{
    "author": [
        "Damini Nath"
    ], 
    "text": "However, experts clarified that this spike could not be linked to implementation of the odd-even car policy.\n\nMAMMOTH TASK:An elephant on a Delhi road on Monday, the fourth day of the odd-even traffic rule implemented by the government to fight pollution.— Photo: V. Sudershan\n\nDelhiites breathed in “severe” levels of pollution on Monday, the first full working day since the Delhi government’s car-rationing experiment started on January 1.\n\nIn fact, the level of the harmful PM2.5 (particles below or 2.5 microns in size) spiked by about 18 per cent over the course of the day. According to the System of Air Quality and Weather Forecasting and Research (SAFAR) index of the Union Earth Science Ministry, the average PM2.5 level from eight monitoring stations rose from 226 at 8 a.m. to 266 micrograms per cubic metre at 7 p.m. This meant that the air quality index (AQI) was over 400, putting pollution in the “severe” category.\n\n“The increase in PM2.5 levels is associated with prevailing weather conditions,” said SAFAR project director Gufran Beig, referring to the relatively calm winds and high moisture levels seen on Monday.\n\nAccording to a Meteorological Department official, the minimum temperature remained at 8 degrees Celsius, the same as Sunday.\n\nThe maximum rose from 22.8 degrees Celsius on Sunday to 23.2 degrees on Monday, four degrees above normal for this time of year. Since the wind speed fell to “calm” levels on Monday, pollutants did not get swept away as they did on Sunday, when westerly winds were observed. The moisture levels also remained high, between 97 to 53 per cent,\n\nAnumita Roychowdhury, the head of the Centre for Science and Environment’s clean air campaign, said climatic conditions would only lead to higher pollution levels over the coming weeks.\n\n“As the weather gets colder in January, pollution levels increase. We have to take that into account when we assess the impact of the odd-even policy,” said Ms. Roychowdhury.\n\nCiting the Delhi government’s data for Day One of the odd-even experiment, she added that the dip in PM levels, that happens every day from early morning to afternoon, was more pronounced compared to previous days, pointing towards the effect of the policy.\n\nMeanwhile, air quality is expected to remain bad on Tuesday, with SAFAR forecasting an average PM2.5 level of 235 micrograms per cubic metre, which is almost four times the standard of 60.", 
    "section": "national", 
    "title": "‘Calm’ winds spike pollution levels in Delhi", 
    "subsection": "general", 
    "date": "2016-01-05"
}