{
    "author": [
        "P V"
    ], 
    "text": "Coracle operators continue to differ with the district administration over the multi-tier safety overhaul in Hogenakkal here. The administration permits only a single-route coracle operation from Maamarathukadavu coracle jetty.\n\nCurrently, coracles are being launched only from Maamarathukadavu jetty, when the water level is below 9,000 cusecs. Once the level crosses the threshold in Maamarathukadavu, the operations will have to be shutdown. Coracles were traditionally operated from three different routes. Depending on the water flow, the operations were moved as and when the water level shifted.\n\nSince June, the level has risen to 25,000 cusecs, when coracle operations were traditionally shifted to Uthamalai Parisal Thurai, says Kempuraj, president, Hogenakkal coracle riders association.\n\nSimilarly, when the level crosses 25,000 cusecs, coracles would be launched fromKothikal Parisal Thurai. “When the level reaches 60,000 cusecs or 1 lakh cusecs, it is still safe to operate from Kothikal Parisal Thurai, where it has still waters, posing no threat to safety. Tourists are shown the Karnataka pass from this point,” says Mr.Kempuraj.\n\nWhen contacted, Collector K. Vivekanandan said the demand was premature, since the current water level is barely 5,000 cusecs. The need will arise only after June, when the level rises, says Mr.Vivekanandan. “We will take a call after May. Tourists will have to walk a short strip inside the forest and we need adequate personnel to monitor safety. The route was videographed by us and it was decided that the other two points can’t be opened up for coracle operations without safety personnel to monitor safety,’ says Mr.Vivekanandan.\n\nThe demand to increase the operation timing from 8 a.m. to 5 p.m., against the current timing of 10 a.m to 5 p.m, is also being seen as logistical overload for skeleton staff monitoring safety aspects. “First, we need to be assured of their dependability, to consider any relaxation.”", 
    "section": "national", 
    "title": "Coracle operators want multiple routes opened", 
    "subsection": "general", 
    "date": "2016-01-05"
}