{
    "author": [
        "Joshua Barone"
    ], 
    "text": "Laurie Anderson is hosting a concert for canine pets on the occasion of the three-minute screening of her film in New York\n\nA pair of dogs and their owner rest on the steps of the Sydney Opera house during a ‘Music for Dogs’ concert in Sydney in 2010.— Photo: AFP\n\nEight years ago, Laurie Anderson recalled in an interview, she was backstage with cellist Yo-Yo Ma at a Rhode Island School of Design graduation ceremony when she turned to him and said, “I have this fantasy where I look out, and the whole audience is dogs.” He replied: “Are you kidding? I have the same fantasy.”\n\nMs. Anderson, a performance artist known for incorporating new technology into her work, got her wish two years later. She and friends put on a concert for hundreds of dogs outside the Sydney Opera House, with the music emitted from speakers at a low, dog-friendly frequency. At the end, they began to bark — even the droolers in the front row. “It was a beautiful sound,” she said. “They barked for five minutes. That was one of the happiest moments of my life.”\n\nNow, Ms. Anderson will be hosting a concert for dogs at Duffy Square in New York on Monday night.\n\nThe occasion is the January edition of Midnight Moment, a series in which many Times Square billboards become a digital art gallery, if only for three minutes.\n\nThe series, presented by Times Square Arts and the Times Square Advertising Coalition, has in the past included works by Andy Warhol, Bjork and Yoko Ono. Anderson’s contribution is a three-minute cut of her documentary Heart of a Dog — a poetic visual essay about, among other things, the journey from life to the afterlife.\n\n“Heart of a Dog,” which has been shortlisted for an Academy Award nomination, is about 75 minutes long.\n\nThe Midnight Moment’s three-minute edit, Anderson said, homes in on the bardo, the journey into the afterlife as depicted in The Tibetan Book of the Dead . The bardo, Ms. Anderson said, is the heart of the film, and it lent itself well to the time constraints of the Midnight Moment.\n\n“The images from the bardo don’t have to follow a narrative,” she said. “I wanted something that would work in a dreamlike way.” — New York Times News Service", 
    "section": "national", 
    "title": "Dogs’ day out", 
    "subsection": "general", 
    "date": "2016-01-05"
}