{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Self-promoting men ran cricket bodies like fiefdoms, Lodha Committee report says\n\nAmong the pages of the Supreme Court-appointed Justice (retired) R.M. Lodha Committee’s report is an impassioned narrative of how cricket administration lost its lustre at the hands of self-promoting men who ran State cricket bodies and the BCCI like “fiefdoms.”\n\nSquarely blaming “high functionaries” of both Central and State governments for the downfall of cricket administration across the country, the Lodha Committee report recommends that ministers and government servants should be banned from holding posts in cricketing bodies, especially the BCCI.\n\nThe report filed in the Supreme Court gains significance as dark clouds continue to gather over the alleged DDCA ‘scam’ and the alleged involvement of Union Finance Minister Arun Jaitley.\n\n“It became clear that many ills had become endemic due to the apathy or involvement of those who were at the helm of the board’s administration; that many of these were high functionaries in the Central and State governments further compounded the problem, as did the fact that several incumbents had remained in charge of State associations for several decades,” the report said.\n\nIt said the poison of corruption started seeping up from the State associations.\n\nNo transparency\n\nMany officials of the various State associations “hold power without adhering to the basic principles of accountability and transparency by converting them into regional fiefdoms.”\n\nThe report said mismanagement had become the norm not just in cricket but also other sports bodies much to the chagrin of the public and players.\n\nThe committee said the report was dedicated to the “trusting soul” of the cricket lover who stood in snaking queues outside crumbling stadia for his ticket, whose faith in the game was pure and who suffered the ignominies of watching cricket in stands where basic amenities like drinking water were scarce.\n\nThe committee, which started work in January 2015, said its investigation and numerous interviews with cricket professionals, administrators and a myriad number of people associated with the sport all over the country revolved around two questions: “Whether this will benefit the game of cricket?” and “What does the Indian cricket fan want?”\n\nAt the end, Justice Lodha, along with Justices Ashok Bhan and R.V. Raveendran, concluded that “an individual-centric constitution and old power centres that have remained relatively unaltered for years” left the reins of cricket’s richest and arguably most powerful national body mired in controversy.\n\n“The BCCI seems to have strayed from its chosen path ... cricket stands without a custodian for its protection and propagation in its most passionately followed nation,” the report concluded.\n\n‘Mismanagement has become the norm not just in cricket but also in other sports bodies’", 
    "section": "national", 
    "title": "Don’t allow netas into BCCI: panel", 
    "subsection": "general", 
    "date": "2016-01-05"
}