{
    "author": [
        "K V Aditya Bharadwaj"
    ], 
    "text": "The most heart-wrenching image, as the city bid farewell to NSG commando Lt. Col. Niranjan on Monday, was of his 18-month-old baby, Vismaya, smiling on her mother’s lap next to the coffin. Niranjan died in a grenade blast in Pathankot on Sunday,\n\nHis wife Radhika, a dentist, was still in shock.\n\nEmotions ran high as his mortal remains in a coffin wrapped in the Tricolour were brought to his house at Doddabommasandra in the morning. The body had been airlifted from Pathankot late on Sunday night and kept at the Air Force Command Hospital. Niranjan’s elder brother Sharath E.K., an Air Force officer, was in charge of the arrangements.\n\nSome of Niranjan’s colleagues recounted his last moments to the family. “Sahib volunteered for the mission out of turn,” one of them said. “It was a team of five. Niranjan sahib was in the front, two others were just behind him and the last two were giving them cover. We were combing the area for explosives. The team came across the body of a terrorist and as it was being checked we heard a huge explosion. It is not clear whether the body was booby-trapped or a terrorist lurking nearby had hurled a grenade. Because of the dust and smoke, precious minutes were lost before sahib could be reached. He, being the first in line, succumbed to his injuries while the two behind him are critical,” the commando said.\n\nFrom his house, the body was taken to the BEL grounds in Doddabommasandra, where people queued up for more than a kilometre to pay their respects.\n\nAncestral home\n\nThe body was later flown to his hometown, Palakkad, in a chartered helicopter. It reached the Government Victoria College grounds at 3.45 p.m. where hundreds of people gathered. It was then taken in an ambulance to his the ancestral house at Elampulassery in Mannarkkad. Around 11 a.m. on Tuesday, the mortal remains will be cremated close to a temple owned by the family.", 
    "section": "national", 
    "title": "Emotional farewell for Niranjan", 
    "subsection": "general", 
    "date": "2016-01-05"
}