{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "India will have its own climate change models to project the impact of global warming over the decades and these will form part of the forthcoming Sixth Intergovernmental Panel on Climate Change Reports that is expected to be available in 2020.\n\nThe IPCC reports — there have been five so far since 1988 — are coordinated by the United Nations and bring together the scientific consensus on the causes and impact of climate change. They also assess the extent to which the globe is expected to warm up over the medium and long term.\n\n“We will be working on our own models and projections and have to make our first submission by 2018,” said Madhavan Rajeevan, Secretary, Ministry of Earth Sciences, at the Indian Science Congress here.\n\nCrucial at Paris summit\n\nThe IPCC’s fifth report in 2014, was critical in shaping the resolution at the recently concluded climate talks in Paris that all countries — developed and developing — had to, over time, do their bit to contain their greenhouse gas emissions to keep ensure that mean global temperatures did not rise beyond 1.5 to 2 degree of temperature in the 19th century.\n\nAs per the Paris Agreement, which will come into effect in 2020, India and several other countries will have report their emissions as well as detailed plans to curb them.\n\nThe climate models, being developed by the Earth Sciences Ministry, will be prepared by the Pune-based Centre for Climate Change Research.\n\nThese are so-called dynamic models that rely on super-computers to compute the weather on a given day and simulate how it would evolve over days, months and even years. These models, developed in the United States, have over few years been customised to Indian conditions. “Their ability to predict the Indian monsoon has consistently improved over the years, “said Mr. Rajeevan, “and now over the next few years they should be able to project climate over the decades.”\n\nThe climate models will be prepared by the Pune-based Centre for Climate Change Research", 
    "section": "national", 
    "title": "Indian climate models to aid future IPCC reports", 
    "subsection": "general", 
    "date": "2016-01-05"
}