{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "‘ISIS’, ‘IS’, ‘Syria’ and ‘Jihad’ are currently the top keywords Mumbai Police are keeping tabs on. Police officials trawling Facebook and Twitter say the number of people searching for these keywords is “considerably high”.\n\nThe Mumbai Police’s Social Media Lab was inaugurated in 2013 to keep tabs on social media and get a better sense of the public mood, to prevent potential law and order problems.\n\nWith the rise of the Islamic State (IS) and its significant presence on the Internet, the police are now making use of specially developed tools to flag relevant keywords.\n\n“We earlier had tools set to identify keywords pertaining to historic, religious and political figures, as there was a huge controversy in 2014 about objectionable content regarding such figures. Over the last few months, we have redefined our parameters and currently, the IS and related words are a priority,” said a senior Mumbai Police officer.\n\nThe officer said that a majority of the people still search for ‘ISIS” even though the terrorist outfit now calls itself IS, and hence ‘ISIS’ is also among the list of constant keywords, along with ‘Syria’ and ‘Jihad’.\n\nApart from these fixed keywords, the police also keep adding and removing keywords depending on events in the country and around the world. “Currently, in light of the Pathankot terror strikes, we have added ‘Jaish-e-Mohammed’ to our list of keywords,” said a source.\n\nOther than watching the social media space for who is searching for the IS, the police are also quick to block posts that are potentially inflammatory. Almost every day, the Cyber Cell of the Mumbai Police receives reports about posts containing the keywords that are flagged by its tools.\n\nThe data is then analysed, and accounts that are found to be searching for flagged keywords a large number of times are viewed and the content shared by them studied. Posts about the IS or any content that is communally sensitive are then identified, after which a report on these posts is sent to Facebook authorities, requesting that they be blocked.\n\nAn IPS officer, while refusing to share specifics, said: “ISIS and related keywords are among the most searched in Mumbai. What is also worrying is that a majority of the posts that we block on Facebook are communally inflammatory in nature.”\n\nThe IS is a matter of particular concern when it comes to watching cyberspace, as it has a huge presence online, including videos on YouTube, Twitter accounts and Facebook accounts.\n\nKalyan native Areeb Majeed, who fled the country to join the IS in 2014 and was subsequently brought back to India, is reported to have been radicalised online, while Malwani youth Ayaz Sultan, who is suspected to have joined the IS, was active on the Internet.\n\nIt has a huge presence online, says Social Media Lab of Mumbai Police", 
    "section": "national", 
    "title": "‘IS among key words on Net search’", 
    "subsection": "general", 
    "date": "2016-01-05"
}