{
    "author": [], 
    "text": "Princeton mathematician Manjul Bhargava got a little more publicity than he bargained for. At a special lecture in the Science Congress, Mr.Bhargava’s hour-long talk on the genius and contribution of Indian mathematician Srinivasa Ramanujan so charged the audience of students that several of them mobbed him for an autograph.\n\nThe mathematician had to be spirited away by the organisers to a separate room, where he stayed put for a good 20 minutes. He finally got away— amidst teeming students — only after the organisers promised a special interaction on Tuesday on the sidelines of the Children’s Science Congress, a sister function being organised alongside the Indian Science Congress.\n\n“He was upset,” said N Ramachandra, among the organisers of the congress. “He was ready to meet students in groups of 5-10 but tomorrow [Tuesday], he will be available at the Children’s Congress.” However, when Mr. Bhargava made it to his car, he didn’t appear to be grim and even signed autographs for a few students.\n\nMr.Bhargava’s evening lecture delved into the greatness of Ramanujan’s contribution to mathematics and he signed off his talk with a movie trailer on the forthcoming movie, The Man Who Knew Infinity , starring Dev Patel and directed by Mathew Brown. Mr.Bhargava is an associate producer of the movie and said he was there to ensure that the “mathematics and historical treatment were accurate”. “The movie has been shown at some film festivals, including at Goa, but awaits a wider commercial release. Mr. Bhargava, 41, is the winner of mathematics’ most prestigious prize the Fields Medal.\n\nMr.Bhargava, who said he was on a mission to make Ramanujan’s work better known, said some of the mathematician’s works inspired his own doctoral dissertation.", 
    "section": "national", 
    "title": "Mathematician Manjul mobbed", 
    "subsection": "general", 
    "date": "2016-01-05"
}