{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Issue will be debated around facts, says Arundhati Vashishtha Anusandhan Peeth\n\nOn January 9, the Arts Faculty of Delhi University will hear professors, lawyers and sadhus make a renewed pitch to mobilise public opinion for the Ram Janmabhoomi temple. While the choice of the venue, a Centrally-funded academic university, has caused concern among the academic fraternity, the organisers of the two-day seminar, the Arundhati Vashishtha Anusandhan Peeth, founded by the late Vishwa Hindu Parishad leader, Ashok Singhal, say the issue will be debated around facts.\n\nThe facts, the organisers point out, are as follows: The Allahabad HC verdict in 2010 had acknowledged the site as the birthplace of Ram and had divided the disputed site among three parties; nothing has moved forward.\n\nThe Supreme Court order had stayed the High Court verdict in 2011.\n\nThe convention hall for the seminar has been booked in the name of chief librarian Dr. K.P. Singh, who is also a member of the Academic Council of the Delhi University, as rules of the University do not allow organisations from outside to book convention halls, the estate department said . The invitation has a photograph of the late Ashok Singhal, founder of the Peeth, whose president is BJP leader Dr Subramanian Swamy.\n\n‘Not an emotional pitch’\n\nThis is not an emotional pitch but one based on facts, clarified Sanjay Kumar of the Peeth, who teaches in Satyawati College. The invitation, which is posted on the website of the organisation, however, makes an emotional appeal for the temple when it exhorts, “For a great majority of Indians, Ram is central to not only their spiritual life but also their physical being; and, therefore, construction of Ram Temple at the Rama Janma Bhoomi Ayodhya is something that represents the sincere interest of this great Indian majority. It is a public interest which is akin to the national interest of the Indian Republic the fulfilment of which is an essential obligation of the state.” The seminar will have more than 12 sessions on issues ranging from “Universalism, fraternity and inclusivism in the character of Ram” to linking the temple to national pride.\n\nThe move to host the seminar has led to disquiet on the campus, with many academics concerned about the university being misused for propaganda. Denying this, Mr. Kumar said this would be an academic seminar. “It is only academic institutions which can generate a debate. What’s wrong with that?” he asked.\n\nActing Vice-Chancellor Sudheesh Pachauri denied knowledge of the seminar, though he added it was a matter of concern. “I would not know what each department of the university organises,” Mr. Pachauri said.\n\nMr. Singhal, co-founder of the Peeth, who died last year, championed the movement to build a temple at the disputed site with his divisive brand of politics till the end. Delhi University has in the recent days, opened its premises to host RSS functions.", 
    "section": "national", 
    "title": "Move to host event in DU raises eyebrows", 
    "subsection": "general", 
    "date": "2016-01-05"
}