{
    "author": [
        "Yuthika Bhargava"
    ], 
    "text": "The National Association of Software and Services Companies (Nasscom) said on Monday that all data tariff plans should ensure unfettered right of choice for the consumer and telecom carriers or their partners should not have a say in what content can be offered at “favourable rate.”\n\nThe IT industry body, however, said the regulator should have powers to approve differential pricing for data services considered to be in public interest, even as it reiterated its opposition for platforms such as Airtel Zero and Free Basics, saying these violate the principles of net neutrality. Nasscom President R. Chandrashekhar said: “We strongly oppose any model where telecom services providers [TSPs] or their partners have a say or discretion in choosing content that is made available at favourable rates, speed etc.”\n\n“Any such differential pricing by TSPs violate criteria of net neutrality that we have outlined,” he added.\n\nTrai has issued a consultation paper on the subject for which the last date for submitting comments is January 7. The consultation paper on differential pricing of data services raises issues related to zero-rating tariff models – a practice wherein service providers offer free data to users for select applications and websites.\n\nMr. Chandrashekhar said that the regulator should have the power to allow differential pricing for certain types/ classes of services that are deemed to be in public interest and based on mandatory prior approvals.\n\n“Any differential pricing programs including proposals by TSPs and their partners should have explicit directives/approval of the regulator and deemed to be in public interest…Such proposals should be subject to a wider public consultation by the regulator before arriving at a final decision,” the industry body said.", 
    "section": "national", 
    "title": "Nasscom opposes differential pricing for data services", 
    "subsection": "general", 
    "date": "2016-01-05"
}