{
    "author": [], 
    "text": "If reducing stress is on your mind, turning off your phone’s e-mail app can be an easy and inexpensive way to bring happiness back into your life, new research suggests.\n\nE-mail can simultaneously be a great communication tool and a source of frustration and stress, the findings showed.\n\nIn a survey of around 2,000 people, London-based Future Work Centre found that people who automatically receive e-mail on their devices are more likely to report higher levels of stress.\n\nThe study also pointed out that checking e-mail earlier in the morning or later at night is associated with higher levels of pressure.\n\n“People who reported higher levels of pressure also experienced greater interference between work and home ,” the report said.\n\nHowever, how much stress you feel and the extent to which it interferes with your work-life balance may depend on your personality.\n\n“Our research shows that e-mail is a double-edged sword. While it can be a valuable communication tool, it is clear that it is a source of stress of frustration for many of us,” lead author Richard MacKinnon, insight director, Future Work Centre, was quoted as saying by Daily Mail.\n\n“The people who reported it being most useful to them also reported the highest levels of email pressure,” MacKinnon noted.\n\nManagers experience significantly higher levels of stress when compared to non-managers, the results of the survey showed.\n\n“The habits we develop, the emotional reactions we have to messages and the unwritten organisational etiquette around e-mail, combine into a toxic source of stress which could be negatively impacting our productivity and wellbeing,” MacKinnon said. — IANS\n\nE-mail is a great communication tool but also a source of stress, says new research", 
    "section": "national", 
    "title": "‘No email app on phone can make you happier’", 
    "subsection": "general", 
    "date": "2016-01-05"
}