{
    "author": [
        "Laiqh A"
    ], 
    "text": "‘In order to invent in India, you should have discoveries in India’\n\nNobel laureates attending the 103{+r}{+d}Indian Science Congress urged India to give primacy to invention and discovery over manufacturing, suggesting modifications to modify Prime Minister Narendra Modi’s ‘Make in India’ slogan.\n\nParticipating in an interaction with the media here on Monday, the Nobel laureates made out a strong case for more investment in research and development (R&D), while encouraging more youth to pursue pure science.\n\nParticle physicist David J. Gross suggested that the Prime Minister’s ‘Make in India’ slogan be replaced with ‘Discover, Invent and Make in India’. Before ‘Making in India’, Prof. Gross said, there was a need to invent in India. “In order to invent in India, you should have discoveries in India,” he said, adding that the country should focus on “new inventions, new technologies and new products that can compete on the world stage.”\n\nWinner of the Nobel in Chemistry in 2011 Dan Schechtman continued with Prof. Gross’ line of argument and stressed on innovation in India. This should be supported by entrepreneurs and start-ups, which can make products out of innovations taking place at universities and research centres, he said.\n\nProf .Gross said investment in R&D was crucial for a country to develop. Though India’s economy and GDP had doubled in the last 10 years, the government’s financial allocation for R&D has more or less stagnated.\n\nDespite the promises by successive Prime Ministers to increase the funding for R&D during every Indian Science Congress since the last 15 years, the growth has just been a “flat curve”, Prof. Gross said. In contrast, he said South Korea, China and the U.S., besides countries in Europe, were allocating more funds for R&D.\n\nMeanwhile, Prof. Schechtman said India also needs more human resources in science and engineering. If more youth are to be encouraged to take up studies in science, he urged the subject should be introduced to students at a very young age.\n\nDespite the promises by successive Prime Ministers to increase funding for R&D during every ISC over the past 15 years, the growth has just been a flat curve. — Noble laureate David J. Gross", 
    "section": "national", 
    "title": "Nobel laureates ‘re-make’ Modi’s slogan", 
    "subsection": "general", 
    "date": "2016-01-05"
}