{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "In the first clear indication that New Delhi and Islamabad are in contact over the Pathankot attacks, the Pakistan Foreign Ministry said it was “working on the leads” provided by the Indian government, and called for a commitment to a “sustained dialogue” process.\n\n“In line with Pakistan’s commitment to effectively counter and eradicate terrorism, the government is in touch with the Indian government and is working on the leads provided by it,” a statement issued by the Foreign Affairs Ministry in Islamabad said.\n\nHowever, officials in Delhi would not confirm whether any leads had been shared from the ongoing situation at the Pathankot Air Force base, where a sixth terrorist was killed on Monday evening, and whether either External Affairs Ministry officials or the National Security Advisers had been in touch.\n\nThe statement from Pakistan comes even as officials in Delhi said the government was “mulling” its options over whether to go ahead with Foreign Secretary-level talks next week. According to sources, those options include postponing or cancelling the talks scheduled for January 15 or holding NSA talks on the terror issue prior to the Foreign Secretaries’ meeting.\n\nMaking a pitch for the talks to continue, the Pakistan government called for cooperation on fighting terrorism, adding, “Living in the same region and with a common history, the two countries should remain committed to a sustained dialogue process. The challenge of terrorism calls for strengthening our resolve to a cooperative approach.”\n\nMinistry officials declined to comment on whether the statement from Pakistan was a positive step. Earlier, officials had told The Hindu that Pakistan’s reaction would be closely watched, adding that a “bland denial” of any connection to the attack as in the past would evoke a strong reaction from India.\n\nWhile the government has not directly named any group for the attack that saw seven Indian soldiers lose their lives, officials say the Jaish-e-Mohammad is believed to be the main suspect and calls made by the terrorists that were intercepted had been made to Bahawalpur in Pakistan’s Punjab.\n\nJeM leader Masood Azhar was facing terror charges in India when he was released in 1999 in exchange for passengers taken hostage on IC-814. Since then he has lived in Pakistan without any restrictions. After Pakistan’s latest statement, where it condemned the Pathankot attack and expressed condolences for the death of soldiers, one Indian official told The Hindu , “These are still words. Let us see some action,” indicating that India awaits a crackdown by Pakistani authorities on the group responsible for the attack.", 
    "section": "national", 
    "title": "Pak. in touch with India, pursuing ‘leads’", 
    "subsection": "general", 
    "date": "2016-01-05"
}