{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court-appointed Justice R.M. Lodha Committee wants to give cricketers, especially women, an independent voice.\n\nIn its 159-page report presented on Monday, the Committee recommended an overhaul in the BCCI structure. It also urged a change in the attitude towards players. The report said players, who were the driving force of the game, had been reduced to the status of employees and subordinates of those governing the game.\n\n“In the affairs of the sport that they are the drivers of, they have no voice and no independence. Players who are the sport’s biggest draw are not spared from the apathy of the BCCI. They are treated less like assets and more as the employees and subordinates of those governing the game,” the report read.\n\nThe disdain for players was also evident in how no attempt was made to protect the sport and its players from the orgy of excess that quickly began to envelop the Indian Premier League which thrust the sport into shame and mired the BCCI into controversy.\n\nThe committee lauded national players who continue to play for India colours despite the remuneration they earn being half of that earned by IPL players with “modest credentials” but richly paid by their franchisees.\n\nNoting that the Indian cricket calendar had changed to accommodate more of this IPL “extravaganza,” the Committee suggested more days of rest for Indian national players rather than thrust them into IPL contracts and parties.\n\n“A testing and cramped cricketing year takes a substantial toll on a professional cricketer’s body and longevity,” the Committee pointed out.\n\nBut the “most unfortunate fact” the Committee found was how the Indian women’s cricket team had last played a Test match eight years ago.\n\n“Coupled with general chauvinism, the women players receive paltry earnings and have only a one month-long domestic season. The Women’s Cricket Committee is to be therefore formed to exclusively pay attention to this much ignored department in addition to the Women’s Selection Committee” it said.", 
    "section": "national", 
    "title": "‘Players reduced to employees’", 
    "subsection": "general", 
    "date": "2016-01-05"
}