{
    "author": [
        "Radhakrishnan Kuttoor"
    ], 
    "text": "HC tells officials to save the area’s wildlife and protect the reserve forests from degradation\n\nPlastic waste in the reserve forests is posing a serious threat to wildlife as well as the environment.\n\nThanks to the emphatic intervention by the Kerala High Court, PET (Polyethylene terephthalate) bottles and other plastic wastes will be effectively banned in Sabarimala, situated in the Periyar Tiger Reserve, from February 1.\n\nIn November 2010, the Kerala State Pollution Control Board (PCB) imposed a blanket ban on the sale and use of plastic carry bags and the dumping of plastic bottles, including PET bottles, sachets and pouches in and around the Sanidhanam, Pampa, Chalakkayam, Nilackal and Erumely.\n\nThough the Travancore Devaswom Board, the police and local self-government institutions were bound to implement the PCB ban, it was not done.\n\nThis has been leading to the accumulation and littering of plastic waste in the reserve forests, posing a serious threat to the wildlife as well as the environment.\n\nTaking serious note of the failure, which amounted to a criminal offence, a High Court Division Bench comprising Justices Thottathil B. Radhakrishnan and Anu Sivaraman recently directed Special Commissioner K. Babu to ensure the execution of the PCB order from February 1 to save the area’s wildlife and protect the reserve forests from further degradation.\n\nThe court has also directed the Environmental Engineer of the TDB to ensure that waste management is done effectively, with guidance from the KSPCB authorities.\n\nThe court also asked the Special Commissioner to ensure that the waste that has accumulated at Sabarimala and its base camps during the ongoing pilgrim season is cleared, to facilitate a total ban on plastic wastes in letter and in spirit from February 1.\n\n’Serious challenges’\n\nThe Deputy Director of the Periyar West Division had informed the High Court on the “serious challenges posed to the forest environs and the animal wealth” by the indiscriminate dumping of plastic bottles in Sabarimala forests.\n\nThe viscera examination of dead elephants in the area had shown the presence of plastic, including bottles, they had eaten.\n\nA report by the Deputy Director pointed out that the TDB had given an undertaking to the Supreme Court as far back as in 2005 promising to take care of waste management in Sabarimala. But 10 years since, this assurance remained on paper.\n\nThe recent death of a sambhar deer pointed to the plight of wild animals in the Poomkavanam, which die after eating plastic wastes.\n\nIn the first week of November 2015, a wild elephant died at Pampa after it ate plastics.\n\nIt said the range forest officer, Pampa, had found the carcass of a sambhar deer in a waterhole on the Sannidhanam-Saramkuthy trekking route on December 28, 2015. The post-mortem revealed that it had died after ingesting a huge quantity of plastic wastes (4.7 kg).\n\nIt was quite certain that the animal consumed the plastic waste in Poomkavakam, the report said.", 
    "section": "national", 
    "title": "Sabarimala to be plastic-free from February", 
    "subsection": "general", 
    "date": "2016-01-05"
}