{
    "author": [
        "T Nandakumar"
    ], 
    "text": "Fishermen’s livelihood also at stake\n\nSnowflake coral is known to inhabit reefs and underwater structures, such as shipwrecks and piers, attaching itself to metal, concrete and even plastic.\n\nColonies of snowflake coral ( Carijoa riisei ), an invasive species recently documented off the coast of Thiruvananthapuram and Kanyakumari, could pose a serious threat to the marine ecology of the region, according to scientists.\n\nScuba divers working for Friends of Marine Life (FML), a local NGO, have recorded the presence of several colonies of the fast-growing alien species amid barnacle clusters on the rocky reef off the coast of Kovalam in Thiruvananthapuram and Enayam, Kanyakumari.\n\nThe documentation was done as part of a research project harnessing the traditional knowledge of the fishermen community to assess the marine biodiversity of the region.\n\nThe snowflake coral is known to inhabit reefs and underwater structures such as shipwrecks and piers, attaching itself to metal, concrete and even plastic. It is considered an invasive species because of its capacity to dominate space and crowd out other marine organisms.\n\nResearcher Robert Panipilla, who coordinated the project, said the colonies of the soft coral were documented at 10 metre depth off Kovalam and 18 metre depth off Enayam.\n\n“Last month, we deployed scuba divers after receiving information from local fishermen that the species had colonised parts of the reef,” he said. A native of the tropical Western Atlantic and the Caribbean, C.riisei was first reported as an invasive species from Hawaii in 1972. Since then, it has spread to Australia, Thailand, Indonesia and the Philippines.\n\nIn India, it has been reported from the Gulf of Mannar, the Andaman and Nicobar Islands, Gulf of Kutch and Goa.\n\nWith its capacity to thickly settle and occupy a variety of surfaces, C.riisei can destabilise the marine ecosystem, says K. Padmakumar, Pro Vice Chancellor, Kerala University of Fisheries and Ocean Studies (KUFOS).\n\nHe fears it will crowd out other species like corals, sponges, algae, ascidians that contribute to the rich marine biodiversity of the region.", 
    "section": "national", 
    "title": "Snowflake coral, a serious threat to biodiversity", 
    "subsection": "general", 
    "date": "2016-01-05"
}