{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court-appointed Lodha committee in its report submitted on Monday said betting in cricket should be legalised but players, team and match officials and cricket administrators should not be allowed to indulge in it. As a rider, betting should be restricted through licensed betting houses. Again, players and others banned should disclose their assets to the BCCI in a measure to ensure that they do not bet.\n\nThe report suggested sweeping changes in the BCCI super-structure.\n\nIt recommended that a nine-member apex council replace the present 14-member BCCI working committee, which, it said, lacked “managerial expertise to run a billion dollar entity.”\n\nFive of the nine office-bearers, namely BCCI president, vice-president, secretary, joint secretary and treasurer, should not be either government servant or minister. The office-bearers should not have crossed 70 years of age, should be an Indian and not an insolvent.\n\nAsked why the committee did not exclude the political class as a whole from cricket administration, Justice Lodha told the media that the political class involved people from all walks of life and “we cannot brush the entire citizenry with one brush. Government servants and ministers are any way prevented by the office of profit clause.”\n\nEach of these office-bearers has a three-year term and can contest for a maximum three terms. There will be a mandatory cooling-off period after each term. No office-bearer can hold office consecutively in a row.\n\n“Again, if a person was president, after the cooling-off period, he can only contest as president and not any of the other four posts. That is, one person one post,” Justice Lodha explained.\n\nIn case of the BCCI president, no person can hold the office for more than two terms.", 
    "section": "national", 
    "title": "Sweeping changes recommended in BCCI", 
    "subsection": "general", 
    "date": "2016-01-05"
}