{
    "author": [], 
    "text": "A dealer cuts tuna in Tsukiji fish market in Tokyo. As part of an annual tradition, a huge tuna will be auctioned on Tuesday at the market, which is to be relocated this year.— Photo: AP\n\nIt’s among the biggest of Japan’s many New Year holiday rituals. Early on Tuesday, a huge, glistening tuna will be auctioned at Tokyo’s 80-year-old Tsukiji market. Next year, if all goes as planned, the tradition won’t be the same.\n\nThe world’s biggest and most famous fish and seafood market is due to move in November to a huge complex further south in Tokyo Bay, making way for redevelopment of the prime slice of downtown real estate.\n\nThe closure of the Tsukiji market will punctuate the end of the post-war era for many of the mom-and-pop shops just outside the main market that peddle a cornucopia of sea products, from dried squid and seaweed to whale bacon and caviar.\n\nThe new year auction is typical of Japan’s penchant for fresh starts at the beginning of the year and it’s meant to set an auspicious precedent for the next 12 months .\n\nSushi restaurateur Kiyoshi Kimura has prevailed in most of the recent new year auctions. In 2013, a bidding war drove his record winning bid to 154.4 million yen (at today’s exchange rates about $1.3 million) for a 222 kilogram fish.\n\nThat drew complaints that prices had soared way out of line, and the winning price in 2014 was dramatically lower. Last year, a 180.4-kilogramme (380 pound) tuna caught off Japan’s northern region of Aomori fetched a winning bid of 4.51 million yen ($37,480).\n\nJapanese eat about 80 percent of all bluefin tuna caught worldwide, and stocks of all three bluefin species-- the Pacific, Southern and Atlantic-- have fallen over the past 15 years amid overfishing.\n\nBut while the new year and daily tuna auctions are Tsukiji’s best known events, the market is much more than tuna. Already, some shops outside the market have been razed and a new building that will house a smaller “outer market” is under construction.\n\nShopping plaza to come up\n\nConceptual drawings from the Tokyo city government show the 23-hectare (nearly 57-acre) market site that fronts the Sumida River’s outlet into Tokyo Bay being transformed into an open waterfront park surrounded by greenery, with a wide shopping plaza and a passenger terminal for tourist ferries traversing the bay and river.\n\n“We are contributing with all our efforts to the revitalization of our historic Tsukiji,” said a banner emblazoned with the logos of the architect and other contractors hanging from a scaffolding of the new building.\n\nTsukiji’s predawn auctions are a fixture on the tourist circuit, and since it was not set up to accommodate large crowds the management has gradually limited access for safety’s sake.\n\nPlanning for the move began nearly 20 years ago. But the shift was delayed for years due to toxins found in the soil at the new location, the former site of a coal gasification plant run by Tokyo Gas. — AP", 
    "section": "national", 
    "title": "Tokyo’s 80-year-old fish market to hold final auction before move", 
    "subsection": "general", 
    "date": "2016-01-05"
}