{
    "author": [
        "Jayant Sriram"
    ], 
    "text": "In Nov. 2012, Mumbai man Hamid Ansari crossed over from Kabul to Kohat to find his girlfriend\n\nHamid Ansari was a good student. His college marks were good enough to get him into a medical school, but he was squeamish about cutting bodies open and blood in general, so he opted for an engineering degree. Then, like many other ambitious young Indians, he did an MBA. His qualifications notwithstanding, he wasn’t able to get a job he wanted.\n\nIn late 2012, he told his parents that there was an opening in the Kabul airport and that he had a good chance of landing the job.“I immediately objected,” his mother Fauzia Ansari says. “I told him that people go to places like the U.S. or the U.K. for jobs and not to Kabul. But he said that if he worked there for a few months, he could get experience and come back and get a job of his choice.”\n\nOn November 4, when Hamid set off for Kabul, he told his parents he would be back by the 12th or latest by the 15th of that month. He kept in touch with his family. “For about a week we were talking every day,” Ms Ansari says. “If we didn’t speak before I went to bed, I felt uneasy. After November 10, the connection was lost. He didn’t call and we were unable to get in touch.”\n\nWorried, the family waited. The 12th passed. And then the 15th. Still no word from their son. They went to the Afghanistan embassy to make an enquiry. They were told that phone lines were down because of weather conditions and to just be patient.\n\nAt this point, Hamid’s older brother suggested they should check Hamid’s email and Facebook account. They didn’t have to hack into his email: the family members all know each other’s passwords. And Hamid had left his Facebook account logged in.\n\nFrom there, Ms Ansari, a college lecturer, pieced together what happened. “I came to the conclusion that there was a tribal girl from the Kohat area in Pakistan that Hamid had been friends with.\n\nShe was the victim of a social evil where, if there was a rivalry between two families, the tribe’s leader takes a decision and the other family’s daughter is given to the affected family. That is what had happened with this girl and she was going to be married off to an elderly person.”\n\nJatin Desai, general secretary for the Pakistan India Peoples’ Forum for Peace and Democracy, who Hamid had got in touch with, is more direct.\n\nHe told The Hindu , in a separate conversation, that Hamid had fallen in love with a young woman from the rough frontier area of Pakistan, and had decided to rescue her and bring her back to Mumbai.\n\nHamid, it appears, had discussed the situation with his friends from Pakistan. Ms Ansari says he repeatedly stated in the conversations that they needed to do something to save her.\n\nThe friends, apparently, said they could not intervene, but urged Hamid to cross over from Kabul, saying that the border there was porous, unlike on the India side.\n\n“When I first came to know that he had gone to Pakistan,” Ms Ansari says, “I went to the Versova police station to file a complaint. I also approached a lawyer, Majeed Memon, who agreed to help us. Notices were sent to the External Affairs Ministry and the Intelligence Bureau. I ran from pillar to post trying to meet the External Affairs Minister.”\n\nMs Ansari was also connected with an investigative journalist from Lahore, Zeenat Shehzadi. Over several visits to Kohat, Ms Shehzadi managed to piece together a timeline of what transpired.\n\nThe sub-inspector at the Kohat police station, Faizullah Khan, told Ms Shehzadi that Hamid had been arrested from a hotel. In 2013, Ms Shehzadi, who had been given a power of attorney by Hamid’s family, filed a petition in the Peshawar High Court on their behalf.\n\nIn a statement under oath in court, in September 2014, the sub-inspector said Hamid was arrested after information was provided by the Intelligence Bureau.\n\nHe claimed that Hamid was interrogated and later taken away by personnel from the ISI and MI.\n\nThe High Court continued to seek replies from the Ministry of Defence and Interiors. Finally, on January 13 this year, Pakistan’s Deputy Attorney-General informed the court that Hamid is in military custody and is being tried.\n\nThe legal battle is not over, given that nobody yet knows under what charges Hamid is being tried. But Ms Ansari is hoping that the struggle will soon be over.\n\n“I got help from a Pakistani journalist and Pakistani lawyers. Now, it is up to our government to resolve the issue,” she says.", 
    "section": "national", 
    "title": "A perilous journey, for his love", 
    "subsection": "general", 
    "date": "2016-01-28"
}