{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Nepal-boundflight was evacuated and searches were conducted\n\nSecurity agencies at Delhi’s Indira Gandhi International Airport (IGIA) were kept on their toes throughout the afternoon and evening on Wednesday due to threat calls about bombs being placed on two Kathmandu-bound flights.\n\nAlready under a heightened alert since the Pathankot terror attack, the Deputy Commissioner of Police (IGIA) received two calls at 1.05 p.m. and 1.10 p.m. about bombs being placed on two flights — Jet Airways (9W 260) and Air India (AI 215). The caller identified himself as Hafiz Azad from Istanbul and said the two bombs were placed inside laptops, sources at the airport said. Security agencies were immediately alerted and emergency measures were put in place. The police again got two more calls around 3.30 p.m., identifying two specific bags that contained bombs, which delayed the flights further.\n\nAt the time the first call was received, passengers of the Jet Airways flight were still at the aerobridge and about to board the flight. The 122 passengers and seven crew members were evacuated and taken back to the departure waiting area.\n\nThe 121 passengers of the Air India flight, however, had boarded the flight and had to be de-boarded, along with the six crew members and brought back to Terminal 3.\n\nBoth the aircraft were taken to isolation bays keeping in mind the security threat where anti-sabotage searches were conducted by security agencies and bomb disposal squad was also brought in.\n\nSources at the airport said the calls were made through Voice Over Internet Protocol (VoIP), making it difficult to trace them.\n\nOn Monday, a similar threat call was received about a bomb being placed inside a Kathmandu-bound Jet Airways flight. Later the call turned out to be a hoax. However, due to the high terror alert, security agencies did not take any chances.\n\nAfter a second round of check, the Jet Airways flight, scheduled for departure at 1.25 p.m., finally left around 8.30 p.m. Air India, however, brought another aircraft and the flight finally left Delhi for Kathmandu at 7.46 p.m.", 
    "section": "national", 
    "title": "Bomb threat calls delay flights", 
    "subsection": "general", 
    "date": "2016-01-28"
}