{
    "author": [], 
    "text": "Oommen Chandy said he had answered all questions posed to him by the commission.\n\nAccording to her, it was on July 9, 2012 that she, along with Mallelil Sreedharan Nair, a businessman, met the Chief Minister in his office at the Secretariat. The meeting was fixed after communicating the details on the phone. At the meeting, the Chief Minister also offered single-window clearance and subsidies. Mr. Nair offered to invest after the Chief Minister’s assurance.\n\nShe said the Chief Minister asked her to meet Abbas, private secretary of Industries Minister P.K. Kunhalikutty. Mr. Abbas promised to identify the holdings, she said.\n\nShe met the Power Minister at his official residence, she said. His personal assistant Keshavan suggested that bribes be paid for taking the projects further. Though he demanded Rs. 2 crore, it was pegged at Rs. 1 crore after negotiations, and Rs. 25 lakh was paid as the first instalment at Manmohan Bungalow, the official residence of the Minister. Though an additional Rs. 15 lakh was paid to the Minister, neither did he render any help nor return the money..\n\nThe panel will continue its examination of Ms. Nair on Thursday.\n\nAt a press conference in Thiruvananthapuram, the Chief Minister said: “Those who believe what Saritha S. Nair said will find themselves in tears later.”\n\nHe said he had answered all the questions posed to him during the 14-hour questioning by the commission. He had highlighted three major issues — whether she had received any favour from the government, whether the government had lost any money and whether there was any lapse in resorting to prosecution of the guilty. Talking about their alleged proximity to him, Mr. Chandy said the scamsters were unable to get his letter pad. They, instead, forged it..\n\nMr. Chandy said his government had appointed the solar commission to bring out the truth. The Opposition, he claimed, had failed to produce even a shred of evidence.\n\n“Let the people evaluate the veracity of the allegations,” he said.", 
    "section": "national", 
    "title": "Chandy took Rs. 1.9 crore in bribe, says scam accused", 
    "subsection": "general", 
    "date": "2016-01-28"
}