{
    "author": [
        "National Bureau"
    ], 
    "text": "Party sees opportunity to rally the Opposition against the BJP in Parliament\n\nThere appeared to be some cheer in the Congress camp after the Supreme Court asked Arunachal Pradesh Governor J.P. Rajkhowa on Wednesday to furnish the reports on the basis of which the Union Cabinet recommended and President Pranab Mukherjee issued the proclamation of President’s rule in the State.\n\nThe party feels that the issue has the potential of bringing together various Opposition parties against the BJP in the coming Parliament session. It has already attracted support from the Janata Dal (U), the Aam Aadmi Party (AAP) and, on Wednesday evening, the Nationalist Congress Party (NCP). “This is no more a local issue but a national issue. If Raj Bhavan works as an office of the BJP, it is very damaging for a democratic country,” said NCP women’s wing president Fauzia Khan.\n\n“The Governor is supposed to act on the advice of the Council of Ministers. But when he acts as an RSS agent, it is very destructive,” she added. The Congress, therefore, took an aggressive stance even as the Supreme Court is yet to pronounce its ruling on the issue.\n\n“The autocratic politics of Prime Minister [Narendra] Modi is now exposed. He is using the Governors to control the States. This is a war on democracy, from the streets to Parliament. The Congress will fight the autocratic behaviour of the Central government,” Congress leader Raj Babbar said in Delhi.\n\nCongress leader V. Narayanaswamy squarely blamed the BJP for the political crisis in Arunachal Pradesh, saying it was done to topple the elected government in the State. “There is a crisis situation created in Arunachal Pradesh. Who created this crisis? Only RSS-backed people are being appointed Governors in the North-east. This shows the sinister designs of the Modi government to topple elected governments,” he said.\n\n“The BJP engineered defection in the Congress and, today, they are telling we don’t have the majority,” he added.\n\nOpposition leaders have rallied together in the recent past over the death of Rohith Vemula, the Dalit research scholar in University of Hyderabad, and now the Arunachal Pradesh situation.\n\n“These two issues have more or less ensured that Parliament will likely not run during the budget session,” said a senior Opposition leader.\n\n“In the last session, the Congress had to cast about for issues other than the National Herald case to justify not allowing Parliament to work. This time it is not so,” said a senior Congress leader.", 
    "section": "national", 
    "title": "Congress gets fresh ammunition", 
    "subsection": "general", 
    "date": "2016-01-28"
}