{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "A day after selecting Ramanjit Sikki as its candidate for the Khadoor Sahib Assembly by-poll in Punjab scheduled for February 13, the Congress on Wednesday announced that it would boycott the by-election.\n\nPunjab Congress president Capt.Amarinder Singh told reporters in Chandigarh that the Congress decided to boycott the by-election as the party had felt that the issue of sacrilege of the Guru Granth Sahib over which Mr.Sikki (former Congress MLA) had resigned, still remained unresolved.\n\nMr.Sikki resigned as MLA from the Khadoor Sahib Assembly seat in November 2015 in protest against a series of sacrilege incidents in Tarn Taran district and other parts of the State.\n\nCapt.Singh said party members felt that the desecration of the Guru Granth Sahib was an issue which far outweighed politics. “And therefore, I recommended to the Congress president that the Congress party should boycott the Khadoor Sahib by-election”, he said, adding that even though party president Sonia Gandhi had cleared the name of Mr.Sikki, she had left it to the PCC president to take the final call.\n\n“Keeping in view the situation that has engulfed the Sikh community in Punjab because of the sacrilege incidents, we have decided to boycott this by-election,” he said, adding that the SAD-BJP government was not probing the issue seriously. Capt.Singh demanded that the matter should be probed by a judicial commission headed by a sitting judge of the High Court.\n\nHowever, the decision to boycott the by-election has not gone well with a section of the party cadre which believes that the party should have contested the poll, sources said.\n\nMeanwhile, Punjab’s Deputy Chief Minister Sukhbir Singh Badal said the Congress had opted out of the by-poll owing to the fear of defeat. “It’s an admission of defeat by the Congress. Capt.Amarinder is a quitter and his latest decision of not contesting the poll is a continuation of his record”, Mr.Badal said.\n\nBJP’s Punjab State president Kamal Sharma said the Congress action was an admission that the party stood nowhere in the Assembly elections due next year. He tweeted, “Khadoor Sahib by-election: Congress withdrawal itself proves that party is no more a player in Punjab”.", 
    "section": "national", 
    "title": "Congress to boycott Punjab by-election", 
    "subsection": "general", 
    "date": "2016-01-28"
}