{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Efforts are on to make farming profitable, says Union Minister\n\nAgriculture Minister Radha Mohan Singh presenting an awardat the National Youth Convention on ‘Attracting and Retaining Youth in Agriculture,’ in New Delhi on Wednesday.— PHOTO: PTI\n\nUnion Agriculture Minister Radha Mohan Singh on Wednesday said migration of rural youth to cities was alarming. This could have several implications on the future of Indian agriculture and hence, to create interest among rural youth in agriculture, there was a need to make farming more profitable.\n\nHe was addressing an event on attracting and retaining youth in agriculture organised jointly by the Indian Council of Agricultural Research (ICAR) and the All India Agriculture Students Association (AIASA) here.\n\nRealising the importance of rural youth in agricultural development, especially from the point of view of food security, the ICAR has initiated a programme on “Attracting and Retaining Youth in Agriculture.”\n\nMr. Singh said start-up India had created an impact on non-farm sectors as many entrepreneurs started vibrant enterprises. “It is time to extend start-up India to the farm sector by replicating the success stories of enterprises in honey production, dairying and fisheries,” he said, adding that to promote agri-business and to attract young farmers, the Centre was promoting formation of Farmer Producer Organisations. Capacity building and financial assistance would be provided. “This ICAR project will be implemented in 25 districts [one district from each State] through the Krishi Vigyan Kendras. Each KVK will involve about 200 youths below the age of 35.”\n\nThe Minister said the government had made B.Sc. Agriculture a mandatory qualification to get licence for sale of agriculture inputs such as seeds, fertilizers and pesticides. “This will create several thousand jobs for agriculture graduates,” he added.", 
    "section": "national", 
    "title": "Extend Start-up India to farm sector, says Minister", 
    "subsection": "general", 
    "date": "2016-01-28"
}