{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Security personnel escort Vipin Srivastava after he was mobbed by students in Hyderabad on Wednesday.— Photo: KVS Giri\n\nProtests at the University of Hyderabad took a turn for the worse on Wednesday, when about 100 students chanting slogans marched in a group and surrounded the house of Professor Vipin Srivastava, Vice-Chancellor in charge. They were protesting against the suicide of Dalit research scholar Rohith Vemula on January 17.\n\nLater in the day, when the VC reached the protest venue to talk to them, students raised the slogan “VC down down,” following which he left amid police presence.\n\nThe SC/ST Teachers’ Forum demanded that both Vice-Chancellor Professor Appa Rao and Prof. Srivastava resign, failing which they said they would go on a hunger strike from Thursday.\n\nUoH officials said it was hard to talk about resuming academic activities given that the Students Joint Action Committee had given a bandh call. Talks were expected to resume and the impasse would hopefully end in a few days, they said.\n\nAbout 100 students surrounded Prof. Srivastava’s house around 10.30 a.m. Prof. V. Krishna, who resigned as controller of examinations, said Prof. Srivastava should step down as he had headed the sub-committee which was formed to look into the incident involving the Ambedkar Students Association (ASA) and ABVP member Susheel Kumar. The students’ JAC also demanded his resignation.\n\nAfter six fasting students were shifted to the varsity’s Health Centre as their health deteriorated, Devi Prasad, along with writer Meena Kandasamy, were continuing with the hunger strike, said a JAC member. The day witnessed students carrying out rallies by the All India Students JAC. The group, which has been organising the ongoing protests after Rohith Vemula committed suicide, comprises about 15 members from different student unions in the UoH campus, barring the ABVP.\n\nProf. Vipin Srivastava headed the sub-committee formed to look into the incident involving the ASA and ABVP member Susheel Kumar", 
    "section": "national", 
    "title": "Hyderabad university students demand acting V-C’s resignation", 
    "subsection": "general", 
    "date": "2016-01-28"
}