{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After viewing the Republic Day parade on Tuesday, French President Hollande said he was “delighted by the profusion of colour” and enjoyed the dances and the tableaux the most.\n\nNot just that, Mr. Hollande, who was the chief guest at the parade, said he wanted the annual French military parade on Bastille Day, July 14, to have more of the joie de vivre (French for “joy of life”) and “show of diversity” that the Indian parade did. Mr. Hollande referred to the tableaux from the various States as a “veritable 3-D painting,” which he said he was particularly struck by.\n\nMr. Hollande was speaking at a function shortly after the parade. French Defence Minister Jean Yves Le Drian was present. “I wish that instead of more military hardware, we see more colour of the same kind in our parade too next year,” the President said with a smile directed at Mr. Drian.\n\nMembers of the French President’s entourage told The Hindu that they had all been impressed with the marching of various military contingents down Rajpath.\n\n“But, for us, the dancers from Rajasthan, the camels that marched and the tableaux that showed Indian life all stood out in comparison to the more sombre military parades we see,” a senior official said.\n\nThe parade on Tuesday included a foreign contingent for the first time, with the French 35th Infantry regiment leading it. The decision to include the French contingent was a “return honou”’ for the French invitation to an Indian contingent of 400 soldiers, who led the Bastille Day parade along the Champs Elysees in Paris in 2009, when the then Prime Minister, Manmohan Singh, was the chief guest there. Then too, it was the Indian contingent that drew the loudest cheers, especially for the Indian Army’s 22 Maratha Light Infantry, with their bright red turbans, that particularly delighted the crowd. This is President Hollande’s second State visit to India, but his first on a Republic Day.\n\nFrench President wants Bastille Day parade to share the vibrancy of Republic Day", 
    "section": "national", 
    "title": "Joie de vivre that charmed Hollande", 
    "subsection": "general", 
    "date": "2016-01-28"
}