{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "A multi-purpose port, refinery and Jaitapur nuclear plant threaten coastline: activists\n\nIn its rush to present a business-friendly face, the Maharashtra government is now betting on the ecologically-rich Konkan coastline, where three projects — a port which will also include a thermal power plant among other industries, the contentious 9,900-MW Jaitapur nuclear power plant and one of the biggest oil refineries in the world — are proposed almost adjacent to each other within a 50-km radius.\n\nWith the government firm on going ahead with the projects, environmentalists have pressed the alarm button, warning the government that the cluster of industries will do more harm than good. However, Chief Minister Devendra Fadnavis told The Hindu on Wednesday that there was no reason for concern.\n\n“Whatever location we finalise will be in consultation with experts,” he said, adding that safety protocols will be followed. “It is too early to jump to conclusions,” he said.\n\nAcquiring plateaus\n\nEnvironmentalists, though, fear the worst and point to his recent announcements. On Monday, the CM had held a meeting with Union Petroleum Minister Dharmendra Pradhan, announcing India’s biggest ‘green’ refinery — a joint venture with the Bharat Petroleum, the Indian Oil and Hindustan Petroleum Corporation Limited on the Vijaydurg plateau in north Sindhudurg district by acquiring over 15,000 hectares of land.\n\nTo the north of this proposed project lies the Madban plateau, which is being acquired to set up the 9,900 MW Jaitapur Nuclear Power Project (JNPP).\n\nRecently, French firm EDF acquired Areva (another French company), the nuclear firm that was originally slated to provide technology for this project.\n\nThe Nuclear Power Corporation of India Limited (NPCIL) has reportedly signed an MoU with EDF to build nuclear reactors here. While work on the project has been stopped for the last few years due to pendency of certain techno-commercial agreements, there are no roadblocks to this project.\n\nDebate lost for translation\n\nIn addition to these projects, the Ambolgad beach in Ratnagiri has been earmarked for the construction of a multi-purpose port. According to the project’s Environment Impact Assessment (EIA) report, it is proposed to have both forward and backward integration by developing jetty-based industries such as a bauxite benefication plant, a steel plant and gas or coal-based thermal power plant, sugar refineries, a container hub and tank farms directly or through joint ventures and acquisitions.\n\nLast week, a prescheduled environmental public hearing for the project was cancelled and postponed as the EIA report was available only in English; villages that will be potentially affected have demanded a draft in Marathi.\n\nDrawing local ire\n\n“Analysing individual projects for their adverse impact on the environment won’t do any good. An integrated approach is needed for projects coming up in ecologically-sensitive area like Konkan,” said renowned ecologist Madhav Gadgil, who had headed the Centre-appointed committee that studied the impact of projects, including dams, on the Western Ghats.", 
    "section": "national", 
    "title": "Konkan mega projects decried", 
    "subsection": "general", 
    "date": "2016-01-28"
}