{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Mehbooba Mufti is building pressure on BJP to spell out its assurances on the agenda.\n\nPeoples Democratic Party (PDP) president Mehbooba Mufti has called a cadre-level meeting on January 31 to assess the party’s mood on government formation and to provide more time to coalition partner Bharatiya Janata Party.\n\nPDP sources said Ms. Mufti was prolonging the process of government formation “to allow time to the coalition partner BJP to re-engage her on a timeline for implementation of the Agenda of Alliance”, a common minimum programme agreed u'pon between the PDP and the BJP when they formed the government in Jammu & Kashmir in March last year.\n\n“The main focus of the meeting will be the late Mufti Mohammad Sayeed’s vision for the State and how the same can be taken forward. Mehbooba wanted to meet district-level leadership to know their mind on a range of issues … Government formation will also be on the table,” PDP legislator and former Education Minister Nayeem Akhtar told The Hindu .\n\nIt will be Ms. Mufti’s second meeting after January 17, when senior party leaders mandated her to take the final call on government formation. A similar meeting is scheduled in Jammu in the first week of February. Last year, Sayeed carried out a similar exercise while allying with the BJP.\n\nApparently unhappy with the coalition’s performance, Ms. Mufti (56), who never held a portfolio in the State, is building pressure on the BJP to spell out its assurances on the common minimum programme.\n\nThe BJP in New Delhi reportedly is in no mood to make any fresh promises. PDP insiders told The Hindu that the only way to end the logjam is to reopen a channel of communication, which was snapped after Union Minister and BJP leader Nitin Gadkari’s visit to Ms. Mufti’s residence on January 10.\n\n“Let the PDP approach the Governor first,” said BJP leader Nirmal Singh, who was the Deputy Chief Minister in the PDP-BJP government. “The Agenda of Alliance was agreed upon at the highest level [last year]. We are committed to it,” he said.\n\nOmar’s jibe\n\nNational Conference (NC) working president and former Chief Minister Omar Abdullah took a jibe at Ms. Mufti for delaying government formation.\n\n“She [Ms. Mufti] thinks she would keep people waiting for the government and people will plead with her for it,” he said.", 
    "section": "national", 
    "title": "Mehbooba wants timeline for ‘Agenda of Alliance’", 
    "subsection": "general", 
    "date": "2016-01-28"
}