{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "While passengers complain of rattling and unclean coaches in many express / passenger trains operated across Tamil Nadu, dozens of brand new Linke Hofmann Busch (LHB) coaches worth several crores of rupees are gathering dust in the yards of Southern Railway awaiting clearance of the Commissioner of Railway Safety (CRS).\n\nThe light weight LHB coaches are based on German technology and equipped with a variety of inbuilt features that provide extra space, smooth ride and safety.\n\nThese coaches are designed for an operating speed up to 160 kmph and cost about Rs. 2.5 crore each.\n\nAccording to sources, the Indian Railway took a decision to replace the conventional AC and non-AC coaches with LHB coaches in all trains by the end of 2016 and later extended the deadline. While other railway zones got a sizeable number of LHB coaches for important trains in their States, the Southern Railway, which holds the largest number of coaches in the country, has been left far behind in the allocation.\n\nAwaiting clearance\n\nIronically, about 30 new coaches delivered to the zone are idling in the yards awaiting clearance from the CRS and the Railway Board.\n\n“A minor change was made in the design to customise the coach for local requirements. We need the clearance of the CRS to operate these coaches on high speed. At least 30 new LHB coaches are lying in the yard and adequate precaution is being taken to protect them from creepers and rodents,” a senior railway official told The Hindu on Wednesday.\n\nThough the Integral Coach Factory is located in Chennai, not many LHB coaches are rolled out for use in the Southern Railway. The Modern Coach Factory, Raebareli, and Rail Coach Factory, Kapurthala, also make LHB coaches.\n\n“It is true that many important trains in the zone, including the Chennai-Madurai Duronto Express, are run with coaches that are more than a decade old.", 
    "section": "national", 
    "title": "New rail coaches gather dust", 
    "subsection": "general", 
    "date": "2016-01-28"
}