{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Specific aspects on which price can be reduced being discussed, says an official\n\nIndia is waiting for France to get back with ‘better terms’for concluding the Rafale jet deal.— File photo: AFP\n\nIndo-French talks to conclude the deal for purchase of 36 Rafale fighter jets seem to have reached the tipping point with officials on both sides giving four weeks to four months for conclusion of the price negotiations.\n\nOfficials said on Wednesday that the Memorandum of Understanding (MoU) signed in the presence of Prime Minister Narendra Modi and French President Francois Hollande early this week was to confirm the details of the Inter-Governmental Agreement (IGA) which was ready except for the pricing.\n\nA senior government official said the MoU was the first important step to conclude the IGA. “Even in pricing the analysis is complete and a breakup has been done and specific aspects on which price can be reduced are being discussed,” he said.\n\nOn the time required, the official added, “There is no reason why it can’t be done in 4-6 weeks.”\n\nSeparately, in an interview to Karan Thapar on India Today TV, French Ambassador to India Francois Richier said he expected the price negotiations to conclude in four weeks to four months. “Four weeks will be a reasonable time,” he said, adding that four months would be “long time.”\n\nIf India ordered additional jets as the Indian Air Force had a requirement for 126 aircraft of this category, Mr. Richier said some of the components could be manufactured in India in line with the government’s Make in India initiative.\n\nThe IAF has on several occasions conveyed to the government that it needs more planes of the same category for fleet commonality and operational viability.\n\nOffsets clause\n\nMr. Richier said the issue of offsets had already been frozen but refused to comment if it was 50 per cent. The issue of offsets has been one of the major sticking points in the negotiations which France has later agreed to.\n\nAs reported by The Hindu earlier, the effort is to bring the price by at least 20 per cent to below € 8 billion. When asked about this in the interview Mr. Richier declined to comment.\n\nOfficials said while the price had come down from that in the original Medium Multi-Role Combat Aircraft (MMRCA) deal, it was still not acceptable. “Price has come down from the earlier tender but not to our expectations. Let them [French] do their exercise of costing and come back with revised terms,” they said.\n\nThey added that a deal could not be concluded till India got “better terms” as announced by Mr. Modi in Paris last year.", 
    "section": "national", 
    "title": "Rafale pricing issue likely to be resolved in 4-6 weeks", 
    "subsection": "general", 
    "date": "2016-01-28"
}