{
    "author": [
        "Pam Belluck"
    ], 
    "text": "Mood disorders can be detrimental to the well-being of children\n\nJenna Zalk Berendzen, who suffered from severe depression after her first birth, with the younger of her two sons, one-year-old Samuel, at her home in Iowa.— Photo: NYT\n\nWomen should be screened for depression during pregnancy and after giving birth, an influential government-appointed health panel said Tuesday, the first time it has recommended screening for maternal mental illness.\n\nThe recommendation, expected to galvanize many more health providers to provide screening, comes in the wake of new evidence that maternal mental illness is more common than previously thought; that many cases of what has been called postpartum depression actually start during pregnancy; and that left untreated, these mood disorders can be detrimental to the well-being of children.\n\n1 in 7 suffer\n\nIt also follows growing efforts by states, medical organizations and health advocates to help women experiencing these symptoms — an estimated one in seven postpartum mothers, some experts say.\n\n“There’s better evidence for identifying and treating women with depression” during and after pregnancy, said Dr. Michael Pignone, a professor of medicine at the University of North Carolina at Chapel Hill and an author of the recommendation, which was issued by the U.S. Preventive Services Task Force.\n\nAs a result, he said, “We specifically called out the need for screening during this period.”\n\nThe recommendation was part of updated depression-screening guidelines issued by the panel, an independent group of experts appointed by the Department of Health and Human Services. In 2009, the group said adults should be screened if clinicians have the staff to provide support and treatment; the new guidelines recommend adult screening even without such staff members, saying mental health support is now more widely available. The 2009 guidelines did not mention depression during or after pregnancy.\n\n“It’s very significant that the task force is now putting forth a recommendation that’s specific to pregnant and postpartum women,” said Katy Kozhimannil, an associate professor of public health at the University of Minnesota. “Policymakers will pay attention to it. Increased screening and detection of depression is an enormous public health need.”\n\nAffordable Care Act\n\nThe panel gave its recommendation, which was published in the journal JAMA , a “B” rating, which means depression screening must be covered under the Affordable Care Act.\n\nFor years, obstetricians and other health care providers who saw women during and after pregnancy often felt ill equipped or reluctant to ask about problems like depression, anxiety and obsessive-compulsive disorder.\n\n“Ob-gyns thought that if they identify something and don’t have resources to support it, it puts them at significant legal risk,” said Dr. Samantha Meltzer-Brody, the director of the perinatal psychiatry program at the University of North Carolina at Chapel Hill.\n\nNo one screened Melissa Mead, 30, of The Dalles, Oregon, during or after her first pregnancy, five years ago. Shortly after her son Brady’s birth, “I experienced postpartum depression, anxiety and OCD,” she said, and “I didn’t know what it was.”\n\nMs. Mead cried constantly, barely slept, rarely left home and was “scared to death that my baby was going to suffocate,” she said. At her job as an optician, she said that people asked, “‘Isn’t everything so wonderful?’ and I was like ‘I kind of feel like dying on the inside,’ and you don’t want to say that because you’re afraid what people will think of you.”\n\nAfter a year, she saw a psychiatrist for talk therapy. When her second son, Emmett, was born, and she had more symptoms, including fearing that she would stab herself with a kitchen knife, Ms. Mead tried several medications until one worked. She now volunteers for Postpartum Support International.\n\nThe panel said evidence showed that cognitive behavioural therapy was helpful to mothers. It said that the use of some antidepressants during pregnancy could cause “potential serious fetal harms,” but that “the likelihood of these serious harms is low.”\n\nDr. Pignone also emphasized that “untreated depression has a lot of adverse consequences itself.”\n\nPrenatal health\n\nAmong them, experts say, are that pregnant women with depression often take poorer care of their prenatal health. And maternal mental illness can affect children, leading to behavioural problems, emotional instability and difficulty in school.\n\nBesides citing evidence that screening accompanied by even minimal counselling helped women with depression, the panel found that screening caused no harm.\n\n“A decade ago there was more concern that screening pregnant and postpartum women for mental health would do more harm than good,” said Wendy N. Davis, the executive director of Postpartum Support International. “Medical providers would say to me, ‘If I screen and she screens positively for depression and anxiety, I’m afraid that it will just make her feel more scared, or there’s more stigma to that label.’”\n\nBut, she said, “screening tools actually can give a language for both the providers and the patients to feel comfortable talking about it and prevent the stigma.” — New York Times News Service", 
    "section": "national", 
    "title": "Screening for maternal depression gains a push from U.S. health panel", 
    "subsection": "general", 
    "date": "2016-01-28"
}