{
    "author": [], 
    "text": "A former mayor of Bogota city actively promoted graffiti as a public art form; that stance helped counter the stigma of vandalism\n\nA pineapple that looks strikingly like a grenade is spray-painted on one wall, while another is splashed with carnations sprouting from rifle barrels.\n\nAs Colombia seeks a historic peace agreement to end five decades of conflict with the FARC rebels, war and peace are increasingly popping up as themes in the graffiti around the capital Bogota, where street art is booming.\n\n“I wanted to send a message that would open people’s minds,” says DjLu, a graffiti artist known for dotting the city centre with black-and-white images such as soldiers shooting heart-shaped bullets.\n\n‘Servant of peace’\n\nDjLu, who prefers not to give his real name, doubles as an art professor at Catholic University of Colombia when he isn’t out spray-painting public spaces as a self-described “servant of peace”.\n\n“I’m not a guy who’s been uprooted by the conflict, let’s be clear about that. I’m simply human, and as a human I think the conflict is absurd,” he said.\n\nThe Colombian conflict has killed more than 220,000 people and forced six million from their homes.\n\nBut after more than three years of negotiations, the Revolutionary Armed Forces of Colombia (FARC) and the government appear to be close to a peace deal.\n\nLast week they asked the United Nations to set up an observer mission to oversee an eventual ceasefire and rebel disarmament.\n\nThe two sides have set a self-imposed deadline of March 23 to sign a final accord.\n\nThe prospect of turning the page on more than half a century stained by violence is increasingly fuelling street artists’ creativity in Bogota, where graffiti is surging as an artistic medium.\n\nThe city’s mayor from 2012 to 2015, former guerrilla fighter Gustavo Petro, actively promoted graffiti as a public art form.\n\nThat stance helped counter the stigma of graffiti as vandalism, and giant murals sprouted up in iconic spots throughout the city.\n\nToday, visitors and fans can even take a graffiti tour, created by Australian expatriate Christian Petersen.\n\nToxicomano, a graffiti artist known for works protesting atrocities committed by the Colombian army, said the medium is well-suited to politically engaged art.\n\n“The mere fact of painting in the street is a political act,” he said. — AFP", 
    "section": "national", 
    "title": "Street art as a political statement", 
    "subsection": "general", 
    "date": "2016-01-28"
}