{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Don’t be surprised if the next edition of The Hindu Young World Quiz carries a question related to the record-breaking performance of Vidhya Niketan Public School students, Jeevesh C. and Ashwath Sibi M., who won the senior category with 344 points in the 16th edition of the competition.\n\nThe Standard IX boys were ahead of the runners-up, P. Shriram and R. Avnish, who were also from the same school, by a whopping 250 points.\n\nIt was a “dominating and mind boggling performance” and the winners made a mockery of the entire event, said The Hindu ’s resident Quiz Master V.V. Ramanan, who has conducted the contest for several years in a number of cities.\n\nJeevesh and Ashwath, who were runners-up in last year’s quiz, said they prepared only for 10 days before this year’s quiz but had banked on the solid three months’ work they had put in before last year’s event. Their association with the Coimbatore Quiz Circle also helped.\n\nThe boys, along with the junior category winners Vineet Tiwari and Sri Vaibhav of Chinmaya International School, won bicycles, a trip to Kodaikanal, gift hampers, certificates and trophies from chief guest Arunachalam Muruganantham, CEO, Jayaashree Industries.\n\nThis year’s senior event saw 461 teams of two students each compete in the first round. Six of those teams made it to the final round that had a matrix of 24 questions that concealed a Hindi film personality’s face.\n\nIn the junior quiz, 351 teams of two students each participated in the preliminary round. Only six made it to the finals.\n\nThe third prize winners in the senior category were Aravind S.N. and Rahul M. from the Vidya Vikasini Matriculation Higher Secondary School, Coimbatore. Students of Standards VII, VIII, and IX competed in this category.\n\nThe runners-up in the junior category were Nandakishor G.R. and C.K. Jayantha Thitiya of The PSBB Millennium School and Senthil Sivakumar and Kanishk M. of C.S. Academy, Erode.\n\nStudents of Standards IV, V, and VI competed in this group.\n\nThe 16th edition of The Hindu Young World Quiz was presented by the Vellore Institute of Technology.\n\nFirefox was the national sponsor and Kokuyo Camilin was the goodie sponsor.\n\nThe regional sponsors were Banana Slice, Noruks, Indian Oil Corporation Ltd., Lakshmi Ceramics, and Mehta Jewellers (R.S. Puram).\n\nSNR Sons College was the venue partner.", 
    "section": "national", 
    "title": "Vidhya Niketan wins Young World Quiz", 
    "subsection": "general", 
    "date": "2016-01-28"
}