{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Women of Shani Shingnapur staging a protest on Tuesday against attempts by the Ranragini Bhumata Brigade activists to enter the temple.— PHOTO: Special Arrangement\n\nA day after the Ranragini Bhumata Brigade’s eye-grabbing, though failed, plan to break gender barriers by entering the prohibited inner sanctum of the Shani Shingnapur temple, activists led by the outfit’s president, Trupti Desai, met Maharashtra Chief Minister Devendra Fadnavis and submitted a memorandum demanding that women be allowed to offer worship in the sacred platform.\n\nMs. Desai met Mr. Fadnavis here along the sidelines of a function and sought his support to end gender bias and allow unrestricted entry to women at the Shani Shingnapur temple and all other sacred places in the State.\n\n“The CM said he will back us. He has supported our movement. I request the government to act as soon as possible and do away with similar bans across the country,” said Ms. Desai.\n\nThe brigade’s plan to storm the temple on Republic Day was foiled owing to heavy security at the temple. More than 400 activists were detained at Supa village, some 70 km from the temple town in Maharashtra’s Ahmednagar District. Following this, Mr. Fadnavis posted a conciliatory tweet on Tuesday in which he said Indian culture and Hindu religion gave women the right to pray.\n\nLocal residents continue to oppose the brigade’s attempts to do away with the centuries-old tradition, with the Shani Shingnapur village Gram Sabha passing a resolution condemning Ms. Desai and fellow agitators for their repeated attempts to storm the temple ‘chauthara’ (sacred platform).\n\nThe temple authorities are silent on Mr. Fadnavis’ support for the women.\n\nDiscrimination in praying is not in our culture, says Fadnavis\n\nVillage sabha passes a resolution condemning the brigade for repeated attempts to storm the temple ‘chauthara’", 
    "section": "national", 
    "title": "Women’s outfit meets Fadnavis, seeks access to Shani temple sanctum", 
    "subsection": "general", 
    "date": "2016-01-28"
}