{
    "author": [], 
    "text": "“In today’s world, peace is a constant struggle” — is how an Indo-Pak peace calendar welcomes the New Year on its January page.\n\nThe message written by an Indian lawyer in the calendar is complemented by a painting by a student from Lahore that shows a white dove flying from India to Pakistan.\n\n“The idea is to reflect a message of 365 days of peace,” says Ravi Nitesh, founder of Aaghaz-e-Dosti, a joint initiative between non-governmental organisations from both countries, which launched the calendar here recently.\n\nFormer Karnataka Governor T.N. Chaturvedi, chief creative of special projects at ZEEL Shailja Kejriwal, South Asian University President Kavita Sharma and South Asian Fraternity secretary-general Satya Pal spoke at a discussion that followed the launch.\n\n“India has such strength and power to absorb jolts, and it has been so for centuries. It is wrong to divide India into Hindus and Muslims. There are certain people from both sides who indulge in some kind of wrongdoing but the common notion remains of co-existence,” Mr. Nitesh said. Issues of poverty, gender equity and co-existence were mentioned by Ms. Sharma.\n\nMs. Kejriwal highlighted how the media shaped the perception Indians had of Pakistan for generations.\n\nShe said that through her Zindagi channel, she wanted to “put Pakistan into people’s homes and see if perceptions change if the enemy is in your drawing room 24X7.” She said that when she went to different cities and showed it to people, she received an amazing response.\n\n“One person even said ‘they look like us’,” she said amid laughter from the audiences that also had schoolchildren whose paintings were selected from some 300 entries for the calendar, for its fourth edition this year. — PTI\n\n‘Some people indulge in wrongdoing but the common vein is of co-existence’", 
    "section": "national", 
    "title": "A date with India-Pakistan peace", 
    "subsection": "general", 
    "date": "2016-01-18"
}