{
    "author": [
        "Chintan Girish Modi"
    ], 
    "text": "When the Pathankot airbase was under attack for four days, straining India-Pakistan ties further, a bunch of 16 Pakistan nationals were at Igatpuri in Maharashtra, quietly learning life lessons as part of an initiative working on the message of peace.\n\nA citizen-led initiative for cultural exchange is bridging communication gaps between the people of India and Pakistan. Harsh Narayan, a Delhi-based filmmaker, who is coordinating the effort, with institutional support from the Vipassana International Academy in Igatpuri, said the four women and 12 men completed the 10-day course, which requires all participants to observe silence, on January 10. “Members of the group hail from Lahore, Karachi, Islamabad and Rawalpindi,” says Mr. Narayan, who has been facilitating cross-border exchanges between artists, musicians, youth groups and intellectuals from India and Pakistan for several years in collaboration with Society for the Promotion of Indian Classical Music And Culture Amongst Youth (SPICMACAY) and the Pakistan India Peoples Forum for Peace and Democracy.\n\nGroup member Almas Bana, who is former CEO of Habib Education Trust in Karachi, said, “I was amazed with the genuine interest, empathy and curiosity about Pakistan among people here. The course design itself was very thoughtful. The key idea we learnt was to maintain equanimity — not to take success to one’s head, and not to be depressed by failure.”\n\nFor Saira Muneer, the course was an extension of the work she does back home in Lahore Pakistan — that of a yoga teacher at Faiz Ghar and Lahore Gymkhana. “My father was born in Amroha (in Uttar Pradesh). He moved to Pakistan after the Partition in 1947. However, he would come back to his house in Amroha for some time every year. Until 30 years ago, it was much easier to move between our countries. My dream is to have a Vipassana centre in Pakistan.”\n\nThe delegation is now in Delhi, visiting places of historical and cultural significance. On January 14, they enjoyed listening to qawwali at the Sufi shrine of Hazrat Nizamuddin Auliya. On January 16, they participated in a SPICMACAY meeting at Delhi University’s Hindu College, to discuss how cultural exchanges can help foster peace and harmony in South Asia.\n\nAfter the 10-day course, the delegation arrived in Mumbai and was hosted at the Global Vipassana Pagoda near Gorai beach in Mumbai. They spent two days visiting tourist hotspots of Marine Drive, Gateway of India, and Juhu beach. They leave India on January 18, with a bunch of memories and a healthy helping of sukoon .\n\n(The author is a freelance journalist)", 
    "section": "national", 
    "title": "A new prescription for peace from India", 
    "subsection": "general", 
    "date": "2016-01-18"
}