{
    "author": [
        "Suresh Krishnamoorthy"
    ], 
    "text": "The Someswara temple is believed to have been originally constructed in the 7th century\n\nIt is really out of the way. Almost 95 km off the National Highway and most of the road is single lane. However, the place is really worth a visit — be it for nature lovers or for those religious/spiritual at heart.\n\nIt is nature's bounty for sure, tucked away in the backwaters of the Srisailam dam construction on which began in 1960 and 21 long years to be opened.\n\nThe dam was constructed across the Krishna river on the border of Mahbubnagar and Kurnool district and is the second largest capacity, working hydro-electric station in India.\n\nWell, that apart, what is of interest is the temple of Someswara (Lord Shiva), believed to have been originally constructed in the 7th century. But the present temple structure is on a relocated site. There are over a dozen Shiva Lingas and as many temples that are a part of the original complex.\n\nInterestingly, the main temple, with nine Shiva lingas was practically dismantled and re-located around the late 70s to a higher location because it faced submersion in the backwaters, according to D. Satyanarayana, a historian.\n\nOf the temple per se, he said it was built during the time of the Chalukyas, following the ‘Vesara’ style that is considered unique to what is now Telangana.\n\nSpeaking to The Hindu , Chairman of the Telangana State Tourism Development Corporation, Pervaram Ramulu remembers that the exercise to re-locate the massive structure was modelled after the way in which the Abu Simpel temple was dismantled and re-constructed at a height of 600 to 800 metres because it faced submersion following the construction of the Aswan dam across the River Nile in Egypt.\n\nThe Abu Simbel temple was originally constructed in 1257 BC around the time of the Pharoah Ramses in Nubia on the West Bank of the River Nile and re-located once the dam came in place.\n\n“Every block of rock was carefully marked and shifted to the new location. They were then fit in place with nary a change of the original design,” Mr. Ramulu said.", 
    "section": "national", 
    "title": "A standing example of conservation architecture", 
    "subsection": "general", 
    "date": "2016-01-18"
}