{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The Akhilesh Yadav-led Samajwadi Party government has promised to provide land for the construction of a ‘grand memorial’ for Ambedkar.— File photo: Rajeev Bhatt\n\nWith a little more than a year before Uttar Pradesh goes to the polls, politics over the legacy of B.R Ambedkar has gathered pace. Appropriating the legacy of Babasaheb is considered a key thread of the political strategy applied by parties to secure Dalit support.\n\nThe social group together forms a major chunk — almost 22 per cent — of the State’s electorate. There are 66 Dalit sub-castes in the State.\n\nTaking steps to honour the architect of the Indian Constitution, the Akhilesh Yadav-led Samajwadi Party government has promised to provide land for the construction of a “grand memorial” dedicated to him.\n\nOn January 22, Prime Minister Narendra Modi is scheduled to visit the State capital and attend functions bearing the name of Babasaheb.\n\nFor the memorial, Mr. Yadav said he would allot land in the C.G (Chak Ganjaria) City project, an ambitious premium township on the outskirts of Lucknow.\n\nHe took the decision after a meeting with Lalji Prasad Nirmal, the president of the Baba Saheb Dr. Bhimrao Ambedkar Mahasabha, an organisation that claims to propagate the vision and ideals of Babasaheb.\n\nIn what will be his first visit to the State capital after assuming the top post, Mr. Modi is scheduled to attend the convocation of Dr. Bhimrao Ambedkar University. He will also visit the premises of the Ambedkar Mahasabha, where the ashes of Dr. Ambedkar are kept, and pay homage.\n\nThe posturing of the BJP and the SP has not gone down well with the Bahujan Samaj Party, which currently commands the largest chunk of Dalit votes in the State.\n\nOn her 60th birthday on Friday, BSP chief Mayawati attacked both the parties for “working against the interests of Dalits.”\n\nShe accused the Modi government of engaging in “cosmetic work” regarding Dalits merely to appropriate the legacy of Babasaheb ahead of the elections, even as the party plotted to wipe out reservation and other constitutional rights enjoyed by the oppressed communities.\n\nLaunching a direct attack at the Akhilesh Yadav government, Ms. Mayawati said the SP’s mindset towards Dalits was of “casteist and political hatred.”", 
    "section": "national", 
    "title": "Ahead of U.P. polls, politics over Ambedkar’s legacy gathers pace", 
    "subsection": "general", 
    "date": "2016-01-18"
}