{
    "author": [], 
    "text": "A new study shows that ants respond fully to information only when they are at rest.— File photo: K. Ananthan\n\nAnts fully respond to social information when at rest and do not get distracted by it when on the move, a new study has found.\n\nSuch sporadic monitoring of the social environment may reduce information overload and enhance the robustness of complex societies, researchers at the University of Bristol in UK said.\n\nThey tracked the movement patterns of lone rock ants ( Temnothorax albipennis ) exploring a large arena outside the nest, both when the arena was clean and when it contained chemical information (pheromones or other cues) left by previous nest-mates.\n\nThe researchers discovered a relationship between the duration and average speed of an ant’s movements, and also established that movements mostly fluctuated around a constant average speed. The average speed increased in anticipation of a longer movement, suggesting that movement durations were somehow determined in advance.\n\nThis was the case both when chemical information was absent and when it was present, suggesting ants probably only fully respond to social information in between movements.\n\n“An intermittent response to social information would help the individual ant by reducing the burden of information it has to process when moving around in its crowded society,” said Edmund Hunt from University of Bristol.\n\n“It could also benefit the colony as a whole by moderating positive feedback effects, which may otherwise propagate social information of poor quality through the system,” Mr. Hunt said.\n\n“This would compromise the effectiveness of the ants’ decentralised task allocation system. Such intermittent responsivity to aspects of the social environment during movement may have implications for the way we understand other complex adaptive social systems, including human ones,” he said.\n\nThe findings were published in the journal Royal Society Open Science . — PTI", 
    "section": "national", 
    "title": "Ants don’t respond to social information on the move", 
    "subsection": "general", 
    "date": "2016-01-18"
}