{
    "author": [
        "Dennis S"
    ], 
    "text": "Reduction in soil fertility, climate change and shortage of labour cited\n\nCane productivity in the State is dependent on excessive rainfall and drought which appear at regular intervals leading to wide fluctuations in output. — Picture used for representational purposes\n\nA decline in soil fertility, climate change and shortage of labour are some of the reasons that have led to the decline in sugarcane production in the State over the last few years.\n\nAccording to the Sugarcane Research Station in Cuddalore functioning under the Tamil Nadu Agricultural University (TNAU), the production was 30,100 (in thousand tonne) in 2012-13 and 25,700 during 2013-14.\n\nThough there was an increase in the production between 2009 and 2012, the rate of produce could not be maintained due to various factors. The production was 29,746 (in thousand tonne) during 2009-10, 34,252 during 2010-11 and 35,309 during 2011-12.\n\n“There are various factors for the decline in the sugarcane production. Decline in soil fertility, climate change and the need for high cane yield and sugar recovery varieties and non availability of pure seed are some of the reasons behind the decline in production,” said R.S. Purushothaman, professor and Head of the Sugarcane Research Station.\n\nLabour shortage, escalation in the cost of cultivation and non-adoption of Sustainable Sugarcane Initiative, drip fertigation systems by farmers are also said to be the reasons. As for the diseases, red rot poses a major challenge for the farmers. “Cane productivity in the State is dependent on excessive rainfall and drought which appear at regular intervals leading to wide fluctuations in output ,” he added. The Sugarcane Research Station, Cuddalore, has brought out 24 varieties so far to increase the production and sugar recovery.", 
    "section": "national", 
    "title": "Cane production on the decline", 
    "subsection": "general", 
    "date": "2016-01-18"
}