{
    "author": [], 
    "text": "“It will be much easier to export to Iran. We have been importing oil from them despite the sanctions through a rupee payment agreement. We can also start taking up construction projects there. Our project companies can go back to doing that. Iran will also be looking for our technical skills,” Mr.Kumar said.\n\nThe sanctions on Iran were lifted on Saturday following the European Union and the International Atomic Energy Agency deeming that Iran has completed the necessary steps in a deal to restrict its nuclear programme.\n\nApart from Iranian oil, India will also benefit from the removal of restrictions on payments to Iranian companies that the sanctions had imposed. “With the removal of sanctions, we won’t have difficulties in reaching our payment dues. As a result, we can go ahead and sign commercial deals with Iran since payment is no longer an issue. The lifting of sanctions means we can invest in Iran, which we could not do earlier,” PR Kumaraswamy, Professor on the Middle East at Jawaharlal Nehru University said.\n\nIndia reportedly owes Iran $6.5 billion for crude oil purchases, the payment of which has so far been held up due to the sanctions.\n\nOne of the major construction projects in Iran that India has taken an interest in is the development of the Chabahar Port. Now Indian companies will be able to get contracts for this project.\n\n“One area of interest is construction, and there the Chabahar Port becomes important. But even then, that port will be more important for Iran than for India. India’s total trade with all these (Central Asian) countries is less than $1billion. The real benefit will be that we were able to build a port in a foreign country in the face of international competition,” Prof.Kumaraswamy said, adding that this would be the first time India would be attempting this.\n\n“We can sign commercial deals with Iran since payment is no longer an issue”", 
    "section": "national", 
    "title": "Cheaper oil, more trade opportunities for India", 
    "subsection": "general", 
    "date": "2016-01-18"
}