{
    "author": [
        "B Kolappan"
    ], 
    "text": "Viduthalai Chiruthaigal Katchi (VCK) leader Thol. Thirumavalavan said it was an ill-conceived notion that only a Dalit should write about the community or lead a Dalit movement.\n\nIn a discussion on ‘Dalit aesthetics and politics: How the Tamil Dalits reclaimed their identity’ at The Hindu Lit for Life 2016 here, Mr. Thirumavalavan said, “You cannot argue that the leadership and ideology of the working class should emerge from the working class themselves. In that case, we cannot accept Karl Marx and Frederick Engels as the ideologues of the communist movement.”\n\nThe VCK leader stressed that the definition of Dalit literature could not be confined to literary works dealing only with a particular community, but should include all writings portraying the lives of those from disadvantaged sections.\n\nMr. Thirumavalavan called for the re-evaluation of political views. “While we express solidarity with the Tamils in Sri Lanka, Tamil Nadu remained silent when the body of a Dalit was not allowed to be taken to the burial ground through streets where caste Hindus live. We should re-evaluate our views,” he said.\n\nFormer VCK MLA Ravikumar argued that whether it was Tamil nationalism or Left wing politics, an “allergy” towards Dalit literature continued to persist and prevented Dalits from entering the mainstream. “How do you expect a Dalit writer to return his awards protesting against intolerance, when they have received none?” he questioned.\n\nMr Ravikumar said Dalits have become “surrogate victims” and were being sacrificed for the sake of others.\n\nRetired Madras High Court judge Justice K. Chandru, who moderated the debate, said 2015 was a year of intolerance, beginning with a ban of the Ambedkar Study Circle in IIT-Madras.\n\nHe said questions raised over the University of Madras’ decision to ban the works of Pudumaipithan remained unanswered.\n\nVCK leader Thirumavalavan calls for the\n\nre-evaluation of political views", 
    "section": "national", 
    "title": "‘Dalit literature is not just about one caste’", 
    "subsection": "general", 
    "date": "2016-01-18"
}