{
    "author": [], 
    "text": "The discovery of a 75-million-year-old dinosaur fossil in 2010 from Canada’s Dinosaur Provincial Park has now provided scientists an opportunity to fill in gaps in the evolution of other horned dinosaurs.\n\n“For the first time ever, we have a complete skeleton of a baby ceratopsid ,” said Professor Philip Currie from the University of Alberta.\n\n“We’ve only had a few isolated bones before to give us an idea of what these animals should look like as youngsters. All you need is one specimen that ties them all together. Now we have it,” the professor said.\n\nAccording to Prof. Currie, the discovery of juvenile Chasmosaurus allows for the refinement of previous findings.\n\n“One of the greatest benefits is that we can now look at the different body proportions for Chasmosaurus as it grew up,” he said.\n\n“We now have an anchor point with the baby that we can compare with all other specimens of this species, and from that comparison can calculate the dimensions, body weights, and ages for all other ceratopsid species. We can start filling in missing pieces,” the professor added.\n\nThe fossil holds incredible value for paleoecological studies and allows understanding the life history, biomass, population structure, growth rates, variation, and physiology of these animals.\n\n“Unless you’ve got that basic anatomical information, you’re kind of shooting in the dark with all of these other calculations,” Prof. Currie said.\n\nProf. Currie and his team found that juvenile Chasmosaurus ’ skeleton was unexpectedly different in shapes and relative proportions with adult Chasmosaurus .\n\n“There was no doubt in our minds that a baby would have had a much shorter frill relative to its skull length than an adult. But what we couldn’t see is that it also has a different shape,” the researcher said. — IANS", 
    "section": "national", 
    "title": "Dinosaur fossil fills in missing pieces of evolution", 
    "subsection": "general", 
    "date": "2016-01-18"
}