{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "Aruna Roy’s organisation was part of a yatra against the Rajasthan government\n\nA day after an FIR was lodged against a BJP MLA and about 35 persons for allegedly attacking a group working for social activists Aruna Roy and Nikhil Dey, police arrested four persons in connection with the violence.\n\nThough the FIR does not name the MLA, the activists who were allegedly attacked have confirmed that the MLA from Aklera, Kanwar Lal Meena, was involved in the incident.\n\nA 100-day jawabdehi yatra questioning accountability of the government and raising awareness about its schemes across Rajasthan began in December last year. It saw the participation of about 100 organisations under the banner ‘Soochana Evam Rozgar Ka Adhikar Abhiyan’. The yatra has a major participation from Ms. Roy and Mr. Dey’s organisation Mazdoor Kisan Shakti Sangathan (MKSS).\n\nOn Saturday evening, members taking part in the yatra, including women, were attacked by a mob in Jhalawar district’s Aklera region. They have alleged that MLA Meena and about 35 of his supporters beat the activists with lathis and slapped some women.\n\n“The yatra was being taken out peacefully until it was suddenly attacked by a mob,” Mr. Dey said in a statement to the media on Sunday.\n\nA statement issued by the MKSS said: “The BJP MLA began the assault by attacking MKSS activist Shankar Singh… The MLA’s followers then lathi-charged the unarmed members in the yatra and slapped two women activists, broke glass panes of two vehicles, and forcibly seized the camera form an independent filmmaker and beat him up.”\n\nVideo of MLA’s act\n\nOn Sunday, a 56-second long video of the attack emerged showing a mob charging towards the activists.\n\nThe recording shows MLA Meena with a lathi charging towards the activists, beating them and chasing other activists.\n\nHowever, speaking to The Hindu , the MLA denied any role in the violence.\n\n“I heard about the attack and I went to the spot to stop the violence. I am being falsely accused of participating in the violence.”\n\nFour persons were arrested in connection with\n\nthe violence\n\nduring the yatra", 
    "section": "national", 
    "title": "FIR against Rajasthan BJP MLA for ‘attacking’ Aruna Roy’s group", 
    "subsection": "general", 
    "date": "2016-01-18"
}