{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Lalu Prasad, who has been re-elected president of the Rashtriya Janata Dal for the ninth consecutive term, says he will launch a nation-wide campaign against the BJP and Prime Minister Narendra Modi soon. —Photo: RaNjeet Kumar\n\nFormer Bihar Chief Minister Lalu Prasad was on Sunday re-elected the president of the Rashtriya Janata Dal (RJD) for the ninth consecutive term at the party’s national council meeting here. Speaking on the occasion, Mr.Prasad said that there were no differences between him and Chief Minister Nitish Kumar as alleged by some. On the charge that he was giving directions to officials, Mr.Prasad said that being the leader of the ruling grand alliance, it was his responsibility to solve people’s problems, and took a dig at the saffron brigade, asking, “In which capacity does the RSS give directions to the BJP?”\n\nMr.Prasad said that he would begin a campaign from Jayanagar in Varanasi to take on the BJP and Prime Minister Narendra Modi all across the country. Party sources told The Hindu that Mr.Prasad would start his journey from the last week of February.\n\n“The Bihar experiment of grand alliance will also be replicated in other States by bringing like-minded parties on a common platform”, said Mr.Prasad.\n\nHe emphatically said that there were no differences between him and Mr.Kumar and the coalition government was working well. He also admitted to giving directions to bureaucrats, health officials and doctors of government-run hospitals. Mr.Prasad’s elder son, Tej Pratap, is the State Health Minister and Mr.Prasad had been making “surprise inspections” and giving instructions to health officials and doctors of government hospitals.\n\n“Being the leader of the grand coalition government, it is also my responsibility to solve people’s woes who come to me for redress…there is nothing wrong in it”, Mr. Prasad said, while addressing the party delegates at the function. Posing a question to the Opposition BJP, he asked, “Then why does the RSS give directions to the BJP? The BJP leaders should answer this”.", 
    "section": "national", 
    "title": "Grand alliance will be replicated, says Lalu", 
    "subsection": "general", 
    "date": "2016-01-18"
}