{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tantri, Kandararu Maheswararu Mohanararu, conducting a ritual after Alangad Yogam offered the ‘Pantheerady Nivedyom’ at the Ayyappa Temple in Sabarimala on Sunday.\n\nThe Sabarimala temple continued to witness heavy rush on Sunday as hundreds of Ayyappa devotees from different parts of the country undertook their annual pilgrimage to the forest shrine even after the ‘Makaravilakku’ ceremony on January 15.\n\nThe pilgrims had to wait inside the thickly packed barricades leading to the Lower Tirumuttom of the Ayyappa temple for hours together to reach the temple ‘Sopanam’ on Sunday.\n\nWater and biscuits\n\nThe Travancore Devaswom Board and the Ayyappa Seva Sanghom volunteers have supplied medicated drinking water and biscuits to the weary pilgrims waiting inside the barricades.\n\nThe Alangad Yogam group of pilgrims reached the ‘sannidhanam’ after performing the ‘Petta Thullal’ at Erumely on January 12 have offered their annual ‘Panthirunazhy Nivedyom’ and other offerings to the presiding deity on Sunday.\n\nThe Tantri (chief priest), Kandararu Maheswararu Mohanararu, performed the rituals.\n\nThe ‘Nivedyom’ was prepared with the rice, jaggery, spices, coconuts, cashew nuts and dried grapes brought by the Alangad Yogam in six large vessels as well as their ‘Irumudikkettu’.\n\nThe Tantri also performed the auspicious ‘Neyyabhishekom’ with the ghee offered to the deity by the Alangad group.\n\nThe auspicious ‘Kalabhabhishekom’ was performed at the Ayyappa temple prior to the ‘Utchapuja’. ‘Padipuja’ and ‘Pushpabhishekom’ were the other important rituals performed at the temple on Sunday.\n\nThe ‘Neyyabhishekom’ offering will come to a close with the ‘Kalabhabhishekom’ on Tuesday.\n\nThe ‘Guruti’ ritual to propitiate the ‘Bhoothagana’ (cohorts) of Lord Ayyappa will be performed at ‘Malikappuram’ on Wednesday and the Ayyappa temple will be closed on Thursday morning, marking the culmination of the annual pilgrim season.\n\n2 pilgrims die of heart atack\n\nTwo pilgrims died of heart attack at Sabarimala on Sunday.\n\nThe deceased have been identified as G. Rajashekharan, 52, from Trichy in Tamil Nadu, and E. Venitaramadu, 57, from Ananthapur in Andhra Pradesh.", 
    "section": "national", 
    "title": "Heavy rush continues at Sabarimala", 
    "subsection": "general", 
    "date": "2016-01-18"
}