{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "India is all set to overhaul its security cooperation agreement with China and further liberalise visa norms for the neighbouring country, a senior government official has told The Hindu.\n\nIf the agreement comes through, China will deport Indians accused of terrorist acts and operating in Chinese territory after its agencies conduct an independent probe, the official said.\n\nTo begin with, a Memorandum of Understanding (MoU) signed in 2005 between the Ministry of Home Affairs and the Ministry of Public Security, People’s Republic of China, is being revisited to expand its scope, said the official. The MoU was signed for exchange of security-related information to combat terrorism.\n\n“The new agreement will also factor in contemporary global threats like the Islamic State, as many Chinese nationals are also learnt to have joined the extremist outfit, especially those from the Uighur region who are fighting for a separate state,” said the official.\n\nIndia has been trying to rope in China to corner Pakistan, which according to Indian officials, is involved in supporting terror-related activities in this country\n\nAs per the draft agreement, accessed by The Hindu , India and China will exchange information on terrorist activities, terror groups and their linkages and share experience on anti-hijacking, hostage-like situations and coordinate positions on anti-terrorism endeavours at regional and multilateral levels.\n\nIndian agencies say that the United Liberation Front of Asom leader, Paresh Baruah, shuttles between China and Myanmar to run his extortion and terror rackets.\n\nEven though India included China in the list of countries which have been extended the facility of electronic tourist visa on arrival, the neighbouring country has pressed for lifting restrictions on conference and research visas as well. However, China is yet to respond to India’s demand to offer a similar arrangement for its citizens. Despite opposition from the intelligence agencies against extending e-visa facility for the Chinese, Prime Minister Narendra Modi, during his maiden visit to the country in May 2015, had announced it.\n\n“China has assured that they were working on a mechanism that would ease visa restrictions for Indians. This would include time-bound replies to the applicants,” said the official.\n\nChina is among the top five nations which have expressed interest in doing business in India. According to Ministry of Home Affairs data, eight Chinese companies were given the green signal to start business operations in India under the Make in India policy.", 
    "section": "national", 
    "title": "India may ease visa norms for China", 
    "subsection": "general", 
    "date": "2016-01-18"
}