{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Soon after Union Human Resource and Development (HRD) Minister Smriti Irani backed the Centre’s decision on the minority status of Aligarh Muslim University (AMU), Jamaat-e-Ulema Hind (JUH) on Sunday described the move as “a result of communal bent of mind of the present ruling dispensation.”\n\n“This attempt of the government reflects that it has no interest in forwarding the slogan sabka saath sabka vikaas ,” said Maulana Mehmood Madani, the president of JUH.\n\nWhile Ms. Irani said the government’s stand was in accordance with the act of Parliament, Mr. Madani said it was “against the Constitution.”\n\n“All right-minded citizens of the country should come forward to oppose it,” Mr. Madani said.\n\nThe restoration of minority status of AMU is pending with the Supreme Court but what kicked up a controversy is the Centre’s recent decision to overturn the UPA government’s support to the university in the apex court.\n\nOn January 11, Attorney General Mukul Rohatgi told the court that the NDA government withdrew supporting the idea of having a State-funded minority institution in a secular State.\n\nMr. Madani said the government’s cold-shouldering toward minority status of AMU was unfathomable since the educational institution was constitutionally obliged under the University Act of 1981 to have large admission quotas for minorities.\n\n“This provision was adopted by an act of Parliament,” he said.\n\n“Likewise, the Commission constituted by an act of parliament NCM led by its former chairperson Wajahat Habibullah had upheld the minority status to Jamia Millia Islamia a few years ago. Besides, according to Article 29, 30 of the Constitution, the Aligarh Muslim University has been founded with an objective to promote education and culture of the Indian Muslims,” he said.\n\nMr. Madani said the government should not play “anti-minority card” and must revoke its decision to scrap the minority status of AMU.", 
    "section": "national", 
    "title": "Jamaat flays AMU status change", 
    "subsection": "general", 
    "date": "2016-01-18"
}