{
    "author": [], 
    "text": "Social activist Anna Hazare is full of praise for his one-time protégé Arvind Kejriwal, who he said has not taken “a wrong step” after becoming the Delhi Chief Minister.\n\nMr. Hazare said Mr. Kejriwal is a man of “clean character and an idealist”, who changed the “common man’s approach” to politics.\n\n“Arvind Kejriwal is a man of clean character who is committed to moral values in politics. I have not seen him take a wrong step during the last one year of his tenure as the Chief Minster,” Mr. Hazare said.\n\nHe said Mr. Kejriwal, his comrade-in-arms in the India Against Corruption movement, faces the challenge of taking along good people in politics.\n\n“He is an idealist. His performance as the Chief Minster so far is a positive achievement. To start a political party was earlier regarded as a privilege of the rich. Arvind has changed the common man’s approach to politics,” Mr. Hazare said.\n\n“He is honest and transparent. Manish Sisodia (Deputy CM) is also a committed idealist. I want to see politics in the country getting freed from the influence of money power,” he said in an interview.\n\nMr. Hazare and Mr. Kejriwal fell out following the latter’s decision to join active politics after floating a political party. However, subsequently, there was a thaw and Mr. Hazare even gave some suggestions to Mr. Kejriwal which the latter included in the Jan Lokpal Bill brought by the Delhi government in December last year.\n\nMr. Hazare also rejected Mr. Kejriwal’s criticism by his detractors that the Delhi Chief Minister had little respect for the Constitution or the law.\n\n“I do not agree that Arvind has no respect for the Constitution or the law of the country. He has come from the movement and asserts his rights. To undertake satyagraha is not anti-constitutional. He has not advocated violence as by naxals to change the system,” he said.\n\nThe odd-even road rationing experiment undertaken by the Kejriwal government also came in for praise by Mr. Hazare. — PTI", 
    "section": "national", 
    "title": "Kejriwal has taken no wrong step after becoming CM: Hazare", 
    "subsection": "general", 
    "date": "2016-01-18"
}