{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Days before Nepal is to implement a series of Constitutional amendments, its main Madhesi leader Rajendra Mahato demanded that India should step into Nepal’s domestic negotiations.\n\nMr. Mahato sought India’s involvement at the end of his fortnight-long stay in Delhi where he underwent treatment to recover from grievous injuries sustained in a police attack in Nepal.\n\nMr. Mahato told The Hindu , before leaving for Kathmandu on Sunday, that the amendments that were aimed at neutralising the months old political agitation by the Madhesi people in the plains of Nepal, should involve India as a guaranteeing party so that Nepal government could not backtrack on the political agreement underlying the amendment process. The amendment process took a turn towards implementation on Saturday when three main political parties of Nepal promised the United Madhesi Democratic Front (UMDF) a series of amendments.\n\n“The government of Nepal agreed on two of our demands for the amendment process. But for the main demand of re-drawing of State boundaries, they have asked for three months period. There is no certainty that the Nepal government will stick to the third promise. That is why we are demanding India’s inclusion into the process as a guarantor,” Mr. Mahato said.\n\nState demarcation\n\nSaturday’s understanding reached between the three-party combine and the UMDF pledged to table inclusive and proportional representation of the non-hilly Madhesi population, and constituency delimitation, in the first round of amendments.\n\nHowever soon after the discussions, the UMDF representatives said that they were not satisfied with the position of Nepal government on creation of new State boundaries which they said was necessary to protect Madhesi identity.\n\nNo certainty that Kathmandu will stick to its promise, says Madhesi leader Mahato", 
    "section": "national", 
    "title": "Madhesi leader demands India as guarantor", 
    "subsection": "general", 
    "date": "2016-01-18"
}