{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "What has happened to the many lists of terrorists handed over to Pakistan after major strikes?\n\nIn the wake of the Pathankot terror attack, India has again raised its demand for action against Masood Azhar, the founder of Jaish-e-Mohammad.\n\nOfficials say the government is planning to formally demand that Azhar be handed over to India. It intends to deliver to Pakistan another “list of most wanted”, people accused of terror attacks in India, who are currently believed to be living in the neighbouring country, with Azhar on top of the list.\n\nBut many are asking why India’s focus went off Masood Azhar in the first place. Prior to the 26/11 Mumbai terror attacks, Azhar figured as the most wanted on all the lists.\n\nDespite being referred to as a “harmless cleric” by the previous NDA government, Azhar, who was one of three men released in exchange for 150 Indians during the IC-814 hijack in 1999, activated his terror groups as soon as he reappeared in Pakistan, striking in quick succession in 2001 with the Jammu and Kashmir Assembly building bombing and the Parliament attack.\n\nAfter the Mumbai attacks, however, Hafiz Saeed, Zaki-ur-Rehman Lakhvi and Ilyas Kashmiri of the Lashkar-e-Taiba took precedence.\n\n“India is tracking so many groups and attacks, that we lose focus,” says former RAW chief Vikram Sood, adding, “Pakistan feels that each time we hand over a new list of most wanted, we will eventually move on and give up on the old ones.”\n\nWhile on paper, India has not given up on its most wanted, in reality, the focus has constantly shifted. In the 1980s and early 1990s, there were Sikh militants on the list like Bhindranwale’s nephew Lakhbir Singh Rode and Gajendra Singh, who hijacked a plane to Lahore in 1981. “I personally met General Zia on several occasions, demanding that Singh and others be handed over, but to no avail,” recalls the then High Commissioner to Pakistan, Natwar Singh.\n\nAfter the 1993 Mumbai blasts, India handed over a list of six more names, including Dawood Ibrahim and his associates, that were regularly brought up in India-Pakistan talks. India’s first fully collated list of “14 most wanted”, modelled after the U.S.’s FBI list, was handed over by the then Home Minister L.K. Advani to Pakistani President Pervez Musharraf during the Agra summit of 2001. At the time, Dawood was on top of the list, and Mr. Advani made a special mention of handing him over to India when he met General Musharraf. Why not Azhar, given that the IC-814 hijack had already occurred?\n\n“I guess it was a bit awkward to ask Pakistan to hand him back to us, because we had handed him over to them in Kandahar. So, we preferred not to speak about him as much,” Mr. Sood says. Another reason was that Azhar’s diabolical potential was underestimated by Indian agencies which only saw him as an unfit man who had failed jihadi training in Afghanistan.\n\nJust six months later, however, after the Parliament attack, Mr. Advani’s new list had Azhar on the top. Interestingly, while the list of most wanted has carried Azhar and the other terrorist, Mushtaq Ahmed Zargar (chief of the Al-Umar), released by India in 1999, New Delhi has never demanded Omar Sheikh Saeed, who was also released and is a British terrorist, currently in Pakistani prison for the Daniel Pearl killing. The next list of 20 most wanted was handed over by India after the Mumbai attacks in 2008. According to Satyabrata Pal, who was the High Commissioner to Pakistan at the time, the detention of Saeed then was very much like the current custody of Azhar, and proved cosmetic.\n\nEven so, he says the handing over of the lists is a good “debating point” for India. “Asking for Masood Azhar will not change anything, nor will asking for Hafiz Saeed or anyone on the list. But it is a good debating point, and shows to the rest of the world how Pakistan has not been helpful,” he says.\n\nOthers say harking back to previous lists is pointless. “Let’s get real. Forget about Dawood Ibrahim. We should focus on trying to get Masood Azhar for the Pathankot attack for now. And perhaps try and remind them that Hafiz Saeed is a danger for them too, but that’s it,” says former R&AW chief A.S. Dulat.\n\nIn 2011, India proffered a list of 50 names, which was then amended in 2012. The Multi Agency Centre coordinated the two-week effort, to build the list after consulting the National Investigation Agency, the CBI, Intelligence Bureau and R&AW. It was further updated to 60 names by the same team when NSA Ajit Doval was due to meet his Pakistan counterpart Sartaj Aziz in August 2015. But that meeting never took place, and it is unclear if the list was actually handed over during the NSA meeting in Bangkok in December 2015, or whether it will be handed over the next time the NSAs meet. One thing, however, is clear, for the third time in the past decade and a half, Masood Azhar will no longer be in the background, but right on top of that list, as India’s most wanted.", 
    "section": "national", 
    "title": "Of Masood and other safe-haven men", 
    "subsection": "general", 
    "date": "2016-01-18"
}