{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Tense moments prevailed at Vadavalam in Pudukottai district when a pelted police personnel with stones for preventing them from conducting jallikattu.\n\nTrouble began when the law-enforcers prevented a group from organising the traditional sport on an open round close to the Sri Kaliyuga Meyyar temple.\n\nPolice said that a few bull owners brought the animals to the temple under the pretext of offering worship with the alleged intention to defy the ban. Revenue and police personnel were deployed to prevent the event.\n\nWhile officials tried to explain the Supreme Court ban, a few villagers tried to conduct the event. Some in the crowd threw stones leading to minor injuries to a woman constable, Kalaivani, besides untying one of the bulls from the shed. Sensing trouble, police personnel used force to chase the crowd triggering tension in the village. In retaliation, villagers damaged the wind screens of a police vehicle and injuring a Home Guard member Suresh. The injured were admitted to Pudukottai Government Hospital. Pudukottai Superintendent of Police E.S. Uma inspected the village situated along the Pudukottai – Karambakudi main road. In Tiruchi, district police personnel were deployed at various places to ensure that the sport was not held.\n\nPolice said pickets were posted at places including Suriyur, Avarangaadu, Lalgudi, Kanthalur, Somarasampet, Irungalur, Samayapuram and Purathakudi in the district. A few bulls were reportedly let off in Kodikaal Theru in Lalgudi town in the morning.\n\nLocals said the bulls were brought to a temple located on the street and let off after performing pooja. The locals, however, claimed no one tamed the bulls that emerged from the temple. Upon receipt of information, a police team was deployed at the spot to ensure that bulls were not let off.", 
    "section": "national", 
    "title": "Police prevent bid to defy jallikattu ban", 
    "subsection": "general", 
    "date": "2016-01-18"
}