{
    "author": [
        "K A"
    ], 
    "text": "A medical survey and financial package promised for the victims still remain on paper\n\nAccording to an unofficial survey, 613 children below the age of 14 continue to suffer from the illnesses caused by the aerial spraying of the pesticide in mango plantations of Muthalamada in Palakkad district of Kerala.— Photo: K.K. Mustafah\n\nHemalatha was born two years after the global ban on the killer pesticide endosulfan came into being. Now two-and-a-half-years, her swollen head and apparent physical illnesses are testimony to the residuary harm the banned pesticide had been doing to the people of Muthalamada in Palakkad, known widely as the mango hub of Kerala.\n\n“We all are waiting in vain for the promised help from the State government, which included a detailed medical survey and a financial package ensuring proper rehabilitation of affected families. But nothing happened so far. With another Assembly election hardly a few months away, politicians have started remaining vocal about the plight of endosulfan victims across the State. But we are continuing as a denied and discriminated lot,” says Hemalatha’s mother, Dhanalakshmi Senthil Kumar of Babu Colony at Muthalamada.\n\nSix years have passed since the National Human Rights Commission (NHRC) directed the State government to conduct a health survey and economically empower the poor victims of the killer pesticide, once sprayed indiscriminately in the mango orchards of Muthalamada.\n\nThe order issued on December 31, 2010, directed the government to pay at least Rs. 5 lakh to the close relatives of those who died because of the aerial spraying of the banned pesticide. An equal mount was promised to those who became permanently bedridden and suffered from severe deformities. The NHRC also ordered payment of at least Rs. 3 lakh to all those who turned living victims of the killer pesticide. Now the families of the living victims are demanding an expert study at Muthalamada, Elavanchery, Kozhinjampara, Velanthavalam, Vadakarapathi, Eruthempathy, Nenmara, and Nelliyampathy grama panchayats.\n\nAccording to an unofficial survey conducted by the Chittur Taluk Endosulfan Virudha Samara Samithi, 613 children below the age of 14 continue to suffer from the illnesses caused by the aerial spraying of the pesticide in mango plantations of the region. While some of them have apparent physical illnesses and swollen heads, rest of the children had severe birth deformities, cancer, cerebral palsy, mental disorders, skin diseases, and vision loss.\n\nHemalatha’s elder sister, born five years ago with similar physical condition, lived only for two months‘‘Here the pesticide was sprayed on individual trees with nozzles directed skywards. The person spraying gets affected almost instantly and the after-effects are transferred genetically to kids,’’ says S. Guruvayurappan, a conservation activist.", 
    "section": "national", 
    "title": "Relief eludes Kerala endosulfan victims", 
    "subsection": "general", 
    "date": "2016-01-18"
}