{
    "author": [
        "B Kolappan"
    ], 
    "text": "Father Seraphym, working in the department of foreign relationship with Asia in the Russian Orthodox Church, was deported by officials of the Foreign Regional Registration Office of the Bureau of Immigration at the airport here on Sunday on the ground that he had only a tourist visa.\n\n“He had previously visited India on a proper visa, but this time, could not get one because of holidays in the Russian Federation. But he had an invitation from Russian Ambassador to India Alexander Kadakin. Still, he was not allowed to enter the country,” a Russian Consulate source said.\n\nHe was supposed to participate in a special prayer here on Monday as part of his Asian trip to consulate offices in India, Afghanistan, Sri Lanka, Vietnam and Nepal to give spiritual support to officials and family members of Russian embassies and other official organisations.\n\n“He is not here for preaching or evangelical work among Indian citizens,” the source said.\n\nEarlier, the Russian Embassy in Delhi had sent an invitation to the Indian Embassy in Moscow to issue a visa to Fr. Seraphym. But he was given a visa that allowed him entry only twice.\n\n“Since he was travelling around Asian countries, he had to enter India two times on his way to other countries. His visa expired and he could not go to Moscow to receive a new visa because of the holidays and the Indian Embassy also did not work. So he applied for a visa through Internet. But you can use Internet only for tourist visa on arrival at Chennai. He explained the problems while pointing out that he had already visited India many times. But Indian officials said he could do only sightseeing and cannot involve in other activities,” the consulate source said.\n\nAlleging that his deportation was against the spirit of an agreement between the two countries, Russian consulate sources said the tourist visa could be utilised for humanitarian purposes too.\n\n“What disturbed the Russian diplomats most was they were not allowed to visit the priest at the airport to hand over food. Since he was not allowed to be deported through Delhi, the Russian Embassy could not hand over his winter clothes. This is unfortunate that such disrespect was shown to a priest from a friendly country. Such disrespect will not augur well for the long-term business and cultural relationship between the two countries,” a consulate official said.\n\nImmigration officials sent him back from the airport as he had only a tourist visa", 
    "section": "national", 
    "title": "Russian priest deported from Chennai", 
    "subsection": "general", 
    "date": "2016-01-18"
}