{
    "author": [], 
    "text": "The tiny machines are useful in cell manipulation and have potential to detect cancer\n\nMicrobots can be scaled down from their current size of about 4 mm.— File photo: AFP\n\nScientists are using “mini force fields” to independently control individual microrobots operating within groups, an advance aimed at using the tiny machines in areas including manufacturing and medicine.\n\nUntil now it was only possible to control groups of microbots to move generally in unison, said David Cappelleri, an assistant professor of mechanical engineering at Purdue University in the US.\n\n“We want to be able to control them individually so we can have some robots here doing one thing, and some robots there doing something else at the same time,” Mr. Cappelleri said. The team developed a system for controlling the robots with individual magnetic fields from an array of tiny coils.\n\n“The robots are too small to put batteries on them, so they can’t have onboard power. We use magnetic fields to generate forces on the robots. It’s like using mini force fields,” Mr. Cappelleri said.\n\nThe microbots are magnetic disks that slide across a surface.\n\nWhile the versions studied are around 2 millimetres in diameter — about twice the size of a pinhead — researchers aim at creating microbots that are around 250 microns in diameter, or roughly the size of a dust mite.\n\nIn previous systems, the microbots were controlled using fewer coils located around the perimeter of the “workspace” containing the tiny machines.\n\nHowever, this global field is not fine enough to control individual microrobots independently.\n\n“The approach we came up with works at the micro-scale, and it will be the first one that can give truly independent motion of multiple microrobots in the same workspace because we are able to produce localised fields as opposed to a global field,” Mr. Cappelleri said.\n\n“What we can do now, instead of having these coils all around on the outside, is to print planar coils directly onto the substrate,” he said.\n\nIndependently controlled microbots working in groups might be useful in building micro-electromechanical systems, or MEMS, minuscule machines that could have numerous applications from medicine to homeland security.\n\n“We might use them for cell sorting, cell manipulation, characterisation and so on. You could think about putting the micro-coils on the bottom of a petri dish,” Mr. Cappelleri said.\n\nMicrobots equipped with probe-like “force sensors” might then be used to detect cancer cells in a biopsy.\n\nUseful in medicine\n\n“Cancer cells have different stiffness characteristics than non-cancer cells, and in some of our previous work we put force sensors on the end of these robots to figure out which ones are stiffer than others,” Mr. Cappelleri said.\n\nThe coils were made by printing a copper pattern with the same technology used to manufacture printed circuit boards.\n\nThey can be scaled down from their current size of about 4 millimetres. A new process was needed to create a micro-scale prototype, he said. The study was published in the journal Micromachines . — PTI", 
    "section": "national", 
    "title": "Scientists use ‘mini force fields’ to control microbots", 
    "subsection": "general", 
    "date": "2016-01-18"
}