{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "Uttar Pradesh emerging as a leading player in computers, electronics\n\nThe Uttar Pradesh and Chhattisgarh governments are finalising the contours of a start-up policy to attract young entrepreneurs to set up shop in their terrain, following half a dozen States that have already announced measures for start-ups ahead of the NDA government’s Start-Up India action plan unveiled on Saturday.\n\nKerala was the first State to have a start-up policy that included the setting up of Kochi Startup Village in partnership with the Union Science and Technology Ministry. Since then, Karnataka, Andra Pradesh, Rajasthan and Maharashtra have also formulated similar policies for new-age businesses. A few budding ventures are already being incubated in a Start-Up Oasis set up by the Rajasthan government in Jaipur.\n\n“We are seeing a great interest among State governments to take pro-active steps and attract start-ups. Even U.P. is working on a start-up policy, while West Bengal has created a Rs.150-crore fund to support start-ups that are being selected through a reality TV show hosted by ex-cricketer Sourav Ganguly,” said a senior government official.\n\n“This is particularly interesting as these States have traditionally not been considered business-friendly,” the official pointed out, adding that a Chhatisgarh is also drafting a policy.\n\nUttar Pradesh has emerged as India’s leading State in computers, electronics and optical products manufacturing a few years ago. The State’s IT department has recently invited inputs from industry bodies for formulating its own startup policy.\n\nWhile Karnataka has a policy for start-ups within its IT policy, it is now mulling a separate start-up policy to facilitate new ventures. Some of these policies may need to be re-oriented in order to be able to tap the benefits offered under the Centre’s action plan, such as tax breaks, quicker patents and easier compliance with labour and environmental laws.\n\n“A lot of State entrepreneurship policies are driven by the departments of IT and electronics. So IT has probably the most fertile ecosystem for start-ups with ample traction from private capital,” said Raghunandan Rajamani, executive director, Indian STEP and Business Incubators Association (ISBA).\n\n“Make In India is focussed more on generating larger jobs in core engineering sectors, for which we need a lot more impetus to support ventures beyond IT, so I hope the Start-Up India plan fosters ecosystems to encourage entrepreneurship across sectors with the states,” he said.", 
    "section": "national", 
    "title": "States join start-up bandwagon", 
    "subsection": "general", 
    "date": "2016-01-18"
}