{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Three local militants, who in the last one year became the new face of Kashmir’s militancy due to their family background and educational qualification, were killed in an encounter in south Kashmir’s Pulwama district on Thursday morning.\n\nThe exchange of fire started around 9 p.m. on Wednesday in Mir Mohalla of Dadsara village, Tral area, around 40 km south of Srinagar, when the security forces cordoned off the area. The forces had to battle with the protesters, who hurled rocks at the security forces in a bid to help the militants escape from the site.\n\n“Three terrorists, who belonged to the Hizbul Mujahideen, were killed,” said Srinagar-based Army spokesman.\n\nThe slain militants, identified as Ashiq Hussain Bhat, Mohammad Issac Parray and Asif Ahmad Mir — all residents of Tral — were working with the 24-year-old militant commander Burhan Wani.\n\nWani succeeded in galvanising support and infusing young blood into the militant outfit in south Kashmir last year, enlisting around 35 recruits, to make Hizb emerge stronger than Lashkar-e-Toiba (LeT) and Jaish-e-Muhammad.\n\nAccording to Army sources, Bhat, who took to militancy two years ago, was a ‘A plus-plus’ category militant and wanted by the National Investigation Agency (NIA) in the August 5, 2015 Udhampur attack.Parray (25), widely-known as ‘Newton’ attracted media focus last year for his academic credentials and for being a government official’s son.\n\nParray had secured 98 per cent marks in Class 10 and 85 per cent in Class 12 before joining the militants.\n\nMir, son of a local resident who was killed when the Army allegedly used him as a human shield in Tral in 1994, had a degree in a medical assistance course.\n\nSlain militants had been recruited by Burhan Wani to boost the Hizbul Mujahideen", 
    "section": "national", 
    "title": "3 militants killed in Pulwama encounter", 
    "subsection": "general", 
    "date": "2016-03-04"
}