{
    "author": [
        "Puja Mehra"
    ], 
    "text": "Union Finance Minister Arun Jaitley on Thursday introduced the Aadhaar (Targeted Delivery of Financial and Other Subsidies, Benefits and Services) Bill, 2016 in the Lok Sabha. The Bill provides statutory backing to Aadhaar, the unique identity number through which the government plans to target delivery of subsidy benefits and services. The expenditure for the nationwide Aadhaar exercise is incurred from the Consolidated Fund of India.\n\nThe Bill provides for the establishing of the Unified Identification Authority of India (UIDAI) and the establishment, operation and maintenance of the Central Identity Data Repository. The Authority shall ensure the security, confidentiality and protection of identity information and authentication records of individuals in its possession or control, including the information stored in the repository, according to the Bill. These include biometric information collected, created and stored in electronic form.\n\nThe government expects to address, through the proposed legislation, concerns that have been raised on the mandatory use of Aadhaar in government schemes. The Supreme Court has restricted the use of the Aadhaar number until a Constitution Bench delivers its verdict on a number of cases concerning privacy and other issues.\n\nUnder the provisions of the Bill, the Aadhaar number cannot confer right of or proof of citizenship of domicile.\n\n“An estimated expenditure of Rs. 13,663.22 crore has been approved for implementing the Aadhaar scheme up to the financial year 2016-17,” according to the financial memorandum of the Bill.\n\nMoney Bill\n\nMr. Jaitley introduced the measure as a money Bill, which can only be introduced in the Lok Sabha and to which the Rajya Sabha — where the NDA government does not enjoy a majority — cannot make amendments. The Upper House can only make recommendations to money Bills and must return such legislation to the Lok Sabha within 14 days from the date of their receipt, thus ensuring a time-bound process.\n\nObjecting to the Bill being introduced as a money Bill, Leader of the Opposition in the Lok Sabha (Congress) Mallikarjun Kharge said: “We are ready to cooperate on the Bill but it should not come as a money Bill. They are doing this to avoid Rajya Sabha ... You have made your intention clear.”\n\nThe Opposition also demanded to know if the Bill can be referred to the standing committee on finance. Money Bills cannot be referred to a joint committee of Parliament.\n\nThe UPA government had also introduced the National Identification Authority of India Bill, 2010, to provide statutory backing to the UIDAI. It is not clear if the NDA government has withdrawn the earlier Bill.\n\nResponding to the Opposition’s objections, Mr. Jaitley said: “This Bill is substantially different from what the colleagues are talking about ... The substance of the Bill is that whoever gets subsidies, will have to produce Aadhaar ... This is in accordance with Article 110 ... It is up to the Speaker now to decide whether it is in accordance or not.”\n\nGovt. wants to address concern\n\non mandatory use of the number\n\nin schemes", 
    "section": "national", 
    "title": "Aadhaar Bill introduced in Lok Sabha", 
    "subsection": "general", 
    "date": "2016-03-04"
}