{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Military personnel of adversarial world powers converged upon the Aundh Military Station in Pune to thrall spectators with the largest Multinational Field Training Exercise (FTX) ever conducted on Indian soil.\n\nThe week-long exercise, being held from March 2 to 8, is christened ‘Force 18’ (initially labelled ‘FTX-2016’). The spectacle is an elaborate and ambitious military training exercise involving Army units from eighteen countries, often locked as adversaries in the arena of global realpolitik. They include nine members of the Association of South East Asian Nations and eight observer States: India, Japan, Korea, China, Russia, the United States, Australia, and New Zealand. Myanmar was compelled to back out owing to elections and security issues pertaining to border infiltration.\n\nLt Gen Bipin Rawat, Army Commander of the city-based Southern Command, said the broad objective of ‘Force 18’ was to build common understanding and achieve inter-operability among the 18 ASEAN-Plus countries.\n\n“The countries participating in this FTX have shown faith in the Indian Army for their excellent record with the UN peacekeeping forces,” said Lt Gen Rawat, remarking that an emphasis on minimising casualties caused by land mines would be a focal point. The drill also aims at reaffirming India’s expertise as the lead agency in Southeast Asia for Peacekeeping Operations and Humanitarian Mine Action. A unique facet of the exercise is that the Indian Army contingent of 40 soldiers is being led by Lt Col Sophia Qureshi, a woman officer from the Corps of Signals, who now has the rare distinction of becoming the first woman officer to lead an Indian Army training contingent in such a multinational exercise.\n\nThe Indian Army contingent is\n\nled by a woman officer from the\n\nCorps of Signals", 
    "section": "national", 
    "title": "ASEAN-Plus military drill begins in Pune", 
    "subsection": "general", 
    "date": "2016-03-04"
}