{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "The farmers of Sultanpur village in the Vaishali district of Bihar have refused to part with their standing wheat crop to clear the area for an event which will be attended by Prime Minister Narendra Modi on March 12.\n\nMr. Modi is scheduled to visit Patna on March 12 to attend the concluding ceremony of the Patna High Court’s centenary celebrations and also to inaugurate some railway projects in Vaishali.\n\nFarmers from Sultanpur staged a protest in front of the district administration office recently against the persistent demands from the authorities to cut their standing crops to make space for Mr. Modi’s programme.\n\nThe district administration and Railway officials are said to be pressuring the farmers to harvest their crops early.\n\nRailway officials, requesting anonymity, told The Hindu that despite their best efforts, the farmers were firm on not cutting their unripe crops. “They’ve threatened to prolong their protest if pressured by the district or the Railway officials,” said an official. “The farmers have also refused to accept any compensation for loss of crop.”\n\nUsually, farmers of the district harvest their wheat crop by the end of March or the first week of April.\n\n“The standing wheat crops are like our children and we cannot cut them down early, even if paid compensation five times more than their actual price,” the farmers told local journalists.\n\nEarlier, Bihar Chief Minister Nitish Kumar had tweeted that he and the people of Bihar were looking forward to Mr. Modi’s visit to the State. Official sources said that along with Mr. Kumar and Governor Ram Nath Kovind, Railway Minister Suresh Prabhu, Union Minister and MP from Hajipur, Ram Vilas Paswan and other Union Ministers from Bihar would be present on the occasion.", 
    "section": "national", 
    "title": "Bihar farmers refuse to clear fields for Modi’s event", 
    "subsection": "general", 
    "date": "2016-03-04"
}