{
    "author": [
        "Special Correspondent"
    ], 
    "text": "J.P. Nadda says the BDJS has joined the NDA unconditionally to bring changes in Kerala.\n\nThe BJP on Thursday formally announced two crucial tie-ups for the upcoming Assembly polls, with the Asom Gana Prishad (AGP) in Assam and the Bharath Dharma Jana Sena (BDJS) in Kerala joining the NDA fold. The two tie-ups are seen as important for the BJP as it wants to consolidate the anti-Congress votes in Assam, and make inroads in Kerala, a State where the party has only a marginal presence.\n\nUnion Minister Jagat Prakash Nadda, in-charge of the BJP’s election campaign in Kerala, announced the tie-up in the presence of BDJS president Tushar Vellapally, son of Vellapally Natesan, general secretary of the Sri Narayana Dharma Paripalana Yogam that is dedicated to the ideals of the social reformer Sree Narayana Guru, and is influential among the dominant Ezhava community in Kerala.\n\n“To bring changes in the Kerala politics, the BDJS has joined the NDA unconditionally. We expect that more nationalist forces will join us in the future”, Mr. Nadda said.\n\nMr. Natesan had floated a new political party in December last and had been holding talks with the BJP.\n\nTelecom Minister Ravi Shankar Prasad and senior leader of the AGP Prafulla Kumar Mahanta, along with party president Atul Bora, announced the tie-up for Assam. The AGP will be contesting 24 of the 126 seats in the Assam Assembly, a tie-up that had many hiccups on the way, including Mr. Bora declaring that there would be no poll alliance with the BJP, a few weeks ago. The news was greeted with protests by members of both the parties in Assam, but senior BJP leaders said that these were just “teething problems”.\n\n“There has to be a consolidation of anti-Congress forces in the State”, said a senior party leader.", 
    "section": "national", 
    "title": "BJP clinches poll tie-ups with BDJS in Kerala, AGP in Assam", 
    "subsection": "general", 
    "date": "2016-03-04"
}