{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Indo-U.S. cooperation should not target third party, says China\n\nIndia and China jockeyed over their plans to build connectivity during the Ministry of External Affairs’ first ‘Raisina Dialogue’ international conference that ended on Thursday, with India projecting its own plans in the Indian Ocean and across Central Asia as a counter to China’s estimated 1-trillion dollar One Belt One Road (OBOR) project.\n\nThe theme of the conference was ‘Asian connectivity’, which External Affairs Minister Sushma Swaraj said was “central to the globalisation process” and “particularly important for Asia’s growth and development.”\n\nComparing India’s approach to China’s (without referring directly to either China or the OBOR), the Minister said that India’s plans for connectivity were “cooperative rather than a unilateral approach”, adding that an “environment of trust and confidence is the pre-requisite for a more inter-connected world.”\n\nReplying to Ms. Swaraj, former Chinese Foreign Minister Li Zhaoxing, in his keynote address, rejected the allegation that the OBOR was an “exclusive” initiative for China.\n\n“China views South Asian countries as very important partners and we stand ready to focus on roads, manufacturing, free trade zones. OBOR is not an exclusive initiative, and we welcome participation of various countries and regional organisations,” he said, making a special mention of the BCIM (Bangladesh China India and Myanmar) roadways and trade route project.\n\nSpeaking directly after, Foreign Secretary S. Jaishankar, focussed instead on the government’s project of SAGAR (Security and Growth for All in the Region) and the BBIN (Bangladesh Bhutan India and Nepal) sub-regional connectivity initiative, warning against hidden agendas in promoting connectivity.\n\n“We cannot be impervious to the reality that others may see connectivity as an exercise in hard-wiring that influences choices. This should be discouraged, because particularly in the absence of an agreed security architecture in Asia, it could give rise to unnecessary competitiveness”, he said.\n\nAn organiser from the Observer Research Foundation, that is co-hosting the Raisina Dialogue, rejected criticism that panels on Asian security had lacked Chinese participation for ‘balance’, saying many more senior participants had been invited from China for the conference, but had declined to attend. “We hope for more participation from several countries next year,” said the organiser, adding that about 40 countries had been represented this year.", 
    "section": "national", 
    "title": "Connectivity plans not unilateral: Sushma", 
    "subsection": "general", 
    "date": "2016-03-04"
}