{
    "author": [], 
    "text": "“There is no question of you ‘wanting’ anything. We will decide whether we are inclined to send some restricted issues back to the committee for its decision to be taken within a limited span of time... The committee costs BCCI a lot of money. It is not an easy committee,” Chief Justice Thakur said.\n\nThe court allowed a batch of State cricket associations and former players like Bishan Singh Bedi and Kirti Azad to intervene in the case.\n\nIt posted the case for further hearing on March 18.\n\nThe two-hour hearing focused on the BCCI’s reply to the Justice Lodha report. The Board complained and lauded the Lodha report in the same breath.\n\nThe hearing saw the Bench subject each one of the BCCI’s objections to either derision or counter-questioning. It asked the Board whether the latter thought its rules were too “sacrosanct” even for the Supreme Court.\n\nOne of the questions was why the BCCI and State cricketing bodies have ministers as members. The Lodha report had banned government servants and ministers. The BCCI said people, like former Union Minister N.K.P. Salve, lend “leadership and experience” to cricket administration.\n\n“So just because N.K.P. Salve was there, you want every other minister also to be there? You are finding fault with having a nominee of the Comptroller and Auditor General (CAG) on board, but you don’t mind a minister?” the Chief Justice asked senior advocate K.K. Venugopal, who was fielded by the BCCI.\n\nChief Justice Thakur said ministers may come to appease their own sense of aggrandisement, but why should the BCCI insist on their involvement?\n\nWhen Mr. Venugopal remained quiet, Chief Justice Thakur smiled and said, “Mr. Venugopal, your silence is eloquent.”\n\nTo the BCCI's objection to the Lodha panel’s recommendation on an age cap of 70 years for cricket administrators, Chief Justice Thakur replied, tongue-in-cheek, “Lawyers like you get better with age, is that so with cricketers also? We feel 70 is a good age for retirement. At 70, they should sit at home and watch cricket on TV.”\n\nAt one point, an embattled BCCI told the Bench that the Lodha report has praised them for the good work done. Mr. Venugopal said the Indian side is a dominant force in cricket and the team occupies the top spots in T20 and other formats.\n\n“Yes, the players have managed despite the BCCI,” Chief Justice Thakur intervened.\n\nOn the BCCI's apprehension that the recommendation for “one member, one State, one vote” would lead to corruption like the one seen in FIFA, Chief Justice Thakur asked how many such incidents FIFA had experienced before.\n\nThe BCCI complained that Justice Lodha had recommended voting rights based on territorial boundaries of States and did not take into account historical demarcation of boundaries among members as per the levels of cricket played. This had led to Maharashtra and Gujarat having multiple existing members in BCCI.\n\n“Who gave you the authority to demarcate territories? How can someone start a Cricket association and demarcate the entire country for themselves?” Chief Justice Thakur shot back.\n\nThe Bench then asked whether the BCCI does an audit of the money it gives to State Cricket associations.\n\n“You give crores to these State associations run by some politician or bureaucrat and no questions are asked... is this done to ensure they vote in a particular way?” Chief Justice Thakur asked the Board.\n\nThe Bench asked the BCCI to submit details of amounts given to cricket associations and their expenditure for the past five years. The BCCI then complained about the Lodha report’s suggestion for a drastic reduction in advertisements during matches. This was done to give top priority to “viewer enjoyment.” The BCCI said this would cripple its finances.\n\n“Do you mean that your commerce should overtake the enjoyment of the game?” Chief Justice Thakur asked.", 
    "section": "national", 
    "title": "Don’t delay reforms mooted by Lodha panel, SC tells BCCI", 
    "subsection": "general", 
    "date": "2016-03-04"
}