{
    "author": [], 
    "text": "The organism was about 440 million years old\n\nThree filaments of Tortotubus from Gotland, Sweden, showing the growth of secondary branches along the main filament.— Photo: Reuters/Martin R. Smith\n\nScientists have identified the oldest fossil of any land-dwelling organism yet found — an early type of fungus from 440 million years ago which likely kick—started the process of rot and soil formation, encouraging the growth and diversification of life on land.\n\nThis early pioneer, known as Tortotubus , displays a structure similar to one found in some modern fungi, which likely enabled it to store and transport nutrients through the process of decomposition.\n\nAlthough it cannot be said to be the first organism to have lived on land, it is the oldest fossil of a terrestrial organism yet found, researchers said.\n\n“During the period when this organism existed, life was almost entirely restricted to the oceans — nothing more complex than simple mossy and lichen-like plants had yet evolved on the land,” said Martin Smith, who conducted the research at the University of Cambridge.\n\n“But before there could be flowering plants or trees, or the animals that depend on them, the processes of rot and soil formation needed to be established,” said Mr. Smith, who is now at Durham University in the U.K.\n\nResearchers attempted to reconstruct the method of growth for two types of fossils that were first identified in 1980s.\n\nThe fossils had been thought to be parts of two different organisms, but by identifying other fossils with ‘in-between’ forms, researchers were able to show that they represented parts of a single organism at different stages of growth.\n\nThe fossils represent mycelium — the root-like filaments that fungi use to extract nutrients from soil.\n\nIt is difficult to pinpoint exactly when life first migrated from the seas to the land, but it is generally agreed that the transition started early in the Palaeozoic era, between 500 and 450 million years ago, researchers said. But before any complex forms of life could live on land, there needed to be nutrients there to support them.\n\nFungi played a key role in the move to land, since by kick-starting the rotting process, a layer of fertile soil could eventually be built up, enabling plants with root systems to establish themselves, which in turn could support animal life.\n\nMr. Smith found that Tortotubus had a cord-like structure, similar to that of some modern fungi, in which the main filament sends out primary and secondary branches that stick back onto the main filament, eventually enveloping it.\n\nThe study was published in the Botanical Journal of the Linnean Society . — PTI", 
    "section": "national", 
    "title": "Fungus fossil gives clues to oldest land-dweller", 
    "subsection": "general", 
    "date": "2016-03-04"
}