{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "Bhumata Brigade plans to enter sanctum on Mahashivaratra\n\nRightwing Hindu organisations have decided to oppose the plan of the women activists of Bhumata Brigade to enter the sanctum sanctorum of the Shri Trimbakeshwar temple in Nashik, Maharashtra on Monday on the occasion of Mahashivaratra, to challenge religious traditions.\n\nEarlier, they had insisted on offering worship from the platform of the Shani deity at Shani Shingnapur.\n\n“However, all devout Hindu organisations will prevent them from entering,” said a press release issued here on Thursday by the Hindu Janajagruti Samiti (HJS).\n\nAt the Trimbakeshwar Temple, which is one of the 12 Jyotirlingas of Bharat, only men wearing sovale (a clean, washed, silk or cotton dhoti to be worn during worship) are allowed to enter the sanctum sanctorum. This tradition is hundreds of years old and was not questioned by women VIPs, including ex-President Pratibha Patil, ex-Prime Minister Indira Gandhi and Chief Minister of Rajasthan Vasudharaje Sindhia during their visits.\n\nMoreover, 1,200 local women have also submitted a petition to the local administration opposing any violation of the temple tradition, said a press release from Sunil Ghanvat, HJS organiser for Maharashtra\n\nThe HJS accused the Bhumata Brigade members of indulging in cheap publicity gimmicks and holding the district administration, police and residents to ransom, and advised them, instead to help tackle more important problems facing women such as rapes, sexual atrocities, and molestations.\n\n“On the day of Mahashivaratra, lakhs of devotees visit Trimbakeshwar. There is every likelihood of law and order problems due to the agitation by the Bhumata Brigade. In such a case, the entire responsibility will be pinned on the administration. Therefore, the activists must be banned from entering Nashik district,” said the HJS press release.", 
    "section": "national", 
    "title": "Hindu outfits oppose women defying Shiva temple tradition", 
    "subsection": "general", 
    "date": "2016-03-04"
}