{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Rafael of Israel and Kalyani group are setting up a joint venture (JV), Kalyani Rafael Advanced Systems, to build weapon systems in India. It could start with the production of Spike Anti-Tank Guided Missile (ATGM) which the Indian Army is in the process of procuring.\n\nHowever the final deal for Spike is yet to be cleared and contract negotiations are currently underway. The deal which was cleared in 2014 ran into trouble but informed sources said that the issues have been sorted and negotiations will be completed soon without giving a time frame. Sources said the deal is on the top of the agenda during Prime Minister Narendra Modi’s visit to Israel later this year. Under a tripartite agreement the JV is expected to manufacture sub-assemblies and Bharat Dynamics Limited (BDL) will do electro optics and do hot integration at its Hyderabad facility which currently manufactures French Milan ATGMs.\n\nMake in India policy\n\nThe work on the facility has already commenced. It is all about when the final contract is signed, according to a source. As reported by The Hindu earlier the unit will be set up in the hardware technology park in Hyderabad. Conforming to Foreign Direct Investment (FDI) norms in defence the Kalyani group will hold 51 percent stake with Rafael holding the rest.\n\n“The initiative is in line with the government’s ‘Make in India’ policy and will enable the development and production of high end technology systems within the country,” Rafael said in a statement.\n\nThe Rs.3,200 crore deal for the ATGMs was cleared in 2014 by the Defence Acquisition Council chaired by Defence Minister Arun Jaitley which put an end to uncertainty after the U.S. offer of joint production of Javelin missiles. The deal includes 8,000 plus missiles, 300 plus launchers and requisite technology transfer to the Indian entity which was initially supposed to be BDL. Spike is a third generation, fire and forget anti-tank missile.", 
    "section": "national", 
    "title": "Indian firm to partner Israel for anti-tank missiles", 
    "subsection": "general", 
    "date": "2016-03-04"
}