{
    "author": [], 
    "text": "More than 150 works of Indian modernist Nasreen Mohamedi will be displayed at an exhibition at the prestigious Metropolitan Museum of Art this month with the help of Reliance Foundation, marking the first museum retrospective of the artist’s work in the U.S.\n\nThe exhibition is a celebration of Ms. Mohamedi’s work and examines the career of the artist, whose singular and sustained engagement with abstraction adds a rich layer to the history of South Asian art and to modernism on an international level, the museum said.\n\nThe show is organised by The Metropolitan Museum of Art and the Museo Nacional Centro de Arte Reina Sofia in collaboration with the Kiran Nadar Museum of Art.\n\nThe retrospective will span the entire career of Ms. Mohamedi, from her early works in the 1960s through her late works on paper in the 1980s.\n\nIt is by far the most comprehensive exhibition of any Indian artist in the United States. 'With more than 150 works by Ms. Mohamedi on display, the exhibition brings to an international audience more than three decades of her work, comprising her oil paintings, collages, drawings in ink and graphite, watercolours and photographs. The exhibition will be held at The Met Breuer, the new location for The Metropolitan Museum of Art’s contemporary art programme, opening to the public on March 18.\n\n“Mohamedi rarely theorised or spoke about her work but documented her internal dialogue in a form of soliloquy, in tiny personal diaries and notebooks, some of which will be on display in the exhibition. The exhibition explores the conceptual complexity and visual subtlety that made her practice unique in its time,” the museum said. Kiran Nadar said, “The museum’s mandate is also focused on artists whose practice is yet to receive desiring attention and critical acclaim. We believe that their stories need to be told.”\n\nMs. Mohamedi was born in 1937 in Karachi and her family moved to Bombay in 1944. The Metropolitan Museum of Art’s Director and CEO Thomas Campbell said Ms. Mohamedi’s work calls on “us to expand our understanding of graphic minimalism in a transnational context. It is a project that speaks to our interest in introducing a broad range of audiences to the innovative work created by artists across borders”. — PTI\n\nNasreen Mohamedi’s art is on display at the inaugural exhibition of The Met Breuer", 
    "section": "national", 
    "title": "Indian artist’s work opens The Met’s new venue", 
    "subsection": "general", 
    "date": "2016-03-04"
}