{
    "author": [], 
    "text": "Scientists have detected repeated bursts of radio waves beyond the edge of the Milky Way\n\nAstronomers have, for the first time, detected repeating short bursts of mysterious and powerful radio waves from an enigmatic source that is likely located well beyond the edge of the Milky Way galaxy.\n\nThe findings indicate that these “fast radio bursts” come from an extremely powerful object, which occasionally produces multiple bursts in under a minute, researchers said.\n\nAll previously detected fast radio bursts (FRBs) have appeared to be one-off events, they said. As a result, most theories about the origin of these mysterious pulses have involved cataclysmic incidents that destroy their source — a star exploding in a supernova, for example, or a neutron star collapsing into a black hole.\n\nThe new finding, however, shows that at least some FRBs may have other origins. The FRBs, which last just a few thousandths of a second, have puzzled scientists since they were first reported nearly a decade ago. Despite extensive follow-up efforts, astronomers until now have searched in vain for repeat bursts.\n\nLast year, McGill University Ph.D student Paul Scholz was sifting through results from observations performed with the Arecibo radio telescope in Puerto Rico — the world’s largest radio telescope.\n\nThe new data run through a supercomputer showed several bursts with properties consistent with those of an FRB detected in 2012.\n\nThe repeat signals were surprising — and “very exciting,” Mr. Scholz said. “I knew immediately that the discovery would be extremely important in the study of FRBs.”\n\nHe pored over the remaining output from specialised software used to search for pulsars and radio bursts. He found that there were a total of 10 new bursts.\n\nThe finding suggests that these bursts must have come from an object, such as a rotating neutron star having unprecedented power that enables the emission of extremely bright pulses.\n\n“Not only did these bursts repeat, but their brightness and spectra also differ from those of other FRBs,” said Laura Spitler, postdoctoral researcher at the Max Planck Institute for Radio Astronomy in Germany.\n\nThe study was published in the journal Nature. — PTI", 
    "section": "national", 
    "title": "Is Earth getting an intergalactic SOS?", 
    "subsection": "general", 
    "date": "2016-03-04"
}