{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "In November, in an article, Rashtriya Swayamsevak Sangh mouthpiece Panchjanya labelled Jawaharlal Nehru University as a hub of anti-national politics, particularly hitting out at the “pro-Naxal” student unions on campus.\n\nThe battle between the JNU as an institution and the Sangh Parivar is an old one, with the university often being the hub of anti-Sangh academic work over the decades.\n\nJNU is broadly committed to being critical of social conservatism and, owing to its distinctive admission policy, has attracted students from across class and caste backgrounds, imparting its Left-liberal worldview to many of them. This poses a challenge to Hindutva.\n\n“It is not as if JNU professors are all Marxists. There are many liberals, Nehruvians, Ambedkarites, etc. If there is one thread that goes through much of the JNU ethos, it is its opposition to social conservatism,” said a professor of the university. “It is painted as radical Left by the Sangh Parivar because they see its academic output as a threat to their definition of India and to their movement.”\n\nAn article written by JNU historian Rajat Datta for a website says as much: “Not everyone in JNU is a ‘commie’ or a jholawala. I certainly am not. I have felt deeply disturbed by the intellectual arrogance and overreach of the institutional Left ... On the other hand, I have nothing but contempt for the anti-intellectualism and anti-liberalism of the institutional Right.”\n\nAt the height of the Ram Janmabhoomi campaign, in 1991, professors at the Centre for Historical Studies contributed to a book, Anatomy of a Confrontation – The Babri Masjid Ram Janmabhoomi Issue , edited by historian S. Gopal. Many faculty members at the history centre also contributed to a pamphlet as soon as the Babri mosque was demolished in 1992, recalls an historian.\n\nThe centre has seen the production of many works against the Hindu Right: Bipan Chandra’s Communalism in Modern India ; K.N. Panikkar’s Communal Threat, Secular Challenge ; three essays by Romila Thapar, Harbans Mukhia and Bipan Chandra on Communalism and the Writing of Indian History; and a book by Mridula Mukherjee and Aditya Mukherjee on RSS school textbooks and the assassination of Mahatma Gandhi.\n\nThe mood pervades the Centre for Political Studies too. For instance, its retired political scientist C.P. Bhambri has written works like Hindutva: A Challenge to Multicultural Democracy and Bharatiya Janata Party – Periphery to Centre .\n\nIn the recent years, a strong association of Ambedkarites has added to the diversity of political discourse on campus, adding yet another ideological adversary to the Hindu Right.\n\nThe Left-liberal worldview of the university poses a challenge to the Hindutva concept", 
    "section": "national", 
    "title": "JNU-Sangh Parivar battle goes on", 
    "subsection": "general", 
    "date": "2016-03-04"
}