{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "The government’s move is expected to reduce non-degradable plastic content in municipal waste by over a third. Picture shows Bengaluru residents protesting against the use of plastic.— file Photo: Sampath Kumar G.P.\n\nThe Karnataka government is confident of tackling garbage menace across the State by next week, particularly in Bengaluru, by banning the use of plastics in non-essential items — from takeaway containers to banners and flexes.\n\nOn Thursday, the State Cabinet approved the final draft notification on banning the utilisation of non-essential plastics. Officials of the Department of Forest, Environment and Ecology, who drafted the notification, believe that this will spur the use of eco-friendly materials, and reduce the amount of plastics in garbage dumps.\n\nA Cabinet meeting, presided over by Chief Minister Siddaramaiah, took the decision to ban the manufacture, storage, sale, distribution, and use of plastic carry bags, irrespective of their thickness, according to sources in the State Secretariat. The decision goes beyond the 2011 notification that banned plastic below 40 microns and aims at banning products for which eco-friendly alternatives are available.\n\nWith enforcement of the ban involving multiple departments, officials said a workshop would be conducted for all stakeholders to create awareness on the ban.\n\nThe approved notification is far more extensive than the draft notification that was put up for objections in October. Additions include thermocol, micro-beads and even plastic cutlery — which were suggestions given by activists and citizens, said officials who drafted the law. “We expect the approved notification to come to us in the next few days. The gazette notification will be issued immediately and it will be implemented by next week,” said Ramachandra, Secretary of the department.\n\nThe ban is expected to reduce non-degradable plastic content in municipal waste by over a third. “From using jute to encouraging the use of reusable steel and glass cutlery, there is always an alternative to plastic,” he said.", 
    "section": "national", 
    "title": "Karnataka bans use of non-essential plastic", 
    "subsection": "general", 
    "date": "2016-03-04"
}