{
    "author": [], 
    "text": "Boxing idol Muhammad Ali’s gloves from the “most important sporting event in history” and pieces of his childhood home are among the artefacts at an exhibition in London honouring “the greatest”.\n\nThe vast show opening on Friday at London’s 02 Arena traces the story of the boxer from his childhood, through his glittering and brutal career to his elevation as a cultural and political icon.\n\nThe 100 items at the “I Am The Greatest” show include one of his robes, embroidered with his famous “float like a butterfly, sting like a bee” mantra and a dazzling rhinestone and jewelled boxing gown given to him by rock’n’roll legend Elvis Presley in 1973.\n\nVisitors will also be able to see the wooden doorframe from his childhood home in Louisville, Kentucky, and white boots used during his fight with Jimmy Young with soles worn from repeated “Ali shuffles”.\n\nOn show in the city where they became infamous are Ali’s gloves from his bout against British fighter Henry Cooper at Wembley Stadium in 1963, the left one carrying a large rip.\n\nAli’s legendary trainer Angelo Dundee admitted that he opened the tear to buy his fighter more time to recover in the corner after being knocked down by Cooper’s fearsome left hook.\n\nThe show examines Ali’s political journey from pariah, after refusing to fight in the Vietnam War, to counterculture trailblazer and later to establishment hero feted by a string of presidents.\n\nThe event, which runs until August, is co-curated by best-selling Ali author Davis Miller, who stressed Ali’s importance as a man and cultural figure.\n\n“It features his iconic moments, it has numerous artefacts, but the biggest thing here is story,” he said.\n\n“Everyone either knows the boxer, or the gentleman who has Parkinson’s or the guy who could say poetry at the top of a dime,” added co-curator Angie Marchese. “We wanted to make sure we captured all these different aspects,” she said.\n\nMore than 20,000 people have signed a British petition to give Ali an honorary knighthood, and Mr. Miller said that London was “the best place in the world” to hold the exhibition.\n\n“Londoners have always had a particular affinity for Ali,” he said.\n\n“Ali himself feels a similar affinity for Londoners, he has felt understood and admired here when he was reviled and loathed in the United States.\n\nMr. Miller showed off the gloves worn by Ali during his 1971 defeat to Joe Frazier at New York’s Madison Square Garden, more commonly known as “the Fight of The Century”, or simply “The Fight”.\n\n“It’s certainly the most important sporting event in history, without exception,” Mr. Miller said.\n\n“It was the first time that two undefeated heavyweight champions entered the ring. One representing the establishment, the other representing the young, rebellious and revolutionary.”\n\nAli defeated Frazier in a 1974 rematch, and then again in the legendary 1975 “Thriller in Manilla”. — AFP", 
    "section": "national", 
    "title": "London honours Muhammad Ali with ‘I Am The Greatest’ show", 
    "subsection": "general", 
    "date": "2016-03-04"
}