{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Thousands of head of cattle were lost in natural disasters and the NDRF can reduce future causalities.— PHOTO: Sanjoy Ghosh\n\nAgriculture Minister Radha Mohan Singh on Thursday said that animals were often the forgotten victims of natural disasters and it was commendable that National Disaster Response Force (NDRF) was now getting trained to rescue livestock as well.\n\n“No doubt, prevention of loss of human lives has to be the top priority. However, livestock protection is in no way less important,” Mr. Singh said, addressing a workshop on ‘Management of Animals in Emergencies’ organised by the National Institute of Disaster Management (NIDM) here.\n\n“I’m happy to know that they are now getting trained on management of animals in emergencies and working to get equipped to rescue animals also from disasters,” he added.\n\n“India is vulnerable to a large number of disasters. On an average, direct natural disaster losses amount up to 2 per cent of India’s GDP. Around 94,830 cattle are lost per year on an average due to floods alone in India as per the National Disaster Management Authority’s [NDMA] Flood Guidelines,” he said, pointing out that the losses and impact of natural disasters on animals are equally significant, but are neither reported nor highlighted by media.\n\nIndia is having not only the largest bovine population but also the second largest cattle population and the third largest sheep population in the world.\n\nPointing out that disasters have the potential to affect our vast livestock resources adversely, Mr. Singh said there was a need to put in collective efforts to adopt a holistic approach in addressing the issues of animals for which sensitisation of all the related stakeholders is very essential.\n\nThe government has announced Rs. 1600 crore for Department of Animal Husbandry, Dairying and Fisheries in the budget for the year 2016-17 as against allocation of Rs. 1491 crore in the year 2015-16.", 
    "section": "national", 
    "title": "‘NDRF getting trained to rescue livestock also’", 
    "subsection": "general", 
    "date": "2016-03-04"
}