{
    "author": [
        "Somesh Jha"
    ], 
    "text": "Following widespread outrage over the Union Budget proposal to tax Employees’ Provident Fund (EPF) withdrawals, the Prime Minister’s Office (PMO) held a review with top officials on Thursday.\n\nPrincipal Secretary in the PMO Nripendra Misra chaired the high-level meeting attended by top Finance and Labour Ministry officials.\n\n“The views of all the departments concerned were heard in the meeting. The discussion centred on why there has been so much public uproar over the proposal. The final decision will be taken by the competent authority now,” a government official said. The Union Labour and Employment Ministry made a strong case for a rollback of the proposal to tax 60 per cent of EPF savings at the time of withdrawal, officials say.\n\nRevenue Secretary Hasmukh Adhia; Economic Affairs Secretary Shaktikanta Das; Financial Services Secretary Anjuli Chib Duggal; Finance Secretary Ratan Watal; Labour Secretary Shankar Aggarwal; and Central Provident Fund Commissioner of EPFO V.P. Joy attended the meeting.\n\nThis is the second intervention by the PMO on the issue, the first one being an hour-long discussion with Finance Minister Arun Jaitley and Mr. Adhia on Tuesday.\n\nInitially, Mr. Adhia said that only the interest earned on EPF savings would be taxed. Later, the Ministry said taxing interest income was just one among the representations the government had received. It said those who bought an annuity product with 60 per cent of their EPF corpus would not be taxed.\n\nOn Wednesday, Mr. Jaitley said a final decision would be taken on the proposal before responding to the issue during the debate on the Finance Bill in Parliament.\n\nIn the PMO-led meeting, the Labour Ministry opposed the move to tax EPF savings.\n\n“When PPF and GPF are not taxed at the time of withdrawal, why should EPF savings be subject to it,” asked a senior Labour Ministry official privy to the meeting.“Investing up to Rs.1.5 lakh a year into PPF is tax-free which in over 20-odd years could grow to Rs.80 lakh or so,” the official pointed. He alsoquestioned the Finance Ministry’s explanation that tax on EPF would affect only 70 lakh high-income EPF members out of 3.7 crore active members. The Labour Ministry also pointed out that EPF members were already getting pension under the Employees’ Pension Scheme 1995, which could be revamped.\n\nCentral trade unions say they\n\nwill hold a joint protest on March 10 on the issue", 
    "section": "national", 
    "title": "PMO reviews budget proposal to tax EPF", 
    "subsection": "general", 
    "date": "2016-03-04"
}