{
    "author": [
        "K A"
    ], 
    "text": "Large-scale human interference in forest tracts of Nelliyampathy hills, along with a change in land use patternsby tea estates, are pushing wild animals to stray into human habitats.- File Photo: K.K. Mustafah\n\nUnrestricted plantation activities by nearly four dozen private estate groups at the environmentally fragile Nelliampathy hill ranges in Kerala and large-scale quarrying in the foothills are forcing wild animals to stray into nearby human habitations.\n\nOn Wednesday, a gaur reached a thickly populated residential area at Pudunagaram town near Kollangode, creating panic among the locals. Forest officials said the animal reached Pudunagaram from Seetharkund in Nelliampathy.\n\nHalf a dozen people sustained injuries as the gaur attacked them. The local people managed to capture the animal without the help of officials, and then released it into the forests.\n\nIn the recent past, elephants too had strayed out of Nelliampathy forests.\n\n“The hill ranges that house the Parambikulam Tiger Reserve and numerous streams irrigating vast stretches of farms in Palakkad, and Coimbatore and Tirupur districts in Tamil Nadu are located in a geographically less stable area. The plantation companies that are functioning illegally because of the expiry of their lease agreements are contributing heavily to the present situation. Granite quarries in the foothills are also responsible,” said S. Guruvayurappan, project officer of the Wildlife Protection Society of India.\n\nIn a letter to the Principal Chief Conservator of Forests, Mr. Guruvayurappan stated that forest fire and large-scale human interference were responsible for the present situation at Nelliampathy.\n\nForest officials said that in many areas, the electric fencing initiative had failed because of the lack of cooperation from private estates and those engaged in the tourism business.\n\n“The forest field staff in Nelliampathy requires training in meeting wildlife emergencies. Better coordination between the Forest and police departments is also needed,” he said.\n\nWhen contacted, Nelliampathy forest range officer B. Ranjith said the department was taking steps to prevent the straying of wild animals into human habitats.", 
    "section": "national", 
    "title": "Straying of wild animals triggers panic near Nelliampathy", 
    "subsection": "general", 
    "date": "2016-03-04"
}