{
    "author": [], 
    "text": "About 6,000 items from his 60-year career would be part of the collection\n\nA trove of thousands of Bob Dylan notebooks and other artefacts — mostly unknown except to the rock icon himself — will head to a US university to be preserved for posterity.\n\nThe University of Tulsa in Oklahoma announced on Wednesday that it had acquired more than 6,000 items from the singer's six-decade career and would create the Bob Dylan Archive. The archive will eventually go on permanent display in Tulsa near a recently built museum to Woody Guthrie, the folk legend and Dylan influence who was born in Oklahoma.\n\nThe 74-year-old is revered as one of the most influential living US musicians.\n\nAmong the items in the archive that were rumoured but had not been seen in the public realm is a notebook in which Dylan penned lyrics for his 1975 album Blood on the Tracks , as he conversed with the New York painter Norman Raeben.\n\nThe album is considered a musical landmark for having established a confessional style of song-writing.\n\nThe archive will also feature the leather jacket worn by Dylan at the 1965 Newport Folk Festival where, in one of the defining moments of rock history, he switched to electric guitar. And it will include part of the piano on which he wrote ‘Like a Rolling Stone’, one of his best-known songs.\n\nThe collection also includes Dylan's first recordings in 1959, previously unseen concert films and a wallet in which he kept soul great Otis Redding’s business card and country star Johnny Cash’s phone number. Dylan performs regularly and is believed to be in good health, but he has increasingly paid attention to the preservation of his legacy.\n\nThe University of Tulsa made a concerted pitch to buy the archive, vowing to properly care for it. The price of the deal was not revealed, but The New York Times estimated it was worth $15 million to $20 million. — AFP", 
    "section": "national", 
    "title": "Tulsa varsity proud owners of Bob Dylan artefacts", 
    "subsection": "general", 
    "date": "2016-03-04"
}