{
    "author": [
        "Staff Reporter"
    ], 
    "text": "App-based taxi aggregators Uber and Ola have launched their bike taxi service in Bengaluru on a pilot mode with fares cheaper than those of autorickshaws. With the new venture, they plan to tap the commuter segment that does not normally use cabs.\n\nThe service by U.S.-based Uber – uberMOTO – in Bengaluru, is the second in the world, after Bangkok. “uberMOTO will offer affordable mobility option that will help people save time and money while helping cut congestion in our cities over time,” said Amit Jain, president, Uber India.\n\nAimed at the short-distance traveller, the minimum fare for the uberMOTO service is Rs. 15, and Rs. 3 per km plus Re. 1 per minute travel time. A user can choose the uberMOTO option in the app and can book for the service.\n\nIn the initial launch, the service is made available in places like Sarjapur, Banaswadi, Whitefiled, and Viajayanagar among others. A customer can pay using cash, credit/debit card, mobile wallet or Airtel money for payment. Bengaluru-based cab aggregator Ola also launched Bike Taxi service at a minimum fare of Rs. 30, with an introductory fare of Rs. 2 per km and Re. 1 per minute of trip time. Based on the responses, the service will be rolled out to other cities, Ola said.\n\n“We expect significant demand in the pilot phase and we will continue to scale this service up in the coming weeks to cover more areas in the city and serve more users. We believe this will be a major step towards enabling mobility for a billion,” said Pranay Jivrajka, Chief Operating Officer at Ola.\n\nOf late, bike taxi service start-ups are getting momentum in India and have already seen some players like M-Taxi, Baxi, Hey Taxi, Rapido, Heybob among others.\n\nThey have operations in Guragaon, Mumbai and Bengaluru.\n\nThe new initiative from the app-based providers comes at a time when they are facing regulatory heat from the regional transport authority in the State.\n\nAt present there is no law regulating two-wheeler taxi services in Karnataka.", 
    "section": "national", 
    "title": "Uber, Ola launch bike taxis in Bengaluru", 
    "subsection": "general", 
    "date": "2016-03-04"
}