{
    "author": [
        "Devesh K"
    ], 
    "text": "The Central Bureau of Investigation is probing the role of some politicians in connection with corruption cases against suspended Uttar Pradesh chief engineer Yadav Singh. The accused official and his associates charged five per cent commission to allot work contracts to private players.\n\nIt is learnt that the Income-Tax department had seized several documents from Mr. Yadav during searches against him in 2014. The papers included one hand-written chit comprising the name of a politician. Further investigations into dealings of some companies operated by his associates revealed that shares in a firm were acquired by one member of an influential political family.\n\nThe I-T department findings have been shared with the CBI, which is pursuing the leads to identify all those involved.\n\nThe CBI arrested Mr. Yadav on February 3 as “he had been giving evasive replies.” The agency found that the accused had signed over 1,280 contract bonds amounting to Rs. 959 crore within eight days in November 2014.\n\nOne of the two cases against Mr. Yadav pertains to alleged corruption in the award of tenders for laying underground cable worth Rs.92.02 crore in Noida.\n\nAccording to the CBI, the contract was given without following the rules. Almost 60 per cent of the laying work had been completed by two private firms when the contracts worth about Rs.47 crore were awarded to them in December 2011, the agency alleged. Based on the allegations, the police initially registered a case, but subsequently filed a closure report that was accepted by the court. The investigating agencies have identified about 40 immovable properties allegedly acquired by Mr. Yadav and his associates in Noida, Agra and other places.\n\nThe I-T department findings have been shared with the CBI, which is pursuing the leads", 
    "section": "national", 
    "title": "U.P. politicians under CBI scrutiny", 
    "subsection": "general", 
    "date": "2016-03-04"
}