{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Residents moving a man injured in firing to a hospitalin Srinagar on Sunday.— PHOTO: AFP\n\nTwo civilians, including a woman, were killed and over a dozen people injured in security forces firing, near an encounter site in south Kashmir’s Pulwama district on Sunday afternoon, sparking protests.\n\nEarlier, a local militant was also killed in the encounter.\n\nPulwama erupted in protests in the afternoon when the news about the killing of a local Lashkar-e-Toiba (LeT) militant, identified as Adil Ahmad, spread in the area.\n\nThe Army’s 50 Rashtriya Rifles, CRPF and the police had sealed Lelhaar area of Pulwama after reports about the presence of three militants in the area. However, the protests engulfed parts of the area when the operation was on against the militants.\n\nLocals alleged the Army opened fire and killed a student, Danish Rashid Bhat, without any provocation at Kakapora area, away from the encounter site. “Bhat was just playing cricket,” alleged protesters.\n\nSecurity forces allegedly fired upon civilians inside a residential area near Gousia School, Khar Mohallah, of Kakapora. A student, Shaista Hamid (22), a resident of Lilhaar, received firearm injury and died in the security forces’ action.\n\nThe killing of two civilians, second after the January 20 incident, left a civilian dead near the encounter site, put south Kashmir on the boil.\n\nNeither the Army nor the police have come up with the sequence of events, which led to killing of civilians till late Sunday night.\n\nViolent protests spread across the district. Protesters hurled rocks and clashed with security forces in Pulwama, Pampore and old city in Srinagar.\n\nSeveral injured civilians were shifted to Srinagar hospital for treatment. “One injured civilian, Ghulam Mohi-ud-Din, is critical,” said SMHS Medical Superintendent Dr Nazir Choudhary.\n\nIt’s terrorism: Geelani\n\nAll separatists groups, including Mirwaiz Umar Farooq and Syed Ali Geelani’s Hurriyat factions and Yasin Malik’s JKLF, have called for a shutdown on Monday.\n\n“Forces are committing crimes against humanity and unleashing terror due to the unbridled powers they enjoy under the draconian laws like the Armed Forces Special Powers Act,” said the Mirwaiz.\n\nMr. Geelani described the killings as “state terrorism”.\n\nThe Congress and the National Conference also condemned the killings. “Steps should be taken to avoid innocent causalities,” said J&K Pradesh Congress Committee chief G.A. Mir. NC spokesperson Junaid Mattu said: “Such incidents are major setbacks to reconciliation.”\n\nMeanwhile, inter-district train services have been suspended in the Valley on Monday and all Kashmir University exams postponed.", 
    "section": "national", 
    "title": "2 civilians killed in firing by troops", 
    "subsection": "general", 
    "date": "2016-02-15"
}