{
    "author": [], 
    "text": "The exhibition aims to recreate one of the rebellious artistic movement’s great but unfinished projects\n\nA painting, titled ‘At the Rendezvous of Friends’, by the Dada artist Max Ernst. Dadaism was born in 1916 in Zurich’s old town, where artists produced work that sought to challenge pre-existing notions of what constituted art.— Photo: Dadaart.com\n\nA century after Dadaism was founded in Zurich, a prestigious museum in the city is hosting an exhibit that aims to recreate one of the rebellious artistic movement’s great but unfinished projects.\n\nDadaism was born in 1916 at the famous Cabaret Voltaire in Zurich’s old town, where artists produced work partly inspired by the devastation of World War I that sought to challenge pre-existing notions of what constituted art.\n\nOne of its founders, Romanian-born Tristan Tzara, tried in 1921 to release a collection with some 200 contributions from some of Dadaism’s main contributors — a project named ‘Dadaglobe’, which ultimately faltered due to financing problems.\n\nThanks to artistic sleuthing, much of the collection has been reassembled and put on display in Zurich’s Kunsthaus museum.\n\nEntitled ‘Dadaglobe Reconstructed’, it includes some 160 works by 40 artists from across the world, including noted figures like Max Ernst, Hans Arp and Sophie Taeubeur. All had sent contributions to Tzara for the project.\n\nThe exhibit opened this month and will be on display until May 1, before it shifts to the Museum of Modern Art (MOMA) in New York.\n\nTzara’s Dadaglobe project was conceived as an anthology of the movement, which ran through the mid-1920s and used humour, wit and irony to highlight what some artists described as the social and cultural decay in Europe.\n\nDadaglobe gradually fell into oblivion, aside from passing interest from a few scholars. In 2005, however, Adrian Sudhalter, an art historian and curator at MOMA, noticed a series of numerical markings on various pieces while participating in a Dada retrospective at the Beaubourg Museum in Paris.\n\n“When we inspected the art work, I started to see these numbers at the back of the works and asked myself, ‘what are these numbers?,” she said.\n\nHer curiosity piqued, Ms. Sudhalter headed to the archives of the Jacques Doucet library in Paris, which has a significant collection of Dada and surrealist material.\n\nThere she discovered a list that corresponded to the numbers and sequences she found on the pieces at the retrospective.\n\nBaffled at first, she little by little realised the list was a complete inventory of Tzara’s intended Dadaglobe. She would be able to assemble “the pieces of the puzzle.”\n\n“It was really artistic detective work,” Ms. Sudhalter said. “Because of this list and because of these numbers I realised it would be possible to put (Dadaglobe) back together again,” she added.\n\n‘Biggest regret’\n\nTzara, who died in 1963, commissioned pieces from the leading lights of Dadaism, many of whom sought to poke fun or mock outright a world thrust into upheaval by World War I. The ‘Reconstructed’ exhibit features work by German painter and sculptor Max Ernst, who fought in WWI and was reportedly traumatised by the experience, producing art that was partly concerned with the subject of mental illness.\n\nAlso featured are Hans Arp and Sophie Taeubeur, who were married and worked together in Zurich, turning out what were then groundbreaking multi-media projects.\n\nTaeubeur, born in Davos, is pictured on Switzerland’s 50-franc note.\n\nMs. Sudhalter said that in her research for the project she consulted with Michel Sanouillet, one of France’s most renowned experts of Dadaism, who spoke with Tzara a few years before his death.\n\n“Tzara told [Sanouillet] that Dadaglobe was one of his biggest regrets,” Ms. Sudhalter said. — AFP", 
    "section": "national", 
    "title": "A century after ‘Dada’, museum recreates lost work", 
    "subsection": "general", 
    "date": "2016-02-15"
}