{
    "author": [], 
    "text": "Bajrang Dal activists protest against Valentine's Day in Hyderabad on Sunday.— Photo: K.V.S. Giri\n\nCouples, young and old, enthusiastically celebrated Valentine’s Day on Sunday even as several right-wing activists were held in Hyderabad for taking out a protest march against it.\n\nThe national capital saw the day pass off peacefully as young couples were seen thronging public places, coffee houses and themed restaurants decked up with heart-shaped flowers and red and pink balloons.\n\nDiscounts galore\n\nE-commerce majors, pizza chains, restaurants spas and salons also offered special discounts on the occasion.\n\nIn Hyderabad, several Bajrang Dal and Vishwa Hindu Parishad (VHP) activists were taken into custody from different parts of the city as they held protests against Valentine’s Day celebrations.\n\nAs many as 12 VHP activists were taken into preventive custody at Paradise Circle when they held a demonstration and raised slogans seeking a ban on the celebrations, Assistant Commissioner of Police (Saifabad Division) J. Surender Reddy told PTI.\n\nIn Abids road area, workers of the Bajrang Dal and the VHP burnt an effigy and raised slogans.\n\nAgainst Islam: AIMPLB\n\nDescribing Valentine’s Day as against Islam and its culture, the All India Muslim Personal Law Board (AIMPLB) urged Muslims not to celebrate it.\n\nMeanwhile, students organisations at Osmania University in Hyderabad under the banner of ‘Indian Lovers Unity’ decided to celebrate the day by holding an open meeting on the campus.\n\nIn Kolkata, the National Coalition for Men in India, a coalition of about 50 organisations fighting for men’s rights, said it observed the day by creating awareness against “false rape cases.” — PTI\n\n12 VHP activists taken into preventive custody in Hyderabad", 
    "section": "national", 
    "title": "A day of celebrations, protests", 
    "subsection": "general", 
    "date": "2016-02-15"
}