{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The faces in the Assam Assembly polls may have been declared, three-time Chief Minister Tarun Gogoi will helm the Congress’s challenge and Union Sports Minister Sarbananda Sonowal will be the BJP’s chief ministerial candidate. Yet, it is the All-India United Democratic Front (AIUDF) leader Badruddin Ajmal who has emerged as the fulcrum of both campaigns.\n\nThe BJP’s campaign-in-charge and a former minister in the Tarun Gogoi government, Himanta Biswa Sarma told The Hindu that it was Mr. Ajmal versus the BJP in the State, in an election where identity issues will be most crucial.\n\n“The feeling that issues related to Assamese identity are not important in polls anymore, after two Asom Gana Parishad governments and 15 years of Mr. Gogoi, has been shaken by the appearance of Census data and the Upamanya Hazarika report to the Supreme Court in October 2015, that has made a very realistic assessment of the problem of infiltration in the State,” he said. The Census figures, he said, showed that Muslims made up 34 per cent of the population in Assam. The rise, he said, was directly due to infiltration by migrants from Bangladesh.\n\n“In 2006 and even 2011, these challenges were not before the State, and therefore Mr. Gogoi won in elections where strong emotions were not involved,” he said. “This election will be determined by how strongly we are able to position questions of identity, that a BJP government in the State will have more of an influence over a BJP-ruled Centre and therefore issues like fencing of the border, citizenship rights and the resolution of Clause 6 of the Assam Accord will be acted on,” he added. The BJP, while having just five MLAs, secured seven Lok Sabha seats in the 2014 polls, and showed a spectacular rise in vote percentage from 12 in 2011 to 36 in 2014.\n\n“What is more interesting than the BJP winning seven seats is that the AIUDF won three seats, equalling the Congress’s tally,” Mr. Sarma said.\n\nParty leaders also admit that there are at least 35 seats where the BJP has no chance of winning, and where Mr. Ajmal or the Congress may win. The party has, therefore, worked hard for an alliance with the Bodo People’s Front (BPF) and an attempt, so far unsuccessful, at an alliance with the Asom Gana Parishad to counter this handicap.\n\nMr. Sarma dismissed any suggestions that a high-voltage emotional campaign on identity issues, could boomerang on the party as it did in Bihar where party chief Amit Shah had given incendiary speeches saying the victory of the grand alliance will set off firecrackers in Pakistan. “In Bihar, there was no Ajmal; Lalu Prasad and Nitish Kumar are Indians,” he said. The party, sources said, is waiting for the declaration of poll dates to scale up its campaign rhetoric. And despite the emphasis on identity, continues to remain worried over the fine web of community politics and entitlements that holds up Congress rule in the State. The BJP is hoping that the elections will be fought on the question of who can be considered Assamese.", 
    "section": "national", 
    "title": "BJP relying on identity politics in Assam", 
    "subsection": "general", 
    "date": "2016-02-15"
}