{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Top BJP leaders met Prime Minister Narendra Modi on Sunday in a routine pre-Budget meet in which the JNU controversy is believed to have informally come up.\n\nSources said the government’s line remains one that “anti-national activity” would not be tolerated.\n\nThis happens at a time when the political polarisation over the JNUSU president’s arrest threatens to cast its shadow on the budget session of Parliament when key Bills like the Goods and Services Tax Bill are pending.\n\n“Rahul Gandhi is confused and the Congress is frustrated. They are unable to digest the popularity of the Modi government.\n\nIt is indeed the height of negative politics that the Congress has sided with anti-national forces to target the government,” BJP National Secretary Shrikant Sharma said.\n\nRSS charge\n\nThe RSS too accused the Left parties and the Congress of “condoning anti-national acts” instead of demanding action against them.\n\n“At the expense of the exchequer money, instead of studying, students are involving themselves in anti-India activities and some teachers are supporting them. It is serious,” RSS spokesperson Manmohan Vaidya said in a tweet carried on the RSS twitter handle.\n\n“Instead of condemning and demanding strict action against anti-national activities, some political leaders are condoning this act,” he said.\n\nCPI leader D. Raja said he had received threatening calls from two numbers, with one caller claiming to be a gangster.\n\nHe apprised Home Minister Rajnath Singh of this when he met him on Saturday morning, adding that the threats were regarding him and his daughter, an AISF activist in JNU.\n\n“I will write to the Prime Minister and the Home Minister about the threats on Monday,” Mr. Raja told The Hindu .", 
    "section": "national", 
    "title": "BJP leaders meet PM; govt. keeps hard line", 
    "subsection": "general", 
    "date": "2016-02-15"
}