{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Percentage of Muslims in police forces across States declining\n\nData on representation of Muslims in the country’s police forces has not found a place in the annual Data on Police Organisations (DPO) report of the Bureau of Police Research and Development (BPRD) for the year 2014. The report has been made available at BPRD website.\n\nThe data on percentage of Muslims in police, along with percentage of SCs and STs, was recorded by the National Crime Records Bureau (NCRB) until 2013 year in its Crime in India report in the section on Police Infrastructure.\n\nHowever, the NCRB’s Crime in India Report for 2014, released in August 2015, mentioned that it was discontinuing the section on Police Infrastructure to avoid duplication as similar data was already being collected by the BPRD.\n\nFollowing this, it was expected that the BPRD’s DPO report, which captured the representation of the SCs, the STs and the OBCs in police, would henceforth be capturing the data on Muslims as well. However, the DPO report for 2014 has no mention about Muslims.\n\nIt has to be noted that the percentage of Muslims in police forces across the States was declining steadily, albeit marginally, over the years as the NCRB reports until 2013 showed.\n\nWhile the country had 14.23 per cent of Muslims as per the Census 2011, the country’s police forces with a total strength of about 17.3 lakhs had only 6.27 per cent of Muslims as of 2013.\n\nThough data on Muslims in the police was being captured from 1999, as the archives available in the NCRB website shows, a few States had not made their data available until 2009. Analysis of data from 2010 shows the number of Muslims in police has declined from 6.91 per cent to 6.27 per cent.\n\nParticularly, in Tamil Nadu, which has 5.86 per cent of Muslim population and about one lakh police personnel, the percentage of Muslims in police had declined from 3.5 per cent in 2009 to 1.82 per cent (only 1,846 Muslims) in 2013, which is one of the lowest among major States with comparable police strength.\n\nIn contrast, the representation of the Scheduled Castes and the Scheduled Tribes, have shown healthy increase over the years.", 
    "section": "national", 
    "title": "BPRD report has no data on Muslims in police force", 
    "subsection": "general", 
    "date": "2016-02-15"
}