{
    "author": [
        "Arun S"
    ], 
    "text": "The Centre is at loggerheads with the West Bengal over the State government’s one-and-a-half -decade-old notification banning conversion of agricultural land into tea cultivation area.\n\nStating that the 2001 notification was affecting a large number of small growers — estimated to be around 20,000 — mainly in north Bengal, the Centre recently asked the West Bengal government to lift the ban.\n\nHowever, the State government says the ban — imposed as part of land reforms — was to prevent ‘tea gardeners’ from purchasing (forcibly and through other means such as cheating) land belonging to tribal people. The ban is also to prevent tea gardeners from illegally encroaching upon government-owned land. Besides, the State government says the prohibition was to maintain “an appropriate environmental balance in life and livelihood” in the area.\n\nThe Union Commerce Ministry has of late adopted a proactive approach to improve the prospects of the tea sector, particularly in West Bengal and Assam together accounting for over 80 per cent of the country’s tea production.\n\nIn a rare move, the Ministry in January-end invoked a provision under the Tea Act, 1953 and directed the Tea Board (a Central government agency coming under the Ministry’s jurisdiction) to take over the management and control of seven tea estates owned and managed by Duncan Industries in north Bengal, on finding that the deteriorating conditions there had been hurting over 17,000 workers.\n\nThe Centre noted that the State government’s revenue authorities were not granting ‘No Objection Certificate’ (NOC) to small growers who have planted tea after the 2001 notification.\n\nThe State government had said legal action could be taken against those trying to expand tea cultivation in new areas in violation of the notification, which had followed the West Bengal Land Reforms (Amendment) Act, 2000.\n\nState told to lift ban to help small growers estimated to number\n\naround 20,000", 
    "section": "national", 
    "title": "Centre, Bengal in row over growing tea on farmland", 
    "subsection": "general", 
    "date": "2016-02-15"
}