{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "To strengthen the fight against human trafficking, the Union government has decided to set up a central nodal agency, a senior government official said.\n\nSpeaking to The Hindu on the sidelines of the fifth annual Trafficking in Persons (TIP) conclave in Siliguri, Rajnish Kwatra, Under Secretary (Prison Reforms & Anti Trafficking Cell), Ministry of Home Affairs, said the government was also mooting a law for the same.\n\n“The legislation will be complementary to the nodal agency,” Mr. Kwatra said.\n\nCampaign pays off\n\nOfficials and experts who took part in the conclave said “the message” would be implemented by the end of this year. According to them sustained initiatives such as Operation Smile, a month-long campaign to rescue and rehabilitate those trafficked, had also been bearing fruit.\n\nOne official said the figures for just four States of Operation Smile II carried out in January this year pointed out that over 10,000 missing children had been rescued.\n\nLast year, 9,146 children under Operation Smile and 19,742 children under Operation Muskaan were rescued or rehabilitated.\n\nAt the conclave held on Friday and Saturday, jointly organised by the U.S. Consulate in Kolkata and the NGO Shakti Vahini, various stakeholders raised the question of putting in place a uniform rehabilitation package for survivors of trafficking among other issues.\n\nWhile experts and activists focussed on the vulnerability of Siliguri and north-east India to trafficking, mainly due to “distress in tea gardens”, the U.S. Consul General in Kolkata, Craig Hall, said poverty was just “one of the factors” for the human rights abuse.\n\n“Even in highly developed economies, there is [human] trafficking. Material poverty does not mean poverty of values,” Mr. Hall said. “Poverty cannot be an excuse for pushing somebody into trafficking.”\n\nWest Bengal Women and Child Development Minister Sashi Panja announced that the State would soon implement MoUs inked with other States such as Jharkhand, Uttar Pradesh, Delhi and Bihar for rescue and rehabilitation of trafficked women and children.\n\n“We welcome the announcement by the West Bengal government. Since Bengal is a source State, an inter-State co-ordination will go a long way in curbing trafficking,” Rishi Kant of Shakti Vahini said.\n\nPoverty not an excuse for pushing somebody into trafficking: U.S. Consul-General", 
    "section": "national", 
    "title": "Central nodal agency to curb human trafficking planned", 
    "subsection": "general", 
    "date": "2016-02-15"
}