{
    "author": [
        "Devesh K"
    ], 
    "text": "Mohammad Asif, the alleged India head of the Al-Qaeda in Indian Subcontinent (AQIS) and resident of Deepa Sarai, landed in the terror net through Facebook, say official reports.\n\nPolice records quote Asif, who is now in judicial custody, as saying that while working at a Sambhal shop that sold construction materials, he opened a Facebook account in 2012. Soon he received a friend request from Saeed Akhtar, aka Qasim, a former resident of Deepa Sarai, who was then in Karachi.\n\nQasim, as allegedly disclosed by Asif, said he worked for the Tehrik-e-Taliban, and motivated him to undergo training in Pakistan. He told him that a youth from their village, Sarjil, was also planning to visit Pakistan. At Qasim’s instance, Deepa Sarai resident Masood paid Rs.1 lakh for the travel expenses of his nephew Sarjil and Asif.\n\n“Sarjil, the eldest, was doing engineering from Jamia University. We had high hopes for him. He was obsessed with his plans to go for Umrah [pilgrimage to Mecca], but we asked him to finish his studies first. Days before he is said to have left for Tehran, he came home to collect next year’s fee. His phone was switched off. Someone misguided my son,” says his mother, Imrana.\n\nAsif and Sarjil boarded a Tehran-bound flight on June 23, 2013, from the Delhi airport, where a third person from Delhi joined them, say official reports. “All this is concocted. Asif had got a job in Saudi Arabia through a manpower agent. He travelled alone. I went to drop him at the airport. Travel records will reveal all details,” insists Asif’s brother Sadiq.\n\nHowever, the police version records Asif recounting that he along with the other two landed in Tehran together and contacted Qasim over the phone. They took a bus to Zahedan, capital of Sistan and Baluchistan province in Iran, and crossed the Iran-Pakistan border on foot. On the outskirts of Quetta, they stayed for over a week.\n\nIt took them two more days of travel on motorcycles to reach Ghazni in Afghanistan, and from there they boarded a car to Pakistan’s North Waziristan where Usman — their neighbour from Deepa Sarai — received them.\n\nAsif has disclosed that after reaching North Waziristan, they along with Usman stayed in Miramshah. Qasim joined them soonAsif had to meet one Maulana Asim Umar for further orders.\n\nAsim Umar turned out to be their former neighbour Shaan-ul Haq. Asif completed his Deeni (religious) training, after which Haq invited him to an important meeting at Miramshah, with Al-Qaeda chief Ayman Al Zawahiri’s son-in-law Abu Dujana al Basha (believed to have been killed in U.S. airstrike in 2014), and members of its grand council.\n\nAt the meeting, the police say, Haq was anointed the Amir of the new wing of Al-Qaeda and he took the pledge to propagate the outfit’s ideology across the South Asian region. Asif was made the India chief. He remained stuck in Waziristan for 8-9 months. On getting an opportunity, he got out and was crossing the Iran border when the Iranian police caught him, reports say.\n\nAsif spent about a month in jail. The Iranian police later dumped him in Turkish territory, thereafter he contacted the Indian Embassy in Istanbul which facilitated his return to Delhi after 15 months in October 2014. “Yes, he returned around the same time, but he came back as he was unhappy with his job at a department store in Saudi Arabia,” says Sadiq. Though Asif’s brother says he has never visited Bengaluru, police records cite him disclosing that he went there in August-September 2015 to meet two operatives.", 
    "section": "national", 
    "title": "Deepa Sarai and its road to infamy", 
    "subsection": "general", 
    "date": "2016-02-15"
}