{
    "author": [
        "N J"
    ], 
    "text": "The resentment brewing in Kerala unit of the Bharatiya Janata Party (BJP) against the national leadership over its alleged autocratic style of functioning is likely to erupt soon with the latter reviving a proposal to rehabilitate two expelled leaders P.P. Mukundan and K. Raman Pillai.\n\nParty sources told The Hindu here that leaders of the factions headed by the former State presidents V. Muraleedharan and P.K. Krishnadas, who have buried their hatchet fearing strong punitive action from the Centre, are once again likely to make a last ditch effort to thwart such moves.\n\nThey do not have any strong objections in re-inducting Mr. Pillai, but are sore over the rehabilitation of Mr. Mukundan and that too before the Assembly elections.\n\nSince the national leadership has evinced interest in bringing back all those who have left the party at different stages, and it has entrusted State president Kummanam Rajasekharan to take a call on the issue, the indications are clear that it will not retract from the attempt anymore.\n\nMr. Rajasekharan too had been focussing on the same theme all along the Vimochana Yatra. The exhortation of Mr. Rajasekharan that doors are open for all those who have left the party, has confirmed the fears of the State leaders that he would have his way in the State organisation on other key issues and will also ruthlessly muffle voices of dissent in the party.\n\nThe factional leaders in the BJP deem it as a do-or-die situation and are likely to take the plunge soon. But a section with the State Rashtriya Swayamsevak Sangh (RSS) unit, which was opposed to the rehabilitation of Mr. Mukundan, does not have any option but to toe the leadership’s line, sources say.\n\nThe only solace for the detractors of Mr. Mukundan is the broad hint dropped by the party leadership that even on being rehabilitated, he would not have a prime role in the organisational affairs in the State and in all probability be assigned the chairmanship of the party organ.\n\nThe leadership is understood to have concluded that keeping a potential leader like Mr. Mukundan outside the organisational fold and giving him the freedom to snipe at it would not be prudent. But whether he will clinch the deal is what puzzles them, sources say.", 
    "section": "national", 
    "title": "Differences in Kerala BJP likely to erupt soon", 
    "subsection": "general", 
    "date": "2016-02-15"
}