{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A Scottish national, the chief executive officer of a popular fitness centre, has been arrested for allegedly raping an entrepreneur on the pretext of marrying her.\n\nFollowing a complaint by the victim, which she submitted at the Defence Colony police station on Saturday, Crispin Lamont (40), the CEO of Ozone Fitness and Spa was arrested and produced before a court which sent him to 14 days’ judicial custody.\n\nIn her purported complaint, the woman claimed that Mr. Lamont had raped her several times over two months at his residence in Defence Colony. According to her, it was through the social media website Facebook that she first came in contact with Lamont for a business deal.\n\nIt was in due course that they met to take the business deal forward for the first time and met a few more times, the two growing close to each other with the passage of time.\n\nThe complainant, a resident of Chittaranjan Park in South Delhi, added that when the two established physical relations, she had resisted but the accused promised to marry her. The woman told the police that her consent had also come under duress as she was afraid of the force he used.\n\nHowever, his behaviour changed and he started avoiding her.\n\nOver the last fortnight, he would not even answer her calls and used one pretext or the other to avoid responding to her calls. It was then that the victim, who is an entrepreneur and a management graduate, decided to approach the police.\n\nEarlier this week, the woman got in touch with the south east district police after which a case under section 376 (rape) of the Indian Penal Code was registered.\n\nThe Scottish Embassy was also informed about the incident.\n\nThough Lamont has been living in India for almost a decade now, Ozone, in a statement, said he had joined them about four months back and his services were terminated.\n\nA Scottish national, Crispin Lamont\n\nhas been living in India for almost a\n\ndecade now\n\nA Scottish National, he has been living in India for almost a decade now", 
    "section": "national", 
    "title": "Gym CEO held for rape", 
    "subsection": "general", 
    "date": "2016-02-15"
}