{
    "author": [], 
    "text": "The U.S.-based wife of Pakistan-American Lashkar-e-Taiba terrorist David Headley, one of the main conspirators of the 26/11 Mumbai attacks, and his business partner have “refused” to answer questions posed by NIA, citing a privacy clause.\n\nThe agency had approached Shazia, Headley’s wife, and Raymond Sanders, his business partner, through the U.S. Department of Justice, for helping it get answers to some of the questions related to the 55-year-old terrorist, undergoing a prison term of 35 years in an American jail, for his role in plotting the terror strikes in Mumbai and Denmark.\n\nOfficial sources said both of them “refused” to answer any questions, citing a “privacy” clause.\n\nAs per the U.S. law, since neither of them is an accused in the case, they can accept or deny requests for examination by a foreign law enforcement agency. The investigators had approached them as they feel Headley had stonewalled information about his family and that they had knowledge of his activities in India and his links with the banned Lashkar-e-Taiba.\n\nAccording to the 106-page dossier of the NIA, Headley had told the Indian investigators that they should not ask him any questions pertaining to his immediate family. “I got married to Shazia Gilani in Pakistan in the year 1999...I do not want to discuss the details of my in-law’s family as they have nothing to do with my activities...,” Headley is quoted as having said in the dossier. According to the Chicago court records, Shazia watched on TV the terror strikes unfold in Mumbai and used code words like “I am watching cartoons” to describe the 26/11 strikes. — PTI\n\nShazia used code words like “I am watching cartoons” to describe the 26/11 strikes", 
    "section": "national", 
    "title": "‘Headley’s wife, associate not answering NIA questions’", 
    "subsection": "general", 
    "date": "2016-02-15"
}