{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "INDIGO will be a replica of the two LIGO detectors\n\nWith the discovery of gravitational waves by the U.S.-based LIGO (Laser Interferometer Gravitational Wave Observatory), Prime Minister Narendra Modi may have tweeted his support for a similar detector in India but such a project is at least eight years away, said scientists familiar with the project.\n\nThis is not counting the time it will take the Central government to clear the proposal, estimated to cost around Rs. 1,200 crore, and is further premised on the project not running into environmental or State-level hurdles. Another ambitious mega-science project, the Indian Neutrino Observatory (INO) project — a proposed, underground observatory in Tamil Nadu to detect ephemeral particles called neutrinos — had been cleared by the Union government in 2015, after several years of deliberations, but has been stalled for over a year due to protests by activist groups, concerned over its environmental impact.\n\nScientists associated with the India-LIGO project (called INDIGO) say that they have, since 2009, done considerable work in identifying suitable sites in India and met officials in several States. “I have met the Chief Secretary of Karnataka and others in many States … they are quite favourable to it [hosting a detector]” said Tarun Souradeep, a key co-ordinator of INDIGO and physicist at the Inter-University Centre for Astronomy and Astrophysics (IUCAA). “Eight years is our timeline based on extensive planning … though it is possible to do it sooner too,” he told The Hindu .\n\nINDIGO will be a replica of the two LIGO detectors and many of its components have already been built and are ready to be shipped from the United States.\n\nThe project was initially to be located in Australia but, since 2011, scheduled to be located in India. At least 25 sites were considered for the detector that will, most saliently, have two L-shaped four-kilometre-long arms. “All of north India is ruled out [as a potential site] because of its seismicity, as are the deserts of Jodhpur because of sandstorms … the Deccan Plateau is best suited,” said Mr. Souradeep.\n\nThird detector\n\nOther than the benefit of having a third detector, which will likely improve the chances of spotting gravitational waves, an India detector would improve the chances of novel, exciting discoveries being made out of India and being made by Indians.\n\nIndian scientists have, over 30 years, contributed substantially to the gravitational wave discovery that was announced last week. C.V. Vishveshwara and Bala Iyer, formerly of the Raman Research Institute, Bengaluru, were among the first to solve Einstein’s equations to derive a mathematical model to explain how colliding blackholes would look and what tell-tale signals they emitted.\n\nIn later years, Anand Sengupta of the Indian Institute of Technology, Gandhinagar, developed methods to ensure that both the LIGO detectors — separated by 3,000 kilometres — have caught the same gravitational wave, and Sanjib Mitra of the IUCAA, has found ways to tell apart gravitational waves from various exotic stars.\n\nNaba Mondal, coordinator of the INO and a physicist at the Tata Institute of Fundamental Research, said the INO — being built a kilometre-and-a-half deep under the ground and also employing a novel design — was a “slightly more” challenging project than INDIGO. “The delays we have faced so far are due to unfounded objections by some activist groups. These projects are important for the future of Indian science but require lot of support from government.”", 
    "section": "national", 
    "title": "Indian gravity wave detector 8 years away", 
    "subsection": "general", 
    "date": "2016-02-15"
}