{
    "author": [
        "Piyush Pandey"
    ], 
    "text": "When most of the public sector banks are bleeding, and their combined market capitalisation has fallen below private sector peer HDFC Bank, Union Finance Minister Arun Jaitley is set to announce a series of reforms in the banking sector, including reducing the government’s holding in these banks to 51 per cent.\n\n“There are a series of banking reforms which I am likely to announce...in the days to come…,” he said at CNN Asia Business Forum 2016 at the Make in India week here on Sunday, without elaborating on the proposed reforms as he is set to announce his third Union budget on February 29.\n\nWhen told that it was time for the government to get out of the banking sector, Mr. Jaitley said: “I don’t think India has reached a state where India can pull out of the banking all together. If you see the last 3-4 decades, state-owned banks have played an important role as they reached out to areas where there was no banking. Just 20 months ago, when this government took over, we still had a situation in which only 58 per cent of India was connect to banks and 42 per cent of Indians had no bank accounts. Therefore, these banks have an important role to play in financial inclusion and geographical reach.” He said the government should not interfere in the functioning of banks.\n\n“The government is committed to zero interference and the boards of the banks have to be professionalised. The banks have to work on banking considerations, and this government is particular about the fact that banks must be allowed to do so, and you may need various kinds of reforms, including reducing the government equity. I have already announced that the government’s equity in these banks will be reduced to 51-52 per cent…”\n\nStable tax regime\n\nOn taxation, Mr. Jaitley said the tax regime had to be predictable and stable, and the government was working to bring down corporate tax rates to make direct taxes globally competitive. “Our regime is becoming increasingly able and globally competitive. Both in direct tax reforms and indirect tax reforms. We will bring down the direct corporate tax in the next four years, and when we do that we will be globally competitive. As for the indirect tax, a proper system has been introduced in Parliament: GST. It will raise India’s GDP, ease business processes and make goods and services cheaper.”\n\nMr. Jaitley praised the former Prime Minister, Manmohan Singh, for kick-starting reforms. “To be fair to him, he did a great job as Finance Minister in initiating reforms. That process stalled when he became the Prime Minister,” he said.", 
    "section": "national", 
    "title": "Jaitley hints at cutting equity in banks", 
    "subsection": "general", 
    "date": "2016-02-15"
}