{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "The 368-page report points to little improvement in literacy, health or participation in work\n\nMuslims, who form 27.01 per cent of West Bengal’s population, “constitute a very large proportion of the poor” in the State, Professor Amartya Sen said.\n\nHe was releasing a voluminous report on the condition of Muslims in West Bengal titled ‘Living Reality of Muslims in West Bengal.’\n\n“The fact that Muslims in West Bengal are disproportionately poorer and more deprived in terms of living conditions is an empirical recognition that gives this report an inescapable immediacy and practical urgency,” Prof. Sen said, releasing the report with long chapters dedicated to education, health, economic conditions and gender of Muslims of Bengal who constitute a majority in 65 of 341 blocks in the State.\n\nThe survey — the most extensive one on Bengal’s Muslims — was carried out in 325 villages and 75 urban wards from a sample of 81 community development blocks and 30 municipal bodies. The 368-page report was produced by two Kolkata-based research organisations, Association SNAP and Guidance Guild, in association with Prof. Sen’s trust, Pratichi India.\n\nLow literacy rate\n\nThough the ruling Trinamool Congress (TMC) has claimed to have played a significant role in the uplift of Muslims in Bengal since 2011, the report points to little improvement in areas such as literacy, health or participation in work. For example, Muslims have a literacy rate seven per cent lower than the State’s average.\n\n“Around five per cent of those who discontinued education admitted lack of motivation as the factor behind dropping out of school as they did not see any future benefits from education,” the synopsis said. However, the report has not named any political party or held any government institution responsible.\n\nIn the health sector, the condition of, Muslims is no better and the report observes on the basis of State government data and field-level survey that “when Muslim population percentage increases in the blocks, the hospital facilities dwindle down.”\n\nAs a result “almost double the number of hospital beds is available in blocks with less than 15 per cent population share of Muslims in comparison with blocks having 50 per cent or above of (Muslim population).” Such discrimination is underscored in nearly every page of the report.\n\nWhile in the entire report it was never said the ruling party in the State is responsible for the discrimination against the main minority of Bengal, it is expected to take political colour as it has been released only months before the Assembly elections.\n\nMuslim bodies differ\n\nOne of the most well-spread cadre-based Islamic political organisation, Jama’at e Islami-Hind (JIH), West Bengal, which does not contest elections or is affiliated to any political party, believe that Muslims of Bengal have “moderately benefited” during the TMC rule. The media and public relations chief of JIH, Masihur Rahman, underscored how the minorities have benefited during TMC’s rule, without referring to the report.\n\n“Firstly, the number of Muslim students clearing West Bengal Civil Services is much higher than in earlier years. It is 24 this year. Secondly, Aliah University, started during the Left’s time, was given a grant of Rs. 300 crore and many hostels for Muslim girls were built in the districts,” said Mr. Rahman.", 
    "section": "national", 
    "title": "Muslims in West Bengal more deprived, disproportionately poorer: Amartya Sen", 
    "subsection": "general", 
    "date": "2016-02-15"
}