{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "This culture has produced Left leaders; it has also helped the Hindutva camp\n\nPeople stand in solidarity with JNU students, demanding the release of students’ union president Kanhaiya Kumar, at Jantar Mantar in New Delhi on Sunday. —Photo: Shanker Chakravarty\n\nJawaharlal Nehru University students’ union president Kanhaiya Kumar, son of a poor anganwadi worker from Bihar, has suddenly captured national attention after being charged with “sedition.”\n\nThis has also brought the spotlight on the university’s student politics, once considered an ideal model for institutions but now being seen by many on the social media with acute suspicion.\n\nThe legal implications of the police crackdown on the campus apart, JNU student politics over the decades has been unique in two ways: its freedom from money and muscle, and its propensity to see ideological debates and dissent as an integral part of politics.\n\n“In how many universities today can children of working class people hope to contest and win an election without money being spent or goons being brought in to deter rivals?” a research scholar pursuing PhD in the School of Social Sciences wondered.\n\nJNU politics has a unique character. Campus problems apart, the debates veer around to discussing the strengths and flaws of capitalism, visions of nationalism or the rights of minorities. This culture of debate has not just produced bright leaders from the left camp like Sitaram Yechury and Prakash Karat, but also ideologically helped the Hindutva camp.\n\nThe BJP’s journals and publications department convenor Shiv Shakti Bakshi, who was RSS-affiliate ABVP’s JNU unit president more than a decade back, has a PhD from the university. Even the RSS mouthpiece Organiser ’s Editor Prafulla Ketkar is from the JNU and has an ABVP background.\n\nThe campus heats up politically as October comes, with organisations like AISA, SFI, AISF, ABVP and NSUI deciding their candidates and also their main issues for the campaign.\n\nJNU students form their own election committee, comprising largely apolitical faces, which ensures free and fair polling. In the run-up to it, all candidates have to take part in a public debate,.", 
    "section": "national", 
    "title": "Politics here is about ideas and debates, not money, muscle", 
    "subsection": "general", 
    "date": "2016-02-15"
}