{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Punjab Assembly elections are drawing near and with a high-voltage debate triggered by a controversial ‘poster’ that appeared in the digital world, Jarnail Singh Bhindranwale, the spearhead of the Khalistan movement, is back on the centre-stage of political discourse.\n\nEven as mainstream political parties such as the Congress, the BJP and the Aam Aadmi Party (AAP) are slugging it out on the poster issue, interestingly, the Shiromani Akali Dal (SAD) has refrained from direct intervention.\n\nThe controversy that started after an unattributed poster pairing Delhi Chief Minister Arvind Kejriwal alongside Bhindranwale went viral on the social media, with a message by the AAP’s State unit urging workers and people to celebrate Bhindranwale’s birth anniversary and fulfil his dream, does not seem to die down.\n\nAmid political parties accusing one another of being involved in the ‘poster conspiracy,’ Harnam Singh Dhuma, the chief of the Damdami Taksal has cautioned the AAP and other political parties to refrain from using Bhindranwale’s name to gain political mileage. The Damdami Taksal is a Sikh seminary which was headed by Bhindranwale from August 16, 1977 till his death during Operation Bluestar in 1984.\n\nNotably, it was after former Chief Minister and Punjab Congress president Capt. Amarinder Singh accused Mr. Kejriwal of following an “anti-national agenda” by attempting to evoke extremist sentiments in Punjab through the poster that the war of words broke out. BJP’s State president Kamal Sharma also launched a sharp attack on the AAP for alleged “nexus with extremists.” Mr. Kejriwal, however, denied the allegations the AAP had any nexus with Khalistanis and accused the Congress of placing photos of AAP members with Bhindranwale in the poster.\n\nPolitical observers believe the Congress sees this as an opportunity to reconnect with Hindus, who had been its traditional vote bank, but certainly slipped away over the years.\n\nAkali Dal, which has kept itself away from the controversy, however, does not seem to be interested in getting involved in the political fight between the AAP and the Congress, even as experts see it’s not the Akali Dal’s vote bank that is being affected by the furore.\n\nThe Congress, the BJP and the Aam Aadmi Party are slugging it out on the issue", 
    "section": "national", 
    "title": "Poster brings Bhindranwale back in Punjab discourse", 
    "subsection": "general", 
    "date": "2016-02-15"
}