{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "(Clockwise from top left) Police and fire brigade personnel try to douse the fire that broke out during an event to mark Make in India, in Mumbai on Sunday; Chief Minister Devendra Fadanvis at the disaster management cell at the civic body headquarers; an artist is escorted out of the venue by a policeman; and members of a production house associated with the Maharashtra Night programme react at the venue.— Photos: Prashant Nakwe, Special Arrangement\n\nNo one injured, blaze brought under control in 38 minutes; about 20,000 people had gathered to watch the event\n\nWhat was supposed to be a glitzy song-and-dance night on the sidelines of the Make in India Week turned into a disaster as a massive fire on the stage brought the festivity at Mumbai’s Girgaum Chowpatty to a grinding halt, much to the embarrassment of the Devendra Fadnavis-led NDA government. No one was hurt.\n\nMr. Fadnavis, Shiv Sena chief Uddhav Thackeray, the entire Maharashtra cabinet, and A-list Bollywood stars such as Amitabh Bachchan, Hema Malini, Aamir Khan, Katrina Kaif, and Aditya Roy Kapoor were present at the event. According to government officials, close to 20,000 people had gathered to watch the much-publicised event.\n\nAround 8.20 p.m. on Sunday, fire broke out under the stage when a troupe of dancers was performing on the stage. Police personnel immediately rushed towards the stage bringing the performance to a halt. The strong evening wind fanned the fire and within seconds the entire stage along with the strobe lights were engulfed in a billowing blaze. Sounds of explosions were heard due to the presence of gas cylinders at the venue.\n\nChaos reigned, and within minutes thousands of spectators who were spread over the beach enclosure made a quick dash for the exits and were evacuated from the spot. The Mumbai Police and Mumbai Fire Brigade took control of the evacuation and of dousing the fire respectively.\n\nFour fire tenders were at the spot and 14 more were rushed to Chowpatty, along with 10 water tankers and eight jumbo tankers. The police barricaded the area and diverted traffic. Chief Fire officer P. Rahangdale said the fire was controlled in 38 minutes. Around 8:56 pm, Deven Bharti, Joint Commissioner of Police, Law and Order, told Mr. Fadnavis, “All well.”\n\nThe Bombay High Court had denied permission for the event. However, the Maharashtra government sought the Supreme Court’s nod for the event.\n\nA visibly shaken Chief Minister called the incident “extremely unfortunate” and ordered “a comprehensive inquiry” into the cause of the fire. “It is extremely unfortunate as an important cultural event was being held. We began the evacuation process immediately. All the civilians and artists were safely evacuated. A fire audit of the event was conducted four days ago and a disaster management plan was prepared. We have ordered an inquiry into the causes of the fire, to find out if there were any lapses and if SOPs (standard operating procedures) were followed. Further action will be taken based on the probe. There was a spark under the stage and because there was cloth and wood, it spread rapidly,” Mr Fadnavis told reporters.\n\nThe incident has cast a shadow on the Make In India Week, the Centre’s big ticket investment programme for Maharashtra, though Mr. Fadnavis assured that it will not impact the event. “A comprehensive inquiry into the incidence of fire will be conducted to ascertain reasons,” Mr. Fadnavis tweeted. “All Make In India programmes will be conducted as scheduled.”\n\nActor Vivek Oberoi who was the presenter for the event said, “There was chaos even backstage. Artists were scrambling for their phones and belongings. The show was good. It is sad this had to happen. All the performers were shifted to 400 metres of the stage immediately. The evacuation process was smooth,” he told mediapersons.\n\nFire broke out under the stage when a troupe of dancers was performing", 
    "section": "national", 
    "title": "Summit will go on, says Devendra Fadnavis", 
    "subsection": "general", 
    "date": "2016-02-15"
}