{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Anbalayam has rescued 50 mentally ill persons in the city so far\n\nA 23-year-old wandering mentally ill woman, who was rescued from the streets in the city about six months ago, was restored with the family through the efforts of Anbalayam, a voluntary organisation working for the cause of wandering mentally ill.\n\nThe woman, who was called Ramya Krishnan by the Anbalayam volunteers but now identified as Alivellama, hailed from a poor family of weavers in Somendapalli in Anantapur district in Andhra Pradesh.\n\nShe is said to have separated from her husband after marriage and went missing from her parents’ home. She was found roaming on the streets near the Tiruchi Airport by Anbalayam volunteers and later accommodated at the home run by the voluntary organisation for mentally ill persons in Gundur.\n\nAs the woman spoke only Telugu, Anand, a volunteer, culled out some information about her family. As she indicated that her native was near Puttaparthi, Anbalayam got in touch with the Puttaparthi police who managed to trace her family.\n\nOn Thursday, her brother Anjaneyalu arrived here to take his sister home and amidst emotional scenes the siblings were reunited. Later, they were sent home by Anbalayam.\n\nOn Wednesday, a youth from Odisha, Guru alias Ajay, another mentally ill person, was handed over to police personnel from his home State. The youth, aged about 30, was rescued near the Railway Junction in the city by Anbalayam volunteers in 2014, according to T.K. Senthil Kumar, founder, Anbalayam. His family was traced through the efforts of the police as information about him was sent to the Tamil Nadu State Crime Records Bureau to be included in the list of missing persons.\n\nMr. Senthil Kumar said nearly 50 wandering mentally ill persons rescued from the city have been reunited with their family over the past few years.", 
    "section": "national", 
    "title": "23-year-old woman reunited with her family from A.P.", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}