{
    "author": [
        "S Senthalir"
    ], 
    "text": "“The official gazette published by the French government in 1935 and 1959 describes ‘Mottai Thoppu Kulam’ as Poramboke and Water Pond. However, the officials have refused to take this into consideration. During a resurvey in 1972 the officials had erroneously recorded this land as a private property belonging to Ratnasabapathy,” said G.Venkatasubramaniam, secretary, Mottai Thoppu Kulam Protection Association.\n\nThe Dalit families who worked as agricultural labourers on the land owned by Mudaliars and Chettiars till late 20th century have used the pond to bathe, wash cattle, clothes and play while they were growing up. As urbanisation slowly set in, the landowners sold their agricultural lands in the 1970s and were converted into plots. Slowly, sprawling apartments came up on this land which once grew once paddy and coconut trees.\n\nHowever, the families of agricultural labourers continued to live in that place and took up menial jobs for survival. Nearly 75 per cent of the women from this area are domestic workers.\n\n“I started work as a cook in a hotel in 1973. Some went as daily wage labourers. Only three persons from that generation are alive,” says G.Velayudham, a resident of Annamalai Nagar.\n\nReminiscing about the past, 44-year-old P.Mala says: “We used this water to soak coconut fronds palm leaves and decorate chariot for the annual Nagamuthu Maariamman Temple festival. This is also a place where we immerse the ashes after the funeral rites. This is a sacred pond to the families who all those who have long been associated with this land here.”\n\nThe elders in Annamalai Nagar have vibrant memories from the past. “We used to play and bathe there. The pond was vast and it never dried in any season. There was a canal that passed closer to the pond. Starting from Madupatty near Krishnanagar, the canal passed through the fields of Annamalai Nagar to Venkata Nagar. It was called the Kazhutha Paadai,” said Velayudham.\n\nThis path was used by the dhobi to carry the clothes, wash it and then bring back it to their clients. “Now, there is no trace of this pathway or canal. Buildings have been constructed encroaching upon those canals, agricultural lands and pathways. Nothing of the past remains now, except for this pond,” added Venkatasubramaniam.\n\nDuring a resurvey, officials erroneously recorded this land as a private property", 
    "section": "national", 
    "title": "A pond with a rich past", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}