{
    "author": [
        "B Kolappan"
    ], 
    "text": "A cross-section of DMK’s second line leaders was crestfallen on Thursday over the decision of actor and DMDK founder Vijayakant not to align with it in the forthcoming Assembly polls. But the party, contrary to popular perception, takes solace by believing that the anti-AIADMK votes will come to its kitty and will give it an advantage.\n\n“Of course, we are upset and it will take a few days for our cadres to recover from the disappointment. But the DMDK’s decision also has ended our agonising wait. At least now he has revealed his decision. We have plenty of time before us and we can go ahead with our preparations for the polls,” said a district secretary of the DMK from north Tamil Nadu.\n\nThough Mr Vijayakant’s decision has created a situation akin to the one that prevailed in the 2006 Assembly election, the DMK camp today has none of the constituents who faced the elections along with it then, barring the Congress.\n\nThe DMK had contested in minimum numbers of seats in its electoral history in 2006 in the company of the Congress, PMK, VCK and the Left parties.\n\n“We are unable to understand how Vijayakant would make a difference with his limited vote share. It would have benefited both of us had he decided to sail with us. He can play only spoilsport,” said another DMK district secretary.\n\n‘Advantage DMK’\n\nA senior DMK leader argued that voters disillusioned with the ruling AIADMK and those who are neutral and looking for a change would favour only the DMK.\n\n“History has proved that anti-DMK votes would go to the AIADMK and vice versa. Others cannot take advantage of the situation,” a senior leader claimed.\n\nWelcoming Mr Vijayakant’s decision, CPI (M) state secretary G. Ramakrishnan, argued that the DMK was wrong in believing that it would garner a majority of the anti-incumbency votes.\n\n“The political climate of Tamil Nadu has changed. The DMK and the AIADMK alternatively got elected in the absence of a viable alternative. Now, the People’s Welfare Front (PWF) has stepped in to fill the gap and people will prefer us,” he claimed.", 
    "section": "national", 
    "title": "Agonising wait is over, says a crestfallen DMK", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}