{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Wrapping up the last session of the 13{+t}{+h}Assembly, Chief Minister N. Rangasamy on Thursday claimed that his government implemented all welfare programmes to the people in spite of financial constraints faced by it. He said, heeding the advice, suggestions and demands of the MLAs, the government executed all programmes during preceding years and implemented all welfare programmes promised during elections in spite of government facing financial constraints.\n\n“We were paying adequate attention in getting more funds from the Centre and more revenue to the UT exchequer without taxing the people,” said Mr. Rangasamy while listing out measures to improve education, medical facilities and infrastructure.\n\nHe also added that the government has been completing works recommended by MLAs under constituency development funds without any complaints.\n\nMr. Rangasamy recalled that though there was delay in getting fund to render financial assistance to rain-affected people, the government has managed to extend such assistance in due time. He said it was the wish of government to render assistance to 6000 people who were left out in Karaikal. Stating that the government accorded high priority to extend super specialty medical care to the people, he also pointed that the steps have been taken to commence a branch of Jipmer in Karaikal.\n\nThanking the MLAs for their support in running the House, the Speaker V. Sabapathy said the 13{+t}{+h}Assembly had 10 sessions during last five years and has sittings in 68 days. Its business transacted more than 283 hours and 55 minutes. Members raised 2,752 questions and of them 2,340 were answered during question hour. Mr. Sabapathy said he was able to perform smoothly with the cooperation of MLAs from all parties and thanked the Chief Minister for having confidence in him and giving an opportunity to serve as the Speaker.\n\nThough they face-off in the Assembly elections in a few weeks, unusual bonhomie was witnessed among the MLAs as they exchanged pleasantries while leaving the House.", 
    "section": "national", 
    "title": "All welfare schemes implemented: CM", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}