{
    "author": [
        "L Renganathan"
    ], 
    "text": "Video of farmer being beaten up by police for loan default goes viral\n\nIn an ironical coincidence, on a day the Supreme Court was informed that industrialist Vijay Mallya had flown out of the country defaulting loans of over Rs.9,000 crore, video footage of a small farmer in Thanjavur, G. Balan (40), being publicly thrashed by the police for defaulting two instalments of a loan availed from a private bank to purchase a tractor went viral. The incident occurred on March 4 but became public only on Wednesday and the National Human Rights Commission (NHRC) has taken cognisance of the same.\n\nBalan’s family in Cholagankudikadu village in Thanjavur district is distraught. Initially, Balan had told his family members that police personnel took him to the police station regarding the tractor loan he had availed from Kotak Mahindra Bank and that they had let go of him after wresting an assurance that he would pay up the arrears soon. However, when they saw the video footage of Balan’s brutal assault by the police and the bank’s agents, which went viral on social media and mobile messaging platforms, his family got to know the full truth.\n\nOn Thursday, the National Human Rights Commission (NHRC), taking suo motu cognisance of the incident, issued notices to the Tamil Nadu Chief Secretary and the Director General of Police to explain why the action was taken.\n\nBalan had borrowed Rs.3,80,430 in 2011 from the Thanjavur Branch of the Kotak Mahindra Bank. He has so far repaid in six half yearly instalments of Rs. 68,543 each, a sum of Rs. 4,11,200 and needed to pay only two instalments when crop failure in successive seasons hit him like other delta farmers, forcing him to default on repayment.\n\nAccording to him, the bank’s agents harassed him to pay the money. On March 4, around a dozen agents of the bank along with Inspector of Police, Pappanadu, Kumaravel, and some other police personnel intercepted Balan at his field, assaulted him and took forcible possession of his tractor — all of which were recorded unknown to others and later shared on WhatsApp.\n\n“I had never previously borrowed any money from banks but I rue the day I gave in to the sustained three-month pestering by the agents of Kotak Mahindra Bank agents and took a loan,” claims Balan. “I was required to pay just two more instalments when I got beaten up,” he says, adding that he has preferred a petition with the Thanjavur district administration seeking action against those who assaulted him. “In availing the tractor loan, I lost my money first and now my honour as well as peace of mind,” he says.\n\n“My son took a loan for buying a tractor. Now look at what fate has befallen him. A hard worker, Balan hid the fact that he was beaten up and dragged to the police station and simply said that he went to the station to clarify things lest I get worried. We set store by honour but the bank men and the police have thrashed not just Balan but our honour and respect,” rues his mother Marikkannu at their house in the village, which incidentally lies next to the hometown of State Agriculture Minister R. Vaithilingam.\n\n“In all my 75 years I have not seen such a treatment meted out to a farmer,” Balan’s father Govindasamy notes. Wondering whether his son had deprived anyone of anything to be treated like a criminal, Mr. Govindasamy wryly says that though they had promised the bank to repay soon after harvest, the staff and the police had acted in collusion to assault him. “Successive crop failure and delay in issuing cutting orders or sugar cane coupled with brief illness forced him to default on repayment,” points out Mr. Govindasamy, saying that he will repay the loan.\n\nMeanwhile, taking a stern look at the incident, the NHRC has issued notices to the State Chief Secretary and the DGP. Stating that such form of forcible recovery by itself amounted to human rights violation and compounded the nature of the offence committed by those who assaulted the defaulting farmer. The officials have been asked to file their report in two weeks time.\n\nJustice D. Murugesan, Member, NHRC observed that it was common knowledge that private sector banks and financial institutions, to recover loans advanced to individuals and particularly farmers, used police to brutalise the defaulters. The intemperate and immoderate attitude of the bank officials and the involvement of the police in such forcible recovery was prevalent in several parts of the country, he noted in a release.", 
    "section": "national", 
    "title": "Assault of farmer: NHRC notice to Chief Secretary, DGP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}