{
    "author": [
        "Special Correspondent", 
        "M Soundariya Preetha"
    ], 
    "text": "Elected office-bearers\n\nP.B. Balaji, director of Chandran Poultry Farm, has been elected chair of Young Indians (Yi), Coimbatore chapter, for 2016-2017. Prasanna Krishna, managing director of Career Zone Consulting, has been nominated co-chair of the chapter.\n\nPassport mela\n\nThe Regional Passport Office will organise a passport mela on March 19 here for residents of Coimbatore, Salem, Erode, Namakkal, Tirupur and the Nilgiris. Applications for issue of ordinary passport under normal course will be accepted at the camp. Applicants who have registered their applications online and obtained the valid ARN can take appointment on March 19. Appointments will be opened on March 14 at 1.30 p.m. Tatkaal, walk in applications, and issue of police clearance certificate applications will not be accepted.\n\nInsurance products\n\nCoimbatore Consumer Cause has urged the public to inform it if any bank compels customers to buy insurance policy to open accounts or to get bank loans or any other loans or if amount is debited from the account without the consent of the customers.\n\nAccording to a press release by Coimbatore Consumer Cause, Reserve Bank of India has also assured to take action against forced or misguided selling of insurance products by banks.\n\nThe consumer organisation had written to the Chairman of State Bank of India in this regard, and, according to the press release, the bank has replied that it has issued instructions in this regard to all its offices.\n\nElectricity bill\n\nThe Tamil Nadu Generation and Distribution Corporation has clarified that it has not authorised any private person or agency to collect money from the residents for payment of consumption charges.\n\nIt is collecting consumer charges at all the distribution section offices and has enabled the bill payment facility through bank collection counters of Tamil Nadu Mercantile Bank, City Union Bank, Lakshmi Vilas Bank, and CSCs of TACTV, Elcot and post offices. It has also enabled online payment.\n\nHence, consumers should not pay the amount to any private person or agency, according to a press release from Tangedco.\n\nProgramme\n\nKGK Industries and ABK-AOTS Dosokai will conduct a programme on “The Daily Work Management”, one of the fundamental tools in Japanese management techniques, on March 12.\n\nThe training will be held at KGK-TI, SIDCO. For details, contact: 8220051333\n\nTraining\n\nThe Department of Lifelong Learning and Extension of Avinashilingam University will offer certificate courses (six months each) and short term courses in the following areas soon: apparel designing, computer application and accounting software, herbal beauty care and web page designing (certificate courses) and computer skills, beauty skills, textile skills, painting and needle art, food art (short-term courses). For details, contact: K. Vasantha, Head of the Department of Lifelong Learning and Extension, Avinashilingam University, Mettupalayam Road, Coimbatore – 641043. Telephone: 0422-2449715, email:lll_adu@yahoo.in", 
    "section": "national", 
    "title": "Attn Desk: MUST today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}