{
    "author": [
        "K Lakshmi"
    ], 
    "text": "There are over 1,200 companies in the State at present; many are said to be misusing the ISI mark\n\nIn an attempt to stop the distribution of packaged drinking water of poor quality, the Bureau of Indian Standards (BIS), southern region, has intensified its drive against units that are misusing the ISI mark.\n\nIn the last two weeks, teams of BIS officials have seized several bubbletops of 20-litre capacity at units in Navalur, Chennai, and Walajah, Vellore. At least ten raids are conducted in a year, based on the complaints received from consumers.\n\nIn the last few years, the number of units has risen considerably as more and more residents prefer packaged drinking water. There are over 1,200 units in the State at present. Of this, nearly 400 are found around Chennai.\n\nOver the last two to three years, there has been an increase of 10 to 20 per cent in the number of applicants for licences to operate packaged drinking water units, according to sources with the BIS. Most of the new units applying for licences are found on the fringes of the city. Of the nearly 130 applicants every year, about 50 are received to start a unit near Chennai.\n\nOfficials of the BIS said that the teams had found that the ISI mark was either being misused after expiry of licence or the licence number was not being displayed. In one case, manufacturing units distributed water using another unit’s licence number.\n\nConsumers must check for the ISI mark accompanied by licence number and IS standard on the bubble top. They may also crosscheck the list of manufacturers with their licence numbers on the website. People must also be aware of valid dealers, they said. The BIS teams also periodically lift samples from the market to assess the quality; field visits have also been scaled up.\n\nDemand increases\n\nWith the demand expected to go up in summer months, the Greater Tamil Nadu Packaged Drinking Water Manufacturers Association plans to check allegations of packaged water being of sub-standard quality.\n\n“We have received information that water from lorries is filled in empty containers and brand names are misused. These malpractices are bound to increase in the coming months,” said A. Shakespeare, the association’s founder. At present, Chennai and its suburbs are consuming 1.3 crore litres of packaged drinking water every day. Of these, bubbletops contribute to nearly 90 per cent of packaged drinking water consumption.", 
    "section": "national", 
    "title": "BIS steps up raids on water units", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}