{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Former Union Finance Minister P. Chidambaram on Thursday termed the Union Budget 2016 ‘a wasted opportunity.’\n\n“This is the third budget of the current (BJP) government. The third budget of any government is a crucial milestone and was looked with great anticipation. But it turned out to be a budget of ‘Suit Boot Sarkar’ with a farmers’ turban on its head,” said Mr. Chidambaram, addressing students of Loyola Institute of Business Administration here. Mr. Chidambaram, an alumnus of Loyola College, said that it was after 30 years that one party had an absolute majority in the Lok Sabha. “Here was a great opportunity that one should have grabbed with both hands and made deep and broad structural reforms,” he said, adding that such a privilege was not available to him or Manmohan Singh.\n\n“We were Finance Ministers of a minority government and we had to watch our step very carefully. Because, if any Bill was defeated the government would have to resign,” he said.\n\nCommenting on the state of the country’s economy, he said there was a demand constraint. He pointed out that the economy was said to be growing at 7.4 to 7.6 per cent during 2015-16, but industries including steel, cement and metal were in the dumps. Not just industries, there was an acute rural distress and if rural demand was not boosted, aggregate demand would not go up.\n\nAccording to Mr. Chidambaram, the next big concern was exports. “For the first time for fourteen straight months, exports have recorded negative. This has never happened before, which means there is no external demand,” he said.\n\nThe last factor affecting the economy was languishing private investments. He told the students that there was nothing in the budget for the export sector and nothing to revive private investments. “This is the subject you should focus in your classrooms,” he said.\n\nThe former Union Minister said the BJP government played Santa to farmers just to get away with the ‘Suit Boot Sarkar’ tag. The total allocation for agriculture and farmer’s welfare was Rs. 35,984 crore, an impressive number.\n\n“The current year allocation is Rs. 15,809 crore and how will this government pull the rabbit out of the hat where there is no rabbit in the first place,” he asked.\n\nHe explained that Rs. 15,000 crore was found in the Finance Department as interest subsidies for loans given to farmers. “What the Finance Minister did was take this Rs. 15,000 crore and put it in the Agriculture Department and, therefore, he gets this impressive figure of 35,984 crore. If you minus the 15,000 crore, the number is 20,984 crore.”\n\nThis budget, which was a wasted opportunity, would prove a setback in the long run. “The price will be paid by succeeding generations like you,” he told the students.\n\nSays economy is in the dumps, exports a matter of big concern", 
    "section": "national", 
    "title": "Budget a wasted opportunity: Chidambaram", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}