{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "With DMDK deciding to go it alone, TN likely to face multi-cornered Assembly polls\n\nPutting to rest months of speculation, Desiya Murpokku Dravida Kazhagam (DMDK) president Vijayakant, on Thursday, publicly announced that his party will face the Assembly elections alone, rejecting repeated invitations from the DMK for a poll tie-up.\n\nWith this dramatic announcement at the party women’s wing meeting here late in the evening, Tamil Nadu in all probability would witness a six-cornered poll battle involving the ruling AIADMK, DMK-Congress, DMDK, PMK, PWF and BJP. Mr. Vijayakant said too many rumours had been spread about the party’s position on alliance over the last three months. “I will contest alone. I thank those who invited me to their alliances,” he declared. Denying that he had negotiated with any political party, as reported in sections of the media, he said, “Some said crores of money had changed hands. What do you say now? I reiterate that we will contest this election alone.” A seven-member committee headed by party youth wing secretary L.K. Sudheesh to finalise the candidate list for all 234 Assembly constituencies. The party also released its manifesto on the occasion. However, towards the close of the meeting, Mr. Vijayakant’s wife and party women’s wing secretary Premalatha appealed to parties that shared the aim of the DMDK should talk to Mr. Vijayakant.\n\nLaunched in September 2005, the DMDK contested the 2006 Assembly elections alone and secured over 8 per cent vote share. This went up to 10.3 per cent in 2009 Parliamentary elections. In 2011, the party aligned with the AIADMK and won 29 seats, making it the main opposition in the Assembly.\n\nAIADMK, DMK attacked\n\nEarlier, Ms. Premalatha lashed out at both the AIADMK and the DMK, accusing them of encouraging corruption in administration.\n\n“The DMDK was formed as an alternative to the AIADMK and the DMK. It is true we aligned with the AIADMK in 2011. But the moment our leader realised the government was initiating anti-government policies, he stormed out of the alliance. Our aim is to drive the two parties out of Tamil Nadu,” she added.\n\nMs. Premalatha also took on the media for publishing what she called “plants” the DMK had floated.", 
    "section": "national", 
    "title": "‘Captain’ Vijayakant to steer his own ship", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}