{
    "author": [], 
    "text": "RELIGION\n\nMahabharatham: Rama Dikshithar, Sri Krishna Gana Sabha, 6.30 p.m.\n\nGita: Ramana Swaroopananda, R-Block, 47/15. 15{+t}{+h}St., Anna Nagar, 6.45 p.m.\n\nVetri Tharum Mandhirangal: V.S. Karunakaran, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.\n\nThirupallandu: Venu Raza Narayaan, Varadaraja Perumal Thirukoil, Tana St., Purasawalkam, 7 p.m.\n\nThayumanavar: D. Gnanasundaram, Sri Balasubramania Baktha Jana Sabha, T.T.K. Salai, Royapettah, 6.30 p.m.\n\nVedanta Treatise: R. Aravindan, Narada Gana Sabha, T.T.K. Rd., 6.45 p.m.\n\nIrai Anbu: S. Kumaraswamy, Valeeswarar Temple, South Mada St., Mylapore, 7 p.m.\n\nVivekanandarin Bhakti Yogam: Apavargananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nCULTURE\n\nKalakshetra Foundation: Inauguration of conference and festival ‘Baani 2016’, Rukmini Arangam, Thiruvanmiyur, 8.45 a.m.\n\nGENERAL\n\nConsulate General of Japan: Signing ceremony for extending grant to two NGOs, 5-B, Chittaranjan Rd., Teynampet, Noon\n\nRajan Eye Care Hospital: World Glaucoma day celebrations and public awareness programme on glaucoma, Vidyodaya 2{+n}{+d}St., T. Nagar, 11 a.m.\n\nRoja Muthiah Research Library: Lecture on ‘The ‘Lost’ Bengali – Sir Albion Banerji and the shaping of relations between the princely state of Mysore and the Madras Presidency 3{+r}{+d}Cross Rd., CPT Campus, Taramani, 5.30 p.m.\n\nT.T. Ranganathan Clinical Research Foundation: Distribution of certificates, 17, 4{+t}{+h}Main Rd., Indira Nagar, Noon.\n\nIndian Institute of Technology, Madras and Incubation Cell: ‘The Tech Saloon’ – talk on innovation, IIT Madras Research Park Auditorium, 6.30 p.m.\n\nValliammai Engineering College: Lecture on ‘Ethical hacking and cyber security’, Kattankulathur, 9 a.m.\n\nEaswari Engineering College: Project Expo ’16 and cultural festival, Ramapuram, 10.30 a.m.\n\nSri Sai Ram Engineering College: Lecture on ‘Application of lean and six sigma in manufacturing industries’, West Tambaram, 10 a.m.\n\nRajiv Gandhi National Institute of Youth Development: Inauguration of seminar on ‘Trends in Counselling Across Life Span’, Sriperumbudur, 10 a.m.\n\nT.J. Institute of Technology: Seminar on software testing and opportunity for engineers, Karapakkam, 10.30 a.m.\n\nS.A. Engineering College: Blood donation camp, Poonamallee – Avadi Main Rd., 10 a.m.\n\nKCG College of Technology: Women’s day celebrations, Karapakam, 1.30 p.m.\n\nAMET Business School: Inauguration of ABS Management Fest 2016 ‘Fest for the Prime’, ECR, Kanathur, 9 a.m.\n\nSRM Ramapuram B – School: Inauguration of management meet ‘Quest ‘16’, Ramapuram, 9.15 a.m.\n\nPrajnya: Talk on ‘Sexism in Media’, Asian College of Journalism, 5 p.m.\n\nLoyola College: Inauguration of programme o ‘Padaippaaligalin Nokkum Pokkum’, Nungambakkam, 9 a.m.\n\nD.R.B. Calavala Cunnan Chetty’s Hindu College: Graduation day, Pattibiram, 10 a.m.\n\nSir Theagaraya College: Valedictory function of cultural programme, New Washermenpet, 10.30 a.m.\n\nPatrician College of Arts and Science: College day, Canal Bank Rd., Gandhi Nagar, Adyar, 10 a.m.\n\nThe Hindu Theological HSS: Annual day, Mint St., Sowcarpet, 4.30 p.m.\n\nMadhuram Narayanan Cetnre for Exceptional Children: Programme on nutritional awareness ‘Nutrifest’, Prakasam St., T. Nagar, 11.30 a.m.\n\nArappor Iyakkam: Release of citizen’s model bill for Lokayukta, Rajarathinam Kalaiarangam, R.A. Puram, 11 a.m.\n\nNarcotics Anonymous: Meeting, Sangarsh Group, Fatima Church, United India Colony, Kodambakkam, 7 p.m.\n\nAl-Anon: Meetings, Sinagaram Pillai Boys HSS., Villivakkam; A.G. Church, Sivagamipuram, Thiruvanmiyur; Madurai Siddha Ayurvedha Maruthuva Nilayam, Avadi; and CSI Emmanuel Church, Vadapalani; and Kevin School, Royapuram, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Kevin School, Royapuram; Singaram Pillai Boys HSS., Villivakkam, Kesari HSS., T. Nagar; C.S.I. Zion Church School, Chintadripet; Assembly of God’s Church, 100 ft. Rd., Arumbakkam; St. Fathima Church, Velachery Rd., East Tambaram; Magadalona Mariyal Church, Ezhil Nagar, Poonamallee; C.S.I. Peters Church, Vyasarpadi; A.G. Church, Sivagamipuram, Thiruvanmiyur; St. Soosai Church, Ennore; Madurai Siddha Ayurvedha Maruthuva Nilayam, Avadi; and Chennai Corporation Public Health Centre, Adambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}