{
    "author": [
        "Staff Reporter"
    ], 
    "text": "‘The drain used to carry run off water from Bommanapalayam and Balaji Nagar’\n\nDebris and extended entrance pathways of a few houses at Gurusamy Nagar in Vadavalli (Ward 17) have closed a storm water drain that has been in existence since the layout was developed in 1985.\n\nThis has troubled a few residents of the area, more particularly Vasantha Kumari Nathan, who has been running from pillar to post petitioning the officials in the Coimbatore Corporation to district administration.\n\nRainwater\n\nMr. Nathan charges his neighbours with closing the drain that used to carry rainwater and sewage to a channel that runs along Thondamuthur Road.\n\nThe drain used to carry run off water from Bommanapalayam and Balaji Nagar, he adds.\n\nAfter the residents closed the drain, he had petitioned the then district Collector M. Karunakaran, who in 2011 ordered the debris to be removed and drain to be restored to its original condition.\n\nMison Mathew, a former president of the Residents’ Welfare Association, says that the drainage provided by the layout developer has been in use for a very long time and helped in the disposal of rain water.\n\nBut now the drain is partially closed. One of the residents who have constructed the extended pathway over the drain says that it has been so for the past four years.\n\nThe woman who identified herself as Ms. Udhayashankar also says that she was forced to close the drain because her neighbours on both sides had also closed the drain.\n\nLalasan, who runs the Pioneer Packaging Systems and Services, says that in the first place, there was no drain to be closed.\n\nAsked about the drain that is visible a few metres away from his house, he says that there was no water flowing so he closed it.\n\nGroups\n\nCorporation officials say that the open drain has been a bone of contention among the residents, who have formed groups – one opposing the drain and another seeking its restoration.\n\nTo tide over the problem, the corporation has proposed a drain with its slope on the northern side but the residents, again, are opposed to it. The proposed drain will carry rain water from Gurusamy Nagar and a few other areas and have its disposal point at the natural drain in Curio Garden.\n\nBut then the residents have objected to it in writing and that is the reason that Corporation has been unable to take up the work.\n\nThe Corporation Council approved of the work more than three months ago.", 
    "section": "national", 
    "title": "Closed drain troubles residents in Vadavalli", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}