{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Doctors list steps to prevent kidney diseases in children\n\nThis World Kidney Day, the stress is on preventing kidney diseases in children. As the theme goes – “Act early to prevent it”, the need is to pick up symptoms early and get prompt treatment.\n\n“Many times, children come for treatment when the kidney has reached end stage disease as the symptoms would have been missed. Hence, there is a need for awareness for parents, children and paediatricians to pick up the symptoms,” Dr. Indira Agarwal, Professor and Head of Paediatrics and Paediatric Nephrology, Christian Medical College (CMC), Vellore said.\n\nOn Thursday, the departments of Nephrology and Paediatric Nephrology of CMC organised an exhibition to create awareness about prevention of kidney diseases, a puppet show, and health screening for adults and children.\n\nKidney diseases in children can be congenital and acquired, she said, adding that ante natal ultrasound scan was the best to pick up congenital conditions. “Else, the symptoms such as dribbling of urine can be picked up at birth. Often, symptoms are missed by parents, and also by paediatricians,” she said.\n\nWhen kidney diseases are acquired later due to genetic/immunological changes or infections, the symptoms in children included swelling of face and limbs, decreased urine, blood in urine, blood pressure and growth failure, Dr. Agarwal said.\n\n“If a child is not growing well, it may be a sign of kidney disease, and should be evaluated,” she said.\n\nSome of the common kidney diseases in children are nephrotic syndrome, acute nephritis, acute renal failure and chronic renal failure, while urinary tract infections and reflux were also very common.\n\nThere are simple measures that can prevent kidney diseases. Doctors said children should drink adequate water as it will cleanse the kidneys. They should eat healthy diet as constipation worsens some symptoms of kidney diseases.\n\nEarly diagnosis, doctors say, can prevent complications of kidney diseases. For end stage kidney diseases, patients have to undergo dialysis and later transplant.\n\n“This is more difficult to do in children. A five-year-old boy received a kidney from a cadaver donor three months ago. There is hope for children but we need to pick up symptoms early so that they can be treated on time,” she insisted.\n\nIn the run up to the World Kidney Day, competitions were organised for nurses and technicians. Doctors visited four schools in Vellore and Dharmapuri to educate students on symptoms of kidney diseases, and a general health check up was also done. An interactive session for children with kidney diseases was also conducted.\n\nAmong others, Raju Titus Chacko, associate director and V. Tamilarasi, professor and head, Nephrology dept., were present at the inaugural session.", 
    "section": "national", 
    "title": "‘Early detection key to cure’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}