{
    "author": [
        "Special Correspondent"
    ], 
    "text": "J. Balachander, Medical Superintendent of Jipmer (centre) at the inaugural session of World Kidney Day observance.Photo: Special Arrangement\n\nNephrologists have stressed the importance of propagating awareness on lifestyle risks that contribute to kidney diseases and the importance of early detection, as part of World Kidney Day observance on Thursday.\n\nThe theme of the observance hosted jointly by the International Society of Nephrology (ISN) and the International Federation of Kidney Foundations (IFKF) is “Kidney Disease & Children. Act Early to Prevent It.”\n\nThe department of Nephrology, Jipmer conducted a continuing medical education programme to mark the occasion.\n\nAccording to Dr. Sreejith Parameswaran, Head of the Department, Department of Nephrology, kidney disease affects millions of people worldwide, including children. A majority of kidney diseases stems from abnormal and unhealthy lifestyles acquired as a result of modern lifestyle. Some of the kidney diseases in children are treatable if diagnosed at an early stage, whereas some diseases cannot be cured.\n\nAcute kidney disease (AKI) is a serious condition that develops suddenly, often treatable if patient receives appropriate medical management, but it can also lead to permanent kidney damage in the future, Dr. Parameswaran said.\n\nChronic kidney disease (CKD) doesn’t disappear with treatment and tends to worsen over time eventually leading to kidney failure which needs dialysis or kidney transplant. CKD in children can be caused by birth defects, hereditary diseases, infections, nephrotic syndrome, systemic diseases, urine blockage or reflux.\n\n“Children are often vulnerable to kidney diseases in future resulting from lifestyle related diseases during early childhood and adolescence. It is vital to disseminate information regarding the risk of kidney diseases, early detection and to facilitate a healthy lifestyle starting right from birth and continuing up to old age,” he said.\n\nEarlier, inaugurating the programme, Dr. J. Balachander, Medical Superintendent of Jipmer, said Jipmer is offering full range of nephrology care to children through the departments of Paediatrics and Nephrology.\n\nThe services provided include care for childhood glomerular diseases, dialysis services for AKI and CKD, Continuous ambulatory peritoneal dialysis and live and deceased cadaveric kidney transplantation.", 
    "section": "national", 
    "title": "Experts blame lifestyle changes for kidney diseases", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}