{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The accident occurred when the van driver overtook the car\n\nFive persons, including four women, died and 24 others were injured in a road accident involving a van, a private engineering college bus, and a car on the Tiruchi–Salem Main Road at Manjakorai near here on Thursday.\n\nThe fatal accident that occurred at around 7.45 a.m. on the State highway led to traffic hold up for more than an hour.\n\nA group of 13 persons on board the van were on their way to Velankanni from Salem when the accident occurred. Police said the van driver overtook the car proceeding ahead and collided head-on with the private college bus that came in the opposite direction at Manjakorai.\n\nWithin no time, the car dashed against the tempo traveller van from behind. In the impact of the collision, the tempo traveller veered and went off the main road and fell in a water body. Five passengers on board the van died on the spot in the collision and the vehicle was completely damaged in the impact.\n\nPolice gave the names of the dead as S. Ramraj (24) — the van driver, S. Varsha (55), S. Maheswari (58), M. Dharini (25), and R. Mahalakshmi (40) — all from Kakathampatti in Salem district.\n\nThe front portion of the car, which was proceeding to Nagore, and its windscreens were damaged in the impact. The front portion of the bus, in which 33 students were travelling, suffered damage.\n\nThe occupants of the car; five on board the bus and eight others in the van were injured in the collision. Police personnel rushed to the spot to clear vehicular traffic movement that got disrupted owing to the accident.\n\nSuperintendent of Police E.S. Uma and Transport Department officials inspected the spot.\n\nPolice said many of the injured were treated as out-patients. The Vathalai police has registered a case.", 
    "section": "national", 
    "title": "Five die as van, bus and car collide near Gunasheelam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}