{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "The next time your phone gets blocked without any request to the mobile operator from your side, make sure you inform your bank to block any transaction. Also, take utmost care of your PAN card. These are lessons a city businessman learnt the hard way — after losing over Rs. 7.5 lakh recently.\n\nBhushan Goyal, the proprietor of the ice cream parlour Milky Way, has lodged a complaint with the Central Crime Branch (CCB) of the city police after he fell prey to a gang.\n\nCyber cell investigating\n\nThe case has been transferred to the cyber cell.\n\n“On February 23, my phone stopped working and I thought it was a signal issue. I lodged a complaint with the mobile operator the next day and found that someone had been issued a duplicate SIM card. After getting a duplicate card myself, I saw messages from the bank informing me that Rs. 7.5 lakh had been transferred from my account with the Indian Bank. My number was used to get the OTPs sent by the bank,” said Mr. Goyal.\n\nSoon after this, he enquired with the bank and also rushed to the Aircel office in Aynavaram to check how this had happened.\n\nImpersonation\n\nHe found that on February 23, a man impersonating him had informed the staff that he had lost the mobile phone, got the number blocked and took a duplicate SIM.\n\n“Through the CCTV footage, I found a man much younger than me approaching the counter with the letterhead of my parlour. He even had a PAN card with my details, but the photo was his. The staff failed to check the age. It is surprising how the staff gave the duplicate SIM card without any police FIR,” added Goyal.\n\nMeanwhile, enquiries the CCB made with the bank revealed that the money was transferred into five accounts in Kolkata.\n\nTransfers from\n\nNigeria, U.S.\n\n“But the IP addresses from where the transfers were carried out were in Nigeria and the U.S.” he claims.\n\nHe claims that neither he nor his accountant received any ‘vishing’ calls. “\n\nIt is surprising how he got the details of my PANs card and account. I don’t want this to happen to anyone else. I hope the CCB finds and arrests the gang fast before they cheat others,” he added.\n\nThey got his number blocked and took a duplicate SIM\n\nin his name", 
    "section": "national", 
    "title": "Gang appropriates businessman’s number, cheats him of Rs. 7.5 lakh", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}