{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Tamil Maanila Congress president G.K. Vasan has said that Gas Authority of India Limited (GAIL) and Government of India should hold talks with farmers and eradicate any fear about the gas pipelines passing through their fields.\n\n“The interactions should happen in all the seven districts in the State through which the gas pipeline planned by GAIL to take the natural gas from Kochi to Bengaluru pass, before the work begins. If the court and Central Government want to insist on laying pipelines, the work can be taken up. But, GAIL at least should try to understand the realities of the situation and avoid laying the pipelines through the middle of any farm area against the interest of the farmers”, he said while chatting with The Hindu on the sidelines of a function at Kangayam.\n\nThe party was of the view that it was advisable to lay the gas pipelines alongside the highways but not through the farm lands. Sticking to the earlier stance that his party will take decision on alliances only after March 15, Mr. Vasan said that the party’s manifesto would always focus on development of agriculture, health, industry and higher education, the four sectors which were pillars on which the economical and social prosperity of the State need to be build upon.\n\nMr. Vasan called upon the Central Government to increase the support price of copra from the present Rs 59.50-a-kg to Rs. 110-a-kg and directly procure the entire produce from the farmers, in order to help the coconut growers to come out of the distress.\n\nSimilarly, TMC wanted the government machinery to open avenues to export milk powder so as to avoid stagnation of milk powder within the country due to glut in the market.\n\nOn cash seizures by election officials, Mr. Vasan was of the view that the officials should not unnecessarily harass small traders, farmers and people who go to purchase ornaments for family functions.", 
    "section": "national", 
    "title": "Gas pipeline: TMC wants GAIL, Centre to allay fears of farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}