{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Calls Special Judge’s verdict a ‘brilliant analysis’ of corruption case\n\nThe Karnataka High Court overturned the trial court judgment convicting Tamil Nadu Chief Minister Jayalalithaa in a disproportionate assets case without even once mentioning what it found wrong with the lower court verdict, the Karnataka government argued in the Supreme Court.\n\n“In the entire judgment of the High Court, there is not a single finding saying the trial court was wrong even in one single instance. Before you (Karnataka High Court) overturn the trial court judgment, you have to point out where it went wrong,” senior advocate Dushyant Dave for Karnataka submitted before a Bench of Justices P.C. Ghose and Amitava Roy as he wrapped up the State's final arguments in the case.\n\nMr. Dave described the over 1,000-page judgment of Special Judge John Michael D' Cunha in September 2014 as a “brilliant analysis” of the 18-year-old corruption case.\n\nThe verdict of guilt was overturned by Justice C.R. Kumaraswamy in May 2015, against which the Karnataka government came in appeal before the Supreme court.\n\nKarnataka has argued that the case could not be viewed as a mere instance of default in payment of Income Tax, but should be considered as one of corruption in public life against Ms. Jayalalithaa and three co-accused – N. Sasikala Natarajan, V.N. Sudhakaran and J. Elavarasi.\n\nThe State alleged that Ms. Jayalalithaa had created a veneer of “conscientiousness” by drawing Re.1 salary. “While on the other side, tonnes of money are carried in suitcases to the banks by her cadre,” Mr. Dave had submitted.\n\nIn his submissions, Mr. Dave mentioned how it has “become a fashion for political leaders to term crores of money they get as birthday gifts” and the way in which some political leaders are considered as “demi gods” by their followers.\n\nKarnataka’s appeal has described the State's High Court judgment as “cryptic, lacks reasoning and illogical”.", 
    "section": "national", 
    "title": "HC could not find even one wrong in trial court verdict: Karnataka", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}