{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has imposed a cost of Rs.10,000 on C.M. Syed Babu, vice-president, Madurai District (Urban) Congress Committee, for filing a public interest litigation petition seeking allotment of houses for 12 homeless families after having given two different sets of names to the Collector, Corporation Commissioner and Tamil Nadu Slum Clearance Board.\n\nExpressing dissatisfaction over the conduct of the petitioner, a Division Bench comprising Justices S. Manikumar and C.T. Selvam directed him to pay the cost to the Collector within 10 days from the date of receipt of the order copy, failing which the latter was directed to recover the money from the litigant by initiating appropriate proceedings under the Tamil Nadu Revenue Recovery Act, 1864.\n\nThe judges pointed out that the petitioner had made a representation to the Collector and Corporation Commissioner for the first time way back in 2011, seeking allotment of houses to 12 families in the tenements constructed under Jawaharlal Nehru Urban Renewal Mission at Rajakoor or in the houses constructed on Avaniapuram-Aruppukottai Road and in Ellis Nagar here.\n\nHe followed up his plea with supplementary representations made in 2012, 2013 and 2015. However, the names in the list of 12 beneficiaries for whom he had sought allotment in 2012 were completely different from the list he had submitted in the subsequent years and the TN Slum Clearance Board claimed that the people for whom the petitioner had sought allotment were not genuine.\n\nSimilarly, R. Murali, counsel for the Corporation, submitted that none of the people for whom the petitioner had filed the case had submitted individual representations to the Commissioner seeking allotment of tenements. The judges recorded their submissions and held that the PIL petition deserved to be dismissed with costs.", 
    "section": "national", 
    "title": "HC imposes cost on Congress office-bearer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}