{
    "author": [], 
    "text": "In a touching case that highlights the plight of the elderly in the country, an octogenarian’s sons moved the Madras High Court, seeking exemption from paying a measly Rs. 400 as monthly maintenance to their father.\n\nAppalled by the plea, the court dismissed their petition and directed them to pay up the maintenance sum with arrears and warned them that neglecting the elderly citizen was punishable.\n\nC. Chinnappa (82), father of three, was a farmer who earned his living cultivating 2.40 acres of land he owned. As his sons were married, he bequeathed the land equally to his sons and retained 40 cents for his own use.\n\nIn 2004, Chinnappa, alleging that two of his sons C. Shanmugam and C. Mani were not allowing him to cultivate the 40 cents of land and stopped his source of income, moved the Chief Judicial Magistrate, Vellore with his wife Lakshmi seeking maintenance from his two sons who are retired military officers, receiving pension and held good jobs. During the pendency of the case, his wife Lakshmi passed away and Chinnappa moved into his elder son’s house. After analysing the evidence and witnesses, the court directed the two sons to pay Rs 400 as monthly maintenance to their father. Aggrieved by the order, Shanmugam and Mani assailed the direction before the District Court. They contended that though their father is living with his first son, who owns the same extent of land, he has not chosen to claim maintenance from him. They argued that as their father was earning some income from cultivating the 40 cents of land, the Rs. 400 maintenance amount was high. The District Court dismissed their appeal and they approached the High Court challenging the order. When the plea came up for hearing before Justice S. Vaidyanathan, he said, “It is very unfortunate that the petitioners' father has not been taken proper care of at his old age. On noting persons like that of the petitioners, Parliament has legislated the Maintenance and Welfare of Parents and Senior Citizens Act, 2007.” Observing that the monthly maintenance (Rs. 400) was too meagre considering the present cost of living, the judge directed the petitioners to deposit the entire arrears of maintenance within two months.\n\nDirects them to deposit the entire arrears within two months", 
    "section": "national", 
    "title": "HC upholds maintenance amount for octogenarian neglected by sons", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}