{
    "author": [
        "Staff Reporter"
    ], 
    "text": "It is the duty of the State Government to create means of livelihood for the tribals so that migration to Seshachalam Hills could be prevented, said K. Kranthi Chaitanya, defence counsel for 347 persons who were acquitted in Seshachalam forest official’s murder case in February.\n\nRed sanders smuggling\n\nSpeaking to The Hindu here on Thursday, he said that despite the risk involved in red sanders smuggling, tribals get involved only because there is lack of resource or survival methods for them here.\n\n“The government should provide a permanent solution by creating opportunities for tribals so that they need not migrate”, he added.\n\nMr. Kranthi said that registering case against 347 innocent persons is the biggest abuse of law in Andhra Pradesh and blamed the police for its act.\n\nWhen 61 accused belonging to Andhra Pradesh were granted bail, 287 Tamils could not get bail.\n\n“It exposes the lacklustre of the judiciary which the judge pointed out in his 325-page judgement”, he added.\n\nMockery of investigation\n\nMr. Kranthi said that the State should not make mockery of investigation and demanded compensation and rehabilitation measures for their illegal detention for 26 months in prison. “Will move a civil or criminal case against the Andhra Pradesh government for registering a false case”, he added.\n\nHe said that food given by mother to his son in prison was even denied. It is regional discrimination and denial of basic humanitarian rights that made me take up the case and appear for all’, he pointed out.\n\nLater, he participated in a programme organised by Tamil Nadu Tribal People’s Movement. Many of the tribals who were acquitted in the case spoke on sufferings while they were in prison.\n\nFuneral\n\nWhile Ganesh of Karumandurai in Salem district said that he could not attend his father’s funeral, Radha of Vellimalai said that her mere earnings of Rs. 100 per day would not be sufficient to meet their growing debts.\n\nMany said that they went to Tirupati temple and while returning they were picked up by the police at railway stations and bus stands.\n\nChandra Mohan, Campaign Committee member, All India People’s Forum and others spoke.", 
    "section": "national", 
    "title": "‘It is duty of Tamil Nadu Government to prevent migration of tribals’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}