{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Government allocates Rs. 3,550 crore to meet expenditure for next 6 months\n\nAmidst dissenting voices from the Opposition, the last session of 13th Puducherry Legislative Assembly was wound up within 45 minutes after authorising the decision of the outgoing All India NR Congress (AINRC) Government to allocate a sum of Rs. 3,550 crore to meet out expenditure for next six months until September without any discussion.\n\nEven though the model code of conduct has come into effect in the poll-bound Union Territory, the Legislative Assembly was convened to rush the Appropriation (Vote-on-Account) Bill 2016 and authorised payment and appropriation of Rs. 3,550 crore from the Consolidated Fund towards ‘Vote-on-Account’ for defraying several expenses from April to September.\n\nOpposition parties were strongly critical of AINRC’s preference to Vote-on-Accounts for all these years since it came to power in 2011 rather than presenting regular budget and allowing to discussion.\n\nImmediately after the House assembled on Thursday, deputy leader of the AIADMK Legislature Party, A. Anbalagan said the Speaker should allow a discussion on the proposed move of Centre to introduce the National Eligibility Entrance Test for medical seats. He also said in Tamil Nadu, the annual budget was presented ahead of announcement and it was undemocratic for the government to have convened the Assembly and pass the vote-on-account without discussion on the issues which affect the people.\n\nLeader of Opposition V. Vaithilingam stood up demanding the chair to ask the Chief Minister N. Rangasamy to make a statement on the stand of government on the proposed construction of a hovercraft in Veerampatinam village despite protests from fisherfolk and alleged back door appointments. His party MLAs- A. Namassivayam and K. Lakshminarayanan also raised the same issues in support of him.\n\nAmidst noise in the Assembly, Speaker V. Sabapathy allowed the Chief Minister Mr. Rangasamy to present the Supplementary Expenditure and Demands for Grants for the year 2015-2016. Again Mr. Vaithilingam rose and asked the explanation from the government side on the expenditure of Rs.120 crore to Revenue Department and another Rs.100 crore towards pensions.\n\nThe Speaker said there was nothing wrong in passing Supplementary Demands for Grants without discussion and such practice was in vogue when Mr. Vaithilingam was Chief Minister during Congress regime. Opposing the stand of the Speaker, Five Congress MLAs led Mr. Vaithilingam staged a walk out while two other Congress MLAs remained seated in the Assembly.\n\nLater the Chief Minister Mr. Rangasamy moved the Appropriation (Vote-on-Account) Bill 2016 for appropriation of the fund in the first six months of financial year. Then the Speaker invited those who were in favour of the motion to say 'Aye' and those against the motion to say 'No'. He declared that more number of members in favour of the motion say ‘Aye’ and Supplementary demands and Vote-on-account got approval of the house.", 
    "section": "national", 
    "title": "Last session of Assembly lasts less than 45 minutes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}