{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Madurai, with its rich culture and heritage, could evolve as a model Smart City for the country, said Ajit Sabnis, president, Association of Consulting Civil Engineers (India), here on Thursday.\n\nInaugurating a symposium on “Smart cities in India: challenges and constraints,” organised at the Thiagarajar College of Engineering, Mr. Sabnis pointed out that rural migration for a better life would cause enormous burden on the urban infrastructure and the civic administration would not be in a position to provide basic amenities to all. In this context, the Smart Cities Mission would have an answer by providing smart solutions to civic problems.\n\nRural migration led to urbanisation, which required development, and development meant release of green house gases. This added to global warming and resultant manmade disasters, he said. However, just by enabling cities with smart technology it would not be possible to make them smart cities as many stakeholders were involved.\n\nK.P. Pradeep, Editor-in-Chief, Masterbuilder, said that there was no clarity on the concept of Smart City and people did not know what it meant. Seminars like this would throw more light on the concept, he said.\n\nKarumuttu T. Kannan, Managing Director, Thiagarajar Mills, recalled how our forefathers employed the requisite technology to build smarter cities around temples. The damage done to such city structures was so callous and the Smart Cities Mission concept could revisit the damage and reclaim whatever had been lost.\n\nThe idea of Smart City would succeed only when people took up ownership. Madurai, he said, should have public involvement if it were to become a Smart City.\n\nK. Arunachalam, Head, Department of Civil Engineering, spoke about the need for the seminar. S. Chandran, Associate Professor, explained the objectives of the two-day event. S. Arunkumar proposed a vote of thanks.", 
    "section": "national", 
    "title": "Madurai can be a model Smart City, says expert", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}