{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Harivamsam,’ Railway Colony, 7.30 p.m.\n\nMuneeswarar Temple: Mahakumbabishekam, Munsif Court Road, Tirumangalam, 6.30 a.m.\n\nPanniru Tirumurai Mandram: Discourse on ‘Tiruvilayadalpuranam,’ Tirukkalyana Mandapam, 5 p.m.; Abirami Anthathi parayanam, South Adi Street, Meenakshi Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tirukkural,’ North Adi Street, Meenakshi Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Avvai Kural,’ Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Yoga class, 6 a.m.; aarathi, New Natham Road, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Viveka Choodamani class, Sri Kuttaiah Swami Mutt, 164 South Veli Street, 6.45 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nThiagarajar College: 67{+t}{+h}annual sports meet; V. Jeyaveerapandian, Director of Physical Education, Madurai Kamaraj University, and A. Sithalatchumi, Commonwealth Games medallist, address; M. Eyini, Principal, presides, 9.30 a.m.\n\nFatima College: 63{+r}{+d}College Day; U. Sahayam, Vice-Chairman, Science City, addresses, Mary Land, 10.30 a.m.\n\nSri Sathguru Sangeetha Vidyalayam: 50{+t}{+h}Annual Day; V. Indhumathi, Joint Director of Collegiate Education, addresses; B. Ganapathi Sarma presides, Lakshmi Sundaram Hall, 5.30 p.m.\n\nVivekananda College: 45{+t}{+h}College Day; A. Muthumanickam, Registrar, Madurai Kamaraj University, addresses; Swami Niyamananda, secretary, presides, Tiruvedakam West, 9.45 a.m.\n\nE. M. Gopalakrishna Kone Yadava Women’s College: N. Kalaiselvi, Senior Principal Scientist, Central Electrochemical Research Institute, inaugurates State-level science expo; E.M.G.S. Indirani, secretary, presides, Tiruppalai, 9.30 a.m.\n\nSt. Charles College of Education: Rev. Sr. A. Amali Anbarasi, Principal, inaugurates international seminar on “ICT in education and research;” Rev. Fr. S. Basil Xavier, Principal, Arul Anandar College, presides, Thanakkankulam, 9.30 a.m.\n\nMadura College Higher Secondary School: 159{+t}{+h}Annual Day, RMS Road, 10.30 a.m.\n\nKaren Public School: Annual Day celebration; S. Murugan, Inspector General of Police (South Zone), addresses; P.T. Rajan, chairman, presides, K. Puliyankulam, 4 p.m.\n\nRotary Club of Madurai West: Mohammed Nazar speaks, Fortune Pandiyan Hotel, 5.30 p.m.\n\nMadurai Central Junior Chamber: RM. Ramanathan speaks on “Finance management,” Madurai Productivity Council Hall, 52 TB Road, Mahaboobpalayam, 6 p.m.\n\nAlcoholics Anonymous: Meeting, RC School, Sivaganga Road, Melur, 6.30 p.m.; Parasakthi Nagar, Avaniapuram, CSI Church, Narimedu, and Maniammai Nursery School, North Masi Street, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}