{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "48-year-old slits throat of wife, 2 children; financial problems may be reason\n\nIn a horrifying incident in the early hours of Thursday at Kothavalchavadi, a 48-year-old man murdered his wife and two children by slitting their throats and then ended his life in the same manner.\n\nDevendra Kumar killed his wife Deepti (39), daughter Surabhi (16), a class XI standard student, and son Manas (7), a class III student, at their house on Govindapa Naicken Street.\n\nHe left behind a suicide note for the city police commissioner, which read — “I have killed my family and committed suicide. Kindly pardon me. I am solely responsible for this act.”\n\nCommenting on the suicide note, a police officer said that his handwriting was not shaky and the act appeared to be pre-meditated.\n\nDevendra was working in Ghana, South Africa, for the past two years and was staying with his sister there.\n\n“He was into online trading. His wife was ailing and he is suspected to have been facing financial problems. He therefore returned to Chennai last month. On Wednesday night, the family even went for a movie,” said a police officer.\n\nDevendra’s parents saw the bodies and alerted the neighbours. Devendra had been staying on the second floor of a nearly 50-year-old building with his wife and two children.\n\nDevendra’s parents — Vishwambarnath and Jayadevi — also stay on the same floor but in a different house, said the police.\n\n“Around 5.30 a.m, Jayadevi went to Devendra’s house and found the four lying in a pool of blood. She alerted us and we informed the neighbours. They have been staying here for nearly 20 years,” said Diwakar, who stays on the same building which houses five families.\n\nThe Kothavalchavadi police reached the spot and took the bodies to the Stanley Medical College Hospital for post-mortem examination. During investigation, it was found that Devendra had committed the crime using a new knife.\n\n“We suspect he sprayed or gave something to his wife and children to prevent them from making any noise,” the officer said.\n\nHis neighbours remember Devendra as a friendly person.\n\n“When we used to pump water, he would carry the pots to the second floor without anyone asking him. Recently, he asked me if I could teach his son Tamil,” said a neighbour who didn’t want to be named. A case has been registered and further investigation is on. Forensic experts were also pressed into service.\n\nSneha’s suicide prevention helpline can be reached at 2464 0050/60. The State health helpline can be reached at 104.\n\nThe bodies were discovered by his parents who live in another house on the same floor", 
    "section": "national", 
    "title": "Man kills family, ends life", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}