{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has turned down a plea to issue a direction to the Centre to amend Section 197 of Code of Criminal Procedure, 1978, which mandates prior government sanction before prosecuting judges and public servants for certain criminal offences.\n\nJustices S. Manikumar and C.T. Selvam dismissed a public interest litigation petition filed by K.K. Ramesh of Centre for Public Interest Litigation, on the ground that judiciary could not step into the shoes of the legislature and begin taking decisions on amending existing laws.\n\nThe petitioner had claimed that the legal provision was a stumbling block in prosecuting politicians, bureaucrats, police officers, forest officials and many others accused of looting public money through various scams and amassing wealth disproportionate to their known sources of income.\n\nAgreeing with him to an extent, the judges said: “The intention (of the petitioner) may be laudable for who does not want to weed out corruption… But the prayer sought for cannot be granted for the reason that it is for the Legislature to consider by making amendment to any provision of law.\n\n“On the averments made, we cannot take over the legislative function to amend Section 197 Cr.P.C, by issuing a writ of mandamus as desired by the petitioner. The salutary purpose sought to be served by the Section is to avoid wrongful prosecution of judges, magistrates and public servants.”\n\nThey also pointed out that Section 197 prohibits courts from taking cognisance of any offence alleged to have been committed by a person, “who is or was a judge or magistrate or a public servant not removable from his office save by or with the sanction of the government,” while acting or purporting to act in discharge of his duty, without prior sanction to prosecute.\n\nHowever, an explanation to the legal provision also makes it clear that prior sanction was not necessary to prosecute public servants accused of offences such as rape, outraging modesty of woman and trafficking. It shows that the “provision is conceived by the legislature with an avowed object,” the judges added.\n\nHigh Court says judiciary cannot step into the shoes of the legislature", 
    "section": "national", 
    "title": "Plea to amend law on prosecution of judges rejected", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}