{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court has cleared decks for removal of encroachments in the Perumpallam Anicut in Erode. —PHOTO: M. GOVARTHAN\n\nThe Madras High Court has issued a directive to the Public Works Department to remove encroachments on the water spread area of Perumpallam Anicut.\n\nThe Court has given time till July 15 for removing the encroachments. If not for the elections to State Assembly, the deadline would have been much earlier, Logusamy, a functionary of the district unit of Tamizhaga Vivasayigal Sangam, which is in the forefront along with other farmers’ organisations for restoration of the original utility of the water body, said.\n\nIn a recent survey, the PWD could determine encroachment on 1.43 acres of water spread area in the anicut with actual area of 10 acres and 91 cents.\n\nThe apprehensions by farmers’ organisations that four to five acres have been encroached appear far-fetched, PWD Executive Engineer Raju said.\n\nAs per the High Court directive, the 134 houses constructed on the water spread area by Tamil Nadu Slum Clearance Board and about 30 other houses would be cleared. As per norms, the occupants are required to vacate within 14 days of receipt of notice. The notices will be issued soon after the completion of polls during mid-May, Mr. Raju said.\n\nAfter eviction, the entire tank area is to be desilted. The PWD has already forwarded a proposal to the Government for revival of the anicut that receives seepage water from Lower Bhavani Project canal.\n\nThe relevance of the anicut at Soorampatti got lost in the last two decades due to rampant encroachments of the canal path that had caused clogging of the water body that once used to irrigate over 2,500 acres in 46 Pudur, Lakhapuram and a few other villages close to the city.\n\nOne of several such structures constructed to draw surplus water from the Lower Bhavani Project canal decades ago, the check dam maintained by the PWD presents a sorry sight with overgrowth of water hyacinth.", 
    "section": "national", 
    "title": "PWD directed to remove encroachments in anicut", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}