{
    "author": [
        "S Senthalir"
    ], 
    "text": "They have petitioned the Directorate of Survey and Land Records to ascertain the ownership of the pond and declare it a government property.\n\nA view of the ‘Mottai Thoppu Pond’ at Annamalai Nagar, in Puducherry which the residents are fighting to conserve.— Photo: S.S. Kumar\n\nResidents of Annamalai Nagar in Puducherry have taken up the cudgels to protect a water pond, which is the only surviving water body in their area. Known as ‘Mottai Thoppu Kulam’, this pond has long been central to the rituals of the 175 families residing in the predominantly Dalit area.\n\nOnce an agricultural area where paddy, coconut trees were grown in the land spread across 80 acres, the 10,600 square feet pond is now the only remnant of the rich green past. Even this natural resource is facing the threat of encroachment.\n\nThe residents have petitioned the Directorate of Survey and Land Records to ascertain the ownership of the pond and declare it a government property in order to preserve it.\n\nIn 2005, the Annamalai Nagar Residents Welfare Association had submitted a petition stating that the land at R.S.No 296/3 of Saram Revenue Village (Mottai Thoppe) was a government poramboke pond and during the re-survey, the survey number has been erroneously mentioned as patta land and that land grabbers are trying to convert the pond into housing plots.\n\nThey had requested the government to safeguard the pond by correcting the records.\n\nThe Taluk Office of Oulgarpet had conducted an inquiry and submitted a report to the Deputy Collector (Revenue/North) on May 18, 2005, and reported that the official gazette published by the French government, the Cadastre no.84, which is correlating to the R.S.No 296/3, has been described as Poramboke vide no.13 dated March 3, 1935. Also in the French document No.R.V.253 No.85 dated October 14, 1959, the Cadastre No.84 is described as ‘Water Pond’.\n\nThe Director of Survey and Land Records was directed to explore the possibility of converting the settlement records in respect of that survey number as government poramboke (pond) instead of patta land in the name of Rathinasabapathy and the land in question still remains a pond and no action has been initiated by the legal heirs to convert it into layout plots.\n\nUpon receiving the enquiry report from the Taluk office, then Deputy Collector (Revenue/North) A.Vincent Rayar in 2007 had directed the Department of Survey and Land Records to ascertain the ownership of the land and furnish a suitable reply to the association.\n\nSince then the files have not been cleared by the Director of Survey and Land Records. Waiting for response, the residents, when pursued the case, found to their surprise the files were missing. Later, they again sent a copy of all the documents they had with them to the office in 2014. Still, no action has been taken in this regard.\n\nHaving decided to clean the water pond, which was left abandoned for the past three years, the residents collected up to Rs. 50,000 and cleaned up the pond. “If we get help from the government, we can clean and conserve this pond,” a resident said.\n\nWhen contacted, the official concerned at the Director of Survey and Land Records refused to comment and said the case was under investigation and the officials would decide on whether to declare it a government or private property.\n\nHowever, the residents look relentless and are determined not to give up their natural heritage treasure.", 
    "section": "national", 
    "title": "Residents fight to save pond from encroachers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}