{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The otherwise deserted looking railway station in the island town witnessed hustle and bustle as hundreds of school students made a beeline to Rameswaram station to visit Science Express, a unique exhibition on wheels.\n\nHundreds of school students and general public thronged the station on Thursday to visit the “Climate Action Special” run by the Ministry of Railways in coordination with Department of Science and Technology and Ministry of Environment and Forest.\n\nThe train, which featured various aspects of climate change, nature conservation, recent advancements in biotechnology applications and international climate change negotiations, was virtually a treasure trove of knowledge for the students.\n\nThough it was open for all, priority was being given to teachers and students, an official said.\n\nThe train would be stationed here for three days till March 12 before leaving for Tirunelveli, the official said. The displays in 13 carriages focussed on climate change, climate change impact, adaptation, mitigation and biotechnology for bio-resources and nature conservation.\n\nKids’ Zone\n\nOne carriage was exclusively converted as Kids’ Zone for Class IV and V students and the higher class students enjoyed joy of science lab, on-platform activities, outreach activities, innovations in India and recent advances through biotechnology applications in other carriages.\n\nSixty instructors, who travelled in the train, explained the students on various aspects.\n\nOn the first day, about 3,000 people, including 2,500 students from 13 schools in the district, visited the Science Express, Bernardette, District Co-ordinator of the National Green Crops, who was coordinating with the schools, said. The exhibition would be open between 10 a.m. and 5 p.m., he said.\n\nAs the instructors explained the aspects in English, students who hailed from villages found it difficult to understand them, he said.\n\n“The exhibition on climate change was very informative,” R. Ajay Kumar, a class IX student of Kendriya Vidyalaya, said. It was a new experience for S. Yamuneswari, a Class VIII student.", 
    "section": "national", 
    "title": "Science Express, a huge draw at Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}