{
    "author": [], 
    "text": "RELIGION\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, ratharohanam, 7 a.m.; thiruther vadam pidithal, 8 a.m.; theerthavari, 4 p.m.\n\nNational Institute of Technology Prayer Cell: Easter extravaganza, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Vasudeva Perumal Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Krishnar Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 1, Cauvery Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nBharathidasan University Department of Environmental Management: Lecture on “Real time monitoring of environmental impact through smart governance”, by L. Soma Sundaram, Director, Research, Akara Research and Technologies, Chennai, 2.30 p.m.\n\nNational Institute of Technology Instrumentation and Control Engineering Association: Sensors 2016 – national technical symposium, S.N.Banerjee, additional general manager, C&I Systems, Instrumentation Limited, Srinivasan Sundarrajan, Director, NIT, Tiruchi, presides, 5 p.m.\n\nFederation of Obstetric and Gynaecological Societies of India: Felicitations to Youth team of Bharathidasan University women students and youth of Tiruchi on successful completion of rally from Tiruchi to Agra, Garbaratchagi Mahal, Cantonment, 4.30 p.m.\n\nBharathidasan University Department of Plant Science: Valediction of conference on Emerging trends in plant science, M.Krishnan, Syndicate Member, chief guest, 4.15 p.m.\n\nJ.J. College of Engineering and Technology Swayam Entrepreneurship Development Cell: Valediction of Anubhav 2016 – entrepreneurship week, P.K.Kumravel, founder and CEO, Naturals Salon and Spa, and Kathir Loganathan, chairman, Varnam Foundation, speak, 2 p.m.\n\nShrimati Indira Gandhi College: Demonstration on preparation of green fodder and bio fertilizer, Perugamani, P. Palayam, P.Pazhaiyur, Sirugamani Agraharam and Malaiyappa Nagar, 9.30 a.m.\n\nNational College Department of English: Prof. S. Thothadri Iyengar Endowment Lecture on “Chicago address” by Swamy Murugananda Sarasawati, Managing Trustee, Arunachala Unique Mountain Trust, noon.; Department of Commerce: K.K. Srinivasan, auditor, speaks on Budget 2016, noon;; History Association meeting, M. Arokiasamy Xavier, Head, Department of History, St. Joseph’s College, speaks on “Socio Religious movements in the 19{+t}{+h}century in Tamil Nadu,” 11.30 a.m.\n\nThe Booksellers and Publishers Association of South India: Book fair, Corporation grounds, Anna Nagar, Thennur, 11 a.m.\n\nSri Sivananda Balalaya: Teacher enrichment programme on “Cognitive learning for children,” C.K. Dhanapandian and P.R. Krishnamurthy, rehabilitation psychologists, Satchita Psychological Research and Training Centre, resource persons, Ramalinga Nagar campus, 10.30 a.m.\n\nBishop Heber College Department of Social Work: Awareness programme on “Mental health,” Sebastiar Street, Warehouse, 6 p.m.\n\nCARE Group of Institutions: Hertz – national-level technical symposium, 10 a.m.\n\nJ.J. College of Engineering and Technology: Workshop on “VLSI system design with altera FPGA tools”, D. Ramesh, chief technical officer, Chip Crafts Technologies, resource person, 10 a.m.\n\nChidambaram Pillai College for Women, Manachanallur: Cancer awareness programme, Dr. V. Sujatha of Dr. Viswanathan Cancer Centre, 10.30 a.m.\n\nM.A.M. College of Engineering: Scientia 2016, R.A. Krishna Kumar, Executive Director, Dalmia Cement, chief guest, 9 a.m.; workshop on “basic electronic component testing and analysis”, A.K. Kasthuri, resource person, 10 a.m.\n\nJayaram College of Engineering and Technology CSI Students Branch: Paper presentation, 10 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}