{
    "author": [
        "R Rajaram"
    ], 
    "text": "The sale has touched Rs. 12 lakh for the month of January\n\nThe Prison Bazar in Tiruchi has been putting up an impressive performance.— PHOTO: A. MURALITHARAN\n\nDishing out a variety of food stuffs and a slew of other products manufactured by inmates, the Tiruchi Prison Bazaar, managed by a group of convicts, has been witnessing robust business with monthly sales perking up.\n\nThe monthly sale of products, which used to be in the range between Rs. 6 lakh and Rs. 7 lakh a month, has almost doubled clocking Rs. 12 lakh a month witnessing a spurt in business.\n\nPrison authorities say the Rs. 12 lakh mark in respect of sales was achieved after January at the Prison Bazaar which was started with the avowed objective of engaging convicts in a productive vocation and helping them earn wages during their incarceration.\n\nWith the current robust business taking place at the prison bazaar, jail authorities are confident that the sales would touch Rs. 1.5 crore this fiscal.\n\nAbutting the Tiruchi–Pudukottai national highway and situated at the entrance of the Tiruchi Central Prison, the prison bazaar is run from the crack of dawn till night by engaging a group of 20 convicts — most of whom are lifers. A variety of food stuff was being dished out to public every day with latest addition being “chicken biryani”. Vegetables grown on prison lands, readymade garments, bakery items, and pickles were being sold in the prison bazaar — a novel initiative of the Prison Department.\n\nBumper harvest\n\nThe authorities say tomatoes grown on one-acre prison land abutting the Central Prison has witnessed a bumper harvest this time.\n\nOn Wednesday alone, around 600 kg of tomatoes was harvested, said an official.\n\nThe tomatoes were being sold at Rs. 6 a kg to general public and others who procure in bulk.\n\nOrganic manure manufactured by prisoners inside the sprawling Central Jail was applied while raising tomatoes and other vegetables.\n\nBesides tomato, other vegetables including pumpkin, lady’s finger and greens were being raised on prison lands.\n\nWith paddy cultivation in full swing on prison lands, the authorities are hopeful of a good harvest this time. The ADT-39 paddy variety was raised on 2.2 acres of land and we expect about 50 bags this time. The rice would be supplied to prison bazaar for preparation of variety rice items, the official said.", 
    "section": "national", 
    "title": "Tiruchi Prison Bazaar notches up Rs. 1.5 cr. sales", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}