{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The World Trade Organisation agreement would be a death knell for retail traders, and hence India should not sign it, said T. Vellaiyan, president of Tamil Nadu Traders’ Federation, here on Thursday.\n\nArriving here as part of the 10-day two-wheeler rally from Chennai , Mr. Vellaiyan said that the federation had staged various forms of agitations explaining the ill-effects of the WTO agreement as it would only support multinational companies and force India to heavily depend on imports. The rally was undertaken to explain to the people the ill-effects of the WTO pact.\n\nIf the Centre continued with its present policy of allowing FDI in key sectors, retail trade would cease to exist in the country in the next few years, and crores of retail traders would be affected badly. Agriculture sector would be the worst affected, he said.\n\nAlleging that the State government had been toeing the line of the NDA government at the Centre on allowing FDI in key sectors, Mr. Vellaiyan said that the Federation appealed to all political parties to make an announcement in their election manifesto that they would not support the WTO pact.\n\n“The Federation will extend its support to the political parties which promise this in their election manifesto,” he said.\n\nThe rally started at Gandhi statue on Marina Beach in Chennai on March 1 and would culminate in front of Tiruvalluvar statue in Kanniyakumari on Friday.\n\nOver 200 members of the Federation took part in the rally. The rally was led by Mr. Vellaiyan.\n\nDuring the course of the rally, roadside meetings were held in important towns, Mr. Vellaiyan said.\n\nFederation State vice-president L.M. Davidson, district president Karungal R. George and district secretary Cross S. Arul Raj were also present.", 
    "section": "national", 
    "title": "We will support parties which oppose WTO pact: Vellaiyan", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}