{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "The Sri Shakthi Institute of Engineering and Technology came up with yet another adventurous exercise for its women, as part of the International Women’s Day celebration, here last week.\n\nTitled the Power Puff girls, the two-day event was aimed at empowering its women through adventurous sports such as bullet and horse riding, jeep driving, boating and many more. And, the girls were thrilled to be part of the show.\n\nThe girls, about 20 of them, did not mind getting up early on the first day to show their might on the Bullet bikes, which normally attracts the big boys. Besides loads of fun under the sun, they rode through the busy Avinashi Road, visited colleges and distributed pamphlets on road safety for awareness sake.\n\nThe bold and the brave nature of the Sri Shakthi women spread nicely to the other colleges as well. The same day about 400 girls along with their faculties took part in a walkathon from Chinniampalayam to the College campus. And, they carried with them message of saving nature from global warming. This was followed by a cookery contest, the traditional way.\n\nThe second day the girls had to go through a tough grind. They took part in boating, jeep driving and horse riding. After the rigorous exercise, the participants had something to cheer. They were showered with bouquets of praises by the specials guests, who had come in from various parts of the State. The girls also took home attractive prizes for their efforts.\n\nS. Thangavelu, the institution’s chairman, and Sheelan Thangavelu, its joint secretary, were happy that the girls showed grit and determination right through.\n\nHonour women\n\nThe Shri Nehru Maha Vidyalaya College of Arts and Science celebrated the International Women’s Day under the banner ‘Let’s Honour Women. Senior Family Court lawyer Vennila, the main guest of the day, spoke on various issues from sexual harassment to the numerous sacrifices made by the women.\n\nThe day did not end with just inspiring speeches but there were competitions and attractive prizes for its women too.\n\nMedical camp\n\nThe Kalaignar Karunanidhi Institute of Technology celebrated the day on a different note. To mark the occasion it organised a free medical camp at its campus for its women and those from the Kannampalayam Panchayat.\n\nVGM Hospital and Ranjan Medical Centre (Thennampalayam) was associated with the event. The participants went through screening tests for cervical cancer, bone marrow density, BMI, hepatitis B and C, blood pressure and sugar. A primary examination for breast cancer was also carried out during the camp. More than 600 attended the camp.", 
    "section": "national", 
    "title": "Women power comes to the fore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-11"
}