{
    "author": [
        "T Madhavan", 
        "R Srikanth"
    ], 
    "text": "The new small buses, which link several interior areas with bus termini, railway and metro stations in the city, are expected to give a boost to intermodal transport. They are also expected to encourage many people to use public transport.\n\nMTC officials claim that the small bus services have brought real convergence of public transport facilities.\n\nThe lack of bus services linking interior areas with various public transport facilities had forced people to either use individual vehicles or private transport.\n\nA senior official of the MTC said the new small routes are based on an elaborate plan to link Metro, Mass Rapid Transit System (MRTS) and suburban train services.\n\nHe cited the examples of the bus services from Alandur Metro Station to Velachery, via thickly-populated residential areas of Nanganallur, Vanuvampet and Ullagaram-Puzhuthivakkam, which provide commuters with the options of using the Metro and Mass Rapid Transit System (MRTS).\n\n“Connectivity to Metro stations is the highlight of the new routes,” said S. Padmavathi, a software engineer working in Vadapalani.\n\n“Though the timings have not been fixed, there will be buses at least once every half-an-hour,” said sources with MTC.\n\nSome of the new small buses would be linking villages in the western parts of Thirumullaivoyal, Avadi, Thiruninravur, Pattabhiram and Ayappakkam.\n\nN. Murugan, a resident of Thirumullaivoyal, said only suburban train services were available previously for the residents of Avadi, Thiruninravur and Pattabhiram, who would have to go to the Moore Market suburban complex to take other trains to their destinations. But now, the operation of more number of small bus services by the MTC would help these residents reach south and central Chennai easily.", 
    "section": "national", 
    "title": "‘A real convergence of public transport’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}