{
    "author": [
        "Poorvaja Sundar"
    ], 
    "text": "240 delegates in city as part of Next Generation Global Leaders programme\n\nDelegates of Next Generation Global Leaders programme on board the ship Nippon Maru at Chennai Port on Tuesday—Photo: M. Vedhan\n\nWhen the ship ‘Nippon Maru’ docked at Chennai Port, the 240 delegates on board were visibly excited.\n\n“We cannot wait to explore the rich culture of Chennai and are particularly enthusiastic about trying out the cuisine here,” said Muizz, a student from Bahrain and one of the delegates who are here as a part of the Next Generation Global Leaders programme. They will be in the city for three days.\n\nThe programme is a cultural exchange initiative, which will help the delegates develop communication, leadership and management skills through discussion and interaction with people from various countries. The delegates are being hosted by the Rajiv Gandhi Institute of Youth Development.\n\nKo Dai, a Japanese student, said the delegates had learnt a lot about different cultures in the few days they had all been on board the ship together.\n\n“Everyone here has been friendly and it is a learning experience,” said Ko Dai.\n\nStating that it was snowing in Japan, Carmina Gorres, a delegate from Chile, said they had visited Mt. Fuji there. “After India, we will be going to Sri Lanka, a visit we are looking forward to,” she said.\n\nHamad Alwadin, a delegate from the UAE, summed up his experience on board as one that would help him become a good and positive leader. “We are learning about and respecting and understanding cultures around us. For most of us, it is our first time in the southern part of india,” he said.\n\nThere are 120 Japanese youngsters participating in the programme. The delegates will visit Kalakshetra, besides Centre of Innovation at IIT Madras; Centre for Disaster Management and Mitigation at the Institute of Remote Sensing in Anna University; The Banyan and the L.V. Prasad Film and TV Academy.", 
    "section": "national", 
    "title": "A ship full of future leaders exploring peoples, cultures", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}