{
    "author": [
        "R Sujatha"
    ], 
    "text": "The information, though useful, is only basic, says an educational consultant\n\nThe All India Council for Technical Education has created a dashboard on its website with easy access to some basic details about institutions under its purview across the country.\n\nUnder the section ‘Statistics’ the data provides information about the number of institutions, their intake, the number of faculty and enrolment. According to the data, as of 2015-16 there are 10,329 institutions in government, aided, private and deemed institutions.\n\nThe sectors include pharmacy, hotel management, engineering and technology, MCA, management, applied arts and crafts and architecture and planning.\n\nThe data, a self-declaration by institutions, reveals that in Tamil Nadu 2,79,827 seats have remained vacant in the academic year. Though in a couple of months colleges would start the preliminaries for admission process, the data on intake and vacancies for the current year are not available.\n\nAn independent educational consultant Moorthy Selvakumaran says the Council has uploaded only basic information but this is only raw data. “It is useful to the students and public but there is no specific information about the quality of the institution. The online system of uploading the details will keep the Council competitive as the Ministry of Human Resource Development has proposed to rank institutions. The need of the hour is to update the website about the number of institutions that have sought National Board of Accreditation (NBA) accreditation,” he says.\n\nLast year, the Council had made it mandatory for colleges to be accredited by the NBA. Yet, the details are missing, Mr. Moorthy points out. Also, the Council is silent on the details about colleges that had violated the rules and the action taken.\n\nThe principal of a private engineering institution says the Council is still evolving. “Sometime ago even these data were not available. It is a step forward in transparency,” he adds.\n\nFor institutions, however, the issue of concern is the revision of fee structure.\n\nThe former Supreme Court Judge B.N. Srikrishna-led committee report on technical education had come up with a range of fee structure for private institutions. The report has been sent to the MHRD for approval. An academician, however, said the decision to hike the fees could be the discretion of the State government.", 
    "section": "national", 
    "title": "AICTE launches online dashboard on institutions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}