{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The first case the newly-launched bike ambulances handled was of a resident of Kutchery Road, Mylapore, who had fainted, reportedly after inhaling pesticide fumes.\n\nSo far, the two-wheeler ambulances, launched on Monday, have handled about 17 cases — eleven on the first day and at least six on Tuesday, said B. Prabhudoss, head, marketing and hospital relations, GVK EMRI, which operates the emergency service.\n\n“The bikes are strategically located in between two ambulances in high traffic and densely-populated locations. These include Purasawalkam, T. Nagar, Gemini, Sterling Road, Flower Bazaar, Wallajah Road, Thirumangalam, Madhya Kailash, the Perambur and Central stations.\n\nHowever, these locations are not final — the bikes are on dynamic deployment and their location may change based on outcomes,” he said.\n\nThe objective is quick responses to emergencies and the bikes are only meant to complement the four-wheeler ambulances — if they are closer to the scene of an emergency, they will be deployed and simultaneously an ambulance will be deployed too.\n\n“The emergency medical technicians, can immediately provide aid, and crucially, recognise the emergency and stabilise the patient. Good pre-hospital care will lead to better outcomes,” he said.\n\nThe technicians can even backpack and provide care if the patient is in a multi-storey building, he said.\n\nEmergency medical technicians who had driving licenses and were comfortable on two-wheelers were identified, and then trained and tested before deployment, Mr. Prabhudoss said.\n\n“We are learning more as we go on, and may change a few things based on outcomes,” he said.\n\nBleeding injuries, fevers, diarrhoeas and breathing difficulties have also been handled by the bike ambulances so far.\n\n‘The bikes are strategically located in between two ambulances in densely-populated locations’", 
    "section": "national", 
    "title": "Ambulance bikes handled over 17 cases so far", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}