{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: R. Krishnamurthy,, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy Rd., Abhiramapuram, 6.45 p.m.\n\nBhagavatham: B. Sundarkumar, Chinmaya Mission Yoga Centre II, Chinmaya Nagar, 6.45 p.m.\n\nVishnu Sahasranamam: Sudha Seshayyan, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nLalitha Sahasranamam: K. Balasubramanyam, Yogalaya, 18/65, 3{+r}{+d}Main Rd., Gandhi Nagar, Adyar, 10.30 a.m.\n\nAmudhar Amudham: Venu Raza Narayanan, Sri Santhana Venugopalan Sannidhi, 115, Pidariyar Koil St., Broadway, 6 p.m.\n\nJeevanmukti Vivekam: K.S. Maheswaran, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nLife and Teachings of Swami BrahmanandaCcji: Gautamananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nCULTURE\n\nKala Sadhanalaya: Programme on ‘Salangai Poojai’, Bharatiya Vidya Bhavan, East Mada St., Mylapore, 6.15 p.m.\n\nGENERAL\n\nCardiological Society of India: Inauguration of conference, presentation of lifetime achievement awards, Convention Hall, Chennai Trade Centre, Nandambakkam, 6.30 p.m.\n\nTamil Nadu State Chess Association and Kanchipuram District Chess Association: felicitation to Padma Shri awardee D.K. Srinivasan for his outstanding service in the field of social work, Russian Cultural Centre, Kasthuri Ranga Rd., Alwarpet, 6 p.m.\n\nEcube Windoors: Session on ‘Window 360 Degree’, The School of Architecture and Planning, Anna University, Guindy, 3 p.m.\n\nHindustan Institute of Technology and Science and IGBC, Chennai Chapter: Workshop on ‘Lighting and Ventilation’, Padur, Kelambakkam, 9.30 a.m.\n\nRajalakshmi Engineering College: Programme on ‘Best HR Practices for Sustainable Corporate Readiness’, Rain Tree Hotel, Anna Salai, 10 a.m.\n\nVelammal Engineering College: Awareness programme on ‘Employment opportunities in Public Sectors’, Surapet, 4.30 p.m.\n\nMEASI Institute of Management: Graduation day, Peters Rd., Royapettah, 4 p.m.\n\nAnna Adarsh College for Women: Inter-collegiate cultural fest ‘Neherika’ with the theme ‘Namma Chennai’, Shanthi Colony, Anna Nagar, 10 a.m.\n\nKanchi Shri Krishna College of Arts and Science: Talk on ‘Kabilar Tamil works in Sangam Literature’, Kilambi, Kancheepuram, 11 a.m.\n\nNarcotics Anonymous: Meeting, Staying Clean Group, St. Lourdes Church, Don Bosco School, Perambur, 7 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Kondithope, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Manram, Ashok Nagar; The Lady of the Light Church, Mylapore; Jacob MHSS., Judges Colony, Periakuppam, Thiruvallur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Loyola MHSS., United India Colony, Kodambakkam; St. Lukes Church, Anna Nagar; Anglo Indian Association, Ponniyamman Koil St., Egmore; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Rd., Velachery; Kondithope Community Centre, Police Quarters, Waltax Rd.; St. Mathias Church, Kamarajar Salai, K.K. Nagar; C.S.I. Church, Moolakadai; and The Lady of the Light Church, , Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}