{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The world of coding and computers is not too complicated for young students, two boys from the city have shown.\n\nShrikrishna Madhusudhanan, a class V student of the Bala Vidya Mandir Global School, Perungudi, and Shyam, a class IX student of the St Michael’s Academy Higher Secondary School in Chennai, have emerged winners in their respective categories in Google India ‘Code to learn’ contest,\n\nThousands of other students participated in the contest.\n\nAs a part of the contest, the students were required to use ‘App Inventor’ or ‘Scratch’, tools invented by MIT and were judged on the application of computer science concepts to their final program.\n\nShrikrishna was one of the three winners from across the country in the classes V and VI category, Shyam was adjudged one of the three winners in the classes IX and X category.\n\n‘Shoot to score’\n\nSpeaking about his win, 10-year-old Shrikrishna said that he had created a computer game called ‘Shoot to score’ which required users to point and shoot at a ball, balloon and a bubble which would drop from the top of the playing screen, thereby earning points for the same.\n\n“I used the ‘Scratch’ tool to develop the game. Since we have been learning robotics in school, I have been making such projects using simple programming from last year, which is why I was able to give this a shot,” said Shrikrishna, who added that he aspired to work on building automatic cars when he grows up.\n\n“Anything associated with computers and robotics fascinates me and being a movie buff, I absolutely love the concepts behind the Transformers and Iron Man movies where the characters use a lot of advanced gadgets and technology,” he said.\n\nThe students had to use ‘App Inventor’ or ‘Scratch’ tools invented by MIT", 
    "section": "national", 
    "title": "City students shine in Google coding contest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}