{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Observing that it is the paramount duty of any welfare State to provide security to the oppressed people, the Madras High Court has upheld the order of a single judge awarding Rs. 10 lakh as compensation to the family of a Scheduled Caste boy who was murdered in a government hostel run by the SC/ ST Welfare Department Kancheepuram district.\n\nThe Division Bench comprising Justices R. Sudhakar and S. Vaidyanathan held that the authorities are vicariously liable to pay the compensation when the murder occurred inside the hostel. On October 1, 2010, a first year ITI student, staying in the Adi Dravidar Welfare Hostel at Kayarkulam, Kancheepuram, was murdered inside the hostel.\n\nThe father of the deceased boy approached the High Court seeking Rs. 15 lakh as compensation alleging that negligence on the part of the authorities resulted in the death of his son.\n\nAdmitting the plea, the single judge awarded Rs. 10 lakh as compensation.\n\nAssailing the order, the State government moved the present appeal contending that vicarious liability cannot be fastened on the authorities and they cannot be held responsible for the death of the student.\n\nWhen the petition came up for hearing, the Bench said, “The hostel is meant for students who come from oppressed section of society. But it did not have a watchman or a proper security arrangement.”\n\n‘Can't shirk from their responsibility’\n\n“It is the duty of the government to provide all the necessary facilities, infrastructure as well as security for students staying in the hostel. In the absence of providing any security, much less, adequate security, the authorities cannot shirk away from their responsibility by merely stating that vicarious liability cannot be fixed on them,” the judges added and dismissed the appeal.\n\nIt is State’s duty to provide security to oppressed people, says Madras\n\nHigh Court", 
    "section": "national", 
    "title": "Compensation of Rs. 10 lakh for SC boy upheld", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}