{
    "author": [
        "R Sujatha"
    ], 
    "text": "Time and again, students and parents complain of exorbitant fee charged by private educational institutions but even approaching the government has been of little help as one parent found to his dismay.\n\nThe daughter of S. Mathi, a public sector employee, had attended counselling at the Siddha Medical College in Arumbakkam for the academic year 2013-14.\n\nBased on the choice she made, she was asked to report to a self-financing homoeopathy college in Rasipuram .\n\n‘Rs. 1.75 lakh as fee’\n\n“On reporting to the college principal , he asked me to pay Rs. 1.75 lakh as lump sum, excluding hostel and transport fees in spite of the government prescribed fee of Rs. 30,000,” Mr. Mathi recalled. I could not afford the fee and my daughter opted to attend the re-counselling session. But the commissionerate said that since the student had already made a choice they could not help her.\n\nAlso, the details of the selected candidates had been forwarded to the Central Council of Homoeopathy in New Delhi. When I pursued the matter further he said the department was authorised only to conduct the counselling. I was asked to make my complaint to the relevant authority,” he added.\n\nHis daughter, who had by then secured a seat in Anna University, began pursuing engineering.\n\nMr. Mathi lodged a complaint with the Selection Committee but there was no response. He then forwarded a copy of the complaint to the Chief Secretary and to the Department of AYUSH, New Delhi. On December 16, 2013 he sent a copy to the Chief Minister’s Special Cell.\n\nOn May 2014, he received a letter from the Directorate of Indian Systems of Medicine informing him that his complaint had been forwarded to the relevant department.\n\nNeed evidence\n\n“There are lots of oral complaints but no one approaches us with confidence. It is an issue of students’ future so parents remain silent. Only after the recent incident in Villupuram college, parents are taking up the issue with courage. However, we need receipts and evidence to pursue any complaint,” said K. Senthamizhselvan, president of AYUSH Medical Practioners’ Welfare Association.\n\n‘There are lots of oral complaints\n\nbut no one approaches us\n\nwith confidence’", 
    "section": "national", 
    "title": "Complaint on exorbitant fee to CM’s cell remains unaddressed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}