{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The civic body builds a new roundabout, hopes to decongest the junction\n\nA view of the new road built at the roundabout junction of Lawsons Road and Bharathidasan Road in Tiruchi on Tuesday.— PHOTO: A. MURALITHARAN\n\nThe Tiruchirappali City Corporation (TCC), which has proposed to build a new roundabout for MGR statue on Bharathidasan Road, plans to acquire a piece of private land for solving the traffic bottleneck.\n\nThe move assumes significance in the wake of apprehension raised by a section of road users over the efficiency of movement of traffic at the proposed roundabout.\n\nAs per the plan, a roundabout will be built around the MGR statue. The area has been encircled by placing temporary barricades now. The Tiruchirapalli City Corporation, to facilitate the construction, has rearranged the traffic flow by demolishing a portion of median on Bharathidasan Road.\n\nSince the electric post and high-mast post were hindering the traffic, they have been removed by the Tamil Nadu Generation and Distribution Corporation (Tangedco) based on the demand of the corporation. The civic body had to pay Tangedco Rs. 3 lakh to shift the two posts.\n\nMeanwhile, the corporation has formed new road around the statue. It has taken steps to level the roads from all the four sides joining the roundabout.\n\nA senior official of the corporation told The Hindu that it had been monitoring the response of road users and movement of traffic at the proposed roundabout. It had been decided to complete the roadwork as quickly as possible. It would improve the traffic movement.\n\nMoreover, it had identified a portion of small land near the roundabout for acquisition. Once done, the apprehension of road users would be addressed. Similarly, the current arrangement would be monitored continuously. The flow of vehicles and difficulties faced by motorists would be studied. If needed, minor changes would be made on the roundabout.", 
    "section": "national", 
    "title": "Corporation plans to acquire private land near MGR statue", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}