{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Activists say civic body constructed two rooms and dug a well on a reserved site\n\nA sewage well that the Coimbatore Corporation has constructed on the reserved site belonging to Kannika Parameswari Nagar at Ramanathapuram in the city- Photo: M. Periasamy\n\nOn a portion of the reserved site that belongs to Kannika Parameswari Nagar and Murugan Nagar (in Ward 68), off Nanjundapuram Road, the Coimbatore Corporation has constructed two rooms and dug a well.\n\nIt has also placed concrete rings in the well.\n\nInquiries reveal that the civic body took up the work more than a year ago to pump water flowing through the storm water drain from the nearby Sripathy Nagar (Ward 75). The construction of rooms and well digging was part of the larger project to construct storm water drain in the area at Rs. 75 lakh.\n\nBut activists cry foul over the civic body’s construction and charge it with having violated rules.\n\nTamil Nadu Reserved Sites Protection Committee member S.P. Thiyagarajan says that the Corporation’s action is patently illegal because it cannot take up construction of pump rooms and well in reserved site earmarked for school and playground.\n\nReferring to plan approval documents, he says that the promoters of Kannika Parameswari Nagar and Murugan Nagar had earmarked the reserved site (19.9 cents) for school and playground. The State Government’s rules and a number of court rulings clearly say that even the civic body, in this case the Corporation, does not have the power to use reserved sites for other than intended purposes.\n\nThe Corporation’s action, therefore, is patently illegal, he adds.\n\nInquiries reveal that the Corporation took up the work a year ago but stopped it midway following objections from Ward 68 Councillor K. Sakthivel. He says that he has lodged a complaint saying how could a reserved site belonging to the ward that he represents could be used for constructing structures for the benefit of the people of the neighbouring ward.\n\nWard 75 Councillor R. Kalaivani says that it does not matter where the reserved site is as the property belongs to the Corporation and it has every right to use the land for public purpose.\n\nA Corporation official says that the civic body has used the reserved site only for public purpose and there is nothing illegal.\n\nMr. Thiyagarajan says that he will move the courts for relief as there are orders clearly stating that even planning authority shall not have power to exempt the land for being put to use for any other purpose.", 
    "section": "national", 
    "title": "Corporation accused of violating rules", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}