{
    "author": [
        "C Jaisankar"
    ], 
    "text": "He claims semi-automated poly greenhouse method can cut costs, improve yield\n\nIt is unusual for the educated youths to take up agriculture as their profession as they usually look for white collar jobs. However, a 35-year-old BE Agricultural Engineering graduate believes that he can make a difference by adopting modern farming technologies.\n\nWhen the horticultural officials were looking for progressive farmers to set up poly greenhouses as part of the National Horticulture Mission in Karur district, R. Bala Saravanan of Erumapatti near Aravakurichi readily came forward to grab the opportunity along with his sister Dhanapakkiam.\n\nUsing his own ideas, experience, educational background, and knowledge, he has gone one step ahead by forming semi-automated poly greenhouse to cultivate vegetables on 1,000 square metre area.\n\nUnlike many other poly greenhouses, his farm does not require too many workers. He controls the operations, including watering, fogging, in-house temperature maintenance, root temperature maintenance, and so on from a master control room. The operations have been brought under sensors so as to make necessary changes in the settings.\n\nThe farmer has set up Reverse Osmosis water treatment plant to use pure water for irrigation.\n\nA water chilling plant has been set up to supply cool water to the crop. Although the actual cultivation was slated to be started in a week, he said the effort would be certainly fruitful.\n\n“I am confident on achieving success, though there is a risk involved in it,” Mr. Saravanan said.\n\nS. Muniandi, Deputy Director, Horticulture, told The Hindu that poly greenhouse technology would wean away farmers from seasonal and conventional cultivation method. High-yielding vegetables such as cucumber and capsicum could be taken up throughout the year irrespective of summer, rainy, and winter seasons. The technology could help farmers cultivate vegetables in a controlled weather condition and in protective environment. It was more cost-effective than traditional methods.\n\nK. Mani, Assistant Director, Horticulture, said the poly greenhouse had been set up at an estimate of Rs. 9.5 lakh. Of it, the subsidy would be Rs. 4.67 lakh. The farmer had spent a few lakh more to give value addition to the technology.\n\nMr. Saravanan said the in-house temperature would be maintained between 30 and 35 degrees during the day. The root temperature would be between 22 and 25 degrees. The poly greenhouse had UV protection to evenly spread the light.", 
    "section": "national", 
    "title": "Cost-effective cultivation method for horticulture crops evolved", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}