{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CAUTIONLINE:The police have pasted notices outside ATMs in Erode asking the public to be careful with pranksters.— PHOTO: M. GOVARTHAN\n\nThe Crime Branch unit here has reached out to the public with messages urging them not to fall prey to con calls made by strangers seeking details about ATM cards identifying themselves as bank managers entrusted with the task of renewing the debit cards.\n\nNo bank official would obtain information pertaining to debit or credit cards from any individual, the Crime Branch has conveyed to the public through notices pasted outside ATMs in and around the city.\n\nThe notice cautions the public against divulging the ATM, pin and CVV (Card Verification Value) numbers to strangers calling over phone, warning that the pranksters would withdraw money using the information.\n\nLikewise, the public have also been warned against believing in phone messages promising car or lakhs of rupees and asking the receiver of the call to furnish their names, age, email and password.\n\nThe receiver will subsequently receive a communication from the pranksters from the other end asking for payment of deposit.\n\nPranksters were also on prowl promising crores of rupees from Bank of Scotland or Coco Cola, and asking for payment of deposit for RBI clearance, the Crime Branch police said.\n\n“We have also put up message boards at various vantage locations to sensitise public to the dangers of divulging information over phone,” Crime Branch personnel involved in investigation of crime cases said.\n\nThe Crime Branch has also mentioned its number 0424-2210010 on the notice, with an advice to pass on information about such pranksters. Absence of complaints about con calls was indicative of the impact created by the posters, the personnel explained.", 
    "section": "national", 
    "title": "‘Do not disclose bank details to strangers’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}