{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "On the second day of the protest by disability rights organisations, a protester said the venue they had been given was riddled with problems.\n\n“We were at the Maharashtra Building Trust in Vepery. There were no ramps for us to get in, only four toilets for about 600 people and an inaccessible mobile toilet that was brought in around 11 a.m. and the place had no water facility,” said S. Namburajan, State general secretary, Tamil Nadu Association for the Rights of All Types of Differently Abled and Caregivers, one of the four organisations protesting.\n\nMember of Parliament Kanimozhi, who visited the protesters, highlighted the problems they were facing on her Facebook page. The mobile toilet, she said, had about seven or eight steps that had to be climbed and were like a ladder.\n\n“There was nothing to hold on to and no railing and hardly any space. There were no water facilities. The protesters were hardly given food and were not allowed to go out. It was appalling and I was really shocked. How can you be so insensitive as to bring such toilets,” she asked.\n\nMs. Kanimozhi said the government had to at least be prepared to have a dialogue with members of the disabled community, listen to their problems and try to address them.\n\n“There are government orders but implementation is not there. This is a crucial issue that should be tackled. The world has to be inclusive – we cannot leave out a section of the population,” she said.\n\nMr. Namburajan said the protesters had met Chief Secretary K. Gnanadesikan around 3 p.m. but that the meeting was disappointing.\n\nThe protesters reiterated their demands for financial assistance for those with 40 per cent and above disabilities and for the State to set aside funds for accessibility among others.\n\n“With the Assembly session starting on the February 16{+h}, we have decided to adjourn the protest till then,” he said.", 
    "section": "national", 
    "title": "Even to protest, disabled activists struggle", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}