{
    "author": [
        "Deepu Sebastian Edmond"
    ], 
    "text": "Educationist Anil Sadgopal says that a battle to end caste and class oppression is taking place\n\nCalling the ongoing protests at the University of Hyderabad (UoH) “probably one of the most important events in post-Independence India,” educationist Anil Sadgopal on Wednesday said that an evolving student politics is the new hope against the Sangh Parivar.\n\nMr. Sadgopal, a former Dean of the Delhi University’s Faculty of Education, was in the city to speak at an international conference organised by the School of Human Excellence, Loyola College. “They are changing the whole politics of the country,” he told of the Ambedkar Students’ Association and described Rohith Vemula’s suicide note as an, “indictment of capitalism.”\n\nLater in a chat with The Hindu, Mr. Sadgopal attempted to trace the evolution of a politics of the subaltern across campuses in the country. “I think what is increasingly happening in the student movement – particularly the Dalit student movement – is that they are beginning to see the flawed political basis of the state, instead of just fighting for some advantages that I call lollypops. Organisations like the Ambedkar Students’ Association or the Ambedkar Periyar Study Circle in IIT-Madras represent a new phenomenon. They question the very premises on which state policies have been made,” he said. According to Mr. Sadgopal, who attempted to trace commonalities between incidents involving the APSC, IIFT and UoH as well as the Occupy UGC protest, what is happening is a synthesis of two ideas: “In Rohith Vemula’s own works, you can see how he attempts to see the common links between Marx and Ambedkar. It is the same about the APSC. That is to say that on the one hand, it is a battle to end caste oppression and on the other hand, class oppression…I think it is a very, very encouraging phenomena. The Occupy UGC struggle is similar when it said – in not such a forthright manner – that taking away our scholarship is a social justice issue.”\n\nHe felt that the conceptualisation of studying Marx with Ambedkar is revolutionary it will help students understand the exclusiveness of the new education policy being drafted. “The economic policies of this government provide a perspective in which the new education policy can be viewed. Skill India, I think, is the most dangerous one. It is because, never in the philosophy of education, skill has been seen in isolation. Skills, along with cognition and value system make up an organic whole when it comes to education,” he said.", 
    "section": "national", 
    "title": "Evolving student politics offers new hope: educationist", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}