{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Say they were not represented on committee; place several demands including a separate ministry\n\nFishers from Tamil Nadu and Puducherry on Tuesday refused to accept the draft National Policy on Fisheries, 2016, stating among other things that they were not represented on the draft committee.\n\nThe stakeholders meet was organised by the Central Marine Fisheries Research Institute here to elicit the views of fishermen of Tamil Nadu and Puducherry on the draft policy prepared by the Committee headed by Dr. S. Ayyappan, Director General, Indian Council for Agricultural Research.\n\nRepresentatives of several fishermen’s associations took the opportunity to place their demands, including a separate ministry, a bank for fishers, inclusion in Scheduled Tribes list, facilities for fish export and export agreements with countries, a detailed study on protected species of fish and educational institutions for fishers. As only four stakeholders consultations have been conducted till now, they said it was insignificant considering the country’s 7,500 km long coastline.\n\nG. Anton Gomez, president, National Union of Fishermen, said the policy aimed to control and regulate fisheries in the exclusive economic zone, an area between 12 and 200 nautical miles, whereas the fishermen of Rameshwaram did not even have 12 nautical miles to fish in. He urged the Centre not to allow non-fishermen into deep sea fishing.\n\nU. Arulanandam of Alliance for Release of Innocent Fishermen, who cited the example of Indian fishermen having rights to dry their nets at Katchatheevu when they use nylon nets, said when non-fishermen were involved in formulating policies for the fishers, such things happen. “The policy talks about the cooperative societies… even in neighbouring Sri Lanka they have been modernised, but in India the societies barely function,” he said.\n\nPollution and various development schemes such as desalination plants, ports and power generation plants led to depletion of resources and thereby loss of livelihood, said K. Bharathi, South Indian Fishermen’s Welfare Association. “The Centre has not done anything to increase fish availability. The policy merely mentions fisherwomen, who form the backbone of every household,” he pointed out.\n\nThe Aikiya Indhia Meenavar Sangam’s Nanjil Ravi said as part of the Swach Bharath Abhiyan effort must be taken to clean fishing harbours and the waterways that empty into the sea. “Though deep sea fishermen are encouraged to catch fish including yellow fin tuna, the government does not have any agreement with other countries to export our fish,” he said.\n\nThe need for a separate bank for fishermen was stressed by Tamil Nadu Meenavar Makkal Sangam’s Ko Su Mani. “Though we come under the agriculture ministry, even cooperative agricultural banks refuse to give us loans,” he said.\n\nM. Ilango, Chairperson, National Fishworkers Forum, said unless there is a separate ministry for the welfare of fishermen, their voice will remain unheard. “The amount allocated for fisheries is very minimal bringing no change in the lives of fishermen,” he pointed out.\n\nY.S. Yadava, Bay of Bengal Programme Inter-Governmental Organisation and Paul Pandian, Commissioner, Fisheries Development, said the views of the fishermen associations would be conveyed to the Central government.", 
    "section": "national", 
    "title": "Fisherfolk reject draft national policy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}