{
    "author": [
        "Special Correspondent"
    ], 
    "text": "58-year-old undergoes unconventional hip replacement surgery\n\nWhen Frederick Schmidt landed in Chennai and was picked up at the airport to go to hospital, it was, he says, “like being transported to a different kind of world.”\n\nMr. Schmidt, who was once part of the pre-Olympics team for skiing, arrived on January 26 for a hip resurfacing procedure – a procedure he hoped would give him unrestricted movement and the ability to carry on with his many sporting activities.\n\nA mountain biking injury in 2012 had broken his leg, but while the leg had been fixed, a resulting hip injury had remained and grown worse over the next three years, developing into secondary osteoarthritis.\n\n“I began exploring hip replacement options but in Sweden, the procedure offered would have made it impossible for me to bike and run,” said the 58-year-old, who now runs a training academy.\n\nAnd so, Mr. Schmidt began researching other options. He found that doctors in England and Germany performed hip resurfacing procedures, but he also found that Vijay C. Bose at SRM Institutes for Medical Science performed an adaptation of the procedure that would perhaps be the best option for him. That and the cost – less than half of what it would cost in Europe, decided it for him.\n\n“I wrote to Dr. Bose, he explained the procedure to me, and a date was fixed for January 28. But I had a lot of concerns about coming for a surgery to India and I had made a second appointment in Sweden. I’ll have to cancel that now,” Mr. Schmidt says, laughing.\n\nThe procedure, explains Dr. Bose, is different from conventional hip replacement in that it does not replace the femoral head (head of the thigh bone). “The head is kept intact, and we put a cap on it – a metallic cap made of an alloy of cobalt and chromium. The advantage with this is that not only does it preserve bone stock, the natural biomechanics of the socket are also left intact. So, all we do really, is replace the worn out cartilages. My adaptation of this procedure involves preserving the capsule – the fibrous covering of the hip joint. Generally, this is removed during surgery, but I isolate it, cut through it, perform the surgery and then, repair it. This helped preserve blood supply to the femoral head,” he says.\n\nThe procedure is not suitable for everyone, says Dr. Bose.\n\n“It is meant for younger people and those who do a lot of sports or physical activities. A lot of my patients are those who have developed premature arthritis and are sill quite young,” he said, adding that he had performed over 2,000 such procedures.\n\nTen days after the one-and-a-half-hour surgery and four days of physiotherapy later, Mr. Schmidt has already walked 12 km near his hotel in Mamallapuram.\n\nUp next: at the end of August, he is hoping to run through the Alps for 10 days. “But it’s not set in stone,” he says, smiling. “I’ll see how I feel. Right now, I’m incredibly happy.”\n\nThe procedure involves replacing worn out cartilages and preserves\n\nbone stock", 
    "section": "national", 
    "title": "For Swedish athlete, new paths beckon after surgery", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}