{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Looking to the future:A group of transwomen at the job mela organised by Chennai police in a hotel at Egmore on Tuesday —Photo: R. Ragu\n\nEvery day, Rekha (name changed), a transgender, would look at employment columns in newspapers, but would never muster the courage to apply for any of the jobs mentioned. She was certain she would not be treated well.\n\nBut when the Chennai police organised a job mela for transgenders, she had no hesitation.\n\nOn Tuesday, over 200 transwomen assembled at a hotel in Egmore to take part in the job mela.\n\n“Before this, no one had collected data about transgenders and their qualifications with a view to ensuring employment for them,” said Jaya, general manager, Sahodaran, a male sexual health project.\n\nSenior police officers addressed the meeting and gave them motivational talk.\n\nBanks pitch in\n\n“They took details such as educational qualifications, preferred job and place of work and expected remuneration from us. Some bank officers also attended the meeting and explained how we could get loans and set up our own businesses,” said Swetha, board member, Thozhi.\n\nThe details collected will be forwarded to different companies and the selected candidates will find employment.\n\n“Those who do not have the requisite educational qualifications will get the job of an office attendant. Many NGOs, self-help groups, corporates and some banks have shown interest in recruiting them,” said Shyamala Devi, additional deputy commissioner of police, Central Crime Branch (CCB).\n\nNeed for free homes\n\nHowever, some of them felt that the government should first provide them with free homes in Chennai.\n\n“It has been done in other districts, but not in the capital. Many of us pay a rent of over Rs. 6,000. It would be beneficial only if we got a salary of Rs. 20,000,” said a transwoman candidate.", 
    "section": "national", 
    "title": "For transgenders, job mela offers a ray of hope", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}