{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In Tamil Nadu they are getting Rs. 10,000 per month but in other states the salary is Rs. 25,000\n\nGuest lecturers of government colleges stage a protest near the Office of the Joint Director of Collegiate Education in Vellore on Tuesday.- Photo: C. Venkatachalapathy\n\nMembers of Tamil Nadu Government Arts College Guest Lecturers Welfare Association staged a protest on Tuesday demanding a salary of Rs. 25,000 per month as per the recommendation of University Grants Commission (UGC).\n\nIn Tamil Nadu, the guest lecturers were being paid a salary of Rs. 10,000 every month for 10 months – June to March.\n\nUGC recommendation\n\nHowever, States such as Andhra Pradesh, Kerala, Karnataka and West Bengal were following the UGC recommendation and were paying Rs. 25,000, they said.\n\n“We are not paid for the months of April and May though we work during the two months. The Chief Minister, before coming to power in 2011, assured us that guest lecturers would be regularised if she was voted to power. But nothing has been done so far,” said S. Kannadhasan, branch secretary of the association, Cuddalore.\n\n3,400 lecturers\n\nHe said there were 3,400 guest lecturers working in government arts and science colleges across the State.\n\nAt least 90 per cent of them were qualified with Ph.D/SLET/NET or with M.Phil as mandated prior to 2009, he added.\n\nThey took classes for around 17 hours every week. They staged a protest on the premises of the Joint Director of Collegiate Education office, Vellore region. The association also objected to the move of absorbing assistant professors of Annamalai University, Chidambaram into government arts and science colleges saying that it has affected the employment opportunities of several guest lecturers. He said that they will continue their protests in the coming days demanding salary as per UGC recommendations for 12 months.\n\n“We are not being paid for April and May though we work during the two months”", 
    "section": "national", 
    "title": "Guest lecturers protest demanding higher salary", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}