{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An initiative to meet the requirements of budding innovators and scientists\n\nA group of children from R.C. Middle School, Thazhamuthunagar near Thoothukudi, taking a look at the Dinosaur model kept at District Science Centre in Tirunelveli on Tuesday.— Photo: A. Shaikmohideen\n\nThe District Science Centre, which attracts good number of visitors everyday, is all set to add one more attraction – Innovation Hub – with the objective of enabling visitors to express their groundbreaking technological ideas that may revolutionise living standards of the common man.\n\nThe objective of the initiative is to meet the requirements of budding innovators and scientists. Innovation hubs that are equipped with Hall of Fame stories of inventions and inventors, multimedia kiosks to explore major inventions, e-journals, books and portals, technology labs for robotics provides an opportunity for children of various age groups to work at the centre during weekends so as to develop their ideas on science and technology.\n\nThe National Council of Science Museums (NCSM), which is an autonomous body under the Ministry of Culture, has taken an initiative to establish innovation hubs in its science centres across the country.\n\nThe proposed facility, which would be created on an outlay of Rs. 1 crore, will provide the much-needed opportunity to visitors, right from students to the common man, to express their new scientific ideas. If there was more scope for further fine-tuning of those ideas, the District Science Centre, after digitizing the visitors’ concept, will rope-in an expert from the field for wider discussion between him and the proponent.\n\n“If a visitor submits his proposal at the Innovation Hub on synthesizing the right alternative for plastic, it will be evaluated. If it is found to be suitable for further fine-tuning, an expert in this field will meet the visitor at the Hub and work together for preparing the ultimate product, which should be able to effectively replace plastic,” Navaram Kumar, District Science Officer told The Hindu here on Tuesday.\n\nAs a precursor, the DSC will organise a techno-fair titled ‘Engineering Tirunelveli 2050’ between March 3 and March 15, in which students of engineering / polytechnic colleges can display their innovative products / working models. “Aspiring budding engineers should submit their titles and the abstract on or before February 26 so that we can select the right models for the expo,” Mr. Navaram Kumar said. On the number of visitors coming to DSC, he said 2,96,177 persons had visited the centre since April 1, 2015 as its galleries were so educative.\n\nEchoing his assertion, Vincent Ananathraj, Headmistress of RC Middle School, Thaalamuthu Nagar near Thoothukudi, who was visiting the DSC on Tuesday along with 130 students and a team of teachers, said they could use the working models to explain even tougher scientific principles to their students. “Since the children could understand the principles by doing, the level of retention will be really high,” Ms. Vincent said.", 
    "section": "national", 
    "title": "‘Innovation Hub’ to come up at District Science Centre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}