{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P. A. Ponniah, Railway Colony, 7.30 p.m.\n\nSaiva Siddhantha Sabha: Discourse on ‘Tiruvasagam’ by Yazh S. Chandra, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nYadava College: C. Dhanasekaran, Principal (in-charge), inaugurates blood donation camp, Nagendran Auditorium, 10 a.m.\n\nRass Academy College of Nursing: Graduation Day; M. Nalla Mohammed, District Educational Officer, addresses; C. Ravisankar, chairman, presides, Poovanthi, 10.30 a.m.\n\nFederation of Indian Export Organisations: International Business Forum, Mohammed Al Mahmoud, Commercial Director, Sharjah Airport International Free Zone Authority, addresses, Gateway Hotel, Pasumalai, 5 p.m.\n\nM. S. Chellamuthu Trust and Research Foundation: Professional meeting on ‘Importance of medication;’ M. Ramu addresses, 662 K. K. Nagar, 8.30 a.m.\n\nTopkids: Counselling session, All-Women Police Station, Tallakulam, 10.30 a.m.\n\nNala Dental Hospital: Programme on ‘Advantages and benefits of laser in dental treatment,’ Chokkikulam, 11 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Deep Hospital, K. Pudur, and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}