{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A Coimbatore court has found painter Antony of Sulur guilty of murdering his wife Krishnakumari by immolating her in December 2009. The prosecution case was that following frequent disputes between the couple, Antony on December 17, 2009 doused his wife with kerosene and set her ablaze near their house in Pallapalayam. Their neighbours rescued and rushed her to Coimbatore Medical College Hospital, where she gave a dying declaration implicating Antony. Based on the declaration and evidences, the court found him guilty and sentenced him to life, the sources said.\n\nYouth killed\n\nin accident\n\nI. Sahul (18) of Podanur died on Monday to injuries he had sustained in an accident on Sunday.\n\nThe Traffic Investigation Wing-West Police said that Sahul’s motorcycle and a private bus were involved in the accident that took place around 8 p.m.\n\nA case has been registered against driver K. Loganathan (42) on charges of rash and negligent driving\n\nHouse burgled\n\nUnidentified persons gained entry into K. Kanagaraj’s house in Ganesh Layout, Nallampalayam, on the intervening night of January 6 -7 and decamped with jewellery weighing seven sovereign, said the Thudiyalur Police, who have registered a case. Kanagaraj was away in Chennai to meet his daughter. He learnt of the incident from his neighbour Ganesh.\n\nTwo held\n\nThe Kovilpalayam Police have arrested Prabhu (26) and Bhuvanes (26) on charges of murdering Arasur resident Rajkumar on Saturday.\n\nThe Police who had registered a case after Rajkumar’s body was found in Devampalayam learnt that he was murdered. They then tracked the calls he had made and based on the record zeroed in on two of his estranged friends, Prabhu and Bhuvanes.\n\nDuring the course of the inquiry, the two confessed to murdering Rajkumar after he refused to get his sister married to Prabhu. The Police said that Rajkumar befriended the two more than a year ago when the three were workers in a foundry in Vellamadai.", 
    "section": "national", 
    "title": "Man sentenced to life for murder", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}