{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At its 67{+t}{+h}annual conference to be held from February 10 to 12, the Cardiological Society of India will formulate guidelines for the management of acute heart attacks as well as congenital heart diseases, said S. Shanmugasundaram, organising secretary of the conference.\n\n“So far, we have been following guidelines formulated by organisations in the west. But these might not suit Indian communities and may not be cost-effective. We have already formulated guidelines for high cholesterol and hypertension, and are now planning guidelines for two more diseases,” he said.\n\nD. Vaidyanathan, chairman of the reception committee for the conference explained that for instance, as insurance coverage for health in India was still low and the cost of angioplasty high, pharmacoinvasive strategy could be used first in case of a heart attack – to dissolve a clot and for some blood flow to be restored — before a patient could take up angioplasty. “This can be done even in an ambulance or at a village hospital as it might take some time for the patient to reach a centre where angioplasties are performed,” said Dr. Shanmugasundaram.\n\nThe other focus of the conference would be discussing new developments in the field in India, including drugs and manufacturing of stents, he said.\n\nAbout 4,500 delegates are expected to attend the conference, with about 500 from South Africa, Nepal, Bangladesh, Sri Lanka and the UAE. About 40 well-known cardiologists and cardiac surgeons from the USA, U.K., Australia, UAE and Europe will participate as faculty, and 320 senior cardiologists from India will form the national faculty at the conference.\n\nThe conference will be discussing new developments in\n\nthe field of cardiology\n\nin India", 
    "section": "national", 
    "title": "Meet to list norms on managing heart attacks", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}