{
    "author": [], 
    "text": "Noting that unless the petitioner proves that there was a defect in conducting a post-mortem examination or a procedural violation, any plea for a fresh autopsy cannot be entertained, the Madras High Court on Tuesday dismissed the petition moved by the father of Saranya, one of the three girl students of SVS Medical College of Yoga and Naturopathy, who were found dead in a well next to the college.\n\nRefusing to concur with the contentions of the petitioner that since the postmortem report was silent on the cause of death and a fresh autopsy would bring out the truth, Justice R. Mala said, “If a person has died under suspicious circumstance, after conducting autopsy, the internal organs will be sent to the Forensic Science department to obtain viscera report to ascertain whether any poisonous substance could be traced. Only after obtaining the report can a final opinion be given on the cause of death.”\n\nTherefore, the second postmortem examination cannot be ordered merely because the cause of the death is not mentioned in the first report, the judge added.\n\nWhen the petitioner’s counsel R. Sankarasubbu pointed out that the High Court had allowed a similar plea moved by father of another girl Monisha, the judge said, “Just because the court has allowed the plea of Monisha’s father, it is not necessary to allow this petition too.” The judge then directed the Public Prosecutor S. Shanmuga Velayutham to file a status report on the investigation and the second post-mortem examination report of Monisha on Friday.\n\nRejecting the request of the prosecutor that he must be allowed to file the reports in a sealed cover before the court, Justice Mala said, “The petitioner, who is the father of the deceased girl, is entitled to know the status.”\n\nHigh Court calls for status report on investigation", 
    "section": "national", 
    "title": "Plea for fresh autopsy on college girl rejected", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}