{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Fishing community fears that its occupational right and free life would be affected\n\n: Scores of fishermen and women from Veerampatinam, supported by social activists, conducted a massive demonstration demanding that the Coast Guard and the Union Territory (UT) government give up the proposed hover port in the coastal village.\n\nFearing that their occupational right and independent and free life would be affected by the facility, the fishing community has been opposing the project ever since its conceptualisation in 2004.\n\n‘Will restrict movement’\n\nAssembling in front of the Head Post Office here on Tuesday, they raised slogans against the Centre and UT government.\n\n“The setting up of a hover port would hamper our free movement and fishing activities. We were not consulted about the project,” said S. Sundari, a fisherwoman of Veerampatinam.P.S. Sakthivel, one of the office-bearers of fishermen panchayat, said, “Even as we have been opposing the project since 2004, the authorities started work at the proposed site on January 15 last and have fenced the area. The hover port is being built in the northern part of the village without any public consultation. Our worry is that it would cripple our movement and we may not be able to dry our fishing nets there.” The protestors also alleged that their relatives and friends from outside the village, as well as devotees to the famous Sengazhuneer Amman Temple might face restrictions.\n\nAffect fish catch\n\nThey also claimed that the frequent movement of hovercrafts in the sea would adversely affect the fish catch.\n\nR. Mangaiyarselvan, organiser of a fishermen’s welfare association, said the authorities had not taken any initiative to allay the fears of the people in the last 12 years through dialogues and discussions.\n\n“Instead, they are attempting to coerce the people into giving their consent for the project. We will intensify the agitation if the authorities fail to respond to our demands,” he warned.\n\nCases registered\n\nCases under non-bailable Sections have been registered against the leaders of the fishermen panchayat who went to oppose the foundation-laying ceremony.\n\nG. Sugumaran, secretary of the Federation of People’s Rights, said filing cases against the leaders was undemocratic and must be withdrawn. “The government should also realise that this facility, within a distance of 50 metres, violates the Coastal Zone Regulations.”", 
    "section": "national", 
    "title": "Protest against hover port at Veerampatinam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}