{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "The plan will help modernise suburban stations in particular\n\nIn a move that would bolster the ‘Swachh Bharat’ and ‘Smart Cities’ initiatives of the Union Government, the Ministry of Railways has opened the doors to Public Sector Undertakings (PSUs) and Corporates to sponsor modern passenger amenities and cleanliness/sanitation projects at railway stations.\n\nThe focus will be more on tapping solar/wind energy, creation of amenities like elevators, escalators, setting up of water harvesting/conservation facilities and establishing eco-friendly faecal treatment/disposal arrangements.\n\nSouthern Railway has 28 important stations classified under the A-1 and A-2 categories, where there is scope for development on various fronts. Since there is already a plan to develop major stations across the Railways under a different action plan, this move to rope in sponsors is expected to go a long way in modernising suburban stations that lack basic infrastructure such as potable drinking water, usable toilet facilities and seating arrangements. Of course, a lot remains to be done when it comes to hygiene on railway premises, say passengers.\n\nGoing by the new plan, the authorities will sign a memorandum of understanding with the sponsors and make sure that the project proposed is executed within two years. The facilities created will become a property of the railways and the sponsoring entity shall have no right on the assets or indulge in commercial exploitation. Where sponsors don’t offer to operate or maintain, the cost of the same will be borne by the railways.\n\nThough no space would be given for the sponsors to advertise their products, the railways may allow putting up a plaque or a board acknowledging the contribution by way of showcasing the PSU or company’s logo or brand. However, this facility would be extended only to contributions exceeding Rs. 50 lakh or above. The Railways will adopt innovative strategies to encourage PSUs and Corporates to take up projects under the aegis of their Corporate Social Responsibility (CSR) funds.\n\nIn a circular issued to General Managers of all zones, the Railway Board has listed out the nature of works that can be taken up under the CSR category. Wind and solar power plants can be built for catering to energy requirements at railway stations, hospitals, level crossing gates and signalling equipments. For success in cleanliness/sanitation projects on a sustainable basis, the Railways called for innovative communication strategies to create awareness and bring about a change in the behaviour of rail users.\n\nSanitation problems\n\nIt was noted that open defecation along the approaches to railway stations was a threat to safety of trains and it also affected track maintenance and hygiene in the area. “The problem is due to non-provision of civic amenities by local bodies for the residents (primarily unauthorised slums) in adjoining areas. Innovative infrastructure and sanitation solutions, including behavioural change strategy, can be sponsored as a project by the companies,” the circular said.\n\nWater conservation, recycling and rain harvesting works, sewage and effluent treatment plants, waste-energy plants, energy-efficient fixtures and equipment, protection and development of water bodies on railway lands, measures of natural air-conditioning of railway buildings, including geo-thermal cooling/heating and providing drinking water (reverse osmosis or any other water filtering system) are some of the projects the PSUs/corproates can take up for the railways.", 
    "section": "national", 
    "title": "Railways rolls out red carpet to sponsors", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}