{
    "author": [
        "T Madhavan"
    ], 
    "text": "Municipality hopes Venkatamangalam waste-to-energy conversion facility will be part of solution\n\nThe municipality has acquired two mini-compactors to improve the efficiency of the Venkatamangalam plant —Photo: G.Krishnaswamy.\n\nThe Sembakkam Municipality is confident that the issue of garbage being dumped in the Sembakkam lake will be resolved soon. Its optimism is based on an initiative aimed at promoting conversion of waste into energy.\n\nThe chairperson of Sembakkam Municipality G.M. Santhakumar said efforts to optimally use the waste-to-energy conversion facility at Venkatamangalam, near Vandalur, which had been launched by Chief Minister Jayalalithaa, would provide part of the solution.\n\nOptimal use of the facility automatically involves better waste management, towards which the municipality has acquired 80 new garbage bins, 30 push carts, and two mini-compactors. The municipality generates more than 25 tonnes of wastes from its 15 wards.\n\n“According to the new arrangement, door-to-door collection of garbage will continue. Workers have been instructed to offload the garbage into the bins, which would be cleared every day. The 15 wards have been bifurcated into three zones and supervisors would be on call to oversee the operations,” said Mr. Santhakumar.\n\nThe municipal administration faced stiff resistance from residents’ welfare associations for using the lakebed for disposal of waste, over the years.\n\nThey filed petitions with the National Green Tribunal’s southern bench, which passed strictures not only on Sembakkam Municipality, but also on bigger municipalities like Pallavaram and Tambaram.\n\nAs per the new arrangement, the municipality needs a space for waste segregation. A proposal for making the present location – Sembakkam lakebed – a garbage transfer station was opposed by Dravida Munnetra Kazhagam members in the municipality. The municipality has already paid Rs. 2.73 lakh towards consultation fees to the Centre for Environmental Studies, Anna University, for help in converting the present location as transfer station and removing garbage from the fringes of the lake.\n\nSembakkam municipal councillor, S. Lakshmipathy Raja said the dumping of garbage had been stopped and the process of getting a suitable land for a transfer station would be facilitated by a team under the Chairman of the Municipality. He urged the municipal officials to remove the sewage lines letting untreated sewage into the lake and also the blocks in the supply channels, so that the lake continues to receive water.\n\n“We hope the Municipality acts on our demands for a pollution-free locality,” he said.", 
    "section": "national", 
    "title": "Saving Sembakkam lake from trash", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}