{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prior to their posting as sub-inspector at the field level, a select batch of 150 special sub-inspectors (SSI) of various districts falling under the Tiruchi Range are being given an orientation on a range of topics connected with their line of work.\n\nThe pre-promotion training exercise for the chosen SSIs that commenced at the District Armed Reserve premises here on Monday would go on for nine weeks. A training module has been prepared by the police as per which the SSIs would be put through indoor and outdoor sessions every day barring Sundays. The select SSIs attending the training are from Tiruchi City, Tiruchi Rural, Ariyalur, Karur, Pudukottai, and Perambalur districts. Thirty seven of them are from Tiruchi city police alone.\n\nSenior police officers in the rank of inspectors and law officers would handle sessions on a slew of subjects for the SSIs at the Commando Barracks.\n\nThe theoretical sessions as per the training module covers various subjects including investigation, forensic science, forensic medicine, human rights, criminology, Code of Criminal Procedure, Indian Evidence Act, Indian Penal Code, and Special and Local Laws.\n\nPolice sources said the day-long sessions commences at the crack of dawn with parade for about couple of hours. This is followed by theoretical sessions for the whole day. Upon completion of nine-week pre-promotion training, the SSIs would undergo practical training for three months at the station level, a the senior officer said.\n\nThe chosen SSIs were those who had put in at least 20 years of service in the police force.\n\nSuch training exercises for the field-level police personnel used to be conducted at the Tamil Nadu Police Academy at Oonamancherry near Chennai.\n\nHowever, this time around the training for the SSIs at the range level was being held at Tiruchi, the sources said and added that tests would be conducted for the participants.", 
    "section": "national", 
    "title": "Special Sub-Inspectors undergo training ahead of promotion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}