{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "The State will be having an additional 17.3 lakh tonnes of storage capacity to hold agricultural produces once the Rs. 1,400 crore sanctioned by NABARD from the Warehouse Infrastructure Fund (WIF) been fully utilised, according to NABARD Deputy General Manager K. Arthanareeswaran.\n\n“We have sanctioned the amount from WIF, which is a corpus created out of the shortfalls in priority sector lending by the banks, over 2013-14 and 2014-15 fiscal and the works on various projects are currently underway”, he told The Hindu on the sidelines of a regional conference NABARD organised here for government officials on rural infrastructure improvement projects.\n\nThe scientific storage capacities, thus created, would help the farmers to gain better unit value for their produces and also avoid them from distress sale when glut was prevailing in the market.\n\nAccording to him, the government departments and agencies should give more focus on irrigation, agricultural and allied activities like dairy when utilising the funds created under Rural Infrastructure Development Fund (RIDF).\n\n“We have earmarked Rs. 2,000 crore under RIDF for Tamil Nadu during the current fiscal (2015-16) so as to ensure development in agricultural activities, social sector development like drinking water supply and health, and connectivity improvement through provisions of roads, all specifically in rural areas”, he said.\n\nAbout 40 per cent of the RIDF allocation to the State was being used for providing irrigation and agriculture activities with the rest been meant for social and connectivity sectors.\n\nNABARD officials briefed the representatives from various government departments/agencies on how to effectively plan rural development using the allocations under WIF and RIDF.\n\nThe storage capacity will help farmers gain better unit value for their produces", 
    "section": "national", 
    "title": "State will soon have more capacity to store produces", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}