{
    "author": [
        "T K"
    ], 
    "text": "The percentage of women winning Assembly elections in Tamil Nadu compared to the number of seats contested by them has seen a decline during the last three polls.\n\nWhile in 1991, women candidates won 31 per cent of the seats contested, an analysis of the Election Commission of India statistics shows that women in the State won merely 6 per cent of the seats they contested in 1996, 22 per cent in 2001, 14 per cent in 2006 and just 11 per cent in 2011.\n\n“The percentage of women winning also depends on the winning chances of the parties that are fielding them. When the big parties field women candidates, their ability or chance to win depends on how the parties do in the elections,” U Vasuki, vice-president of All India Democratic Women’s Association (AIDWA) said.\n\nFunds problem\n\nWomen are at a disadvantage at the polls as they also find it difficult to raise funds. “Contesting elections has increasingly become an expensive affair. Women don’t have the means to raise that much money,” contends Anandhi Shanmugasundaram, Associate Professor, Madras Institute of Development Studies said.\n\nThe decline in the number of women winning compared to the seats contested also has to be seen in the light of the number of women filing nominations as Independent candidates. Independents have filed more nominations in the elections since 1991 than women being nominated by political parties.\n\n“If you look at some of the political parties that are caste based, they want to keep up their patriarchal mindset,” Ms. Anandhi said, adding that women are getting distanced from the political process. “Corruption and the kind of mobilisation of money needed for sustaining at the elections is something that is making it difficult for women candidates. Also, women seem to be becoming invisible in party activities across all parties,” she added.\n\nApart from the AIADMK, no party, including the DMK, has fielded more than 9 per cent women of the total seats they have contested in each election.\n\nIn the last Assembly election, the DMK fielded only 11 women candidates, while the AIADMK fielded 12. Independents filed more than 60 nominations. Despite 143 women fighting the elections, only 11 per cent were successful.\n\nMs. Vasuki said there is a need to have constituencies reserved for women like in local bodies in Tamil Nadu where 50 per cent of the seats are reserved for women. “We need a constitutional amendment for that. Overall, if such legislation is passed, whichever party fields a candidate, ultimately it will be a woman candidate,” she said.\n\n“When there are reserved constituencies for SC/ST’s, why not for women? Ultimately, the law needs to be passed in Parliament to at least have 33 per cent reservation for women in politics. But what is stopping all the parties from bringing in the law,” asked DMK MP Kanimozhi.\n\nThe percentage of women winning polls falling since 2011", 
    "section": "national", 
    "title": "Success rate of TN women in polls dismal", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}