{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "Thoothukudi airport has joined the elite zone with the launch of Wi-Fi mobile data offloading service by Bharat Sanchar Nigam Limited (BSNL). K. Saju George, General Manager, BSNL, Thoothukudi, inaugurated the facility at the airport on Tuesday evening in the presence of E.C. Taji, Director, Thoothukudi Airport. The BSNL has introduced the facility free of cost to the Airports Authority of India to benefit passengers. The BSNL had deployed this technology in association with Quadgen Wireless Solutions Private Limited, Mr. George said.\n\nReferring to access procedures, he said that passengers could use the Wi-Fi free for the first 15 minutes once a month. After the free usage limit, passengers could avail themselves of the facility at Rs.30 with 200 mb speed for one day, Rs. 50 with 400 mb speed for one day, Rs. 90 with 800 mb speed for one day or at Rs. 150 with 1.5 gb speed for one day by making an online payment. This is part of the Digital India initiative by the Central government and the BSNL has launched Wi-Fi hotspots across India to offer Internet access to people on the move. Further, the General Manager said that the BSNL had already launched 5G Wi-Fi services in 10 States at historic monuments and public places such as Taj Mahal, Varanasi ghats, Sarnath temple, Konark temple and Charminar.\n\nLikewise, in Tamil Nadu, this facility was in existence at Thanjavur Big Temple, airports in Tiruchi, Madurai and Coimbatore and more places would be covered soon. Plans are afoot to create Wi-Fi hotspots at Thoothukudi railway station, Collectorate, government medical college and crowded localities, including shopping malls.\n\nSri Venkateswarapuram village panchayat in Sathankulam taluk, adopted by DMK Rajya Sabha MP Kanimozhi, would also have Wi-Fi facility. With all means of connectivity, Thoothukudi as a port city had a lot of potential in future, he said. For better speed and connectivity, 62 towers of 3G mobile service would additionally be erected in Thoothukudi district apart from the existing 32 towers.\n\nD.R. Kodeeswaran, secretary, Indian Chamber of Commerce and Industry, and member of Airport Advisory Committee, said that three airliners – Jet Airways, Air Coasta and Air Pegasus – were willing to operate flights from Thoothukudi airport, which desperately required an expanded runway, for which land acquisition should be completed at the earliest.", 
    "section": "national", 
    "title": "Thoothukudi airport gets Wi-Fi facility", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}