{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, Namperumal purappadu from sanctum sanctorum in tholukkiniyan, 7.30 a.m.; reaching Renga vilasa mandapam, 8 a.m.; purapadu from the mandapam, 4.15 p.m.; reaching vagana mandapam, 6.30 p.m.; purapadu in Hamsa vaganam, 6.30 p.m.; reaching vagana mandapam at thiruveedhi valam, 7.45 p.m.; purapadu, 8.30 p.m.; reaching sanctum sanctorum, 9.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Adhava Residential Complex, Amma Mandapam Road, Srirangam, 6 p.m.; Sri Vaishnava Ramanuja Koodam, 12, Malligaipoo Agaraharam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 21, Teachers Colony, 6 p.m.\n\nGENERAL\n\nSt. Joseph’s College Economics Association : Lecture on Economic theory in retrospect by N.Prasanna, assistant professor, Bharathidasan University, noon.\n\nSeshasayee Institute of Technology : Leadership lecture series, lectures on Leadership Skills and Renewable Energy Sources by G.Balamurali, Executive Engineer, Tangedco, Chennai, 10 a.m.\n\nSeethalakshmi Ramaswami College Department of Nutrition and Dietetics : Seminar on Brain training for teens, R.Kumar, Head, Department of Psychiatry, Manakkula Vinayagar Medical College, inaugurates, 9.30 a.m.\n\nNational College : Chemistry Association meeting, V.Alex Ramani, associate professor, St.Joseph’s College, speaks on Chemical Techniques in Phytochemical Research, 11.30 a.m.\n\nShrimati Indira Gandhi College CSI Women Students’ Branch and Department of Computer Science: Training on Tamil computing for B.Lit students, 9 a.m.\n\nJamal Mohamed College : National conference on Graph theory, fuzzy graph theory and their applications, R. Ravichandran, senior principal scientist, Structural Engineering Research Centre, Taramani, inaugurates, 9.30 a.m.\n\nSaranathan College of Engineering Electrical and Electronics Engineering Department : Awareness programme on Intellectual property rights and innovations, M.Kantha Babu, Director, Centre for Intellectual Property Right, College of Engineering, Guindy, speaks, 1.30 p.m.\n\nM.A.M. School of Engineering : Workshop on Advanced Java, N.Ramalingam of HCL, resource person, 10 a.m.\n\nAIMAN College of Arts and Science for Women : Special address by Gayathri Padmanaban, chief dietician, KMC Speciality Hospital, noon.\n\nOrdnance Factories Sports Promotion Board and Heavy Alloy Penetrator Project : All India Ordnance and Ordnance Equipment Factories inter-zonal badminton tournament, 9 a.m.\n\nCARE Group of Institutions and National Science and Technology Entrepreneurship Board : Entrepreneurship awareness camp, A.Parthasarathi, Director, Baby Engineering Pvt.Ltd., inaugurates, 10 a.m.\n\nSeethalakshmi Ramaswami College : Lecture on Human rights in Tamil literature by S.Karuthan, assistant professor, National College, 2 p.m.\n\nSt.Joseph’s College Department of Physical Education : Centenary tournaments – volleyball, Rev.S.John Britto, Rector, inaugurates, A.Murugesan, Superintendent of Prisons, Tiruchi Central Prison, chief guest, 7 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}