{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A 74-year-old man became the first person in Apollo group of hospitals to undergo transcatheter aortic valve replacement (TAVR), hospital sources claimed on Tuesday.\n\nIn the procedure, a valve made from the pericardium of a cow and placed inside a stent is inserted through the large artery in the groin, neck or underarm.\n\nThe valve remains folded during insertion and opens up when warm blood flows through it.\n\nN. Padmanabhan, who had undergone a bypass surgery in 2005, suffered from severe breathlessness, sleep apnea, chronic obstructive pulmonary disease, high BP and diabetes.\n\n“I couldn’t walk more than five feet. I had to be transported in a chair from the first floor to the ground floor in my house. Now I walk up the 21 steps, though I take three breaks,” he told reporters during an interaction on Tuesday.\n\nAs the Aynavaram resident could not be considered for another open heart surgery, doctors told him a non-invasive procedure would help.\n\n“He was suffering from aortic stenosis, a degenerative condition that comes with advanced age. The aortic valve had thickened and calcified due to wear and tear and needed to be replaced. People could live with it for long, but if we don’t treat at once the onset of symptoms, it could become serious. The patient was suffering from other co-morbid conditions such as poor kidney function, severe asthma and anaemia. We did a CT, ECHO and an angiogram to assess the patient,” said interventional cardiologist G. Sengottuvelu.\n\nAccording to him, the valve has been around for the last 10 years. So far, it has been used on 40,000 patients across the world. In India, as many as 20 persons have undergone the procedure.\n\nThe entire procedure costs around Rs. 18 lakh, with the valve priced at Rs. 13 lakh. The advantage of the procedure is that the patient’s condition returns to normality immediately after the procedure.\n\nMr. Padmanabhan was discharged four days after surgery, Dr. Sengottuvelu said.\n\n74-year-old man is the first person in Apollo group of hospitals to undergo the procedure", 
    "section": "national", 
    "title": "Transcatheter aortic valve replacement performed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-10"
}