{
    "author": [], 
    "text": "The World Health Organization (WHO) has asked all countries, including India, to introduce age-classified ratings for films and other entertainment programmes with tobacco imagery to restrict the number of new adolescent smokers.\n\n“Today, we want to emphasise that governments should require age-classification ratings for films with tobacco imagery to reduce the overall exposure of youth,” said Dr. Armando Peruga, chief coordinator for WHO’s Tobacco Free Initiative, releasing the third edition of a report called ‘Smoke-free Movies’.\n\nIn 2013-14, adolescents in the U.S. were exposed to 3.1 billion in-cinema tobacco use impressions, 46 per cent of which were from PG-13 films, Mr. Peruga said. This classification calls for parental guidance when watched by children under 13.\n\n“Taking advantage of the progress that they [Indian government] have made, I think, the next step for India is certainly to introduce a rating system for not only movies but also TV programmes and other entertainment products,” he said.\n\nStudies by the U.S. National Cancer Institute and the U.S. Surgeon General have concluded that smoking in films leads to 37 per cent new adolescent smokers.\n\nRestricting exposure\n\nThe U.S. Centres for Disease Control and Prevention in 2014 estimated that exposure to on-screen smoking would lead to six million new young smokers of which an estimated two million would die of tobacco-induced illnesses.\n\n“Smoking in Hollywood films comprises the main exposure of adolescents in Western nations. The study in India deserves special consideration because films made in India constitute the primary exposure in the country,” the report said. “Another measure that we recommend is certification in movie credits that films produced received nothing of value from anyone in exchange for playing tobacco products,” Dr. Peruga said. — PTI\n\nWHO report urges government to introduce classification for TV programmes too", 
    "section": "national", 
    "title": "‘Age-wise rating must for films with tobacco images’", 
    "subsection": "general", 
    "date": "2016-02-02"
}