{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The 35-member martial band of the Army was all decked up, ready to impress foreigners in Dhaka on Indian Republic Day. With ceremonial dresses and musical instruments, the band reached Kolkata to cross into Bangladesh by road well in advance, and awaited the final clearance.\n\nThe band kept waiting, as the bureaucratic red tape in New Delhi strangled yet another military diplomatic effort for better neighbourhood relations.\n\nOfficial sources told The Hindu that the finance wing in the Defence Ministry sat on the file till the last minute, though it was processed and sent on time after approval from the Chief of the Army Staff General Dalbir Singh.\n\n“It was a well-planned event but the finance wing delayed the file till the eleventh hour and then the office of the Defence Secretary,” an informed source said.\n\nThe tradition of exchanging military bands was agreed upon as part of the military-to-military cooperation between the two countries and has been in effect at least since 2009. While an Indian band plays in Dhaka on January 26 as part of the celebrations hosted by the Indian High Commission there, a military band from Bangladesh plays at the mission in India on their national day. The three services take part on a rotation basis and it was the Army’s turn this year.\n\nThe finance wing turned down the proposal saying that it was “too costly” and sent the file to the Defence Secretary on January 23 which took two more days, only to reject the proposal and returned the file on January 25. The band, comprising two officers, one junior commissioned officer and 32 jawans, was to reach Dhaka on January 24 and was positioned in Kolkata to be quickly transported by road. However, after the proposal was turned down, the team returned to Delhi.\n\nImportant social event\n\nThere was a break in 2014 when the Indian team was not sent due to technical issues following which the Indian High Commission in Dhaka wrote a letter to the Defence Ministry in October of the same year, stressing the importance of the ceremonial event.\n\nThe letter had stated that the Indian Republic Day parade is a “much awaited and sought after social event in Dhaka” and attended by people from various walks of life. Following this, the Defence Ministry in December 2014 gave the approval for the practice to continue.\n\nResponding to questions on the issue, officials from the Bangladesh High Commission said that all necessary instructions were passed from their side. “There are some official formalities which took time on the Indian side and some administrative problems,” an official said.\n\nOn the reasons for the rejection, Defence Ministry sources said these bands performed on rotation as per requirement and exigencies, and so could not be sent. However, they did not respond to specific questions on the issue.\n\nThe cost would be minuscule compared with the amount spent on organising the Republic Day celebrations in the national capital. According to a Right to Information reply from the Central Public Works Department, the Centre spent Rs.320 crore on the parade in 2014.", 
    "section": "national", 
    "title": "Army band performance in Dhaka scuttled by red tape", 
    "subsection": "general", 
    "date": "2016-02-02"
}