{
    "author": [], 
    "text": "Hindus can perform puja and Muslims can offer namaz at the disputed Bhojshala monument in the district on Basant Panchmi on February 12, the Archaeological Survey of India said in an order.\n\nTension has been brewing up in the district since last one month in the run-up to the festival as members of both the communities could not arrive at a mutually agreeable solution over paying obeisance as per their respective faiths at the protected archaeological structure.\n\nHindus consider Bhojshala as the temple of Goddess Waghdevi (Saraswati), whereas Muslims treat it as Kamal Moula mosque.\n\nAccording to the ASI order released today by the district public relation office: “In the ancient protected monument Bhojshala/Kamal Moula Mosque, both puja and namaz will take place on February 12, Basant Panchmi festival. The order is effective for that day only.”\n\nIn the past too, tension had prevailed in Dhar city whenever Basant Panchmi fell on a Friday, once forcing the administration to impose a curfew to conduct namaz at the designated time. As per the ASI order, Hindus will perform puja from sunrise to 12 noon and from 3.30 p.m. to sunset on the day of the festival, while Muslims can offer namaz between 1 and 3 p.m..\n\nThe order was issued by ASI Director-General Rakesh Tiwari on January 20, 2016, under the Provisions of Ancient Monuments and Archaeological Sites and Remains Act 1958 and the Ancient Monuments and Archaeological Sites and Remains Rule 1959.\n\nIt also mentioned an order issued on February 5, 1998, by the ASI.\n\nThe entry in Bhojshala premises will be free for both the communities on Basant Panchmi. In the normal course, Hindus are allowed to perform puja on every Tuesday while Muslims can offer namaz every Friday, while the structure is open to all on rest of days. - PTI", 
    "section": "national", 
    "title": "ASI allows Hindus to do puja, Muslims to offer namaz at Bhojshala", 
    "subsection": "general", 
    "date": "2016-02-02"
}