{
    "author": [
        "Nirnimesh Kumar"
    ], 
    "text": "Kirti Azad and others sought dissolution of the working panel of the cricketing body.\n\nFormer cricketers Kirti Azad and Bishan Singh Bedi and others on Monday moved the Delhi High Court for a court-monitored investigation into a preliminary inquiry registered by the CBI into the charges of corruption in the Delhi and District Cricket Association.\n\nIn a petition, they also sought dissolution of the working committee of the cricketing body and appointment of a retired judge of the High Court or a retired Chief Justice of any High Court as administrator in its place to run the DDCA until fresh elections. They sought a directive to the Centre to cancel the allotment of subsidised land to the DDCA.\n\n“There is a grave apprehension that the CBI will not be able to conduct a free and fair investigation, especially since Arun Jaitley, during whose tenure as president most of the offences occurred, is now a senior Minister and Leader of the House in the Rajya Sabha,’’ they said.\n\nThe petitioners submitted that the election by a proxy system in the DDCA had been perpetuating a fraud on the genuine members, including the petitioners, by ensuring that certain persons remained office-bearers perpetually.\n\nThe petitioners said Justice (retd.) Mukul Mudgal had found several irregularities and indicted the DDCA’s working committee.\n\nCourt allows Jaitley’s plea\n\nMeanwhile, a Delhi court on Monday allowed a plea by Union Finance Minister Arun Jaitley seeking summoning of certain records of the DDCA in a criminal defamation complaint. Mr. Jaitley has filed the complaint against Delhi Chief Minister Arvind Kejriwal and five other AAP leaders.\n\nIn the application filed before chief metropolitan magistrate Sanjay Khanagwal, Mr. Jaitley had sought summoning of DDCA records for the period during which he was its president.", 
    "section": "national", 
    "title": "Azad seeks court-monitored investigation in DDCA case", 
    "subsection": "general", 
    "date": "2016-02-02"
}