{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The huge backward classes consolidation in the Bihar polls in favour of the Grand Alliance has led to intense soul searching within the BJP. The party’s Other Backward Classes (OBC) Morcha has urged Prime Minister Narendra Modi to make the findings of the Socio-Economic Caste Census (SECC) undertaken by the previous UPA government public.\n\nMore significantly, the morcha asked for the implementation of the “Karpoori Thakur” formula of quota within quota to help non-Yadav OBCs secure their share of reservation. “The average rate at which the 27% quota for OBCs is availed does not go beyond 15% in most States. That too is cornered by dominant OBC castes like the Yadavs. We want these posts to be filled, especially Group A, B and C,” said a source.\n\nThe suggestions, among several made by the morcha, were articulated when Mr. Modi hosted office-bearers of the eight morchas or cells of the BJP at his official residence on Sunday. The OBC Morcha, a recent addition to the party, was the only one that was told to put its suggestions in writing and send them to the Prime Minister’s Office (PMO).\n\nSources present at the meeting told The Hindu that making the findings of the SECC public, a key demand made during the Bihar polls by Rashtriya Janata Dal chief Lalu Prasad, would be helpful in convincing voters in “every State that the government was sincere in its concern for backward classes, by at least making their real proportion in the population public.” Recent remarks by Rashtriya Swayamsewak Sangh chief Mohan Bhagwat for a review of reservation in government jobs had alienated the backwards, according to morcha members.\n\n“There was also a demand to accord Constitutional status to the Backward Classes Commission, and raise the income ceiling of those who would be included in the ‘creamy layer’ of the OBC since the new pay commission had overshot the Rs. 6 lakh per annum ceiling,” said a source.\n\nMr. Modi, after a month-long series of appraisals, presentations and conversations with bureaucrats, office-bearers of the BJP and his Council of Ministers, seems to have zeroed in on certain issues. He has also finalised at least four big farmer rallies in Madhya Pradesh, Odisha, Karnataka and Uttar Pradesh, all in the month of February.\n\n“The Prime Minister has undertaken this exercise in the first month of the new year plainly because last year there was a lot of talk that he was centralising decision-making in the government, and alienating the party’s rank and file in the way BJP president Amit Shah ran the campaigns for Delhi and Bihar Assembly polls,” said a senior party general secretary. In fact, a monthly meeting of the Council of Ministers has now been made compulsory by the Prime Minister.\n\n“He has said that all Ministers should know what the government is up to. Not in bits and pieces or only their part of it, but in its entirety,” said a junior Minister.\n\nMorcha members feel RSS chief’s remarks on quota alienated the backwards", 
    "section": "national", 
    "title": "BJP’s OBC Morcha wants SECC findings made public", 
    "subsection": "general", 
    "date": "2016-02-02"
}