{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Does the Gujarat government think itself so “unique” that it can say ‘no’ to a law passed by Parliament? The Supreme Court verbally thrashed the State government and the Centre on Monday for not implementing the National Food Security Act passed by Parliament in 2013 to ensure that the poor in the nation do not go hungry.\n\n“Do you want to break away from the Union of India? Can a State say it cannot implement a law passed by Parliament? Are you saying you are not part of India? What is the Government of India doing about this,” a Bench of Justices Madan B. Lokur and R.K. Agarwal asked Solicitor-General Ranjit Kumar, who appeared for the Centre.\n\nWhen Hemantika Wahi, counsel for Gujarat, responded that the implementation of the law was under “active consideration,” Justice Lokur replied: “Then, it’s a pity,” asking whether Gujarat thinks that it has a choice to not implement the law. “So, tomorrow Bihar can say it will not implement the Criminal Procedure Code and some other States will say they do not believe in the Indian Penal Code or other laws of Parliament. The food security law extends to the whole of India... So, Gujarat thinks it is unique,” Justice Lokur said.\n\n“What is Parliament doing about this? We have absolutely no idea what you are all doing,” he said.\n\nThe Bench was hearing a public interest litigation petition filed by Common Cause on the lack of effective implementation of welfare schemes such as food security, the Mahatma Gandhi National Rural Employment Guarantee Act and basic water supply to the drought-hit States in the country.\n\nMr. Kumar said top officials of the drought-hit States met the Union Agriculture Secretary on January 25 and 27 as per the order of the Supreme Court to assess the situation.\n\nOf the 36 States, 25 were implementing the food security law. Bihar, Gujarat and Haryana had not declared drought.\n\nIn a written order in reference to Gujarat’s non-implementation of the food security law, the Bench directed the Centre to respond in an affidavit by February 12 whether it is “permissible for a State not to follow the National Food Security Act.” The court asked the Centre to set forth the parameters followed by Gujarat, Bihar and Haryana to declare themselves drought-hit.", 
    "section": "national", 
    "title": "Do you want to break away from the Union, court asks Gujarat", 
    "subsection": "general", 
    "date": "2016-02-02"
}