{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a day of dramatic developments, the Enforcement Directorate arrested Sameer Bhujbal, 42-year-old nephew of NCP leader Chhagan Bhujbal, on money laundering charges after several hours of questioning at its Ballard Pier office late on Monday night.\n\nInformed sources said Sameer Bhujbal was arrested under Section 19 of the Prevention of Money Laundering Act 2002 (PMLA) and will be produced before a court on Tuesday morning after a medical test. His arrest comes at a time when his uncle is away in Washington DC to attend an event organised by the US Congress.\n\nEarlier, he was detained for questioning by ED officials on Monday afternoon even as a 20-member team from Mumbai’s zonal unit carried out searches at multiple premises linked to Chhagan Bhujbal, the former Public Works Minister, his son Pankaj, and Sameer as part of its money laundering probe. “Searches were conducted on 10-11 premises, mostly of companies in which the Bhujbals had a direct or indirect stake. We had questioned Pankaj earlier, and we questioned Sameer on Monday. Mr. Bhujbal left for the U.S. on Saturday, but we will question him once he returns,” a senior ED official told The Hindu .\n\nThe ED had lodged two FIRs against the Bhujbals under the PMLA in connection with the construction of the new Maharashtra Sadan, and the Kalina land-grab case.\n\nWhile BJP MP for North-east Mumbai Kirit Somaiya and the Aam Aadmi Party tried to claim credit for the ED action, the NCP accused the BJP government of “political vendetta.” “The government is targeting NCP leaders and running a wrongful campaign against the party. Mr. Somaiya announced that there will be action against Mr. Bhujbal, and next day, there is action,” NCP spokesperson Nawab Malik said.\n\nMinutes after his arrest, Mr Somaiya tweeted, “V have done it #SameerBhujbal arrested by ED…#PankajBhujbal to follow.”\n\nWe will question the former Minister once he returns from the U.S.,\n\nsays ED official", 
    "section": "national", 
    "title": "ED arrests Chaggan Bhujbal’s nephew", 
    "subsection": "general", 
    "date": "2016-02-02"
}