{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Enforcement Directorate (ED) on Monday conducted searches on premises linked to the NCP leader and former Maharashtra Minister, Chhagan Bhujbal, and his family in the city as part of its money-laundering probe, even as the NCP called the action “political vendetta.”\n\nA team of 20 officers of the ED’s Mumbai zonal unit carried out the searches at the offices of some companies floated by Mr. Bhujbal, his son Pankaj and nephew Sameer.\n\nSameer Bhujbal, former NCP MP from Nashik, was summoned for questioning at the ED office on Ballard Estate and later arrested.\n\n“Searches were conducted on 10-11 premises, mostly of companies in which the Bhujbals had a direct or indirect stake. We had questioned Pankaj earlier, and we questioned Sameer today. Mr. Bhujbal left for the U.S. on Saturday and was unavailable, but we will question him once he returns,” a senior ED official told The Hindu.\n\nThe searches came hours after his office issued a statement that Mr. Bhujbal had left for Washington, DC, at the invitation of the U.S. Congress. “He will be participating in a three-day event organised by the U.S. Congress. It will be attended by senior U.S. senators, diplomats, and high-ranking officers of the U.S. judiciary and administration, as well as representatives from 140 countries,” said a statement from Mr. Bhujbal’s office.\n\nThe statement said U.S. President Barack Obama would address the gathering. “During the three-day programme, discussions will be held on issues pertaining to social justice, education etc., with focus on mutual co-operation and harmony the world over,” it said.\n\nThe ED had lodged two FIRs against the Bhujbals under the Prevention of Money Laundering Act in connection with the construction of the new Maharashtra Sadan, and the Kalina land-grab case. The agency also launched proceedings to attach three properties of the Bhujbal family worth over Rs. 280 crore.\n\nBhujbal’s nephew Sameer has been arrested in the money laundering case", 
    "section": "national", 
    "title": "ED searches premises of Bhujbal family", 
    "subsection": "general", 
    "date": "2016-02-02"
}