{
    "author": [
        "Nirnimesh Kumar"
    ], 
    "text": "In a landmark judgment, the Delhi High Court has held that a female member of a Hindu Undivided Family (HUF) by virtue of being the first born eldest can also be a ‘karta ’ (manager).\n\n“If a male member of an HUF, by virtue of his being the first born eldest, can be a ‘karta,’ so can a female member. The court finds no restriction in the law preventing the eldest female co-parcener of an HUF, from being its ‘karta,’” Justice Nazmi Waziri said in his 27-page judgment pronounced on December 22.\n\n“What emerges… is that the impediment which prevented a female member of a HUF from becoming its karta was that she did not possess the necessary qualification of co-parcenership. Now that this disqualification has been removed by the 2005 Amendment (Section 6 to the Hindu Succession Act), there is no reason why Hindu women should be denied the position of a ‘karta,’” Justice Waziri said.\n\nSujata Sharma, plaintiff in the matter, through her lawyer, had argued that pursuant to the Hindu Succession (Amendment) Act, 2005 by which the Hindu Succession Act, 1956, was amended, all rights available to a Hindu male were now available to a Hindu female also.\n\nShe further submitted that a daughter is now recognised as a co-parcener by birth in her own right and has the same rights in the co-parcenary property as a son.\n\nAdmitting her argument, the court said: “Section 6 of the Hindu Succession Act is a socially beneficial legislation; it gives equal rights of inheritance to Hindu males and females. Its objective is to recognise the rights of female Hindus as co-parceners and to enhance their right to equality apropos succession. Therefore, courts would be extremely vigilant apropos any endeavour to curtail or fetter the statutory guarantee of enhancement of their rights.”\n\nAl rights available to a Hindu male is also applicable to a female: plaintiff", 
    "section": "national", 
    "title": "Female can also be a ‘karta,’ says Delhi HC", 
    "subsection": "general", 
    "date": "2016-02-02"
}