{
    "author": [
        "Smita Gupta"
    ], 
    "text": "Trinamool denies any move for electoral alliance as CPI(M) prefers to watch the situation\n\nA Congress delegation from West Bengal met party vice-president Rahul Gandhi on Monday to discuss the possibility of forging an alliance with the Left Front in the State where Assembly elections are due later this year.\n\nThe majority of party leaders in West Bengal, led by State chief and Baharampur MP, Adhir Ranjan Chowdhury, favoured this alliance. But the Congress’s minority cell chairman in the State, Khalid Ebadullah, who was not part of the delegation that met Mr. Gandhi, said the party should go it alone. “We have a great chance to make a fresh start”, he told The Hindu , adding that Mr. Chowdhary wanted the CPI(M)’s support to save his constituency from the Trinamool. “Mamata has made his life hell. She is after his workers, harassing them.”\n\nHe claimed that Muslims, who earlier voted in large numbers for the Left, were disenchanted with it because of its “godless” philosophy. He also accused the Left of killing many Muslim leaders. In a State with a 30 per cent Muslim population, Mr. Ebadullah’s view could be significant, and is one that the Trinamool is hoping will turn out to be correct.\n\nIndeed, Trinamool Congress leader and Lok Sabha MP, Saugata, dismissed the likelihood of a Congress-Left arrangement jeopardising his party’s prospects. He argued that even though the percentage of votes polled by the Left parties (29%) and the Congress (10%) – that had fought the Lok Sabha polls separately – taken together equalled that of the Trinamool (39%), it would not work in their favour. “The Congress and the Left parties have fought each other for so many years that they will not be able to transfer their votes to each other,” he said. Besides, the Congress’s votes are not evenly distributed over the State, he said, being largely confined to the districts of Malda, Murshidabad and North Dinajpur.\n\nAmid speculation that the Trinamool, in a bid to block a possible Congress-Left alliance, might offer to enter into an arrangement with the Congress, both Mr. Roy and the party’s Rajya Sabha MP, Derek O’Brien, ruled it out. “We are going it alone,” Mr. O’Brien said. Mr. Roy said that the Trinamool had been performing well consistently in both local and by-elections in the past 20 months. Since it did exceedingly well in the Lok Sabha polls, winning 34 out of 40 seats in the State, there was no need for entering into an alliance with any party.\n\nThe Left is keenly watching the developments in the Congress camp. “Reflecting the mood of the people of West Bengal, we have given a call to the Left, democratic and secular forces to throw out the authoritarian regime of Mamata Banerjee and asked political parties to declare which side of the fence they are on,” CPI(M) Polit Bureau member Mohammad Salim said, adding, “There is a growing groundswell of anger against the Trinamool that is visible in the mass mobilisation that we have been doing.”\n\nMr. Salim, however, clarified that the Left had not yet made any overtures to the Congress, or vice versa: “We understand that Congress leaders are meeting to take a view. Let them come back to us,” he said, stressing, “But we are very clear that we need to respect the people who are eager to oust this government.”\n\nIndeed, Left sources said that after the Congress makes a proposal, its Central committee and Polit Bureau would meet to take a final view.", 
    "section": "national", 
    "title": "Fresh push for Congress-Left tie-up", 
    "subsection": "general", 
    "date": "2016-02-02"
}