{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "As per the latest extension, Gujarat will implement the National Food Security Act from the next financial year.\n\nIt’s more than two years since Parliament passed the National Food Security Act (NFSA) which seeks to provide foodgrains to the poor in the country. However, the Gujarat government has not yet implemented the Central Act and instead obtained four consecutive extensions from the Centre.\n\nAccording to top officials in the government, the decision to delay implementation of the Act was “taken at the highest political level.”\n\n“It was a political decision. No reasons for delay was shared with us,” a top bureaucrat told The Hindu , adding, “Now, as per the latest extension, the State will implement it from the next financial year — April 2016.”\n\nAnother bureaucrat requesting anonymity told The Hindu : “Perhaps, the government wants to implement the Act around the Assembly election time next year.”\n\nHowever, Gujarat’s Civil Supplies Minister Bhupendrasinh Chudasama told The Hindu that the “implementation process is under way.”\n\n“We have prepared the list of beneficiaries and have been displaying the list in each of the 18,000 villages across the State as per the provision of the Central Act,” Mr. Chudasama said.\n\n“We will tell the apex court during the next hearing that the full-fledged implementation of the Act will begin from April,” he said, indicating that the programme may be launched on April 14, the birth anniversary of Babasaheb Ambedkar.\n\nRecently, a PIL petition was filed in the High Court demanding compensation from the State for its failure to implement the law, which is likely to benefit almost 3.8 crore people in the State.\n\nState has obtained four consecutive extensions; Minister says beneficiaries’ list is ready", 
    "section": "national", 
    "title": "Gujarat got four extensions on Food Security Act", 
    "subsection": "general", 
    "date": "2016-02-02"
}