{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "We believe in providing a basic fairness level, says Bench\n\nWhile ordering the Centre to hand over to deposed Arunachal Pradesh Chief Minister Nabam Tuki documents, equipment, data and personal papers seized from his office and residences, the Supreme Court on Monday asked Mr. Tuki’s side to file amended pleas by Friday based on these additional materials. The case has been scheduled for hearing on Monday next.\n\nThe Ministry of Home Affairs, in a counter-affidavit filed before the Supreme Court on January 29, had accused Mr. Tuki, his cousin and Assembly Speaker Nabam Rebia and their Cabinet of being communal and promoting lawlessness and accused them of being “involved” with the outlawed NSCN (K) outfit.\n\nAttorney-General Mukul Rohatgi, even at one point, submitted that the Centre was getting an impression that the court seemed to believe that it had been unfair to the Tuki government.\n\n“We have not been unfair to your government and we will never allow anyone to be unfair to you,” Justice Khehar corrected Mr. Rohatgi.\n\n“But we believe in providing a basic fairness level. How can they [Mr. Tuki’s side] update their petitions without access to these records? We are not touching on your authority ... we only want to afford them a good defence,” Justice Khehar said.\n\nGovernor J.P. Rajkhowa had issued an office memorandum on January 26 dismissing the State government in Arunachal Pradesh while directing the seizure of official documents, office equipment and files and sealing of offices of the deposed CM and Ministers with immediate effect.\n\nMr. Tuki, represented by senior advocates Fali Nariman and Kapil Sibal, said the memorandum treated Mr. Tuki and his Ministers as “criminals.” It was completely antithetical to the suspension of the Assembly following the President’s proclamation of emergency. He submitted that among the seized documents were over 100 letters, some acrimonious, exchanged between the Governor and the CM which would effectively deal with the personal allegations against him in the Centre’s affidavit.\n\n“Everything done by the Governor is attributable to the President. Now, has the President told him to lock up everything?” Mr. Nariman said.\n\nMr. Rohatgi objected that this was not a “free-for-all” and tomorrow Mr. Tuki would ask for “letters sent to the sun.” He argued that the memorandum was a natural consequence of President’s rule. He said the government was willing to hand over to the court all the communications. However, the court advised Mr. Rohatgi not to “bring the battle” to the Bench.", 
    "section": "national", 
    "title": "How can Tuki update pleas without access to records, asks SC", 
    "subsection": "general", 
    "date": "2016-02-02"
}