{
    "author": [
        "Staff Reporter"
    ], 
    "text": "RTI had revealed that she was given a plot of land for Rs 70,000\n\nMaharashtra revenue minister Eknath Khadse said on Monday that the plot given to Bharatiya Janata Party (BJP) MP and actor Hema Malini’s trust was on lease and had not been sold. He said that those who find fault in the process could appeal to relevant authorities.\n\nLast week, activist Anil Galgali had obtained documents from the Mumbai suburban collector under the Right to Information (RTI) Act which stated that a 2000 sq m plot at Ambivli in Andheri was given to the actor’s dance school for Rs 70,000, while the plot’s market value is estimated to be approximately Rs 50 crore.\n\nMr Khadse said the state government has given plots to educational institutions, hospitals, etc, under similar rules and regulations. “The valuation of the land is yet to be done,” he told reporters on Monday, adding that trusts of several politicians including that of Vilasrao Deshmukh, Gopinath Munde, AR Antulay, Narayan Rane, and Jayant Patil were given plots under these rules.\n\nEarlier in the day, Ms Malini held a press conference justifying her actions. She claimed she has “not grabbed the land” and will abide by the government’s rules regarding the purchase.\n\n“I have not paid anything as of now,” she said, adding, “I will follow all the rules and regulations of the government. Why speculate the price when I don’t know myself how much I have to pay? Whatever will be the cost I will pay it,” she said. Ms Malini also asked not to make it a political issue.\n\n“Thank you all for making it an issue nationally and internationally. Don’t make it a political matter. It’s my right to make this dance institute in Mumbai as I have been living here. I don’t know why an issue is made out of it,” she added.\n\n“I am getting 2,000 square metres land for building a dance institute called Natyavihar Kalakendra Charity Trust,” she said adding that she will have to develop the garden and give it to the BMC which will then decide what should be done with the land.", 
    "section": "national", 
    "title": "Land to Hema Malini is on lease not sold, says Minister", 
    "subsection": "general", 
    "date": "2016-02-02"
}