{
    "author": [], 
    "text": "Believers say those who look after their dolls well, will see good fortune\n\nA monk leading prayers during a religious ceremony for women and their ‘luuk thep’ (child angel) dolls at the Bangchak Buddhist Temple in Nonthaburi on the outskirts of Bangkok.— Photo: AFP\n\nDriving to a Buddhist temple on the northern fringes of Bangkok, beauty salon owner Natsuda Jantaptim is running through her youngest daughter’s likes and dislikes.\n\n“We sleep in the same bed together, she has her own pillow and blankets,” she said, her daughter sitting quietly in the front passenger seat.\n\n“We didn’t switch the air-con on two nights ago because she was cold. In the morning, she likes to drink strawberry milk,” she added.\n\nOn first reckoning, it sounds like the everyday observations of a dedicated mother.\n\nExcept the daughter Natsuda refers to isn’t real. Certainly not in the living, breathing flesh and blood sense.\n\nShe is a meticulously groomed plastic doll, part of the latest celebrity- fuelled superstitious craze that has swept the country — much to the dismay of the kingdom’s conservative military rulers.\n\nKnown in Thai as ‘luuk thep’ (child angels), the pricey dolls, which can cost up to $600, were first popularised a little over a year ago by celebrities who claimed dressing up and feeding the dolls had brought them professional success.\n\nBelievers say the dolls — many of which are blessed and have sacred scripts drawn on them by a monk — contain the spirit of a real child and must be treated as a living being.\n\nThe theory runs that those who look after their dolls like members of the family, will see good fortune returned to them.\n\nAs a result, plastic dolls are now taking their seats at restaurant tables, cinemas and even on airplanes. Natsuda, 45, lives with her very real 21-year-old daughter. But that has not dimmed her affection for the doll, auspiciously named Ruay Jang (So Rich).\n\n“Since I got Ruay Jang my life has really changed. For example, I won the lottery which I had never won before,” she explained. After praying for help from her doll, she added, a friend paid back a significant loan after years of fruitless efforts to chase it down.\n\nThe ‘luuk thep’ craze appears to have divided Thais.\n\n“I freak out sometimes when I see them on the train,” admitted Lakkhana Ole, a 31-year-old graphic designer from Bangkok who says she spots dolls increasingly often around the city. — AFP", 
    "section": "national", 
    "title": "Lucky or Chucky? Spirit dolls in Thailand delight and disturb", 
    "subsection": "general", 
    "date": "2016-02-02"
}