{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Videos show demonstrators being lathicharged, kicked and thrown to the ground\n\nStudents, protesting against events leading to the suicide of Rohith Vemula, being restrained by police in New Delhi on Saturday.— Photo: AP\n\nThe Delhi Police drew flak on Monday after videos showing them brutally assaulting protesting students went viral on social networking sites.\n\nStudents protesting against the events leading to the suicide of scholar Rohith Vemula were marching towards the RSS headquarters in Central Delhi’s Jhandewalan on Saturday. They had broken through a layer of barricades when police decided to take them on physically.\n\nStudents alleged that the policemen did not discriminate between male and female protesters, as they swirled their lathis and punched them.\n\nBut the sharpest reactions were reserved for some men in plainclothes, alleged to be RSS workers, who joined in the assault. One video actually showed policemen allowing these elements to take over from them as they turned their attention to other protesters.\n\nRSS spokesperson Rajeev Tuli, however, dismissed the allegation.\n\nThe uproar over the videos, though, led to the Delhi Police Commissioner B.S. Bassi ordering a probe into the allegations. He insisted that he had not seen the videos though most news channels ran them through the day.\n\nStopped from marching towards the RSS headquarters, the 200-odd student activists from JNU, DU, Jamia and a few other varsities broke through the first level of barricades before drawing the police’s wrath.\n\nSome videos circulating on the social media showed students abusing the policemen, the government and Prime Minister Narendra Modi.\n\nThe students were lathicharged, kicked, pulled by their hair and thrown to the ground by the police. Some female students came forward to claim they were beaten up by policemen as policewomen, very few in numbers, watched.\n\nAmidst all this, political parties led by the AAP, made the most of the incident.\n\nKejriwal condemns police\n\nDelhi Chief Minister Arvind Kejriwal went on to call the Delhi Police the “private army” of the BJP and the RSS out to “terrorise” anyone opposing them.\n\nMr. Kejriwal, who is in Bengaluru for his naturopathy treatment, tweeted: “Del pol being used by BJP/RSS as their pvt army to terrorize n teach lesson to anyone opposing BJP/RSS. I strongly condemn attck on students [sic].”", 
    "section": "national", 
    "title": "Police draw flak for assaulting students", 
    "subsection": "general", 
    "date": "2016-02-02"
}