{
    "author": [
        "Bhumika K"
    ], 
    "text": "‘Women should be able to narrate stories from their point of view’\n\nActor and filmmaker Suhasini Maniratnam may seem to be vociferously championing the cause of women, but at the Bengaluru International Film Festival on Monday, she made it amply clear that hers is not the “woman’s opinion.”\n\n“Now I consider myself a human being, not a woman. After 40, women forget they are women. There’s a certain liberation and we get to know ourselves. Everything depends on capability, except maybe when we are abused or put down.”\n\nShe set out to speak on acting at the seminar on Monday, but the interactive session took its own course and the charming actor spoke on everything ranging from working with her husband Mani Ratnam, learning languages, technology in cinema, the culture of remaking movies, to working with today’s young directors.\n\nMs Suhasini elaborated how the predominant voice in cinema was still that of men. “Women should be able to come out and narrate stories from their point of view.” During the interaction she recalled how her father (actor Charu Hassan) would tell her that women could be given career and economic freedom, but emotional freedom must come from within. “I still haven’t come out of it, or I would have directed 20 films by now, or dedicated myself to community work, or would have joined politics.” Answering another question, Ms. Suhasini said she became an actor because “we women want to take the easy way out. I appreciate men because they take risks.”\n\nWhen moderator Prakash Belawadi steered the conversation towards the objection to remaking films, Ms Suhasini clearly voted against remakes. “My husband won’t remake films and won’t allow anyone to remake his films. It’s like making your child study like your neighbour's child.”", 
    "section": "national", 
    "title": "‘Predominant voice in cinema still that of men’", 
    "subsection": "general", 
    "date": "2016-02-02"
}