{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "“India should mobilise an opinion amongst the developing countries”\n\nIn a bid to ensure country’s food security, Punjab wants the Centre to push for finalising the work programme for public stock holding of food grains and Special Safeguard Mechanism (SSM) in the special sessions of committee on agriculture during the upcoming negotiation meet of World Trade Organization (WTO) in Geneva.\n\nChief Minister Parkash Singh Badal on Monday wrote a letter to Prime Minister Narendra Modi urging for his personal intervention into the matter.\n\n“India should mobilise an opinion amongst the developing countries to support these issues during the negotiations in the committee in the larger interest of small farmers of these countries and more importantly food security of our country,” Mr. Badal said. The food-grain requirements would increase with the rise in population in the coming years and to ensure the food security for the people, the public stock holding was necessary so that requirements under the National Food Security Act could be met.\n\n“We don’t consider the public stock holding as a distortion in the market as it is important for us to provide access to food at affordable prices to our growing population. Besides, sufficient stocks need to be maintained to ensure availability in case of a crop failure in a situation where more than half of the agriculture production is received from un-irrigated areas,” he wrote.\n\nMr. Badal expressed concern that absence of SSM would expose the domestic market to the cheap imports from the developed countries and would impair the agricultural production and thereby the livelihoods of small and marginal farmers of the country.\n\nWTO ministerial meeting at Nairobi in December, 2015 ended with a declaration which welcomed the progress on Doha development agenda. The WTO General Council has been mandated to regularly review the progress of these negotiations and meeting is likely to be held early this month.\n\n“Nairobi declaration provided that the members should pursue the negotiations on an SSM for developing country members in dedicated sessions of committee on agriculture in a special session. Similarly, regarding public stock holding for food-security purposes, the member should engage constructively to agree and adopt a permanent solution to the issue,” Mr. Badal wrote in the letter.", 
    "section": "national", 
    "title": "Punjab asks PM to push for public stock holding of food grains", 
    "subsection": "general", 
    "date": "2016-02-02"
}