{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The CBI on Monday told the Bombay High Court that ballistic laboratory reports on the murder weapon used to kill rationalists Narendra Dabholkar, Govind Pansare and MM Kalburgi have differed on their results.\n\nAdditional Solitical General Anil Singh told the court that while the Kalina forensic lab said that the weapon used in all three cases was the same, the Bangalore lab stated that different weapons were used in the crimes. Mr Singh informed a bench of Justices Ranjit More and VL Achliya that the agency is considering seeking the opinion of experts in Scotland and that it would take at least two months.\n\nAdvocate Abhay Nevgi, appearing for the families of Dabholkar and Pansare, who had petitioned the High Court seeking setting up of an independent investigation team, wanted the probe to be transferred to the NIA. The court, however, noted the investigation is at a crucial stage and both the agencies are making sincere efforts.\n\nThe HC also said that the CBI is in touch with NIA and hence there is no need to hand over the investigation to the latter at this stage.\n\nNarendra Dabholkar, who fought against, was murdered in Pune in August 2013, by two unidentified gunmen.\n\nIn February 2015, Govind Pansare, a Communist Party of India leader, was shot at in front of his home in Kolhapur.\n\nPansare, who promoted inter-caste marriages and criticised the glorification of Nathuram Godse, died of injuries days later.\n\nAuthor MM Kalburgi, who spoke against idolatry in Hinduism, was also gunned down by unidentified men at his home in Dharwad in August last year.\n\nThe modus operandi of Kalburgi’s attackers was similar to that of those who killed Dhabolkar.\n\nThe HC has clubbed all the three cases and investigations in all three cases have been going on parallely.\n\nThe CBI, which is investigation the Dabholkar case, and the State Criminal Investigation Department (CID), which is looking into the Pansare case, submitted investigation reports to the court.\n\nThe court posted the petition for hearing on February 29, and sought progress reports from the CBI and the CID.", 
    "section": "national", 
    "title": "Rationalists’ murders: CBI to seek opinion of experts in Scotland", 
    "subsection": "general", 
    "date": "2016-02-02"
}