{
    "author": [
        "Special Correspondent"
    ], 
    "text": "White paper soon, says Naidu; CM covering up failure, alleges Jagan\n\nThe Ratnachal Express, which was gutted by miscreants on Sunday, was brought to Tuni Railway station late in the night.— Photo: BVS BHASKAR\n\nEven as Tuni and the villages around it are limping back to normal after Sunday’s large-scale arson, former Minister Mudragada Padmanabham who organised the ‘Kapu Ikya Garjana’ demanding inclusion of the Kapus in the backward caste list, warned the Andhra Pradesh Government that he would sit on indefinite fast.\n\nThe Visakhapatnam-Vijayawada Ratnachal Express was burnt near Tuni, two police stations were attacked and several vehicles were burnt by some unidentified miscreants towards the end of Kapu Garjana on Sunday.\n\n“If the government failed to fulfil the main demands of including the Kapus in the list and also releasing a sum of Rs 1,900 crore to the Kapu Corporation, I’ll sit for an indefinite fast at my residence from February 5,” Mudragada said in his native village Kirlampudi in East Godavari district.\n\nMeanwhile a 53-year-old man hanged himself at the Collectorate in Kakinada demanding reservation to the Kapus.\n\nChief Minister N. Chandrababu Naidu, on his part, said that reservation issue would be taken to a logical conclusion by 2017. He said that the government would release a white paper on the entire reservation issue soon.\n\nMeanwhile, the YSR Congress president and the leader of the Opposition Y.S. Jagan Mohan Reddy at a media conference at Lotus Pond lashed out at Mr. Naidu for trying to cover up his failures by blaming others for the untoward incidents.\n\nHe extended full support to the Kapu community’s demands for inclusion in the BCs without affecting the existing reservations for BCs. Jana Sena founder and film actor Pawan Kalyan asked the government to do justice to Kapus by conceding their long pending demand for inclusion in the Backward Classes without harming the interests of the BCs, at a press conference in Hyderabad.\n\nNational Backward Classes Welfare Association president R. Krishnaian said that the BCs would launch a counter movement to oppose the inclusion of the Kapus in the BCs. He said the association took a serious view of the Kapus resorting to violence in Tuni demanding inclusion in the BCs and any such “blackmail tactics” would be resisted.\n\nA 53-year-old man from Kakinada commits suicide in support of the issue", 
    "section": "national", 
    "title": "Reservation issue: Kapu leader to go on indefinite fast", 
    "subsection": "general", 
    "date": "2016-02-02"
}