{
    "author": [
        "Tanu Kulkarni"
    ], 
    "text": "The village boasted of one teacher in every house till the government stopped recruitment.— File Photo\n\nThe last five years have seen many firsts at in Chitradurga district — first doctor, first engineer, and first public servant.\n\nSurprisingly, none of these “firsts” saw any celebration, because for the people here, it was a break from a tradition they held dear — the small village has had at least one teacher from every household. The change began about six years ago when the government stopped recruiting teachers, forcing youngsters to look for other options.\n\nFor instance, 23-year-old Basavaraj G. completed his Diploma in Education in 2011 and taught at a primary school as a guest teacher.\n\nWith no hope of permanent employment, he cracked the police recruitment test in 2014 and is set to join the police force in a month.\n\nTalikatte, home to many people predominantly from the Kuruba community, has always held teachers as the pride of the village.\n\nMany teachers from the village, belonging to the earlier generations, are posted in almost every district of Karnataka. Some travel about 80 km a day to schools in adjoining districts.\n\n“People from all adjoining districts are thrilled if a teacher from Talikatte is posted to their village. They say that all it requires is one Talikatte teacher to reform the village,” says a proud Kaleshappa, who is a third generation teacher at the Government Higher Primary School at Dasikatte. He fears that the situation may worsen with the introduction of the Teacher Eligibility Test and with B.Ed. being made a two-year course from this academic year.\n\nWhile the elders in the village are nostalgic, youngsters are looking for greener pastures.\n\nKiran Kumar, who completed his B.Ed. in 2006 and taught as a guest faculty in the school, said he cracked the KPSC exam in 2010 and now works as a warden at a Social Welfare Department hostel in Davangere.\n\n“It is not just about passion, it is about sustaining our livelihood as well. My prospects as a teacher looked bleak, which is why I wrote the KPSC examination,” he says.\n\nSince about 6 years, residents of Talikatte village in Chitradurga district are breaking away from the tradition due to delay in recruitments", 
    "section": "national", 
    "title": "Talikatte in Karnataka, no longer a village of ubiquitous teachers", 
    "subsection": "general", 
    "date": "2016-02-02"
}