{
    "author": [
        "National Bureau"
    ], 
    "text": "The Trans-Pacific Partnership (TPP), or the mega-regional free trade pact led by the U.S. and including 11 other Asia-Pacific countries, is likely to indirectly impact India’s exports in several industrial sectors such as textiles, plastics, leather, clothing, cotton and yarn, besides the country’s regime on investment, labour standards, intellectual property rights (IPR), government procurement and State-owned enterprises (SOE), according to Commerce Minister Nirmala Sitharaman.\n\nThe Minister said on Monday that the challenges arising from the TPP — which has set very high standards for the international trading regime — could be similar to those experienced by India post the 1991 economic liberalisation. Ms. Sitharaman said the External Affairs Ministry would soon do a study in the context of TPP and inform the government what the priorities should be in terms of policy-making in the next six months.\n\nThe TPP agreement (which India is not a part of) was reached in October last year and the member countries have two years to ratify the pact. In the meantime, the Indian government will have to consider improving the country’s standards in areas such as labour laws by holding stakeholder consultations, Ms. Sitharaman said. The investor-State dispute settlement mechanism adopted by the TPP was also a concern from India’s point of view.\n\nShe said some of the TPP standards were higher than that of the WTO norms, including on IPR and possible ever-greening of patents, which could hurt India’s pharma sector. The operations and the production methods of India’s public sector units (or SOEs) could also be constrained due to the TPP, she said\n\nSeveral Indian export sectors such as cotton and yarn could be affected as trade may be diverted to the TPP region due to its benefits of low or nil duties. She said Indian companies may have to consider investing in the TPP-region countries and start producing from there.\n\nMs. Sitharaman was speaking at an event organised by the industry body CII to launch a book, “TPP and India: Implications of Mega Regionals for Developing Countries,” edited by Harsha Vardhan Singh, former Deputy Director-General, World Trade Organisation (WTO).\n\nPointing out that the TPP, RCEP and the Transatlantic Trade and Investment Partnership (a proposed mega-regional between the U.S. and the European Union) excluded African countries, the Minister said India would also have to focus on improving its trade with African countries. Meanwhile, India is also considering engaging with the Asia-Pacific Economic Cooperation countries to ensure that it did not miss out on the emerging trade dynamics, she said.", 
    "section": "national", 
    "title": "‘Trans-Pacific pact may impact exports’", 
    "subsection": "general", 
    "date": "2016-02-02"
}