{
    "author": [
        "Rahul Devulapalli"
    ], 
    "text": "Protest site wears a deserted look; ‘Chalo Dilli’ programme postponed\n\nTwo weeks after massive protests rocked the University of Hyderabad following the death of Ph. D scholar Rohith Vemula, the situation on the campus returned to near-normality on Monday. The three students, Sunkanna, Vijay Kumar and Vishal, who were on an indefinite fast, called off their strike, as did the SC, ST Teachers’ Forum, whose members were on a relay hunger strike for a couple of days. The university functioned as usual and the protesting students also attended classes.\n\nThe JAC for Social Justice, the body that was formed after Rohith committed suicide, released a statement that its ‘Chalo Delhi’ programme, which was to be held on February 4, is postponed.\n\nThe meeting between JAC, the protesting faculty members and M. Periasamy, the new Vice-Chancellor in charge, helped defuse the situation. On Sunday, the JAC submitted a list of eight demands to Mr. Periasamy which included not allowing Appa Rao or Vipin Srivastava to occupy the VC’s position, providing employment to a member from Rohith’s family and immediately releasing his scholarship amount, implementing the Thorat Committee recommendations, besides others. The JAC has announced that if the demands are not met fully, it will go back to protesting.\n\nOn Monday, Mr. Periasamy met the Deans of various departments to discuss the demands put forward by the JAC.\n\nThe university administration has decided to extend the present semester by 15 days to compensate for the time lost due to the protests. The university had cut short the semester by one month owing to shortage of water and other issues on the campus.\n\nOn Monday, the protest site on the campus wore a deserted look with only a few members from the Ambedkar Yojana Sangham participating in a day-long hunger strike.", 
    "section": "national", 
    "title": "UoH limps back to normality", 
    "subsection": "general", 
    "date": "2016-02-02"
}