{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Documents on PAC deployment were ‘weeded out’\n\nThe Uttar Pradesh police destroyed documents that could have helped to prove the involvement of the Provincial Armed Constabulary (PAC) personnel in the Hashimpura massacre of 1987, even while the trial is still pending, it has now emerged.\n\nLast year, a Delhi court acquitted 16 PAC men, who were among the 19 charged with abducting 42 members of the minority community in May 1987 during the riots in Meerut. The victims were picked up from the Hashimpura mohalla in a truck, and taken to a canal, where they were gunned down, according to the prosecution. The Hashimpura case collapsed due to “insufficient evidence”. Three of the 19 PAC men died during the trial.\n\nA letter written by the Senior Superintendent of Police (SSP) of Meerut, a copy of which is with The Hindu , shows the documents were “weeded out” on April 1, 2006. In the letter to the Crime Branch of the State Crime Investigation Department (CID), the SSP said it was now impossible to make available documents related to the deployment of the PAC personnel on the day of the alleged massacre. The matter was being heard in a Tis Hazari court at time the documents were destroyed.\n\nThe letter gave no reason for the documents being weeded out. “Your office has asked to make available the records of deputation and deployment of PAC personnel during the alleged massacre of the residents of Hashimpura Mohalla, to Zafaryab Jilani. It is brought to your notice that all the details of the case were weeded out on April 1, 2006. Hence, it is impossible to make them available,” said the letter signed by the Meerut SSP on January 30.\n\nA senior official said the documents were required as the State government had appealed against the acquittal of the accused.\n\nRebecca John, counsel for the victims and survivors, told The Hindu that charges had been framed against the accused at the time when the crucial documents were destroyed. “The fact that the original documents on the horrific massacre of 42 men were destroyed shows the utter contempt police and authorities have for the court procedure. It is unprecedented that the agency relied upon by the prosecution to establish its case should have chosen to destroy the documents,” she said.\n\nMs.John said the CB-CID’s failure to retain these records would be raised when the appeals of the UP government and the victims and survivors came up in the Delhi High Court. “This is no small case, but a massacre of mammoth proportions. Someone has to be made accountable for the acts which actually had immense adverse impact on the dispensation of justice,” she said.", 
    "section": "national", 
    "title": "U.P. police destroyed papers on massacre", 
    "subsection": "general", 
    "date": "2016-02-02"
}