{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Bombay High Court on Monday directed the Central Railway (CR) to grant three months’ maternity leave to its employee who became a mother by using a surrogate.\n\nA Division Bench of Justice Anoop Mohta and Justice G.S. Kulkarni gave this verdict while hearing a petition filed by a nurse working at the Dr Babasaheb Ambedkar Railway Hospital in Byculla East. She moved court after the CR refused to grant her leave on the ground that the Railways had no rule that allowed leave.\n\nThe court ruled that a mother enjoys the same benefits of maternity leave as any other working woman under the Child Adoption Leave and Rules. “There is nothing in the rules that disentitles maternity leave to a woman who has attained motherhood through surrogacy procedure,” the court added.\n\nWhile challenging the CR for disallowing her leave, the woman’s lawyers argued that if the maternity leave was refused, it would certainly violate the right of a child to develop a bond with the mother. The petitioner got married in 2004 and underwent IVF in 2007 on two occasions but lost her baby. In 2012, she was advised to have a child through surrogacy. When the surrogate mother completed 33 weeks, the petitioner applied for maternity leave in January 2014 as the baby was expected to be delivered in the first week of February.\n\nIn its reply, the CR asked her if she had sought permission before opting for surrogacy. She wrote back saying that she can claim maternity leave for surrogacy under the Indian Railway Establishment Board that provides for a Child Adoptive Leave. However, she was not granted the leave.\n\nOn January 29, 2014, the surrogate mother delivered twins and again the petitioner wrote a letter to the medical officer seeking leave under Child Care Leave. The officer forwarded it to the CR.\n\nThe High Court Bench on Monday directed the Central Railway to grant her maternity leave of 180 days. The petitioner’s lawyers referred to an earlier judgment of a Nagpur bench of the Bombay High Court which, in a similar case, said: “a woman cannot be discriminated as far as the maternity benefits are concerned, only on the ground that she has obtained the baby through surrogacy.\n\n“Though the petitioner did not give birth to the child, the child was placed in the secure hands of the petitioner as soon as it (child) was born. A newly-born child cannot be left at the mercy of others,” the judgment said.\n\n( With PTI inputs)\n\nA newborn cannot be left\n\nat the mercy\n\nof others, says Bombay HC", 
    "section": "national", 
    "title": "‘Woman having child through surrogacy entitled to maternity leave’", 
    "subsection": "general", 
    "date": "2016-02-02"
}