{
    "author": [], 
    "text": "Tickets for the premiere at the show in Amsterdam on February 6 are already sold out\n\nDutch National Ballet principal dancer Anna Tsygankova performs during the rehearsal of Mata Hari , a ballet based on the life of Mata Hari.— Photo: AFP\n\nNearly a century after she was shot as an alleged spy, the story of the world’s ultimate femme fatale, Mata Hari, is to be staged for the first time as a ballet in her native Netherlands.\n\nMata Hari will open to an already sold-out premiere at the Dutch National Ballet in Amsterdam on February 6, aiming to bring to life through dance the woman whose name has become synonymous with unbridled sensuality and ultimately, fatal betrayal.\n\nFrisian-born Margaretha Geertruida Zelle, known by her stage name Mata Hari, was executed by a French firing squad on October 15, 1917 after being accused of spying for Germany during World War I. She was just 41.\n\nIn the years before the war, her daring striptease act had brought her notoriety, fame and adoration and she’s widely regarded as one of the world’s first-ever exotic dancers.\n\nNow her story is being told “en pointe” for the first time.\n\n“I wanted to make a dramatic ballet... and I was looking for a subject matter to create dance, so there had to be a connection with dance,” said Ted Brandsen, Dutch National Ballet director and the show’s choreographer.\n\n“Mata Hari was a person who always fascinated me and she was Dutch. A lot of people actually don’t know that,” Mr. Brandsen said.\n\nThe idea of creating a major new ballet began four years ago — and when Brandsen shared his plans with two-time Grammy-nominated British composer Tarik O’Regan, it all came to life.\n\nMore than 60 dancers will perform during the two-hour production featuring a kaleidoscope of experiences from Mata Hari’s life.\n\nMuch of the ballet is set in Paris, where she kept a string of lovers said to include famous Italian composer Giacomo Puccini.\n\n“Much like Mata Hari had a fast-paced life, so do we want to tell her story in a fast-paced way on stage,” said Brandsen.\n\nRichly complementing the dance, is a wardrobe of more than 300 lavish costumes designed by Francois-Noel Cherpin — who began working on the designs three years ago.\n\nDeep inside the company’s building next to the Amstel River, Brandsen and his co-producers are hard at work.\n\nPrinciple dancer, Russian ballerina Anna Tsygankova, glided effortlessly through rehearsals.\n\n“To touch upon her life story is a great opportunity for me to get to know Mata Hari better,” Ms. Tsygankova, who trained at the Bolshoi ballet, said.\n\n“She is an enigma to me. Who can say for sure? Was she just a dancer? Was she really a spy, or perhaps a victim of her circumstances?”\n\nAfter a rancorous divorce from a Dutch officer in the colonial army left Zelle penniless, she fled to Paris in 1904 to start a new life.\n\nThere she quickly reinvented herself as “Mata Hari”, an Indonesian word for “Eye of the Day” and adopted Javanese dancing in an erotic act that often left little to the imagination.\n\nFame of her “exotic beauty” quickly spread across Europe and almost overnight she became a celebrity, who also raised eyebrows for her many affairs. “She went to Paris and completely reinvented herself. That idea is what intrigues me about her,” said Mr. Brandsen. “She became comparable to somebody like Madonna, or Lady Gaga today. She became famous very quickly.”\n\nBy 1914 however her popularity was waning and she found herself in Berlin when war broke out.\n\nShe was recruited by the Germans to spy on France and Britain. But today it is widely believed she never really took the deadly business of spying seriously, but rather agreed because of the money —and the glamour.\n\nAfter trying to reach the front to meet a young Russian officer, her lover at the time, Mata Hari was arrested by a French officer and charged with being a double agent.\n\nOn a cold October morning she was shot in the Parisian suburb of Vincennes.\n\nOn the day of her execution, Mata Hari is said to have declined a blindfold and blew kisses to her executors.\n\n“She died with her head held high,” Mr. Brandsen said. — AFP", 
    "section": "national", 
    "title": "WWI ‘spy’ Mata Hari in new Dutch ballet", 
    "subsection": "general", 
    "date": "2016-02-02"
}