{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "Students classified as ‘Visa Waiver Pilot Programme violators’ by Department of Homeland Security will have to seek legal help\n\nA student who was sent back from the United States being consoled by his relatives at the Rajiv Gandhi International Airport in Hyderabad on Saturday.— Photo: K.V.S. Giri\n\nImmigration for students with admit cards issued by the Silicon Valley University and the Northwestern Polytechnic University has turned into a nightmare. While earlier, they faced only the risk of deportation, experience recounted by a new batch of students deported from the United States reveals that some were also handcuffed and barred entry to the country for five years.\n\nFour students, including a girl, out of the 40 who landed in the city’s Rajiv Gandhi International Airport on January 1 and 2, confirmed that they were handcuffed and questioned in interrogation rooms at Boston’s immigration wing.\n\nWorse, their deportation records (copies of which are with The Hindu ) issued by the U.S. Department of Homeland Security (DHS), stated that under “Sections 235 (b)(1) or 240 of the act (Immigration and Nationality Act), they are barred from “entering, attempting to enter or being in the United States.”\n\nThis because the DHS had found them to be “Visa Waiver Pilot Programme violators”, which among many definitions of the term could mean people who try to enter the country without proper documentation and immigrate to gratify intensions other than those permitted by the visa they hold.\n\n“Each of us was questioned by two officers. We showed all original documents and the required bank details. But they deported us and our handcuffs were removed only after we boarded the return flight,” said a Hyderabad based student who was barred for five years from entering the country.\n\nThe students had flown from the city to the U.S. in a private airline via Dubai and landed in Boston. According to another student, it was not the language barrier that caused deportation.\n\n“Going by their questions, the officers seemed to suspect us of fraud and maybe that is why they handcuffed us,” he said. Students who are barred entry will now have to seek legal help.\n\nThe U.S. authorities drew the ire of the Ministry of External Affairs when they radio-tagged Telugu students who had taken admission to the Tri Valley University that was declared fraudulent in 2011.\n\nOf the 40 students who have been deported in the past two days, most returned from Seattle, others from San Francisco and Boston.\n\nTill recently, deportation documents issued to most students by the DHS were forfeiting receipts, till some started barring entry. As per the forfeiting forms, the students sign a document which states that they be “permitted to withdraw” their “application and return abroad.”\n\nA girl student who flew to Seattle via Heathrow, London, said that she felt humiliated and insulted. “I had Rs. 40 lakh in my bank account and answered all their questions with confidence,” she said as her voice choked with emotion.", 
    "section": "national", 
    "title": "Cuffed, deported, barred entry to U.S.", 
    "subsection": "general", 
    "date": "2016-01-03"
}