{
    "author": [
        "Smita Gupta"
    ], 
    "text": "Delhi Chief Minister Arvind Kejriwal took a huge political gamble in early December when he announced that his government intended to impose an odd-even formula for vehicles traversing the streets of the national capital to battle rising pollution. Political parties — from the Bharatiya Janata Party to the Congress — dismissed the idea as a gimmick, and discussions on television tended to be dismissive.\n\nThree weeks rolled by, and Mr. Kejriwal and his Aam Aadmi Party (AAP) colleagues continued relentlessly to bat for the experiment even as they drew up a list of exemptions for the first 15-day phase that started Friday. Gradually, as the health hazards related to rising pollution began to be reported on, the need for a collective response gathered strength, and the scepticism in the media faded as it took it on as a campaign.\n\nWhen Delhi Police Commissioner B.C. Bassi sounded less than enthusiastic about implementing the formula, the Chief Minister said he would deploy volunteers. Instantly, Mr. Bassi, stressing that would amount to vigilantism, said the police would undertake the task. Having achieved his purpose, Mr. Kejriwal retreated, saying his volunteers would merely practise Gandhigiri, presenting flowers to those who broke the rules.\n\nFinally, on the opening day of that experiment, it appeared that the gamble had paid off: a majority of drivers did not just obey the new diktat but a majority of those interviewed by TV channels on the streets affirmed their support for the move.\n\nAs an army of civil defence volunteers and schoolchildren, all armed with flowers, joined the policemen on Delhi’s roads, the message of a participatory democracy was amplified as people began to realise that this problem that concerns us all needs to be addressed unitedly. Most political parties felt that this issue would annoy the middle class: but the pendulum seems to have swung the other way, if Friday’s wall-to-wall coverage on TV and the social media are any indication. Mr. Kejriwal is now being seen as a man of action, willing to risk a politically unpopular decision to improve life for the citizenry. He has hit upon a new method of political mobilisation that cuts across social groups.\n\nKejriwal is now seen as a man of action, willing to risk a politically unpopular decision", 
    "section": "national", 
    "title": "Kejriwal’s gamble unites Delhi", 
    "subsection": "general", 
    "date": "2016-01-03"
}