{
    "author": [], 
    "text": "Natalie Cole, best known for the songs ‘Unforgettable’, ‘Inseparable’ and ‘This Will Be’, died on Thursday. She was 65.\n\nThe singer-songwriter died in a Los Angeles hospital due to “complications from ongoing health issues,” her publicist Maureen O’Connor confirmed.\n\nHer family released a statement, “It is with heavy hearts that we bring to you all the news of our Mother and sister’s passing. Natalie fought a fierce, courageous battle, dying how she lived… with dignity, strength and honour. Our beloved Mother and sister will be greatly missed and remain UNFORGETTABLE in our hearts forever.”\n\nShe was supposed to perform for New Year’s Eve concert at Disney Hall in LA but she cancelled all commitments a month ahead due to illness.\n\nNatalie’s mother was the late singer Maria Hawkins Cole.\n\nShe received a kidney transplant in May 2009 and had battled Hepatitis C. Through the years, she struggled with drug addiction.\n\nNatalie’s 1991 jazz album, ‘Unforgettable ... With Love’, featuring numerous standards sung by her father, sold 14 million copies.\n\nThe album reached the top of the Billboard 200 album chart on July 27, 1991. It featured a duet with her father.\n\n‘Unforgettable ... With Love’ won multiple Grammys, including the 1992 Album of the Year, Record of the Year, Traditional Pop Vocal Performance, Song of the Year, Arrangement Accompanying Vocals and Producer of the Year.\n\nMany stars have poured condolences for the passing of Nat King Cole’s daughter.\n\nTony Bennett said, “I am deeply saddened to hear of the passing of Natalie Cole, as I have cherished the long friendship I had with her, her father Nat, and the family over the years. Natalie was an exceptional jazz singer and it was an honour to have recorded and performed with her on several occasions. She was a lovely and generous person, who will be greatly missed.”\n\n“A voice from heaven has been called home,” Cher tweeted.\n\nThe Recording Academy said in a statement, “We’ve lost a wonderful, highly cherished artist and our heartfelt condolences go out to Natalie’s family, friends, her many collaborators, as well as to all who have been entertained by her exceptional talent.” — PTI", 
    "section": "national", 
    "title": "Multiple Grammy-winner Natalie Cole is no more", 
    "subsection": "general", 
    "date": "2016-01-03"
}