{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "PM will lay the foundation stone for the Rs. 4,000-crore project today\n\nOn Sunday, a nondescript backward village about 100 km from this Indian aerospace hub will be flagged off into big-time journey of manufacturing military helicopters.\n\nBiderahalla Kaval in Tumakuru’s Gubbi taluk is where aircraft maker Hindustan Aeronautics Ltd. (HAL) has planned to start its composite Rs. 4,000-crore helicopter complex.\n\nOn Sunday afternoon, Prime Minister Narendra Modi is stopping over briefly from Mysuru (after inaugurating the annual Indian Science Congress) to lay the foundation stone for the 600-acre facility. The HAL says the full facility, including a helipad, should be ready by around 2019.\n\nInitially, the HAL plans to manufacture the lighter, three-tonne machines — the Light Utility Helicopter (LUH) for reconnaissance and surveillance; and then the attack helicopter LCH (Light Combat Helicopter). It will overhaul and repair military helicopters.\n\n“The facility will boost [HAL’s] aviation capability in the helicopter segment as it will produce three-tonne to ten-tonne class of helicopters,” HAL Chairman T. Suvarna Raju told The Hindu . “Later, it could take up the 10-12-tonne class into which we are yet to venture.” The HAL earlier explored the production modalities of this class tentatively.\n\nCurrently, the Bengaluru Helicopter Division produces the indigenous 5.5-tonne ALH Dhruv for civil and military agencies; the older Cheetah, the Lancer and also the re-engined Cheetal choppers. Repair and overhaul of the forces’ rotary fleet are also done here. When the Tumakuru complex gets going, the Bengaluru facility, along with the Rotary Wing Research & Design Centre, would remain busy with next levels of helicopter R&D and design, Mr. Raju said.", 
    "section": "national", 
    "title": "Non-descript village to host HAL’s helicopter complex", 
    "subsection": "general", 
    "date": "2016-01-03"
}