{
    "author": [], 
    "text": "New versions are expected, sparking debate over how one of the most controversial books in history should be treated\n\nCopies of Mein Kampf, which will be printed in Germany in January for the first time since World War II.— Photo: AFP\n\nThe controversy over the upcoming re-publication of Adolf Hitler’s Mein Kampf in Germany is having particular resonance in Israel, where memories of the Holocaust run deep and the book remains taboo.\n\nHitler’s anti-Semitic rant, which he wrote from prison in the early 1920s, lost its copyright in Germany on Friday, and the country’s first release of it since 1945 is due out soon in the form of an extensively annotated version.\n\nThe copyright had been held by the German state of Bavaria, to which it was granted by the victorious Allies after World War II, and now enters the public domain.\n\nNew versions are expected in many countries, sparking fierce debate over how one of the most controversial books in history should be treated.\n\nMein Kampf , or “My Struggle”, does not face a total legal ban in the Jewish state, but any large-scale publication remains forbidden, the Israeli Culture Ministry says.\n\nEven if there were no restrictions at all, publishers say there is still stigma around the book in a country formed after the Holocaust that was inspired by Hitler’s writings. According to the Foundation for the Benefit of Holocaust Survivors in Israel, 1,80,000 of them live in the Jewish state.\n\nMurray Greenfield, founder of Gefen Publishing, which specialises in works about Judaism and its history, said he would not publish it “even if they paid me”.\n\n“My wife is a Holocaust survivor,” he said. “We have a built-in censorship on this book, in spite of being very much against censorship (generally).”\n\nIn many countries, including some of Israel’s Arab neighbours, copies of the book are widely available. It can also be found on the Internet.\n\n“The book is available online,” Dan Michman, head of the Yad Vashem International Institute for Holocaust Research, said. “Many copies are to be found. Some 12 million copies were printed in German; so it is not rare.”\n\nThe book is also available in a shortened version in Hebrew in Israeli universities, the result of a campaign in the late 1980s by Holocaust survivor Dan Yaron.\n\nYaron, who died in 1999, fought for the book, totally forbidden until then, to be published in Hebrew for educational purposes.\n\n“He said it was important for the people to know and to prevent future such events by reading what the [Nazi] leader was saying,” Mr. Michman said. Yaron, he added, approached him to publish it, but there was no money at the time.\n\nIn the end, the Hebrew University of Jerusalem financed the project, and a condensed version of the rambling 720-page original is available in Israeli universities and research institutes. Mr. Michman was involved in drafting the 3,500 explanatory notes for the annotated German reprint, expected out in the coming days, and the book will remain outlawed if it is not contextualised. He said it was positive to put the book in a wider context. “It will include a lot of issues around the text — where Hitler took his ideas from [and] when he suggests something it explains if and how it was translated into deeds.” — AFP", 
    "section": "national", 
    "title": "Out-of-copyright Mein Kampf does not suit Israel", 
    "subsection": "general", 
    "date": "2016-01-03"
}