{
    "author": [
        "Tca Sharad Raghavan"
    ], 
    "text": "Finance Minister asks revenue officials to make taxation a painless process for people\n\nThe government is hopeful of the passage of the Goods and Services Tax Bill in the Budget session of Parliament, when the numbers in the Rajya Sabha will swing in its favour, according to Union Finance Minister Arun Jaitley.\n\n“Halfway through the next session, the numbers in the Upper House will also change. I am reasonably optimistic as far as the next session is concerned that we will be able to push it [GST Bill],” Mr. Jaitley said, as the strength of parliamentarians belonging to the Congress and its allies would start to diminish.\n\nThe GST is expected to boost economic growth by one to two per cent as it will replace India’s complex indirect tax regime of multiple state and central levies that makes inter-State trade and movement of goods tedious. The new tax regime should have been introduced much earlier, says Mr. Jaitley.\n\nThe government had announced a target date of April 2016 for the rollout of the GST regime, but is now eyeing a start in the middle of financial year 2016-17. The Finance Minister said he would be continuing his talks with the States and all the political parties to ensure the passage of the Bill.\n\nAfter the Constitution Amendment Bill is passed in Parliament, there are three more legislation — Central GST (CGST), State GST (SGST) and Integrated GST (IGST) — that need to be passed for the GST regime to come into force.\n\n“We are in the stage of readiness as far as those legislation are concerned which will have to be passed then by the Central government and by the State governments,” Mr. Jaitley said.\n\n“If you ask me 4-5 years later, in Income Tax Act ... did the provisions of the retrospective taxation help India or did they hurt India? My answer is very clear, they hurt India because at the end of the day we have not been able to collect those taxes and we scared investors away,” Mr. Jaitley said, addressing officer-trainees of the Indian Revenue Service.\n\nThe Minister told revenue officials to make taxation a painless process for people. “When in doubt, go straight. You’ll never go wrong. The moment you deviate by even a few inches, there is no limit to which you can fall. There is no such thing as 99 per cent integrity,” he said. “If you lean either way then you will unfairly cost the revenue or you may be unfairly taxing an assessee. ”\n\nThe introduction of GST is expected to boost economic growth by 1 per cent to 2 per cent as it would replace India’s complex indirect tax regime of multiple state and central level levies that makes inter-state trade and movement of goods tedious.\n\nArun Jaitley Finance Minister\n\nI am reasonably optimistic as far as the next session is concerned that we will be able to push it, Jaitely says\n\nThe new tax regime will lead to the economic integration of India", 
    "section": "national", 
    "title": "Passage of GST Bill likely in next session", 
    "subsection": "general", 
    "date": "2016-01-03"
}