{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Ram Chandra Purve, the incumbent Rashtriya Janata Dal (RJD) State president and close confidant of party chief Lalu Prasad Yadav, was on Saturday unanimously elected as the party president of the Bihar unit. Mr. Purve has been elected for the post for the third time.\n\nAll party leaders and workers were present at the party headquarters for a State executive committee meeting where Mr. Lalu Prasad formally announced Mr. Purve’s name and congratulated him on the re-election.\n\nKnown as a soft-spoken person, Mr. Purve has been with the party since its inception. He was first elected for the post in 2010 and was re-elected in 2013, when the RJD was voted out of power.\n\n“No one other than the incumbent Ram Chandra Purve had filed nomination for the State party chief post”, said Chitranjan Gagan, RJD’s additional election officer.\n\nExpressing gratitude to Mr. Prasad and other members for reposing faith in him for a third term, Mr. Purve said, “I’m obliged by the goodwill gesture of party leadership and I’ll make further efforts to improve the party organisation in my third term”.\n\nIt was under the State leadership of Mr. Purve that the RJD won 80 seats out of 101 contested in the last State assembly elections, making the party part of the Bihar government after 10 years. The RJD was voted out of power in 2005.\n\n“We have our base in 21 States and under the able leadership of our national president Lalu Prasadji, the Mahagathbandhan (Grand Alliance) with the JD(U) and the Congress party will script a new history in the politics of Bihar as well as that of the country”, Mr. Purve said.\n\nRumours of fissures\n\nAddressing party leaders and workers, Mr. Prasad accused opposition BJP and its allies for spreading rumours about fissures in the Grand Alliance.\n\n“They’re creating all sorts of rumours to create a rift in our alliance but let me be clear here, this government will complete its full term and there is no confusion among the alliance partners”, Mr. Prasad said. He also advised party leaders to maintain a safe distance from the media to avoid spreading confusion with their statements.\n\n“Now I’ll tour the entire country to uproot the BJP from the Centre…my schedules have been fixed but all of you too have to be alert over their (BJP) false propaganda among the masses”, Mr. Prasad said.", 
    "section": "national", 
    "title": "Purve re-elected RJD Bihar chief", 
    "subsection": "general", 
    "date": "2016-01-03"
}