{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Complaint of a senior Punjab Police officer thathe was abducted by terrorists was ignored\n\nTackling terror:Security personnel take position on the rooftop of a building outside the Pathankot airbase on Saturday. — Photo: AP\n\nhe security establishment lost crucial hours in verifying the claims of a senior Punjab Police officer, who was abducted by terrorists along with two others early on Friday, and possibly squandered away chances of tracking the terrorists before they stormed the Pathankot Air Force base.\n\nAfter police officer Salwinder Singh alerted his counterparts that he, along with his jeweller friend Rajesh Verma and cook Madan Gopal, was abducted by five heavily armed terrorists dressed in Army fatigues, the establishment disbelieved him.\n\nA senior government official described the police officer as having a “colourful background”, which is why the police dismissed his initial claims that the armed men could be terrorists.\n\nIt was only after one of the terrorists rang up his mother in Bahawalpur, Pakistan, and spoke to her (the call was intercepted) that the possibility of an imminent terror attack became clear and National Security Adviser Ajit Doval took charge of the situation, well past noon.\n\nNational Security Guards and Army commandos were mobilised and the Border Security Force was asked to check the possible infiltration points.\n\nThe terrorists, suspected to belong to Jaish-e-Mohammad (JeM), a Pakistan-based outfit, had snatched the mobile phones of Mr. Verma and Mr. Singh. It was from Mr. Verma’s phone that one of the terrorists reportedly made a call to his mother at Bahawalpur in Pakistan. This call, intercepted by the agencies, gave the first clue of a terrorist attack planned for the State.\n\nDuring the phone call, the alleged terrorist is heard telling his mother in a Punjabi accent: “Main kuch bada kaam karne aaya hoon, jispe aapko fakr hoga [I have come for a great work and you will be proud of me].” When the woman asks him when did he go to India, he replied: “Kal raat daakhil hue [We entered yesterday night].”\n\nThis call established that the attackers could have entered India in the intervening night of December 30-31 as the call was made in the early hours of Friday.\n\nA top intelligence officer told The Hindu that the possibility that the group belonged to the JeM was only on the basis of a handwritten note recovered from Mr. Singh’s vehicle, which the terrorists had used. The Hindu has a copy of the note.\n\nThe note written in English and signed by “A.G.S”, dated December 25, 2015, says the group had planned attacks to avenge the death of Afzal Guru, the 2001 Parliament attack convict, who was hanged to death in 2013. The officer said that till now, they had not been able to make any recoveries from the Pathankot airbase, where the operation took place for 13 hours and continued till late in the evening on Saturday.\n\nThe officer said that so far they had not received any information on Pakistan’s complicity. He said the airbase had been cordoned off and would be opened up for investigations and recoveries on Sunday.\n\n“By afternoon, we were sure that terrorists had sneaked into Punjab and a high alert was sounded. The NSA had taken control of the situation. We are treating this as a minor victory of sorts as a major attack has been thwarted,” said the top intelligence officer.\n\nIt was from Verma’s phone that one of the terrorists reportedly made a call to his mother in Pakistan", 
    "section": "national", 
    "title": "Puzzling delays, squandered chances and then gunshots", 
    "subsection": "general", 
    "date": "2016-01-03"
}