{
    "author": [
        "Radhakrishnan Kuttoor"
    ], 
    "text": "Travancore Devaswom Board will approach PM with a request to delink 500 hectares from Periyar Tiger Reserve\n\nThe Travancore Devaswom Board (TDB) has decided to approach Prime Minister Narendra Modi to seek the delinking of 500 hectares of forestland in and around Sabarimala from the Periyar Tiger Reserve (PTR) to provide basic pilgrim facilities as recommended by the Public Accounts Committee (PAC) of Parliament a decade ago.\n\nTalking to The Hindu , TDB president Prayar Gopalakrishnan and member Ajay Tharayil said they would meet the Prime Minister after the Makaravilakku festival seeking his help in developing Sabarimala into an international pilgrimage centre by providing sustainable amenities.\n\nThe TDB officials said Sabarimala, situated 467 metres above mean sea level, had been plagued by “grossly inadequate” basic facilities due to non-availability of space.\n\nMr. Tharayil said the concept of Sabarimala pilgrimage itself stood for preserving the pristine glory of the sacred grove ( poonkavanam ). The TDB was for providing basic pilgrim facilities there in an eco-friendly manner. However, frequent intervention and intimidation by the Forest Department have been posing hurdles in the temple administration’s efforts to ensure proper pilgrim facilities at Sabarimala, he said.\n\nHe said the board had only 25 hectares of land, allotted by the erstwhile kingdom of Travancore, in its possession at Sabarimala. He added that a TDB team would invite Mr. Modi to visit Sabarimala at the earliest.\n\nPAC recommendation\n\nMr. Tharayil said the PAC visited Sabarimala in 2004 and 2005 to collect first-hand information regarding the problems faced by the pilgrim centre.\n\nChapter II of one of the reports submitted by the PAC had discussed the problems facing the pilgrims on account of the inclusion of Sabarimala in the PTR.\n\nThe report had categorically stated that delinking Sabarimala from the PTR was the only remedial measure to address the plight of the pilgrims.", 
    "section": "national", 
    "title": "Sabarimala authorities seek more forestland", 
    "subsection": "general", 
    "date": "2016-01-03"
}