{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Structural problems continue to haunt the Tamil film producers despite the industry enjoying a good 2015 at the box office. There are hundreds of movies which have received their certification, but simply have no chance of recovering even the money spent on production as they are not ‘marketable’.\n\nThere are more than a 100 movies already hoping to sneak into one of the 52 Fridays in 2016.\n\nProducers, who are active in the film business, often point out that the problem was accentuated after the film industry embraced digital technology, which significantly reduced the cost of making a film.\n\n“Youngsters with fresh ideas and ambition started making more and more movies. But today, the cost of production has gone through the roof. Even to shoot a low budget film, one needs Rs. 2.5 lakh a day,” says Sridhar Pillai, senior entertainment journalist.\n\nProducer C.V. Kumar, who made a slew of low-budget, but highly successful films such as Pizza, Soodhu Kavvum, Atta Kathi , could be credited with kick-starting this trend and cracking the business model. This business model – making a small budget film and selling it to the satellite channels hungry for content – worked well for a time until satellite channels decided to pull the plug.\n\nToday, the distributors and the satellite channels aren’t ready to buy the movies as they have no recognisable faces.\n\nJ. Satish Kumar, who has mainly produced and backed smaller films such as the super hit film, Naduvula Konjam Pakkatha Kaanom , and is currently planning to produce three films (all low budget) in 2016, says that producers often start production with no idea about how the market or production works.\n\n“The producers’ council has more than a thousand members, out of which only 15-20 members are actively engaged in production. The rest have all disappeared,” he says.\n\nWhile stating that ‘low-cost films’ still are the best bet, he says that these first-time producers flooded the market with so many movies that it even bigger movies have begun to suffer.", 
    "section": "national", 
    "title": "Several Kollywood movies waiting in queue", 
    "subsection": "general", 
    "date": "2016-01-03"
}