{
    "author": [], 
    "text": "The arrest of Syed Abbas Tublani in connection with the threats to and proposed attack on journalist S. Balakrishnan has led to a new avenue of investigations. Sources confirmed that the Crime Branch has initiated investigations into a hawala racket through which wanted fugitive Shakeel Babumiyan Sheikh alias Chhota Shakeel used to send money to Tublani every month.\n\nTublani was arrested from Mumbra on Thursday in connection with the threats that Mr. Balakrishnan got when he bid for the Delhi Zaika restaurant, a property belonging to the 1993 bomb blasts accused Dawood Ibrahim Kaskar, when it was auctioned off by the government. Crime Branch officials said that Tublani was planning an attack on Mr. Balakrishnan after he bid for the restaurant in spite of the warnings issued to him.\n\n“Tublani’s interrogation has revealed that Shakeel used to send him between Rs. 5,000 and Rs. 10,000 every month for expenses through a hawala network. We are obtaining more details about the people involved in this network and are probing this aspect further. Tublani’s interrogation has yielded some leads about the network and he is being interrogated further to this end,” a Crime Branch officer said.\n\nThe Crime Branch is currently conducting inquiries in Mumbra where Tublani was staying, getting details of regular visitors to his residence and analysing his movements over the last few months. The people that he has frequently spoken to on the phone are also under the scanner, with the police checking their backgrounds, said officials.\n\nThe Hindu , in a series about the activities of Kaskar’s gang, had reported how several of his loyalists get monthly payments from him. Many of his gang members, or their families if they are in prison, have been getting regular payments as well as other help, including college admissions for children, all of which is being managed from Pakistan, where Dawood and Shakeel are both located.\n\nOfficials said Tublani was in regular touch with Shakeel over the phone and was also in touch with others in Mumbai involved in the wanted fugitive’s network.\n\nCops begin probe into Shakeel’s hawala network", 
    "section": "national", 
    "title": "‘Shakeel aide got monthly retainer through hawala’", 
    "subsection": "general", 
    "date": "2016-01-03"
}