{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "How can government propose such kind of destructive plans without first conducting a comprehensive study, ask NFF and GRE.\n\nThe National Fishworker’s Forum (NFF) and its Goa affiliate Goenchea Ramponkarancho Ekvott (GRE) on Saturday demanded that all dredging, expansion of ports and building of new ports must halt with immediate effect until there is a comprehensive study of the sustainability of coastline for such an exercise.\n\nReferring to the projects suggested for Goa by Union Minister for Road Transport and Highways, Mr. Nitin Gadkari, during his visit to Goa on Friday, NFF and GRE office-bearers on Saturday asked how he could suggest such projects “that are feared to destroy the little existing marine ecology lock, stock and barrel”. “In the name of development, the Government has been proposing projects like sea planes, deep dredging for expansion of sea ports, marinas, etc., which are destructive in nature”.\n\nQuestioning the BJP’s sustainable development promised , President of GRE, Agnelo Rodrigues and Joint General Secretary of NFF, Olencio Simoesaccused the Central Government of looting the State and the country of its marine environment through haphazard plans.\n\n“The National Waterways Bill, 2015 states that 111 rivers in the country including six of Goa will be developed for the purpose of inland waterways. In order to make way for inland waterways, deep dredging will be conducted on all these rivers. Dredging have not been conducted for several years. Consequently, it would be an unsustainable exercise and sudden dredging would led to collapse of the river beds may cause water-logging areas surrounding the river, besides completely destroying corals, sea weeds and other marine ecology, collapse of mangroves, etc.”, apprehended Mr. Simoes.\n\nHe recalled expert Dr. Antonio Mascarenhas of the Goa Coastal Zone Management Authority (GCZMA) had warned the Goa Government against deep dredging proposed by Mormugao Port Trust (MPT) , which would aggravate sand erosion would cause drastic morphological changes within the estuary. Mr. Simoes further pointed out that of the 7,516.6 km coastline in the country, 42 per cent has already been washed away, dredging of 111 rivers, expansion ports and jetties would only further intensify erosion of the coast due to Coastal Regulation Zone (CRZ) violations.\n\n“About 20 per cent of the 105 km of Goa’s coastline has already been affected by erosion. Heavy sand mining, constructions along the coast etc., are some of the reason of such destructions. We fear a Chennai flood like situation with this unsustainable dredging”, warned the Fisherfolk’s bodies.\n\n‘Govt. projects are feared to destroy the existing marine ecology lock,\n\nstock and barrel’", 
    "section": "national", 
    "title": "Stop dredging and expansion of ports, demands fishworker’s forum", 
    "subsection": "general", 
    "date": "2016-01-03"
}