{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "Stuck in a foreign land with no friends and no money after being promised a job, a 27-year-old Mumbai resident sent out a plea on Twitter, asking for help to return home. The Mumbai Police, through its recently launched Twitter handle, got in touch with him and have launched an inquiry into a possible job racket.\n\nIn December, Kshitij Ganekar, was contacted on email by a man who identified himself as Mukesh Munda.\n\nThe email, Mr. Ganekar said, informed him that he had been selected for a job aboard a ship in Jakarta, Indonesia. Mr. Ganekar and Mr. Munda then remained in touch with each other through email and Facebook messages. Mr. Munda allegedly told Mr. Ganekar to meet him in Jakarta for further formalities.\n\n“I reached Jakarta on Friday and contacted Munda on the number he had given me. On his instructions, I got a visa and waited for him to call me back, but there was no contact. I even went to the port he had mentioned and found no ship with the name that he had given me. In the evening, he took my call and told me that the ship had left earlier than usual, and asked me to wait. Since then, his phone has been switched off,” Mr. Ganekar told The Hindu , on phone from Jakarta.\n\nMr. Ganekar said apart from air fare and hotel expenses, which came up to Rs. 1 lakh, he had also transferred Rs. 65,000 to Mr. Munda’s account, which left him with very little money. Finding himself trapped, Mr. Ganekar then turned to Twitter, sending out tweets describing his predicament, and tagging several official handles, including the Prime Minister’s Office and the Mumbai Police. The Mumbai Police responded to his tweet, after which Mr. Ganekar sent a detailed email recounting the sequence of events.\n\n“We are in touch with Mr. Ganekar, and have forwarded his email to the Versova police. They will be visiting Mr. Ganekar’s residence and getting more details about the case, after which we will decide on further course of action,” said Mumbai Police spokesperson Dhananjay Kulkarni.\n\nThe police have also alerted officials in Indonesia and the Indian Embassy there, requesting them for help. Meanwhile, Mr. Ganekar’s parents managed to put together some money on Saturday evening and booked a ticket for a flight to India on Sunday.\n\nThe Versova police have registered an FIR in the case on charges of cheating.\n\nPolice suspect job racket, contact family in Versova, register case of cheating", 
    "section": "national", 
    "title": "Stranded in Jakarta, conned Mumbai man turns to Twitter for help", 
    "subsection": "general", 
    "date": "2016-01-03"
}