{
    "author": [
        "Special Correspondent"
    ], 
    "text": "There are striking similarities between Saturday’s terror attack on the Pathankot Air Force Base and last year’s July 27 attack in the neighbouring Gurdaspur district of Punjab, where 10 persons were killed.\n\nIn both the incidents, the alleged terrorists struck in districts close to the Pakistan border and snatched vehicles to execute their plan. In Saturday’s attack, three defence personnel were said to have been killed along with four terrorists.\n\nJust as reported during the Gurdaspur incident, this time also the terrorists are suspected to have come at least two days prior to the attack and were found to be moving freely in Army fatigues, without being checked or intercepted by any security force personnel.\n\nDuring the Gurdaspur attack, the accused were using GPS devices and stormed a police station. This time too, a defence installation was attacked. “The similarity between the two places being that it also housed the families of police personnel [Gurdaspur] and the Air Force personnel in Pathankot’s case. Maybe the idea was to inflict maximum casualties,” said a senior investigating officer.\n\nIn both the operations, the terrorists engaged the security forces for more than 10 hours. Though the Border Security Force had ruled out that the three terrorists involved in the Gurdaspur attack entered India after crossing the Ravi, which flows near the Pakistan border, this time they said they were yet to come to any conclusion. “On our part we have checked the border areas and have not found any sign of forced entry but it cannot be denied every time. The fact is they are coming from somewhere. We have also checked border areas for any possible presence of tunnel but haven’t found any,” said a senior BSF officer.", 
    "section": "national", 
    "title": "Striking similarities in attacks", 
    "subsection": "general", 
    "date": "2016-01-03"
}