{
    "author": [], 
    "text": "Union Home Minister Rajnath Singh spoke to Nistula Hebbar on the terror attack on the Indian Air Force base in Pathankot, secularism and the Uniform Civil Code. Here are the excerpts:\n\nWe are in the middle of a major terror attack in Pathankot. As Home Minister how worried are you, and what effect will it have on our relationship with Pakistan?\n\nLet me first tell you about the Government of India’s policy which is that we want a good relationship with neighbours and other countries across the world, but if there is a terror attack against us, the government is willing, and able, to give a befitting reply. There will be zero tolerance on terror and that has been the policy of this government through its tenure. Having said that, the Pakistan government has also condemned this attack on us. I feel that when we talk to each other, there should be a discussion on terror as well. What we should be doing for preventing such attacks in future. That is a discussion that needs to be held between India and Pakistan.\n\nYou spoke in Parliament on how secularism is the most misunderstood word in India. It seems your government wants to make fundamental changes in things that had been settled for the past many decades.\n\nI just wanted to say that those who actually do communal politics in this country term themselves secular. That is why I said that secularism was the most misused word in India. In this country, the word secularism is defined in the Constitution not as “dharma nirpeksh but as panth nirpeksh.” It is not necessary that everything that is there in Hindi should be translated in a literal sense into English. This has in fact led to many things being interpreted differently from the way it has been intended. Like the phrase “Dharmachakra pravartanaya” that is etched above the Lok Sabha Speaker’s chair, shouldn’t that be removed from there. “Dharma ke 10 paddhtiyan hain, usey hum Dharma kehtey hain, it is not connected to pooja padhhati (there are 10 traditions of defining and carrying out Dharma, it has nothing to do with ritual or religion). Dharma is the righteous way of living, not necessarily religion. I was speaking of the difficulty of exactly translating our philosophy into English phrases, and words.\n\nIndia is a pluralistic society and your party’s government by various measures of dietary restrictions, etc. is seen as imposing majoritarianism.\n\nThat is not true and with time, this perception among certain people, will go away. We would not have been voted in with this mandate if this had been true. I believe, people of all communities are nationalist. Individuals can get involved in anti-national activities but as individuals and not as members of a community. That is because there is a commitment of the people of this country to certain values.\n\nFor example, compared to other countries from where thousands are going to fight alongside the ISIS in Syria, in India this number is low because of family values shared by all communities. Families play a very strong role in stopping radicalisation. Thousands of imams in India have registered protests against the ISIS.\n\nThis Indian set of family values is clear even in such things as divorce rates. The world over, people who believe in Islam show higher rates of divorce, compared to Muslims in India. These are the Indian family values that are inherent here.\n\nSpeaking of marriage and divorce, what are your thoughts on the Uniform Civil Code now that there is a Supreme Court observation that should be looked at?\n\nI feel there shouldn’t be any objection to at least a debate on this. India is a pluralistic society and the UCC is an issue where a consensus can be reached between different communities.\n\n(For full interview, visit: thne.ws/1mw0j53 )\n\nSecurity forces and intelligence agencies have to be commended for having worked fast", 
    "section": "national", 
    "title": "There will be zero tolerance on terror, says Rajnath Singh", 
    "subsection": "general", 
    "date": "2016-01-03"
}