{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Hindutva groups and BJP threaten State-wide agitation\n\nThe Uttar Pradesh police on Saturday booked Swami Yashvir, who allegedly made controversial statements against Islam at a “Mahapanchayat” in Shamli last week, under the stringent National Security Act (NSA).\n\nThe mahapanchayat was held by Hindutva groups against the love affair of a Hindu girl and Muslim boy who had eloped together to Delhi. In a setback to the rightwing outfits, the girl, after she was traced by the police, told the magistrate on Friday that she was an adult and wanted to stay with the Muslim man.\n\nYashvir’s arrest under the NSA has led to strong reaction from Hindutva groups and the local unit of the BJP which had warned the administration against such a move. A delegation of BJP leaders in the neighbouring district of Muzaffarnagar met Senior Superintendent of Police K.B. Singh on Friday and told him that it would launch a State-wide agitation if Yashvir was booked under the NSA.\n\nVijay Bhushan, Superintendent of Police, Shamli, told the media that Yashvir, who owns a yoga ashram in Muzaffarnagar, had been slapped with the NSA because he was accused of making provocative statements in the mahapanchayat which led to tension in the area.\n\nSenior police officials were of the view that things can flare up quickly in areas like Shamli and Muzaffarnagar which saw one of the worst communal riots.\n\n“Yashvir’s comments led to tension and anger in the area. We cannot afford to allow people to make provocative and objectionable statements. Those who seek to take the law into their own hands will have to face legal action,” said an official.\n\nBajrang Dal State convener Balraj Doongar accused the U.P. government of resorting to “minority appeasement.”", 
    "section": "national", 
    "title": "U.P. Hindutva leader booked under NSA", 
    "subsection": "general", 
    "date": "2016-01-03"
}