{
    "author": [], 
    "text": "In the complicated web of Assamese politics there is no figure more enigmatic than All India United Democratic Front (AIUDF) chief Badruddin Ajmal. The perfume baron, who has 18 seats in the Assam Assembly and won three seats in the Lok Sabha polls speaks to Nistula Hebbar on the upcoming polls, and why there is no Mahagathbandhan in Assam.\n\nChief Minister Tarun Gogoi has accused you of being hand in glove with the BJP after your decision to contest 60 seats.\n\nI totally deny this charge of Chief Minister Gogoi and request him to stop spreading this canard, so that after the polls some people may be of use to him.\n\nAre you saying that you are open to a post-poll alliance with the Congress?\n\nI’m not saying that. I’m merely pointing out that the aim of my party is to fight the Bharatiya Janata Party. If I have any kind of understanding with it, I will be politically finished.\n\nAs for contesting these seats, well, in 2011 we fought 78 seats. This time, when we really fancy our chances, and estimate our goal as 40 seats we have announced that we will fight for 60 seats.\n\nWe have left most of the minority community dominated seats in Upper Assam as we don’t want those votes to be divided, as the Congress is in a direct fight with the BJP in those areas, and seats in Dibrugarh, Shibsagar, and Jorhat where there are 20,000 to 40,000 votes. Why is Mr. Gogoi persisting with this line?\n\nIn the aftermath of the Bihar polls, there was talk of a Mahagathbandhan in Assam as well. What happened to that?\n\nYes, there were efforts. I met Bihar Chief Minister Nitish Kumar at least twice on this account, but we found that certain elements in the Congress, Ministers in Mr. Gogoi’s government like Rakib-ul-Hassan and even the Pradesh Congress Committee (PCC) chief Anjan Datta were against the move. Mr. Hassan probably thinks that if the AIUDF is in alliance with the Congress, it will hurt his utility to the party.\n\nYour party is seen by the BJP as the force to combat in terms of Assam’s identity politics. It has blamed AIUDF for infiltration and illegal migration of Bangladeshis.\n\nThis is all nonsense. My party has clearly said that whoever has come into Assam after March 26, 1971 is to be treated as a foreigner. The BJP talks of border fencing. Well, I have advocated a complete sealing of the border. Certain officials of the government of India who thrive on cross-border trade don’t want this to happen.", 
    "section": "national", 
    "title": "AIUDF’s aim is to fight BJP, says Ajmal", 
    "subsection": "general", 
    "date": "2016-02-16"
}