{
    "author": [
        "Mohit M"
    ], 
    "text": "In a Bollywood-esque twist to a week-long drama that has captured the attention of the city, the male leopard caught in a school last week escaped from its metal confines at the Bannerghatta Biological Park (BBP) on Monday.\n\nAround 6 a.m., the feline managed to escape through the treatment cage — either by squeezing between the bars or pulling open the cage that operates on the counter-weight mechanism — at the rescue centre of BBP, where it had been kept under observation since it was captured at Vibgyor School on Sunday.\n\nThe leopard scaled the high walls of the park and walked into the surrounding forest. With more than 100-sq. km. expanse of the Bannerghatta National Park, which adjoins the Satyamangala forest in Tamil Nadu, spotting the big cat has become a veritable needle in a haystack for forest officials.\n\nHowever, more than 50 forest officials searched for the animal in the morning. The priority, they said, was to scour areas that border villages in the area.\n\nWith concerns emerging in and around Whitefield — where rumours have been swirling since Sunday’s incident — forest officials said it is unlikely that the leopard would make its way to the area where it was captured.\n\nAgile animal\n\nWhile the forest department is yet to find out how the leopard escaped, the most plausible theory — as explained to The Hindu by forest officials — exhibits the leopard’s immense agility. In the main enclosure, the gate to a smaller treatment cage is controlled by a counter-weight. The leopard has managed to scale the gate, reach out to the rope, and pull down the counter-weight. This opens the trap door, if only slightly, and the leopard made its way to the treatment cage.\n\nThe cage is surrounded on three sides with vertical grills, and the roof has a metal mesh designed in six-inch squares. The feline has managed to squeeze through and then spring out into the ‘kraal enclosure’. From here, the tall trees must have allowed the agile leopard to hop over the 20-feet barbed wire and electrified fence into the open.", 
    "section": "national", 
    "title": "Captured leopard escapes from cage in Bannerghatta", 
    "subsection": "general", 
    "date": "2016-02-16"
}