{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Even as the Aam Aadmi Party (AAP) in Punjab plans to sort out differences with its rebel MPs, who were suspended from the party around six months ago for speaking against the party leadership, the rebels seems to stick to their stand saying there has been no apparent change in the ‘situation’ and chances of reconciliation are weak.\n\nAAP’s suspended MP Dharamvir Gandhi from Patiala on Monday said: “Nothing has changed since I was suspended, they [AAP] are approaching us in the light of Punjab Assembly polls that are drawing near. Foundation of getting me back is very weak.”\n\nMr. Gandhi’s reaction came after the AAP’s Punjab convener Sucha Singh Chhotepur said the party would approach the rebel leaders, including Dharamvir Gandhi and Harinder Singh Khalsa (MP from Fatehgarh Sahib), to sort out the differences.\n\n“We intend to meet them and if they assure of working on party lines and in party interest, we are good to work together again on the same platform,” said Mr. Chhotepur.\n\nThe AAP had suspended party MPs Dharamavir Gandhi and Harinder Singh Khalsa from primary membership of the party and initiated disciplinary proceedings against them. This action was taken against both these MPs for speaking against the party leadership.\n\nAsserting that AAP still has a chance to capture political space in Punjab and a fair chance of winning the upcoming Assembly elections, Mr. Gandhi said: “if AAP plays its cards well it still has a chance.... but if people of dubious character from other parties are welcomed, it leads to the perception amongst people that there’s no difference between AAP and other political parties... and this is exactly what’s happening.”\n\nMr. Gandhi said core issues such as inner party democracy and financial transparency have to be resolved to move forward. “I’m an AAP MP and would stand by Punjab’s interest, but would support only honest and dedicated party candidates in the 2017 Assembly elections.”\n\nMr. Harinder Singh Khalsa also felt that AAP has become a leader-centric party and was no more people-centric.", 
    "section": "national", 
    "title": "Chance of reconciliation weak, say AAP rebels", 
    "subsection": "general", 
    "date": "2016-02-16"
}