{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "ith the Jawaharlal Nehru University row turning into a national debate, the Congress is figuring out how to sustain its campaign against the BJP government over a series of issues that concern the country’s student community.\n\nSoon after returning from the JNU campus on Saturday evening, party vice-president Rahul Gandhi called an emergency meeting at his residence, where he discussed ways to “tie up” every compelling issue the students are facing in India today and place them in its anti-BJP narrative.\n\nA senior Congress leader privy to the meeting said that Mr. Gandhi was of the opinion that the issues — ranging from the ongoing unrest at JNU to the suicide of the Dalit research scholar Rohith Vemula in Hyderabad University, to the budget cuts affecting a big section of scholars — are sufficient enough to mobilise students nationwide and place them as a deterrent against the zealous cadre of the BJP and the RSS.\n\nSenior party leader Anand Sharma told The Hindu that in the upcoming Parliament session, the party would strongly raise the JNU issue and also “surprise” the BJP with its attack. “We are working out the formulation as to how these issues can be raised in an effective manner,” said Mr. Sharma.\n\n“It’s unfortunate that the communal venom injected by the BJP has breached the walls of our universities but it’s good to see a lot of people coming out against these divisive plots. We (Congress) know that we have a long battle to fight and we will fight it hard.”\n\nShakeel Ahmed, Congress general secretary in-charge for Punjab, said that the party understood the significance of speaking up for the “voiceless” student community.\n\n“We know that the BJP is feeling frustrated because the ABVP lost the student body elections in JNU,” Mr. Ahmed said.\n\n“We would certainly oppose the BJP’s strategy of involving the police to win the future elections.”\n\nSince advocating for the students who are facing sedition charges can backfire, Mr. Ahmed said that Mr. Gandhi was aware about the political risks the JNU row poses.\n\n“He will fight for them from the front,” he said, adding that the high command had briefed all the units to visit colleges and universities and find out if liberal spaces were being taken over by the “forces affiliated to the BJP.”", 
    "section": "national", 
    "title": "Congress seeks to channel student anger in its favour", 
    "subsection": "general", 
    "date": "2016-02-16"
}