{
    "author": [
        "John Markoff"
    ], 
    "text": "When computers speak, how human should they sound?\n\nThis was a question that a team of six IBM linguists, engineers and marketers faced in 2009, when they began designing a function that turned text into speech for Watson, the company’s “Jeopardy!”-playing artificial intelligence program.\n\nEighteen months later, a carefully crafted voice — sounding not quite human but also not quite like HAL 9000 from the movie 2001: A Space Odyssey — expressed Watson’s synthetic character in a highly publicised match in which the program defeated two of the best human “Jeopardy!” players.\n\nThe challenge of creating a computer “personality” is now one that a growing number of software designers are grappling with as computers become portable and users with busy hands and eyes increasingly use voice interaction.\n\nMachines are listening, understanding and speaking, and not just computers and smartphones. Voices have been added to a wide range of everyday objects like cars and toys, as well as household information “appliances.” A new design science is emerging in the pursuit of building what are called “conversational agents,” software programs that understand natural language and speech and can respond to human voice commands.\n\nHowever, the creation of such systems, led by researchers in a field known as human-computer interaction design, is still as much an art as it is a science.\n\nIt is not yet possible to create a computerized voice that is indistinguishable from a human one for anything longer than short phrases that might be used for weather forecasts or communicating driving directions.\n\nMost software designers acknowledge that they are still faced with crossing the “uncanny valley,” in which voices that are almost human-sounding are actually disturbing or jarring. The phrase was coined by the Japanese roboticist Masahiro Mori in 1970. He observed that as graphical animations became more humanlike, there was a point at which they would become creepy and weird before improving to become indistinguishable from videos of humans.\n\nThe same is true for speech. — New York Times News Service", 
    "section": "national", 
    "title": "Creating a computer voice that people like", 
    "subsection": "general", 
    "date": "2016-02-16"
}