{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Justice C.S. Karnan of the Madras High Court, who ‘stayed’ the Chief Justice of India’s proposal to transfer him to Kolkata, sent copies of his letter to the President, the Prime Minister, Union Law Minister, Minister for Consumer Affairs Ramvilas Paswan, former U.P. chief minister Mayawati, National Commission for Scheduled Castes and Scheduled Tribes Chairperson and Congress party president Sonia Gandhi.\n\nIn the letter, he acknowledges receipt of the transfer proposal on February 12, but says he is unable to comprehend why the CJI wants him transferred. He proceeds to ask the CJI to file, through his subordinates, a “written statement” by April 29, 2016 to explain himself.\n\nThe High Court judge then stayed any move to transfer him to Kolkata, asking the CJI not to “interfere in my jurisdiction, as I am in the process of finalising an order on merits.”\n\nHe even suggests to Chief Justice Thakur to look up the Second Judges case law of 1993 delivered by a nine-judge Constitution Bench. The 1993 case law had said that judges should be transferred “only in ‘public interest’ i.e. for promoting better administration of justice throughout the country.”\n\nActing on the urgent plea by the Madras High Court Registrar-General to restrain Justice Karnan from passing any suo motu orders, the apex court Bench of Justices J.S. Khehar and R. Banumathi stayed all administrative or judicial orders passed by Justice Karnan post February 12 – the date of his transfer recommendation.\n\nThe Supreme Court then left it to Madras High Court Chief Justice Sanjay Kishan Kaul to decide whether or not to assign future work to Justice Karnan.\n\n“It will be open to the Chief Justice of the High Court not to assign any further administrative/judicial work to him.” This would imply, that no other orders shall be passed by Mr. Justice C.S. Karnan, suo motu or otherwise, in any matter not specially assigned to him.\n\nJustice Khehar, who is a member of the Supreme Court Collegium which met on February 11 to decide on large-scale transfers of High Court judges including Justice Karnan’s, said it is left to the High Court judge to state his case against the transfer before the apex court, if he wants to.\n\n“It shall be open to the Hon’ble Judge [Justice Karnan] to enter appearance before this Court, in case he is so advised [in respect of the instant/pending matter],” Justice Khehar dictated the order for the Bench.\n\nOn February 12, the Madras High Court registry authorities had made an urgent plea to the Supreme Court to intervene following an earlier letter shot off by Justice Karnan, accusing Chief Justice Kaul of caste discrimination.\n\nJustice Khehar, however, said this issue would be taken up in due course as it is not “immediate.”\n\nIn Chennai, Justice Karnan made serious allegations against the Chief Justice and other judges.\n\n“I am in no way subordinate to the Supreme Court. Mine is a separate constitutional office. How can the apex court interfere in my office that too without even hearing my version?” he asked.\n\nClaiming that he has been targeted only because he is a Dalit, Justice Karnan said, “Let the two judges come to Parliament. The issue can be decided there. It is the competent authority.”\n\nJustice Karnan cites 1993 verdict that judges should be transferred only\n\nin public interest", 
    "section": "national", 
    "title": "Don’t interfere in my jurisdiction, judge tells CJI", 
    "subsection": "general", 
    "date": "2016-02-16"
}