{
    "author": [], 
    "text": "A team at the University of Utah led by an Indian-origin engineer has discovered a new kind of 2D semi-conducting material for electronics that opens the door for much speedier computers and smartphones that consume a lot less power.\n\nThe semi-conductor, made of tin and oxygen or tin monoxide (SnO), Professor Ashutosh Tiwari and his team discovered is a layer of 2D material only one atom thick, allowing electrical charges to move through it much faster than conventional 3D materials such as silicon.\n\nThis material could be used in transistors, the lifeblood of all electronic devices such as computer processors and graphics processors in desktop computers and mobile devices.\n\nTransistors and other components used in electronic devices are currently made of 3D materials such as silicon and consist of multiple layers on a glass substrate.\n\nBut the downside to 3D materials is that electrons bounce around inside the layers in all directions. “The benefit of 2D materials is that the material is made of one layer the thickness of just one or two atoms. Consequently, the electrons can only move in one layer so it’s much faster.”\n\nTransistors made with Prof. Tiwari’s semi-conducting material could lead to computers and smartphones that are over 100 times faster than regular devices.\n\n“Because the electrons move through one layer instead of bouncing around in a 3D material, there will be less friction, meaning the processors will not get as hot as normal computer chips,” the authors noted. They will also require much less power to run, a boon for mobile electronics that have to run on battery power. According to Prof. Tiwari, this could be especially important for medical devices such as electronic implants that will run longer on a single battery charge. — IANS\n\nAshutosh Tiwari and his team have found a new 2D semi-conducting material", 
    "section": "national", 
    "title": "Indian-origin engineer’s discovery may help speed up gadgets", 
    "subsection": "general", 
    "date": "2016-02-16"
}