{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India is likely to highlight the “best practices” in the international nuclear industry and its national nuclear safety record in the Nuclear Security Summit (NSS) slated to be held from March 31-April 1 this year.\n\nOn Monday, a team, including Amandeep Gill, Joint Secretary of Disarmament division of MEA, flew into Swedish capital Stockholm for the last round of pre-summit discussions.\n\nThe summit is seen as important as this is the last time U.S. President Barack Obama will host the participating countries and the first time Prime Minister Narendra Modi will take part. The Hindu had earlier reported that the summit may also form the backdrop for a meeting between Mr. Modi and his Pakistani counterpart Nawaz Sharif that may thaw the freeze that crept into the India-Pakistan ties following the Pathankot terror attacks.\n\nCritical campaign\n\nIndia has been a part of the summit since it convened for the first time in 2010, but came into focus recently due to a critical campaign by the Centre for Public Integrity, a Washington DC-based non-governmental organisation.\n\nA series of recent articles written by journalist Adrian Levy for the NGO questioned India’s capability to secure nuclear material and safeguard workers engaged in the Indian nuclear industry.\n\nRejecting the charges, officials said they suspected that the reports were timed to put a spotlight on India just ahead of the summit and might be backed by the powerful western non-proliferation lobby. India will highlight its safety and non-proliferation records in the summit.\n\n“India’s attendance at the Nuclear Security Summits is based on the understanding that we have common concerns with other advanced nuclear-capable countries and for that we have to share the ‘best practices’ available to ensure complete security and safety in the nuclear industry. India is expected to follow the same principle in NSS 2016 as well,” said Shyam Saran, Chairman, RIS, a think-tank under the Ministry of External Affairs. Nuclear scientists said the summit provided another opportunity for India to stay ahead in the field of security and safety in the nuclear industry.\n\n“After the terror strike at Pathankot, we have to think in terms of creating specialist forces for various strategic addresses and also for the nuclear installations,” said Brig (Retired) Gurmeet Kanwal.\n\nNarendra Modi\n\nand Nawaz Sharif\n\nmay meet on the sidelines of the Stockholm summit", 
    "section": "national", 
    "title": "India to highlight nuclear best practices", 
    "subsection": "general", 
    "date": "2016-02-16"
}