{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Magisterialprobe ordered; Governor seeks report from police\n\nTENSE SITUATION:Tyres set on fire by protesters in Srinagar on Monday.— PHOTO: AFP\n\nThe situation remained tense in the Kashmir Valley on Monday even as a magisterial probe was ordered into the killing of two civilians near an encounter site in south Kashmir’s Pulwama district on Sunday.\n\nGovernor N.N. Vohra directed Pulwama Additional Deputy Commissioner Shahbaz Ahmad Mirza to complete the inquiry in a time-bound manner. Mr. Vohra also sought a detailed report from the Director-General of Police after a public outcry and violent protests.\n\nOn Sunday, two students, Danish Farooq Mir (19) and Shaista Hameed (22), were killed in Pulwama, more than 30 km from Srinagar. A local militant was also killed, while two fled. More than a dozen civilians sustained bullet wounds in security forces’ action later.\n\nUnder house arrest\n\nCurfew-like restrictions were imposed in parts of Srinagar and Pulwama on Monday to curb protests. All main roads were blocked to prevent movement of traffic and people. Several separatists, including Mirwaiz Umar Farooq and Yasin Malik, were placed under house arrest.\n\nDefying the restrictions, protesters clashed with security forces in Kakapora area and pelted stones. Three more demonstrators were injured, one of them critically, in fresh clashes.\n\nMeanwhile, life was disrupted in the entire Valley in response to the separatists’ shutdown call against the killings.\n\nHurriyat faction chairman Syed Ali Geelani said: “The situation is becoming intolerable day by day.”\n\nMirwaiz Umar Farooq alleged that “the third generation of Kashmiris was now being deliberately targeted.”\n\nNational Conference (NC) general secretary Ali Muhammad Sagar accused the security personnel of “using disproportionate and wanton lethal force on unarmed civilians.” Peoples Democratic Party president Mehbooba Mufti said: “The incident is unfortunate and uncalled for. It could have been avoided.”\n\nThree injured after protesters clash with security forces", 
    "section": "national", 
    "title": "J&K on the boil after killing of civilians", 
    "subsection": "general", 
    "date": "2016-02-16"
}