{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "The judge made headlines when he complained to the National Commission for Scheduled Castes that hewas being victimisedbecause he was a Dalit.\n\nJustice C.S. Karnan of the Madras High Court has been in the news ever since he was appointed judge on March 30, 2009. He has often gone public with his complaints about the judiciary.\n\nHe first hit the national headlines in November 2011 when his complaint to the National Commission for Scheduled Castes (NCSC), alleging that he was being harassed and victimised by brother judges because he was a Dalit, became public.\n\nIn his complaint, he alleged that there was an attempt to reduce his role to one of subjugation. Justice Karnan even charged that at a marriage function, a brother judge “crossed his leg deliberately touching mine.”\n\nNCSC Chairman P.L. Punia forwarded the complaint to then Chief Justice of India Justice S.H. Kapadia as the latter was “the ultimate authority in the judiciary.”\n\nUnprecedented act\n\nTwo years later, in January 2014, in an unprecedented act, Justice Karnan entered a court hall where a Division Bench was hearing a public interest litigation petition relating to names recommended for the post of judges and declared that the “selection [of names] is not fair” and that he would file an affidavit on the issue.\n\nThe Supreme Court in March 2014 condemned Justice Karnan’s behaviour observing: “The sudden unfamiliar incident made us fume inwardly on this raw unconventional protest that was unexpected, uncharitable and ungenerous and, to say the least, it was indecorous.”\n\nIn fact the then Madras High Court Chief Justice R.K. Agarwal wrote to the then Chief Justice of India P. Sathasivam urging him to transfer Justice Karnan to some other court.\n\nJustice Agarwal alleged that when a lawyers’ boycott was under way, “Justice Karnan barged into my chambers hurling a volley of invectives … seeking a change in portfolio … In fact, some of my brother judges are afraid of him. The conduct of Justice Karnan, as the present incident shows, is not only unbecoming of a judge but also tends to undermine the dignity of the Chief Justice and brings a bad name to the institution.”\n\nJustice Karnan countered this by complaining to the NCSC about Chief Justice Agarwal accusing him of displaying “a form of discrimination without any reason.” Sensing that he could be transferred, he also wrote to the Chief Justice of India and Justice Agarwal saying “I should not be transferred till I establish the veracity of my allegations [against the judges].”\n\nIn mid-2015, he accused a sitting judge of the High Court of sexually assaulting an intern in his chambers, a charge he repeated on Monday.\n\nLikewise, he suo motu stayed an administrative order of then Madras High Court Chief Justice S.K. Kaul regarding selection of civil judges and said he would direct the NCSC to initiate proceedings against him under the SC/ST (Prevention of Atrocities) Act. Finally the apex court intervened and stayed his interim order for undermining the authority of the Chief Justice.\n\nJustice Karnan had also dubbed “autocratic” the collegium system of selecting judges.\n\nIn November 2015, he went on long leave, dissatisfied over the allocation of “insignificant or dummy” portfolios to him. The proverbial last straw for him came this month when the Madras High Court Registry sought the Supreme Court’s intervention after Justice Karnan accused the sitting Chief Justice of caste discrimination.", 
    "section": "national", 
    "title": "Justice Karnan’s judicial journey", 
    "subsection": "general", 
    "date": "2016-02-16"
}