{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Monday said Parliament or the “people's court” should be the final judge to decide the legality of passive euthanasia and “Living Will”.\n\nThe Centre agreed with the apex court and illustrated the complexity of medically taking a person's life by pointing at how Formula One legend Michael Schumacher is “being kept alive for years in the hope he will wake up from his coma one day”.\n\nA Constitution Bench, led by Justice Anil R. Dave, said it will wait till July 20 with the “unwritten hope” that the government or Parliament will finalise a law on passive euthanasia, the act of withdrawing medical treatment with the deliberate intention of causing the death of a terminally-ill patient.\n\n“Ultimately it is whether you want a verdict from this court or a ‘people’s court's’ verdict. Such issues are better decided by the people's court,” Justice Kurian Joseph, one of the five-judges on the Bench, observed.\n\nOn legalising the ‘Living Will’ — an advance directive to physicians for end-of-life medical care — the Bench asked whether the concept was fundamentally against a person's instinctive urge to live.\n\nIt asked whether such a person should be given every minute chance to recover without alien intervention.\n\n“Yes. Look at Michael Schumacher. He is being kept alive in the hope that he will come back one day,” Additional Solicitor-General P.S. Patwalia agreed with the court.\n\n“I know a dying widower who saw his sons have returned from the United States and started rejuvenating on his death bed. But the sons asked the doctor ‘how long’ for their father as they had to get back,” Justice Kurian said.\n\nJustice Rohinton Nariman asked whether a 90-year-old patient would still be bound by a ‘Living Will’ he made at the age of 18.\n\n“A Living Will is valid if a person prepares it in his right mind when he is already a terminally ill patient and knows he has six months more to live. Such a Will is not stale. But a 90-year-old man is not bound to a Will he made when he was 18... So the narrow question is the level staleness,” Justice Nariman observed.\n\n‘Schumacher is being kept alive\n\nin the hope that\n\nhe will come\n\nback one day’", 
    "section": "national", 
    "title": "Let ‘people’s court’ decide on euthanasia: SC", 
    "subsection": "general", 
    "date": "2016-02-16"
}