{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Delhi police chief B.S. Bassi says probe is on into the “blasphemous” tweet posted from an account ofHafiz Saeed.\n\nThe Ministry of Home Affairs (MHA) on Monday said there were at least 12-18 more persons, who could be students of JNU, and who were under the scanner for participating in an event held on the campus on February 9 to condemn Afzal Guru’s hanging.\n\nA senior Home Ministry official said he was not certain about the “political affiliation” of those under watch, but said that the Delhi police had informed the Ministry that it had enough evidence against Jawaharlal Nehru University Students’ Union president Kanhaiya Kumar, who was arrested on February 12 on the charge of sedition.\n\nDelhi Police Commissioner B.S. Bassi on Monday briefed Home Minister Rajnath Singh on the JNU row. After the meeting, Mr. Bassi said that the police had so far found “no evidence that Lashkar-e-Taiba (LeT) was linked” to the event, but said they were inquiring about the “blasphemous” tweet posted from a fake Twitter account of Hafiz Saeed, the chief of Jamaat-ud-Dawah (JuD), the philanthropy arm of LeT.\n\nHafiz Saeed denies role\n\nIn a video message posted on Monday, Saeed denied that he was behind the protests at the JNU. “Neither I am behind the students’ protest nor did I post any tweet to incite them (students). It is a fake tweet. India has made an issue out of this as if I am behind this protest campaign,” said Saeed in the video message.\n\nMoS (Home) Kiren Rijiju defended Mr. Singh, saying there were enough indications that Hafiz Saeed was backing the event at the JNU. “Intelligence inputs indicated that Hafiz Saeed and some related organisations were backing the JNU incident. That is what the Home Minister had said.\n\n“Intelligence inputs can’t be shared or analysed in public. Political parties supporting the anti-nationals should learn what is patriotism”, Mr. Rijiju said.\n\nHe said there was a support group for a convicted terrorist. “The event was organised where people spoke about breaking India into pieces. And then they are getting support from political parties.”", 
    "section": "national", 
    "title": "More persons under scanner", 
    "subsection": "general", 
    "date": "2016-02-16"
}