{
    "author": [
        "Special Correspondent"
    ], 
    "text": "But they have blamed the organiser, Wizcraft, for lapses and gaps\n\nIt was touted as an ‘event of national importance’, but officials chose to ignore the many red flags that an inspection team raised ahead of the Maharashtra Night event at Chowpatty on Sunday.\n\nOfficial documents show that the Mumbai Fire Brigade’s 59-point no-objection certificate for the temporary stage erected for Maharashtra Night was only partly complied with. The NOC for the 81,600 sq ft stage was given for an audience strength of 5,000 or more on February 11, but an inspection by the fire team on February 13 found as many as a dozen gaps in safety measures. The 26-point disaster plan of the Brihanmumbai Municipal Corporation (BMC) was not fully in place, they found.\n\nHowever, 24 hours after the fire gutted the temporary structure, the authorities put all the blame on the organiser, Wizcraft, which they said was responsible for fire safety measures. “It is the responsibility of the organisers to fulfil these requirements and maintain the same during the entire period of the programme,” the NOC states.\n\nA senior BMC official said: “The disaster plan process is considered complete when the corporation receives a fully complied report from the fire brigade and the organisers, but we never got a copy back.”\n\nAccording to officials, part of the inspection team that had visited the event site hours before it started, as many as 10 vital compliances were found to have been violated, including storage of combustible material in the green rooms, storage of fire crackers under the stage, use of cylinders and a fire demo unit in front of the stage.\n\nThe electric wiring was found to be not up to the mark, entry and exit points were inadequate and, most important, the fire extinguisher on the site was past its expiry date. “When I saw the fire, I tried dousing it with an extinguisher but at least two of them were not working. I had to rush on the stage to grab another,” chief fire officer P Rahangdale told The Hindu .\n\nThe NOC given to the organisers had clearly given guidelines on the use of fire and crackers at a distance from the stage, which were not followed. It had found that crackers were still lying under the table as on February 13 evening.\n\nWhether it was eventually moved or not could not be ascertained because there wasn’t enough time to do so, officials said.\n\n“This was clearly a hurriedly put together event where the organisers and officials both did not get enough time to check and complete compliances. Lack of time prevented us from checking if the NOC or the disaster plan was complied with,” said a senior official of the fire brigade.", 
    "section": "national", 
    "title": "Mumbai fire: officials ignored inspection team’s caution", 
    "subsection": "general", 
    "date": "2016-02-16"
}