{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Chandigarh comes second as Dhanbad lags at 73rd slot; southern, western cities fare better\n\nMysuru was found to be impressive in solid waste management and ‘minimal’ open defecation.— Photo: M.A. Sriram\n\nMysuru city in Karnataka retained the top position in Swachh Bharat Rankings for 2015 that were released on Monday by the Ministry of Urban Development.\n\nCompared to the 2014 rankings, Chandigarh has replaced Tiruchirapalli of Tamil Nadu in the second rank while Dhanbad of Jharkhand is reeling at the 73rd slot, the lowest rank.\n\n“Cities from south and west continue to do well overall,” said Urban Development Minister Venkaiah Naidu at the release ceremony of the rankings. “But those in other parts of the country, particularly in the north, are beginning to catch up with the traditional leaders.”\n\nMr. Naidu said that the survey was “more participatory and evidence based” as all the featured cities were informed two months in advance about the methodology.\n\n“We asked them to put in place records of their efforts in support of infrastructure creation, deployment of men and machines, improvements made, expenditure, etc,” he said.\n\nCompared to the previous rankings, NDMC of New Delhi has moved upward from rank 7 to 4, south MCD from 47 to 39 and North MCD from 47 to 43. Each MCD, however, has gone downhill from 47 rank in 2014 to 52 in 2015.\n\nIn a year-long survey, the researchers studied 476 first-tier cities with two parameters: one, how ‘minimal’ open defecation was in the city; two, how robust the municipalities were with the solid waste management system. Mysuru was found impressive on both the counts.\n\nLaunched in October 2014 by Prime Minister Narendra Modi, the Swachh Bharat Mission is the flagship sanitation programme of the National Democratic Alliance government, which aims to bridge the gap between sewerage and solid waste management and construct several million toilets in the urban centres.\n\nWith a Central funding of Rs.14,623 crore, the government aims to build 1.4 crore household toilets, 2.5 lakh community toilets and 2.6 lakh public toilets by 2019.\n\nThe purpose of the rankings, Mr. Venkaiah said, is to encourage cities to fix their sanitation and sewerage infrastructure by showing them the performance of other cities.\n\n“Competition makes one strive better,” Mr. Venkaiah added.", 
    "section": "national", 
    "title": "Mysuru retains cleanest city tag", 
    "subsection": "general", 
    "date": "2016-02-16"
}