{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Apex court dismisses appeal against Delhi High Court order\n\nFifteen years after its verdict that the confidence of litigants would be shaken if judgments were kept pending for years, the Supreme Court on Monday dismissed a plea to maintain the data on its pending judgments and make the information public under the Right to Information (RTI) Act.\n\nThe court’s refusal to be made accountable under the RTI Act is despite the decision of the Central Information Commission (CIC) to disclose the number of pending or “reserved” judgments. The Commission’s decision was upheld by a single judge of the Delhi High Court in a case in which the Supreme Court itself was an opposing party.\n\nHowever, the single judge’s order was set aside by a Division Bench on January 7, 2016 following an appeal by the Registrar representing the Supreme Court.\n\nA Bench of Justices P.C. Ghose and Amitava Roy decided to dismiss RTI applicant Lokesh Batra’s appeal against the Division Bench’s judgment .\n\n“With utmost respect, I will say that if this petition is dismissed, it will undermine the confidence of the people in the Supreme Court. People would say that the Supreme Court makes grand statements about transparency and RTI but when it comes to itself, it is reluctant to disclose even the most basic information,” said Prashant Bhushan, representing Mr. Batra.\n\nThe CIC had directed the Supreme Court to maintain its record in such a manner that RTI applicants could be informed of the number of its “reserved judgments”. “We are of the view that the total number of such cases in which orders are reserved should be duly intimated to the public. Now that the benefit of computerisation is available, placing such data in the public domain should not be particularly difficult,” the CIC had said.\n\nThe CIC’s decision was based on the SC’s 2001 judgment in Anil Rai vs. State of Bihar. The ruling had also pointed out that “the confidence of the litigants in the results of the litigation is shaken if there is an unreasonable delay in rendering a judgment after reserving the same”.", 
    "section": "national", 
    "title": "SC refuses to disclose data on pending verdicts", 
    "subsection": "general", 
    "date": "2016-02-16"
}