{
    "author": [
        "Devesh K"
    ], 
    "text": "Khan was tasked with recruiting unemployed youths on pretext of jobs in Saudi Arabia\n\nThe network that actively worked on expanding the Al-Qaeda in Indian Subcontinent (AQIS) was not simply limited to the Deepa Sarai neighbourhood from where six men allegedly came together to form the outfit. Its reach was far and wide, according to alleged revelations by Mohammad Abdul Rehman Ali Khan. He is now in judicial custody.\n\nKhan came under surveillance after a phone call to him by Deepa Sarai resident and alleged AQIS-India chief Mohammad Asif was intercepted by Indian agencies in August-September 2015. Official records quote him as saying that Asif met him in Bengaluru and told him about the new outfit.\n\nPolice say Asif’s visit to Bengaluru was for roping in Khan and one Maulana Anzar Shah who were already engaged in making recruitments for the Al-Qaeda and the Lashkar-e-Taiba.\n\nDuring interrogation, Khan purportedly disclosed that he visited Pakistan via Saudi Arabia about a year ago and underwent weapons training in Muzaffarabad at the instance of Lashkar veteran Sajid Mir, who has been named by David Headley in his recent deposition before a Mumbai court in the 2008 Mumbai terror attacks case.\n\nKhan also met top Lashkar leader Zaki-ur Rehman Lakhvi in a Rawalpindi jail and its founder Hafiz Saeed in Lahore. By last December when he was arrested in Odisha, Khan had initiated at least five men to join the Al-Qaeda, police allege.\n\nRadicalised in the wake of the 1992 Babri Masjid demolition, Khan’s inclination towards extremism was nurtured further by Jaish-e-Mohammed founder Masood Azhar’s provocative speeches that were in wide circulation in the 1990s. He was then a scholar pursuing higher studies in Deoband’s Darul Uloom, say police records.\n\nIn November-December 1999, Khan met one Saleem, reportedly a veteran of Afghan jehad against the Soviets, who told him that he was part of the conspiracy hatched to free Masood Azhar, then lodged in a Jammu jail. He revealed that about 10 well-trained boys had already flown into Kathmandu, and that Saleem had been told to be in Delhi.\n\nSaleem disappeared after a couple of meetings. Khan returned to his home in Bahugram village of Cuttack. Meanwhile, the IC-814 flight was hijacked and Masood Azhar freed in exchange for the passengers.\n\nSix months later, Saleem again met Khan and told him that he had fled to Pakistan after the IC-814 hijacking. In 2000, Khan arranged for Saleem a safe house in Cuttack. The same year, he introduced Khan to two Pakistani associates of Masood Azhar.\n\nKhan later came to know through newspaper reports that Saleem and the Pakistani terrorists had been killed in an encounter with the Uttar Pradesh’s Special Task Force in Lucknow on April 18, 2001. When his name cropped up in the probe, prompting the U.P. police to enquire about him in Deoband, he went underground.\n\nA double doctorate in Arabic and Hadith and proficient in six languages, Khan was on the run. He kept shifting base: from Kendrapara and Cuttack in Odisha to Jamshedpur in Jharkhand and Bengaluru. The police went after his brother Tahir Ali Khan, who was arrested, then released on bail, again arrested in the 2002 Kolkata’s American Center attack case, and then acquitted.\n\nIn 2007, Khan returned home to attend to his old mother and took up a teaching job. He also started a madrasa. He disclosed that during a visit to Bengaluru in 2009, he came in contact with Dr. Sabeel Ahmed, a cousin of the 2007 Glasgow international airport attack mastermind Kafeel Ahmed.\n\nIn 2010-11, the doctor moved to Saudi Arabia and Khan followed suit in October 2012. He was received by Arshiyaan, a friend, at whose house he again met Dr. Ahmed. They told him that they worked for the Al-Qaeda and the LeT and that they wanted him to recruit unemployed Indian youths on the pretext of getting them jobs in Saudi Arabia, according to police records.", 
    "section": "national", 
    "title": "Terror network has wide reach", 
    "subsection": "general", 
    "date": "2016-02-16"
}