{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Two movies, both love stories, but of a different kind, make a lasting impression in Berlinale 2016\n\nSometimes, the synopsis in the festival brochure doesn’t tell you the real story.\n\nTake the Israeli documentary Who’s Gonna Love Me Now? , directed by the brothers Barak and Tomer Heymann. (The title refers to the first question that comes up when a gay man is diagnosed as HIV-positive.) This is the official synopsis: “Singing in the London Gay Men’s Chorus gives Saar the courage for reunion with his estranged family in Israel.” For a while, it does seem to be Saar’s story. We feel for him when he says he wishes his family had stood up for him when he was sent away from the kibbutz. (“They did not say we will leave too.”). He had to go to London to find another family in the Gay Men’s Chorus. And what a rainbow family it is. One of them wears a kurta-pyjama. One of them wears a kilt. Saar, of course, is seen with the yarmulke.\n\nBut the film is more than that — and it doesn’t take sides. It’s a deeply felt cross-generational tale of a large clan trying to come to terms with the fact that one of them is leading a life that, according to the Torah, is punishable by death. We understand (even if we do not empathise with) the sister who fears that her children might get infected, the father who wonders why Saar cannot marry a woman and still be gay, and especially the mother who says, sorrowfully, “It’s awful to feel a leper is coming, and this is my son and these are my grandchildren.”\n\nAt the end, this isn’t a gay story. It’s a family story.\n\nRifles and roses\n\nA different kind of love is manifest in Ivo M. Ferreira’s Portuguese drama Cartas da Guerra (Letters from War), which narrates, in epistolary form, the experiences of Antonio Lobo Antunes (Miguel Nunes), a young doctor in the military. Antonio had to leave his pregnant wife when he was posted in Angola during the Portuguese Colonial War in the early 1970s. The details are unimportant. It could be Vietnam. It could be Afghanistan. What’s important is that Antonio is a writer (he’d go on to become a famous novelist), the quintessential Byronian brooder, and the screenplay, with strong echoes of Miguel Gomes’s Tabu , is adapted from the letters he wrote.\n\nI couldn’t get enough of the film, which has everything I love: the shadows of black-and-white cinematography, the intoxicating sweetness of ripe language (it would be fascinating to compare Antonio’s novels with those of Márquez), and the unshakeable conviction that, when in love, when in longing, there is no such thing as over-the-top.\n\nIt’s almost impossible to get the film at one viewing, simply because you keep wanting to re-read the subtitles. This is another kind of war — the beauty of words versus the beauty of images. Over visuals of barbed wire, a soldier who dies from a bullet in his back, over sounds of exploding landmines and screams of men being operated on without morphine, over images of exotic celebrations by the locals, we participate in the writer’s yearning. I remember our farewell as something that took place under a general anaesthetic... Find a big bed so we can die on it together, bodies glued to each other.\n\nBut war has a way of splashing ice-cold water on the most fevered romanticism, and slowly, Antonio’s tone changes. I’m beginning to understand what made Che Guevara tick: there’s something genuinely exciting about this, really, and even the hard, cold touch of the rifle feels nice... In the most astonishing passage, which would have been shot through intense purple filters had this film been in colour, Antonio tosses about at night, dreaming of his wife: I adore you, my January cat, my black, my white, my glass of water, my mirrored castle room, my bird on the highest evening branch, my departing ship, my sand between my fingers... Cut to the next morning: He’s seeing off a patient. “Here’s medication for a week, and then you should be okay.” Ice-cold water.\n\nWar isn’t always what happens between nations, races, peoples. It’s also what happens in the mind. Cartas da Guerra is the most poetic examination of the mind-altering effects of war since Apocalypse Now .", 
    "section": "national", 
    "title": "Touching tales from Berlin", 
    "subsection": "general", 
    "date": "2016-02-16"
}