{
    "author": [], 
    "text": "Scientists at CERN accomplish this by colliding lead atoms in the Large Hadron Collider\n\nScientists have recreated the universe’s ‘primordial soup’ in miniature format by colliding lead atoms with extremely high energy in the world’s most powerful particle accelerator, the Large Hadron Collider (LHC) at CERN.\n\nThe primordial soup is a so-called quark-gluon plasma and researchers from the Niels Bohr Institute in Denmark, among others, have measured its liquid properties with great accuracy at the LHC’s top energy.\n\nA few billionths of a second after the Big Bang, the universe was made up of a kind of extremely hot and dense primordial soup of the most fundamental particles, especially quarks and gluons. This state is called quark-gluon plasma. By colliding lead nuclei at a record-high energy of 5.02 TeV in LHC, the 27 km-long LHC at CERN in Geneva, it has been possible to recreate this state in the ALICE experiment’s detector and measure its properties.\n\n“The analyses of the collisions make it possible, for the first time, to measure the precise characteristics of quark-gluon plasma at the highest energy ever and to determine how it flows,” said You Zhou, who is a post-doc in the ALICE research group at the Niels Bohr Institute.\n\nThe focus has been on the quark-gluon plasma’s collective properties, which show that this state of matter behaves more like a liquid than a gas, even at the very highest energy densities.\n\nThe new measurements make it possible to determine the viscosity of this exotic fluid with great precision.\n\nMr. Zhou said the experimental method is very advanced and is based on the fact that when two spherical atomic nuclei are shot at each other and hit each other a bit off centre, quark-gluon plasma is formed with a slightly elongated shape somewhat like an American football.\n\nThis means that the pressure difference between the centre of this extremely hot ‘droplet’ and the surface varies along the different axes. — PTI", 
    "section": "national", 
    "title": "Universe’s ‘primordial soup’ recreated", 
    "subsection": "general", 
    "date": "2016-02-16"
}