{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students of Panchayat Union Middle School, Vadakathipatti, Madhanur at the 3D Science Theatre in Sathuvachari.- Photo: c. venkatachalapathy\n\nTravel back into prehistoric times, get a closer look at dinosaurs and learn the science behind magic at the newly established 3D Science Theatre at the District Science Centre, Sathuvachari.\n\nThe 3D Science Theatre, which was inaugurated by the Chief Minister from Chennai on February 14, has come up at a cost of Rs. 23 lakh.\n\nThe theatre with 60 seats offers the 3D experience of watching films, particularly on science-based topics, for children. It has been set up on the second floor of the science centre, inside the Industrial Gallery.\n\nFilm on prehistoric times\n\n“We are giving polarized 3D glasses to those coming to watch the show in the 3D theatre. Each show will have two films. Currently, we are showing a film on prehistoric times and another one called Master Magic in which the science behind magic is explained, cloning and chemical experiments are shown,” J.R. Pazhaniswami, District Science Officer in-charge, Vellore said.\n\nEach show will be for about 12 to 15 minutes. “We have a collection of films that deal with topics such as astronomy, nano science, space research, medical science and cloning. We will change the films screened once in six months,” he added.\n\nThrough this theatre, certain scientific principles can be explained to students in an easy and enjoyable way. Such 3D theatres have been established in other parts of the State too by the Tamil Nadu Science and Technology Centre.\n\n“It was introduced at Birla Planetarium, Chennai in 2000, followed by the Anna Science Centre-Planetarium, Tiruchi in 2008. Then, a similar theatre was established at the Regional Science Centre, Coimbatore in 2013. Now, it has come up in Vellore” he said.\n\nThere will be eight shows everyday at 10.30 a.m., 11.30 a.m., 12.30 p.m., 1.30 p.m., 2.30 p.m., 3.30 p.m. 4.30 p.m. and 5.15 p.m.\n\nThe entry fee for the 3D science theatre is Rs. 10. The show timings could be altered to enable groups from schools to watch the 3D films, the officer said.\n\nFor further details on the shows, contact the centre at phone number 0416-2253297.", 
    "section": "national", 
    "title": "3D science theatre established at District Science Centre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}