{
    "author": [], 
    "text": "Kasthuri Sreenivasan Trust will organise art exhibition as part of the “Coimbatore Artists Meet 2016”. The inaugural function will be on February 24 at 5 p.m. and the exhibition will be held for five days from February 25 to 29 at Kasthuri Sreenivasan Art Gallery, Avinashi Road at 10 a.m. For details contact 0422-2574110\n\nWinners\n\nVidhya Niketan Public School team emerged victorious in the quiz competition hosted by the Cambridge University Press recently. More than 400 students in 105 teams participated. The winning team Vidhya Niketan Public School was represented by S. Anand, R. Harshavardhan and P. Shriman Visahan. Runner-up trophies were bagged by S.B.O.A MHSS (Ashwath B, Kaarthik R and Logeshwar V.R), and Good Shepherd International School (Rahul Adusumilli, Sriniketh Krishnan and V.P Laksith).\n\nProgramme\n\nFace2Face Foundation, a worship ministry from Bengaluru, will be hosting “Praise Adonai” by Paul Wilbur at the Hindusthan College Grounds on February 20. For entry passes, contact 8098788000/ 8940589000\n\nConclave\n\nThe Coimbatore Productivity Council will be organising annual flagship event “Productivity Conclave 2016” on February 25 at The Residency, Avinashi Road at 10 a.m. The theme for the conclave is “Make in India: Opportunities & challenges”. CEOs, senior/ middle level executives, academicians and students are eligible to attend the event. For details contact 8220000373/ 7373663002. email:cpc@cpccbe.orgcpccbe@airtelmail.in\n\nwebsite:www.cpccbe.org\n\nContest\n\nMoneyGram will be organising a ‘Golden Arm Bowling Challenge’ on February 20 & 21 at Burly Ground, RS Puram. The fastest delivery by any bowler will be adjudged as the winner of the city and will be recorded for the fastest delivery bowled not only within Tamil Nadu, but also 50 other cities. The winner will be rewarded with a cash prize of Rs. 10,000. Top four fastest bowlers will receive tickets for the 2016 ICC World Twenty20 match.", 
    "section": "national", 
    "title": "Art exhibition", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}