{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Holding both the Central and State governments responsible for their plight, sugarcane farmers in the region have questioned the rationale behind the sugar mills refusing to heed to the Government’s State Advised Price (SAP) over the last two years.\n\nAccording to representatives of farmers’ associations, the sugar mills in the state collectively owe Rs. 650 crore as dues on account of not implementing the SAP during the 2014-15 and 2015-16 crushing seasons.\n\nTripartite meetings\n\nThe revenue authorities, who hold tripartite meetings to prevail upon mills to settle dues, are able to ensure payment of the Fair and Remunerative Price fixed by the Central Government, but is helpless when it comes to settlement of SAP.\n\nThe Commission for Agricultural Costs and Prices, Ministry of Agriculture, recommended FRP of Rs. 220 per quintal for the 2014-15 and Rs. 230 per quintal for 2015-16 crushing seasons. The SAP per tonne in Tamil Nadu was Rs. 650 during 2014-15 and was Rs. 550 during the current crushing season.\n\nThere is a provision for the revenue authorities to issue notices and stall production of the mills if they fail to pay up the dues beyond permissible time, but there is no clarity as to whether the leverage could be exercised for failure on the part of the mills to settle SAP.\n\nThis was due to an apparently contradictory stand on SAP taken by the Central Government. The Price Policy for Sugarcane released during 2014-15 by the Commission for Agricultural Costs and Prices (CACP) states that high SAP without commensurate increase in sugarcane productivity would make the Indian sugar sector globally uncompetitive.\n\nStating that such a situation would lead to large excess stocks at home, and high cane arrears, bringing uncertainty and instability in sugar sector, and ultimately its fall, the CACP report advocated immediate adoption of the hybrid formula for pricing of sugarcane, which is composed of revenue sharing principle dovetailed with some Minimum FRP (MFRP).\n\nThe revenue sharing principle will be to distribute the total revenue generated in the cane-sugar value chain from sugar and its first stage by-products (molasses, bagasse and press mud) produced from a quintal of sugarcane, between farmers and millers in the ratio of their relative costs (70:30) incurred in producing sugarcane and converting that sugarcane into sugar and by-products. If the value of by-products is loaded on the value of sugar, then this ratio comes to 75:25.\n\nUncertainty\n\n“Given the uncertainty about future sugar prices, this revenue sharing principle needs to be combined with MFRP so that farmers are ensured of a minimum price. Adoption of this transparent and scientific hybrid formula as the basis of pricing of sugarcane will bring greater stability and rationality in the sugar sector. This, in turn, would attract fresh investments with new technology and take it to higher levels of efficiency and growth. Thus, the SAP needs to be phased out as it has lost its relevance,\" the report states.\n\nThis being the case, farmers wonder why the SAP announcements are made if the State Government is not serious about securing the dues.\n\nImpact\n\nThe impact of the downturn in sugar industry was perceptible in Tamil Nadu since the State accounts for one-tenth of sugar production in the country. Tamil Nadu ranks fourth in terms of sugarcane production with 10.8 per cent, after Uttar Pradesh (36.5 percent), Maharashtra 22 and Karnataka 10.9.\n\nSugarcane farmers say a solution is possible to the present crisis if the mills are forthcoming about sharing revenue from the by-products.", 
    "section": "national", 
    "title": "Cane farmers slam Centre, State Governments", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}