{
    "author": [], 
    "text": "RELIGION\n\nRamayanam : R. Ramamoorthy, Shirdi Sai Baba Temple, 16{+t}{+h}Street, Thillai Ganga Nagar, Nanganallur, 6.30 p.m..\n\nBhagavatam : B. Sundar Kumar, Madras Sanskrit College, Mylapore, 6.30 p.m.\n\nGita: R. Aravindan, AI 118 / 18, Creation Ragas Apartments, Eighth Main Road, Anna Nagar, 6.45 p.m..\n\nVishnu Sahasranamam: Dr. Sudha Seshayyan, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m..\n\nVinayagar Agaval: Amaresh Chaitanya, Chinmaya Mission, Harrington Road, Chetpet, 7 p.m..\n\nPanchapadika: R. Mani Dravid, Sri Sankara Gurukulam, C.P. Ramaswamy Street, Abhiramapuram, 5 p.m..\n\nKenopanishad (Tamil): Swami Suprajnananda, Sri Ramakrishna Math, Mylapore, 5.30 p.m..\n\nKurai Ondrum Illai : Nagai Mukundan, Tirumala Tirupathi Devasthanam, Venkatnarayana Road, T. Nagar, 6.30 p.m..\n\nPanchadasi: Satyavratananda Saraswathi, Mylapore Club, Luz Church Road, Mylapore, 11 a.m..\n\nThirukural and Silapathikaram: K. Venkatesan, Kanchi Shri Krishna College of Arts and Science, Kilambi, Kanchipuram, 11 a.m.\n\nGENERAL\n\nThe Indus Entrepreneur (TIE) Chennai Health Care SIG: Discussion on ‘the new age health care,’ My Fortune Hotel, Cathedral Road, 4 p.m..\n\nRotary Club of Madras Chennapatna: Awards distribution, Hotel Savera, 6.30 p.m..\n\nUniversity of Madras: Three-day national seminar on death and dying in Indian tradition, F-50 (first floor), Chepauk, 10 a.m.\n\nBharath University: Ph.D. Scholars’ Meet – 2016, Bharath University Auditorium, Main Campus, Selaiyur, 11 a.m.\n\nValliammai Engineering College: Lecture on ‘ethical hacking and cyber security’, 9 a.m.; seminar on ‘issues in big data’, Kattankulathur, 2 p.m.\n\nGuru Shree Shantivijai Jain College For Women: Seminar on ‘mantra for self development’, Vepery, 9 a.m..\n\nSaveetha School of Law, Saveetha University: ‘Frames – 2016’, Velappanchavadi, 9.30 a.m..\n\nPeriyar Library Reader’s Circle: Dr. C. Natesaanar Remembrance Day, Periyar Thidal, 6.30 p.m..\n\nNarcotics Anonymous: Meetings: St. Joseph High School, Vepery, 7 p.m..\n\nAl-Anon: Meetings: Divine School, Pudur; Santhome Boys Higher Secondary School; CSI Inbarasu Aalayam, Tollgate; Philomina Matriculation School, Injambakkam; Ezhil Nagar Third Street, ‘B’ Block, Kodungaiyur, 7 p.m.\n\nAlcoholics Anonymous: Meetings: Church of Christ, Anna Nagar; Corporation School, Chepauk; Victory Child Development Centre, Selaiyur; Church of Victorious Cross, Ashok Nagar; St. Joseph’s Church, Cholapuram Road, Ambattur; St. Sebastian Church, Madhavaram; Sri Ganapathy Sachidananda Ashram Hospital, Velachery; Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}