{
    "author": [
        "Karthik Madhavan", 
        "Aloysius Xavier Lopez"
    ], 
    "text": "As the dust settles on the Smart Cities Mission announcements, and the implementation phase is all set to begin, local governments will have to work towards the key goals, keeping in mind the need to make it a participatory and involved process along the way. The pendency of other ‘city improvement’ projects will also have to be factored in.\n\nIt would be a worthwhile exercise to evaluate these factors in the two cities chosen initially for the Smart City Mission - Chennai and Coimbatore.\n\nA study of the projects approved under the JNNURM, over five years ago, will bear testimony to local government’s willingness to act, the pendency of these projects an indication of the ability of the local body to implement development schemes with a broad based development agenda.\n\nFor instance, most of the 13 e-governance initiatives, and infrastructure projects, proposed in 2009 under JNNURM in Chennai have not been yet implemented. More than 50 per cent projects estimated at Rs.3,500 crore under JNNURM in 2009 in the city remain incomplete due to various reasons. Experts say projects such as procurement and monitoring of projects, information dissemination on health programs, modernisation and management of corporation hospitals, solid waste management system, modernisation and management of corporation schools and council management and other internal functions critical for effective citizen services have not been successful.\n\nThey point out that some of the projects that did make headway and result in success in e-governance registration and issuing birth/death certificates, payment of taxes (property, professional and company), building plan approvals and permits, geographic information system for town planning and urban development and public grievances, redressal and suggestions.\n\nThe Coimbatore Corporation took up a few projects of which it is yet to complete underground drainage work. It has implemented the solid waste management project but in the process it got into more problems – the dispute with the contract company is one among those.\n\nSources said the Geographic Information System project was not implemented.\n\nOne of the reasons that this scenario exists is because there was hardly any citizens’ supervision or it was kept to a minimum just to fulfil procedural obligations, charge activists. In the initial days of implementing the JNNURM projects the Corporation showed enthusiasm in convening the Citizens’ Technical Advisory Committee (CTAC)’ meetings but as time passed by it waned to the extent that the civic body stopped convening the meetings,” says R. Raveendran, a CTAC member. As it turned out, the Corporation only wanted suggestions but did not want the CTAC members to monitor the projects, he said.\n\nThis story should not repeat itself. The SCM project in Coimbatore should involve citizens, activists at every level, says Vanitha Mohan, Managing Trustee, of Siruthuli, an NGO that was consulted while drafting the SCM proposal for Coimbatore. But her fears may well turn out to be true as a company (special purpose vehicle) will implement the SCM projects in cities that the Central Government has selected under this mission.\n\nThe local councils will have very little role. They cannot reverse decisions of the companies and their resolutions will not bind the companies, says a Coimbatore Corporation officer, adding that if the companies decide to levy charges the councils cannot prevent it.\n\nGiven the SCM guidelines, even the elected municipal council in the selected cities will have very little say in functioning of the company, which for all purposes will be a corporate body, said M.G. Devasahayam, a former bureaucrat and urban development expert. In the implementation of SCM projects, “democracy is substantially derailed and replaced by corporatisation.”\n\nBoards of directors of the companies (SPVs) in the selected cities will decide on their functioning and the State Governments and urban local bodies will delegate to them the rights and obligations of the municipal councils with respect to the SCM projects, he added.\n\nIf the non-government organisations’ aspirations for monitoring the projects must be met, their say must have legal sanctity and must impact on release of funds, Mr. Devasahayam explained.\n\nIn the absence of such a frame work in the SCM, citizens’ participation will have little meaning, adds A. Srivathsan, professor, Centre for Environmental Planning and Technology University, Gujarat. And, for citizens’ participation to have meaning, the articles of association of the proposed companies should be suitably formed to include citizens.\n\nThe writing on the wall is clear: Unless the civil society monitors implementation of such projects for public welfare services is incorporated into its very core, the Smart Cities Mission is not likely to serve the purpose.", 
    "section": "national", 
    "title": "Citizens demand participation in Smart Cities Mission projects", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}