{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The tax earnings of Madurai Corporation are likely to rise, as around 6,000 new assessees have been added in the current fiscal, officials said here on Wednesday.\n\nAfter the new Commissioner Sandeep Nanduri took over, a review of the progress made in tax collections for the financial year ending March 2016 was discussed at a meeting.\n\nFrom 2, 91, 267 assessees in 2014-15, the number has gone up to 2,97,263 this year. This is expected to rope in more taxes proportionately to the Corporation through added property tax, underground drainage tax/deposit and water tax, among others. Already, the officials in the four zones covering 100 wards are on a collection spree and they hope to achieve the target by March 31.\n\nSo far, including arrears of about Rs. nine crore from UGD and vacant site tax, the officials have collected Rs. 39 crore against a budget estimate of Rs. 37.76 crore under the property tax head of account. This is about Rs. three crore higher than 2014-15.\n\nTANGEDCO data\n\nFurther, based on the data collected from the Tamil Nadu Generation and Distribution Corporation, the Corporation officials found that a number of commercial electricity connections had been obtained in all the four zones, but the property tax remitted by the assessees to the Corporation remained unchanged. Based on this, the tax structure was revised from resident status to commercial. This has enabled an added earning of Rs. 10 lakh from each zone. The earnings were likely to go up further, officials said.\n\nCollection of arrears from vacant site tax fetched an additional revenue to the Corporation. The landlord has to pay vacant site tax if his plot remains vacant for long prior to construction. The tax will be collected for the period till getting plan approval. Likewise, apartments with unsold flats should pay tax with arrears till the date of sale after which the Corporation will provide UGD and drinking water connections.\n\nThe Corporation had raised a demand of Rs. 12 lakh as annual property tax for the newly built office of the Commissioner of Police on the New Natham Road, which is awaiting formal inauguration by Chief Minister, they also added.", 
    "section": "national", 
    "title": "Corporation’s tax revenue looks up with more assessees", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}