{
    "author": [], 
    "text": "Three students\n\ngo missing\n\nThree Class VIII students were reported missing in the city here recently. On February 14, S. Ragu (15), R. Prabhu (15) and Shajahan alias Sakthivel (14), residing in Seelanaickenpatti, left home after informing their parents that they were going to Anna Park . However, they did not return home. Search efforts by their parents failed and they lodged a complaint with the Annathanapatti police. The police have registered a case. Search is on for the boys.\n\nThree children injured\n\nThree children suffered injuries on Wednesday after gunny bags fell on them at an anganwadi in Sendamangalam. The incident took place when a worker was unloading bags from a vehicle. The children were admitted to a private hospital in Sendamangalam and were said to be out of danger. Officials are investigating.\n\nOne held, 16 sovereigns recovered\n\nThe police arrested Deva alias Devendran (34) of Harur in Dharmapuri district on charges of committing burglaries in the town. On February 7, burglars entered two houses in Ramapuram Pudur, and decamped with 28 sovereigns of gold jewellery, silver items and other valuables. Namakkal police registered a case. The police arrested Deva and recovered 16 sovereigns of gold jewellery from him. Search is on for three others.\n\n30 passengers injured\n\nAs many as 30 passengers of two private buses sustained injuries after a bus hit the rear of a stationed bus at Mettur on Wednesday. A bus from Salem with 50 passengers, proceeding to Mettur, had stopped at Pudusampalli for passengers to board. Another private bus that was coming behind, hit the rear side of the stationed bus. In the impact, both the buses were damaged and passengers sustained injuries. They were admitted to hospitals in Mettur and were undergoing treatment. Karumalai Koodal police have registered a case and are investigating.", 
    "section": "national", 
    "title": "Crime notes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}