{
    "author": [
        "K Manikandan"
    ], 
    "text": "Earlier, individuals could book up to 10 tickets a month, which has now come down to six\n\nMany passengers, especially frequent travellers on long-distance trains, want the Indian Railway Catering and Tourism Corporation (IRCTC) to continue to allow them to book more than six tickets a month.\n\nThe restriction on individuals booking tickets through IRCTC came into effect on Monday.\n\nEarlier, individuals who had registered on the IRCTC website with valid user accounts could book up to 10 tickets a month, which was restricted to six from Monday. The move from the Railway Ministry is to prevent misuse of the facility by touts and a small section of individuals who booked tickets for someone else and made a profit out of it, officials explained.\n\nFrequent travellers\n\nFrequent travellers like M. Arul, who hails from Tenkasi, said the move would inconvenience passengers who travelled often on work.\n\n“People in my sales team make multiple journeys a month and now we have to search for authorised agents wherever we go,” he said.\n\nUsers also said that till now it was easy for senior citizens on a pilgrimage in small groups of four to six to plan their journey and book tickets in advance.\n\nTo prevent an individual from making more than six bookings through multiple phone connections and e-mail accounts, the IRCTC has devised a system and random calls and checks will be made.\n\n“It will be ensured that through one Internet protocol address, no more than six bookings can be made a month,” officials said.\n\nAn authorised ticket agent in the city said that in the event of a joint family, one of them can make bookings through a fixed broadband connection, while others can book from their phones through their mobile data.\n\nNumber of agents lower now\n\nWith the ticket booking simplified through mobile apps, the number of authorised IRCTC agents had come down from nearly 2,000 in the city a few years ago to just a few hundred agents now, officials said.\n\nThey said that initially, users could book only six tickets and subsequently, the number of bookings was increased to ten.\n\nOnly after considering various issues and also, more importantly, to prevent the nuisance caused by touts and unauthorised agents, a policy decision was taken by the Railway Ministry to impose a restriction on individuals to book tickets, they added.", 
    "section": "national", 
    "title": "Curbs on e-booking of train tickets a dampener", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}