{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "A 2012 study with a sample size of 4,209 patients in 17 States found that 26 per cent of patients in ICUs contracted sepsis\n\nMedical devices such as central lines, mechanical ventilators and urinary catheters are responsible for three very common hospital-acquired infections, said Victor D. Rosenthal, a specialist in infectious diseases and founder and chairman of the International Nosocomial Infection Control Consortium.\n\nDr. Rosenthal, who was in the city on Wednesday for a conference, said these devices caused all blood stream infections, 90 per cent of pneumonia and 90 per cent of urinary tract infections in hospitals.\n\n“Devices are responsible for about 95 per cent of all hospital-acquired infections, and lead to a three-times increase in length of stay, costs and mortality. But following a simple set of 12 guidelines could help reduce these infections considerably,” he said.\n\nAn Indian Intensive Care Case Mix and Practice Patterns study published in 2012 with a sample size of 4,209 patients admitted to 124 ICUs across 17 States, found that 26 per cent of the patients in ICUs contracted sepsis.\n\nMortality in patients with sepsis was 42.2% as opposed to 17.8% in those who did not get it, preliminary findings of the study said, according to a media report.\n\nFive times higher in India\n\nDr. Rosenthal, who said he had been working with Indian doctors and nurses both in the government and private sector since 2003, said in Indian patients, the rate of blood stream infections was five times higher than that of patients in the United States.\n\nOne of the primary causes of hospital-acquired infections in India, he explained, was the use of older, less expensive technology. “New technology, including collapsible IV containers, split septum connectors, single-use flushing devices — is more expensive but cost-effective in the long run as it helps prevent infections,” he said.\n\nThe other problem is that there is not much awareness of guidelines to curb hospital-acquired infections, said Dr. Rosenthal.\n\nNo national guidelines\n\n“There are no national guidelines on infection control. Most of that are used by hospitals are extrapolated from the West, and may not be suitable for India. However, the National Accreditation Board for Hospitals and Healthcare Providers has now initiated compulsory reporting of data on infections,” said Santosh Kumar, senior quality advisor, UP Health Systems Strengthening Project, a World Bank initiative.Outdated technology\n\nWith multi-drug resistant infections on the rise and not many new antibiotics on the anvil, it becomes all the more important to control hospital-acquired infections, said M.N. Sivakumar, who collaborated with Dr. Rosenthal on a study that revealed that outdated technology contributed to catheter-associated blood stream infections.\n\nWhat is needed? “A national surveillance system with a clear standardised system for data collection and validation of reported infections, national guidelines and a trained team for surveillance and infection control at every hospital,” said Dr. Rosenthal.", 
    "section": "national", 
    "title": "‘Devices cause most hospital-acquired infections’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}