{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They demanded the Speaker expunge remarks against Stalin’s son-in-law\n\nDMK MLAs were evicted en masse from the Assembly on Wednesday as they did not pay heed to the Speaker’s repeated warnings and continued to protest by standing near the Chair demanding that certain remarks made by a ruling party MLA be expunged.\n\nPandemonium prevailed for about 15 minutes after Vilathikulam MLA G.V. Markandayan made some remarks on the DMK, particularly mentioning party treasurer M.K. Stalin’s son-in- law Sabareesan. While he continued his speech, some infuriated DMK MLAs started shouting at him. A few of them even went near Speaker P. Dhanapal’s chair asking him to expunge the remarks. After being briefed, Mr. Stalin sought the removal of the remarks but the Speaker said he could take action only after going through the records.\n\nThen, Mr. Stalin, admitting that Mr. Sabareesan was his son-in-law, made some remarks which triggered angry response from the Treasury benches. The Speaker immediately expunged his remarks. The DMK MLAs asked the Speaker to expunge the AIADMK MLA’s remarks also. As their demand was not accepted, the DMK MLAs surrounded the Chair and the Speaker strongly objected to their conduct and reiterated that he would take action only after going through the records. The DMK MLAs were unrelenting and continued to stand around the Chair in protest. Finance Minister O. Panneerselvam intervened twice and tried to pacify the DMK MLAs but they were firm in their demand.\n\nHeated exchange ensued and the Speaker asked the DMK MLAs if it was correct to ring his bell and treat him in a disrespectful manner. He reprimanded DMK’s J. Anbazhagan in particular for his behaviour in the House.\n\nWhen his repeated requests and warnings for maintaining decorum in the House failed, the Speaker summoned the marshals and ordered the eviction of the DMK members. Some of the DMK MLAs squatted before him and had to be forcibly removed. As they were being evicted, the agitating MLAs raised slogans against the Speaker.\n\nLater, Mr. Dhanapal said he had to take action against the DMK MLAs as they had repeatedly disrupted the proceedings, not allowing the smooth functioning of the House.", 
    "section": "national", 
    "title": "DMK MLAs evicted en masse from Assembly", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}