{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Rupee’s decline to the lowest level against dollar since August 2013 and nearly hitting the all time low, all happening on Wednesday, has caused jitters among the industrialists in Tirupur knitwear cluster.\n\nDuring the intra-day, the rupee fell to Rs. 68.67 to the dollar against the record low of Rs. 68.85 hit in August 2013 and eventually closed at Rs. 68.49 on the day.\n\nThe experts attribute rupee volatility to a host of reasons ranging from poor global economic environment, worries about Chinese economy subsequent to devaluation of Yuan and uncertainty on low crude oil prices, among others.\n\nThe fluctuations in the rupee- dollar rates are causing worries for Tirupur knitwear exporters as they fear that the production costs would go up substantially.\n\nImports\n\n“The export cluster of Tirupur also imports lots of machinery, raw materials like apparel print inks and accessories used for embellishing the apparels. With rupee weakening against the dollar, the cost of production automatically goes up and profit margins shrink”, pointed out M. Veluswamy, apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council). Adding to the worries, a large chunk of foreign buyers ask the exporters here to pass on the benefits of price margins to them every time the rupee depreciates against the dollar little taking into consideration the increase happened to the overall production costs.\n\nS. Dhananjayan, chartered accountant and industry consultant, feels that Reserve Bank of India should intervene immediately to arrest any further decline by utilising various monetary tools and options.\n\n“This is very important to bring back stability in currency markets and for boosting the confidence of the industry”, he said.", 
    "section": "national", 
    "title": "Fluctuations in rupee- dollar rates worry Tirupur knitwear exporters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}