{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "insistent:Government employees staging a demonstration in front of old bus stand in Thoothukudi (left) and near Tirunelveli Junction on Wednesday.— Photos: N. Rajesh and M. Laxmi Arun\n\ninsistent:Government employees staging a demonstration in front of old bus stand in Thoothukudi (left) and near Tirunelveli Junction on Wednesday.— Photos: N. Rajesh and M. Laxmi Arun\n\n1,816 protesters arrested in Tirunelveli when they tried to stage a road blockade\n\nThe ongoing strike by government employees and teachers continued on Wednesday also and 1,816 protestors were arrested here when they tried to stage a road blockade.\n\nAfter their office-bearers addressed the protestors, members of primary school teachers’ associations and government employees’ associations took out a procession near Lourdhunathan Statue and courted arrest. The police took 422 persons, including 354 women, to a marriage hall.\n\nLed by G.S. Madhavan, Assistant Police Commissioner, Palayamkottai, police had made security arrangements.\n\nSimilar protests were staged at Tenkasi, Ambasamudram and Sankarankoil.\n\nWhen the employees of Primary Agriculture Cooperative Banks from Tirunelveli, Tuticorin, Kanyakumari and Virudhunagar districts staged a road roko at Tirunelveli Junction, the police arrested 636 protestors, including 44 women.\n\nThoothukudi\n\nAs many as 1,285 State government employees, including 1,029 women, courted arrest in Thoothukudi and other parts of the district on Wednesday for staging protests.\n\nThey had been demanding the government to scrap the existing contributory pension scheme, fill up vacancies in government offices and address other grievances. In Thoothukudi, the employees staged a road blockade opposite the old bus stand.\n\nSimilar agitations were held at Sathankulam, Kovilpatti and Tiruchendur.\n\nNagercoil\n\nAs many as 570 members of Tamil Nadu Government Employees Association (TNGEA), including 315 women, courted arrested for staging a road roko in front of the Kanyakumari Collectorate in Nagercoil.\n\nC.R. Rajkumar, district secretary, TNGEA, said that the indefinite strike entered into its eighth day on Wednesday, as over 2,500 out of 6,000 government employees, including teachers, took part in the strike in the district.\n\nDistrict president Leedenstone led the protest.", 
    "section": "national", 
    "title": "Government employees’ strike continues", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}