{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Indefinite strike by government employees has been continuing for the third day in Theni and Dindigul districts.\n\nMore than 1,700 government employees and noon meal staff were arrested in Dindigul and 1,300 employees in Theni district who took out processions and picketed prime roads on Wednesday.\n\nIn Dindigul, the employees took out a procession that started from Dindigul panchayat union office and ended at Dindigul Corporation office. Later, they staged a demonstration in front of the Corporation office pressing for 20-point demands and raising slogans against the State government.\n\nMeanwhile, doctors in Dindigul Headquarter Hospital supported the employees’ indefinite stir from Wednesday.\n\nThey wore protest badges and attended duty. When contacted, doctors said that they were showing their protests in a peaceful manner and extending their support to agitating employees. Only a section of senior doctors in the Dindigul Government Hospital wore badges and others did not wear any badge.\n\nRamanathapuram\n\nMore than 3,500 government employees, including large number of women noon meal and anganwadi workers, courted arrest after they attempted to picket the collectorates in Ramanathauram and Sivaganga districts.\n\nThe employees, who had been staging picketing and road block agitations in different parts of the two districts during the last three days, intensified their stir and marched towards the collectorates in a bid to picket the Collector office on Wednesday.\n\nA huge pose of policemen who were deployed at the entrance of the Collectorate in Ramanathapuram prevented the employees from entering the complex. While more than 1,000 women employees squatted on the road at the entrance, others squatted on the road and blocked traffic before they were arrested.\n\nSivaganga\n\nAbout 2,500 employees courted arrest after they tried to picket the Collectorate. They came in groups, squatted in front of the complex and courted arrest.\n\nThe arrested employees were detained in marriage and community halls and released in the evening, police said. The government employees were on an indefinite strike, pressing 20 point charter of demands, including scrapping of the new pension scheme.", 
    "section": "national", 
    "title": "Govt. employees arrested", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}