{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In an interesting collaboration between the farm fraternity and the police, the Krishi Vigyan Kendra conducted a pre-Rabi awareness programme forging alongside a police initiative at KVK, Paaparapatty, recently.\n\nThe programme inaugurated by J. Loganathan, Superintendent of Police, Dharmapuri, coincided with the introduction of a new “Farmer Friend of Police’ initiative to bridge a rapport between farmers and the police.\n\nWith the Rabi season poised to take over, KVK here organised the campaign to sensitise farmers to the technical aspects for the current season of crops here in Dharmapuri.\n\nIn his presidential address, Mr. Loganathan highlighted the need to increase awareness towards small millets and organic farming among the farmers. H. Philip, Director of Extension Education of Tamilnadu Agricultural University, Coimbatore, spoke on the various activities of Krishi Vigyan Kendra at district level and the establishment of model farms at the kendras for farmers’ sensitisation.\n\nFarmer ‘Nel’ Jayaraman of Tiruvarur district exhibited a collection of traditional varieties in paddy and discussed about the importance of conservation of traditional varieties of paddy and the enormous possibilities of organic farming.\n\nDr. Jalaluddin, Professor and Head, Regional Research Station, Paiyyur, highlighted the various varieties and technologies released by the Regional Research Station.\n\nParticipating in the programme, resource persons from departments spoke on the success of polyhouse cultivation in Dharmapuri district and the importance of farm mechanisation and utilisation of government schemes effectively to increase farm productivity. Live demonstrations were given on high density planting in Moringa and ecological engineering in paddy.\n\nParticipants were taken on a tour to the fodder bank, exposure to new crop varieties, and precision farming in vegetables.\n\nThe programme also witnessed special demonstrations on Integrated Farming System and model food processing lab; and inauguration of permanent technical exhibition at KVK.", 
    "section": "national", 
    "title": "KVK organises pre-Rabi awareness programme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}