{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Devotees taking a holy dip in the Mahamaham tank on Wednesday at Kumbakonam.— Photo: M. Srinath\n\nThe Mahamaham festival gathered momentum on Wednesday with a large turnout of devotees including VIPs and VVIPs arriving at the town to take a holy dip at the tank.\n\nVarious government departments, including the Hindu and Religious Charitable Endowment, the police and fire fighting personnel, have made extensive arrangements to help devotees to have the holy dip without any hitch.\n\n“We ensure that the movement of devotees is regulated from Sri Abimukeswarar temple site to the opposite end, allowing devotees and pilgrims to have a dip in the 20 ‘theerthams,” said a police official from Vellore who has been deployed on special duty at the Mahamaham tank.\n\nAlthough the crowd of devotees was relatively far less in the morning, it started swelling around noon.\n\nMen, women and children were seen walking all around the mahamaham tank, trekking from one theertham to another.\n\nThe police personnel kept a vigil all around the tank regulating the entry and exit places.\n\nAn LCD screen has been installed to provide information on the arrangements and to guide the devotees.\n\nThe LCD screen caught fire apparently due to electrical short-circuit in the early hours of the day and was immediately replaced.\n\n“Fire service personnel and TANGEDCO workers rushed to the spot and made immediate arrangement to put out the fire,” eye-witnesses told ‘The Hindu’.\n\nA number of ambulances have been deployed in the town and free medical camps were being organised at various places in the town. A total of 11 first responder units have been set up at the town, including five on the mahamaham tank.\n\n“We have extended immediate medical attention to as many as 19 persons so far in the past four days,” says Gokularaj, Emergency Medical Executive.", 
    "section": "national", 
    "title": "More devotees throng Kumbakonam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}