{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Neyveli Lignite Corporation (NLC) has built an exclusive office for Booth Level Officers of Neyveli Assembly constituency that will serve as a place where election volunteers are trained and voters can approach for inclusion/deletions and correction of name/details on the Election Photo Identity Card (EPIC) and voters list.\n\nOf the 1,38,000 registered voters of Neyveli Constituency, 68,000 voters are residing at Neyveli Township.\n\nElection work\n\nHence to benefit them, around 70 employees of the Corporation have associated themselves with the District Administration and the Election Commission in the works such as preparing the voters lists, Census, Issue of Aadhar Card, Socio Economic Census etc., The employees carry out the above work out of their office hours during break hour and holidays.\n\nS. Suresh Kumar, District Collector of Cuddalore, hailed the NLC as a ‘role model’ for dedicating an exclusive facility for the Booth Level Officers of the Neyveli Assembly constituency.\n\nSpeaking on inclusion of first time voters in the list, the collector said, as per the population census of 2011, approximate names of 21,000 people who had recently completed 18 years of age are absent in the list and an awareness to this effect is being created in all the colleges.\n\nA college campus Ambassador has been nominated for this purpose, he said.\n\nThrough SMS\n\nTo ascertain the registration of the voter in the voters list, the voter may send the number entered on the EPIC Card through SMS to the number 1950.\n\nThis will help the voter to ensure that the name is available in the voters list.\n\nIn case the voter finds the name not registered, they he can include his name through online facility, including capturing the photo of the applicant, the Collector said.\n\nSarat Kumar Acharya, CMD, NLC who inaugurated the office, said NLC has been associating itself with the district administration with works related to the welfare of the people.\n\nWith the computerisation of the entire process by the Election Commission, there is total transparency. Computer and internet facility will also be provided at the office, he said.\n\nNLC Directors Rakesh Kumar, V. Thangapandian, Executive Directors N.Muthu, N.S.Ramalingam, S.Thirunavukkarasu, officials of the Revenue Department of Government of Tamil Nadu, representatives of Engineers Association, Officers Association, and trade unions participated.\n\nIt will serve as a place where voters can approach for correction of details on identity cards", 
    "section": "national", 
    "title": "NLC builds exclusive booth for BLOs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}