{
    "author": [
        "B Kolappan"
    ], 
    "text": "Kumbakonam’s fame goes beyond its innumerable temples and its renowned Mahamaham temple tank. It was also a redoubtable hub of modern Tamil literature.\n\nNa. Pitchamoorthy, Ku.Pa. Rajagopalan, T. Janakiraman, Karichan Kunju, Ka.Na. Subramaniam and M.V. Venkatram, who were all associated with Manikodi , the literary magazine that was the trendsetter for modernism in Tamil literature, functioned from Kumbakonam.\n\nThey were followed by a new crop of writers, including Indira Parthasarathy, Ra.Ki. Rangarajan, Ki.Ra. Gopalan, Swamimalai Mani, Thronar and artist Gopulu. They ran a library known as ‘Jayamaruthi Vasagasalai’ and a manuscript magazine. Many of them went on to win literary fame and major awards, including the Sahitya Akademi.\n\nThe old generation of writers used to assemble at Thondarkadai, a stationery shop opposite the Town High School, owned by Thondaradipodi. Over a cup of Kumbakonam filter coffee or a wad of betel leaves, they would endlessly discuss literature. The bathing ghats of the Mahamaham tank also used to be their favourite haunt.\n\n“They were known as the ‘Kumbakonam group.’ It functioned continuously from the 1930s to the 1980s. The twins of modern Tamil literature, Ku.Pa. Rajagopalan and N. Pitchamoorthy, were born here. All the writers had close association among themselves,” said V. Arasu, former Head of the Department of Tamil, University of Madras.\n\nGopalarao Library, named after the principal of Kumbakonam Art College, provided the much-needed fodder for young readers.\n\n“It was there I read the entire works of Maupassant,” recalled Indira Parthasarathy, another native of the town and student of T. Janakiraman, who taught at the town high school.\n\n“The semi-rural and semi-urban nature of Kumbakonam provided perfect ambience for the writers,” said poet Ravi Subramaniam, who had moved closely with Karichan and M.V. Venkatram.\n\nIn one of his works, Janakiraman recalls the nights they spent together at the Ku.Pa. Rajagopalan’s house, discussing literature till the arrival of the Karichan, a small-sized songbird also known as ‘Anachathan’ and ‘Bharadwajam,’ in the wee hours. Ku.Pa.Ra. adopted the bird’s name as his pen-name, ‘Karichan.’\n\nNarayanaswami, a school teacher and Sanskrit scholar, who considered himself a disciple of Ku.Pa.Ra, adopted the pseudonym ‘Karichan Kunju.’\n\nThe once-in-12-year Mahamaham festival also provided an opportunity for writers to buy rare books. “In his preface to Ma. Aranganathan’s novel Kaaliyootu , S. Kandasamy has noted that Ka.Na.Su. had purchased many rare books during the festival,” said L.S. Sathyamurthy, another writer from Kumbakonam.\n\nIndira Parthasarathy said he had also seen Janakiraman and others sitting on the ghats of the Mahamaham tank. “I still remember Karichan Kunju praising the line ‘Ottum irandulathin thattil arintheyn’ by Subramanya Bharati. He stressed he had not come across such a beautiful rendering in Sanskrit literature,” he said.\n\nIt was pure passion that drove them towards literature. “M.V. Venkatram could have earned millions through his family’s textile business. But he spent all his money on publishing books and lived in poverty,” said Ravi Subramaniam.", 
    "section": "national", 
    "title": "Of idyllic times and literary fame in temple town", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}