{
    "author": [
        "Staff Reporter"
    ], 
    "text": "For Ravi Desikan (45), whose legs have been affected by polio but enthusiasm still remains undiminished, mobility is not at all a problem.\n\nMr. Desikan, who works as a Higher Grade Assistant in Life Insurance Corporation of India (LIC), has travelled 1.60 lakh km in a modified car in the last three years, demanding the State government to waive toll fee for vehicles used by differently abled persons and exempt petro scooter and retrofitted cars used by them from Value Added Tax (VAT).\n\nMr. Desikan began his 700-km journey from Kanyakumari to Chennai on Wednesday morning to create awareness among differently abled persons that in spite of their disabilities they could achieve their goals in life. He would reach Chennai on Thursday morning.\n\nHe said that he had sought an appointment with Chief Minister Jayalalithaa to submit a petition seeking 100 per cent excise duty exemption for cars meant for differently abled persons, increase in waiver of insurance premium from 50 per cent to 75 per cent, exemption for their vehicles from Road Tax and a separate identity for their vehicles like a beacon.\n\nHe said that he would also appeal to the Chief Minister to press car manufacturers to manufacture five cars for differently abled persons for every 100 vehicles they rolled out.\n\nMr. Desikan, who owns a car with modified clutch, break and accelerator, said that he had so far motivated over 400 persons to go for modified cars.\n\nHe wanted to create a Guinness record by driving an SUV from Chennai to New Delhi and back with stoppages only for fuel filling.\n\nHis car journey to Chennai was flagged off by R. Rajinikanth, Regional Transport Officer, Nagercoil.\n\nMr. Rajinikanth said that not a single differently abled person was involved in an accident or booked for violation of the MV Act across the State.", 
    "section": "national", 
    "title": "Plea to exempt vehicles of differently abled persons from toll levy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}