{
    "author": [], 
    "text": "There will be no power supply from 9.45 a.m. to 2 p.m. on Saturday owing to maintenance work at the Tiruverumbur sub-station: Tiruverumbur, Malaikovil, Prakash Nagar, Vengur, Natarajapuram, Arasangudi, Thogur, Koothaipar, Krishnasamudiram, Pathalapettai, Kiliyur, Tiruverumbur Industrial Estate, Mela Kumaresapuram, Cholamadevi, Cholamanagar, Navalpattu, Burma Colony, Nehru Nagar, Anna Nagar Police Colony, Poolangudi, Suriyur, Kumbakudi, Pazhankanankudi, Kanthalur, MIET and Guntur.\n\nEntrepreneurship camp\n\nA three-day free entrepreneurship camp conducted under the auspices of the Entrepreneurship Development Institute of India, the National Implementing and Monitoring Agency for Training (NIMAT), will be held at the Tiruchi District Tiny and Small Scale Industries Association (TIDITSSIA) office at Ariyamangalam in the city from February 25. This is the second batch of the three camps being conducted under the initiative. Men and women aged above 18 and interested in starting new business ventures were eligible to attend the programme. Candidates will be exposed to various aspects on how to start small business units and schemes implemented by the State and Union governments. Forty persons would be admitted to the camp on first-come first-serve basis. Resource persons from various government organisations, successful entrepreneurs, and industrialists will handle the session. For details, contact the TIDITSSIA office by dialling 0431-2440119/2440114 or email to tiditssiatry@gmail. com ortiditssiatry@yahoo.com\n\nJob fair\n\nThe Tamil Nadu Corporation for Development of Women will organise a job fair at Manapparai on Saturday for unemployed youths of Manapparai, Marungapuri and Vaiyampatti panchayat unions. Candidates with education qualifications from SSLC to graduation and ITI and diploma holders from these unions can participate in the fair to be held at the Montfort Matric Higher Secondary School, Manjampatti, Manapparai. Interested candidates can appear in person along with relevant certificates at the job fair to be held from 9 a.m. on Saturday, an official press release said. More details can be had from the Project Officer, Mahalir Thittam, Collector’s Office, Tiruchi, by dialling 2412726, the release added.", 
    "section": "national", 
    "title": "Power shutdown", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}