{
    "author": [
        "Aditi R"
    ], 
    "text": "Over 300 resettled residents at Ezhil Nagar in Perumbakkam thronged the estate office of the Tamil Nadu Slum Clearance Board (TNSCB) on Wednesday morning, demanding documents that would ensure that they continue to stay in the tenements. These residents said they made this trip to the TNSCB office, following a threat, the previous night, from a group of people who asked them to vacate the premises, saying they too had been allotted the same houses.\n\n“They barged into our houses and asked us to leave,” said Gunasekar, a resident who along with 300 other flood-affected people moved into the tenements at Ezhil Nagar, from R.A. Puram and Adyar last month. “They said they had been allotted these same flats after they were affected by tsunami. We have the necessary documents. But they too held similar allotment papers. It is confusing,” he said.\n\nTwo years ago, TNSCB constructed 2,048 tenements at Okkiyam-Thoraipakkam to accommodate families who were living in huts along the Marina and had been affected by the tsunami in 2004.\n\nOf them, 814 families did not occupy the houses. Early last month, the State passed an order, demanding conversion of these vacant houses, which had been allotted for the tsunami-affected people, into houses to be allotted for families living along the banks of the Adyar river. The order was passed following a proposal put forth by the Managing Director of TNSCB to allot 25,000 tenements at Perumbakkam, Thoraipakkam, Navalur and AIR land in Tiruvottiyur. “Something had to be done to make use of these flats and accommodate those in need, so this step was taken,’ said a senior official of TNSCB. The official said that the tsunami-affected people would be accommodated in the 10,000 new tenements under the ‘Housing For All Mission’, which are under construction in Perumbakkam.\n\nHowever, activists have questions about this. “The housing was completed under the aegis of the World Bank, which had provided the funding to construct the 2,048 tenements exclusively under the Emergency Tsunami Reconstruction project. This sudden change in order raises many questions,” said Vanessa Peter, Policy Researcher, Information and Resource Centre for the Deprived Urban Communities (IRCDUC).\n\nAn information provided by another TNSCB official on January 21, this year, too clearly mentions that the 2,048 tenements in Okkiyam-Thoraipakkam had been constructed and allotted to Tsunami-affected victims, 3,616 tenements in Thiruvotriyur and 6,28 in Nochi Nagar, Marina, had also been allotted to them.\n\nTNSCB has taken cognisance of the issue and ensured that the residents who move recently continue to stay in the allotted tenements. “We do not want them to come back again and fight with us. We cannot afford more tension. We hope something is done about this,” said R Jeeva, another resident.\n\nA group of people barged into their houses claiming they had been allotted to them", 
    "section": "national", 
    "title": "Resettled residents suffer rude shock", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}