{
    "author": [
        "R Sujatha"
    ], 
    "text": "The search panel constituted to recommend three names for the post of Vice Chancellor of Madurai Kamaraj University (MKU) has come under a cloud with one of its members, Mu Ramasamy, who resigned last week, alleging that the selection process was fudged.\n\nHe was the university senate’s nominee on the search panel, which is headed by C. Murukadas (Governor nominee) and has Chennai-based educationist Harish Metha as a member.\n\nAn eminent theatre artist and former Head of Department of Drama at Tamil University, Prof. Ramasamy, alleged that while only 112 candidates had applied for the post in response to an advertisement, the convener Murukadas had drafted a new list with 144 names without the approval of the remaining members.\n\nHe had twice complained to the Governor about this but the latter did not respond.\n\nProf. Ramasamy alleged that the convenor had not given equal weightage to candidates who had 10 years’ experience as professors and associate professor. He wanted to know if it was right to expedite the proceedings when the issue of appointment of a Vice Chancellor was sub judice.\n\nThe Hindu is in possession of Prof. Ramasamy’s resignation letter. “Since I did not get any response from you [Murukadas], I sent a complaint to the Governor-Chancellor on Dec. 31, which was forwarded to you also. I wrote to the Chancellor again on January 28, but there was no response. I am afraid that this panel is not moving in the right direction. Since this process is causing me much mental distress, I am resigning from the panel,” he said in the letter.\n\nOn Wednesday, he went public with his allegations at a press conference in Madurai. Prof. Ramasamy said the plan was to convene a meeting on February 17 to finalise the names and present the list to Governor on the same day.\n\n“If I continued in the committee, the maximum I could do would be to register a dissenting note, which will anyway have no effect. My complaints to the Governor have also not elicited any action. So if I have to be truthful to my conscience, resigning was the only option,” he said.\n\nCiting the MKU statute, he said, “With my resignation, it will not be legally tenable for the committee to recommend names for VC now.”\n\nAccording to him, Mr. Murukadas had on November 17 last year entered into a heated argument with Mr. Harish Metha.\n\n“My repeated requests during the meetings to decide on the parameters for evaluation and assign marks for applicants on those parameters to make the process objective were not entertained. The convener instead suggested that the three members can suggest one name each and those three names can be given to the Governor. That is arbitrary and without doubt only the person already decided by those at the top will be appointed,” he charged.", 
    "section": "national", 
    "title": "Rift in panel mars MKU V-C selection", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}