{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Sastra University here is conducting a technical fest DAKSH to provide a platform for budding engineers from all over the country to showcase their technical flair.\n\nThis year, the tenth edition DAKSH DECA, to be held from February 19, 20 and 21, promises not only to be a great platform for students to exhibit their skills but also to be a joyous experience of learning outside the four walls of the conventional classrooms.\n\nThe stage is calibrated to a whole new level and is all set for the students to explore their skills.\n\nThe festival includes Autoexpo, powered by the SSB Tata Motors, the first of its kind in any student run fest of an Indian institution and is all set to enthral the audience showcasing automobiles like BMW, Mercedes, Jaguar, Harley Davidson and much more. The auto expo will be on during all the three days.\n\nA rally of super cars is planned during the evenings. At the Internsfair, “Letsintern” provides students with great opportunities to land internships with top notch companies like PayPal, Amazon, eBay, and Logitech.\n\nThere are two rounds – aptitude and HR. Once a student clears the first round, you sit for an HR interview.\n\nThe HR comprises all engineering domains. It includes marketing, media and administration.\n\nThe idea/ paper presentation event helps showcase the student’s ideas in abstract form in not more than 150 words.\n\nTopics are open to all engineering domains.\n\nThere are six clusters that include all engineering disciplines and each cluster has five events. Events from DAKSH provide up to Rs.40,000 as cash awards. It also hosts five intriguing workshops which are Spybotics, Ornithopter, Bridge Design, Raspberry Pi and Big Data.\n\nWhen you think you are just cracking your brains to compete with people from various colleges and you are just tired of it, there are so many pro shows on all the three days.\n\nThe KTM Bike stunt show and the Skeleton Dance crew from “India's Got Best Talent” show will be performing to set the stage on fire.\n\nDetails\n\nFor more details, log on to the official website www.daksh.sastra.edu for more details.\n\nThe Hindu is the media partner of the event.", 
    "section": "national", 
    "title": "SASTRA’s tech fest from tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}