{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Southern Railway has announced the operation of more special trains on February 18 and 19 to clear the extra rush of traffic in view of the mahamaham festival at Kumbakonam.\n\nMela charges, as applicable, would be levied on the tickets during the festival. The following trains would be operated on the two days:\n\nTrain No.07676 Tiruchi-Mayiladuthurai Express Special will leave Tiruchi at 1.35 a.m on February 18 and 19 and reach Kumbakonam at 3.15 a.m. and Mayiladuthurai at 4.25 a.m. The trains will stop at Tiruverumbur, Budalur, Thanjavur, Thittai, Pandaravadai, Sundaraperumalkoil, Kumbakonam, Aduturai and Kuttalam.\n\nTrain No.07681 Mayiladuthurai – Thanjavur Express Special will leave Mayiladuthurai at 4.50 a.m. on February 18 and 19 and reach Kumbakonam at 5.30 a.m. and Thanjavur at 6.30 a.m. The trains will stop at Kuttalam, Aduturai, Kumbakonam, Sundaraperumalkoil, Papanasam, Pandaravadai and Thittai.\n\nTrain No.07682 Thanjavur – Mayiladuthurai Express Special will leave Thanjavur at 6.50 a.m. on February 18 and 19 and arrive Kumbakonam at 8.05 a.m. and Mayiladuthurai at 9.15 a.m. The train will stop at all stations between Thanjavur and Mayiladuthurai.\n\nTrain No.07685 Mayiladuthurai –Thanjavur Express Special will leave Mayiladuthurai at 9.35 a.m. on February 18 and 19 reach Kumbakonam at 10.25 a.m. and Thanjavur at 11.50 a.m. The trains will stop at all stations between Mayiladuthurai and Thanjavur.\n\nTrain No.07686 Thanjavur – Mayiladuthurai Express Special will leave Thanjavur at 12.35 p.m. on February 18 and 19 and reach Kumbakonam at 1.25 p.m. and Mayiladuthurai at 2.45 p.m. The trains will stop at Thittai, Pandaravadai, Papanasam, Sundaraperumalkoil, Swamimalai, Darasuram, Kumbakonam, Aduturai and Kuttalam.\n\nTrain No.07689 Mayiladuthurai –Thanjavur Express Special will leave Mayiladuthurai at 3.30 p.m. on February 18 and 19 and arrive at Kumbakonam at 4.15 p.m. and Thanjavur at 5.25 p.m. The train will stop at all stations between Mayiladuthurai and Thanjavur except Malliyam.\n\nTrain No.07694 Thanjavur – Mayiladuthurai Express Special will leave Thanjavur at 6.40 p.m. on February 18 and 19 and arrive at Kumbakonam at 7.50 pm. and Mayiladuthurai at 8.50 p.m. The train will stop at Thittai, Pasupatikovil, Ayyampettai, Pandaravadai, Papanasam, Sundaraperumalkoil, Swamimalai, Darasuram, Kumbakonam, Aduturai, Narasinganpet and Kuttalam.\n\nTrain No.07695 Mayiladuthurai –Thanjavur Express Special will leave Mayiladuthurai at 9.50 p.m. on February 18 and 19 and arrive at Kumbakonam at 10.33 p.m. and Thanjavur at 13.20 p.m. The trains will stop at Kuttalam, Aduturai, Kumbakonam, Sundaraperumalkoil, Papanasam, Pandaravadai and Thittai.\n\nAll the trains will have 16 second class DEMU coaches, a press release said.", 
    "section": "national", 
    "title": "Special trains for Mahamaham festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}