{
    "author": [
        "S Senthalir"
    ], 
    "text": "‘Burns’, ‘Sangarsh’ and ‘Good day will not come’ were screened at Pondicherry varsity’s film festival\n\nDocumentary filmmaking is not about capturing the stark facts of life alone. It can inspire, motivate and retell the stories of love, affection, grit and courage living through the horrifying realities.\n\nThe students of Department of Electronic Media and Mass Communication in Pondicherry Central University have captured the hope and struggle of oppressed people emerging through challenges that life throws at them.\n\nThe eight-minute documentaries made by the students – ‘Burns’, ‘Sangarsh’ and ‘Good day will not come’ – were screened at the International Documentary and Short Film Festival in Pondicherry Central University.\n\nFrom a remote village in Jharkhand, Naina Kumari, a student in the Department of Electronic Media and Mass Communication at Pondicherry Central University, films the lives of a 62-year-old woman who struggles to meet the needs of her HIV-positive granddaughter.\n\nHaving lost her son and daughter-in-law to AIDS, Radhev Oraoh works in a farm to send her 11-year-old granddaughter to school. Though she has many grandchildren, she works to take care of this child. The camera just captures the life of the woman, filming the activities from going to the farm to taking her granddaughter to circus. “She was very shy to speak to us. Hence, we decided to film her routine activities and her relationship with the granddaughter and how the village has been supportive to this family,” she said.\n\nNaina added that the grandmother never discriminates this child because she is HIV positive. “She is going to school and leading a normal life. Everyone in the village knows and do not discriminate against her. The documentary film ‘Sangarsh’ is about the struggle of the grandmother to give a normal life to a HIV positive granddaughter. The story is about treating everyone equal in society,” she said.\n\n‘Burns’, the documentary film, which was screened at the 5{+t}{+h}International Documentary and Short Film Festival, is about acid attack victims. Twenty-three-year old Ashika Kumar along with her classmate Unni Krishnan from the Department of Electronic Media and Mass Communication travelled to Bangalore to document the lives of acid attack victims.\n\n“We did not want to record how the beauty of a woman was destroyed due to acid attack. They are not just victims but survivors and determined to live. We wanted to document this positive aspect rather than talk about victimisation,” says Ashika.\n\nThe eight-minute documentary ‘Burns’ is about the life of Pragya Singh. “We also recorded the legal aspects speaking to the activists groups in Bangalore,” she said. They are planning interviews with acid attack victims in Chennai.\n\n“Women are becoming victims to acid attacks for refusing marriage or love proposals. Acid attack cases are increasing day by day around us. But some brave women victims of the acid attack fight back to live their normal life in the society. It is vital to talk about these issues and create awareness,” she said.\n\nMuhammed Mubeen’s documentary ‘Good day will not come’ focuses on malnutrition in Karnataka.", 
    "section": "national", 
    "title": "Students make inspiring documentaries", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}