{
    "author": [
        "Dennis S"
    ], 
    "text": "The inhuman and illegal practice of Thalaikoothal – a form of geronticide or involuntary euthanasia where the elderly are forced to undergo the procedure against their will – continues to be practiced in the State, a study conducted in Madurai, Virudhunagar and Theni districts reveals.\n\nAccording to the study titled ‘A Study on the Victims of Geronticide in Tamil Nadu, India’ conducted by M. Priyamvadha, Assistant Professor in the Department of Criminology of Madras University, about 30 per cent of the respondents of the study acknowledged that geronticide was being practiced as a ritual killing in the State, while 22 per cent of the respondents acknowledged that death-hastening ceremonies were bring performed to terminate the life of the elderly. The offenders choose from a range of 26 different methods to kill. The respondents have cited a variety of reasons for the illegal practice including ‘concern’ for their parents, irreversible physical or mental condition (of the elderly) and poor economic situation. Contentions such as the respondents not wanting their parents to suffer during old age, claiming situation where there was no scope for improvement in physical or mental condition of the elderly and poor economic conditions continue to be the major reasons behind the illegal practice.\n\nBut there have also been instances that suggest other factors at play. “In one case at Theni district, a son has killed his elderly father so that he could join the government service,” states the study.\n\n“Initially we conducted the study only in Virudhunagar district, but as we proceeded, we found that it was being practiced in Madurai and Theni districts as well.. We are currently conducting the study in Tirunelveli district too,” says Dr. Priyamvadha.\n\nThe offenders choose from a range of 26 different methods to kill the elderly", 
    "section": "national", 
    "title": "Thalaikoothal: death in 26 shades", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}