{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, pantha katchi, Namperumal purappadu from sanctum sanctorum in pallakku, 7.30 a.m.; reaching Theppakula asthana amndapam, 1 p.m.; purappadu from the mandapam in Ottrai Prabhai, 6.30 p.m.; reaching sanctum sanctorum, 8.30 p.m.\n\nSt. Selvanayaki Ammal Church: Episcopal pastoral visit and high mass by Rev.Antony Devotta, Bishop of Tiruchi, Alam Street, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Parayana goshti procession, South Gate, Srirangam, 5.30 a.m.; Sri Vishnu Sahasranama parayanam, Kothandaramar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 92, Balamurgan Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nGovindammal Tamil Mandram: N. Arulsamy speaks on Silapathikaram, Pappammal Anna Chathram, Draupadi Amman Kovil Street, Keezha Chinthamani, 6.30 p.m.\n\nU.Ve.Sa Ilakkiya Mandram: Lecture on ‘Tamizh mozhiyin panmuga thanmai,’ by Durai.Manikandan, assistant professor, Bharathidasan University Constituent College, Subbiah Memorial Middle School, Thennur, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology: Currents – national level technical symposium, S.K.Patnaik, Director, All India Council of Technical Education, inaugurates, 3 p.m.\n\nCentre for Higher Research on Bharathidasan, Bharathidasan University : C.P.Adithanar Endowment seminar, V.M.Muthukumar, Vice Chancellor, inaugurates, university campus, 10.30 a.m.\n\nSharon-JCI Tiruchi Excel: Quiz fest for Rane TRW Rolling Shield, Panchayat Union Middle School, Pirattiyur, 3.30 p.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram : Inauguration of Computer Science and Engineering Department Association, N.Shebagavadivu, assistant professor, BIT campus, Anna University, chief guest, 9.30 a.m.\n\nHallmark Business School: Training programme on Banking and finance, 10 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : National workshop on ‘Health care problems and environmental defects caused by mobile phone radiation,’ 10 a.m.\n\nBishop Heber College Department of Social Work : Programme on positive thinking, RC Middle School, Woraiyur, 11.30 a.m.; awareness programme on personal hygiene for children, Government High School, Kondaiyampettai, 3 p.m.\n\nChidambaram Pillai College for Women Vista Association : Seminar on ‘How to face NET/SET examination,’ V.Francis, assistant professor, St.Joseph’s College, resource person, Manachanallur, 11.30 a.m.\n\nCARE Group of Institutions: Hands-on training on ‘Launch your dream App in Android,’ 10 a.m.\n\nTiruchi District Handball Association and SBIOA Matric Higher Secondary School : Inauguration of district handball championship for boys and girls for SBIOA Educational Trust Rolling Trophy, M.Asok, correspondent, SBIOA Schools, Tiruchi, chief guest, school campus, 9.30 a.m.\n\nPeriyar E.V.R.College : Lecture on Application of statistical tools in social science research by B.Mathavan, professor, Annamalai University, 11 a.m.\n\nSt.Joseph’s College Department of Economics : Econs 2016, Rev.S.Sebastian, college secretary,inaugurates, 10 a.m.\n\nMadras Management Association : Workshop on Stress Management, Hotel Sangam, 9.30 a.m.\n\nHoly Cross College Department of Social Work: Awareness programme on Old age people and mental hygiene, St.Thomas Mercy Home, Crawford, 11 a.m.\n\nBishop Heber College Department of Social Work : Awareness on health and hygiene, LEAD office, Srirangam, 11 a.m.; awareness programme on breast and cervical cancer, St.John de Britto Industrial School, Melapudur, 3 p.m.\n\nVoice Trust : Training on integrated farming, K.Jayabalan, assistant director of agriculture, Manachanallur block, speaks, Siruganur, 9 a.m.\n\nSri Sankara Matriculation School : Annual day, A.V.Narayanan, former Executive Director, BHEL, chief guest, 5 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}