{
    "author": [
        "K Lakshmi", 
        "R Srikanth"
    ], 
    "text": "Some consumers paying their electricity bills through post offices have been facing delays in their bill payment status getting updated.\n\nConsidering this, the Tamil Nadu Generation and Distribution Corporation (TANGEDCO) recently instructed its officials to be cautious in proceeding with disconnection of services. Consumers who produce receipts of bill payment must be spared even if their names are on the defaulters list.\n\nAt present, post offices accept payment of bills for Aircel mobile phones, electricity and BSNL landlines. On an average, nearly one lakh e-payment transactions are done through post offices every month. The Department of Posts earn nearly Rs.7 lakh through e-bills.\n\nA few consumers in some parts of the city note that they think twice before approaching post offices for paying bills as they feel there is a delay in updating the electricity bill payments through post-offices.\n\nThere are also issues like the software system suffering technical snags during transaction and payment links normally remaining unavailable.\n\nConsumer activist T. Sadagopan said residents in the western suburbs have been experiencing problems in network connectivity for the electricity bill payment properly.\n\nSometimes, printed receipts are not generated due to some technical snag in the system at post offices. Due to this, consumers who are mostly senior citizens hesitate to make payments through post offices.\n\nA senior TANGEDCO official said the postal department had been apprised of the issue and the software must be modified to avoid embarrassing situations for consumers.\n\n‘Problems are rare’\n\nOfficials of the postal department said such problems were rare and might occur in offices that were newly networked under core banking solutions.\n\n“We have not received any complaints. But, we will look into the issue and rectify the problem,” an official said.\n\nConsumers have been facing delays in their bill payment status getting updated", 
    "section": "national", 
    "title": "Watch out while paying power bills at post offices", 
    "subsection": "tamilnadu", 
    "date": "2016-02-18"
}