{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Members of key Standing Committees will be replaced if they are not regular, says Venkaiah\n\nPrime Minister Narendra Modi with BJP veteran L.K Advani and Finance Minister Arun Jaitley during the BJP Parliamentary Party meeting in New Delhi on Tuesday.— Photo: R.V. Moorthy\n\nThe BJP Members of Parliament who are members of Standing Committees of Parliament and have below 50 per cent attendance in the meetings of these committees may be replaced.\n\nAt a meeting of the BJP Parliamentary Party here on Tuesday, Parliamentary Affairs Minister M. Venkaiah Naidu told the members as much, saying that it was necessary for those appointed to key Standing Committees to be regular in their work.\n\nMeanwhile, sources said that some changes had been sought by the party to the key committees of Estimates, Public Accounts and Public Undertakings, something which made many wonder whether this was related to Mr. Naidu’s words of caution.\n\n12 members removed\n\nIt is believed that the party has decided to replace Vinod Khanna, Kirti Azad and four others from the Estimates Committee, S.S. Ahluwalia, Dushyant Singh and Ramesh Pokhriyal Nishank from the Public Accounts Committee and Varun Gandhi, apart from two others, from the Committee on Public Undertakings. In all, 12 replacements are believed to be in place.\n\n“I have not filed my nomination. I did not do so in 2014 too, when the party nominated me. There is no question of replacement when I did not file my nomination. It is the party’s choice whom to nominate,” Mr. Ahluwalia told The Hindu .\n\nIn the meeting, Mr. Naidu is believed to have commended the work done by BJP MP Anil Madhav Dave in the committees. Mr. Dave has been on the Public Accounts Committee and has headed three Select Committees since 2015, including the one on the Real Estate (Regulation and Development) Bill, which has been passed by both Houses of Parliament.\n\nMr. Naidu also spoke on the controversy over the suicide of Dalit student Rohith Vemula and the booking of JNU students on charges of sedition, saying the Congress had scored a “self-goal” by opposing the government on the issue.\n\nHe said there were 11 cases of suicide at Hyderabad University prior to Vemula’s case and that six of these were Dalit students. Yet, the Congress did not react and Rahul Gandhi did not visit the campus earlier, he added.\n\nHe is believed to have told the BJP MPs that a factual counter-offensive worked in such cases and the members should also take the message to the people.", 
    "section": "national", 
    "title": "Absenteeism may cost BJP MPs dear", 
    "subsection": "general", 
    "date": "2016-03-16"
}