{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Eleven years after the Maharashtra government banned dance performances in bars rendering thousands jobless, four dance bars have got the licence to hold live dance performances.\n\nBar owners said 16 bars are expected to get the licence over the next few days, and another 100 will get it by month-end.\n\nThey said activity was picking up gradually as they have to make structural changes to comply with the directives the Supreme Court issued earlier this month.\n\nThe Supreme Court had on March 2 asked the Maharashtra government to start issuing licence to dance bars by March 15. The apex court had ordered that CCTV cameras be fixed at the entrance of dance bars and not in the restaurant or the permit area or the performance area, which was requested by the State government.\n\nFollowing the order, 150 bars sought a licence to hold live dance performances on their premises.\n\nThe licence requires them to comply with 26 conditions, key among them being maintaining distance between dancers and customers.\n\nBharat Thakur, owner of three bars – Indiana in Tardeo, Natraj in Vidya Vihar, and Uma Palace in Mulund West – got the licence for dance performances for all on Monday. “We had an orchestra following the ban. Business had dropped for us, but even the state incurred a loss as tourism took a hit. The bar dancers were rendered jobless, and were not rehabilitated,” Mr Thakur said. He said now bars will have to make changes in the seating arrangement, as it was different when it was just the orchestra playing. The fourth bar that got the licence is Padma Bar in Bhandup.\n\n“Work will be complete in another two-three days. Once the annual performance charge of Rs 1,82,500 is paid to the assistant commissioner of police concerned, performances can begin.”\n\nManjeet Singh Sethi, former president of the Dance Bar Owners Association, who closed his dance bar eight years ago, and was the petitioner in the case, said Mumbai nightlife will get a shot in the arm once the dance bars open.\n\n“I have told the members (of the bar owners association) to follow all the rules. We hope the industry flourishes again.”\n\nThere are over 1,200 dance bars across Maharashtra. Bar owners said work, as they knew it, would most likely begin by April.\n\n4 bars get licence for live dance performances; boost to Mumbai nightlife", 
    "section": "national", 
    "title": "After 11 years of ban, dance bars set to spring to life", 
    "subsection": "general", 
    "date": "2016-03-16"
}