{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "Counsel says NCP leader cooperated with probe and is willing to answer all questions\n\nNCP leader Chhagan Bhujbal being taken to the Sessions Court by ED officials, in Mumbai on Tuesday.— Photo: PTI\n\nNationalist Congress Party leader Chhagan Bhujbal was on Tuesday remanded in the custody of the Enforcement Directorate for two days by a PMLA court in Mumbai.\n\nThe former Maharashtra Deputy Chief Minister was arrested by the ED on Monday on charges of money laundering, resulting in a loss of Rs. 887 crore to the State exchequer.\n\nThe agency’s advocate Hiten Venegavkar said during the investigation under the Prevention of Money Laundering Act, records and documents were obtained from individuals/entities and scrutinised. He said statements of bank accounts of various entities were collected from the banks concerned and analysed.\n\nSeeking Mr. Bhujbal’s custody for three days, he said that it had also been revealed that certain individuals/entities had provided payments through cheques against cash to the Bhujbal companies in the guise of dubious real estate deals.\n\nMr. Venegavkar also informed the court that Mr. Bhujbal had not cooperated and not answered questions related to contractors, relationship between the contractor and the sub-contractor, why meetings were held and contracts were given to certain contractors.\n\nHe said a former employee of the Mumbai Education Turst, Amit Balraj, had disclosed that he was witness to huge leather bags containing Rs. 1 crore of the Rs. 1000 currencies being brought to the MET office.\n\nOpposing the agency’s application seeking Mr. Bhujbal’s custody, senior counsel P.K. Dhakephalkar said Mr. Bhujbal had fully cooperated with the ED and that he was willing to be at their office from morning to evening to answer questions. He said since there were allegations of kickbacks in the construction of the Maharashtra Sadan, it should be a case of Prevention of Corruption Act, not Prevention of Money Laundering Act.", 
    "section": "national", 
    "title": "Bhujbal remanded in ED custody", 
    "subsection": "general", 
    "date": "2016-03-16"
}