{
    "author": [], 
    "text": "A police man on Tuesday feeds the horse that was injured during a protest by BJP activists in Dehradun on Monday. –Photo: PTI\n\nRuling Congress and Opposition BJP in Utttarakhand today exchanged charges over the attack on a horse allegedly by BJP MLA Ganesh Joshi during a protest here even as the issue dominated the social media with people pouring their wrath on the Mussoorie legislator for showing cruelty to the hapless animal.\n\nPolice has registered a case against Joshi and his supporters under Cruelty to Animals Act in connection with the incident, while several animal rights activists including Puja Bahukhandi have also lodged a police complaint against the Mussoorie MLA for his “inhuman” act.\n\nWhen intercepted by police near Rispana bridge on way to the state assembly during a protest march yesterday, BJP workers tried to jump over the barricades prompting security personnel, including the mounted police, to swing into action to control the protesters.\n\nThis enraged Joshi who allegedly began hitting a 13—year—old police horse named Shaktiman with a stick, causing fracture in one of its hind legs.\n\nAfter news about the horse being injured during protests by BJP spread, Chief Minister Harish Rawat visited the stable located at the police lines where it has been kept for treatment.\n\nRawat asked sub—inspector Shyam Singh Chauhan, who is looking after the injured animal, to take good care of the horse in consultation with veterinary doctors.\n\nMeanwhile, noisy scenes were witnessed in Uttarakhand Assembly today when BJP demanded a discussion on “deteriorating law and order” in the state provoking a sharp reaction from Congress, which said the opposition party had no moral right to seek a debate on the subject after its MLA “attacked a horse with lathis” during a protest march here.\n\nThe House witnessed a furore during zero hour when Pradesh BJP president and Leader of Opposition Ajay Bhatt rose from his seat to demand a debate on deteriorating law and order scenario which was reflected in the “repressive measures” adopted by the administration yesterday to quell an agitation by BJP.\n\nReacting to Bhatt’s demand, Parliamentary Affairs Minister Indira Hridayesh said a party which was responsible for the law and order going out of grip had no right to seek a debate on it. She said cruelty shown towards a hapless animal by the BJP’s Mussoorie legislator Ganesh Joshi had put the party on the backfoot in its so—called movement against corruption and collapse of law and order. -- PTI", 
    "section": "national", 
    "title": "BJP MLA booked for assault on horse", 
    "subsection": "general", 
    "date": "2016-03-16"
}