{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "oing by the political grapevine, the BJP stands a chance only in Assam among the four States and a Union Territory going to the polls, and the State defies the binaries of Indian politics. The first point is self-explanatory, but the second defies explanation.\n\nCongress versus the rest; BJP versus the rest; outsider versus the son of the soil; or even the Hindu migrant versus the Muslim — those binaries cannot fully explain the intermeshing issues factored in by the State’s voter. Apart from the Congress and the BJP, the regional parties Asom Gana Parishad (AGP), All India United Democratic Front (AIUDF) and Bodo People’s Front (BPF) are significant players.\n\nNot even the simple anti-incumbency factor can help predict the winner, despite 15 years of Congress rule, headed by Chief Minister Tarun Gogoi. As senior AGP leader Prafulla Mahanta told The Hindu , “Please remember, even in 1985 when the newly formed AGP won a historic mandate in the State, the Congress managed to get 35 seats in the Assembly.”\n\nIf there are no meta-narratives or overarching themes dominating the polls, what exactly will matter to the voter?\n\nThe moment the polls in Bihar were over, the Congress and the BJP seemed to have drawn their own lessons from the verdict. Mr. Gogoi was the first off the blocks, trying for a “Mahagathbandhan”, or grand alliance, but that did not work, since he soon realised that tying up with the AIUDF would rob him of the Assamese identity plank and hand it over to the BJP as the regional party’s leader, Badruuddin Ajmal, spoke mostly for the interests of Bangladeshi migrants. The second was to shift focus from his 15-year rule to two years of Prime Minister Narendra Modi. “The BJP may have announced a chief ministerial candidate [Union Minister Sarbananda Sonowal], but the real battle is between Mr. Modi and me, since none of his Ministers or even CMs can move an inch without his say-so,” Mr. Gogoi said.\n\nDemographically, Mr. Gogoi is depending on the Congress’s support base among tea garden voters and tribal groups who have been provided special policies by the State government.\n\nThe BJP’s lessons from its debacle in Bihar were to announce a chief ministerial candidate for the State. Pitting Prime Minister Narendra Modi against Chief Minister Gogoi, they rightly deduced would give Mr. Gogoi the fight he was asking for. “We want to focus on 15 years of Gogoi’s rule, he should answer for that,” Mr. Sonowal said. The second lesson they drew was to consolidate allies, and try for a rainbow alliance. They signed up the BPF. It was, however, the tie up with old allies such as the AGP that is threatening to unravel the BJP’s strategy.\n\n“There are at least 35 seats, minority-dominated areas, where our alliance has no chance. With the AGP, in theory that makes sense,” said a senior office-bearer of the BJP.\n\nIn practice, the RSS-backed move by the NDA government to provide citizenship to Hindu migrants from Bangladesh has driven a Hindutva stake through the heart of the alliance.\n\n“This move is a violation of the Assam accord that mandates that no migrant who moved to Assam after 1971 is to be considered for citizenship,” said a senior AGP leader. Stung, the AGP has decided to put up a “friendly fight” against the BJP in six Assembly seats.\n\nThe disruptor\n\nThe most important tally in these polls will be that of the AIUDF. “The AIUDF and the Congress got the same number of seats in the 2014 Lok Sabha polls. That has rung alarm bells in the State and will help us,” says BJP’s campaign in-charge Himanta Biswa Sarma.", 
    "section": "national", 
    "title": "Caught in churn, Assam gives little away", 
    "subsection": "general", 
    "date": "2016-03-16"
}