{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Those who wrote class 12 examination take to online platform for solution\n\nA day after the CBSE Class 12 Mathematics examination left students across the country stumped, many have taken to the online platform to find a solution for their situation and sought leniency in paper correction.\n\nChange.org, an online forum for people to start petitions for social change, has seen nearly 115 petitions from students and parents across the country. An official statement from Change.org said they had demanded that the Board be lenient in the correction of the exam papers.\n\nAmong the petitions, one from Guwahati urged the Board to award grace marks to students; this petition had over 5,000 signatures on Tuesday evening.\n\n“Even though we were prepared for a challenging paper, this was unexpectedly tough. Most of us are trying to put this behind us and prepare for our accountancy papers on March 17,” said L. Aditya, a student from Chennai.\n\nA petition from Utraksh, a student, to Union Minister Smriti Irani, has further urged the CBSE to take cognisance of the NCERT textbooks while setting question papers.\n\nAnother petition started by a student who signed off as a ‘disappointed student’ reads: “I agree all you wanted to do was increase the standard of the paper... But all of that by keeping us at stake? These marks are not just going be buried away. They are going to stay with us for a good lot of time...”\n\nManila Carvalho, principal, DPS Bangalore East, said some of the questions were beyond the comprehension of the students. Every mark would make a difference to a child in securing a seat in a professional course.\n\nA class 12 student from National Public School, Bengaluru, who is looking for an admission in IIT, said his aim was to score a centum in mathematics. “But I was unable to attempt two questions.”\n\n(With inputs from Tanu Kulkarni in Bengaluru.)", 
    "section": "national", 
    "title": "CBSE students seek lenient correction of math paper", 
    "subsection": "general", 
    "date": "2016-03-16"
}