{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Sensors at the Airmen’s Billet of the Pathankot airbase had picked up the chatter of two terrorists, convincing the NSG Director-General that six ultras were involved in the attack.\n\nThree months after the Pathankot airbase was attacked by terrorists belonging to the Pakistan-based Jaish-e-Mohammad (JeM), a forensic report has established that six terrorists were present there. A forensic examination of the samples collected from the blown-up Airmen’s Billet, where the last leg of the operation was conducted, has found that the samples belonged to “two humans” but it was not possible to extract any “DNA samples” from them.\n\nThere was a debate on the number of terrorists present at the airbase, which came under attack from the alleged JeM terrorists on the intervening night of January 1 and 2. While the bodies of four terrorists killed within the first 24 hours of the operation was found at the airbase, the bodies of the other two could not be found as the Airmen’s Billet, where they were hiding, had been blown up by the National Security Guard (NSG). Two different samples were collected from the Billet and sent to the Central Forensic Science Laboratory (CFSL), Chandigarh.\n\n“The forensic report says the samples tested positive for human remains. The remains were collected from two different rooms. The report says they belong to two different humans. The remains were so badly charred that it was not possible to extract DNA samples from them,” said a senior government official. The National Investigation Agency (NIA) had to send two reminders to CFSL before the reports were sent in.\n\nOn February 8, The Hindu , while giving out the details of the operations, had published an interview with NSG Director-General R.C. Tayal. He had said he was certain that there were six terrorists in the airbase as the ‘go-through’ sensors (a listening device) on the wall of the Airmen’s Billet had intercepted the chatter of two terrorists. When contacted on Tuesday, Mr. Tayal said: “I have not seen the forensic report but we have always said there were six terrorists at the airbase.” A spokesperson of the NIA said: “We do not want to comment on this.”\n\nThe NIA has preserved the bodies of the four terrorists and has shared the photographs with Pakistan through a letter rogatory. A Special Investigation Team from Pakistan is expected to visit India to conduct joint investigations.", 
    "section": "national", 
    "title": "Forensic report establishes presence of 6 terrorists during Pathankot strike", 
    "subsection": "general", 
    "date": "2016-03-16"
}