{
    "author": [], 
    "text": "Noisy scenes were witnessed in the Uttarakhand Assembly on Tuesday when the BJP demanded a discussion on the “deteriorating law and order” situation in the State, provoking a sharp reaction from the Congress, which said the Opposition had no moral right to seek a debate on the subject after its MLA “attacked a horse with lathis” during a protest march here on Monday.\n\nThe police have registered a case against BJP MLA Ganesh Joshi and his supporters under the Prevention of Cruelty to Animals Act, while animal rights activists have lodged a complaint against him. The attack provoked strong reaction on social media.\n\nThis enraged Mr. Joshi who allegedly began hitting a 13-year-old police horse, Shaktiman, causing a fracture in one of its hind legs. Chief Minister Harish Rawat visited the stable at the police lines where it has been kept for treatment. The animal on Tuesday underwent a surgical procedure to fix one of its hind legs after which authorities said no amputation was required. The horse was operated upon by a team of doctors from Pantnagar Veterinary College\n\nThe attack saw the ruling Congress and main opposition BJP locked in a verbal clash in the assembly even as people poured their wrath on Mr. Joshi. Mr. Rawat asked the Dehradun SSP to take the help of doctors of a veterinary hospital in Chennai.\n\nMr. Joshi visited the police lines stable to enquire about the horse’s condition. Denying the charges levelled against him, Mr. Joshi said it was part of the State government’s conspiracy to malign him and his party and deflect people’s attention from its failures. Claiming he had not inflicted injury on the horse, Mr. Joshi said in a statement the horse went out of control during the protests and its hind leg got stuck in a hole dug to put up the barricades. This had led to the injuries. On the video being circulated on the social media showing him attacking the horse with a stick, Mr. Joshi said he was only trying to scare away the animal which had gone berserk, leaving a BJP worker badly injured.\n\nMeanwhile, Union Minister Rajiv Pratap Rudy told presspersons that such cruelty was “unacceptable”, and the party had taken serious note of the incident.\n\nThe party will take a call on this, he added.— PTI", 
    "section": "national", 
    "title": "Furore over BJP MLA’s assault on police horse", 
    "subsection": "general", 
    "date": "2016-03-16"
}