{
    "author": [
        "K A"
    ], 
    "text": "For the first time in the history of the Sainik School at Kazhakkoottam in Thiruvananthapuram, six children from impoverished tribal families of Attappady have got admission for the next academic year by cracking an all-India entrance examination and subsequent interview.\n\nThough 15 tribal students passed the examination, only six were selected on Monday based on the outcome of the interview and medical examination.\n\nThose who failed to win the final round have already undergone the Navodaya School Entrance examination and are awaiting results. The children selected to the school are Binuraj of Karara U.P. School, B. Hari and R. Vishnu of Kottathara U.P. School, M. Midhin, B. Shivakumar and R. Aneesh of Puthur U.P. School.\n\n“I never thought I would crack a national-level competitive examination and subsequent interview. It looks like a miracle,’’ said Hari.\n\nHari and others were part of a group of 24 tribal students from Attappady who appeared for the examination this year under the guidance of the 1991 batch students of the Sainik School.\n\nBuoyed by the success, the alumni association is planning to train at least 100 tribal children from the region for the examination next year.\n\nThe students underwent a six-month training session under the initiative Project Shine. Former student Babu Mathew led the initiative. “Our alumni association undertook the task in its silver jubilee year and it was dedicated to the memory of a batchmate, Shine P. Baby, a lecturer at Rajagiri College, Kalamassery, who passed away in 2006,” says Mr. Mathew.\n\nAlumni bear expenses\n\nThe classes were held on Saturdays. The alumni batch provided teachers and training inputs along with meal at the centralised training centre in an Attappady Hill Area Development Society (AHADS) building at Agali.\n\n“A total of 180 hours of training was provided. All expenses, including transportation for writing the entrance exam, were borne by the alumni batch,” said Sunil Rajendran, another alumnus.\n\nThe alumni association\n\nwants to train\n\n100 children for next year’s exam", 
    "section": "national", 
    "title": "In a first, Attappady tribal children get admission to Sainik School", 
    "subsection": "general", 
    "date": "2016-03-16"
}