{
    "author": [], 
    "text": "Weeks after their stir for quotas in jobs and education plunged Haryana into a welter of violence leaving 30 dead, Jat leaders have threatened to resume their agitation if the State’s BJP government does not meet their demands by March 17.\n\nThe influential Jat community leaders are demanding 10 per cent quotas, besides withdrawal of FIRs registered against the protesters, compensation to those killed during the stir and action against BJP MP from Kurukshetra Raj Kumar Saini for his anti-Jat reservation stand.\n\n“On March 17, we will decide on the next mode of action on whether to block roads, railway tracks or any other type of agitation,” All India Jat Mahasabha chief Yashpal Malik said.\n\nThe State government must bring a Bill in the ongoing budget session of the Assembly to ensure reservation for Jats, he said.\n\nJat leaders from across the State have decided that community members will hit the streets again if the State government does not act, he said, adding that dharnas this time would also cover the rural areas.\n\n“The State government has time till March 17. So far the government has not responded to any of our demands,” said Akhil Bhartiya Jat Mahasabha president, Hawa Singh Sangwan.\n\nOn Monday, members of the community had held demonstrations across the State.\n\n‘Peaceful’ protest\n\nMr Malik said the “government is keen to crush the members of Jat community even though their protest was peaceful”. He also said the government should control its ministers from issuing statements against the Jat community.\n\nHe claimed that the Jat agitation has continued since 2005-06 in 13 states, including Uttar Pardesh, Uttarakhand, Delhi, Madhya Pardesh, Rajasthan, Punjab and Haryana, in a “peaceful manner”.\n\nPolitical outfits in Haryana have for their vested interests given the Jat community a bad name, he said and sought a probe by a sitting Supreme Court judge into incidents of violence during the quota stir in Haryana.\n\n“Those who fired upon peaceful protesters in Haryana recently must be dealt with sternly,” he said, adding that those killed during the agitation must be compensated by the Khattar government through award of jobs to their next of kin.\n\nAs the Jat quota agitation spread fast, engulfing town after town in Haryana, with protesters burning railway stations, schools, hospitals and shops, Khattar government buckled under pressure and announced last month that a bill for giving OBC status to Jats will be brought in the coming Assembly session and a high-powered committee will be set up to examine the quota demand for the community in central jobs.\n\nBJP has accused Congress leader and former Chief Minister Bhupinder Singh Hooda of fanning the agitation. Hooda’s former political adviser Virender has been booked under several charges, including sedition, in connection with the violence. - PTI\n\n“On March 17, we will decide on the next mode of action on whether to block roads, railway tracks or any other type of agitation”", 
    "section": "national", 
    "title": "Jat leaders threaten to resume agitation", 
    "subsection": "general", 
    "date": "2016-03-16"
}