{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Experts surprised at low rating for incident\n\nIndia’s atomic energy regulatory body has classified Friday’s nuclear reactor leak at the Kakrapar atomic power station (KAPS) as Level-1, or the lowest in a seven-rung classification scheme internationally used to rate the severity of nuclear mishaps.\n\nAkin to the Richter scale, used to quantify the severity of an earthquake, the International Nuclear and Radiological Event (INES) scale, developed by the International Atomic Energy Authority, rates a Level 1 as only akin to ‘an anomaly in the plant.’ Levels 1-3 are termed ‘incidents’ and 4-7 as ‘accident.’ By comparison, the nuclear accidents in Fukushima, Japan, in 2011 and Chernobyl, Russia, in 1986 were Level 7 incidents, according to the Atomic Energy Regulatory Board (AERB) update.\n\nOn Friday, one of the pipes carrying heavy water ruptured and led to leakage on the floor of the reactor building. Though plant operators have identified the location of the leak, it will take a while for it to be plugged.\n\nMoreover, the leak occurred in a subsystem that had been refurbished with better quality material in 2011, as part of a planned upgrade.\n\n“The present situation at KAPS Unit 1 is stable and the reactor is in cold shutdown state. The reactor is being continuously cooled and at present there are no major safety concerns. There has been no radioactivity release exceeding the specified daily limits for normal operation, between March 11, 2016, till date. There has also not been any case of workers receiving abnormal radiation exposures,” says the update by AERB, the safety assessor of India’s nuclear plants.\n\nS. Harikumar of AERB said that though heavy water, a key component used to facilitate a nuclear reaction, was still leaking at the plant he didn’t expect anything untoward, as there was no surge in radiation.\n\nHowever, independent experts said it was “surprising” that the incident was classified as only a Level-1 incident. “Right now we have contradictory reports on the quantum of the leak. A Level-1 classification may be underestimating the seriousness of the incident,” said A. Gopalakrishan, the former Chairman, AERB, and a critic of India’s nuclear establishment.\n\nIn Atomic Regulator's Nuclear Mishap Ranking, Fukushima is a ‘7’and Kakrapar just a ‘1’", 
    "section": "national", 
    "title": "Kakrapar leak a ‘Level-1’ nuclear mishap, says AERB", 
    "subsection": "general", 
    "date": "2016-03-16"
}