{
    "author": [], 
    "text": "Ceremony expected to take place in Rome with a thanksgiving later in Kolkata\n\nPope Francis on Tuesday approved sainthood for Mother Teresa, the missionary nun who became a global symbol of compassion for her care of the sick and destitute.\n\nThe pontiff set September 4 as the date for her canonisation, elevating her to an official icon for the Catholic faith.\n\nThe move comes 19 years after the death of the Albanian nun who dedicated most of her adult life to working with the poor of Kolkata.\n\nThere was no immediate word from the Vatican on the location of the canonisation ceremony, which is expected to take place in Rome with a thanksgiving ceremony held at a later date in Kolkata where Teresa is buried.\n\nTeresa, who was 87 when she died in 1997, was revered by Catholics and many others around the world.\n\nDespite posthumously published letters revealing that she suffered crises of faith throughout her life, Teresa has been fast-tracked to canonisation in unusually quick time, underlining her status as a modern-day icon of Catholicism.\n\nTeresa took the first step to sainthood in 2003 when she was beatified by Pope John Paul II following the recognition of a claim she had posthumously inspired the 1998 healing of a critically-ill Bengali tribal woman.\n\nLast year she was credited by Vatican experts with inspiring the 2008 recovery of a Brazilian man suffering from multiple brain tumours, thus meeting the Church’s standard requirement for sainthood of having been involved in two certifiable miracles.\n\nPope Francis met the internationally famous nun three years before her death, when he was still a bishop in Argentina. He later joked that she had seemed so formidable he “would have been scared if she had been my mother superior.”\n\n“She built an empire of charity,” said the Rev. Bernardo Cervellera, editor of the Vatican-affiliated missionary news agency AsiaNews. “She didn’t have a plan to conquer the world. Her idea was to be obedient to God.” — AFP/AP", 
    "section": "national", 
    "title": "Mother Teresa to be canonised on September 4", 
    "subsection": "general", 
    "date": "2016-03-16"
}