{
    "author": [
        "H S", 
        "Narasimha Kumar"
    ], 
    "text": "The Karnataka State Dr. Gangubai Hangal Music and Performing Arts University is contemplating introducing the ‘gurukula’ system to teach students music and performing arts at Dharmapura village in Hunsuru taluk.\n\nDedicated students will be selected to be trained in the gurukula system and the university will appoint teachers who have both practical and theoretical knowledge in music and performing arts.\n\nSarvamangala Shankar, Vice-Chancellor of the university, told The Hindu that the proposal would be placed at the next syndicate and academic council meetings to get formal approval before initiating steps to appoint teachers and select students to be enrolled under the gurukula system Both teachers and students would remain at the ashram proposed to be set up at Dharmapura village. The university has about 65 acres of land in the village.\n\nThe teachers are expected to teach and involve the students in academic activities in as many hours as possible in a day. Students are not expected to serve their teachers like in the ancient Guru-Shishya Parampara. Students are expected to live in a disciplined manner, focusing only on education at the ashram, Ms. Shankar said. They will be trained to perform in public functions, she added.\n\nThe V-C further said the gurukula system is in vogue in many places in Tamil Nadu. She said with music being a practical subject, it can only be acquired through direct contact with the teacher.\n\nShe said in the ancient system of gurukula, the Guru symbolised the art itself while for the disciples signified the continuity of the art form.\n\nSenior academicians of the university are engaged in working out the details of the proposed gurukula system of education, she said, adding that two panels would be formed — one to select teachers and the other to select the students.\n\nBoth teachers and students will stay at the ashram proposed to be set up in Dharmapura", 
    "section": "national", 
    "title": "Music university looking at gurukula system of education", 
    "subsection": "general", 
    "date": "2016-03-16"
}