{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Fear of being struck of voters’ lists and branded Bangladeshis haunts the poverty-stricken migrants\n\nNearly 40,000 Assamese migrants live in Uttar Pradesh in deplorable conditions. Their biggest grouse is that despite carrying valid ID cards, they are still being labelled as Bangladeshis.— PHOTO: Rajeev Bhatt\n\nIsmael left the Brahmaputra plains for Lucknow around 15 years ago hoping for a better livelihood. Back home in Assam’s Barpeta district, he had to struggle as a farm labourer on abysmally low wages.\n\nIn the Uttar Pradesh capital, following the path of other Assamese migrants, Ismael took to rag-picking for a living. Though in Lucknow he is assured of a relatively stable income, even if low, and is safe from the violence of the ethnic Bodo movement, he has to subsist in deplorable conditions.\n\nHowever, hundreds of kilometres away from home, far from the economic considerations that led to his initial migration, his biggest concern is the fear of losing his Indian citizenship. It is this threat of “identity crisis” and State persecution that drives him to vote in every election. And in a few days time, Ismael, along with hundreds of other Assamese migrants living in Lucknow’s slums, will make a 36-hour train journey passing through Kokrajhar — the district notorious for Bodo violence — to cast his vote in the upcoming Assam Assembly elections.\n\n“If I do not vote, they will strike my name off the voter’s list (in Assam) and term me a defaulter. I will be branded a Bangladeshi and all chaos will descend upon my life,” says Ismael, who is in his mid-thirties.\n\nBottom of the pile\n\nPoverty, unemployment and the destruction caused by floods have forced thousands of Assamese to flee the State over the past three decades. The migration peaked with the violence of the Bodoland movement. NGO Vigyan Foundation estimates that 50,000-60,000 Assamese migrants live in Lucknow.\n\nOnce cut-off from the electoral list, getting re-enrolled is a painful exercise, says Mohammad Qasim, who once sold jute products in Assam.\n\n“‘Where were you during the time of voting — Bangladesh?’ This is how they taunt us if we are absent. We have to spend a lot of money and make many trips to get our names re-enlisted. If we do not have a valid ID, we are harassed as Bangladeshis, and sometimes even picked up as terrorists,” says Mr. Qasim.\n\nIddis Ali (21), who hails from Bongaigon district, adjoining Kokrajhar, is one of the few who has managed to go to college. An art student at the DAV college, he hopes to secure a stable job some day, away from the shambles of rag-picking.\n\nWith the BJP intensifying its campaign against “illegal Bangladeshi immigrants” in the Assam elections, these migrants are more determined to make the journey home this time.\n\nHowever, the trip is not only tedious — besides that Bodo militants have been known to sabotage trains — but also dents the pocket of the impoverished migrants.\n\nThe threat of being disenfranchised is a major concern of Assamese migrants in Uttar Pradesh", 
    "section": "national", 
    "title": "My vote, my only identity — migrants’ plight", 
    "subsection": "general", 
    "date": "2016-03-16"
}