{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Central Excise and Customs Commissioner M. Sreedhar Reddy on Tuesday said that gold merchants need not fear that the recently introduced one per cent central excise levy on jewellery would trigger invasive inspections of their manufacturing premises.\n\nAt a press conference held here against the backdrop of the ongoing nationwide strike of gold merchants, Mr. Reddy said tax inspectors would not visit the premises of jewellery manufacturers.\n\n(Gold merchants have been on strike since March 2 to get the levy rolled back. However, their agitation seemed to have barely affected the jewellery trade in Kerala. Local merchants opened their showrooms for business after a token strike for a few days.)\n\nMr. Reddy said the new levy applied only to jewellers whose annual turnover was Rs.12 crore and above. (Such traders number less than 120 in Kerala).\n\nGold merchants who sought the benefit of the tax input credit scheme (an incentive plan that allowed traders to offset the tax they owe the Centre against the various taxes they have already paid) need only pay a nominal duty of one per cent of their annual turnover. However, merchants who have availed themselves of the benefits of the scheme have to remit 12.5 per cent of their annual turnover as tax.\n\nArtisans and goldsmiths who fashioned jewellery on a job-work basis were not required to pay duty or file returns. Only the principal manufacturers were required to meet these obligations.\n\nSmall jewellers with an annual turnover less than Rs 50 lakh, who form the bulk of gold merchants in the country, were exempt from the tax.\n\nSilver jewellery, except those studded with precious stones, was exempt from the tax. Small-scale sector gold manufacturers with an annual turnover of less than Rs.6 crore were also exempt from the levy. Such manufacturers were merely required to produce a certificate from their chartered accountant, based on their respective book of accounts, to prove their eligibility for duty exemption.\n\nMr. Reddy said efforts were on to cut red tape in the department to pre-empt allegations of harassment or corruption and make the process of tax assessment accountable and transparent.\n\nAssesses were now not required to directly interact with Central Excise assessors for registration, payment of duty or filing of returns. They could do it themselves by logging ontohttps://www.aces.gov.in. There will be no post registration verification of premises.", 
    "section": "national", 
    "title": "No inspection of jeweller premises: Customs chief", 
    "subsection": "general", 
    "date": "2016-03-16"
}