{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Najeeb Jung, as Vice-Chancellor of Jamia Millia Islamia, conferring the Degree of Doctor of Letters on Prince Salman Bin Abdul Aziz, Governor of Riyadh.— File PHOTO: Sandeep Saxena\n\nIn the last decade, India has seen a 10-fold increase in its research collaboration with Saudi Arabia, according to a study commissioned by the Department of Science and Technology (DST) and conducted by Thomson Reuters.\n\nIn the period 2005-2008, Saudi Arabia was only the 20th most prolific contributor of India, with 123 jointly-authored papers involving Indian and Saudi Arabian researchers. This has skyrocketed to 1,303 in 2013-2014, making the oil rich kingdom India’s 12th most important contributor, surpassing Switzerland, Russia, The Netherlands and Poland. In other words, from having merely 0.1 per cent of India’s total collaborative research publication output in 2005, Saudi Arabia contributes now 1.25 per cent — a 10-fold increase. In comparison, the U.S. has only increased from 6.67 per cent to 7.47 per cent.\n\n“This was a voluminous report that looked at various aspects of India’s research publication trends….we will look at the Saudi Arabia aspect more closely shortly. It’s an interesting find,” said Praveen Arora, a DST official involved with commissioning the study.\n\nSaudi Arabia’s engagement with India is a point highlighted by the authors of the DST report, which has been prepared by Thomson Reuters’ Research and Data Services unit. “Collaboration with Saudi Arabian universities increased dramatically… Many Saudi Arabian institutions now rank among India’s top 10 collaborating organisations.”\n\nFor their analysis, the report employs a tool called ‘Web of Science’, a popular, online search tool, used often by scientists to search for research related to their sub-fields. The most prolific Saudi Arabian university mentioned in the analysis is the King Saud University, which is now among the top collaborators with Indian institutions.\n\nWhile the Indian institutions, who’ve been involved with Saudi Arabia, are wide ranging such as the IITs, Council of Scientific and Industrial Research and the Delhi University, there’s been a significant increase in collaborations involving researchers at the Aligarh Muslim University and Jamia Millia Islamia and many Saudi Arabian universities.", 
    "section": "national", 
    "title": "Research tie-ups with Saudi Arabia growing", 
    "subsection": "general", 
    "date": "2016-03-16"
}