{
    "author": [], 
    "text": "Scientists discover new model to test the elusive material\n\nA continuing quest:It has been a constant but unfulfilled quest of mankind to trace the elusive dark matter\n\nScientists have proposed a new model for what the elusive dark matter might be and how the presence of this mysterious material can be tested.\n\nThough no one has ever seen it, and no one knows what it really is, indisputable physical calculations state that approximately 27 per cent of the universe is dark matter, researchers said.\n\nOnly five per cent is the matter of which all known materials consist, they said.\n\nSeveral types of devices have been put up on Earth and in space to capture particles that dark matter is supposed to consist of, and experiments have attempted to create the particle by colliding ordinary matter particles at very high temperatures.\n\nEven if such a collision succeeds, it would immediately pass on and fly away from detectors — but will take some energy with it, and this energy loss will be recorded and indicate that a dark particle was produced.\n\n“Maybe dark matter is of a different character and needs to be looked for in a different way,” said Martin Sloth, associate professor at the University of Denmark.\n\nDark matter is light and therefore interacts weakly with ordinary matter. This means that the particles are capable of being produced in colliders, researchers said.\n\nThis theory’s dark particles are called weakly-interacting massive particles, and are thought to have been created in an inconceivably large number shortly after the birth of the universe 13.7 billion years ago.\n\nResearchers call their version of such a heavy particle a PIDM particle (Planckian Interacting Dark Matter). In their new model, they calculated how the required number of PIDM particles could have been created in the early universe.\n\n“It was possible, if it was extremely hot. To be more precise the temperatures in the early universe must have been the highest possible in the Big Bang theory,” said Sloth.\n\n“If the universe indeed was as hot as calculated in our model, several gravitational waves from the childhood of universe would have been created. We might be able to find out in the near future,” he said. The study was published in the journal Physical Review Letters . — PTI", 
    "section": "national", 
    "title": "Scientists find new model to detect dark matter", 
    "subsection": "general", 
    "date": "2016-03-16"
}