{
    "author": [], 
    "text": "The batteries that power the ubiquitous devices of modern life are mostly made of toxic materials such as lithium.— File Photo\n\nMIT researchers have come up with an alternative system for generating electricity to power smartphones and computers that harnesses heat and uses no metals or toxic materials.\n\nThe batteries that power the ubiquitous devices of modern life are mostly made of toxic materials such as lithium that can be difficult to dispose of and have limited global supplies.\n\nThe new approach is based on a discovery announced in 2010 by MIT researchers — a wire made from tiny cylinders of carbon known as carbon nanotubes can produce an electrical current when it is progressively heated from one end to the other, for example by coating it with a combustible material and then lighting one end to let it burn like a fuse. But experiments at the time produced only a minuscule amount of current in a simple lab setup.\n\nIncreased efficiency\n\nNow, researchers have increased the efficiency of the process and produced devices that can put out power comparable to what can be produced by today’s best batteries. They caution, however, that it could take several years to develop the concept into a commercialisable product. Much of researchers’ work has focused on not just improving the efficiency of the process but also “developing the theory of how these things work.”\n\nThe latest experiment shows how good agreement between theory and experimental results, providing strong confirmation of the underlying mechanism, said Michael Strano from MIT.\n\nThe effect arises as a pulse of heat pushes electrons through the bundle of carbon nanotubes, carrying the electrons with it like a bunch of surfers riding a wave, researchers said.\n\nKey finding\n\nOne key finding that helped to verify the theory is that sometimes the wave of heat produces a single voltage, but sometimes it produces two different voltage regions at the same time, they said.\n\n“Our mathematical model can describe why that occurs,” said Strano, whereas alternative theories cannot account for this.\n\nAccording to researchers’ theory, the thermopower wave “divides into two different components,” which sometimes reinforce one another and sometimes counter each other.\n\nThe improvements in efficiency “brings [the technology] from a laboratory curiosity to being within striking distance of other portable energy technologies,” such as lithium-ion batteries or fuel cells, researchers said. — PTI", 
    "section": "national", 
    "title": "Sustainable alternative to power phones, computers", 
    "subsection": "general", 
    "date": "2016-03-16"
}