{
    "author": [
        "M K"
    ], 
    "text": "Only 36 prison inmates in the western region who are eligible to exercise their franchise have evinced interest in doing so for the Assembly elections.\n\nWhile a general opinion is that all prison inmates, be it remand convicts or under trials, could cast their vote, it is not the case.\n\nTop prison officers said that convicts and under trials cannot vote. Only persons detained under the Goondas Act and don’t have cases pending against them could caste their vote.\n\nThe central prisons in Coimbatore and Salem are the only prisons in this region were persons detained under Tamil Nadu Preventive Detention Act – commonly known as Goondas Act – could be lodged.\n\nOf the 1,749 inmates in the Coimbatore Central Prison (as on Tuesday), 1,002 were convicts, 616 are remand prisoners and under trials, 101 are Goondas Act detenus and 30 are women prisoners.\n\nOf the 101 Goondas Act detenus, 14 have evinced interest in casting their vote and given it in writing.\n\nThirteen of them are from Coimbatore and a prisoner from Erode.\n\nThe 828 inmates of the central prison in Salem included 456 remand prisoners, 134 convicts, 120 under trials and 118 Goondas Act detenus. Prison authorities said that 25 of these Goondas Act detenus eligible to cast their vote.\n\n“While three of them will get released before the election, we have identified 22 of them as eligible and interested in voting,” a prison officer said.\n\nOn reasons for very few prison inmates showing interest in exercising their franchise, prison officers said that it could be due to fear of being identified as prisoners by their relatives or neighbours when officers on election duty went to their house to verify the addresses.\n\nNames\n\nNames of eligible prisoners with the details furnished by them have been sent to the respective district election cell of the district where the inmate resides. On verifying the address and voter identity card, the election cell will approve those who can cast their vote. Eligible prisoners will cast their vote through postal ballots at the office of the Superintendent of Prison, on May 16.\n\nTop prison officers said that convicts and under trials cannot vote", 
    "section": "national", 
    "title": "36 prisoners in western region will get to vote in Assembly elections", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}