{
    "author": [
        "P V"
    ], 
    "text": "Bird houses adorn the porch of houses at Himagiri Homes in Vatsula layout in Hosur. The tranquil of this bird conservation project is suddenly being threatened by a resident bid to rent out his premises for erecting a cell phone tower.- Photo: N. Bashkaran\n\nA cardboard box stuffed with haystack adorns the porch of each house at Himagiri Homes here. The residents of this gated community, housing over 120 medium-income villas, wake up to the chirping of sparrows and other urban birds, carefully nurtured in the bird houses of each home at Vatsula layout on Alasanatham Road in Hosur.\n\nA conservation project to nurture sparrows and other birds that frequented the homes of yesteryears, in a semi-urban milieu such as here, now faces threat from a proposal to erect a cell phone tower within the campus of the gated community.\n\nToday, this tranquil neighbourhood sports a black flag and a banner announcing its protest against the action of a lone resident to rent out his premises for a cell phone tower.\n\nIncidentally, the resident Venkatesan, who has inked the agreement to let out his plot for cell phone tower erection, is an employee of a private firm that has invested in local communities for environment conservation and sparrow conservation here. The bird conservation project started by residents Hari Raj and Umawathi, had caught up across the sprawling 25-acre neighbourhood. Today, each bird house hosts nested eggs under the care of the mother birds. The duo, replenish each bird house with millets and water twice a day.\n\n“For us, it is a philosophy of living in harmony with nature; to waking up to the chirping of birds and the tranquillity of greenery,” says Mr. Hari Raj, a social media entrepreneur. This bird conservation project is slowing catching up with neighbouring layouts too. It is against this backdrop that the move by the resident to rent out his premises for erecting a cell phone tower for a leading service provider has triggered fears of radiation impact on birds and humans.\n\n“I am yet to see an environment conscious, nature loving people as the people of Himagiri Homes,” says a source. They may not know the species of each bird, but are conscious of bio-diversity and are fierce about guarding this biodiversity.\n\nHowever, when contacted, Subramani, the brother of the plot owner Venkatesan, says the opposition was at first not anticipated at the time of signing the contract. “Also, this is a corner house, and the radiation from the tower, is purportedly very minimal with least impact on humans. If the residents were concerned about birds, why wouldn’t they make efforts to set up a sanctuary,” says Mr. Subramani. According to him, now the decision was up to Indus Tower Limited that has signed the agreement for erecting the tower. “It’s up to them to erect or not erect the tower.”\n\nSpeaking to The Hindu , Franklin, the site association manager of Indus Tower Limited, Coimbatore, said it was a private agreement between the site owner and Indus Tower. “We only look at building stability, signal reception etc. There is no requirement for NOC or any other clearances.” The rental agreement is the same as one for a 2 BHK in a certain locality, says Mr.Franklin.\n\nThe once-ubiquitous home sparrow that chirped awake our dawns is fast dwindling in the urban landscape. In its wake, a neighbourhood has taken up a fight for survival of sparrows that they nurture – as a cell phone tower threatens this biodiversity.", 
    "section": "national", 
    "title": "A wake-up call to save sparrows", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}