{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Both parties are open to reviving the alliance but formal talks have not commenced yet\n\nIf the local leadership of the ruling All India NR Congress and the AIADMK is to be believed, a revival of ties between the two sworn rivals to jointly face the Assembly elections in the Union Territory is very much on the cards.\n\nThe last time the two parties came together was in the 2011 Assembly polls though the relationship ended in bitterness and acrimony. After the AINRC-AIADMK alliance romped home in the 2011 Assembly polls, AINRC president N. Rangasamy reneged on his promise of sharing power with the AIADMK and formed the government on his own by securing the support of an independent.\n\nAt that time, Tamil Nadu Chief Minister and AIADMK general secretary Ms. Jayalalithaa went to the extent of saying Mr. Rangasamy had backstabbed her party.\n\nSince then, the AIADMK leaders, Puducherry unit have been most vociferous in their attacks against the ruling party.\n\nRajya Sabha elections\n\nThough a revival of the AINRC-AIADMK ties was out of everyone’s calculations, the unforeseen happened during the Rajya Sabha elections when a crisis to the Government from a group of dissident MLAs prompted the AINRC to put behind the rivalry and approach the AIADMK.\n\nNot averse to ties\n\nAs a result, the AINRC fielded its nominee N. Gokulakrishnan as an AIADMK candidate and survived.\n\nAINRC sources say that Mr. Rangasamy is not averse to the idea of a revival of alliance with the AIADMK.\n\nA senior leader of AINRC who did not wish to be identified told The Hindu ,\n\n“Both sides are open to talks to revive the alliance. There are three options before the ruling AINRC; contesting alone, aligning with BJP (which lacks a strong local presence) or reviving the alliance with AIADMK.”\n\nThe AINRC leader also said an alliance with AIADMK had the advantage of being an effective counter to the Congress-DMK alliance.\n\nAvailabe options\n\n“At a time when when the Congress and the DMK have firmed up the alliance and are about to conclude the seat sharing talks in a week or two, the ruling AINRC and AIADMK have to contest alone or form alliance with each other,” he said. A senior leader of AIADMK says, “It is the wish of Puducherry Chief Minister to revive alliance between AIADMK and AINRC but no formal talk has commenced between us so far. It seems that he wanted more time as he is on a pilgrimage to temples.” According to sources in AINRC, there is no urgency to commence any talks between both parties as there is sufficient time ahead of polls.\n\nMeanwhile, after having darshan at Tirupati, Chief Minister Rangasamy might be recalling a similar visit in 2011 after he launched the AINRC as a break-away from the Congress.\n\nIn a brief interaction with reporters in Tirupati, Mr. Rangasamy said, “I worshipped the presiding deity here and captured power in the Union Territory with His blessings. With His blessings, I will come to power again.”\n\nOn forging alliances, Mr. Rangasamy said, “Lord Balaji will take of everything.”", 
    "section": "national", 
    "title": "AINRC, AIADMK may join hands", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}