{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Mention of an outer main-belt asteroid now brings to mind an endangered bird. It has been named after Akikiki, a critically endangered Hawaiian honeycreeper bird.\n\nThe credit for this goes to Prakash Vaithyanathan, a science teacher from the city. Mr. Vaithyanathan said he had written to the International Astronomical Union (IAU) suggesting that new planetary bodies and other objects in space could be named after endangered or extinct animals, birds and plants. “In class, I keep speaking to my students about endangered and extinct flora and fauna and also encourage them to give each other nicknames based on such species. Most new planetary bodies and other objects discovered in space are given complicated names through a scientific protocol of the IAU and I wrote to ask them if they could name objects in space in the manner,” he said.\n\nMr. Vaithyanathan wrote to them on May 29, 2015, and received a reply the same day from a database manager with the IAU stating that they would be interested in implementing his idea.\n\n“They contacted me again and asked me to suggest a name and I went with ‘Akikiki.’ The reason for choosing the name of the Hawaiian honeycreeper was because the IAU annual conference was happening in Hawaii in May,” Mr. Vaithyanathan said. Nearly ten months after his suggestion, the IAU implemented this and named an asteroid ‘Akikiki.’\n\nIn the small body database on the Jet Propulsion Laboratory website of the California Institute of Technology, credit for the name ‘7613 akikiki,’ assigned to an outer main-belt asteroid, is given to Mr. Vaithyanathan. It says: ‘name suggested by Indian high-school teacher P. Vaithyanathan, on the occasion of the 2015 IAU General Assembly.’", 
    "section": "national", 
    "title": "Asteroid named after endangered bird, thanks to Chennai teacher", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}