{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Textile sector, catering, fireworks units, event management firms are set to cash in on poll frenzy\n\nDealers selling campaign merchandise are gearing up with innovative products this time. A file picture of a shop selling party flags and festoons in Vellore.\n\nWith election work set to begin in the next few weeks, wholesalers, retailers and individuals involved in the goods and services industry are expecting their business to increase threefold.\n\nTextile sector, catering, fireworks industry, election merchandise and event management firms will see a rise in demand, starting next week. According to an event management team, the basic cost per political meeting involves Rs. 15-20 lakh. This includes the stage, decorations, audio sets, speakers, mikes, chairs, banners, coolers and airconditioners.\n\n“The LED displays that are put up during campaigns would cost between Rs 70,000 and a Rs. one lakh. This is for a 15x10 display.\n\nParties have a minimum of three such displays during a meeting,” said a board dealer at T Nagar.\n\nParties through their managers are also hunting for caterers. “Earlier, the trend used to be distributing biryani packets wrapped in leaf and newspapers. This time, we are looking at other food items that are packed in boxes and are easy to distribute,” said one of the managers of a party, who has been assigned to get quotations from restaurants and individual caterers across the city.\n\nAt the textile hub of India, Tirupur, textile firms are busy readying T-shirts and flags of various parties. Handkerchiefs and colourful bandanas are ready to be dispatched to various centres from next week.\n\nG Abiruben, president of Tamil Nadu Fireworks and Amorces Manufacturers’ Association (TANFAMA), said, “Our industry will see a sales spurt only when the results are announced. During the celebrations parties opt for ‘Sara Vedi’ (crackers). The price starts at Rs. 5,000 and goes up to several thousands,” he added.\n\nInnovative products\n\nMeanwhile, wholesalers selling campaign merchandise are gearing up with innovative products. Parry’s Corner is abuzz with enquires from parties. “Orders and enquires have started pouring in. But no actual sale has happened. Parties through their managers have asked for quotation and pricing details,” said a wholesaler, who has a shop on Malayaperumal Street.\n\nRaja, who works in one of the shop’s at Parry’s said, “With mercury rising there have been enquiries on customised caps, sleeveless T-shirts for men and hand fans.”\n\nBut Raja feels enquiries have not been promising. “These days you get all these products everywhere. Ten years back Parry’s was the only place where one could source these items,” he said.\n\nFrom sarees, dhotis, stickers, mugs, shawls, key chains to post cards, everything is getting ready. Based on trends from the 2011 elections, wholesalers expect orders worth several lakhs from each party. Most of these orders are in bulk and the bill value is nothing less than Rs 10 lakh. Small retail shops which sell party merchandise also source it from the shops in Parry’s.\n\n51-year-old Ezhil KA Ezhumalai, a vendor selling AIADMK merchandise outside the party headquarters at Royapettah for the last 28 years, said, “On a normal day, I sell products worth Rs. 5,000 and on some days it even goes up to Rs. 20,000. During campaign times the sales increase twofold.”\n\nRajathi from Panruti, Cuddalore district, who has a shop right next to Ezhumalai, said, “She has got DVDs with new songs for this campaign season.” Rajathi who makes around Rs. 2,000 per day expects her sales to shoot up in the coming days.", 
    "section": "national", 
    "title": "Boom time for election merchandise, services", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}