{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students taking out a rally at Chinnalapatti near Dindigul on Tuesday to create awareness of the importance of voting.— PHOTO: G. Karthikeyan\n\nA total of 117 polling stations with low voter turnout have been identified in the seven Assembly constituencies in the district, according to Collector T.N. Hariharan.\n\nKick-starting an awareness campaign here on Tuesday, he said that district officials have started concentrating on these polling stations by conducting awareness campaigns, door-to-door campaigns and distribution of pamphlets to improve voter turnout in these areas.\n\nBanners would be displayed and awareness rallies taken out in these localities to draw the attention of voters. Special attention was being given to women voters in these areas.\n\nCampaign was intensified at Chinnalapatti town panchayat as voter turnout was less in several polling stations in the Athoor constituency. “Our aim was to achieve cent per cent polling in all the seven constituencies. Voters signed the forms issued by officials assuring that they would vote without fail in the Assembly election. Already, officials had intensified the campaign at Chennamanaickenpatti and Velvarkottai.\n\nTheni\n\nDistrict election officials were advised to erect mega banners at places of public congregation like markets, marriage halls, cinema theatres, community halls and bus stands in rural and urban areas. Local cable TVs would also be utilised to propagate the importance of voting and democratic rights of the voter, said Collector N. Venkatachalam.\n\nEven loud speaker-fitted vehicles could be used to campaign in interior villages and awareness pamphlets distributed. Special teams had been constituted to follow complaints registered through internet, telephone and mobile phones at the control room, he added.\n\nLater, Mr. Venkatachalam distributed pamphlets at Bodi bus stand and motivated the voters to sign on a big sign board erected near the bus stand after taking an oath to cast their vote in the Assembly poll.\n\nHe also inspected the surveillance work of a special squad at Kodangipatti village.", 
    "section": "national", 
    "title": "Campaign to improve voter turnout in 117 polling stations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}