{
    "author": [], 
    "text": "RELIGION\n\nRamayanam : Navalpakkam Narasimhan, Visranthi Mudhiyor Illam, M.G.R. Road, Palavakkam, 3.30 p.m.,; R. Krishnamurthy, Sri Sankara Gurukulam, C.P. Ramaswamy Street, Abhiramapuram, 6.45 p.m.\n\nGita: Swamini Satyavratananda Saraswati, Mylapore Club, Luz Church Road, Mylapore, 11 a.m.,; Swami Omkarananda, Narada Gana Sabha, TTK Road, Alwarpet, 6.30 p.m.\n\nJeevan Mukti Vivekam: K. S. Maheswaran, Sri Sankara Gurukulam, C.P. Ramaswamy Street, Abhiramapuram, 5 p.m.\n\nVedanta Treatise: R. Aravindan, ‘C’ Flat, Harmony (Second Floor), 20/39, Venkatarathinam Nagar, Adyar, 6.45 p.m.\n\nSri Chaitanya: Swami Gautamananda, Sri Ramakrishna Math, Mylapore, 7 p.m.\n\nCULTURE\n\nSri Kanchi Kamakoti Peetadhipathi Jagadguru: Sri Jayendra Saraswathi Swamigal Sahasra Chandra Tharisanam, Kamarajar Arangam, Teynampet, 5 p.m.\n\nGENERAL\n\nGovernment of India Ministry of Earth Sciences India Meteorological Department, Regional Meteorological Centre, Chennai: World Meteorological Day Celebrations -2016, College Road, Nungambakkam, 3 p.m.\n\nPan IIT Leadership Series and IIT Alumni Industry Interaction Center, Chennai: ‘innoWAH’, an innovation challenge competition, IITM Research Park, Kanagam Road, Taramani, 10 a.m.\n\nPublic Expenditure Round Table: Dr. K. Venkatraman Memorial Lecture, ‘Indian Budget in the Context of Global Economic Scenario’, Madras School of Economics, Kotturpuram, 3 p.m.\n\nUniversity of Madras Department of Indian History: Centenary Celebrations – A two-day National Conference on ‘Socio-Cultural Transformation in 20{+t}{+h}Century South India’, Chepauk, 10 a.m..\n\nVelammal Engineering College: Department of Library and Information Science and Department of Management Science: A seminar on ‘Higher Education Opportunities in Abroad (GRE / GMAT)’, Surapet, 4.15 p.m..\n\nDharmamurthi Rao Bahadur Calavala Cunnan Chetty’s Higher Secondary School : 125{+t}{+h}School Annual Day Celebrations’, Perambur, 4 p.m..\n\nNarcotics Anonymous: Meetings: Staying Clean Group, St. Lourdes Church Premises, Don Bosco School, Paper Mills Road, Perambur, 7 p.m.\n\nAl-Anon : Meetings: Kondithope Al Anon Group, Police Community Hall, Wall Tax Road, Kondithope; Feel and Heal-Al-Anon Group, Ambedkar Mandram (Opposite Women’s Police Station), Ashok Nagar; Blossom Buds Group, The Lady of the Light Church (Behind St. Isabel’s Hospital), Luz, Mylapore; Shrine of Divine Mercy Church, Anna Nagar East (Near Chinthamani); Vazhikatti Al-Anon Group, St. Andrews Church, NR. Market, Gandhi Road, Guduvancherry, Al-Anon Group, Jacob Matriculation School, First Street, Judges Colony, Peria Kuppam, Thiruvallur, 7 p.m.\n\nAlcoholics Anonymous: Meetings : Loyola Matriculation School, United India Colony, Kodambakkam; St. Luks Church (Opposite Blue Star), Second Main Road, Anna Nagar; Anglo Indian Association(Opposite Albert Theatre), Ponniyamman Koil Street, Egmore,; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Road (Near Tansi Nagar), Velachery; Kondithope Community Centre, Police Quarters (Near Padmanaba Theatre), Wall Tax Road; St.. Mathias Church, Kamarajar Salai, K.K. Nagar, C.S.I. Church (Near Shanmuga Theatre), Moolakadai; Lady of Light Church, Luz Church Road, Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}