{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Such details will help investigating agencies”\n\nV. Suresh, Technical Director, Immigration, Visa and Foreigners Registration and Tracking, addressing a meeting of lodge owners in Madurai on Tuesday.— Photo: G. Moorthy.\n\nProvision of details of stay of foreigners by owners of lodges, hotels, ashrams and those running paying guest accommodation facilities had a significant role in national security, said V. Suresh, Technical Director, Immigration, Visa and Foreigners Registration and Tracking.\n\nAddressing at a workshop for those running hotels, lodges, paying guest accommodation facilities here on Tuesday, he said that such details would help investigating agencies. “This will also give a fair detail about the foreigners returning to the country,” he said.\n\nStating that it was the duty of those giving accommodation to foreigners to provide their details through the online system, he said. Violation on this aspect would come out when the foreigners provided details of their stay before leaving the country.\n\nBabies included\n\n“Details of every single member of the visiting groups of foreigners, including babies, should be intimated,” he said.\n\nHe asked the educational institutions to provide to the officials details of academic performance and attendance of the students from abroad.\n\n“Mere profile of the foreign students will not be enough. All the details of the foreigners will have a different purpose for the investigating agencies,” he said.\n\nSimilarly, changing of courses by the students and details of overstaying students should also be intimated.\n\nDeputy Commissioner of Police (Law and Order) Bandi Gangadhar urged the accommodation providers to register themselves at the online portal of the Foreign Registration Office.\n\n“Failure to comply with these instructions will be viewed seriously by the Ministry of Home Affairs,” he said.\n\nDirector, IVFRT, A. Ravikumar, explained the new features and developments of the online immigration system.", 
    "section": "national", 
    "title": "“Details of foreigners’ stay vital for national security”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}