{
    "author": [], 
    "text": "SALEM\n\nSri Ayyappan Bajanai Mandali Annadhana Trust: Panguni Uthiram festival from 6 a.m. ISKCON: Sri Gaura Purnima from 6 p.m. Dhirajlal Gandhi College of Technology: Annual sports day, N. Thirumal Alagu, Deputy SP, Omalur, chief guest, P. Vimalan, Chairman, CII Salem, guest of honour, 9.30 a.m. Annual Day, Hemal Gopal, Vice President, TCS, Chennai, chief guest, S. Mohan, president, MMA, and K. Anil, Chief Regional Manager, Indian Overseas Bank, speak,5.15 p.m.\n\nShri Sakthikailash Women’s College: Achievers Day, K. Rahavendran, senior vice president and Global Head-HR, Infosys BPO, and R. Venkatachalapathy, Professor, Department of Geology, Periyar University, and others speak, 10 a.m.\n\nKnowledge Institute of Technology: Department of Placement and Training, Cambridge felicitation ceremony, Bro. Varghese J. Koonammave, Principal, Montfort School, Yercaud, chief guest, 2 p.m.\n\nGovernment College of Engineering: Annual Sports Day, P. A. Arul Mani, state president, Sports Cell, chief guest, K. S. Mohamed Nizamuddin, former international athlete and national athletic coach, guest of honour, 2 p.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Thangam Pattu Maaligai showroom, 10 a.m. to\n\n8 p.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nDistrict Employment Exchange: Training programme for the Staff Selection Commission aspirants,\n\n10 a.m.\n\nMuslim Youth Federation: Zikr majlis, Mettu street, 9 p.m.\n\nNAMAKKAL\n\nMahendra Institute of Engineering and Technology: Department of Mechanical Engineering, national level workshop on ‘finite element methods and its applications’, N. Ravikumar of Dr. B. S. Abdur Rahman University, Chennai, resource person, 9.30 a.m.\n\nPGP College of Nursing and Research: Seminar on tuberculosis, Ganapathi, Joint Director, District TB Prevention Centre, resource person, 2.30 p.m.\n\nPaavai Arts and Science College for Women: Campus recruitment drive by Matrix Business Services India Private Limited, 9.30 a.m.\n\nGnanamani College of Technology: National conference on ‘emerging trends in engineering and technology’, M. Mathirajan, Chief Research Scientist, Indian Institute of Science, Bengaluru, chief guest, 10 a.m.\n\nGnanamani Educational Institutions: Campus recruitment drive by Tech Mahindra Private Limited, Chennai and Intelenet Global Services, Chyennai, 10 a.m.\n\nAnnai Mathammal Shella Engineering College, Erumapatti: National level conference on ‘recent trends in civil and mechanical engineering’, 10 a.m.\n\nPaavai Educational Institutions: Youth Red Cross, blood donation camp, 9.30 a.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Cooptex showroom, 10 a.m. to 8 p.m.\n\nTIRUCHENGODE\n\nSengunthar Engineering College: Department of CSE, national level workshop on ‘AVA and its applications’, Rajendran, founder and CEO, Silicon Software Services, Madurai, chief guest, 9.30 a.m.\n\nRASIPURAM\n\nMuthayammal College of Engineering: Department of Electrical and Electronics Engineering, national level technical symposium, M. Ravichandran, Assistant Executive Engineer, Control and Instrumentation, Mettur Thermal Power Station, chief guest, 10 a.m.\n\nERODE\n\nM.P. Nachimuthu M. Jaganathan Engineering College: ISRO-sponsored National-level seminar on 'Recent Trends in Satellite Communication', 9.30 a.m.\n\nVelalar College of Engineering and Technology: Workshop on 'Body Language and Etiquette During Job Interview', 2.30 p.m.\n\nNandha College of Technology: National-level Technical Symposium by Department of Civil Engineering, 9.30 a.m.\n\nErode Sengunthar Engineering College: Lecture on 'Finite Element Analysis', 9.30 a.m.; lecture on 'Vedic Maths', 10.00 a.m.; knowledge-sharing session on 'Advancement in CAE and Testing Methods in Automobile Industry', 4.30 p.m.; Full-moon Day celebrations 'Thol Paavai Kootthu', 6.30 p.m.\n\nEBET Group of Institutions: LEAF '16 - Intra-Departmental Technical Treat by Department of Electrical and Electronics Engineering, 10.00 a.m.; on-campus drive by M/s Alpha Associates, Coimbatore, 9.00 a.m.\n\nSri Vasavi College (Self-Finance Wing): National Symposium on 'Study of Qualitative and Quantitative Research in Library and Information Science', 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}