{
    "author": [], 
    "text": "The Madras High Court on Tuesday refused to stay a batch of notifications issued by the Union Ministry of Health banning the sale and manufacture of 344 Fixed Dose Combination (FDC) drugs.\n\nHowever, the First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh provided a limited protection to pharmaceutical companies by directing that no coercive steps shall be initiated against manufacturers, stockists and agents with regard to stock already manufactured.\n\nThe Federation of South Indian Pharmaceutical Manufacturers Association (FOSIPMA) moved the High Court contending that the Central government has issued the notifications dated March 3 banning 344 FDC drugs which were on sale for many years on the ground that the drugs had no therapeutic justification. The federation claimed that the government has acted unilaterally and arbitrarily without complying with the process of natural justice.\n\nEfficacy of drugs established: petitioner\n\n“The banned drugs have been sold for over decades under licences granted by the Central/ State licensing authorities. The medical efficacy and the therapeutic value of the drugs have been well documented and have been clearly established,” the petitioner said.\n\nPointing out that the Delhi High Court has granted interim stay on several notifications, the petitioner pleaded for an interim stay from the court and a direction to restrain the authorities concerned from taking any coercive action against them by enforcing the notifications.\n\nWhen the plea came up for hearing, the Bench said, “We respectfully disagree with the view of the Delhi High Court. We are not inclined to pass an all-encompassing order.”\n\nThe Bench also added that the mere fact that the sale of medicines was allowed for so many years cannot call for the sale to continue when an expert body has gone into this issue.\n\nNoting that the contention whether all procedural formalities have been followed or not while issuing the notifications, as also the provisions of the statute would be examined in the course of the proceedings, the judges added, “We are not dealing with a perishable commodity. There is a shelf life. Further, the larger public interest would weigh in favour of not staying the effect of the notification.”\n\nThe Centre’s contention was that the drugs had no therapeutic justification", 
    "section": "national", 
    "title": "HC refuses to stay ban on sale of 344 FDC drugs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}