{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Expressing shock over an unholy nexus between doctors and businessmen in having reportedly placed expired stents in coronary arteries of poor patients covered under Chief Minister’s Comprehensive Health Insurance Scheme (CMCHIS), the Madras High Court Bench here on Tuesday refused advance bail to two doctors based here.\n\nJustice P.N. Prakash said his conscience stood in the way of granting anticipatory bail to cardiologist R.A. Janarthanan and oncologist P. Saravanan who was also the promoter of Saravana Hospital, authorised to treat patients under the CMCHIS, here besides being a film actor and a politician known for shifting allegiance from one party to another at frequent intervals.\n\nAgreeing with Additional Advocate General K. Chellapandian that there were sufficient incriminating materials against the two absconding doctors, the judge said the petitioners “are medical professionals to whom patients surrender their body, mind and soul on the altar of the operation theatre. They have acted in utter disregard of the sacred Hippocratic Oath”. “This is indeed a textbook case for demonstrating how a laudable social welfare scheme launched by the government for the poor and the needy can become a milch cow for satiating the greed of ingenuous entrepreneurs and immoral professionals.”\n\nOn the submission of petitioners’ counsel that Dr. Saravanan was also a philanthropist and ran a charitable trust, through which he served the poor and the needy, the judge said: “This court does not want to comment on this except saying that Robinhoods have no place in a republican democracy governed by the rule of law.” He, however, granted conditional anticipatory bail to three employees of Saravana Hospital after observing that “they were mere cat’s paws” of the two doctors and their life would be spoiled if the police arrested them.\n\nThe judge also sympathised with the patients who had been carrying the expired stents in their arteries. According to the prosecution, the use of expired stents in the hospital came to light on May 14, 2015 during a surprise inspection carried out by a private firm engaged by United India Insurance Company to oversee implementation of the CMCHIS in private hospitals. Subsequent police investigation revealed the nexus between the doctors and suppliers.\n\nThe judge said his conscience stood in the way of granting anticipatory bail to the two doctors", 
    "section": "national", 
    "title": "HC shocked over use of expired stents", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}