{
    "author": [
        "Aditi R"
    ], 
    "text": "Study finds that 94 per cent of the homeless in city live on the streets\n\nTwo days ago, 60-year-old Sivakumar, a blind homeless man living near Egmore railway station, entered the station to use the washroom.\n\nHe was beaten up and pushed away by the police officials manning the platform.\n\n“We can’t use their washrooms as we are not passengers. But we find a way to sneak in, as we have no other place to go to,” said Sivakumar.\n\nAround 42 families live on the pavement near the Egmore station, while there is pay-and-use public convenience, most use the open tracks or pay Rs. 30 or Rs. 100 and sneak inside the station to use the toilet and take a bath.\n\n“It depends on why we need to use the toilets, if we want to use it for a longer time we have to pay Rs 100, or if any police official spots us we will be fined Rs. 500,” said Soundarya, a flower seller who has been living on the tracks with other families for over 20 years.\n\n“The public toilet here is in a very bad state, the women’s toilet has been shut for months now. Nothing has changed over the years, we continue to live in hell, in terms of both sanitation and safety,” said Navodaya, another pavement dweller.\n\nWhile the Greater Chennai Corporation is coming up with 20 additional shelters for the homeless, in addition to the existing 31, a permanent solution is what these families seek. “These are just temporary accommodations; if allotted a proper house we will be able to live a lot better and without fear,” said Navodaya.\n\nA study, conducted by the Information and Resource Centre for the Deprived Urban Communities last year, reveals that 94 per cent of the homeless in Chennai live on the streets as families and 72 per cent of them have been living on the streets for over 30 years.\n\nWhile discussions with the people have revealed that they required housing, there was no provision to rehabilitate the homeless in any such facility as they do not come under the Tamil Nadu Slum Areas (Improvement and Clearance) Act, 1971.\n\n“These are vulnerable communities who have lived here since generations, they need to be provided with proper documents and housing facility like other slum dwellers. Else, they will continue to live a precarious life,” said Vanessa Peter, Policy Researcher at IRCDUC.\n\n“There is no State guidelines on providing housing for them as many are migrant workers,” said a senior official of the Greater Chennai Corporation.\n\n“They must make use of the shelters at night and get a job to take care of their living, houses are only built for slum dwellers,” he added.\n\nThere is no provision to rehabilitate them as they are not under the ambit of law", 
    "section": "national", 
    "title": "Homeless struggle to access sanitation facilities", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}