{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "RELIGION\n\nRathina Vinayakar Temple: Panguni Uthiram – special poojas and alankaram, temple premises, DB Road, R.S. Puram, 7.30 a.m.\n\nKannanur Mariamman and Kundathu Kaliamman Temple: Special pujas, temple premises, Pappanaickenpalayam, 7.00 a.m. onwards\n\nSri Sidhi Vinayakar Temple: Special pujas and Samvatsra Abishegam, Krishna Colony – Mani Rajanna Gardens, 6 a.m.\n\nCULTURE\n\nKasthuri Sreenivasan Trust: Realctions – Coimbatore Artistes Meet 2016, inauguration by S. Murali, Managing Director of Ashwinram Spinning Mills Private Limited, Art gallery premises, Avanashi Road, 10 p.m.\n\nHindusthan College of Arts and Science – VISCOM Department: Bimbam 2016 – Short Film Festival, college premises, 10.30 a.m., award ceremony 3.30 p.m.\n\nIndian Chamber of Commerce and Industry and OSAI: World Forest Day – Special Enviro Meet, K. Sankar, Director of SACON speaks on Tiger Forest, screening of Shekar Dattatri’s film – “Save our Sholas”, Chamber Towers, Avanashi Road, 6 p.m.\n\nCoimbatore Bar Association: Unveiling of the portrait of Senior Lawyer Late V. Mayilsamy, Supreme Court Judge Justice C. Nagappan and High Court Judge Justice K. Kalyanasundaram take part, SNR College auditorium, 6 p.m.\n\nCentral Industrial Security Force: Motivational Talk by Narain Karthikeyan, Airport premises, 3 p.m.\n\nKG Blood Bank: 35{+t}{+h}anniversary, Corporation Commissioner K. Vijayakarthikeyan takes part, 10 a.m.\n\nSri Ramakrishna Engineering College: National Level Robotic championship Robotron 2K16, EC Conference Hall, 10.30 a.m.; workshop on Business Decision Making, Conference Hall, MBA Block,\n\n10.30 a.m.\n\nSNS College of Technology: International Conference on Mechanical and Budding Sciences: 10 a.m.\n\nBragathi Hospital: Special Arthritis Clinic, Sidhapudur, 2 p.m.\n\nDhanalakshmi Srinivasan College of Engineering: 2{+n}{+d}National Conference on Recent Trends in Science and Technology, 10 a.m.\n\nThe Institution of Engineers: V. Ramakrishnan Endowment Lecture, D Block, Conference Hall, PSG College of Tech, 6.30 p.m.\n\nPark College of Engineering and Technology: State level inter-college Mobile Appathon 2916, 9.30 a.m.\n\nGlobal Hub and SNR College: Global Education Expo, 10 a.m.\n\nVLB Janakiammal College of Arts and Science: National Conference on evolution of computer science and information technology, 10 a.m.\n\nTejaa Shakthi Institute of Technology for Women: Annual & Sports Day, Seminar Hall, 10.30 a.m.\n\nTIRUPUR\n\nJay Shriram Group of Institutions: Conference on civil engineering, 9.30 a.m.\n\nUDUMALPET\n\nVidyasagar College of Arts and Science: College day celebrations,\n\n3 p.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}