{
    "author": [
        "M K"
    ], 
    "text": "Kausalya, widow of the slain Dalit youth V. Shankar, is steadily recovering from the injury she suffered on the head when an attempt was made on their lives near Udumalpet bus stand on March 12. Hospital sources hinted that she could be discharged before the weekend.\n\nThe 36 stitches on her forehead following the attack would be removed on Wednesday. “We will check if she develops puss or infection on removal of the sutures,” a senior doctor in Coimbatore Medical College Hospital (CMCH), where she is getting treated, said. Tests so far have not shown any impact on the brain.\n\nDoctors said that she was cooperating for counselling, but is under observation as she is disturbed after being an eyewitness to the brutal murder of her husband. The doctor said that there was no need for her to remain in the intensive care unit on medical grounds. However, she was still there under police protection as it was the safest place where police could guard her better. While police are already guarding Shankar’s family, a senior police officer here said that security will be provided for Kausalya after she is discharged.\n\nMeanwhile, Shankar’s family at Kumaralingam village near Udumalpet in Tirupur District is awaiting Kausalya’s arrival. “Knowing what her relative’s have done we cannot take the risk of sending her with them. We will continue treating her as one among us. We would like to know her expectations, help her continue studies and fulfil her expectations,” a family member told The Hindu over phone.\n\nSo far only a girl (Shankar’s cousin) was allowed to meet Kausalya, last Thursday. While police denied permission to her and her husband’s family on security grounds, her in-laws approached revenue officials to allow them to see her in the hospital, on Monday and Tuesday. But they could not as she had to be taken to Palladam Court and Coimbatore Central Prison for legal proceedings.\n\nOn Tuesday morning, Kausalya was taken from the CMCH to the central prison for an identification parade to identify those involved in the attack. Accompanied by an emergency technician, she was taken to the prison in an ambulance. Police sources said that the parade went on for nearly three hours from 11 a.m. in the presence of the Judicial Magistrate of Udumalpet R. Srividhya.\n\nOne more held\n\nMeanwhile, a special team on Tuesday arrested one more accused in connection with the case. Police sources told The Hindu that Kausalya’s uncle Pandi Durai (51) was arrested in Dindigul and brought to Udumalpet.\n\nPrior to this, the police arrested five accused and two others surrendered in court.\n\nMeanwhile, a special team headed by Deputy Superintendent of Police (Udumalpet) Vivekanandan had started inquiring Kausalya’s father Chinnasamy in Udumalpet.\n\nChinnasamy, who surrendered before a magistrate at Nilakottai in Dindigul district last week, was given seven-days police custody by a magistrate court at Udumalpet on Monday.", 
    "section": "national", 
    "title": "Kausalya recovering, may be discharged by weekend", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}