{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Panguni Uthiram puja, Railway Colony, 6.30 p.m.\n\nKallazhagar Temple: Sundararaja Perumal tirukkalyanam festival; tirukkalyanam, Naicker Tirumana Mandapam, 11.15 a.m.; procession of deities, Alagarkoil, 7 p.m.\n\nDandayuthapaniswamy Temple: Panguni Uthiram festival; Skanda homam, 5 a.m.; Rudra japam, 6 a.m.; pookoodaram, 4 p.m.; procession of deity, Masi Streets, 7 p.m.\n\nMuneeswarar Temple: Masi festival; devotional music by T. M. Chandrasekar, Munsif Court Road, Tirumangalam, 9 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nChinmaya Mission: Discourse on ‘Bhagavad Gita’ by Swami Sivayogananda, Sri Kanchi Kamakoti Mutt, Besant Road, Chokkikulam, 6.45 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nInternational Society for Krishna Consciousness: Goura Poornima festival, 12/37 Maninagaram Main Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMannar Thirumalai Naicker College: 42{+n}{+d}College Day; V. Nandakumar, Joint Commissioner of Income Tax, addresses; S. Rajagopal, vice-president, presides, Lakshmi Ammal-Veerappa Naicker Auditorium, 10 a.m.\n\nSaraswathi Narayanan College: NSS Camp, Kombadi, 10 a.m.\n\nYadava College: M. Nallakaman, NSS Coordinator (in charge), Madurai Kamaraj University, inaugurates NSS camp; S. Dhanasekaran, Principal (in charge), Alagarkoil, 4 p.m.\n\nK. L. N. College of Information Technology: V. G. Idichandy, Professor, Department of Ocean Engineering, Indian Institute of Technology-Madras, inaugurates national conference; K. N. K. Karthik, president, presides, Pottapalayam, 10 a.m.\n\nVelammal College of Engineering and Technology: Inauguration of ICI students’ chapter by S. Ratnavel, chairman, ICI, Madurai centre; S. Viswanathan presides, Viraganoor, 2 p.m.\n\nFatima Michael College of Engineering and Technology: Seventh Annual Day; B. Ajay Rathnam speaks, M. Stalin Arockiaraj, chairman, presides, Sivaganga Road, 10 a.m.\n\nM. S. Chellamuthu Trust and Research Foundation: K. S. P. Janardhan Babu speaks on “Developing family psycho education modules,” 662 K. K. Nagar, 8.30 a.m.\n\nVidiyal: 13{+t}{+h}Annual Day; Ayyappan speaks, Vidiyal Nursery School, 21 Kennet Nagra, Muthupatti, 4 p.m.\n\nLady Doak College: World Social Work Day celebration, 10 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Dheep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}