{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Surface level of the four stations on Anna Salai completed; work on next level to be taken up\n\nAfter months now, Chennai Metro Rail work along Anna Salai seems to start making some progress, with work on construction of stations from AG-DMS to Saidapet expected to be taken up soon.\n\nThe work on the construction of four stations — AG-DMS, Teynampet, Nandanam and Saidapet— started in December last year and the contractor L&T has been in the process of completing various levels like surface, platform and concourse, inside the stations.\n\nOver a year to complete\n\nAccording to officials of Chennai Metro Rail Limited (CMRL), the surface level of the stations has been completed and the work on the next level will be taken up.\n\n“We hope to complete the work as soon as possible,” an official said.\n\nBut commuters have to grapple with traffic on this stretch for another one-and-half years for it may take that long for the work to be complete.\n\nThis construction of underground stations along Anna Salai has run into several problems ever since it began.\n\nInitially, Gammon India and Russian firm Mosmetrostroy were awarded a contract for Rs. 1, 947 crore for the construction of seven underground stations along Anna Salai.\n\nBut CMRL had issued show cause notices during the course of the project for the delay in completing the work.\n\nBut Mosmetrostroy suddenly abandoned the project in May last year owing to a severe financial crunch.\n\nA few months later, CMRL terminated the contract of Gammon India too for its failure to keep up the deadlines.\n\nChennai Metro Rail floated fresh tenders for this project dividing it into two stretches — one from AG-DMS to Saidapet and Government Estate to AG-DMS.\n\nThough Afcons Infrastructure Limited completed tunnelling work and L&T subsequently took up station work for the stretch between AG-DMS to Saidapet, CMRL is yet to award a contract for the other stretch due to various reasons.", 
    "section": "national", 
    "title": "Metro work chugs along steadily", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}