{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district official machinery is gearing up to create awareness among the fresh voters and common people on casting votes through the electronic voting machines (EVMs).\n\nA team of poll staff visited various villages in Omalur Assembly constituency on Monday and explained the functioning of EVMs and imparted training to them in casting votes. They were informed about the procedures to be followed for ensuring that their votes had been properly cast.\n\nAt the Tholasampatti weekly santhai, a large number of rural people evinced interest in gaining information on the functioning of the EVMs. The people were imparted training in casting their votes. The officials also clarified the doubts raised by the public.\n\nOfficial sources said that teams will visit the weekly markets and also the venues which attract crowds to create awareness on the EVMs till the elections, the sources added.\n\nMeanwhile, a mock polling exercise was conducted at the Vivekanandha College of Arts and Science for Girls near Sankagiri for the benefit of the fresh voters recently.\n\nThe authorities have taken steps for enrolling college students as fresh voters by conducting special camps. As such, training is also given to them on casting their votes in the EVMs.\n\nA model polling station was set up on the college premises with the poll officials and polling agents. More than 1,000 students of the college cast their votes at the mock polling exercise.\n\nC. Paul Princely Rajkumar, Revenue Divisional Officer and Returning Officer of the Sankagiri constituency, explained the procedures to be followed at the polling station for exercising their franchise. He called upon the college students to take part in the democratic process and extend a helping hand to the authorities to ensure cent per cent poll percentage.\n\nRajendran, Principal of the college and other officials were present.", 
    "section": "national", 
    "title": "Mock poll conducted for benefit of voters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}