{
    "author": [
        "Special Correspondent"
    ], 
    "text": "List of roads to be sent to Ministry of Road Transport and Highways\n\nSathy Road in Erode district is among the roads likely to be handed over to the NHAI.— File Photo\n\nA total of 693 km of State Highways will be handed over to the National Highways Authority of India (NHAI) for upgrading. The list of roads is ready and expected to be forwarded to the Ministry of Road Transport and Highways (MORT) soon, said a source in the Highways Department.\n\nUsually, roads that have a high volume of traffic, that are lengthy and that will have economic viability if widened are handed over to the NHAI. “The assets of the road, including space on the sides, trees, bridges, culverts and drains, are also transferred,” explained the official.\n\nSuch a transfer would be favourable for the State as it would bring down maintenance costs and the roads would get upgraded, said a former engineer.\n\nThe roads that have been chosen include the SH 4: Arcot–Villupuram road (114 km), SH 15: Ooty-Kottagiri-Mettupalayam-Sathy Road (161 km), SH 17: Malur-Hosur-Adhiyamankottai Road (103 km) and the 248 km long SH 29: Tanjore-Pattukottai-Paramakudi-Kayalkudi road that runs through four districts of Tanjore, Pudukottai, Sivagangai and Ramnad.\n\nA total of 5,004 km of National Highways run through the State, of which 1,998 km of roads are maintained by the National Highways Wing of the State Highways Department with funds from the MORT. The remaining 3,006 km are maintained by the NHAI, which develops the road by widening them into two-lane, four-lane or six-lane facilities.\n\nThe total length of State Highways in Tamil Nadu is 11,752 km.\n\nRoads classified as State Highways usually have a minimum carriageway width of 7 metre (double lane) and a right of way of minimum 30 m. The process of transfer takes about a year and upgrading to National Highways standards takes more time.\n\nHowever, for the ordinary motorist handing over the road also means that a toll could be introduced and they would have to pay for using the road.\n\n“In many cases even roads with just two-lanes are with the NHAI. In some places, despite widening not being completed toll is collected. There are roads where the contractor has exited the contract or excess fee is charged,” said K. T. Easwaran, who travels frequently.", 
    "section": "national", 
    "title": "NHAI to upgrade 693 km of highways in State", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}