{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CSR initiative to help them supplement their family income\n\nS.K. Acharya, NLC CMD, presents certificate to a beneficiary who underwent training in trade skills at NLC.— Photo: Special Arrangement\n\nUnder an initiative to strengthen their capabilities and empower marginalised women, Neyveli Lignite Corporation (NLC) launched a ‘Women Empowerment Centre’ on Tuesday.\n\nThe facility set up under the auspices of the NLC’s CSR Cell was opened by Sarat Kumar Acharya, CMD, NLC and Yogamaya Acharya, president, Neyveli Ladies Club.\n\nOn the occasion, Mr. Acharya said the centre had been set up to help women increase their employment opportunities and supplement family incomes.\n\nEmpowering women not only helps their families but also their communities and the country at large.\n\n“If we add skill to manpower to enhance value addition it would provide higher earnings capability and help them in all walks of life,” he said. Ms. Acharya in her address underscored the view that genuine empowerment of women comes when they are educated and gain self reliance. Education is the only means which provides knowledge, skills and self-confidence to aid in the development process, she added.\n\nS.Sridhar, CGM, PR& CSR, welcomed the initiative under the NLC CSR Cell which organises various initiatives to reach out to the weaker and more vulnerable sections such as women and children, the illiterate and unemployed in society.\n\nThe cell has organised training programmes in trades such as tailoring, beautician, computer, light motor vehicle driving free of cost. During the current year, 266 women have been trained at an expenditure of Rs.14.22 lakh.\n\nLater, the CMD, Functional Directors and Neyveli Ladies Club patrons presented certificates to beneficiaries who underwent training in various trades.\n\nWomen’s empowerment was also the theme of NLC’s International Women’s Day celebrations a couple of days ago where the NLC chief had stated that women possessed all potential abilities to change their own status and compete with anyone in society.\n\nSaundarya Rajesh, President, Avtar Career Creators and R. Maya, Director, Genlite Engineering Pvt. Ltd., were Guests of Honour and made presentations on the theme ‘A Holistic Approach on Skill Development for Women in PSUs and dichotomy space of women in public/private sphere.’", 
    "section": "national", 
    "title": "NLC launches centre to empower women", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}