{
    "author": [
        "R Sujatha"
    ], 
    "text": "Academicians blame poor infrastructure and lack of training opportunities\n\nIn the academic year 2015-16, of the total 1,050 seats in hotel management and catering technology institutions in the State only 78 were filled. Of these, only four were taken by girls.\n\nAccording to the Directorate of Technical Education, 15 institutions are affiliated to the All India Council of Technical Education and there has been a small improvement in enrolment in the last four years. For instance, in 2012-13 and 2013-14 it was as low as 45 and 53, with just one and two girls joining the courses in the respective years.\n\nThe government-run Institute of Hotel Management fills all seats, says Principal S. Rajendran. “It is a mix of problems at the level of the industry, institutions and students. There are two lakh openings in the country but only 17,000 eligible candidates.” He blames the private institutions for not spending money on infrastructure and lack of individual training opportunities to students.\n\n“Attitude and aptitude count. It is an industry with low returns at the entry level with long work hours. Employees may have to forgo social life and holidays. The way senior personnel treat their juniors is also an important indicator,” Mr. Rajendran says.\n\nPresident of Chennai Hotels Association K.T. Srinivasa Raja blames poor enrolment on the arduous and expensive visa process and lack of training for candidates in star hotels.\n\nThe director of SRM University’s institute of catering and hotel management, Antony Ashok Kumar, however, says his students have been either placed or are interning abroad, including in Dubai and Malaysia.\n\n“The hospitality sector is booming with the growth of multinational companies and the automobile sector. Chennai now has five to six international hotel brands. Last year Delhi added 2,200 rooms and this year, 2,600 rooms. Mumbai will add 3,000 rooms, Bangalore plans to add 2,000 and Chennai will have an additional 1,200 rooms this year,” he says.\n\nOpportunities abound in allied sectors such as airlines and airport management and cruises. He believes the sector will pick up when the government introduces luxury trains.\n\nCouncil’s take\n\nThe National Council for Hotel Management has affiliated 21 Central, 22 State and 13 self-financing institutes. It has since suspended affiliations of private institutions.\n\nCouncil director L.K. Ganguli said: “We take the industry on board and design curriculum. We stopped affiliating as private colleges do not comply with industry requirements. And we have nothing to do with AICTE’s affiliation.”", 
    "section": "national", 
    "title": "Only 78 of 1,050 hotel management seats filled", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}