{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "The institute aims to expose students to rural realities under ROME activity\n\nMedicos from the Pondicherry Institute of Medical Sciences (PIMS) engage in rural outreach initiatives in Villupuram and Kancheepuram recently.— Photo: Special Arrangement\n\nFor many medical students enrolling at private medical colleges who are unaware of the health concerns in rural communities or their lack of access to treatment, an orientation programme advocated by the Medical Council of India (MCI) is often their first brush with the harsh realities of village life in the country.\n\nAt a time when many private institutions struggle through logistic hurdles to implement the ‘Reorientation of Medical Education (ROME)’ as envisioned by the MCI several years ago or update it to a level of modern-day relevance, the Pondicherry Institute of Medical Sciences has been doing its bit to make the rural exposure for its students as meaningful as possible, administrators said.\n\nRecently, a batch of students, under the guidance of faculty from Department of Community Medicine at PIMS, comprising around 120 undergraduate and postgraduate medical students, interns and 20 medical social workers visited villages of Villupuram and Kancheepuram districts under the ROME activity.\n\nThe team undertook a community survey among 12,000 people in the villages of Villupuram and Kancheepuram districts of Tamil Nadu to put together a fact-sheet on the prevalence of common infectious diseases such as tuberculosis and chronic conditions such as cancer.\n\nThe geriatric population was also surveyed for age-related conditions.\n\nBased on the problems identified during the survey, the team led by Dr. Zile Singh, Head of the Department, Community Medicine, conducted medical camps in eight of these villages.\n\nIn these camps, people were provided free consultation by doctors from PIMS and drugs were distributed free of cost on the camp site itself for more than 2000 patients.\n\nThose patients who needed further lab tests and treatment were referred to PIMS. Patients referred from these medical camps were admitted, treated and in case of need undergone surgery free of cost.\n\nDuring the camp, the community was also counselled on the spread, prevention and control of common diseases, especially disorders that are spread in conditions of poor environmental hygiene.\n\nMedical students also distributed pamphlets and brochures to the community members to raise awareness regarding early detection of oral cancer.\n\nApart from providing information regarding available health facilities to manage these diseases, medical students also explained procedures to avail benefits under various government social welfare programmes.\n\nAccording to PIMS doctors, through this community based activity, students were not only sensitised towards health needs of the rural people but also to the realm of conducting research. Students were trained in carrying out the various steps of research from protocol writing to the preparation of final report.\n\nA Swachh Bharat Campaign was conducted in Chunampet that featured an awareness rally highlighting the importance of cleanliness.", 
    "section": "national", 
    "title": "PIMS medicos reach out to villagers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}