{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Chennai has been rapidly growing in the past few years and infrastructure development, especially that pertaining to supply of drinking water, has not kept pace with the expansion of the city. This is especially true of the added areas.\n\nWorld Water Day observed on Tuesday comes as reminder that improved water availability is linked to a better life.\n\nThis year’s theme ‘Better Water, Better Jobs’ is only apt for Chennai residents, especially in the merged areas, as they spend much of their time fetching safe drinking water. The theme highlights that sufficient quantities of quality drinking water can change people’s livelihoods.\n\nAccording to Chennai Metrowater, nearly 830 million litres of water a day is being supplied daily to the expanded city. However, residents of Thoraipakkam and Semmenchery point out that they largely depend on groundwater resources for their daily needs as they either do not get water supply or the volume supplied is inadequate. Vatsala Samban, a resident of Thoraipakkam said some streets in her locality still depended on well water as they did not get water through tankers.\n\nResidents of areas like Kathirvedu and Puthagaram who experience erratic water supply opt for paid tanker water. Some of these added areas are still awaiting piped water supply, which has been delayed for want of infrastructure.\n\nSimilarly, in some parts of Ambattur, residents have to wait for tankers to fetch a few pots of water.\n\nB. R. Prasad, a resident of Vijayalakshmipuram, said, “Supply through street taps has been erratic for a month now even after the heavy rains few months ago. People who cannot afford to buy water wait for tankers to get a few pots of water.”\n\nIncrease in groundwater table has helped in reducing the burden and offset the gap in supply in areas like Ambattur, Nolambur and Semmenchery. G. Sathish of Semmenchery said piped water supply to some areas was being sustained with the old network of pipelines and borewells provided by the erstwhile panchayat.\n\n“Most of the highrise apartment buildings have to buy water in large numbers of tankers both from Metrowater and private operators. Local Metrowater officials assure us that water connections will be provided in six months,” he said.\n\nSupply of drinking water has not kept pace with the expansion of the city", 
    "section": "national", 
    "title": "Piped water supply still elusive in added areas", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}