{
    "author": [
        "S Senthalir"
    ], 
    "text": "Scant regard for rules, unchecked exploitation adding to the woes, say experts at Water Festival\n\nChildren from four different government schools conducted a puppet show related to water conservation at Auroville as part of the Water Festival 2016 on Tuesday.— PHOTO: M. Samraj\n\nThe seven-week celebration of Water Festival 2016 from February 2 to March 22 culminated on Tuesday at Auroville, identifying rampant pollution and encroachment as a threat to water resources in Puducherry, Auroville, Villupuram and Cuddalore bio-region.\n\nProbir Banerjee of All for Water for All spoke on the way forward during the valedictory function of the water festival.\n\nHe underlined that during the seven-week festival, it was found that unscientific solid waste management, poor sanitation, open defecation, sewage and industrial effluents let out into fresh water resources was polluting the water.\n\nHe added that conversion of agricultural land and river sand mining and rampant encroachment of water bodies by government, quasi government and private parties was leading to decrease in groundwater recharge.\n\n“Besides, over extraction, exploitation and commercialisation of water, salt water intrusion into ground water table due to coastal erosion was adding to the problem,” he said.\n\nInteraction with the local people in the seven bioregions including Puducherry, Bahour, Cuddalore, Nettapakam, Mannadipet, Marakkanam and Auroville led to the identification of these problems. During the course of water festival celebrations, it was analysed that the lack of respect to rules and regulations, non-integrated approach by multiple departments, improper carrying out of civil works related to water, contract fishing and prioritisation of fishing over irrigation and poor governance were the main reasons for the continued degradation of water resources.\n\nAll for Water for All recommended stopping of privatisation of water resources by governmental agencies. Besides, making rainwater harvesting mandatory, creation of water bodies, removal of weeds and encroached constructions, arresting of sand mining and finding alternative materials for construction instead of sand would help resolving the current problems.\n\nThey also recommended formation of steering group at the secretary level involving civil society organisations and setting up of project management units for an integrated approach involving all concerned government departments. All civil works related to water to be implemented only through the communities or water user associations and tank associations and the role of PWD or State should be only to prepare the estimates and monitoring of works, it was felt.\n\nAudrey Richard and Tom Gablier of All for Water for All presented their seven-week activities to the gathering.", 
    "section": "national", 
    "title": "‘Pollution threatening Puducherry, Auroville water resources’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}