{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Condemning Tamil Nadu Water Supply and Drainage (TWAD) Board’s reported decision to give 20 lakh litres of water from the Tamirabharani to a franchisee manufacturing Coke’s beverages at Gangaikondan, People Welfare Front functionaries staged a demonstration on the banks of the river at Seevalaperi near here on Tuesday in connection with World Water Day (March 22).\n\nThe protesters alleged that Public Works Department had constructed a check dam across the river near Seevalaperi to ensure adequate flow and stagnation of water around infiltration wells supplying 20 lakh litres a day to Coke’s beverage manufacturing unit at Gangaikondan, which had increased its production capacity. “This decision will kill farming operations and affect the public who rely on the Tamirabharani for their drinking water needs,” they charged.\n\nDistrict secretary of Communist Party of India Kasi Viswanathan said that the Tamirabharani water was quenching the thirst of several million people in Tirunelveli, Thoothukudi and Virudhunagar districts, besides nourishing a range of crops cultivated over a lakh hectares of land. If water from the perennial river was sold to Coke, it would seriously affect farming operations in the region and the drinking water schemes executed on an outlay of several crores of rupees would become meaningless as there would be no flow of water in the river.\n\n“The State government should withdraw its decision to sell water to Coke and also its rival Pepsi, both having their manufacturing units at Gangaikondan,” Mr. Viswanathan said.\n\nDistrict secretary of Communist Party of India (Marxist) K.G. Bhasakaran said that the transnational beverage giantshad established their units at Gangaikondan despite protest by political parties and agriculturists. “Giving 20 lakh litres of water from the Tamirabharani to these companies for a throwaway price would only encourage them to go in for uncontrolled expansion,” Mr. Bhaskaran said.\n\nMarumalarchi Dravida Munnetra Kazhagam’s Tirunelveli Rural district secretary T.M. Rajendran said that the PWF would launch a series of agitation against the decision. MDMK’s Tirunelveli City district secretary K.M.A. Nizam, party’s State legal wing deputy secretary Arasu Amalraj, former Principal of MDT Hindu College V. Ponnuraj, office-bearers of Viduthalai Chiruthaigal Katchi and Social Democratic Party of India participated in the demonstration.", 
    "section": "national", 
    "title": "Protest against huge water supply to soft drink unit", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}