{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Dhayabara Raj continues his fast demanding release from camp\n\nEven as Sri Lankan Tamil Dhayabara Raj lodged in the Special Camp here continued his fast demanding release, members of the People’s Welfare Front (PWF) staged an agitation seeking the release of the Sri Lankan Tamil.\n\nThe PWF, comprising the Left parties, Marumalarchi Dravida Munnetra Kazhagam and the Viduthalai Chiruthaigal Katchi, had called for an agitation in front of the Tiruchi Central Prison on Tuesday demanding the release of the fasting Dhayabara Raj from the Special Camp here.\n\nAccordingly, members of the front assembled near the jail corner and took out a march up to the entrance of the Central Prison. A heavy posse of police personnel was deployed near the Prison entrance.\n\nThe PWF cadre led by CPI (M) district secretary Raja were stopped by the police near the jail entrance. The cadre who raised slogans sat on the main road for some time following which they were arrested. Police said 80 PWF members were arrested and were subsequently taken to the Armed Reserve community hall here.\n\nSources said Dhayabara Raj had illegally entered India through Dhanuskodi in 2014 by boat along with his wife and children from the island nation. He was arrested and a case booked against him in connection with his illegal entry into India. He was sentenced to one year imprisonment and lodged in the Puzhal Prison at Chennai. After completion of the sentence period, Dhayabara Raj was lodged in the Cheyyar special camp.\n\nHe was shifted to Tiruchi Special Camp early this month from Cheyyar special camp following its closure by the government. While Dhayabara Raj was lodged in the Tiruchi camp, his wife Udayakala and children were accommodated in the camp at Mandapam near Rameswaram. Dhayabara Raj resorted to indefinite fast at Tiruchi camp a few days ago demanding his release as he had already completed the sentence period besides urging the official authorities to make arrangements to meet his wife and children.\n\nThe sources said Dhayabara Raj, in his mid-thirties, was not inclined to return to Sri Lanka.\n\nThe PWF demanded that Dhayabara Raj should be released from the camp and permitted to stay in the country along with his wife and children without being sent back to the island nation.", 
    "section": "national", 
    "title": "PWF demands release of Sri Lankan Tamil from Tiruchi camp", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}