{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A female Indian Owlet-moth and a Common banded peacock (below) spotted in the foothills of Pachamalai and Puliyancholai.\n\nThe female Indian Owlet-moth (Spirama retorta), belonging to Erebidae family, has been spotted recently by a city-based ecologist and a student volunteer at the foothills of the Pachamalai nature reserve.\n\nQ. Ashoka Chakkaravarthy, ecologist and assistant professor of Environmental Science, Department of Foundation Courses, St. Joseph’s College, and student K. Arunagiri recorded the presence of the moth species that is usually found in north-eastern India, Maharashtra, Himachal Pradesh, and Madhya Pradesh late last month.\n\nThe moth’s wings (spanning 60-70 mm) carry a striking pattern that often looks like the face of a snake with slightly opened mouth, intended perhaps as a device to momentarily ward off predators (known as Deimatic behaviour).\n\nOwlet moths are one of the largest families that Lepidoptera which comprises more than 35,000 known species placed in 29 sub-families and 4,200 genera.\n\n“Most moths in India are not yet identified properly. The lifespan of this moth is 36 or 37 days,” Mr. Chakkravarthy noted in a statement.\n\nThe ecologist has tracked the Common Banded Peacock (Papilio crino) butterfly in Puliyancholai, at the base of the Kolli Hills.\n\n“(Puliyancholai) is a haven for butterflies because of the steady flow of water throughout the year in this unique ecosystem,” said Mr. Chakkravarthy.\n\nThe area has been teeming with blue butterfly species such as zebra blue, common albatross, and common gull after the monsoons, and the ecologist has recorded more than 20 species of butterflies so far.\n\nThe Common Banded Peacock, with a wing span of 8 to 100 mm, was spotted while it was “mud-puddling” — sucking up moisture from rotting plant matter, mud, and carrion.\n\nBesides its shiny blue or green colouring, the tips of its hind wings are distinguished by markings that look like eye spots.\n\nThis species belongs to Papilionidae family and can be seen in the southern Maharashtra, Madhya Pradesh, Odisha, and West Bengal.", 
    "section": "national", 
    "title": "Rare moth species spotted near Pachamalai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}