{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "In a late-evening development on Tuesday, the State government ordered the release of Sri Lankan Tamil refugee K. Dhayabararaj’s family from the special quarantine detention camp at Mandapam in Ramanathapuram district. As the indefinite fast of the family demanding release entered the sixth day, the authorities released Udayakala and her three children amid allegations that their detention was unlawful, police sources said.\n\nMr. Dhayabararaj, who is held at the Tiruchi special camp, had alleged that his family was being illegally detained in the special quarantine camp that lacked basic amenities. He claimed that the health condition of his wife who required an emergency surgery was declining. Since no dole (financial aid of Rs. 100 per day) was paid, his family had to starve for several days. On Thursday, they decided to launch a fast-unto-death agitation demanding justice.\n\n“On release, a local church pastor agreed to give them food and shelter. My wife is in a state of shock…she was under treatment for depression for sometime. The authorities have to explain why my family was detained in the quarantine camp for so long without any assistance,” Mr. Dhayabararaj told The Hindu on Tuesday.\n\nHe said the family was arrested on arrival by boat in 2014. After being convicted in the Passport Act case, the family served a one year sentence. “We were detained again in special camps. I was separated from my wife and children and lodged at the Tiruchi special camp. There is no case against us. In the last six months, I sent several petitions to the Home Secretary seeking my release but there was no response,” he said.\n\nPolice sources maintained that the process was on to repatriate Dhayabararaj and his family to Sri Lanka. “We have information that he is involved in a financial fraud case in Sri Lanka. During the process of repatriation, it is required to keep him custody. There is a possibility that he might abscond if released,” a senior police official said on condition of anonymity.\n\nPeople’s Union for Civil Liberties national general secretary V. Suresh said the Tamil Nadu government should respond with a humanitarian gesture and release Dhayabararaj from the special camp. “Instead of sticking to technicalities, they must release him. His wife and children need him as much as he needs them for their collective well being,” he said.\n\nDemonstration\n\nIn a related development, at least 90 cadres of the Makkal Nala Kootani staged a demonstrated in front of the Tiruchi camp demanding its closure. They were arrested and released in the evening.", 
    "section": "national", 
    "title": "Refugee’s family released", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}