{
    "author": [
        "S Ganesan"
    ], 
    "text": "Shops on pavements have been posing a serious threat to the safety of road users in Thillai Nagar in Tiruchi. Parking of vehicles, particularly two-wheelers, aggravates the situation.— Photo: M. Srinath\n\nThere has been indiscriminate commercial development in Thillai Nagar with many old houses being demolished to make way for multi-storeyed buildings.\n\nt a time when the Tiruchi Corporation is planning to give a push to non-motorised transport by creating bi-cycle lanes and pedestrian pathways, the way pavements in the city have come under encroachments has been a cause for concern for residents.\n\nIt is not that the city does not have pedestrian pathways. But in most places they have been occupied or made inaccessible by encroachers, mainly by shop keepers and vendors, or indiscriminate parking of vehicles. Consequently, pedestrians have been pushed to the road.\n\nPedestrian pavements along Thillai Nagar Main Road, which in recent years have emerged as a commercial and medical hub on its own right, have almost completely been made inaccessible by traders in recent years. Scores of traders operating along the road have extended their commercial space to the pavements. In recent days, a new fruit shop has come up along the main road near the VIth Cross and has occupied the entire pavement with impunity. Adjacent to this shop, an eatery functions on the pavement. With a town bus halt located right in front, commuters have to literally wait on the middle of the road as vehicles of customers visiting the shops are parked along the roadside. Just a few yards down the road, another fruit shop has been operating right on the pavement untouched by civic authorities for years.\n\n“It is astonishing to find the entire pavement occupied by the shopkeepers. Pedestrians and commuters have nowhere to go,” observes Chithra, a commuter waiting at the bus halt.\n\nCivic activists have long been raising the issue but to no avail. Despite several appeals, pavements on Thillai Nagar continue to remain encroachment forcing pedestrians to walk on the road endangering their lives, says A.V.Narayanan, a resident of Thillai Nagar.\n\n“The practice has to be brought to an end,” says S.Pushpavanam, secretary, Consumer Protection Council, Tamil Nadu. He points out that there has been indiscriminate commercial development in Thillai Nagar area with many old houses being demolished to make way for multi-storeyed buildings.\n\nThe situation is same elsewhere in the city too. Footpaths in the Railway Junction area, Central Bus Stand, Chinnakadai Street, Nethaji Subash Chandra Bose Road, Chathiram Bus Stand, Chinthamani, Thennur High Road, Pattabiraman Road, Fort Station Road, Palakkarai Main Road, West Boulevard Road, Gandhi Market area and Nandhi Koil Street have been encroached upon by traders. In many of these areas, the platforms are not even accessible to pedestrians.\n\nFor long, traders engaged in second sale of two-wheelers and two-wheeler mechanics have completely occupied the pavements along Pattabiraman Pillai Road. But for the occasion drives to clear encroachments in places such as NSB Road, the Corporation has largely turned a blind eye to the problem.\n\nThere has been indiscriminate commercial development in Thillai Nagar with many old houses being demolished to make way for multi-storeyed buildings.", 
    "section": "national", 
    "title": "Shopkeepers push out pedestrians", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}