{
    "author": [
        "A D Balasubramaniyan"
    ], 
    "text": "With the advent of mobile phone, the STD booths faded into oblivion. History is being repeated again as smart phones and laptops are pushing the internet cafés off the communication grid.\n\nFaster access to internet became a reality after BSNL launched its broadband service. This gave a boost to the fledgling cyber café business in Tiruvannamalai with browsing centres cropping up every 100 metres. Vengikkal, Gandhi Nagar, Periyar Statue, Ramanashram and areas around Sri Arunachaleswarar Temple are some of the areas that had more internet cafés. BSNL has no statistics regarding the total number of internet cafés as there is no special category of connection for them.\n\nHowever, after smartphones made their way into the market, access to internet became even easier, with all the mobile operators providing the services, including 3G on the device itself. Realising that the trade would not be viable any more, owners of internet cafés converted the centres into photocopier shops, with some of them even taking laser printouts. They also provide services such as payment of bills and other online transaction. A few others downed their shutters altogether.\n\nDevaraj, who owned an internet café in Vengikkal but discontinued browsing services, said that he still maintains an internet connection but only to facilitate printouts from customers’ email accounts etc. “About 80 percent of internet cafés closed browsing services. Even those who provide it don’t have cabins anymore and don’t do it as a full-time business,” he says.\n\nA large internet café with about 20 plus systems in the heart of the town stopped the browsing services and carry out only utility services such as payments etc. The owner stopped the business when he had to upgrade his obsolete and aging hardware as investing more in the business was unwise.\n\nM.N.Sridhar, who runs the oldest net café in the town, Image Computers, on car street, is however unfazed. Of course, he does services like online payment etc., but his systems are always open for the customers to browse but without partitions for privacy, as ever. Mr.Sridhar, who runs the café since dial up internet days is aware of the fact that smartphones have taken away most of the business. However, he says “there are many people who can’t access internet on their own for utilities. They have no other go than internet cafés. The browsing centres still can thrive on this population. Even government can step in and recognise some of the cafés as common service centres.”", 
    "section": "national", 
    "title": "Smartphones force cyber cafés to log out", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}