{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A majority of the 1.2 million passengers were overseas travellers\n\nThe non-metro Tiruchi international airport continues to be on a growth trajectory witnessing an upswing in passenger traffic and export cargo movements this fiscal as well.\n\nThe fast-growing airport with more overseas operations than domestic services handled 1.2 million passengers up to January this fiscal recording a robust growth with bulk of them accounting for international passengers.\n\nThe airport recorded impressive growth in export cargo movement surpassing the 6,000 tonnes target set internally for the current fiscal.\n\nThe target was surpassed in February clocking around 6,075 tonnes in export cargo shipment.\n\nWith the current robust cargo movement, the airport is expected to cross the 6,500 tonnes mark by the end of this financial year, said K. Gunasekaran, Airport Director, Tiruchi.\n\nMr. Gunasekaran, who assumed charge recently, told presspersons here on Tuesday that the airport achieved 31 per cent growth in cargo movement till now this fiscal. The airport had handled 4,973 tonnes in the 2014-15 fiscal.\n\nA bulk of the cargo exported from Tiruchi airport were perishable commodities to Singapore and other South East Asian destinations, he said and added that the airport authorities would focus on pharma products as there was a good demand for it especially in West Asian countries.\n\nA meeting would be convened with the Confederation of Indian Industry in May to discuss the issue and the ways and means of boosting export cargo growth and focussing on import cargo, he said. The proposed meeting would be organised after the upcoming Assembly election.\n\nNew terminal\n\nHe pointed out that the Airports Authority of India had decided to build a new international terminal building at an estimated cost of Rs. 862 crore. The proposed project was in the planning stage and a consultant would be appointed to carry out a survey, the soil test, and preparation of detailed project report for the project, he added.", 
    "section": "national", 
    "title": "Spurt in air passenger traffic, and export cargo in Tiruchi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}