{
    "author": [
        "B Kolappan"
    ], 
    "text": "Manithaneya Makkal Katchi (MMK) leader M.H. Jawahirullah on Tuesday rejected the argument that inclusion of exclusive Muslim parties in an electoral alliance would result in alienation of voters from other communities.\n\n“It has no basis as the outcome in election after election has proved the argument wrong,” Mr. Jawahirullah told The Hindu after meeting DMK leader M. Karunanidhi at his Gopalapuram residence.\n\nThe two parties will face the forthcoming Assembly elections together, and on behalf of the MMK, a 17-point charter of demands was handed over to Mr Karunanidhi for inclusion in the DMK’s manifesto.\n\nMr. Jawahirullah said in the 1996 Assembly polls, the Tamil Nadu Muslim Munnetra Kazhagam (TMMK), the parental body of the MMK, supported the DMK and the latter won the elections.\n\n“In 2001, we were with the AIADMK and it was elected to power. We supported the DMK in the 2006 Assembly polls and it became a ruling party. After launching the MMK, we joined hands with the AIADMK. Our alliance won the elections and two of us were elected to the Assembly. If the argument that Muslim parties will alienate the votes of others is true, the outcome of the elections would have been different. In the coming election, the DMK will once again be elected to power,” he said.\n\nAsked why the MMK, perceived to be close to the AIADMK, had turned towards the DMK, Mr. Jawahirullah said the ruling party failed to consider the demands of the minority communities in the state.\n\nHe accused the AIADMK government of not taking efforts to facilitate construction of mosques and churches on patta lands.\n\n“The State Government wrote to the Centre to release the convicts in the Rajiv Gandhi assassination case only on the eve of elections. It did nothing to release long-time Muslim prisoners though the Supreme Court had made it clear that the State government enjoyed unfettered power under Article 161 of the Constitution to set them free,” he charged.\n\n‘Integrate secular forces’\n\nMr. Jawahirullah said there was a need to integrate the secular forces at a time the BJP government at the Centre was working against the interests of the nation and was seeking to implement its Hindutva agenda.", 
    "section": "national", 
    "title": "Tie-up with Muslim parties won’t cleave voters, says Jawahirullah", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}