{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal purappadu in thanga pallaku from kannadi arai, 6 a.m.; reaching Thayar Sannidhi, 9.30 a.m.; reaching Panguni Uthira mandapam, 2 p.m.; Thayar purappadu from sanctum sanctorum, 2.30 p.m.; reaching Panguni uthira mandapam, 2.45 p.m.; Chinna Perumal reaching Thayar Sannidhi after theerthavari, 10.30 p.m.\n\nArulmigu Thayumanaswamy Temple, Rockfort : Theppam festival, theerthavari, 8 a.m.; Chandikeswarar purappadu, 7 p.m.\n\nSri Srinivasa Perumal Temple, Indira Nagar : Panguni uthiram, Vasurthara homam, 8 a.m.; thirukalyana utsavam, 2 p.m.; Garuda sevai thiruveedhi purappadu, 8 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, Ranganayaki Thayar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 28, SMESC Colony, North Extension II Street, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha : Centenary programmes, vocal concert by Aiswarya Madhavan and party, Mahatma Gandhi Centenary Vidyalaya, Thennur, 6.30 p.m.\n\nGENERAL\n\nThe Book Club : Book review, V.Gopalakrishnan reviews Vinod Rai’s ‘Not just an accountant,’ Thathachariar House,152, South Chithra Street, Srirangam, 6.30 p.m.\n\nNational College: Valediction of Physics Association, R.Ramesh Babu, assistant professor, Bharathidasan University, speaks on Growth and applications of bulk single crystals, 11.30 a.m.; Department of Computer Science: Workshop on Big data analytics, 10 a.m.\n\nDistrict Administration: Systematic Voter Education and Electoral Participation programme, cultural event, Manapparai Taluk Office, 10 a.m.; Musiri Bus Stand, 12.30 p.m.; RDO Office, 2 p.m.\n\nM.A.M.College of Engineering, Computer Society of India and ICTACT : International conference on Electrical Information and Communication Technology, R.Jayavel, Director, Centre for Research, Anna University, Chennai, inaugurates, 9.30 a.m.; valedictory address by E.Kirubakaran, AGM (EDP), BHEL, Tiruchi, 4 p.m.\n\nBharathidasan University Career and Counselling Cell : Soft skills development career counselling programme, Premanand Sivalingam and Anusha of Arrant HR Solutions, speak, Bharathidasan University Constituent College, Lalgudi, 10 a.m.\n\nShri Angalamman College of Engineering and Technology: Lecture on Advancements in CAD and NDT by B.Lawrance, CEO, A Plus Technologies, 10 a.m.\n\nJamal Mohamed College : College Day for women, T.M.Abdul Kadar, former Head, Department of Tamil, Islamia College, Vaniyambadi, chief guest, 3.30 p.m.\n\nSaranathan College of Engineering Department of Instrumentation and Control Engineering : Discussion on Safety instrument system, J.Vishnuvardhan, Managing Director, Trend Instrumentation and Automation Pvt.Ltd., resource person, 11.30 a.m.\n\nCARE Group of Institutions: Annual day, B.Prative Chend, CEO, CARE Group of Institutions, chief guest, 2 p.m.\n\nArignar Anna Arts College, Musiri : Yoga training, 10.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}