{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Southern Railway has notified the following changes in train services in view of the pre-disconnection or disconnection works for commissioning of double line between Tiruchi and Manapparai from March 28 to April 1:\n\nPartial cancellations\n\nThe Tirunelveli – Mayiladuturai – Tirunelveli Passenger (56822/56821) will be partially cancelled between Dindigul and Tiruchi from March 28 to 31. The trains will run only on Tirunelveli – Dindigul – Tirunelveli and Mayiladuturai – Tiruchi – Mayiladuturai sections.\n\nThe Palghat Town – Tiruchi – Palghat Town Passenger (56712/56713) will be partially cancelled and will run only between Palghat Town and Tiruchi Fort on both directions on April 1.\n\nThe Coimbatore – Mayiladuturai – Coimbatore Jan Shatabdi Express (12084/12083) will be partially cancelled and run only between Coimbatore and Tiruchi Fort on both directions on April 1.\n\nThe Nagore – Tiruchi Passenger (76851) will run up to Ponmalai on April 1 and will be partially cancelled between Ponmalai–Tiruchi.\n\nThe Tiruchi – Cuddalore Port Junction – Tiruchi Passenger (76842/76841) will be operated between Ponmalai and Cuddalore Port Junction on both directions on April 1.\n\nThe Erode – Tiruchi Passenger (56844) will run up to Karur on April 1 and will be partially cancelled between Karur and Tiruchi.\n\nTrains fully cancelled\n\nThe Tiruchi – Karur Passenger (76833); The Mayiladuturai – Tiruchi – Mayiladuturai Express (16233/16234); The Karaikkudi–Tiruchi–Karaikkudi Passenger (76840/76839) and the Tirunelveli–Mayiladuturai–Tirunelveli Passenger (56822/56821) have been cancelled on April 1.\n\nTrains rescheduled\n\nThe Tiruchi–Dindigul Passenger (56703) scheduled to leave Tiruchi at 6.20 p.m. on April 1 has been rescheduled to leave at 7 p.m.\n\nThe Tiruchi – Erode Passenger (56843) scheduled to leave Tiruchi at 4.10 p.m. is rescheduled to leave at 5.30 p.m. on March 30 and April 1.\n\nThe Tiruchi – Nagore Passenger (76852) scheduled to leave Tiruchi at 4.30 p.m. has been rescheduled to leave at 5 p.m. on March 30 and April 1.\n\nTrain regulated\n\nThe Chennai Egmore – Guruvayur Express (16127) will be regulated on April 1 so as to reach Tiruchi at 4 p.m. and will be diverted via Tiruchi–Karur–Dindigul.\n\nTrains diverted\n\nThe Chennai Egmore – Guruvayur/Tuticorin Link Express (16127/16129) leaving Chennai Egmore will be diverted via Tiruchi – Karur – Dindigul from March 28 to 31. The Guruvayur/Tuticorin – Chennai Egmore Link Express (16128/16130) leaving Guruvayur will be diverted via Dindigul – Karur – Tiruchi March 27 to 31.\n\nPassengers who had made reservation to and from Manapparai will be transported by road. The Guruvayur – Chennai Egmore Express (16128) arriving Dindigul on April 1 will be diverted via Dindigul – Karur – Tiruchi.\n\nThe Nagercoil – Mumbai CST Bi-weekly Express (16352) leaving Nagercoil on March 31 will run via Madurai – Dindigul – Karur – Tiruchi. The Nagercoil – Kacheguda Weekly Express (16354) leaving Nagercoil on March 29 will run via Madurai – Dindigul – Karur. Passengers who had made reservation ex- Tiruchi will be taken by road from Tiruchi to Karur.\n\nThe Shri Mata Vaishno Devi Katra – Tirunelveli Express (16788) and The Kacheguda – Nagercoil Express (16353) arriving Tiruchi on March 31 will be diverted via Karur – Dindigul – Madurai. Passengers who had made reservation up to Tiruchi will be bridged at Dindigul, a Southern Railway press release said.", 
    "section": "national", 
    "title": "Track doubling forces change in train timings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}