{
    "author": [
        "Staff Reporter"
    ], 
    "text": "It was on its way to Vijayawada from Manamadurai: driver\n\nCollector K. Veera Raghava Rao inspecting the mini truck, which was carrying mobile phones worth Rs. 77 lakh and seized by election officials, in Madurai on Tuesday.— Photo: S. James\n\nA mini truck carrying 9,940 mobile phones, worth about Rs. 77 lakh, allegedly without appropriate documents was detained by election officials near Koodal Nagar in Madurai East Assembly constituency late on Monday night.\n\nThe vehicle, bearing Salem district registration number, was intercepted by a Static Surveillance Team (SST) between Koodal Nagar and Basingapuram.\n\nAccording to official sources, the vehicle driver and his assistant showed some documents to the officials and claimed that they were taking the consignment from a private company’s godown at SIPCOT in Manamadurai in Sivaganga district to Vijayawada in Andhra Pradesh.\n\nMadurai Revenue Divisional Officer and Returning Officer of Madurai East constituency G. Senthilkumari, however, said that the SST officials became suspicious as a vehicle going on its way to Vijayawada had no reason to come near Koodal Nagar.\n\n“When the team questioned the two why they had come to this side of Madurai, they had no convincing answers,” she said.\n\nThe vehicle was taken to the Collectorate premises where Collector and District Election Officer K. Veera Raghava Rao inspected it on Tuesday morning.\n\nOfficials said that there were 497 boxes in the container with each having 20 new mobile phones. The Commercial Taxes Department was also alerted by the district administration.\n\nSources said that the vehicle driver and the company officials brought additional documents and trip sheet of the vehicle on Tuesday afternoon in a bid to establish that the consignment was on the move in adherence to stipulated procedures.\n\n“The Commercial Taxes Department is also scrutinising the documents to check if they had followed all the procedures. Once they are convinced, the truck may be released,” Ms. Senthilkumari said.\n\nA total of 713 cases of various election code violations have so far been booked in the district. The administration seized about Rs. 64 lakh and goods worth about Rs. 82 lakh during vehicle checks at various places till Monday.", 
    "section": "national", 
    "title": "Truck with Rs.77 lakh-worth mobile phones detained", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}