{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Temperature in the district has been varying between 36 degrees Celsius and 39.2 degrees in the last one week\n\nVellore residents were feeling the heat as the temperature rose to 41.1 degrees Celsius on Tuesday. According to meteorological office it was it the hottest day of the month.\n\nOn Monday, Vellore recorded 39.6 degrees Celsius.\n\nThe temperature has been varying between 36 degrees Celsius and 39.2 degrees Celsius from March 16 to 20. In fact, temperatures were lesser by at least two or three degrees during the subsequent period last year. On March 22, 2015, the temperature was 37.7 degrees Celsius, officials said.\n\nAccording to the IMD website, the highest temperature recorded in March last year was 39.5 degree Celsius (March 23).\n\nWhat doctors say\n\nThe scorching sun can be really harsh, and doctors stress on the need for proper care, particularly for children, during summer. E. Theranirajan, head, Paediatrics, Government Vellore Medical College Hospital (GVMCH), said the common diseases that occur during summer are typhoid, hepatitis A and chickenpox. Throat infection and prickly heat can also cause trouble.\n\n“Drinking contaminated water can cause typhoid and hepatitis A. It is important to avoid drinking water outside. Give purified water to children. Dehydration is a problem during summer. Children should take plenty of fluids, like home-made buttermilk and fruit juice,” Mr. Theranirajan said.\n\nTender coconut can also be given for children, while ice creams can be avoided, he said.\n\n“Parents can give bath twice a day for children,” he added. With chicken pox also being common during summer, he said vaccination was available for children aged between 15 months and five years, in two doses.\n\nAccidental ingestion of kerosene was another problem. He advised parents to keep kerosene out of the reach of children.\n\nGo. Bharani, retired professor of medicine, GVMCH, said people should avoid going out in the sun from 11 a.m. to 3 p.m. “It is better to finish important work early as the sun is at the peak during these hours. Drink butter milk, lemon juice and tender coconut and wear cotton clothes to manage the heat,” she said.\n\nDiabetics, too, should take utmost care. “They should keep the sugar level under control. They can drink buttermilk and lemon juice with salt, consume vegetable salad, tomato and greens soup,” she added.\n\nCarbohydrates intake\n\nIt is important to reduce intake of carbohydrates and oily food during summer, and increase vegetables and greens in one’s diet. “Diabetics should avoid tender coconut, soft drinks and fruit juices. They should drink plenty of water,” she said.", 
    "section": "national", 
    "title": "Vellore feels the heat as mercury hits 41 degrees", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}