{
    "author": [
        "B Kolappan"
    ], 
    "text": "Close to a turning point in State politics, says Thirumavalavan\n\nMarumalarchi Dravida Munnetra Kazhagam (MDMK) general secretary Vaiko expressed hope on Tuesday that actor Vijayakant’s Desiya Murpokku Dravida Kazhagam (DMDK) would join the People’s Welfare Front (PWF).\n\nReacting to reports that were doing the rounds in media that Mr. Vijayakant would join the PWF and his wife Premalatha had already held talks with its leaders, Mr. Vaiko, who is also the convener of the front, would only say, “I am hopeful that the DMDK will join hands with us.”\n\nThol. Thirumavalavan, leader of the Viduthalai Chiruthaikal Katchi (VCK), another constituent of the PWF, said talks were going on with the DMDK and efforts were being made to rope in Mr Vijayakant into the front. “A turning point in the electoral politics of Tamil Nadu might happen anytime,” he told The Hindu.\n\nMr Thirumavalavan said Mr Vijayakant’s speech at the state conference at Kancheepuram shutting the doors on the DMK and another speech at the party’s women wing conference eliminating the BJP from the race gave the PWF the confidence.\n\nThree-cornered contest\n\n“There was a three-corned contest to win over the DMDK and now only the PWF is in the fray,” he added.\n\nMr. Vaiko said since the actor-turned-politician had declared a fight against rampant corruption in the State, he could not afford to join hands with the DMK and the AIADMK, the parties that were responsible for the current state of affairs.\n\nAsked about DMK leader M. Karunanidhi’s recent remarks on a possible tie-up with the DMDK, Mr. Vaiko countered the question quoting DMK treasurer M.K. Stalin’s assertion that no fresh appeal had been made to Mr. Vijayakant.\n\n“Never in the history of the DMK has a statement of a party leader been denied in 24 hours. The DMK has been infiltrated by elements who have no idea of the history and ideology of the party. All the stalwarts of the party have been sidelined. It is a sad thing. I can only feel sorry for Mr. Karunanidhi,” he said.", 
    "section": "national", 
    "title": "Vijayakant’s stand on corruption makes him our natural ally: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}