{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "The veteran actor shares his experience and difficulties associated with dialysis\n\nAward-winning playwright and film personality Visu spoke movingly on the subject of organ donation at a gathering for donors and recipients hosted by Kauvery Hospital at Hotel Sangam here on Sunday.\n\n“I have heard applause for actors like Sivaji, Kamal, and Rajini, but the applause these doctors are getting is the most heartening, because they have really been life-savers,” said the actor, who has been on dialysis for the past one-and-a-half years and who has also survived throat cancer.\n\nSunday’s event, held to observe World Kidney Day, saw the launch of a renal disease-themed mobile phone application in Tamil, an organ donor registry through donor cards, and the ‘Kauvery Kidney Care’ manual by the hospital, which has centres in Tiruchi, Chennai-based non-profit transplant organisation Mohan Foundation and the Rotary Club of Tiruchi – Elite were co-hosts of the evening.\n\nWater bottles were distributed with the catchy slogan ‘Ka, Ka, Ka, Po’ (‘Kallum Karainthu Kaanamal Pogum’ which translates to even stones will dissolve and disappear) to educate the public on the importance of keeping the kidneys hydrated.\n\nDr. S. Manivannan, Joint Managing Director, Kauvery Hospital, joined the transplant team comprising Dr. (Ms.) S. Senthil Kumar, transplant surgeon, S. Kandasamy (nephrologist), T. Rajarajan (nephrologist) and N. Karthikeyan (urology consultant) on stage, where a kidney donor, two kidney recipients and an eye transplant recipient were introduced to the public.\n\n“We have noticed that the bonding between donor and recipient increases after the operation, especially if they are close relatives,” said Dr. Rajarajan. “Usually it is mothers who volunteer first to donate their kidney to their ailing children.”\n\nVisu held the floor for the concluding part of the evening as he detailed his battle with throat cancer in 2010 and of late renal dysfunction that requires regular dialysis.\n\n“I used to smoke at least 60 cigarettes a day from 1961 to 2010. It was only when I was diagnosed with throat cancer did I realise how tough the treatment was going to be. I was confined to my home for nine months. My voice, my trademark, went away. It was as if Visu had been erased from this world,” the actor and talk show host recalled.\n\n“Though I was able to beat back cancer, I have been suffering due to kidney disease for the past year and a half. Dialysis is arduous. It doesn’t allow me to travel like before. I refused to consider a transplant, probably because I was not well-informed about the subject. But now, after meeting so many people in Tiruchi who have recovered after receiving a kidney, either from a live donor or a cadaver, I’m considering opting for a transplant too,” he said.", 
    "section": "national", 
    "title": "Visu canvasses for organ donation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}