{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "In 8 months, 25 houses robbed in an area in Triplicane\n\nMost of the burglaries take place between 1.30 a.m. and 3.30 a.m.—Photo: B. Jothi Ramalingam\n\nResidents of Elephant Tank Streets in Triplicane have eyes peeled for burglars. For the past many months, burglars have been striking at the houses in their area. Despite their best efforts, they are outwitted by the thieves.\n\nIn the past eight months, they have targeted over 25 houses, stealing valuables ranging from mobile phones to gold jewellery — in most cases, these have been life earnings of middle-class residents in the locality.\n\nFed up by the lack of action on the part of police, despite repeated complaints, hundreds of them staged a protest in front of the police station on Wednesday evening.\n\nThere are six Elephant Tank streets and over 6,000 residents.\n\n“On Sunday afternoon, a burglar tried entering my house while my family was not there. When he entered the house, my neighbours, Aamina and Mumin, locked the door from outside and he was nabbed,” said Habiba, a resident of Elephant Tank 6{+t}{+h}street.\n\nResidents claim that there were a few other burglars, who fled on seeing the women nabbing the thief.\n\n“But the police have not made any effort to catch them. For the past three years, we have been putting up with the continual burglary. It has increased in the past eight months,” claims 50-year-old Jalma, a resident.\n\nThe burglary takes place between 1.30 a.m. and 3.30 a.m. “Sometimes, they sprinkle some substance that puts people to sleep and steal with the lights on,” claims Aamina, the resident who caught the thief.\n\nResidents allege that the poorly-lit streets turn into a haven for anti-social elements, who smoke ganja and drink alcohol.\n\n“The policemen at Ice House station don’t take the complaints in the form we give them. They want us to sign in the complaint copy written by them. There is no patrolling in the locality,” claims Habiba.\n\nMeanwhile, police sources agreed that there have been thefts in the locality and said that a shortage of manpower had affected patrolling. “We need more personnel,” said a source. An officer at Ice House police station said that they had arrested a person in connection with the theft and remanded him. “There is no gang,” he said.\n\nRecently, residents of Elephant Tank 6th Street nabbed a robber by locking him inside a house", 
    "section": "national", 
    "title": "Where burglary is a routine occurrence", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}