{
    "author": [
        "Udhav Naig"
    ], 
    "text": "While political opponents pushing for a change in status quo have often been quick in faulting the two Dravidian parties for the all-pervasive corruption, the brutal murder of Dalit youth Shankar in Udumalpet has only drawn belated and reluctant criticism from the political class. This has set off a debate on whether parties in Tamil Nadu really offer an alternative.\n\nThough political leaders publicly came out against the murder of Shankar, there was widespread opinion that they did so only because they were subject to criticism from social media users, who, incidentally they are wooing as part of their campaign strategy. Pattali Makkal Katchi founder S. Ramadoss even refused to comment initially on the murder when specifically asked for a response during a press conference, and said “there are other important issues at hand”.\n\nK. Veeramani, President, Dravidar Kazhagam, opined that a strong-willed government could curb such incidents. “These murders are committed by powerful ‘hit-men’ in these places, hired by the parents of the bride. So, a pro-active police force can curb these incidents very easily. But the government needs the will to do so,” he said.\n\nAsked to comment on why former deputy chief minister Stalin, the face of DMK’s campaign, spoke about it only a day after the incident, Suba. Veerapandian, another Dravidian ideologue, said that he may have done so because this was the election season. “With the election upon us, everyone is busy. However, since then, not only our leader Stalin, but also the party’s spokesperson T.K.S. Elangovan has condemned the incident in strongest terms,” he said.\n\nRuminating on what could be done to prevent such incidents in future, he said “even passing new laws is not enough.” “We must remember that this murder is driven by the assertion of male ego that treats women as a man’s property. We need to push for social change and we need to work across party lines,” he said.\n\n‘Focus on three issues’\n\nRavi Kumar, General Secretary, Viduthalai Chiruthaigal Katchi, said any ‘alternative’ to the status quo must focus on three issues. “First, the constitution merely bans ‘untouchability’, but allows caste outfits to be run. This should change. Second, we need a reform of electoral system, which currently is based on ‘First Past The Post’ logic. Like the Election Commission had recommended in 2004 itself, if political parties are required to get 50 per cent of votes to win, then the political parties will have an incentive to maintain peace among various communities. We also need a strong legislation to curb hate speech against oppressed groups in the cultural space, which would include movies,” he said.\n\nFormer judge of the Madras High Court K. Chandru said top political leaders must refrain from participating in functions organised by caste outfits. “The alliances that are forged are mostly opportunistic, and with securing more votes as their primary objective, the alliance parties may not agree to a common minimum programme on the caste issue,” he said, adding, “Leaders must assure the victims of their positive support and must conduct campaigns for getting justice for the victims.”\n\nStating that a separate law is necessary to curb caste violence, he said political parties must come out with a clear plan to curb caste violence in their election manifestos. “The Madras High Court held that there is no legal basis for reservation for children born out of inter-caste marriages (ICM). That judgment must be reviewed and a sizable percentage of reservation should be made in educational institutions and employments as well as in the grant of state welfare assistance including housing,” he added.\n\nKathir, who runs the organisation called ‘Evidence’ and has documented cases of atrocity against the Dalits said that the parties could start by democratising themselves.\n\n“We need to start with proportional representation within each party. If AIADMK and DMK have 32 district secretaries, how many of them are Dalits? How many politburo members in Communist parties are Dalits? What is the point of just changing leaders without making any ideological change?” he asked.\n\n‘We need to\n\npush for social change and work cutting across\n\nparty lines’", 
    "section": "national", 
    "title": "With no magic bullet against casteism, call for a multi-pronged fight gets louder", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}