{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The assault on a 25-year-old conductor on Tuesday night has demonstrated yet again how vulnerable bus crew are to attacks from anti-social elements. Unions complain that there are specific routes on which the bus crew are often attacked.\n\nAccording to the police, Ponnusamy (25) works as a bus conductor on the MTC bus route 44C plying between High Court and Indian Oil Corporation. On Tuesday night, when the bus reached Tondiarpet, three passengers hopped onto the footboard around 8.30 p.m.\n\n“Since they did not have tickets, an argument broke out between the conductor and the passengers. When they got down, they slashed Ponnusamy’s left shoulder with a blade,” said a police officer. Ponnusamy was rushed to the Stanley Medical College Hospital for treatment. A complaint has been lodged with the Tondiarpet police station. “Based on the identification provided by Ponnusamy, we are searching for the suspects,” said a police officer.\n\nThis is the second attack on a bus conductor this month. A week ago, Thiruvengdam, an MTC bus conductor, was attacked by a passenger with a knife at Pallavaram bus stop. Venkatesan (27) attacked the conductor after an argument broke out between them over the purchase of tickets.\n\nSuch incidents have made the bus crew insecure. “Though all the stretches are dangerous for us, there are some routes which are very risky, especially those that have many colleges,” said K. Sekar, president, State transport employees union, affiliated to CITU.\n\nHe said that bus crew are often attacked on routes such as Poonamalee High Road, Thiruverkadu, Manali, Tiruvottiyur High Road, Kamarajar Salai and Nandanam. “Those who attack us are either college students or some anti-social elements,” he adds. “We are vulnerable as we are on the road. People can escape after assaulting us,” said he. Sekar says that neither the MTC management nor the police take any interest in pursuing complaints. “Any assault on the crew will affect our morale. Besides, many conductors are forced to withdraw the complaints fearing repercussion while travelling on the same route,” he said.", 
    "section": "national", 
    "title": "Yet another MTC conductor attacked", 
    "subsection": "tamilnadu", 
    "date": "2016-03-23"
}