{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The artificial pond which has been in disuse for several years at Mukkombu in Tiruchi.— PHOTO: B. VELANKANNI RAJ\n\nore than six years have passed since the toy train, which is one of the star attractions of Mukkombu (Upper Anaicut), fell silent. It is yet to come out of the shed to engage the children. The lock that hangs outside the shed is tagged with a message that the toy train is still in disuse, making the visitors particularly children to feel unhappy.\n\nIt is not that the toy train alone has been in disuse for so long. An artificial pond, which is supposed to be used for boat rides, is lying idle.\n\nA large number of people visit Mukkombu daily, situated about 15 km from Tiruchi, for an outing. Children and youth spend considerable time at the park situated on both sides of the barrage across the Cauvery.\n\nAlthough the children enjoy the visit with a few available facilities such as slides and swings, they express disappointment over the non-functioning of toy train and absence of a boat ride. Although the authorities had promised on various occasions to carry out repair and maintenance so as to resume the toy train operation, the promise has not become a reality, it is said.\n\nThe Public Works Department, which is maintaining the picnic spot and the Mukkombu barrage, planned to give a facelift to both toy train and artificial pond in the scheme announced by the State Government. However, both of them have not been reopened for public use.\n\nPointing out the absence of good picnic spots in Tiruchi, the visitors said that the toy train and artificial pond should have been refurbished long ago. Although many more new amenities could be created at the parks, the authorities should have taken steps to preserve the available facilities. They expect that the facilities will be reopened for the public use at least in the next few weeks so that they will serve the purpose of engaging the children during the summer vacation.", 
    "section": "national", 
    "title": "Amenities derailed at Mukkombu", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}