{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The banana plants on Vayalur Road in Tiruchi on Monday appeared to be withering because of scarcity of water.— PHOTO: B. VELANKANNI RAJ\n\nBanana growers have urged the Public Works Department to ensure water supply in the Uyyakondan canal to meet the requirement of the standing banana crop.\n\nWater should be released in the Uyyakondan canal up to May to ensure successful harvest of banana crop. It is being followed for several years in spite of closure of Metter dam in January, the farmers said.\n\nHowever, the supply of water in the Uyyakondan canal was stopped about two weeks ago apparently to facilitate the renovation work of the Uyyakondan canal taken up by the Public Works Department (PWD). But it has caused concern among farmers, who had raised banana crop on 12,000 acres of Uyyakondan canal ayacuts.\n\nField reports suggested that the standing crop, which was at the advanced stage of harvest, is facing the possibility of withering because of paucity of water in areas such as Kuzhumani, Vayalur, Vayalur Road, Athavathur, Pettavaithalai, Analai, Thiruparaithurai, Perugamani, Sirugamani, Kodiyalam, Pulivalam, Mullikarumbur, Somarasampettai, Nachikurichi and Ariyamangalam, Kattur, Pappakurichi and Thiruverumbur.\n\nFarmers say the standing crop was badly in need of water for a few more weeks only then banana would reach its full growth. But the sudden stoppage of water has made the banana plantations drying up fast.\n\nAyilai Siva Suriyan, district secretary, Tamizhaga Vyvasayigal Sangam, said stoppage of water supply had posed danger to the banana crop. If water was not released for a few more weeks, the standing crop could not be saved.\n\nHence, the government should reopen the canal immediately. The Public Works Department could continue the canal renovation work after May.\n\nMeanwhile, a group of farmers met Collector K.S. Palanisamy on Monday and demanded his intervention to release water in the Uyyakondan canal.\n\nThe crop has been raised on 12,000 acres on Uyyakondan ayacut", 
    "section": "national", 
    "title": "Banana farmers seek water release in Uyyakondan canal", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}