{
    "author": [
        "M K"
    ], 
    "text": "RAAC and ICCIC have decided to make it a poll plank\n\nTired of petitioning Ministers, politicians, and bureaucrats over the years seeking flights from Coimbatore International Airport to Dubai, a few associations have decided to use the social media to press the demand.\n\nResidents Awareness Association of Coimbatore (RAAC) and Indian Chamber of Commerce and Industry – Coimbatore (ICCIC) have also decided to make it a poll plank.\n\nVotes\n\n“In just a day our petition onwww.change.orgreceived more than 1,000 votes from residents and Coimbatore citizens living elsewhere,” said RAAC secretary R. Raveendran.\n\nHe told The Hindu that the petition has also been posted atwww.skyscrapercity.com, in various Coimbatore-related websites, Facebook, and Whatsapp groups.\n\nOn September 10, 2015, the ICCIC, and the RAAC petitioned Civil Aviation Minister Ashok Gajapathi Raju during his visit to the city seeking flights to Dubai. They sought inclusion of Coimbatore in the Bilateral Services Agreements (BASA).\n\nReason\n\nThey cited that the main reason foreign carriers are unable to operate from and to Coimbatore was the delay in including the city in BASA.\n\nThe Minister who was not in favour of foreign airlines capturing Indian markets, said that he would recommend Air India or the Air India Express to operate from Coimbatore to Dubai.\n\n“It is shocking to know that Air India Express has increased its summer schedule from Kerala to the Middle East from 96 flights to 119 flights, from March 28. Mangaluru, Amritsar, Vizag, and Chandigarh have enhanced connectivity with Dubai,” Mr. Raveendran said.\n\nDubai is the global transit point, which would enable connectivity to the whole of Europe, the U.S. and other remote countries.\n\nTo catch a flight to Dubai, citizens of Coimbatore have to go either to Kozhikode, or Bengaluru or Chennai. At present, Air Arabia was operating five days a week to Sharjah.\n\nMr. Raveendran said that the delay in the airport expansion here was not the reason for not introducing flights to Dubai from here. While a direct flight from Coimbatore to Dubai would take only about three-and-a-half hours, it takes nearly half a day to reach other airports through a connecting flight from here and wait for a flight to Dubai. While a passenger could carry up to 40 kg at no extra cost to Dubai, domestic airlines have a 15-kg ceiling – beyond which they are charged Rs. 250 a kg.\n\nAlternative modes\n\n“Commuters are now forced to find alternative modes of transport to seed luggage to other connecting airports to avoid this additional expenditure. international passengers flying from Dubai conveniently avoid Coimbatore, as it does not have a direct flight,” he added.\n\nThis affects foreign investments in this region, including Tirupur, Erode and Karur. Exports from this industrial belt, and tourists flow to The Nilgiris, too are affected, he said.", 
    "section": "national", 
    "title": "Campaign on in social media for Dubai flights", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}