{
    "author": [
        "Staff Reporter"
    ], 
    "text": "On Sunday , more than 20 officials and passers-by rushed to put out a fire that was spotted on a hillock in the Turahalli forest, which sprawls nearly 500 acres.\n\nTurahalli forest remains particularly vulnerable to fires\n\nThrough recklessness or intentional arson, the fires that have broken out in the past week at Turahalli forest on the outskirts of the city – one of the last bastions of pristine forests here – have been keeping forest officials on their toes.\n\nOn Sunday, more than 20 officials and passers-by rushed to put out a fire that was spotted on a hillock in the forest, which sprawls nearly 500 acres.\n\nThis come close on the heels of a major fire that broke out barely three days ago while minor fires have been reported in the area since the start of the ‘fire season’ – the dry months from winter to the monsoons.\n\nThe hilly terrain, which has almost no vehicular trails, poses a challenge. “We had to get the help of passers-by and visitors to break branches and beat the ground to douse the fire,” says Dipika Bajpai, Deputy Conservator of Forests (Bengaluru Urban), who was notified of the fire while on an inspection nearby.\n\nWith Bengaluru’s haphazard growth putting pressure on its borders, the forest remains particularly vulnerable to fires. Garbage is often piled up on its edges and late-night gatherings in the forest are common. Officials suspect that with encroachments at its boundaries, many of the fires could be intentional.\n\nMs. Bajpai said three watchers have been deputed at the forest to keep an eye on the fire. Officials had been trying to contain the spread of the blaze. Villagers and residents of the towering apartment complexes nearby have been roped in to report any fire to the department.\n\nSharath R. Babu, Honorary Wildlife Warden, said it is difficult to curb down on fires considering the unregulated entry of people into the area. “Parts of the forests have become sites for illegal dumping while a large number of visitors and construction workers use the spot as a recreation area,” he said.", 
    "section": "national", 
    "title": "City’s forest battles ‘man-made’ fires", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}