{
    "author": [
        "M K"
    ], 
    "text": "Actor Simbu at the office of the Assistant Commissioner of Police (Law and Order) in Coimbatore on Monday.\n\nTwo months after his ‘beep’ song drew strong criticism from a section of civil society for making vulgar reference to women, Kollywood actor Simbu alias Silambarasan on Monday appeared before the Coimbatore City Police and reportedly claimed that he had composed the song long ago when he was depressed due to a love failure.\n\nThe police posed 35 questions to the actor, who was accompanied by his father actor-director T Rajendar, at the office of the Assistant Commissioner of Police (Law and Order) Central Sub Division.\n\nOn December 14, the Race Course Police registered a case against Simbu and young music composer Anirudh on a complaint from an office-bearer of the All India Democratic Women’s Association (AIDWA) alleging that the actor had sang the ‘beep’ song composed by Anirudh. The song was not officially released, but was uploaded online.\n\nThe two were booked under Section 4 read with Section 6 of the Indecent Representation of Women Act, 509 (word, gesture or act intended to insult modesty of a woman) of the Indian Penal Code and Section 67 (publishing or obscene material in an electronic form) of the Information Technology Act.\n\nAnirudh who appeared before the Race Course Police on January 11, submitted that he had no role in composing the song. Simbu did not appear for inquiry and moved the Madras High Court, who asked him to appear before the Race Course Police here before February 24.\n\nQuestioned for 20 minutes\n\nOn Monday, accompanied by fans, the actor came to the office of the Assistant Commissioner of Police at Gandhipuram around 10 a.m where the Race Course Inspector V. Selvaraj questioned him for about 20 minutes.\n\nThe proceedings were videorecorded and the actor gave a written statement.\n\nPolice sources claimed that Simbu had told them that he had used his own instruments for composing music the song and that his friend Anirudh had no role in it.\n\n“He was unable to recall when he sang it. He also claimed that he did not know who released it in the social media,” a police source said.\n\n“I am not in a position to talk much. I am innocent and have cooperated with the police for inquiry. God will take care of the rest,” Simbu told newsmen after the inquiry.", 
    "section": "national", 
    "title": "Composed ‘beep’ song after love failure: Simbu", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}