{
    "author": [
        "S Ganesan"
    ], 
    "text": "The budget for 2016-17 makes no mention about bus stand in Srirangam\n\nA new integrated bus stand at a convenient location has been a long-pending demand of the people of Tiruchi.— FILE PHOTO: B. VELANKANNI RAJ\n\nThe continued silence of the Tiruchirapalli City Corporation over some of the long-pending development proposals, especially the integrated bus stand, in its Budget for 2016-17 has come as a big disappointment for residents.\n\nThe most glaring omission has been the proposal on setting up an integrated bus stand and also a bus stand for Srirangam. There is no word on the shifting of the Gandhi Market, an issue which recently provoked the traders of the market to go on a strike.\n\nAlthough the corporation has been making a token allocation over the past many years, there has not been any mention of the proposal on setting up the integrated bus stand in its Budget for the next financial year. For nearly two decades, the corporation has been unable to finalise a suitable site for the bus stand and the present council, whose term expires later this year, has failed to find a solution to the vexed problem.\n\nThe proposal to establish an integrated bus terminus in the city was initially mooted in the early 1990s but consensus has eluded the choice of a suitable location for the facility. Over the years, various sites have been considered at Devadhanam off the Tiruchi-Chennai Bypass, the Ariyamangalam compost yard, Ramji Nagar on the Tiruchi-Dindigul National Highway, and Kottapattu on the Pudukottai National Highway.\n\nThe previous Dravida Munnetra Kazhagam government had planned to set up the bus stand at Panchapur. A couple of years ago, a site near the Jail Corner was under consideration. A section of civic activists wants the government to get the defence land in Mannarpuram for setting up the bus stand.\n\n“It is a disgrace that a site for the bus stand has not been identified for a city that is vying to become a smart city. In the absence of the a proper bus stand, the authorities have been forced to set up temporary bus stands during festival seasons,” points out H. Ghouse Baig, secretary, Golden Rock branch of the Consumer Protection Council, Tamil Nadu.\n\nSimilarly, a move to set up bus stand for Srirangam announced a couple of years ago has not been pursued. The corporation, in its Budget 2012-13, had unveiled a plan to build a bus stand at Srirangam. The corporation had earmarked Rs. 9 crore for the project. Subsequently, a 6.6 acre site was identified near the Yatri Nivas. Although a major tourist attraction, the Srirangam island, which lies sandwiched between the Cauvery and Coleroon rivers, does not have a proper bus stand. Town and mofussil buses and tourist vehicles have to be parked on the roadsides.\n\nThe town with a population of about 1.02 lakh, attracts a floating population of about 20,000 every day. Nearly 300 tourist vehicles visit the town on an average every day.\n\nAfter making some unsuccessful attempts to relocate some of the wholesale vendors of the Gandhi Market, the corporation now seems to have given up the move.\n\n“It is regrettable that corporation council has failed to strengthen the civic infrastructure over the past five years. It doe not have many projects to show as achievements,” said N. Ramakrishnan, founder, MGR Nalpani Mandram.\n\nMajor issues\n\nA search has been on for a suitable site for the bus stand\n\nRelocating the Gandhi Market has been another vexed issue", 
    "section": "national", 
    "title": "Corporation silent on bus stand", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}