{
    "author": [
        "C Jaisankar"
    ], 
    "text": "In an attempt to enable the slum dwellers to cook in an eco-friendly manner, the Tiruchirapalli City Corporation has set up a community kitchen with a bio-methanisation plant at Viragupettai in Ariyamangalam.\n\nThe residents of the area can use the community kitchen by remitting nominal charges, which is to be used for operation and maintenance of bio-methane gas plant.\n\nFifteen gas stoves have been set up in the kitchen for the use of residents. All of them have been connected with bio-methane fuel gas pipe from the 30-cubic meter capacity plant. It is expected that it will generate at least 22 cubic meter of bio-methane gas daily.\n\nThe facility was launched at a function by R. Manoharan, Chief Whip in the State Assembly, on Monday.\n\nAlthough the time and user charges were yet to be decided, interested residents will be allowed to use the facility for three hours daily in the morning.\n\nAccording to an estimate, there are 200 families living in Viragupettai. They have been categorised as slum dwellers. Many of them were still using firewood for cooking. The new facility would not only provide an opportunity to get exposure on using eco friendly gas-based cooking but also shun the practice of using firewood.\n\nA senior official of the corporation told The Hindu that Rs.40 lakh had been spent on the project, which was first its kind in the city. The main aim was to create awareness among the poor people, who still used wood as fuel for cooking.\n\nThe operation and maintenance of the kitchen and gas plant would be handed over to a self-help group. It would collect cow dung, vegetable waste, food waste, and others so as to use them as raw material for producing bio gas. The group could collect a nominal fee from the users to operate the plant.", 
    "section": "national", 
    "title": "Corporation sets up community kitchen with bio-gas plant", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}