{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District Judge R. Poornima adjourned the temple pujari suicide case till March 1 on Monday as the copy of the Madras High Court’s order to appoint the petitioner’s lawyer as public prosecutor to hear the case did not reach the district administration.\n\nAll the seven accused, including the prime accused, O. Raja, brother of Finance Minister O. Paneerselvam, appeared before the court in the morning. However, petitioner Subburaj and his lawyer did not appear. Defence counsel S. Kannappan informed the court that the trial could be conducted on the arrival of the new lawyer. Then the judge adjourned the case.\n\nSources said that the district administration had not received the copy of the High Court’s order regarding the appointment of a new lawyer, as sought by the petitioner, instead of the Public Prosecutor. The Collector would have to issue an order on the appointment of a Public Prosecutor as directed by the High Court.\n\nBut the Collector would certainly consult the Government Pleader in the High Court before appointing the lawyer preferred by the petitioner. Then, the new lawyer would present the copy of the appointment order in the court and argue the case on behalf of petitioner, the sources added.\n\nLater, the case would be heard on a daily basis as directed by the Madurai Bench of the Madras High Court.\n\nEarlier, Collector T.N. Hariharan had turned down the demand of the petitioner to change the Special Public Prosecutor.\n\nCharges were framed against Mr. Raja and others on December 15.\n\nTheni District Court transferred the case to Dindigul District Court on November 25 on the direction of the Madurai Bench.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam, on December 8, 2012, after he was allegedly subjected to harassment.\n\nThe district administration has not received copy of HC order for appointment of a lawyer", 
    "section": "national", 
    "title": "Dalit temple pujari suicide case hearing posted to March 1", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}