{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Strong criticism has emanated from political parties and social outfits against authorities following the death of an eleventh standard boy, M. Mohamed Suhail who was studying in 11th standard at Petit Seminaire Higher Secondary School.\n\nHe had collapsed while running on the track during the state-level athletic event held at the Indira Gandhi Sports Complex on Sunday. They attributed the unfortunate incident to the lax attitude of authorities.\n\nGuidelines not followed\n\nThe guidelines of Sports Authority of India have not been followed while conducting any sport event in Indira Gandhi Sports Complex, Congress party said.\n\nCondemning the organisers of the event and authorities, A.V.Veeraraaghavan, spokesperson of Pradesh Congress Committee said the guidelines of Sports Authority of India clearly stipulates that there should be an ambulance, first aid kit, fire extinguisher and drinking water in the venue of sports events. But none of them were followed by the organisers on Sunday.\n\nAIADMK Legislature Party Deputy Leader A.Anbalagan said the young boy died due to the negligence of the amateur athletic association and lax attitude of the government. He also said when over 750 students were participating in the event, there was no doctor, ambulance and first-aid team to render any medical assistance.\n\n“It is not right on the part of the government to have permitted the event when there is no proper athletic track. Again when the boy was struggling for his life, nobody came forward to extend first aid and he was taken in an auto, instead of an ambulance, by the organisers ,” said Mr. Anbalagan while adding that government should ensure that such incident do not recur.\n\nThe MLA demanded the Chief Minister N.Rangasamy to release Rs.10 lakh solatium to the bereaved family of the boy.\n\nMeanwhile police registered a case under section 174 of Criminal Procedure Code for the mysterious death.", 
    "section": "national", 
    "title": "Death of young athlete draws criticism", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}