{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A large number of devotees took a holy dip and offered worship at ‘Jada Maguda Theertham,’ in which, according to legend, Lord Ram washed off his hair (jada) in the tank after killing Ravana to purify himself, on the occasion of Mahamaham festival on Monday.\n\nThe devotees thronged the Siva Temple on Dhanushkodi Road, about eight km from here, right from the morning to take part in the festival, organised once in 12 years, coinciding with the famed Kumbakonam Mahamaham festival. The festival began after the ‘Panchamoorthis’ left Ramanathaswamy Temple in Rameswaram around 7 a.m. in a procession to the Jada Theertham temple. Lord Ramanathaswamy and his consort Goddess Parvadhavardhini Ambal were carried on a ‘Rishaba Vaganam’ along with Vinayagar, Subramaniyar with Valli Deivanai, and Chandigeswarar.\n\nAfter the Panchamurthy procession reached the Jada Theertham temple around 11.30 a.m., priests performed special pujas after which ‘theerthavari’ was performed. Soon after the ‘theerthavari’ began, holy water drawn from the tank was sprinkled on the devotees. Sprinklers were installed near temple to avoid scramble, Joint Commissioner of the temple S. Selvaraj and Assistant Divisional Engineer K. Mahivahanan said.\n\nConsidering safety aspects, the devotees were not allowed to get into the tank, they said. The festival drew to a close around 5 p.m.\n\nAfter ‘Maha Deepam Aradhana,’ the ‘Panchamoorthis’ were brought back to the Ramanathaswamy temple in a procession. The temple remained closed till they returned late in the evening. The police had installed CCTV cameras at 22 places and monitored the security after deploying about 1,200 police personnel.\n\n“Everything went off well and there was no untoward incident,” Superintendent of Police N. Manivannan said. Inspector General of Police (south zone) S. Murugan and Additional Director General of Police (Coastal Security Group) C. Sylendra Babu supervised the security arrangements.", 
    "section": "national", 
    "title": "Devotees throng Jada Maguda Theertham", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}