{
    "author": [
        "Dennis S"
    ], 
    "text": "The National Green Tribunal’s Southern Bench here has declined to accept the plea of the Ministry of Environment, Forests and Climate Change, which sought to exempt certain information relating to 2×660 MW coal-based thermal power plant in Nagapattinam district from the purview of certain sections of the Right to Information (RTI) Act, 2005.\n\n“..a project like the one in question is being processed in which public interest is involved either in the way of protection of environment or protection of industrial development, fairness requires transparency at each level so that the attainment of sustainable development will have some purposeful meaning,” the Bench comprising Justice P. Jyothimani and expert member R. Nagendran said.\n\nThe Bench rejected a memo filed by the Ministry and further permitted the counsels appearing for appellants and other respondents to peruse the records pertaining to M/s. Sindya Power Generating Company Pvt. Ltd in the chambers of the NGT Registrar between February 24 and 26.\n\nThe Bench was dealing with a batch of appeals, which challenged clearances given by the Ministry granting M/s. Sindya Power Generating Company Private Limited to set up the plant in Perunthottam and Agara Perunthottam.\n\nIt may be noted that during the course of the hearing, though the entire set of original files were submitted along with one set of photocopies by the Additional Solicitor General, some pages were missing in the photocopies, when the law clerks compared them with the original files . The bench’s order has listed out the details of pages that were missing.\n\nThe tribunal had directed the Ministry to produce all documents relating to the case. Though they were submitted, the counsel appearing for the Ministry had objected to counsels of appellants and respondents perusing those documents contending they contained “sensitive documents and official communications.”\n\n“We do not see any reason to accept the contention raised by the 1st respondent [Ministry] that disclosing information may affect sovereignty and integrity of India or security, strategy or scientific or economic interest of the State or lead to incitement of an offence or affecting relationship with foreign State. It is certainly not any personal information which is exempted,” the bench added.", 
    "section": "national", 
    "title": "Disclose documents relating to thermal power plant: NGT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}