{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It was formulated in consultation with economists, civil servants\n\nThe first part of the DMDK manifesto released on Saturday puts the party’s focus on rural population, with schemes that offer monetary support to the elderly dominating the document.\n\nParty insiders state the move was strategic since the DMDK’s presence in the rural areas was much wider than its support base in cities.\n\nThe video released at the party’s Kancheepuram rally stated that the contents were formulated after wide discussions with economists and civil servants from across the country.\n\nThree important sections have been targeted with retirement schemes. The manifesto said farmers, weavers and fisherfolk over the age of sixty would be provided monetary support of Rs. 2,500 a month. For farmers, this would be applicable only if they do not possess land.\n\nAll farmers will be provided machinery at subsidised rates. The documents stated that steps would be initiated to ensure that the State procured all agricultural, horticultural and poultry produce to help ryots get better rates.\n\nA scheme named after former President A.P.J. Abdul Kalam would be put in place to come up with ideas that will ensure a monthly income of Rs. 25,000 for one person in a rural household.\n\nOn the education front, the party proposed to introduce a breakfast scheme for students in government schools. “A light breakfast that includes eggs, milk and porridge would be given to students,” it said. One thousand girls’ schools would be converted into evening colleges so that they could access higher education without any hurdle. Every school will also have a HR consultant who will assess the skills of students.\n\nThe party said if voted to power, it would establish 24-hours hospitals in all taluks. Shopping malls would be established in all taluks in association with private players. Each mall would have 200 to 500 stores that would help the trading community improve its profits. These malls will also have three to five cinema halls. While the manifesto proposes to expand the reach of education, one aspect that could come under criticism is the proposal to have separate schools and colleges for the third gender. Activists have consistently stressed on the need to mainstream the third gender and not segregate them in exclusive schools.\n\nFarmers, weavers and fisherfolk over the age of 60 would be provided monetary support of\n\nRs. 2,500 a month", 
    "section": "national", 
    "title": "DMDK manifesto eyes rural votes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}