{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The DMK and the DMDK on Monday commenced the process of interviewing candidates aspiring for a party ticket to contest the upcoming Assembly election in Tamil Nadu.\n\nAt the DMK headquarters Anna Arivalayam here, party president M. Karunanidhi and senior leaders, including general secretary K. Anbazhagan and treasurer M.K. Stalin, interviewed aspirants from the districts of Kanyakumari, Tirunelveli, Thoothukudi, Ramanathapuram, Virudhunagar, Dindigul and Theni.\n\nCandidates were asked about the party’s electoral prospects post an alliance with the Congress and the number of years they have been active members of the party, their educational qualification and spending capacity for the elections.\n\nAt the DMDK headquarters in Koyambedu, party president Vijayakant asked candidates on their preference on electoral alliances. An aspirant from Tiruvallur, on condition of anonymity, said the leader wanted to know if he would be committed to contest the elections if the DMDK chose to face the polls alone.\n\nIn fact, number of aspirants said the same question was put to them. To some, the interviewing team asked what the best alliance combination would be for the party in the particular constituency.\n\nAnother crucial aspect queried was whether the interviewee was part of Mr. Vijayakant’s fan club before joining the DMDK or if the person came after 2011 elections when the party managed to win 29 seats. Some felt those who were originally part of the fan club may be given preference during ticket distribution.\n\nFurther, the team also questioned the financial strength of the aspirant.\n\n“I was asked to give an honest view of my financial situation. They did not want me to waste all my savings and get into debts,” another aspirant said.\n\nAn interview typically lasted five to ten minutes with Mr. Vijayakant asking the aspirant about the demography of the constituency and the issues facing it.\n\nBoth parties wanted to know financial strength\n\nof aspirants and their education", 
    "section": "national", 
    "title": "DMK, DMDK begin interviews", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}