{
    "author": [], 
    "text": "I had a pleasant experience while visiting Kumbakonam on Mahamaham final day. There were sufficient number of toilets on both sides of the road. The car could go into town and get space for parking. The police and those manning the guidance kiosks were courteous. Arrangements for bathing and changing were adequate on the Cauvery banks.\n\nRamesh Krishnan,\n\nSrirangam\n\nPoor planning on\n\ntraffic regulation\n\nThough the police have made elaborate arrangements in Kumbakonam for Mahamaham, they did not regulate the vehicular traffic. Even the two-wheeler riders were finding it difficult to return home just 6 km from Kumbakonam after taking a holy dip in the tank. Traffic diversions caused delayed and people had to take a detour. Even vehicles which were headed beyond Kumbakonam stopped even on the bypass by the police. On February 20, we were stopped and asked to go to the parking lot. We had to return to Tiruchi via Tiruvaiyaru. We found that there hardly any traffic on Papanasam road. Police could have drawn up a map and allowed people travelling beyond Kumbakonam on this road.\n\nThirumeni J.,\n\nCantonment, Tiruchi\n\nAriyalur-\n\nThanjavur line\n\nRailway Minister Suresh Prabhu on February 7, laid the foundation stone for a new broadgauge line from Chinna Salem to Kallakkuruchi. This makes it a third line between Salem and Chennai. The railways should similarly look at reopening the Thanjavur-Ariyalur broadgauge line. The line should start from Thittai Railway Station near to Thanjavur Junction – en route Thanjavur-Chennai main line.\n\nN. Natarajan,\n\nThanjavur\n\nJan Dan account\n\nonly on paper?\n\nThe people of Konerirajapuram village in Kuthalam taluk of Nagapattinam district not able to benefit from the no-frills bank account launched under the Prime Minister’s Jan Dan Yojana. The ICICI Bank Branch in Konerirajapuram and the Indian Overseas Bank branch at Kodimangalam are not extending this facility to account holders stating they have no instructions. The village panchayat passed a resolution and urged the District Collector also passed requisite resolution in this regard and submitted the same to the Nagapattinam District Collector to look into this. But action has not been taken.\n\nS. Viswanathan,\n\nKonerirajapuram\n\nBus to SASTRA\n\nirregular\n\nThe TNSTC buses operated for the benefit of SASTRA University students in the evening are irregularly, leaving the students in the lurch. Many days, the buses leave even before the college hours. The timing of the bus should be in accordance with the closing hours of college as the bus runs between Thanjavur Old Bus Stand and SASTRA University only in the evening.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nProtect\n\ntemple land\n\nIn a swift action by the Revenue Department, Hindu Religious and Charitable Endowment Department and the local administration, all the temple land encroachments were evicted in Kumbakonam and surrounding villages. Among the encroachments, some of them were blocking the temple entrance which forced the devotees to enter the temple through side gate instead of the main gate. Devotees are thankful to the authorities for the commendable job. A fencing has been put up by the HRandCE department at the place. The departments concerned should not follow this up by publishing the list of sites where evictions were carried up and raise Nandavanam.\n\nM. Baluswamy,\n\nKumbakonam\n\nRestore order\n\nin Nachiarkoil\n\nThe local panchayat, the highways, the police and other regulatory authorities have turned a blind eye the happenings in the bazar of Nachiarkoil. It is congested and accident prone. Any vehicle takes more than 15 minutes or more to cross this bottleneck and since the road is used by the heavy trucks from Nagappattinam and other industrial sites, major accidents could occur any time. A parking area can be defined. The bazar can be declared no parking area. All the encroachments should be impartially removed. The autorickshaw stand can be relocated.\n\nSheik Abdul Kadhar H.,\n\nNaachiarkoil\n\nA laudable move\n\nChief Minister Jayalalithaa’s announcement that senior citizens aged 60 and above can enjoy a free ride in MTC buses and the extension of this pilot scheme will soon be fulfilled in other parts of the State is another gem in her crown.\n\nR. Pichumani,\n\nThippirajapuram", 
    "section": "national", 
    "title": "Excellent arrangements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}