{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Philomin Lotus will never forget the night of August 6, 1980. It was 9 p.m. when a constable informed her husband V. Palanisamy, inspector of Jolarpet station, about a gruesome naxal attack on a “wealthy” man.\n\n“He was going to bed, but rushed out for duty following this information. I was filled with fear, but he asked me not to be afraid and that he had people to support,” said Ms. Lotus. A day later, she was informed that her husband had succumbed to injuries in a bomb attack carried out by naxalites.\n\n“Our family was shattered. I was standing there with two little daughters, aged 10 and four years. It was a huge blow to the family,” she added. As she was working as a postgraduate assistant in Katpadi Higher Secondary School, the then Chief Minister M.G. Ramachandran granted transfer to her native district of Nagercoil where Ms. Lotus brought up her daughters with the support of her parents.\n\n“I also met the Chief Minister when the government presented the gallantry award. He named the operation against naxalites after my second daughter, Ajantha. My husband was sincere in his work, and the killing came as a rude shock to us,” she said. Ms. Lotus, now aged 69 years old, retired as headmistress of a government school. “The accused deserves to be punished. It would have been better if justice had come early,” she added. Chelliah Murugesan, eldest son of C. Murugesan of the Tamil Nadu Special Police, was seven years old when his father was killed in the naxal attack. “I was the eldest of three sons. My mother was given a government job, but it was a struggle for us after my father’s death,” he said.\n\nAs a tribute, the police department established a memorial on the premises of the Tirupattur Town police station on August 6, 1982.", 
    "section": "national", 
    "title": "Families happy with the sentence", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}