{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Aggrieved over the poor condition of paddy crop, farmers from Athangarai village in Vilathikulam taluk thronged the Collectorate here on Monday carrying withered paddy crop.\n\nV. Uthandaraman, president, Farmers’ Club of Athangarai, who led the aggrieved farmers, sought the intervention of the district administration to ensure release of water to save the paddy crop.\n\nRelying on a small pond, ‘siria kulam’ at Athangarai, as source of water, the farmers had cultivated paddy crop on 500 acres. But, there was no water in the pond and the paddy crop had started withering. Hence, they requested the district administration to release water from the Irukkankudi dam.\n\nIf the paddy fields were deprived of water for some more days, the crop would wither away in the entire cultivated area. . If water was not released, these farmers could face a huge loss. Hence, they sought a compensation of Rs. 25,000 per acre of withered paddy crop.\n\nMoreover, basic facilities such as roads, public hygiene and bus services were not adequate in the village. A petition to this effect was submitted to Collector M. Ravikumar.\n\nCompensation sought\n\nFarmers under Tamirabharani Irrigation Banana Farmers’ Protection Forum had urged the district administration to determine a reasonably fair price for banana.\n\nK. Kandasamy, coordinator of the Forum, who led the farmers, said that bountiful rains during the northeast monsoon season had done extensive damage to banana fields in the district.\n\nWhile about Rs. 100 was expended on raising a bunch of bananas, the bunch could be sold only at Rs. 20 to Rs. 25.\n\nSince the farmers had suffered a huge loss, the government authorities should include banana in the menu under the noon meal scheme, he said.\n\nThe government should also facilitate export of bananas to benefit the farmers.\n\nHe said that several banana farmers, who suffered crop loss during the rainy season, had not been included for distribution of compensation.\n\nThey submitted a petition to the Collector in this regard.", 
    "section": "national", 
    "title": "Farmers seek release of water from dam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}