{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Site identified for model college at Thiruthuraipoondi\n\nWork on the construction of the Bharathidasan University Model College is fast apace at Maharajapuram Keezhpathi village near Vedaranyam in the district. The work which is being executed at an outlay of Rs. 7.25 crore, on an area of 4.08 hectares, is executed in fast phase and will be completed in course of time. The building would have ground floor and two floors. The plinth area is 1,551 square metres for the ground floor and 1,529 sq. m. for the first and second floor each, according to university sources.\n\nThe college caters to the educational needs of the students belonging to the economically weaker sections in rural areas. Vedaranyam was identified for the institute as a large number of students from higher secondary schools in the area now rely on colleges located at distant places.\n\nWork on the construction of the new building for the Bharathidasan University model college at Perunavalur in Aranthangi in Pudukottai district commenced at this site about one-and-a-half months ago had been declared open recently. The area is 4.08 hectares. The estimated expenditure for the building was Rs. 7.97 crore as it involved some additional expenses for levelling.\n\nAs for the model college at Tiruthuraipoondi, the district administration had identified a site at Tandalaicherry about 7 km from Tiruthuraipoondi. Tenders are called for the college at Tiruthuraipoondi, sources told The Hindu on Monday. The site belonged to the Hindu Religious and Charitable Endowment Department and it needed some departmental procedure for transferring the land. The college would be built at an estimate of Rs. 7.25 crore.\n\nThe University Grants Commission would sanction one-third of the estimate for the construction of these model college buildings.\n\nSources said the site for the construction of the new building for the Constituent College, Lalgudi, had been identified at Kumulur. In fact, the estimate for the college was Rs. 7.97 crore as it involved additional expenditure for formation of road for access to the site.\n\nIn Nagapattinam, the district administration had identified the site of four hectares, also belonging to the HR and CE Department, at Sellur village. Work for the foundation structure was in progress at Nannilam.", 
    "section": "national", 
    "title": "First phase of Bharathidasan varsity college almost ready", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}