{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Water has been affected with microbial contamination after the Adyar swelled beyond its capacity.— Photo: K. Pichumani\n\nAfter the devastating floods that wreaked havoc in Chennai, residents living close to Adyar river have another problem to deal with – contaminated groundwater.\n\nGroundwater in several areas along the banks of the Adyar has been affected with microbial contamination after the river swelled beyond its capacity during November and December last year, according to a study made in 26 areas. A research team from the Department of Geology and Centre for Biotechnology, Anna University, found that the total bacterial content, which must be nil for drinking water, has increased up to 24,000 colony-forming unit (cfc/ml) per ml in some locations near Maraimalai Adigal bridge, Saidapet.\n\nIn Ramapuram, water samples from places such as MGR Garden and Gandhi Nagar have shown microbial contamination and presence of E-coli of up to 2,000 cfc/ml.\n\nS. Murugan, a resident of Ramapuram said, “Well water in many areas close to Adyar river has turned murky. But, residents have not complained much as they get water through public taps and street supply.”\n\nAnna University research scholars Gokul Praveen N. and S. Ramachandran took groundwater samples from areas close to the river bank stretching from Chembarambakkam to Besant Nagar.\n\nThe study covered locations such as Nandanam, MRC Nagar, Adyar and Anakaputhur during December and January and analysed samples for the presence of eight parameters in total bacterial content. Drinking water contaminated with such content could cause health problems such as typhoid and diarrhoea.\n\nOne of the striking findings by the research team is that groundwater in areas located even 700 metres away from the river has been contaminated as the river swelled beyond its banks during the floods.\n\nL. Elango, Professor, Department of Geology, Anna University, said that as the river’s flow was much above the top of the wells, sewage content and leachate from garbage that was usually confined to the river boundaries mixed with groundwater. Some locations in Besant Nagar had better groundwater quality compared to other areas closer to the banks. The floods had improved parameters like total dissolved solids in groundwater.\n\nUsha Antony of Centre for Biotechnology said that they had to analyse the samples for over a month to find out if the bacterial content thrived in sewage. The bacterial content was expected to come down only if a fresh bout of heavy showers hit Chennai.\n\nExperts advise residents to chlorinate or boil the water before consumption.", 
    "section": "national", 
    "title": "Groundwater along Adyar banks contaminated after floods", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}