{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Adi Tamilar Viduthalai Munnani representatives at the Coimbatore Collectorate on Monday seeking action on sale of toddy on the outskirts of the city. (right) Saravanan who attempted self-immolation with his wife at the Collectorate.— Photos: M. Periasamy\n\nAdi Tamilar Viduthalai Munnani representatives petitioned the District Collector on Monday alleging sale of toddy with intoxicating substances mixed in it in rural Coimbatore.\n\nDistrict secretary R. Rajendran alleged that intoxicated toddy was served primarily in pockets where persons from downtrodden communities lived in large numbers. Intoxicating substances were added to toddy to make the consumers feel dizzy and this posed a threat to their lives.\n\nHe said that such incidents were happening primarily in Sulur, Karamadai, Negamam, Annur and Thondamuthur. Mr. Rajendran said that some anti-social elements were behind it and that repeated representations they made to Prohibition Enforcement Wing police went in vain. The members appealed to the district administration to enforce ban on such illegal sale and take action against persons involved in such activities.\n\nBenefits sought\n\nEmployees of a leading chain of bakeries in Coimbatore sought intervention of the district administration to help them get the various financial benefits that are due to them over the last nine years. The labourers claimed that around 50 of them worked for the bakery that had branches at Brookefields Mall, on Avanashi Road and at Saibaba Colony and its production unit at Olympus on Trichy Road.\n\nThey claimed that their employer forced them to work for 12 to 14 hours a day, but refused to give them the promised extra pay. He also deducted provident fund from their salaries, but claimed that he had not deducted it. They also complained of poor workspace and hazardous work environment.\n\nThe labourers said that one of them quit the job earlier this month and asked for those benefits and the employer lodged a complaint against him with the Central Crime Branch police stating that he swindled Rs. 8 lakh. “The employer is threatening to lodge similar complaints against us,” they said.\n\nSelf-immolation bid\n\nSaravanan (47) of Mettupalayam and his wife Parameswari were stopped by the police when they tried to set themselves ablaze by dousing themselves with kerosene at the grievances redress meeting. They claimed that some government officials had by mistake given patta for a piece of land belonging to another person and this blocked the way to their house.\n\nThe couple said that they had already petitioned the Collector in a grievances redress meeting last month and that no action had been taken to cancel the patta.", 
    "section": "national", 
    "title": "‘Intoxicating substances mixed in toddy’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}