{
    "author": [
        "M K"
    ], 
    "text": "Based on a direction from the Madras High Court on February 3, investigation of a multi-crore bank fraud, conducted by the Race Course police, is all set to be transferred to Central Bureau of Investigation (CBI) by the end of this month. A senior police officer here said that they are awaiting orders for transferring the case.\n\nCase registered\n\nIn June 2013, the Race Course (Crime) police registered a case against four persons, two jewellers N. Ashok and his brother N. Balaji, who owned jewellery outlets on Big Bazaar Street, Telungupalayam and on Cross Cut Road, and their accomplices Nagendran and Manoharan.\n\nAshok and Balaji pledged documents of their properties in the Commercial Branch of State Bank of India on Tiruchy Road and borrowed Rs. 60 crore in two phases. Using the money, they floated Lavanya Gold Jewels India Private Limited at Tatabad in early 2013.\n\nAs they failed to repay the loan for three months, the bank authorities went to the establishment only to find it locked and realised that they were cheated.\n\nThey could not recover the money by selling the pledged properties, as the accused had pledged the same documents fraudulently with Indian Overseas Bank for Rs. 14 crore and also obtained Rs. 5 crore from Corporation Bank.\n\nBased on a complaint from Deputy General Manager of the Bank K. Siddha Reddy, the Race Course police registered a case against them under Section 420 (cheating and dishonestly inducing delivery of property) in the first week of June 2013. Subsequent complaints were registered on them based on complaints lodged by the authorities of the other banks and customers who were cheated by them.\n\nInsolvency petition\n\nMeanwhile, the jeweller duo filed an insolvency petition before the first additional subordinate court in Coimbatore that they were bankrupt and they had debts for Rs. 136.36 while their assets were worth only Rs. 79.35 crore. They claimed heavy loss in business as reason for their bankruptcy.\n\nA police officer here hinted that the transfer was based on an office memorandum of the CBI (dated August 24, 2012) that scams below Rs. 3 crore could be probed by the local police and those between Rs. 3 crore and Rs. 25 crore by Anti-Corruption Wing of the CBI.\n\nWhen the money involved was more than Rs. 25 crore the case should be handled by the Bank Fraud Cell of the CBI.", 
    "section": "national", 
    "title": "Investigation of multi-crore bank scam to be transferred to CBI", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}