{
    "author": [
        "Special Correspondent"
    ], 
    "text": "AIADMK cadres taking out a procession with milk pots in Madurai on Monday as part of Chief Minister Jayalalithaa’s 68th birthday celebrations.— Photo: S. James\n\nCadres of the All India Anna Dravida Munnetra Kazhagam, mostly women, took out a massive milk pot procession in the city as part of the 68th birthday celebrations of Chief Minister and party supremo Jayalalithaa on Monday.\n\nOrganised by the Minister for Cooperation and party’s secretary of urban district unit, K. Raju, the procession started from the Vaigai river bed along the Kalpalam causeway and wound through the Masi Streets to reach the Sri Dhandayuthapani Temple on Netaji Road.\n\nHundreds of women had congregated at the riverbed early in the morning. Though the procession was slated to leave at 7.30 a.m., it started only at 9.20 a.m.\n\nAfter a special puja in which Mr. Raju, Revenue Minister R.B. Udhayakumar, Madurai MP R. Gopalakrishnan, Melur MLA R. Samy, and several councillors took part, the procession began with ‘mayil’ kavadi, followed by a few people who had pierced their cheeks with long spears (‘paravai’ kavadi).\n\nHuge hoardings of the Chief Minister were erected at the venue. The partymen had decorated the venue with party flags.\n\nTraffic diverted\n\nThe city police had made traffic diversions on several arterial roads to prevent congestion on the Albert Victor Bridge, Kalpalam, Simmakkal and Yanaikkal.\n\nAll the vehicles, including buses and two-wheelers, were diverted through Nelpettai from the AV Bridge to facilitate the procession that crossed the Yanaikkal and Vakkil New Street. Similarly, buses proceeding to Mattuthavani integrated bus stand from Periyar bus stand were diverted through South Marret Street, Kamarajar Salai and Kurivikkaran Salai.\n\nVehicles from Arapalayam bus stand were diverted via Sellur road over bridge to reach Mattuthavani.\n\nThough the police said that school-going children were not affected in the traffic diversion as the procession started much after the morning school timings, office-goers were caught unawares by the sudden traffic diversions.\n\nMany road users frowned upon the celebrations that affected free flow of traffic, while some complained of making circuitous journey under the hot sun.\n\nVehicular traffic was disrupted on the Masi Streets, which have one-way traffic regulation, as the serpentine procession went through the North Masi Street and West Masi Street.\n\nBesides, the huge congregation at the temple also led to traffic disruption for nearly an hour.", 
    "section": "national", 
    "title": "Jayalalithaa’s birthday fete: hundreds take out milk pot procession", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}