{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Judicial Magistrates have no authority to order a change in investigating agency, much less a probe by Crime Branch-Criminal Investigation Department (CB-CID), if they are not satisfied with the investigation conducted by local police in criminal cases, the Madras High Court Bench here has held.\n\nJustice C.T. Selvam said that Judicial Magistrates could at the most direct the local police to conduct further investigation in appropriate cases since the power to change investigating agencies was reserved for the higher courts. He also relied upon a 2015 Supreme Court ruling to substantiate his conclusion.\n\nThe order was passed while allowing a petition filed by CB-CID sleuths in Tiruchi in 2010 challenging a direction given to them by a magistrate to investigate a complaint lodged by a 62-year-old man accusing his elder sister of having stolen a teak cot and a few utensils from his house after threatening to murder him.\n\nPointing out that Woraiyur police had registered an FIR in 2006 and filed a negative final report in 2007, the judge said that the complainant had nevertheless managed to make the local police reinvestigate the case in the same year by filing multiple petitions before the High Court as well as the lower court. When the police filed a negative report once again in 2008 since the complainant as well as his sister were found to be living under the same roof at the time of alleged incident, he filed a petition seeking change of investigating agency and the Magistrate too ordered a CB-CID probe in 2009.\n\nMr. Justice Selvam set aside the Magistrate’s order and ordered that the FIR registered by the police as well as all proceedings related to it should also stand quashed.\n\nCB-CID appealed against magistrate’s ruling ordering probe into theft case", 
    "section": "national", 
    "title": "Judicial Magistrates can't order CB-CID probe: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}