{
    "author": [
        "B Kolappan"
    ], 
    "text": "Sivakozhunthu, Azhaganambiya Pillai and K. A. Thangavel Pillai are the big names from the town\n\nIn modern times it is T. Jankiraman’s Moha Mul (The Thorn of Passion) that captured the distinct flavour of Kumbakonam. Notwithstanding his sniping at the polluted waters of the Mahamaham tank, long after one puts down the novel, the reader will be haunted by the various dimensions of Carnatic music, as delineated by the author.\n\nCoincidentally, some of the best Carnatic musicians were either born in Kumbakonam or made it their home.\n\n“When I started learning mridangam, my father was particular that I should emulate the style of Kumbakonam Azhaganambiya Pillai. The sound ‘theem’ was not produced as effectively by anyone as Pillai,” recalled noted mridangist Umayalpuram K. Sivaraman, a resident of Kumbakonam, where his father Kasi Viswanatha Iyer practised medicine.\n\nMany musicians, including late Semmangudi Srinivasa Iyer, made Kumbakonam their home for sometime of their career. Srinivasa Iyer enjoyed the patronage of ghatam player Umayalpuram Kothandarama Iyer, who lived on Kamakshi Josier Street. It was Azhaganambiya Pillai who first organised a concert for him in the Nageswaran temple, known as Keezh Kudanthai Kottam in ancient times.\n\n“Both Kothandarama Iyer and violinist Kumbakonam Rajamanickam Pillai assiduously promoted Srinivasa Iyer in his earlier years,” said Mr. Sivaraman.\n\nRajamanickam Pillai was the winner of the Music Academy’s coveted Sangita Kalanidhi award in 1948. “He was known for his effortless sarvalagu swarams, and it was a pleasure accompanying him. My guru Palghat Mani Iyer and Pudukottai Dakshinamurthy Pillai too enjoyed playing for him,” said Mr Sivaraman.\n\nThe celebrated nagaswaram player Sivakozhunthu proved his mettle by playing a stone nagaswaram in the Kumbeswaran temple, pointed out musicologist B.M. Sundaram.\n\nAnother eminent musician was thavil player Kumbakonam A. Thangavel Pillai, a contemporary of nagawaram wizards like T.N. Rajarathinam Pillai and Tiruvenkadu Subramania Pillai.\n\n“The sound ‘thom’ produced on the left side of his instrument had a captivating effect. None could surpass him when it came to playing for keerthanas. I have learnt a lot by listening to him,” said thavil player Thanjavur R. Govindarajan.\n\nThere was also Velu Nair, a theatre personality and a Sanskrit scholar, whose house was situated between Kumbakonam and Tharasuram. It was Velu Nair who took M G Ramachandran (MGR) and his brother M.G. Chakrapani under his wings after their arrival from Sri Lanka. The brothers studied in a school at Anaikatti in Kumbakonam before dropping out. Their stage career blossomed subsequently.", 
    "section": "national", 
    "title": "Kumbakonam, the hub of Carnatic music", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}