{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Allege discrimination at shop in the area dominated by caste Hindus\n\nA section of residents of Kuruvithurai village near Sholavandan staging a demonstration in Madurai on Monday.— Photo: S. James\n\nAround 150 Dalits from Kuruvithurai village near Sholavandan, which witnessed caste violence in January, petitioned the Collector here on Monday, demanding opening of a separate ration shop in their area at the earliest.\n\nM. Muniyandi, district president of the Puthiya Tamilagam, who led the petitioners, alleged that Dalits were discriminated at the ration shop, which was located in the area of the village dominated by caste Hindus.\n\nK. Karupaiah, another resident, said that discrimination existed at the ration shop even before the recent violence.\n\n“Whenever fresh stocks arrived at the shop, only caste Hindus could buy them first. We were not allowed to buy essential commodities along with them,” he alleged.\n\nOn January 16, an issue over playing of songs in loudspeakers resulted in violent attacks by a mob of caste Hindus, in which about 10 Dalits were injured and 28 houses belonging to Dalits damaged.\n\nFollowing the incident, Dalits demanded, among other things, setting up of a separate ration shop, to which the district administration agreed.\n\n“The shop, however, has not been set up yet. Last month, we bought essential commodities at the ration shop in their (caste Hindus) area in the presence of police personnel to ensure that nothing untoward happened. We do not want to do the same this month,” said P. Gurusamy, another Dalit.\n\nProposal\n\nDistrict Supply Officer R. Jeeva said that the administration was in the process of sending a proposal to the government seeking exemption from norms to set up a new ration shop. “As per norms, to set up a new ration shop, there should be a minimum of 150 ration cards and the nearest ration shop should be at least 1.5 km away. Here, there are only about 110 ration cards in the area where Dalits reside and the existing ration shop is nearby,” she said.\n\nThe Dalits also complained that compensation for affected Dalits had not been sanctioned yet.\n\nHowever, a revenue official said that they were awaiting final approval from the government and the money would be handed over to the victims soon.", 
    "section": "national", 
    "title": "Kuruvithurai Dalits want separate ration shop", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}