{
    "author": [
        "L Renganathan"
    ], 
    "text": "Priests perform rituals at Kumbakonam Mahamaham tank as part of the grand finale of the festival .— Photo: M. Srinath\n\nLakhs of pilgrims participated in the Teerthavari ritual and took a holy dip in the Mahamaham tank and the Cauvery on the occasion of the Mahamaham here on Monday. With the elaborate safety measures in place, the rituals were completed in a smooth manner.\n\nThe Mahamaham festival, which is held once in 12 years, commenced in 12 Shiva temples in Kumbakonam on February 13 and in five Vishnu temples, the next day.\n\nUntil Sunday, more than 38 lakh pilgrims, including those from Andhra Pradesh, Telangana, Karnataka and Puducherry, had taken part in the rituals in Kumbakonam as per official estimates.\n\nOn Monday, the Mahamaham day, thousands of devotees brought by the numerous special train and bus services arrived at the 7 temporary bus stations and the Kumbakonam Railway junction since midnight and inched their way up to the tank as also the Portrarmarai tank and Chakra Padithurai bathing ghat on the banks of the Cauvery.\n\nWhen the auspicious time of 12 noon arrived, the Siva temple Astra Devars and Vishnu temple Teertha Berars were ceremoniously immersed by the priests to the accompaniment of the vedic chant and hymns. As per official estimates, more than 44 lakh pilgrims have participated in the rituals since February 13. Devotees from Singapore, Malaysia and Sri Lanka too participated in the rituals on Monday.\n\nProminent personalities, including Kanchi Acharyas Jayendra Saraswati and Vijayendra Saraswati, Sri Lankan MP for Batticoloa Seenithambi Yogeswaran, State Food and HR&CE Minister R. Kamaraj participated.\n\nPrincipal Secretary, Municipal Administration and Water Supply Department, K. Phaneendra Reddy, Commissioner of HR & CE M. Veerashanmugamoni, Director of Rural Development K. Bhaskaran, and Thanjavur Collector N. Subbaiyan were at hand to monitor the developments.\n\nThe rituals would continue for one more month until the next Maham star occurs in Panguni month.", 
    "section": "national", 
    "title": "Lakhs take a holy dip on Mahamaham day", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}