{
    "author": [
        "T Madhavan"
    ], 
    "text": "The facility that was opened last month is built on a 33-acre-site —Photo: G.Krishnaswamy\n\nA leprosy care centre has been opened by Chennai Corporation in Madambakkam, a town panchayat near Tambaram.\n\nThe facility, declared open by Chief Minister Jayalalithaa last month, is set on a 33-acre site at Radhasamy Koil Street, Maruthi Nagar that is owned by the Chennai Corporation.\n\nNot many people were aware that a leprosy care centre had begun functioning in Madambakkam, except for the people living on that street, said R. Sridharan, a resident of Sudharshan Nagar.\n\nThe centre, built at a cost of Rs. 66 lakh, consists of a couple of consultation rooms and a pharmacy.\n\nFacilities have been created to have in-patient wards, patient-waiting rooms and a clinical laboratory, according Corporation health officials. The centre has started receiving patients who were referred by those who visited.\n\nA medical consultant and a pharmacist have been posted to assist the doctor. The medical centre functions from 8 a.m. to 3 p.m. on weekdays, sources said.\n\nThe care centre was a long-pending proposal and was first mooted in 2012. A philanthropist, R.M. Alagappa Chettiar, had donated the land to the Corporation in 1946 on the condition that only a hospital is built on it.\n\nA few years ago, the civic body had proposed to construct a 600-bed hospital on the land in Madambakkam. The civic body had earlier also considered setting up a medical college on the land. While welcoming the decision to open such a facility, residents wanted the establishment of a full-fledged hospital in the remaining space, in accordance with the wish of the donor.\n\nA senior official of the Corporation said the Directorate of Medical Education frequently conducted screening camps, cultural events, and training sessions for the rural population to avoid factors that led to disease outbreaks. Apart from this leprosy care centre at Madambakkam, a Government Leprosy Rehabilitation Promotion Unit functions near Madras Export Processing Zone, Tambaram Sanatorium.", 
    "section": "national", 
    "title": "Madambakkam gets a leprosy care centre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}