{
    "author": [], 
    "text": "A Special Bench of the Madras High Court on Monday sentenced a Madurai-based advocate, W. Peter Ramesh Kumar, to undergo six months simple imprisonment after holding him guilty of committing criminal contempt of court.\n\nThe court had suo motu initiated contempt proceedings against the lawyer on charges of interrupting the proceedings of a Division Bench sitting at the Madurai Bench of the High Court on September 16 last year and for inciting advocates to boycott the court in support of 12 lawyers who were arrested for staging a sit-in protest in the Chief Justice’s court hall. A Division Bench of Justices V. Ramasubramanian and K. Ravichandrabaabu constituted to hear the contempt petition against Peter also imposed a penalty of Rs. 2,000 and directed the Bar Council of Tamil Nadu and Puducherry to take appropriate action based on the order.\n\nConcluding the hearing, on February 15, the Special Bench found the lawyer guilty of the offence and posted the issue to Monday to decide on the quantum of punishment.\n\nOn Monday, the advocate failed to appear before the court. Thereafter, the Bench decided to fix the quantum of punishment by itself. The 35-page order authored by Justice Ramasubramanian begins with the words of H.M. Seervai, a distinguished jurist as quoted by the Supreme Court in Harish Uppal Vs. Union of India (2003): “For, once conceded that lawyers are above the law and the law courts, there can be no limit to lawyers taking the law into their hands to paralyse the working of the courts. It is high time that the Supreme Court and the High Courts make it clear beyond the doubt that they will not tolerate any interference from anybody or authority in the daily administration of justice.”\n\nThe Bench suo motu suspended the sentence alone for 15 days saying that despite his nonappearance, the court is doing so as an indication of its “sense of fairness and magnanimity”. However, the Bench made it clear that the suspension is subject to the condition that the penalty amount is paid within a week to the High Court registry.\n\nHigh Court suspends sentence to enable him to file an appeal\n\nin apex court", 
    "section": "national", 
    "title": "Madurai lawyer gets jail term for criminal contempt", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}