{
    "author": [
        "R Srikanth"
    ], 
    "text": "Chennai Corporation carrying out ducting work for building heritage walkway in Mylapore\n\nA brisk walk around the tank of Kapaleeshwarar Temple will certainly be a delight to residents of the city, especially heritage lovers, but a number of hindrances come in the way.\n\nAs part of their Heritage Walkway project around the temple tank, which is among the city’s most iconic and much-loves landmarks, the Chennai Corporation has started work on executing ducting of underground cables for creating pavements around three Mada streets or ‘ maada veethis.’\n\nCorporation officials say the shifting of underground cable to create pavements wide enough for people to walk comfortably on either side of the three Mada streets — East, South and North — around the temple tank had started. Now, removing encroachments by numerous commercial establishments and shops to build pavements is on at the East and South Mada streets.\n\nThe heritage walkway project has been approved by the Corporation council. It was initiated after public consultations were held with residents of Mylapore and the design of the footpath was finalised only after that, the official said. Residents like D. Mukundan of Chitrakulam Street, however, are not very convinced that the work will ultimately benefit pedestrians as hawkers and shops have not been evicted on the three Mada streets and the Sannadhi street too.\n\nThey recall that the government had come up with the original plan where it was proposed to create a promenade linking the temple tank with Luz Church Road. As per the original proposal, the promenade involved an eight-metre wide space in the middle of Luz Church Road and a six-metre carriageway for vehicles on either side. The plan also included three-metre wide pavements on the three Mada streets and tabletop crossings to connect the promenade from both sides of the road.", 
    "section": "national", 
    "title": "Making it easier to soak in heritage", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}