{
    "author": [], 
    "text": "Actress Anu Aggarwal shared her experiences with Sri Manakula Vinayagar Engineering College girls\n\nModel turned actress Anu Aggarwal at a programme organised by the Women Empowerment Cell of Sri Manakula Vinayagar Engineering College in Puducherry.— Photo: Special Arrangement\n\nThe Women Empowerment Cell of Sri Manakula Vinayagar Engineering College in association with Vanavil Art Academy organised a motivational programme for young women.\n\nAddressing the students, former model cum actress Anu Aggarwal recalled the near death experience, her courage and determination to get back on her feet and subsequently venturing into Yoga for peace. The audience listened to her speech in rapt attention.\n\nM. Dhanasekaran, chairman-cum-managing director of Sri Manakula Vinayagar Educational Trust delivered the presidential address. S.V. Sugumaran, vice-chairman and K. Narayanasamy, secretary were present.\n\nHonour for Alpha group chairman\n\nThe International Tamil University of the United States of America has recently honoured V. Bashingam, chairman of Alpha Group of Institutions by awarding an Honorary Doctorate.\n\nS. Selvin Kumar, founder president of the International Tamil University conferred the Honorary Doctorate on Mr. Bashingam at a function in Madurai on February 6.\n\nEntrepreneurship programme\n\nThe Rajiv Gandhi College of Engineering and Technology and ICT Academy of Tamil Nadu recently organised the valedictory function of the five-day training programme on National Level Youth Entrepreneurship Development programme in the college.\n\nAs many as 40 students of the college participated in the programme. The participants were trained on steps to start small enterprises and business plan, market survey, management process and policies, finance, business opportunity guidance and entrepreneurship support.\n\nV. Bhaskaran, administrator of the college distributed the training completion certificate to the students. A. Maria Jayaprakash, principal and Prof. K. Ayappan, vice-principal participated.\n\nCoastal security discussed\n\nThe University Grants Commission (UGC) sponsored two-day national seminar on “Good Order at Sea: India’s Role” was held in UGC Centre for Maritime Studies, Pondicherry University.\n\nA. Subramanyan Raju, Coordinator of Maritime studies, stressed on the importance of good order at sea and the reasons why this topic needed to be educated and discussed among the students and experts in the field.\n\nDelivering the presidential address, Venkata Raghotham, professor of Department of History, mentioned some of the non-traditional threats emerging in the sea including arm trafficking and illegal migration.\n\nBimal N Patel, Director, Gujarat National Law University, Gandhinagar, stressed the need of revising the Indian Ocean Zone of Peace, UN 1979 declaration.\n\nP.V. Rao, Former Director, Centre for Indian Ocean Studies, Osmania University, Hyderabad, expressed his concern regarding the destabilisation of Indian Ocean Region.\n\nHe focused on the paradigm shift of security in 21st Century, including Blue water Navies, terrorism and sea pirates. In order to maintain maritime security and coastal security, he stressed on cooperation among coastal people like fishermen with Coast Guards.\n\nBy S. Prasad", 
    "section": "national", 
    "title": "Motivating young women to take the lead", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}