{
    "author": [], 
    "text": "Civic amenities are being developed to connect the MRTS, Metro and suburban railway stations; final report to be submitted soon\n\nA plan to integrate multi-modal public transport facilities covering Mass Rapid Transit System (MRTS), metro and suburban railway station is currently being prepared. As part of the proposal, a review meeting with officials from Southern Railway and Chennai Metro Rail Limited (CMRL) was held in October, last year.\n\nAccording to an official of Chennai Corporation, civic amenities like pavements were being improved and attention was also being given to spots around metro stations between Koyambedu and Alandur. St. Thomas Mount was now in the centre of expansion projects with Metro rail to be extended till there, in addition to the extension of MRTS too from Velachery. Under such circumstances, authorities of the different government agencies are working on integration.\n\nThe Chennai Metropolitan Development Authority (CMDA) has been entrusted with the task of working out a plan of operating small bus services, creating parking lots and paving wide footpaths to link the three public transport facilities with the interior residential areas.\n\nA final report is being prepared highlighting four packages of southern, northern and western suburban stations and MRTS stations for multi-modal integration. The final report will be submitted soon, the official added.\n\nMTC drivers find themselves in a fix\n\nDrivers of Metropolitan Transport Corporation come under a lot of criticism for not obeying rules – be it jumping signals or not halting at the designated bus stops. They are also chided by commuters when drivers follow the safety norms, as can be witnessed in deluxe buses. Some drivers open the automatic doors only after the buses come to a halt at the last stop or the terminus.\n\nHowever, impatient commuters insist that the doors be opened even as the buses approach their destinations. Some commuters make a polite appeal, while some others shout at the drivers for not opening them. “Commuters are always in a hurry to get down from moving buses when we enter Chennai Mofussil Bus Terminus in Koyambedu. Opening the automatic doors before the bus comes to a halt can be a risk for commuters standing on the footboard, especially when we take a sharp turn” says a driver on the Tambaram – Koyambedu route.\n\nAs the automatic doors are fitted on low-floor buses, it is easier for commuters to get down from them, but this is also extremely risky. However, in most buses, the automatic doors cannot be operated due to the mechanical problems and can be seen tied to the poles near the footboard.\n\n(Reporting by R. Srikanth and\n\nK. Manikandan)", 
    "section": "national", 
    "title": "Multi-modal railway integration plan taking shape", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}