{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The National Green Tribunal’s Southern Bench here granted a permanent injunction restraining authorities, including the Public Works Department (PWD) of Puducherry government from drawing water from Ossudu Lake unless necessary permission was received from the Ministry of Environment, Forests and Climate Change and other authorities.\n\nThe lake, which shares boundaries with Tamil Nadu and Puducherry, is also a declared bird sanctuary.\n\nThe Bench comprising Justice P. Jyothimani and expert member R. Nagendran further disposed off a plea from the Puducherry Environment Protection Association, which challenged the actions of the Puducherry PWD, which floated tenders to draw water from the water body.\n\nThe plea submitted that the lake has been identified as a wetland of national importance under the National Wetland Conservation Programme, an Important Bird Area (IBA) of India by the Bombay Natural History Society (BNHS), to which over 20,000 birds of about 40 species visited.\n\nWhile 390 hectare of the 800-acre lake lies within Puducherry, the remaining is with Tamil Nadu.\n\n“The present proposal of the Puducherry government is environmentally destructive and will not ensure equitable water availability to the people of Puducherry. The lake goes dry for 3 to 4 months of the year and gets filled in during the northeast monsoon to welcome migratory birds which stay till the end of winter and return to their native lands,” the plea stated.\n\nThe association also contended that the PWD cannot withdraw water from the Ossudu Lake, which has been declared as a Bird Sanctuary by both the State of Tamil Nadu and Union territory of Puducherry under the Wildlife Protection Act, 1972.\n\nThe association further sought for a permanent injunction restraining the PWD from withdrawing or permitting the withdrawal of water from Ossudu lake for any drinking water project in violation of various laws.\n\nThe lake, which shares boundaries with TN and Puducherry, is also a bird sanctuary", 
    "section": "national", 
    "title": "NGT grants injunction on drawing water from Ossudu Lake", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}