{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "R. Ganesan, who was on his way to board a flight to Saudi Arabia, suffered a fracture in Sunday’s accident at Muttukadu —Photo: V. Ganesan\n\nR. Ganesan was on his way to the Chennai airport from his village in Cuddalore district, when the bus he was on met with a head-on collision at Muttukadu on Sunday. In the few minutes that followed, the 48-year-old’s life was irrevocably changed.\n\n“I was heading to the airport to board a flight to Saudi Arabia to take up a construction job,” said Ganesan, an agricultural labourer. “My wife and daughter were accompanying me, to drop me at the airport,” he said, at Government Royapettah Hospital, where he is waiting for a surgery for his broken left leg.\n\nGanesan’s wife and daughter, said his older brother R. Sekar, have also been admitted to Rajiv Gandhi Government General Hospital. His wife Parameshwari suffered injuries to both her legs, and his teenage daughter Geetha’s right leg has been amputated below the knee. This was to be Ganesan’s first job abroad.\n\n“There’s not much work in our village, so he decided to go abroad and work. He got the job through an agent,” said Sekar.\n\nEverything was ready on Sunday. “I had my passport and ticket with me. My flight was at 8 p.m.,” said Ganesan.\n\nA doctor at the hospital said both bones in Ganesan’s lower leg were broken, and he was being assessed for surgery.\n\nYouth suffers fractures\n\nAt Rajiv Gandhi Government General Hospial, a doctor said 19-year-old Geetha had suffered multiple fractures on her right leg. “There was no pulsation and it had to be amputated through the knee,” she said. Geetha also suffered fractures in both arms. Parameshwari had bones in both legs fractured and was due to undergo surgery on Monday, she said.\n\nAfter the surgeries have been completed and the family has recovered to some extent, Sekar plans to take them home. On what happens with his job next, Ganesan said, “I don’t know if I’ll be able to go abroad at all now.”\n\nTwo other women and one man have also been admitted to the orthopaedics ward at Government Royapettah Hospital. K. Saraswathi, daughter of M. Gunabhushani, said she had been called by a stranger who informed her that her mother was in hospital. “Her phone and purse were then stolen. But, I don’t mind because at least they told me about my mother,” said the 37-year-old, adding that her mother was coming to visit her in the city from Puducherry.\n\nAnother woman, admitted for surgery, was pregnant and had gone to the Institute of Obstetrics and Gynaecology for a check-up, a doctor said. Nine other victims of the accident were at Rajiv Gandhi Government General Hospital on Sunday. Of these, two have been discharged and the other seven are undergoing treatment, a doctor said.", 
    "section": "national", 
    "title": "Of shattered dreams and an uncertain future", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}