{
    "author": [
        "Staff Reporter"
    ], 
    "text": "DMK councillors (left) and their AIADMK counterparts (right) enter into scuffle during the corporation council meeting in Salem on Monday. —Photo: E. Lakshmi Narayanan\n\nA scuffle broke between AIADMK and DMK councillors during the Salem City Municipal Corporation council meeting here on Monday in which a group of AIADMK councillors pushed two DMK councillors out of the meeting hall.\n\nIn the impact, DMK P. Murugan of Ward 59 suffered minor injuries on hand.\n\nWhen the meeting began, Mayor S. Soundappan read out a resolution greeting the Chief Minister on her birthday. Following this, AIADMK councillor T. Thiyagarajan (ward 1) praised the Chief Minister. When DMK councillor V. Deivalingam (ward 10) started playing the finger symbol, AIADMK councillors condemned it and besieged him.\n\nThe house witnessed heated exchange of words between the councillors.\n\nA group of AIADMK councillors pushed Mr. Deivalingam and Mr. Murugan out of the hall while other DMK councillors left themselves. The incident took place despite the Mayor repeatedly asked the councillors to abstain from their act.\n\nThe Mayor suspended Mr. Deivalingam from the meeting for disrupting the house. He hit out at the DMK for failing to complete any developmental works during their regime and said that they implemented the Mettur – Salem Dedicated Water Supply Scheme and residents are receiving surplus water regularly.\n\nWhen S.S. Krishnamoorthy (ward 29) was speaking on the problems in his ward, M.R. Jayakumar (ward 9) criticised the media for highlighting only the DMK councillors and not the works of the AIADMK. This is not the first time that the house witnessed unruly behaviour by the councillors as in May 2015, DMK councillors were beaten and pushed out of the meeting hall as they opposed hailing the Chief Minister by the AIADMK councillors.", 
    "section": "national", 
    "title": "Pandemonium at Salem council meeting", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}