{
    "author": [
        "Special Correspondent"
    ], 
    "text": "About 2 lakh units have been demanding wages agreed to be paid in 2014\n\nCoimbatore Collector Archana Patnaik (second from right) at the talks on wages held in Coimbatore on Monday. Ministers S.P. Velumani, MSM Anandan and Tirupur CollectorS. Jayandhi are in the picture.— Photo:S. Siva Saravanan\n\nFollowing the appeal by Coimbatore and Tirupur District Collectors here on Monday urging textile manufacturers (master weavers) to pay the wages that they agreed to pay in 2014 to the job working powerloom units, the job working unit owners have decided to resume operation from Tuesday.\n\nAbout two lakh powerlooms in Coimbatore and Tirupur districts are on strike from January 28 demanding wages the textile manufacturers agreed to pay in 2014. The job working unit owners said the wages were reduced drastically in the last three to four months.\n\nAccording to a press release from the Joint Labour Commissioner here, the District Collectors held talks with the job working unit owners and the textile manufacturers on February 4,9,14 and 22. The textile manufacturers said they were unable to pay the wages according to the agreement because of the slowdown in the market. The job working unit owners said they were unable to pay wages to the workers in their units because of this and their livelihood was affected.\n\nAfter discussions, the Coimbatore and Tirupur District Collectors announced that the textile manufacturers should immediately pay the wages they had agreed to in 2014 (30 per cent more than the wages agreed to in 2011 for the Somanur variety and 27 per cent more for other varieties). If there is a complaint that these are not paid, action would be taken against those who do not pay the higher wages and the job working units should withdraw the strike.\n\nP. Kumaraswamy, secretary of the Coimbatore District Job Working Powerloom Unit Owners’ Association, said that following the talks on Monday, it was decided to withdraw the strike and start operations from Tuesday.\n\nMinisters S.P. Velumani and MSM Anandan, Coimbatore Collector Archana Patnaik and Tirupur Collector S. Jayandhi were present at the talks on Monday.\n\nAbout two lakh powerlooms were on strike demanding wages textile manufacturers agreed to pay in 2014", 
    "section": "national", 
    "title": "Powerloom units to resume operations today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}