{
    "author": [
        "S Prasad"
    ], 
    "text": "Chief Minister N. Rangasamy unveiling the plaque at the inauguration of the Passport Seva Kendra in Puducherry on Monday.(right) Muktesh K. Pardeshi, Joint Secretary and Chief Passport Officer, Ministry of External Affairs (left) and K. Balamurugan, Regional Passport Officer, Chennai are also seen in the picture. —Photo:T. Singaravelou\n\nChief Minister N. Rangasamy on Monday inaugurated Puducherry’s first Passport Seva Kendra (PSK) set up by the Ministry of External Affairs and said that it would cater to the needs of a large number of students seeking to pursue higher studies abroad.\n\nSpeaking on the occasion, Mr. Rangasamy said that the dream of Puducherry to have a separate PSK had now become a reality. This would be of great help to students from various professional colleges going abroad for further studies. Passport applicants earlier had to go to the Regional Passport Office in Chennai, he said.\n\nMuktesh K. Pardeshi. Joint Secretary and Chief Passport Officer, Ministry of External Affairs said that no state or union territory was now without passport related facilities.\n\n“In 2010 we embarked on a journey called passport seva programme and tied up with Tata Consultancy Services and setup new centres. The country has around 37 Passport Offices and 90 PSKs.”\n\nIndia is the third largest passport issuing country after China and the US. In 2016, India issued about 1.2 crore passports whereas in 2010 it was around 55 to 60 lakhs, he said.\n\nK. Balamurugan, Regional Passport Officer, Chennai said that applicants from Puducherry and Karaikal could submit their applications at the PSK here and need not go to . On an average 90 applications were received from Puducherry and Karaikal daily. The centre at Puducherry could handle as many as 150 appointments daily, he further added.\n\nMember of Parliament R. Radhakrishnan, N. Gokulakrishnan, MLA G. Nehru, Chief Secretary Manoj Parida and Inspector General of Police Praveer Ranjan were .", 
    "section": "national", 
    "title": "Puducherry gets Passport Seva Kendra", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}