{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Ariyar Division of the Public Works Department has begun construction of 13 check dams across different rivers in the district to harness rain flow.\n\nThe National Bank for Agriculture and Rural Development (NABARD) has sanctioned 14 check dams under Rural Infrastructure Development Fund (RIDF-21) at a cost of Rs. 20.73 crore. While the Ariyar Division will build 13 ground-level which seek to harness the rain flows, the River Conservation Division will build the other check dam.\n\nThe check dams will come up across Nandiyar in Lalgudi taluk, Ponaniyar, and Mamundiyar in Manapparai taluk, Ayyar in Musiri, Vellar in Marungapuri taluk, and Kattar in Tiruverumbur taluk.\n\nCheck dams will come up at smaller streams such as Kothamangalam vari, Manodai, Shanmuganadhi, Kannuthu Odai, Koraiyar, Upparu, and Panguni Vaical. Check dams were built at 10 places in the district under RIDF-20 and these have been effective in harnessing the recent rain flows.\n\nConstruction of the check dam across the Shanmuganadhi at Tirupattur in Manachanallur taluk was inaugurated recently by T.P. Poonachi, Minister for Khadi and Village Industries, in the presence of V. Selvaraj, Executive Engineer, PWD Ariyar Division.\n\nAccording to PWD officials, the check dam would help harness the rainwater flowing from the Kollimalai in Namakkal district.\n\nThe rainwater usually runs off the Coleroon into the sea. The construction of the check dam, at an estimate of Rs.1.01 crroe, would help improve the water table in the region.\n\nThe 1.20-metre tall check dam would be 18 metres long. It would have capacity to hold about 0.362 million cubic feet of water.\n\nAbout 365 acres of land would benefit from the structure, the officials said.\n\nSources in the PWD said although the contract for the construction of the check dams was one year, the structures were expected to be completed in six months.", 
    "section": "national", 
    "title": "PWD plans 13 check dams", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}