{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Dravidian parties that did not make efforts to solve even basic civic problems of people should not come to power again, said speakers at a meeting of the People Welfare Front here on Monday.\n\nMarumalarchi Dravida Munnetra Kazhagam (MDMK) leader Vaiko said that Dravidian parties should not come to power under any circumstances. The PWF would waive both the principal and interest of farmers’ loans if elected to power, he said.\n\nHitting hard on Dravida Munnetra Kazhagam State treasurer M.K. Stalin, Mr. Vaiko said that he hade made false remarks at a meeting in Erode, stating that farmers were killed in police firing during MGR rule in 1978.\n\nHe should have consulted his father and party chief M. Karunanidhi before making that statement. He would have definitely corrected it. Mr. Stalin did not know that farmers were killed in firing during the DMK government of Mr. Karunanidhi and not during MGR rule.\n\nMr. Stalin wanted to become Chief Minister. Many persons, like him, who did not know even basic politics wanted to become Chief Minister, Mr. Vaiko added.\n\nHe held Mr. Karunanidhi responsible for the “pathetic condition of the DMK,” saying he spoiled the party in order to make his son CM.\n\nMr. Vaiko did not spare Minister for Power R. Viswanathan who had informed in the Assembly that total prohibition would lead to illicit arrack menace. When the government failed to control theft, murder, robbery, will it close all police stations, Mr. Vaiko questioned.\n\n“No locus standi”\n\nCommunist Party of India (Marxist) state secretary G. Ramakrishnan charged that Dravidian parties did not have any right to talk about policies of Periyar and Ambedkar as both the AIADMK and DMK did not show any interest in social issues.\n\nBoth parties had planned to buy votes in the ensuing elections. Mr. Stalin was speaking against corruption. But corruption charges had been levelled against his mother and relatives, he said.\n\nViduthalai Chiruthaigal Katchi leader Thol. Thirumavalavan expressed grave concern over ill-effects of liquor and its impact on the common man, and deep-rooted corruption in the State.\n\n“Many persons who do not know even basic politics want to become Chief Minister”", 
    "section": "national", 
    "title": "PWF will waive farm loan, interest: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}