{
    "author": [
        "R Rajaram"
    ], 
    "text": "Kumbakonam Railway Station recorded over 3 lakh footfalls on February 22\n\nAccording to one estimate, three lakh passengers passed through the Kumbakonam Railway Station on the eve of Mahamaham.— PHOTO: G. GNANAVELMURUGAN\n\nGiven the proximity of the Kumbakonam Railway station to the Mahamaham tank and the extensive road traffic diversions in place, trains were the preferred mode of transport for a large number of pilgrims.\n\nThe Kumbakonam Railway Station bustled with huge movement of thousands of pilgrims who trooped into the temple town to take a holy dip on the festive occasion.\n\nThe movement of devotees who came by various special trains to temple town Kumbakonam from various parts of the State witnessed a spurt on Monday.\n\nAccording to railway sources, the passengers’ movement to Kumbakonam doubled on the eve of the festival with the figure exceeding a little over three lakh.\n\nThere was a substantial movement of rail passengers on the Mahamaham festival day as well.\n\nThe Southern Railway had operated several special trains from Thanjavur to Mayiladuthurai via Kumbakonam for the benefit of the passengers to clear the extra rush.\n\nThe Kumbakonam railway station where basic facilities were augmented in connection with the festival teemed with devotees every time a train arrived and left the station.\n\nRailway Protection Force (RPF) personnel, who kept a round-the-clock vigil, said the peak hours of arrival was between 6 a.m. and 10.30 a.m. on the festival day and on its eve.\n\nPassenger movement was monitored from the RPF control room which was linked to the chain of surveillance cameras installed at vantage points at the station.\n\nWith barricades set up at various points outside the station, the devotees were guided by the police to take the specified route to reach the Mahamaham tank.\n\nNevertheless, several passengers had to had a torrid time in reaching the station on their return journey.\n\nWith the police setting up barricades on several streets and narrow bylanes as part of crowd regulation management, the devotees were completely caught unawares.\n\nMany who came from other districts were unaware of the route to be taken to reach the station and the town’s topography, although flex boards were erected indicating the route to the station.\n\nTough time\n\nUnable to stand in the intense heat, several passengers became anxious as the police allowed the devotees in a staggered manner on their way back to the station.\n\nThe devotees had to take the specified route on foot to reach the station as movement of autorickshaws and other vehicles were prohibited on the day of the festival.\n\nSome devotees swooned and were brought to the nearest temporary medical help units set up close to the tank to provide first aid.\n\nA fleet of ambulances were stationed near the tank as a precautionary measure.", 
    "section": "national", 
    "title": "Railways remains bedrock of public transport during Mahamaham", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}