{
    "author": [], 
    "text": "Excellent\n\narrangements\n\nI had a pleasant experience while visiting Kumbakonam on Mahamaham final day. There were sufficient number of toilets on both sides of the road. The car could go into town and get space for parking. The police and those manning the guidance kiosks were courteous. Arrangements for bathing and changing were adequate on the Cauvery banks.\n\nRamesh Krishnan,\n\nSrirangam\n\nPoor planning on\n\ntraffic regulation\n\nThough the police have made elaborate arrangements in Kumbakonam for Mahamaham, they did not regulate the vehicular traffic. Even the two-wheeler riders were finding it difficult to return home just 6 km from Kumbakonam after taking a holy dip in the tank. Traffic diversions caused delayed and people had to take a detour. Even vehicles which were headed beyond Kumbakonam stopped even on the bypass by the police. On February 20, we were stopped and asked to go to the parking lot. We had to return to Tiruchi via Tiruvaiyaru. We found that there hardly any traffic on Papanasam road. Police could have drawn up a map and allowed people travelling beyond Kumbakonam on this road.\n\nThirumeni J.,\n\nCantonment, Tiruchi\n\nEnd menace of\n\nplastic waste\n\nIt came as a surprise that Tiruchi was selected as the third cleanest city in India. The city has miles to cover.\n\nUse of plastic carry bags has reached unreasonably high levels. Garbage bins in many areas are overflowing with plastic waste. The Uyyakkondan is increasingly turning into an eyesore for the residents in the absence of credible attempts to prevent discharge of sewage by residents and commercial establishments near the river. We hear nothing on the matter despite some litigation.\n\nLess said the better about the situation in Srirangam, particularly Seshadripuram.\n\nJ. Anantha Padmanabhan,\n\nSrirangam\n\nSegregate waste\n\nWe are proud that Tiruchi has been declared the third cleanest city in India. Yet, we have streets littered with garbage. People throw garbage out of their compounds on to the streets. To make Tiruchi greener, we have to segregate organic and inorganic waste.\n\nAnbin R Inian,\n\nWoraiyur\n\nOverexploitation\n\nof groundwater\n\nMany builders are sinking borewells to great depths in Srirangam leading to salinity and higher TDS in water. Impurities are found in such water due to mineral contamination. The Town Planning authorities should not allow mindless commercial exploitation of the ecologically sensitive Srirangam island region. Most green cover is gone here. Building plans are violated with impunity. Who will bell the cat?\n\nT.M. Ranganathan,\n\nSrirangam\n\nTurmeric powder\n\nadulterated\n\nTurmeric powder is often adulterated. This is because there is a perception among consumers that thick yellow colour turmeric is of top quality. The chemical, metanil yellow which is an inveterate enemy to man’s health, is used as an artificial colouring agent. Food Safety officials should check such adulteration.\n\nAravind K. Rao,\n\nSrirangam\n\nUseful bridge\n\nThe new Coleroon bridge has been declared open and has come as a relief to bus commuters from Lalgudi, Samayapuram, Manachanallur and Thuraiyur. With this, traffic on Y road from both direction has reduced considerably. Thanks to the district administrators for having rendered this yeoman service.\n\nMurugappan SP.\n\nNo 1 Tollgate\n\nNew bridges,\n\nnew problems\n\nThe new bridge across the Coleroon and the one in Odathurai are posing serious traffic problems. As more and more vehicles are converging near No.1 Tollgate, there is a severe traffic jam in the peak hours. Traffic signal lights should be installed at this point to solve this problem. Proper lanes for two-wheelers and four-wheelers, road signs, and scientific speed-breakers with proper markings are very essential for the smooth movement of traffic inside the city. These will become the benchmarks for a smart city, not mere slogans.\n\nA. Prabaharan,\n\nPuthanampatti\n\nDrivers render\n\nbus stops useless\n\nMost of bus stops in city are without shelters. And those with shades are all erected at the wrong spots. Mannarpuram is a case in point. A newly erected bus shelter near Sankar Café in Tiruchi Junction is spick and span. But it is not at all serving the purpose as the buses do not stop in front of the shelter. Traffic constables ask the waiting commuters to go the bus shelter but do not act against the erring bus drivers. With the public unable to use the newly erected bus shelter, it will soon become a haven for anti-social elements. The bus shelter in the western side of the traffic island near DRM office is also not used. A two-wheeler mechanic has occupied his space.\n\nH. Ghouse Baig,\n\nTiruchi\n\nOne more train\n\nto Bengaluru\n\nAt present, there is only one train connecting Tiruchi and Bengaluru. It takes about nine hours to cover the distance. There is a huge demand for introduction of a superfast day train between Tiruchi and Bengaluru. We hope that the Railway Ministry considers this demand in the Railway Budget.\n\nK. Muthuswamy,\n\nTiruchi\n\nPension delayed\n\nat post offices\n\nIn recent times, railway pensioners have been getting the money through CBS mode at post offices. The disbursal is often delayed due to network problem. The Post-Master General should look into this matter and ensure that the pension is disbursed on the last day of the month.\n\nB. Thirunavukkarasu,\n\nGeneral Secretary, Southern Railway Pensioners Association,\n\nTiruchi.\n\nUnscrupulous\n\nBSNL\n\nA few months ago, I got a call about unlimited music downloading facility on my BSNL number. Unwittingly, I gave the woman my email address. Although I did not activate the facility, I was charged Rs. 270 in my bill for November 2015. In the bills for December 2015, another Rs. 489 was charged. After several attempts, I got the facility deactivated on January 13, 2016. But now, I have received a bill with another one-time charge of Rs. 205. I am charged by BSNL for facilities which I never used.\n\nK. Lakshmanan,\n\nSrirangam", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}