{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pondicherry University Vice Chancellor-in-charge Prof. Anisa B. Khan with keynote speakers Rod Hemsell (US), Andre Rafael Fernandez, Goa University and Prof. Edwin Zappe (Austria) at the seminar on Monday. Students perform ‘The Swan Lake', a dance segment, at the cultural show on the occasion.— Photos: Special Arrangement\n\nPondicherry University organises a seminar on ‘English Literature in the Digital Era’\n\nWriters and educationists participating in a seminar on the future of English literature in a digital age have highlighted the need for renewing popular perceptions about teaching and learning in an increasingly technology-driven world.\n\nThe one-day seminar on ‘English Literature in the Digital Era’ organised by the Department of English, Pondicherry University, focused on the theories and practices in an age where digital form of teaching, learning and research methodology has become an integral part of life.\n\nThe event, which had guest speakers such as Andre Rafael Fernandez from Goa University, Rod Hemsell, a writer and educationist from the US and Prof. Edwin Zappe, teacher and educationist from Austria, also discussed about the rise of digital humanity and digital applications and their immense possibilities in various areas of academic exercises.\n\nAccording to Lakhimai Mili, assistant professor, Department of English, the seminar was also a platform to discuss and debate about the problems of the traditional English literature classrooms and evolve newer ways of teaching and learning for a tech-savvy student fraternity.\n\nThe head of the department Prof. N. Natarajan, chairman of the seminar welcomed the dignitaries and the delegates from across India. Vice Chancellor (i/c), of Pondicherry University Prof. Anisa B. Khan and P.M.L. Kalayanasundaram, Kalapet MLA, were among those who participated. The academic sessions were followed by cultural fare that featured ‘The Swan Lake,’ a dance segment, ‘Stranger than Fiction,’ a play, and concerts by the in-house music bands of Pondicherry University- Karmic Mantra and Ragas Retold.\n\nThe highlights included performances by students from SAARC nations studying in the University and North-East students.", 
    "section": "national", 
    "title": "Renewing literature in tech-savvy age", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}