{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The damaged stretch of the road from Avaniapuram to Vaikom Periyar Nagar road in Madurai on Monday.— Photo: R. Ashok\n\nA group of residents from Avaniapuram and surrounding areas and members of Satta Panchayat Iyakkam (SPI) submitted a petition to the Collector on Monday about the appalling condition of Periyar Nagar road connecting Avaniappuram to Vaikom Periyar Nagar.\n\nDespite the roughly three-km-long road, being the shortest route from Avaniapuram to Vaikom Periyar Nagar, the severely damaged road has not been repaired for more than five years, P. Rajkumar from SPI said.\n\n“The road was laid in 2010. However, as the quality was low, the road was damaged within six months,” he said.\n\nAs the condition is bad, the petitioners said that they often end up taking a 10-km-long route through Airport-Mattuthavani Ring Road and Mandela Nagar. “Even in case of medical emergencies, ambulances cannot take the Periyar Nagar road to reach soon,” R. Uma Sankar, a resident said.\n\nHe added that the students of a private women’s college located in the road are also hugely affected because of the poor condition of the road.\n\nAfter the expansion of Madurai Corporation, while major portion the Periyar Nagar road, from Avaniapuram to the point it connects with Airport-Mattuthavani Ring Road has come under Corporation limits, the rest is under the control of Samanatham panchayat.\n\nThe petitioners alleged that while the Corporation had carried out road repair works recently in many areas, the Periyar Nagar road has been neglected despite repeated complaints to Corporation Commissioner and Collector. They said that they also carried out a protest last month in this regard.\n\nRs. 1 crore sanctioned\n\nWhen contacted, S. Veerakumar, Corporation Councillor of Ward 60, under which the area comes, said that around Rs. 1 Crore has been sanctioned for the road and the tender process is expected to happen in a week’s time. Samanatham panchayat president could not be reached for comment.", 
    "section": "national", 
    "title": "Residents petition Collector for repairing road", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}