{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A leading Right To Information (RTI) activist and State Resolution Committee Member of the Marumalarchi Dravida Munetra Kazhagam (MDMK), M. Krishnasamy (55), of Maniyakaranpalayam petitioned the City Police Commissioner A. Amalraj on Monday.\n\nHe sought action against those who sent fraudulent RTI petitions in his name.\n\nMr. Krishnasamy who was a councillor in the corporation from 1996 to 2006 claimed that mischief mongers had forged his letter pad, seal and signature and sent as many as 66 petitions with 250 questions to the RTI Officer of the Corporation here. The activist who has used RTI over 500 times from 2006 and published two books about RTI Act 2005 said that misusing his identity was a bid to tarnish his image.\n\n“The incident came to my notice last Thursday (February 18) when the personnel at the Ganapathy Post Office asked me why I had affixed stamps for lesser denomination in so many RTI petitions. Knowing I had not sent any such petitions of late I checked the covers and was shocked to see misuse of my identity,” he said.\n\nSome of the questions in those fraudulent petitions sought financial status, wealth and salary details of the 100 councillors and the corporation staff here over a period of 10 years. “Such questions are aimed at creating enmity between me and the councillors and corporation staff,” Mr. Krishnasamy said.\n\nHe suspected the hand of a leading contractor for Coimbatore Corporation.\n\nThis contractor is closely linked to a top ruling party functionary who Krishnasamy had exposed in his RTI petitions earlier this month. He also produced copies of the fraudulent letter pads, seals and signatures in the RTI petitions sent in his name.\n\nSupporting him, representatives of a few other political parties also petitioned the police commissioner. Mr. Krishnasamy said the police commissioner has forwarded it to the Assistant Commissioner (Law and Order) of the East Sub Division to inquiry the incident and initiate appropriate action.", 
    "section": "national", 
    "title": "RTI activist alleges forgery of letter pad, signature", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}