{
    "author": [
        "S Senthalir"
    ], 
    "text": "45-year-old Ezhilarasi is the only woman delivery associate in Puducherry\n\nThe lanes of Lawspet are now used to see her riding past with a heavy black courier bag on her shoulders attired in cotton saris and with a white helmet.\n\nEzhilarasi Sivashankaran is Amazon.in’s only woman delivery associate in Puducherry. Breaking the male bastion, the 45-year old, shuttles between work and household chores, yet managing to deliver all the orders.\n\nHer day begins at 6 a.m. After finishing household chores, she reaches her office located near Indira Gandhi statute at 9.30 a.m. and organises the packages based on the number of shipments she has to deliver to an area.\n\n“If there are more packages to be delivered to the North, I start from Navarkulam and then move towards the South. I decide the route based on the number of shipments to be delivered to a particular area. After sequencing the packages, we assign numbers and re-check them before going out,” she said.\n\nMs. Ezhilarasi takes a short break in the afternoon to provide lunch to her daughter who arrives home at 12.30 p.m. “My husband works at the Government General Hospital. Her son is in XIstandard and her daughter is studying in IX standard. The timings are flexible enough for me to shuttle between work and home,” she says.\n\n“I always wanted to work. I had started a Xerox shop and worked as sub-staff in a private bank. “When I met a person working in Amazon.in, I was informed about the job opportunity there. When I approached Rani Margert Anandraj, Amazon.in’s partner in Puducherry, she immediately recruited me. It was important for me to support my family financially and I was ready to do that work,” she said.\n\n“I carry a range of articles, from books to mobiles and all the shipments allotted to the PIN Code 8 (Lawspet). If the customers are not at home I go back the second or third time if required to deliver,” she says.\n\nStarting with 26 packages, she now delivers up to 50 packages per day. Carrying more than 50 kg of packages is not a burden for Ms. Ezhilarasi. “I like this work. Everyone is supportive and I feel at home in office. My earning is supporting my family too. I am happy to do this work,” she smiles.\n\nThough she did meet an angry customer, many people respect her and are happy to see a woman who delivers their goods. “When I went to the Jipmer on duty, I met the women doctors who were happy to see me. They called out their colleagues and hugged me. This was very encouraging,” she said.\n\nThe regular customers have become good friends. They call up and check if they have any deliveries. “People are surprised when they look at me but they encourage me to continue the work,” she says. She is determined to bring more women into this profession.\n\nWhile Amazon.in is said to be crushing the retailers, it has also opened up job opportunities for people like Ms. Ezhilarasi. She currently delivers close to 40 packages on an everyday basis. She is aiming to deliver 100 packages in a day and wants to be the first lady to do so in India.\n\nWhen I went to the Jipmer on duty, the women doctors called out their colleagues and hugged me. This was very encouraging.\n\nEzhilarasi Sivashankaran", 
    "section": "national", 
    "title": "She also delivers smiles and hugs, Amazon-style", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}