{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Opening of the track expected to ease traffic in this section\n\nSMOOTH GOING:Speed trial being conducted on the newly laid second track between Thamaraipadi and Dindigul on Monday.— PHOTO: G. Karthikeyan\n\nSpeed trial on the newly laid second line between Thamaraipadi and Dindigul railway stations as part of track doubling project was conducted successfully on Monday afternoon.\n\nAn Inspection Special, comprising an electric loco engine and three compartments, ran at a speed of 110 km per hour, covering the eight-km distance in about four minutes.\n\nThe speed trial started at Thamaraipadi station and ended at Balakrishnapuram railway gate in Dindigul.\n\nTalking to reporters after the trial run, Commissioner for Rail Safety Satish Kumar Mittal said that it was a statutory inspection.\n\nHe had travelled in a mechanised trolley inspecting stations, bridges, curvatures, overhead electrification, signal system and the condition of the track.\n\nAfter completing the field trial, the officials conducted the speed trial between Thamaraipadi and Dindigul. He was satisfied with the work, and necessary certificate would be issued soon. Then trains would be operated on this track, he added.\n\nRail Vikas Nigam Limited (RVNL) Chief Project Manager Prdeep Gaur, Chief Administrative Officer P.K. Misra, Chief General Engineer Bola Singh, Chief (Signal and Telecommunications) Kalavathi and a technical team accompanied him during the inspection.\n\nMadurai Railway Division could enjoy the full benefit of the double track only on completion of work in Tiruchi-Dindigul section. Already the second track between Manaparai and Tiruchi had been opened for train operation. Track doubling work between Thamaraipadi and Manaparai, especially near Vadamadurai, was pending owing to delay in land acquisition and other practical difficulties, officials said.\n\nOpening of the second track between Thamaraipati and Dindigul would ease traffic in this section to a certain extent. The second line between Dindigul and Thamaraipadi was part of Villupuram-Dindigul doubling project being executed by the RVNL.\n\nThis track would become operational on completion of the subway at Balakrishnapuram railway gate and link line connecting the second and the first tracks at Anumanthanagar railway level crossing.", 
    "section": "national", 
    "title": "Speed trial conducted on second track from Dindigul", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}