{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Villagers of Singilipatti near Kadayanallur have appealed to the district administration to provide water facility in a newly created cremation ground and to take steps to stop the burial of bodies near watercourse.\n\nThe petitioners said the villagers of Singilipatti under Punnaiyapuram in Kadayanallur, including the Dalits, had been using a common cremation ground near the hamlet for the past 30 years. Only when efforts were made to form a cement road from the village to the cremation ground, the villagers came to know that they were taking the bodies to the common cremation ground via private patta lands belonging to eight individuals.\n\nAs one of them erected fence around his property, the villagers lost access to the cremation ground and created another cremation ground on 35 cents belonging to the Department of Forest.\n\n“While a few of us are cremating bodies in the old cremation ground after obtaining permission from the land owners for taking bodies via their properties, others are performing last rites in the new cremation ground. However, a group of Dalits living at Singilipatti is burying the bodies near the channel bringing water to Silambankulam. Since this third unapproved burial ground is situated close to the houses of people belonging to a particular community, representations were sent to the officials concerned to put an end to this practice. However, no action has been taken to stop the bodies from being buried within 100 meters from the houses. If the new cremation ground obtained from the Forest Department is provided with water facility, it can be used as a common facility for all communities,” said M. Ramaiya, one of the petitioners.\n\nMove flayed\n\nVillagers from Ramakrishnapuram near Nanguneri submitted a petition condemning the move to shift the ration shop in their village. The petitioners said the ration shop in Ramakrishnapuram, now functioning from a shop constructed on a piece of land donated by the villagers, was effectively serving the villagers ever since it was established six years ago. However, a group people, affiliated to some political parties and caste outfits, was trying to shift the ration shop to some other place for no reason.\n\nIf the shop was shifted, it would be of great difficult for the villagers, particularly women, to buy the essential commodities, the petitioners said.\n\nHealth hazard\n\nThe Campus Front of India cadres submitted petition against the garbage being dumped near the schools at Melapalayam. They said the garbage being dumped near two schools and an anganvadi at Melapalayam was causing health hazards to the students.\n\nMoreover, the open drinking water valve chamber near Quaid-E-Millet Government Higher Secondary School at Melapalayam was causing mishaps involving students every day. Though it was brought to the notice of the Corporation officials, no action had been taken to cover this trap, they said.", 
    "section": "national", 
    "title": "“Take steps to stop burial of bodies near watercourse”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}