{
    "author": [], 
    "text": "Private candidates who had applied under the Tatkal scheme to appear for the Plus Two examinations in March/April 2016 can download their hall tickets online. The candidates can download the hall tickets from the websitewww.tndge.infrom February 23 to 25. The candidates can access the link “Higher secondary exam March 2016-Private Candidate-Tatkal Hall Ticket Print Out” at the website and download the hall tickets by providing their application number and date of birth, V. Murugan, Regional Deputy Director of Government Examinations, Tiruchi, said in a release. Candidates would not be allowed to sit for the examinations without hall tickets, the release added.\n\n‘Abolish all forms\n\nof child labour’\n\nTN-Forces, the Tamil Nadu Forum for Creche and Child Care service, a non-political organisation, has urged the government to amend the Child Labour (Prohibition and Regulation) Act, 1986, so as to abolish all forms of child labour by removing the distinction between hazardous and non-hazardous categories of work for all children up to the age of 18. Child labour under the ‘sumangali thittam’ in textile units should be abolished, the forum demanded at a joint meeting held here recently with Tamil Nadu Street Vendors Workers Federation. Amendments should be made to harmonise the age definition of all child-related legislations and programme in line with the National Policy for Children, which categorically defined child as any person below the age of 18. The Right to Education should be made fully functional as a fundamental right with an equitable common school system with mother tongue as medium of instruction. The organisations urged the government to formulate special policies and programmes for adolescents in areas of education, health, nutrition, life skill education, protection from abuse, and violence.\n\nFarmers’ meeting\n\non February 26\n\nThe monthly farmers grievances meeting would be held at 10.30 a.m. on February 26 at the Collector’s office here, Collector K.S. Palanisamy said in a release.", 
    "section": "national", 
    "title": "Tatkal hall tickets", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}