{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Registration process said to be irregular; Corporation asked to submit action-taken report in 15 days\n\nhe Chief Registrar of Births and Deaths in the State has found laxity in processes relating to the registration of births and deaths in Chennai.\n\nFollowing a survey of the system, the Chief Registrar has called it “irregular and non-functioning” and has urged the Greater Chennai Corporation to “take urgent action and implement the legal provisions of the Registration of Births and Deaths Act 1969.”\n\nThe Chief Registrar has also asked the Corporation to submit an action-taken report in 15 days.\n\nIn Chennai Corporation, a sanitary inspector is appointed registrar of births and deaths. The Corporation Commissioner is the district registrar for births and deaths. Following a scrutiny of complaints pertaining to registration of births and deaths, the Chief Registrar has found that the public could be possibly facing difficulty in having access to the registrar for registration of birth and death.\n\nThe Chief Registrar has warned the Corporation that “violation of the legitimate duty of the Birth and Death Registrar” would attract penal action against the registrar as per Section 23 of the Registration of Births and Deaths Act 1969.\n\nTo remedy the situation, the Chief Registrar has stipulated that each sanitary inspector have an office at the local area and meet the public from 2 p.m. to 5 p.m. to register birth and deaths on a daily basis. The sanitary inspector should also be proactive in registering births and deaths in his area without omission by utilising the services of notifiers. Each of the hospitals notifies the events of births and deaths to the Chennai Corporation’s health department.\n\n“The sanitary inspector responsible for omission will be penalised for any omission as per Section 23 of the Act,” said an official of Chennai Corporation.", 
    "section": "national", 
    "title": "The ordeal of recording births, deaths", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}