{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram: Car festival, abishekam, 6 p.m.; Ambal purappadu in Simha vaganam, 7 p.m.\n\nArulmigu Sundararaja Perumal Temple, Anbil: Masi maham festival, reaching temple premises from Kollidam banks, noon.\n\nSri Srinivasa Perumal Temple, Indira Nagar: Special Garuda Sevai utsavam, Perumal purappadu, 9 a.m.; theerthavari, 9.30 a.m.; pooja, 6.30 p.m.; Garuda sevai – thiruveedhi purappadu, 7.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Veli Andal Sannidhi, West Adayavalanjan Street, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 41, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nOrganising Committee: Sri Thyagabrahma aradhana mahotsavam, vocal concert by Chennai Virkram Raghavan, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; vocal concert by Sikkil C. Gurucharan, 8 p.m.\n\nGENERAL\n\nTiruchirapalli City Corporation: Council meeting, discussion on “corporation budget”, Mayor A. Jaya, presides, Corporation office 11 a.m.\n\nPeriyar E.V.R. College Department of Chemistry: Seminar on “modern synthetic designs,” A. Ilangovan, chair, School of Chemistry, Bharathidasan University, inaugurates, 10 a.m.\n\nM.S. Swaminathan Research Foundation: Workshop for media persons on climate change agreement, Hotel Femina, 10 a.m.\n\nNational College Rotary Club of Tiruchi: Lecture on disaster management by Hari Balaji, consultant, Emergency Risk Management, Chennai, 12.30 p.m.\n\nNehru Memorial College Department of Commerce: NMC-comex – inter-collegiate competition, 10 a.m.\n\nK. Ramakrishnan College of Engineering Department of Management Studies: Eminencia – 2016 – State-level management meet, 10 a.m.\n\nJamal Mohamed College Department of Zoology: Seminar on “recent trends in animal sciences”, K. Venkataraman, former director, Zoological Survey of India, inaugurates, 9.30 a.m.; Department of Physics: Lecture on Micro controller and its applications by A.Rajendran, assistant professor, Nehru Memorial College, 11.30 a.m.\n\nRotary Club of Tiruchi Midtown: Rotary International district governor’s meet, G.Olivananan, past district governor, chief guest, 7.30 p.m.\n\nNational Institute of Technology Department of Civil Engineering: International conference on disaster mitigation and management for sustainable development and risk reduction, 9.30 a.m.\n\nM.A.M. College of Engineering: Workshop on “embedded system and robotics,” K.C. Tamil Venthan, Director, LIFT Technologies, resource person, M.A. Mohamed Nizam, secretary, MAMCE, inaugurates, 10 a.m.\n\nGEECO Enercon Pvt. Ltd: Sixth international technical forum on “Rotary air pre heaters, electrostatic precipitators, boiler testing and CFD,” Hotel Ramyas, 10 a.m.\n\nBishop Heber College Department of Social Work: Awareness programme on personal hygiene for schoolchildren, Panchayat Union Primary School, Alampadi Mettur, 11 a.m.; awareness programme on health and hygiene, Dr. Gayathri Mathrubootham, chief guest, Annai Ashram, 4 p.m.; awareness programme on stress management, Bharathi Matric Higher Secondary School, Indian Bank Colony, 2.30 p.m.; special programme for senior citizens, St.Antony’s Home for Aged, Kattur, 10 a.m.\n\nM.A.M. School of Engineering: Lecture on “Micro Aerial vehicle and its applications” by Sathishkumar of Nucleons Aero Modelling Club, 11 a.m.\n\nSharon – JCI Tiruchi Excel: Quiz fest 2016 for Rane TRW Rolling Shield, Nehru Memorial Middle School, Muthukulam, 11 a.m.; Muthu Raja Aided Middle School, Adavathur, 3.30 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Lecture on “recent trends in electronics” by P. Sakthivel of Premier Evolvics Pvt. Ltd., 10 a.m.", 
    "section": "national", 
    "title": "Tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}