{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Customers, under the influence of alcohol, will harm the public”\n\nA group of residents from Ayangulam near Palayamkottai, who submitted a petition against the proposed opening of a liquor shop in their village on Monday.— Photo: A. Shaikmohideen\n\nA group of residents from Aayankulam under Puthukkulam panchayat near Palayamkottai have appealed to the district administration not to open TASMAC’s Indian-Made Foreign Liquor outlet in the village wherein people from different communities are living amicably so far.\n\nIn a petition submitted to District Revenue Officer M.G. Kulandaivel at the weekly grievance day meeting at the Collectorate on Monday, the residents said they had to reach the nearby four-lane national highway only on foot as the hamlet had not been connected by bus service. If the liquor shop was opened in the village or on the road connecting the village with the national highway, customers, under the influence of alcohol, would harm the public.\n\nSince the proposed IMFL outlet could undermine the tranquillity of Aayankulam while posing a serious threat to women and girl students, the Collector should instruct officials not to open the liquor shop.\n\n“As a drunkard murdered a woman from Aayankulam a few months ago in the nearby forest and took her gold chain, the proposed liquor shop will certainly be the source of all evils and crimes,” said S. Mary Sugiratha Bai, 6th ward village panchayat member.\n\n“Health hazards”\n\nMembers of Social Democratic Party of India’s Tirunelveli east district wing, led by general secretary N. Iliyas, submitted a petition explaining the health hazards being caused by burning of empty tar barrels near Tamil Nadu Pollution Control Board Executive Engineer’s Office at Pettai.\n\nThe petitioners said empty tar tins were being burnt at Rahmath Nagar and Sathya Nagar areas in Pettai to use the molten tar for spraying it on steel bureaus before giving the final coat of paint.\n\n“Though it is happening in a place very close to the TNPCB office, no action has been taken to curb this menace causing breathing problems to the children, aged and those who are suffering from various ailments. Hence, appropriate action should be taken to stop this practice or shift these industries to some other far off place,” Mr. Iliyas said.\n\nRation shop\n\nsought\n\nOn behalf of the residents of Beedi Colony, Paris Nagar, Alangar Nagar and Rahman Taj Nagar, the Tamil Nadu Makkal Jananayga Katchi cadres submitted a petition seeking ration shop for the residents of these areas as the cardholders had to get the essential commodities from the ration shop situated over 1 km away from their hamlets.", 
    "section": "national", 
    "title": "Villagers oppose move to open liquor shop in their hamlet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}