{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Leading trade unions have resolved to hold street corner meetings across Tirupur knitwear cluster with the view of telling the workers that the new wage agreement could not be signed till now due to delaying tactics adopted by the textile unit owners.\n\nThe decision was taken as stalemate continued in the talks under way between six textile associations and eight trade unions in Tirupur knitwear cluster to finalise the new wage agreement.\n\nOn Monday, the talks held between the two factions ended quickly without able to come to a consensus.\n\n“We will begin the street corner meetings shortly as the textile associations are dragging on with the talks despite the fact that the previous four-year wage agreement expired on January 30 this year.\n\nThe trade unions have been inviting the associations to hold negotiations in December itself so that new wage agreement could be signed before the then existing one expired. However, the textile associations came forward with talk only at the eleventh hour,” alleged G. Sampath, district joint secretary of CITU.\n\nThe workers and the trade unionists were worried over the continuing impasse in the negotiations as the textile associations in the past did not give the wage increase with retrospective effect whenever the new wage agreement was signed beyond the date in which the previous pact ceased to exist.\n\nR. Damodaran, joint secretary of South India Hosiery Manufacturers Association, said that the textile associations had actually eased the earlier stance of giving a 19 per cent increase over the wages drawn in the last wage pact, spread over four years.\n\n“We have been now offering 24 per cent increase during the last two rounds of talks. Now the Unions should respond to that,” he said.\n\nMeanwhile, the trade unionists said they would persist with the demand for a 100 per cent hike considering the rising cost of living and demand for skilled workers.", 
    "section": "national", 
    "title": "Wage talks: trade unions to hold street corner meetings", 
    "subsection": "tamilnadu", 
    "date": "2016-02-23"
}