{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "In one of the few cases of a large number of foreigners to be tried and convicted in India, a trial court in Tuticorin in south Tamil Nadu on Monday convicted 23 foreign nationals, all of whom were on board a detained U.S. anti-piracy vessel ‘MV Seaman Guard Ohio’ , under provisions of the Arms Act. The foreigners and 12 Indians, cited as co-accused, have been sentenced to undergo a five-year rigorous imprisonment term for illegally entering Indian waters with a huge cache of arms and ammunition in October 2013.\n\nThe Sierra Leone-flagged ship owned by AdvanFort, a U.S.-based company, was intercepted by Indian Coast Guard ship ‘Naikidevi’ on October 12, 2013 and escorted to V.O. Chidambaranar Port in Tuticorin. The crew and private security guards on board the vessel were arrested and 35 firearms, 102 magazines and 5,682 rounds of ammunition were recovered from them. The ship had 10 crew members of whom eight were Indians and two Ukrainians. Besides, the vessel had 25 security guards — six British, 14 Estonian, four Indians and one Ukrainian.\n\nDistrict Principal Sessions Court Judge N. Rajasekar pronounced the accused guilty of charges under the provisions of the Arms Act, 1959. Reacting, R. Subramaniya Adityan, counsel for the accused, said he would file an appeal.\n\nThe charges against eight persons accused of smuggling diesel and transporting it to the vessel were not proved and they were acquitted for charges under the Essential Commodities Act.\n\nThe ‘Q’ Branch CID of the Tamil Nadu, which investigated the case, said the entry of MV Seaman Guard Ohio was a “threat to internal security”. The ship’s crew had claimed that the ship had run out of fuel and was stranded. However, the prosecution submitted that had there been an emergency, the Captain could have alerted the Maritime Rescue Coordination Centre (MRCC) seeking assistance from the Indian Coast Guard. “Instead he chose to lay anchor in Indian waters and buy about 1,500 litres of fuel clandestinely with the help of agents. When the same vessel visited Cochin Port there was no sign of any weapons…when intercepted by the Coast Guard the private security guards on board were heavily armed,” a senior police officer told The Hindu .\n\nAn alert by the Research and Analysis Wing (RAW), led to the interception of the U.S. vessel off the Tuticorin Coast on October 11. Indian Coast Guard Ship Naikidevi intercepted the vessel anchored 10.75 nautical miles off the coastline and just 3.8 nautical miles from the base line from where the Indian territorial waters begin.", 
    "section": "national", 
    "title": "5-year jail for crew of U.S. anti-piracy ship", 
    "subsection": "general", 
    "date": "2016-01-12"
}