{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Ghalib Guru’s feat remained the most shared story on social networking sites in J&K. —Photo: PTI\n\nGhalib Guru, son of executed Parliament attack convict Afzal Guru, has secured the 19th rank in the 10th J&K board examinations. Besides creating a buzz among netizens, separatist leaders on Monday congratulated him. “Students, despite trying times, are performing exceptionally well, which is a very encouraging sign for Kashmir. It would be a befitting reply from the son to the hangmen of his father if he excels in his studies. Ghalib has set an example for other children,” said a statement issued by a Hurriyat faction headed by Syed Ali Geelani.\n\nThe separatist amalgam will reward students who have secured top 20 positions in the 10th class examinations.\n\nMirwaiz Umar Farooq, heading another Hurriyat faction, was the first to tweet about Ghalib’s feat.\n\n“Congratulations to all who have done well in matriculation exam specially Young Ghalib son of Shaheed Afzal Guroo, 4 securing 94% way to go!!,” tweeted the Mirwaiz.\n\nA resident of Sopore, 55 km north of Srinagar, Afzal Guru was executed on February 9, 2013 when Ghalib was 12 years old.\n\n“Had Ghalib’s father been alive today, he would have been proud of his success. I used to stand by him like a teacher and ask him to concentrate on studies,” said Tabasum Guru, Ghalib’s mother.\n\nGhalib says his father was showing him “the way to deal with adversity and confusion in life.” “My father used to tell me to pray ... that is what I do,” said Ghalib.\n\nThe National Conference, in whose term Guru was hanged, praised his son.\n\n“Congratulations to Ghalib Guroo, son of late Afzal Guru for securing 474 marks in 10th class exams. Well done Ghalib, so proud of you. Way to go,” wrote Sara Hayat Shah, an NC spokesperson, on Facebook.\n\nGhalib’s feat remained the most commented and most shared story on social networking sites in Jammu and Kashmir.\n\nHurriyat, NC praise achievement despite adversity", 
    "section": "national", 
    "title": "Afzal Guru’s son among Class 10 toppers in J&K", 
    "subsection": "general", 
    "date": "2016-01-12"
}