{
    "author": [
        "Kolkata Bureau"
    ], 
    "text": "Officials say law and order situation will worsen\n\nBJP MP S.S. Ahluwalia (centre) and other leaders on their arrival in Malda district on Monday to visit the violence-hit Kaliachak police station.— Photo: PTI\n\nThe police on Monday stopped a BJP delegation and CPI(M) legislator Mohd. Salim from visiting violence-hit Kaliachak in Malda district.\n\nOn January 3, the Kaliachak police station was attacked and several police vehicles were torched during a rally by a minority community. Ten persons have been arrested.\n\nThe fact-finding team comprising three MPs — Bhupendra Yadav, S.S. Ahluwalia and B.D. Ram — was constituted by the party’s national president Amit Shah on Sunday and were to submit a report to him after the visit.\n\nThere was large deployment of police in and around the railway station when the MPs reached there at 6.10 a.m. They were escorted to the waiting room and after three hours were asked to take the train back to Kolkata.\n\n“Under pressure from the State government, the district administration said that Section 144 [banning unlawful assembly] was promulgated in the area. We told them that we are not here to incite or instigate anybody but to console people,” Mr. Ahluwalia told journalists.\n\nAnother member, Bhupendra Yadav, said the delegation wanted to know the truth but were forcibly sent back. Later in the evening, the MP from the adjoining Raiganj Lok Sabha constituency, Mohd Salim, was also prevented from entering Kaliachak. The police detained the MP for a few hours and then released him.\n\n‘BJP fomenting trouble’\n\nThe BJP is using social media to turn “a criminal case” into “a communal issue,” Trinamool Congress leader and party’s national spokesperson Derek O’Brien said on Monday.\n\nCommenting on the BJP’s plan to visit Kaliachak, party’s national spokesperson Derek O’Brien said the party’s idea was to “fuel communal tension” in the disturbed area.\n\nMr. O’Brien alleged that the BJP and Rashtriya Swayamsevak Sangh (RSS) was politicising the issue using social media.\n\nWe wanted to know the truth but were forcibly sent back, says BJP member", 
    "section": "national", 
    "title": "BJP team stopped from entering Kaliachak", 
    "subsection": "general", 
    "date": "2016-01-12"
}