{
    "author": [
        "National Bureau"
    ], 
    "text": "The Congress on Monday demanded the resignation of the Minister for Road Transport and Highways, Nitin Gadkari, accusing him of engaging in “crony capitalism” by handing over a contract worth Rs.1,050 crore for the construction of the Zojila Pass Tunnel in Jammu and Kashmir to the Mumbai-based IRB Infrastructure Developers Ltd, even as Mr.Gadkari denied the charges fully.\n\nAICC general secretary Digvijaya Singh, who levelled these charges, said he had gone to the Central Vigilance Commission (CVC) with the complaint and asserted that Mr. Gadkari’son, Nikhil Gadkari, had been a shareholder of Ideal Energy, a subsidiary of IRB Infrastructure Developers.\n\nMr.Singh said that in the “final round”, the contract was awarded to IRB in a single bid, elbowing out reputed developing companies such as “Infrastructure Leasing and Financial Services (IL&FS), Larsen & Toubro (L&T), Hindustan Construction Corporation (HCC),” and “violating” the guidelines of the Central Vigilance Commission (CVC).\n\nMr.Gadkari denied the charges levelled and said, “In my department, no work is done without following due process of e-tendering. The Ministry didn’t favour anyone while giving tenders”. Denying any connection with the company in question, the Minister said his son was not the director in that company. He said the I-T department had given a clean chit to him during the UPA regime.\n\nThe Congress, however, was unconvinced. “This is a clear case of corruption at the highest level and I demand that Mr.Nitin Gadkari should be sacked by Narendra Modi, the Prime Minister, if he sincerely believes in controlling corruption in his government,” Mr.Singh said.\n\nHe said the companies that had initially shown interest to build the tunnel — the country’s most expensive road project so far — ended up withdrawing their tenders as they were “given specific signals to withdraw or face consequences in other projects.”\n\nThe Congress alleged that the contract was awarded to IRB in a single bid, elbowing out reputed companies.", 
    "section": "national", 
    "title": "Congress accuses Gadkari of favouring infra firm", 
    "subsection": "general", 
    "date": "2016-01-12"
}