{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Anita Shete favoured maintaining the tradition of women not being allowed to offer worship to the deity\n\nMarking a radical shift in an age-old tradition, the trust board of the famous Shani Shingnapur Temple in Maharashtra’s Ahmednagar district has appointed a woman as its president.\n\nAnita Shete, who was inducted last week as one of the trustees, was announced as president of the trust on Monday. On January 7, the Charity Commissionerate announced the nomination of Ms. Shete, a homemaker, along with another woman, Shalini Lande, as part of the 11 new trustees who will helm the affairs of the temple.\n\nHowever, rather than a conclusive demolishing of gender barriers, the gesture is being viewed largely as a symbolic one as Ms. Shete is being perceived as a conservative who is an ardent believer in, and a keeper of, centuries-old traditions.\n\nFollowing her appointment last week, Ms. Shete, along with Ms. Lande, is reported to have said that the tradition of women devotees not being allowed to worship the Shani deity would be maintained. “I have deep faith in different traditions followed at the temple and will ensure they remain intact during my tenure,” she said.\n\nOne of the most controversial traditions has been the barring of women from the inner sanctum of the temple where the idol of Lord Shani is installed.\n\nThe temple’s trustees have been embroiled in controversy since November last year, when a woman attempted to enter the sanctum where the idol of Lord Shani is installed. The ‘violation’ caused the trustees to perform ‘purification rituals’, which kicked up a row and outraged several women groups across the State.\n\nThe trustees said both men and women were not allowed to climb the shrine arena where offerings like garlands and oil are kept.\n\nIn December, four women from the Bhumata Brigade attempted to breach the stiff security cordon around the inner sanctum, but were barred by security personnel. The brigade plans a massive rally of 400 women activists to storm the temple premises on Republic Day this month as part of their crusade against gender discrimination and in a bid to overthrow the tradition of debarring women from entering or offering worship inside the sanctum.\n\n“While it is unfair to remark on how conservative or progressive Ms. Shete’s tenure would turn out to be, the fact that a woman has been appointed president of a temple trust steeped in centuries of patriarchy marks a significant shift. We hope that she [Ms. Shete] shows courage by allowing women to offer worship in the inner sanctum,” said activist Hamid Dabholkar.", 
    "section": "national", 
    "title": "Is naming woman as trust chief tokenism?", 
    "subsection": "general", 
    "date": "2016-01-12"
}