{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Atta Mohammad Khan has buried at least 235 bruised, defaced and decomposed bodies in the past 26 years.— File PHOTO: NISSAR AHMAD\n\nGravedigger Atta Mohammad (75), who helped identify the graves of several “disappeared’ Kashmiris, has died.\n\nHe was a resident, of Bimyar, Chahal, Uri, more than 100 km north of Srinagar. Mohammad breathed his last on Sunday night.\n\nHe had buried at least 235 “bruised, defaced and decomposed bodies” in the past 26 years of raging militancy in the State.\n\n“He was suffering from chest and kidney ailments,” said Manzoor Ahmad, his son.\n\n‘Brave Kashmiri’\n\nRights activist say Mohammad, a farmer by profession, played a significant role in indentifying unmarked graves in the Valley. “Mohammad is a brave Kashmiri who, despite an atmosphere of militarisation and repression, continued to speak out the truth,” said a spokesperson of the Association of Parents of Disappeared Persons (APDP), an organisation of families whose relatives have been missing after being allegedly picked up by the security forces in most cases.\n\n“On some occasions, he and the local community members would retain some belongings of the dead, which helped identify them when their families came looking,” said the spokesman.\n\nJammu-Kashmir Coalition of Civil Society (JKCCS), a Srinagar-based rights body, has documented the existence of 7,000 unmarked graves in Baramulla, Kupwara, Bandipora, Poonch and Rajouri districts of Jammu and Kashmir.\n\nNo records\n\nThe government has no records to establish the identity of these unidentified persons.\n\n“Mohammad is among the very few who came out in the open to testify as witness,” said a JKCCS coordinator Khurram Pervez.\n\nDNA profiling\n\nOn September 16, 2011, the State Human Rights Commission directed that the bodies should be identified using all available means and techniques, including DNA profiling and dental examination. Later, in 2012, the court directed the State to undertake DNA profiling of those buried in unmarked graves. But the State government has expressed its inability to do this.", 
    "section": "national", 
    "title": "Man who helped identify graves of disappeared Kashmiris dead", 
    "subsection": "general", 
    "date": "2016-01-12"
}