{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "She had confided to BJP leaders her disappointment with the Centre over flood relief assistance\n\nMonday went by without Peoples Democratic Party (PDP) leader Mehbooba Mufti taking oath as Chief Minister of Jammu and Kashmir in a sign that she was determined to take the post on her own terms.\n\nThis was acknowledged by her ally, BJP, with its general secretary Ram Madhav (who had helped to negotiate the alliance) saying: “It is for the PDP to take the first call… It has to decide on its leader and come forward. I hope it takes a decision soon so that this uncertainty ends.”\n\nGiving no clue to her plans, Ms. Mehbooba released a statement praising the local administrative officials for their work under her father, late Mufti Mohammad Sayeed. Her close aides told The Hindu that Ms. Mehbooba’s delay in taking over as Chief Minister was also a way of making sure that her engagement with the BJP was on her own terms. Sources in the BJP said she had confided to senior BJP leaders, including Mr. Madhav, her disappointment with the Union government over assistance for flood relief works.\n\n“There is disquiet within the party on the lack of outreach from the BJP’s top leadership to the PDP, especially during Mufti Sahab’s illness and even after his death,” said a senior aide of Ms. Mehbooba. This was in contrast to the warmth shown by Congress president Sonia Gandhi. “BJP president Amit Shah did not visit Mehboobaji, while Ms. Gandhi who is not in alliance with the PDP did so,” a source said. In fact, the PDP is yet to respond to Governor N.N. Vohra’s letter asking that it make clear its intention in respect of government formation. At a meeting with PDP legislators on Sunday evening, Ms. Mehbooba turned emotional and was assured of the party’s support. “She is aware that the party has lost some ground because of its alliance with the BJP. She has to assert her control not just over the party but also over the alliance if the going has to be smooth for the rest of the term,” said a source.", 
    "section": "national", 
    "title": "Mehbooba maintains the suspense", 
    "subsection": "general", 
    "date": "2016-01-12"
}