{
    "author": [
        "Santosh Patnaik"
    ], 
    "text": "HUDCO to provide a loan of Rs.7,500 crore for capital Amaravati\n\nUnion Minister M. Venkaiah Naidu shares a lighter moment with Andhra Pradesh Chief Minister N. Chandrababu Naidu as Union Minister of State for Finance Jayant Sinha and others look on at the CII Partnership Summit in Visakhapatnam on Monday.— Photo: K.R. Deepak\n\nThe focus on the second day of the CII Partnership Summit and Sunrise Andhra Pradesh Investment Meet here on Monday was on development of futuristic capital at Amaravati in the Vijayawada-Guntur region.\n\nMoUs envisaging investment of Rs.1.95-lakh crore were signed.\n\nThe MoUs include establishment of a thermal power plant in Krishna district by Queensland Coal with an investment of Rs. 30,000 crore, 66 agreements for investment of Rs. 6,000 crore in food processing units, agreements by retail outlets including Walmart to invest Rs.1,500 crore and beach sand mining by Trimex with an investment of Rs. 2,500 crore in Srikakulam and LNG terminal by PETROGAS Private Limited at Krishnapatnam by investing over $ 500 million.\n\nLaunching of an exclusive retail policy by Chief Minister N. Chandrababu Naidu attracted praise from Walmart India CEO Krish Iyer, Raheja Corporation Group president Neel Raheja, Future Group CEO Kishore Biyani and others.\n\nHUDCO loan\n\nUnion Minister for Urban Development M. Venkaiah Naidu said HUDCO would provide a loan of Rs.7,500 crore for Amaravati. He said Prime Minister Narendra Modi was keen on providing all possible assistance to Mr. Chandrababu Naidu not because he was an alliance partner. The entire world knows him as an able leader and how he contributed his might for developing Hyderabad as an IT hub,” he pointed out.\n\nIn his address, the Chief Minister exuded confidence that Andhra Pradesh would overtake Gujarat in ease of doing business by attracting investments from across the world in manufacturing, food processing, infrastructure and housing in a big way.\n\n33,000 acres of land pooled\n\nMr. Naidu elaborated as to how under most difficult situation they were successful in acquiring 33,000 acres from farmers under the Land Pooling Scheme for creating a world-class capital city at Amaravati.", 
    "section": "national", 
    "title": "MoUs worth Rs. 1.95-lakh cr. signed at A.P. investment meet", 
    "subsection": "general", 
    "date": "2016-01-12"
}