{
    "author": [
        "Mark Brown"
    ], 
    "text": "Days of looking at crossed-out dates on original manuscripts with the help of a magnifying glass reveals that there are different dates on five works from the 17-th century composer’s early period\n\nMozart symphonies from one of the most important periods of his composing life have been wrongly dated, a British scholar has discovered.\n\nJohn Arthur believes he has made what is arguably the most important Mozart discovery of the last 30 years: that the accepted composition dates are wrong for five symphonies written by a 17 and 18-year-old Mozart in 1773 and 1774.\n\n“I was absolutely stunned, gobsmacked really,” Arthur said. “It completely changes our understanding of the works he composed in that period.” The works are part of a collection of nine handwritten symphonies that were bound in a single volume by Mozart’s father, Leopold, and include some of his most celebrated early instrumental work, including K 183, often called the “little G minor”, which was used in the opening music for Milos Foreman’s film Amadeus , accompanying the attempted suicide of Salieri.\n\nThe mistakes range from a couple of days to nine months. The five wrongly dated symphonies, according to Mr. Arthur, are: Symphony 24 K182 in B Flat, which should be 1 October 1773, not 3 October; Symphony 26 K184 in E Flat, which should be November 1773, not March; Symphony 27 K199 in G, should be January 1774, not April 1773; Symphony 28 K200 in C, should be February 1774, not November; Symphony 30 K202 in D, should be 16 May 1774 not 5 May 1774. They may not sound like huge discrepancies but are important considering how young and prolific Mozart was — a week was an awfully long time in the teen genius’s life.\n\n“It was the time he was becoming the Mozart we know, when Mozart became Mozart,” said Arthur. “Mozart is coming under new influences every month and this completely changes the biography of that period.” For example: “In the summer of 1773 we know Mozart was in Vienna and two of the symphonies had been thought to predate that visit,” said Mr. Arthur.\n\n“Now it is clear they were written after Vienna, in November and January. If you look in the music of these symphonies you can see influences and things that Mozart learned during his Vienna trip.” The discovery allows scholars to fill in puzzling gaps in our knowledge of Mozart. For example, before the discovery there were no known works from the first three months of 1774.\n\n“It has been completely blank,” said Mr. Arthur. “We now know what Mozart was doing in those first two months of 1774. It is very exciting.” The two best known works from the nine are K183 and K201, a symphony that the Guardian’s Tom Service said changed his life. He wrote of first hearing it: “It was an experience that had the immediacy of an epiphany, a revelation of a new world of feeling and being O This music symbolises, for me, the potential power of the musical experience and the start of a never—ending journey of discovery.”\n\nMr. Arthur said both these works were correctly dated, but the re-dating of the other symphonies before and after was of huge importance.\n\n“183 and 201 contain genuine Mozart miracles and they can be understood better if one has got the dates of the surrounding symphonies correct O they can be put in context, you can understand how Mozart has got there,” he said.\n\nThe mystery of when Mozart wrote the symphonies arose because someone crudely crossed out the dates on the original manuscripts, possibly because they wanted to pass them off as later works and not the works of a teenage boy. “There has always been a problem with the dates of the symphonies,” said Mr. Arthur.\n\n“Someone cancelled the dating inscriptions on the symphonies so for the past 200 years they have always been a puzzle and a problem,” he added.\n\nThe manuscripts are now a crown jewel of the Morgan Library in New York, on a long-term loan as part of the Robert Owen Lehman collection. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Music dates of key Mozart symphonies wrong, says scholar", 
    "subsection": "general", 
    "date": "2016-01-12"
}