{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Move is part of decision to re-define terms that are not scientifically precise\n\nThe India Meteorological Department (IMD) has officially expunged the word “drought” from its vocabulary, months after it struck a contrarian note and correctly forecast one of India’s severest monsoon deficits last year.\n\nAccording to a circular issued by the department last Thursday, the move is part of a decision to do away with or re-define terms that are not scientifically precise. Beginning this season, for instance, if India’s monsoon rainfall were to dip below 10 per cent of the normal and span between 20 and 40 per cent of the country’s area, it would be called a “deficient” year instead of an “All India Drought Year” as the IMD’s older manuals would say. A more severe instance, where the deficit exceeds 40 per cent and would have been called an “All India Severe Drought Year,” will now be a “Large Deficient Year”.\n\nThe IMD has never used the term “drought” in its forecasts and has maintained that declaring droughts was the prerogative of States. “Some confusion has been there over some years,” said B.P. Yadav, spokesperson for the agency, “and we wanted to be more precise.”\n\nThe agency had several definitions of drought: meteorological, hydrological and agricultural, and it was quite possible for a State to have a meteorological drought — 90 per cent shortfall of the average monsoon rainfall — but not suffer an agricultural drought —if the shortfall didn’t affect more than 20 per cent of the State’s area. “Declaring a drought has never been the IMD’s mandate and, in fact, not even that of the Central government,” said Shailesh Nayak, former Secretary, Ministry of Earth Sciences, to whom the IMD reports. “That’s because drought is not a measure of productivity (agricultural).”\n\nOfficials said the change in the nomenclature would not practically influence the way States viewed droughts.\n\nThe spokesperson for the agency said there would now be a standardised definition for heat waves and cold waves, and the IMD’s local arms would no longer use terms such as “could” or “may” to suggest the possibility of showers.", 
    "section": "national", 
    "title": "No more ‘droughts’ in India, says IMD", 
    "subsection": "general", 
    "date": "2016-01-12"
}