{
    "author": [
        "B Kolappan"
    ], 
    "text": "N. Ravikiran will begin the work on January 12 at the International Institute of Tamil Studies in Taramani\n\nTirukural, a moral treatise in pithy verse is rarely associated with music.\n\nNow, Chitraveena exponent N. Ravikiran is planning to set to music all 1330 couplets. He will begin the work on January 12 at the International Institute of Tamil Studies in Taramani.\n\nA State government press release said Madurai-based Ulaga Tamil Sangam would also support this effort.\n\n“It is possible to make use of the lyrical beauty of the kurals and set them to music. I have decided to complete the task in 50 hours,” said Mr.Ravikiran when asked how a work not meant for musical rendering would fit into the grammar of Carnatic ragas.\n\nIn the past noted singers and supporters of Tamil Isai Movement including M.M. Dhandapani Desikar, Kudanthai Sundaresan and playback singer Chidambaram C.S. Jayaraman have given full-fledged Tirukural concerts. Dhandapani Desikar would begin his concert with the first couplet, Agara Mudhala Ezhuthellam.. .\n\nMr. Ravikiran said he would use over 300 Carnatic ragas for setting the couplets to music.\n\n“Besides I will use Hindustani and folk tunes, tunes suitable for western orchestra and tunes capture the attention of children. My objective is also to make Tirukural popular on concert platforms on a par with traditional keerthanas,” he said.\n\nConversion of some chapters\n\nHe is planning to convert some chapters into keerthana formats. “I may use a particular raga for an entire chapter or ragamalika to add colour,” said Mr Ravikiran, who is instrumental in bringing out more keerthanas of Oothukadu Venkatasubbaiyar.\n\nThe Chitraveena player said IAS officer T.K. Ramachandran offered the necessary help for the project.\n\n“I will also set the couplets to rare thalas. Musicians, Tamil scholars, rasikas and general public are welcome to participate in the event at the International Institute of Tamil Studies in Taramani,” Mr Ravikiran added.", 
    "section": "national", 
    "title": "Now, Tirukural will be set to Carnatic music", 
    "subsection": "general", 
    "date": "2016-01-12"
}