{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "It is nothing but brutal perversion, says Justice Mishra\n\nIncreasing instances of rape of children have caused alarm among all sections of society.— File Photo: G. Ramakrishna\n\nCrimes against children was an indication of the abysmal depths to which society is falling, the Supreme Court said on Monday.\n\nRape of infants and children below 10 years was nothing but brutal perversion. It asked Parliament to enact a separate law providing for harsh punishment.\n\nThis is the first time the Supreme Court has distinguished infants and children below 10 from the general description of “minors” given by law to anyone below the age of 18.\n\nA Bench, led by Justice Dipak Misra, said Parliament had to separately define the word “child” in terms of rape.\n\nThe suggestions to Parliament are part of an order dictated at the end of a hearing of a writ petition seeking castration as an additional punishment for child rapists.\n\n“The pain and distress caused to a child who knows nothing about sex and rape is nothing but brutal perversion. When a society moves this way, it has to be stopped,” Justice Misra observed.\n\n“Victims are as young as three years to four years of age... there was even one instance of a 28-day-old infant...” Justice Misra remarked later that such crimes were “atrocious, unconscionable and cruel.”\n\nThe court pointed out how Section 376 (2) (f) of the Indian Penal Code only talked of rape of a “woman below 12 years of age.” The Code had no specific provision dealing with punishment for raping a girl below 10 and infants.\n\nAttorney-General Mukul Rohatgi agreed to highlight the court’s suggestions to the government for putting it up before the lawmakers for an appropriate legislation.\n\nThe court, however, declined SCWLA’s plea to include castration as an additional punishment, saying the judiciary could not issue a mandamus to create a punishment for an offence. “That is the job of the legislature,” Justice Misra told senior advocate Mahalakshmi Pavani for SCWLA.\n\n“You have protected juvenile offenders in the past, it is time to protect juvenile victims,” Ms. Pavani said.\n\nThe Supreme Court’s suggestion to Parliament comes even as new anti-rape laws have made rape punishable with death penalty.", 
    "section": "national", 
    "title": "SC wants separate law to deal with child rape", 
    "subsection": "general", 
    "date": "2016-01-12"
}