{
    "author": [
        "Special Correspondent"
    ], 
    "text": "United States Consul General Michael Mullins (second from right), Telangana CII chairperson Vanitha Datla (left), IT Secretary Jayesh Ranjan (seond from left), and Margadarsi MD Sailja Kiran during the Girls in Tech launch in Hyderabad on Monday.— Photo: KVS Giri\n\nSan Francisco-based global non-profit organisation Girls in Tech (GIT), working towards empowering women in technology and entrepreneurship, has launched India operations and made Hyderabad its hub.\n\nGirls in Tech India will “support and raise the visibility of women in STEM (science, technology, engineering and mathematics) fields,” national managing director Sree Divya Vadlapudi said at the launch on Monday. The young head of the India chapter hit the headlines a few years ago when her name figured in the Limca Book of Records as the undergraduate researcher with most number of international research publications.\n\nWhile keeping the ideologies – engagement, education and empowerment of women – of the parent body intact, GIT India wants to localise the mission with best resources available to achieve the desired results. Over the past seven months, it has identified a few focus areas such as helping students take up entrepreneurship after college and mothers returning to careers after taking a break. “The programmes will be result-oriented,” Ms. Vadlapudi said, adding already 2,100 women had been trained.\n\nAgreeing that it was not easy explaining to people the cause and concept, she was confident of fanning beyond Hyderabad and Telangana into other States, starting with Andhra Pradesh.\n\nBeginning with a mentorship programme for coding at school, college and professional levels next month, GIT India has lined up a gamut of events for the year. Going forward, there will be an entrepreneurship workshop, Lady Pitch Night, with participation of serial entrepreneurs and venture capitalists, a GIT hackathon besides a catalyst conference.\n\nUnited States Consul General Michael Mullins, addressing the event, highlighted how GIT provided a “terrific platform for women to cultivate skills.”\n\nIts activities assume significance when seen in the context of the “sub-conscious biases” that women were often subjected too. Parents needed to encourage girls to get into STEM areas, he said, citing statistics on how the earnings of women working in the fields were 33 per cent more compared to those in non-STEM areas.\n\nMakes Hyderabad the hub", 
    "section": "national", 
    "title": "Silicon Valley’s ‘Girls in Tech’ begins operations in India", 
    "subsection": "general", 
    "date": "2016-01-12"
}