{
    "author": [], 
    "text": "David Bowie, the innovative and iconic singer whose illustrious career lasted five decades with hits like Fame , Heroes and Let’s Dance , died on Sunday after a battle with cancer. He was 69.\n\nRepresentative Steve Martin said early on Monday Bowie died “peacefully” and was surrounded by family. The singer had battled cancer for 18 months.\n\n“While many of you will share in this loss, we ask that you respect the family’s privacy during their time of grief,” the statement read. No more details were provided.\n\nBowie turned 69 on Friday, the same day he released a new album called Blackstar .\n\nBowie, who was born David Jones, came of age in the glam rock era of the early 1970s. He had a striking androgynous look in his early days and was known for changing his looks and sounds. The stuttering rock sound of Changes gave way to the disco soul of Young Americans , co-written with John Lennon, to a collaboration with Brian Eno in Berlin that produced Heroes .\n\n“My entire career, I’ve only really worked with the same subject matter,” Bowie said in 2002. “The trousers may change, but the actual words and subjects I’ve always chosen to write with are things to do with isolation, abandonment, fear and anxiety all of the high points of one’s life.”\n\n“What I’m most proud of is that I can’t help but notice that I’ve affected the vocabulary of pop music. For me, frankly, as an artist, that’s the most satisfying thing for the ego,” he said.\n\nBowie kept a low profile in recent years after reportedly suffering a heart attack in the 2000s. He made a moody album three years ago called The Next Day his first recording in a decade. Blackstar , which earned positive reviews from critics, represented yet another stylistic shift, as he gathered jazz players to join him. Bowie was married to international supermodel Iman since 1992. British PM David Cameron tweeted that Bowie’s death is “a huge loss.” — AP\n\nBorn David Jones, the crooner came of age in the glam rock era of the early 1970s", 
    "section": "national", 
    "title": "Singer David Bowie passes away at 69", 
    "subsection": "general", 
    "date": "2016-01-12"
}