{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "A day after an RSS body asked all madrasas in the country to hoist the national flag on Republic Day, Darul Uloom Deoband on Monday asked the RSS if it “believed” in Constitution of India and in the national flag.\n\nThe Muslim Rashtriya Manch, (MRM), a Muslim organisation, which functions under the patronage of senior RSS leader Indresh Kumar, on Sunday had directed all madrasas in the country to hoist the tricolour on January 26.\n\nAshraf Usmani, the spokesperson of the seminary told The Hindu that though the decision to hoist the national flag is individual choice of madrasas, almost all of them not only hoist national flag but also celebrate Independence and Republic days.\n\nMr. Usmani also bluntly asked the RSS what its contribution in the freedom struggle was.\n\n“First of all, let me announce it to everybody who are ignorant of the immense contribution of madrasas in the freedom struggle of the country, that most of the madrasas not only hoist the national flag but also celebrate the Independence and Republic days regularly. Nobody has given the right to any body or any organisation like RSS to ask or direct anybody else, let alone madrasas, to hoist the national flag,” Mr. Usmani said.\n\nIn a tone which is unusual for the seminary spokesperson, Mr. Usmani said that it would be “historically unfair” for any group associated with the RSS to question or pressurise madrasas in the country to “be patriotic”.\n\n“It is a fact which everybody is aware, that those who are asking us to hoist the national flag, do not believe in it neither do they have any contribution in the struggle for the independence of the country. These people should first hoist the national flag in their headquarters in Nagpur before asking anybody, let alone us to hoist the tricolour,” Mr. Usmani said.\n\nWithout taking names Mr. Usmani said the entire category of Hindutva groups “bow before different kinds of flags and never did they declare their allegiance to the Constitution.”\n\nSeveral faculty members and Islamic scholars associated with madarsa system whom The Hindu spoke to, said they were “fed up” of “the repeated demands to prove nationalist credentials by someone whose credentials are suspect in the first place..\n\n“We are the ones who sacrificed our lives for the freedom struggle of the country. It is an indisputable fact that the ideological forefathers of the group which is asking us for our nationalist credentials, were on the sides of Britishers. Their ideological associate killed Mahatma Gandhi after all,” added a faculty member of the Deoband seminary who did not want to be named.\n\n“Now it would be hugely ironic and hypocritical of these people to ask us to do become nationalist,” added the faculty.\n\n‘Most madrasas celebrate Independence\n\nand Republic\n\nday regularly’", 
    "section": "national", 
    "title": "We hoist the flag but does RSS honour it, asks Deoband", 
    "subsection": "general", 
    "date": "2016-01-12"
}