{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Impossible for anyone coming by boat without a visa to settle in our country”\n\nSean Kelly, Australian Consul-General, said the deaths were believed to have occurred between 2008 and 2013.\n\nAn estimated 1,200 people, mostly Sri Lankan Tamil refugees, died at sea while undertaking dangerous journey by boat to reach Australia.\n\nThe deaths were believed to have occurred between 2008 and 2013, Sean Kelly, Australian Consul-General to South India, said on Friday. Elaborating on the Australian government’s tough border protection measures called ‘Operation Sovereign Borders’, he said it was impossible for anyone coming by boat without a visa to settle in Australia.\n\nPeople undertaking such long and dangerous journey by boat were being intercepted and safely removed from Australian waters or sent to another country for regional processing.\n\nResettlement in Australia would never be an option.\n\n“Between 2008 and 2013, it is estimated that over 1,200 people died at sea trying to reach Australia. There were no known incidents under ‘Operation Sovereign Borders’ involving loss of life since December 2013,” he said.\n\nCommending the ‘Q’ Branch CID of the Tamil Nadu police for intercepting and apprehending some suspects who tried to take some Sri Lankan Tamil refugees to New Zealand recently, Mr. Kelly said he had reasons to believe that the refugees were actually promised a trip to Australia.\n\nThe distance between the Tamil Nadu coast and Australia was about 3,000 nautical miles and New Zealand was even farther.\n\nThe top priority of the government was to prevent people from getting on boats and putting their lives at risk.\n\n“People smuggling is an evil and criminal activity that must be opposed in every form it takes. Such smugglers steal peoples’ money and put their lives in danger…ultimately they do not give people what they promise. The Australian government has taken a firm decision to make it impossible for the people smugglers to sell their product,” Mr. Kelly said.\n\nThe only way for Sri Lankan Tamil refugees to seek a refugee status in Australia was to return to their home country and approach through the United Nations High Commissioner Refugees.\n\n“Impossible for anyone coming by boat without a visa to settle in\n\nour country”", 
    "section": "national", 
    "title": "“1,200 Lankan refugees died trying to reach Australia”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}