{
    "author": [
        "R Rajaram"
    ], 
    "text": "With their natural habitat shrinking, birds are attracted to open spaces like the Tiruchi airport, say activists.\n\nAn independent study by a city college faculty member on bird activity in the international airport and in its vicinity here has recorded 23 bird species besides butterfly species and few mammals, amphibians and reptiles.\n\nThe ongoing study by Q. Ashoka Chakkaravarthy, Assistant Professor of Environment Science, Department of Foundation Courses, St. Joseph’s College, Tiruchi, with cooperation from the airport officials is to eventually suggest scientific measures to minimize bird hits suffered by aircrafts.\n\nEngaging a few students, the study, launched in December last week, at first sought to identify distribution of birds in the airport and its vicinity by carrying out field studies. In its preliminary report, it recorded 23 species of birds including Asian Palm Swift, Black Kite, Black-Shouldered Kite, Oriental Skylark, Spotted owl, rock pigeon, house crow, Indian robin, Common myna, Indian pond heron, Hoopoe and white throated kingfisher inside the airport. With respect to butterflies the species recorded include Blue Pansy, Small Grass yellow, crimson rose, common rose and Tawny coster.\n\nMammals such as mongoose and rabbit, amphibians such as frogs, reptiles like snakes and insects like dragonfly were recorded, said Ashoka Chakkaravarthy – also an ecologist.\n\nPoint count methodology was adopted to record distribution of bird species. Now, the study would focus on areas of bird activities, reasons for their attraction towards the airport side and how they become a hazard to aircraft. It would soon be done by field observations, inspection of infield areas and survey of buffer zone soon by seeking cooperation from the Airports Authority of India and Corporation authorities. The study would deploy bird scaring reflective ribbons in vantage areas inside the airport to ascertain the extent to which the device would scare the birds from flying inside the airport.", 
    "section": "national", 
    "title": "23 bird and butterfly species recorded in Tiruchi airport", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}