{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "With the stipulation that PAN should be quoted for purchases ofRs. 2 lakh and above, many customers may prefer to split their purchase.— FILE PHOTO: A. MURALITHARAN\n\nPeople only buy ornaments when they need them — for marriages and to maintain family traditions.G. Dhamodaran,Secretary, Tiruchi District Jewellery Association\n\nnew rule that mandates the use of Permanent Account Number (PAN) card for transactions exceeding Rs. 2 lakh since January 1, 2016 has caused much consternation among the business community, especially jewellers.\n\nNationwide protests on the issue were held by jewellery associations earlier this month, with many claiming a 25 per cent drop in transactions in places such as Bangalore.\n\n“When PAN card is not available with even 10 per cent of the people, how will the Government ensure the implementation of the rule? There is a gap in the intention and execution,” N. Chandrasekharan, president, Tiruchi District Jewellery Association, honorary secretary, Tamil Nadu Jewellers Federation and proprietor, New Raja Rajeswari Jewellers, told The Hindu .\n\nHe added that a more rigorous campaign to make PAN usage compulsory, as in the ration and Aadhaar cards, would have helped reduce the friction caused by the new rule.\n\n“Right now, customers, especially from villages, prefer to make unbilled purchases from goldsmiths rather than furnish their PAN cards at the shops.\n\nMany just walk away when you mention the PAN card,” said Mr. Chandrasekharan. “Naturally, the black marketing of gold will increase in such circumstances,” he said.\n\nWhile the move aimed at cutting down illegal transactions in fields such as travel, real estate, jewellery, and banking, and widening the country’s tax base while moving to a cashless economy, it needs more time to achieve its target, said Mr. Chandrasekharan.\n\n“Perhaps, if the government offers incentives such as tax breaks or discounts on PAN card purchases, its usage will become more widespread. But the worry over being monitored by the government will always be there,” he said.\n\nAs seen in recent years, gold has lost its lustre as an investment option.\n\n“People only buy ornaments when they need them — for marriages and to maintain family traditions,” said G. Dhamodaran, secretary, Tiruchi District Jewellery Association and owner, Archana Jewellers.\n\n“Most of our customers are from the rural belt, and they usually tend to pool their funds when they buy gold. In such cases, whose PAN card will be used?”\n\nTiruchi District Jewellery Association, which groups 385 local businesses, held a low-profile in-store candlelight protest as part of the nationwide strike.\n\n“Unless we make the PAN card compulsory, such as the basic bank account under the Pradhan Mantri Jan Dhan Yojana, small traders, who have already been hit by the entry of corporations into the jewellery business, will be forced to down shutters,” he said.\n\nAs for increasing the ceiling from Rs. 2 lakh to Rs. 10 lakh (as has been done for real estate purchases), Mr. Dhamodaran said it all depended on the “bargaining power” of the major players in the jewellery sector.\n\nThe new rule has made customers wary of shopping for gold, said an official of a leading corporate jewellery franchise in Tiruchi, who requested anonymity. “It is a bit sensitive to inform customers about the PAN card rule when they come into our store, because they may leave immediately. But we have been reiterating the rule at the billing point,” she said.\n\n“Most customers are used to buying designer pieces, which usually exceed Rs. 2 lakh. After this rule, many have opted to ‘break up’ their purchase, such as buying three bangles on one day and three on the next, to avoid the PAN card rule. But it is difficult to do that when they want to buy one big jewel such as a wedding necklace,” she said.\n\nPeople only buy ornaments when they need them — for marriages and to maintain family traditions.\n\nG. Dhamodaran,Secretary, Tiruchi District Jewellery Association", 
    "section": "national", 
    "title": "A big turn-off for jewellery buyers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}