{
    "author": [
        "Parshathy J Nath"
    ], 
    "text": "Music Maestro A.R. Rahman greeting students of PSG Group of Institutions during a visit to PSG Sarvajana Higher Secondary School in Coimbatore for singing Vande Mataram with the students on Friday. —Photo: M. Periasamy\n\n“I saw him!”, “I touched him” and “I got his autograph”. College students, volunteers and children at the PSG Sarvajana Higher Secondary School scream as they chase A.R. Rahman, who is hurrying to his car. Behind him, a squad of four journalists run to get a byte.\n\nA.R. Rahman had come to the city to perform for his ‘Nenje Ezhu’ concert. However, it was a few days ago that a nugget of information caught the musical maestro’s attention. One of the alumni of the PSG College informed him that Jana Gana Mana was first sung in PSG Sarvajana Higher Secondary School, which was set up in 1924, much before it became a national anthem.\n\nIt took place in the month of September in 1926 when Rabindranath Tagore visited the school campus. After Tagore recited it, the song became the school’s morning prayer song.\n\nSo, when A.R. Rahman finally arrived at the school on Friday, there was a great sense of excitement and pride among the school children and teachers. They sang his ‘Vande Mataram’ to welcome him. A thousand smart phones went up in air to click photographs.\n\nBoth children and adults jostled and pushed past each other to get one glance of the music composer.\n\nIn his usual calm, soft tone, he wished the children Happy New Year and reminded them that they are the most important pillar of the society. “He wished us Happy Pongal. We got to sing with him! It is a dream come true,” says an excited Shanmugapriya, a Class 9 student. She says A.R is her inspiration. “But he could have sung at least one song. At least a ‘Nenje Ezhu’.”", 
    "section": "national", 
    "title": "A historic moment", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}