{
    "author": [
        "B Kolappan"
    ], 
    "text": "The soft approach of the State government towards the BJP-led Central government on major issues reflected in the Governor’s address. The impression it gave was that the AIADMK was ready to join hands with the BJP in the 2016 Assembly polls, said CPI(M) floor leader A. Soundararajan.\n\nOn Friday, participating in the debate to thank the Governor for his address to the Assembly, he said even though the State government had been talking about reclaiming Katchatheevu, it had not adopted a resolution in the Assembly in support of its claim. “Instead the Governor’s address talks about expanding deep sea fishing capabilities and sought Rs 1,520 crore from the Centre. But the Governor’s speech had nowhere criticised the Centre for not releasing funds. Is the AIADMK planning to join hands with the BJP?” he asked. Finance Minister and floor leader O. Panneerselvam intervened to say a decision on alliance partners would be taken by Chief Minister Jayalalithaa.\n\n‘PWF is like a well-knit saree’\n\nEarlier, Mr. Soundararajan had said the People’s Welfare Front (PWF), in which the CPI(M) was a partner, was like a well-knitted saree treated in a strong dye. “It will never tear and fade,” he said recalling Minister for Textiles and Handlooms S. Gokula Indira’s remarks that it was doubtful whether the PWF could sustain itself till the election was announced.\n\nWhen Mr. Soundararajan reiterated his demand for a judicial inquiry into the release of water from the Chembarambakkam lake, Electricity Minister Natham R. Viswanathan wondered whether the reason behind a natural calamity could be probed.\n\nMr. Soundararajan countered it, saying he was only demanding a probe into the aspect of water management and not into the natural disaster. He charged that adequate warning was not issued to alert people living far away from water bodies.", 
    "section": "national", 
    "title": "AIADMK may join hands with BJP: CPI(M)", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}