{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "DMK leader K. Anbazhagan on Friday questioned the contention made by Chief Minister Jayalalithaa that he has no locus standi to move an appeal in the Supreme Court against her acquittal in a disproportionate assets case.\n\nThe appeals against the acquittal of Ms. Jayalalithaa and three other co-accused – N. Sasikala, V.N. Sudhakaran and J. Elavarasi – are scheduled for hearing before a Bench of Justices P.C. Ghose and Amitava Roy from February 2, 2016.\n\nIn two separate documents highlighting the issues he wants to argue on in the appeals, Mr. Anbazhagan, through advocate V.G. Pragasam, said the statement by the Chief Minister that he had no role in the current appeal proceedings in the apex court was made in “deliberate ignorance of the antecedents by which the accused was prosecuted in Karnataka at his instance”.\n\n“It was at the instance of this petitioner that the Supreme Court transferred the prosecution of the said accused from Tamil Nadu to the State of Karnataka as this court held that there was a total subversion of the course of justice in the trial being conducted in Tamil Nadu,” Mr. Anbazhagan argued.\n\nHe said that his role as her political opponent was touched upon by the Supreme Court, which said that political rivals were the watchdogs of the government in power.\n\nIn a separate set of issues against the High Court’s decision to set aside the confiscation of assets of six companies allegedly owned by the accused, the DMK leader asked that “when fraudulent, illegal and camouflaged transactions are carried on behind the legal facade of a company as a separate entity, whether such companies are entitled to claim any protection under law...”\n\nHe asked whether the court was not entitled “to lift the veil and identify the real persons, namely, the accused operating behind the veil ”.\n\nSays it was at his instance SC transferred the prosecution", 
    "section": "national", 
    "title": "Anbazhagan questions Jayalalithaa’s contention", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}