{
    "author": [
        "Staff Reporter"
    ], 
    "text": "VIT University’s Technology Business Incubator (VIT-TBI) has called for applications for its six-week non-residential training programme in Food and Agro Processing Technology.\n\nVIT-TBI, which is a joint initiative between the university and Department of Science and Technology, Government of India, is launching the programme with an aim to equip the youth in the region with adequate knowledge to initiate a venture in food and agro processing sector, a press release said.\n\nThis entrepreneurship development programme in food processing technology seeks to expose participants to start-up venturing process and equip them with requisite skills, knowledge and competencies to convert their start-up idea into a viable business entity.\n\nThe training programme will be conducted from February 8 to March 18. The fee to take part in the training is Rs. 2,000. The last date to apply for the programme is January 28.\n\nGraduates/diploma holders in engineering/science with interest or exposure to food processing technologies and are planning to start a venture in the domain can apply.\n\nVIT Chancellor G. Viswanathan said the programme will cover essentials of entrepreneurship, basics of marketing, finance, HR, business modeling and business planning in the business module. In technology module, the programme will provide exposure to food processing techniques, quality control, certification processes, hospitality industry and packaging. It also includes industry visits, the release said.\n\nParticipants will be equipped to write and present a project report. Qualifying projects would be considered for business incubation and seed funding at VIT-TBI.\n\nThose interested can send in their queries to tbicoordinator@vit.ac.in and tbisecy@vit.ac.in.\n\nFor registration forms, write to The General Manager, VIT-Technology Business Incubator, VIT University, Vellore 632 014. For details, contact, phone numbers 0416-2202302/03, mobile: 94433 11367/99943 09009, the release said.", 
    "section": "national", 
    "title": "Applications invited for agro training programme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}