{
    "author": [
        "Dennis S"
    ], 
    "text": "Electronic Voting Machines (EVMs), which would be used in the Assembly elections in the State, would display the new symbol for the ‘None of the Above (NOTA)’ option in the ballot unit.\n\nThe cross mark symbol designed by the Ahmedabad-based National Institute of Design (NID) was introduced by the Election Commission (EC) in September last year and was used in polls conducted thereafter. This would be the first time, the symbol would be used in polls in Tamil Nadu, officials said.\n\nOver 5.68 lakh voters (about 1.4 per cent of the total electorate) from Tamil Nadu had pressed the ‘NOTA’ button during the Parliamentary polls in May 2014. Over 46,000 voters from Nilgris Parliamentary constituency had opted for ‘NOTA’ – the highest among the 39 constituencies.\n\nEarlier, there was only a box which had the letters ‘NOTA’ but now, under the name of the last candidate would be a tab which would read ‘None of the Above’ in English and the same in Tamil. Also, the cross mark symbol would be the last symbol below the last symbol of the last candidate, official sources said.\n\nStationery procurement\n\nOfficials are in the process of procuring stationery for the polls. “We have called for a tender notification on January 8 and we expect to procure the material within two months. They would be stored in our godown near Parrys corner and respective district administration officials from across the State would take delivery of the items,” J. Jayakanthan, Director of Stationery and Printing Department said.\n\nExcept for the indelible ink, all items would be procured by the Stationery and Printing Department.\n\n“The indelible ink would be procured by the EC itself,” he said.\n\nElection Commission officials are also holding talks with banks over monitoring transactions before and during the elections, to check the practice of money being used in the polls, officials said.\n\nOver 5.6 lakh voters in TN pressed the option for parliamentary polls", 
    "section": "national", 
    "title": "Ballot unit to display NOTA symbol", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}