{
    "author": [
        "S Prasad"
    ], 
    "text": "Students looking at a model at the Mega Science Fair in Puducherry on Friday. (left)S.K. Shivakumar, former director of Indian Space Research Organisation interacts with students at the exhibition.In his address, he said India has the capability to go beyond Mars and urged students to take up space science. — Photos: S.S. Kumar\n\nShivakumar, former director of ISRO, says preparations are in full swing\n\nPreparations for Chandrayaan-2, the second lunar exploration mission of the country, is progressing well and is expected to be ready for launch by 2018, S.K. Shivakumar, former Director of Indian Space Research Organisation (ISRO) Satellite Centre, has said.\n\nTalking to reporters after inaugurating the Petit Mega Science Fair here on Friday, Mr. Shivakumar said the ambitious mission involved releasing an orbiter, lander and a rover to the moon by 2018.\n\n‘India’s own GPS’\n\nReferring to the successful launch of 1E, the fifth satellite of the Indian Regional Navigation Satellite System (IRNSS), he said that India will have its own Global Positioning System (GPS) after the completion of the launch of two more satellites in the system. The remaining two satellites will be put in orbit by the end of this year.\n\nIndia’s space programme is progressing in the right direction since it began 50 years ago, he said adding that the country had achieved production and management of satellites and used it for different applications.\n\nEarlier, addressing the Petit Mega Science Fair, Mr. Shivakumar said that India had the capability to go beyond Mars and reach other planets.\n\nHe urged students to follow their heart and take up space science.\n\nMr. Shivakumar also visited the exhibits presented by students and commended them.\n\nHe interacted with the students from various schools and answered their questions about the country’s space programme.\n\nAs many 356 models and 10 projects screened from about 530 and 20 entries respectively were showcased at the event.\n\nHe interacted with the students from various schools and answered their questions about the country’s space programme.", 
    "section": "national", 
    "title": "‘Chandrayaan-2 launch likely by 2018’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}