{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The National Handloom Development Corporation (NHDC) deployed its new ERP (Enterprise Resource Planning) software for hassle-free supply of yarn to handloom societies in Chennimalai cluster and demonstrated the concept of e-commerce for the hand-woven products on Friday.\n\nUnion Minister for Textiles (Independent charge) Santosh Kumar Gangwar initiated the activities in the presence of Alok Kumar, Development Commissioner for Handlooms, Union Ministry of Textiles, Sarvepalli Srinivas, Managing Director, National Handloom Development Corporation Ltd, Director of Handlooms and Textiles G. Latha and District Collector S. Prabakar.\n\nReferring to the contribution of Tamil Nadu in handloom sector, the Minister said that 26 handloom clusters have been approved for the state , and that two of the eight mega clusters in the country will come up in Virudhunagar and Tiruchi. The Centre has provided Tamil Nadu with Rs. 40 crore for developing the handloom sector.\n\nSupply of yarn through the NHDC increased from 1,262 lakh kg. in 2013-14 to 1,484 lakh kg in 2014-15, he said, adding that the NHDC has opened 10 new yarn godowns.\n\nThe Minister also witnessed the dyers training programme. The officials explained how the ERP system will improve productivity, increase efficiencies, decrease costs and streamline supply of raw material processes in NHDC.\n\nThe ERP system’s significant benefit the weavers, reflecting in quick delivery of yarn with higher transparency and accountability was demonstrated on the spot. The completion of processes: indenting, purchase order generation and invoice generation, within a few minutes on online platform was witnessed by an audience comprising representatives of 214 handloom societies in the district.\n\nAlongside improving the efficiency and responsiveness of the supply chain, the forecast of procurement, inventory management and demand will also result in high quality customer service, the weavers were told.\n\nThe key benefits of ERP system, made available in local language, encompass availability of yarn at best price, access to information through mobile application, determination of stock of material in yarn depots, ease in placing and checking the status of their indents, and receipt of details of dispatched material through SMS.\n\nWeavers could, hence, save time and money, and also view information about their unused quota under the 10 per cent yarn subsidy scheme at any point of time, the officials explained. The handloom cooperative societies were also exposed to the benefits accruing from e-commerce for attractive returns, and were advised to improve the living conditions of the weavers through enhancement of wages.", 
    "section": "national", 
    "title": "Chennimalai handloom societies initiate ERP system", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}