{
    "author": [], 
    "text": "RELIGION\n\nAsthiga Samajam: Naama Prachara Vaibhavam, V.R.G Mahal, Edayarpalayam, 6 a.m.\n\nSubramaniya Swami Temple: Thaipoosam ther thiruvizha- Dhevaara Innisai, Marudhamalai, 10 a.m.\n\nBalathandayudhapaani Swami Temple: Thaipoosa Thiruvizha, Sukurawarpet, 10 a.m.\n\nKovai Kamaatchipuram Atheenam: Maha Utsava Thiruvizha, Kovai Kamatchipuram Atheenam, Kamatchipuram, Trichy Road,\n\n8 a.m.\n\nGENERAL\n\nSri Krishna College of Technology: One-day workshop on ‘Geometric Dimensioning & Tolerancing (GD&T) Stackup Analysis’, ES Seminar Hall, college premises, 9.30 a.m.\n\nNGP College of Arts and Science: Placement Training Program on Abacus and Vedic Math, conference hall, college premises,\n\n10 a.m.\n\nNehru Yuva Kendra & Sivaguru Ilaignar Vilayaatu Mandram: National Roller Skates Competition, Roller Skating Rink, VOC Park, 8 a.m.\n\nSri Krishna College of Arts and Science: Guest Lecture on ‘Nanobiotechnology: A Bigger Fish for Fry’, SKIM Hall, campus premises, 10 a.m.\n\nSrinivasa Vidhyalaya Matriculation Higher Secondary School: Annual Sports Day, school premises, 2.30 p.m.\n\nKalaignar Karunanidhi Institute of Technology: Three-day Entrepreneurship Awareness Camp, KIT Campus, Kannampalayam Post, 9 a.m.\n\nThe Coimbatore Productivity Council: Quality Circles, Coimbatore Productivity Council, Race Course, 9.30 a.m.\n\nP.S.G Trust: Discourse on PSG Vanavil, PSG College of Techonology, campus premises. 5.20 p.m.\n\nAkila Bharatha Mootha Kudimakkal Matrum Pensionargal Kootamaippu (ANMKPK Bharat): Pensioners’ day, Saraswathi Natarajan Kalyana Mandapam, Ramanathapuram, 10 a.m.\n\nBishop Appasamy College of Arts and Science: Eye screening camp, college premises, 9.30 a.m.\n\nCMS College of Science and Commerce: Pongal celebration, college premises,\n\n9.30 a.m.\n\nMnemonics Learning Centre: Study Skill for students- free program, Mnemonics Learning Centre, R.S. Puram, 10 a.m.\n\nAvinashilingam Institute For Home Sciences and Higher Education for Women: Sadguru Tyagabrahma Aradhana, Thiruchitrambalam Auditiorium, college premises, 10.30 a.m.\n\nSri Ramakrishna College of Engineering: Swacch Bhaarat: - Cleaning of School Campus and Socio-economic survey, 24, Veerapaandi, Marundhangarai, 10 a.m.\n\nSri Ranganathar Institute of Engineering and Technology: Technical function and Project expo, college premises, 9.30 a.m.\n\nGRG School of Management Studies: Management Development Programme, Institute campus, 9.30 a.m.\n\nAJK College of Arts and Science: Seminar on Capital Market Reforms, Grace Auditorium, college premises, 10 a.m.\n\nCentre for Career in Uniformed Services: Nethaji Subash Chandra Bose 119{+t}{+h} birth anniversary celebrations, St. Michael’s Higher Secondary School, 10 a.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}