{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector M. Karunakaran assured farmers of Tirunelveli district on Friday that steps would be taken not to give room for irregularities in direct purchase centres (DPCs) for paddy. Reacting to farmers’ concern at the monthly grievance meeting that irregularities noticed in DPCs in the last procurement season would surface again, the Collector assured that stringent action would be taken against erring officials if complaints were substantiated with adequate evidence.\n\nAs the district was blessed with abundant rainfall during the northeast monsoon and all reservoirs and irrigation tanks now have decent storage, paddy cultivation has been taken up on 93,788 hectares against the target area of 83,100 hectare. Anticipating the demand, the district administration has made arrangements for adequate availability of fertilizers and other agro inputs. After distributing 37,684 tonnes of urea, 4,372 tonnes had been stocked in primary agricultural cooperative societies. Similarly, other chemical nutrients such as potash (distributed 16,270 tonnes and stock 1,837 tonnes), super phosphate (distributed 1,488 tonnes and stock 1,072 tonnes) and complex (distributed 25,865 tonnes and stock 2,436 tonnes) are also available at the right price. Since the situation is so favourable for bumper harvest this year, the district administration has made arrangements for opening 44 paddy DPCs.\n\n“When we took the harvested paddy at the end of the ‘kar’ season last year, we were compelled to pay anywhere between Rs. 35 and Rs. 40 as ‘handling charges’ per 100 kg bag in most of the DPCs. Those who objected to this practice were forced to take their produce back for unacceptable reasons like moisture content, inferior quality etc. These farmers had to sell their paddy to private buyers, who purchased 100 kg of paddy for Rs. 1,214 while the government’s procurement price stood at Rs. 1,525. The Collector should weed out this problem,” said Velu Mayil, district president of Tamil Nadu Vivasayigal Sangam.\n\nWhenever a rift broke out between the DPC officials and farmers, some of the farmers themselves became mediators to broker a ‘deal.’ On reaching an ‘agreement,’ the money was given only to the mediator and not to the farmer directly, the participants at the meeting alleged.\n\nFarmers alleged that this practice was more prevalent in DPCs at Munneerpallam, Puliyarai and Veerakeralamputhur. The total arrears to be settled by the ‘broker farmer’ at Puliyarai DPC now stands at Rs. 1.50 lakh. Our repeated efforts to get this amount are yet to fructify,” said an affected farmer.", 
    "section": "national", 
    "title": "Collector’s assurance on DPCs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}