{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Farmers complain that provision is there only for crops damaged by boars and elephants\n\nFarmers are being compensated for crop damages caused by animals such as wild boars and elephants, but not monkeys. The reason - there is no provision to award compensation for crop damage caused by the primates.\n\nWith several farmers in Vellore facing losses due to monkey menace, representatives of farmer association submitted a resolution to the district administration seeking compensation for crops damaged by monkeys in the district.\n\nAt the farmers’ grievance redressal meeting on Friday, Raghupathy, a farmer, said, “Monkeys have been damaging several crops, and eating coconuts, mangoes and tomatoes. But there is no provision to award compensation to crops damaged by monkeys. But at least 30 per cent of crops are damaged by the primates.”\n\nOfficials of the Forest Department told the farmers to give a representation through the farmers association. Following this, the farmers at the meeting passed a resolution and handed over it to the district administration seeking steps from the government to make crop damage caused by monkeys eligible for compensation.\n\nWild boars\n\nFarmers from various areas complained that wild boars were continuously entering into agricultural lands causing damage to crops such as groundnuts. They said that the population of wild boars is on the increase in certain pockets.\n\nS. Kalanithi, district forest officer, said following representation from farmers, an enumeration of wild boars was taken up in the district. This has been sent to the government. “The government will take a policy-level decision on how to control wild boar population. Till then, we will be able to compensate for damages caused by the animals. The farmers can inform the forest range officers in case of damage within two days of the incident. We will come and assess the field,” he said.\n\nMr. Raghupathy also urged the Forest Department to increase the compensation for deaths caused by elephants from Rs. three lakh to Rs. five lakh.\n\nFlood relief\n\nCollector R. Nanthagopal informed the farmers that the relief amount for flood-affected lands was being distributed.\n\nFor the first enumeration of affected lands, the government has sanctioned Rs. 2.88 crore for 4,162 farmers covering 2,238 hectares of land under agricultural crops. A total of 873 horticultural farmers covering 312 hectares are receiving total relief amount of Rs. 42.3 lakh.\n\n“We have received the amount from the government. The flood relief has been distributed to more than 90 per cent farmers who were part of the first enumeration,” G. Ramakrishnan, PA to Collector (Agriculture) said.\n\nIn the second enumeration of flood-affected lands, the district administration had identified 5,339 hectares of agricultural land and 666 hectares of land under horticultural crops.\n\nThe government has released Rs. 4.2 crore for agriculture and Rs. 91 lakh for horticulture. The district administration is waiting for additional fund of nearly Rs. one crore for agriculture.\n\nFarmers said there was continuous nuisance due to wild boars entering agricultural lands", 
    "section": "national", 
    "title": "Compensation sought for crops damaged by primates", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}