{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "Information is sent as SMS to Android phone, which decodes it and makes the announcement\n\nA speaker connected to an Android phone in the government buses along six routes in Valparai plateau will provide information on elephant movement to the passengers travelling to their homes in various estates. This is the latest of the early warning system to be launched on Friday.— Photo: Special Arrangement\n\nPerhaps for the first time in the country, the government buses are being used as an early warning system to reduce human-elephant conflict.\n\nOn Friday, a unique automated announcement system in buses was launched in the highly human-elephant conflict prone Valparai plateau. This is in addition to the existing systems like TV crawls, elephant alert text messages and voice calls over people's mobile phones and elephant alert indicators.\n\nDatabase of locations\n\n“We already have a database of over 250 locations through eight years of elephant tracking information. The bus alert system will fill in one of the gaps,” says Ananda Kumar, who won the Whitley Award (Green Oscar) in 2015 for the early warning systems that have helped reduced the human-elephant conflict in Valparai plateau.\n\n“A lot of school children have special classes and return home to various estates from Valparai town in buses around 7.30 p.m. The children do not have mobiles and they have to walk to their homes. This is where the bus alerts help,” he says.\n\nSix routes covered\n\nInitially, six routes covering major part of the estates have been fitted with the announcement devices.\n\n“It will also help people who don’t own mobile phones and those who can’t read messages,” the scientist says.\n\nThe system will reduce conflict, as it will eliminate surprise encounters, prepare the bus passengers so that they have enough time to take precautions, he points out.\n\n“A sudden encounter can be scary for both elephants and humans. Through the early warning systems, the unpleasant incidents could be avoided,” he emphasises.\n\nAnbu Abraham, general manager, TNSTC, inaugurated the system.\n\nV. Asokan, District Forest Officer, Anamalai Tiger Reserve; K.S. Shanmuga Velayudham, deputy manager, Mr. K. R. Muthusamy and forest ranger officers participated.", 
    "section": "national", 
    "title": "Elephant warning system on buses", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}