{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Friends, relatives allege medical negligence by hospital\n\nRelatives and friends of deceased engineer T. Thangaselvan (25) staged a protest in front of Rex Hospital, R.S. Puram, alleging that wrong treatment was what had led to his death. Led by traders’ federation leader, Irudhayaraja, they gathered in front of the hospital demanding criminal case against the doctors there and also Rs. 1 crore in compensation.\n\nThe hospital had admitted the engineering graduate for surgery on January 18 after he had complained of shoulder pain. Sources said that he had sustained injury while playing cricket near his house in Karamadai. Thangaselvan’s father Thangaraj managed a grocery store there.\n\nThe hospital had operated him but he did not regain consciousness. As an emergency situation arose, the hospital shifted him to a multi-speciality hospital in Race Course, where he died on Thursday night after three days of emergency care.\n\nHearing about his death, Thangaselvan’s friends and relatives led by Irudhayaraja gathered in front of the hospital and charged doctors with medical negligence. They then gathered at the Coimbatore Medical College refusing to take his body after post-mortem.\n\nAfter negotiations with the police, they took the body to Karamadai for burial.\n\nR.S. Puram Police, who registered a case, said that they had registered a case of suspicious death and would take the next step after obtaining the autopsy report from the CMCH doctors.\n\nClarification\n\nThe Rex Hospital in a clarification said that it operated him for shoulder problem due to injuries in his chest. They rectified it through arthroscopic shoulder procedure.\n\nIn the immediate post-operative period, patient (Thangaselvan) developed fits and was shifted to a higher centre for evaluation and treatment.\n\nIn the higher centre, his condition deteriorated and he expired on Thursday, the release said and also added that it had asked to find the cause and evidence of pre-existing medical illness which led to the problem.", 
    "section": "national", 
    "title": "Engineer’s death sparks protest", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}