{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Workshop held on higher education, career to help in guiding students\n\nThe academic training needed for hospitality industry in Puducherry lags behind in meeting the requirements of the growing tourism sector.\n\nThere are only three colleges that offer a graduate programme in tourism and one MBA course in Tourism offered at Pondicherry University.\n\nMore courses and postgraduate programmes in tourism and hospitality industry will open up better employment opportunities for youngsters in Puducherry. Assistant Professor of Tourism, Tagore Arts College, E. Devabalane said that Puducherry was developing as a tourist destination and there is demand for more human resources.\n\n“More postgraduate programmes need to be introduced in tourism for skill development,” he said.\n\nHe was speaking at the one-day workshop on higher education-cum-career guidance and confidence building programme on Friday.\n\nTourism Minister P. Rajavelu, who inaugurated the workshop, said: “This workshop is to train the teachers to guide students in choosing a course that would elevate their living standards.”\n\nHe added that this workshop was held especially for the rural students.\n\n“The career opportunities for students who score high marks are fixed. They choose either medical or engineering colleges. But, the students who score between 200 and 300 marks, especially from the rural areas, should not be dejected. There are many vocational courses available that would help them get employment. This workshop is to introduce those vocational courses to teachers who would in turn guide the students,” he said.\n\nMr. Rajavelu added that there were many courses in medical science. “In the near future, students completing their courses in Puducherry will be preferred for jobs here,” he said.\n\nTeachers and principals from 51 higher secondary schools including 43 government schools and eight private schools participated in the workshop.\n\nSignificant\n\nSecretary to the Government, Labour Department, R. Mihir Vardhan, said that this workshop assumes lot of significance since nearly 70-75 teachers would be trained and they would go to the field and in turn motivate more students. They would be exposed to what courses could be pursued by students.\n\nProfessor and Principal, College of Pharmacy, Mother Theresa PG and Research Institute of Health Sciences V. Gopal spoke on the opportunities available for those pursuing biology.\n\nWhile G. Nagaraj of Pondicherry Engineering College spoke about courses and colleges for those who want to do engineering, Professor and Head Manakula Vinayagar Institute of Technology R.V. Pazhani provided information for students interested in accounts and commerce. Besides, teachers also were exposed to the varied areas that a student would explore in physics by associate Professor in Physics KMCPGS, Puducherry, S. Periandy.\n\nTeachers and principals from\n\n51 higher\n\nsecondary schools participated", 
    "section": "national", 
    "title": "Exposing teachers to myriad vocational courses", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}