{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district administration has sought Rs. 4.48 crore as compensation for crop loss: Collector\n\nThe monthly farmers’ grievance day meet held here on Friday witnessed serious allegations against some Village Administrative Officers of demanding bribe for including names in the list of flood-affected farmers for getting compensation for crop damage.\n\nFarmer R. Kasamuthu of the Communist Party of India said that some of the VAOs and Revenue Inspectors were demanding a bribe of Rs. 1,000 for including names in the list of flood-hit agriculturists for getting compensation.\n\n“Instead of involving officials from various departments, including revenue, local administration, Hindu Religious and Charitable Endowments Department (in case of leased temple lands), agriculture and horticulture, this task should be streamlined so as to weed out corrupt practices in giving compensation,” Mr. Kasamuthu said.\n\nCollector M. Karunakaran said that the erring VAOs would be taken to task if the charges were proved. “The district administration had sought Rs. 4.48 crore as compensation for crop loss and received Rs. 2.21 crore from the government,” Dr. Karunakaran said.\n\nFarmer S.T. Shaik Maideen of Vadakarai said that coconut growers of Tenkasi, Shencottai and Kadayanallur taluks were struggling a lot as they could not get good procurement price for their produce. “Coconut farmers, who got Rs. 10 per coconut till December, are now getting only Rs. 5. Upset with this, some of the farmers are converting their coconut groves into housing plots. To arrest this trend, the government should announce a decent support price and procure coconut directly from farmers,” said Mr. Shaik Maideen, who was backed by farmer K. Zakhir Hussein, also from Vadakarai, who submitted petitions in this connection.\n\nA.M. Palanisamy of Sivagiri complained that the sugar factory in their area was yet to settle arrears to the tune of Rs. 9.80 crore to farmers since 2013.\n\n“The Collector should initiate immediate steps for early disbursal of arrears,” Mr. Palanisamy said.\n\nKasi Viswanathan of the CPI said that farmers, who had taken temple lands on lease for farming, were being coerced by the HR and CE department and police officials even after lease amount had been paid.\n\n“Rejecting the receipts as fake, the police, on receiving complaints from temple authorities, arrest the farmers. How is it possible for farmers to print receipts in a uniform fashion? Hence, the Collector should stop this nagging practice of harassing farmers,” Mr. Kasi Viswanathan said.", 
    "section": "national", 
    "title": "Farmers allege irregularities in enumeration for compensation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}