{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Dredging operations undertaken to a length of 20 km. by Olirum Erodu Foundation\n\nNOBLE VISION:Utility of the Perumpallam irrigation canal passing through the city has been restored by Olirum Erodu Foundation in Erode. - Photo: M. Govarthan\n\nHopes of the farming community in the fast urbanising areas of Lakhapuram, 46 Pudur and surroundings on the city’s outskirts to revive agricultural activities has brightened owing to the present dredging of the Perumpallam canal to a length of 20 km by Olirum Erodu Foundation.\n\nThe canal that had become defunct over the last two decades due to dumping of debris and overgrowth of shrubs and encroachments on the sides is being dredged to a depth of over 20 feet for ensuring optimal usage of water from the Perumpallam Anicut that otherwise goes waste.\n\nSix earthmovers provided free of cost by building contractors based in the city are being utilised for dredging the water body and the Olirum Erodu Foundation meets the fuel expenses, while stakeholders have been roped in from farming community as well to take care of food and other expenses of the drivers and labourers, Vice-Chairman of OEF C.D. Venkateswaran said.\n\n“Revival of the irrigation canal will also recharge ground water in the urbanised localities while facilitating resumption of agricultural activities in the rural parts, since water percolation was possible to an extent of 100 feet,” he said.\n\nSurplus water from the anicut will not go waste since the Perumpallam canal joins the Kalingarayan canal at the tail end.\n\nThe OEF, Mr. Venkateswaran said, will sensitise the residents of localities en route the canal to carry out maintenance by themselves, through efforts for raising compound walls and formation of pavements on the sides, once the canal is cleared of encroachments.\n\nThe PWD, it is learnt, is under compulsion to submit a report on the action taken for removing encroachments from water bodies in the district.\n\nThe anicut constructed over six decades ago to harness seepage from the Lower Bhavani Project canal is also poised for renovation. The Public Works Department has reportedly secured sanction of funds for the purpose. When the anicut was constructed, it had an ayacut of 3,045 acres.\n\nCultivation can be revived in at least one-third of the ayacut area once the canal’s utility is restored, farmers say.", 
    "section": "national", 
    "title": "Fillip to Perumpallam irrigation canal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}