{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Four earlier films of the producer were also not granted tax exemption. A scene from the film ‘Gethu’\n\nAlleging that the State government had “mechanically” accepted the recommendations of the Viewing Committee which has decided that the film title ‘Gethu’ is not a Tamil word and thereby denied entertainment tax exemption, the producer of the movie approached the Madras High Court seeking to quash the order.\n\nJudge recites song\n\nfrom Thiruppugazh\n\nInterestingly, when the plea moved by the Red Giant Movies, the producer, came up for hearing on Friday before Justice R. Mahadevan, the judge recited a song from the 15th century anthology “Thiruppugazh” in which a similar word had been used.\n\nSenior Counsel P. Wilson, who represented the petitioner pointing out two dictionaries compiled by professors in Tamil language said, “According to the dictionaries, the meaning of the word ‘Gethu’ was proud or hearty.”\n\nCase adjourned to\n\nJanuary 27\n\nHowever, the Additional Government Pleader maintained that ‘Gethu’ was not a Tamil word and sought time to file a reply. The judge then adjourned the matter to January 27.\n\nIn the petition, the producer of the film contended that while films like ‘Rajini Murugan’ had been given entertainment tax exemption, ‘Gethu’, starring Udhayanidhi Stalin, had been denied the benefit.\n\n‘Ill-will’\n\nAll the four films produced by the petitioner ( Oru Kal Oru Kannaadi , Vanakkam Chennai , Neerparavai , and Nanbaenda ) were not given tax exemption, the petitioner said,\n\n“The viewing committee which assesses the movies, is loaded with persons affiliated to the ruling party and therefore they carry ill-will against the firm's partner Udhayanidhi Stalin, who is the son of M.K. Stalin, treasurer of DMK.”\n\nFour earlier\n\nfilms of the producer also\n\nnot granted\n\ntax exemption", 
    "section": "national", 
    "title": "‘Gethu’ producer moves HC for tax exemption", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}