{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "The Madras High Court on Thursday passed an order for attachment of assets of cellphone service provider M/s Aircel Cellular limited.\n\nAccording to the Madras HC order, Aircel’s equipment, including servers, computer systems, telecom equipment, network switches and other equipment, could be attached in the case pertaining to non-payment of Rs.49 lakh awarded to its former collection agent, Selkon Consulting.\n\n“We are one of Aircel’s collection and markting agents, for nearly three years. However, we found the business model to be unsuitable. They were deducting money from the commission on a monthly basis for outstandings that we did not collect from the customer,” said Mekala Vaseekaran and her husband Philip Vaseekaran, run Selkon Consulting.\n\nPhilip Vaseekaran, director of Selkon Consulting, said that many Aircel agents had lost money.\n\nBut they were afraid of taking against Aircel as they usually withhold 2 to 3 months invoices and also hold the deposit of Rs.3 lakh collected from the agent as part of the agreement.\n\nCase filed\n\nSubsequently, a case was filed against Aircel on February 12, 2014 regarding deduction of unexplained sums from its agency commission. Following this, an arbitrator was appointed by Aircel on April 7, 2014 to resolve the dispute.\n\n“The arbitrator, Justice E. Padmanabhan, termed the deductions as ‘illegal, void and unenforceable’ in June 2015 and asked Aircel to pay the money by September. Since they did not pay, we waited for a few days and filed another execution petition in the Madras High Court in December and the Court passed the order to attach the assets on January 6,” added Mekala.\n\nShe said that Aircel on Thursday evening gave an undertaking to the Court stating that they would pay the principal amount of Rs. 49 lakh to Selkon Consulting.\n\n“They are supposed to give us Rs. 12 lakh as interest. They are planning to contest this in court,” said Mekala.\n\nNot to comment\n\nWhen contacted, Aircel officials at Spencer Plaza refused to comment.\n\nOrder was passed in a case pertaining to non-payment of Rs.49 lakh to a collection agent", 
    "section": "national", 
    "title": "HC orders attachment of Aircel’s property", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}