{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has refused to order the release of Indian and foreign currencies seized by the Central Bureau of Investigation (CBI) last year from a money changer in connection with the ongoing investigation into theft of several kilograms of gold and foreign currencies estimated at Rs. 17.51 lakh from the ‘strong room’ of Customs and Central Excise office in Tiruchi.\n\nJustice M. Venugopal dismissed a criminal revision case filed by Rock Fort Money Changers, represented by its director P. Muruganandam, after CBI Special Public Prosecutor S. Jeyakumar submitted that another director of the company, Manikandan, was suspected to have aided the criminals in encashing the gold besides converting the foreign currency into Indian money.\n\nHolding that a Special Court, for hearing CBI cases, had rightly rejected the plea for return of currencies on October 27, the judge said: “Although a court below has power to dispose of the property under Section 457 of the code of Criminal Procedure, it is not expedient to release the property when the case is under suspicion and investigation had not been completed.”\n\nHe recorded the submission of the SPP that the theft came to light on April 18 when Directorate of Revenue Intelligence (DRI) officials went into the strong room to take possession of a packet containing 18,512 grams of gold for being produced before a Judicial Magistrate in Tiruvarur. To their shock, the package was found tampered and weighed only 3,580 grams.\n\nHence, a First Information Report was registered against Customs Superintendent Mohammed Farook and inspector Senthil Kumar who were together in possession of five keys required to open the strong room safeguarded with double lock key system. Subsequently, on May 2, the Commissioner of Customs, Tiruchi, reported loss of two more consignments of gold weighing 7,227 grams and 14,082 grams.\n\nActing on a specific intelligence input, the CBI officials raided the residence of Jaffar Ali, Abdul Kalam Azad, and Zahir Hussain and seized unaccounted cash to the tune of Rs. 85 lakh suspected to be the proceeds of the gold disposed of by them.\n\nOther incriminating documents in possession of the three revealed that the petitioner firm’s director Manikandan was involved in unauthorised gold transactions and illegal sale as well as purchase of foreign currencies in violation of Foreign Exchange Management Act and Reserve Bank of India (RBI) guidelines by creating fake documents in the name of fictitious persons.\n\nAlthough a copy of the returns submitted by the petitioner firm with the RBI on July 31 stated that the available balance of foreign currency with it was nil, the CBI sleuths recovered unaccounted foreign currency estimated at about Rs. 20 lakh from the firm, the SPP added.", 
    "section": "national", 
    "title": "HC refuses to release seized foreign currency", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}