{
    "author": [
        "Special Correspondent"
    ], 
    "text": "E. Vallavan, District Collector, having a look at the building plan of the indoor stadium in Karaikal on Friday.\n\nWork on the state-of-the-art building to house an indoor stadium has been completed.\n\nThe stadium, located near the seashore, has a plinth area of 3,600 square metres. The infrastructure among other things, include 1,500-capacity gallery, a series of long-shadow lights all around, rest room for players, an office room, and a coach room.\n\nA transformer has been set up to ensure uninterrupted power supply, and, as a standby arrangement, a generator forms part of the infrastructure.\n\nFlooring forms the important infrastructure for an indoor stadium; any compromise in use of wood will lead to knee pain for sportspersons, an official source told The Hindu on Friday.\n\nSo, maple wood, imported from California, is used for the flooring on an area of about 3,000-odd square metre. Logs of wood have been fitted in rows and columns before being nailed together by means of sharp-edged pins.\n\nThis specialised wood prevents knee pain for sportspersons.\n\nThe indoor stadium built at an estimate of Rs. 12 crore will have facilities for organising events on badminton, ball badminton, table tennis, gymnasium, and physiotherapy unit. “It has been designed by the Indian Institute of Technology, Madras, on par with international standards,” sources told The Hindu .\n\nOpen stadium\n\nThe indoor stadium is being built on 16 hectares of land. Indoor stadium work was taken up in the year 2007 but the work gained momentum in the last two years and a new proposal had been mooted for the construction of an open stadium outside it at an estimate of Rs. 8 crore.\n\nThe stadium would have 400-metre track, a gallery with a capacity of 3,000 persons, hockey court, basketball court, football court, and volleyball court will form a major component of the stadium.\n\nHowever, the work will be executed through a loan sanctioned by HUDCO, sources added.\n\nE. Vallavan, District Collector, who inspected the indoor stadium, said Puducherry Chief Minister N. Rangasamy, will declare it open on January 29.\n\nThe Chief Minister would lay the foundation for the open stadium.", 
    "section": "national", 
    "title": "Karaikal indoor stadium ready for inauguration", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}