{
    "author": [
        "P Sudhakar"
    ], 
    "text": "The first reactor of the Kudankulam Nuclear Power Project (KKNPP), which has been under maintenance since June 23 last following the scheduled annual spent fuel removal, attained criticality on Thursday evening.\n\n“On commencing the First Approach to Criticality (FAC) at 11.49 p.m. on Wednesday by withdrawing the control rods from the reactor, boron dilution started at 2.28 a.m. on Thursday, which eventually led to the criticality of the reactor at 4.19 p.m.” R.S. Sundar, site director, KKNPP, told The Hindu .\n\nAfter the control rods were gradually lifted to increase neutron concentration inside the core, where 163 bundles of enriched uranium fuel bundles have been kept, the dilution of boron solution started to facilitate early chain reaction.\n\nOnce the boron dilution is started, it would gradually allow neutron concentration to go up and eventually kick-start nuclear fission - the chain reaction that will generate the heat required for producing water vapour which, in turn, would operate the turbine to generate electricity.\n\nAs the FAC and boron dilution were uneventful and smooth, the reactor attained criticality at 4.19 p.m., Mr. Sundar said.\n\nThe FAC is an important step towards the beginning of power production. The approval has been given by Atomic Energy Regulatory Board (AERB) after in-depth review of associated safety aspects. The clearance for the FAC is the culmination of in-depth review of all safety aspects, commissioning results, corrective measures of the identified non-conformances and submissions regarding fulfilment of various regulatory requirements.\n\nThe reviews had included checks to ensure if quality assurance norms have been followed and the commissioned systems meet the acceptance criteria for safe operation.\n\n“Power generation in the reactor will commence within five days. It will be further raised in stages. At every stage, various mandatory tests will be conducted and the technical parameters verified. Only after getting clearances from the AERB, we will cross every stage,” Mr. Sundar said.\n\nThe KKNPP administration originally planned to restart the reactor in 60 days from the date (June 23, 2015) on which it was stopped for removal of spent fuel, this exercise and allied tests consumed more time than anticipated.", 
    "section": "national", 
    "title": "KKNPP’s first reactor attains criticality", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}