{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple : Thiruarutpa Agaval parayanam and annadhanam, Railway Colony, 4.30 p.m.\n\nSri Meenakshi Sundareswarar Temple : Theppa Thiruvizha, 11th day event, deity procession, 9 a.m. and 2 p.m.\n\nSolaimalai Murugan Temple : Thaipusa Thiruvizha, eighth day event, deity procession, Solaimalai Mandapam, Alagarkoil, 10.45 a.m. and 6.30 p.m.\n\nThiruvalluvar Mandram : Discourse on ‘Sundarar Thirupattu’ by R. Umarani, S.S. Colony, 5 p.m.\n\nPanniru Thirumurai Mandram : Thirupugazh Sinthanai Vattam meeting, Sri Thandayuthapani Temple, Iravadanallur, 5 p.m.\n\nGita Bhavanam : 68th anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nYoung Men’s Brahmins’ Association : Sri Vishnu Sahasranama parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSri Swami Tatwananda Ashram : Gita class by Swami Samanandar, P and T Nagar, 6:45 p.m.\n\nCULTURE\n\nThirunavukkarasar Music Trust : Free Thevaram music class by Dr. T. Suresh Sivan, Thiruvavaduthurai Adheena Madam, Dhanappa Mudali Street, 6 p.m.\n\nInternational Sivananda Yoga Vedanta Centre : Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya : Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre : Yoga training by S. Yoganand, Department of Philosophy, The Madura College, 6.30 a.m.\n\nIyalnilai Yoga Trust : Yoga demonstration for awareness, Meenakshi Amman Nagar, Surya Nagar, 6 p.m.\n\nGENERAL\n\nLawyers Association of Madurai District Court : Third State Law Seminar, Justice Sanjay Kishan Kaul, Chief Justice of Madras High Court, chief guest, Raja Muthiah Mandram, 10:35 a.m.\n\nCentre for Advocating Research and Education : Inaugural session of fourth workshop on SARFAESI Act, inaugural address by Justice V. Ramasubramanian of the Madras High Court, presidential address by R.S. Garg, Executive Director of National Housing Bank, Poppys Hotel, 9:30 a.m.\n\nMRR. MAVMM. Matriculation Higher Secondary School : 24th annual day celebrations, B. Rohini Ramdas, Additional Collector, Madurai, chief guest, S. Kanagasundaram–Amutha Auditorium, 5 p.m.\n\nRuby Matriculation Higher Secondary School : 33rd Athletic Meet, M. Rajarajan, Deputy Commissioner of Police (Headquarters), Madurai City, chief guest, The Madura College Ground, 10 a.m.\n\nIdhayam Rajendran Residential Higher Secondary School : Annual Utsav and 17th annual day, Vimal Memorial Outdoor Auditorium, 5 p.m.\n\nMannar Thirumalai Naicker College : Guest lecture on ‘IAS career awareness’, Moorthy Naidu Andalammal Hall, 9 a.m.\n\nMannar Thirumalai Naicker College : Department of English, guest lecture on ‘Mannar Thirumalai Naicker’s 433rd birth anniversary’, College Auditorium, 10 a.m.\n\nN.M.S. Sermathai Vasan College for Women: Department of English and Vergal (Roots) Education Trust, International conference on “The Role of Literature in Social Upliftment: Need of New Perspectives,” Seminar Hall, 10 a.m.\n\nThiagaraja College: Youth Red Cross Society organises Netaji Subash Chandra Bose birth anniversary, Principal M. Eyini, Dean (Curriculum Development) and Head, Department of Economics S. Kanagasabai speak, New Block Auditorium, 10.30 a.m.\n\nGandhi memorial Museum : Two-day conference on ‘Works of Arutselvar’, Library Hall, 10 a.m.\n\nKaviarasu Kannadasan Narpani Mandram : Netaji Subhas Chandra Bose birth anniversary celebrations, Netaji statue premises, Netaji Road, 8:50 p.m.\n\nSakthi - Vidiyal : Periodic medical check-up for Vidiyal children, Vidiyal Centre, Rathinapuram, 5 p.m.\n\nAlcoholics Anonymous : Meeting, Quality Care Hospital, Ellis Nagar, 7 p.m.; 14, Vaidyanatha Iyer Street, Shenoy Nagar, 7 p.m.; St. Antony Church, R.C. School, R.C. Nagar, Palanganatham, 7.30 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}