{
    "author": [
        "S P"
    ], 
    "text": "Members of Muslim and Dalit outfits trying to enter the Salem Collectorate on Friday to submit a petition to the Collector demanding re-postmortem.\n\nThe parents of Syed Imthiyas (24), who was found dead near the railway track in Omalur on Thursday, allege that it was a case of honour killing and refused to accept the body.\n\nThey demanded that the police register a case of murder and called for a second post-mortem.\n\nOn Friday, they protested outside the Government Mohan Kumaramangalam Medical College Hospital here.\n\nThe youth’s death triggered tension on the hospital premises as members of various Muslim and Dalit outfits, along with his parents – Syed Sultan and Piyari Begum – refused to receive the body.\n\nMr. Syed told the media that his son left home at 11 p.m. on January 20 while speaking on mobile phone angrily. His body was found near the track the next day.\n\n‘He was in love with a girl belonging to a Hindu community. They warned him to stay away from her. We have enough reason to believe this is an honour killing incident. They murdered him,” he added and refused to divulge details about the girl.\n\nCadre of Social Democratic Party of India (SDPI), Viduthalai Chiruthaigal Katchi (VCK), Indian Union Muslim League (IUML), Bahujan Samaj Party (BSP), Manithaneya Makkal Katchi and other outfits submitted petition to Collector’s office.\n\nTheir demands include conducting a second autopsy by a team with a doctor representing them, videographing the entire process, Rs. 25 lakh compensation for the victim’s family, transfer of case from Dharmapuri Railway police to local police, altering the section as murder and arrest of the accused.\n\nMembers wanted to know why the autopsy was hurriedly conducted without obtaining the parents’ permission. They threatened to carryout a State-wide protest if their demands are not met.\n\nMeanwhile, P. Vijayakumar, Superintendent of Police, Railways, visited the crime spot and held inquiries. He also held discussions with the Superintendent of Police G. Subbulakshmi in the city.\n\nMembers of the various political outfits submitted petitions to the SP demanding the arrest of the accused.\n\nSay he was in love with a caste Hindu girl", 
    "section": "national", 
    "title": "Muslim youth’s parents allege it was honour killing", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}