{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A.G. Murugesan receiving the national award from Union Minister for Chemicals Anantkumar in New Delhi recently. Joint Secretory of Ministery of Petrochemicals Avinash Joshi looks on.\n\nA.G. Murugesan, Professor and Head, Sri Paramakalyani Centre of Excellence in Environmental Sciences, Alwarkurichi, a satellite centre of Manonmaniam Sundaranar University, has won the national award of the Union Ministry of Chemicals and Petrochemicals for his innovative research in polymer from natural resources.\n\nHe received the award from Union Minister for Petrochemicals Ananthkumar at a function in New Delhi recently. The Ministry is recognising scientists and innovators by giving national awards for the past five years.\n\nDr. Murugesan was selected for the sixth national award under the category ‘Innovation in Polymeric Material’ for his research in biopolymer from natural resources. The award includes a memento, citation and a shawl.\n\nThe awardees were selected by a high-level juries committee under the chairmanship of S.K. Nayak, Director General of Central Institutes of Plastic Engineering and Technology, Haryana.\n\nProf. Murugesan is doing research in different aspects of industrial toxicology, natural resources management, environmental impact assessment, bio-remediation and bio-energy generation using microbial technologies.\n\nHe has produced a biopolymer – Poly Hydroxy Butyrate B – from water hyacinth.\n\nDr. Murugesan, who has received several State awards, has guided 34 research scholars so far, published more than 675 research papers and authored six books on environment. He is a Fellow in several top-level academies of the country. He has also served as expert member in several high-level environmental committees, including the Ministry of Environment and Forest’s State-level expert appraisal committee for two consecutive terms.", 
    "section": "national", 
    "title": "National award for MSU professor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}