{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Nenje Ezhu concert by Mozart of Madras A.R. Rahman to raise funds for the flood relief and rehabilitation measures, seems to have a line up of surprises in store for the audience. The concert will take place near CODISSIA fair complex in Peelamedu at 6 p.m. on Saturday.\n\nThe concert was first performed in Chennai on January 16 at YMCA grounds which had about 20,000-odd audience and response from Coimbatore has been tremendous so far, said Karthik Srinivas – Founder and CEO of Noise and Grains, a production house and event management firm. The concert is being done by Noise and Grains in association with AKR Events and The Hindu .\n\nArtistes numbering more than 50 and a full set of 17 piece orchestra team will be joining A.R. Rahman on stage to provide a music feast for nearly three to four hours, says C. Karthikeyan alias Dongli – Creative Head and Business Director Mahaveer of Noise and Grains.\n\nOn the surprises in store, the three of them said that legendry singer S.P. Balasubramanian is joining A.R. Rahman on stage after a gap nearly more than a decade. Mr. Rahman’s son Ameen, and Rahman’s sister A.R. Rehana will also join him on stage. Others to join the concert team on stage include Dhanush and Trisha, they added.\n\nThe other notable and famous singers to perform on stage would include Hariharan, Karthik, Benny Dayal, Hari Charan, Vijay Prakash, Neeti Mohan, Jonaita Gandhi, Blaze, Aryan Dinesh, Lady Kash, Hari Priya, Adhi (Hip Hop Tamizha) Dr. Narayanan, Aslam, and Sunitha Saravathy.\n\nMr. Srinivas said that the Chennai event was a grand success and Mr. Rahman after the concert complimented the team by saying “First mega event of Noise and Grains is the best concert of mine”. A four-member core group assisted by six to seven persons for executing has a 30-member team on the ground.", 
    "section": "national", 
    "title": "‘Nenje Ezhu’ concert by A.R. Rahman today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}