{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“Priority for de-silting, proper maintenance of canals, tanks”\n\nA farmer greets Collector K.Veera Raghava Rao at the grievance day meet held at the Collectorate in Madurai on Friday.Photo: S. James\n\nThe new Collector, K. Veera Raghava Rao, urged officials from all departments to earnestly handle grievance petitions and not be vague in their responses or keep passing the buck to other departments.\n\nDuring the farmers’ grievance day meeting, the ryots raised issues of non-maintenance of tanks and canals, need for enabling individual farmers to get workers through MGNREGS, removal of seemai karuvelam (prosopis juliflora) and wild boars destroying crops in certain areas.\n\nThey also alleged that the officials were often lackadaisical in responding to grievance petitions.\n\nUnhappy with the responses of a few officials on the grievance petitions presented in the meeting, Mr. Rao instructed them to aim at providing final disposal. “Whether it is possible to provide the requested remedy or not should be clearly explained so that the petitioner need not come back for the same issue,” he said.\n\nThe Collector also instructed senior officials from all departments to be present during grievance day meetings. He told the farmers that a booklet detailing schemes available from various departments for farmers would be issued during the farmers’ grievance meeting next month.\n\nOn the issue raised by several farmers that many regions, particularly those close to tail-end areas of Periyar-Vaigai canal, had not received water as the encroachments on tanks and canals were not removed, Mr. Rao instructed the PWD and revenue officials to first conduct a survey of all the tanks and canals.\n\nHe told the farmers that priority would be given for de-silting and proper maintenance of canals and tanks.\n\nHe said that a government order had already been issued to enable farmers to use MGNREGS workers to work in their farms.\n\nHe assured the farmers that steps would be taken to implement the order in the district. Mr. Rao added that removal of seemai karuvelam trees would also be taken up under the MGNREGS.\n\nLong-pending issues\n\nThe farmers also highlighted some of the long-pending issues including non-completion of the 58-canal project, provision of irrigation to dry areas in Usilampatti regions, and non-settlement of balances to sugarcane farmers by National Cooperative Sugar Mills.\n\nA booklet detailing schemes available for farmers to be issued during farmers’ grievance meeting next month", 
    "section": "national", 
    "title": "New Collector asks officials to handle grievance petitions earnestly", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}