{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Villagers urge officials to see for themselves the encroachment\n\nMembers of Viduthalai Chiruthaigal Katchi staging a road roko in front of Government Rajaji Hospital in Madurai on Friday demanding the arrest of those involved in the murder of a Dalit.Photo : S. James\n\nScores of residents of Odaipatti under Thindiyoor panchayat on Friday blocked Panagal Road near Government Rajaji Hospital here demanding the arrest of those involved in the murder of a Dalit, A. Chinna Karuppiah (45), for complaining against encroachment on government poromboke land in the village.\n\nThe protesters said that it was Chinna Karuppiah who led some of the villagers, belonging to different castes, to submit a petition to the Collector against one M. Sampath Kumar, who allegedly encroached on 1.20 acres of government poromboke land.\n\n“It was only because of lackadaisical attitude of Revenue officials in removing the encroachment, the accused were emboldened to murder the complainant,” said former panchayat president of Thindiyur, S. Mahalingam (76). He was seen arguing with Revenue officials for not looking into the villagers’ complaint, after the protest.\n\nMr. Mahalingam said that Sampath Kumar, a former panchayat president, had been paying ‘B-memo’ (a tax for enjoying rights over government land) without the knowledge of villagers. However, when the people came to know about it later, they were agitated.\n\n“We wanted the land to be used for constructing a community hall, public toilet, ration shop or an office for the panchayat. Even the cement threshing plot constructed on the land has been encroached upon,” P. Sethuraman said.\n\nThe family of the accused had kept a public toilet constructed by the government in a nearby location under its custody.\n\nWhen the villagers lodged a complaint with the Collector in August, the Revenue Divisional Officer (Madurai) gave a report, based on the one submitted by Madurai East Tahsildar, that the encroachment was removed on September 8, 2015.\n\n“Only on Monday (January 18) did the villagers, led by the deceased, gave another petition at the Collectorate seeking removal of encroachment. If the officials had acted on the complaint, the murder could have been averted,” Mr. Sethuraman said.\n\nThe angry villagers, claiming that the RDO report was false, wanted the officials to inspect the village immediately and see for themselves that no encroachment had been removed.\n\n“In fact, only a week back, Sampath had got electricity supply for the shed he had put up on the encroached land,” Mr. Mahalingam alleged.\n\nHowever, RDO G. Senthilkumari said that the encroachment was removed in the past. “But they have again encroached upon the land. The motive is not only the land, but simmering enmity between them over contesting the local body election,” she said.\n\nForce deployed\n\nHeavy police force was deployed on Panagal Road, where vehicular traffic was disrupted for nearly an hour.\n\nThe villagers accepted the body only after the cheque for compensation under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act was handed over later in the evening.\n\nThe district police have arrested three persons and booked a case under SC/ST (Prevention of Atrocities) Act against six persons, including Sampath Kumar.", 
    "section": "national", 
    "title": "Officials’ inaction blamed for murder", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}