{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Son of a lorry driver, student of a government school, he believed education was key for success\n\nCollector Karuppannan Nanthakumar, who was transferred to Perambalur after his nearly four-year-long stint, bade adieu on Thursday after placing the arid and backward district in the path of development.\n\nThe district had earned the dubious distinction of “thanni illa kaadu” (waterless jungle) and became the choicest destination for punishment postings when Mr. Nanthakunar assumed office in early 2012 but worked to ensure that it shed its negative image and emerged as one of the developing districts.\n\nFinding that paddy was cultivated in nearly 1.20 lakh hectares of rain-fed areas, which was more than 85 per cent of total paddy cultivation area in the district, and farmers often lost their crops due to monsoon failure, he came out with the idea of creating farm ponds to supplement the irrigation needs at the terminal stage and save the crops.\n\nFarm ponds\n\nAfter biding for 5,000 farm ponds, he had completed digging more than 3,000 ponds, which came in handy for farmers to save their crops. He had also helped small and marginal farmers with concrete and ring wells to improve the irrigation facilities.\n\nSon of a lorry driver and student of a government school, Mr. Nanthakumar firmly believed that education was the key for success and ensured quality education in government schools. After picking up bright students from poor family background, he arranged for special coaching and helped them secure admission in top ranking professional colleges.\n\nConcerned over frequent caste conflicts, Mr. Nanthakumar, soon after assuming office, imposed a ban on school students wearing colour wrist bands to mark their castes.\n\nWith the then Superintendent of Police N. M. Mylvahanan, he created a system and ensured that the two sensitive annual events in the district – the death anniversary of Dalit leader Immanuel Sekaran and Thevar jayanthi – were held in a peaceful manner.\n\nMr. Nanthakumar also focused on ensuring quality medical facilities to poor people at the government hospitals and created infrastructures facilities for various government departments.", 
    "section": "national", 
    "title": "Outgoing Collector steered Ramnad towards development", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}