{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bharatiya Janata Party (BJP), Puducherry unit president V. Saminathan on Friday said his party is firmly in alliance with ruling All India NR Congress (AINRC) and future alliance will be decided by national president Amit Shah and Prime Minister Narendra Modi soon.\n\n“BJP’s base has increased\n\nin UT”\n\nAddressing reporters here, Mr. Saminathan along with former president and MLA M. Visweswaran claimed that the BJP’s base has increased in Union Territory and the recent outcome of Parliamentary polls is testimony to it.\n\n“As of today, we are in alliance with AINRC. At the invitation of national president Amit Shah, we are leaving to New Delhi where we will brief him on the current political situation and express our opinion on forging alliance. Based on that the party president and Prime Minister Narendra Modi will take appropriate decision on alliance,” added Mr. Saminathan.\n\nThe BJP leaders also said they would soon meet Union Minister of Human Resources Development Smriti Rani.\n\nThey would definitely urge her to implement the 25 per cent reservation to the students of the Union Territory during the admissions to all the departments of the Pondicherry Central University.\n\nMr. Saminathan said, “People of Puducherry want big change here. During polls BJP will play major alternative force and will create modern Puducherry.”\n\nHe said Modi-Government at the Centre would give more welfare programmes to UT and also said it would give required funds to UT.\n\nMr. Saminathan said the party has been preparing to face elections and party conferences would be conducted at district level where Union Ministers are likely to participate and deliver special addresses.\n\nApplications from aspirants\n\nThe BJP leader also said his party would invite applications from aspirants who seek to contest election on party tickets from February 1.\n\nHe also claimed that his party has 75,000 members in Puducherry with 3,000 in at least nine constituencies.", 
    "section": "national", 
    "title": "Party is in alliance with AINRC: BJP president", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}