{
    "author": [], 
    "text": "Power supply will remained suspended from 9.45 a.m. to 2 p.m. on Saturday in the following areas of the city owing to maintenance work to be taken up by the Tangedco at the Tiruverumbur and Thuvakudi sub-stations: Tiruverumbur, Malaikovil, Prakash Nagar, Vengur, Natarajapuram, Arasangudi, Thogur, Koothaipar, Krishnasamudiram, Pathalapettai, Kiliyur, Tiruverumbur Industrial Estate, Mela Kumaresapuram, Cholamadevi, Cholamanagar, Navalpattu, Burma Colony, Nehru Nagar, Anna Nagar, Policy Colony, Poolangudi, Suriyur, Kumbakudi, Pazhankanankudi, Kanthalur, MIET,Guntur, BHEL Township A, D, E, R and PH, and a part of C sector; AOL, Anna Arch, Akbar Salai, MD Road, Government Arts College and Polytechnic, VOC Nagar, and so on.\n\nMeet of musicians\n\nThe fourth annual meet of Trichy Carnatic Musicians, a Facebook group of Carnatic musicians in the Cauvery delta region, will be held here on January 24. The meet, ‘TCM Vaibhav 2016,’ will be held from 9 a.m. at Sri Akilandeswari Vidyalaya in Thiruvanaikovil. Veteran vocalist Ambujam Vedantham will be presented the TCM Lifetime Achievement Award during the meet, which would also include a thematic recital, ‘Thiruvarutpa,’ by disciples of Mrs.Ambujam Vedantham. It would be followed by a tribute to M.S. Subbulakshmi by G.Girish and a musical discourse by Visaka Hari and party, according to a press release.\n\nApprenticeship programme\n\nApplications have been invited from eligible candidates for undergoing apprenticeship at industries, commercial establishments and hospitals. The programme conducted with government assistance is open to candidates in the age group of 18 to 50 with qualifications of a pass standard VIII to graduation. The programme is provided in jewellery making, call centre assistants, beautician assistants, laboratory technician, sales person, hotel receptionist and other ITI trades. Those who complete the programmes would be issued national apprentice certificate. Those interested can contact the Assistant Direct of the Related Instruction Centre at Industrial Training Institute, Tiruverambur, according to a press release.", 
    "section": "national", 
    "title": "Power shutdown", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}