{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Usually the work starts in the middle of January\n\nPre-season work has started in some salt pans in Thoothukudi ahead of salt production after an unusual delay. Normally, production would start in the middle of January every year, but this year only maintenance work commenced in the fourth week of the month.\n\nHeavy rains during the northeast monsoon triggered delay in production in 2016, A.R.A.S. Dhanabalan, secretary, Tuticorin Small Scale Salt Manufacturers’ Association, told The Hindu here on Thursday.\n\nSalt pans were inundated with rainwater and it took more time to drain out stagnant water since the groundwater table was on the rise. Hence, production was expected to begin either in the middle of February or March. However, the delay in production would create favourable market conditions since the stocks now could be moved to the market. Moreover, the 2016 crop would gain market leverage, Mr. Dhanabalan said. Though preliminary work began, salt could come out as a finished product only when water in pan reservoir reached 22 to 24 degree baume (density). Only four to five degree baume could be achieved now. Only when the required level was achieved, salt could be a finished product with pure whiteness of desired quality.\n\nHe said that optimum amount of sunlight was required for production. Even though such weather conditions arrived, the required content of sodium chloride in salt could not be achieved as water from the sub-soil contained other minerals such as potassium.\n\nConditions to optimise quality in production could be achieved from sea brine, which could be done only by large-scale operators. On maintenance works under way in rain-damaged pans, he said that a manufacturer had to incur an additional expenditure of Rs. 10,000 per acre. Normally, it would require Rs. 20,000 to undertake maintenance work in an acre of salt pan.\n\nClay bunds, water feeding channels from reservoirs to pans and roads leading into pans suffered damage following rains.", 
    "section": "national", 
    "title": "Pre-season work in salt pans begins after unusual delay", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}