{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To minimise reaction time\n\nRapid Action Force (RAF) of the Central Reserve Police Force (CRPF) has offered to permanently station one of its platoons in Rameswaram in view of the threat to the historic Sri Ramanathaswamy Temple in the island.\n\nTalking to reporters here on Friday, RAF Deputy Commandant K.V. Kuriakose and Assistant Commandant K.C. Raja said that the RAF was willing to permanently station its platoon, comprising 50 commandos, if the Collector and the Superintendent of Police gave consent.\n\nTwo years ago, the district police had tightened security at the temple and Pamban rail bridge by re-inducting one company of Tamil Nadu Special Police (TSP) following specific input from Intelligence Bureau (IB) that intruders taking the sea route might attack the temple and the bridge. As it would take long for the RAF Battalion, stationed in Coimbatore, to deploy its commandos to the island in the event of any exigency, the RAF had offered to base one of its platoons in the island itself, they said.\n\n“We will discuss the issue and take a decision,” Superintendent of Police N. Manivannan said, reacting to the offer.\n\nAn RAF platoon was here to carry out the routine ‘familiarisation exercise’ in the district, which had been identified as one of the sensitive districts in the State by the Ministry of Home Affairs (MHA) following an IB report based on previous incidents, Mr. Raja said. “The platoon will visit every nook and cranny of the district during the week-long exercise to assess the situation and instil confidence in the minds of the people,” he said. After carrying out the exercise they would submit a report to the Ministry of Home Affairs through the commandant, he said.\n\nThis was a routine exercise carried out once in two years in the sensitive districts and it had nothing to do with the coming Assembly elections.\n\nDuring the exercise, they would hold discussions with community leaders to foster communal amity and carry out flag marches in areas suggested by the district police, he said.\n\n“The platoon will visit every nook and cranny of the district during the week-long exercise”", 
    "section": "national", 
    "title": "RAF offers to station platoon in Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}