{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Jansirani is the new chief of TNCC women's wing\n\nA hasty decision to take her battle with the State Congress chief E.V.K.S. Elangovan to the police station has seemingly cost MLA S. Vijayadharini her position as the Tamil Nadu Mahila Congress (women’s wing) chief. Congress vice president Rahul Gandhi on Friday replaced her with M. Jansirani, the granddaughter of the late seven-time Congress Legislator A.S. Ponnammal in what is being viewed in Tamil Nadu Congress Committee (TNCC) circles as a victory for its president E.V.K.S. Elangovan.\n\nAn official party release from New Delhi said Mr. Gandhi has appointed Ms. Rani as the new head of the Mahila Congress with immediate effect.\n\nSources in the TNCC said after the open battle between Ms. Vijayadharini and Mr. Elangovan in November, when supporters of the MLA filed a police complaint against the TNCC chief, Mr. Gandhi had directed the All India Mahila Congress to investigate the matter and file a report.\n\nEven at that point, it was widely believed that both Mr. Gandhi and Congress president Sonia Gandhi were unhappy at the manner in which the feud played out in public and the decision of Mr. Vijayadharini’s supporters to take the matter to the police.\n\n“The police complaint was later withdrawn. This decision to remove Ms. Vijayadharini was probably the result of the report the Mahila Congress gave Mr. Gandhi. Mr. Elangovan had also wanted her removal,” a senior leader said.\n\nHailing from the Dalit community, Ms. Jansirani belongs to a traditional Congress family.\n\nHer grandmother Ponnammal, who passed away in November, was elected to the Tamil Nadu Assembly seven times and had worked with stalwarts such as K. Kamaraj.\n\nMs. Jansirani was the Dindigul District Mahila Congress president.\n\nJansirani is the grand daughter of seven-time Congress Legislator A.S. Ponnammal", 
    "section": "national", 
    "title": "Rahul Gandhi sends Vijayadharini packing", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}