{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Highways Department has commenced work on repairing rain damaged roads in the district.\n\nAccording to sources in the department, the State government has sanctioned Rs.1 crore for carrying out temporary repairs of roads that were damaged during the monsoon rain. The department has identified some of the badly damaged road stretches in the district and has taken up 34 works with the funds sanctioned. Patchworks would be carried out at the damaged stretches of the road, a senior official of the department told The Hindu.\n\nAmong the works that have been executed so far are repairs to the road stretch between the Anna Statue and Cauvery Bridge and the roads leading to the Chathram Bus Stand, the official said.\n\nThuraiyur-Athur Road which was badly damaged in the rain would be repaired at a cost of Rs.17 lakhs. All the works would be completed before the end of this month, the officials said.\n\nThe sources also indicated that work on the widening of the K.K. Nagar Main Road would be completed soon. The department had planned to widen a stretch of the road between the K.K.Nagar arch and the SIMCO Meter office and had also constructed road medians along the road. However, the delay in shifting of utilities such as over head power lines and poles had been delaying the relaying of the road, which had sustained heavy damages during the rain at certain stretches.\n\nThe official said that shifting of the poles have since been completed and only work on relaying the road was to be carried out. The work would be completed most probably before the end of this month, he said.\n\nLocal people have been complaining over the poor condition of the road especially as the carriage ways have shrunk in size after the construction of the concrete median. The official said the road would be laid for seven metres width on either side.", 
    "section": "national", 
    "title": "Repair of rain-damaged roads begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}