{
    "author": [
        "S Senthalir"
    ], 
    "text": "Yohan Triboulat, Thomas Triboulat, John Langlois, Tanguy Bar and Maxime Peythieu display their skills on the cycle on Beach Road in Puducherry on Friday. They are scheduled to have a show in IIT-Madras on Sunday night.— PHOTOS: M. Samraj and S.S. Kumar\n\nMembers of Freestyl’Air on a visit to Auroville perform at Promenade Beach\n\nFive riders on the beach road drew the attention of onlookers as they performed stunts in their special cycles on Friday afternoon.\n\nThey were world class riders from France performing bunny hops (both wheel lift at the same time), pogo (hopping on the back wheel), and doing all this over a man lying down.\n\nThirty-four year old Yohan Triboulat along with four team members of Freestyl’Air, a company specialising in extreme sports, on Tuesday had come to Auroville to explore and unwind.\n\nThough they are scheduled to have a show in IIT-Madras on Sunday night, they turned their leisure time in this city to carry out a dry run with their special dirt bikes on Promenade Beach.\n\nEric Avril, an event manager at Aurovelo, spotted them when he saw on the roof rack some very special dirt bikes with high end shock absorbers, fancy wheels and hubs.\n\n“Yohan Triboulat, his younger brother Thomas Triboulat, John Langlois, Tanguy Bar and Maxime Peythieu were having lunch at Farm Fresh when I drove by their Innova and I immediately knew that some serious riders were here,” he said.\n\nWhen they confirmed it was the case and explained that they had a show in IIT- Madras on Sunday night, he invited them to Aurovelo, near Rêve community close to Edayanchavadi, India’s first cycle cafe.\n\nThey arrived at Aurovelo and started using the skate ramp.\n\n“They even tried our modest pump track and bumps for jumps which have been built by BMX and street trial enthusiasts,” he said.\n\nMr. Eric added that there was a first training session at Aurovelo on Tuesday for whoever walked by since it was not planned.\n\nOn Wednesday, they performed some stunts in front of students at the Dea Shakti Sports Ground. Among those were a backflip, a tailwhip, bunny hops, 360 turns, pogo, and many more.\n\n“What we performed on the beach road was not even 10 per cent of the potential as the obstacles are small. On Sunday night, in Chennai they surely will reach full potential as the organisers have prepared special ramps, obstacles and wooden modules,” the riders said.\n\nFreestyl’Air team has performed shows like crossing, balancing and acrobatic urban tricks in their sports bicycle in France, Switzerland, Dubai and China.\n\nThe Freestyl’Extreme show includes a street trial rider, a dirty jump rider, a monocycle rider and many more.\n\nThey are scheduled to have a show in IIT-Madras on Sunday night", 
    "section": "national", 
    "title": "Riveting stunt show on bicycles", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}