{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court on Friday directed the Centre to bring out a comprehensive chart on the status of environmental clearance and building projects of seven builders from Tamil Nadu.\n\nA Bench of Chief Justice T S Thakur and R Banumathi, however, asked all the construction companies to deposit five per cent of the project cost, imposed as fine by the National Green Tribunal for not complying with environment norms.\n\nAdditional Solicitor General Neeraj Kishan Kaul told the Bench that the government was coming out with fresh notification with far more stringent norms for building projects.\n\n“We are not challenging this NGT order. We are working on a stringent notification based on the Polluter Pays principle,” Mr. Kaul submitted.\n\nThe Bench, on its part, asked the law officer, “The fresh notification will deal with future projects but what about the past violations.” The court said it would consider the issue and directed him to prepare a chart showing how many projects had complied with the directions for fine. The court also wanted to know the level of occupation in completed projects, if any.\n\nThe court said the chart should give a complete picture, including what are the minimum requirements for getting environmental clearance, who gave the clearance to these building projects, who all are in default of the NGT order and who have paid the fine imposed and the stage of construction of the projects.\n\n“Flooding of Chennai may have happened due to builders...” Chief Justice Thakur remarked.\n\nA battery of senior advocates, including Kapil Sibal, C A Sundaram, Rajiv Dutta and S Guru Krishna Kumar, appeared for different project proponents Y Pondurai, M/s Ruby Manoharan Property Developers Pvt. Ltd, M/s Jones Foundations Pvt. Ltd, M/s SSM Builders and Promoters, M/s SPR and RG Construction Pvt Ltd, M/s Dugar Housing Ltd and M/s SAS Realtors Pvt Ltd.\n\nThe NGT had earlier quashed Office Memoranda, relating to environment clearance and prohibited the MoEF and the SEIAC (State Environment Impact Assessment Committee) in from giving effect to these circular in any manner.\n\nIt had also levied a fine of five percent of the total cost towards environmental compensation on a provisional basis on the developers and formed a high-powered committee for preparing a report on illegal and unauthorised activities carried out by the project proponents, ecological and environmental damage due to the projects and if the conditions stated in the plan and permissions granted by various authorities have been strictly complied with or not.\n\nConstruction companies told to deposit five per cent of the\n\nproject cost", 
    "section": "national", 
    "title": "SC seeks list of building projects meeting environmental norms", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}