{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Gandhigram Khadi and VIPC Trust, an ISRO-certified manufacturing company functioning under Gandhigram Trust, had modernised its shampoo production to improve quality and expand its market base, said K. Shiva Kumar, secretary, Gandhigram Trust.\n\nTalking to media persons here on Thursday, he said that the unit had invested Rs. 10 lakh for modernising its plant to improve production and quality of the product.\n\nErection of modern mixing plant enhanced quality, helped maintain uniform colour and increase production also.\n\nSimilarly, production capacity too had been increased from 10 tonnes to 20 tonnes, he added.\n\nAutomating entire process\n\nThe unit had also planned to automate the entire production process from preparation to mixing and filling to labelling and packing.\n\nSuch modernisation was necessary to tap highly potential shampoo market and expand market base.\n\nThe total sale of aloe vera shampoo and herbal shampoo was Rs. 3.05 crore in 2014-15 and it rose to Rs. 3.23 crore in 2015-16.\n\nAbout 51.7 per cent of the total sale revenue came through sale of 170 ml containers and share of 500 ml bottle was 45.58 per cent.\n\nSale of 110 ml container was 3.25 per cent.\n\nSachet sale picking up\n\nSachet sale was picking up well in rural market.\n\nAt present, the unit had successfully tapped shampoo and soap market in Tamil Nadu, Andhra Pradesh and Karnataka.\n\n“We want to modernise the plant on the basis of demand and supply. Rapid modernisation will speed up production but scale down work force. The main aim of the unit is to create more jobs to rural women. We want to ensure that modernisation does not affect job creation,” he also added.\n\nOwn lab\n\nThe unit had its own lab to test the quality of products.\n\nTo ensure high quality, the unit utilised services of external labs in cities, he added.\n\nProduction capacity of the unit increased from\n\n10 tonnes to\n\n20 tonnes", 
    "section": "national", 
    "title": "Shampoo production modernised at Gandhigram Trust unit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}