{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students at a career exhibition organised by the employment exchange at the Government Arts College, Salem, on Friday.\n\nSpecial lecture and interaction sessions, mini exhibition on competitive examinations marked the day long career guidance programme organised by the Employment Exchange at the Government Arts College in the city on Friday.\n\nThe speakers hailing from different fields, who addressed the sessions, said that plenty of job opportunities are available in both the Government departments and in the private sector. The younger generation should leave no stone unturned to update their knowledge and skills to snatch the opportunities that come in their way, they said.\n\nR. Latha, Regional Joint Director of Employment, inaugurated the event and also declared open the exhibition.\n\nShe explained the various initiatives taken by the employment exchange to motivate the youth to prepare them well for facing the competitive examinations.\n\nThe study circles functioning in the employment exchange organise programmes regularly exclusively for the benefit of the students. Special programmes are organised every Friday to discuss the job vacancy advertisements that appear in the news papers and also to guide them to prepare their bio-data to suit the nature of the private concerns.\n\nMs. Latha said that free coaching programme organised for the candidates appearing for the Tamil Nadu Public Service Commission (TNPSC) Group II examinations at the employment exchange evoked good response. The exchange has planned similar coaching programme for the candidates appearing for the TNPSC VAO examinations scheduled next month end.\n\nO. S. Gnanasekaran, Deputy Director of Employment, said that websites and the newspapers provide lot of information to motivate the youth to be successful in the job markets. It is sad that the youth are not taking advantage of the same, due to which the government agencies such as employment exchange had to organise such motivation programmes.\n\nMr. Gnanasekaran underlined the importance of cultivating reading habit and urged the youth to be regular in reading newspapers for updating their knowledge.\n\nLt. Commander T. Sangeetha, Assistant Director, Ex-Servicemen’s Welfare, explained the job opportunities available in the defence forces.\n\nR. Dhanalakshmi, Principal, Government Arts College, commended the employment exchange for organising such a programme in the government college, which accounted for a large depressed and weaker sections.\n\nT. Rama Duraimurugan, District Supply Officer, K. Udayakumar, Lead District Manager, S. Vinoth, District Employment Officer, Erode, also spoke on the job opportunities available in their respective fields.\n\nCharts explaining the various types of competitive examinations conducted by UPSC, Railway Recruitment Board, Staff Selection Commission, TNPSC, the examination calendar were displayed. The books suggested for facing the competitive exams were also displayed.", 
    "section": "national", 
    "title": "Special lecture, interaction sessions mark career guidance programme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}