{
    "author": [], 
    "text": "Ramakrishna Mission Ashram: Narai S. Nellaiappan speaks on ‘Swami Thiriyananda’s life’, 7 p.m.\n\nSri Skandashramam Trust, Udaiyapatti: Thaipoosam festival, Varushabishegam, 8.30 a.m.; pournami puja, 6 p.m.\n\nShree Parshwanath Jain Trust: Sri Kesariya Swetambar Jain Temple Maha Kumbabishekam, pujas, 9 a.m.; devotional songs concert, temple premises, Sankarnagar, 6 p.m.\n\nTNAU Krishi Vigyan Kendra, Sandhiyur: Pre Rabi campaign cum seminar on agriculture and horticulture technologies for Salem district, H. Philip, Director of Extension Education, TNAU, Coimbatore, V. Panneerselvam, MP, N. Sriram, Programme Coordinator, ICAR-KVK, and others speak, KVK premises, 10 a.m.\n\nSri Sarada College for Women: College Day, C. Swaminathan, Vice Chancellor, Periyar University, chief guest, 9.30 a.m.\n\nThe Salem Polytechnic College: Toppers Day and annual day, R. Panchanadhan, Director, Talent Consultancy, Tiruchi, chief guest, A. Duraisamy, chairman, presides, 9 a.m.\n\nTangedco: Salem Electricity Distribution Circle, power consumers grievances day meeting, Attur, 11 a.m.\n\nKnowledge Business School and Confederation of Indian Industry-Salem: Faculty development programme, 9.30 a.m.\n\nKnowledge Institute of Technology: Centre for Excellence for Embedded Systems Design and Development, ISTE Student Chapter sponsored workshop, 10 a.m.\n\nNational Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m.\n\nNAMAKKAL\n\nMahendra Institute of Engineering and Technology: Department of Mechanical Engineering, national level workshop, 10 a.m.\n\nPaavai College of Engineering: Campus recruitment programme by Zealous Services, 9 a.m.\n\nPaavai Engineering College: Campus recruitment programme by TVS-Sundaram Fasteners Limited, 9 a.m.\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 9.30 a.m.\n\nTIRUCHENGODE\n\n:Annual day, 4 p.m.\n\nSengunthar Engineering College: Tamil Manram, 10.30 a.m.\n\nKOMARAPALAYAM\n\nSSM College of Engineering and Indo-Russian Chamber of Commerce and Industries: Russian cultural dance performance, 10.30 a.m. and\n\n5 p.m.\n\nERODE\n\nNandha Matric Higher Secondary School: 14th annual day, 4 p.m.\n\nBannari Amman Institute of Technology: Workshop on mathematical modelling for engineering research,\n\n9.00 a.m.; Inauguration of NSS Camp, Kaliyappagoundanpudur and Vettuvanpudur, 6.30 p.m.\n\nErode Sengunthar Engineering College: Yoga, meditation and kayakalpa training to faculty and students by S. Indra, Professor,\n\nManavalakkalai- Yoga, Ulaga Samudhaya Seva Mandram,\n\n10 a.m.\n\nVellalar College of Engineering and Technology: Faculty development programme on engineering mathematics and its applications, talk by G. Sai Sundra Krishnan of PSG College of Technology, 9.30 a.m.\n\nEBET Group of Institutions: Campus drive by M/s Vivid Infotech, Chennai, 9.00 a.m.", 
    "section": "national", 
    "title": "TAMIL NADU", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}