{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Ranganathaswamy Temple, Srirangam: Thai car festival, thiruther vadam pidithal, 6.30 a.m.\n\nArulmigu Mariamman Temple, Samayapuram: Thai poosam festival, Amman thiruveedhi ula in pallakku, 10 a.m.; abishekam, 5 p.m.; maha deeparadhana, 7 p.m.; theppam, 8 p.m.; thiruveedhi ula and reaching asthana mandapam, 11 p.m.\n\nSri Andal Tirupaavai Mahotsava Sabha: Tirupaavai mahotsavam, Sri Vedanata Desikan Sannidhi, discourse by Sri Navalpakkam Vasudevachariar, Srirangam Srimad Andavan Ashram, North Chithirai Street, Srirangam, 10 a.m.; discourse by Sri Valayapettai Ramachariar, 11 a.m.; discourse by Sri N.S. Rananathachariar, noon.\n\nSri Lakshmi Narayana Perumal Sannidhi, Keezha Valadi: Sri Radha Kalyana mahotsavam, thirumanjanam, 7 a.m.; ashtapathi bhajan, 8 p.m.; divya nama sangeerthanam, dolothsavam, 8 p.m.\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha: Sri Seetha Rama Vivaaha vaibhavam, Thodayamangalam, ashtapathi bhajan, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 8 a.m.; dolotsavam, 8 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Parayana goshti procession, South Gate, Srirangam, 5.15 p.m.; Sri Vishnu Sahasranama parayanam, Sri Kothandaramar, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 28, SMESC Colony, II Street, North Extension 6 p.m.\n\nHindu Samaya Mandram: Sri Radha Kalyana mahotsavam, Guru keerthanangal and ashtapathi bhajan, No.20, Rajaji Street, Ranga Nagar, Srirangam, 3 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary programmes, “Sriranga Vaibhavam” - bharatanatyam by Yalini Prabakaran by Nritya Kiran Academy, Hotel Sangam, 6 p.m.\n\nBharatiya Vidya Bhavan: Kalaiyurum Kaviri 2016 – music, dance and drama festival, flute concert by M. Anirudh and party, Kalai Kaviri College of Fine Arts, 6 p.m.; vocal duet by Aishwarya Madhavan and Padmashree, 7 p.m.\n\nGENERAL\n\nHoly Cross College: Graduation Day, G. Bhasakaran, Vice-Chancellor, Tamil University, delivers the graduation day address, 3 p.m.\n\nYoung Indians: National conference on “entrepreneurship and start-up competition”, Hotel Sangam, 9.30 a.m.\n\nAnna University Centre for Excellence in Nanobio Translational Research: International convention of Association of Pharmacy professionals,Breeze Residency, 9.30 a.m.\n\nJamal Mohamed College: National seminar on “Sahitya Akademic Award Winning Works”, S. Mohamed Salique, principal, presides, 9 a.m.\n\nHindu Mission Hospital, Rotary Club of Tiruchi Midtown and Dr.K.Shantha Breast Cancer Foundation: Mammogram screening for women above 30 years, hospital premises, Thennur, 9 a.m.; free cataract screening and surgery camp, Konar Chathram, Amma Mandapam Road, 9 a.m.\n\nBishop Heber College Department of Social Work: Awareness programme on alcoholism, Mela Pandamangalam, 6 p.m.; awareness programme mental health, Kanthalur, 11 a.m.\n\nVivekananda Social Service Organisation: Netaji Subash Chandra Bose birth anniversary, Thiruvalluvar Street, Srirangam, 10.30 a.m.\n\nRasavelar Shenbaga Tamil Arangu: K. Manuraj speaks on “Impact of and lessons from Chennai floods”, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nSeethalakshmi Ramaswami College: NSS special camp, Lakshmi Prabha, NSS Coordinator, Bharathidasan University, presides, Mutharasanallur Community Centre, 6 p.m.\n\nK. Ramakrishnan College of Engineering: Inauguration of ICTACT and faculty development programme on mobile application development, 10 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo-Indian Higher Secondary School , 4 p.m.\n\nJegan Matha Matric Higher Secondary School: Annual day, K.Chinnappan, Head, Department of Education, Tamil University, chief guest, 5.30 p.m.\n\nTiruchi District Chess Association: Annual day, Axiom S.Abdul Nazer, joint secretary, TNSCA, chief guest, Hotel Sevana, 10.30 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}