{
    "author": [
        "B Kolappan"
    ], 
    "text": "15,000 and 20,000 ‘Do It Yourself’ kits to be distributed at a cost of Rs. 500 each\n\nAt a time when pesticide residue in agricultural products has become a cause for concern and there is a growing need to bridge the gap between demand and supply of vegetables, the Horticulture Department has decided to conduct a mega campaign in Chennai on January 23 and 24 to promote vegetable cultivation on rooftops.\n\nThe objective of this “do it yourself” programme is to motivate urban dwellers to grow poison-free and eco-friendly vegetables in an effort that can be sustained throughout the year.\n\nIn Chennai, the campaign will be held in 100 centres, including Corporation parks and schools, in coordination with the Chennai Corporation.\n\nThe department has plans to distribute between 15,000 and 20,000 ‘Do it yourself kits’ at a cost of Rs. 500 each.\n\nLaunched in 2013\n\nChief Minister Jayalalithaa launched the scheme in 2013 and it proved successful in Chennai and Coimbatore. It was subsequently extended to Tiruchi and Madurai at a cost of Rs 5.37 crore, in 2015. A senior official of the department said the scheme would ensure nutritional security through fresh green vegetables.\n\nHe said demand for vegetable was fuelled by various factors, which include urbanisation, increase in per capita consumption and health consciousness.\n\nIn the urban setting, the desire to take up gardening and nurture plants is often not realised as space is hard to come by.\n\nWhen it comes to cultivation of vegetables, Tamil Nadu stands first, covering 2.76 lakh hectares. The production is 29.95 tonne per hectare at the national level.Dietary allowance\n\nThe per capita consumption of vegetables in India is 230 grams as against 300 grams of Recommended Dietary Allowance (RDA) by Indian Council of Medical Research (ICMR) and National Institute of Nutrition, Hyderabad.\n\nWith the population growth projected to be 1,330 million in 2020, 1,460 million in 2030, 1,570 million in 2040 and 1,650 million in 2050, production of 190, 210, 225 and 240 million tonnes of vegetables is required respectively.", 
    "section": "national", 
    "title": "Vegetable farming hits the rooftop", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}