{
    "author": [
        "K Manikandan"
    ], 
    "text": "After an overnight journey from Tirunelveli to Chennai, the last thing 67-year-old P.Lakshmi wanted was to argue with autorickshaw drivers at Egmore station.\n\nHowever, she could not avoid getting into an argument with an auto driver, who demanded Rs. 200 for a drop at Triplicane.\n\nFifteen minutes later, she managed to hire another auto for Rs. 100.\n\nBargaining with auto drivers is a familiar sight every day at the Egmore railway station, where people from southern districts and other States arrive.\n\nThe moment a passenger steps down from the staircase, he/she would be surrounded by a group of autorickshaw drivers.\n\nThe passengers, many of who would have arrived in the city for the first time, would be fleeced.\n\n“It is better at Chennai Central station. At Egmore, passengers do not even know that a pre-paid auto service is available. The booth is located near the exit gate,” pointed out T. S. Raman, a passenger. According to him, if they manage to evade the drivers who surround them near the foot overbridge, they are mobbed on Gandhi Irwin Road.\n\n“Passengers are not guided to the pre-paid booth,” Mr. Raman said.\n\nIn Egmore, about 150 auto drivers are part of the pre-paid system and, on an average, they make 300 trips a day, said one of them, adding this number can increase if there is regulation.\n\nAt Chennai Central, a complaint with the pre-paid arrangement is that though the charges are based on the fare fixed by the government, drivers invariably fleece passengers after they are dropped, demanding as high as Rs. 50 more than the fare.\n\n“Passengers hand over the computerised receipt to the drivers. When they come back to the station later, they complain, but do not have the driver details,” said a traffic police constable on duty.\n\nMembers of auto drivers’ associations said nearly all drivers who are part of the pre-paid system were law abiding and that instances of fleecing were being dealt with.\n\nRailway police said they were conducting sensitisation programmes for the drivers frequently, urging them to be courteous with passengers and stop fleecing.", 
    "section": "national", 
    "title": "Vexed passengers want auto drivers reined in", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}