{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Volunteers, who came together to aid residents during the December deluge, are helping quake-hit people in the northeastern State\n\nThe group has now prepared a kit that can be sponsored and also a standard list of items that would be required in disaster-hit areas. —Photo: Special Arrangement\n\nDuring the floods in Chennai, they came together to offer help to the affected. Now, with this experience guiding them, this spirited group of volunteers are coordinating relief efforts in the quake-hit Manipur. And, they want to sustain this initiative and continue to help people during disasters.\n\nIt all started when individuals joined hands to reach out to flood-affected residents in December. They then formed Tamil Nadu Flood Support and worked several hours in a day to support the flood-affected, carrying out various activities from mobilising volunteers and materials to delivering supplies on time. The group continues work in Chennai and Cuddalore.\n\n“We met with several challenges as we tried to reach out to people. Many had supplies and funds and did not know how to reach people. Much time was lost in transporting supplies. Sometimes, there were more volunteers than was necessary at one place,” said Shashi Kumar M. of Tamil Nadu Flood Support.\n\nIn response, they created www.chennaiassemble.com which enabled them to assess requirements and availability of resources. “We continue work as there are places in Cuddalore and Chennai where residents need such help. We set up collection centres in many places, including Coimbatore, Hyderabad and Bengaluru, to mobilise supplies and coordinate through the website,” said Mr. Shashi Kumar, an engineering student.\n\nUsing this experience and database of over 55,000 people, the team is coordinating with other groups like Red Elephant Foundation, Flood Support Manipur and Sphere India to mobilise help for quake-hit Manipur. “Our Chennai experience has taught us to identify the specific needs of people and avoid supplying things they don’t need. For instance, we realised much later about the need for children’s clothes in Chennai. In Manipur, there is a greater need for materials like tents and warm clothes than for volunteers,” said Anusha Padmanabhan of the same group.\n\nThe group has prepared a kit that can be sponsored and also a standard list of items that would be required in disaster-hit areas.\n\n“We are planning to gather more support and funds for the relief operations from ICON-MUN in ICFAI, Hyderabad where students from various colleges will congregate for a conference this month-end. Our focus is to be more transparent in feedback about relief operation,” Mr. Shashi Kumar added.\n\n“We want to mobilise disaster management teams and keep the spirit alive among the volunteers through our initiatives,” said Ms. Padmanabhan.\n\nThe group plans\n\nto collate information and release a guidebook on\n\ndisaster management", 
    "section": "national", 
    "title": "When flood relief lessons proved useful to Manipur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}