{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The CII unit holds two-day conference on entrepreneurship\n\nK S. Bharath, chairman, Aparajitha Group, shares his experience as an entrepreneur with the audience at the inauguration of national conference on 'Entrepreneurship sharpen your saw' in Tiruchi on Friday.— PHOTO: A. MURALITHARAN\n\nThe annual entrepreneurship conference and start-up competitions, YuTry, organised by Young Indians, a part of the Confederation of Indian Industry, in the city have started attracting good business models and ideas from young entrepreneurs and prospective entrepreneurs.\n\nEncouraged by good response to the initiative last year, Yi, Tiruchi Chapter, has got up the YuTry 2016 — a national conference on “Entrepreneurship and start-up competition in the city for the second year”.\n\nThe event strives to stimulate the entrepreneurial spirit among youngsters through interaction with successful entrepreneurs, corporate leaders, and a competition of business ideas. Germination of ideas, business plan formulation, business plan competition, and learning from the competition are the major objectives of the event. Young entrepreneurs and students get an opportunity to present their business plans, which found viable, are provided mentoring, incubation, and funding support, apart from prizes.\n\nAngel network funding and mentoring support is extended to good business models. Through the Yi initiatives, one business plan of a differently abled person has been funded and two more have been selected for funding, according to Ponnambalam Balakrishnan, Chair, and B. Prative Chand, Co Chair, Yi, Tiruchi Chapter.\n\nThe Yi has been reaching out to more people and currently works with about five educational institutions in and around Tiruchi to foster the entrepreneurial spirit among students and plans to take it to more institutions over the next couple of years, Mr. Chand said.\n\n“The focus of the initiative is on tier I cities. We have been receiving good business models. They are diverse, aimed at solving problems, and grounded in reality unlike metro cities where most start-up initiatives are focussed on technology,” Mr. Balakrishnan said.\n\nEarlier, the two-day conference was inaugurated by K.S. Bharath, Chairman, Aparajitha Group on Friday.\n\nApart from the experience sharing by a clutch of successful entrepreneurs, Sujith Kumar, Head, Human Resources, Infosys, and R. Sivarajah, founder and president, Nativelead Foundation, addressed students and aspiring entrepreneurs on the first day of the conference.\n\nThe conference is hosted by Yi in partnership with CII, Tiruchi zone, TIE, the knowledge partner, NIT-CEDI, the incubation facilitator, Nativelead Network, the mentoring and funding partner, and Bharathidasan Institute of Management (BIM), the academic partner.", 
    "section": "national", 
    "title": "Young Indians begins hunt for best business plans", 
    "subsection": "tamilnadu", 
    "date": "2016-01-23"
}