{
    "author": [
        "R Krishna Kumar"
    ], 
    "text": "Forest Department has sought the court’s permission to dispose of the entire lot in the Mysuru depot\n\nSeized sandalwood in the custody of the Forest Department in Mysuru has crossed the 100-tonne mark, and the authorities have decided that the only way out is to auction it. For this reason, the department has sought the court’s permission to do so.\n\nThere are nearly 1,100 instances of sandalwood smuggling that the department foiled over the years, and most of the cases are still pending in court. V. Karikalan, Deputy Conservator of Forests of Mysuru Division, told The Hindu that some of the cases were registered as early as in the 1970s, and they are yet to see closure. In most cases, the offenders had simply fled on being apprehended, leaving behind the wood. “We have written to the court to permit us to dispose of the wood in such cases where the offenders are not traceable, after keeping a small portion as evidence,” said Mr. Karikalan.\n\nThe jurisdictional forest office and the police stations where the cases were registered will write individually to the courts to seek permission for the disposal of the wood, he added. In all, 20 forest divisions in the State are attached to the Mysuru sandal koti (sandalwood depot).\n\nOne tonne of sandalwood fetches around Rs.1 crore to Rs.1.2 crore at auctions. So, auctioning the seized material is expected to fetch the government substantial revenue while fuelling the market with the raw material for use in sandal oil extraction, agarbathi units and the handicraft sector. The seized sandalwood is kept at the sandal koti and is under guard round the clock. “Some of the seized sandal has remained in gunny bags for years. Last year, our staff worked for nearly three months dusting and sorting them, with the case number, date of seizure, jurisdictional police station and other details marked on each of the seized sandal clumps,” said Mr. Karikalan.", 
    "section": "national", 
    "title": "100 tonnes of seized sandalwood awaiting auction", 
    "subsection": "general", 
    "date": "2016-03-06"
}