{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Vice-Chancellor says the minority character of the institution must be retained\n\nA day after the Opposition criticised government “interference” in the functioning of Aligarh Muslim University, its Vice-Chancellor, Zameer Uddin Shah, met Prime Minister Narendra Modi on Saturday.\n\nAt the 40-minute meeting, Lt.Gen. (Retd) Shah raised the issue of the minority character of the university while seeking Mr. Modi’s support in the legal battle to preserve its status.\n\nHe raised the issue of off-campus centres of the university in Kerala, West Bengal and Bihar, after Union Human Resource Development Minister Smriti Irani told a ministerial delegation from Kerala that the Ministry would not financially support those centres as they were “illegally” established.\n\n“Lt.Gen. Shah informed the Prime Minister [that] these Centres had been approved by the highest policy-making bodies: AMU Executive Council, University Court, Government of India and the President of India, in his capacity as the Visitor of the university,” Rahat Abrar, university spokesperson, told The Hindu . Lt.Gen. Shah said the BJP had supported the minority character of the AMU when it contested the Lok Sabha elections in 1977 on the manifesto of the Janata Party. The manifesto said, “A consensus on the restoration of the autonomy and original character of the Aligarh Muslim University, which had been gradually impaired by previous governments.”\n\nThe Vice-Chancellor regretted that the Union government had recently reversed its stand with Attorney-General Mukul Rohatgi submitting in the Supreme Court on January 11, 2016, that the stand taken by the previous government was wrong. The five-member delegation, which included the Vice-Chancellor, urged the Prime Minister that the government must revert to its original stand of supporting the minority character of the AMU.\n\n“Restoring the minority character of the university would have a very salutary effect on minorities who are agitated and apprehensive that their rights are being trampled upon. It will also have a positive effect in further binding the minorities in the national mainstream,” said a memorandum seeking the Prime Minister’s support.\n\nThe delegation expressed confidence in the Prime Minister, saying, “We have full faith in your sagacity and the slogan Sab ka Sath, Sab ka Vikas . We are confident that you will take all necessary steps to alleviate the grievances of AMU.”\n\nFunds crunch\n\nThe Vice-Chancellor submitted the memorandum, which said the Centre had sanctioned “Rs. 447 crore” for the off-campus centres. Against this, the university has been given a meagre Rs. 130 crore. He said the AMU was being given less funds than Banaras Hindu University, which is of equal size, and Jamia Millia Islamia, which is half the size.\n\nLt.Gen. Shah informed Mr. Modi that the AMU had recently been placed sixth among top 10 global institutions of higher learning in India and was at the threshold of some outstanding research in the spheres of Environmental Studies and Nano-fertilizers, which would help usher in a “second Green Revolution”.", 
    "section": "national", 
    "title": "AMU team seeks PM’s intervention", 
    "subsection": "general", 
    "date": "2016-03-06"
}