{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The security establishment is on a heightened alert as there are some “disturbing inputs” of a terror attack aimed at creating “the maximum media impact” during the ongoing Parliament session and Shivratri festival, a senior Army officer has said.\n\n“There are security-related problems today. You know, Maha Shivratri is coming. There are inputs which are disturbing but notwithstanding that, extra care has been taken,” Lt. Gen. K.J. Singh, General Officer Commanding-in-Chief, Western Army Command, told presspersons on the sidelines of an event in Pathankot on Saturday.\n\nFurther elaboration about the inputs was “neither required nor warranted”, he said. “These events [terror attacks] are planned to create the maximum media impact, and when can you create a media impact? When Parliament is in session, when a festival is taking place, so both happen to be going on. So that is why, there are inputs but we have taken steps against that. I must assure you of that.”\n\nObserving that a major terror attack had been averted with the recent detection of a tunnel near the International Border, he said a survey was being carried out to ascertain if there were any more such tunnels.\n\n“It is a very serious matter and the Union Home Ministry has constituted a team which has got representatives from security agencies, and the Survey of India. They are going to survey the entire fencing and put in place the measures to seal whatever gaps are there.”\n\nOn SIT visit to Pathankot\n\nOn the proposed visit of Pakistan’s special investigation team to the Air Force station in Pathankot in connection with the investigation into the terror attack, Lt. Gen. Singh said it was the government’s call but advised that the team should be prevented from gathering sensitive information.", 
    "section": "national", 
    "title": "Army officer warns of major terror attack plan", 
    "subsection": "general", 
    "date": "2016-03-06"
}