{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "The Indian Institute of Mass Communication (IIMC) accepted Associate Professor Amit Sengupta’s resignation letter with immediate effect and communicated its decision via e-mail on Saturday, when administrative offices are normally closed.\n\nMr. Sengupta resigned on Friday in protest against the decision of the Officer on Special Duty (OSD) of the institute to transfer him to Dhenkanal, Odisha. The professor’s allegation that he was victimised for supporting students’ protests brings to focus, once again, the freedom enjoyed by those who teach in the institutes funded by the government and their autonomy.\n\nMr. Sengupta, in his letter on Friday, had accused the OSD of not only eroding the autonomy of the institute but also punishing him for supporting students’ struggles on campuses across the country.\n\nAs the Central universities under the HRD Ministry, which have become venues of protest following alleged interference in administrative matters, the IIMC and the FTII have been centres of agitation following the I&B Ministry’s attempts to appoint people with questionable credentials.\n\nLast year, if the I&B Minister’s chosen man, Gajendra Chauhan, was appointed FTII Chairman and four members close to the RSS-BJP were nominated to its society, leading to an unprecedented strike by students, the IIMC finds itself in the news for transferring teachers like Mr. Sengupta who have questioned the system and encouraged students pursuing journalism to do so.\n\nQuite a similar situation prevails in the HRD Ministry under Minister Smriti Irani, whose alleged overreach in the affairs of institutes of higher learning funded by it have led to disquiet among not only students but also senior teachers — at times, even directors heading them.\n\nThe suicide of Rohith Vemula in Hyderabad University highlighted not only the insensitivity of the administration but also exposed the Ministry’s constant interventions, which, many allege, forced the administration’s hand in expelling the students.", 
    "section": "national", 
    "title": "Concern over autonomy as IIMC accepts professor’s resignation", 
    "subsection": "general", 
    "date": "2016-03-06"
}