{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Kerala Pradesh Congress Committee has decided to go slow on its candidate selection process in view of the over 50 days’ time for the Election Commission’s formal election notification.\n\nIn the meantime, the focus would be on sorting out differences with the UDF partners over certain seats, including the numbers to be contested by minor parties like the Kerala Congress (Jacob) and the splinter Communist Marxist Party led by C. P. John.\n\nThe go slow decision was taken at a meeting attended by Chief Minister Oommen Chandy, Home Minister Ramesh Chennithala and KPCC president V. M. Sudheeran and officially indicated here by the latter. However, the KPCC might prepare a draft list of candidates comprising a panel of four for each of the constituencies it is going to contest. This would be submitted to the AICC general secretary Mukul Wasnik, who is in-charge of Kerala, during his tour of the State from Monday.\n\nFrom what the leaders have indicated, it looks that the draft list would make its trip to and fro from here to Delhi till the real time for nominations begins. The party leaders are wary about the onset of bickering if the list were to be announced ahead of time.\n\nThe bilateral discussion with UDF partners is not yet over. The Janata Dal (United) has demanded at least 10 seats to be redistributed from among the seats that have fallen vacant consequent to the ouster of the JSS and the Kerala Congress (B) of Balakrishna Pillai.\n\nThe Kerala Congress (M) is also proving to be a headache, since the party leader is now seeking the Congress support to tide over the problems caused by the departure of a few leaders of the erstwhile Joseph group led by Francis George. The departure has come as a psychological blow for the UDF which had taken pride in accretion in the number of its partners over the years. The Congress is in a dilemma because it also needs to protect its interests in the Central Travancore belt which is expected to provide the party its edge in the election outcome. The departure of leaders like Francis George would also mean reopening the seat sharing formula between Congress and Kerala Congress (M).\n\nFocus on sorting out issues with partners", 
    "section": "national", 
    "title": "Congress to go slow on candidate selection in Kerala", 
    "subsection": "general", 
    "date": "2016-03-06"
}