{
    "author": [], 
    "text": "Homebuyers are suffering in the absence of a regulator in the sector, says Ajay Maken.\n\nThe Congress on Saturday wrote to Prime Minister Narendra Modi and Urban Development Minister M. Venkaiah Naidu, asking them to have the Real Estate Bill passed in the first leg of the Budget Session of Parliament.\n\nThe move by Delhi Pradesh Congress Committee chief Ajay Maken comes two days after Congress vice-president Rahul Gandhi assured a group of homebuyers that his party was committed to a strong Real Estate Bill to protect their interests and would ask the government to bring it in Parliament at the earliest.\n\nMr. Maken, in separates letter to Mr. Modi and Mr. Naidu, said, “It has come to our notice that the Real Estate Bill is yet to be listed for passing in the Rajya Sabha. I wish to reiterate the stand taken by our party vice-president Rahul Gandhi that the Real Estate Bill should be brought in the Rajya Sabha at the earliest”.\n\nNoting that his party supported the Bill, he said, “It is my sincere request to you to list the Bill on top priority basis so that it can be passed in the first leg of the ongoing Budget Session to provide relief to millions”.\n\nRecalling that the Real Estate (Regulation and Development) Bill was approved for introduction in the Rajya Sabha by the Union Cabinet in June 2013 when he was Minister for Housing and Poverty Alleviation in UPA government, Mr. Maken said the legislation was then introduced in the upper House with the sole aim that it would not lapse on the dissolution of 15th Lok Sabha.\n\nThe Bill was referred to the Standing Committee, which submitted its report in February, 2014. After the NDA government was formed, the Bill was again referred to a Select Committee of the Rajya Sabha, which submitted its report on July 30 last year.\n\n“The Bill has since been pending in Parliament and homebuyers are suffering in the absence of a regulator in the sector”, Mr. Maken said.\n\nMr. Gandhi had told the homebuyers that he would urge the Centre to bring the Bill in the House at the earliest.\n\nReferring to the social media campaign by consumers and potential homebuyers seeking early passage of Bill, Mr. Naidu had on Wednesday urged all concerned to enable early passage of this Bill which aims at promoting confidence among homebuyers. — PTI", 
    "section": "national", 
    "title": "Cong. writes to Modi urging passage of Real Estate Bill", 
    "subsection": "general", 
    "date": "2016-03-06"
}