{
    "author": [
        "Gollapudi Srinivasa Rao"
    ], 
    "text": "The killing of two women Naxalites of Warangal — Anitha and Navatha — on the Telangana-Chhattisgarh border on Tuesday amply proves that though insurgency has come down drastically compared to the past, it has not been eliminated as claimed by the Telangana government.\n\nAccording to intelligence sources, as many as 36 persons in the district joined the Maoists since the separate State of Telangana was formed. The promise of more jobs and social justice does not seem to have impressed the youth who are attracted to the extremist ideology. That the Telangana Rashtra Samiti sympathised with the naxals for quite some time also appears to have emboldened some youth to join the armed squads.\n\nA senior police official said although there was no organised movement as in the past, there are many Naxalites around. “A banner was placed by the naxals on the Kakatiya University campus where a condolence meeting of Vivek, a slain naxal, was held. There were posters in Parkal and Bhupalpalli threatening the Speaker and Minister A. Chandulal,” he said. The police dismissed the possibility of the posters being put up by miscreants. However, they are not sure who were behind them.\n\nThe killing a few months ago of Sruthi and Vidyasagar Reddy, who also hailed from Warangal, sent a strong signal to the rebels that the TRS government would not treat armed insurgency lightly. Both had joined the Maoist party after the formation of Telangana State. Navatha and Anitha were also recent recruits.\n\nWhat surprises the police is the reason youth, mostly educated, get attracted to the armed movement and the growing number of sympathisers. It had become difficult for them to identify naxal sympathisers in villages despite their best efforts, the police said.", 
    "section": "national", 
    "title": "Despite encounters, Naxals attract young recruits in Telangana", 
    "subsection": "general", 
    "date": "2016-03-06"
}