{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Contrary to his image of a calm and polite man, the Thane mass murder accused Hasnain Warekar had turned into a completely different person over the last two years, Hasnain’s sister Subiya has alleged in her statement to the police.\n\nThe police said Hasnain had become a terror in his house due to his short temper and used to threaten his family with the qurbaani knife that he used to kill 14 of them before hanging himself at his residence last Sunday.\n\nSubiya, the sole survivor of the murderous rampage who is still in hospital, started recording her statement with the police on Saturday morning. She recounted the attack and made several revelations about Hasnain, that he was sexually abusing his mentally challenged sister Baitul, the debts that he had incurred and the change in his behaviour.\n\n“The whole world knows him as a man who never spoke to anyone beyond salaam-dua (greetings) and never once raised his voice. But at home, his temper scared us all and we were afraid of doing anything that could offend him. His short-tempered nature was due to his failure to repay close to Rs 70 lakh he had borrowed from various persons and the failed import-export business,” Ms Subiya said in her statement.\n\nShe also told the police that Hasnain used to roam around the house with the qurbaani knife, putting it to his family members’ throats and idly wondering how many swipes were needed to kill each one.\n\n“His gestures and words were only in half jest,” Ms Subiya alleged.\n\nHer statement corroborates the police’s suspicion that the victims were drugged before being killed. “Subiya has told us that after the daawats hosted by Hasnain, the family used to stay awake till 2.30 am, including the children, who would play with their grandfather for some time. On Saturday night, last week, however, all of them started feeling sleepy almost as soon as the meal was finished,” said Joint Commissioner of Police Ashutosh Dumbare, Thane police.\n\nThe police, based on the positions of the bodies and the blood splatter patterns in the house, had suspected that the victims were sedated before being killed.\n\nThe police said they were trying to verify the claims that Subiya made about Hasnain sexually abusing Baitul.\n\n“Subiya has said that Baitul told her in January this year about the abuse, which Subiya brought to her mother’s attention. A month later, the matter was discussed by all the sisters and their mother, and Hasnain had heard them talking about it. This could be one of the motives behind his actions, coupled with his mounting debts,” Mr Dumbare added.\n\nHasnain Warekar,\n\na terror at home, would threaten family with knife, says sister", 
    "section": "national", 
    "title": "Grisly subtext to a murder plot", 
    "subsection": "general", 
    "date": "2016-03-06"
}