{
    "author": [], 
    "text": "The Madras High Court has ordered that private schools in the State must follow singing of national anthem as part of their curriculum, keeping in mind the mandate of the Constitution of India, the respect for national anthem and the national flag.\n\nThe First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh on Saturday passed the order on a Public Interest Litigation (PIL) petition moved by N. Selvathirumal, who claims to be an ex-service man and now working with the Railway Claims Tribunal, Chennai.\n\nThe petitioner submitted that most of the schoolchildren were of the opinion that the national anthem was a movie song. He brought the court’s attention to Article 51A of the Constitution which envisages every citizen of the country to abide by the Constitution and respect the national flag and the national anthem.\n\nProviding a list of private schools, he alleged that they were not teaching their students to respect the national anthem on a daily basis. “Based on a reply to a RTI query dated December 17, 2014, I came to know that the Union Ministry of Home Affairs has released an advisory to all the schools to take adequate steps to teach the students to respect the anthem. But as it is an advisory it has no effect on the schools,” said Mr. Selvathirumal. He argued that if the trend continued, it would reduce the importance and value of national anthem and the national flag in the the student community.\n\nWhen the PIL petition came up for hearing, the Central Board of Secondary Education (CBSE), in its counter affidavit, submitted that a circular dated November 10, 2015 has been issued to all the schools directing them to strictly comply with the constitutional mandate related to the national anthem. The Centre also submitted its stand that the national anthem ought to be sung and is being sung in schools.\n\nBut the petitioner contended that the anthem was not being sung to which the Bench said, “It is not impossible for us now to verify with each school for this purpose, especially since various schools are not disputing this requirement as stipulated by the CBSE and the Government of India.”\n\n“We would expect that keeping in mind the mandate of the Constitution, the respect for the national anthem and the national flag, the circulars issued by the CBSE and other authorities, singing of national anthem would be taking place in various institutions,” the Bench said.", 
    "section": "national", 
    "title": "Include singing of national anthem in curriculum: HC", 
    "subsection": "general", 
    "date": "2016-03-06"
}