{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "Principal Secretary in the Prime Minister’s Office Nripendra Misra has already reviewed the EPF tax plan twice this week, starting from the day after the Union Budget was presented, when its repercussions on the working class became clear.\n\nAt an inter-ministerial meeting he chaired on Thursday, the Labour Ministry is learnt to have pointed out that the tax would yield little more than Rs. 200 crore a year from employees earning over Rs. 15,000 a month under the EPF scheme, another senior official said.\n\nThe Labour Ministry also pointed out that since high-income employees, who invested voluntarily in the EPF beyond the Rs 1.5 lakh tax deductions offered under Section 80 C of the Income Tax Act, were anyway taxed on their contributions. So taxing their returns or accumulated corpus, at retirement, would amount to double taxation.\n\nThe official said the government was considering a full rollback of the EPF tax proposals, as demanded by Labour Minister Bandaru Dattatreya and allies of the ruling NDA, especially since the political price of sticking to them could be too high ahead of the Assembly elections, including in West Bengal and Kerala. “Trying to save face with a dilution [of the plan] or a partial rollback would also be risky, especially since the alternative proposals from the Finance Ministry are not optimal from a taxation or implementation point of view,” this official said.\n\nThe Labour Ministry has told the PMO that EPF members already get a pension under the employees’ pension scheme, so instead of forcing them to buy another pension plan through an annuity product with 60 per cent of their EPF account balance at retirement, it would be better to revamp the existing scheme.\n\nThe other proposal, floated by the Finance Ministry after the budget, is that the tax would only be levied on the 60 per cent of interest income on EPF contributions made after April 1, 2016.\n\nThe Labour Ministry has argued that taxing EPF returns announced annually would lead to accounting problems and deprive members of the compounding effect of long-term savings.\n\nWhile it may be possible to maintain multiple sets of accounts for each member to distinguish the interest income from the principal, the idea runs counter to Chief Economic Adviser Arvind Subramanian’s recommendations in the Economic Survey for 2015-16.\n\nThe Survey has mooted a “phased move” to an EET method of taxation of savings, wherein contributions and income from them are exempt from tax, but accumulated savings are taxed at retirement. Taxing interest income would mean subjecting EPF to an ETE (exempt, taxed, exempt) treatment, a system not used anywhere in the world for such funds.\n\nLabour Ministry says taxing EPF returns annually will lead to accounting problems", 
    "section": "national", 
    "title": "‘It amounts to double taxation’", 
    "subsection": "general", 
    "date": "2016-03-06"
}