{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India, Iran and Russia should be included in the talks with the Taliban, says former Afghanistan President Hamid Karzai, who said that the current talks among the Quadrilateral Coordination Group (QCG) were Afghanistan’s “only hope for peace” despite the fact that the talks were being held in Pakistan.\n\n“We have no other hope for peace. Which is what forces us to accept a condition we are unhappy with (on the venue for talks in Pakistan). Of course, we aren’t happy that these talks aren’t being held in Afghanistan”, Mr. Karzai told The Hindu in an interview in Delhi.\n\nMr. Karzai’s comments came as there was uncertainty in Islamabad over just when the next round of QCG talks that include representatives from the U.S., China, Pakistan and Afghanistan, would be scheduled. The group had met twice, in February in Islamabad on February 6 and Kabul on February 23, expressing the hope that the direct talks between the Afghan government and Taliban representatives would be scheduled in early March, after which the QCG had met.\n\nHowever, in a statement on Saturday, the Taliban said it would not attend the talks until all the International Security Assistance Force (ISAF) forces had left the country. “We reject all such rumours and unequivocally state that the leader of Islamic emirate has not authorised anyone to participate in this meeting”, the statement reported on by agencies in Kabul said. “(Islamic emirate) once again reiterates that unless the occupation of Afghanistan is ended, blacklists eliminated and innocent prisoners freed, such futile misleading negotiations will not bear any results”.\n\nAfghan analysts have also been worried that the presence of the U.S. and China in the QCG would push President Ghani to accept more and more concessions toward the Taliban, even though they have been unable to bring enough pressure to bear on Pakistan to use those “levers”. “We believe China has an influence on Pakistan, and we hope it will exercise that influence to bring peace in Afghanistan”, Mr. Karzai said, adding, “Let’s look at it this way… this quadrilateral dialogue implies that the problem for Afghanistan is external, then there are other external players as well who are important. Iran is the first, then India and Russia. They are all friends and neighbours, so I hope the talks would include them too”.\n\nIndia has stayed disengaged from the process, saying that it would support any initiative that is “Afghan-owned and Afghan-led”.", 
    "section": "national", 
    "title": "Karzai for including India in Afghan talks", 
    "subsection": "general", 
    "date": "2016-03-06"
}