{
    "author": [], 
    "text": "Congress leader says those who voted for him are now seeking a ‘refund’\n\nCongress vice-president Rahul Gandhi with Assam Chief Minister Tarun Gogoi launching the first election rally of the Congress, in Assam on Saturday.- Photo: Ritu Raj Konwar\n\nCongress vice-president Rahul Gandhi on Saturday accused Prime Minister Narendra Modi of playing a fraud on the people by failing to fulfil his election promises, and said those who voted for him are now seeking a “refund”.\n\nMr. Gandhi, on a two-day visit to Assam from Friday, was speaking at an election meeting after a six-km padayatra from Shahid Bhawan in Nagaon to Borghat.\n\n“I’ll continue to pressure this government as it is not the government of the honest working class ... it is not the government of poor farmers, backward classes, youths, women, Dalits, adivasis and minorities,” he said.\n\nFour questions\n\nMr. Gandhi said that in Parliament, he had asked Modi four questions on his promise of bringing back black money and depositing Rs. 15 lakh in everybody’s bank account, the recent budget proposal of “turning black money into white,” Rohith Vemula’s suicide and the arrest of Kanhaiya Kumar, and finally about the number of youths employed as a result of his “Make in India” scheme.\n\n“Have I asked anything wrong? Did I say anything personal? Modi ji , in his hour-long speech, instead of giving a reply to these questions, quoted former Prime Ministers Jawaharlal Nehru, Indira Gandhi and Rajiv Gandhi and launched a personal attack on me,” Mr. Gandhi said at the election meeting.\n\n“He does not give answers, but only makes promises which are hollow,” he said.\n\nOn the JNU row, he said the government slapped sedition charges on JNUSU president Kanhaiya Kumar and put him in jail. “But I listened to his 20-minute speech and there is not a single word against the country,” he said.\n\n“People were lured by Modi’s false and hollow promises and are asking for a refund now,” he said. — PTI", 
    "section": "national", 
    "title": "Modi making hollow promises, says Rahul", 
    "subsection": "general", 
    "date": "2016-03-06"
}