{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The government may have managed to table the Aadhar Bill as a money Bill in the Lok Sabha, but there are misgivings about the move among the Opposition and policy-watchers.\n\nLeader of the Opposition in the Rajya Sabha Ghulam Nabi Azad has written to Finance Minister Arun Jaitley, raising apprehensions that the government, which does not enjoy a majority in the Rajya Sabha, is trying to avoid scrutiny of Bills (the Rajya Sabha cannot reject a money Bill) and circumvent questions by the Opposition.\n\n“You may agree that the importance of the Rajya Sabha, of which you are the leader, will be severely impaired if the government decides to adopt the money Bill route for the Aadhaar Bill. Rather, it will be the first step towards making the Rajya Sabha redundant in the days to come,” Mr Azad said. “I am sure, like me, you would not like to fiddle with the constitutional structure that has stood the test of time.”\n\nThe Opposition parties protested when the Bill was introduced on Thursday as a money Bill.\n\nM.R. Madhavan of the PRS Legislative Research says serious questions can be raised on whether the Bill falls in the category of a money Bill. “What does the Constitution say? It says money Bills should have certain features: one, tax is levied through the Bill or some expenditure is validated through the Consolidated Fund of India. It also says anything incidental to these two provisions can put a Bill in the category of a money bill,” he said.\n\n“The way the Aadhaar Bill has been positioned is through clause 7 of the Bill that essentially says the Bill will enable the government to mandate the use of Aadhaar to distribute subsidy. In clause 57, however, it says one can also use this identification number for any other function … In this way, it does not meet the criteria of a money bill,” Mr Madhavan said.\n\nWhat is giving the Opposition the jitters is that as part of the Finance Bill, the government has mentioned the incorporation of the Reserve Bank of India (RBI) monetary policy committee. “How can that be made a part of the Finance Bill? It is just to avoid scrutiny by the Rajya Sabha,” a source said.", 
    "section": "national", 
    "title": "Opposition livid over money Bill on Aadhaar", 
    "subsection": "general", 
    "date": "2016-03-06"
}