{
    "author": [
        "Devang Pathak"
    ], 
    "text": "‘When you concede fascism is staring you in the face, you overestimate your enemies’\n\n“The moment you concede that fascism is staring you in the face, you overestimate your enemies who are against pluralism and secularism,” said N. Ram, Chairman, Kasturi and Sons Ltd., on Saturday.\n\nHe was speaking at the first day of the two-day Mumbai Collective event, “Celebrating Freedom and Pluralism in Defence of Secularism” at the Y.B. Chavan Centre. The event started with an inaugural address by Professor R. Ramkumar of the Tata Institute of Social Sciences.\n\nThe Mumbai Collective represents a group of academics, activists, writers and journalists with a view ‘to bringing like-minded progressive people from different walks of life’ together.\n\nThe inaugural panel, comprising Mr. Ram and Professor Gopal Guru of the Centre of Political Studies, Jawaharlal Nehru University, spoke about restricted freedom of speech and nationalism respectively. Mr. Ram noted that the slew of incidents in recent months were not merely “accidental” but clearly had a pattern in adherence to an ideology. But he refused to believe that this was the age of fascism.\n\nTalking on nationalism and its state in India, Professor Guru said: “Nationalism isn’t sufficiently plural. The dominant definition is emotional, outward looking, and based on borders such as the Line of Control.”\n\nA panel discussion, ‘Mumbai: 24 years after the 1992 riots’ with Naresh Feranandes, Editor, Scroll.in , and Jyoti Punwani, independent journalist, talked about the increase in ‘ghettoisation’ in the city post-1992 riots.\n\n“A historian’s dharma is to be vigilant to mythmaking,” said historian K.M. Shrimali as he spoke about ‘How the Sangh Parivar Rewrites History.’ Mr. Shrimali recounted several anecdotes of how the Sangh Parivar had sought to establish its own version of history in educational institutions.\n\nHistory and facts played a significant role in another panel which sought to argue against the Hindutva appropriation of icons such as Dr. B.R. Ambedkar, Shivaji and Bhagat Singh. Chaman Lal, Professor of Indian languages at JNU, and an expert on Bhagat Singh, marvelled at how the freedom fighter has been appropriated as an icon by the Sangh Parivar. Bhagat Singh was, in fact, a prominent Marxist atheist. While CPI(M) member Ashok Dhawale sought to debunk the saffronised version of Shivaji and talked about his progressive tolerance of Muslims, former MP Prakash Ambedkar highlighted the ideological differences between the Sangh Parivar and Dr. Ambedkar’s philosophy.\n\nMedia and the crisis\n\nThe last panel discussion for the day was ‘Media and Communal Politics’ with journalists Nikhil Wagle, P. Sainath, Sashi Kumar, and Geeta Seshu.\n\nWhile Ms Seshu spoke about the failure of the media to regulate itself, Mr. Wagle opposed the manipulation of the media for communal gains. “These are the worst days in my 35 years of journalism because so much poison exists now,” Mr. Wagle said. “If you want to break democracy, secularism, and fraternity, you have to break the media first,” said Mr. Wagle. Sashi Kumar, the founder of Asianet and chairman of the Asian College of Journalism, said the job of free and truthful journalism is to “comfort the afflicted and afflict the comfortable”.\n\nMr. Sainath said the more the Indian population had become heterogeneous, the more the media was becoming homogenous with the corporatisation of the media. “We have reduced journalism to a revenue stream,” Mr. Sainath said, as he called the Indian media politically free but imprisoned by profit. He noted how the greatest exposures in journalism in the last decade had come not from mainstream journalists but people such as Julian Assange, Edward Snowden, and Chelsea Manning.\n\n(The author is a freelance writer)\n\nThe Mumbai Collective seeks to bring together\n\nlike-minded progressive people", 
    "section": "national", 
    "title": "Recent incidents not ‘accidental’, show ideological pattern: N. Ram", 
    "subsection": "general", 
    "date": "2016-03-06"
}