{
    "author": [
        "Special Correspondent"
    ], 
    "text": "JSS leader Gouri stepped into Kerala CPI (M) office to negotiate seat-sharing with LDF\n\nJanadhipathya Samrakshana Samithi leader K.R. Gouri coming out of the AKG Centre in Thiruvananthapuram after meeting the CPI(M) leaders.— Photo: C. Ratheesh Kumar\n\nThe AKG Centre in the city, the Kerala headquarters of the CPI(M), was witness to a historic homecoming of sorts when K.R. Gouri, one of the most powerful women leaders of the State, stepped into the portals of the imposing edifice where she was a commanding presence 22 years ago.\n\nShe was met at the steps of the AKG Centre by Opposition Left Democratic Front (LDF) convener Vaikom Viswan, and received with warmth by party Polit Bureau member Pinarayi Vijayan and State secretary Kodiyeri Balakrishnan in the AKG Centre.\n\nThe purpose of her visit was to negotiate her party’s share in the allocation of seats by the LDF leadership, but there was much more to her arrival at the CPI(M) headquarters.\n\n“We sat there talking long about the old times,” she told reporters at a news conference held a while later.\n\nMs. Gouri, who will turn 97 on July 14, had walked out of a party State secretariat meeting and the AKG Centre on a bright noon in January 1994, when she found herself cornered by the then party leadership over allegations of nepotism and ‘anti-party activities.’\n\nShe had gone ahead and formed the Janadhipathya Samrakshana Samithi (JSS), a political outfit that became part of the Congress-led United Democratic Front (UDF), and become a Minister in the two UDF governments that ruled the State between 2001 and 2006. She had distanced herself from the UDF over a year ago and campaigned for LDF candidates in the last Lok Sabha elections.\n\nShe was almost on the verge of merging her party with the CPI(M) last year, but could not do so because of legal hurdles.\n\nMs. Gouri, who had etched her name in the annals of Kerala’s political and social history as a fiery Communist activist and, later, by piloting the historic Kerala Agrarian Relations Bill of the first E.M.S. Namboodiripad Ministry (1957-58), was one of the frontline leaders of the CPI(M) from the day the party was formed in 1964. She came very close to becoming the Chief Minister of Kerala in 1987, only to be pipped to the post by the late E.K. Nayanar.\n\nHer expulsion from the CPI(M) was under unedifying circumstances. She was found ‘guilty’ by an internal party inquiry of having shown favouritism towards those involved in the then sensational cashew import scandal. A vigilance inquiry that was on into the allegations had by then become the subject of a preliminary inquiry by the CBI, but there was no further investigation.\n\nShe had walked out of a meeting in 1994 after being accused of anti-party activities", 
    "section": "national", 
    "title": "Return of the comrade after two decades", 
    "subsection": "general", 
    "date": "2016-03-06"
}