{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "Since Dec. 2015, six cases involving boys aged 16 or below have been reported\n\nThree years after the Delhi gang rape in 2012, and a change in the ruling dispensation, the Centre managed to push through a vital amendment to the Juvenile Justice (Care and Protection) Act, which brings down the age for trying a minor as an adult for serious crimes from 18 to 16 years.\n\nOne of the accused in the gang rape was a few months short of 18 years when he was booked for the crime. At the time, the law said minors can be only booked and, if convicted, cannot be sentenced to more than three years in a juvenile correctional facility.\n\nBy the time the amended Act came into force in January, the accused had walked free in December 2015. Since then, Mumbai alone has accounted for six cases of sexual assault where the accused were aged 16 years or younger — the youngest being a 12-year-old boy who was booked on January 29 by the Goregaon police for allegedly molesting his neighbour’s three-year-old daughter.\n\nPolice and the legal fraternity blame lack of focused sex education and poor parental control for the rising number of cases of minors committing sexual crimes. They point to the easy availability of sexual content on the Internet and the fact that children as young as 11 or 12 are now given cell phones with Internet access by parents.\n\nThe other reason behind the occurrence of such crimes is lack of awareness about personal safety among the children who are targeted. According to experts, this is also due to the absence of a proper sex education mechanism.\n\nA far bigger concern is most accused are dealing with the hormonal rush that comes with teenage, and don’t know that they are committing crimes punishable by law. Under the amended Act, a minor accused of serious crimes like rape and murder can be tried as an adult if he is above 16 years.Experts say the juvenile justice system too needs to be looked at closely. Once incarcerated in a correctional facility, the accused come into contact with other accused minors, and is at the mercy of a system which lacks infrastructure as well as the sensitivity to deal with them. Many of them go on to commit even more serious crimes.", 
    "section": "national", 
    "title": "Sexual offences by juveniles on the rise in Maximum City", 
    "subsection": "general", 
    "date": "2016-03-06"
}