{
    "author": [
        "Prafulla Das"
    ], 
    "text": "Activists of Niyamgiri Surakshya Samiti will approach the Odisha Governor to reiterate their opposition to mining in the hills which they consider sacred.- File Photo: Lingaraj Panda\n\nPeeved over Naveen Patnaik Government’s fresh bid for bauxite mining in the Niyamgiri hills to ensure raw material supply to Vedanta’s alumina refinery in Kalahandi district, the activists of the Niyamgiri Surakshya Samiti have decided to approach the Governor of Odisha to reiterate their opposition to mining in the hills, which they consider sacred.\n\nA delegation of the Dongaria Kondhs under the banner of the Surakshya Samiti will shortly meet Governor S.C. Jamir to apprise him of their protest. Subsequently, the tribals have planned to intensify and strengthen their opposition to the proposal for mining in Niyamgiri.\n\nA two-judge Bench of the Supreme Court on Friday observed that the plea of Odisha Mining Corporation seeking a direction for re-conduct of gram sabhas for approval of mining in Niyamgiri be referred to a three-judge Bench of the court for consideration.\n\nThe gram sabhas were held in 12 villages in Niyamgiri region in 2013 as per the orders of the Supreme Court and all rejected the mining proposal.\n\n“There was no need for the State government to approach the Supreme Court. They should have approached the gram sabhas which are supreme even in the view of the Supreme Court,” said Lingaraj Azad, advisor of the Surakshya Samiti on Saturday.\n\nPolice repression\n\nMr. Azad said the delegation of tribals from the Niyamgiri hills, spread over Kalahandi and Rayagada districts, will also inform Mr. Jamir about the alleged police repression in the region with innocent tribals being branded as Maoists and killed.\n\nMonda Kadrika, a local youth, was killed in Kalyansinghpur police station area in Rayagada on February 27. Police had claimed that Kadrika was killed during an exchange of fire between Maoists and security forces, while his family members and villagers said that the 20-year-old youth was falsely implicated as a Maoist.", 
    "section": "national", 
    "title": "Tribespeople seek to stall fresh mining proposal", 
    "subsection": "general", 
    "date": "2016-03-06"
}