{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘It would be the natural fulfilment of ideals behind Panchayati Raj Act’\n\nCamaraderie across party divisions:Lok Sabha Speaker Sumitra Mahajan with Union Minority Affairs Minister Najma Heptullah, External Affairs Minister Sushma Swaraj, the former Delhi Chief Minister Sheila Dikshit, and Union Women and Child Development Minister Maneka Gandhi during the National Conference of Women Legislators in New Delhi on Saturday.— Photo: R.V. Moorthy\n\nPresident Pranab Mukherjee on Saturday appealed to all political parties to pass the Constitution 108th Amendment Bill, or Women’s Reservation Bill, to reserve one-third of the seats in State legislatures and Parliament for women.\n\nAddressing a national conference on “Women legislators: building a resurgent India”, organised by Lok Sabha Speaker Sumitra Mahajan here to coincide with International Women’s Day on March 8, he said this reservation would be the natural fulfilment of the ideals behind the Panchayati Raj Act.\n\n“During my days in Parliament — and my colleague from then, Mrs. Sushma Swaraj, is present here — there had been big attempts at getting the legislation cleared. It was cleared in the Rajya Sabha, but not in the Lok Sabha. There has to be an attitudinal change and I am hopeful that the Bill will come up for consideration,” he said.\n\nMr. Mukherjee said Vice-President Hamid Ansari’s suggestion that political parties make a start by giving at least 33 per cent of the electoral ticket to women candidates was a good one, but “unless it is followed by all parties it won’t be successful”. He added, however, that the Vice-President’s suggestion that political parties take particular care in making sure they nominated women members to parliamentary committees was an important one.\n\nHe praised Prime Minister Narendra Modi, who was present at the conference, but did not speak. “As soon as he was elected Prime Minister, he gave the slogan of Beti Bachao, Beti Padhao , and the fact that he is here, when he does not have to speak, for this function, shows his commitment to women’s empowerment,” the President said.\n\nMs. Mahajan said the conference was important in underlining the fact that economic growth was not the only measure of holistic development — there should be commensurate social development.\n\n“That cannot happen without the contribution of women legislators and administrators,” she said. The conference will continue on Sunday.", 
    "section": "national", 
    "title": "Women’s reservation must for Panchayat Raj’s success: Pranab", 
    "subsection": "general", 
    "date": "2016-03-06"
}