{
    "author": [
        "Soumya Das"
    ], 
    "text": "West Bengal Chief Minister Mamata Banerjee says her government has completed most of the work.\n\nChief Minister Mamata Banerjee on Tuesday brushed aside the efforts of the Communist Party of India (Marxist) to form an alliance with the Congress party to oust her government.\n\nAddressing a government programme in Sadhanpur here, the Chief Minister said it was futile to form a “nexus” against the Trinamool Congress (TMC).\n\n“It is no use conspiring (against the TMC government). The masses want the grand alliance of people,” Ms. Banerjee said during Mati Utsav (festival of soil).\n\nHer comments come in the wake of a section of CPI(M) leadership, including former Chief Minister Buddhadeb Bhattacharjee and party State secretary Surjya Kanta Mishra, making public offers of an alliance to the Congress.\n\nConfident of comeback\n\nMaking it clear that she was confident of the TMC returning to power in the Assembly elections this year, the Chief Minister said: “We have completed most of the work. Whatever little is left, we will do it next time.”\n\nMs. Banerjee refuted the criticism of the CPI(M) that accused the TMC of ruining the prospect of industrialisation in West Bengal and asserted that she was in favour of “equal growth of industry and agriculture.” Without naming the party, she accused the CPI(M) of trying to create a “conflict between industry and agriculture”, asserting that she would not allow it.\n\n“Industry and agriculture are dependent on each other. Look what they (CPI-M) have done to Bengal with their strikes in 34 years. Enough of such politics now,” Ms. Banerjee said.\n\nThe Chief Minister urged the gathering not to get influenced by “divisive politics”, saying “if anyone tries to create a division among the Hindus, Muslims, Sikhs and Christians, do not listen to them.”", 
    "section": "national", 
    "title": "Any nexus against TMC is futile: Mamata", 
    "subsection": "general", 
    "date": "2016-01-20"
}