{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After 11 years, the much-awaited data on India’s health indicators were released by the Health Ministry on Tuesday night. The Phase 1 results from the National Family Health Survey-4 for 2015-16, which covered 13 States and two Union Territories (UTs), are a reason to smile.\n\nIn nearly every State, fewer children are dying in infancy, and across all States, more mothers are getting access to skilled ante-natal care. The last round of NFHS data was released in 2005-06.\n\nOther findings are that while anaemia is widespread, rates have declined. Currently, over half the children in 10 States and over half the mothers in 11 States continue to be anaemic. Consistent with the burden of non-communicable diseases in India, over-nutrition or obesity among adults has emerged as a major concern. At least three in 10 women are overweight or obese in the Andaman and Nicobar Islands, Andhra Pradesh, Goa, Puducherry, and Tamil Nadu.\n\nA promising trend in the data shows that women are having fewer children.\n\nFertility rates\n\nThe report states, “The total fertility rates or the average number of children per woman, range from 1.2 in Sikkim to 3.4 in Bihar. All first phase States/UTs except Bihar, Madhya Pradesh and Meghalaya have either achieved or maintained replacement level of fertility — a major achievement in the past decade.”\n\nFindings for the 13 States — Andhra Pradesh, Bihar, Goa, Haryana, Karnataka, Madhya Pradesh, Meghalaya, Sikkim, Tamil Nadu, Telangana, Tripura, Uttarakhand and West Bengal — and two Union Territories of Andaman and Nicobar Islands and Puducherry show that all have rates below 51 deaths per 1,000 live births, although there is considerable variation among the States/Union Territories.\n\nMore mothers\n\nin India are now getting access\n\nto skilled\n\nante-natal care", 
    "section": "national", 
    "title": "Fewer children dying in infancy, says survey", 
    "subsection": "general", 
    "date": "2016-01-20"
}