{
    "author": [
        "Angela Saini"
    ], 
    "text": "A blooming zinnia following a successful lettuce harvest at the ISS heralds a giant leap for zero-gravity gardening\n\nWhen there is no “up”, which way does a flower grow? Astronauts on the International Space Station (ISS) have answered this and other zero-gravity gardening conundrums by growing the first flower in space.\n\nThe orange zinnia looks like a daisy and has a reputation for being one of the easiest flowers to grow on Earth. In space, though, it was a challenge getting it to sprout.\n\nThe flowers seemed doomed in December after four plants developed mould. But at the weekend, U.S. astronaut Scott Kelly, who has been taking care of them, tweeted a photo of a solitary blooming zinnia with the Earth in the distance behind it, with the hashtag #SpaceFlower and the words: “Yes, there are other life forms in space!”\n\nThe flower is part of a wider attempt to grow food in orbit, using Nasa’s plant growth system Veggie, which was delivered to the ISS in April 2014. The Veggie team has already enjoyed a successful lettuce harvest and plan to have tomatoes too by 2017. Ultimately, the hope is to make possible “a sustainable food supplement” for a future manned mission to Mars.\n\nBut space gardening is plagued with problems, including high radiation levels and temperature extremes. Fortunately, with the ISS in a low orbit, the Earth’s magnetic field shields plants from the worst radiation effects. Inside the station, the atmosphere can be tightly controlled.\n\nExperimentation on\n\n“It’s a relatively nice environment, with heat and humidity control,” says professor Dhiren Kataria, who builds space instruments at University College London’s Mullard Space Science Laboratory, and is working on a new project to study the survival of seeds in space in collaboration with the seed bank at Kew Gardens.\n\n“It’s quite significant that we can do this now,” says Prof. Kataria. “If we can grow flowers, it helps in terms of the pollination process. And if you want a sustainable environment, you need cross-pollination.” Plus, of course, nothing brightens up a space station like a nice bunch of flowers. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "First flower in space is giant leap for zero-gravity gardening", 
    "subsection": "general", 
    "date": "2016-01-20"
}