{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The party may have to go back to the drawing board to refashion caste templates\n\nSolidarity with Rohith:Students from various universities staging a protest beside a statue of Ambedkar in Hyderabad on Tuesday.— Photo: K.V.S. Giri\n\nhe suicide of a Dalit research scholar, Rohith Vemula, has not only set off a political storm but also placed the Bharatiya Janata Party in a politically precarious position.\n\nThe letters written by Union Ministers seeking action against Dalit students who had got into a clash with activists of the Akhil Bharatiya Vidyarthi Parishad (ABVP), the student wing of the Rashtriya Swayamsevak Sangh and the subsequent death of Rohith, has focussed attention on the way the party and the government has been wrong-footed on Dalit issues.\n\nAn interview given by RSS chief Mohan Bhagwat to the Organiser asking for a review of the current policy of reservation, and the remarks made by Union Minister of State for External Affairs, V.K. Singh, when two Dalit children died of burns in Faridabad, contrasts sharply with the recent conclave of Dalit entrepreneurs and the Union government’s grand plans to commemorate the 125th birth anniversary of Dalit icon B.R. Ambedkar.\n\nSome of this internal contradiction was reflected in the reaction of former Union Minister and member of the BJP national executive Sanjay Paswan to Rohith’s suicide. “The stakeholders of power politics must take serious note of the episode or be ready to face wrath, revenge, revolt, reactions,” he tweeted.\n\nMr. Paswan, who had headed the BJP’s Scheduled Caste Morcha, told The Hindu : “As a Dalit, I know how difficult it is for children of the community to reach these levels of higher education and then for this to happen ... ”\n\nFormer BJP ideologue and architect of its “social engineering” project of breaking the stereotype that the BJP was only an upper caste party, K.N. Govindacharya terms it an ideological contradiction that lies at the heart of the Sangh Parivar.\n\n“Even the leadership that was developed from among the Other Backward Classes and the Scheduled Castes could not be extended across the board, and the party retreated to type,” he said. “ Satta [power], Sampatti [property] and Samman [dignity] are the three things that are needed when you want to co-opt a particular social group; it cannot be done by tokenism, upkar ki bhavna se nahin ho sakta ,” he said.\n\nPolitical scientist Badrinarayan, author of a well-regarded biography of Bahujan Samaj Party founder Kanshi Ram, puts it differently.\n\n“What happened in Hyderabad is not a problem between the Dalits and the ABVP, but between a certain kind of radical Dalit politics, that doesn’t square with the ABVP or even the BJP ideologically,” he said.\n\nThe RSS had launched an ambitious programme just last year on outreach to the Dalit communities especially in rural areas, and auditing instances where Dalit communities were denied access to public spaces. The suicide in the University of Hyderabad and its aftermath may well force the BJP and its larger ideological family to go back to the drawing board to revisit some caste templates.", 
    "section": "national", 
    "title": "For the BJP, a poignant moment for introspection", 
    "subsection": "general", 
    "date": "2016-01-20"
}