{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Srinagar-resident Bilqees Dar organised an assembly of mourners after 14 years of search for her father failed\n\nBilqees Dar leads a protest demanding justice ahead of a funeral prayer for her father on the outskirts of Srinagar on Tuesday.— PHOTO: NISSAR AHMAD\n\nKashmir, with more than 7,000 documented cases of “disappeared” people, witnessed the formal closure of the first such case on Tuesday when a woman performed the funeral prayers for her missing father without a grave or a body.\n\nBilqees Dar, in her thirties, organised an assembly of mourners around 2 p.m. in a school ground in Srinagar’s Rawalpora area, after 14 years of agonising search failed to locate her father Manzoor Ahmad Dar.\n\nMs. Dar says that she did not want to see her ageing and ailing mother die a half-widow.\n\n‘Half-widow’ was a term coined for women whose husbands have disappeared, mainly in counter-insurgency operations carried out by the security agencies, after armed rebellion broke out in the State in the 1990s.\n\n“Ever since the police presumed him dead, my mother has not been keeping well. She should not die a half-widow. The funeral will give her peace of mind,” said Ms. Dar.\n\nMs Dar was in Class 9 when her father was picked up by the Army’s 35 Rashtriya Rifles on January 18, 2002.\n\n“We returned disappointed from every jail, every army camp and every police station where we searched for our father … However, it is a unique case where the government presumed the victim to be dead,” said Ms. Dar.\n\nA Special Investigation Team probing Dar’s custodial disappearance closed the case on November 26, 2015, concluding that Major Kishore Malhotra (now Brigadier) abducted him from his residence and “his body could have been disposed of.” An arrest warrant was issued against the officer by a local court.\n\nScores of people gathered at the Rawalpora school ground for the funeral. A spontaneous shutdown was observed in the area and several protesters raised anti-government slogans and waved flags. Separatist leaders like Hurriyat leader Pir Saifullah and JKLF chief Yasin Malik also offered prayers.\n\n“The struggle to search and identify our loved ones will continue,” Parveena Ahangar, chairperson of the Association of Parents of Disappeared Persons (APDP), a body of families searching for missing relatives, told The Hindu . “No closure equals a real closure where justice is delivered.”\n\nSearches continue\n\nMs. Ahangar claimed that despite Islamic decrees allowing ‘half-widows’ to remarry, they preferred to continue the search for their missing husbands.\n\n“Our demand is to subject the bodies buried in unmarked graves to DNA test. Identify the graves if there is a match,” said Ms. Ahangar.\n\nJ-K Coalition of Civil Society, a rights body, has documented more than 7,000 graves and an estimated 8,000 disappearances in Jammu and Kashmir since the 1990s.\n\nIt marked the formal closure of the first case in Kashmir where there are over 7,000 documented cases of “disappeared” people", 
    "section": "national", 
    "title": "‘Funeral’ for missing man in Kashmir", 
    "subsection": "general", 
    "date": "2016-01-20"
}