{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Seven-page document highlights 16 points of contention\n\n: With only a few days left for the final hearing on appeals against the acquittal of Tamil Nadu Chief Minister Jayalalithaa to commence in the Supreme Court, the Karnataka government on Tuesday firmed up their act by filing point-by-point highlights of the “errors” made by the State High Court in deciding the disproportionate assets case in favour of the AIADMK leader and three co-accused.\n\nThe seven-page document listed 16 points of contention against the May 11, 2015 judgment of Justice C.R. Kumaraswamy which led to the exoneration of Ms. Jayalalithaa, N. Sasikala Natarajan, V.N. Sudhakaran and J. Elavarasi in the corruption case. Principally, the State government asks whether the bare fact that it was neither considered nor ignored as the “sole prosecuting agency” in the corruption case would by itself vitiate the HC judgment.\n\nThe State wants the Supreme Court to address what would be the effect of not repairing this omission throughout the appeal hearings in the HC till they were disposed of. The State’s document, filed by advocate Joseph Aristotle and settled by senior advocate B.V. Acharya, asks whether the appeals were not vitiated as the duly appointed Public Prosecutor was “never given the opportunity” of an oral hearing. His role was reduced to just handing over written submission, that too on the orders of the Supreme Court, at the fag end of the appeals in the HC. The State government pointed out that the acquittal can be set aside by just correcting the “totalling mistake” to show that the value of disproportionate assets of the accused comes to Rs. 16.32 crore, that is 76.7 p. c. of the income, against the 8.12 p.c. arrived at by the HC.\n\nThe document lists 16 points of contention against Kumaraswamy judgment", 
    "section": "national", 
    "title": "Karnataka govt. lists ‘errors’ in acquittal of Jayalalithaa in assets case", 
    "subsection": "general", 
    "date": "2016-01-20"
}