{
    "author": [
        "National Bureau"
    ], 
    "text": "Former Prime Minister Manmohan Singh with SP Chief Mulayam Singh as Congress leader Mallikarjun Kharge looks on during the condolence meeting of CPI leader A.B. Bardhanin New Delhi on Tuesday.— Photo: PTI\n\nLeaders across political parties, including the former Prime Ministers Manmohan Singh and H.D. Deve Gowda, converged at the memorial meeting of late CPI leader A.B. Bardhan, who passed away recently, here on Tuesday.\n\nCongress leader Mallikarjun Kharge, Samajwadi Party leader Mulayam Singh, AIDMK leader M. Thambidurai, NCP leader D.P. Tripathi, CPI (M) general secretary Sitaram Yechury and his predecessor Prakash Karat, shared the stage with CPI leaders to recall the legacy of Bardhan.\n\n“He was in the forefront of opposing communalism,” Mr. Yechury said about Bardhan, even as he shared some anecdotes about him.\n\n‘Committed leader’\n\nWhile Dr. Singh chose not to speak, the others shared their memories of Bardhan, remembering him as a committed Communist leader who led a simple life, often staying in a room of the party’s office.\n\nOn the sidelines of the event, Mr. Yechury said that the CPI (M)’s aim was to “save West Bengal” from the Mamata Banerjee government and to “save India” from the BJP government. “Who comes or does not come with us, it is for them to decide,” he said on whether the party would ally with the Congress in Bengal.\n\nHe also demanded that Union Ministers Smriti Irani and Bandaru Dattatreya be sacked in the wake of the suicide of a Dalit student of Hyderabad University.\n\nJanata Dal (United) leader K.C. Tyagi made extensive references to current controversies, saying Bardhan’s passing away was a jolt in such a situation.\n\n‘Time of crisis’\n\n“This is a time of crisis. People’s food habits and religious beliefs are being questioned. Not even in colonial times was the situation so bad. In Hyderabad, a Dalit boy has been forced to commit suicide. The minority status of the AMU and the Jamia Millia Islamia is being questioned,” he said.", 
    "section": "national", 
    "title": "Leaders pay homage to Bardhan", 
    "subsection": "general", 
    "date": "2016-01-20"
}