{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The city will see three musical acts as part of the Mumbai for Chennai initiative’s concert series\n\nAs Chennai recovers from the floods, a celebration of the city’s resilience comes in the form of three-day concert series titled ‘Mumbai for Chennai’. Featuring artists that bring warm and soulful melodies to stage, the concert is part of The Hindu Group’s series of fundraising concerts dedicated to the victims of the Chennai floods. “ The Hindu just concluded its annual music festival, the November Fest, about a month before Chennai was devastated by floods. And it seemed appropriate that we do something connected with music after the waters receded. And what better place to do this than Mumbai?,” says Mukund Padmanabhan, Editor, Business Line , and organiser of the event.\n\nPresented by Yes Bank and powered by Birla Sun Life Mutual Fund, the event commences on Friday January 22, with a performance by classical vocalist and Padma Shri Awardee, Aruna Sairam.\n\nShe will present Abhang or Abhanga which is a form of devotional poetry sung in praise of Vitthala, also known as Vithoba, the presiding deity of Pandharpur. She will be accompanied by artists from both south and north Indian traditions and will trace the influence of Maharashtrian culture in South India since the rule of the Marathas in Thanjavur. Complementing her are M. Rajeev on violin, J. Vaidyanathan on mridangam, Mandar Puranik on tabla and Paras Nath on the flute. The next day will feature an instrumental duet by celebrated flautists Shashank Subramanyam and Ronu Majumdar. While Subramanyam, is a Grammy nominated exponent of the flute, Majumdar is a celebrated flautist representing the Hindustani music tradition, trained under his father, Dr Bhanu Majumdar, and later under late Pandit Laxman Prasad Jaipurwale and renowned flautist Pandit Vijay Raghav Rao. The duo will be accompanied by talented percussionists Parupalli Phalgun on the mridangam and Anubrata Chatterjee on the tabla.\n\nTheir concert will be a melange of the Hindustani and Carnatic music traditions, and will showcase how different and similar the two are.\n\nJanuary 26, the final day, will see acclaimed playback singer Hariharan, the son of renowned Carnatic vocalists, Shrimati Alamelu and the late H.A.S. Mani, perform a ghazal concert. Inspired by Pakistani singer, Mehdi Hassan -- Hariharan developed a passion for ghazals and started training in Hindustani music from Padma Bhushan, Ustad Ghulam Mustafa Khan. He has gone on to perform several ghazal concerts and has been lauded for his proficiency in Urdu.\n\nSchedule\n\n22 January 2016 – Aruna Sairam sings abhangs in collaboration with Marathi and Carnatic musicians.\n\n23 January 2016 – Shashank Subramanyam and Ronu Majumdar in a flute jugalbandi.\n\n24 January 2016 – Hariharan sings ghazals.", 
    "section": "national", 
    "title": "Mumbai reaches out to flood victims", 
    "subsection": "general", 
    "date": "2016-01-20"
}