{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "No clarity yet on the number of terrorists who entered the airbase\n\nSix sets of footprints, six AK-47 magazines and a five to six kilometre land-riverine patch from where the terrorists most probably infiltrated into India — these are the latest findings of the National Investigation Agency (NIA) which took over the probe into the Pathankot Airforce base attack a fortnight ago.\n\nThe NIA subjected Gurdaspur Superintendent of Police Salwinder Singh, who they are treating as a suspect, to a lie-detector test on Tuesday.\n\nMeanwhile, the mystery surrounding the number of terrorists who entered the Airbase continues. While four bodies were found at the airbase, the confusion about the presence of one or two more terrorists at the Airmen’s billet which was blown up persists.\n\nAll the NIA officers can say for now is that they picked up a lump of flesh from the building and sent a sample to the forensic laboratory. Its report is awaited. They have also preserved the DNA samples.\n\nApart from four AK-47 rifles found on the four bodies, no other weapon has been recovered. A mobile phone recovered from the rubble turned out to be an Airbase employee’s, said an NIA official.\n\n“Apart from the recoveries made by the Air Force personnel after the operation ended, there have been no new recoveries. We are still searching for evidence,” said a senior NIA official.\n\nThe entry point identified by NIA, from where the terrorists could have sneaked into India, falls in the Gurdaspur sector in Punjab. “We zeroed in on the area after measuring the distance from the airbase and the circuitous route the terrorists took to reach there,” said the official. “They travelled a distance of nearly 40 kilometres from the border point to the airbase.”\n\nThe official said that after the first set of footprints were lifted after being alerted by villagers near Bamiyal village, the NIA collected five more samples. They have been sent for forensic analysis to match them with the shoes worn by the terrorists.\n\nA team of NIA officials has been rummaging through the damaged airmen’s billet. “We have stationed a team at the airbase and are questioning all the personnel who were in the vicinity or were present there during or before the attacks took place,” said the official.", 
    "section": "national", 
    "title": "NIA continues to search for evidence", 
    "subsection": "general", 
    "date": "2016-01-20"
}