{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Sushil Kumar Modi with other BJP leaders sitting on a dharna in Patna on Tuesday in protest against the killing of a jeweller and the increasing crime in Bihar.— PHOTO: RANJEET KUMAR\n\nA day after two ruling Janata Dal (United) MLAs courted controversies for allegedly misbehaving with a couple in a running train, the Opposition BJP on Tuesday called Bihar Chief Minister Nitish Kumar a “helpless CM”, daring him to take action against the two party legislators.\n\nThe BJP also said it would soon meet the Governor to seek his intervention to check the rising crime in the State.\n\n“Earlier, people were afraid of the RJD but now even JD(U) MLAs have started flexing their muscles and Nitish Kumar has become a bechara mukhya mantri (helpless chief minister) before such elements,” said senior BJP leader Sushil Kumar Modi. Criminals had become emboldened ever since the coalition government of the RJD-JD(U) and the Congress came to power in Bihar, he said.\n\nMr. Modi was reacting after two JD(U) MLAs — Sarfaraj Alam and Bima Bharti — hit headlines for wrong reasons recently.\n\nMr. Alam, an MLA from Jokihat Assembly constituency in Araria district, was named as an accused in a complaint over allegedly misbehaving with a couple in a Guwahati-Rajdhani train on Sunday night. However, the MLA has denied the charges and claimed that he was not even travelling in the train.\n\nMs. Bharti, an MLA from Rupauli Assembly constituency in Purnia district, was accused of helping her husband Awadhesh Mandal, against whom several criminal cases have been lodged, and getting him released from the Maranga police station.\n\nHowever, Ms. Bharti denied the charges, saying she did not know how her husband got out of police custody. Later, the police station in-charge, Shivshankar Kumar, was placed under suspension for “laxity in duty.”\n\nEarlier, following the daylight murders of two engineers and a Patna-based jeweller and several incidents of extortion, Chief Minister Nitish Kumar underscored that law and order “would be maintained at all costs” in the State.\n\nExtortion again\n\nHowever, incidents of crime continue in the same trend. On Tuesday, the Alamganj police in Patna filed a case following a complaint of extortion registered by doctor-couple Dr. Raj Kishore Prasad and Dr. Hemrani Devnath.\n\nThey stated that criminals had demanded Rs. 10 lakh from them.\n\n“These are litmus tests for the Chief Minister. A BJP delegation will also meet Governor Ram Nath Kovind soon to seek his intervention in checking the spiralling crime,” said Mr. Modi.", 
    "section": "national", 
    "title": "Nitish a helpless CM: BJP", 
    "subsection": "general", 
    "date": "2016-01-20"
}