{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "One reason I stayed in Muslim colony is relate with my youthful days, says Omkar Razdan\n\nOmkar Razdan has taken up voluntary work after coming back to the Valley. He says his Muslim neighbours do not allow politics to interfere in their personal relations.— PHOTO: SPECIAL ARRANGEMENT.\n\nA Kashmiri Pandit couple is back in the Kashmir Valley. What makes the return of Omkar Razdan (70) and Vijay Bazaz Razdan (65) unique is they refused to take the Prime Minister’s package. Instead, they preferred to move to a Muslim neighbourhood.\n\nOmkar Razdan and Vijay Bazaz Razdan, son-in-law and daughter of the widely-read Kashmiri Pandit, Prem Nath Bazaz, have constructed a three-storey house in the Muslim-majority Humhama colony of Srinagar to dispel the myth that the two communities cannot live together.\n\n“It was a conscious decision not to live in a separate settlement or colony, as it goes against the idea of Kashmiriyat. Kashmir was an abode of communal harmony when the minorities were attacked in 1947 in other parts of India. Not a single Pandit was killed or displaced then,” said Mr. Razdan.\n\nMr. Razdan said he grew up listening to folklores on Hindu-Muslim harmony. The couple has named the house Noor Augur (Spring of light), to relive the past.\n\n“We travel by public transport in Srinagar. We get a warm feeling. I leave my keys with my Muslim electrician when I travel to New Delhi,” said Mr. Razadan, who has authored the book, Trauma of Kashmir and Untold Realities .\n\nA retired chief engineer, Mr. Razdan was moved by the efforts of his Muslim neighbourhood to rescue him and his wife in the floods of 2014. “It may be astonishing but I chanted Islamic verses as Muslims chanted ‘Har Har Mahadev’ in our joint effort to escape the floods,” he recalled.\n\nHis wife said she was moved by the verses she hears every morning from a nearby mosque. “It is so soothing. When we introduce ourselves as Pandits, we are offered free vegetables and grocery at times. This is not possible anywhere else,” she said.\n\nThe duo has taken the political reality of Kashmir in its stride to realise the dream of living and dying in the Valley. “On the walls of the mosque, we see the words ‘Go India, Go back’ but the locals do not allow politics to interfere in our personal relations,” said Mr. Razdan.\n\nThe mass migration of Pandits in 1990 was engineered by “fringe elements,” according to him. “Till date no expert has established that an entire community was behind Pandits’ migration. I believe some were used as compulsive tools,” he added.\n\nThe dream to construct the house was realised after Ms. Razdan refused to sell her 10 marlas of land in the Valley. “One reason I stayed in the Muslim colony was my desire to relate with my youthful days,” said Mr. Razdan, who is planning to open up his house’s attic to a computer centre for the economically weaker sections.\n\nHe is a frequent visitor to temples of Ganpatyaar in the old city and Kheer Bhawani in north Kashmir’s Tulmul temples. “I have requested my wife to conduct my last rites in Kashmir,” said Mr. Razdan.", 
    "section": "national", 
    "title": "Pandit couple returns to Muslim neighbourhood in Kashmir", 
    "subsection": "general", 
    "date": "2016-01-20"
}