{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "The Parliamentary Standing Committee took cognizance of activist Smita Chakraburtty’s write-up in the Frontline on survey on jails.— Photo: Dhirendra Nirala.\n\nKolkata-based human rights activist Smita Chakraburtty has been asked to analyse parts of a voluminous survey-report on the appalling condition of Bihar’s prisons for a Parliamentary Standing Committee.\n\nMs. Chakraburtty will appear before the committee on January 21 to explain the condition of the “legal aid clinics...and conditions of undertrials” in jails of Bihar. She was commissioned to survey all the 58 prisons of Bihar by Justice V. N. Sinha, the retired judge of Patna High Court, who earlier said “prison inspection can open a can of worms.”\n\nThe 1,800-page survey on the appalling condition of Bihar’s jails was published by Bihar State Legal Services Authority (BSLSA). A report on the survey was first reported by The Hindu on November 9. However, the Committee took cognizance of Ms. Chakraburtty’s write-up in the Frontline in January, based on the original report.\n\nIn a letter to Ms. Chakraburtty, the Parliamentary Standing Committee on Personnel, Public Grievances, Law and Justice has said they were reviewing the legal aid under National Legal Services Authority [NALSA] and the committee is “in the process of interacting/ seeking feedback from State Legal Service Authorities of different States.” The Committee will also take feedback from the Legal Service Authority of Bihar. Earlier, the National Human Rights Commission issued a notice to the Bihar government, on the basis of the report.\n\nIn distress\n\nMs. Chakraburtty stated in her survey report that at least 2,799 prisoners are “in need” of legal aid. She interviewed 30,070 prisoners in 58 jails, including 26 terminally ill and 102 mentally challenged. The number of prisoners in need of medical attention was 176, the report stated. Besides custodial torture and denial of justice, the report focuses on the physical condition of the inmates, the condition of juveniles and aged prisoners.", 
    "section": "national", 
    "title": "Rights activist asked to study report on Bihar jails", 
    "subsection": "general", 
    "date": "2016-01-20"
}