{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "He had questioned the opposition to Modi’s visit to Sivagiri Madhom in 2013\n\nThe Supreme Court on Tuesday stayed disciplinary action taken by the UDF-led Kerala government against a senior IAS officer for publishing an article lamenting the opposition to the then Gujarat Chief Minister Narendra Modi visiting the Sivagiri Madhom in 2013.\n\nA Bench led by Justice J. Chelameswar gave immediate relief to B. Ashok, who was facing action for “grossly violating all sense of decency and propriety” by publishing the article titled What if Modi Comes to Sivagiri? in the Kerala Kaumudi on April 24, 2013. He was then the Vice Chancellor of the Kerala Veterinary and Animal Sciences University, Wayanad.\n\nIn the English translation of his article placed before the Supreme Court, the author asks: “What is really wrong about BJP leader, Parliamentary Board member and Gujarat CM Narendra Modi visiting Sivagiri?”\n\nMr. Ashok, who was a co-panellist in a seminar Mr. Modi was to address at Sivagiri, argued in his article that “it is indeed true that the 2002 riots in Gujarat were avoidable and the government there did not effectively prevent the killing of innocents.The government set up an inquiry panel, which reported in November 2014 that Mr. Ashok had violated conditions of sanction accorded to him by the Chancellor to publish literary and technical works. The report also concluded that he had violated the All-India Service (Conduct) Rules and recommended action under Section 153-A (promoting enmity between different groups on grounds of religion, etc) of the Indian Penal Code.\n\nThe Kerala High Court in August 2015 upheld the State’s jurisdiction to initiate disciplinary proceedings against Mr. Ashok on the ground that his appointment as V-C was on deputation.\n\nHe questioned the opposition to the PM’s visit to Sivagiri Madhom in 2013", 
    "section": "national", 
    "title": "SC stays Kerala action against IAS officer", 
    "subsection": "general", 
    "date": "2016-01-20"
}