{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "The Bihar government on Tuesday decided to impose a Rs. 20,000 fine on students caught cheating and send parents or relatives found helping them in the act to jail. The government has taken a few other pre-emptive measures as well to check cheating in board exams for Std. X and XII, scheduled to be held in February and March.\n\nLast year, a photograph showing parents, friends and relatives clinging to un-plastered wall and windows of a four-storey building in Vaishali to help students writing their exams there caused a huge embarrassment to the State government.\n\n“This time we are determined not to allow something like that to happen again and have taken several decisions to ensure a cheating-free exam… cheating will not be tolerated this time,” State Education Minister Ashok Chaudhury told The Hindu . This year, about 15 lakh students will appear for the Std. X and 14 lakh for the Std. XII Board exams in the State.\n\nChairman of the Bihar School Examination Board (BSEB), Lalkeshwar Prasad Singh, told journalists that students caught cheating would be fined Rs. 20,000 and barred from taking the exam again for three years. Earlier, the ban was only for a year.\n\n“Section 144 will be imposed around the exam centres and parents, relatives, friends or anyone caught helping the students by passing chits will be sent to jail. CCTV cameras will be installed in all the examination centres,” said the BEB chairman. Live stream from some exam centres with a tainted record will be monitored by senior officers.\n\nMore security personnel armed with modern gadgets would be deployed at the exam centres this time. “All district SPs and DMs have been informed of the decisions taken by the government… They have been asked to impose section 144 at the centres an hour before the exam,” Mr. Singh said.", 
    "section": "national", 
    "title": "Students to be fined Rs. 20,000; jail for parents caught helping", 
    "subsection": "general", 
    "date": "2016-01-20"
}