{
    "author": [
        "Ramya Kannan"
    ], 
    "text": "India continues to be at the top of the table\n\nConcerned over the slow rate at which stillbirths have reduced across the world, missing a specific Millennium Development Goal target, the journal, The Lancet, has launched a series of five papers about ending preventable stillbirths and kick-started a campaign along with the London School of Hygiene and Tropical Medicine.\n\nAn estimated 2.6 million third trimester stillbirths occurred in 2015 across the world, or as one of The Lancet articles in the series says, “That’s roughly the population of Rome, wiped out.” Most stillbirths (98 per cent) occur in low and middle income countries, The Lancet paper shows.\n\nWhile the estimates for the causes of stillbirths are often frustrated by various classification systems, in 18 countries with reliable data, congenital abnormalities account only for a median of 7.4 per cent of stillbirths. Many disorders associated with stillbirths are potentially modifiable and often coexist — maternal infections, non-communicable diseases, nutrition, lifestyle factors and maternal age older than 35 years. Prolonged pregnancies, when the baby is not born after 42 weeks of gestation, contribute to 14 per cent of stillbirths. Causal pathways for stillbirth frequently involve impaired placental function, either with growth restriction, or preterm labour or both.\n\nThe journal points out that less than 5 per cent of neonatal deaths and even fewer still births are registered. A paper calls for maintaining meticulous records of all births and deaths (maternal and foetal) in order to increase the availability of data, rationalising that while data alone will not help save lives, it would certainly indicate a way to target interventions to reach more than 7,000 women every day worldwide who experience the reality of stillbirth.\n\nNotably, it was in 2011, that The Lancet began its first series on stillbirths, highlighting the rates and causes of stillbirth globally, exploring cost-effective interventions to prevent stillbirths (as well as maternal and neonatal deaths), and setting key actions to halve stillbirth rates by 2020. One of the papers notes that some progress has been made in the measurement of stillbirths since the 2011 The Lancet Stillbirths Series. Stillbirths are increasingly counted, which might be partly related to more visible estimates. India continues to be at the top of the table in the rank for numbers of stillbirth in 2015, recording 5,92,100, followed by Nigeria, Pakistan, China and Ethiopia. Cultural taboos and superstitions often take the blame in the case of stillbirth — in a recent study, 36 per cent of respondents blamed the mother for her lifestyle or diet, 29 per cent said the baby was never supposed to live and 25 per cent blamed it on witchcraft or evil spirits.\n\nThe stillbirth series sets out to show the need for increased awareness, opening up the dialogue at policy and community levels, giving women adequate healthcare — from before conception to after birth— and calling for accountability for targeted interventions. And all this would be possible only if there is political determination to reduce the number of lives lost to zero, the paper says.", 
    "section": "national", 
    "title": "The Lancet turns spotlight on ending preventable stillbirths", 
    "subsection": "general", 
    "date": "2016-01-20"
}