{
    "author": [], 
    "text": "An artist works on a facsimile at the future international cave arts museum, Lascaux IV, at Montigny-Lascaux in France.— Photo: AFP\n\nAn army of artisans have laid down their paintbrushes, chisels and pigments after three years of painstaking work to create a true-to-life replica of renowned Stone Age cave paintings long hidden away in southwestern France.\n\n“Absolutely all the work you see on the wall has been engraved, worked and sculpted, chiselled by hand, with little paintbrushes and sometimes even tools used in dentistry,” said Francis Ringenbach, the artistic director of the project to replicate the 18,000-year-old Lascaux cave paintings.\n\nThe meticulously faithful copy of what has been dubbed the “Sistine Chapel of prehistoric art” is now ready to be transported one segment at a time — 46 all together — and installed just down the road from the original at a site semi-buried in a hillside in Montignac, in the Dordogne region.\n\nThe International Centre of Parital (rock wall) Art, 150 metres long and nine metres high, designed by Norwegian architectural firm Snohetta, will open by the end of the year.\n\nThe nearly 2,000 Upper Paleolithic wall paintings depicting rhinos, horses, bison, deer and panthers make up Europe’s most important collection of prehistoric art and were inscribed on UNESCO’s World Heritage list in 1979.\n\nThe caves, discovered in 1940 by four teenagers, quickly became a massive tourist draw, with around a million people flocking to see the work of the oldest known modern humans, who came to Europe from Africa via Asia.\n\nAuthorities closed them to the public in 1963 out of concern over the danger posed by humans to the delicate micro-climate.\n\nA limited set of reproductions have been on display in Montignac since 1983, while Chicago’s Field Museum hosted the first exhibit outside France of copies of the paintings last year titled “Scenes from the Stone Age”.\n\nThe 57 million-euro ($65 million) project to replicate the entire set has married cutting-edge technology with a desire for the utmost authenticity in the reproduction.\n\nRingenbach, himself a sculptor, says the need to be as faithful as possible to the original slowed the team down.\n\n\"Sometimes one has to spend hours reproducing just 10 square centimetres (1.5 square inches),\" he says.\n\nChief painter Gilles Lafleur said of the original works: “We try to understand them and why they were painted this way.” — AFP", 
    "section": "national", 
    "title": "To draw like prehistoric man is not easy! Ask these artists", 
    "subsection": "general", 
    "date": "2016-01-20"
}