{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Stills from the film Gaya Jamana Pitne Ka (My days of taking a beating are over), one of the documentaries made by children of sex workers screened at a film festival in Kolkata.— Photos: Special Arrangement\n\nChildren of sex workers give a masterly screen portrayal of their life\n\n“I have a doll, but I am not going to get her married,” says 10-year-old Saleena Khatoon in the film Gaya Jamana Pitne Ka (My days of taking a beating are over). The short film, made by Saleena, has won the best film award in a unique film competition, titled “Film Festival in a Box”.\n\nTwenty-five short films made by children of sex workers from Delhi, Bihar and West Bengal in the competition have created a sensation among documentary film-makers and the audience.\n\n“I cannot make such films; neither can documentary film-makers like Anand Patwardhan and Sanjay Kak. This is pure documentary ... The children have created a new genre,” Ranjan Palit, award- winning documentary film-maker, told The Hindu .\n\nMr. Palit, who has been a judge in the competition, says, “What is more to say when a 10-year-old girl playing with doll says she does not want to get the doll married as she will be beaten up after marriage.”\n\nThe films, screened at Max Muller Bhavan on Tuesday, include Anadhadhund Raid (Unending raids) and Yeh Kaisi Paramapara (What kind of tradition is this). They are mostly the stories about the surroundings these children grow up.\n\nThe jury includes Aruna Vasudev, editor-in-chief, Cinemaya, and Shailaja Kejriwala of Zee TV. Not only Mr. Palit but other members of the jury are also equally charmed by the films. They have pooled their own resources to award each of the 25 children who are behind every film.\n\nThe short films are a result of the initiative taken by Apne Aap Women Worldwide India Trust and Alliance Francaise du Bengale. The children were made to attend a workshop to learn the use of a camera and other visual tools to tell their story.\n\n“For an anti-trafficking organisation as ours, these films are an attempt to start a dialogue between what we call the last girl — marginalised, living in remote parts of the country in abject poverty — and the first girl — who has access to everything that a child needs to grow up,” Ruchira Gupta, founder and president of Apne Aap, said.\n\nTo be screened in schools\n\nStephane Amalir of the Alliance Francaise du Bengale said the idea was to give children tools to tell their story and the project had been successful. The films will be screened in at least 10 schools in the city, he added.\n\nWhile Mr. Palit is ready to give his national award money and camera equipment for the children to learn the craft of film-making, Ms. Gupta said that many including Vishal Bharadwaj and novelist Kunal Basu were keen on meeting the children and watch these films.", 
    "section": "national", 
    "title": "When they turned camera inwards", 
    "subsection": "general", 
    "date": "2016-01-20"
}