{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Swaraj Abhiyan leader Yogendra Yadav on Tuesday said the possibility of their organisation floating a political party ahead of Punjab Assembly elections, which are due in early 2017, cannot be ruled out if its internal goals are achieved by that time.\n\n“I don’t rule out the possibility of launching a political party. We would want to. This is what Swaraj Abhiyan is about. However, before that, we have to achieve our benchmarks we have set for ourselves,” Mr. Yadav told The Hindu .\n\nWorking quitely\n\nSwaraj Abhiyan, a group formed by ousted AAP leaders Mr. Yadav and Prashant Bhushan and their supporters have been quietly working across Punjab to strengthen their outfit, especially among farmers in an attempt to garner support.\n\nMr. Yadav said Swaraj Abhiyan was in principle a political movement and was committed to alternative politics, but the reason why the organisation was not a political party yet was because it was in the process of achieving its goals that primarily included a set-up for internal democracy, transparency mechanism and critical mass.\n\n“We are yet not there. Many steps are being taken but it would take some time as we don’t want to be a one-State organisation. Once we achieve our internal goals, we will launch a political outfit,” he said, pointing out that if internal benchmarks were achieved before the Punjab elections, there would be no denying of formation of a political party and providing people with an alternative.\n\nIn Punjab, the Swaraj Abhiyan is already politically active and has extended its support to Bhai Baldeep Singh, who is contesting as an Independent candidate for Khadoor Sahib Assembly polls to be held on February 13.\n\n“Punjab is desperately looking for a change, but there’s no genuine alternative,” said Mr. Yadav.Punjab is desperate for change, says Yogendra Yadav", 
    "section": "national", 
    "title": "Yogendra Yadav hints at new party", 
    "subsection": "general", 
    "date": "2016-01-20"
}