{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As many as 1,172 booths have been set up across the district ahead of intensified Pulse Polio immunisation drive, scheduled on Sunday (January 17). With necessary arrangements in place, the district administration has geared up to organise the drive in coordination with the Health department. Under the drive, 1, 51,672 children in the age group of zero to five years would be administered polio drops, City Health Officer, Tuticorin Corporation, Pradeep V. Krishnakumar told The Hindu here on Saturday.\n\nA total of 24, 901 children would be covered during the first phase of Pulse Polio immunisation drive under Tuticorin Corporation limits, where 59 booths were in existence. Apart from stationary booths, transit booths would also be functional at Thoothukudi old and new bus stations, railway stations at Keelur and Melur here, Kovilpatti, Tiruchendur and also near toll plazas and check posts. Seven supervisory teams had been deployed.\n\nFurther, Dr. Krishnakumar said additional care would be given to slum dwellings that were identified as high risk areas. Apart from doctors, staff of departments of Social Welfare, Education, Integrated Child Development Services, Transport, volunteers from educational institutions and voluntary organisations would render services during the drive. Each of the booths would be manned by staff of Health and ICDS departments along with volunteers. After polio drops were administered to the children, the health care professionals would conduct a door-to-door check on Monday and Tuesday to cover those children, who had missed the Pulse Polio drive. On subsequent days till Saturday, the Health staff would check for houses marked ‘X’ to ensure that all targeted children were covered.\n\nThe City Health Officer said the last case of polio in Tamil Nadu was reported from Tenkasi in Tirunelveli district in 2004. A nomad community child was the victim. On January 13 in 2011, a polio case was last reported from Howrah district of West Bengal. India as well as World Health Organization’s South East Asia region was certified as ‘polio free’ on March 27, 2014 by Regional Certification Commission for Polio Eradication. But still, Pakistan and Afghanistan had cases of indigenous polio transmission. Pakistan and Afghanistan had reported 49 and 17 cases respectively during 2015, he said.", 
    "section": "national", 
    "title": "1,172 booths set up in Thoothukudi for Pulse Polio immunisation drive", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}