{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Charges of Dalit discrimination and neglect seem to be common in many southern districts of Tamil Nadu. But, in Thirunalkondacheri hamlet of Nagapattinam district, Dalits have been fighting with authorities for four decades to get a burial ground .\n\nIn the absence of the burial ground, the Dalits have been facing several problems that a few months ago, the issue snowballed into a major law and order trouble and posed threat to some of their lives.\n\nEvidence, an NGO, from Madurai, visited the hamlet recently after trouble arose over burial of a senior citizen belonging to the community. Finally, the police themselves took the body and buried it.\n\nSpeaking to The Hindu , Evidence executive director A. Kathir said that in the event of a death in the hamlet, the body had to be cremated near an ‘odai’ (small stream) earmarked by the Vazhvur panchayat. And to reach the ‘odai,’ the villagers had to carry the body for about three km after passing through cultivable lands.\n\nDuring crop seasonpassing through the fields was cumbersome. The owners too objected to the movement across their fields. Similarly, when during the rains, the fields turned slushy.\n\nSo, the villagers petitioned the district administration to provide them a space or allow them to carry the body through the main street to reach the burialground near the ‘odai.’ As the caste Hindus objected to Dalits passing through their dwellings, they were forced to use the agricultural fields, Mr. Kathir said.\n\nOn November 26, 2015, when Kunjammal (85) died, the body could not be carried through the fields as it was heavily raining.\n\nThe caste Hindus objected to the Dalits carrying the body through the main street.\n\nApprehending trouble, the police, instead of taking action against the threat from caste Hindus, compelled the Dalits not to use the main road. They even went to the extent of registering cases against the Dalits for causing disturbance to law and order, Mr. Kathir alleged.\n\nRecently, 70 policemen and officers were deployed ‘under the guise of’ law and order maintenance at the hamlet where about 40 Dalit families lived. The government should immediately register cases against the officers under SC/ST Prevention of Atrocities Act. Compensation should be given to the Dalits and a burial ground should be earmarked immediately.\n\nThe prime reason for such exploitation of Dalits was poor economy. Therefore, they should be given skill-based training and rehabilitated, Mr. Kathir said.\n\nNGO visits Thirunalkondacheri where Dalit discrimination continues", 
    "section": "national", 
    "title": "A 4-decade battle for burial ground", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}