{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Theatre owners are frustrated as they have been forced to accommodate these films by reducing the number of shows.\n\nFour Tamil movies – Sivakarthikeyan’s Rajini Murugan , Bala’s Thaarai Thappatai , Vishal’s Kathakali and the Udhayanidhi Stalin’s starrer Gethu – all with reasonable box-office pull were released on Pongal day leaving theatre owners and distributors frustrated as they have been forced to accommodate these films by reducing the number of shows.\n\nWhile cities such as Chennai and Coimbatore have multiplexes to provide adequate number of screens, tier-II cities have had to choose between one or the other film.\n\nDespite the apparent overcrowding at the box-office, Abirami Ramanathan, a leading distributor and exhibitor in Chennai, says that movies have been accommodated adequately. “All movies are running almost to full houses because of the Pongal weekend. We will know what movies are dropping out only on Monday. But as of now, all movies are doing reasonably good business,” he says.\n\nWell-known distributor Tirupur Subramanian, who is based in Coimbatore, says that Rajini Murugan has managed to get a lion’s share of the screens throughout Tamil Nadu. “As on January 16, Rajini Murugan is the clear winner. It has released in almost 60 screens out of the 150+ screens in Coimbatore area. The rest of the screens have been divided almost equally between Thaarai Thappattai, Kathakali and Gethu ,” he says.\n\nThough Thaarai Thappatai has received an ‘A’ certificate and is being labelled violent, it seems to be holding on to its second position. “ Rajini Murugan will do well because it is an entertainer, but Bala’s movies also have their share of audiences,” says Mr. Subramanian.\n\nRajini Murugan seems to be doing well in the Chennai area as well, says Rakesh Gowthaman, MD of Vettri Theatres in Chromepet. However, he says that the decision to release four movies together was a bad strategy.", 
    "section": "national", 
    "title": "A tough time for theatre owners, distributors", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}