{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Undeterred by the chilly weather tourists from Tamil Nadu, Karnataka, Kerala, and Andhra Pradesh are thronging the hill station of Yercaud, known as poor man’s Ooty, in all sorts of vehicles, from Thursday evening.\n\nThe spurt in the arrival of tourists has brought much cheer to the local traders, who were complaining of poor business in the last two months. The absence of the winter flower show, which proved a big hit in the past, also dampened the spirit of both the tourists and local traders alike.\n\nThe boat house at the entrance of the hill station is the major attraction for the tourists.\n\nAll the motor fitted boats and those with pedals have been in good demand. A long queue was seen at the ticket issuing counter of the boat house much before it opens by 9 a.m.\n\nAll the boats remain busy till the evening hours, say the tourism department sources.\n\nThe Kiliyur water falls about 3 km from the town is another major attraction. The Deer Park, and the Anna Park near the boat house, Zoological Park, Pagoda Point, Lady's seat, Gent's seat, sun rise view point, botanical garden, Karadiyur point too saw huge crowds. For the devotees, the Shervaroyan Temple and Annamalaiyar Temple, both about 8 km away from the town, are Murugan Temple are the favourite spots once reaching Yercaud. Some of the tourists prepared sweet pongal and offered worship at the temples on the Pongal day.\n\nThe arrival of heavy number of vehicles and the haphazard parking led to frequent traffic bottlenecks everywhere.\n\nThe Yercaud panchayat should create adequate parking lots, which will help the local body to earn revenue too, say S. Karthikeyan, a taxi car driver of Erode, who regularly transport tourists to Yercaud.\n\nTo regulate the crowd and check the activities of anti-social elements, the police had deployed additional personnel at different points. They will remain at the hill station till Monday morning.\n\nAll the lodging houses and the private guest houses at the hill station are brimming with tourists. 'No room till Sunday night' boards are displayed by all these houses.\n\nThe Mettur Dam is another tourist spot thronged by the people. The park near the dam site is the favourite spot besides the dam and the River Cauvery since Thursday evening.\n\nThe Mookaneri Lake, and the mini zoo in Salem saw a heavy rush of visitors. Tourists from outside the state were busy buying sugar canes. Taking advantage of the good demand, some of the traders raised the price to Rs. 120 from Rs. 70.", 
    "section": "national", 
    "title": "Accommodation not available in Yercaud", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}