{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mrinalini Singh, a research scholar, has been awaiting her provisional certificate for the past few months. She has been regularly checking with her college, Nirmala College for Women, but the wait continues.\n\nThe reason: there has been no reply from the Bharathiar University that has been without a vice-chancellor since the then Vice-Chancellor James Pitchai demitted office in September 2015.\n\nThe University’s Tamil Department has got UGC funding for a project to study dialects and record cultural traits of tribes in Western Ghats but the work is yet to begin as it has not got the vice-chancellor’s approval.\n\nThese are just two of the many academic works that are pending as the institution has been without a leader. On the administration front, the University has been unable to buy high-value items because the Purchasing Committee has not met and for it to meet there has to be a vice-chancellor, says N. Pasupathi, General Secretary, Association of University Teachers.\n\nThe University is now governed by a three-member committee that has the Tamil Nadu Higher Education Secretary as the convenor and two Syndicate nominees as members. The committee looks after only the day-to-day functioning or emergency needs and it cannot take policy decision, says a member. The University, even for its day-to-day needs, faxes the Secretary, who clears it from Chennai. Everything else is kept pending, say University sources.\n\nThe Secretary is the convenor of not only the committee of the Bharathiar University but also half-a-dozen institutions in the State and that is leading to a degeneration in the quality of higher education in the State, PMK founder-president S. Ramadoss has criticised in a statement.\n\nAlleging that there has been no transparency in selection of vice-chancellors, he wants to know what is delaying the Government.\n\nAnd, this situation is unprecedented in Tamil Nadu as eight vice-chancellors’ posts are vacant, he points out.\n\nIn the Bharathiar University, this has impacted among others students who passed out of the University in April-May 2015 as they are yet to get degree certificates. And they have not got degree certificates because there is no vice-chancellor to sign those, Mr. Pasupathi points out.\n\nFormer Vice-Chancellor S. Sivasubramanian says that the lack of leadership will reflect poorly on the University’s research capabilities as only the V-Chancellor can lead from the front. In the absence of right leadership there can be no right ambience for research or teaching and learning and at present the University is in doldrums.\n\n‘The University is now governed by a three-member committee, and it cannot take policy decision’", 
    "section": "national", 
    "title": "Administrative work at Bharathiar University hit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}