{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Activists question the fact that leaders within the party have backed anti-jallikattu campaign\n\nThe BJP’s strategy of accusing animal rights groups of being part of an international conspiracy to wipe out indigenous bull breeds by banning jallikattu seems to have backfired, with activists questioning the fact that leaders within the party have also backed anti-jallikattu campaign. They ask why the party had not named such organisations openly backed by BJP leaders involved in the campaign.\n\nOver the past week, the BJP trained its guns on People for Ethical Treatment of Animals (PETA) India, charging the organisation and few others with being the “puppets” of an international conspiracy to target indigenous bull breeds. This argument has gained traction on social media and has been shared widely on Facebook and Twitter. The premise of this salvo was that jallikattu sustains the bulls and thereby organic farming and banning the event will eventually render the bulls extinct.\n\nHowever, animal rights activists are taking the BJP head on. Founder of the People for Cattle in India, G. Arun Prasanna, says the party was being selective in targeting animal rights groups and has thereby “exposed” its double standards.\n\nAccording to Mr. Prasanna, organisations which have senior BJP leaders as members have opposed the sport in the Supreme Court. In particular, he pointed to People For Animals (PFA), the chairperson of which is Union Minister Maneka Gandhi. This was one of the groups that sought the stay on January 7 notification of the Centre allowing jallikattu. “So is the PFA, which has taken a principled stand against cruelty to bulls, also part of a conspiracy?” he questioned.\n\nThis apart, known RSS sympathiser and animal rights activist Radha Rajan, who headed Vigil, an intellectual forum sponsored by the RSS, for many years, has been in the forefront of the battle against jallikattu.\n\nPFA trustee Ambika Shukla said the Tamil Nadu BJP’s accusation was laughable. “We are an indigenous organisation and are fighting for the protection of these bulls from cruelty. As an NGO, we are fighting for a cause that is not too popular and which the mainstream will not take up,” she said.\n\nMeanwhile, the blame game between the BJP and the Congress has heightened. Speaking to reporters, Congress spokesperson A. Gopanna hit out at the BJP for calling former Union Minister Jairam Ramesh a puppet in the hands of international organisations.\n\n“We all know what the position of Ms. Maneka Gandhi on the jallikattu issue is. Will Tamil Nadu BJP leaders target their own Union Minister now?” he charged. The accusation was echoed by TNCC president E.V.K.S. Elangovan in an interview he gave to a Tamil television channel recently.\n\nReacting, BJP national secretary H. Raja said the party’s fight was against PETA, an international organisation. Also, he said Mr. Ramesh openly insulted Tamils by calling the sport “barbaric”. Senior BJP leader L. Ganesan said the view of the Centre has to be gauged by the statement of the Ministry concerned. “The Environment Ministry is sincere in its attempts to bring back jallikattu whereas it was Mr. Ramesh who banned the sport when he was handling the Ministry,” he said.\n\n‘Will Tamil Nadu BJP leaders target their own Union Minister Maneka Gandhi now’", 
    "section": "national", 
    "title": "Animal rights groups pounce on BJP", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}