{
    "author": [
        "S Prasad"
    ], 
    "text": "An arrack and toddy shop remains open at Coundampalayam and a meat shop doing business on Gandhi Market in Puducherry on Saturday despite orders by the government to close it on the occasion of Thiruvalluvar Day.— Photos: S.S. Kumar\n\nMeat shops remain open with scant regard for LAD order\n\nDespite an order of the Excise Department banning the sale of liquor on Thiruvalluvar Day, a section of arrack and toddy vendors in the city brazenly violated the norms and remained open doing brisk business.\n\nArrack and toddy outlets at Coundampalayam in Thattanchavady and rural areas of Bahour and Thirubhuvanai flouted the norms and remained open due to the apathy of Excise and police departments.\n\nWhile arrack outlets on Vazhudavur Road had downed their shutters, arrack and toddy was clandestinely sold in plastic sachets through a small opening at the rear to customers who had thronged the venue from early morning.\n\nIrked by the violation, CPI activists led by Sethu Selvam, State executive committee member, gathered in front of the arrack outlet at Coundampalayam.\n\nMr. Selvam said that clandestine sale of arrack and toddy was going on a Dry day with the full knowledge of the police and Excise departments. Although we informed the jurisdictional police they failed to take any action against the violators.\n\nThe residents have been demanding the relocation of the arrack shop in Coundampalayam for several years but the authorities paid no heed, he said. Similarly, meat shops in Puducherry and Oulgaret municipalities remained open despite an order of the Local Administration Department banning the sale of meat. Meat shop owners in Orleanpet, Mudaliarpet, Nellithope, Thattanchavady, Reddiyarpalayam, Pillaichavady and Bahour carried on with their business as usual paying scant regard to the Government order.", 
    "section": "national", 
    "title": "Arrack vendors flout government ban on liquor in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}