{
    "author": [
        "S Poorvaja"
    ], 
    "text": "They offer healthy alternatives and promote good eating habits\n\nchools affiliated to the Central Board of Secondary Education(CBSE) are now complying with instructions in a recently-issued circular, which enjoins them to ensure no junk food is provided or sold on the premises.\n\nStating their schools had already implemented the ‘No Junk Food rule’ on campuses, heads of CBSE institutions in the city, however, welcomed the present move.\n\n“In school, we have a standard system in place in which breakfast, lunch and an early evening meal are provided from our school kitchens which have the benefit of the services of a dietician who ensures that the meals are nutritious,” said S. Amudha Lakshmi, principal, Chettinad Vidyashram School. However, she added: “we have no control on what the students purchase from the shops around the campus. But, we are sensitising them to the dangers of consuming junk food,” said S. Amudha Lakshmi, principal, Chettinad Vidyashram School.\n\nSensitising students, parents\n\nLakshmi Srinivasan, principal of P.S. Senior Secondary School, said that while their canteen did not stock up on junk food, the faculty has been asked to speak to parents and students about right eating habits whenever necessary.\n\n“Teachers who look after primary classes, in particular, have been asked to observe what the students bring to school and speak to their parents if they bring junk food,” she said.\n\nThe SBOA School and Junior College in the city underwent a change with regard to their canteen, two years ago, after the school correspondent Thomas Franco Rajendra Dev and Management decided to stop the sale of junk food and bakery items on the campus.\n\n“We now have people who come and cook healthy food on the campus and the menu includes options such as Ragi puttu and sundal varieties as well as fresh juices and buttermilk,” said the school Principal Radhika Unni.\n\nList of foods\n\nThe circular is based on a report prepared by a working group constituted by the Ministry of Women and Child Development (MWCD) on the consumption of foods High in Fat, Salt and Sugar (HFSS) and the promotion of healthy snacks in schools across the country.\n\nThe circular, which states that the consumption of HFSS foods could lead to childhood obesity and a number of diseases, also points out that it affects the cognitive and physical development of children.\n\nIt states that schools should not only ensure that foods such as chips, carbonated beverages, ready-to-eat noodles, pizzas, burgers, samosas, chocolates and confectionaries are not available on campus but also take efforts to ensure that such food is not being made available 200 metres around the campuses.\n\nConsumption of food high in fat, salt and sugar can affect cognitive and physical development", 
    "section": "national", 
    "title": "CBSE schools keep junk food off campuses", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}