{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu Chamber of Commerce and Industry has reiterated its plea to the Union Ministry of Civil Aviation to include Madurai in the Bilateral Airport Treaty with Malaysia, Singapore, Thailand, Kuwait, UAE and other Gulf countries for operating international flights, in the light of inclusion of Tamil Nadu in 'must visit' list of 52 places published by the New York Times (NYT).\n\nIn a statement issued here, N. Jegatheesan, president, and S. Rethinavelu, senior president, said that it was a matter to be rejoiced that Tamil Nadu, with its rich heritage, fine hospitality and world renowned tourist attractions like the Meenakshi Sundareswarar Temple, was placed 24th in the list.\n\nThe rating, the chamber said, was also a boon for the growth of hospitality industry and medical tourism in Madurai and south Tamil Nadu.\n\nAs the State was the only Indian destination to have made it to NYT's list of prime places to be visited in 2016, influx of foreign tourists to the region was bound to multiply during the year.\n\nThe chamber felt that southern districts should capitalise on this golden opportunity and improve their limited infrastructure, especially availability of direct flights to foreign destinations from Madurai, to facilitate hassle-free and swift travel for tourists from abroad.\n\nIt was critical that the Madurai airport should be adequately connected with international destinations, for which it should be included in the Bilateral Airport Treaty of countries like Malaysia, Singapore, Kuwait and UAE, from where airliners had expressed their willingness to operate services to Madurai.\n\nThe chamber thanked the NYT for strengthening its plea to include Madurai in Bilateral Airport Treaty. Madurai being the gateway to south Tamil Nadu, the chamber hoped that the Civil Aviation Ministry would take immediate steps to include it in the treaty with important countries.\n\n“Only a consent and no money is required to change the economic scenario of south Tamil Nadu,” it said.\n\nThe chamber appealed to Chief Minister Jayalalithaa to follow up the matter with the Civil Aviation Ministry to attract more tourists to south Tamil Nadu, which is an industrially backward region. It also wanted the State government to improve and maintain all roads in the region and also take efforts to maintain cleanliness at places of public congregation.", 
    "section": "national", 
    "title": "Chamber plea on bilateral airport treaty", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}