{
    "author": [
        "S Prasad"
    ], 
    "text": "CG Director General meets Chief Minister for consultations on various projects\n\nVice-Admiral H.C.S. Bisht, Director General of Coast Guard, hands over a Coffee Table book on the Indian Coast Guard to Chief Minister N. Rangasamy in Puducherry on Saturday. S.P. Sharma, Inspector General of Coast Guard and S.C. Tyagi, DIG, are in the picture.— Photo: T. Singaravelou\n\nThe Indian Coast Guard is planning to set up an air enclave near the Puducherry Airport in Lawspet to boost aerial surveillance, Vice-Admiral H.C.S. Bisht, Director General of Indian Coast Guard has said.\n\nTalking to reporters after paying a courtesy call on Chief Minister N. Rangasamy in his chamber in the Legislative Assembly on Saturday, Mr. Bisht said the Coast Guard was in consultations with the Puducherry Government for setting up the air enclave.\n\n“We had some good discussions with the Chief Minister. The Coast Guard is also planning a Hovercraft port at Veerampattinam where we can base some of our hovercraft. The Hovercraft port is coming up on an extent of 35 acres and we have to resolve some issues. As of now we are concentrating on the Air enclave and hovercraft port projects,” Mr. Bisht said.\n\nS.P. Sharma, Inspector General of Coast Guard, said that two hovercrafts would be berthed at the facility at Veerampattinam. The Centre has already earmarked two hovercrafts for the Union Territory.\n\nPresently the hovercrafts are parked at Mandapam in Ramanathapuram district in Tamil Nadu due to lack of parking space in Puducherry.\n\nThe hoverport would be ready in two years and would augment the station’s capability of search and rescue operations along the Puducherry coastline.\n\nDeputy Inspector General S.C. Tyagi commander of the Coast Guard Headquarters in Puducherry was present.\n\nHoverport\n\nThe release of 3.45 acres of land at Veerampattinam for the hoverport project signifies a breakthrough for the Indian Coast GuardStation in Puducherry which was upgraded to District Headquarters No.13 in 2014.\n\n“The decks have been cleared for developing a hoverport that would provide staging facilities for our hovercraft fleet, which would be augmented in accordance with the emerging scenario in future,” said Mr. Tyagi.\n\nThe hoverport would significantly strengthen the Coast Guard unit’s sea capabilities and coastal security in this region on the eastern seaboard. To start with, it is proposed to develop staging facilities (seafront ramps) for the two UK-made Air Cushion Vehicles the Coast Guard unit was allotted in 2013 with the help of in-house expertise and possibly engineers of the CPWD, Mr. Tyagi said.\n\nThough the Coast Guard had acquired 20 acres near the seafront, it had been unable to develop sea assets on the site after the 2004 tsunami put pressure on the government to focus on resettlement and rehabilitation of fishermen communities.\n\nWith the government offering relocation as a solution to the deadlock, the Coast Guard has now identified about 28 acres of land in Karuvadikuppam over and above the nearly 16 acres that was due for compensation.\n\nThe Coast Guard has also identified about 35 acres of land in Karuvadikuppam for the Air Enclave project which has been in the pipeline for over three years.\n\nAs the Puducherry Government has enhanced the guideline value of land which is markedly higher than the rates sanctioned for the original proposal by the Government of India, the Coast Guard has been instructed to resubmit the project.", 
    "section": "national", 
    "title": "Coast Guard air enclave planned", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}