{
    "author": [
        "T Madhavan"
    ], 
    "text": "A fire had broken out due to an electrical short-circuit when they were asleep\n\nSt. Thomas Mount Deputy Commissioner of Police P.S.C. Kalyan comes out of the apartment complex on Ram Nagar 8th Street, Nanganallur, in which a fire broke out.— Photo: G. Krishnaswamy\n\nIn the early hours of Saturday, a couple died of asphyxiation caused by smoke from a fire that gutted their first-floor apartment in Nanganallur.\n\nJ. Venkataramani, 45, and his wife Sowmya, 40, who were residents of ‘Suprabath Apartments’ at Ram Nagar 8th Street in Nanganallur, died from the smoke that engulfed their flat after an electrical short-circuit caused the fire, police said.\n\nThe two-storey apartment complex with nine flats did not have fire safety measures in place, the police said.\n\nFamily sources said that when the fire broke out, the couple was sleeping in the living room.\n\nTheir children, Vijayalakshmi, 17, and Chandrashekar, 14, were sleeping in one of the bedrooms. A domestic help, 55, was also sleeping in one of the bedrooms.\n\nOne of the residents of Suprabath Apartments said he saw smoke billowing out a window of Mr. Venkatramani’s flat and alerted the other residents who rushed to the ground floor of the two-storey apartment complex.\n\nA few residents tried to rescue the family, but in vain. On receiving information from the residents, Adambakkam police and fire and rescue services personnel from Guindy rushed to the spot.\n\n“When they broke open the door, the couple was found dead and Chandra was struggling to breathe. They rescued the children and sent the woman to the Kilpauk Medical College Hospital for treatment,” said a senior police official, who visited the spot.\n\n“Though the family members lived on the first floor, they kept the windows always closed. Had they kept the windows open, the suffocation would not have taken place. An electrical short-circuit in one of the miniature bulbs-sets could have triggered the fire, which gutted the wooden furniture. As the fire spread to the plastic doors, immense smoke was generated,” he said.\n\nForensic experts collected samples from the scene of crime and senior police officials, including St. Thomas Mount Deputy Commissioner of Police P.S.C. Kalyan, visited the spot.\n\nMr. Venkataramani was working as Senior Officer (Advertisement-Commercial) with The Hindu .", 
    "section": "national", 
    "title": "Couple dies of asphyxiation in apartment fire", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}