{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "The number one enemy for transplant patients is infection, says a doctor\n\nA few months ago, a patient came to see Georgi Abraham, a nephrologist at Madras Medical Mission. “The woman had undergone a related kidney transplant three years ago, but had a cough, cold and fever. At first we could not identify the infection, but then found that she had a small tear in her lungs. She responded to treatment initially, but then became sicker. After a battery of tests, she is still being treated, but it is difficult,” he said.\n\nInfections are one of the primary causes of death in patients who have undergone transplants, say doctors. With Tamil Nadu leading the country in cadaver organ donations and transplants, doctors in the city are calling for infection control measures: standard guidelines for transplant centres as well as for the State government to set up a lab to monitor and test for infections.\n\n“The number one enemy for transplant patients is infection,” said K.R. Balakrishnan, director, cardiac sciences, Fortis Malar Hospital. The average mortality in the heart transplant cases he has seen, he said, was about 8 per cent after one year, and 90 per cent of these deaths were due to infections.\n\nAt Global Hospitals, Subramanian Swaminathan, infectious diseases consultant, said a study published in 2014 found that of 500 patients who had undergone liver transplants, 12 acquired tuberculosis and needed treatment.\n\nWhen it comes to kidney transplant patients, Dr. Abraham said there were wound infections and urinary infections – some of these can be treated while others cannot. “And since patients are on strong immuno-suppresants it becomes even more difficult to treat them without affecting the organ transplant,” he said.\n\nSo what is needed? “It is important for the government and private sector to come together to set up guidelines on minimum requirements with regard to infection control for transplants,” said Dr. Swaminathan. This would include: minimum standards for all transplant centres, ensuring the transplant candidate is chosen carefully, evaluating and preparing the candidate, infection control at the hospital before, during and after the transplant, guidelines for donor management, and preparing and teaching patients how to live post a transplant, he said.\n\nStandards for centres and for donors and recipients too are important — right now, Dr. Balaksrishnan said, there are no standards established for donor maintenance. This means the donor could have an underlying infection that could be passed on to the recipient. This apart, he stressed the need for a stringent antibiotic control policy. “Antibiotic resistant infections are becoming more common in ICUs and this is because of the ad hoc use of antibiotics,” he said.\n\nA State lab where bacterial, viral and fungal infections in transplant patients could be diagnosed and could be used by all transplant centres would be of immense help, said Dr. Abraham.\n\nN. Gopalakrishnan, head of the Nephrology Department at Madras Medical College, too said early identification of infections was crucial, and a sophisticated centralised lab with facilities for rapid diagnosis of all infections would be helpful.\n\nAlso, patient outcomes should be made public on the State’s transplant website, said Dr. Balakrishnan.", 
    "section": "national", 
    "title": "Doctors call for infection control in transplant patients", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}