{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The outlet in Tiruvanaikovil clocksRs. 40,000 turnover on first day\n\nThe Farm Fresh outlets started by the State government have received good response in Tiruchi.\n\nThe outlets, which were inaugurated by Chief Minister Jayalalithaa through video conferencing a few days ago, are functioning at Chinthamani super market in Puthur, Srinivasa Nagar, Thiruvadi Street in Srirangam, Thiruvanaikoil, Subramaniapuram, Kallukuzhi, and Sundar Nagar. They get fresh vegetables from Thangammapatti in Dindigul district, Thayanur, Somarasampettai, Kovilpatti, Marungapuri, and Nagalapuram in Tiruchi district. The Primary Agricultural Credit Societies (PACS) that act as agent in the respective areas procure vegetables directly from farmers and send them to Tiruchi on a daily basis. Although all outlets are doing well, the outlet in Thiruvanaikoil has topped the list in terms of sales. The first day of the sale touched Rs. 40,000. The vegetables brought from various centres were sold out within a few hours. The first three days saw the sale of 1,200 kg in each day. It rose to about 3,000 kg on Thursday and Friday on account of the Pongal celebrations. Sugarcane and turmeric plants were sold to the customers.\n\nIt is followed by outlets in Srirangam and Chinthamani. The freshness of vegetables and competitive rate than the market and Uzhavar Santhai were said to be the reason for the brisk sale.\n\nHowever, cross sections of customers are of the view that the success of farm fresh outlets could not be measured with the first few days of their existence. It will largely depend on timing of arrival and commitment of employees of the outlets.\n\nStating that vegetables invariably arrived at 8 a.m. to the outlets, they said that the customers intended to buy vegetables between 7 a.m. and 8 a.m. on weekdays. The purpose would be achieved only if the outlets stocked fresh vegetables at the time of opening of outlets in the morning.\n\nK.C. Ravichandran, Joint Registrar of Cooperatives, Tiruchi, told The Hindu that the outlets had made a good beginning. All of them had reported brisk sale. Consumer expectations would be fulfilled. One more outlet would be started within a few days.\n\nSimilarly, arrangements had been made to open farm fresh outlets in Ponnagar, Karumandapam, Kattur, Sembattu, Somarasampettai, and Tiruverumbur to extend the benefit to customers of all regions of the city. It would enable the department to increase the procurement thereby reducing the prices of vegetables further.", 
    "section": "national", 
    "title": "Farm Fresh outlets begin with a flourish", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}