{
    "author": [
        "V S"
    ], 
    "text": "Camp elephant of the Forest Department at Top Slip in Anamalai Tiger Reserve (ATR) being fed with special diet at the Elephant Pongal celebrations on Saturday.— Photo: Special arrangement\n\nThose who visited Top Slip in Anamalai Tiger Reserve and the Mudumalai Tiger Reserve on Saturday had a feast for their eyes -- a line up of elephants as part of the Elephant Pongal celebrations.\n\nAt the Mudumalai elephant camp 11 of the 24 camp elephants participated in the celebrations.\n\nThe Nilgiris District Collector, P. Shankar, Principal Chief Conservator of Forests Raghuram Singh, Field Director of the reserve Srinivas R. Reddy, Deputy Director Chandran, and others led the celebrations.\n\nPongal cooked in pots was fed to the elephants along with jaggery, sugarcane, and fruits. Tourists were happy clicking selfies with the elephants. Two elephants that were missing in action this time were Renga that passed away recently after prolonged illness, and Masini, who is currently at Chadivayal in Coimbatore.\n\nMovement of a wild elephant closer to the camp site kept the officials on their toes. At Anamalai Tiger Reserve, 16 of the 22 camp elephants from Kozhikamudhi and Chinnar camps took part in the celebrations. Deputy Director V. Asokan, and Assistant Conservator of Forests C. Vidya participated.\n\nTribal women cooked pongal in nine pots and fed the elephants along with jaggery, sugarcane, and fruits.\n\nThe elephants, after a puja and feeding, were lined up in the grass lawn near the reception.In Chadivayal forest elephant camp at the foothills of Siruvani in Coimbatore, the Pongal celebrations was organised by Range Officer C. Dinesh Kumar. Sujai (46) brought from Mudumalai, Pari (37) brought from Top Slip, and Masini (8) participated.\n\nAt Mettuppalayam, the 30 elephants at the rejuvenation camp had a gala pongal festival on Friday. Competitions were held for elephants after puja, and feeding.", 
    "section": "national", 
    "title": "Feasts, contests keep elephants busy", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}