{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In most of the cases the victims were drunk: police\n\nFour people were killed and more than 20 injured in at least eight different accidents during Pongal festival on Friday and Saturday in the district, even as the Transport department is celebrating Road Safety Week from January 10 highlighting this year’s theme of “Road Safety – Time for Action.”\n\nTwo days after the Transport department took out a helmet awareness rally, stressing the importance of wearing helmets, four two-wheeler riders were killed in two different accidents at Devipattinam and Uchipuli police limits and in both the accidents the deceased did not wear helmets.\n\nPolice said that M. Raja (32) and M. Arjunan (40) from Venkulam, the rider and pillion rider respectively, dashed against another two-wheeler and died on the spot at Poorakudi in Devipattinam police limits on Friday.\n\nIn the other accident, also on Friday, S. Muneeswaran (21) and S. Nagarajan (18) from Kuyavankudi died after dashing their two-wheeler against a van.\n\nOn the day of Pongal festival alone, nine people were injured in five different accidents and admitted or treated at the Government Headquarters Hospital here, police said. All the five cases involved two-wheelers and the injured rode the vehicle in a rash and negligent manner, police said.\n\nEnquiries revealed that in most of the cases, the deceased and injured were found drunk, police also added.\n\nOn Saturday, 15 people, including two drivers of the State Transport Corporation buses were injured after the buses collided at Achundhanvayal near here, police said. The bus, coming from Rameswaram and bound for Madurai, collided head-on with a government bus from Tirupattur after the driver K. Rajan (55) swerved right to avoid hitting a two-wheeler and dashed against the bus.\n\nBoth Rajan and the other driver, M. Anbu Palaniappan (56), were injured and admitted to the Government Hospital here, police said. Three others, including two school girls, were also admitted to the hospital while 10 others treated as out-patients, police said.", 
    "section": "national", 
    "title": "Four killed, 20 hurt in road accidents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}