{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Dedicated freight container train service by Container Corporation of India and Cochin Port Trust was flagged off byG. Senthilvel, Deputy Chairman of Cochin Port Trust, on Saturday from the Inland Container Depot at Irugur in Coimbatore to Vallarpadam in Kochi.- Photo:S. Siva Saravanan\n\nContainer Corporation of India (CONCOR) and Cochin Port Trust have entered into an agreement to offer container train service from Inland Container Depot (ICD) at Irugur here to ICTT, Vallarpadam, Cochin Port.\n\nThe first service was flagged off on Saturday at Irugur.\n\nG. Senthilvel, deputy chairman of Cochin Port Trust, told The Hindu that on Saturday, 22 TEUs (twenty - foot equivalent unit) was sent from Coimbatore. The train from Irugur will start on Saturdays every week and return from Kochi on Sundays. Cochin Port Trust has assured CONCOR of minimum volume of cargo. Currently, the port handles about 2,000 TEUs a month (export cargo from Coimbatore and imported cargo) for this region.\n\n“Initially, we plan only one service a week. We hope to get minimum 80 TEUs a week, both for export and import, from in and around Coimbatore. If needed, the second service can also be launched,” he said.\n\nExporters in the region will have huge cost advantage when cargo is transported by rail to the port. They have not been using it so far as the train service was not regular. Coir, machinery, garments and tools are some of the products that are likely to be transported by rail from the Irugur ICD to Cochin Port.\n\nConcor and Cochin Port Trust are also studying the possibility of starting a facility in Pollachi to put the containers on the rakes and send it directly to Kochi.\n\nFurther, the port trust is looking at tapping the potential for coastal movement (within ports in the country) of products such as cotton, food grains and even fertilisers, he said.\n\nOne of the forwarding agents here said the ICD at Irugur has several facilities. However, efforts should be taken to encourage and facilitate exporters and importers to use the rail service.", 
    "section": "national", 
    "title": "Freight train service launched from Irugur ICD to Kochi port", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}