{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court is all set to embark on a mega recruitment drive as it has kick-started the process of filling huge number of backlog vacancies as well as 429 additional posts sanctioned by the State Government in May last year right from the level of Sweeper to Deputy Registrar at an expenditure of Rs.11.55 crore.\n\nAs a first step, the Registry has promoted hundreds of employees in the lowest cadre which includes Office Assistant to the post of Reader/Examiner. Further, many Office Assistants have been given double promotion and elevated directly to the post of Assistant since eligible candidates were not available for the post in the feeder category of Reader/Examiner.\n\nHigh Court sources said that double promotion had been given to Office Assistants who had put in service for a long number of years besides completing graduation, even if it was through correspondence course, and denied to those who had obtained degrees through Open University system, without following the 10+2+3 pattern, irrespective of the length of their service.\n\nThe double promotion would place the Office Assistants above existing Readers/Examiners who possessed valid educational qualification but could not be promoted due to non-completion of probation period of two years. Pointing out that the Registry conducted interviews even for promotions, court officials said that there were plans to hold written examinations for granting promotion in the officers’ category.\n\nAfter filling up the vacancies through promotions, the High Court shall go for direct recruitment for various posts and it is expected that most of the vacancies would arise only in the posts of Watch and Ward staff and Office Assistants, a court official said. He asserted that the appointments shall be made in accordance with directions issued by the Supreme Court on February 12, 2014.\n\nIn that judgement, the apex court had expressed concern over “perpetual complaints regarding irregularities and illegalities in the recruitment of staff in the subordinate courts throughout the country” and said: “the judiciary which raises a finger towards actions of every other wing of the society cannot afford to have this kind of accusations against itself.”\n\nThe Supreme Court had directed the Registrar Generals of all High Courts to ensure that every post was filled up by issuing advertisements in at least two widely circulated newspapers, including one in vernacular, besides calling for names from the Employment Exchange. It also clarified that “any vacancy filled up without advertising as prescribed herein shall be void ab initio.”", 
    "section": "national", 
    "title": "High Court to hold recruitment drive to fill staff vacancies", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}