{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Defying the Supreme Court ban, jallikattu enthusiasts of Anbil village near here reportedly conducted the sport on Saturday.\n\nA large number of spectators from Lalgudi, Pullambadi and other neighbouring villages arrived in large numbers to witness the event held after the traditional ‘Mattu Pongal’ prayers. A total of 75 bulls, including 20 specially trained animals from Lalgudi, Kookur, Anandimedu and Anbil, were said to have taken part in the event.\n\nThe temple bull was the first one to be released from an open ground. Other bulls from neighbouring villages were released subsequently. Bull tamers were said to have participated though no regular arrangements such as galleries were made.\n\nAccording to a spectator, a handful of animals gave the bull tamers a tough time. Some bulls ran towards the spectators, who came in large numbers to witness the sport, which is part of Pongal celebrations. However, there was no report of any injury to spectators or the tamers. The event was stopped before the police reached the village from Lalgudi.\n\n“We conducted jallikattu as per our tradition. It is part of the Pongal festival and a spontaneous event,” a village leader told The Hindu .\n\nWhen contacted, a senior police officer said that there was no information about the report of jallikattu held in Anbil. Suriyur and Avarankadu were the two villages known for the sport in Tiruchi district and police pickets have been posted there to prevent the conduct of the sport. Tough action would be taken against those violating the ban, the officer said.\n\nAttempt thwarted\n\nAn attempt to conduct jallikattu was also reported at Rapoosal village near Iluppur in Pudukottai district. About 15 bulls were brought from Annavasal, Iluppur, Rapoosal and Tirunallur villages.\n\nPolice rushed to the spot and persuaded the villagers to stop the event. Even as the police were explaining the ban, a section of villagers reportedly untied a bull belonging to Sri Mariamman temple in front of which the jallikattu was scheduled to be held.\n\nThe bull was, however, brought back to the temple.\n\nMeanwhile, residents of Vairivayal near Aranthangi in the district have reportedly decided to boycott the forthcoming Assembly election in protest against the ban on ‘rekla’ race. The villagers have displayed banners in the village announcing their decision.", 
    "section": "national", 
    "title": "Jallikattu held despite ban?", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}