{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Kalabhairavar puja, Railway Colony, 5 p.m.\n\nSri Meenakshi Sundareswarar Temple: Theppa thiruvizha, fifth-day event, deity procession 9 a.m. and 7 p.m.\n\nSolaimalai Murugan Temple: Thaipusa thiruvizha, third-day event, deity procession, Solaimalai Mandapam, Alagarkoil 10.30 a.m. and 6.30 p.m.\n\nRamakrishna Math: Discourse on “Bhagwan Sri Ramakrishnanarin Vaalvum Vaakkum” by Swami Guruvaranandar, 5.45 p.m., aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nThiruvalluvar Kazhagam: 74{+t}{+h}year celebrations, Kandasamy Pulavar Memorial celebrations, Prof. M. Thirumalai, Vice-Chancellor, Tamil University, Thanjavur, speaks on ‘Indraya Vaazhvil Valluvam,’ North Adi Street, 6.30 p.m.\n\nPaneeru Thirumurai Mandram: Pannisai by S.S. Mohanram, Adi Streets, 7 a.m., Discourse on ‘Peria Puranam’ by N.S. Sundararaman, Sundar Nagar, Tirunagar, 5 p.m.\n\nSri Swami Tatwananda Ashram: Upanishad class by Swami Samanandar, P and T Nagar, 6.45 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nThe American College: Sunday communion service, Dr. Milton Jeganathan preaches, Dr. S. Joseph Wellington leads, Jubilee chapel, 6 p.m.\n\nCULTURE\n\nGandhi Memorial Museum: Yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training, Madura College, 6.30 a.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nGENERAL\n\nCorporation of Madurai: Inauguration of pulse polio programme, Commissioner C. Kathiravan chief guest, Palanganatham bus stand, 7 a.m.\n\nGovernment Museum: Expo of currencies/coins/stamps of 200 countries on display, 10.30 a.m.\n\nJ. Vasanthan Art Foundation: Second annual memorial celebration, Dr. Anuradha Kapur, former director National School of Drama, New Delhi, to be awarded J. Vasanthan lifetime achievement award by G. Srinivasan, president, Govel Trust, Aravind Eye Hospital, Old Natham Road, 5 p.m.\n\nMadurai Philatelists and Numismatists Association: A. Chellavel speaks on ‘Tamil Nadu Hand Mint Coin,’ Victoria Edward Hall, 10 a.m.\n\nPadikkattugal: Fourth-year celebrations, Tamil Nadu Polytechnic campus, TPK Road, 9 a.m.\n\nVidiyal: Ripple circle, Abdul Rahman facilitates, 9 a.m., Tamil forum, Rathinapuram, 2 p.m.\n\nAlcoholics Anonymous: Meeting, Krishna Iyer Hall, 7 p.m., Alfred Noble Matric HSS, Tirunagar, 11 a.m.\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, Melur, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}