{
    "author": [
        "S Senthalir"
    ], 
    "text": "Over 100 delegates from different countries take part in the international conference\n\nParticipants at the special conference of International Movement for Tamil Culture, in Puducherry on Saturday.— Photo: S.S. Kumar\n\n: Tamil-speaking families from across the world on Saturday joined common cause to discuss ways to pass on the legacy of the language and its literature to a generation of youth with little or no access to their mother tongue.\n\nOver 100 delegates from different countries shared a platform under the aegis of International Movement for Tamil Culture on Saturday seeking to enrich and conserve the cultural heritage of Tamil language in countries where the Tamil-speaking population had moved as migrant plantation workers or in search of better prospects.\n\nThough the Tamil-speaking people who were taken to Malaysia, Singapore, South Africa as plantation workers during the British rule they have retained the cultural practices to an extent, the opportunities to read and write Tamil language have dwindled.\n\nEminent scholars and writers present at the two-day international conference felt that with younger generation preferring English or any other language to Tamil language, there was a need to preserve the cultural heritage of Tamil language by making them understand the richness of the classical language.\n\nIn order to revive and address the current challenges, two-day International Conference was organised by the International Movement for Tamil Culture (IMTC), India in association with the Canada chapter on Saturday in Puducherry.\n\nNada R Rajkumar from Canada, a propagandist of the International Movement for Tamil Culture said: “People are willing to learn the language in those countries but there are no good teachers. It is the case in South Africa where they have requested for teachers to teach them the language. We need to reach out to them.”\n\nIn this view, the movement is planning to frame a common syllabus to teach Tamil for the Diaspora Tamils living Australia, Switzerland, South Africa, Canada, Malaysia, Singapore and many other countries across the world. To strengthen the Tamil culture and language, another initiative on the lines of United Nations Organisation is being planned.\n\nNada Rajkumar said that an International Tamil Culture Centre would be established in Kilinochchi in Sri Lanka in 2017. “This will be built on the lines of United Nations Organisation. But, it will take decisions only on issues related to the culture and language. There will be no political discussions held in this centre.\n\nThis will have representatives from more than 160 countries where Tamil-speaking population lives,” he said.\n\nHe added that the cultural centre will be built at the cost of Rs 100 crore.\n\nThe theme of the international conference was on Challenges and Opportunities for Tamil living abroad. About 50 delegates from abroad and 150 delegates from Tamil Nadu, Karnataka and Puducherry are participating in the event. Delegates from Sri Lanka, Canada, US, Germany, France, Switzerland, South Africa and many countries participated.\n\nInternational Tamil culture centre to be built in Kilinochchi at a cost of Rs. 100 crore", 
    "section": "national", 
    "title": "Meet seeks to pass on Tamil’s heritage", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}