{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Maha Kumbabishekam is scheduled to be held on January 20\n\nThe ‘Mudhal Kaala puja,’ performed ahead of Maha Kumbabishekam at Ramanathaswamy Temple, scheduled for January 20, began at 6.30 p.m. on Saturday, marking the commencement of the rituals for the mega event, to be held after a gap of 14 years.\n\nLeading a host of more than 250 ‘Sivachariars’ drawn from various temples in the State, Pichai Gurukal, Chief priest of Pillayarpatti Vinayagar Temple, conducted the ‘Mudhal Kala puja’ at the ‘Parivara yaga salas,’ established by the temple authorities for performing eight ‘kala pujas’ and ‘yagasala pujas’ in 108 ‘yaga gundams.’\n\nAfter ‘Ganapathy homam’ on Friday, the ‘Kaala pujas’ began on Saturday and would go on for the next four days, S. Selvaraj, Joint Commissioner of the temple, said. After conducting the eighth kaala puja on the morning of January 20, the Maha Kumbabishekam would commence at 10 a.m., he said.\n\nThe ‘Parivara yaga salas’ for 47 ‘vediyal gundams’ and the ‘Paradana yagasalas’ for 61 other ‘yaga gundams’ had been established for the consecration ceremony, K. Mayilvahanan, Assistant Divisional Engineer of the temple, said. While performing ‘Kaala pujas,’ the Sivachariars would perform ‘yagasala pujas’ at 108 yaga gundams and the priests would conduct ‘Palayalayams’ at the sanctum sanctorum, he added.\n\nThe temple authorities have announced that pilgrims and devotees would not be allowed inside the temple for worship till the consecration was performed.\n\nAll the 22 holy theerthams inside the temple precincts would remain closed, they said. After the consecration, pilgrims would be allowed to offer worship but the theerthams would be open only from January 21, they said.\n\nSecurity arrangements\n\nMeanwhile, police deployed a minimum strength of about 500 police personnel and launched the security exercise on Friday after installing CCTV cameras at more than 30 strategic locations. “The full strength of more than 1,000 policemen would be in place for two days on January 19 and 20,” Superintendent of Police N. Manivannan told The Hindu on Saturday.\n\nCoastal Security Group and other security agencies have been advised to be on full alert, he said. All vehicles entering the island would be checked at the entry point of Pamban road bridge and no vehicle would be allowed beyond the parking bay at the bus stand, he said.", 
    "section": "national", 
    "title": "‘Mudhal Kaala puja’ begins in Ramanathaswamy Temple", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}