{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A 23-year-old person was murdered during Pongal celebration near the water tank at Santhaikadai, in Kavundampalayam, on Friday night.\n\nThe victim was identified as S. Vigneshkumar (23), of Ashok Nagar near Kavundampalayam. Thudiyalur Police registered a case under section 302 (murder) of the Indian Penal Code and formed three special teams to nab the accused Kuruvi alias Saravanan and Sarath.\n\nAccording to the police, the victim and accused were friends and they got separated a few months ago, over difference of opinion. The police said that around 8 p.m. on Friday, Vignesh’s friend Mathankumar and the latter’s brother Praveenkumar were riding a motorcycle near the water tank when the accused came in another motorcycle and hit them. It is learnt that the accused then fled the place.\n\nMathankumar and Praveenkumar told Vigneshkumar about the incident.\n\nVigneshkumar and his friends went to the place to question the accused about the incident, but the duo was not there. Finally, the two accused encountered the victim in the locality, when he was watching the games organised on account of Pongal.\n\nThudiyalur Inspector S. Saravanan said that Kuruvi alias Saravanan stabbed Vignesh twice on his chest and stomach and fled the place with Sarath. The victim was rushed to a private hospital and referred to the Coimbatore Medical College Hospital, but he died enroute.\n\nHouse burgled\n\nThirty-five sovereigns of gold jewellery were reportedly burgled from a house at Mahalakshminagar in D.Nalligoundampalayam, near Pollachi Town, when the occupants were out of town.\n\nAccording to the police, Vinoth Prabhukumar got married about 40 days ago and lives there with his wife. On Thursday evening, the couple went to his wife’s place at Tatabad in Coimbatore. On Friday morning, their neighbour saw the front door open and informed the police.", 
    "section": "national", 
    "title": "Murder during Pongal celebration", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}