{
    "author": [
        "S Poorvaja"
    ], 
    "text": "According to the Tamil Nadu Fire and Rescue Services Department, in apartment complexes of less than 15 metres high, a minimum of two fire extinguishers per floor should be kept. The requirements include having at least one fire drill every year.\n\nThe resident of a three-storeyed apartment complex in the city admitted that residents were unaware of fire drills, and most of them did not know how to use the fire extinguishers that had been provided at the complex.\n\nSpeaking about fire safety norms with regard to buildings that are under construction, Kanchana Krishnan, director of Knight and Frank, said the norms for the ones under construction were extremely stringent.\n\n“For buildings that are over a decade or two old, consultants can be hired to check on the wiring in the building and assess the status. Buildings that were constructed years ago and to which the current norms do not apply, may be more dangerous in the event of a fire as many of them may be without emergency exits or other safety measures,” she said.\n\nN. Nandakumar, managing director of Devinarayan Housing and Property and former president of CREDAI, said most buildings that were 18 metres above the ground level were the ones that implemented fire safety measures, including emergency exits, hose reels and electric pumps.\n\n“From a design perspective, it is extremely important that there is a separate staircase and adequate space that will help fire fighters,” he said.\n\nAdvisory by experts\n\n1. Re-wiring should be considered for buildings over 20 years old\n\n2. Portable extinguishers should be kept in houses if the exposure to fire hazards or electrical intensity is high\n\n3. Faulty electrical panels in old buildings should be repaired at the earliest\n\n4. Apartment owners and residents’ associations should ensure that fire safety drills are carried out occasionally\n\n5. Ensure that residents are aware of water sources such as common taps and sand buckets at the complex\n\n6. Regular maintenance of equipment at homes, which include servicing of air-conditioners, washing machines and fridges, should be carried out\n\nNorms stipulate\n\nat least one fire drill a year", 
    "section": "national", 
    "title": "Old buildings at risk", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}