{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The NI LabVIEW Centre functioning at the Department of Electronics and Communication Engineering of the Dhirajlal Gandhi College of Technology (DGCT), Salem, has been recognised as an authorised NI LabVIEW Academy.\n\nThe NI LabVIEW Centre functioning at the Department of Electronics and Communication Engineering of the Dhirajlal Gandhi College of Technology (DGCT), Salem, has been recognised as an authorised NI LabVIEW Academy.\n\nNational Instruments (NI) is a globally recognised company whose integrated software and hardware platform helps engineers and scientists to provide innovative solutions. NI LabVIEW is a development environment with graphical programming syntax that helps to visualise, create and code engineering systems. Presently, many leading industries like Samsung, Digilogic Systems, Larsen and Toubro, Defence sector, etc are using NI LabVIEW software to develop innovative products.\n\nDGCT in its quest to provide quality engineering education established the NI LabVIEW centre in February, 2015 in the department of Electronics and Communication Engineering. Students have undertaken innovative projects such as smart health care monitoring, automatic irrigation system, maritime boundary alert and structural health monitoring for buildings using NI Labview.\n\nThe centre has now been recognised as authorized NI LabVIEW Academy School. Archana Manojkumar, Secretary, DGCT and M. Sumathi, Head of the Department of Electronics and Communication Engineering (ECE) received the award at Bengaluru recently in the presence of NI and NI alliance partners. The centre will focus on conducting NI authorised training and undertake multidisciplinary projects in the field of engineering in emerging fields like internet of things, automotive electronics, industrial automation, health sector, robotics, etc.", 
    "section": "national", 
    "title": "Recognised as authorised LabVIEW Academy school", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}