{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The State Government should review the decision it took five years ago to merge a few local bodies with the Coimbatore Corporation, Coimbatore Consumer Cause has demanded.\n\nIn a letter to Chief Minister Jayalalithaa, the organisation’s secretary K. Kathirmathiyon said that the reason for the consumer body’s demand was that no good had accrued to the residents of those areas.\n\nIn the past five years, residents of added areas had faced difficulty in getting building plan approval, by paying higher taxation, in obtaining certificates or meeting officials.\n\nThey had to travel quite a distance to meet officials in respective zonal offices.\n\nConnected\n\nConsidering the fact that local bodies were more connected with the day-to-day life of residents than other Government departments, the people’s expectation from the Corporation was higher. In commensuration with the expectation, the civic body should supply water, clean drains, build and maintain roads and install street lights.\n\nBut, it was unable to do so. Unfortunately, it was not happening and the merger of 11 local bodies had created a negative impact.\n\nMr. Kathirmathiyon wanted to know why the Government had expanded the Coimbatore Corporation when it was downsizing other departments.\n\nThe present Government had bifurcated taluks, regional transport offices by justifying that it was doing so to improve services. If bifurcation or creation of small establishments was the norm for better services, why did it not extend the same logic to local bodies.\n\nIf the Corporation felt that a panchayat was growing faster, let it elevate it to create a town panchayat and likewise if a town panchayat was growing bigger, let it upgrade to the next level or elevate it to a municipality.\n\nOnly this would serve the purpose and not merger with a higher municipal body., he said\n\nSuggesting that a referendum would reveal the truth, he wanted the Government to reconsider its decision.", 
    "section": "national", 
    "title": "‘Review decision to expand Corporation area’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}