{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After deliberations with stakeholders at various levels in the post flood scenario, a group of former defence officials and bureaucrats have decided to form Society of Emergency Volunteers (SEVA), a group comprising volunteers trained in search, rescue and life-saving skills, to manage disasters.\n\nBeing floated in the lines of the Community Emergency Response Teams (CETA) in the United States, the SEVA will have area-specific platoons spread across Chennai and its neighbouring districts.\n\nAccording to Commodore (Retd) S Shekhar, Convener of SEVA, the emergency management plan would involve the community, corporate and government machinery in equal measure. Platoons consisting of 30 volunteers each would be formed to cover the city and suburbs. These volunteers would be rendered a structured periodical training and refresher courses in first aid, life-saving techniques, search and rescue operations etc. “There are hundreds of youth trained in specialised disaster management and life-saving skills. But they are all scattered…we need to connect them by creating a common platform. We also aim to establish a bridge between SEVA and Government agencies, armed forces, police, local bodies, NGOs and others,” Mr. Shekhar said. Post-tsunami in 2004, a National Disaster Management Authority (NDMA) was created at the Centre, with similar organisations formed at the State and district levels. Elaborate disaster management plans were developed and promulgated. “Ground realities across the country have however repeatedly brought out ineffective implementation of these plans, lack of coordination amongst the various agencies/departments and inadequate training to the human resource of these departments.”\n\nBesides Mr. Shekhar, the first chairman of Airports Authority of India, Major General (Retd.) Jose Manavalan who was Commandant of the Military Engineering Group that was deputed by the Indian Army during the tsunami relief works in Tamil Nadu, former IAS officer T.S. Sridhar among others will be the founder trustees of SEVA.", 
    "section": "national", 
    "title": "‘SEVA’ formed to coordinate volunteers during calamity", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}