{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seven bikes, cash and three cell phones recovered\n\nSix men were arrested in a crackdown by police and seven bikes, Rs.1.62 lakh cash and three cell phones were recovered. According to Superintendent of Police Ashwin M. Kotnis, all six were serial robbers and charged with various crimes.\n\nThey committed robberies with a modus operandi of closely watching the movement of people especially aged persons in banks while withdrawing cash and persons, who go alone to redeem their jewels and subsequently follow them, Mr. Kotnis said here on Saturday.\n\nInitially, two among these accused from Tirunelveli – S. Suresh (25) of Mahesh Nagar, Reddiyarpatti and S. Periyanambiraja (19) of VM Chathram – were caught while conducting vehicle check near Sathankulam Union office on January 14. After confessing to the crime, the duorevealed the names of their accomplices including S. Kalyanasundaram (20) of Sankar Nagar, Thazhaiyuthu, S. Shanmuga Sundaram (24) of Sathankulam, Muniyandi (22), Madasamy of Sadayankinaru and M. Arumugam alias Durai (21) of Srikirishnaperi, Sathankulam.\n\nInvestigations revealed their involvement in attempts to heist banks, post office and another incident in which they robbed E.Jebaraj (47) of Korneliaz Street by pushing down his wife Nazareth from the bike while both of them were returning from a bank in Sathankulam with cash.\n\nAmong seven stolen bikes that were recovered from the accused, four bikes were from Kanyakumari district and the other three from Tirunelveli district.\n\nFurther, steps to prevent crimes in Thoothukudi district such as, marching additional night beats with the assistance of Armed Reserve police personnel, enquiring suspected persons in the night hours and verifying criminals in neighbouring district with the same modus operandi, had been intensified, the SP said. The accused were produced before the Judicial Magistrate in Sathankulam and remanded in judicial custody.\n\nThe SP lauded the team led by Sathankulam Deputy Superintendent of Police D. Kanagaraj involved in nabbing the offenders.", 
    "section": "national", 
    "title": "Six persons involved in robberies held", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}