{
    "author": [
        "T Ramakrishnan"
    ], 
    "text": "With one more batch of Sri Lankan Tamil refugees returning from Tamil Nadu, India to their motherland in a few days, the Sri Lankan government is keen on getting assistance of the Indian government to enable quicker voluntary repatriation of the remaining refugees. “We would like the Indian government to help us with regard to housing and road development in places of resettlement,” V.Sivagnanasothy, according to Secretary, Ministry of Prison Reforms, Rehabilitation, Resettlement and Hindu Religious Affairs in the Sri Lankan government. On Tuesday, 41 refugees, including 26 women, will reach Colombo from Chennai and Madurai. A senior official in Chennai says: “Of late, on an average, 60 persons are returning to Sri Lanka every month compared to 30 or 40 persons in the past.” To facilitate the repatriation, the Office of the United Nations High Commissioner for Refugees provides free air tickets; reintegration allowance of $75 per person; transport allowance $19 per person and monitory non-food grant of $75 per family.\n\nThe baggage allowance has been increased from 40 kg to 60 kg per person.\n\nA former official of the Rehabilitation Department in the Tamil Nadu government says that if ferry services are resumed early between Talaimannar in the Northern Province and Rameswaram in Tamil Nadu, the number of refugees going back will be much more. Except for a few statements made in the last one year on the resumption of ferry services, there appears to be no tangible progress.\n\nPointing out that about 1.37 lakh houses are required to be built in the Northern and Eastern Provinces of Sri Lanka, Mr. Sivagnanasothy says the Ministry has prepared a “comprehensive project” for providing livelihood assistance to those refugees who return home.\n\nUnder the project, the food component envisages the provision of food for six months. In this regard, the World Food Programme has been approached. “In case our project does not get covered under the Food Programme, we will provide dry ration for three months from our budgetary allocation,” the official says.\n\nOf 46,000 houses to be built with the Indian government’s assistance in the two provinces, 43,800 houses were completed as on December 31, 2015 including 15,878 houses in 2015. The remaining 2,200 houses are expected to be covered in “the next few months,” says the Indian High Commission in Colombo. Mr. Sivagnanasothy adds that his Ministry will award contracts shortly for a project to build 65,000 houses in the two provinces. While 11,000 houses will be built in the first year, the next three years will see the construction of 18,000 houses each year.", 
    "section": "national", 
    "title": "Sri Lanka seeks India’s help for refugee repatriation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}