{
    "author": [
        "S Ganesan"
    ], 
    "text": "The spot where a new culvert will be built on the Virupachipuram canal on Thennur Road in Tiruchi.— PHOTO: B. VELANKANNI RAJ\n\nesidents commuting through the Thennur High Road would have to brace up for some heavy traffic congestion over the next two months as the Tiruchirapalli City Corporation is all set to take up work on reconstruction of a culvert on the Virupachipuram Vaical, a major drain in the city, cutting across the road near the KMC Hospital. The work is scheduled to commence on January 22 and the city police have announced extensive traffic diversions to facilitate the reconstruction. The work is expected to go on for about two months.\n\nThe Virupachipuram Vaical, which starts at Sangeethapuram and drains at Kathirikai Vaical near Ramalinga Nagar, cuts across several densely populated areas.\n\nThe narrow culvert on the Thennur High Road at the stretch near the KMC Hospital has been unable to draw heavy water flow during monsoon season.\n\nThe reconstruction of the culvert is a 50-year-old demand and councillor K. Kalpana (DMK) has been raising the issue at several council meetings. As the present structure was too narrow to take in heavy flow, scores of houses in Babu Chetty Street and other places were left inundated at times of heavy rain as the water headed up from the vaical. The vaical, said to have been originally 10 feet in depth, has been silted up, local people point out. The widening of the culvert, at an estimated cost of about Rs. 21 lakh, would come as a huge relief to a large number of residents, said Ms. Kalpana.\n\nTraffic diversions\n\nThe work could not be taken up for long as it entailed closure of the road entailing major traffic diversions, requiring clearance from the city traffic police. The police have now given the go-ahead and announced the following traffic diversions, effective January 22:\n\nAll buses operating on Central Bus Stand-Thillai Nagar-Chathram Bus Stand route would be diverted via Pattabiraman Salai, Thennur Road, Thillai Nagar Main Road and Salai Road to reach Chathram Bus Stand. In the return direction, the buses would be diverted via Thillai Nagar Main Road XI Cross, Shastri Road, Anna Nagar Main Road, Uzhvar Sandhai and Pattabiraman Salai to go towards Central Bus Stand.\n\nBuses heading towards Chatram Bus Stand from Vayalur Road would be diverted via Puthur Four Roads Junction, Puthur Main Road, Pattabiraman Salai and Thillai Nagar Main Road.\n\nMofussil buses bound for Karur and beyond from Central Bus Stand would have to go via MGR Statue Junction, Anna Nagar Link Road, Shastri Road, and Karur Bypass. The buses would take the same route in the return direction.", 
    "section": "national", 
    "title": "Thennur road to be closed from Jan. 22", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}