{
    "author": [
        "M K"
    ], 
    "text": "A section of the jallikattu bulls will be on display at Narasipuram in Coimbatore on Sunday too.\n\nAn unusually high crowd has been thronging Narasipuram village located about 35 km from the city to have a look at majestic and ferocious jallikattu bulls that are on display at Velliangiri Gaushala.\n\nThe 207 bulls were bought from shandies at Madurai and its nearby districts when they were sold for slaughter by their former owners in January and February 2015 soon after the ban on the bull taming game by the Supreme Court.\n\nAmong the visitors was S. Ramesh (24) of Madurai who had come there on Saturday to see the bulls with 15 friends. This avid jallikattu fan who still raises two bulls at his house said it was a spectacle to see so many bulls, which were once actively involved in the sport, in one place after the sport was banned two years ago.\n\n“It would be nice to see the animals (that are in good shape) in action when the ban is lifted,” he said. Yumi Shiractori (22) of Japan who is studying at Tamil Nadu Agricultural University was elated to see the rescued animals. Hundreds of visitors from across the State came there to see the animals.\n\nThe visitors took pictures with the bulls, which were quite agitated on seeing strangers enter their space.\n\n“Probably they (bulls) were excited to see the crowd and got a feel of the jallikattu,” says J. Jeyamani (32), from Madurai, who takes care of the bulls along with three of his friends. He was actively involved in the sport from his teenage days and is now employed here at the gaushala to take care of the bulls.\n\nHailing from a farmer’s family, he owned eight bulls that he sold to the gaushala. “I am very happy to take care of those bulls here and nearly 200 other bulls,” he said and added that despite the ban the animals are fed with a healthy diet and given exercises such as swimming, hitting the mud with their horns and walking, everyday.\n\nDue to safety reasons, only a few bulls were on display for the public at a close range. The other animals could be seen from a distance. There were volunteers to explain the visitors the types of bulls, their salient features, on how they fared in the jallikattu arena.\n\nAmong them were bulls that bull fighters dared not to touch, those tossed the fighters on the air, and who have killed a few brave men during the encounter.", 
    "section": "national", 
    "title": "They steal the thunder, yet again", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}