{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Honour:NCC cadets of K.R.Balaramadas and M.Ponni from Kendriya Vidyalaya School at Narimedu in Madurai who will participate in ‘Seema Darshan'.Photo: S. James\n\nTwo class 11 students from the Kendriya Vidyalaya School at Narimedu here will participate in the first ‘Seema Darshan’, a new initiative launched by Ministry of Human Resources Development (MHRD), to provide exposure on the functioning of security forces by taking children to the country’s borders.\n\nAccording to C. Muthiah, Principal, M. Ponni from the science stream and K.R. Balaramadas from the humanities stream are the only two students to be selected from Tamil Nadu and Puducherry.\n\nHe said that the MHRD wanted the best performing students belonging to National Cadet Corps in schools run by Kendriya Vidyalaya Sangathan (KVS) and Navodaya Vidyalaya Samiti (NVS).\n\n“There are no NVS schools in Tamil Nadu. These two students were selected from the 46 KV schools from Tamil Nadu and Puducherry that come under the Chennai region of the KVS,” he said.\n\nHe said that 60 students had been selected from across the country for this year’s ‘Seema Darshan’, organised in collaboration with the Ministry of Defence.\n\nAccording to Mr. Muthiah, the students will be split into two groups of which one will be taken to Attari in Punjab and the other to Akhnoor in Jammu and Kashmir.\n\n“The students will meet the army personnel on January 22 and be with them until January 26. They will participate in the Republic Day flag-hoisting ceremony on the borders,” Mr. Muthiah said.\n\nReacting to the selection, Ponni, an ‘A’ certificate holder in NCC who had so far attended seven NCC camps, said that the selection came as a pleasant surprise. “I am super excited about the programme. It will be a lifetime opportunity to be with the jawans defending our borders. I am also looking forward to meeting students from various parts of the country,” she said.", 
    "section": "national", 
    "title": "Two Madurai students to participate in ‘Seema Darshan’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}