{
    "author": [
        "L Renganathan"
    ], 
    "text": "“It is unfortunate that an elderly Dalit was denied a decent funeral; the divisive mindset of some sections of society needs to change for holistic development of the people,” Chairman of the National Commission for Scheduled Castes, P.L. Punia, said here on Saturday.\n\nSpeaking to The Hindu after getting a first-hand information of the recent incident in which a Dalit’s body was held five days without burial following sustained rivalry between two communities at Thirunal Kondachery near Mayiladuthurai in Nagapattinam district, Mr. Punia observed that it was not proper on the part of the officials to have forcibly arranged for a funeral.\n\nInstead, the officials must have enlightened those who obstructed the use of common road that it was illegal to deny the Dalits right of passage and that too for funeral. “A section of the administration was not able to ensure a decent burial for an elderly Dalit and that was unfortunate,” Mr. Punia, also a Rajya Sabha MP, said.\n\nIt seemed right from the beginning some sections of officials and other communities were bent on bending the law, instead of forcing those who tried to flout that, to deny proper funeral to the Dalit.\n\nComparing the conditions prevalent in the Dalit colony and the localities of other developed communities in the village, Mr. Punia remarked that the difference was marked and it was easy for anyone with an open mid to analyse and conclude on the disparity.\n\n“We have directed the district administration to remove the encroachments that prevented a proper and early funeral,” he added.\n\nMr. Punia said that he had asked the administration to file an action taken report immediately. After receiving that, he would add his field study report to be forwarded for action to the State and district officials concerned.\n\nHe also expressed concern over the reported denial of entry to Dalits in a local Shiva temple and said the district administration must address the issue .\n\nMr. Punia consoled the bereaved family members of Sellamuthu (85) who was hurriedly and forcibly buried by the police and Revenue officials after prolonged parleys between two warring communities failed to break the deadlock over access to the graveyard.\n\nMr. Punia also met those who opposed the body being taken through their street and told them to live in harmony with others.\n\nCollector S. Palanisamy, DIG of Police, Thanjavur Range, Senthil Kumar, Superintendent of Police Abhinav Kumar, Assistant Director and Head of Regional Office, National Commission for Scheduled Castes, Chennai, P. Ramasamy, accompanied him.", 
    "section": "national", 
    "title": "Unfortunate that Dalit was denied decent funeral: Punia", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}