{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Bala essentially keeps making the same movie. He’s drawn to darkness, and love is but another stop on the tortuous road to doom\n\nWhy doesn’t Bala make comedies? His obsession with bloodbaths may suggest he has one of the most twisted minds in the industry — it’s a wonder he’s not yet been snapped up as a consultant by the people who run Hell, to design increasingly vivid tortures. But his mind is also one of the funniest — he serves up jokes with a uniquely whimsical twist. Like the scene in Thaarai Thappattai where the folk artist Sannasi (M. Sasikumar) finds himself staring at a serving of rum in a bottle cap. I found myself grinning at even some of the non-jokey lines, as when Sannasi’s father Saamipulavan (GM Kumar) curses his son, Nee ellaam nallaa irukka maatte . Look, it’s a Bala movie. As if someone needed to say that.\n\nSome might view Thaarai Thappattai , which is set in the village of Padithurai in Thanjavur, as Bala’s take on Avatharam . The storyline woven around the miserable plight of folk artists, the near-mythical end, the magnificent Ilaiyaraaja score (more on that later) — it’s all here. Others may view the film as Bala’s take on... Bala’s older films. The déjà vu, especially in the latter portions, is undeniable. But the power of his films is equally undeniable. At one point, a man likens an impromptu Caesarean operation to splitting open a jackfruit and scooping out the flesh. I can’t readily think of many other filmmakers whose dialogue can make you feel violated. With Bala, the “should I watch this film?” question is moot. You already know the answer.\n\nBala essentially keeps making the same movie. He’s drawn, repeatedly, to darkness, and love is but another stop on the tortuous road to doom. Plus, the highly stylised performances, which don’t seem to come from the actor so much as the director. Watch Sooravali, played by Varalaxmi Sarathkumar. She’s marvellous, but it’s still a Bala performance — in, say, the mockery she makes of the phrase thaai paasam , when her mother advises her not to drink during daytime. Sasikumar, on the other hand, plays the character like he plays all his serious characters, like he’s exhausted and he’d rather crawl back into his beard. He’s the straight guy amidst the others (like the excellent new find, R. K. Suresh), the much-needed foil. I watched Thaarai Thappattai like I watch all Bala’s films — partly exasperated, but also (for the most part) able to brush aside the annoyances because he’s such a singular creator. Foremost among my issues with this director: the jagged cutaways, the oddly spliced in reaction shots, the painfully one-note villains, the utter lack of finesse. How can a visionary who’s been making films for so long give us such crude frames?\n\nThen again, the Bala apologist in me wonders if this lack of polish is deliberate. Maybe this kind of filmmaking is as much an act of violence as the endings of his films.\n\nHe’s doing to our sensibilities what the villains did to Suriya at the close of Pithamagan .\n\nBut then you see what he does with the ‘Paruruvaaya’ song sequence, with Sannasi carrying Sooravali like a daughter.\n\nIt’s moving enough when you see these scenes as they’re unfolding, but the blow-to-the-head import comes only at the end, when these images come full circle. For such a sensationalist, Bala can be terrifically subtle. Everything’s there for a reason, however minor.I wish the characters had been fleshed out more. We don’t feel for these social outsiders the way we felt about the quartet in Pithamagan or even the duo of Avan Ivan . We know, from the Andaman sequences, that Sooravali will do anything for Sannasi — yet, this knowledge in the head doesn’t warm the heart. And some scenes needed to be more powerful — the villain’s reveal, the random way in which Sannasi stumbles upon Sooravali after she’s gone missing, or even Sannasi’s transformation at the end, which appears to arise not so much from pages of a screenplay as bars of sheet music.\n\nI refer, of course, to Ilaiyaraaja. It isn’t everyday that we celebrate a 1000th film, and the maestro rises to the occasion with a rousingly red-blooded score. Even if Sannasi’s climactic transformation makes little sense from a narrative point of view, Ilaiyaraaja’s score — violins, conch shells, beats that slam the brain — almost makes you buy it. The background bits are brilliant — the thavil with konnakol syllables in Saamipulavan’s introduction, which segues superbly into the less-classical-sounding piece as Sannasi makes his introduction (you have reams of character development right there, in that switch); the rhythms and the thrilling pauses in the instrumental piece that plays over Soorvali’s dance in the Andamans.\n\nAnd for long-time fans, there are amusing flashbacks — to ‘Kuyila pudichu’ , to ‘En purushan dhaan’. The latter plays as a ringtone in a sequence that’s the exact reversal of the doormat situation in Gopurangal Saaivadhillai — here, the husband is pressing his wife’s feet. Tell me again, why doesn’t Bala make comedies?\n\nbaradwaj rangan\n\nThaarai Thappattai\n\nGenre: Drama\n\nDirector: Bala\n\nCast: Sasikumar, Varalaxmi, GM Kumar, R.K. Suresh\n\nStoryline: The lives of folk dancers as they traverse Bala-land", 
    "section": "national", 
    "title": "Warmed-over Bala, but still worthwhile", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}