{
    "author": [
        "B Kolappan"
    ], 
    "text": "By calling for MGR’s centenary to evolve into a festive occasion at the national level, Ms. Jayalalithaa has acknowledged that he continues to be her party’s mascot.\n\nIt may be just a coincidence that the birth centenary of AIADMK founder and former Chief Minister M.G. Ramachandran (1917-1987) begins when the State is bracing itself for Assembly elections. But, for the ruling AIADMK, it could not have come at a more appropriate time.\n\nFor a party built on MGR’s seemingly everlasting charisma, it will still be banking on his enduring do-gooder image to face every electoral challenge. That he died 28 years ago and those who were under his spell during his lifetime will be quite old now seem to be of little consequence.\n\n“There may have been many phenomena in Tamil Nadu, but MGR is part of the popular imagination and it gives his name higher value over others. The AIADMK will certainly seek to hide its failures and shortcomings behind his imaginative value and make political capital,” said Ramu Manivannan, professor at University of Madras. Invoking his name would be a boost the party’s election prospects.\n\nBy calling for MGR’s centenary to evolve into a festive occasion at the national level, AIADMK general secretary and Chief Minister Jayalalithaa has acknowledged that he continues to be her party’s mascot.\n\nFew could replicate MGR’s success - in films and politics. He achieved this by carefully building his image through meticulous selection of characters, dialogues and songs before taking the plunge into politics.\n\nOften, the screen villain would be assigned dialogues extolling the protagonist’s virtues. Songs subserved his political ambition.\n\n“Lyricists, including Pattukottai Kalyanasundaram, Kannadasan and Vaali, helped construct his image. DMK leader M. Karunanidhi’s dialogues also played a major role in this regard,” said Dravidian scholar K. Thirunavukkarasu, whose forthcoming book Dravida Iyakkamum Thiraippada Ulagamum dwells in detail on the symbiotic relationship between the Dravidian movement and the film world.\n\nMr. Thirunavukkarasu agreed that the anti-DMK feeling generated by MGR and his fans who worship him as God continues to hold sway in Tamil Nadu politics, even though the actor relied heavily on the DMK as a political organisation in his early political phase.\n\n“He is probably the first actor to use party flags in films and spoke dialogues propagating Dravidian ideals.”\n\nWriter Suba Gunarajan, who is also the editor of film magazine Kaatchi Pizhai , takes a nuanced view of MGR’s popularity.\n\n“I will not call it magic because the generation that was captivated by his charisma was well beyond its prime. But we must accept that a considerable number of billionaires in the State have directly or indirectly benefitted by MGR.”", 
    "section": "national", 
    "title": "Where MGR’s charisma still holds sway", 
    "subsection": "tamilnadu", 
    "date": "2016-01-17"
}