{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Congress alleges ruling NDA has a hand in protests\n\nBoth Houses of Parliament were adjourned on Tuesday as the All India Anna Dravida Munnetra Kazhagam (AIADMK) demanded action against the son of former Finance Minister P. Chidambaram, Karti Chidambaram, after newspaper reports alleged his involvement in the Aircel-Maxis issue.\n\nWith multiple adjournments in both Houses, hardly any business was conducted, even as the Congress, which had moved privilege motions against Human Resource Development Minister Smriti Irani, alleged that the ruling NDA had a hand in the AIADMK’s protests since it allowed the government to avoid uncomfortable answers in Parliament.\n\nLeader of the Opposition in the Rajya Sabha, Ghulam Nabi Azad, moved a calling attention motion regarding inflammatory speeches by Union Minister Ram Shankar Katheria and other elected representatives violating the Constitution and oath of office and said that could not be taken up because of the disruption. “A serious issue is not discussed like this. This is a deliberate attempt by the AIADMK. Otherwise, never before has the AIADMK behaved like this,” the Congress leader said. In the Upper House, an angry Deputy Chairman P.J. Kurien even threatened to suspend the agitating members but to no avail.\n\nThis didn’t deter the AIADMK, whose members were displaying copies of an English daily that has claimed that Mr. Karti Chidambaram had invested in real estate across the world, as per investigations by the Enforcement Directorate and Income Tax authorities during searches at his premises. Slogans like “we want justice” and “NDA sarkar take action” were raised at the well of both Houses.\n\nIn the Lok Sabha, AIADMK members rushed to the well raising slogans demanding action against Mr. Karti Chidambaram. Speaker Sumitra Mahajan tried to conduct some business but her voice was drowned in the din. Parliamentary Affairs Minister M. Venkaiah Naidu said if proper notice was given by the party, the issue could be discussed and the government was open to a debate.\n\nAt one point in the Lok Sabha, Congress leader Mallikarjun Kharge stood up to raise some issue, apparently relating to the privilege notice against Ms. Irani over the Rohith Vemula suicide issue, but he was shouted down by the AIADMK members.\n\nSenior government managers feel that the issue will dominate proceedings for the next two days at least. “We don’t see this going away soon,” added a senior Minister.", 
    "section": "national", 
    "title": "AIADMK disrupts House over Karti issue", 
    "subsection": "general", 
    "date": "2016-03-02"
}