{
    "author": [
        "John Williams"
    ], 
    "text": "Jerry Pinto is the author of six books, including a biography of Helen, a Bollywood actor of yesteryear, and a novel, Em and the Big Hoom , for which he won The Hindu Literary Prize in 2012.— File Photo: R. Ragu\n\nThe Windham-Campbell Prizes on Tuesday announced its annual list of nine winners. Each of the recipients receives $1,50,000 for accomplishments in the worlds of literature and theatre.\n\nThis year’s winners in fiction were Tessa Hadley, C.E. Morgan and Jerry Pinto. Ms. Hadley, a British writer whose stories regularly appear in The New Yorker , is the author of several novels and story collections. Her most recent novel is The Past .\n\nC.E. Morgan’s debut novel, All the Living , was published in 2009. Her second, The Sport of Kings , will be published in May. Mr. Pinto is the author of six books, including a biography of the Bollywood actor Helen and a novel, Em and the Big Hoom .\n\nThis year’s prizes in non-fiction went to Hilton Als, Stanley Crouch and Helen Garner. Als is a staff writer and theatre critic at The New Yorker , and the author of White Girls (2013) and The Women (1996).\n\nMr. Crouch is a novelist, cultural critic and biographer whose most recent book is Kansas City Lightning , the first part of a planned two-volume biography of the jazz saxophonist Charlie Parker.\n\nMs. Garner has written both fiction and non-fiction. Her most recent book is This House of Grief , a true-crime story about a father accused of deliberately drowning his three young sons.\n\nThe winners in drama were Branden Jacobs-Jenkins, Hannah Moscovitch and Abbie Spallen. Jacobs-Jenkins’ play An Octoroon (2014) was a riff on a 19th-century play about illicit interracial love. In The Times , Ben Brantley called it a “coruscating comedy of unresolved history,” and predicted that it “may turn out to be this decade’s most eloquent theatrical statement on race in America today.”\n\nMs. Moscovitch’s plays include East of Berlin (2007), Little One (2013) and What a Young Wife Ought to Know (2015). Ms. Spallen’s plays, which deal with themes of Irish life and politics, include Pumpgirl (2006) and Strandline (2009).\n\nThe awards, administered by the Beinecke Rare Book & Manuscript Library at Yale University, were first issued in 2013. — New York Times News Service\n\nNine writers and playwrights to get the award administered by Yale University", 
    "section": "national", 
    "title": "Author Jerry Pinto wins Windham-Campbell prize", 
    "subsection": "general", 
    "date": "2016-03-02"
}