{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "In a decision giving a wide interpretation to the term ‘employee’, the Supreme Court on Tuesday held that welfare schemes for social security and health insurance assured under the Employees State Insurance Act were available even to casual workers.\n\nThe judgment by a Bench of Justices Gopala Gowda and Arun Mishra decided the status of race workers employed on the race tracks of one of the country’s oldest and most prestigious horse racing clubs — Royal Western India Turf Club Ltd — in Mumbai.\n\nThe club, established two centuries ago, runs the iconic Mahalaxmi race course and the Pune race course.\n\nThe judgment, authored by Justice Mishra for the Bench, dismissed the club’s contention that its temporary staff engaged on race days for issue of tickets would not come under the definition of the term ‘employee’ under Section 2(9) of the Employees State Insurance Act, 1948.\n\n“Casual labour engaged on race track is not to be covered under the ESI Act,” the club argued.\n\n‘Sporadic work’\n\nIt described the employees’ work as sporadic.\n\nDisagreeing with this, the apex court observed that the 1948 Act was a welfare legislation with a “very wide” and inclusive definition for the term “employee.”\n\n“A person who is employed for wages in the factory or establishment on any work of, or incidental or preliminary to or connected with the work is covered. The definition brings various types of employees within its ken. The Act is a welfare legislation and is required to be interpreted so as to ensure extension of benefits to the employees and not to deprive them of the same which are available under the Act,” the Supreme Court held.\n\nFurther, Justice Mishra corrected the club’s description of its race track employees. The judgment said the nature of their work was far from sporadic.\n\nIn fact, the apex court observed that the club’s employees’ work for the day of racing is a “perennial activity” which makes them entitled for the benefit of the Act.\n\nThis judgment is a sequel to an earlier verdict on the Royal Western India Turf Club Ltd on July 31, 2014 by the Supreme Court. In that, the apex court had held that the turf club would fall within the meaning of the word ‘shop’ as mentioned in the notification issued under the ESI Act.\n\nThe court held the club liable to pay the ESI contribution in the next three months as per notification dated September 18, 1978 along with interest at such rate as provided in the Act and the rules.\n\nIt further dismissed the applications of the club with costs of Rs. 2 lakh payable to the ESI Corporation.\n\nSC Bench dismisses race club’s contention on definition of the term ‘employee’", 
    "section": "national", 
    "title": "‘Casual workers too covered by ESI’", 
    "subsection": "general", 
    "date": "2016-03-02"
}