{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In continuation of the recent trend of mainstream Malayalam cinema hogging much of the limelight in the Kerala Film Awards, Martin Prakkatt’s Charlie came out on top, sweeping eight of the awards. R.S. Vimal’s Ennu Ninte Moideen was right behind with seven awards in its kitty.\n\nOzhivu Divasathe Kali , directed by Sanalkumar Sasidharan, a searing critique of casteism and patriarchy conveyed through a tense drinking game among a group of friends, was selected as the best feature film of 2015 in the awards announced here on Tuesday.\n\nManoj Kana’s Amoeba , based on the travails of endosulfan victims in Kasaragod district, won the award for the second best film.\n\nThe awards won by Charlie include best director for Martin Prakkat, best actor for Dulqer Salmaan, best female actor for Parvathy (also for her contrasting performance in Ennu Ninte Moideen ), best screenplay for R. Unni and Martin Prakkatt, best cinematography for Jomon T. John (also for Ennu Ninte Moideen and Nee-na ), best sound mixing for M.R. Rajakrishnan, best art direction for M.R. Rajakrishnan and best colourist for J.D. and Kiran.\n\nEnnu Ninte Moideen directed by R.S. Vimal won the award for the best popular film. For the same film, Ramesh Narayanan won the best music award for the song Saaradaambaram (also for Pashyathi dishi from Edavappathy ). His daughter Madhushree Narayanan won the best female singer award for the song Pashyathi dishi .\n\nSreebala K. Menon was selected as the best debut director for Love 24X7 . Jayasurya won a special jury award for his performances in Lukka Chuppi and Su Su Sudhi Valmikam . Joy Mathew won a special mention of the Jury for Mohavalayam .\n\nJoju George won special mention for performances in Oru Second Class Yathra and Lukka Chuppi .\n\nDostoyevsky adaptation\n\nMuhammed Razi won the best adapted screenplay for Velutha Rathrikal , based on Fyodor Dostoyevsky’s White Nights . Harikumar won the best story award for Kattum Mazhayum . Prem Prakash was selected as the best character actor for his role in Nirnayakam . P.V. Anjali won the best character actress award for Ben .\n\nP. Jayachandran was selected as the best male singer for three songs — Njanoru Malayali ( Jilebi ), Malarvaakakombathe ( Ennum Eppozhum ) and Saaradaambaram ( Ennu Ninte Moideen ).\n\nRafeeq Ahammed won the best lyricist award for Kaathirunnu ( Ennu Ninte Moideen ). Bijibal won the best background music award for Pathemari and Nee-na .\n\nSreya Jayadeep won a special mention for her song Enno njanente muttathorattath from Amar Akbar Antony .\n\nGourav G. Menon and Janaki Menon won the best child actor awards for Ben and Malgudi Days respectively. Malettam directed by Thomas Devasia was selected as the best children’s film.\n\nManoj won the award for the best editor for Ivide . Sandeep Kurisseri and Jijimon Joseph won the best live sound award for Ozhivudivasathe Kali . Ranganath Ravi won the best sound design award for Ennu Ninte Moideen .\n\nAmoeba , based on the travails of endosulfan victims in Kasaragod district, won the award for the second best film", 
    "section": "national", 
    "title": "Charlie, Moideen bag Kerala film awards", 
    "subsection": "general", 
    "date": "2016-03-02"
}