{
    "author": [
        "National Bureau"
    ], 
    "text": "Patna High Court issues notice to Army, Parrikar seeks report from Gen. Dalbir Singh\n\nThe image of hundreds of young men sitting cross-legged on the ground in their undergarments to take an Army recruitment examination in Muzaffarpur, Bihar, has gone viral across the country.\n\nThe Patna High Court on Tuesday took cognizance of the incident while Defence Minister Manohar Parrikar sought a report from the Army.\n\nThe test was conducted at Chakkar Maidan in Muzaffarpur for over 1,100 posts in the Army.\n\nColonel V.S. Godara, Director of Recruitment at Muzaffarpur, told mediapersons that the exercise was meant to prevent cheating in the test. “We did not insult anybody or subject anyone to cruelty... no examinee complained, so why are outsiders making a hue and cry over the matter,” Col. Godara asked.\n\nA Public Interest Litigation (PIL) petition filed in the Patna High Court was converted into a writ petition by the court on Tuesday, and a notice was issued to the Defence Ministry to respond by April 5.\n\nMeanwhile, after the images of the incident appeared in the media, Mr. Parrikar sought a report on the incident from Army Chief General Dalbir Singh. But, Army sources said that they were yet to receive any such directive.\n\nCommenting on the notice issued by the High Court to the Defence Ministry, advocate Deenu Kumar, who filed the PIL plea, told The Hindu, “The court has asked the Army officials concerned to come with their report on the issue after four weeks and the next date of hearing is April 5.” Mr. Kumar said that he had argued in the court that it was an act of inhuman behaviour by Army officials.\n\n“It was a violation of Article 21 and 39F of the Constitution and the court too was convinced by my argument and sought a notice from the Army officials,” Mr. Kumar said. The Army officials, who conducted the test, had asked all the 1,159 examinees to remove their pants and vests and take the examination only in their undergarments.\n\nCol. Godara said, “Earlier, students have been caught hiding their answer slips and mobile phones in their undergarments and vests, so we took all precautionary measures this time to conduct the exam in a free and fair manner”.\n\nIn Bihar, incidents of cheating in examinations have caused concern in the past. Last year, images of parents climbing the walls of a multi-storey building in Vaishali and passing on chits to candidates during an examination had caused widespread disquiet.\n\n( With inputs from PTI )", 
    "section": "national", 
    "title": "Exam in undergarments sparks row", 
    "subsection": "general", 
    "date": "2016-03-02"
}