{
    "author": [], 
    "text": "An official release on Tuesday said Mr. Jaitley would consider all suggestions. “We have received representations today [on Tuesday] from various sections suggesting that if the amount of 60 per cent of corpus is not invested in annuity products, the tax should be levied only on accumulated returns on the corpus and not on the contributed amount,” it said.\n\nStill confusion on the intention of this proposal remained through the day despite the official statement, including from Revenue Secretary Hasmukh Adhia. The confusion was caused by the speech and the Finance Bill Mr. Jaitley tabled to amend the Income Tax Act for this provision as they say separate things.\n\nWhile as per the Finance Minister’s budget speech, 60 per cent of the total corpus, which consists of employer’s contribution, employee’s contribution and interest on both, will be taxable on withdrawal, the Finance Bill says something else. The Bill proposes amendments to the Income Tax law that will make 60 per cent of the employee contributions part, of the accumulated balance, tax free. “While the Finance Bill seeks to tax the corpus, the government has received representations suggesting that the tax should only be on the interest accrued... Therefore, the Finance Minister has agreed to revisit the budget proposal,” Mr. Adhia told The Hindu .\n\nThe new proposal under consideration is that interest accrued on 60 per cent of contributions made after April 1, 2016 will not attract any tax on withdrawal unless invested in an annuity plan, Mr. Adhia said. The contributions and interest accrued to the EPF before that and the withdrawal of principal after the cut-off date would remain tax-free, he said.\n\nThe official statement reiterated the position in the budget documents.\n\nOf the total corpus, 40 per cent withdrawn at the time of retirement will be tax exempt in the case of recognised provident fund and the NPS, it said. In the case of employees of private companies, if they place the remaining 60 per cent in annuity, out of which they can get regular pension, no tax is chargeable, it said. In other words, according to the release, the entire corpus will be tax-free, if invested in annuity.\n\nThe other change, according to this release, introduced by the budget, is that when the original corpus goes in the hands of the heirs on the death of the person investing in annuity, then again there will be no tax. The budget proposal does not affect three crore subscribers of the around 3.7 crore contributing members of EPFO as their investments within the statutory wage limit of Rs.15,000 a month, the release said. The proposal affects only about 60 lakh contributing members who have accepted EPF voluntarily and they are “highly-paid “employees of private sector companies, who can withdraw their savings without any tax liability, it said. “We are changing this... What we are saying is that such an employee can withdraw without tax liability provided he contributes 60 per cent in annuity product so that pension security can be created for him according to his earning level… However, if he chooses not to put any amount in annuity product, the tax would not be charged on 40 per cent,” the release said.\n\nFinance Minister will consider all suggestions on the issue, says an official statement", 
    "section": "national", 
    "title": "Govt. to move amendment to EPF tax proposal", 
    "subsection": "general", 
    "date": "2016-03-02"
}