{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "‘His act could have been a ritual or he might have had a psychiatric condition’\n\nThe Thane police investigating the mass murder committed by Kasarwadawali resident Hasnain Warekar, who killed himself, are trying to find out whether he was influenced by a self-styled godman into believing that he had been affected by an evil spirit and asked to perform a macabre ritual to ‘cleanse the bloodline’. The theory is based on not only the gruesome nature of the crime but also on certain beliefs that are prevalent in the village, said officials.\n\nIn the early hours of Sunday, Warekar killed 14 members of his family, including his parents, wife, daughter, sisters and their children, before hanging himself. Only one of his sisters, Subiya, survived the murderous assault, and is currently being treated for the slit on her throat and severe trauma.\n\nThe Thane police are looking into several possibilities with respect to the motive, and one of them is that Warekar was asked to conduct a “cleansing” ritual to rid him and his family of an evil spirit. “The residents of Kasarwadawali village are originally from Konkan, and a lot of their beliefs overlap with those of other communities. In some communities, it is believed that spirits reside on certain trees and anyone passing under them is likely to be possessed. During our inquiries in the village over the last couple of days, it has become apparent that the Kasarwadawali locals, too, believe in this,” said an officer who is part of the investigating team.\n\nWhen The Hindu visited the village and interacted with the residents, some of them spoke about the concept of jinns or spirits.\n\nOne of the villagers, who did not wish to be named, said, “ Pata nahi itna shaant ladka aisa kyon karega. Jinn ne pakad liya hoga usko (Wonder why such a calm person would do something like this. It’s as if a spirit caught hold of him).” Other villagers said that according to local legend, jinns are either pak (pure) or napak (evil).\n\n“There are some people who indulge in aghori practices, which include necrophilia, cannibalism, black magic and occult. We are making efforts to find out whether Warekar came into contact with such a person or group. We are retracing his footsteps to find out which places he visited and who he was in regular contact with. The idea is to find out if the influence of any such occult practitioner, combined with the age-old belief shared by Wadavali natives, led to the crime. Our inquiries are under way in this regard,” said another officer.\n\nMeanwhile, the police are also talking to experts to find out if any psychiatric condition can stay dormant for years and suddenly manifest itself in such an intense manner.\n\n“The problem with confirming whether or not Warekar was suffering from a psychological condition is the only ones who could confirm or deny this for sure are all dead. Any picture we try to build about his mental health would be based on secondary sources and educated guesses by experts,” the officer said.", 
    "section": "national", 
    "title": "Hasnain’s motive is anybody’s guess", 
    "subsection": "general", 
    "date": "2016-03-02"
}