{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "For vulture conservationists, there is no sight more beautiful than the highly decimated-in-number scavenger birds feeding on a carcass offered at a “vulture restaurant”.\n\nA group of dedicated forest officials and personnel, involved in reviving the picturesque vulture habitat in Adilabad district, are an exhilarated lot as their painstaking effort for over a year in making the majestic birds feed in their “restaurant” has yielded results.\n\nThe 100 m high and 250 m wide habitat of the long billed vulture ( Gyps indicus ), the picturesque Pala Rapu cliff in Murliguda beat of Bejjur forest range in Kagaznagar division, at present has 24 adults and 6 chicks living in 2 roosting points and 10 nests, though there are over 40 of them, all abandoned. Five of the 10 have been occupied only after the conservation efforts helped the number of the scavenger birds go up from 10 to 30 in a span of two years.\n\n“We do not know when, but the nests were certainly abandoned because of shortage of food. A survey conducted in 10 surrounding villages revealed that cattle carcasses were not available since long, as farmers sell away their cattle,” recalled Bejjur Forest Range Officer M. Ram Mohan, who leads the conservation effort.\n\n“Supplying food to the vultures became our first priority as the habitat did not lack in the other two parameters for survival of the birds — availability of water and of higher perching places. We established a vulture restaurant on top of the cliff and on the Peddavagu stream bed to attract the scavengers to the habitat,” Mr. Ram Mohan added.\n\n“Though we had placed a carcass near the stream about six months ago, it was for the first time that the birds fed on it on February 20 and 21,”says wildlife biologist and field researcher M. Ravikanth. “We missed photographing the first day’s action involving seven vultures but made sure we carried a camera the next day.”\n\nThe habitat of the long billed vulture now has 24 adults and 6 chicks in 2 roosting points and 10 nests", 
    "section": "national", 
    "title": "Hopes on habitat revive as vultures feed at ‘restaurant’", 
    "subsection": "general", 
    "date": "2016-03-02"
}