{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Why does Kerala Chief Minister Oommen Chandy forego his sleep on most days and work into late hours? If anyone thought the Chief Minister did so entirely out of his commitment to his calling, here is what he has to say: “I must reveal that I have a selfish motive for working so late. I can’t sleep early. I can sleep only if I tire myself.”\n\nThe Chief Minister went candid about his sleeping habits at the release of the book Kunjunju Kadhakal , lighter vignettes from Mr. Chandy’s life authored by his long-time press secretary P.T. Chacko here on Tuesday. “I cannot sleep early. So I keep on working and the last item on my daily routine is signing files. There is someone sitting by my side to keep aside the papers I sign. The instruction that I give the person is to alert me the moment I write the wrong date, for that means I am about to fall asleep,” Mr. Chandy said leaving the select audience at the function rolling in the aisles, shortly after veteran actor Madhu released the book by handing over a copy to former Additional Chief Secretary D. Babu Paul.\n\nAuthor, orator and Janata Dal (S) State president M.P. Veerendrakumar, chairing the function, too had an interesting story on Mr. Chandy’s sleep cycles. “Once when Oommen Chandy boarded a flight, the air hostess failed to recognise him and told him to be seated in one of the back rows. Only a little later did she come to know about his true identity and was quite worried. But there was little she could do, for the Chief Minister was already fast asleep,” he said spreading laughter in the audience.\n\nThe Russian translation of the book was also released at the function, which was attended by Ratheesh C. Nair, honorary consul, Russian Federation.\n\nM.V. Shreyams Kumar, MLA, welcomed the gathering.\n\nCM shared some ‘secrets’ at the release of Kunjunju Kadhakal , authored by his long-time press secretary P.T. Chacko", 
    "section": "national", 
    "title": "I can’t sleep early, says Oommen Chandy", 
    "subsection": "general", 
    "date": "2016-03-02"
}