{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Tensions between India and Pakistan have held back South Asian integration, said former Sri Lankan President Chandrika Kumaratunga, calling for greater South Asian cooperation and economic integration.\n\nMs. Kumaratunga was amongst a high-power panel of former South Asian leaders, as well as External Affairs Minister Sushma Swaraj and Bangladesh Foreign Minister A.H. Mahboob Ali at the first ‘Raisina Dialogue’, hosted by the Ministry of External Affairs in Delhi.\n\n“India-Pakistan conflicts have prevented regional integration,” Ms Kumaratunga said in her keynote address, adding that not just India and Pakistan, but “six of eight SAARC countries (omitting Bhutan and Maldives) have spent the past decades consolidating their identities and inter-state tensions.”\n\nThe conference, attended by speakers from 40 countries, is being seen as the government’s attempt to rival conferences around the world that attract global players such as the Shangri-La dialogue in Singapore, and the Munich Conference on national security. While Ms. Swaraj didn’t mention India’s relationship with China during her speech on Asian connectivity, other leaders on the panel made a point of speaking about China’s role.\n\nMs. Kumaratunga called for a more positive view of China’s role in the region, saying that all countries could benefit from doing business with China. “Could we not see Chinese economic power as an opportunity rather than a threat?” Ms. Kumaratunga asked, referring obliquely to concerns in India over projects built by China in Sri Lanka, especially the Colombo port project that was stalled temporarily last year.\n\nMs. Kumaratunga was joined by former Afghanistan President Hamid Karzai in the pitch for a greater role for Chinese investment.\n\nSpeaking at the inauguration, Ms. Swaraj and her Bangladesh counterpart Mahboob Ali spoke of the importance of building road and rail connectivity through the “BBIN” grouping of Bangladesh, Bhutan, India and Nepal. “If we are able to achieve this vision of connectivity, Asia-Pacific would account for half the world’s output,” Mr. Ali said.", 
    "section": "national", 
    "title": "India kicks off Raisina Dialogue", 
    "subsection": "general", 
    "date": "2016-03-02"
}