{
    "author": [
        "Deepa H"
    ], 
    "text": "‘TN among major contributors to Centre’s kitty’\n\nAIADMK leaders on Tuesday reacted strongly to BJP leader Prakash Javadekar’s statement that Rs. 5,000 each given by the State government to flood-affected families was from the Central government and that some were just putting their stamp on the schemes. Calling him ignorant, they said in reality, it was the Centre that is using funds collected from Tamil Nadu and distributing it among other States.\n\nA senior leader said that Tamil Nadu, Gujarat and Maharashtra were major contributors to the central exchequer and apart from income tax, the State also contributed foreign exchange, corporate tax and excise duty to the Centre.\n\n“They give our money to States declared as underdeveloped. He is ignorant of the fact that Tamil Nadu is one of the largest contributors to the Centre’s kitty,” he said adding that there was no system in India like in the US where 60 per cent of funds from the States are ploughed back.\n\nA long-time AIADMK office-bearer said the Centre had no right calling the funds its own. “We are in a federal set-up and the State has a right over funds from the Central pool. When we ask for funds for schemes including recharging ground water or building vessels for fishermen, they just keep silent for ever,” he said, adding that the amount that the Centre released for flood assistance was meagre when compared to what the Chief Minister Jayalalithaa had asked.\n\nAngry leaders also alleged that the BJP government at the Centre was spending more on States where it was in power or had supportive governments.\n\n“It is not the BJP’s personal money. It is the tax payers’ money that they gave the State. They are not doing charity,” said a leader who felt that the BJP was becoming like the Congress with leaders giving out statements on their own.\n\nOn Tuesday morning, an audio clipping called WhatsApp Bench on social media from circles that support the AIADMK too took a dig at the statement and said it was perhaps said in haste and without clarity of thought.", 
    "section": "national", 
    "title": "Javadekar ignorant, say AIADMK leaders", 
    "subsection": "general", 
    "date": "2016-03-02"
}