{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Mohamad Sidiq Gujjar, an arrested fidayeen (suicide attacker) of the Jaish-e-Muhammad (JeM) and resident of Galotia Kalan in Sialkot, Pakistan, had managed to procure an Aadhaar card during his three-month stay here to revive the outfit. During interrogation, he also confirmed the name of JeM Pathankot attack trainer as Ustad Kashif.\n\nGujjar, 17, was arrested in an operation on February 24 night in Baramulla. He and three other Jaish militants crossed the Line of Control (LoC) in Kupwara district on the night of November 24 from the Pakistan-occupied Kashmir (PoK) to launch a fidayeen attack on the Army’s 3/1 GR base at Tanghdar. In a four-hour gunfight, a major fire broke out and damaged the camp and several vehicles. One civilian and three Jaish militants were killed.\n\nDuring his one-year training at the JeM’s Syed Shah Ismail Shaheed Madrassa at Balakote, Gujjar learnt about the Pathankot attack trainer Ustad Kashif, whose name figured during the probe into the attack on the airbase.\n\n“Gujjar confirmed the name of Kashif but is too young co-relate events,” an investigator told The Hindu .\n\nGujjar’s knowledge of GPS and wireless communication devices helped him survive in the jungles for over a month as he got in touch with his handlers.\n\nHe managed to procure an Aadhaar card to “get a cover” and intended “to revive the JeM with the help of over-ground workers, including JeM militant Saifullah, in the Handwara-Kupwara belt.” Five of his associates have already been arrested.\n\n“We are investigating whether the Aadhaar card is original or fake,” Inspector-General of Police Syed Javaid Mujtaba Gillani told The Hindu .\n\nA computer operator of Kupwara is being questioned in this regard.\n\nAuthenticity of\n\ncard being probed, computer operator in Kupwara\n\nbeing questioned", 
    "section": "national", 
    "title": "JeM fidayeen had got Aadhaar card", 
    "subsection": "general", 
    "date": "2016-03-02"
}