{
    "author": [
        "National Bureau"
    ], 
    "text": "Political parties condemn divisive agenda, demand sacking of Minister of State for HRD\n\nThe alleged divisive speech of Union Minister of State in the Human Resources Development Ministry Ram Shankar Katheria at the condolence meeting for a VHP worker at Agra rocked Parliament on Tuesday, with both Houses of Parliament witnessing disruptions over the incendiary speeches purportedly made at the event against a community.\n\nMr. Katheria, however, claimed that he had not targeted any community in his speech.\n\n“What has been published in one of the newspapers is false. I had not taken the name of any community. I had said the culprits, who had murdered the VHP leader, should be given death sentence,” he said. “I had also said that the Hindu community should unite for their safety. I will send a notice to the newspaper.”\n\nThe Minister along with BJP MP from Fatehpur Sikri Babu Lal had on Sunday attended a condolence meeting held for VHP worker Arun Mahaur, who was shot dead by some youths from another community in Agra.\n\nAt the meeting the Minister had allegedly said : “This is a conspiracy that is being hatched against the Hindu community; we have to be alert to recognise it and strengthen ourselves. We will have to fight it because if we do not do it now, today we have lost one Arun, tomorrow it could be another Arun...the killers should also go, we have to set such an example.”\n\nSpeaking on the issue, Leader of the Congress in the Lok Sabha Mallikarjun Kharge accused the BJP and RSS of harbouring plans to divide the country.\n\n“They speak whenever elections are nearing. They talk about dividing the country and not uniting. If they continue to speak like this, there will be repercussions across the country. Today we are raising this issue because Prime Minister Narendra Modi and Home Minister Rajnath Singh are silent on this issue,” Mr Kharge said.\n\n“This has been the continuous, consistent and obnoxious behaviour by the Modi government. I am sure that no action will be taken,” AIMIM leader Asaduddin Owaisi said.\n\nWhile Samajwadi Party's Ram Gopal Yadav has demanded that Mr. Katheria be sacked, Congress leader Anand Sharma gave an adjournment notice in the Rajya Sabha on the matter.\n\nThe BJP, however, defended Mr. Katheria. Party secretary Shrikant Sharma said: “Katheria has made it clear in his statement that he has said nothing wrong. And after this clarification, there is nothing to comment on. I have seen his statement in which he has cleared everything. The real issue is the deteriorating law and order situation in Uttar Pradesh.”", 
    "section": "national", 
    "title": "Katheria remarks rock Parliament", 
    "subsection": "general", 
    "date": "2016-03-02"
}