{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "In a bid to promote regional literature and strengthen bonds between Punjabi and Marathi literature, the 88th All-India Marathi Literary Festival will be organised at Ghuman in the border district of Gurdaspur in Punjab between April 3 and 4.\n\nThe event is being organised by the NGO, Sarhad, which is also taking an active interest in hosting the first World Punjabi Literary Festival to be held in Pune in November this year. “This year, the theme will revolve around the ‘renewal and restoration’ of Urdu, Punjabi, Kashmiri, Bodo and Hindi languages,” said Sanjay Nahar, convener, Sarhad. Mr. Nahar said the theme of conservation of regional languages was taken up in response to English literary fests across the country, such as the Jaipur and Hyderabad literary festivals.\n\nThe literary totem of the Ghuman fest is the 14th century Varkari poet-saint Saint Namdev, who is said to have spent a significant part of his later life in Punjab. While the Sikhs, who have built a shrine for the saint at Ghuman, insist that he died there (about 1350 C.E.), the fact is historically disputed.\n\nThree-day event\n\nLast year, the three-day festival at Ghuman witnessed a grand confluence of cultures, with nearly 7,000 poets and writers across Maharashtra congregating at the event, which also found a robust and enthusiastic audience in the people of Punjab.\n\nThe World Punjabi Literary festival is being organised as a tribute to the tenth Sikh Guru, Gobind Singh, whose 350th birth anniversary is due in December this year.\n\nThe salient points of the literary festival include a discussion on relation of Punjabi language with other languages, a poetry meet and discussion on works of Guru Gobind Singh.\n\n“Punjabi artistes such as Jaswant Zafar, Gurubhajan Singh Gill and Anup Kumar have expressed their willingness to participate. Besides, the Punjabi Sahitya Akademi and other Sikh organisations across the world have ensured their full support to the festival,” said Mr. Nahar.\n\nThe theme is renewal and restoration of Urdu, Punjabi, Kashmiri, Bodo and Hindi", 
    "section": "national", 
    "title": "Literary fests to forge bonds between Punjab, Maharashtra", 
    "subsection": "general", 
    "date": "2016-03-02"
}