{
    "author": [], 
    "text": "Man whose body was found in a white yacht had been dead in its cabin for several days\n\nManfred Fritz Bajorat was found slumped at a desk in a mummified state in his yacht.— Photo: Barobo Police Station\n\nPhilippine police said on Tuesday that they were trying to determine the identity and cause of death of a man found dead while sitting slumped in a yacht that was drifting in the Pacific Ocean and which was apparently owned by a German adventurer.\n\nPolice Chief Inspector Dominador Plaza said the grey decomposing remains of the man resembled a mummy, adding mystery to his death. His body was discovered near the radio in the cabin of a white yacht found last week by Filipino fishermen off the southeastern province of Surigao del Sur.\n\nThere were no visible signs of foul play, like a gunshot or stabbing wound, Mr. Plaza said.\n\n“Initially, it looks to us that he died of natural causes, maybe a heart attack,” he said by phone. “And death appears to have come suddenly because he was still sitting by the table when he passed away.”\n\nMr. Plaza said initial estimates show the man had been dead in the hot enclosed cabin for at least several days, but that authorities were awaiting an autopsy report due this week for a more accurate finding.\n\nThe 12-m-long sailboat’s mast was broken, maybe in a storm, police said.\n\nDocuments found in the yacht showed that it was apparently owned by a German adventurer identified as Manfred Fritz Bajorat, Mr. Plaza said, adding that investigators still have to determine whether he was the dead man.\n\nMayor Felixberto Urbiztondo of Surigao del Sur’s coastal town of Barobo, where fishermen towed the damaged yacht and the body was brought, said a daughter of Bajorat called to say her family was planning to travel to the Philippines to help investigators confirm whether the man was her father.\n\nIf the man was Bajorat, Urbiztondo said the man’s family plans to have him cremated before bringing him back home. The German Embassy in Manila refused to comment and referred questions to the Ministry of Foreign Affairs in Berlin. — AP", 
    "section": "national", 
    "title": "‘Mummified body’ found off Philippines", 
    "subsection": "general", 
    "date": "2016-03-02"
}