{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "As the decks were cleared for the visit of Pakistani investigators to India to probe the attack on the Pathankot airbase, India will ask the neighbouring country about the “composition of the team” and the “contents of the evidence required by them.” India has accused the Pakistan-based outfit Jaish-e-Mohammad (JeM) of planning and executing the attack on the airbase on the intervening night of January 1-2.\n\nA senior official said the decision to let the Pakistani team access the airbase, a highly sensitive defence installation, would be taken by Prime Minister Narendra Modi and National Security Adviser Ajit Doval.\n\nAfter India gave evidence, Pakistan registered a First Information Report (FIR) a few days ago. The Counter Terrorism Division (CTD) of the Pakistani Police arrested three suspects.\n\n“The Pakistani team will come here armed with a letter rogatory (LR) issued by a court there. The LR is required to probe the case on foreign soil. Since they have made a few arrests, we will have to provide them corroborative evidence. We will be asking them to provide us the details so that we can help in the investigation,” the official said.\n\nHe said the team could come to India “any time soon.” “We are fully prepared to assist the Pakistani team. The decision to provide it access to the airbase will, however, be taken by the highest authority,” he added.\n\nThe three accused arrested by Pakistan have been identified as Khalid Mahmood, Irshadul Haque and Muhammad Shoaib. They had allegedly facilitated the attack.\n\nMinister of State (Home) Kiren Rijiju told the Lok Sabha on Tuesday: “A case has been registered [by Pakistan]. This is for the first time Pakistan has taken action. India had given evidence to Pakistan.”", 
    "section": "national", 
    "title": "Pak. team may arrive soon to probe Pathankot attack", 
    "subsection": "general", 
    "date": "2016-03-02"
}