{
    "author": [], 
    "text": "Kajol, wife of Ajay Devgn, was among the wives of artistes who have been approached by the government to persuade their husbands not to endorse pan masala products.\n\nHaving failed to get a response from four Bollywood actors, the Delhi government has now approached the wives of artistes to encourage their husbands not to endorse pan masala products as they contain areca nuts, a potential cancer causing agent.\n\nAdditional Director (Health), of the Delhi government, S.K. Arora has written to Kajol, wife of actor Ajay Devgn; Gauri Khan, wife of Shah Rukh Khan; Malaika Arora Khan, wife of Arbaaz Khan; and Suneeta Ahuja, wife of actor Govinda; asking them to persuade their husbands not to endorse pan masala products in the larger public interest.\n\n“A humble appeal to you for encouraging Mr Shah Rukh Khan not to participate in advertisements of pan masala in the larger public health interest. Earlier, a letter was written to Mr Khan requesting him not to participate in such advertisements. Nonetheless, I have not received any response till date nor has he plugged doing such advertisements”, Mr. Arora said in his letter to Ms. Gauri.\n\nHe said that even if these pan masalas do not contain tobacco or nicotine, they surely contain areca nuts (supari) and there was scientific evidence to prove that supari caused cancer.\n\n“A similar letter was sent to Ms Sunny Leone and I am delighted to inform that I have received an affirmative response with the assurance not to indulge in such promotion in future. Moreover, she is consulting the companies for the terms and conditions of the present contract to stop advertising pan masalas”, Mr. Arora said.\n\nDelhi government also urged the actors and their wives to join its anti-tobacco campaign to save the lives of lakhs of people who die from oral cancer every year.\n\nIn January, the Health Department had written to six actors — Shah Rukh Khan, Govinda, Saif Ali Khan, Arbaaz Khan, Ajay Devgan and Sunny Leone — urging them not endorse pan masala products.\n\nMr. Arora had said that they (actors) were role model for youngsters and should not participate in pan masala or similar advertisements as these attracted the vulnerable population, especially children and women and were directly and indirectly responsible for the increasing trend of tobacco use.\n\nMs. Leone’s husband, Daniel Weber, had called up to say that she would not sign any contract for such advertisements in future.\n\nAccording to experts, areca nut, the main ingredient in pan masala, is in the league of caffeine, tobacco and alcohol when it comes to addictive properties and also leads to a high number of cases of submucous fibrosis, which can easily turn cancerous. — PTI", 
    "section": "national", 
    "title": "Persuading actors, the Delhi Govt. way", 
    "subsection": "general", 
    "date": "2016-03-02"
}