{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Posters of his films on display on the street where he lived\n\nThe 224-metre stretch, where Ray spent most of his creative years, has been decorated with posters of his celebrated films such as Pather Panchali, Goopy Gyne Bagha Byne , Sonar Kella and and Nayak .— Photo: Special Arrangement\n\nBishop Lefroy Road, the street that houses the residence of renowned film-maker Satyajit Ray in south Kolkata, has undergone a makeover and now reflects a slice of the maestro’s art.\n\nThe 224-metre stretch, where the film-maker spent most of the creative years of his life, has been decorated with posters of his celebrated films like Pather Panchali , Goopy Gyne Bagha Byne , Sonar Kella and Nayak . It was inaugurated by West Bengal Chief Minister Mamata Banerjee on Monday.\n\nHeritage building\n\nThough the house on 1/1 Bishop Lefroy Road, where the Ray family still resides, has already been declared grade-1 heritage building by the city’s civic body, the makeover has seen sodium vapour lamps being replaced with antique streetlights and pavements lined with paver blocks.\n\nThere are plans to install sculpture on the street and the State government has already contacted artist and MP Jogen Chowdhury in this regard. Ms. Banerjee urged the civic body to name Lee Road, the road connecting Bishop Lefroy Road in the name of Satyajit Ray.\n\n“I would request the Kolkata Municipal Corporation to rename Lee Road after Satyajit Ray in his honour,” the Chief Minister said.\n\nShe suggested that the rechristened Lee Road will be called Satyajit Ray Dharani. [Land of Ray].\n\nSon welcomes initiative\n\n“My father spent about 22 years of his life at this house from 1972-1992,” Sandip Ray, filmmaker and son of the maestro, told The Hindu .\n\nMr. Ray, who lives in the same house overlooking Bishop Lefroy Road, welcomed the initiative and said the street was all decked up and was looking great. According to Mr. Ray, two decades after his father death still there were lot of visitors who want to see his room, his other works of art.\n\n“This is not a bad gesture to re-establish the myth. We have seen a number of such examples in Europe where there is an attempt to rebuild a place where a star or artist lived,” said Madhuja Mukherjee, Professor of Film Studies at Jadavpur University, referring to examples like Sherlock Holmes and French impressionist painter Claude Monet.", 
    "section": "national", 
    "title": "Ray’s neighbourhood gets a makeover", 
    "subsection": "general", 
    "date": "2016-03-02"
}