{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Minister launches Telangana Overseas Manpower Company Limited, a State government initiative\n\nTelangana Minister for Home, Labour and Employment, Naini Narsimha Reddy on Tuesday said that the government was pulling out all the stops in its bid to ensure that all the youth who went abroad seeking employment, especially to the Gulf nations, had some protection against touts cheating them.\n\nAddressing a press conference announcing the birth of Telangana Overseas Manpower Company Limited (TOMCOM), he said it was a cause of concern for the government that so many gullible youth were being cheated by unscrupulous elements.\n\n“I get at least two calls a day from relatives of youth who were taken for a ride. The government is setting up a helpline where the youth can register details of his employment offers, online and also call in for help,” he said.\n\n“I am told that of the estimated three crore Indians working outside the country, a sizeable of them are in the Gulf. During our visit to Dubai some time ago, several people there told me how courteous and efficient people from Telangana are. I am sure there are good times ahead, with support from the State and the Centre,” he said.\n\nMr. Reddy said during his visit to the Gulf, together with the political leadership and bureaucracy from States like Gujarat, several meetings were held in the Indian Embassy to review the situation with contractors hailing from the Gulf too. It was decided that a majority of the problems faced by Indians were only due to lack of information.\n\n“If those seeking employment abroad declare the details, the government will definitely be able to help them in times of distress,” he said.\n\nHome Secretary Rajiv Trivedi and Commissioner for Labour Harpreet Singh were also present at the announcement of the launch of the corporation. A Board of Directors for TOMCOM was constituted in June last with the Labour Minister as ex-officio chairman.", 
    "section": "national", 
    "title": "Telangana sets up manpower firm to help workers abroad", 
    "subsection": "general", 
    "date": "2016-03-02"
}