{
    "author": [
        "Vanessa Friedman"
    ], 
    "text": "In the case of womenswear, suits are treated as camouflage for femininity or armour\n\nModels wear creations for Giorgio Armani women's Fall-Winter 2016-2017 collection, part of the Milan Fashion Week, unveiled in Milan on Monday.— Photo: AP\n\nLast week, as Milan Fashion Week began, the Italian Senate voted to approve a bill legally recognizing same-sex unions, sponsored by Monica Cirinnà, a senator from the Democratic Party. The decision was applauded by Maria Elena Boschi, minister of constitutional reforms and a member of Prime Minister Matteo Renzi’s Cabinet — a Cabinet that, even before that of Prime Minister Justin Trudeau of Canada, was at gender parity.\n\nNow those women finally have something to wear (and Hillary Clinton, something to inspire her campaign wardrobe). The soft-power suit is on the rise in Milan.\n\nWhen even Antonio Marras — the champion of collage, of fantasy conjured from roses and lace and, this season, the coin-trimmed story of Adèle Hugo — combines pinstripes with his silvered appliqués, and Brunello Cucinelli, he of the Tuscan countryside idyll, tosses in some tailored herringbones refracting their own light, you know something is in the air.\n\n“What is power?” asked Tomas Maier, standing backstage after a definitive Bottega Veneta show that eschewed recent forays into athletic wear in favor of a palpably adult elegance.\n\n“Woman are powerful, not their clothes. Their clothes just enable them to feel comfortable with what they are.”\n\nHis work gave shape to his words, from long-legged swishy monochromatic trouser suits exuding poise, to belted leopard print jackets over black pants, tweed coats washed in clear sequins for shine, and long-sleeved blush-toned ballet dresses with lingerie layered on top and bound at the waist.\n\nThe texture was the indulgence, cashmeres and calfskins and gossamer knits, and the authority was in the assurance of the line.\n\nSuits are often treated as synonymous with uniforms — the common mufti of the professional class — and, in the case of womenswear, as camouflage for femininity or armor.\n\nMultiple variations\n\nBut over the weekend in Milan, designers demonstrated again and again that this is not necessarily true: there are multiple variations within the form that can convey authority without aggression, and conjure not just respect, but a fully realized vision of self. Some, admittedly, more effectively than others.\n\nAt Marni, for example, they took the form of capes, cut on the curve at the ribs, hugging the shoulders, sometimes sweeping down at the back, over balloon-sleeved shirts and pleated pants suggestive of a boardroom Musketeer, before harlequin prints and Prince of Wales plaids and jellyfish squiggles and oversize sea-creature paillettes got jumbled into the mix.\n\nIn the hands of Versace, they became no-frilled stirrup pants and skinny skirts with belted military jackets or truncated bombers, morphing into knit dresses with the same slick lines.\n\nErogenous zones were a slice of stomach, a glimpse of back (in a tuxedo suit dress, cut out from behind), and a flash of leg; the colour palette was navy and black and baby blue. — New York Times News Service", 
    "section": "national", 
    "title": "The return of the power suit, softly", 
    "subsection": "general", 
    "date": "2016-03-02"
}