{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "For the first time since 2007, Kashmir’s major tourist attraction, the Tulip Garden, with 10 lakh bulbs spread over 20 acres, is witnessing early budding and blooming, forcing the State Floriculture to advance the official opening of the garden.\n\n“Yes, if there is early blooming, it’s going to be thrown open soon,” Floriculture Department Director Talat Pervez told The Hindu .\n\nSituated at an altitude of 5,600 feet, the Tulip Garden, curated by former Chief Minister Ghulam Nabi Azad at the foothills of Zabarwan in Srinagar, came as a shot in the arm for the Tourism Department in 2008. It attracted 12 lakh footfalls in 2012 and is fast emerging as a major spring season attraction for tourists across the country.\n\nHowever, with day temperatures this year hovering around 20 degrees Celsius in February for the first time in 76 years — a good 10 degrees above normal — the garden is witnessing fast budding.\n\n“Around 1000 bulbs are at an advanced budding stage already. Most bulbs may flower by the second week of March if the weather stays as warm,” said Imran Ahmad, Assistant Floriculture Officer.\n\nMr. Ahmad said the garden recorded early blooming in 2008 when it was thrown open around March 25.\n\n“However, for the past three years, the garden has been opened only around April 1. In the recent past, Netherlands too saw a delayed blooming by a month. The flowering is subject to weather and this year it may advance in the Valley by around 10-15 days,” he said.\n\nWith its origin in Persia, the tulip has travelled a long way to add colour and charm to the Valley. Kashmir’s tulip garden, compared to Holland’s Keukenhof, hosts more than 70 varieties of different colours, which bloom in the last week of March. The blooming extends till May.\n\nLast year, despite rumours of floods, around 1.2 lakh tourists visited the garden during the blooming season. The footfall was around 1.6 lakh in 2014. Crafts and food festivals are organised during the tulip season, creating a festive atmosphere.\n\nThe Valley has recorded the warmest winter in 76 years", 
    "section": "national", 
    "title": "Warming early, Srinagar’s tulips rush into bloom", 
    "subsection": "general", 
    "date": "2016-03-02"
}