{
    "author": [], 
    "text": "When they were born premature in 1912, doctors gave Paulette and Simone the slimmest chance of survival. But 104 years later, the French twins say there’s a simple secret to their longevity: sticking together.\n\nWith their long white hair tied back in ponytails and gold spectacles perched on their noses, Paulette Olivier and Simone Thiot are happy to pose for the camera at their retirement home in Onzain, central France.\n\n“This will be fun!” they say in chorus.\n\nThere is no official confirmation that Paulette and Simone are the oldest twins in France, but they appear to be the likely holders of the title.\n\n“We’re being very spoiled,” one of them says as they show off the flowers given by the local council and fellow retirement home residents to mark their 104th birthday.\n\nPaulette and Simone were born in the central village of Limeray at 11 am on January 30, 1912 to Marie Lamolie, a dressmaker, and her husband Joseph, a carpenter.\n\nTheir entry to the world did not bode well.\n\n“We were premature,” says Simone, who can still get around these days without the help of a Zimmer frame.\n\n“We were due in March but we were born in January. They gave us a very small chance of surviving. I didn’t even weigh a kilo. And you, just three pounds (1.36 kg),” she says to her sister, while adding that “they had to keep us wrapped up for four months.”\n\nPaulette, widowed at 36, worked as a hairdresser for 15 years in Algeria, then in Paris. Simone, a dressmaker like her mother, lost her husband when she was 64. Neither had any children.\n\nThe twins, whose only brother died in accident at the age of 99, insist it’s their lasting friendship that has kept them going all this time. “We are still alive because we have always stayed close,” says one. “We keep our independence — each of us has her own room — but we only need to cross the corridor to see and talk to each other. We pity old people who are alone with no one to visit them.”\n\nPaulette and Simone spend their time keeping up with current affairs, reading, watching television and listening to music. Simone also regularly writes poems which she keeps in a notebook. Any other tips for a long life? “A simple life — no excess. No alcohol. And lots of sport.” — AFP\n\nFrench centenarians, born as premature twins, are leading a healthy life", 
    "section": "national", 
    "title": "104-year-old twins say closeness is the secret", 
    "subsection": "general", 
    "date": "2016-02-14"
}