{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "As the People’s Democratic Party (PDP) prepares for the 40th congregational mourning day for the late Chief Minister Mufti Muhammad Sayeed on February 15, the party expects a breakthrough on the government formation with the alliance partner BJP soon.\n\nTop PDP sources confirmed the development stating, “the next week will see a significant headway on government formation”.\n\nJammu and Kashmir has been under Governor’s rule since the death of the Chief Minister on January 7.\n\nSources said the two parties had “covered significant distance” in ironing out differences on the implementation of the common minimum programme, the “Agenda of the Alliance”.\n\nHowever, the BJP is yet to make public any assurance or concession to PDP president Mehbooba Mufti to pave the way for the continuation of the coalition government.\n\nAfter Sayeed’s demise, Ms.Mufti not only accused the BJP of “not treating her father well” but sought confidence building measures as a precondition for government formation in the State.\n\nThe PDP has sought assurances on the implementation of both political and developmental aspects of the joint agenda by fast-tracking the return of power projects to the State and relocation of troops.\n\nSources said the PDP expected BJP national general secretary Ram Madhav to visit Ms.Mufti on the 40th mourning day “to restart the stalled communication over the government formation”.\n\nThe thaw in the frayed relations between the alliance partners was visible in Jammu this week when senior PDP and BJP leaders got together for a dinner party. However, they termed it “an apolitical affair”. Local BJP leaders have shown no opposition to Ms. Mufti taking over as the next Chief Minister.\n\nThe BJP’s central command in New Delhi has held several rounds of talks with the local BJP leaders and remains indecisive on how to reach out to the PDP without extending any concession beyond the alliance’s agenda.\n\nThe two parties joined hands in March last year to form the government in the State after a fractured mandate.", 
    "section": "national", 
    "title": "Breakthrough in J&K govt. formation talks likely soon", 
    "subsection": "general", 
    "date": "2016-02-14"
}