{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court Collegium led by Chief Justice of India T.S. Thakur has recommended transfer of High Court judges across the country.\n\nJudges from various High Courts, including Madras, Karnataka, Allahabad, Delhi, have been recommended for transfer to other High Courts at a collegium meeting held on February 11, sources said.\n\nAmong these judges, Justices R. Sudhakar and C.S. Karnan have been recommended for transfer to Jammu and Kashmir High Court and Calcutta High Court, respectively. Justice Sudhakar is sought for transfer for administrative reasons.\n\nCJI Thakur had on Friday, without elaborating, told senior advocate K.K. Venugopal appearing for the Madras High Court's Registrar-General that a decision has been taken about Justice Karnan. The Chief Justice Bench is scheduled to hear a plea by the High Court's Registry on a letter by Justice Karnan accusing High Court Chief Justice Sanjay Kishan Kaul of caste discrimination.\n\nThe Ministry of Law and Justice will now process the current Collegium recommendations.\n\nFollowing the logjam created by the litigation on the National Judicial Appointments Commission laws, the judiciary is at this point of time battling rising vacancies in High Courts which has touched over 400. It is learnt that the Chief Justice of India has written to High Court Chief Justices to suggest names of persons suitable for appointing to the High Court Benches. CJI Thakur had said that filling up the 400 judicial vacancies in High Courts would be a “big challenge” in 2016. He had however said he was in favour of striking a balance between regional representation and merit while appointing judges.\n\nIn the Supreme Court, with the retirement of Justice M.Y. Eqbal on February 12, the number of vacancies havenow gone up to six. This year would see a possible crisis in numbers with five more Supreme Court judges retiring — Justice F.M.I. Kalifulla in July, Justices V. Gopala Gowda and C. Nagappan in October and Justices Anil R. Dave and Shiva Kirti Singh in November.\n\nCJI Thakur himself would be retiring in January 2017. He will be followed by Justice J.S. Khehar (the Chief Justice of India-in-line as per seniority norm) in August 2017, Justices P.C. Ghose and Prafulla C. Pant. The Collegium's steps show urgency as the Union Law Ministry is still in the process of collecting feedback from the State governments and High Court Chief Justices for the preparation of a new Memorandum of Procedure for transfer and appointment of judges.", 
    "section": "national", 
    "title": "Collegium recommends transfer of HC judges", 
    "subsection": "general", 
    "date": "2016-02-14"
}