{
    "author": [
        "Smita Gupta"
    ], 
    "text": "BJP’s goal is to forge a coalition that can win Assam\n\nIn the coming Assembly elections in Kerala, Assam, West Bengal, Tamil Nadu and Puducherry, the Congress has more at stake than the Bharatiya Janata Party (BJP), as it will be defending its governments in Assam and Kerala.\n\nFor the BJP that is not in power in any of the five States — indeed, not even the principal adversary — its goal is to forge a coalition that can win Assam while increasing its footprint in the other States.\n\nAll eyes are now on Assam, where the BJP has already tied up with the Bodoland People’s Front (BPF) and is currently negotiating with the Asom Gana Parishad (AGP). The BJP, learning from its error in Bihar when it had pinned its hopes on the charisma of Prime Minister Narendra Modi, has announced a chief ministerial candidate, Union Minister Sarbananda Sonowal, who was with the AGP till 2011. In addition, last year, senior Congress leader Hemanta Biswa Sharma and nine party MLAs crossed over to the BJP.\n\nThe Congress that has been in power in the State for 15 years, on the other hand, after toying initially with the possibility of having an electoral arrangement with the All India United Democratic Front (AIUDF) — a party that largely represents Muslim interests in the State — has announced it will go it alone: party sources said that a tie-up with the AIUDF would only help the BJP to polarise the votes.\n\nThe Congress is pinning its hopes, party MP Tarun Gogoi said, on the BJP currently being a “divided house,” with Mr. Biswa Sharma unhappy with the elevation of Mr. Sonowal, and unhappiness among the core workers of the party with the Central leadership’s reneging on the party’s traditional position on the Indo-Bangladesh Boundary Agreement.Divisions in Assam BJP\n\nQuestioned about the divisions within the BJP’s State unit, a senior BJP functionary told The Hindu , “The reasons that resulted in the exodus of Congress MLAs from that party has not vanished: the Congress’s ability to represent a range of interests has shrunk, whereas we, apart from our traditional ideological growth, have new additions — Sonowal, who comes from the AASU-AGP and Mr. Biswa Sharma who brings part of the Congress vote. We have emerged as the principal opposition in Assam.”\n\nIf the Congress is in trouble in Assam, in Kerala, where it leads the United Democratic Front (UDF) government, its State unit is grappling with the possibility of the impact of a tie-up between the Left Parties and the Congress in West Bengal. If that happens, its State leaders say, its battle against the Left Democratic Front in Kerala will not only lose its sharpness, it might also help the BJP open its account in Kerala.\n\nIn West Bengal, the BJP is planning what it describes as a soft Hindutva campaign, even as it will highlight the Trinamool government’s “appeasement” of Muslims. The Prime Minister will visit the Gaudiya Math for its centenary celebrations in Kolkata on February 21 to send a message to Hindus in the State. The party will also reach out to followers of Ramakrishna Mission that has a one crore-strong following in West Bengal.\n\nIn Tamil Nadu and Puducherry, the Congress that appears set to strike an electoral deal with the Dravida Munnetra Kazagham, will remain a minor player.\n\nAs will the BJP that is yet to finalise its electoral plan for the two States.", 
    "section": "national", 
    "title": "Cong. has more at stake than BJP in coming Assembly polls", 
    "subsection": "general", 
    "date": "2016-02-14"
}