{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The F-16 Fighting Falcon is one of the most modern fourth generation aircraft in service.\n\nThe U.S. decision to sell F-16 fighter jets to Pakistan will not alter the military balance in the region, but it will reinforce the centrality of Pakistan’s Army, experts say.\n\nThe F-16 fighting Falcon is one of the most modern fourth generation aircraft in service, and over 4,400 aircraft of the model have been produced so far and are in service with 25 countries.\n\nThe Indian Air Force has a large number of fourth generation-plus Sukhoi-30 aircraft which can more than handle the F-16s, an Air Force officer said.\n\nThe F-16 was in the race for the medium multi-role combat aircraft (MMRCA) contract, but lost to the French Rafale. The U.S. is still pitching the aircraft for the Indian Air Force under the “Make in India” initiative.\n\nThe Defence Security Cooperation Agency, which coordinates foreign arms sales, said: “The proposed sale improves Pakistan’s capability to meet current and future security threats” and the fighter jets are specifically meant to “enhance Pakistan’s ability to conduct counter-insurgency and counterterrorism operations”.\n\nThe sale of the aircraft to Pakistan, a major cold war ally of the U.S. in South Asia, is not new. It dates back to 1982 when the Reagan administration sold the first batch of aircraft when General Zia-ul Haq was the military ruler.\n\nForty fighter jets were transferred when the Pressler amendment to the Foreign Assistance Act stalled further sales because of concerns over Pakistan’s nuclear weapons programme.\n\nHowever, after the 9/11 terror attacks in the U.S. and Pakistan emerged as the number one ally in the war on terror, the sales resumed. A deal for 18 F-16 Block C/D aircraft was signed in 2006 with an option for more.\n\nThe US also gave 14 used F-16 aircraft free of cost in 2012. In 2013, Pakistan announced its decision to buy 13 second-hand F-16 from Jordan, and the delivery started last year.\n\nCompared with the older version, the latest F-16 Block C/D is an entirely new aircraft with significant new capabilities.", 
    "section": "national", 
    "title": "F-16 sale won’t alter military balance", 
    "subsection": "general", 
    "date": "2016-02-14"
}