{
    "author": [
        "Varghese K", 
        "Suhasini Haidar"
    ], 
    "text": "The U.S. decision to sell Pakistan eight F-16 fighter jets has been imminent for some months, as the State Department informally told Congressmen about the proposal in April 2015. The deal came to light during Prime Minister Nawaz Sharif’s visit to Washington last October.\n\nIn December, when the Obama Administration issued a formal notification of “foreign military financing”, several Congressmen put up stiff opposition to the deal. Friday’s notification means the U.S. Congress has 30 days to veto the transfer of F-16, but that is a veto rarely used after the State Department’s clearances and can be overruled by President Obama. U.S lawmakers are under immense pressure from Lockheed Martin, the company that manufactures F-16s, say sources familiar with the circumstances.\n\nIn a letter on February 9, Republican Senator Bob Corker, who is the chairman of the Senate Foreign Relations Committee, told Secretary of State John Kerry that he and other lawmakers would block any move to subsidise the sale through the U.S.’s counter-terror reserve funds.\n\n“I do not want U.S. taxpayer dollars going to support these acquisitions,” Mr. Corker said in an interview after returning from Afghanistan. “While we’re spending tremendous amounts of U.S. dollars and certainly tremendous sacrifice in our men and women in uniform and by other agencies, they [Pakistan] are working simultaneously to destabilise Afghanistan.”\n\nIn a separate letter, Republican Ted Poe and Democrat Tulsi Gabbard objected to the sale, arguing that Pakistan had not stopped supporting terror groups targeting India despite committing to that in exchange for U.S. military aid. India has consistently opposed the transfer of F-16s to Pakistan, as opposed to the transport planes C-130, because of their lethal capabilities, ever since the U.S. began supplying them to the neighbouring country in the 1980s.", 
    "section": "national", 
    "title": "Fighter deal with Pakistan has been in the making for many months", 
    "subsection": "general", 
    "date": "2016-02-14"
}