{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "Major Iqbal, serving officer of the Pakistani Army, asked David Headley to “cultivate relations” with the former Shiv Sena worker, Rajaram Rege, after the American-Pakistani terrorist forwarded him an email he had received from Rege on May 19, 2008.\n\nMajor Iqbal also asked whether Rege would be “generating any worthwhile information on Indian military and paramilitary forces.” He told Headley to keep Rege “engaged” by sending him to conferences and seminars in the U.S.\n\nHeadley also forwarded Rege’s email to LeT commander Sajid Mir on May 19, 2008, to seek his advice on the “probable use” of Rege in their mission. However, the email was sent to al-Qaeda operative Major Pasha on May 25, 2008.\n\nAsked by special public prosecutor Ujjwal Nikam about the motive behind sending Rege’s email to all these people, Headley said Rege would be of use to different people in different ways. For Major Iqbal, Rege would be of use to strengthen the cover and know more about the military and for Major Pasha and Mir, Rege could be of use in planning another attack. Using code language and code words through emails exchanged with Mir, Headley kept asking about the safety of LeT founder Hafeez Saeed and the 26/11 mastermind and LeT chief operational commander, Zakhir-ul-Rehman Lakhvi. Mir also sent an email to Headley, mentioning the plan of an attack. “There is an investment plan, not in Rahul’s city, but at a place nearby.” He explained that the “investment plan” referred to a plan of attack, and the word Rahul referred to Rahul Bhatt, son of filmmaker Mahesh Bhat, with whom Headley had got acquainted during his Mumbai visits. He said: “Rahul’s city” meant Mumbai, and thus the plan was to attack some place near Mumbai.” He also said that since he could not meet Mir after that, he was not aware of the place which was to be targeted by the LeT.\n\nMr. Nikam concluded his examination-in-chief of the accused turned approver in 26/11 attacks. The matter has been adjourned to February 22 for cross-examination.", 
    "section": "national", 
    "title": "Headley was told to ‘cultivate’ Rajaram Rege", 
    "subsection": "general", 
    "date": "2016-02-14"
}