{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "Prime Minister emphasises 4Ds — deregulation, democracy, demography and demand\n\nShowcasing India as a land of immense opportunities, Prime Minister Narendra Modi on Saturday told representatives from 68 countries participating in the Make in India Week that India was blessed with Democracy, Demography, and Demand. His government had added Deregulation making it a four-dimensional India waiting for foreign investment and manufacturing companies.\n\nSpelling out the potential of the market before foreign investors, Mr. Modi said, “50 of our cities are ready for setting up metro rail systems. We have to build 50 million houses. The requirement of road, rail, waterways is enormous. There is no time for incremental changes. We want a quantum jump.”\n\nHarnessing growth\n\nHe said India was committed to harnessing its growth potential in a cleaner and greener way.\n\n“That is why we have made a commitment to the world community at the recent COP-21 meeting in Paris. Hence we are going for renewable energy in a big way – 175 gigawatts,” Mr. Modi said, flagging off the first ever such event since he launched the Make in India initiative in September 2015, at the National Sports Club of India stadium at Haji Ali in South Central Mumbai.\n\nThe Prime Minister said he laid great emphasis on zero defect and zero effect manufacturing.\n\n“We place high emphasis on energy efficiency, water re-cycling, waste to energy, clean India and river cleaning. These initiatives are directed at improving quality of life in cities and villages. These initiatives provide you additional avenues for investment in technologies, services and human resources,” he said at the end of a colourful ceremony punctuated with cultural performances by dancers.\n\nExplaining his government’s attempts to put into practice his slogan “minimum government, maximum governance,” Mr. Modi said his government at the Centre, and various State governments had taken several steps since September 2015 to make their regulations industry-friendly to encourage foreign direct investment and manufacturing.\n\nFDI inflows\n\n“India is perhaps the most open country for FDI. Most of the FDI sectors have been put on automatic approval route. Our FDI inflows have gone up by 48 per cent since the day my government came into office. In fact, FDI inflow in December 2015 was the highest ever in this country. This is, at a time, when global FDI has fallen substantially.”\n\nHe said the initiative had started yielding results, with India achieving highest ever electricity generation, production of motor vehicles, highest software exports in 2015 and had jumped several ranks in global indexes as the most attractive destination for investment.\n\nHe said the manufacturing growth rate had improved from 1.7 per cent in April 2014 to 12.6 in the current quarter.", 
    "section": "national", 
    "title": "India, a land of great opportunity: Modi", 
    "subsection": "general", 
    "date": "2016-02-14"
}