{
    "author": [
        "Mohit M"
    ], 
    "text": "Just over half of Karnataka’s tigers roam amid the woods and shrubs of Bandipur and Nagarahole. The tiger census report, released early last year, showed the State topping the charts with the presence of 406 tigers. However, the yet-to-be-released reserve-wise list shows that 1,517 sq km of forest patches of Bandipur — which now houses the second largest population of tigers in the world — and Nagarahole Tiger Reserve have 221 tigers in their confines.\n\nIn all, the enumeration of tigers in reserves where Project Tiger has been implemented shows that more than three-fourth of the State’s big cat population resides in the nearly 3,500 sq km area encompassed by the five reserves.\n\n“The southern corridor has contiguous forests, which is a very good tiger habitat. The increased protection and conservation seen over the past decade have started paying dividend,” said Ravi Ralph, Principal Chief Conservator of Forests (Wildlife).\n\nY.V. Jhala, principal investigator from Wildlife Institute of India (WII), Dehradun, which came out with the results, believes that there is a need to focus on tiger corridors to ensure that the forests do not reach a saturation point.\n\n“Nagarahole and Bandipur are doing very well in terms of protection of tigers. But if saturation is reached, tigers will need corridors to move to other areas. The Nilgiri biosphere can absorb some of these tigers, but the key is to establish corridors northwards towards Bhadra and M.M. Hills.”\n\nThe need is already seen in the Nagarahole tiger reserve, where tiger sightings in coffee plantations near Madikeri have increased. “There is definitely a need to take precaution and estimate tigers outside Nagarahole,” said H.C. Kantaraju, Director of the reserve.\n\nOn the flipside, the presence of a relatively-verdant corridor between the BRT Reserve and M.M. Hills has seen migration between the reserves. Officials estimate that many of the 14 tigers in the M.M. Hills and Cauvery originated from Biligiri Ranganatha Temple.\n\nThe more impressive increase has been seen at the BRT Reserve at Chamarajanagar, which now houses 68 tigers. “This is a tad higher than our estimate of around 60 tigers. The protection measures are good, and so, the tiger population remains good,” said S.S. Lingaraju, director. The reserve borders the Satyamangala Tiger Reserve in Tamil Nadu, which has also seen an increase in tiger population.\n\nNeed for more reserves\n\nActivists have pointed out that the encouraging tiger populations in BRT and other areas will need declaration of more tiger reserves to sustain the populations — primarily M.M. Hills, Cauvery Wildlife sanctuaries and Kudremukh.", 
    "section": "national", 
    "title": "Karnataka home to 406 tigers; half of them in Bandipur and Nagarahole", 
    "subsection": "general", 
    "date": "2016-02-14"
}