{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Actor James Hyndman (left) and director Denis Cote pose during a photocall to promote Boris without Beatrice at the 66th Berlinale International Film Festival on Friday. (Below) Michael Shannon, Jaeden Lieberher and Kirsten Dunst at a promotion for Midnight Special at Berlinale.— Photos: Reuters/AFP\n\nArt cinema with arty touches. Plus, art cinema with blockbuster touches\n\nAnd the award for the best opening shot goes to... Denis Côté’s Boris Without Beatrice . A tall, lean, bald man stands in a meadow, looking at... something. And then we see, over the trees beyond, a helicopter. Is it coming to pick him up? Is this the most verdant airstrip in the history of aviation? But no. It doesn’t descend. It nears the man and just... hovers. The rotors whip up wind that flattens the grass, the man’s black suit, but he just stares at the helicopter, which seems to stare right back. It may be the first man-versus-machine who-blinks-first face off. And then we cut to a woman playing a harp. Add to this the mysterious note — “ Meet me at the quarry at 11 pm... Alone ” — that appears mysteriously in the man’s mailbox, and you have a genuine head-scratcher. Just what the hell is going on?\n\nToo many “art films” these days settle for being pared-down versions of mainstream movies. They give the impression of not pandering, not compromising, but their narrative arcs are the same, give or take a few ellipses, some unflattering camerawork, a slower pace, and looking beyond stars for more actorly actors.\n\nBoris Without Beatrice restores your faith in art cinema — the film keeps reshaping itself in your head as you watch it. On the surface, it is the story of a man — Boris (James Hyndman) — who’s having an affair while his wife Beatrice (Simone-Élise Girard) struggles with melancholia. He has an affair with the caretaker too. He doesn’t get along with his daughter. He rarely visits his mother.\n\nIn short, the women around this arrogant, selfish man are his victims. Boris, then, is ripe for a reawakening. And who better for the job than his... conscience? I knew I was warming up to this movie when this conscience – if it is that – appeared like a Lynchian spectre, dressed in a dazzlingly ornate kurta-pyjama .\n\nAllegorical allusions abound. Conscience-Man narrates the story of Tantalus, doomed to eternal punishment. Even the names of characters are from myth. There’s someone named Tristan, who, in the legend, fell for another man’s woman, much like Boris. There’s an enactment of a scene from the story of the siblings Orestes and Electra, who plotted the murder of their parents, a scenario that no doubt plays out in the fantasies of Boris’s sullen daughter. Then there’s Beatrice, the cause for Dante’s descent into (and escape from) hell. Boris himself is mocked as being as rich as Croesus.\n\nAll of which brings us back to the modern day, and the question: What was the deal with the helicopter, and who was in it? I’ll tell you after a second viewing.\n\n* * *\n\nAn actor’s face is sometimes reason enough for a movie’s existence. Michael Shannon is one of those actors, he has one of those faces. He looks like George Clooney being torn apart by inner demons. It’s a face that demands a Bergman or a Dreyer to study it, though director Jeff Nichols comes close in Midnight Special , which is not about a television programme airing adult entertainment after the oldies have gone to bed. But what is it? Ostensibly something that begins when an eight-year-old boy is abducted someplace in Texas.\n\nBut this is really less about the story than the form. Just when you thought you’d seen every imaginable genre mash-up, we get this... Splash -like fish-out-of-water comedy meets E.T.- like alien-needs-to-go-home sci-fi heart-warmer meets Stephen King’s kid-with-freaky-powers shocker meets FBI-chasing-down-criminals thriller meets father-son road movie meets apocalyptic summer movie meets Big Love -like drama about a hermetic cult. Plus, one of the most imaginative spaceships (a space city, really) in all of cinema. As the Sam Shepard character says, “You all have no idea what you are dealing with, do you?” I couldn’t blink.\n\nBut be warned. Unlike other films with one (or more) of these elements, Midnight Special is very deliberately paced – it’s almost as if Nichols set out to make an anti -blockbuster. (If you’ve seen Take Shelter , the earlier collaboration between Nichols and Shannon, you’ll know what to expect.) Like most films at this festival, there’s at least one bit of contemporary resonance. When questioned about hoarding guns, the leader of the cult replies, wryly, “It’s not a crime to own firearms in this country.” Tell that to the parents of the two 15-year-old Arizona schoolgirls found dead from gunshots.\n\nDespite the big names – Adam Driver, Joel Edgerton, Kirsten Dunst – it’s Jaeden Lieberher, as the boy Alton, who owns the movie. How far we’ve come from the moppety, overly precocious child actors that were once everywhere! At least Shannon has four decades of earthly experience. Where do these children, who have barely begun to live , draw their emotions from?", 
    "section": "national", 
    "title": "Myths and genre mash-ups", 
    "subsection": "general", 
    "date": "2016-02-14"
}