{
    "author": [
        "National Bureau"
    ], 
    "text": "Consultation process soon to frame first ‘publicly accessible’ Science and Technology policy\n\nPresident Pranab Mukherjee said on Saturday that the government would soon initiate a nation-wide consultation process for framing India’s first ‘publicly accessible’ Science and Technology policy and emphasised the need for consistent encouragement for youth to pursue research and innovations in their chosen fields.\n\nThe new science and technology policy, called Vision S&T 2020, would articulate the country’s future towards technological independence and self-reliance in the 21st Century, the President said, indicating that it would supercede the Science, Technology and Innovation Policy initiated by the government in 2013.\n\nCommitting to continue investment in basic sciences, Mr. Mukherjee said science must be used to transform our society, citing the example of technological advancements that could help reach banking services to the poor.\n\n“India has over 210 million households with more than 140 million households in the rural areas. People residing in rural hinterlands do not have easy access to the banking services and related facilities. Mobile banking is increasingly seen as a tool that holds the power to bridge the gap between banked and unbanked individuals,” the President said, after conferring the Infosys Science Foundation awards in the capital.\n\nStressing that science and technology was a priority for India from the early days of Independence, Mr. Mukherjee said: “As early as 1951, the country decided to set up an Atomic Energy Commission which has enabled India build her own reactors.”\n\nFormer Infosys CEO and president of the Foundation, S.D. Shibulal, said India’s initial focus on research and development after Independence helped the country gain self-sufficiency in several aspects.", 
    "section": "national", 
    "title": "‘Need to encourage youth to pursue research’", 
    "subsection": "general", 
    "date": "2016-02-14"
}