{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "Pakistani-American terrorist fails to recognise from tapes voice of Indian link in 26/11 attacks\n\nWith the death sentence of Mohamad Ajmal Kasab, the lone Lashkar-e-Taiba (LeT) operative who was captured during the 26/11 Mumbai terrorist attack, having been carried out, India’s only hope to nail Syed Zabiuddin Ansari alias Abu Jundal was the Pakistani-American Lashkar operative David Coleman Headley, who, through a plea bargain, was turned into an approver in the case and was made to depose via video conferencing before the court of judge G.A. Sanap here.\n\nBut after five days of deposition, the National Investigation Agency (NIA) and prosecutor Ujjwal Nikam could not extract any information on Abu Jundal from Headley. In fact, on Saturday, when tapes of recorded conversations of LeT handlers directing the 10 terrorists involved in the terror attack were played out before the court, Headley could not even recognise Abu Jundal’s voice.\n\nHeadley, however, identified the voices of LeT handler Abu Kahaffa and Abu Al Kama and LeT commander Sajid Mir. Jundal is a key arrest for India in its effort to establish the complicity of Pakistan’s involvement in funding terrorist organisations to carry out attacks in India.\n\nOn the last day of his examination-in-chief, Mr Nikam made Headley hear a voice recording that was played to him by Mir on a laptop. This was done to identify the voice.\n\nThe conversation between the handlers and terrorists on November 26, 2008 was carried out in Pakistani Punjabi with a few words of Urdu being used.\n\nThe first part of the recording started with a person greeting the other, “ Salaam Valekum and the other replying with “ Valekum Asalam .” On being asked by the prosecutor to identify the voices, Headley said, “The quality of the audio is very poor.”\n\nHe was then made to hear the other part, which had the lines, “ Saare Vaade Poore Karo, Jannat Bahut Khoobsurat Hain [Fulfil all your promises, heaven is very beautiful].” Headley said it is either spoken by by Abu Khaffa or Abu Al Kama.\n\nThe other part of the same conversation had two voices, of which one was recognised as Mir’s by Headley. Mir had said, “ Haanji Veer, Kya Haal Hain ?” [Hey Veer, How are you?] He was then made to hear, “ Allah Aapka Kaam Kabool Karein [May God Accept Your Aspirations] Bahut Saare Logon Ke Zakham Par Marham Rakha Gaya Hain [Many people’s grief must be avenged]. Jo Dua Aapko Batayi Thi Who Bhoolni Nahin Hain [Don’ forget the prayers]. Jahaan Bhi Jao Dua Teen Baar Zaroor Padhna [Wherever you are, must recite the prayers three times].” Headley recognised this voice to be that of Kahaffa.\n\nWhen the last part of the conversation was played, it ended with “ Jannat Inshallah Yahan Se Bahut Behtar Hain [Heaven, god willing, is much better].” Headley said it had voices of three to four people whom he could not recognise. During the recording, one person informed the other about the death of the chief of the investigating agency. When Headley was asked to identify that voice, he said, “I don’t understand the content. The quality is very poor,” and then said, “It sounded like Abu Al Kama’s voice.”\n\nNo questions were asked about Abu Jundal who was also appearing virtually in court through video conferencing after being lodged in Arthur Road Jail for being part of the conspiracy in the 26/11 attacks. The prosecutor did not even mention the name of Jundal or ask any question even remotely related to Jundal during the testimony of Headley and concluded his examination-in-chief.", 
    "section": "national", 
    "title": "No breakthrough in bid to nail Jundal", 
    "subsection": "general", 
    "date": "2016-02-14"
}