{
    "author": [], 
    "text": "The decision to sendR.K. Pachauri on leave, instead of suspending him, has been opposed by the alumni of TERI University.\n\nR.K. Pachauri on Saturday faced more heat with the alumni of TERI University attacking the governing council’s decision to send him on “paid leave” against their demand for his removal or suspension in the wake of serious sexual harassment allegations against him.\n\nTo continue protest\n\nA statement issued on behalf of about 350 alumni of the TERI University said they had decided to continue their protest and to seek government’s intervention, if needed.\n\nThey expressed unhappiness over sending Mr. Pachauri — who is fighting a legal case of sexual harassment filed against him by a former employee — on an indefinite leave.\n\nOn Friday, the governing council of TERI met and nudged Mr. Pachauri to go on leave from the green body as well as its governing council until its decision was reviewed given the subjudice nature of the matter.\n\nThe alumni perceived the decision by the Council as a step to cool the current protests because it not only opens the possibility of his joining the institute anytime the Governing Council deems appropriate but also keeps the channel of influencing the witnesses indirectly.\n\nThe alumni group had submitted a letter to TERI’s governing council on February 10 demanding his suspension from the green body and also started an online petition to mobilise support against him.\n\nIn another development, former Competition Commission chief Ashok Chawla was appointed Chairman of TERI on Friday after incumbent B.V. Sreekantan resigned in the midst of current controversies.\n\nOn February 11, Mr. Pachauri had proceeded on leave from TERI University after students refused to receive degrees from him.\n\nMr. Pachauri had said that he would not be part of the varsity’s convocation which is scheduled to take place on March 7. — PTI", 
    "section": "national", 
    "title": "Pachauri continues to face heat", 
    "subsection": "general", 
    "date": "2016-02-14"
}