{
    "author": [
        "P Samuel Jonathan"
    ], 
    "text": "Collector and District Magistrate of Guntur Kantilal Dande has been summoned by the National Commission for Scheduled Castes in the case relating to the suicide of Rohith Vemula, a Dalit research scholar of the University of Hyderabad, on January 17. Mr. Dande is leaving for New Delhi to be present before the Commission on February 15.\n\nThe NCSC has issued notices to the Chief Secretary, Telangana, the Vice-Chancellor, University of Hyderabad, and the Commissioner of Police, Cyberabad, to be present with all relevant documents.\n\nThe NCSC decision to issue notices comes in the wake of a petition filed by Radhika Vemula, mother of Rohith, over the alleged discrimination faced by him on the campus causing him to take his life.\n\nThe NCSC has also taken cognisance of the controversy which erupted over the caste of the deceased scholar and the subsequent inquiries by both the Andhra Pradesh and Telangana governments.\n\nIt began with the ABVP and other BJP-affiliated organisations questioning the validity of the SC certificate produced by Rohith during his admission in UoH. The Telangana police and A.P. revenue officers soon launched an inquiry.\n\nTop police officials from the Cyberabad Police Commissionerate have visited Gurazala and Guntur and spoken to Rohith’s father and his grandfather and recorded their statements.\n\nRevenue sources in Guntur said that a SC certificate was issued in the year 2004. Another certificate was issued in 2014 through Mee Seva, an online government portal.\n\nWhile Ms. Radhika stated that she belonged to the SC (Mala) community and had brought up her three children in a Dalit colony, her estranged husband Mani Kumar claimed that Rohith inherited his caste, Vaddera, listed as an OBC community.\n\nLater, it emerged that Radhika, born to Dalit agricultural coolies, was adopted by one Anjani Devi and was married to a man from OBC community.\n\nThe NCSC also questioned the top police and revenue officers on the Action Taken Report on the recommendations made by the Commission dated January 20.", 
    "section": "national", 
    "title": "Rohith suicide: Scheduled Castes panel summons Guntur Collector", 
    "subsection": "general", 
    "date": "2016-02-14"
}