{
    "author": [
        "Ruth La Ferla"
    ], 
    "text": "A model shows a lines from Coach as an example of frontier-chic aesthetic that is suddenly entrenched in men’s fashion.— Photo: NYT\n\nIf there is anything more unnerving than the sight of a greasy black grizzly lumbering your way, it’s the look of that grizzly, dismantled and slung like a poncho across Leonardo DiCaprio’s brawny back, its head intact — a 100-pound souvenir of his character’s trials in the wild.\n\nThat bear coat is one of the more eye-catching numbers to drape Hugh Glass, Mr. DiCaprio’s trusty mountain man in the frontier epic The Revenant .\n\nThe Alejandro González Iñárritu film, set in the Missouri wilderness of the early 1800s, is an ode to the survivalist ethos and, by extension, a frontier aesthetic as much entrenched these days in the twin realms of pop culture and fashion as it is in the national psyche.\n\nWarding off bear attacks, Indian raids and catastrophic snowstorms, the film’s characters, in their patched skins, whip-stitched blankets, frock coats and breeches, made a compelling, if inadvertent, fashion statement — one being simultaneously echoed in the world of style. Its appeal these days seems all but inescapable.\n\n‘Heroic and simple’\n\n“There is something heroic to these men living in nature and dressing in a simple, natural, organic fashion,” said Jacqueline West, the Oscar-nominated costume designer of The Revenant .\n\nAs Ms. West pointed out, it’s hard at times to sort the characters in their woollens, badger and buffalo hides from the animals around them.\n\n“They are part of the natural world,” she said. “They almost become the animals that they’re hunting,” their natural camouflage “speaking to a sense of preservation in us.”\n\nA similar survivalist swagger materialised a year ago in the fall 2015 men’s collections, the mood expressed in the outdoorsy, performance-wear of brands like Stone Island; Acronym, a German cult favourite; and White Mountaineering, a Japanese label, each built on so-called tactical dressing, showcasing tech and combat-derived looks made from high-performance materials with trade names like Polartec and Gore-Tex (think L.L. Bean parkas), complete with multiple tool pockets and heat-sealed seams.\n\nLast month, at the fall 2016 menswear shows, wild and woolly Western-inflected counterparts of that cushioned-and-quilted tech look were released on the European runways.\n\nBeefy shearling jackets and furs, buffalo plaids and Pendleton-style blankets muscled their way into shows like Dolce & Gabbana, where roughed-up curly lamb coats were offered, and Dries Van Noten and Burberry each issued husky man-furs atop outdoorsy plaid shirts or fleeces.\n\nLumberjack shirts\n\nWhite Mountaineering returned with a trapper-tinged collection called Trailblazer, and Coach celebrated doughty American archetypes like Kit Carson with a succession of patched leather jackets, lumberjack shirts, bandannas and bucket hats virtually bristling with flinty resourcefulness.\n\nAs the Coach handout stated, “The collection was about finding the heroic in everyday life.” Not bulletproof by any stretch, the clothes were trend-resistant nonetheless. Pretty much as Stuart Vevers, the designer, intended. In The Revenant , as on the runway, the folksy, shredded but eminently durable look speaks volumes. Ms. West ascribed its resonance to a general appetite for simplicity and permanence that extends to people’s wardrobes. — New York Times News Service", 
    "section": "national", 
    "title": "The Revenant lends trapper chic a dose of gritty realness", 
    "subsection": "general", 
    "date": "2016-02-14"
}