{
    "author": [
        "Devesh K Pandey"
    ], 
    "text": "In Uttar Pradesh’s Sambhal region known for producing menthol that could relieve minor irritations, a semi-urban cluster is struggling to find a cure for its unprecedented trouble.\n\nAccording to Indian agencies, a former resident of Deepa Sarai in Sambhal is the leader of the al-Qaeda in Indian Subcontinent (AQIS) and five others from the locality are its active members. One of them reached Pakistan in 1995, the second joined him by 2000, and two more are now in Pakistan with them. The remaining two, who too have been to Pakistan, are in judicial custody in India.\n\nAgencies began to work on AQIS after a video by al-Qaeda leader Ayman al-Zawahiri appeared in September 2014, announcing its formation. However, the breakthrough came only in August-September 2015, when they intercepted a phone call from Mohammad Asif (41), a resident of Deepa Sarai, to one Abdul Rehman Khan (38).\n\nWith double Ph.Ds in Arabic and Hadith, Khan was from Odisha’s Cuttack, and was, the police say, actively engaged in recruiting for Al- Qaeda and Lashkar-e-Taiba. He was in Bangalore when he received the call from Asif.\n\nAsif identified himself, mentioning his association with AQIS chief Maulana Asim Umar, later found to be Deepa Sarai resident Shaan-ul Haq, who had run away in 1995. As the agencies listened in closely, an unusual picture began to emerge.\n\nHaq, who had fled the village after he was slapped by an uncle, was now based in Pakistan, and was working on building AQIS into a deadly terrorist organisation.\n\nAnother Deepa Sarai resident, Saeed Akhtar aka Qasim (42), who moved to Pakistan by 2000, was the second-in-command. In the last few years, two more from the same locality — Usman and Sarjil — have gone missing. Their families are unaware of their whereabouts.\n\nThree-month-long hunt\n\nHaq now operates as Maulana Asim Umar, has written several books on conspiracy theories, his favourite topic being Dajjal (Islamic equivalent of the Anti-Christ). Beginning November 2012, he has featured in several videos released by al-Qaeda.\n\nThe agencies zeroed in on the suspects and it took them almost three months to track down all the key members of the network. The crackdown began on December 14, 2015. Asif got picked up from Delhi, Khan from Cuttack and Zaffar Masood from Sambhal.\n\n“ Achhon mein bure ho jate hain, buron me acchhe ho jate hain (Among the good, some turn out bad, among the bad, there will be some good)”, says 80-year-old Chhuttu Bhai, with a long silver haired beard and a poker face. He doesn’t know where his son Haq, who ran away as a teen, is. The last news the family got about him was in 1998 when an intelligence officer told them not to grieve over him as he was alive in Pakistan.\n\nHaq reconnected with some residents of Deepa Sarai through his deputy Qasim. According to police records, until 1998, Qasim was in India and had told his neighbours, Masood and Usman, that he had joined Harkat-ul-Mujahideen (HuM), following Haq’s advice. He exhorted them to undergo training in Pakistan’s Mansehra.\n\nMasood and Usman, both unemployed, carried betel leaves to Pakistan in 1999-end, reached Mansehra via Abottabad and then boarded a mini-bus to a training camp located in the high hills. Haq met them there.\n\nAfter a fortnight-long training in the handling of weapons and explosives, Haq took them to Rawalpindi via Karachi, then to Lahore and arranged their air tickets to India in January 2000.\n\nAccording to the interrogation report, Haq told them that two more youths from Deepa Sarai had already joined the outfit. The duo, arrested later in 2007-08 on charges of aiding two Pakistani terrorists, was acquitted by a Delhi court in 2009 for lack of evidence.\n\nMasood’s mother Intekhab denies police claims. She says her son, who is now in judicial custody, never went to Pakistan. Intekhab bursts into tears saying: “My son has been framed. We all are being made to suffer without any reason. We are already under so much of debt and the police are accusing him of terror financing.”", 
    "section": "national", 
    "title": "Youths from U.P. formed al-Qaeda in India’s nucleus", 
    "subsection": "general", 
    "date": "2016-02-14"
}