{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Names of 8,770 voters were deleted, owing to double entry and death, from the electoral rolls of 10 Assembly constituencies of the district during the recent purification, Collector M. Karunakaran said.\n\nDuring an informal chat with reporters after inspecting 2,660 electronic voting machines brought from Haryana on Monday, he said that names of 4,240 voters were deleted due to double entry and 4,530 voters due to death. The ‘deletion details’ would be made available to political parties.\n\nHe said that the ongoing calibration of the EVMs by six technicians from Bharat Electronics Limited would be completed before March 13.\n\n“Since the Election Commission of India has proposed to introduce ‘Voter Verifiable Paper Auditor Trail’ (VVPAT) system in Tirunelveli constituency on a ‘pilot basis’, 386 machines would be brought from Bihar and used for this purpose,” the Collector said.\n\nThe VVPAT machine, which has been introduced to serve as an independent verification system for voting machines, will be attached with the EVM and will generate slips like the receipts being generated at the ATMs. Once the voter presses the button of his or her choice, a slip will be generated to indicate the vote that has been actually cast by the EVM.\n\nThe slip will be displayed behind a glass case for seven seconds and the voter will be able to confirm if the vote has been cast in support of the candidate of his choice. After seven seconds, the slip will automatically fall into a sealed chamber.\n\nIn case, the voter alleges that the vote had not been cast in favour of his candidate, he can register a complaint to the presiding officer, who, in the presence of others in the particular booth, will cast three trial votes of a particular choice to verify the allegation. If the complaint is genuine, the EVM concerned will be sealed and seized immediately. If the complaint is found to be false, a criminal complaint will be registered against the complainant.\n\nThoothukudi\n\nA total of 10,380 voters will be deleted from the electoral roll ahead of the forthcoming assembly election, said Collector and District Election Officer M. Ravikumar here on Monday.\n\nThe move was confirmed in the midst of booth-level officers and agents of political parties at a meeting convened here recently. Of this deletion, 6,533 voters could not be identified as they are no more and names of the rest of voters in the electoral roll showed ‘double entries’, he told reporters.\n\nAmong 1,559 polling booths in a total of 856 locations in the six assembly constituencies across the district, 195 booths were considered sensitive. A strict vigil would be maintained and security enhanced in the booths, the Collector said.", 
    "section": "national", 
    "title": "8,770 names deleted in voter list purification", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}