{
    "author": [
        "S Prasad", 
        "R Sivaraman"
    ], 
    "text": "It is not development oriented and is anti-poor, says Narayanasamy\n\nThe Union budget for 2016-17 received mixed reaction from political parties and traders in the Union Territory.\n\nAll India Congress Committee general secretary and former Union Minister for State V. Narayanasamy slammed the Union budget presented by Finance Minister Arun Jaitley and alleged that it was “anti-poor” and not development oriented.\n\n“The Union budget has let down the middle class and rural segments as no specific allocation has been made for rural development schemes. The budget is aimed at helping the big corporates and is not in the interest of the common man,” Mr. Narayanasamy said.\n\nMr. Narayanasamy said that the allocation for Mahatma Gandhi National Rural Employment Guarantee Scheme (MNREGA) which was Rs.59,000 crore during the previous UPA regime has now been slashed to Rs.38,500 crore. “This only reflects lack of concern on the part of the Government for the rural sector,”\n\nInstead of encouraging exports the budget is only pampering imports which would eat into the delicate economic position of the country. On the whole the budget is very disappointing and lacks any vision towards the development of the country, he said.\n\nAppreciable\n\nM. Ramadass, joint Secretary of AIADMK, Puducherry unit and former Member of Parliament said the focus of the Union Budget on nine pillars such as agriculture, rural development, education, health, infrastructure, financial restructuring is really appreciable as it will contribute to the development of vital sectors and render social justice to the hitherto neglected sections of the society.\n\nHowever, he added Union Government should realise that many of the announced schemes are akin to those implemented by several State Governments like Tamil Nadu and hence are likely to duplicate the efforts of the State Governments. Therefore the real percolation effects of budgetary measures will hinge upon how effectively the Central Government Departments will coordinate with the State Governments.\n\n“The allocation of Rs.2.87 lakh crore to the elected local bodies of India is a step in the right direction of decentralising economic decision making to the people at the grass root level, although a Territory like Puducherry will not benefit from the magnanimous gesture of the Central Government as it continues to keep these micro level institution defunct and dead,” said Dr. Ramadass.\n\nWelcoming the Union Budget proposal for more allocation for agriculture and infrastructure development, Puducherry Traders’ Federation president M. Sivasankar said, “It is disappointing that there was no announcement on revival of tax holiday for industries to set their units in the Union Territory.”\n\n‘Allocation of Rs.2.87 lakh crore to the elected local bodies is a step in the right direction’", 
    "section": "national", 
    "title": "Budget elicits mixed reactions in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}