{
    "author": [
        "S Sundar"
    ], 
    "text": "No line of control:Cars parked parallel to two-wheelers on the narrow stretch of East Aavani Moola Street in Madurai on Monday.— Photo: R. Ashok\n\nMadurai city Police Commissioner Office on Monday started functioning from the new building on Alagarkoil Road that was inaugurated on Friday.\n\nAll the officers, including Commissioner of Police Shailesh Kumar Yadav, started their official duty from their new chambers in the building. Though most of the furniture and files have been moved, the work of shifting and arranging them was going on in full pace.\n\nWith all the senior officials and a majority of staff members leaving the old CoP office building, the premises in Kaval Kooda Street wore a deserted look with minimum vehicles, mostly two-wheelers, parked on the once much-cramped parking lot.\n\nMeanwhile, the movement of police vehicles along South Masi Street, South Avani Moola, East Avani Moola Street and Thalavai Street and the by-lanes of Jadamunikoil Street and Thottiyan Kinatru Street has drastically come down.\n\nThough the density of vehicular movement on these roads was relatively lesser on Monday afternoon, the apprehension of Mr. Yadav of people encroaching upon the narrow roads and by-lanes around Sri Meenakshi Sundareswarar Temple due to absence of police movement has come true.\n\nDouble parking in South Avani Moola Street was visible with one more layer of two-wheelers seen parked haphazardly, thus shrinking the carriage way.\n\nThis was true even in East Avani Moola Street with autorickshaws parked without being questioned by traffic police.\n\nThe stark reality is that a good number of traffic police personnel who had been earlier posted on the smaller stretches of one-way roads, especially during afternoon hours, had disappeared.\n\nThe police personnel who are usually found on both ends of Jadamunikoil Street and Thottiyan Kinatru Street, at South Avani Moola Street-East Avani Moola Street junction, (however, a police personnel was regulating traffic over public address system at this junction later in the evening.), near Nandhi statue and Thalavai Road were missing on Monday afternoon.\n\nOn other duty\n\nA traffic police officer said that the police personnel along these stretches were not withdrawn, but had been deployed for a day for other events in the northern side of the city – for the sports event organised by the ruling party and for the function of distribution of gold under marriage assistance scheme held at Tamukkum grounds.\n\nThey returned for work later in the evening, he also added.", 
    "section": "national", 
    "title": "City police move to new office; encroachers return around temple", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}