{
    "author": [
        "L Renganathan"
    ], 
    "text": "Mixed reactions greet the proposals at a panel discussion held in Thanjavur; farmers and women also feel let down\n\n(From left): Rajeswari, a homemaker; K. Padmanabhan, past president of Thanjavur Chamber of Commerce and Industry, R. Palanivelu, Head, Department of Economics, AVVM Sri Pushpam College, Poondi, and V. Jeevakumar, District Vice-president, Tamil Nadu Agricultural Labourers’ Union, discussing the Union Budget 2016-17 in Thanjavur on Monday.— PHOTO: R.M. RAJARATHINAM\n\nWhile some sectors see positives in the Union Budget presented on Monday, others are less optimistic on the impact of the exercise on improving their lot as mixed reactions greeted the proposals at a panel discussion here. For the industrial and corporate sectors, there are several things to cheer about while farmers and individuals feel let down.\n\nHousewife P. Rajeshwari finds the proposal to provide woman members of BPL families with LPG connection interesting and useful. “It will greatly help the rural women especially. But not revising income tax deduction slabs is disappointing. The plan to open 3,000 generic medicine stores is a welcome step. While the working man feels the stress in his workplace and elsewhere, it is the women folk like me who had to endure the domestic economic strain. In that sense, the budget has little to cheer for me,” Ms. Rajeshwari said.\n\nBut the budget proposals had something to cheer about, according to the Builders’ Association of India former National Vice-President K, Padmanabhan who welcomed the Rs. 97,000 crore allocation for road and highways development that would kick-start stalled projects. The seven-day work option for shops was good for rejuvenating certain services that were sluggish, he said.\n\nAnother big plus in the budget was the massive allocation of Rs. 2,21,246 crore for the infrastructure sector and that promises to usher in a better future. The promise on the infra front must get translated into action on the economic front through facilitation in the proper sense, Mr. Padmanabhan who is the former president of the Thanjavur Chamber of Commerce and Industry says.\n\nThe budget proposals on establishing 300 urban clusters could boost the sagging construction and housing sector while the establishment of 1,500 multi-skill development centres at a cost of Rs. 1,700 crore would rescue the skilled manpower shortage felt by various industries, he added. The plan to establish hub to support SC/ST entrepreneurs was a wonderful idea.\n\nThe budget disappoints the common man and salaried class as there was no change in income tax deduction slabs, according to Head, Department of Economics, Poondi AVVM Sri Pushpam College, R. Palanivelu. He said that last year too there was no relaxation and during the year before a relief of just Rs. 50,000 was made. The budget seems to be more industry and corporate oriented than in favouring the common man or the salaried class, he claims.\n\nThe Union Finance Minister Arun Jaitley has given the house-less tenants some relief in hiking the rent deduction limit to Rs. 60,000, Prof. Palanivelu said and added that the plan to establish ATMs and micro ATMs in post offices was a welcome development.\n\nWhile the NDA regime had tried to conjure up some relief for the farm sector in effect the budget proposals were a wholesale sell out to the corporate elite at the cost of the common man and the farmers, said district vice-president of the Tamil Nadu Vivasaya Thozhilalar Sangam V. Jeevakumar.\n\nThe proposed tax compliance window was a reward for those who stashed away black money while it is anybody’s guess as to who would benefit by the proposal to incentivise deep water gas new discovery to calibrated market freedom, he pointed out.\n\n“I am happy that the Finance Minister has spared a thought for the senior citizens and those suffering from renal disorders and the new health protection scheme that promises cheaper medicines is good,” says State government employee J. Sankaran.\n\nWhile the Finance Minister had given very few benefits for small IT payers, he had raised Tax Audit Limit for businessmen from Rs. 1 crore to Rs. 2 crore, which was a welcome step. The service tax rate had been increased from 14.50 per cent to 15 per cent and the much expected relaxation in basic exemption limit has not been considered both in income tax and service tax.\n\nThe plan to tax provident fund withdrawals in part — 60 per cent taxable and the balance 40 per cent is exempted — will affect the salaried class. The Finance Minister had assured farmers were the focus and his agenda was to strengthen the banks.\n\n“Let us hope he makes the right moves in that direction,” said Chartered Accountant A. Guhaneswaran of Kumbakonam. Huge collections were projected from service tax. Not much to cheer for the common man and the Centre must ensure the announced schemes reach the real beneficiaries in full, he emphasised.\n\n“The budget is a theoretical pass for the Prime Minister’s vision and the Finance Minister had successfully defended his practical viva-voce. The announcement of an enabling regulatory architecture to create 20 world class higher educational institutions, a Higher Education Financing Agency with an initial capital base of Rs.1,000 crore and Rs. 1,700 crore for skill training institutes are welcome measures,” says S. Vaidhyasubramaniam, Dean (Planning and Development), SASTRA University.\n\nThe funding mechanism needed to be transparent and non-discriminatory to ensure effective implementation. Online certificate repository aligns with the Digital India Mission and removes transactional impediments that delays career progress.\n\nHowever, at a time when the total R&D spend is at a deplorable low of one per cent of the GDP, the gradual reduction in weighted tax deduction on research donation from 175 per cent to 150 per cent to a final 100 per cent will discourage corporates to fund translational research in educational institutions, said Dr. Vaidhyasubramaniam. This was bad news at a time when in-house corporate research and budgetary allocations for research were insignificant.\n\nOther allocations by way of central and State plans were incremental with too little to complain as they were driven by demands and not by delivery and output, he notes.", 
    "section": "national", 
    "title": "Corporate sector happy; common man feels let down", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}