{
    "author": [
        "T Madhavan"
    ], 
    "text": "DMK councillors and AIADMK cadre clash over contracts given by Tambaram Municipality\n\nThe two groups hurled bricks and fruits at each other on Muthurangam Street—Photo: G. Krishnaswamy\n\nThe council meeting of the Tambaram Municipality on Monday turned ugly with Dravida Munnetra Kazhagam (DMK) councillors and All India Anna Dravida Munnetra Kazhagam (AIADMK) party workers exchanging blows outside the meeting hall.\n\nThe chaos began moments after the resolutions were presented at the council hall with councillors from both parties engaging in a heated argument.\n\nDMK member S. Indiran sought an explanation from the chair on assigning to an AIADMK functionary, who had faced corruption charges, the responsibility of addressing grievances on allotment of contracts.\n\n“There have been several irregularities in allotting projects and executing them, which we had previously questioned,” said D. Kamaraj, DMK councillor.\n\nShouting slogans, members of DMK and Congress staged a walkout.\n\nOutside, words were exchanged between AIADMK cadre and DMK councillors, which led to a scuffle. On Muthurangam Street, where small traders conduct business, both groups hurled bricks, sickles, and fruits at each other.\n\nFour people were injured in the attack and a car belonging to an AIADMK functionary was damaged. The fight came to an end only after police intervened and removed the DMK councillors from the spot.\n\nFormer DMK MLA S.R. Raja led the protesters to the police station to file a complaint. AIADMK party members also filed a complaint against the DMK members.\n\nAIADMK party workers said the Opposition was attempting to thwart the conduct of the meeting. A huge posse of policemen was posted near the entrance of the municipal office and at sensitive areas around Tambaram to prevent any untoward incident.", 
    "section": "national", 
    "title": "Council meet ends up in street fight", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}