{
    "author": [], 
    "text": "Alleging 24 that over 57 lakh bogus voters have been added to the recent voters’ list released by the Election Commission of India (ECI), the Dravida Munnetra Kazhagam (DMK) on Monday moved the Madras High Court seeking to direct the Commission to appoint Central government officials as Electoral Registration Officers and to “purify” the entire voters list by verifying the applications.\n\nAppearing for the party, senior counsel P.Wilson said the population of State of Tamil Nadu as per the census in 2011 was 7.21 crore. In this group, the population of 13-17 age group would have been 50.56 lakh. This group would have been in the age group of 18-22 by 2015.\n\nAccording to the list furnished by the Election Commission the total electorate in 2011 was 4.71 crore.\n\nTherefore, the total number of eligible voters as on January 1 should be 5.21 crore (4.71 crore + 50.56 lakh).\n\nBut, the Commission has published an electoral list on January 20 giving a figure of 5.79 crore. “The difference of unaccounted electorate namely 57.43 lakh causes much concern as they appear to be bogus voters,” Mr. Wilson claimed.\n\nNoting that this mismatch clearly points out multiple entries of voters, besides non-removal of voters who have died, shifted their residence and migrated to other areas, the petitioner submitted that the sudden increase in the percentage of voters (75.58) to total population is unimaginable.\n\nAssailing that the ECI has failed to give reasons for huge additions and deletions to the voters list, the petitioner pointed out that about 16.18 lakh new applications for addition had been admitted in 2015 alone and over 6.46 entries were deleted suo motu after January 20.\n\nThe party prayed the court to direct the Commission to re-verify additions and deletion made after January 20 through Central government officers, alleging that State government officials were hand in glove with the ruling party.\n\nWhen the plea came up for hearing before Justice R. Subbiah, the judge directed the Election Commission to file an affidavit by Friday.\n\nWants Central government officials appointed as Electoral Registration Officers", 
    "section": "national", 
    "title": "DMK alleges 57 lakh bogus voters added recently", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}