{
    "author": [], 
    "text": "A commercial exhibition is being organised at a private marriage hall in Nanjikottai Road in Thanjavur. The exhibition was poorly organised completely neglecting safety arrangements. Weekends recorded large turnout at the exhibition. No arrangements were made for emergency situation. An entry fee of Rs. 30 was also charged for a purely commercial exhibition. I request the authorities not to give permission for conducting such exhibition in future which are organised purely on commercial basis and which neglects the safety of public.\n\nKrithika,\n\nThanjavur\n\nCongested office\n\nThe computerised collection centre at the office of the Kumbakonam municipality is visited by a large number of people every day. But the tiny office lacks ventilation and because of the inefficiency of the staff, the people wait in queues sweltering and suffocating in the humidity. Will the officers concerned take a sympathetic view of the suffering public.\n\nH. Sheik Abdul Kadhar,\n\nNachiarkoil\n\nRegulate timings\n\nof private schools\n\nStudents of classes 10 and 12 have been suffering because of the timings of some private schools. Students can't focus on their education and lose their marks in public exam. So government has to take necessary action against private schools and regularise the timings of them.\n\nCondeepan M.,\n\nPattukottai\n\nSystems are slow\n\nat post offices\n\nVishnupuram is under Eravancheri Sub Post office and controlled by Kumbakonam Division. Computerisation of office is a good step for the public but leads to many problems. We were given to understand that internet speed is very slow. Public have to spent lot of time for deposit as well as withdrawal. This may be due to the poor equipment installed in Eravancheri BSNL exchange. If the system is not upgraded, the public may stop going to post offices for financial transactions.\n\nMali & Mani,\n\nVishnupuram, Tiruvarur district\n\nGive incentives\n\nfor taxpayers\n\nInstead of cutting subsidies for LPG and other things, the Centre should come forward to reward genuine taxpayers by offering concessional pass in railways and airways and seats in government colleges in preferential manner for taxpayers’ children . This will definitely encourage existing taxpayers as well as many persons to come forward to pay income tax.\n\nG. Srinivas,\n\nTiruvanaikoil\n\nSave public spaces\n\nfrom posters, slogans\n\nAs the election approaches, parties are going to spare the public pathways and walls. The Election Commission must act against those who violate the rules strictly. With the large-scale encroachments of the public pathways it is difficult for the people to walk on the roads. With the walkways shrinking, pedestrians are exposed to accidents. Traffic police must act regularly. They should not wait for the election code of conduct to come into force. Tiruchi should evolve a culture of respecting public pathways, walls, and places. A city’s popularity lies in the clean public places.\n\nA. Prabaharan,\n\nTiruchi\n\nMake the roads safer\n\nThe number of accidents would not come down unless traffic laws are made strict by the RTO and the traffic police. How many drivers understand the signals in the roads, how many know the speed limit, how many know to dim the light when other vehicle crosses, how many lorries have indicators or the brake lights or the headlamp at least in the working conditions? Let us not take pride on being one of the biggest organ donors because of accidents, instead let us be proud that we have the safest roads in India.\n\nAnbin R Inian,\n\nWoraiyur, Tiruchi\n\nStop Vaigai Exp.\n\nat Srirangam\n\nVaigai Express does not stop at Srirangam. Srirangam attracts a large number of pilgrims. I request the officials concerned to stop Vaigai Express at Srirangam to help pilgrims visit Sri Ranganathaswamy temple and Akilandeswari temple.\n\nRavi Ramanujam,\n\nTiruchi\n\nHave e-waste\n\nhandling policy\n\nNowadays, everyone uses electronic gadgets in day-to-day activities. These gadgets soon become obsolete. These obsolete gadgets are thrown into garbage bins. Since electronic gadgets have harmful metals and compounds, e-waste poses threat to health and causes land pollution. As the Tamil Nadu government had launched free mobile phone scheme recently, it might consider introducing a viable policy on e-waste management to protect the environment.\n\nA. Haja Abdul Khader,\n\nAdirampattinam\n\nExcellent\n\narrangements\n\nThe arrangements made for the Mahamaham in Kumbakonam is forgotten or easily ignored by the people. It is not a small thing for a town like Kumbakonam to receive about five million pilgrims in a week. Right from the Chief Minister, government machinery and NGOs worked overtime to ensure that it passed off peacefully. We have to be thankful to all those who made it a grand success.\n\nR. Soundararajan,\n\nNagapattinam\n\nCommendable job\n\nin Kumbakonam\n\nKumbakonam Mahamaham went on well bringing plaudits to the government and the district administration. Of course, the local administration with local volunteers have coordinated well. Health Department and the municipal workers have done a great job. But the internal movement of local residents was restricted. Local residents were given passes but that did not work. After the big day, the pilgrims found it difficult to go to railway station and bus stand by taking auto and other small vehicles as they were not allowed till evening. This could have been avoided.\n\nS. Krishnan,\n\nThippirajapuram", 
    "section": "national", 
    "title": "Exhibition badly organised", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}