{
    "author": [
        "Staff Reporter"
    ], 
    "text": "VIT University Chancellor G. Viswanathan (right) interacting with S. Natarajan, professor of Solid State and Structural Chemistry Unit, Indian Institute of Science, Bengaluru, during the 30th National Science Day on Monday .\n\nOn National Science Day, experts expressed concern on the continuing practice of rote learning and the lack of an environment for students to get their hands on scientific experiments in school laboratories.\n\nTaking part in the 30th National Science Day celebrations – SciGATHER 2016 –at VIT University on Monday, both G. Viswanathan, VIT Chancellor and S. Natarajan, professor, Solid State and Structural Chemistry Unit, Indian Institute of Science, Bengaluru, noted that still, teachers only showed scientific experiments to students in many school laboratories, rather than allowing the students to learn by doing.\n\n'Standard of education brought down'\n\n“This is the saddest part. As a result, students have no hands on training. Instead of developing education, we have brought the standards down. We need to take a pledge not to allow this further,” Prof. Natarajan said.\n\nHe urged the students to motivate themselves to take up the cause of science. “We need to evolve to be a scientifically and educationally more knowledgeable society. We should work towards the cause of improving science in the country,” he added.\n\nIn his address, Mr. Viswanathan said, “We have always been lamenting that we do no produce enough Nobel laureates. The reason is we do not concentrate on basic science.”\n\nHe said the country has not made much progress in teaching science. As a country, there is a need to attach more importance to teaching of science, he added.\n\n“Memorising continues to be the basis of learning. This will not take us anywhere and we will not be able to compete with advanced nations,” he added.\n\nYears ago, teachers performed the experiments in laboratories and kept the equipment under lock and key, he said, adding that such situation continued till day.\n\nNeed for good labs\n\nHe emphasized the need for government institutions to spend more on laboratories and facilities so that students will have hands on learning.\n\nMr. Viswanathan also urged students to concentrate only on education and not divert attention to other things.\n\nAmong others, Anand A. Samuel, VIT’s vice chancellor and R. Vijayaraghavan, dean, School of Advanced Sciences, VIT, also spoke.", 
    "section": "national", 
    "title": "Experts concerned over rote learning, absence of hands-on training", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}