{
    "author": [
        "S Senthalir"
    ], 
    "text": "Urge government and people to take appropriate measures to address the problem\n\nSignalling danger of depleting water levels and disappearing water bodies in Puducherry, Aravindan Govindassamy of Sembadugai Nanneeragam organisation, said that increase of population by 10 fold in Puducherry since 1970 has led to excessive dependence on ground water.\n\nThe groundwater level in Puducherry which was 25 to 60 feet in 1970, has depleted to 150 and 250 feet below the surface.\n\nHighly polluted\n\nHe spoke at a one-day workshop on “The State of Lakes and Water bodies of Southern India: Threats, Challenges and Opportunities organised by ‘All for Water for All’ collective on Monday in Puducherry.\n\nMr. Aravindan said: “Excessive dependence on ground water will pave way for scarcity of water on massive scale. Even water that is available at present is highly polluted and efforts are not taken to treat or recycle water. Besides, the solid waste is also not subjected to the process of recycling.”\n\nSpeaking on the topic - ‘The source of water in Puducherry region and future demands of the people,’ he said: “Water resource in the region is dependent not only on rainfall received during monsoons, but also from the rain fed rivers of Tamil Nadu reaching out to the region largely before confluence into the sea. Irrigation needs are met out of rivers, tanks and other water bodies while domestic, industrial and commercial needs are met by ground water.”\n\nRainwater harvesting\n\nHe underlined that rainwater harvesting as a plan of action should be implemented by individual households, government departments and private enterprises to check sea water intrusion.\n\n“The water usage in marriage halls, hotels or restaurants is much more uncontrolled and this usage should be regulated with awareness. To check this, water tariff has to be considerably increased,” he added.\n\nExperts from the Centre for Science and Environment, Indian Institute of Science from Bengaluru, Save our Urban Lakes from Hyderabad and Dhan Foundation from Madurai discussed on the state of lakes and water bodies in different regions of Southern India.\n\nThe session on The State of Urban lakes in India: The Crisis’ was chaired by former member of Planning Commission A.Vaidyanathan.\n\nThe experts stressed the need for the government to consider climate change as an important factor for the urban floods and take appropriate measures to address the problem.\n\nThe water usage in marriage halls, hotels or restaurants is much more uncontrolled and this usage should be regulated with awareness.\n\nAravindan Govindassamy\n\nSembadugai Nanneeragam organisation", 
    "section": "national", 
    "title": "Experts warn of depleting water levels", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}