{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "‘No information on how the Centre will go about doubling farmers’ income in the next five years’\n\nThe Union Budget’s purported farmer friendliness is far from being in sync with perception of the agricultural community in the district, according to farmers in the district.\n\nThe government had failed to understand that un-remunerative prices were the cause for the scores of suicides by farmers. It needed to realise that it could not convince the farmers, who had been battered all these years due to faulty economic policies, through mere vocal assurances, K.V. Ponnaiyan, president of Tamil Nadu Swadeshi Farmers’ Movement, said, questioning: “What is going to be the strategy?”\n\nAbsence of any relief for farmers burdened by agricultural loans, and the scope created for Foreign Direct Investment in value-addition for agriculture were indications that the Budget had been prepared in consultation with the World Trade Organisation, he said, expressing apprehensions that the Centre was preparing the ground for withdrawing existing subsidies.\n\nKMDK secretary E.R. Eashwaram said the Union Budget was a letdown in the absence of plan of action for linking rivers. The BJP Government seemed to have forgotten that it had come to power seeking votes on the plank of linking rivers. There was no concrete information on how the Centre would go about doubling the income of farmers in the next five years. The Budget was lacklustre; while there was an indication that the country as a whole had not been affected economically, the Budget had nothing that would improve economic condition of individuals, Mr. Eashwaran said.\n\nThe Central Government had disappointed the student community by not specifying any measures to provide relief to those who had been provided with educational loans, said C.S. Gowthaman, member, Divisional Railway Users’ Consultative Committee. Announcements were not going to take the economy forward without any follow up. For instance, the progress envisaged last year through introduction of Mudra Bank concept had been elusive, since the banks were reluctant to forward loans to educated youths for self employment under the scheme, Mr. Gowthaman said.\n\nRepresentatives of trade and industry also say there is nothing significant in the Budget. The silence on Goods and Service Tax in the Budget was intriguing, said N. Sivanesan, president of Federation of All Trade and Industries’ Association.\n\nWhile the step taken for providing a thrust to value addition of agricultural products was a welcome measure, the reason for permitting FDI in marketing of agricultural produce without factoring in the internal market defied logic, Mr. Sivanesan said.", 
    "section": "national", 
    "title": "Farmers consider Budget a letdown", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}