{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The District Rural Development Agency of the State Institute of Rural Development, which launched Community Based Disaster Management (CBDM) in 180 coastal villages in the district, has offered training to the members of first-aid committees from select villages.\n\nIn his address after inaugurating the training under the a pilot programme here on Monday, Collector S. Natarajan said that about 1.72 lakh people, constituting 22 per cent of the district’s population, lived in the coastal villages and the CBDM programme was aimed at protecting them in the event of natural disasters.\n\nUnder the programme, various teams were being constituted for the safety and security of people and the team members, after undergoing training, should work for the welfare and safety of others with total commitment, he said. Detailing about the three year project, K. Arumugam, District Programme Officer, said that the CBDM project was launched in last May after identifying 180 target coastal villages and that they had almost completed the tasks earmarked for the first year. The district agency had put in place a disaster management plan in 139 villages, involving the panchayat presidents, ward members, self-help groups and villagers, he said.\n\nTo equip the villagers to take care of themselves in the event of any disaster, the agency had constituted five teams — Early warning team, Search and rescue team, Shelter management team, Evacuation team, and First-aid team — each with five members in 139 villages and decided to offer training to the team members.\n\nIn the pilot programme, the Indian Red Cross Society (IRCS) offered first-aid training to 49 members from 10 villages and the team members were trained on giving first aid to the victims using locally available resources, Mr. Arumugam said.", 
    "section": "national", 
    "title": "First-aid training in coastal villages on", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}