{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They say it will affect their livelihood, turn groundwater brackish\n\nFishermen staging a demonstration in front of Kanyakumari Collectorate in Nagercoil on Monday, opposing the proposal to establish Colachel port in Enayam.— Photo: Special Arrangement\n\nFishermen in coastal villages situated between Arogyapuram and Neerodi staged a demonstration in front of the Collectorate here on Monday, opposing the proposed establishment of Colachel commercial port project in Enayam.\n\nThe demonstration, called by Kanyakumari District Fishermen Federation (KDFF), was presided over by its president Dullas. Leaders of political parties such as the Dravida Munnetra Kazhagam, Congress, Aam Adhmi Party and social organisations participated in it.\n\nOver 5,000 fishermen and their family members gathered for the demonstration, as a result of which the two gates of the Collectorate were closed. All shops around the campus downed shutters.\n\nTraffic on Nagercoil-Thiruvananthapuram National Highway was disrupted for over an hour. Traffic police diverted vehicles through other routes.\n\nLeaders who spoke at the demonstration expressed fear of severe sea erosion that would affect the livelihood of the fishermen if the port was established in Enayam. Most of the villages along the coast of the Arabian Sea were facing the threat of sea erosion, they said.\n\nOnce the port project was implemented, the seashore would vanish, leaving the fishermen with no space to carry out their fishing and other related activities. Sea water would make groundwater brackish, they claimed. They also said that the local fishermen, who fished in sea for 5-10 nautical miles, would lose their livelihood if the port was established on over 500 acres of sea area.\n\nFormer Minister and DMK Kanyakumari east district secretary N. Suresh Rajan, west district secretary Mano Thangaraj, Kanyakumari district Congress committee (west) president V. Asokan Solomon, Colachel MLA J.G. Prince, Aam Aadmi Party (south zone) convenor Ramesh, Coastal Peace and Development Organisation director Gildus and others spoke.", 
    "section": "national", 
    "title": "Fishermen oppose proposal for port in Enayam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}