{
    "author": [
        "T K"
    ], 
    "text": "Emphasis on irrigation, soil health and increased use of organic fertilizers a forward-looking feature\n\nThe Union Budget 2016-17 is a mixed bag for the chambers of commerce and industrial houses across the State. Corporate heads from various sectors commended it for its focus on infrastructure development, agriculture and rural sectors and termed it a forward-looking budget.\n\n“The emphasis given to irrigation, soil health, increased use of organic fertilizers and developing a Unified Agriculture Marketing e-platform are steps in the right direction. The announcements for settlement of pending taxation matters will help resolve long overdue cases, and the simplified process of declaration of undisclosed income is likely to bring in new tax payers,” A. Vellayan, executive chairman, Murugappa Group.\n\nB. Santhanam, president and managing director - Flat Glass, South Asia, Malaysia and Egypt, Saint Gobain India Private Limited, said overall the budget was positive and forward looking with more thrust on rural development, infrastructure, and digital connectivity besides social sectors. He also welcomed the continuity of the MNERGA & Aadhaar schemes and the doubling of the farmers’ income by 2020.\n\nThe Madras Chamber of Commerce & Industry welcomed the following measures from the point of view of boosting trade related transactions: deferring payment of custom duties for large exporters in line with central excise duty procedure; implementation of single window clearances using the EDI platform for customs transactions with a view to reducing transaction time and cost; replacing physical control of bonded goods with technology to ease doing business.\n\nProposals salutary\n\nChambers president S G Prabhakharan said from the industry and business point of view, the following proposals are salutary: doing away with multiple and unproductive cess and the decision to have a relook into the Companies Act.\n\nC. K. Ranganathan,chairman and managing director, Cavinkare Private Limited, said that the allocation of Rs. 35,984 crore for the agriculture sector would indirectly fuel the demand for FMCG and have a trickle-down effect. “The 100 per cent FDI in marketing of food products produced and manufactured in India would help avoidance of wastage of over 30 per cent of farm produce and higher realisation to farmer,” he added.\n\nAt the budget viewing session organised by the Confederation of Indian Industry, E. S. Krishnamoorthy, founder and CEO, Neurokrish, appreciated the three-year tax-holiday for start-ups and the patent exemption scheme, which will boost the R&D and innovation.\n\nHe commended the renal dialysis scheme and suggested that government introduce similar schemes for other chronic illnesses.\n\nS. Mahalingam, Chairman, CII National Committee on Sector Skill Councils, emphasised the importance of digital infrastructure (e-commerce) and Aadhaar.", 
    "section": "national", 
    "title": "Focus on agriculture, infrastructure hailed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}