{
    "author": [
        "P V"
    ], 
    "text": "Last week the Forest Department sleuths here arrested two IT professionals from Kolar in Karnataka, for possession of meat of Monitor Lizard, a Schedule I protected animal under the Wildlife Act, 1972. Their car was impounded.\n\nThe arrested men are among the nameless clients that drive from Bengaluru to Sikkarimedu, a Narikuravar settlement here in Krishnagiri, for the meat and blood of Monitor Lizard, on the belief that it cures infertility.\n\nRaid\n\nA similar raid in a Narikuravar Colony in Bengaluru by the Forest Department sleuths there, led to the arrests of two men. Their arrests led the personnel to Sikkarimedu, from where three locals were arrested.\n\nThe supply chain often is traced back to Pudukottai, Aranthangi, Palani, and Dharapuram. Monitor Lizards are sourced from Narikuravars from these areas, and the live reptiles are transported through buses, says E. Rajendran, District Forest Officer, Krishnagiri.\n\nThe clients usually drive down during the weekends, based solely on phone link and false propaganda.\n\nThe department, seized of the urgency of the issue, has now cast the net high and wide, focussing on well-heeled clients from Bengaluru, who lend the economic rationale for the illegal trade on a scheduled animal.\n\nLast week, the Forest Department officials went on a five-hour checking spree of over 63 vehicles with Karnataka registration plates at Krishnagiri toll gate into the small hours of night.\n\nIn 2015, 16 persons were arrested. Except for five persons, the rest were from Bengaluru.\n\nAccording to Mr. Rajendran, the clients, most of who were found to be in the IT sector, were unaware that possession of Monitor Lizard, or any parts of the animal, will attract a minimum of three-year imprisonment along with the impounding of the vehicle. Now, the department has sought the help of the administration.\n\nThe District Collector has written to the Collectors of Pudukottai, and Tirupur, for assistance.\n\nThe issue equally sensitive – involving an indigenous community profiteering from an illegal trade on the one hand and of educated clients, on the other, driving down from across the border under the belief that Monitor Lizard can cure infertility, is often hushed-up.\n\n“The clients have no way of knowing if the meat is that of the lizard,” says Mr. Rajendran.\n\nThere are limitations to departmental action and a raid cannot be carried out to secure a source in a village. “Instead, any Karnataka registered vehicle seen in the vicinity of Sikkarimedu or in these parts is subjected to stringent vehicle checks, often projecting the department in bad light,” says a source.\n\n“We are looking to rope in NGOs to create awareness among the Narikuravar community. But largely, we want to send out a message to the prospective clients, who are taken in by a false promise that the law will be invoked against them,” says Mr. Rajendran.", 
    "section": "national", 
    "title": "Forest Department grapples with clandestine trade in Monitor Lizards", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}