{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Their demands include salary on par with Central Government doctors\n\nState-wide initiative:A team of service doctors and members of the Post Graduates Association collect signatures.- Photo: C. Venkatachalapathy\n\nGovernment doctors have embarked on a signature campaign across the State to garner support for their demands and take it forward to the Tamil Nadu government.\n\nOn Monday, a team of the Service Doctors and Post Graduates Association collected signatures from 165 doctors at the Government Vellore Medical College Hospital, Adukkamparai, primary health centres and taluk-level government hospitals.\n\nThe association had earlier launched the signature campaign at the Madras Medical College, and collected signatures from doctors in Madurai last week.\n\nThey were simultaneously collecting signatures from service doctors and post graduates in other districts.\n\nS. Palanisamy, organising committee member of the association, said they were demanding salary on par with Central government doctors. The association also wanted the State government to implement the recommendations of the Seventh Pay Commission.\n\n“We also want the government to scrap the Contributory Pension Scheme, and the old pension scheme should be put in place,” he added.\n\nOne of their main demands was grant of child care leave with salary for women doctors. “This provision is available for Central government doctors. Child care leave of two years can be split and taken by women doctors from the time of birth of child up to 18 years. The State government should implement this provision for women doctors here,” Dr. Palanisamy pointed out.\n\nThe association wanted the government to deduct Rs. 300 from the salary of doctors to create a corpus fund for the purpose of helping family members in case of death during service.\n\n“Presently, the government is deducting Rs. 30 from the salary of doctors for this corpus fund. Family members receive Rs. 1.5 lakh if a doctor dies during service, and this is not adequate to take care of their needs. We want the government to deduct Rs. 300. This way, families will get Rs. one crore,” he said.\n\nThere are 18,000 service doctors and post graduates in Tamil Nadu. The association plans to collect signatures from these doctors across the State and submit a memorandum comprising their demands to the State government.\n\nThe association also wanted scrapping of the Contributory Pension Scheme", 
    "section": "national", 
    "title": "Government doctors embark on signature campaign", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}