{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Monday refused to suspend the five-year sentence imposed by a trial court on six British nationals, 14 Estonians, three Ukranians and 12 Indians who were onboard the U.S. anti-piracy vessel MV Seaman Guard Ohio detained by Coast Guard on October 12, 2013 for entering Indian territorial waters illegally with a huge cache of arms and ammunition.\n\nJustice V.S. Ravi dismissed the applications filed by the 35 accused to suspend the sentences imposed on them and grant them bail. The judge said he was not inclined to grant the relief in view of the grave charges levelled against the convicts, vehement objections raised by ‘Q’ branch- Criminal Investigation Department (CID) and also because 23 of the convicts happened to be foreigners.\n\nStating that issues taken into account by a court while deciding a bail application before the commencement of trial differs from considering a similar plea post conviction, the judge said grounds raised by the convicts and alleged infirmities pointed out by them in the trial court judgement were not sufficient to suspend the sentence imposed on them by the Thoothukudi Principal Sessions Court on January 11. Nevertheless, observing that it would be open to the convicts to raise all those grounds during the hearing of the criminal appeal preferred by them challenging their conviction as well as the sentence, the judge directed the Registrar (Judicial) of the High Court to make sure that the hearing on the appeal commences on June 1 and the paperwork related to the case gets completed by then.\n\nThe appellants before the High Court included the ship’s captain M. Dudnik Valentyn (66), a Ukranian national and its Tactical Deployment Officer F. Paul David Dennish Towers (52), a Briton. Denying the charge of having entered Indian waters illegally, they claimed that their vessel had got stranded on high seas, since it ran out of diesel, when the Coast Guard intercepted it.\n\nExplaining the reason for not having given a distress call to the port authorities, the appellants said: “Running out of diesel is not a distress or peril of the sea warranting giving communication to the port authorities. In such circumstances, the captain will send communication to his owner who will arrange for diesel through his agent or advise the captain to procure diesel from another vessel mid-sea.”", 
    "section": "national", 
    "title": "HC refuses to suspend sentence on anti-piracy ship crew", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}