{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Doctors take a pledge to form a joint action committee to take up incidents of assaults on doctors in Puducherry on Monday.— Photo: S.S. Kumar\n\nNearly 600 trainee doctors and doctors took out a rally on Monday from Saint Antony’s Church to the Legislative Assembly demanding to introduce an ordinance on Hospital Protection Act.\n\nThe rally was organised by the Puducherry Doctors’ Association with support of Indian Medical Association. The doctors submitted a memorandum to Chief Minister N. Rangasamy and Lieutenant Governor Lt. Gen. A.K. Singh.\n\nPuducherry Doctors’ Association secretary R. Doraisamy said that there have been many instances where the medical fraternity has been assaulted. There is no protection for them. “We are demanding this ordinance because it would make the attack on doctors or hospital properties a non-bailable offence,” he said. The protest has been organised following the assault of an intern from IGMCRI working in Karikalampakkam Community Health Centre (CHC) by relatives of a patient who was brought dead to the hospital on February 25.\n\nAt least 150 trainee doctors of Indira Gandhi Medical College and Research Institute on Saturday staged a demonstration on the hospital premises. The interns stated that there was no protection for trainee doctors who were posted for a year in rural areas as part of the rural internship programme.\n\nMany states including Tamil Nadu have implemented the Hospital Protection Act. The doctors took a pledge to form a joint action committee comprising Indian Medical Association, Puducherry Doctors’ Association, Pondicherry Government Medical Officers’ Association, Paramedical Association and Staff Nurses Association. “This committee would attend to any incident of assaults on doctors in Puducherry. We will continue our protest till the ordinance is implemented,” said Dr. Doraisamy.", 
    "section": "national", 
    "title": "Interns, doctors demand ordinance on Hospital Protection Act", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}