{
    "author": [
        "Special Correspondent"
    ], 
    "text": "BHEL ancillary units optimistic about more opportunities\n\nMicro, Small and Medium Enterprises have welcomed the move to increase the turnover limit under the presumptive taxation scheme to Rs. 2 crore in the Union Budget.\n\nThe move would bring relief to a large number of assessees in the MSME category, said N. Kanagasabapathy, president, and S. Punniyamoorthy, secretary, Tiruchi District Tiny and Small Scale Industries Association (TIDITSSIA), in a joint statement here.\n\nThe TIDITSSIA welcomed the allocation of Rs. 1,804 crore for skill development and the increase in the target under the Pradhan Mantri Mudra Yojana for the MSME sector to Rs. 1.80 lakh crore. It appreciated the creation of 11 new benches of Customs, Excise and Service Tax Appellate Tribunal to settle pending cases as it would provide relief to assessees.\n\nThe association welcomed the move to set up a National Scheduled Caste and Scheduled Tribe hub in partnership with industry associations, the setting up of multi skill training institutions and national board for skill development certification.\n\nTerming it a progressive Budget, Ashok Sundaresan, president, BHEL Small and Medium Industries’ Association, expressed confidence that more opportunities would open up for the industry through the spending in infrastructure and rural sectors. He welcomed the announcement that companies with revenue up to Rs. 5 crore would be taxed at 29 per cent plus surcharge. The relaxation of the presumptive tax limit and the recapitalisation of public sector banks would help small and medium industries, he said.\n\nHousing sector\n\nThe housing sector was hoping that the initiatives to allocations for rural and infrastructure sectors would bring in long-term benefits. “Though there does not seem to be any direct benefit, we hope that there will be long-term benefits from the rural and infrastructure sector investments,” said T.V. Murali, past chairman, Confederation of Real Estate Developers Associations of India (CREDAI), Tiruchi.\n\nJ. Sankaran, Vice-Chairman, Builders Association of India, Tiruchi, welcomed the additional exemption of Rs. 50,000 for housing loans up to Rs. 35 lakh, provided cost of house is not above Rs. 50 lakh in the case of first time home buyers and the service tax exemption for affordable houses. However, he pointed out that the Real Estate Bill was still pending.", 
    "section": "national", 
    "title": "MSMEs buoyant over increase in tax exemption", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}