{
    "author": [], 
    "text": "Upgrade\n\npolytechnic\n\nA government college in a better location in Tiruchi will help the needy. The government polytechnic can be upgraded to engineering college. It is close to the NIT and is surrounded by industries giving an added advantage to have industry-institution sharing of knowledge. By this we will get one more government engineering college with low investment. The middle class and the poor will have a good college with minimum fee. Will the government look into it ?.\n\nG. Nallasivan,\n\nKailasapuram\n\nGive incentives\n\nfor taxpayers\n\nInstead of cutting subsidies for LPG and other things, the Centre should come forward to reward genuine taxpayers by offering concessional pass in railways and airways and seats in government colleges in preferential manner for taxpayers’ children . This will definitely encourage existing taxpayers as well as many persons to come forward to pay income tax.\n\nG. Srinivas,\n\nTiruvanaikoil\n\nSpeed up\n\nbridge work\n\nThe bottom layers of the RCC on the Cauvery bridge is being bull-dozed, probably to lay steel girders, but the sluggish pace of the work will cause prolonged agony of traffic jam to the public, if the work is not carried out 24x7 on war-footing under proper supervision by the concerned department.\n\nBrigadier R. Ilangovan (Retd.),\n\nMambala Salai\n\nBlacktopping\n\nof roads\n\nThe corporation has taken up the blacktopping of potholed roads in some parts of Srirangam. It is nice to see speed-breakers with proper design and size are in place. This has had a desired effect as motorcycle and moped riders are traversing the streets. We request the city corporation to re-lay the Sudarsan Nagar Road and the A.M. Road with same type of speed-breakers so that walkers can have a worry-free walking on roads without fear of getting knocked down by the over-speeding vehicles.\n\nT.M. Ranganathan,\n\nSrirangam\n\nNew bridge poses\n\nnew problems\n\nThe opening of the Odathurai bridge has opened up new problems in traffic management. In the absence of signal lights, it has become impossible to regulate traffic on this stretch. The area is not adequately manned by the traffic police. Tardy progress of work on the Cauvery bridge too is contributing to the chaos. It seems the authorities have completely overlooked the imperative for early completion of bridge renovation. Tippers carrying sand and other heavy vehicles are freely entering the city limits without any hindrance despite repeated representations in this regard. The residents expect the authorities to do a lot more on traffic management.\n\nJ. Anantha Padmanabhan,\n\nSrirangam\n\nSave public spaces\n\nfrom posters, slogans\n\nAs the election approaches, parties are going to spare the public pathways and walls. The Election Commission must act against those who violate the rules strictly. With the large-scale encroachments of the public pathways it is difficult for the people to walk on the roads. With the walkways shrinking, pedestrians are exposed to accidents. Traffic police must act regularly. They should not wait for the election code of conduct to come into force. Tiruchi should evolve a culture of respecting public pathways, walls, and places. A city’s popularity lies in the clean public places.\n\nA. Prabaharan,\n\nPuthanampatti\n\nSnag in e-service\n\nTamil Nadu government has introduced e-Service in Lalgudi taluk office under which a beneficiary can apply for income certificate, community certificate, land patta transfer, and other value-added services online which are highly useful. Quite often on account of software problem in this e-Service centre, information uploaded by a beneficiary for patta transfer does not reach the mail id of the appropriate authority to process the application. As a result, the public who applied for online patta transfer are put into greater hardship in Lalgudi e-Service centre. Will the authorities look into this matter?\n\nG. Viswanathan,\n\nLalgudi\n\nMake the roads safer\n\nThe number of accidents would not come down unless traffic laws are made strict by the RTO and the traffic police. How many drivers understand the signals in the roads, how many know the speed limit, how many know to dim the light when other vehicle crosses, how many lorries have indicators or the brake lights or the headlamp at least in the working conditions? Let us not take pride on being one of the biggest organ donors because of accidents, instead let us be proud that we have the safest roads in India.\n\nAnbin R Inian,\n\nWoraiyur\n\nEncroachments on\n\nAmmamandapam Road\n\nThe government provided platform with shed from Ammamandapam to Rajagopuram to the pedestrians and it is occupied by the traders. I request the authorities concerned to clear the encroachment so that the devotees can walk on the pavement in the shade during the blistering summer.\n\nJayaraman S.,\n\nSrirangam\n\nStop Vaigai Exp.\n\nat Srirangam\n\nVaigai Express does not stop at Srirangam. Srirangam attracts a large number of pilgrims. I request the officials concerned to stop Vaigai Express at Srirangam to help pilgrims visit Sri Ranganathaswamy temple and Akilandeswari temple.\n\nRavi Ramanujam,\n\nTiruchi\n\nHave e-waste\n\nhandling policy\n\nNowadays, everyone uses electronic gadgets in day-to-day activities. These gadgets soon become obsolete. These obsolete gadgets are thrown into garbage bins. Since electronic gadgets have harmful metals and compounds, e-waste poses threat to health and causes land pollution. As the Tamil Nadu government had launched free mobile phone scheme recently, it might consider introducing a viable policy on e-waste management to protect the environment.\n\nA. Haja Abdul Khader,\n\nAdirampattinam\n\nExcellent\n\narrangements\n\nThe arrangements made for the Mahamaham in Kumbakonam is forgotten or easily ignored by the people. It is not a small thing for a town like Kumbakonam to receive about five million pilgrims in a week. Right from the Chief Minister, government machinery and NGOs worked overtime to ensure that it passed off peacefully. We have to be thankful to all those who made it a grand success.\n\nR. Soundararajan,\n\nNagapattinam\n\nCommendable job\n\nin Kumbakonam\n\nKumbakonam Mahamaham went on well bringing plaudits to the government and the district administration. Of course, the local administration with local volunteers have coordinated well. Health Department and the municipal workers have done a great job. But the internal movement of local residents was restricted. Local residents were given passes but that did not work. After the big day, the pilgrims found it difficult to go to railway station and bus stand by taking auto and other small vehicles as they were not allowed till evening. This could have been avoided.\n\nS. Krishnan,\n\nThippirajapuram", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}