{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mayor S. Soundappan on Monday presented a Rs. 5.94 crore deficit budget for 2016-17. The projected revenue for 2016-17 was Rs. 455.83 crore while the projected expenditure was Rs. 461.77 crore.\n\nMr. Soundappan said that the Corporation would spend Rs. 17.58 crore for implementing solid waste management project, construct two new modern parks, reduce usage of paper in Corporation offices and increase usage of computers, construct 10 shelters for commuters at bus stops, construct commercial complexes on Venkatappan Road in Ward 29 and in Ward 30, renovate two commercial complexes and establish parking lot in vacant land in Ram Nagar in Ward 15.\n\nThe Mayor said that a project had been submitted for developing the Panamarathupatty Lake and to promote tourism at a cost of Rs. 28 crore. Also, the ‘seemai karuvelam’ (prosopis juliflora) would be removed from the lake for which tender had been floated at Rs. 4.61 crore, he added.\n\nThe budget revealed that of the total expenditure of Rs. 147.20 crore that it would be incurring in 2016-17, employees’ salary would be Rs. 58 crore, retirement benefits Rs. 18.95 crore, administrative cost Rs. 26 crore, operating cost Rs. 22 crore and other expenses Rs. 2.6 crore. This leaves the Corporation to spend Rs. 28 crore for projects as it intend to borrow money from the government institutions and other sources.\n\nEarlier, when the Mayor began presenting his speech, DMK councillors torn the budget documents and staged a walkout from the hall. Addressing the media, leader of the Opposition M. Bhuvaneswari said that no new schemes were announced in the present budget and proposals in the past budgets were yet to be fulfilled. She said that in the budget presented in 2011, the Mayor said that 90 per cent of the Mettur – Salem Dedicated Water Supply Scheme was completed. However, even in 2016, only Phase I was completed and Phase II was yet to be completed, she added.", 
    "section": "national", 
    "title": "Salem Mayor presents Rs. 5.94-cr. deficit budget", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}