{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Contribution of Employees Provident Fund for new employees for three years will encourage investments and setting up of new industries, according to industry associations here.\n\nSkill development\n\nCoimbatore SIDCO Industrial Estate Manufacturers’ Association president V. Loganathan has said that efforts towards skill development are the need of the hour and the scheme should be extended to all cities in the country.\n\nA portion of the amount allocated to Mahatma Gandhi National Rural Employment Guarantee Scheme should be given to rural industries too so that the rural people get an opportunity to work in the industries.\n\nAccording to S. Ravikumar, president of Coimbatore Tirupur District Micro and Cottage Entrepreneurs’ Association, many of the demands of the micro sector have not been met.\n\nThe need to start MUDRA Bank on the lines of SIDBI has not been accepted. While the Government has announced tax exemption for new units, it has not made announcement for the existing micro units that were asking for loans at 10 per cent interest.\n\nDisappointed\n\nK. Maniraj, president of Kovai Power Driven Pumps and Spares Manufacturers’ Association, has said in a press release that pumpset manufacturers are disappointed that the customs duty on raw materials for pumpsets has not been reduced and the six per cent excise duty on pumps has not been brought down. There is a possibility of prices of pumps going up, he said.\n\nCoimbatore Compressor Industries’ Association president M. Raveendran has said that though there is no announcement to revive the engineering sector, the association welcomes the announcements related to setting up of multi-skill centres and tax benefits to units that have annual turnover upto Rs. 5 crore.", 
    "section": "national", 
    "title": "Several demands not met, say industry associations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}