{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘The Budget also does not speak of the status on implementation of many schemes announced in the last two years’\n\nThe Budget lacks flavour as it does not have any specific announcement of schemes to enthuse different segments, including the States, said Chief Minister Jayalalithaa.\n\nIn a statement, she said it also does not speak of the status of implementation on many schemes announced in the last two years and that the people of Tamil Nadu had higher expectations which have not been met.\n\nMs. Jayalalithaa, however, welcomed and appreciated the launch of many schemes based on the model of successful schemes implemented by her such as the Chief Minister’s Health Insurance Scheme, Amma Marunthagam, soil health scheme, free laptop, grinder, mixie and fans schemes.\n\nAs the Plan Expenditure has actually been increased in the Revised Estimates for 2015-16, she hoped the release of funds for States for scheme expenditure would be speeded up. She was happy to note that the Finance Minister had accepted her suggestion to do away with the Plan and Non-Plan distinction with effect from 2017-18 and focus on revenue and capital outlays. “This is a much needed reform,” she said.\n\nWelcoming the emphasis on agriculture and rural income, Ms. Jayalalithaa said doubling farm income in five years should be done in real terms. On the irrigation front, she said Tamil Nadu stands to suffer as the Centre looks to repeat an old error.\n\nShe expressed concern over the proposal to privatise the road transport sector through Central legislation by amending the Motor Vehicles Act. “We have consistently opposed encroachment of powers of the State governments by this proposed legislation,” she said.\n\nIt was unfortunate that the Finance Minister has not eschewed the tendency to levy cess and surcharges on various items of Central taxes which are not shareable with the States. Citing levy of cess on service tax, infrastructure cess on excise duty on vehicles and a few other cess, Ms. Jayalalithaa said such steps were retrograde measures by which the Centre was trying to avoid sharing its tax proceeds with States .\n\nThe proposal to treat assignment of spectrum usage as a service and not a sale of intangible goods also eats into the tax base of State governments while enhancing the base of the Centre, she said opposing the proposal. On the whole, the tax proposals in the Budget are regressive, she said.", 
    "section": "national", 
    "title": "Tax proposals regressive: Jayalalithaa", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}