{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur : Theppam festival, Thayar purappadu from sanctum sanctorum, 6 p.m.; reaching theppam mandapam, 6.15 p.m.; purappadu from the mandapam, 8 p.m.; reaching sanctum sanctorum, 8.15 p.m.\n\nSri Srinivasa Perumal Sannidhi, BHEL Township: Brahmotsavam, poojas, 6.30 p.m.\n\nGENERAL\n\nJamal Mohamed College : Discussion on Union Budget, 10.30 a.m.\n\nSri Sivananda Balalaya: Bala Vigyan Utsav, J.Ramanan, founder, Science and Adventure Club, Tiruchi, inaugurates and speaks on Science in nation building, Adavathur campus, 10.30 a.m.\n\nM.A.M.School of Engineering : Workshop on Safety Awareness, D.Jagan Narayanan, Director, Vijay Institute of Safety Training, chief guest, 9.30 a.m.\n\nImayam College of Arts and Science : Valediction of NSS special camp, LAkshmi Prabha, NSS Coordinator, Bharathidasan University, chief guest, Government Higher Secondary School, Murugur, noon\n\nM.A.M.College of Engineering and Technology: Lecture on Rapid wall construction by K.Vairakannu, associate professor, 10.30 a.m.\n\nCARE Group of Institutions Department of Computer Science and Engineering : National level technical symposium, P.Raja, professor, National Institute of Technology, Tiruchi, inaugurates, 10 a.m.; Department of Electrical and Electronics Engineering: National level technical symposium, 10.30 a.m.\n\nBishop Heber College : Golden jubilee state level invitation inter-collegiate basketball tournament for Bishop Solomon Doraiswamy Memorial Trophy, M.Gopinath, deputy director of physical education, Anna University, Tiruchi, inaugurates, 6.30 a.m.; Department of Social Work: Awareness programme for street children, V.Nagar, 11.30 a.m.; life skills programme for visually impaired students, Government Girls Higher Secondary School, Puthur, 3 p.m.; personality development programme, St.John’s higher Secondary School, Irungalur, 11 a.m.; awareness programme on personal hygiene, Hope World Wide, Edamalaipattipudur, 5.30 p.m.; motivation programme, BHM School, Tranquebar House, 11.30 a.m.\n\nAIMAN College of Arts and Science for Women : Fire safety programme, Abdul Razak, Managing Director, Zenith Safety Solutions, chief guest, 11.30 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}