{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Chettipalayam Police have arrested two persons and are on the look out for two others for allegedly attacking three employees of a bar, attached to a tasmac outlet, in the wee hours of Monday. The arrested were identified as B. Velmurugan (23) and S. Poovarasan (23). The incident took place at a bar in JJ Nagar near Chettipalayam. Around 3.30 a.m. on Monday, the accused went to the bar and asked for liquor. Sekar (45), a bar employee, had asked them to come after 10 a.m. In a fit of anger, the accused attacked him with a billhook. Two other employees Chinnappan (46) and Selvam (23), who came to Sekar’s aid, were also attacked. Sekar and Chinnappan have been admitted to Coimbatore Medical College Hospital. Based on a police complaint lodged by Selvam, the accused were booked under sections 294(b) (using obscene language), 324 (voluntarily causing hurt by dangerous weapons or means) and 506(ii) (criminal intimidation) of the Indian Penal Code.\n\nAttempt to murder\n\nIn another incident, the police are on the lookout for a labourer from Andhra Pradesh for allegedly trying to murder four of his fellow workers in a drunken brawl near Chettipalayam, on Sunday.\n\nOn Sunday night, all were said to be in an inebriated condition. Four persons identified as Sriramalu, China Masthan, Periya Masthan and Raghav prepared dinner and woke up Basha, the accused, for dinner. Basha, who could not locate his mobile phone, started attacking others. The injured were admitted to CMCH. The condition of Periya Masthan was said to be critical.\n\nPolice have booked Basha under sections 307 (attempt to murder) and 324 (voluntarily causing hurt by dangerous weapons or means) of IPC. Basha is at large.\n\nAcquitted\n\nFive Dalit activists who were booked by the police in 2010 for alleged attempt to derail trains at Uthukuli in Tirupur, by placing boulders and concrete slabs on the track, were acquitted by the Judicial Magistrate VI here, on Monday.\n\nThe five activists M. Gandhi (38), R. Parameswaran (45), R. Manickam (57), V.C. Kathiravan (39) and K. Mani (38) were from Uthukuli and attached to Puratchi Puligal Movement. Their counsel claimed that the five were acquitted as there was no direct or circumstantial evidence against them.", 
    "section": "national", 
    "title": "Two arrested for attacking bar employees", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}