{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They point out absence of big ticket disinvestmentand also no relief for income tax payers\n\nConsumer bodies have termed the Union Budget as not encouraging even while welcoming certain announcements made by Finance Minister Arun Jaitley.\n\nThe Federation of Consumer and Service Organisations, Tiruchi, has said that the personal income tax slab remained unchanged causing great disappointment to the middle class.\n\nIn a statement, its president M. Sekaran said there was no encouraging scheme to increase the income tax net. Only 3 per cent of the population were paying taxes, he said.\n\nThe huge allocation of funds and some announcements pertaining to development of farmers and the agriculture sector seemed good. However, there was no announcement in reducing the gap between agricultural producers and consumers and setting up of centres for value-added farm products.\n\nThe announcement of health insurance was nothing but a waste, he said and claimed that it would help the corporate hospitals.\n\nThe government should ensure healthcare to all its citizens without any amount slab.\n\nThe supply of free LPG to the people below poverty line might not work considering the fact that such a scheme introduced by the Tamil Nadu government seemed to be a failure, he said. There was no encouraging announcement to promote small scale industries in the budget under the Make in India Scheme, he said.\n\nS. Pushpavanam, secretary, Consumer Protection Council, Tamil Nadu, Tiruchi said the tax net should have been expanded.\n\nIt was a shame that only around 3 per cent paid income tax.\n\nAlthough Mr. Arun Jaitley had said last year that India was poised to fly he was still taxing. He had not taken any wrong step but the pace was not in keeping with expectations, he said.\n\nIt was a disappointment that big ticket disinvestment like certain public sector banks and Air India had not been proposed.\n\nHealth insurance of Rs. 1 lakh per family with additional Rs. 30,000 for seniors for the bottom one-third of the population was welcome.\n\nEstablishment of 3,000 generic drug stores would save the consumers as now generic drugs were sold as branded drugs.\n\nThe intention to bring comprehensive central legislation to stop illicit deposit taking would save the innocent depositors from getting duped\n\nInstead of monetizing the huge NPAs of the banks, the government was again pumping money as recapitalization.\n\nDigital depository\n\nAn important measure was digital depository for school certificates, college degrees, mark sheets and awards. If transfer certificate was included, the confiscation of certificates by educational institutions (when students leave the institution for better institution) would once for all stop, Mr. Pushpavanam said.", 
    "section": "national", 
    "title": "Union Budget not encouraging, say consumer bodies", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}