{
    "author": [
        "S Senthalir"
    ], 
    "text": "Social worker and writer Harsh Mander said universities should be the sites of free thinking in the backdrop of protests, over the arrest of students in JNU campus in New Delhi, refuse to die down, debates on patriotism and sedition continue to intensify across the country.\n\nSpeaking to The Hindu , human rights activist and writer Harsh Mander who was in Puducherry for a talk on ‘Inequality, Prejudice and Indifference in New India’ last week, discussed issues troubling the nation and the indifference of the privileged people towards this.\n\nHe said: “Universities should be the site of free thinking. If we look back, every change for a just world started with the dreams of young people. Universities have always been places of questioning.”\n\nThe former member of the Indian Administrative Service talked about the government’s attempts to quell dissenting voices. “The heart of democracy is tolerating the dissenting voices of people and providing space for diverse views to coexist, where differences are sorted out through debate. When I was growing up in a college in Delhi, some people were becoming naxalites, some were Trotskyite, I witnessed the Jayaprakash Narayan (JP) movement, people were questioning.”\n\nThe writer, who has seven books to his credit, accused the government of attempting to crush the political opponents first, then raising questions of funding to tame the civil society and then media. Large segments of the media have fallen in line because of big businesses. Now, the target is the educational institutions.\n\n“The huge base of dissent is the university and students. Now, we see an attempt to crush this as well. The Prime Minister speaks about online media, blogs and newspapers, which are free of big business control that requires government supervision. The government is slowly trying to submit people into its majoritarian politics as well as its economic model,” he said.\n\nThe writer termed the arrest of JNU students Kanhaiya Kumar, Umar Khalid and Anirban Bhattacharya under sedition as the most dangerous thing. “I think the law is very clear that active incitement to violence is something seditious and mere sloganeering by students should not be criminalised. Even if it is against the nation or if students are against the nation, the nation should have a heart large enough to deal with voices and questions of people even in extreme ways.”\n\nHe added that Prime Minister Narendra Modi had made great promises in creating employment and providing equal opportunities. “But, today we are facing crisis in agriculture, employment and industries. Instead of addressing the enormous frustration of young unemployed people by creating jobs, the government is only dividing the nation in the name of hyper nationalism,” he says.\n\nHe cautioned the progressive forces fighting for equal society to be careful to keep the discourse on the pertinent issues steady and not remain only reactive to the problems raised by the government. “It is important to react but they should be prepared to talk about crisis in agriculture, most importantly our failure to create jobs. The dwindling public investments in education and health care and the absence of social and security and large masses of people,” he said.\n\nHe sees deeply hopeful in the personalities of students like Late Rohit Vemula and Kanhaiya Kumar. “With both coming from both came from extraordinary disadvantaged backgrounds they grew to be young men who cared so deeply about social justice, equality, who had gained finer articulations and a sense of solidarity extended well beyond this specific identity.” This is the compassion that he calls for even in his book ‘Looking Away, Inequality, Prejudice and Indifference in New India’.", 
    "section": "national", 
    "title": "Universities should be sites of free thinking: Harsh Mander", 
    "subsection": "tamilnadu", 
    "date": "2016-03-01"
}