{
    "author": [
        "Yuthika Bhargava"
    ], 
    "text": "With the CAG report tabled in Parliament on Friday indicating a loss of Rs. 12,489 crore to the exchequer due to understatement of revenues by six telecom operators, including Airtel, Idea and Vodafone, the government has ordered a special audit of telecom companies for three years.\n\n“Verification of records of six PSPs indicated total understatement of Rs. 46,045.75 crore in gross revenue, having corresponding impact of Rs. 3,752.37 crore on licence fee (LF) and Rs. 1,460.23 crore on spectrum usage charge (SUC). The interest on this short/non-payment of LF and SUC works out to Rs. 7,276.33 crore,” the Comptroller and Auditor General of India (CAG) said.\n\nThis is for the four-year period from 2006-07 to 2009-10.\n\nCommenting on the findings, Telecom Minister Ravi Shankar Prasad said special audit of the operators’ books would be done for three years from 2009, to check for under-reporting of revenues.\n\n“I have taken a grim view on this because this is again a legacy issue of the previous government… Even though in terms of well-established parliamentary procedure, the report will go to the Public Accounts Committee, I have directed Secretary Telecom and Member Finance to put in place a robust system in order that such gaps do not reoccur,” Mr. Prasad said.\n\n“In conclusion, the audit found that even after 16 years of the introduction of the revenue share regime, the correctness and completeness of revenue flowing into the consolidated Fund of India could not be assured by DoT,” the CAG said.\n\nThe CAG report said the financial impact on LF and SUC due to understatement of gross revenue stood at Rs. 1,507.25 crore for Reliance Communications, Rs. 1,357.68 crore for Tata Teleservices, Rs. 1,066.95 crore for Airtel, Rs. 749.85 crore for Vodafone, Rs. 423.26 crore for Idea and Rs. 107.61 crore for Aircel.\n\nThe interest calculated on these amounted to Rs. 2221.29 crore for Reliance, Rs. 1857.71 crore for Tata Teleservices, Rs. 1584.94 crore for Airtel, Rs. 915.54 crore for Vodafone, Rs. 541.63 crore for Idea and Rs. 155.22 crore for Aircel.\n\nOn the other hand, the two industry bodies representing telecom operators in a joint statement said that matters relating to interpretation of ‘Gross Revenue/Adjusted Gross Revenue’ of telecom companies for the purpose of calculation of licence fees are under litigation in various judicial forums including the TDSAT, High Courts and the Supreme Court.\n\n“The issues pointed out by the CAG pertain to those disputes, which have either been settled or stayed by various Courts. We would like to reiterate that our member-companies follow the highest standards of corporate governance and have always been in compliance with all regulations,” they added.\n\nThe telecom operators had earlier opposed auditing of their books by the CAG. However, a Supreme Court ruling in favour of the auditor in 2014 forced the companies to share the information. The report observed non-compliance with the licence conditions by netting off of discounts/waivers granted to post-paid subscribers and under-reporting of revenue from infrastructure sharing with other telecom operators, among others.", 
    "section": "national", 
    "title": "CAG finds telcos understating revenues, govt. orders audit", 
    "subsection": "general", 
    "date": "2016-03-12"
}