{
    "author": [], 
    "text": "“In conclusion, the audit found that even after 16 years from the introduction of the revenue share regime, the correctness and completeness of revenue flowing into the consolidated Fund of India could not be assured by DoT,” the CAG added.\n\nThe CAG report points out that financial impact on LF and SUC due to understatement of gross revenue stood at Rs. 1,507.25 crore for Reliance Communications, Rs. 1,357.68 crore for Tata Teleservices, Rs. 1,066.95 crore for Airtel, Rs. 749.85 crore for Vodafone, Rs. 423.26 crore for Idea and Rs. 107.61 crore for Aircel.\n\nThe interest calculated on these amounts to Rs. 2221.29 crore for Reliance, Rs. 1857.71 crore for Tata Teleservices, Rs. 1584.94 crore for Airtel, Rs. 915.54 crore for Vodafone, Rs. 541.63 for Idea and Rs. 155.22 crore for Aircel.\n\nOn the other hand, the two industry bodies representing telecom operators in a joint statement said that matters relating to interpretation of ‘Gross Revenue/Adjusted Gross Revenue’ of telecom companies for the purpose of calculation of licence fees are under litigation in various judicial forums including the TDSAT, High Courts and the Supreme Court.\n\n“The issues pointed out by the CAG pertain to those disputes, which have either been settled or stayed by various Courts. Further, we would like to reiterate that our member companies follow the highest standards of corporate governance and have always been in compliance with all regulations,” they added.\n\nThe telecom operators had earlier opposed auditing of their books by the CAG. However, a Supreme Court ruling in favour of the auditor in 2014 forced the companies to share the information.\n\nThe CAG observed non-compliance to the licence conditions by netting off of discounts/waivers granted to post-paid subscribers, netting of discounts from revenues pertaining to roaming services, non-inclusion of forex gains, interest income and profit from sale of investments, and under-reporting of revenue from infrastructure sharing with other telecom operators, among others.\n\nAs per the New Telecom Policy-1999 (NTP-1999) telecom service providers were required to pay a percentage of their adjusted gross revenue as LF in place of fixed licence fee, besides SUC for the use of airwaves allotted to them.\n\nThe Department of Telecom had earlier too done a special audit for two years (2006-07 and 2007-08), based on which a demand of Rs. 1846.51 crore against five telecos — Bharti Airtel, Reliance Communications, Vodafone, Idea and Tata, was issued. This has been challenged by the operators in the court.", 
    "section": "national", 
    "title": "Centre orders audit of six telcos", 
    "subsection": "general", 
    "date": "2016-03-12"
}