{
    "author": [
        "National Bureau"
    ], 
    "text": "Transgressions have led to face-off between the ITBP and the PLA twice in the past four days\n\nPersonnel of the People’s Liberation Army (PLA) of China transgressed into the Indian territory in Ladakh, Jammu and Kashmir, twice in the past four days. An official in the security establishment said that with the new border defence mechanism in place, the issue was resolved in no time along the Line of Actual Control (LAC).\n\nWhile the first incident was reported on March 8, there was a face-off between the Indo-Tibetan Border Police (ITBP) and the Chinese PLA on Friday as well.\n\nThe official said that as the summer had set in, both the sides had initiated long-range patrolling and the recent transgressions were reported along the undefined boundary with China.\n\nOn March 8, Chinese troops entered almost 6 km deep inside the Indian territory near the Pangong lake in Ladakh.\n\nThe incident led to a stand-off between security personnel of the two sides.\n\nA platoon of at least 11 PLA men, led by a colonel-rank officer, crossed over the LAC at ‘Finger VIII’ Sirjap-I area close to the Pangong lake, said the official.\n\nThe Chinese soldiers entered in four vehicles from across the Thakung border post of India and reached 5.5 km deep inside Indian territory, he said.\n\nFriday’s incident was also reported near the Thakung post in Ladakh with the two sides engaged in an eyeball-to-eyeball situation.\n\n“We showed them banners and told them that they had entered the Indian territory. They retreated immediately and the matter was resolved,” said the official.\n\nHe also explained that it was incorrect to call the incidents as “incursions.”\n\n“Both the sides have undertaken long-range patrolling and with no demarcation of the border, we often transgress into each other’s territory. “Such incidents reach their peak in summers as active patrolling is done after the snow has melted,” said the official.", 
    "section": "national", 
    "title": "Chinese patrols enter Indian territory", 
    "subsection": "general", 
    "date": "2016-03-12"
}