{
    "author": [
        "S Vijay Kumar", 
        "Udhav Naig"
    ], 
    "text": "A first year student T. Abinath of Perambalur, studying in Sairam Engineering College, was found dead in a well on the college campus in West Tambaram here on Friday.\n\nThe college authorities claimed that the student had committed suicide because he did not want to study engineering and was forced into it by his parents. “Abinath had dreams of becoming a doctor and was a bright boy. But since he was unable to study medicine, he was disappointed. He had a few arrears in his first semester. He was stressed and had taken this unfortunate decision. It is sad. I don’t know how the college management can be held responsible,” said Saiprakash Leo Muthu, CEO, Sairam Group of Institutions. He also appealed to the people not to believe the rumours circulating on social media sites.\n\nThe incident comes barely months after the students of the college protested against the management alleging that they are being subjected to harsh, ultra-conservative rules. The students expressed doubts over the management’s version of the student’s death.\n\n“The college hostel is run by campus director Balu, who has a reputation for ill-treating and manhandling students. Also, we weren’t told what had happened when we were asked to leave. The management told us that there was an inspection from Anna University. Also, some of us were told that there was a bomb scare. We have no faith in the college management,” said a second year student on the condition of anonymity.\n\nP. Gautham, one of the victim’s roommates, claimed that Abinath was visibly upset since Thursday night after the warden had questioned him for leaving the premises without permission a couple of days ago. “After the study hour early on Friday, he did not turn up for breakfast. Around 8.45 a.m., we informed the warden,” he said. Abinath’s parents arrived late on Friday and were taken to the Kundrathur police station, where a case was registered about the boy’s death. On reports that Abinath had applied for transfer certificate and the management refused to issue the same insisting on payment of fees for four years, Mr. Saiprakash said last year alone TCs were issued to 48 students on request.", 
    "section": "national", 
    "title": "Engineering student found dead in well in Chennai college campus", 
    "subsection": "general", 
    "date": "2016-03-12"
}