{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Haryana recently filed a petition in the Supreme Court for an early hearing on the presidential reference in the SYL case.\n\nPunjab and Haryana are pitched for a bitter face-off as both States have hardened their stance on the Sutlej-Yamuna Link (SYL) canal, the focal point of a water-sharing dispute.\n\nPunjab Chief Minister Parkash Singh Badal announced in the Assembly on Thursday that the State government would de-notify the land acquired for the construction of the controversial canal in the State and the land would be returned to its original owners. Haryana Chief Minister Manohar Lal Khattar took exception to the statement and termed it “unfortunate.”\n\nStating that SYL was the lifeline of Haryana farmers, Mr. Khattar said he was confident that the State would get every drop of its legitimate share of river waters.\n\nMr. Badal said in the Assembly that not a single drop of water would be allowed to flow out of Punjab. “In fact, an extremely critical and dangerous water crisis stares its population in the face. I would rather shed every drop of my blood than allow any drop of Punjab’s river waters to flow out,” said Mr. Badal.\n\nThe Haryana government had recently filed a petition in the Supreme Court for an early hearing on the presidential reference in the SYL case which had been pending for the last 12 years.\n\nThe SYL canal, the foundation for which was laid way back in 1982, was to link the Sutlej and Yamuna rivers in Punjab and Haryana, but the project never saw the light of the day as in the 1990s — amid the rise in terrorism — water sharing became a sensitive issue.\n\nTerrorists even gunned down officials and workers involved in the construction of the SYL canal in a bid to halt the project.\n\nPunjab should protect the interests of the younger brother, says Khattar", 
    "section": "national", 
    "title": "Haryana, Punjab set to lock horns over Sutlej-Yamuna Link canal", 
    "subsection": "general", 
    "date": "2016-03-12"
}