{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The major challenge facing modern pedagogy is the ability to leverage the new era of digital content without losing those on the wrong side of that divide, Professor T Jayaraman of the Tata Institute of Social Sciences (TISS) said on Friday while addressing heads of schools and colleges at The Hindu In School 's Principals Conclave.\n\nThe conclave was organised with the aim of promoting and celebrating the spirit of education and share knowledge on education in the new age. Speaking on the challenges of education in a new age, Prof Jayaraman said three broad challenges facing the system pertained to pedagogy, institution and the larger environment in which education functions.\n\nIn pedagogy, he said, the major challenge was to take on board more quantity of teaching material without sacrificing quality. “The challenge is also to leverage the new era of digital resources without losing those on the wrong side of that divide,” he said.\n\nSpeaking of institutional challenges, he said that while it should be ensured that education remained a public good, education institutions should follow modern human resources principals and not see teaching as a noble profession which people would do for very low pay. Prof Jayaraman also spoke of a larger crisis of values where institutions needed to realise that it is important to work toward long term gains. Investment, he said, could not always be measured by immediate deliverables.\n\nEducationist Dr Geetha Mohan, also speaking at the event, said education is a lifelong process of nurturing a child and eliciting the potential that he or she already has. It was very important, she said, that a good principal realises his or her ability to make or mar the child.\n\nIn today's digital age, she added, children have all the information in the world at their fingertips but they need to be guided on how to understand, assimilate and apply that knowledge. She said a child often knows about the entire world but not enough about him or herself and that is where they need someone wise to guide them.\n\nPrincipals present spoke about a range of topics and exchanged ideas on how to improve school and college education. The conclave was organised in association with SRM University, a partner in this initiative of holding the meet at 17 centres where The Hindu is published. Envisaged as an opportunity to promote and celebrate the spirit of education, the event is being organised annually.", 
    "section": "national", 
    "title": "‘Leveraging new era of digital content a challenge’", 
    "subsection": "general", 
    "date": "2016-03-12"
}