{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India’s quest for permanent membership of the United Nations Security Council (UNSC), on Friday faced a new challenge with Mexico coming out in opposition to India’s campaign.\n\n“We don’t support India’s campaign for permanent seat at the UNSC. We do not think adding more permanent members in the Security Council is the solution. More veto power-wielding permanent members will mean more paralysis of the U.N. Instead we are willing for a compromise with India and India can opt for long-term membership with possibilities of election,” Foreign Minister of Mexico Claudia Ruiz Massieu said here on Friday addressing the Indian Council of World Affairs (ICWA). Ms. Massieu who is on a three-day visit to India indicated that India has taken a maximalist position by demanding a permanent membership at the UNSC with veto powers as the permanent members of the United Nations are yet to give up their control over the United Nations. “How long can India wait?” Ms. Massieu asked urging India to reconsider its stance for the permanent membership of the UNSC and opt for an alternative tactic.\n\n“We hope to reach a consensus that represents the current global community and the need to have peaceful solution to the challenges facing the world,” Ms. Massieu said.\n\nInterestingly, the Mexican opposition to India’s quest at the UNSC came two days after the United Nations held the “Informal Plenary meeting of the Inter-governmental Negotiations on equitable representation” with India strongly reiterating its demand for reform of the UNSC.\n\nIn the Plenary held on Wednesday, India’s Permanent Representative, Syed Akbaruddin tried to convince those countries who oppose new members with veto power in the UNSC arguing that the issue of the veto can be reviewed later whereas the democratisation of the U.N. cannot wait any longer.\n\nAs alternative, New Delhi urged to opt for long-term membership, with possibilities of election", 
    "section": "national", 
    "title": "Mexico opposes India’s campaign for UNSC", 
    "subsection": "general", 
    "date": "2016-03-12"
}