{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Prime Minister Narendra Modi will visit Bihar on Saturday for the first time after the State Assembly poll last year, to attend two functions in Patna and Hajipur. The ruling coalition has decided to remind him of the “special package” for the development of the State announced by him during the poll campaign.\n\nMr. Modi is scheduled to attend the concluding function of the Patna High Court’s centenary year celebrations and, after delivering the keynote address, leave for Hajipur in Vaishali district to flag off several Railway projects there. Railway Minister Suresh Prabhu; Union Cabinet Ministers hailing from Bihar; Chief Minister Nitish Kumar; and State BJP leaders are expected to attend the function.\n\nMeanwhile, the leader of the ruling coalition partner RJD and Deputy Chief Minister Tejaswi Yadav, said he would remind the Prime Minister of the Rs 1.65-lakh crore “special package” announced during the poll campaign. “Yes, getting a chance to meet him, I’ll definitely remind him of the special package,” Mr. Yadav told media persons. Mr. Modi had announced the package at Ara.\n\nLeaders of the ruling party JD(U) too reiterated the same point and said: “The people of Bihar are waiting for the implementation of the Prime Minister’s special package for Bihar which he himself has announced”.\n\nIn the run-up to the functions, over three dozen farmers of Sultanpur village in Hajipur had protested against the plan to use their land as the venue for the Prime Minister’s programme.\n\nDespite repeated requests by the district administration and Railway officials, the farmers refused to accept compensation and cut their standing crops. Later, the venue was shifted to the Chhaukia village under the Raghopur Assembly constituency represented by Tejaswi Yadav.\n\nThe Prime Minister will be in Hajipur for an hour and address the people there after inaugurating several Railway projects.\n\nHe will remain in Bihar for about three hours and return to New Delhi at 5.15 p.m.\n\n“Over 5,000 policemen have been deployed at both the places and three SP-rank officials have been deputed for Patna and two for Vaishali district”, said Sunil Kumar, Additional Director General of Police (Headquarters).", 
    "section": "national", 
    "title": "Modi in Bihar today, State to remind him of poll promise", 
    "subsection": "general", 
    "date": "2016-03-12"
}