{
    "author": [
        "Stanly Johny"
    ], 
    "text": "Prime Minister Narendra Modi will travel to Israel this year which will be followed by a visit to India by either Israeli Prime Minister or President, a diplomat from the West Asian country has said.\n\n“We don’t know the dates yet. What we are expecting is that Prime Minister Modi will arrive in Israel either this spring or summer and then either the Prime Minister [Benjamin Netanyahu] or the President [Reuven Rivlin] will come to India in the second part of 2016,” Yael Hashavit, Israel’s Consul-General in Bangalore, said.\n\nIn an interaction with The Hindu ’s editors here, Ms. Hashavit, a career diplomat, who has just been posted to India, said India is a “very important” partner for Israel. “When we say that, we mean it. Our Prime Minister has said it several times how important it’s for Israel to work with India, to do business with India and how much India supported Israel. It’s a very open relationship.”\n\nIn October, President Pranab Mukherjee visited Israel, Jordan and Palestine. “The [Israeli] embassy in Delhi is trying to set the date for Modi to go there and Netanyahu to come here,” said Ms. Hashavit.\n\nNo Indian Prime Minister has visited Israel. The only Israeli Prime Minister who came to India was Ariel Sharon, in 2003.\n\nMs. Hashavit said stronger bilateral cooperation was possible in several areas such as agriculture, water technology and counter-terrorism. “Mr. Modi says all the time start up India. Netanyahu says the same thing. He says start up nation.”\n\nThe diplomat said bilateral non-military trade between the two countries now stood at around $4 billion. “This is a nice number, but can be increased further. There are many fields India and Israel can further strengthen ties. Culturally, India feels comfortable in working with Israel and Israel feels very comfortable with India.”", 
    "section": "national", 
    "title": "Modi will visit Israel this year: diplomat", 
    "subsection": "general", 
    "date": "2016-03-12"
}