{
    "author": [], 
    "text": "My fight is against injustice done to the State during Modi rule, says Tarun Gogoi.\n\nMy fight is against injustice done to the State during Modi rule, says Cong. leader\n\nAssam Chief Minister Tarun Gogoi on Friday said the primary issue in the coming Assembly polls would be to fight against the alleged injustice done to the State by Prime Minister Narendra Modi.\n\n“My fight is against the injustice committed towards Assam and the northeast during the last two years by Prime Minister Modi,” Mr. Gogoi told reporters here.\n\nThe BJP government had “committed injustice that was never done before, like removing special category status, change in the funding pattern, removing the North East Industrial and Investment Promotion Policy, among other steps,” he said.\n\n“My fight is not against BJP’s chief ministerial candidate Sarbananda Sonowal. In fact, I feel pity for him and other leaders of the party from the State. They cannot even open their mouth before Mr. Modi,” Mr. Gogoi said.\n\nHe said the Congress would continue to fight against the BJP’s “divisive policies and politics of polarisation,” “At any cost we will not allow Assam’s cultural invasion by the RSS and destroy the prevailing harmony between the different communities,” he said.\n\nBlames Mahanta regime\n\nfor ‘secret killings’\n\nRaking up the allegations of secret killings during former Chief Minister Prafulla Kumar Mahanta’s tenure, Mr. Gogoi said the alliance between the Asom Gana Parishad and the BJP was “opportunistic.”\n\n“Secret killings during Mr. Mahanta’s rule was a blot on Assam’s history and both the AGP in the State and the BJP-led NDA government at the Centre during that period were equally responsible for the killing of innocent people,” Mr. Gogoi said.\n\n“Mahanta is responsible for the secret killings and it could not have been possible without the support of the Central government where the NDA was in power then,” the Chief Minister said.\n\nThe period of Mr. Mahanta’s second term in office and the NDA government at the Centre was the worst phase in Assam’s history “when the State bled both in terms of law and order and financially,” he said.\n\nMr. Gogoi said his government had failed to identify the culprits, but stopped all such killings. — PTI", 
    "section": "national", 
    "title": "Modi was unfair to Assam: Gogoi", 
    "subsection": "general", 
    "date": "2016-03-12"
}