{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "After several years of delay, Kalvari is scheduled to be commissioned by the year-end.- File Photo: PTI\n\nAfter the completion of the present order for six Scorpene submarines, the Navy will place additional orders for them with Mazgaon Docks Limited (MDL), the government informed Parliament on Friday.\n\n“In the particular area of submarines what the honourable member is trying to point out is the initial yard where the submarine is being laid. Now that is already vacant. We are trying to increase the number of submarines that they are making,” Defence Minister Manohar Parrikar said in response to a question in the Lok Sabha.\n\nMDL has six submarines on order which are being built with technology transfer from DCNS of France. After several years delay, Kalvari — the first of the submarines — was launched last month and is scheduled to be commissioned by year end after extensive trials. The remaining five, which are in various stages of construction, are expected to be delivered in the next nine months.\n\nWhile Mr. Parrikar had last year hinted about more Scorpenes, this is the first time it was announced in the Parliament. “We will not let MDL lose the expertise it has gained to licence-build six Scorpene submarines,” he had said.\n\nSpeaking at a separate event, Vice Chief of the Navy Vice Admiral P. Murugesan said the tender for the next line of six submarines to be built in India under Project-75I would be issued once the new Defence Procurement Procedure (DPP) is released.\n\n“Once the revision procedure completes, it will be time to decide which shipyard will manufacture the submarines (P-75I),” Vice Admiral Murugesan said. He was speaking at a press briefing on the upcoming seminar “Make in India” being organised by the Navy and the industry body FICCI.\n\nStatement raises eyebrows\n\nThe statement by Defence Minister Manohar Parrikar on the deal for a new line of submarines under Project-75I has raised eyebrows.\n\n“P-75I Indian, which is reserved for private shipyard, is a different technology submarine,” Mr. Parrikar said, contrary to the existing information that it was open to all compliant shipyards in the country.", 
    "section": "national", 
    "title": "Navy to order more Scorpenes after present order of six is completed", 
    "subsection": "general", 
    "date": "2016-03-12"
}