{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "A committee of members of the Maharashtra Assembly and the Council will study the draft of the new law on dance bars.\n\nThe Maharashtra government on Friday announced that a new bill banning dance bars in Maharashtra will be presented in the ongoing session of the State Assembly.\n\nDhananjay Munde, Leader of the Opposition in the State Council, on Friday raised an attention motion demanding a law. Chief Minister Devendra Fadnavis announced the decision.\n\nMr. Fadnavis announced a committee of members of Assembly and Council to study the draft of the new law.\n\n“The committee will give its report within next three to five days. Prior to it, the committee will understand the legal aspects of the law and recommend the steps,” he said, adding that the Bill will be brought in the ongoing session.\n\nEarlier, Mr. Munde accused the government of not fighting the case strongly in the Supreme Court.\n\n“Dance bars have destroyed numerous families. If dance bars restart again, the same will happen to today’s generation as well. It will lead to an increase in criminal activities. The State must think over it and bring new legislation in this session,” he said.\n\nRecalling that the ban on dance bars was struck down by the court twice earlier, the Chief Minister said the ban imposed in 2005 was first revoked by the Bombay High Court and an appeal in the Supreme Court rejected in 2013. He said the apex court had rejected the State’s conditions such as installing CCTVs providing live footage from the dance bars.\n\nDuring a hearing on March 2, a Supreme Court bench had asked the Maharashtra government to issue licences to dancer bars by March 15, paving the way for their reopening.\n\nThe apex court had granted three days time to the owners of the hotels and restaurants to comply with the modified conditions, and expected the competent authorities in the government to issue licences in 10 days thereafter.", 
    "section": "national", 
    "title": "New law to ban dance bars in Mumbai soon: Fadnavis", 
    "subsection": "general", 
    "date": "2016-03-12"
}