{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Rs. 5 crore is for restoring biodiversity and is not penalty, says Tribunal\n\nIn its interim direction on Friday, the National Green Tribunal (NGT) ordered the Art of Living (AoL) Foundation to pay Rs. 25 lakh before the commencement of its three-day World Culture Festival being held on the flood plains of the Yamuna river in the national capital. The Tribunal granted AoL three weeks’ time to pay the remaining Rs. 4.75 crore of the compensation.\n\n“The amount of Rs. 5 crore is being levied as environmental compensation for the restoration amount for biodiversity park and not as penalty,’’ NGT said.\n\nHearing on April 4\n\nIt has also said that if AoL “fails to pay up, then the Tribunal would attach the grant which the Culture Ministry is to release to AoL.’’ The next hearing on the matter would be on April 4.\n\nHowever, at the beginning of the proceedings on Friday, the Tribunal expressed its strong displeasure on the statements in the media by AoL head Sri Sri Ravi Shankar, who had allegedly said that “he would go to prison but not pay the fine.” Sri Sri had also said that he was not “satisfied” with the verdict of the NGT and would appeal against it.\n\n“If anybody hurts the image of the Tribunal, we will take it to a logical conclusion as per rule of law. Don’t make the Tribunal a subject of controversy,” the NGT said.\n\nThe AOL informed NGT that it had obtained the certificate of safety from the Delhi Fire Department, while the counsel arguing against the festival sought a ban on the event saying that construction at the venue has been allowed without any risk assessment to the environment.\n\nThe Tribunal's order came on the pleas by NGOs and environmentalists who had sought cancellation of the festival, saying it would seriously endanger the fragile ecosystem on the riverbed.\n\nMore than 35 lakh people are expected to participate in the festival.\n\nSpeaking at the event, Prime Minister Narendra Modi said: “We need the art of living to follow our dreams, to fight challenges and live for others. This is the Kumbh mela of art and culture; the world is not only connected through economic issues, it can be connected through humanity… I still recall during my visit to Mongolia, there was an Art of Living centre in that country, and they had organised a reception for me, where there were few Indians, but Mongolians were waving the Indian tricolour,” he said. That was, he added, the importance of soft power in international relations.\n\nThe Prime Minister’s stout defence of the spiritual guru followed similar statements by members of his Cabinet earlier. Parliamentary Affairs Minister M. Venkaiah Naidu had dismissed criticism of the WCF, saying, “It has become a fashion to criticise anything concerned with Hinduism.”\n\nHome Minister Rajnath Singh, facing loud protests in the Rajya Sabha from the opposition over the event, said: “There is no controversy. Sri Sri Ravi Shankar is known for resolving controversial issues.”\n\nSignificantly, Delhi Chief Minister Arvind Kejriwal, often on the opposite side of the political spectrum from Prime Minister Narendra Modi, is slated to attend the WCF valedictory on Sunday.", 
    "section": "national", 
    "title": "NGT frowns on Sri Sri’s stance", 
    "subsection": "general", 
    "date": "2016-03-12"
}