{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sena lashes out at Satyapal Singh on his claim that he was asked to go after Modi\n\nThe government came under fire from both the Opposition and its own ally, the Shiv Sena, on the Ishrat Jahan issue on Friday, a day after Home Minister Rajnath Singh accused the earlier United Progressive Alliance government of having tried to frame Prime Minister Narendra Modi in the case when he was Chief Minister of Gujarat.\n\nShiv Sena leader Sanjay Raut took on former Mumbai Police Commissioner and BJP MP Satyapal Singh over his claim that he was asked to go after Mr. Modi while he was part of the SIT investigating the Ishrat Jahan case. Mr. Singh had said this while speaking in the Lok Sabha during a calling attention motion moved by him and others on the issue.\n\n“This should have been told when he was pressured; now saying this has no meaning when he is a part of the ruling dispensation. You can claim your patriotism when you are pressured to do anti- national activities and you don’t worry about them and carry on your work,” Mr. Raut said.\n\nThe Congress alleged “gross injustice” for being disallowed when the calling attention motion on the matter was taken up on Thursday, a charge stoutly denied by the government and the Speaker.\n\n“Gross injustice was done to the entire Opposition parties” which were disallowed from participating in the discussion on the Ishrat Jahan issue, Congress leader Mallikarjun Kharge said amid protests from party members.\n\nHe said for want of the Opposition’s participation, the discussion was “biased” and saw “baseless” allegations against the UPA government and its leadership and projected a “one-sided story.”\n\nMinister of State for Parliamentary Affairs Rajiv Pratap Rudy, however, dismissed the Congress charge.\n\nHe said that after a decision was taken in the business advisory committee that the issue would be taken up, it was for the Congress members to give notice for participation, which was not done by them.", 
    "section": "national", 
    "title": "Not allowed to discuss issue: Congress", 
    "subsection": "general", 
    "date": "2016-03-12"
}