{
    "author": [], 
    "text": "The announcement came after Pakistani Interior Minister Chaudhry Nisar Ali Khan and senior Pakistan Cricket Board official Najam Sethi met in Islamabad on Friday.— PHOTO: AFP\n\nA senior official said: “There is no precedence to suggest that we have given written assurances to anyone. The Pakistani team is no different. They would be provided security, and the State governments have a key role to play in it. During the meeting, the Home Secretary assured the High Commissioner that he would personally supervise the security arrangements for the Pakistani team.”\n\nAfter the meeting Mr. Basit said he had got an assurance from the Home Secretary, and he would convey his recommendations to Islamabad.\n\nAn hour later, Najam Sethi, chairman of the Pakistan Cricket Board’s executive committee, announced in Islamabad that the government had given the go-ahead for the team to travel to India. Mr. Sethi made the announcement after a long meeting with Interior Minister Chaudhary Nisar Ali Khan.\n\n“I have some good news for all cricket lovers who have been waiting for long that the Interior Minister has given the clearance for the team to travel to India,” Mr. Sethi was quoted as saying by PTI.\n\nMr. Sethi said the clearance was given after “solid assurances” from the Indian government on security.\n\nThe Ministry of External Affairs issued a statement after the meeting, reiterating that security would be foolproof for all teams.\n\n“The High Commissioner of Pakistan met the Home Secretary today [on Friday] in connection with the forthcoming ICC World T20 tournament in India. The discussions were positive,” MEA spokesperson Vikas Swaroop said in a statement.\n\n“The Home Secretary conveyed to the High Commissioner that all necessary arrangements are being made for all participating countries, as appropriate, including for security of all the participants. The Home Secretary reiterated that as in the past, all participants will be looked after, and there is no cause for concern,” it said.\n\nDue to the delay in clearance, Pakistan’s first warm-up match against Bengal on Saturday has been cancelled. But the team will take on Sri Lanka on Sunday in its second practice game.\n\n“Anyone who comes to India will be given security. Not only Pakistan, but the citizen of any country who comes to India is always provided security. There should be no doubt about it,” Home Minister Rajnath Singh said on the sidelines of the 47th Raising Day celebrations of the CISF.", 
    "section": "national", 
    "title": "Pakistan govt. gives go-ahead", 
    "subsection": "general", 
    "date": "2016-03-12"
}