{
    "author": [], 
    "text": "The soccer legend is all set to auction off his medals, trophies and even his 1,000th goal crown\n\nPele, the ‘King of Soccer’, has announced that he would auction his medals and trophies and even a crown he received for scoring his 1,000th career goal.\n\nThe collection includes nearly 2,000 items, among them the gold medals the sporting legend received as a member of three Brazilian World Cup-winning squads in 1958, 1962 and 1970, a replica of the Jules Rimet Trophy and the cleats he used in the 1981 film Victory .\n\nProceeds from the auction, to be held from June 7 – 9 in London through Los Angeles-based Julien’s Auctions, will be paid into a fund established to provide financial assistance to relatives of the 75-year-old Pele, the former soccer great’s personal adviser, Jose Fornos Rodrigues, said.\n\n“Pele is like the Marilyn Monroe of the sports world. He is such an icon and a great ambassador for soccer,” Martin Nolan, executive director of Beverly Hills-based Julien’Auctions said\n\nA small portion of the funds raised will be donated to the Pequeno Principe children’s hospital in the southern Brazilian city of Curitiba, Julien’s Auctions said in a statement.\n\n“I have decided to allow fans and collectors to own a piece of my history as well. I hope they treasure these artefacts and share my story with their children and generations to come,” Pele was quoted as saying.\n\nThe top item for auction is a Jules Rimet trophy that was created especially for Pele by world soccer body FIFA and the Mexican government after he led Brazil to the nation’third World Cup victory in Mexico in 1970. It is inscribed with his three wins for Brazil.\n\nJulien’s has placed an estimated price of $400,000 –$600,000 on the trophy.\n\nJulien’s Auctions said the ball that Pele used to score his 1,000th career goal could be sold for between $40,000 and $60,000. He scored that goal in a game between Santos, the Brazilian-league club where he played for most of his career, and Vasco da Gama.\n\nThe World Cup medals could fetch between $100,000 and $200,000, while his Athlete of the Century Award has an estimate of $30,000 and the jerseys he used in Santos and New York Cosmos matches could sell for between $8,000 and $10,000, according to the auction house. — Agencies", 
    "section": "national", 
    "title": "Pele to auction medals and 1,000-goal crown", 
    "subsection": "general", 
    "date": "2016-03-12"
}