{
    "author": [
        "Special Correspondent"
    ], 
    "text": "We have been asked by our chief to wait till further instructions, says MNS\n\nRaj Thackeray had warned that three-wheelers with new permits will be set on fire.\n\nA day after violence was reported following his statement of setting three-wheelers with new permits on fire, Maharashtra Navnirman Sena (MNS) chief Raj Thackeray directed his cadre to put the agitation on hold until further instructions. This, even as Opposition and detractors slammed him for ‘once again striking a deal’ with the Bharatiya Janata Party government in power.\n\n“It is no secret that Mr. Thackeray has a secret understanding with the BJP and a few corporates. History will show you the repeated use of this tactic by him to create fear and then strike a deal with powers that be only to pull back the agitation later,” said Nationalist Congress Party spokesperson Nawab Malik.\n\nSenior functionaries in the party said the MNS leader issued a strong statement to the cadre following an incident in which an auto-rickshaw was set on fire in the city’s Andheri area on Thursday.\n\nParty leaders said there was a growing feeling in the cadre that auto unions fighting amongst themselves could take advantage of the situation and blame the MNS while settling scores with one another, said senior functionaries to The Hindu .\n\nSenior MNS leader Nitin Sardesai said: “The campaign against autos with new permits was meant to start when these auto-rickshaws actually hit the road. There was some confusion among party workers that it was to start immediately. So, after the protest at Andheri RTO, Rajsaheb has told party workers to put it on hold till he gives a call for the campaign.”\n\nAn MNS statement said: “The auto-rickshaws with new permits are yet to be out on the streets. Some unknown persons are taking advantage of this, Rajsaheb Thackeray has asked the party activists to put the campaign against autos with new permits on hold till further instructions.”\n\nOn Wednesday, Mr. Thackeray had stoked the migrant issue once again warning that three-wheelers with new permits will be set on fire, alleging nearly 70 per cent of the auto-rickshaws recently cleared to run on Mumbai's roads belong to non-Maharashtrians.\n\nBut the latest instruction was issued soon after the auto-burning incident, and circulated via WhatsApp.\n\n“I saw the message on the mobile forwarded to me by a party functionary. It was felt that auto unions should not be allowed to take advantage of the situation, and therefore I am following the instructions,\" said an MNS corporator.", 
    "section": "national", 
    "title": "Raj Thackeray puts on hold stir against new auto permits", 
    "subsection": "general", 
    "date": "2016-03-12"
}