{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Near the entrance of Sharda Bal Niketan School, the venue of the Rashtriya Swayamsevak Sangh’s Akhil Bharatiya Pratinidhi Sabha, is a garlanded image of B.R. Ambedkar.\n\nThe ongoing conclave seems set to pass a resolution on the need to counter caste discrimination.\n\n“This is the 125th birth anniversary of the Babasaheb. We believe in complementarity and harmony in society. Discrimination should end. Discussions are under way at this meeting, and a resolution is expected. The former RSS chief, Balasaheb Devras, had said caste discrimination should end as soon as possible. He had also called untouchability a great sin, saying nothing was a sin if this was not,” RSS joint general secretary Krishna Gopal told journalists.\n\nHe said this was also the 1000th birth anniversary of Ramanuja, who worked against discrimination, and the 100th birth anniversary of Jan Sangh leader Deendayal Upadhyay, who had called for securing the “welfare of the last man.”\n\nThe pitch for caste reform comes at a time when the BJP and the ABVP, the RSS’s student affiliate, have faced heat over the suicide of Rohith Vemula, a Dalit scholar of Hyderabad University. The caste divide came out dramatically at Jawaharlal Nehru University days ago when the ABVP vice-president, a Dalit, burned a copy of the Manu Smriti. The Patels in Gujarat have been demanding a quota and the Jats in Haryana recently staged a violent protest to demand reservation. Both States are under BJP rule.\n\nAsked about reservation, Mr. Gopal said reservation had the backing of the Constitution, so it was legitimate. But there could be discussions if any issue came up.\n\nJust before the Bihar Assembly elections, RSS chief Mohan Bhagwat courted controversy by calling for a review of the reservation system. Then, the RSS said reservation should continue till there was no discrimination. The conclave, attended by BJP president Amit Shah, will discuss a change in the RSS uniform. There is speculation that the half-pants will be replaced with trousers, possibly in blue, a colour associated with the Dalit movement.", 
    "section": "national", 
    "title": "RSS may pass resolution on caste", 
    "subsection": "general", 
    "date": "2016-03-12"
}