{
    "author": [], 
    "text": "Rutgers University researchers develop free-form gesture passwords\n\nYou may soon be able to log into your smartphone with sweeping gestures or doodling by using one or more fingers.\n\nResearchers from Rutgers University in the US have performed the first study of free-form gesture passwords for smartphones in the field.\n\nFree-form gesture passwords allow people to draw a password of any shape with any number of fingers, researchers said.\n\nThe results, combined with previous studies, show that free-form gesture passwords are a serious alternative to text or other log-in methods, especially for mobile devices, they said. Free-form gesture passwords are very suitable for touch-screens, faster to use, easy to remember and hard to guess.\n\n“Preventing people from hacking into your smartphone is a major issue, and it becomes even more important because people carry their smartphones everywhere,” said Janne Lindqvist from Rutgers University.\n\n“Getting access to somebody’s phone can give a lot of information about that person and make them vulnerable to lots of different kinds of attacks than can have financial and other repercussions,” said Ms. Lindqvist.\n\nPrevious work by other researchers found that text passwords and PINs were hard to use, easy to compromise and unsuitable for mobile devices. Their shortcomings include limited password space, susceptibility to “shoulder surfing” and slow entry, Ms. Lindqvist said.\n\nThe study explored how 91 people used free-form gesture passwords in their daily lives. Researchers installed software on Android smartphones and the participants created 347 text passwords and 345 gesture passwords. They completed 2,002 log-in tasks involving eight virtual accounts in their smartphones.\n\nEach participant was asked to create and recall passwords for two different sets of accounts created for the study. The first set contained two virtual accounts — online banking and social network. The second set included six accounts — email, online gaming, online dating, shopping, online course and music streaming. The results showed that the participants preferred shapes (49.28 per cent) and letters (24.07 per cent) for their gesture passwords versus lines (15.76 per cent).\n\nParticipants also preferred single-finger gestures (93.62 per cent) over multi-finger ones. Participants who used gesture passwords spent 22 per cent less time logging in and 42 per cent less time creating passwords, on average.\n\nFree-form gestures could be expanded to laptops and tablet/laptop combos with touch screens — even doors with touch screens instead of key locks or swipe cards. They also could expanded to access to services over the internet, researchers said.\n\nThe findings will be presented at the Association for Computing Machinery’s Conference on Human Factors in Computing Systems in May. — PTI\n\nRutgers University researchers develop free-form gesture passwords that are hard to guess", 
    "section": "national", 
    "title": "Soon, doodle to unlock your smartphone", 
    "subsection": "general", 
    "date": "2016-03-12"
}