{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Gujarat police personnel are facing trial for their alleged role in the encounter\n\nThe Supreme Court on Friday summarily refused to entertain a writ petition filed by a lawyer seeking closure of all criminal proceedings against Gujarat police officers in the 2004 Ishrat Jahan ‘fake’ encounter case.\n\nThe petition had sought the discharge of the police officers, including then DIG D.G. Vanzara, on the basis of the testimony given by 26/11 Mumbai attack accused David Headley that Ishrat Jahan and her three companions were Lashkar-e-Taiba operatives on a mission to assassinate then Chief Minister Narendra Modi.\n\nA Bench of Justices P.C. Ghose and Amitava Roy stopped advocate Manohar Lal Sharma short within moments after he began his submissions, telling him that he had no authority to file this petition in the apex court. The Bench said it was up to the people involved in the issue to approach the court concerned for relief.\n\nThe Bench specifically clarified that it was not dismissing the petition on the merits of the case.\n\n“Any person having locus can approach the appropriate authority,” the Bench remarked.\n\nMr. Sharma’s petition sought the Supreme Court to initiate “suo motu perjury/contempt of court proceedings against the then Home Minister and the CBI Director for concealing true facts before the Supreme Court and the Gujarat High Court for filing a false affidavit on the facts about Ishrat Jahan.”\n\nIn his petition, Mr. Sharma contended that the “judicial facts and evidence” supplied by Headley via video conference in the 26/11 special court at Mumbai on February 11 proved that the four persons, including Ishrat, killed by the Gujarat police in an encounter on June 15, 2004 were members of the LeT.\n\nGujarat police personnel, including Mr. Vanzara, are facing trial in a Mumbai court for their alleged role in the encounter.", 
    "section": "national", 
    "title": "Supreme Court refuses to hear petition for closure of trial in Ishrat Jahan case", 
    "subsection": "general", 
    "date": "2016-03-12"
}