{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Sixteen years after they torched a bus and burnt to death three college girls while protesting the arrest of the then AIADMK general secretary Jayalalithaa, the Supreme Court on Friday commuted the death penalty of all three convicts to life imprisonment, saying the incident happened in a flash during mob frenzy and is not pre-meditated.\n\nRolling back its own judgment confirming the death penalty awarded to the three men, the Supreme Court accepted their defence of “diminished responsibility” and reasoned that the convicts had not even know their victims and their crime did not deserve the death penalty.\n\nA tri-judge Bench, led by Justice Ranjan Gogoi, agreed with defence counsel and senior advocate L. Nageshwar Rao that mobs go berserk and possess a demented sight of what is around them.\n\nThe State of Tamil Nadu, the prosecuting agency in the case, represented by advocate Yogesh Kanna, submitted that the Bench should decide the review petition on its merits.\n\nIn an earlier hearing on the petition, Mr. Rao had referred to the riots after the killing of former Prime Minister Indira Gandhi, to argue that the accused, who were part of a rampaging mob, cannot be held fully criminally liable for the crime as their mental capacity were impaired at the time.\n\nTo buttress the point, one of the defence counsel, senior advocate Sushil Kumar, had said “in the South, people worship their leaders, and on their death, even kill themselves”.\n\n“Mobs go berserk. Reason does not enter their minds. After the judgment at 10.30 am, the agitations had started. There was absolutely no pre-meditation. There was a workshop nearby, they took petrol from there and started sprinkling it on the buses,” Mr. Rao had recounted the events of the fateful day.", 
    "section": "national", 
    "title": "Supreme Court commutes death penalty of three convicts in Dharmapuri case", 
    "subsection": "general", 
    "date": "2016-03-12"
}