{
    "author": [
        "Jonathan Soble"
    ], 
    "text": "They make a colossal effort at once precarious and routine\n\nMinoru Ikeda, who published a memoir about working at the nuclear plant, show a document tracking his radiation exposure, in Tokyo.— Photo: NYT\n\nOf the thousands of workers who have answered the help-wanted ads at Fukushima Daiichi, the ruined and radioactive nuclear power plant in northeastern Japan, the part-time lettuce farmer and occasional comic-book artist Kazuto Tatsuta must be among the least likely.\n\n“I needed a job,” Tatsuta, 51, recalled of his decision in 2012 to accept work at the site of one of the world’s worst nuclear accidents.\n\nHis duties included welding broken water pipes and inspecting remote-controlled robots that survey radioactive hot spots.\n\nAnd his comic strips, once populated with baseball players and gangsters, now tell stories of middle-aged, blue-collar men like himself who do the grunt work at Fukushima, some of whom find a sense of purpose and belonging they lacked in the outside world.\n\n“It’s secure. You’re not going to get laid off there,” Mr. Tatsuta said. “But you’re also working for a goal.”\n\nFive years after a powerful earthquake and tsunami struck, causing three reactors at Fukushima to melt down, that goal is the focus of a colossal effort at once precarious and routine. A veneer of stability at the plant masks a gruelling, day-to-day battle to contain hazardous radiation, which involves a small army of workers, complex technical challenges and vexing safety trade-offs.\n\nFukushima has become a place where employees arrive on company shuttle buses and shop at their own on-site convenience store, but where they struggle to control radiation-contaminated water and must release it into the sea. Many of the most difficult and dangerous clean-up tasks still lie ahead, and crucial decisions remain unsettled.\n\n“There’s no precedent or manual,” said Tatsujiro Suzuki, a former vice-chairman of the Japanese Atomic Energy Commission, who is now a Professor at Nagasaki University.\n\nThe effort at Fukushima has reached a few milestones. About 1,500 spent fuel rods were successfully removed from a damaged storage tank in late 2014, a delicate and risky operation.\n\nMuch of the contaminated rubble left by the tsunami and hydrogen explosions has been cleared, and overall radiation levels are down. Workers will soon be able to enter some areas of the plant without full-body protective gear.\n\nLong years ahead\n\nBut a full clean-up of the site — including the extraction of melted uranium fuel from the damaged reactor cores — is expected to take at least 40 years, according to the government’s timetable, and a century by other estimates. In the meantime, officials acknowledge, Fukushima remains vulnerable.\n\n“The question is: Is there a Plan B to deal with another big quake or tsunami?” Mr. Suzuki said.\n\nThe duration of the clean-up also creates the risk of labour shortages, he said, especially in jobs requiring special skills. Japan’s population is shrinking and, with the future of nuclear power uncertain, many young people are unwilling to stake careers on the industry.\n\nFor now, Fukushima is bustling with about 7,000 workers, much more than before the disaster and twice as many as two years ago. The town of Iwaki to the south has become a kind of workers’ village. At dawn, vans and buses line up to ferry workers to the plant via staging areas where they don protective white Tyvek suits, radiation monitors and gas masks.\n\n“You think of it as totally normal work,” said Tatsuta, who asked to be identified only by his pen name to avoid being blacklisted by the plant’s owner, Tokyo Electric Power Co. — New York Times News Service", 
    "section": "national", 
    "title": "The workers who fight Fukushima’s radioactive tide", 
    "subsection": "general", 
    "date": "2016-03-12"
}