{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Such a step will be equivalent to judiciary entering Legislature’s domain\n\nThe Supreme Court on Friday refused a plea to order States to mandatorily collect data on Scheduled Castes and Scheduled Tribes (SC/ST) for fixing reservation in matters of promotions in government jobs, saying such a step would be equivalent to the Judiciary entering the domain of the Legislature.\n\nIn a 49-page judgment, a Bench led by Justice Dipak Misra held that State governments were not bound to make reservation for SCs/STs in matters of promotion, and thus, the Supreme Court could not compel them to undertake the exercise of collecting the qualitative data of SC/STs. The collection of qualitative data of the SC/STs was a necessary pre-condition to setting aside a quota for the SC/ST category as held in the M. Nagaraj judgment in 2006 by a Constitution Bench.\n\nThe judgment is based on a petition filed by one Suresh Chand Gautam, who sought the apex court to issue a direction in the nature of a mandamus to all States to either constitute a two-member panel or a commission headed by a retired judge of a High Court or the Supreme Court to enforce the collection of data on SC/STs by the States in compliance with the 2006 judgment. The petition said this was necessary to State-wise implementation of SC/ST reservation in promotions as a policy.\n\n“The State is not bound to make reservation for Scheduled Castes and Scheduled Tribes in matter of promotions. Therefore, there is no duty. In such a situation, to issue a mandamus to collect the data would tantamount to asking the authorities whether there is ample data to frame a rule or regulation. This will be in a way, entering into the domain of legislation for, it is a step towards commanding to frame legislation or a delegated legislation for reservation,” the judgment held.\n\nBench says such a step will be equivalent to the Judiciary entering Legislature’s domain", 
    "section": "national", 
    "title": "We can’t push States into quota in promotions: SC", 
    "subsection": "general", 
    "date": "2016-03-12"
}