{
    "author": [
        "R Rajaram"
    ], 
    "text": "Temple town Kumbakonam has been brought under several layers of security for the Mahamaham on Monday. The police have divided the town into 30 sectors for enhanced surveillance and for better crowd management.\n\nThe Mahamaham tank has been divided into different sectors with each of them being manned by a senior police officer. In addition to police personnel, teams from the Fire and Rescue Services have been deployed at the tank area to act in emergency situation.\n\nSuch is the level of security deployment that nearly 20,000 police personnel have been mobilised and posted at different points in the temple town. The police personnel have been drawn from the Armed Reserve, Tamil Nadu Special Police, and the Tamil Nadu Commando Force. Seven top police officers in the rank of Inspector-General of Police are camping in Kumbakonam with each of them vested with specific responsibilties and areas.\n\nThree Deputy Inspector-Generals of Police and 31 officers in the rank of Superintendent of Police form part of the comprehensive security arrangement in place.\n\nAs many as 36 temporary police stations have been established at various places with the police having set up several “May I Help You” booths at different spots to help and guide the devotees.\n\nBarricades have been put up at various points and movement of cars and other light vehicles inside the town have been stopped in view of the huge turn out of devotees.\n\nN. M. Mylvahanan, Superintendent of Police, Thanjavur, told presspersons here on Sunday that the police expected one million devotees on the Mahamaham festival day on Monday.\n\nPilgrims movement had exceeded 20 lakh since February 13 when the flag hoisting ceremony in connection with the grand event was held, he said.\n\nA coordinated effort was on with good cooperation from other departments to ensure hassle-free movement for devotees in the town, he said.\n\nIntelligence machinery has been placed on alert following receipt of an anonymous letter threatening that suicide bombers would be on the prowl on the festival day. The police were closely following up the threat letter case, the Superintendent of Police said. Some incidents of chain snatchings had been reported and the police had arrested few persons in this connection, he said.\n\nSecurity had been stepped up in Kumbakonam railway station with the Railway Protection Force and the Government Railway Police jointly taking care of the security measures.\n\nSeveral top police officials camping at Kumbakonam overseeing the security", 
    "section": "national", 
    "title": "20,000 policemen keep round-the-clock vigil", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}