{
    "author": [], 
    "text": "Airport toilet in\n\npoor condition\n\nOn 20th February, I went to the airport to see off my relative who was heading to Dubai. I obtained a visitors’ entry ticket after paying Rs. 70. There is no toilet in the visitors’ lounge. But there is one outside at a distance and I managed to go there. There are a few steep steps to climb. With great difficulty, I used it. When I returned from toilet, I was asked to pay Rs. 5. I asked the staff whether the charges are fixed by the AAI and why there is no board informing people about such charges. The staff was unable to give a satisfactory reply, but insisted that I pay Rs. 5. I said I cannot pay unless I see the AAI order and the staff then told me that I need not pay. The toilet is badly maintained and reeks. As a result of this visitors, especially senior citizens and differently abled, are inconvenienced. The AAI needs to install a board outside the toilet, mentioning these charges. And considering people are made to pay a fee to use this facility, the toilets need to be properly maintained built at a level accessible to all.\n\nV. Santhanam\n\nChromepet\n\nChange small-bus route\n\nIn addition to MTC Small Bus Route No. S13, which is already running from Guindy to Velachery MRTS Railway Station, 3 new buses — S18, S82 and S85 — have been added recently to Alandur-Adambakkam, Madipakkam-Velachery routes. S18, which runs from Velachery to Nanganallur and the S85, from Velachery to Alandur Metro Station, serve the people better. However, the route S82 runs through narrow roads, school zones and in some places, it is difficult for the bus to cross over and therefore its takes more time to reach its destination. Heavy traffic jams along this route, adds to passengers woes. As a solution, the bus can be diverted, via Vanuvampet, Ullagaram and Ponniamman Koil Street. If this route is not feasible, it can be diverted through Puzhuthivakkam, Balaji Nagar, Ram Nagar, Madipakkam Main Road to reach Madipakkam Bus Stand.\n\nJ. Manohar Singh\n\nAdambakkam\n\nNo need for Metro Regulatory Authority\n\nReport appearing in a section of the press about formation of Metro Rail Regulatory by the Central Government is not welcome.\n\nAlready the CMRL fares are very high resulting in poor utilisation. A poor labourer with a daily wage of Rs.400 has to shell out Rs. 80 for a to and fro trip from Koyambedu. Many cannot afford such fares. Taking into account the infrastructural cost, the fares need not be fixed in a welfare state. On the contrary, incentive needs to be provided to rail commuters to use the Metro in preference to road transport, which causes pollution. We have bitter experiences with the Tamil Nadu Electricity Regulatory Commission which insists that TANGEDCO raise the power tariff annually even when there is no demand . CMRL is a joint venture company in which both Central and State Governments have their equity. Since State Government has a stake, the Central Government need not interfere to form a Regularly Authority for Metro Rail.\n\nV. Rama Rao\n\nNanganallur\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu @ gmail.com)", 
    "section": "national", 
    "title": "21FEBCHMAK01_readers_mail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}