{
    "author": [
        "L Renganathan"
    ], 
    "text": "The auspicious hour for theerthavari is said to be between noon and 1 p.m.\n\nA section of the crowd at the Mahamaham tank on Sunday. Till now, 25 lakh people have congregated at Kumbakonam for the big event.Photo: S. R. Raghunathan\n\nAll is set for the smooth conduct of the Mahamaham festival when lakhs of devotees are expected to take a holy dip in the sanctified waters of the Mahamaham and Portramarai tanks as also the Cauvery bathing ghats.\n\nWith the pilgrim count already crossing the 30-lakh mark by Sunday and with thousands more making a beeline to the hallowed spots in Kumbakonam, the authorities expect another 10 lakh pilgrims to visit the town on Monday. The auspicious time, as per the almanac, for ritualistic bath is said to be between noon and 1 p.m.\n\nSpecial poojas and rituals are peaking in the 12 Shiva and five Vishnu shrines that would take part in the Mahamaham theerthavari on Monday. While the Shiva shrine processional deities would arrive on the banks of Mahamaham tank where priests would immerse the ‘astra devars’ in the tank, the Vishnu shrine deities would proceed to the Chakra Padithurai on the banks of the Cauvery where they would witness the Teerthavari. A record but orderly crowd took part in the rituals in Kumbakonam on Sunday when the devotees drew the sacred chariots of Sri Kalahastheeswarar, Sri Abimukeswarar, Sri Kasi Viswanathar, Sri Nageswarar and Sri Someswarar temples. . At the Vishnu shrines of Sri Sarangapani, Sri Chakrapani, and Sri Ramaswamy, the Vennaithaazhi utsavam will be held on Monday and their temple chariots have been decked up for the occasion.\n\nDuring the day, Hindu Religious and Charitable Endowments Minister R. Kamaraj, along with HR & CE Commissioner M. Veerashanmughamoni, Thanjavur Collector N. Subbaiyan, and Kumbakonam Sub Collector M. Govinda Rao conducted yet another inspection of the arrangements made for the smooth conduct of the Mahamaham event.\n\nMr. Kamaraj claimed that as per the estimates of the administration officials, more than 30 lakh pilgrims have taken part in the Mahamaham rituals so far and the arrangements for the devotees have been commendable.\n\nHundreds of special bus services and dozens of train services are being operated from various destinations to Kumbakonam. Thanjavur, Kumbakonam, and Mayiladuthurai stations are crowded with devotees trying to reach the Mahamaham spots. The buses would drop the pilgrims at the seven temporary bus stations established on the peripherals of the town from where they could reach the tank and other spots for which mini bus shuttle services were operated.", 
    "section": "national", 
    "title": "All set for Mahamaham festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}