{
    "author": [
        "R Sivaraman"
    ], 
    "text": "The deceased, M. Mohamed Suhai, is a student of class XI\n\nA 11{+t}{+h}standard of student suddenly collapsed while he was running on track during an athletic competition held here on Sunday. The young boy was later pronounced dead at hospital.\n\nThe sudden death of boy triggered protests by parents, students, and civic outfits demanding police to register a criminal case against the organisers for their negligence and to arrest them immediately.\n\nThe deceased identified as M. Mohamed Suhail (17) is the first son of Mohamed Farooq, who is a staff in the office of Chief Secretary. The boy is a student of Petit Higher Secondary School. He has participated in several sports meets. Following request from Puducherry Amateur Athletic Association, the school had deputed Suhail and a few other students for the state level athletic meet that was held in the Indira Gandhi Sports Complex on Sunday. The 1500 m running competition was held around 9 a.m.\n\nP. Munusamy, a parent whose ward participated in the event said, “Just when the boy completed 80 m, he suddenly struggled and fell down. He was immediately rushed to the Government General Hospital where the doctors declared him dead.”\n\nHussein, a friend of the family said, “The sports event was held without having adequate medical facilities or even an ambulance. ”\n\nThe post mortem was done at the Indira Gandhi Government Medical College, Kadirkamam and the body was handed over to the parents.\n\nMeanwhile the students protested before the Indira Gandhi Sports Complex. They alleged that the death occurred due to negligence of the organisers. They wanted a a criminal case to be registered against the organisers. The protesters dispersed only after being given an assurance by the police officials.", 
    "section": "national", 
    "title": "Athlete collapses on track, dies in hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}