{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Of the nearly 1.3 lakh passports issued by the passport office in Coimbatore, more than 15 per cent of them are students. They need it as prospective employers may ask them if they have one. Or they need it if they are planning higher studies abroad. The regional passport office in Coimbatore has come forward to make it easier for students to apply for a passport. Regional Passport Officer S. Sasikumar said that if education institutions takes the initiative, the passport office is ready to conduct special camps at the Passport Seva Kendra, here, on Saturdays even though it is a closed holiday for the office.\n\nEven students from other districts and States can get their passport with their present address (hostel or private accommodation). Students need to furnish a certificate from the college, proof for date of birth, and copy of the Standard X mark sheet, while applying for passports.\n\nMr. Sasikumar said that a request could be made to the respective city and district police officers to expedite police verification for students who applied through their institutions as their addresses could be verified with ease. “Usually it takes about 15 to 21 days for issuing the passport but quicker police verification will help us hand over passports to students within a week,” he added.\n\nLast year, the Union Government fixed a target to issue one crore passports across the country and it met the goal. This year, the target was increased to 1.25 crore passports.\n\nAround 800 student applications can be processed in a day and the camp can be conducted at one or more institutions a day depending on the student strength. For conducting special camps at the institutions, contact the passport office at 0422-2301415 during working hours or mail torpo.cbe@mea.go.in", 
    "section": "national", 
    "title": "Camps planned at education institutions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}