{
    "author": [
        "Compiled G"
    ], 
    "text": "V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, giving away degree certificate to candidate at the Graduation Day of Srimad Andavan Arts and Science College, Tiruchi.\n\nE. Ramganesh, Head, Department of Educational Technology, Bharathidasan University, handing over a degree certificate to a candidate at the Graduation Day of Bishop Heber College in Tiruchi.\n\nGraduation Day\n\nKnowledge and understanding of human values is most important. Any development in science and technology will be futile and harmful if it were not based on human values, G.V. Uma, Controller of Examinations, Anna University, said in her Graduation Day address at M.A.M. College of Engineering. Around 625 candidates, including five university rank holders, received their degrees. M.A. Mohamed Nizam, secretary and correspondent, was present.\n\nRank holders get\n\ncash incentive\n\nOver 400 graduates and postgraduates received their degrees at the Graduation Day of Srimad Andavan Arts and Science College. V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, was the chief guest. J. Radhika, principal, presented the annual report. R. Rajagopal, chairman, national executive committee, Srimad Andavan Ashramam, Ammangi. V. Balaji, secretary of the college, and S. Ramamurthy, Dean, were present. A total of Rs. 71,000 given by the management was distributed among the 24 university rank holders of various disciplines.\n\n915 get PG degrees\n\nNearly 915 post graduates, including 144 M. Phil scholars, and 15 under graduate university rank holders received their degrees at the Graduation Day of Bishop Heber College. About 1066 undergraduates were conferred degrees in absentia.\n\nE. Ramganesh, Head, Department of Educational Technology, Bharathidasan University, delivered the Graduation Day address. Rt. Rev. G. Paul Vasanthakumar, Chairman, and D. Paul Dhayabaran, Principal, were present.\n\nFocus on\n\n‘Dharmic way’\n\nIndia is a country where the power of youth is visibly potent. In order to bring peace and harmony among human beings, one should be spiritually aware, particularly the dharmic way of life, said Sheela Balaji, chairperson and managing trustee, Swami Dayananda Educational Trust, delivering a lecture on “Dharma” to the first and second year students of Swami Dayananda College of Arts and Science, Manjakudi, Tiruvarur. Spirituality and upholding of Dharma alone could bring forth change and progress in a country, she said.\n\nJamal team wins\n\nThink Quest 2016\n\nJamal Mohamed College won the overall trophy in Think Quest 2016, organised by the PG and Research Department of Computer Science of Nehru Memorial College. Competitions such as dumb charades, short film making, and treasure hunt were conducted. More than 100 students from various colleges took part. Sivakumar Natarajan, Project Manager, Cognizant Technology Solutions, Chennai, distributed the prizes. Pon. Balasubramaniyan, president, college committee, released the magazine ‘View Port.’\n\nACME’16 winners\n\nFarookh College, Calicut, and Bishop Heber College, Tiruchi, emerged overall winners of ACME’16, a national-level inter-collegiate literary fiesta, organised by the Department of English, Holy Cross College. Various competitions such as ‘thinkers’ ‘den,’ ‘poets’ cafe,’ ‘colour chrome,’ ‘literary runway,’ ‘BookRew,’ ‘literary showcase,’ ‘literary pageant,’ ‘spot and act,’ and quiz were conducted.\n\nSpeaking at the valediction, Prabhu Solomon, film director, emphasised the importance of spiritual strength to meet the challenges of life. He gave away the prizes.\n\nWorkshop on\n\n‘wireless’\n\nA workshop on “Emerging Wireless Technologies and Microwave Devices through CAD,” was conducted by the Department of Electronics and Communication Engineering of K. Ramakrishnan College of Engineering. D. Sriram Kumar, Head, Department of Electronics and Communication Engineering, National Institute of Technology, Tiruchi, and S. Raghavan, Senior Professor, NIT, Tiruchi, were the guest speakers. Students and faculties from various colleges took part.\n\nCauvery College\n\nemerges on top\n\nDepartment of Commerce bagged the overall championship at the annual sports meet of Cauvery College for Women. K. Megala, III B.A. Tamil, won the individual championship. K. Jayabharathi, Deputy Inspector General, Prisons, Tiruchi Range, gave away the prizes in the presence of R. Murugan, president, college governing council, V. Ramanathan, secretary, and V. Sujatha, Principal. B. Baby Shakila, Directress of Physical Education, presented the annual sports report.\n\nWorkshop on\n\ntalent search\n\nThe Department of Management Studies, M.I.E.T. Engineering College, organised a workshop on “Global Talent Search.” A. Mohammed Yunus, chairman, M.I.E.T. Educational Institutions, presided. Dharini Srinivasan, Associate CIPD, UK, in her keynote address stressed that education imparted should provide employability skills on a par with the international level. She spoke about the importance of integrity, quality orientation, communication, orientation to learning and knowledge sharing, which were essential for the global employment. S. Guharaja, Principal, was present.\n\nCOMPILED BY G. PRASAD", 
    "section": "national", 
    "title": "CAMPUS CONNECT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}