{
    "author": [], 
    "text": "RELIGION\n\nVishnu Sahasranamam: Sudha Seshayyan, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nAsthika Samajam: Sri Narayanan, Venus Colony, First Street, Alwarpet, 6.30 p.m.\n\nVakya Vritti: Rukmini Ramamurthy, Sir Sivaswamy Kalalaya Higher Secondary School, West Circular Road, Mandaveli, 4.30 p.m.\n\nTheiva Manimaalai: A.M. Manick, Sri Balasubramania Bakthi Jana Sabha, T.T.K Salai, Royapettah, 6.30 p.m.\n\nAitareya Upanishad: Satyavratananda Saraswati, Shiridi Sai temple, Shenoy Nagar, 5.30 p.m.\n\nGENERAL\n\nIndia Post: Inauguration of ATM at Park Town Head Post office. Charles Lobo, chief Postmaster General, Tamil Nadu Circle participates, 10 a.m.\n\nUniversity of Madras: International conference on recent trends in computing technology, Centenary building, University of Madras, 10 a.m; National seminar on Christianity and public sphere in India: Critical explorations, F-50 Hall, Centenary building, Chepauk campus, 9.30 a.m.\n\nVel Tech: 2nd International conference on innovative design, analysis & development practices in aerospace and automotive engineering, Avadi-Vel Tech Road, Avadi, 9.30 a.m.\n\nThe Bharat Scouts & Guides (Ponneri): Thinking day rally, SMGV Sala Middle School, Ambattur, 9.30 a.m.\n\nValliammai Engineering College: Guest lecture on advancements in electrical machines, SRM Nagar, Kattankulathur, 2 p.m.\n\nM.O.P. Vaishnav College for Women: VASPO Inter-collegiate sports tournament, M.O.P. Vaishnav College for Women, 11.30 a.m.\n\nMadras Christian College: 37th graduation day, Tambaram East, 3 p.m.\n\nKanchi Shri Krishna College of Arts and Science: 18th graduation day, Kilambi, Kancheepuram, 11 a.m.\n\nSri Chandrasekharendra Saraswathi Viswa Mahavidyalaya: Inauguration of robotics laboratory and workshop on robotics, Enathur, Kancheepuram, 10 a.m.\n\nNehru Yuva Kendra Sangathan: Tribal Youth Exchange Programme, Vettri Krishnan Mahal, West Mambalam, 11 a.m.\n\nApollo Hospitals: Panel discussion on women’s health, ITC Grand Chola, Guindy, 11.30 a.m.\n\nSri Krishna Sweets: Motivational talk on hard work to success, SRM Nightingale Matriculation Higher Secondary School, West Mambalam, 3 a.m.\n\nSri Vishnu Mohan Foundation: Music and dance festival, Narada Gana Sabha, Alwarpet, 5. 30 p.m.\n\nNarcotics Anonymous: Meetings, Grace of the Millennium group, CSI Zion Church, Chindadripet; Reality Group, CSI Good Shepherd Church, Taramani 100 feet Road, Velachery, 7 p.m.\n\nAl-Anon: Meetings, SOS Al Anon Group, Meston College of Education, Royapettah; Madipakkam Al-Anon Family Group, Near Vyaparigal Sangam, Moovarasampettai; Al-Anon Group, CSI Church, Padikuppam Road, Anna Nagar; Blossom Buds Group, The Lady of the Light Church, Luz, Mylapore, Anmeega Asthivara Group, Tolgate, Tiruvottiyur; Ebenezer MM School, Shanthipuram, Thirumullavoyal, 7 p.m.\n\nAlcohlolics Anonymous: Meetings, Meston College, Royapettah; Chennai Corporation Public Health Centre, Sastri Nagar, Adambakkam; Risenn Redeemers Church, United India Colony, Kodambakkam; ECI Church, Padikuppam Road, Anna Nagar; Annai Velankanni Church, 156, Luz Church Road; St. Johns Catholic Church, 110, Seniyamman Koil Street, Tondiarpet; Ebineaer School, Thirumullavoyal; St. Josephs School, 18th West Cross Street, M.K.B. Nagar; C.S.I Church, Dasarapuram, Thirunindravur; English Language Meeting, P.S. Higher Secondary School, R.K. Mutt road, Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}