{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(From left) Polio drops being administered to a child at Pattapaththu near Tirunelveli on Sunday; Resident Medical Officer J. Silas Jebamani giving polio drops to a newborn at Thoothukudi Medical College Hospital; Collector Sajjansingh R. Chavan immunising a child at Kanyakumari Government Medical College Hospital.—Photos: A.Shaikmohideen and N. Rajesh\n\nOver 2.71 lakh children below the age of five were covered in the second phase of Pulse Polio programme organised in 1,641 centres across the district on Sunday.\n\nThrough 1,496 centres in rural areas and 145 centres in urban areas, 6,461 persons administered polio drops to 2,71,730 children.\n\nCorporation Commissioner S. Sivasubramanian inaugurated a camp at Pattapaththu.\n\nMobile units were used to cover children of gypsies and the centres established in bus stands, Nanguneri toll plaza and railway stations were used to cover the children on the move along with their parents.\n\nThoothukudi\n\nIn Thoothukudi district, 1,51,672 children were administered polio drops through 1,172 centres. Minister for Tourism S.P. Shanmuganathan inaugurated the exercise in the primary health centre at Pandaravilai in the presence of Collector M. Ravikumar.\n\nNagercoil\n\nA total of 1.47 lakh children were administered polio drops across Kanyakumari district. Collector Sajjansingh R. Chavan inaugurated the campaign at Kanyakumari Government Medical College Hospital in the presence of MLAs A. Nanjil Murugesan and K.T. Pachaimal.\n\nPolio drops were administered through the 1,256 camps established across the district.\n\nA total of 5,024 officials and employees drawn from public health, noon meal, municipalities were engaged for this purpose.\n\nA total of 233 mobile vans transported polio drops to the camps.\n\nSeventeen camps were also set up at places where people congregate in large numbers such as bus stands, railway stations and boat jetty in Kanyakumari.\n\nEight mobile polio units were also on the move to administer the drops in hilly areas and places such as Thottamalai, and Thachamalai\n\nAround 160 officials were appointed to oversee proper implementation.\n\nThe employees of primary health centres and other staff were given training in administering polio drops.", 
    "section": "national", 
    "title": "Children administered polio drops", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}