{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Collector S. Natarajan administering polio drops to a child in Ramanathapuram on Sunday. (Right) Minister for Information and Special Schemes Implementation K.T. Rajendra Balaji administering polio drops to a child at Tiruthangal in Virudhunagar district.— Photo: L. Balachandar\n\nOver two lakh children in Dindigul district and more than one lakh children in Theni district, up to the age of five years, were administered polio drops in the second phase of Pulse Polio programme on Sunday.\n\nIn Theni, polio drops were dispatched to respective centres to start immunisation programme at 7 a.m.\n\nMore than 3,500 persons, including government employees, noon-meal staff, officials from Health, Education and Social Welfare departments, non-governmental organisations and members of Rotary Clubs engaged in the work.\n\nThe programme commenced simultaneously at all government hospitals, primary health centres, sub-centres, private hospitals and government schools.\n\nSufficient staff members were deputed to monitor special centres at railway stations, bus stands, markets, places of worship and other public places.\n\nSpecial centres were functioning at old and new bus stands to cover children travelling on buses.\n\nMayor V. Marudha Raj administered polio drops to children at Kamala Nehru Hospital in Dindigul.\n\nAdministration of polio drops commenced at 1,313 centres in rural and urban areas simultaneously. To reach remote villages, 33 mobile teams were constituted and 48 special camps conducted.\n\nAround 5,343 field staff, including anganwadi workers, village health nurses, noon-meal workers, doctors and paramedical staff in government headquarters and taluk hospitals and primary health centres were deployed.\n\nJoint Director of Health Services M. Ravi Kala had made elaborate arrangement.\n\nVirudhunagar\n\nElaborate arrangement were made for the second leg of pulse polio immunisation in which 1.64 lakh children were targeted for the oral vaccination on Sunday.\n\nMinister for Information and Special Schemes Implementation, K.T. Rajendra Balaji, inaugurated the immunisation programme at Tiruthangal. Collector, V. Rajaraman inspected few of the 1,068 centres were polio drops were administered to the children.\n\nSpecial arrangement were made to cover children travelling by bus and trains.", 
    "section": "national", 
    "title": "Children given pulse polio drops", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}