{
    "author": [], 
    "text": "From marathons to turtle walks, Chennai embraces thecause with their nesting season coming to an end in March\n\nSunday dawned early for many runners in the city as they congregated on Marina Beach to participate in ‘Ridley Run,’ a marathon organised to raise awareness of the olive ridley turtles. The turtles have been frequenting the city beaches from January to March, which is their nesting season.\n\nThe theme of the run was ‘conserve the endangered’ as deaths of these turtles has been alarmingly rising every year during the nesting season due to the wide-mesh trawling nets.\n\nAs the nesting season is currently on, the Students Sea Turtle Conservation Network (SSTCN) and TREE Foundation have been organising turtle walks along the coast from Neelankarai.\n\nMany nests have been found and taken to hatcheries, set up for the eggs to safely hatch, during the walks which involve the participation of conservationists and the public.\n\nOn Saturday night, a group of school students participated in a walk organised by the SSTCN from Neelankarai along with the volunteers.\n\nIn memory of the 824 adult olive ridley turtles that died on February 22, 2014, near Penna Estuary in Nellore, TREE Foundation also organised a memorial service in Neelankarai.\n\nK-pop wins many a heart\n\nK-Pop, or Korean pop, seems to have created quite a sensation among youngsters and even the middle-aged in the city. “I love the band Infinite,” says Kashish Ram, a B.Com. student at Stella Maris college, who has kept their song ‘Paradise…’ on loop.\n\n“My friend introduced me to Korean music and movies, and I found them really interesting. And believe me, I am not the only one,” she says.\n\n“I began following K-Pop ever since Psy’s Gangnam style went viral all over the world. My gang of friends and I have subscribed to a couple of Korean bands and singers. This way, we keep track of the latest releases,” says Aushutosh Mukherjee, a software professional. Many people have also adopted their style and way of dressing.\n\n“I like the hairstyle of singer Lee Sung-jong. My parents were upset when they saw me sport the hairstyle, but it was alright,” giggles Siddharth Raj, a first-year engineering student.\n\nNot only movies, but Korean sitcoms too have become current favourites.\n\n“It would be great if they screen Korean movies in theatres here,” says Siddharth. “The whole idea of not understanding the language makes it all the more interesting, even though there are subtitles available, they are fun to watch,” said Vignesh Rajagopalan, an independent filmmaker.\n\n(Reporting by S. Poorvaja\n\nand Aditi. R.)", 
    "section": "national", 
    "title": "City’s youth join hands to save olive ridley turtles", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}