{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Writer S. Ramakrishnan addressing the meeting of the Readers Circle of the Paalam the Book Meet Book Stall in Salem city on Sunday.— Photo: E. Lakshmi Narayanan\n\nNoted writer S. Ramakrishnan reviewed the novel titled “Crime and Punishment” authored by the renowned Russian writer Fyodor M. Dostoyevsky at the weekly book review session brought up by the Readers’ Circle of the Paalam the Book Meet Book stall in the city on Sunday.\n\nThe review of “Crime and Punishment’ was in connection with the 150 th year of publication of this novel.\n\nMr. Ramakrishnan said that the novel “Crime and Punishment” put Dostoevsky at the forefront of Russian writers when it appeared in 1866 and is now one of the most famous and influential novels in world literature.\n\nHe said late Dostoevsky was a multi-faceted personality – a novelist, journalist and short story writer.\n\nLate Dostoevsky commanded respect among the entire writers fraternity across the globe. Many renowned writers and senior literary personalities celebrated his presence. He had lot of following in countries like France and many young French writers had Dostoevsky as their role model.\n\nDostoyevsky was graduated as military engineer from Army Engineering College in St. Petersburg city, but resigned to devote himself to writing.\n\nHe took part in politics and participated in agitations against the government. Though he did not take serious participation in the agitations, still the government preferred to arrest him and put him behind the bars. Through the story of the brilliant, but conflicted young Raskolnikov and the murder he commits, Fyodor Dostoevsky explores the theme of redemption through suffering.\n\n“Crime and Punishment” was first published in a Russian literary journal in monthly instalments in 1866. It was later brought out as a novel. It is the second Dostoevsky’s full-length novels following his return from ten years exile in Siberia.\n\nP. Sahasranamam, proprietor, Paalam the Book Meet, presided. Rajarathinam, a former senior revenue officer, offered felicitations.", 
    "section": "national", 
    "title": "Crime and Punishment is 150", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}