{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "MDMK general secretary Vaiko and CPI (M) Secretary G. Ramakrishnan engrossed in a discussion during a campaign meeting of People's Welfare Front at Sivagiri on Sunday.- PHOTO: M. GOVARTHAN\n\nWhile expressing his desire to rope in DMDK and TMC into People's Welfare Front (PWF), its Convenor and MDMK General Secretary Vaiko on Sunday parried a question on whether the front will project DMDK leader Vijayakant as the Chief Minister candidate, in the backdrop of his statement that he intends to be the king and not king-maker.\n\n“We will decide on the issue once Mr. Vijayakant joins us. The PWF has been treading carefully step by step,” he said.\n\n“The DMDK's aversion towards corruption-tainted DMK and AIADMK has been well established. As a movement against corruption, we welcome DMDK and as also TMC led by G.K. Vasan, who has a corruption-free image, into PWF fold,” Mr. Vaiko said, after addressing a campaign meeting at Sivagiri.\n\nDuring the meeting, he slammed the DMK and Congress, equating them with poisonous serpents to drive home the point that their coming together will bring no benefit to the people. The DMK and AIADMK, he added, had also deceived people. The Dravidian parties could not escape culpability for allowing illegal sand and mineral mining, facilitating the GAIL pipeline scheme and selling liquor, Mr Vaiko said. He promised to constitute Lok Ayukta and confiscate the ill-gotten wealth of the corrupt politicians if the PWF was voted to power.\n\nVCK leader Thol Thirumavalavan said the PWF was formed out of a desire of the constituent parties to root out corruption and continue serving people in the long-run.. He also assailed the privatisation moves of the Government, cautioning that the social fabric will be destroyed without reservation in jobs for weaker sections of the society.\n\nCPI (M) leader G. Ramakrishnan said neither the DMK nor the AIADMK had so far taken the Common Minimum Programme drafted at the time of striking alliances seriously.\n\nThe PWF, he assured, would be in the service of people even beyond the elections. CPI leader K. Subbarayan urged the voters to trust in the PWF's ability to bring about a change.\n\nLater in the day, the PWF leaders addressed a similar campaign meeting at Gobichettipalayam.\n\nVaiko welcomes Vijaykant and\n\nG.K. Vasan into PWF fold during his meeting at Sivagiri.", 
    "section": "national", 
    "title": "‘Decision on Vijayakant as CM after he joins us’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}