{
    "author": [
        "R Rajaram"
    ], 
    "text": "With Kumbakonam having been brought under enhanced surveillance in connection with Mahamaham festival, Director General of Police Ashok Kumar inspected the detailed security arrangements put in place in the temple town on Sunday.\n\nDGP Ashok Kumar, who arrived at Kumbakonam in the morning, went around various places in the temple town for nearly two hours to get a first hand account of the comprehensive security measures in place.\n\nAround 20,000 police personnel, including those from the Armed Police and the Tamil Nadu Special Police, have been deployed at various points in Kumbakonam. Accompanied by the Additional Director General of Police (Law and Order) J.K. Tripathy and top police officers, the DGP inspected the “Potramarai Kulam”, Mahamaham tank, railway station and traffic points inside the temple town. Thereafter, the DGP inspected the temporary master control room established adjoining the Mahamaham tank where he was given a briefing about its functioning by the Inspector General of Police, Technical Services, M.C. Sarangan.\n\nThe DGP spent about 30 minutes at the control room.\n\nThe “live” movements taking place across the town were being viewed in the monitors at the master control room by teams of police personnel round-the-clock in shifts. The DGP held a meeting with the Thanjavur Collector N. Subbaiyan and other officers.\n\nPolice sources said around 400 cameras were deployed at vantage points in the town and some of them were connected through Wi-Fi network with the master control room. This was to have effective surveillance across the town that is teeming with devotees in large numbers every day, the sources said. A comprehensive security plan had been drafted and put in place in Kumbakonam for the grand event that has attracted over 20 lakh pilgrims till Sunday.", 
    "section": "national", 
    "title": "DGP inspects mahamaham arrangements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}