{
    "author": [
        "Staff Reporter"
    ], 
    "text": "TN is the first State to have three judicial law academies\n\nLaws that became obsolete should be repealed and enforcing new laws is as important as introducing them, said Chief Justice of India (CJI) T.S. Thakur here on Sunday. Quoting Prime Minister Narendra Modi’s statement that he would repeal one outdated law a day, the CJI said that if he (Prime Minister) did so he would have repealed 1,700 laws at the end of his tenure.\n\nJustice Thakur addressed top judicial officers from across the country here at the inaugural of the Regional Centres of the Tamil Nadu Judicial Academy at Coimbatore and Madurai (through video conferencing from here) - and a national conference on ‘The March of Law – The Way Forward.’\n\nHe said Tamil Nadu was the first to have three judicial law academies in the country.\n\nOn the need for training, he said the burden on judges had gone up with the increasing complexity of cases. “Judges are confronted with sensitive and difficult cases. Times are going to be more and more difficult. While new laws are introduced, newer areas keep emerging at the other end,” he said.\n\nThis has resulted in the need for judges not only at the entry level, but even in High Courts and the Supreme Court to undergo training. “You are grossly mistaken if you think you know everything,” he said and made an appeal to judges at the High Court too to make use of the academy.\n\nHe said judges from the Supreme Court would soon take part at a retreat at the judicial academy in Bhopal where experts from various fields would address them.\n\nEfforts were on to form a National Judicial Training Council to frame a common syllabus and have a human resource bank for judicial academies across the country.\n\n“It is to bring about uniformity with updated syllabi. Twenty-five per cent of the syllabus will be earmarked for local and regional laws,” the CJI added.\n\nThe CJI felt the national judicial academy, national law schools and regional judicial academies could provide opportunities for interested persons to take up research and do projects for the benefit of the system.\n\n‘Burden on judges has gone up with increasing complexity of cases’", 
    "section": "national", 
    "title": "Enforcing new laws as vital as introducing them, says CJI", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}