{
    "author": [], 
    "text": "SALEM\n\nDistrict Administration: Public grievances redress meeting, V. Sampath, Collector, presides, collectorate hall, 10 a.m.\n\nPeriyar University: Department of Energy Studies, workshop on solar photovoltaic based power generation technologies, V. Krishnakumar, Head, Department of Physics of the University, inaugurates, Ramchander Nirudi, Senior Assistant Professor, Department of Electricals and Electronics Engineering, Padmasri Dr. B. V. Raju Institute of Technology, Vishnupur, Narsapur, Telengana, delivers key-note address, C. Swaminathan, Vice-Chancellor, presides, 10.30 a.m.\n\nDhirajlal Gandhi College of Technology: Department of Electrical and Electronics Engineering, ISTE sponsored national level workshop on ‘PCB design and manufacturing techniques’, K. Kumaravel, MD and proprietor, Hi Teck Technologies, Salem resource person, 10 a.m.\n\nKnowledge Institute of Technology (KIOT): Department of Civil Engineering, inauguration of Centre for Sustainable Research, P. Gopalakrishnan, Director and Head, Asia Pacific and Middle East USGBC and R. Gowrisankar, Manager-Ecuation, USGBC, Chennai, chief guests, P. S. S. Srinivasan, principal, presides, 2 p.m.\n\nVivekanandha Arts and Science College for Women, Sankagiri: Cultural Day, C. Paul Princely Rajkumar, RDO, chief guest, M. Karunanithi, chairman, presides, 10 a.m.\n\nTamil Nadu Iyal Isai Nataka Manram and Department of Art and Culture: Ramayanam Festival titled 'Varna Kalanjiyam', Revathi Muthusamy troupe from Srirangam presents ‘Ramayanam’ dance drama, Vijaragavachariar hall, Cherry road, 6.30 p.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nNAMAKKAL\n\nIncome Tax Department – Namakkal Range: Get together and interaction session, M. Tirumala Kumar, Principal Commissioner of Income Tax, chief guest, N. Sukumar, Joint Commissioner of IT, Namakal Range and others speak, Nala Hotel, 4.30 p.m.\n\nDistrict Administration: Public grievances redress meeting,\n\nV. Dakshinamoorthy, Collector, presides, collectorate hall, 10 a.m.\n\nMahendra Engineering College: Department of Electronics and Instrumentation Engineering, workshop on ‘Lab view: graphical system design in engineering applications’, Rajasekaran, Trainer, Lab View Academy, Bengaluru, resource person, M. G. Bharathkumar, Chairman, presides, 10 a.m.\n\nRASIPURAM\n\nMuthayammal Polytechnic College: Annual Day, R. Sundaram, Founder and Chief Executive, Aerospace Engineers, The Salem Aeropark, Mallur, chief guest, 2 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}