{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At last, residents of Sivagiri were convinced on Sunday that they would not be deprived of the only arts and science college functioning temporarily on the premises of the Government Boy’s Higher Secondary School after the foundation for new buildings were laid.\n\nUG wing\n\nEnvironment Minister Thoppu N.D. Venkatachalam laid the foundation for the building to house the undergraduate wing of Bharathiar University Constituent College, in the presence of District Collector S. Prabakar, Erode MP S. Selvakumara Chinnaiyan, Modakurichi MLA R.N. Kittusamy, and a host of invitees.\n\nThe residents ensured continuance of the college in the town through sustained protests rising above party considerations last year, after the institution was sought to be shifted to Ezhumathur, about 12 km away, on the premise that the permanent campus requires a large land area.\n\nBut, since Chief Minister Jayalalithaa had already laid foundation for permanent campus on a 25-acre area in Ezhumathur, there was a technical difficulty in withdrawing the decision.\n\nSubsequently, an idea was floated by the district administration for having two separate colleges at Sivagiri and Ezhumathur.\n\nEventually, the Higher Education department and Bharathiyar University decided to create a permanent campus for the UG wing in Sivagiri and establish infrastructure exclusively for the PG wing at Ezhumathur.\n\nThe land provided by the Sivagiri Town Panchayat free of cost through a formal resolution was well above the minimum five-acre requirement specified by the Higher Education department for starting colleges in rural places. In all likelihood, the permanent buildings for UG as well as PG wings would be constructed in a year’s time, sources said.\n\nExpansion of infrastructure for the college that is patronised well by students in the rural surroundings, particularly girls, many among them first-time graduates who would have otherwise discontinued studies after schooling, augurs well with the Vision 2023 document of the State Government for enhancing Gross Enrolment Ratio in higher education, according to the teaching community.", 
    "section": "national", 
    "title": "Foundation laid in Sivagiri for permanent college campus", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}