{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The city police are investigating the alleged role of a Head Constable in connection with an extortion case reported under S.S. Colony police station limits on Saturday.\n\nThe police have already arrested three persons, identified as Prem, Gubendran and Mahamuni, for having threatened a restaurateur in Arasardi.\n\nAccording to the complainant, S. Srinivasan (37), a few persons threatened him that they would take steps to cancel his trade licence claiming that they had received complaints on “poor state of hygiene” maintained in the hotel.\n\nThe accused tried to negotiate with the restaurateur and bargained for Rs. 1 lakh to not pursue the complaint.\n\nHowever, Srinivasan approached S.S. Colony police in this regard.\n\nWhen the accused again called him over the issue, he invited them for collecting the money, and the waiting police caught them one by one. The police had registered a case under various Sections of the Indian Penal Code against Prem and an unnamed accused for forgery, extortion and criminal intimidation.\n\nThe accused said the Head Constable prepared the “complaint copy against the hotelier.”\n\nEnquiry on\n\nThe city police picked up the head constable for enquiry in this connection, Commissioner of Police Shailesh Kumar Yadav said. “We learnt that the accused were also involved in threatening a Regional Transport Officer. However, only after thorough interrogation and based on some concrete evidence can we take action against the Head Constable,” he added.\n\nIt was not clear whether the Head Constable abetted the crime, he added, saying that the police would not act in haste in the case.\n\nMeanwhile, police sources said that some audio clippings in which the head constable was said to have threatened some other officials were also doing the rounds through social media.\n\nThe accused said the Head Constable prepared the “complaint copy against hotelier”", 
    "section": "national", 
    "title": "Head Constable being grilled in extortion case", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}