{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It will function round the clock and market all Aavin products\n\nA modern hi-tech milk parlour set up at an outlay of Rs. 60 lakh was inaugurated at the Salem District Milk Producers Cooperative Union (Aavin) head office on Steel Plant Road on Sunday.\n\nEdapadi K. Palanisamy, Minister for State Highways and Minor Ports, inaugurated it in the presence of District Collector V. Sampath. The new parlour will function round the clock and will market all Aavin products such as butter, ghee, badam powder, all ice cream varieties, milk, mango juice, milk shake, sweets such as halwa, Mysorepa and soanpapdi.\n\nOn the occasion, Mr. Palanisamy said that Salem Aavin was only the second unit to get a hi-tech parlour among the district milk producers union in the State. The Chief Minister recently inaugurated the first hi-tech parlour at Virugambakkam in Chennai.\n\nHe said that the new parlour had been set up in a place surrounded by the Government Mohan Kumaramangalam Medical College, and many Central and State Government undertakings, so that it can serve the students and the employees well. A daily sales target of Rs. 15 lakh had been fixed for this parlour, he said and called upon all sections of society to extend their support for achieving the target.\n\nThe Minister said that the farmers, who were solely dependent on marketing milk to the societies, would stand to gain a lot, if people patronised the Aavin products.\n\nThe Salem District Milk Producers Union is implementing a scheme of giving star status to the outstanding milk cooperative societies which continuously supplied maximum milk to the union and sanction cash incentives to them to motivate its members. As such, ten societies have been given the star status.\n\nThe Kumarasamipatti Cooperative Milk Society was given the four star status and an incentive of Rs. 25,000. The second place went to Veppillaipatti Milk Producers Society which was given three star status and an incentive of Rs. 15,000 and the third place to Kamarajnagar society which bagged two star status and an incentive of Rs. 5,000.\n\nSeven more societies were given single star status and an incentive of Rs. 5,000 each.\n\nThe Minister handed over the star certificates and the incentive to all the ten societies on the occasion.\n\nS. Soundappan, Mayor, V. Panneerselvam, MP, R. Chinnusamay, Chairman, Salem Aavin, and K. Santhi, General Manager, Aavin, were present.", 
    "section": "national", 
    "title": "Hi-tech Aavin milk parlour comes up in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}