{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Schoolchildren who won cash prize at the programme ‘Ezhuchi 2016’ on stress management organised for the benefit of government and aided school children who will be writing SSLC and Plus Two examinations in Tiruchi.\n\nThe Cauvery Padithurai where 'Theerthavari' will be celebrated for the processional dieties of Vishnu temples.PHOTO: M. SRINATH\n\nBeing a festival associated with ‘theerthavari’, ‘mahamagam’ offers an opportunity to a large number of devotees to have a holy dip in the waters. ving a holy dip involves a specific procedure to be perfect and complete. One has to first take the dip in the Mahamagam tank, followed by worship to Lord Kasi Viswanathar.\n\nLater, the devotees have to take a dip in the Potramaraikulam followed by another dip at the Cauvery Padithurai popularly known as “Chakra Padithurai”.\n\nAdhering to this ritual, a number of devotees can be seen having a holy dip at the ‘Chakra Theertham’, completing the procedure. Thus, the ‘mahamaham’ in general and the Chakra Padithurai turned out to be a homecoming for a number of residents of the town who had settled elsewhere across the country. Many recall that it was during the last ‘mahamaham’ that they had a holy dip in the Chakra Theertham. One of the visitors, Meyporul, went down the memory lane of having a dip at the Padithurai right from his boyhood days. Another devotee from Mumbai, K. Swaminathan, said he had been visiting Kumbakonam to have a dip during ‘mahamagam’ for the past four decades. With a view to ensuring hassle-free dip, he had come down to the town in advance.\n\nTheerthavari\n\nChakra Padithurai is the place where the processional deities of five Vaishnavite temples are brought for the theerthavari during ‘mahamaham’. The idols from Sri Chakrapani temple, Sri Sarnagapani temple, Sri Ramaswamy temple, Sri Rajagopalaswamy, and Sri Adhivaraha Perumal are brought to the Cauvery.\n\nStress management\n\nStress management among students particularly those appearing for the public examination has been a major hurdle.\n\nWith a view to tiding over the problem, a special programme ‘Ezhuchi 2016’ organised in Tiruchi city recently, evoked overwhelming response from the students.\n\nStudents of government and aided schools who will appear for the SSLC and Plus Two public examinations next year benefited through the programme.\n\n“We identified 15 government and aided schools for honing their skills in various fields,” says Valli Meenakshisundaram, president of the Rotary Club of Tiruchi Shakthi which organised the programme. Spread over two days, the students were exposed to various lectures on career guidance, personality development, and confidence building.\n\nThe response was so overwhelming that cash prizes were given to winners, she added.\n\nM. BALAGANESSIN", 
    "section": "national", 
    "title": "Home-coming for many at Mahamaham", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}