{
    "author": [
        "L Renganathan"
    ], 
    "text": "SASTRA University has arranged to feed 1.5 lakh devotees today from 9 a.m.\n\nServing food occupies an important place among the several kainkaryams (services) that ought to be rendered to the pilgrims during mega events such as Mahamaham.\n\nDevotees usually feel hungry after a long trek followed by a dip and again a staggered walk and again a bath — all the while winging through the seemingly endless milling crowds.\n\nSASTRA University has undertaken the arduous task of feeding the Mahamaham pilgrims and that too for the second occasion.\n\nThe management has erected a massive pandal spread over 72,000 square feet on its Srinivasa Ramanujan Centre, Kumbakonam campus. Arrangements have been made to cater to an estimated 1.5 lakh pilgrims over three days with an expected gathering of one lakh people on the Mahamaham day itself.\n\nArrangements have been made for feeding 2,500 people at any point of time in the pandal. The catering contingent from a popular firm in Chennai includes 300 cooks, 700 assistants, and 400 people exclusively for cleaning.\n\nThe annadanam will be open from from 9 a.m., says SASTRA Vice-Chancellor R. Sethuraman.\n\nThe institution is spending more than Rs. 1 crore on the endeavour.\n\nRice, water donated\n\nLikewise, philanthropic textiles industrialist Abdul Bari and his bother Girgis have had the large heart to donate 1,100 bags of rice and two lakh drinking water bottles for the pilgrims.\n\nGoing beyond religious denominations, the family has been using its affluence to reach out to the various sections of society during religious events such as Mahamaham and Ramzan.\n\nTheir efforts exempl ifies the remarkable quality of communal amity through annadhanam.\n\nThere are other institutions who have joined the noble task of feeding the devotees during the Mahamaham festivities.\n\nThis comes as a relief to the devotees in the wake of surge pricing resorted by hotels.", 
    "section": "national", 
    "title": "Mass feeding comes in handy for pilgrims", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}