{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Carriageways have already become narrower, say commuters\n\nResidents living on Mysuru Road between Nayandahalli and Kengeri are dreading travelling to the city in the coming months as the setting up of barricades for Namma Metro is bound to create major traffic snarls on the stretch.\n\nBarricades\n\nWith a few barricades already up as Bangalore Metro Rail Corporation Ltd. (BMRCL) begins work on phase II linking Nayandahalli to Kengeri, the carriageways have already become narrower causing choke points around the barricades, commuters say.\n\n“This road has many big vehicles travelling towards the city. We saw how traffic was affected at Nayandahalli junction as well as towards Vijayanagar when they were building for Phase I. Hopefully, such massive jams won’t arise again,” said Jaspreet Singh, a resident of Ullal, near Bangalore University.\n\nPreviously, the stretch of road between the Deepanjalinagar station and Nayandahalli junction was barricaded for construction of the viaduct between the two stations. However, this time around, it will be a bigger stretch which will see barricading of around 6.46 km with around 5 stations being constructed as well.\n\n“It is a road with very high vehicle density. We have made it a point with the metro authorities that the width of the road must remain the same from the endpoint of Phase I till Kengeri where Phase II will stop. The barricades will be in place for a good three to four years and it is not possible to have any alternative plans for Mysuru Road,” said M.A. Saleem, Additional Commissioner of Police (Traffic).\n\nMetro officials said that they had taken these issues into account while planning for Phase II.\n\nFive stations to come up in Phase II\n\nNayandahalli\n\nRajarajeshwari Nagar\n\nBangalore University\n\nRV College of Engineering\n\nKengeri", 
    "section": "national", 
    "title": "Metro work to increase Mysuru Road traffic woes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}