{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tiruchi Sankaran (right), Mridangam vidwan, being honoured in Tirucbi on Saturday.— PHOTO: B. VELANKANNI RAJ\n\nMusicians and music lovers vied with one another in honouring mridangam vidwan Tiruchi Sankaran at a function organised to felicitate him to mark his six decade-long contribution to the growth and development music.\n\nThe function was organised by the Connoisseurs of Carnatic Music, Tiruchi, and Srirangam to mark the birth centenary celebrations of M.S. Subbulakshmi and the Alathur Brothers Day and the birth centenary of Alathur V. Sivasubramania Iyer, at Sri Nandrudaiyan temple in the city here on Saturday.\n\nN. Gopalsamy from Dalmia Cements, Venkataraman, an industrialist, Kannan, a faculty from SASTRA University, N. Sekar, secretary of Rasika Ranjana Sabha, P.K. Thyagararan, vice-president of the Rasika Ranjana Sabha, and office-bearers from Sadguru Sangeetha Sabha and Sri Nandrudaiyan Sangeetha Samajam went down the memory lane to describe Mr. Sankaran’s handling of ‘mridangam’.\n\nThey said he had popularised a unique style of playing on ‘mridangam’ with intricate style for ‘kirtan’ and in handling the ‘kumki’ (upper side) of the percussion instrument.\n\nTiruchi K. Ramesh, classical vocalist, explained the efforts put in by Mr. Sankaran in popularising the style he had learnt from his guru Palani Subramaniam Pillai.\n\nCitation\n\nA citation presented on the occasion said that Mr. Sankaran started his career as a young boy and his first concert was at Sri Nandrudaiyan temple six decades ago, when he was an accompanying artiste for the Alathur Brothers. To commemorate his contribution and service, the felicitation was being organised at this temple.\n\nConcert\n\nLater a vocal concert was presented by O.S. Thiyagarajan.\n\nHe was accompanied by Ramanujacharyalu on the violin and Tiruchi Mr. Sankaran on the mridangam.", 
    "section": "national", 
    "title": "Mridangam maestro Sankaran honoured", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}