{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Victims term the proposal of the syndicate ‘atrocious’\n\nManonmaniam Sundaranar University is all set to reinstate an assistant professor who has been placed under suspension for six months following sexual harassment charges levelled against him by some of his girl students. A resolution in this connection has been adopted in its recently held syndicate meeting and the minutes of this meeting have now been circulated among the members for their approval.\n\nAfter a few students of the Department of History of the MSU levelled sexual harassment charges against Vinod Vincent Rajesh last August and started a protest demanding “punitive action” against him. The Grievance Redressal Cell for Sexual Harassment against Women of MSU was formed to probe these allegations. The aggrieved students appeared before the Cell on August 13 and 14 last and explained in detail the trauma they underwent.\n\nOn getting the enquiry committee’s report, the MSU’s conveners committee then forwarded it to the legal advisor who was of the opinion that maximum punishment as per the statutes of MSU should be given since charges against Mr. Rajesh had been proved. Subsequently, suspension order was issued to the assistant professor on August 26 last.\n\nAgainst this backdrop, the syndicate meeting held recently resolved to treat the period of suspension (6-months) as punishment and reinstate him with a warning. Moreover, the syndicate also resolved to stop two increments to him without cumulative effect. This is atrocious… We, the victims have submitted a petition to the Vice-Chancellor in this regard,” said one of the victims. Registrar John De Britto said no “final decision” had been taken in this connection as the resolution had been forwarded to the syndicate committee members for their approval.\n\nA few students of History Department levelled sexual harassment charges against Vinod Vincent Rajesh", 
    "section": "national", 
    "title": "MSU to reinstate assistant professor facing sexual harassment charges", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}