{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Minimum three years of continuous service, a pre-requisite\n\nA continuous period of service for a minimum of three years in Puducherry is now mandatory for Central Government employees to get their children admitted to professional courses in the Union Territory, according to new norms introduced by Government.\n\nThe rule change also insists upon children of Central Government employees having studied in the Higher Secondary Course of two years in any of the schools in the UT of Puducherry and should have also passed the Higher Secondary Examination from the same school.\n\nPrior to this change in norms, the guidelines stated that children of Central/State government servants/defence personnel / Central Paramilitary Forces posted and serving in the Puducherry UT for at least a minimum period of one year prior to the last date of submission of application are eligible.\n\nThe previous guidelines of the Department of Higher and Technical Education had drawn flak from political parties and social organisations for allowing Central Government employees even in posting or deputation in other places near Puducherry to produce residency proof in the Union Territory.\n\nDomicile requirement\n\nNow amending the clause, the government prescribed the new norm stipulating domicile requirement for admission of students to various professional courses by Centralised Admission Committee(CENTAC) admission process.\n\nThe domicile criteria will be followed in the admission of candidates through CENTAC to the seats in various government sponsored professional colleges and to the seats allocated under government quota seats by the unaided private professional colleges functioning in the Union Territory.\n\nAdmission eligibility\n\nThe new clause provides admission eligibility for “Children whose parents are either Central Government, State Government employees, Defence personnel, Central Paramilitary Forces, employees of public sector undertakings wholly or substantially run by the Central Government or Union Territory Government, posted and has been serving in the Union Territory for at least a minimum continuous period of three years immediately prior to the last date of submission application.”\n\n“Children of the above said employees should have studied in the Higher Secondary Course of two years in any of the schools in the UT of Puducherry and should have also passed the Higher Secondary Examination from the same school,” said the Department of Higher and Technical Education.\n\nFinancial assistance/ stipends/ reimbursement of tuition fee applicable to other students under Perunthalaivar Kamarajar Financial Assistance Scheme will not be provided to the candidates admitted under this category. The amended clause will take effect from the ensuing academic year 2016-17.\n\nWelcoming the new amendment brought by the government, V. Balasubramaniam, president of Puducherry State Students Parents Welfare Association said, “By introducing new clause, the government puts full stop to the misuse of the one-year criteria by several central government employees.”\n\nHe also urged the government to scrap the provision enabling the wards of Indian origin French nationals to the admissions.", 
    "section": "national", 
    "title": "New norms for entry of ward of Central staff to professional courses", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}