{
    "author": [], 
    "text": "The allotment of a coupe to Union Minister of State Pon Radhakrishnan triggered a controversy on Sunday, though as per protocol he was entitled to one. An English news channel, which alleged that the Minister had ousted a couple from the coupe, confronted him on his arrival at the Egmore station in Chennai and even wanted to know if he would tender an apology. Enquiries showed that a family had claimed that a coupe in AC First Class of Train No. 12634 Kanyakumari-Chennai Egmore Express was allotted to a newly married couple but was cancelled in the last minute after the Minister boarded the train. However, railway sources confirmed that the coupe was allotted to the Union Minister under the emergency quota against PNR 4317016589. The couple was perhaps given accommodation in four berth bays. A preference for coupe in AC First Class can be given at the time of booking the ticket. However, the allotment can be confirmed only after the preparation of chart, which is four hours before the departure of the train.\n\nIn yet another incident of social media publicity backfiring, MDMK leader Vaiko became the subject of a controversy this week after photos of him at an accident spot in which two bikers were killed began circulating on WhatsApp. Social media was agog that Vaiko’s convoy of vehicles had been involved in the accident, while the two were reportedly mowed down by a mini lorry. Instead of turning out to be an exercise in popularity building, the incident boomeranged on social media leading to a party functionary filing a complaint with the cyber crime police seeking action against rumour mongers.\n\nJudgments in courts run from a few dozen pages to a few hundred pages at times. Chief Justice India T.S. Thakur had a point at the inauguration of the Judicial Academy in Coimbatore on Sunday. He said that since earlier judgements were handwritten by the judge, most of them were to the point and ran to only about one-and-a-half to two pages. “Complicated judgments did not exceed five pages,” he said. Stating that judgments have now become lengthy, he said that one of the reasons was the use of computers, which made it easy to copy and paste lengthy quotes from similar judgments and texts.\n\nMDMK general secretary Vaiko’s aversion to DMK heir-apparent M K Stalin is no secret. The former never loses an opportunity to hit out at Stalin as was seen at a public meeting in Coimbatore on Saturday when Vaiko asked the DMK leader to check facts before speaking. Stalin had at a meeting in Erode said three farmers were killed in the police firing at Perumanallur on February 19, 1970, when M.G. Ramachandran was the Chief Minister of the State. Vaiko pointed out that Stalin’s father Karunanidhi was the Chief Minister when the firing took place. Mr. Vaiko said that it was not the first time the DMK youth wing leader got his facts wrong on the stage.\n\nAt a meeting of the People’s Welfare Front in Salem, CPI State secretary Mutharasan surprised many by spontaneously heaping praise on DMK president M. Karunanidhi for keeping himself abreast of day-to-day happenings in the country. “Mr. Karunanidhi is matchless in issuing instant statements tirelessly on the current affairs every day. He always has an eye on the political scenario in the country, and has in his fingertips almost all details of current political developments,” Mr. Mutharasan said, adding that the nonagenarian indeed was matchless in this aspect and deserved appreciation. Just as everyone were raising their eyebrows, came the twist from Mr Mutharasan who wondered why then Mr. Karunanidhi had chosen to maintain stoic silence on the U. Sagayam Commission Report on illegal granite mining in Madurai during the DMK and AIADMK regimes.\n\n(Contributions from S Vijay Kumar, T K Rohit, M K Ananth and Syed Muthahar Saqaf)", 
    "section": "national", 
    "title": "Of coupe and confusion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}