{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Polio drops were administered to children in Salem on Sunday. (right) Mayor Malliga Paramasivam and Deputy MayorK.C. Palanichamy administer polio drops to a child at an immunisation centre in Erode.— Photos: E. Lakshmi Narayanan and M. Govarthan\n\n1,289 booths functioned to cover 1.98 lakh children in Erode\n\nPolio drops were administered to more than 3.50 lakh children in different parts of the district during the second phase of the pulse polio campaign on Sunday.\n\nEdapadi K. Palanisamy, Minister for State Highways and Minor Ports, inaugurated the campaign by administering polio drops to a few children at the centre at Government Boys Higher Secondary School in Edapadi town, in the presence of V. Sampath, District Collector, V. Panneerselvam, MP, and T. Kadiresan, Edapadi municipal chairman.\n\nPolio drops were administered to children in 2,216 centres that functioned in government hospitals, noon meal centres, primary health centres, sub-centres and government offices in the district. Nine mobile centres also functioned.\n\nAnother 77 centres were set up in bus stands, railway stations and at the places which attracted a large number of people.\n\nA total of 9,332 officials of health and other departments and volunteers of the Rotary Clubs were pressed into service in these centres.\n\nPolio drops were administered to about 82,000 children in 196 centres in the Salem Corporation limits.\n\nErode\n\nAs many as 1,289 booths – 1,201 in villages and the rest in urban parts - were operated to cover 1.98 lakh children within five years of age under the second phase of intensive pulse polio immunisation campaign on Sunday.\n\nThe campaign was initiated by Environment Minister Thoppu N.D. Venkatachalam and District Collector S. Prabakar at the Perundurai Bus Stand.\n\nAccording to a press release, 10,079 children were covered through 104 centres and six mobile booths in the hilly parts of the district. Besides, special camps were conducted to cover children of migrant workers. Eighty five special camps were conducted in bus stands, railway station, temples and other places of public confluence.\n\nA total of 5,234 persons consisting of Health Department and Anganwadi workers, volunteers of non-government organisations and rotary clubs were involved in the campaign. As many as 97 government vehicles were utilised.", 
    "section": "national", 
    "title": "Over 3.5 lakh children immunised in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}