{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Focus on\n\nDevelopment of UT\n\nThe Union Territory of Puducherry has several important Central and State government-run educational institutions including professional colleges. The Pondicherry University established in 1984 is now functioning without a full-fledged Vice Chancellor. Only a VCin-charge has been posted since September last year. Even the post of Lieutenant Governor in Puducherry is lying vacant. The present incumbent is Lt Governor of Andaman and Nicobar islands who is holding an additional charge of the gubernatorial post since July 2014. Puducherry will go for assembly polls shortly and there is every need for the Union Territory to have a full fledged incumbent of the post of Lt Governor.\n\nThe airport in Puducherry established with great expectations and after hefty investment is also lying idle as those coming forward to operate services to link Puducherry with places like Bengaluru could not be in the field for various reasons.\n\nThe Centreshould look into these issues and come out with permanent solutions.\n\nS. Nadarajan\n\nJawahar Nagar\n\nNot enough toilet facilities in Romain Rolland Library\n\nThe Romain Rolland Library in Puducherry is the only place where one can see the public from all walks of life, search for knowledge in their field of interest.\n\nThe aged public who read in the air-conditioned reading room find no toilet facilities, curtailing their duration of reading. The number of visitors has increased but there is just one toilet, behind the children’s section, which is in dilapidated condition. The basic amenities should be provided in order to attract foreigners and tourists and digital technology may be used wherever possible.\n\nTo encourage online reading by members a subsidised membership fee can be collected as in the British Library in Chennai . It is requested that the authorities concerned should look into the matter.\n\nV. Ramalingam\n\nSri Ambal Nagar, Thattanchavady Post\n\nGood work of Election Department\n\nWith Assembly elections round the corner, Puducherry Election Department is working in full swing reaching for a perfect show.\n\nThe department has always been aggressive and enthusiastic in its work and praised for its successful work after each election and also being the first state to fully equip voters with EPIC cards.\n\nThe tradition is kept alive by a team of dedicated officers and staff as my personnel experience proved. Telephonic advice and personnel dealings were most polite and helpful.\n\nThis department stands as a role model for public service.\n\nT.V.Sreekumar\n\nLawspet\n\nReaders can send their mails to pondy.thehindu @gmail.com and The Hindu, No. 135 Mission Street, I Floor, Puducherry – 605001 .", 
    "section": "national", 
    "title": "Page 3 21FEBPYSSM03 READERS’ MAIL 153517512 (for second letter)", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}