{
    "author": [
        "S Ganesan"
    ], 
    "text": "Across the railway track on TV Koil trunk road\n\nThe State Highways Department is set to begin construction of the new road over bridge (ROB) across the railway track at Periyar Nagar on the Thiruvanaikovil Trunk Road in the city.\n\nWith the Odathurai road over bridge being opened a few days back, which would allow traffic diversions, the Highways Department is expected to begin construction of the new bridge soon. The Rail Vikas Nigam Limited, a public sector undertaking, will construct the railway portion of the proposed ROB.\n\nSources in the Highways Department indicated that they have approached the district administration seeking permission for traffic diversions to facilitate the construction of the bridge. Once the nod is accorded, a notification would be issued on the traffic diversions to be enforced to enable commencement of the work at Periyar Nagar. The new four-lane ROB will replace the existing narrow two-lane bridge that has turned a traffic bottleneck in Srirangam in recent years. The State government has sanctioned the project at an estimated cost of about Rs. 47 crore.\n\nAlthough the Highways Department had commenced construction of a subway and other minor bridges as part of the new road overbridge (ROB) across the railway track at Periyar Nagar on the Thiruvanaikovil Trunk Road in the city, the work on the subway had to be suspended during the monsoon due to the high groundwater table and mud slides.\n\nThe Highways Department took up construction of the subway first so as to ensure that vehicles passing through the busy road could be diverted through it. Ultimately, the subway will serve as the route for vehicles for Kumbakonathan Salai from Periyar Nagar. But with the site located close to the Cauvery, there was heavy seepage leading to mudslides at the spot. The department had been waiting for the opening of the Odathurai bridge so that work at the Periyar Nagar site could be taken up at full swing.\n\nThe Highways Department has planned to commence construction of the main bridge structure and the subway simultaneously. The subway work would be completed within a few months. The Rail Vikas Nigam Limited, which was executing the track doubling work on the Villupuram-Dindigul section, is ready to take up construction of the bridge portion above the Railway tracks, the sources said.\n\nThe existing narrow bridge at the site, which is to be dismantled to make way for a new bridge, had turned a major traffic bottleneck in Srirangam in recent years. Choked with heavy and continuous traffic beyond its capacity, the narrow bridge witnessed bumper-to-bumper traffic for most part of the day. The problem started in 2010 after the Oyamari Road was closed for traffic to facilitate the construction of the road over bridge (ROB) along the right bank of the Cauvery.", 
    "section": "national", 
    "title": "Periyar Nagar bridge work to begin soon", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}