{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A child receives polio vaccine drops during the second phase of the Intensified Pulse Polio Immunisation campaign on Sunday.— Photo: C. Venkatachalapathy\n\nA total of 3.62 lakh children aged 0 to 5 years were immunised against polio during the second round of the intensified pulse polio immunisation campaign across Vellore district on Sunday.\n\nThe Health Department had a target of immunising 3,96,386 children during the second round of the campaign. At the end of the campaign on Sunday, the district has achieved an average coverage of 95.4 per cent of enumerated children, according to the officials.\n\nThe department will now start its door-to-door checks to cover children who had missed the dosage.\n\nIn Vellore Health Unit Division (HUD), 1,34,999 children received the drops in rural parts, while 40,969 children in urban parts were covered during the campaign. By immunising 1,75,968 children, the division achieved 97.4 per cent coverage.\n\nAs many as 1,38,500 children were immunised in the rural areas of Tirupattur HUD, while 47,648 children received the drops in the urban parts.\n\nA total of 1,86,148 children have been immunised in the HUD, accounting for 93.6 per cent coverage.\n\nMeanwhile, the drops were also administered to 10,613 children on transit in Vellore HUD, and 5,787 children in Tirupattur HUD.\n\nThe department also reached out to 155 children of migrant labourers in Vellore HUD and 743 children in Tirupattur HUD.\n\nThe department had established 2,393 booths across the district to administer the drops to children during the second phase of the campaign.\n\nThese booths were also set up at the toll plazas on the National Highway, bus terminus and railway stations.\n\nBooths were also provided for hilly areas that had poor transport connectivity. Camps for children of migrant labourers and Sri Lankan Tamil refugees were also arranged.\n\nAs many as 9,466 persons, including from government departments, NGOs and women self help groups, were involved in the campaign works.\n\n“We will start the door-to-door checks from Monday to immunise children who missed the dosage. After immunising such children till Tuesday, we will continue efforts to trace dropped out children till Saturday,” K. Poonkodi, deputy director of health services, Vellore said.\n\nDoor-to-door checks will start from today to immunise those who missed out", 
    "section": "national", 
    "title": "Polio vaccine administered to 3.62 lakh children in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}