{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "City will be among top 10 in next survey: Commissioner\n\nEven these hoarding were placed just days before the auditors arrived for evaluation.– Photo: S. Siva Saravanan\n\nCoimbatore is ranked 18th among the 73 cities audited for cleanliness under the Swachh Bharat programme. This is no surprise, said many who are familiar with the way the city administration has implemented the Swachh Bharat programme.\n\nThe city lagged behind because there were not enoughinformation and communication programmes as there should have been. Only a few days before theSwachh Bharat auditors arrived here , did the civic body scramble to place hoardings across the city.\n\nThe Union Government had a toll free number to facilitate citizens’ participation and feedback, but the civic body did not publicise the number adequately.\n\nWhen the auditors arrived not even one toilet under the Swachh Bharat scheme was constructed.\n\nThis was enough to make the auditors award poor marks. Coimbatore was awarded 72 out of 150 marks in the ‘Sanitation: public and community toilet provision’ parameter and 95 out of 150 in the ‘Sanitation: individual household latrines’ parameter.\n\nIn contrast, Trichy ranked 3, scored 143 out of 150 in the ‘public and community toilet provision’ parameter, and 133 out of 150 in the ‘individual household latrines’ parameter. Sources in Tiruchi say that community and public toilets have boosted the city’s image. The local body there has not only constructed toilets in almost all slums but has also maintained them. And, open defecation had come down significantly.\n\nIn Coimbatore, Solid waste management was also a let down, says a waste management consultant. The city has all the infrastructure and resources it requires but the problem was not using them well. Poor door-to-door collection of segregated waste and the open dumping of waste in Vellalore were contributory factors that landed the city in the 18th spot.\n\nBut senior officials say that there has been an improvement in segregated waste collection. From 70 – 80 tonnes a month of recyclable waste a few months ago, it is now around 230 tonnes a month, they say. This shows that the quantity of waste that they segregated and processed has tripled.\n\nThe officials add that if the Union Government were to audit the cities now, the city would definitely figure in the top 10 because the individual household toilet construction has also gathered momentum.\n\nCommissioner K. Vijayakarthikeyan says that the civic body has identified areas for improvement and is working on those. In the next survey, he promises, Coimbatore will be high in the list of top 10 cities.", 
    "section": "national", 
    "title": "Poor planning costs city high rankings", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}