{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Above) Some of the paintings on display at the 4th Puducherry Road Show held around Bharathi Park on Sunday.(Right) A child looks at an animal made of coconut coir.— Photos: S.S. Kumar\n\nOrganisers are planning to conduct a seven-day camp for artists next year\n\nCanvases of different sizes with pencil strokes, colours and sand adorned the steel fence panels surrounding the Bharathi Park on Sunday, thanks to Puducherry Ovia Nunkalai Kuzhu, which organised its fourth edition of the Puducherry Road Show, bringing together amateurs and connoisseurs to display their art works in a common space.\n\nCurious onlookers gathered around the exhibits and enquired about the price of artworks. As many as 252 artists exhibited their paintings, craft, sculptures under the tree-shade of Bharathi Park and the works were priced from Rs. 100 to 50,000.\n\nArtists from Puducherry and Tamil Nadu took part in the show.\n\nS. Megavathi, a VI standard student from St. Joseph of Cluney Girls Higher Secondary School, had her works in small canvases pinned to a white cloth spread over the plants opposite Raj Nivas.\n\nG.V.Yokesh, a VI standard student from KV, used vegetables like beetroot, brinjal and carrot to carve out images of gods and displayed in front of the metal gate in Bharathi Park towards Suffren Road. There were large canvases of oil and water colour paintings as well. School children and people took pictures of the art works.\n\nIn the sweltering Sunday afternoon, parents also accompanied their children to watch the Puducherry Road Show.\n\nEven art enthusiasts got an opportunity to showcase their talents at the Road Show. A polytechnic student R.Rajarajan displayed the house and swing built in ice cream sticks, painted with blue, red and pink colours. They were priced between Rs 100 to Rs 250.\n\nThe road show also had dolls made of coconut fronds with a message against child labour. As one moved towards Suffran Road, there were hardbound tiny books to note down shopping list, coloured by children from Jwala Home for Mentally Challenged from Murungapakkam.\n\n“This is an attempt to make art more accessible to common public and also to encourage students and children. Public should know that art is not for the elite alone,” said Malathi Rajavelu, president of the Puducherry Ovia Nunkalai Kuzhu.\n\nShe added that a seven-day camp for artists would be organised next year. This would encourage more artists from Puducherry to enrich their creativity.\n\n“The indoor camp will help local artists to interact with artists from other states. If the Tourism Department along with Department of Art and Culture support this venture, the participants’ number could be increased from 12 to 24,” added R.M.Palaniappan, regional secretary, Lalit Kala Academy.", 
    "section": "national", 
    "title": "Road show brings art under one roof in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}