{
    "author": [
        "Pon Vasanth Arunachalam R Sujatha"
    ], 
    "text": "A last-minute change in the examination centre for a cross-section of candidates marred the Tamil Nadu State Eligibility Test (TNSET 2016) conducted by the Mother Teresa University across 66 colleges in 16 cities/towns on Sunday.\n\nAround 57,000 candidates took the examination, a pass in which is mandatory for appointment as Assistant Professors in the State.\n\nA considerable number of candidates faced confusions over change in examination centres on Saturday.\n\n“In the hall ticket printout I took from the website, the examination centre was mentioned as Lady Doak College. However, yesterday I received an SMS stating that the centre is American College,” said M. Kumaresan, who came to Madurai from Ramanathapuram district for the examination.\n\nMany other candidates shared a similar experience. S. Swaminathan, founder-secretary and advisor to NET/SLET Association, said he received similar complaints from candidates in Tiruchi and Chennai.\n\nS. Vijaya, who took the test in Chennai, said two days ago when she downloaded the hall ticket the centre was marked as Ethiraj College. “But late last evening around 7 p.m., I browsed the website for instructions and found that the centre had been changed to JBAS (erstwhile SIET) College,” she said.\n\nAdding to their woes, candidates were not given a copy of the question papers after the test. “In the National Eligibility Tests (NET) conducted by the University Grants Commission, question papers and even carbon copies of answer sheets are provided,” said S. Bhoominathan, a candidate.\n\nIn some places, candidates complained that they were asked to remove their watches before entering the exam hall. “Since there was no clock in the exam hall we were worried about finishing the paper in time. Our invigilator was kind and updated us on the time left every half hour,” said a candidate.\n\nThe TNSET notification, however, mentioned that answer sheets of all candidates would be uploaded on website later and candidates could challenge any mismatch in marked answers or issues with questions or answer keys.\n\nA candidate who had taken the Sociology test said there was mismatch in answer choices between Tamil and English versions.\n\nHigh fees\n\nCandidates also complained of comparatively high examination fee, which ranged from Rs. 500 for SC/ST to Rs. 1,500 for the general category. Those who paid online had to shell out at least Rs. 100 more as the payment gateway meant additional charges besides service tax and convenience fee.\n\nIn contrast, for UGC NET, the fee for general category candidates is Rs. 600, with 1.2 per cent service tax for credit card and 0.75 per cent for debit card. Candidates were surprised to find college teachers as invigilators. “Usually it is the non-teaching staff who are given the job to check teachers helping students. Normally, candidates from various subject domain are accommodated in a classroom,” said a candidate.", 
    "section": "national", 
    "title": "SET marred by last-minute change in centres", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}