{
    "author": [
        "Dennis S Jesudasan"
    ], 
    "text": "Challenges Jayalalithaa to a debate on status of projects announced by her\n\nReiterating his party's promises made earlier, DMK treasurer M.K. Stalin on Sunday said necessary steps would be taken to set up a Lok Ayukta (anti-corruption body) and to enact the Right to Service Act, if his party was elected to power in the Assembly polls.\n\nAddressing a public meeting near here, Mr. Stalin said, “if the Lok Ayukta is established, there won't be any corruption or commission or collection (in government)”\n\n“We would make the State number one in the country. Youth and students would be our priority,” he said, adding the party would introduce prohibition in the State.\n\nMr. Stalin, who recently completed his Namakku Naame road show in all 234 Assembly constituencies, said the people had innumerable grievances. “Chief Minister Jayalalithaa had said she would need 36 days to list out the achievements of 36 departments, but it would take several years to list out the grievances people have,” he said .\n\nTearing into the ruling party for not fulfilling several promises made in the election manifesto, he alleged 50 of the 53 promises made were not fulfilled.\n\nHe questioned the status of the satellite town project in Tirumazhisai, the desalination projects in Pattipulam and Nemmeli. On the other hand, companies such as Foxconn and Nokia had wound up their Chennai operations.\n\nMr. Stalin also challenged Ms. Jayalalithaa to a debate on the status of announcements made by her government. “I’m ready. Are you ready?” he asked.\n\nSuicide issues\n\nThe truth behind the suicides of State government official Muthukumarasamy, police officer Vishnupriya and IPS officer N. Harish would be brought out if his party came to power, he said.\n\nRecalling his party’s several demands to launch a judicial inquiry into the reasons behind the breach of Chembarambakkam reservoir, he said if DMK came to power it would set up a probe panel.\n\nMr. Stalin questioned the efficiency of the AIADMK government and claimed that the State was better off when DMK ruled the State.", 
    "section": "national", 
    "title": "Stalin promises Lok Ayukta", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}