{
    "author": [], 
    "text": "If anybody thinks that cleaning of toilets is the occupation of a section of people, think again. A Madurai duo is out to prove that cleaning is as honourable as any other profession and anybody can get involved and make money. The startup, VE Clean, started by Rajesh Kanna and D. Prasana may not sound as glamourous as the ones that involve technology. But it is poised to shatter certain social myths. Located on Marudupandiar Street in Tahsildar Nagar of Madurai, VE Clean, which won the top award in the startup competition conducted by the Nativelead Foundation this year, has over 400 customers in eight months. It is the only company in South India to have got National Small Industries Corporation certificate for cleaning service. Prasana, who has a long line of degrees – M. Sc., B. Ed., M. A. and B. L., tells S. Annamalai how an idea to do business with zero investment grew up into a scalable and viable venture.\n\nThe yearning to be job providers was in the due from an early age but success eluded them. Rajesh Kanna of K. Pudur, an M. Tech. (IT) graduate, says, “I did not want to be a slave from my young age. I always wanted to be a leader.” He attributes his “inexperience” for the many failures he had to face before finally settling in a sustainable venture. His last failure was Food Web, a social enterprise intended to distribute surplus food before it got spoilt. “It was a good concept but not a financially viable model,” admits Rajesh. “We had three things in mind before starting the cleaning service – it should be a product or service in demand; a scalable business and people should come to the company, instead of the other way round,” explains Prasana, the CEO.\n\nThe service was started with an investment of Rs. 250 and lot of passion on June 5, 2015. At present, there are six employees, working with an incentive of 5 per cent for work done for Rs. 500; 10 per cent for Rs. 1,000 and 15 per cent for Rs 1,500 a day, along with their salaries. They are provided with all protective gear and covered by insurance and pension scheme. “We use minimal acid in our cleaning work. But our real intention is to bring in all unskilled youth into the business of cleaning by making it attractive as in the case of hair stylists,” says Prasana.\n\nTo make cleaning a respectable profession, the duo has planned to offer training to unskilled youth. On successful completion, they will be rewarded with a certificate of National Skill Development Corporation and a job. Soon, VE Clean plans to introduce automation in the cleaning process. “We have been adopting guerrilla marketing strategies to popularise our service. With growing demand, we plan to open four more offices in the city,” says Rajesh. Ultimately, they want to use only organic materials in cleaning. “Since use of organic products will be costlier, we will segregate customers with two different tariffs.”\n\nMore details about VE Clean can be had fromwww.veclean.inor 84382 31223.", 
    "section": "national", 
    "title": "Startup for a clean sweep", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}