{
    "author": [
        "L Rengathan"
    ], 
    "text": "Vehicles and pilgrims keep arriving 24X7 and shops are doing brisk business round-the-clock\n\nt is 1.15 a.m. on Sunday at Kumbakonam and the continuous honking of horns by drivers on the arterial Ayee Kulam Road area proximate to the Mahamaham tank area reflects the mood. There is a train of vehicles caught in a bumper-to-bumper crawl.\n\nUnearthly it might be elsewhere, but in Kumbakonam during the Mahamaham, it is all, as they saw, happening here.\n\nMeanwhile, vehicles and pilgrims are inching their way slowly through the main roads mostly towards the Mahamaham tank, Portramarai tank, and the Cauvery bathing ghat.\n\nGroups of families and friends, dripping after a dip in the Mahamaham tank, trek to the other sacred spots enquiring their way through the teeming crowds. Thousands move towards the Mahamaham tank from the eastern sides of the town and police personnel having a torrid time in patiently convincing those jumping the queue to adhere to rules for a smooth outing. Soaked streets indicate that the tank was round the corner.\n\nThe streets in Kumbakonam are illuminated. The Mahamaham tank resembles a flood-lit stadium. Once in the tank, the average pilgrim, never mind his or age, forgets everything and enthusiastically reaches for the mug.\n\nEmerging from the western side of the tank, the countenance of the devotees reveal a satisfying spiritual effort and all the tiresome trek from the temporary bus stand to the Mahamahm tank, the Portramarai tank, and the Cauvery bathing ghat fly in the face of that spiritual satisfaction.\n\nMeanwhile, the police announcer from his perch at the control room adjacent to the tank keeps calling the names of men, women, and children who have lost their way. He calls upon the pilgrims to keep their belongings safely.\n\nMost shops remain open and do a brisk business. From restaurants to rest houses, coffee shops to kiosks selling varied items, they are all busy. It’s selfie time for the enthusiastic youth.\n\nThe foot soldiers of the Department of Health and Public Sanitation go around fogging the area. The conservancy workers tidy things up at the Mahamaham tank and elsewhere mindful the of herculean task they have on hand this morning.", 
    "section": "national", 
    "title": "Sun never sets on Kumbakonam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}