{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Houses of over 600 families have been demolished at Surya Nagar in Kotturpuram—Photo: S.R. Raghunathan\n\n“This is the place where both my father and grandfather lived and died. When our families have lived here for generations, is it fair for the government to ask us to move to another area,” asks Muniyandi of Surya Nagar.\n\nHis family is among the 300 families in Surya Nagar at Kotturpuram, who have not shifted their homes to Perumbakkam in the tenements allotted to them by Tamil Nadu Slum Clearance Board after the floods in December.\n\nRecently, the High Court ordered a status quo on a petition moved by the residents seeking to restrain the authorities from evicting them.\n\nDespite numerous meetings with the officials, the residents had sought support from activists to continue living there and the HC order has brought in some temporary relief, they say.\n\n“Many buildings have encroached upon the Adyar river banks. When the houses of the poor are over 100 feet away, why are they being asked to move? ” asks G. Selva of Communist Party of India (Marxist), who has been working with the people there.\n\nAmong the houses in the locality, there are empty spaces filled with debris. Over the last month, around 600 families have moved into houses allotted by TNSCB at Perumbakkam and their houses have now been demolished. “We never wanted to leave and after the HC order, we are even more determined not to leave,” says M. Devaki, a resident.\n\nEchoing her views, T. Manikavel, another resident asks: “We are not encroachers. So, why should we move?”\n\nVehement about continuing in Surya Nagar, Vijayalakshmi, a resident says the area had good roads, street lights, a fair price shop, a Corporation gym and a Children’s Centre run by Integrated Child Development Service.", 
    "section": "national", 
    "title": "Surya Nagar residents firm on staying put, HC to their aid", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}