{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram: Car festival, abishekam, 6 p.m.; Ambal purappadu in kedayam, 7 p.m.\n\nArulmigu Sundararaja Perumal Temple, Anbil: Masi maham festival, reaching Kollidam banks, 10 a.m.; purappadu from Kollidakarai, 10 p.m.\n\nSri Srinivasa Perumal Temple, Indiranagar: Special Garuda Sevai utsavam, Perumal purappadu, 9 a.m.; theerthavari, 9.30 a.m.; pooja, 6.30 p.m.; Garuda sevai – thiruveedhi purappadu, 7.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Srinivasa Perumal Sannidhi, Amma Mandapam, Srirangam, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 6, Perumalkovil Street, Indira Nagar, 6 p.m.\n\nCULTURE\n\nOrganising Committee: Sri Thyagabrahma aradhana mahotsavam, nadaswaram by Sheik Subani and Kalisha Bi and party, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; vocal concert by Sanjay Subramanian & party, 8 p.m.\n\nGENERAL\n\nDistrict Administration: Public grievances meeting, K.S. Palanisamy, presides, Collector’s Office, 10 a.m.\n\nConfederation of Indian Industry, Tiruchi Zone: Annual Day, B T Bangera, Managing Director, Hi-Tech Arai Limited, speaks, Hotel Sangam, 6 p.m.\n\nTiruchirapalli City Corporation: Civic grievances meeting, A. Jaya, Mayor, presides, Corporation Office, 11 a.m.\n\nNational Institute of Technology Department of Civil Engineering: International conference on “Disaster mitigation and management for sustainable development and risk reduction”, S. Gomathinayagam, Director General, National Institute of Wind Energy, Chennai, chief guest, Srinivasan Sundarrajan, Director, NIT, Tiruchi, presides, 9.30 a.m.\n\nBharathidasan University: Department of Social Work, UGC-sponsored national seminar on “Social work perspectives and practices in disaster preparedness and management”, S. Sekar, Syndicate Member, inaugurates, K. Abdul Ghani, Social Activist, delivers keynote address, BUTP Seminar Hall, Khajamalai campus, 10.30 a.m.; A. Umesh Samuel Jebaseelan, Dean, Research and Development, Bishop Heber College, delivers valedictory address, 4.30 p.m.\n\nM.A.M. College of Engineering: Workshop on “embedded system and robotics”, K.C. Tamil Venthan, Director, LIFT Technologies, resource person, M.A. Mohamed Nizam, secretary, MAMCE, inaugurates, 10 a.m.; inauguration of NSS special camp, B. Kumraguraparan, NSS Zonal Coordinator, Anna University,Tiruchi, Tirupattur, 10 a.m.\n\nM.A.M. School of Engineering: Matribhasha Diwas - cultural festival, 10 a.m.\n\nUrumu Dhanalakshmi College Bharathi Vasagar Vattam: Book review by students, 12.30 p.m.\n\nCauvery College of Engineering and Technology: Seminar on “Career Opportunities”, 10 a.m.\n\nGEECO Enercon Pvt. Ltd: Sixth international technical forum on “Rotary air pre heaters, electrostatic precipitators, boiler testing and CFD”, Hotel Ramyas, 10 a.m.\n\nSharon – JCI Tiruchi Excel: Quiz fest 2016 for Rane TRW Rolling Shield, Aided Middle School, Pallakkadu, 11 a.m.; Panchayat Union Middle School, Edamalaipattipudur, 3.30 p.m.\n\nKongunadu College of Engineering and Technology: Lecture on “Experimental investigation on replacement of waste material in concrete” by D. Gowsika, assistant professor, 5 p.m.\n\nJamal Mohamed College: Valediction of inter-collegiate diamond jubilee volleyball tournament for IOB Rolling Trophy, R. Muralidharan, Chief Manager, IOB, JMC Branch, distributes prizes, 6 p.m.\n\nRotary Club of Tiruchi: Weekly meeting, Rajarathinam, Specialist in liver transplantation, speaks on “Liver transplantation”, Hotel Femina, 6.30 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}