{
    "author": [
        "Staff Reporter"
    ], 
    "text": "For Suhail Azad Ahamed, studying Third Grade in Queen Mira International School, it was his passion to become proficient in English which got him interested in spelling bee contests.\n\nWhat started as a hobby, however, has now brought laurels to Suhail, who secured 11th rank in the national level MaRRS International Spelling Bee contest, an annual event organised by a private organisation, recently held at Kalamassery in Kerala.\n\n“I didn’t feel that I was in a contest. It was just like one of the spelling bee sessions I regularly practice at home and school,” said Suhail who competed with about 400 participants in the event. However, he said that the national-level contest was comparatively challenging. “Until State level, it was just written tests. In national level, there were both written and oral rounds apart from questions on etymology of the words,” he said, adding that he will aspire to get selected for an international level contest next year.\n\nWhile for Suhail it was his interest in English, for S. Sri Rachana, a Grade Five student from the school, it was her interest to improve performance in Mathematics that took her to the national level math league competition, organised by the same group along with the spelling bee contest. “Compared to other subjects, I found Maths to be tough. So I took it as a challenge to participate in math league, which involves instant solving of math puzzles. But I never thought I will reach the national level,” Sri Rachana said.\n\nSujatha Guptan, Principal, said that while students from their school had participated in the competitions before, this was the first time they reached the national level. “In the spelling bee contests, there were only two schools from Tamil Nadu. One is ours and another from Chennai,” she said.\n\nAbinath Chandran, Managing Director of the school, said that the curriculum followed in the school helped the students develop interests in multiple fields instead of just focusing on academics.\n\n“There were written and oral rounds, besides questions on etymology of words”", 
    "section": "national", 
    "title": "Wizards of letters and numbers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}