{
    "author": [
        "R Srikanth"
    ], 
    "text": "One of the buses involved in the accident near Muttukadu boat house on Sunday; an injured passenger undergoing treatment at the Government Royapettah Hospital —Photos: M. Karunakaran and B. Jothi Ramalingam\n\nOver 40 passengers injured in accident involving three state government buses near Muttukadu Boat House\n\nA 59-year-old woman died and over 40 passengers were injured after two Tamil Nadu State Transport Corporation (TNSTC) buses collided at Muttukadu on East Coast Road on Sunday afternoon.\n\nThe two buses — one travelling towards Chennai from Chidambaram and another towards Puducherry from the city — were involved in the head-on collision.\n\nAnother bus proceeding behind the Puducherry-bound bus, rammed into it.\n\nG. Lakshmi, who was travelling in the Chennai-bound bus was critically injured and was rushed along with several other injured passengers to Government Royapettah Hospital, where she succumbed to her injuries. Her husband Ganesan was also injured in the accident.\n\nThe couple, residents of Race Course Road in Guindy, was returning from the Mahamaham festival in Kumbakonam, when the accident took place, a senior police officer of Kancheepuram district said.\n\nIn the impact, one of the buses was ripped apart, with several passengers suffering major injuries. Some of them were taken to Government Medical College Hospital in Chengalpattu.\n\nParts of the bus fell below the bridge across the backwaters near the Tamil Nadu Tourism Corporation’s boat house at Muttukadu.\n\nRaja, who was travelling with his wife Santha from Royapuram to Cuddalore, while recounting the accident, said it took place as the driver of the Chennai-bound bus was driving rashly. Raja suffered a broken tooth and several injuries.\n\nR. Narayan Babu, Dean, Government Kilpauk Medical College Hospital, said 37 passengers were injured in the multiple collisions and taken to the Government Royapettah Hospital.\n\nAmong them, four were shifted to to Rajiv Gandhi Government General Hospital for further treatment. Two are being treated for injuries on their legs. The rest were discharged after first aid.\n\nOf the seven injured passengers taken to the Chengalpattu hospital, six were discharged, sources said. Kelambakkam police have registered a case and are investigating. None have been arrested so far. All the buses belonged to Villupuram division of TNSTC, police added.", 
    "section": "national", 
    "title": "Woman dies after buses collide on ECR", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}