{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Economy growing because of strong demand in domestic market’\n\nUnion Minister of State for Commerce and Industry Nirmala Sitharaman (second right) at the Start-Up meeting organised in Coimbatore on Sunday by Young Indians and Indian Chamber of Commerce and Industry, Coimbatore. —Photo: M. Periasamy\n\nOnly eight per cent of the start-ups in the country are run by women and hence, women entrepreneurs should come up with more enterprises, Union Minister of State for Commerce and Industry Nirmala Sitharaman said here on Sunday.\n\nShe was speaking at a session on Start-Up India organised by Young Indians (Yi), Confederation of Indian Industry (CII) and the Indian Chamber of Commerce and Industry, Coimbatore.\n\nIndia was ranked third globally in the start-up segment. However, the number of women starting such ventures is not much. Women have the capability to identify problems in the society. They should come up with solutions and their number in the start-up segment should go up, the Minister said.\n\nFunds were not a constraint for start-ups and there was no area that was closed to this segment. “We are not looking at only tech-based start-ups. It should be in other areas too,” she said.\n\nThough exports were seeing a downfall for the last 13 months, the economy was growing because of the strong demand in the domestic market. The self-efforts of entrepreneurs and the private sector were not able to flourish and managed to survive because of the socialist policies of the Government for the last six decades. India’s strengths were small savings and private enterprises. Despite the controls because of the regulatory framework, the private sector had contributed to the economy. The emphasis of the Government now is to change the mindset that the Government is not to control. The Central Government has, hence, brought about self-certification, she said.\n\nShailendra Singh, Joint Secretary of the Department of Industrial Policy and Promotion, said the Central Government will soon have an application and a portal to make registration easy for start-ups. There will be one form to get all the required registrations from the Central Government.\n\nThe State Governments have been requested to come up with a similar facility or integrate with the existing form of the Central Government. Further, a notification will be issued shortly exempting start-ups from any compliance for three years and they only need to provide self-certification. This is to facilitate start-ups to focus on ideas. There are also plans to provide tax exemptions to innovative MSMEs and to develop more incubators. India Aspiration Fund has a funding of Rs. 2000 crore and is handled by the Small Industries Development Bank of India. So far, projects worth Rs. 600 crore have been approved and the funding will start soon, he said.\n\nJacob Joy, national vice-chairman designate - Yi, said that about 70 per cent of the start-ups in the country is founded by those less than 32 years and the start-ups are coming up in tier-two and tier-three towns too.\n\nAccording to K.V. Srinivasan, chairman of CII – Coimbatore, now 80 per cent of investment is focused towards technology-based start-ups. This should change and the focus should be on other sectors also.\n\nThe Government should support non-technology and non-ICT based start-ups. The CII is in the process of setting up a national centre for start-ups.\n\nSwathy Rohit, chair of Yi (Coimbatore chapter), said the city needs a central university and research centre and better connectivity. Coimbatore start-ups find it difficult to get venture capital and such facilities and the city is seeing more start-ups going to other cities.\n\nE.K. Ponnuswamy, president of Coimbatore District Small Industries Association, explained about its initiative to promote open source hardware and the two new industrial parks that the association is promoting here. The two parks will attract Rs. 2,500 crore investment, he said.\n\nTamilisai Soundararajan, State president of BJP, and Vanathi Srinivasan, vice-president BJP - Tamil Nadu, also spoke.\n\nAnmol Vij, co-founder and COO of ShopsUp, and Arunachalam Muruganantham, founder of Jayaashree Industries, spoke about their experience in setting up a start-up. D. Nandakumar, president of the Indian Chamber of Commerce and Industry – Coimbatore, welcomed the gathering.", 
    "section": "national", 
    "title": "Women urged to start new enterprises", 
    "subsection": "tamilnadu", 
    "date": "2016-02-22"
}