{
    "author": [], 
    "text": "Loongkoonan’s indigenous work, depicting bush tucker and medicine, is now being displayed overseas\n\nAustralian artist Loongkoonan only began painting aged about 95, little more than ten years on her works have electrified the indigenous art scene and are now being exhibited overseas.\n\nThe softly-spoken centenarian, who as an artist goes by one name, arrives at the Art Gallery of South Australia wearing a lightweight silver jacket over a bright blue floral dress, and a black bowler hat on her head.\n\nShe’s tired after the long journey from her community in remote Western Australia, but is nonetheless thrilled to see her canvasses on display as part of the prestigious Adelaide Biennial of Australian Art.\n\n“I’m really, really happy,” she says, in comments interpreted from her indigenous Nyikina language by her niece Annie Milgin. “And I’m really, really proud.”\n\nBorn around 1910, Ms. Loongkoonan has defied the statistics relating to Australia’s Aborigines who have, on average, a markedly shorter life expectancy than their fellow citizens and are the country’s most disadvantaged people. Diane Mossenson, whose gallery in Perth has shown her work, says Ms. Loongkoonan’s family attribute her good health in part to traditional remedies, adding that the artist’s eyesight has always been “brilliant”. “She doesn’t take any Western medicines at all except for perhaps a Panadol (painkiller) when she’s got a little bit of an ache or a pain,” she says. “It’s all bush medicine.” Throughout her long life, Ms. Loongkoonan has maintained her connection to her traditional culture and lifestyle, and today lives in the small community of Jarlmadangah in Australia’s far northwestern Kimberley region.\n\n“So how much of her life is spent doing things like fishing and hunting? She still does that,” explains Ms. Mossenson.\n\nMs. Loongkoonan’s life is written into her work — bright depictions of bush tucker (food), natural springs and other geographical features of the Australian Outback, working on cattle stations, and growing up alongside the Fitzroy River.\n\nAnd as an elder of the Nyikina people from the central western Kimberley region, she is the custodian of much traditional language and lore, and strives to impart her knowledge through her art.\n\nFrom the start, Ms. Loongkoonan’s style, which the artist has previously described as painting the landscape “the same way eagles see country when they are high up in the sky”, was distinctive and arresting. “When Loongkoonan’s first and early paintings came in, although they were rather raw and simple in a way by contrast to what’s currently on show, they still had an amazing graphic element to them and a really lovely energy,” says Ms. Mossenson.\n\n“That was just the way she chose to want to paint and portray her country.”\n\nMs. Loongkoonan’s works have recently had their first international exhibition at the Australian embassy in Washington, and Ms. Mossenson says they don’t always fit the norm of what is the expected style of Aboriginal painting, with some slow to recognise her work. “The puzzle for me as we’ve been representing has been these most amazingly beautiful works ... have been embraced by some people, but broadly within those that thought they knew everything about Aboriginal art there has been in some ways a slow recognition of her work,” she says.\n\nBut to her niece Annie Milgin, Ms. Loongkoonan’s works are not only beautiful.\n\n“She’s talking about bush medicine, and the bush tucker. And that’s what she learned from her mother and her father and her grandmothers,” she says.\n\nMs. Mossenson, who says Ms. Loongkoonan did not have children of her own but brought up many of her nieces and nephews, adds the artist is someone for whom painting keeps her healthy in mind, spirit and body, even though she is currently having a break. Asked if she feels strong when she is painting, Ms. Loongkoonan agrees, saying she would only stop if she felt “really, really sick”.\n\nIndigenous Australian art is considered the oldest ongoing tradition of art in the world, but it was not until the 1970s that it began to receive widespread recognition in the West. — AFP", 
    "section": "national", 
    "title": "Aboriginal painter, aged 105, electrifies art scene", 
    "subsection": "general", 
    "date": "2016-03-18"
}