{
    "author": [], 
    "text": "Baig has also been acquitted of the charge of forgery, forgery of valuable security and forgery for purpose of cheating.\n\nThe HC has only convicted him of the charges under Section 5 (b) (Punishment for making or possessing explosives under suspicious circumstances) of The Explosive Substances Act, which results in rigorous imprisonment that can extend up to 10 years and Section 474 (Having possession of document knowing it to be forged and intending to use it as genuine) of the IPC that provided imprisonment of seven years.\n\n“The court observed that the Prosecution has failed to establish that the bomb was manufactured/prepared/assembled by accused in Global Internet Café at Udgir. Other than asking his other attendants to leave, there is no evidence provided to the court. We are not convinced to even draw an inference.” Baig worked as the manager of this internet café in Latur district when he was arrested by the State Anti Terrorism Squad and convicted by a Pune anti-terror court in April 2013.\n\nThe HC in its judgment said, “There is no reason to believe that explosives recovered from the accused must have been used in commission of the offence of terrorist act. If such an interpretation is not assigned, the resultant inference would be omnibus in nature and a person found to be in possession of explosive substance unauthorisedly would be facing the risk of being involved in every blast triggered by means of similar explosives at different places in the country.” The court rejected applications made by two witnesses and a public interest litigation plea filed by AAP member Ashish Khetan, who conducted a sting operation on the witnesses, claiming that they were coerced to testify against Baig.\n\nThe Division Bench has directed that Baig be sent back to the Nagpur Central Jail from the Yerwada Jail where he was originally lodged.\n\nUnanswered, says Bench\n\nIn its 237-page judgment, the Bench observed:\n\n“The question remains unanswered as to where the bomb was prepared and how it was handed over to the planter. The facts presented by the prosecution are not consistent with the hypothesis of the guilt of the accused as regards the main charge relating to unlawful activities and terrorist acts. They are not of conclusive nature… “It is not possible to hold that in all human probability the acts must have been done by the accused. There was a vast gap between “may” and “must” and prosecution has failed to bridge this gap. One has to travel a long distance from “may” to reach up to the “must.” “The major circumstances the prosecution is relying upon — the nature of the accused, his mental aptitude, his approach towards life, his jehadi utterances, his conduct of moving with two cell phones, some forged documents — themselves do not establish the involvement of the accused.\n\n“In our view, the prosecution has only established that the prohibited explosive substance RDX was recovered from the accused. The question is whether mere recovery of RDX would connect him with further activities of preparing bomb and handing over the same to the other accused – Yasin Bhatkal. There is absolutely no evidence and merely on probabilities a guilt cannot be established.”", 
    "section": "national", 
    "title": "Baig’s death penalty quashed", 
    "subsection": "general", 
    "date": "2016-03-18"
}