{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The Delhi CM was opposing the construction of the SYL Canal with an eye on Punjab polls, says Haryana Minister.— File Photo: S. Subramanium\n\nAccusing Delhi Chief Minister and Aam Aadmi Party (AAP) convener Arvind Kejriwal of adopting anti-Haryana stance for political gains on the controversial issue of Sutlej Yamuna Link (SYL) canal, Haryana Agriculture and Irrigation Minister O.P. Dhankar on Thursday asked him to construct a separate canal to carry Delhi’s share of water.\n\nThe Delhi government replied to it by saying that in case of any such event forced upon Delhi, the government would approach the Supreme Court.\n\nMr. Dhankar, in a letter to Delhi Chief Minister, wrote: “In the wake of your stand, it will be difficult for Haryana to deliver Delhi’s share of water through its existing canal system. You should take up the trouble of constructing a separate canal from Nangal dam and Tajewala by your efforts to carry Delhi’s share of water to Delhi,” said the letter.\n\nMr. Kejriwal had earlier said that he was against the construction of the SYL canal as Punjab did not have surplus water to spare. Mr. Dhankar alleged that Mr. Kejriwal had opposed the proposed canal with an eye on political gains in Punjab ahead of the Assembly elections due in 2017.\n\nThe letter reads: “You must be aware that Haryana was allocated 3.5 MAF and Delhi 0.2 MAF of water from Ravi-Beas through Nangal dam. Haryana, through the Bhakra main line (Punjab) gets Delhi’s 0.2 MAF share of water and channelises it through Narwana Branch and Western Yamuna Canal systems to make it reach Delhi. And due to this, Haryana is not able to lift its share of 496 cusec of water.”\n\n“And you have opposed the SYL canal. It was through this canal, water for Haryana and Delhi would have come,” the letter said.\n\nReacting to the letter, Delhi’s Water Minister Kapil Mishra said: “The letter is a cheap tactic to divert the attention from the real issue of major law and order problem in Haryana. The BJP government in Haryana is not doing us a favour by supplying water to Delhi, they are obligated to do so. The Supreme Court is directly monitoring it.”\n\nHe said Haryana doesn’t share extra water and only the quantity of water ordered by the Supreme Court was released.\n\nNotably, last month, when the people of Haryana belonging to Jat community were agitating for reservation, the protesters had shut the gates of Munak Canal, which brings water to Delhi. As a result, seven of the Delhi Jal Board’s treatment plants were shut and supply to many parts of the Delhi were severely hit.", 
    "section": "national", 
    "title": "Build separate canal, Haryana tells Delhi", 
    "subsection": "general", 
    "date": "2016-03-18"
}