{
    "author": [
        "Devesh K"
    ], 
    "text": "The agency will probe over 5 lakh financial transactions of Kingfisher Airlines since 2004\n\nScope of investigation expanded to loans of over Rs.7,000 crore taken by Kingfisher Airlines from 17 banks\n\nThe Central Bureau of Investigation has decided to invoke the charge of cheating against businessman Vijay Mallya, Kingfisher Airlines and others in the alleged Rs.900-crore IDBI Bank loan wilful default case. The agency is also probing over 5 lakh financial transactions of the company since 2004.\n\nThe CBI had last July registered the case under Section 409 (criminal breach of trust) read with Section 120 B (criminal conspiracy) of the Indian Penal Code and other provisions of the Prevention of Corruption Act against unknown IDBI officials pertaining to abuse of office to allegedly extend favours to Mr. Mallya’s Kingfisher Airlines.\n\nThe Hindu had, on Tuesday, reported that Section 409 of the IPC, a stringent provision that prescribes a maximum of life sentence, does not come under the Prevention of Money Laundering Act, the law that empowers the Enforcement Directorate to attach the alleged proceeds of crime. Therefore, the Directorate was concerned that attaching assets in its money laundering case against Mr. Mallya would pose a challenge.\n\n“Apart from corruption, criminal conspiracy and breach of trust, cheating charges are also being pressed against the accused, given that they allegedly defrauded the bank of the loan amount,” said a senior CBI official, adding that the provisions are finalised at the time of filing the charge sheet.\n\nIndicating that the CBI knows the current whereabouts of Mr. Mallya, the official said the agency has expanded the scope of the probe to the loans of over Rs. 7,000 crore taken by Kingfisher Airlines from 17 banks.\n\nNone of the banks has, however, filed a complaint with the CBI seeking action.\n\n“The nature of transactions made by the company is so complex that funds flowing in from other banks and diverted to various accounts also need to be investigated. Over 5 lakh such transactions, 60 per cent of which pertain to outflow to, and inflow from, at least four countries are under scrutiny,” said the official.\n\nThe CBI has through various channels approached the authorities in the four countries seeking access to the details of transactions. The agency is treading cautiously in identifying the transactions pertaining to the IDBI Bank loan funds as the loan had been sanctioned for a wide range of purposes and, therefore, many of the transactions could be legal.", 
    "section": "national", 
    "title": "CBI to charge Vijay Mallya with cheating", 
    "subsection": "general", 
    "date": "2016-03-18"
}