{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The BJP has less to lose as it is not in power in any of the five States\n\nn the Assembly elections in Kerala, Assam, Tamil Nadu, West Bengal and Puducherry, the Congress has more at stake than the Bharatiya Janata Party.\n\nThe grand old party rules Assam — for an unbroken 15 years — and Kerala, where it heads the United Democratic Front. In sharp contrast,\n\nThe BJP has less to lose as it is not in power in any of the five States.\n\nIf the Congress retains power in Assam and Kerala, it will be a big boost for the party, as after its ignominious defeat in the 2014 general elections, the party rapidly lost in Haryana and Maharashtra as well, and was out for a duck in Delhi.\n\nThe only bright spot was in Bihar where it was part of the winning combine led by the Janata Dal(U) and the Rashtriya Janata Dal.\n\nThe BJP hopes to increase its footprint in Kerala, West Bengal, Tamil Nadu and Puducherry, and win Assam or, at least, emerge at the head of the charts.\n\nIt is banking on its performance in the State in the Lok Sabha elections, when it won seven of the 14 seats, securing a 36.5 per cent vote share, an increase of 19.29 per cent. The Congress lost just 4.31 per cent, sliding down to 29.6 per cent, but its seven seats shrank to three.\n\nIn Assam, the BJP has announced a chief ministerial candidate, Union Minister Sarbananda Sonowal, who was with the Asom Gana Parishad till 2011.\n\nEvidently, it has learnt from its error in Bihar, where it pinned its hopes on Prime Minister Narendra Modi’s charisma. If that is a plus, trouble is brewing in both the BJP and the AGP over the alliance the two parties have entered into. The BJP has, therefore, vowed to disenfranchise millions of Muslim immigrants to polarise the election campaign.\n\nThe Congress, meanwhile, has suffered several losses in Assam, including the departure of Chief Minister Tarun Gogoi’s brains trust, Himanta Biswa Sharma.\n\nIn Kerala, the Congress-led UDF and the CPI(M)-led Left Democratic Front (LDF) are locked in a direct contest, with the BJP working to make its first entry into the Assembly by poaching Hindu votes from both alliances, but particularly from the LDF.\n\nSimultaneously, the LDF and the UDF hope that the Congress-Left understanding in West Bengal — intended to confront Mamata Banerjee’s Trinamool Congress, currently in power in the State — will not adversely affect them in Kerala.\n\nThe BJP, as in Kerala, is a minor player in West Bengal but the Congress-Left understanding here provides it with a talking point in both States.\n\nThe Trinamool — a flag-bearer for West Bengal’s 30 per cent Muslim vote — is keen on polarising the election to ensure that the Left and the Congress do not eat into its minority support.\n\nThe BJP, meanwhile, has planned a soft Hindutva campaign here, highlighting the Trinamool government’s “appeasement” of Muslims. The Prime Minister visited the Gaudiya Math for its centenary celebrations in Kolkata on February 21 to send a message to Hindus in the State even as party cadres fanned out to reach out to the Ramakrishna Mission’s one-crore following in the State.\n\nIf the Congress retains power in Assam and Kerala, it will be a big boost for the party after its ignominious defeats in the Lok Sabha and Assembly elections", 
    "section": "national", 
    "title": "For the Congress, it’s a do-or-die battle", 
    "subsection": "general", 
    "date": "2016-03-18"
}