{
    "author": [], 
    "text": "PDP president Mehbooba Mufti on Thursday met BJP President Amit Shah amid rising speculation about government formation in Jammu and Kashmir but there was no clear indication whether they have made any headway.\n\nThe PDP, which toughened its stance after Mufti Mohammed Sayeed’s demise by seeking concrete plans for the State’s development before the coalition could be resumed, may latch on to Finance Minister Arun Jaitley’s statement in the Lok Sabha in which he promised speedy implementation of all the projects.\n\nThe PDP president, who was in the national capital to attend the budget session of Parliament, drove in a car without security for a meeting that lasted nearly 30 minutes.\n\nBoth the parties maintained silence on the meeting but sources in the know said it was part of the intense efforts being undertaken by the two parties before resuming the coalition.\n\nFormer Finance Minister Haseeb Drabu, who is considered one of the architects of the coalition worked during Sayeed’s time, is also understood to have been doing the ground work for bringing together PDP which has 27 MLAs and BJP’s 25 MLAs in the 87-member State Assembly.\n\nThe sources said consultations with some of the ministries have been undertaken and the State may soon witness the end of Governor’s rule which came into force from January 8 this year after Ms Mehbooba decided against taking over the reins after her father Mufti Mohammed Sayeed’s death.\n\nMr Jaitley had announced in Parliament earlier this week that the Centre will speedily implement all the projects announced as part of special package to Jammu and Kashmir.\n\n“Prime Minister has announced special package for J&K. We want that the three regions of the J&K are developed very fast,” Mr Jaitley said in reply to debate on Budget in the Lok Sabha on Monday.\n\nMs Mehbooba had said last month that before taking a call on continuing the alliance, she wants to “reassess” whether the Narendra Modi government would take substantive steps within a ‘set time-frame’ to address the “core” political and economic issues of the State. -= PTI", 
    "section": "national", 
    "title": "Mehbooba meets Amit Shah", 
    "subsection": "general", 
    "date": "2016-03-18"
}