{
    "author": [], 
    "text": "Prime Minister Narendra Modi is among the most influential people on the Internet, TIME magazine said, describing the Indian leader as an “Internet star” who often uses social media to “conduct diplomacy.”\n\nThe magazine cited Mr. Modi’s unconventional announcement on Twitter of his visit to Pakistan last year while naming him among ‘The 30 Most Influential People on the Internet’ for the second year in a row in this year’s unranked list.\n\nThe list includes U.S. Presidential hopeful Donald Trump, reality TV star Kim Kardashian and her husband Kayne West, author J.K. Rowling, former Olympic athlete Caitlyn Jenner and soccer star Cristiano Ronaldo.\n\nThe magazine noted that Mr. Trump is “redefining how political candidates use social media, for better and for worse.” Despite facing flak for his often insulting tweets and comments online, Mr. Trump has almost 7 million followers on Twitter, more than any other presidential candidate including Hillary Clinton, it said.\n\nFor its second annual roundup of the most influential people on the Internet, TIME said it looked at the contenders’ global impact on social media and their overall ability to drive news.\n\nOn Mr. Modi, TIME said the leader of the world’s largest democracy is also an “Internet star”, boasting more than 18 million Twitter followers and over 32 million Facebook likes. It also cited Mr. Modi’s use of social media to break news and conduct diplomacy.\n\n“And unlike some of his contemporaries, he often uses social media to break news and conduct diplomacy. On Christmas Day, for example, Modi tweeted that he would visit the Pakistani city of Lahore to wish Nawaz Sharif, the leader of India’s chief regional rival, a happy 66th birthday,” it said. — PTI", 
    "section": "national", 
    "title": "Modi again on TIME’s ‘influential on Internet’ list", 
    "subsection": "general", 
    "date": "2016-03-18"
}