{
    "author": [
        "National Bureau"
    ], 
    "text": "The mystery over the 10 Pakistani terrorists, who purportedly sneaked into Gujarat on the eve of Shivratri earlier this month, has deepened, with most sections of the security establishment distancing themselves from the claims of a senior Home Ministry official that three of them were gunned down somewhere in western India.\n\nThe alert about terrorists entering India reportedly came from the newly opened line of communication between the National Security Advisers of the two countries. Though the claims about the killing of three terrorists came while Parliament was in session and on the eve of the meeting between the Foreign Ministers of both countries in Nepal, the government has not yet issued any official statement.\n\nA senior Gujarat bureaucrat told The Hindu on Thursday that they were clueless about the claims, even as the four teams of NSG commandos that were rushed to the State in the wake of the alert have been withdrawn.\n\n‘We are confused’\n\nThe PMO is probing how details of the alleged encounter emerged in the media. The Home Ministry, however, has not yet denied the claims of one of its seniormost officials made repeatedly over two days about the encounter.\n\n“We are totally flummoxed at the MHA claim, which we learnt only through the media. We have been requesting the MHA and other agencies to throw some light on the matter if it has happened in Gujarat,” a senior Gujarat bureaucrat said.\n\nThe terror alert from Pakistan had its origins in early March. In the first week of March, a BSF patrol team in Sir Creek area reported that 10 Pakistani men were seen on a fishing boat. When the team spotted them, they abandoned the boat and ran away into Pakistani territory.\n\nA day or two after the BSF input, came the call from Pakistan National Security Adviser Nasir Khan Janjua to his Indian counterpart Ajit Doval that 10 terrorists had entered Gujarat to carry out sensational terror attacks.\n\nHowever, it is still unclear if there was any correlation between the BSF patrol team’s claim and Mr. Janjua’s alert. The alert triggered a heightened security response with the Gujarat police cancelling the leave of all its personnel, NSG commandos taking position in Ahmedabad and around the Somnath temple, where all government sponsored cultural programmes for Mahashivratri were cancelled.\n\nEarlier this week, on two consecutive days, a senior Home Ministry official informally claimed that three of the 10 terrorists had been neutralised somewhere in western India. As the news spread, and questions arose about the veracity of the claims, most in the security establishment distanced themselves from the claims. However, the Home Ministry has not yet denied it.\n\nMeanwhile, the Centre has withdrawn the four NSG teams that were rushed to Gujarat after the high alert regarding a possible strike on the Somnath temple.", 
    "section": "national", 
    "title": "Mystery over terror alert, encounter deepens", 
    "subsection": "general", 
    "date": "2016-03-18"
}