{
    "author": [], 
    "text": "The Shiv Sena today took on AIMIM leader Asaduddin Owaisi for his refusal to chant “Bharat Mata Ki Jai” and sought revocation of citizenship and voting rights of those who refuse to chant the slogan even as authorities in Uttar Pradesh denied permission to him to hold two events.\n\nAs the row over Owaisi’s recent remark in Latur escalated, the Sena also sought to know from ally BJP leader and Maharashtra Chief Minister Devendra Fadnavis how Owaisi was allowed to leave the state after “insulting” the country.\n\nIn a vitriolic editorial in party mouthpiece ‘Saamana’, the Sena said, “Hardik Patel had by mistake disrespected the national flag and he was tried for sedition and is still in jail. Has Asaduddin Owaisi not committed treason as well by insulting mother India? The citizenship and voting rights of all those who do not chant ‘Bharat Mata ki Jai’ should be revoked.”\n\n“There is a BJP Chief Minister in the state. He has to answer how was Owaisi allowed to leave Latur after insulting the country,” it said.\n\nThe Muslim community has remained “backward” due to the ideas propagated by people like Owaisi, the Sena said hitting out at the AIMIM leader.\n\nHowever, MPCC spokesman Al—Nasser Zakaria alleged that the Sena is only indulging in politics of hypocrisy.\n\n“They (the Sena) should understand that they will be taken seriously, even by their own ally (BJP) after they come clean themselves. Merely chanting slogans won’t make them nationalists,” Zakaria said.\n\nIn Uttar Pradesh, Owaisi’s programme in Lucknow on Thursday was cancelled after he was denied permission by the district administration to hold a meeting on grounds of “law and order situation” in the state. An angry AIMIM slammed the SP government’s decision to deny permission, saying it was “afraid” of Owaisi it had “done nothing” for the minorities.\n\nOwaisi was denied permission by the district administration to hold a meeting in Lucknow on grounds of “law and order situation” in the State. - PTI", 
    "section": "national", 
    "title": "Owaisi faces Sena flak, denied permission for UP events", 
    "subsection": "general", 
    "date": "2016-03-18"
}