{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "Deafening cheers for India’s arch-rival at Bangladesh match surprises one and all\n\nThe match between Bangladesh and Pakistan witnessed overwhelming support for Pakistan at the Eden Gardens here on Wednesday evening, for the first time in the post-Independence history of nearly 70 years.\n\nThe support surprised many, including Pakistani cricketers and even police officials. Nearly 40,000 people assembled to watch the ‘Super 10’ match in the ICC World T-20 in the Eden and the support for Pakistan was “overwhelming,” cricket correspondents of Bangladesh and some spectators said.\n\nAzad Majumdar, Sports Editor of one of the leading papers of Bangladesh New Age , told The Hindu that he “never expected” such support for Pakistan.\n\n“Eleven Bengalis were playing in the Eden Gardens only two days before the India-Pakistan match. We all thought that the entire support would go to Bangladesh as the defeat of Pakistan would have demoralised them before a match with India. More importantly [we expected the support] as Bangladesh was playing in the Eden Gardens after 26 years,” Mr. Majumdar said.\n\n“But what we witnessed shocked us. It was only about 1,500 Bangladeshi supporters who supported Bangladesh and the entire local crowd backed Pakistan,” said Mr. Majumdar, also the AFP correspondent in Bangladesh.\n\nThe event has surprised British-Bangladeshi Sabir Mustafa, who is holidaying in Kolkata, and went to the Eden Gardens to watch the match. “Seventy per cent of the support was for Pakistan. I thought it would be other way round in Eden,” said Mr. Mustafa.\n\n“Both teams were getting support from the locals, but every time Pakistani batsmen hit a boundary the cheers were deafening, while the cheers for Bangladesh were a bit muted,” he said. The support, in fact, surprised Pakistan cricketers as well. Former skipper Mohammad Hafeez said at the post-match press conference that the support was “unbelievable.”\n\n“Never expected to hear Pakistan jitega [Pakistan will win] in Kolkata. It was unbelievable,” Hafeez said.", 
    "section": "national", 
    "title": "Pakistan draws cheer at Eden Gardens", 
    "subsection": "general", 
    "date": "2016-03-18"
}