{
    "author": [], 
    "text": "Although Defence Minister Manohar Parrikar had said in January that Pakistani nationals would not be given access to the high-security installation, several officials including the Air Force Chief Arup Raha have said since then that they would have no objection if the government cleared the visit. Sources told The Hindu a final call would be taken by the Prime Minister’s Office, as the Pakistani team is likely to comprise officials from the ISI and the Military Intelligence.\n\nOfficials at the Indian High Commission in Islamabad also confirmed that while the decision to facilitate visas for the Pakistani team had been taken, the Pakistan government is yet to inform them of the list of team members for clearances.\n\n“As we said last month, it will take at least 5-6 days to clear the names of the JIT. Now that a date for their visit has been decided, we hope they will forward the names at the earliest,” an official said. The Joint Investigation Team constituted by Prime Minister Nawaz Sharif on January 13 included officials from the police from Punjab and Khyber Pakhtunkhwa, the Intelligence Bureau, the Federal Investigation Agency (FIA), the Military Intelligence (MI) and the Inter-Services Intelligence (ISI), and the team to visit India is likely to have the same composition.\n\nThe meeting between Ms. Swaraj and Mr. Sharif’s Foreign Affairs Adviser, was held on the sidelines of the SAARC ministerial meeting in the resort town of Pokhara, and marked the first face-to-face meeting between the Indian and Pakistan government ever since the January 2 terror strike by suspected Jaish-e-Mohammad militants on the Air Force base in Pathankot.\n\nIt also comes two weeks before a possible meeting between Prime Minister Modi and Mr. Sharif in Washington, where they will both attend the Nuclear Security Summit.\n\nWhile not confirming a “structured meeting,” Mr. Aziz told reporters that he was “hopeful” of a bilateral meeting between the two Prime Ministers. Ms. Swaraj also accepted an invitation for Prime Minister Modi to attend the SAARC Summit to be held in Pakistan on November 9-10 this year.", 
    "section": "national", 
    "title": "Pathankot probe: Pak. team to visit India on March 27", 
    "subsection": "general", 
    "date": "2016-03-18"
}