{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Sonia Gandhi initiates probe to find out why party MLAs backed BJP, NCP, Sena\n\nThe Congress high command on Thursday could not explain the rationale behind its Maharashtra legislators supporting the MLAs of the BJP, the Shiv Sena and the NCP, who demanded in the Assembly the suspension of Waris Pathan, a Muslim member of the All India Majlis-E-Ittehadul Muslimeen (AIMIM), who refused to say “Bharat Mata Ki Jai” on Wednesday.\n\nSources said Congress president Sonia Gandhi has initiated an internal inquiry to find out what prompted the Congress MLAs to endorse the motion of the BJP, the NCP and the Shiv Sena legislators seeking Mr. Pathan’s ouster.\n\nThe move has left the senior leadership at an odd spot as it is unsure whether to support the move or to speak against it. The Maharashtra Congress president, Ashok Chavan, distanced himself from the motion, saying since he is not a member of the Assembly, “he has no idea about what transpired there.”\n\nMr. Chavan, in fact, criticised the BJP, the NCP and the Sena for “using the slogan as a political tool.”\n\n“No one has a problem with saying ‘Bharat Mata Ki Jai’ but I think it becomes problematic when the RSS and the BJP impose it on others to score political points,” he said.\n\nThough Mr. Chavan denied receiving any communication from the senior leadership, he said the party would try and understand why its MLAs chose to toe the rival parties’ political line.\n\nThe chairman of the party’s minority cell, Khurshid Ahmed Saiyed, said he would discuss the issue with the senior leadership but, in the same breath, downplayed the incident, giving a vague explanation. “Jai Hind is the most patriotic slogan. The Congress has been saying Jai Hind from 1925; it was the favourite slogan of Subas Chandra Bose but ‘Bharat Mata Ki Jai’ is the slogan of RSS. We don’t like the way they (RSS) are trying to use it against us.”\n\nThe worst by Congress MLAs came when BJP leader Eknath Khadse sought an apology from Mr. Pathan to end the matter. They shouted down Mr. Khadse and demanded Mr. Pathan’s suspension. Their cry was backed by the NCP, BJP and Sena leaders.\n\nRevoke citizenship: Sena\n\nMumbai Special Correspondent reports:\n\nSlamming AIMIM leader Asaduddin Owaisi for his refusal to chant ‘Bharat Mata ki Jai’, the Shiv Sena on Thursday called for revoking the citizenship and voting rights of those who refuse to chant the slogan, and supported Mr. Pathan’s suspension from the Maharashtra Assembly.\n\n“Hardik Patel has been arrested for unintentional disrespect to the national tricolour and is still in jail on charges of sedition. Hasn’t Asaduddin Owaisi committed treason by insulting Mother India?” asked an editorial in Sena mouthpiece Saamna .", 
    "section": "national", 
    "title": "Pathan’s suspension puts Cong. in fix", 
    "subsection": "general", 
    "date": "2016-03-18"
}