{
    "author": [], 
    "text": "Sanjoy Hazarika , author of Strangers of the Mist, Rites of Passage and Writing on the Wall , has been an astute observer of the Northeast in general and Assam in particular for over two decades. Currently Director of Jamia Millia Islamia’s Centre for North East Studies and Policy Research and Honorary Research Professor at the Centre for Policy Research, the journalist-turned-academic fields questions from Abdus Salam as campaigning for the two-phase Assembly elections in Assam gradually shifts into top gear. Excerpts:\n\nIs the Assam election a Tarun Gogoi vs Narendra Modi face-off, as the three-time Chief Minister is projecting it to be, or are local issues going to be the key determinant?\n\nPrime Minister Narendra Modi isn’t even campaigning, so much as Mr. Gogoi would want to project it as a face-off, local issues will take precedence. The BJP has realised that a national government cannot fight a local election.\n\nThe BJP is betting big on “illegal Bangladeshi immigration” as a poll plank. How real is the threat? Or is it a bogey that gets resurrected in the run-up to every election in the State?\n\nIllegal immigration as an “issue” has been around since 1979. There is a reality to the migration, but we cannot denounce people who are from a different community, speak a different tongue and have been around for a hundred years. The newer generation hasn’t learnt to distinguish between old and new settlers — the 1985 tripartite agreement, to which the All Assam Students’ Union was a signatory, has fixed 1971 as the cut-off year; so the issue is settled. A rhetoric of fear and suspicion should be avoided, more so because the Central government has gone the extra mile to bring Bangladesh on board, be it on the land boundary, better connectivity, Internet gateways or in handing over Ulfa [United Liberation Front of Asom] and NDFB [National Democratic Front of Bodoland] militants.\n\nThe Asom Gana Parishad is seen as a declining force, while the All India United Democratic Front has emerged as a significant player in recent years. Going forward, do you see space for regional parties, or are we moving towards a bipolar polity in Assam?\n\nThe AGP has signed its own death warrant by tying up with the BJP — it will lose out on whatever pockets of support it had among the minorities. The AIUDF is more of a religious-language-ethnic combination. But going forward, regional parties and community-based outfits will retain their pockets of influence.\n\nIrrespective of the outcome, what is Mr. Gogoi’s legacy as Assam’s longest-serving Chief Minister?\n\nHe has run the State for 15 years, managing coalitions at a time when it was difficult, and has certainly delivered on many aspects. But overall, it’s spotty — there is widespread poverty, people still move out of the State for jobs and opportunities, the farm sector is languishing …\n\nHow would the Assam verdict resonate nationally, given simultaneous elections in three other States and those in Punjab and the big one — Uttar Pradesh polls — next year?\n\nIt might resonate in a few States, but won’t resonate nationally. The issues specific to Assam do not exist in other States.\n\nIn a sense, everybody is a great minority in Assam if you dice it in terms of ethnicity, language, religion.\n\nIn a sense, everybody is a great minority in Assam if you dice it in terms of ethnicity, language, religion", 
    "section": "national", 
    "title": "Rhetoric of fear and suspicion should be avoided", 
    "subsection": "general", 
    "date": "2016-03-18"
}