{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A day before he was due to appear before the Enforcement Directorate, businessman Vijay Mallya on Thursday sought additional time to respond to the summons issued by the agency last week.\n\nMr. Mallya was booked by the ED earlier this month under the Prevention of Money Laundering Act (PMLA).\n\nLast week, the ED had issued a summons asking him to appear for questioning on March 18.\n\nThe agency has consistently been questioning two of his former employees — A Raghunathan, former Chief Financial Officer of Kingfisher Airlines, and Ravi Nedungadi, CFO of the United Breweries group.\n\nOfficials said Mr. Mallya had communicated to the ED that he would be unable to appear for questioning on Friday and that he needed time till at least early April to respond to the agency’s summons.\n\nA source said the matter was discussed at length at a meeting of top ED officials in the agency’s Mumbai office on Thursday.\n\nMeanwhile, Mr. Raghunathan and Mr. Nedungadi were questioned for the fourth time since the registration of the case against Mr. Mallya, in which Mr Raghunathan has also been named as an accused. Some officials with the IDBI bank also visited the ED office on Thursday and the investigating team questioned them as well, said sources.\n\nThe ED is primarily looking into a loan of Rs 900 crore that the IDBI bank had granted to Kingfisher Airlines at a time when its credit rating was poor.\n\nThe ED has, over the last one week, quizzed several IDBI officials to find out the exact procedures that have to be followed while granting a loan to any company, and inquiries are currently under way with Mr Raghunathan, Mr. Nedungadi and IDBI officials to find out if these procedures were followed when the loan in question was sanctioned.\n\nThe other part of the ED’s inquiries focuses on the trail of the loan amount after it was paid to Kingfisher Airlines.\n\nMallya has been booked under the Prevention of Money Laundering Act", 
    "section": "national", 
    "title": "Seeks time till April to appear before ED", 
    "subsection": "general", 
    "date": "2016-03-18"
}