{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "Small parties have set high ambitions and are challenging the Dravidian behemoths in this election in Tamil Nadu. Among the claimants is a four-party alliance, the People's Welfare Front, comprising the MDMK, the two Left parties and the VCK, a Dalit party, whose leaders are seen launching the front's website recently. Other contenders include the DMDK, the PMK and the BJP.Photo: M. Prabhu\n\nIn the run-up to the Assembly elections in Tamil Nadu, veteran leader and Dravida Munnetra Kazhagam (DMK) president M. Karunanidhi displayed uncharacteristic eagerness to rope in the Desiya Murpoku Dravida Kazhagam (DMDK) headed by actor Vijayakant, as an ally. He ignored repeated taunts by Mr. Vijayakant’s wife, Premalatha, dubbing the DMK as a “corrupt” party and waited in vain for the alliance to fructify.\n\nLikewise, All India Anna Dravida Munnetra Kazhagam (AIADMK) leader and Chief Minister Jayalalithaa held unusual direct alliance talks with representative of seven parties, most of them outfits not recognised by the Election Commission.\n\nThe apparent political climb-down exposed their dependence on allies for tilting the balance of votes in their favour. Also, this time, smaller regional parties are not willing to play second fiddle to them.\n\nIt is rather strange that the Dravidian parties have never contested in all 234 Assembly constituencies, despite not having faced any serious competition from a third player, in the past 49 years.\n\nOnly in 1977, a year when the AIADMK led by M.G. Ramachandran formed the government, the DMK had fielded candidates in 230 constituencies and won in 48. While 44 candidates forfeited their deposits, the party’s vote share in the seats it contested stood at 25.26 per cent. Its independent vote share in Tamil Nadu has since never been tested.\n\nIn the very next Assembly elections in 1980, the DMK aligned with the Congress and tried its luck in 112 constituencies, which remains its lowest share of seats in any alliance since 1967.\n\nThe largest number of seats the AIADMK contested was in its debut election when it fielded 200 candidates.\n\nWhile the Congress and other parties with a limited geographical or community reach rode piggybank on either of the Dravidian parties, the two largest parties too were dependent on minor allies to edge out the other in successive Assembly elections.\n\nUntil 1996, only the Congress, the Janata Party (briefly), the Tamil Maanila Congress (in its earlier avatar) or the two Left parties were considered worthy allies. But Ms. Jayalalithaa first recognised the cumulative usefulness of smaller regional parties, whose voter base was limited but not insignificant. During the 1998 Lok Sabha polls, pushed to the wall after a rout in 1996, she stitched up a winning alliance with the PMK, the MDMK and the BJP, which was until then politically untouchable in the State.\n\nThe victory helped the smaller parties convert their spoilsport value into political capital to shift allegiances alternatively to either of the Dravidian parties and bag some potentially winnable seats. For the Dravidian parties, the small percentage of vote transfer from these parties helped win certain do-or-die battles.\n\nIn 1991, the PMK fielded 194 candidates and cornered a total vote share (of total votes polled) of 5.89 per cent and a contested vote share of 7 per cent.\n\nOnly one candidate won. In contrast, in 2001, when it allied with the AIADMK, 20 of its 27 candidates won and its vote share in seats contested dramatically rose to 46.82 per cent, thanks to the transfer of the AIADMK’s votes. The AIADMK went on to form the government.", 
    "section": "national", 
    "title": "Smaller parties flex muscles in T.N.", 
    "subsection": "general", 
    "date": "2016-03-18"
}