{
    "author": [], 
    "text": "Wearable device AutoDietary can help people monitor their food intake\n\nThe device that helps you track the calories you take in.— Photo: University of Buffalo\n\nResearchers have developed a high-tech, food-tracking necklace that will alert you about the unique sounds that foods make as you bite, grind and swallow them.\n\nEach food as it’s chewed has its own unique sound and the device can help people suffering from diabetes, obesity, bowel disorders and other ailments by enabling them to better monitor their food intake and improve how they manage their conditions.\n\n“There is no shortage of wearable devices that tell us how many calories we burn but creating a device that reliably measures caloric intake isn’t so easy,” said Wenyao Xu, assistant professor of computer science at University at Buffalo. Mr. Xu is creating a library that catalogues the unique sounds that foods make as we eat.\n\nThe library is part of a software package that supports “AutoDietary”, a necklace being developed by Mr. Xu and researchers at Northeastern University in China.\n\n“AutoDietary” is like Fitbit and other wearable devices. Only instead of tracking burned calories, it monitors caloric intake — in other words, what we eat — at the neck. AutoDietary wraps around the back of the neck like a choker necklace.\n\nA tiny high-fidelity microphone — about the size of a zipper pull — records the sounds made during mastication and as the food is swallowed. That data is sent to a smartphone via Bluetooth where food types are recognised.\n\nThe study, published in the IEEE Sensors Journal , describes how 12 participants ages 13 to 49 were given water and six types of food: apples, carrots, potato chips, cookies, peanuts and walnuts.\n\n“AutoDietary” was able to accurately identify the correct food and drink 85 per cent of the time. Mr. Xu plans future studies to build upon his library by testing different foods and recording the sounds they make.\n\nHe also plans to refine the algorithms used to differentiate the foods to improve AutoDietary’s ability to recognise what’s being eaten.\n\nWhile promising, a wearable necklace that measures sound has limitations when used alone. For example, it cannot differentiate similar foods such as frosted corn flakes and regular corn flakes. It also can’t distinguish the ingredients of complex foods such as soup or chilli.\n\nTo address these limitations, Mr. Xu is planning a biomonitoring device which would complement AutoDietary. The device is under development but it would be activated once the necklace recognises that the user is eating a general category of food. — IANS", 
    "section": "national", 
    "title": "This necklace hears what you munch", 
    "subsection": "general", 
    "date": "2016-03-18"
}