{
    "author": [
        "K A"
    ], 
    "text": "An initiative in Kongappadam near Palakkad has boosted the morale of not just children but also parents\n\nAn initiative in Kongappadam, near Palakkad has boosted the morale of not just children but also parents. Picture shows a class in progress— Photo: K. K. Mustafah\n\nIt was a chance visit by Qatar-based professional C.D. Sajith Kumar to his alma mater, Nair Service Society College of Engineering, Akathethara, near here, four years ago to attend a reunion that set off a set of changes in the adjacent Dalit colony, Kongappadam.\n\nThough not far away from the hustle and bustle of Palakkad town, Kongappadam, with 230 people from 32 families, remained extremely backward, especially in education, till recently.\n\n“Only three persons from the colony had attended high school in over 60 years owing to discrimination and neglectNothing happened in the colony in the two decades since I left the college — it remained frozen in a time warp,” recalls Sajith Kumar, who started an educational initiative using the facilities of a single room anganwadi.\n\nThe result has been overwhelming. Sajith’s efforts brought many an educationist, teacher, and subject expert to Kongappadam. In three years, a dozen colony students passed school final with flying colours and joined higher education.\n\nFour are now preparing for medical and engineering entrance exams. “I am determined that at least one student from the colony should join the engineering course at the institution close to the hamlet. That will be a major step towards ensuring social justice,” said Sajith.\n\nTitled Ente Kongappadam, the initiative has won the appreciation of the government and socio-educational initiatives. “What is remarkable is the project is not just about running a tuition centre. It is aimed at boosting the morale of not just students, but their parents too ,” said tribal social activist Dhanya Raman.", 
    "section": "national", 
    "title": "A new dawn for Dalit students", 
    "subsection": "general", 
    "date": "2016-01-10"
}