{
    "author": [
        "Ramya Kannan"
    ], 
    "text": "Gavi, the Vaccine Alliance, to spend $ 500 mn between 2016 and 2021\n\nIndia’s immunisation programme, in dire need of expanding the number of vaccines on the list, will receive a boost with Gavi the Vaccine Alliance pledging to spend up to $ 500 million between 2016 and 2021.\n\nThe overnment of India and Gavi, the Vaccine Alliance, was announced earlier this week in Delhi, after a meeting between Prime Minister Narendra Modi and Seth Berkley, CEO, Gavi.\n\nIn addition to introducing new vaccines into the schedule, the idea is also to reach the unreached and increase access to vaccines for millions of children in India.\n\nUnder the new partnership strategy, Gavi will allocate the $ 500 million in two tranches — $ 100 million to support the country’s current immunisation programme and enhance reach, and $ 400 million for country-wide introduction of new vaccines for diarrhoea and pneumonia, cervical cancer, and Rubella with measles.\n\nIndia is due to begin transitioning away from Gavi support from 2017 and is expected to begin fully self-financing all its vaccine programmes by 2021, according to sources at Gavi.\n\n“India has a huge birth cohort of about 27 million. While historically India has been slow in introducing new vaccines, over the last few years, we have seen a definite speeding up of the programmes. Also, with the polio immunisation programme, India has proved that it is possible to reach every child,” Dr. Berkley said, speaking to The Hindu of his great optimism from the partnership.\n\nHe also lauded the Prime Minister and the Health Minister for taking the initiative.\n\n“The Gavi team will create a joint action plan with the government, marking out specific milestones and timelines, and providing targeted release of funds. There will also be an active communication programme to take the message of vaccination to people and explain the benefits of the new vaccine,” Dr. Berkley explained.\n\nGavi procures 60 per cent of its vaccines from Indian manufacturers. It is hoped that through the partnership, Gavi and the Government of India will work more closely together.\n\nThe idea is to reach the unreached and increase access to vaccines for children", 
    "section": "national", 
    "title": "Boost for immunisation drive in India", 
    "subsection": "general", 
    "date": "2016-01-10"
}