{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "‘An expert is not a witness of fact and his evidence is of an advisory character’\n\nAs many as 32 of the total101 witnesses turnedhostile during the trial ofthe Jessica Lal murder case.\n\nDistinguishing between the status of an expert witness in a criminal trial from a witness of fact, the Supreme Court quashed a perjury case instituted against a forensic expert in the sensational murder of model Jessica Lal in 1999 in New Delhi.\n\nJessica was shot dead while working as a celebrity bartender at a socialite party in upscale Tamarind Court restaurant. The police recovered two .22 empty cartridges from the crime scene, but the weapon used was never recovered. Investigation pointed to the involvement of Manu Sharma, son of influential Haryana politician Venod Sharma, who was refused a drink by the victim.\n\nBut Manu Sharma and nine other accused were acquitted by a Delhi sessions court. The Delhi High Court overturned the acquittal and convicted all the accused in December 2006 and the Supreme Court, on appeal, upheld the conviction.\n\nHowever, the High Court had started suo motu perjury proceedings against 32 of a total 101 witnesses who turned hostile in the trial. The forensic expert, Prem Sagar Manocha, who was deputy director at the State Forensic Science Laboratory, was one of the 32.\n\nMr. Manocha was sent the two empty cartridges for his expert opinion as to whether they were fired from the same pistol. In his report to the trial court, he said no definite opinion could be formed without examining the weapon they were fired from.\n\nHowever, during the examination, on the court’s insistence, Mr. Manocha testified that the cartridges appear to have been fired from two guns. On cross-examination in the court, he said they appeared to have been fired from two guns but a definite opinion could only be formed after examination of the weapon concerned. Following this, he was declared a hostile witness.\n\nBench criticises HC\n\nIn their judgment quashing the High Court-ordered perjury case against Mr. Manocha, a Bench of Chief Justice of India T.S. Thakur and Justice Kurian Joseph castigated the High Court’s decision to start perjury proceedings against the forensic expert.\n\n“An expert is not a witness of fact and his evidence is really of an advisory character. The duty of an expert witness is to furnish the judge with the necessary scientific criteria for testing the accuracy of the conclusions,” Justice Kurian wrote the verdict for the Bench.\n\nBased on the opinion of the expert, the judge has to form an independent judgment, the verdict said.\n\nIt said Mr. Manocha gave a non-specific and indefinite opinion only on the insistence of the trial court.\n\n“Merely because an expert has tendered an opinion while also furnishing the basis of the opinion and that too without being conclusive and definite, it cannot be said that he has committed perjury so as to help somebody,” Justice Kurian observed.", 
    "section": "national", 
    "title": "Case against forensic expert in Jessica case quashed", 
    "subsection": "general", 
    "date": "2016-01-10"
}