{
    "author": [], 
    "text": "In the two-hour interaction at the Taj Mahal Hotel in South Mumbai, Mr. Jaitley said that in most countries, there was a mechanism for certifying films and documentaries, but it had to be ensured that artistic creativity and freedom did not get curtailed.\n\nSpeaking to The Hindu later, Mr. Benegal said the meeting was a preliminary one, held by the Ministry to brief the committee about revamping the censorship guidelines, and the working of the CBFC. “The government wants us to study and look at all the problems regarding the censor Board. Over the years, generations change, entertainment ideas change, and the censor guidelines need to be in tune with these changes. So, guidelines need to be looked at, administering the institution needs to be looked at,” he said. Minister of State for I&B Rajyavardhan Rathore and I&B Secretary Sunil Arora were present at the meeting, along with all six members of the committee, including Mr. Benegal, film-maker Rakyesh Omprakash Mehra, advertising guru Piyush Pandey, film journalist Bhawana Somaiyaa, NFDC Managing Director Nina Lath Gupta and Joint Secretary, Films, Sanjay Murthy.\n\nTwo-month deadline\n\nMr. Benegal said the committee had been given a timeframe of two months to study different aspects, and take suggestions from all stakeholders. “The government wants us to study and look at all the problems regarding Censor Board … The government is guided by social considerations and there are two stakeholders here — those that make films, exhibit and distribute them, and those who watch films. The Ministry has already communicated with the film-making stakeholders, inviting their specific suggestions. Our committee needs to meet and decide ways and means of engaging with the film audiences who come from diverse socio-economic and cultural backgrounds,” Mr. Benegal said.\n\n“Completing our task within two months is going to be tough, but what needs to be constantly stressed is that it [CBFC] is not a censoring board, it is a certification board. There is a need to move towards a new system of grading films in terms of age, maturity, sensibility and sensitivity without the application of scissors,” he said.", 
    "section": "national", 
    "title": "Censor guidelines should be non-discretionary, says Jaitley", 
    "subsection": "general", 
    "date": "2016-01-10"
}