{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Buoyed by the results of the Bihar polls, party to adopt same strategy in Assam, Punjab and U.P.\n\nPleased with the performance of its women candidates in the Bihar elections, the Congress high command has decided to field more women in the upcoming Assembly elections in Assam, Punjab and Uttar Pradesh.\n\nShobha Oza, president of All India Mahila Congress, told The Hindu that party president Sonia Gandhi and vice-president Rahul Gandhi had always been strong supporters of fielding more women as candidates in Assembly elections across the country, but “patriarchal” attitudes persistent in the party had prevented them from doing so. But the success of women candidates in the recently concluded Bihar elections, Ms. Oza said, has changed that perception.\n\n“We are working right from the local body level to find out potential women candidates,” she said. “We learned in Bihar that women are able to cut through identity politics and connect with the masses on governance issues.”\n\nIn Bihar, the Congress fielded five women candidates out of its total share of 43 seats. Four candidates emerged victorious; one of them, Amita Bhushan, defeated a male BJP candidate in Begusarai by 17,000 votes.\n\nMs. Oza said political parties largely fielded women candidates in those areas where the chances of winning were bleak. But Ms. Bhushan’s victory was evidence enough that women could mobilise support amid a lot of second guessing emanating even from the parties they represent.\n\nSpeaking to The Hindu , Ms. Bhushan said she had done enough “homework” to swing the voter sentiment in her favour.\n\n“I extensively travelled in my constituency and educated people about the welfare policies of the state and Central government,” she said. “I did not talk about caste or religion.”\n\nThe Congress recently performed well in the Gujarat civic polls. Ms. Oza said that taking a cue from Bihar, the party had increased women’s participation to 65 per cent in 36 seats in the State.\n\n“There are more women corporators then men in Baroda,” she said adding that the party had rolled out more funds to emulate the Bihar model when it comes to fielding candidates. “Women candidates are able to defeat the culture of goondaism in politics,” Ms. Oza said. “You will see more women winning elections,” she said.", 
    "section": "national", 
    "title": "Cong. to field more women in polls", 
    "subsection": "general", 
    "date": "2016-01-10"
}