{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Jana Sangh founder Syama Prasad Mookerjee — held in high regard in BJP circles — had tried to “combat” the Quit India Movement of 1942, says a booklet released by the Communist Party of India (Marxist).\n\nSix booklets “exposing” the past and present of the RSS and its allied organisations have been written in English and are being translated into Indian languages by the party’s State committees.\n\nThese booklets will be disseminated among the common people as part of the party’s bid to mount a challenge to the Sangh.\n\n‘It’s exploiting beliefs’\n\nEach booklet has an introduction by party leader Brinda Karat that says: “The RSS appeals to the lowest denominator in human behaviour in inciting violence against ‘the other’. In doing so, it seeks to exploit religious feelings and utilises traditions and beliefs based on social and gender inequalities that still influence a substantial section of our people.”\n\nOne of the booklets quotes Mookerjee, then Finance Minister in the “Bengal government headed by a member of the Muslim League Fazlul Haq,” making a “proposal” to the Bengal governor instead of resigning on August 9, 1942, as the Quit India Movement was launched.\n\n“The question is how to combat this movement [Quit India] in Bengal? The administration of the province should be carried on in such a manner that in spite of the best efforts of the Congress, this movement will fail to take root in the province … Indians have to trust the British, not for the sake of Britain, not for any advantage that the British might gain, but for the maintenance of the defence and freedom of the province itself,” it quotes Mookerjee as saying.\n\n‘Vajpayee turned approver’\n\nThe booklet says that while Hindutva ideologue V.D. Savarkar had appealed to the British for mercy from the cellular jail in the Andamans, former Prime Minister Atal Bihari Vajpayee had turned “approver” during the Quit India Movement, “leading to the arrest of some freedom fighters”, reviving decade-old controversies.\n\nIt also cites extracts of second RSS chief M.S. Golwalkar’s writings in We — Or Our Nationhood Defined : “… the foreign races in Hindustan must either adopt the Hindu culture and language, must learn to respect and hold in reverence Hindu religion… and must lose their separate existence to merge in the Hindu race, or may stay in the country, wholly subordinated to the Hindu nation…”\n\nOne booklet seeks to link this to the killing of Mohammad Akhlaq in Dadri in 2015. “The act of the murder of a Muslim accused of cow slaughter through a manufactured rumour is to send a message to the community,” the booklet says.", 
    "section": "national", 
    "title": "CPI(M) booklets target RSS", 
    "subsection": "general", 
    "date": "2016-01-10"
}