{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Bench asks trial court judges not to buckle under pressure by the accused\n\nIn a word of caution for trial court judges, the Supreme Court has said they should stand their ground rather than buckle under pressure exerted by the accused to transfer criminal cases at the drop of a hat.\n\n“He [the trial judge] is required under law to do his duty and not succumb to the pressure put by the accused. He is not expected to show unnecessary sensitivity ... If this can be the foundation to transfer a case, it will bring anarchy,” the Supreme Court observed in a judgment.\n\n“Unscrupulous litigants will indulge themselves in court haunting,” the judgment delivered by a Bench of Justices Dipak Misra and Prafulla C. Pant said on Friday.\n\nThis verdict assumes significance amidst public debate on whether courts were soft on celebrities accused of serious criminal offences.\n\nConstant pressure\n\nThe verdict authored by Justice Dipak Misra explains how “lower judicial officers mostly work under a charged atmosphere and are constantly under a psychological pressure ... They do not have the benefit of a detached atmosphere of the higher courts to think coolly and decide patiently,” the judgment observed.\n\nThe verdict came on a challenge against a Gujarat High Court order to transfer a criminal case after the accused in a riots case at Kheda district complained that he overheard the informant in the case telling his son in a parking lot that conviction is for sure in the case.\n\nThe accused person had then gone on to co-relate this conversation with certain remarks made by the judge in court to reach the conclusion that the latter was biased.\n\nJustice Misra noted that the apprehension of the accused was merely based on a conversation he seemed to have overheard and a belief that the “trial judge is a convicting judge.”\n\n‘Request must be reasonable’\n\nAcknowledging that a person accused in a criminal case is prone to be “hyper-sensitive” and usually in a dilemma about his fate, the Supreme Court said such apprehensions should not be imaginary, based on conjectures and surmises. The request for change of court and apprehension of judicial bias should be grounded in reasonableness, Justice Misra held.\n\n‘Mere allegation won't do’\n\n“It is one of the principles of the administration of justice that justice should not only be done but it should be seen to be done. However, a mere allegation that there is apprehension that justice will not be done in a given case does not suffice,” the judgment held, directing the sessions court to complete trial in six months.\n\nTrial court judge must not yield to pressure by the accused, says Supreme Court", 
    "section": "national", 
    "title": "‘Don’t transfer criminal cases at the drop of a hat’", 
    "subsection": "general", 
    "date": "2016-01-10"
}