{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Both countries want to conclude the deal ahead of French President Francois Hollande's India visit on January 26.— PHOTO: AFP\n\nFrench Defence Minister Jean-Yves Le Drian is scheduled to visit India shortly to oversee the conclusion of the inter-governmental agreement for direct purchase of 36 Rafale fighter jets and clear the path for signing the final agreement.\n\nInformed sources said Mr. Drian was visiting India specifically for the Rafale deal and was likely to be in Delhi on January 18.\n\nAs reported by The Hindu earlier, both sides are working to conclude the deal ahead of French President Fancois Hollande’s visit to India as the chief guest for the Republic Day parade on January 26.\n\n“The deal was announced at the highest level politically; so both sides want to make sure it is adhered to,” officials said earlier.\n\nDefence Minister Manohar Parrikar said recently that the deal was “in the final stages of price negotiations” and issues such as the 50 per cent offset clause have “almost been sorted out”.\n\nPrime Minister Narendra Modi, during his visit to Paris last April, had announced the direct purchase of 36 Rafale fighter aircraft from France through a government-to-government deal as quickly as possible in view of the “critical operational necessity” of the Air Force, sidestepping the original medium multi-role combat aircraft (MMRCA) contest.\n\nHowever, negotiations by a high-powered committee set up to reach the terms and conditions of the deal and recommend a draft agreement hit a road block because of differences, especially over offsets and price.\n\nThe offset clause applies for defence deals over Rs. 300 crore under which companies are to invest 30 per cent of the value of the contract back in the country. For the MMRCA deal, the government had fixed it at 50 per cent.\n\nIn addition, the Air Force wanted some structural changes on the aircraft.", 
    "section": "national", 
    "title": "French Minister to carry Rafale brief", 
    "subsection": "general", 
    "date": "2016-01-10"
}