{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "Song, dance and live painting in oil and soft pastels marked the flagging off of Swaraksha, a caravan campaign supported by the United States Consulate, here on Saturday.\n\nThe caravan, aimed at raising awareness on human trafficking, will travel through 53 districts of Telangana, Andhra Pradesh and Odisha, reaching out to 13.2 crore people.\n\nOf the 11 members riding the caravan, six are those who were rescued and rehabilitated from trafficking rings in the past. Survivors, artists and performers are expected to conduct group discussions, social meets, documentary screenings and puppet shows as part of the participatory community awareness drive.\n\nThe undivided Andhra Pradesh contributes the second largest share in human trafficking network in India.\n\nThe caravan has the support of the State and Union governments, legal, paralegal and police wings. Its launch, which sprung out of collaboration between the U.S. Consulate in Hyderabad and Prajwala, an NGO that has been working in rescuing and rehabilitating survivors of sex crimes and trafficking, was launched this month coinciding with the U.S. National Slavery and Human Trafficking prevention month. “The campaign will focus not just on women and children, but also include awareness drive among men and boys,” Sunitha Krishnan, founder-director of Prajwala said.\n\n“We will not be silent as people from all walks of life are trafficked every day. The U.S. is committed to be the world leader in the global movement to end this abhorrent practice. We hope that perpetrators are brought to justice and all survivors get their right to live a life of freedom and dignity,” said Michael Mullins, Consul-General, U.S Consulate General, Hyderabad,.\n\nWhile the caravan will end by May, similar campaigns will be used to spread awareness across the country in the years to come, said Sarada Ali Khan, Joint Secretary, Women and Child Development.\n\nThe initiative to raise awareness on human trafficking is supported by the U.S. Consulate", 
    "section": "national", 
    "title": "Message on wheels to travel across Telangana, A.P. & Odisha", 
    "subsection": "general", 
    "date": "2016-01-10"
}