{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After several State governments resisted the Union government’s ordinance and Bill proposing amendments to the Land Acquisition Act, 2013, NITI Aayog has taken up with the States a proposal for unlocking the value of farmland through leasing.\n\nOn Friday, an expert group, headed by T. Haque, former Chairman of the Commission for Agricultural Costs and Prices, held consultations with officials from various States on a model land leasing law that NITI Aayog will prepare for the States to use for reforming land lease provisions.\n\nRepresentatives of farmers’ organisations and non-governmental organisations attended the meeting.\n\nThe organisations and individuals unanimously supported a model law, which should help the tenant and protect the landowner’s right, an official statement said.\n\nThe majority opinion was that the law should be restricted to agriculture and should not encourage corporate farming.\n\nThe measure is among the reforms NITI Aayog is taking up with the States on the subjects under the State and Concurrent Lists of the Constitution.\n\nPrime Minister Narendra Modi, chairman of NITI Aayog, will hold further consultations with the States at the National Conference on Sustainable Agriculture and Farmers’ Welfare in Gangtok on January 17 and 18.\n\nLand bank\n\nA land bank held by a public agency is being considered in which interested landowners could deposit their land parcels for cultivators to lease land. Under this system, the public agency acts as an intermediary and transfers rent from the actual cultivator to owner while charging a small fee to cover its costs. This is expected to permit the consolidation of operational landholdings, given the steadily declining size of and fragmentation of farmland holdings in the country.\n\n“The biggest advantage of a liberalised and secure land lease market will be that it will ease the exit of those farmers who find farming unattractive or non-viable and economically strengthen those farmers who want to stay in the farming and raise the scale of operational holdings,” NITI Aayog Vice-Chairman Arvind Panagariya recently wrote in a blog on its website.\n\nSuch a market offers solution to several problems of Indian agriculture such as consolidation of operational holdings, fallow land, access to institutional credit, and productive use of land belonging to farmers unwilling to engage in farming, he said.\n\nWritten documentation\n\nThe consultation agreed to the need for written documentation of lease agreements, which could be recognised by the banking and credit institutions and honoured by the States in extending relief to tenant or lessee in case of natural calamities.\n\nIt was also discussed that the model Act should also explicitly provide provision for a dispute redress mechanism.\n\nProductive land has been found to be left uncultivated as the existing land leasing laws make it risky to lease land.", 
    "section": "national", 
    "title": "NITI Aayog plans model lease law", 
    "subsection": "general", 
    "date": "2016-01-10"
}