{
    "author": [], 
    "text": "Sushma Swaraj invites diaspora to participate in India’s growth story\n\nExternal Affairs Minister Sushma Swaraj addressing the media on the Pravasi BharatiyaDiwas in New Delhi on Saturday. Priti Patel, MoS for Employment, United Kingdom, is at right.— Photo : R. V. Moorthy\n\nThe government is considering giving Aadhaar cards to non-resident Indians and a decision on it will be taken soon, External Affairs Minister Sushma Swaraj said here on Saturday while inviting the diaspora community to actively participate in India’s growth story.\n\nIn her address to the first limited edition of Pravasi Bhartiya Divas, Ms. Swaraj said it had been decided that women workers would be allowed to go to Gulf countries for employment only through the government agencies to ensure they were not duped by recruiting agents or firms.\n\nThe PBD, webcast by almost all Indian Missions and Posts, was organised for the first time by the Ministry of External Affairs (MEA) after the government’s decision to merge Ministry of Overseas Indian Affairs (MOIA) with it.\n\nEarlier the MOIA used to host the event. January 9 was chosen as the day for PBD as it was on this day in 1915 that Mahatma Gandhi, the “greatest Pravasi,” returned home from South Africa to lead India’s freedom struggle.\n\nAsking the diaspora to participate in government’s various flagship programmes including the Skill India, the Digital India and the Clean Ganga initiatives, she said Prime Minister Narendra Modi wanted the Aadhaar card scheme to be extended to the NRIs.\n\n“So far, Aadhaar card has been given to those Indians who live in India. It is not for non-resident Indians. But you will be happy to know that the Prime Minister wants the card to be given to the NRIs the way it is issued to people living in India.”\n\n“He even wants it for OCI (Overseas Citizens of India card) holders. The matter is under our consideration. No decision has been taken as discussions on it are underway. I hope soon you will hear about it,” Ms. Swaraj said during an interaction after her address.\n\nThe government has so far issued Aadhaar cards to over 92 crore citizens. Under the programme, every citizen is to be provided with a 12-digit unique identification number for which biometric information is collected.\n\n‘Time to come back’\n\nCalling upon the diaspora to be part of the India growth story, the Minister said: “It is time for you to come back to India.”\n\nEffusive in praise of the Prime Minister, Ms. Swaraj said India’s engagement with the overseas Indians had increased manifold because of his constant endeavour to reach out to the community. She also referred to Mr. Modi’s Madison Square address in the U.S. and at the Wembly in London.\n\n“Your achievements in the countries of your adoption are a matter of pride... It is our responsibility to protect you and take care of you. Indeed, we are you and you are us,” the Minister said. — PTI", 
    "section": "national", 
    "title": "NRIs likely to get Aadhaar number", 
    "subsection": "general", 
    "date": "2016-01-10"
}