{
    "author": [
        "Jatin Anand"
    ], 
    "text": "Passengers thronging a metro station in New Delhi after the odd-even traffic scheme was implemented by the Delhi government.— Photo: Sushil Kumar Verma\n\nDelhi Transport Minister Gopal Rai on Saturday trashed reports that the Aam Aadmi Party (AAP) government intended to extend its odd-even car rationing experiment beyond the January 15 deadline announced prior to rolling it out.\n\nAt a press conference here, Mr. Rai also cleared the air in relation to what he termed “confusion” about its “illegal imposition” by the government stating that it fell well within the jurisdiction of Section 115 of the Motor Vehicle (MV) Act.\n\nSimilar provisions of the Act had been utilised by the then Congress-led Delhi government for creation of an exclusive lane meant for Commonwealth Games traffic in 2010.\n\n“The government is neither going to extend the scheme beyond January 15 nor rescind it before January 15 as was announced earlier,” Mr. Rai said, adding that media reports hinting the opposite were “false.”\n\nSpeaking to The Hindu later in the day, the Transport Minister said the government would stick to its guns on the matter as pollution and enforcement-related data generated over the implementation of the experiment a little over a fortnight would form the core of anti-pollution measures to be taken by the AAP government in the future.\n\n“Data related to both pollution and congestion is very encouraging. We will use this to shape future policies related to reducing both in the coming days after a meticulous analysis of the same,” he said.\n\n5,893 challans\n\nMr. Rai had, during the day, presided over a meeting of the Coordination Committee for the initiative held at his Civil Lines residence following which he also released data stating that from January 1 to January 8, enforcement teams consisting of the traffic police in addition to the transport and revenue departments had issued 5,893 challans for violation of its various regulations.", 
    "section": "national", 
    "title": "Odd-even scheme only till January 15", 
    "subsection": "general", 
    "date": "2016-01-10"
}