{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "With tensions continuing between India and Pakistan over the Pathankot terror attack, Foreign Secretary S. Jaishankar will travel to Male and Colombo from January 11 to 14, raising a bigger question over whether he will travel to Islamabad on January 15.\n\nDiplomatic sources told The Hindu that while the talks in Sri Lanka and the Maldives had been in the offing for some time, they had been held off pending the Pakistan talks.\n\n“With the talks in Islamabad being clouded until there is action on the ground from the Pakistan government, it was decided to go ahead with these other visits independently,” an official said.\n\nIn Islamabad, Mr. Jaishankar’s counterpart, Aizaz Ahmed Chaudhry, sounded an uncertain note on Saturday, in stark contrast to comments made by the government in Parliament a day earlier.\n\n“We are not in a position to say anything about the Foreign Secretary-level talks at this moment,” Mr. Chaudhry told the Aaj TV channel in Pakistan.\n\nOn Friday, Pakistan Prime Minister’s Adviser on Foreign Affairs Sartaj Aziz told the National Assembly that Mr. Jaishankar and Mr. Chaudhry would meet on January 15 in Islamabad “as scheduled” to lay the framework of the Comprehensive Bilateral Dialogue (CBD) that had been decided during the December 8-9 visit by External Affairs Minister Sushma Swaraj to Islamabad. Diplomatic sources, however, maintained that Pakistan’s steps in response to India’s requests have not been encouraging, especially after a background briefing given by officials in Islamabad who told the Pakistani media that evidence provided by India “was not enough”.\n\nSources, however, said that the Foreign Secretary’s visit to Maldives and Sri Lanka did not “rule out” his visit to Islamabad.", 
    "section": "national", 
    "title": "Uncertainty over Jaishankar’s Pak. visit", 
    "subsection": "general", 
    "date": "2016-01-10"
}