{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "RJD chief launches veiled attack on coalition partner, as Opposition criticises law and order\n\nIt is for the first time that Lalu Prasad has pointed fingers directly at the Nitish government’s functioning and lack of concern for the people of Bihar.—File photo\n\nLaunching a veiled attack on his coalition partner Nitish Kumar, Rashtriya Janata Dal chief Lalu Prasad has once again hit the headlines. He asked the Chief Minister when the people of Bihar will get clean tap water for drinking.\n\nAddressing a function here on Friday, the RJD chief referred to the Nitish government’s ongoing cleanliness programme in the State, and pointed out: “One day I asked Nitish Kumar when people who voted us to power will get clean water, tap water?.” “The hand-pumps have become defunct and don’t work well in the State… the problem of non-availability of safe drinking water continues.”\n\nIt was for the first time that Mr. Prasad has pointed fingers directly at the government’s functioning and lack of concern towards people of the State. Earlier in the day, he had expressed differences with Mr. Nitish Kumar on the Prime Minister’s recent Pakistan visit and the Pathankot terrorist attack. Some time ago, he embarrassed the Nitish Kumar government saying that the law and order situation in the State was not good as the police had become lunj-punj (slack). Later, he reportedly invited the JD(U)’s ire when he conducted a surprise inspection of Indira Gandhi Institute of Medical Sciences, where he gave instruction to the authorities and later to his Health Minister-son Tej Pratap Yadav.\n\n“Recently I rang up the superintendent of Patna Medical College and Hospital to keep every equipment ... oxygen mask and other things in the emergency ward in ready order,” said Mr. Prasad at a function organised at Patna’s A.N. Sinha Institute on Friday.\n\nThe Opposition BJP took a swipe at Mr. Prasad’s statement in an oblique reference to his alliance partner. “Since the beginning, we’ve been saying Nitish Kumar is Chief Minister but Lalu is super CM… actually he is running the government,” alleged senior BJP leader Prem Kumar.", 
    "section": "national", 
    "title": "‘When will people get clean tap water?’", 
    "subsection": "general", 
    "date": "2016-01-10"
}