{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "In yet another instance of man-elephant conflict, five persons and a tusker were killed in the Bardhaman district in south Bengal in the past two days.\n\nSenior forest officers said they were attempting to rescue a male elephant that had strayed into human habitation along with the tusker from the forests of Bankura district. According to latest reports, the male elephant had entered the Nadia district.\n\n“We tried to tranquillise the tusker. It had strayed into muddy rice fields. Though we arranged for vehicles to bring the animal to the main road, it died after the tranquilisation,” a senior forest official told The Hindu .\n\nA herd of elephants had strayed into Bardhaman from adjoining Bankura district on Saturday night. The tusker accompanied by another elephant started moving through the paddy fields of Bardhaman, considered the rice bowl of West Bengal.\n\nA 19-year-old boy was the first to be attacked by the pachyderm. He sustained major injuries and was being treated at a government hospital. The elephant then attacked and killed two persons, identified as Annakali Roy (62) and Narayan Majhi (69), in Bhatar. From there, the jumbos moved to Manteshwar, killing two more persons, Prakash Goria (45) and Suraj Seth (38).\n\nAt the Denur village, forest officials attempted to tranquillise the animal. Locals said that after several hours, with the help of chains, vehicles and huge belts, the elephant was driven away from the paddy fields. However, forest officials said the tusker had succumbed to the tranquiliser darts by then, adding that it was later buried in a forest in Kaksa.\n\nAnother herd of elephants killed a farmer, Anil Bagdi (64), in the early hours of Monday in Kashpur area of the district, taking the total toll to five.\n\nMajor concern\n\nMan-elephant conflict has emerged as a major concern in south Bengal where small patches of forests are surrounded by large farmlands. Elephants from the Dalma Forest range often migrate to south Bengal from Jharkhand and due to the fragmented nature of forests, the pachyderms often stray into human habitations.\n\nOver the past 10 years, at least 240 persons and more than 50 elephants have died in the forests of south Bengal.", 
    "section": "national", 
    "title": "5 persons, tusker killed in Bengal in 2 days", 
    "subsection": "general", 
    "date": "2016-03-22"
}