{
    "author": [
        "Abdus Salam"
    ], 
    "text": "In 2005, a former student union leader-turned-politician became an “Assamese hero” when his dogged campaign to contest the legality of the Illegal Migrants (Determination by Tribunal) Act, 1983, finally paid off with the Supreme Act striking down the legislation; Sarbananda Sonowal, the leader in question, was at the time Dibrugarh MP of the Asom Gana Parishad.\n\nThe setting aside of the Act sparked deep insecurity among the Bengali-speaking Muslim population in the State, overwhelmingly poor, illiterate agriculturalists and itinerant labourers. It was in that climate of fear of persecution that Maulana Badruddin Ajmal floated his United Democratic Front, later renamed the All India United Democratic Front (AIUDF).\n\nIt took just six months for the party to register its presence, winning 10 seats in the 2006 Assembly elections. Another five years and it became the principal Opposition party in the 126-member Assembly in the next round of State elections with 18 seats. As the ‘Modi wave’ swept India — and Assam — in the 2014 general election, the AIUDF stood firm, winning three of the 14 Lok Sabha constituencies.\n\nThe party went on to offer unsolicited support of its three MPs to the Narendra Modi government, but this isn’t as perplexing as it seems. The AIUDF’s ideological opponent and rallying point might be the Bharatiya Janata Party (BJP) but its principal opponent on the ground is the Congress, with which its interests overlap.\n\nThe AIUDF’s gains over the years have primarily been at the cost of the Congress, which had historically monopolised the Muslim votes, and especially the Bengali Muslim votes, in the State. It secured 39 per cent of the Muslim votes in the 2014 parliamentary polls while the Congress’s share dropped to 40 per cent. An adversarial stance vis-à-vis the BJP is only mutually beneficial, the polarising rhetoric of one feeding into that of the other and shrinking the (Congress) middle ground.\n\nStrongholds\n\nThe AIUDF’s strongholds are Lower Assam, the Barak Valley, and pockets in the Bodoland Territorial Areas Districts — or areas with a heavy minority presence. Since inception, Mr. Ajmal, MP from Dhubri, has tried to enlist the support of other communities, including the tea tribes. His contingent of 10 MLAs in its 2006 electoral debut included a tribal and an SC; Radheshyam Biswas is one of its three current MPs; and its working president is Aditya Langthasa, a Dimasa tribal. The recent effort to prop up a secular “grand alliance” including Janata Dal (United) and the RJD, Bihar-based parties with a negligible presence in Assam, and the plan to get Babulal Marandi of the Jharkhand Vikas Morcha to campaign for the party in Upper Assam is an effort to broadbase AIUDF’s supporter profile.\n\nSuch efforts have, however, delivered limited success for the AIUDF, and it is to its core vote base that the party will look to yet again as it puts up 60 candidates.\n\nIn an eerie replay of 2005, Mr. Sonowal, now the BJP’s chief ministerial candidate, and Mr. Ajmal are yet again principal protagonists tapping into the fear of illegal immigration and state persecution respectively. And if Mr. Sonowal doesn’t emerge as king on results day, May 19, the man all set to play kingmaker is Mr. Ajmal.\n\nAjmal's party\n\nate into Congress' share of Muslim votes in the 2014 parliamentary polls", 
    "section": "national", 
    "title": "A kingmaker in the making", 
    "subsection": "general", 
    "date": "2016-03-22"
}