{
    "author": [
        "National Bureau"
    ], 
    "text": "869 personnel have died at Siachen glacier between 1984 and December 2015\n\nAfter a massive five-day rescue operation, the Army recovered the body of a civilian porter who fell into a crevasse at Siachen.\n\nUnpredictable and difficult weather is quickly becoming one of the key reasons behind Indian Army’s worrying casualty count, as yet another avalanche claimed a soldier’s life along the treacherous border with Pakistan.\n\nThe latest tragedy comes just weeks after 10 soldiers were buried under snow after their camp in northern Siachen glacier was hit by a major avalanche in February. While one of them, Lance Naik Hanamanthappa Koppad, was miraculously pulled out alive six days after the tragedy, he died a few days later. On February 27, a civilian porter with the Army fell into a deep crevasse in the Siachen glacier and died.\n\n“We should be ready for more such tragedies,” a senior Army officer posted in the region said, pointing out the increasing unpredictability of weather in the higher reaches because of global warming and climate change is something that is “more the norm than the exception.”\n\nAfter almost two days of a gruelling rescue operation, the Army was able to locate the body of Sepoy Vijay Kumar K in the Kargil heights, buried under 12 feet of snow. Another soldier was rescued a day earlier. The avalanche that buried Vijay Kumar was caused by a mild earthquake.\n\nThe death of the soldier is the latest in a series of tragedies to strike Army units deployed along forward areas of the India-Pakistan border, especially on the higher reaches.\n\nNowhere is the challenge of freak weather starker than in Siachen. According to a government statement before Parliament, 869 Indian troops have died at the glacier between 1984 and December 2015. After this, in 2016, the 10 soldiers were buried under an avalanche, just days after three others were also killed in Siachen.\n\nHowever, freak weather in the higher reaches, not militancy, is the single largest killer of Indian soldiers.\n\nAccording to Army statistics, around 300 soldiers are killed a year in road accidents. About 100 soldiers also commit suicide a year. Since 2010, over 500 soldiers have committed suicide.\n\nLast year, a total of 155 security personnel were killed in terrorist operations; of them a significant number were paramilitary and police forces.", 
    "section": "national", 
    "title": "Army now battles a new enemy: freak weather", 
    "subsection": "general", 
    "date": "2016-03-22"
}