{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Work in progress to douse the fire at the Deonar landfill area in Mumbai on Monday.— Photo: Mukesh Trivedi\n\nThe Brihanmumbai Municipal Corporation (BMC) has decided to impose prohibitory orders in areas around the Deonar dumping ground following fears that the raging fire at the waste site could have been a case of sabotage.\n\nExpressing his fear that the fire at Deonar is a result of sabotage, Municipal Commissioner Ajoy Mehta on Monday said the process for initiating prohibitory orders under Section 144 to regulate law and order would be started at the earliest, even if it meant regulating rag-pickers and free movement of residents in and around the waste site.\n\nTerming it a “serious” issue, Environment Minister Prakash Javadekar on Monday said that a two-member special team would be sent to investigate the incident. Mr. Javadekar, who held a telephonic conversation with the Commissioner of Mumbai on the issue, blamed the fire on the “callousness” of the contractors in charge of managing the dump yard and said action would be taken against the violators.\n\nHowever, Mr. Mehta said so far there was no concrete case for taking any action against the contractor. “We want to send out a strong message that a waste yard cannot be treated as a free moving thoroughfare by anyone. We fear sabotage and have registered a case with the local police in this regard,” he said.\n\nThe fire at Deonar started again over the weekend, engulfing the residential areas in the vicinity under a thick cloud of smoke and smog. The corporation said the fire started on Sunday and was doused with the help of water cooling and fire safety measures this morning. The corporation has deployed 70 fire men, four fire engines at the site.\n\nThe corporation, Mr. Mehta said, had taken a slew of measures around the dumping ground, where the fire has been intermittently raging for days now. The BMC has also used the services of experts from the Indian Institute of Technology (IIT), who have suggested in their report to flatter out mountains of garbage at the site.\n\nWhite Paper sought\n\nShiv Sena corporator Avkash Jadhav on Monday wrote to Municipal Commissioner Ajoy Mehta demanding a White Paper on the dumping grounds in Mumbai. He also wanted a special investigation team to carry out an inquiry to fix accountability for the negligence.\n\nIn his letter, Mr. Jadhav pointed out that the allocation for solid waste management in the municipal budget has been growing over the years, and Rs. 2,852 crore is the allocation for 2016-17. But, there is no visible development in the process of management.\n\nTwo-member team to investigate the incident, says Prakash Javadekar", 
    "section": "national", 
    "title": "BMC says Deonar dump site fire could be act of sabotage, to impose ban orders", 
    "subsection": "general", 
    "date": "2016-03-22"
}