{
    "author": [], 
    "text": "In Nigeria, where poverty is endemic, this provides people an escape from the daily grind\n\nTwo rams head butt each other as the referee and marshals look on during a ram fighting competition held at the National Stadium in Lagos, Nigeria, on Sunday.— Photo: AFP\n\nChampion ram King of Oils shows no visible signs of stress before his semi-final fight at the National Stadium in Lagos.\n\nThe amber eyes of the snow-white ram barely register the raucous crowd 50 metres away but his outward tranquillity belies a tenacity deep within.\n\nThree and a half years ago, Dayo Folami bought King of Oils for less than 50,000 naira (Rs. 16,714). Yet today the 39-year-old businessman says the ram is “priceless.”\n\n“I’ve won a lot of money with the power he has,” Folami, wearing a white T-shirt and dark jeans, told AFP at Sunday’s event. “He doesn’t give up.”\n\nWhat motivates King of Oils to dominate in the ring is a mystery, said Folami. “There is no winning secret of rams, you can never force them to fight.”\n\nIt is exactly that innate will to battle that distinguishes ram fighting from other animal sports, Folami said. With eight weight categories and referees, the Ram Lovers Association of Nigeria (RLAM) is working to bring ram fighting into the mainstream by enforcing a strict set of rules to ensure ram safety and fair play.\n\n“We brought in rules and regulations of different weight categories, just like in boxing,” RLAM member Basheer “Bash” Agusto said. “People expect to see fairness.”\n\nAgusto, the 68-year-old owner of champion ram Little Tiger — who competes in H, the lightest category — said the rams are “just like any other athlete.”\n\nOnce identified as a fighter “you make sure he’s not lacking,” Agusto explained, recommending to “give him vitamins and clean between the hooves.”\n\nAgusto, his silver hair in a short mohawk and a thin gold chain necklace, said ram fighting is an escape from daily life in Nigeria, where poverty is endemic despite massive oil wealth. “They can't go to the polo club or golf club, never mind the boat club, so here they have an outlet to look forward to.”\n\nIntimidating names\n\nHundreds of people gathered under a blazing sun to watch the rams fight on a sandy pitch, fenced off with orange and blue rope.\n\nVendors sold popcorn and suya — a salty, spicy grilled meat served with red onions and tomatoes — while contortionists in striped outfits of mustard yellow and lime green performed in front of VIPs sitting in the shade under white tents.\n\nSome rams are named after historic warriors (Attila the Hun, Spartacus), while others after devastating diseases (Ebola, Malaria).\n\nThe Nigerian ram fighting rules state that at the start of a tournament rams are allowed to hit 30 “blows” before the referee calls a tie. By the finals, rams can headbutt up to 100 times.\n\nBut sometimes the fight never takes place at all, with unwilling rams high-tailing it to the safety of their owners amid laughs and jeers from the crowd.\n\nAt stake is a plethora of official prizes ranging from cars to kitchen appliances. More lucrative, however, is the gambling on the sidelines where men bet tens of thousands of naira on rams. “After football, this is what brings people together,” said ram judging assistant Segun Odulate. “If you come here you won’t think anything more, you’ll concentrate on the rams and you’ll be happy.” — AFP", 
    "section": "national", 
    "title": "Champion rams fight for cash and glory", 
    "subsection": "general", 
    "date": "2016-03-22"
}