{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "While some Muslim groups feel their ghettoism has reduced under Mamata Banerjee's rule, others blame her for the rise of the Hindu right in West Bengal.— file photo: pti\n\nWest Bengal, Kerala and Assam are among the States with the highest concentration of India’s largest minority. This factor reflects in the polity and elections\n\nnyone wishing to be a pan-Bengal leader will have to acknowledge that Muslim votes determine — to a large extent — which party leads the State.\n\nAn extensive study on the Muslims of India by late Prof. Iqbal Ansari, later taken forward in West Bengal by Sabir Ahamed of Pratichi Institute, shows that 46 out of the 294 Assembly constituencies of the State have a Muslim “concentration” of more than 50 per cent. The figure is 40-50 per cent in about 16 seats, and 30-40 per cent in 33 seats. The data underscores that in exactly one-third of the seats, Muslim vote is the key factor to win an election. Moreover, in another 50 seats, the concentration is 20-30 per cent. Overlooking such data was possibly one of the reasons for the defeat of the Left Front in 2011.\n\n“Statements against unauthorised madrasas, making a large section of farmers — many of whom are Muslims — feel insecure, and half-baked reports about the recommendations of the Justice Sachar Committee are three reasons why Muslims deserted us,” said Anindya Ghosh Dastidar, a popular CPI(M) leader, soon after the 2011 debacle.\n\nTrinamool Congress leader Mamata Banerjee joined the BJP-led National Democratic Alliance in 1999. It adversely affected her party and it took her more than a decade to acquire and consolidate her minority base. Ms. Banerjee started wooing the Muslims in a way Bengal has not witnessed for many decades.\n\nShe gave an allowance to Imams and muezzins, covered her head and attended prayers, mixed Arabic words with Bengali in public meetings and even inducted men who practise right-wing politics in the name of minority rights. Additionally, she cultivated the relatively small but influential big city-based Urdu-speaking Muslims. The 2006 Cabinet of the Left had five Muslim Ministers out of 44. While four were Bengali-speaking, only one was Urdu-speaking. But in the TMC’s Cabinet, three are Urdu-speaking, while two are Bengalis, notes Sabir Ahamed.\n\nIn 2014, she managed to score handsomely in the Muslim-dominated districts of south Bengal. In Birbhum district which has a 37 per cent Muslim population, the TMC led in nine out of 11 Assembly segments in the 2014 Lok Sabha elections. In South 24 Paraganas, with 35.5 per cent Muslim votes, the TMC led in 29 out of 31. The party was ahead of others in 72 of 81 segments in both north and south Bengal’s five districts with a Muslim population of over 25 per cent.\n\nJama’at e Islami-Hind (JIH), a cadre-based Islamic socio-political organisation in West Bengal, believes that Muslims have benefited during the TMC rule. JIH’s media and public relations chief Masihur Rahman claims that the number of Muslim students clearing West Bengal Civil Services is “much higher than it was in earlier years.”\n\n“Secondly, Aaliah University, started during Left’s rule, was given a grant of Rs. 300 crore and many hostels for Muslim girls were constructed in the districts,” said Mr. Rahman. While opposing the monthly allowance given to the Imams or muezzins, Mr. Rahman said ghettoism among Muslims has “marginally reduced” in many parts during TMC’s rule.\n\nOn the other hand, the recent study by Pratichi Institute of Amartya Sen and other organisations have also indicated, on basis of a survey done in 2011-12, that the Left Front has failed on many counts to address the basic needs of the Muslims in Bengal.\n\nCommunity’s opposition\n\nHowever, there is a counterview within the Muslim community too. A section of Bengal’s Muslims believe that the Trinamool has facilitated the rise of the Hindu right wing in the State.\n\nThe Bengal chapter president of the All India Muslim Majlis-e-Mushrawat, Abdul Aziz, said: “The TMC has no inner party democracy. Ms. Banerjee decides everything. She is a capitalist and history has taught us that the relationship between capitalism and communalism runs deep.”\n\nMany among Muslims believe Ms. Banerjee may have unwittingly created space for the rise of the Hindu right, a phenomenon that has led to a sharp polarisation of votes on communal lines in the Basirhat South by-election in 2014, in which the BJP won its first seat in the Assembly.\n\nThe Congress has already made this polarisation-driven voting an issue in its stronghold in central Bengal’s two districts — Malda and Murshidabad. Congress chief Adhir Ranjan Chowdhury has accused the TMC of “implicit support” to the RSS.\n\nMs. Banerjee, however, has got many factions of the Muslims, including the most powerful one led by Siddiqullah Chowdhury, the State chief of Jamiat Ulema-I-Hind, to back her. Similarly, the TMC has closely coordinated with another powerful community leader Pirzada Toha Siddiqui in south Bengal to ensure that the Muslim votes of at least south Bengal, where 75 per cent of the seats are located, remain undivided.\n\nThe current election will show whether she remains a favourite of the Muslim community.\n\nMamata gave an allowance\n\nto Imams and muezzins and inducted men who practise right wing politics in the\n\nname of minority rights", 
    "section": "national", 
    "title": "Co-opt and placate: Trinamool’s Muslim formula", 
    "subsection": "general", 
    "date": "2016-03-22"
}