{
    "author": [
        "Sumit Bhattacharjee"
    ], 
    "text": "The Indian Coast Guard ship ICGS Arnvesh after being commissioned at Visakhapatnam on Monday. It is a fast patrol vessel with 40/60 Bofors gun on board.— Photo: C.V. Subrahmanyam\n\nThe fast patrol vessel (FPV) of the Indian Coast Guard, ICGS Arnvesh, was commissioned here on Monday by Flag Officer Commanding-in-Chief, Eastern Naval Command, Vice-Admiral H.C.S. Bisht.\n\nThe 50-metre long, 300-tonne vessel is the 16th of the 20 in this category being built by the Cochin Shipyard Limited (CSL).\n\nPropelled by triple Rolls Royce Kamewa water jets, it can achieve a maximum speed of 33 knots and carry a crew of five officers and 34 men.\n\nFitted with the state-of-the-art navigational and communication equipment, including night vision capabilities, its main armament comprises 40/60 Bofors guns.\n\nCommissioning the vessel, Vice-Admiral Bisht said the role of the Coast Guard had now become 24/7, and it played a very active role in coastal security, especially terror threat from the sea. “Today, the coast is secured by the tri-forces of the Navy, the Coast Guard and the Marine Police,” he said.\n\nOn the role of ICGS Arnvesh , Inspector General of Coast Guard (Eastern Region) S.P. Sharma said the vessel would primarily focus on surveillance at sea, coastal patrol, anti-smuggling operations, anti-piracy and search and rescue operations.\n\nAccording to him, the Coast Guard was on an expansion mode, as its role in safeguarding the maritime assets in the exclusive economic zone (EEZ) and coastal security had increased.\n\nNow, it had 120 ships, 63 aircraft and 10,000 men, spread across its 42 Coast Guard Stations, five air stations and10 Coast Guard Air Enclaves.\n\nMr. Sharma said 125 ships of different types were under construction at different shipyards, and the idea was to have at least 150 ships and 100 aircraft under operation, across the length of the Indian coast on any given day, by 2019.\n\nFour new ships, he said, would be added to the Eastern Region by next year. As of now, the Eastern Region that covers Odisha to Tamil Nadu, had 33 commissioned ships, 11 non-commissioned craft and 15 aircraft.\n\nDIG of Coast Guard (Andhra Pradesh) A.K. Harbola, Commanding Officer of ICGS Arnvesh Amit Uniyal and other senior officers were present.\n\nThe 50-metre long vessel is the 16{+t}{+h}of the 20 vessels built by Cochin Shipyard Ltd in this category", 
    "section": "national", 
    "title": "Coast Guard patrol vessel Arnvesh commissioned", 
    "subsection": "general", 
    "date": "2016-03-22"
}