{
    "author": [
        "S Bhuavaneshwari"
    ], 
    "text": "In a shocking incident at Siddarabetta, about 30 km from Tumakuru, a couple was stripped and forced to walk naked on Sunday afternoon by a man wearing khaki pants and claiming to be a ‘forest officer.’\n\nThe victims — an 18-year-old girl and a 23-year-old man — work at a private factory in Tumakuru. Their nightmare started around 1 p.m. on Sunday when the ‘forest officer’ accosted them while they were sitting on a rock and threatened to have them arrested for indulging in “illegal activities”.\n\nAfter telling them that a police inspector was on his way to arrest them, the man, said to be in his twenties, snatched their wallet and mobile phones before leading them to a secluded area. There, he asked them to strip. While the young man accompanying the girl removed his clothes, the ‘officer’ took the girl some distance away and asked her to disrobe herself. “He attempted to rape me near a cave,” the girl told The Hindu on Monday after filing a police complaint.\n\nShe said she kicked him and attempted to escape, but the man grabbed her and pushed her off a rock. “I fell and hid behind a bush till Monday morning,” she said. The girl, separated from her friend, spent the night alone in the forest.\n\nIn the morning, she covered herself with some branches and leaves, and found her way to Bandehalli village about 4 km away. The villagers gave her a gunny bag and later some clothes.\n\nConfirming the case, Additional Superintendent of Police G.B. Manjunath said: “The man in khaki dress threatened the couple and asked them to disrobe with the intention of making sure they don’t get help from the public. The girl and her friend are not sure if he managed to film them using his mobile phone.”\n\nHowever, Deputy Conservator of Forests N.V. Amarnath said he had not been apprised of the matter. “I will check and also ask the forest guards in Siddarabetta to watch the area carefully,” he said.\n\nThe Koratagere police have registered a case of attempt to rape, and the girl has undergone a medical examination.\n\nThe man in khaki allegedly forced\n\nthe woman and\n\nher friend to strip near Tumakuru", 
    "section": "national", 
    "title": "Couple on an outing waylaid by ‘forest official’", 
    "subsection": "general", 
    "date": "2016-03-22"
}