{
    "author": [
        "S Bhuvaneshwari"
    ], 
    "text": "The man in khaki allegedly forced the man and woman to strip\n\nA man dressed in khaki, who identified himself as a “forest officer,” allegedly forced a couple to strip and attempted to rape an 18-year-old girl at Siddarabetta in the Koratagere taluk of Tumakuru district on Sunday.\n\nAccording to the police, the man and the young girl, who work in a private factory, had gone to Siddarabetta around 1 p.m. A man dressed in khaki approached them and told them that he was a forest officer and that he had taken pictures of them and sent them to his head office. The girl told The Hindu that she and her friend were sitting near a rock when the man came and threatened them saying they would be arrested for carrying out “illegal activities” and that a police inspector was on his way to arrest them. He told them to hand over their purses and mobile phones. He then took them to a secluded place and allegedly told them to strip so that the inspector “would not recognise them.”\n\nAfter the youth did as he was told, the man told him to stay where he was and took the girl with him saying he would hand her over to a woman constable. On reaching a secluded place which had a cave, he forced her to strip and tried to rape her.\n\nThe woman said she kicked him and tried to escape but the man caught her and pushed her from a rock. She fell and hid in a bush till Monday morning.\n\nShe said: “I went to a village (Bandehalli) around 6 a.m. I asked the women in the fields to give me some clothes. They gave me a gunny bag with which I covered my body.” She said she was humiliated and shocked by the incident. The couple decided to file a complaint on Monday evening.\n\nAdditional Superintendent of Police G.B. Manjunath told The Hindu that the offender must have forced the couple to strip to prevent them from seeking public help.\n\nHe added that the young girl and her companion did not know whether he had filmed them using his mobile phone.\n\nA case of attempt to rape has been registered in the Koratagere police station and the woman sent for medical examination. The police are on the look out for the accused.\n\nHe tried to rape me and threatened to hand us over to authorities, claims the 18-year-old", 
    "section": "national", 
    "title": "Couple on an outing waylaid by ‘forest official’ in Tumakuru", 
    "subsection": "general", 
    "date": "2016-03-22"
}