{
    "author": [], 
    "text": "Palestinian break-dancing crew B-Boy Funk practise at a makeshift training facility in the Nuseirat refugee camp in the central Gaza Strip last month.— File PHOTO: AFP\n\nKhamiss Abu Shaban’s band would love to wow the kinds of crowds seen elsewhere, but in Hamas-run Gaza they struggle to find venues and instruments, let alone get permission to play.\n\nEven so, that hasn’t dispelled the enthusiasm for popular music in the Palestinian territory, where 70 per cent of the population is under 30 years old.\n\n“Gazans are fans of music. They flock to every concert,” Abu Shaban, a 22-year-old bass player in Watar Band, says on the small stage of a sold-out 200-seat theatre. It was only their third performance for the past year and a half.\n\nMusicians and other entertainers have found it hard to make a name and living for themselves in the hardscrabble Palestinian territory’s few venues. That is the paradox of Gaza, a fact not lost on advertisers who seek to woo young breakdancers and devotees of parkour — the urban sport combining running, acrobatics and gymnastics.\n\nBut the rewards are few for the rappers, other musicians, dancers and acrobats trying to carve out a niche for themselves. If they want to rehearse, record or be filmed, they must do it in whatever space they can find, often in their own homes.\n\nWithout official authorisation and performance space, they cannot have grandiose dreams, they say. There is also a lack of instruments and equipment, thanks to an Israeli blockade of the strip in place for nearly a decade.\n\nThe French Cultural Centre was one of the few places where young Gazans could get away briefly from Palestinian political divisions, repeated wars with Israel, poverty and chronic unemployment, but it has closed its doors. In December 2014, it was hit by a bombing claimed by Salafist jihadists.\n\nGaza is a narrow strip of land into which 1.8 million Palestinians are jammed, wedged between Egypt, Israel and the Mediterranean.\n\nStarved of permanent performance spaces, dancers and musicians use the Internet to display their talents.\n\nSinging during war\n\nEven at the height of the gruelling war of summer 2014, Watar Band and rapper Ayman Mghamess posted songs and videos shot in the ruins of bombed-out buildings because they believed people needed to hear music.\n\n“In Gaza, it’s life or death, it’s the same,” chants Mghamess, a Gaza rap pioneer. “They can put up more checkpoints and barriers/I shall not weary, believe me/our dreams will survive/even if I myself die,” he intones in a clip viewed tens of thousands of times online.\n\nIt was online that Mahmud Saradi, 21, dressed in sportswear and a green and blue baseball cap, was initiated into breakdance moves. The dance style that spread among African-American youths in the 1970s and ’80s is the best way to banish “despair, stress, everything we suffer” in Gaza, says Karim Azzam, 18.\n\nGazans are for the most part physically confined to their sliver of Palestinian territory. An Israeli blockade imposed in 2006 severely restricts the movement of people and goods. Egypt has largely kept its border with Gaza closed since 2013 and has destroyed Palestinian tunnels under the frontier used for smuggling.\n\nSaradi and Azzam have given up hope of taking part in international competitions and even Palestinian national events are beyond reach as Israel rarely allows passage to Jerusalem or the occupied West Bank.\n\nMany obstacles\n\nYoung artists also face obstacles placed by their own conservative society, ruled for the past 10 years by Hamas. “We wanted to open our own centre in Gaza City but three times the authorities refused to give us a permit,” says Abderrahim Zrii, 22, who runs the makeshift training facilities of break-dancing crew B-Boy Funk.\n\nThe crew made do with the house of the father of three members who all fled Gaza for the United States and Europe. — AFP", 
    "section": "national", 
    "title": "Gaza rockers and rappers struggle to carve out a space", 
    "subsection": "general", 
    "date": "2016-03-22"
}