{
    "author": [
        "Girish Menon"
    ], 
    "text": "The Indian Union Muslim League, the second largest partner in the ruling United Democratic Front, is perhaps the only political party in Kerala, if not the country, which is currently at peace with itself. While others have been witnessing organisational turmoil, factionalism, and ego clashes among leaders, the IUML has been virtually free of such aberrations.\n\nOther UDF constituents have been wrangling for more seats ahead of the election, but the IUML agreed to limit its ambition to the 24 seats it contested last time.\n\nThere has hardly been a murmur in the IUML over the manner in which the candidates were selected, reflecting the leadership’s confidence about its role in current Muslim politics in the State. Today, the IUML has emerged as an umbrella outfit for various Muslim organisations, some of them rooted in fundamentalism and orthodoxy.\n\nIt draws its political clout from the 15 plus seats it usually wins in Malabar, particular in Malappuram district. The IUML is the only party which is “perpetually” in power, especially since the advent of the panchayat raj system. Irrespective of the outcome of Assembly and parliamentary elections, the IUML dominates the local bodies in areas of its influence. It got a slot in national politics in 2004, when E. Ahamed was inducted in the Manmohan Singh government.\n\nThe IUML ministers handle portfolios that account for over 65 per cent of the State’s budget allocation. The party used to have only four ministers whenever the UDF comes to power. It wrested one more ministerial berth in the Chandy Cabinet in 2011.\n\nWhen the whole of India swayed under the impact of Masjid-Mandir issue, the IUML steadfastly tread the middle path, refusing to give space to the forces of fundamentalism. When Muslims elsewhere had doubts about the credentials of the Congress in protecting secularism, the IUML leadership stood by the Congress in Kerala. Today, its alliance with the Congress is over 40 years old. Its contribution towards providing political stability and ensuring a bipolar coalition system in Kerala in indelible. Its participative governance has helped the Muslims to prosper in Kerala.\n\nThe IUML had to go through difficult times during the 1990s and 2000s when Abdul Nasir Maudany’s brand of fundamentalism made headway, attracting Muslim youth. At one stage, the Left Democratic Front hobnobbed with Maudany in its bid to break the IUML’s hold on Muslim electoral politics.\n\nThe party owes a lot to its late leader Panakkad Sayyed Shihab Thangal for its secular status by providing spiritual and temporal rationale to its agendaThe IUML leadership has succeeded in using the Thangal as a figurehead to mobilise myriad Muslim groups. The current incumbent, Hyderali Thangal, might not enjoy the kind of influence his late brother had, but his word continues to be final.\n\nOver the decades, the IUML appears to have lost a bit of its secular sheen. The challenge before it is to prevent communal polarisation by overstretching itself especially at a time when the BJP-RSS combine perceives that it would be able to achieve a breakthrough in Kerala and make its debut in the Assembly.", 
    "section": "national", 
    "title": "How the Muslim League is at peace with itself", 
    "subsection": "general", 
    "date": "2016-03-22"
}