{
    "author": [
        "T V"
    ], 
    "text": "The region is in the grip of oppressively hot days and nights, as temperatures shoot up a few degrees above the season normal\n\nNorth Karnataka is in the grip of oppressively hot days and nights, after temperatures shot up a few degrees above the season’s normal.\n\nSweltering summers are not news in north Karnataka. But this year, the mercury has reached new and unbearable heights across the eight districts.\n\nThe Hyderabad Karnataka and Bombay Karnataka regions are in the grip of oppressively hot days and nights, as temperatures have shot up a few degrees above the season normal, according to data from the India Meteorological Department (IMD) on Monday.\n\nAs hot winds blow across most places in the region, life has become miserable for the people. Roads are mostly deserted during afternoons, when the heat peaks. Those who venture out, do so with their faces and arms fully covered.\n\nFor the third day running, Kalaburagi recorded the State’s highest maximum temperature of 41.3 degrees Celsius, two degrees above the recording last year.\n\nRaichur recorded a maximum temperature of 41.2 degrees C, which was again two degree higher than last year.\n\nBidar, considered a hill station of the Hyderabad Karnataka region because of its cold weather conditions even in summer, is scorching this year. Its maximum temperature shot up to 41 degrees C, five degrees higher than last year.\n\nOther parts of the region are also suffering from heatwave — Koppal and Haveri are both at 40 degrees C; Vijayapura, Bagalkot, Dharwad, and Gadag each recorded maximum temperatures of 39 degrees C. Belagavi city and airport recorded a higher maximum temperature of 38 degrees C.\n\nNights are no less cruel. Temperatures across the region soared with Koppal recording the State’s highest minimum temperature of 27 degrees C, followed by Kalaburagi, Raichur, Gadag, and Bidar, which were 26 degrees C (minimum). The State’s lowest minimum temperature was recorded at Davangere: 19 degrees C.\n\nHighest in 91 years for Chitradurga\n\nPradeepkumar Kadkol reports from Chitradurga:\n\nThe fort city of Chitradurga reached its highest maximum temperature for mid-March in the last 91 years. The maximum temperature reigned at 40 degrees C for the last four days. Since the second week of February, the maximum was around 35 degrees C.", 
    "section": "national", 
    "title": "Karnataka reels under scorching heat", 
    "subsection": "general", 
    "date": "2016-03-22"
}