{
    "author": [
        "National Bureau"
    ], 
    "text": "This is the first time India has deployed Boeing P 8I for surveillance operation in a foreign country\n\nSignalling India’s deepening naval engagement in the Indian Ocean, the Indian navy has for the first time deployed one of its advanced maritime reconnaissance aircraft to Seychelles for surveillance of the island nation’s Exclusive Economic Zone.\n\nIt is the first such deployment of the Boeing P 8I to a foreign country. The aircraft has been in Seychelles since March 20, according to the Navy. The move is “in accordance with the MoU between the Governments of India and Seychelles,” it said in a statement.\n\n“It is a significant tactical development that India is able to extend this kind of surveillance,” said C. Uday Bhaskar, director, Society for Policy Studies. The deployment was a sign that India was a “credible security provider to the smaller states in a consensus manner,” he said.\n\nThe aircraft deployment, which followed earlier surveillance missions of the Seychellois EEZ by naval ships, reflects India’s increased maritime engagement in the region. India and China are locked in efforts to widen their respective spheres of influence in the strategically vital Indian Ocean.\n\nIndia has been reaching out to the smaller Indian Ocean island nations through various Maritime Domain Awareness (MDA) exercises that include Search and Rescue (SAR) support, oil pollution response exercises, and assistance in legal matters. Besides supplying naval vessels and aircraft, the Indian navy has supported countries such as Sri Lanka, Mauritius, Maldives and Seychelles with training, hydrographic surveys, surveillance operations and counter-terror patrols.\n\n“What we are seeing is China and India trying to expand their presence in the extended Indian Ocean region. India is of course the natural choice for the smaller nations because of geography and politics,” Mr. Bhaskar said.\n\nThe Indian Navy has, in the past, undertaken surveillance missions in the Seychellois EEZ twice a year, but by deploying naval ships. The P 8I is a cheaper, economical, faster and more effective option than the naval ships, and sends a signal about navy’s overall ambition and capabilities.\n\nThe last such surveillance deployment was undertaken by ships of the 1st Training Squadron of the Indian Navy in October last year.\n\nPointing out that P 8I is at the higher end of the spectrum in terms of surveillance and anti-submarine warfare capabilities, Mr. Bhaskar said he was intrigued by the “professional compulsion that may have led to the choice of a P 8I over a Dornier.”\n\nThe navy said in a statement that the aircraft will remain deployed till March 23. “During this period, the aircraft will undertake surveillance of the Seychellois EEZ. The deployment will also facilitate professional interaction between the aircrew and the Seychelles People’s Defence Force (SPDF).\n\n“Deployment of Indian Navy’s latest and technologically most advanced maritime reconnaissance aircraft is an indicator of India’s commitment towards ensuring the security of Seychelles EEZ. This deployment would assist in curbing illegal activities and piracy and contribute towards security and stability in the Indian Ocean Region,” the navy said.", 
    "section": "national", 
    "title": "Navy’s aircraft on mission in Seychelles", 
    "subsection": "general", 
    "date": "2016-03-22"
}