{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bedaquiline to be introduced in 104 districts across 5 States, at 6 identified tertiary care centres\n\nOn the eve of World Tuberculosis Day, Health Minister J.P. Nadda launched Bedaquiline — new drug for Drug Resistant TB — as part of the national programme. The drug will be introduced in 104 districts across five States.\n\nSpeaking at a press briefing, Mr. Nadda said the “process of fighting TB is continuous. Hence there can be no dilution and no diversion. Our attention needs to be steadfast and aggressive.” The programme would not suffer on account of budgetary allocation.\n\nThe new class of drug is a diarylquinoline that specifically targets Mycobacterial ATP synthase, an enzyme essential for the supply of energy to Mycobacterium tuberculosis and most other mycobacteria.\n\nBedaquiline is being introduced at six tertiary care centres across India. These sites have advanced facilities for laboratory testing and intensive care for patients. Bedaquiline will be given to multi-drug resistant TB patients with resistance to either all fluoroquinolone and/or all second line injectables and extensive drug resistant TB.\n\nThe national programme will also benefit from the introduction of over 500 Cartridge-Based Nucleic Acid Amplification Test (CBNAAT) machines — a revolutionary rapid molecular test which detects Mycobacterium tuberculosis and rifampicin drug resistance, simultaneously. This test is fully automated and provides results within two hours. It is a highly sensitive diagnostic tool and can be used in remote and rural areas without sophisticated infrastructure or specialised training.\n\nEmphasising on the need for collective commitment from all stakeholders, B.P. Sharma, Union Health Secretary, said the Revised National Tuberculosis Control Program (RNTCP) was one of the most successful programmes. “The programme has made significant impact on prevalence and treatment of TB. The quality of treatment has to be even over the public and private sectors. It has to be well supported by a strong procurement so that it can be sustained till 2030. But we need new tools for diagnostics and new research,” Mr. Sharma said.", 
    "section": "national", 
    "title": "New medicine for drug-resistant TB launched", 
    "subsection": "general", 
    "date": "2016-03-22"
}