{
    "author": [], 
    "text": "Two drugs used in the targeted treatment of leukaemia can significantly prolong the survival time of high-risk patients, researchers say, suggesting that in future, these medicines could not only replace chemotherapy but even stem cell transplantation.\n\nThe study found that the drugs ibrutinib and idelalisib used in the targeted treatment of chronic lymphatic leukaemia can significantly prolong the survival time of high-risk patients.\n\nThe average survival time of these patients is between one and two years when they receive standard treatment, whereas 80 per cent of patients receiving the new treatment were still alive after two years, researchers said. “We can regard the results of these studies as milestones. We have now started further studies to investigate the two substances in combination,” said Ulrich Jager from Vienna General Hospital.\n\n“In future, they might even replace chemotherapy and stem cell transplantation to some extent,” said Mr. Jager.\n\nBoth drugs are so-called “small molecules” and belong to the class of substances known as kinase inhibitors. They are used in targeted cancer treatment, where they interrupt the signalling pathways of the cancer cells, researchers said.\n\nBoth substances inhibit cell growth and idelalisib additionally affects the cells’ ability to metastasise, they said. “In targeted therapy, blood cancers serve as a model system for many different types of cancer. Knowledge obtained from haematology is therefore of great interest to other oncologists,” said Mr. Jager.\n\nThis is because targeted treatment acts on specific molecular-biological properties of the cancer cell. Tissue samples have to be taken to determine these properties.\n\nSuch samples must also be taken if follow-up tests are necessary during treatment. In the case of solid tumours, a surgical procedure is usually required to take a tissue sample and this is not only stressful to the patient but also carries a certain risk, they said. — PTI", 
    "section": "national", 
    "title": "New leukaemia treatment could replace chemotherapy", 
    "subsection": "general", 
    "date": "2016-03-22"
}