{
    "author": [
        "Rishikesh Bahadur Desai"
    ], 
    "text": "The State government will take up comprehensive development of the ‘karez’ or ‘surang bavi’ system, the medieval era underground aqueduct, to transform them into an international tourist attraction.\n\nThe area above the surang in Naubad will become a no-construction zone and a boulevard will be built over it. Also, interpretation boards will be put up along the way and visitors will be able to descend into the mouth of the duct and walk up some distance.\n\n“The Indian Heritage Cities Network (IHCN), the consulting agency, has proposed an action plan of development in four stages. The first stage is getting the go ahead,” Anurag Tewari, Deputy Commissioner, told The Hindu .\n\nEach stage entails an expenditure of around Rs. 1 crore. The first phase will focus on purifying water that flows under the vents, strengthening the laterite rock structure for safety and security, and clearing of encroachments around the structure. Construction of new buildings and roads will not be allowed over the structure. The existing structures will be asked to follow some guidelines to make sure they don’t damage the heritage structure, Mr. Tewari said.\n\nIllegal structures in the no-construction zone will be removed, he said.\n\nKishore Raykar, chief executive officer of IHCN, said strengthening the structure will be of utmost importance.\n\n“We have requested experts from IIT-Hyderabad to examine the structure. Some of them have already had an exposure visit to Bidar. Once we have them on board, it will be a long term association. We have urged the government to let us use the services of the experts. The Deputy Commissioner has assured us that he would provide all cooperation,” Mr. Raykar said. According to him, water sampling of all the wells along the Surang Bavi will begin soon.", 
    "section": "national", 
    "title": "Plans afoot to develop Bidar’s ‘karez’", 
    "subsection": "general", 
    "date": "2016-03-22"
}