{
    "author": [
        "Sudhir Srinivasan"
    ], 
    "text": "Here it is, the remake of Bangalore Days , for the benefit of audiences in interior Tamil Nadu, who presumably don’t really care for subtitles all that much. It’s the return of the tale of three cousins—Ammu (Sri Divya), Aju (Arya), and Kutty (Bobby Simha, with an obvious wig)—who set out to Bangalore with little knowledge that their worlds are about to be rocked. After all, as Aju awkwardly says on the eve of Ammu’s wedding, “What ye rocking city!” Aju talks of Bangalore like it is the place of every Tamilian’s dreams. “Bangalooooooore,” he whispers with the excitement of a child who’s asking for an ice-cream. I can understand Goa, but does Bangalore really hold that fascination? Are there people whose eyes go as wide as Aju’s when talking about the Garden City?\n\nWith the exception of a few jokes, mainly in Kutty’s track, Bangalore Naatkal is a faithful remake. It has even retained the same composer (Gopi Sunder), who, for his part, has retained the opening hit number, ‘Maangalyam’. A few members of the cast reprise their roles from the original, including Parvathy (RJ Sarah), Sajid Yahiya (a member of a racing group), and Sijoy Varghese (racing coach). When a remake is as faithful, the crucial point of discussion is invariably the main difference—cast. I really liked Sri Divya; put aside her dubbing difficulties—awkward pronunciation, and often, unnaturally shrill—and she really grows on you. Both Arya and Bobby (Dulquer and Nivin in the original) play their parts reasonably well, but I thought both lacked the subtlety and finesse of the original actors. Bobby’s character, Kutty, for instance, though the weakest character of the three (and hence, perhaps the narrator), is the light of the film, every time things get a bit too dark. But I wasn’t really convinced that Kutty was as innocent as the film portrays him to be. I quite missed the childlike glint in Nivin’s eyes every time his character does something that he considers blasphemous—like ogling at an airhostess, for instance. Arya, meanwhile, doesn’t seem like he’s as traumatised by his past (even though he says otherwise) as Dulquer was in the original. You knew Dulquer was a ticking time-bomb, that you’d have to step carefully around him. Arya doesn’t bring that same explosiveness to the role. His eyes don’t really seem to have had as many sleepless nights. His heart doesn’t seem to be filled with as much desperation for acceptance, for love.\n\nBut there are some great casting choices too—mainly Rana (Prasad, Ammu’s husband) and Saranya (Kutty’s mother). If Fahadh Faasil exuded alpha male behaviour through quiet confidence in the original, Rana also brings to the party his broad frame and musculature. As for Saranya, she’s played the impish mother so many times that she could sleepwalk through these roles. You don’t even have to write these roles in the script anymore. Just mark it as Saranya’s role.\n\nBangalore Naatkal quite worked for me, despite the aforementioned minor niggles. It made me well up at all the right moments, even if it didn’t get me laughing as much as the original. It’d have taken some seriously dreadful filmmaking to ruin a tale as heartwarming as Bangalore Days . There is so much subtlety in the script, which affects so powerfully— especially in the track between Ammu and Prasad. Like the scene that has the latter filling up his entire refrigerator with Slice bottles. It says so much without really spelling it out. Like when a fully grown labrador gambols into Prasad’s arms. You’re moved because of their shared past, which, again, isn’t really milked. These moments are so tender that you’re willing to forgive the film its needlessly filmy moments. Like the overly cinematic bike race at the end. Like a flashback love story whose intensity is lazily qualified by a narrator.\n\nAt its heart, Bangalore Naatkal is about change. Everything, like in life, is in a state of constant transformation. A woman embraces modernity, a foreigner embraces tradition, an old man discovers the joy of taking a solitary journey to Goa, an old couple finds redemption, a racer begins to believe in himself, a married man learns to move on from a past relationship… and perhaps, best of all, people find love. The lives of people begin to merge, and love is acquired. Mergers and acquisitions… which, incidentally, is what Prasad handles for a living.\n\nsudhir srinivasan\n\nBangalore Naatkal\n\nGenre:Drama\n\nDirector:‘Bommarillu’ Bhaskar\n\nCast:Sri Divya, Arya, Bobby Simha, Rana Daggubati, Saranya\n\nStoryline:Three cousins discover life and love in Bangalore", 
    "section": "national", 
    "title": "A likeable remake despite minor casting issues", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}