{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "The ancient Greeks probably had it right. According to them, gods were power-hungry pleasure-seekers, who got their kicks by toying with human lives. It’s a fancy way of saying shit happens — but how else to explain away the mind-boggling randomness of, say, the recent floods in Chennai? Or the plight of the four Tamilian migrant workers tossed into a Guntur prison in Vetri Maaran’s powerful new film, Visaranai ?\n\nThe gods of this story, partly adapted from M Chandrakumar’s novel Lock Up , are the gods of our time – the powerful people who make up the nebulous, all-pervasive, malignant entity we’ve come to call the System. And they keep hurling lightning bolts at Pandi (‘Attakathi’ Dinesh), Murugan (‘Aadukalam’ Murugadoss), Afsal (Silambarasan) and Kumar (Pradeesh), who are arrested when a local big shot’s house is burgled. The cops don’t care who committed the crime. They just want a confession. Any confession. And who better to extract it from than these four... specks in the cosmic scheme of things? They’re voiceless, dispossessed. They’re sacrificial lambs, and the first act of Visaranai depicts their ritualised slaughter.\n\nIt’s ostensibly an interrogation, but we don’t hear too many words. Instead, we hear the thwack of a lathi when it lands on bare flesh, the gasps and coughs when a man is waterboarded, the crrrack of a tooth coming off, and most sickeningly, the fingernails-on-chalkboard rasp from a long stem being shaved and readied for a sustained thrashing. Suddenly, it’s a game. If Pandi buckles and falls, then his friends will receive more punishment. The camera moves in close to capture how flesh vibrates when that long stem falls with sadistic force. The sound design is chilling. You feel the welts on your back.\n\nThe violence in Visaranai is... horrifying is too mild a word. But it’s not torture porn. It’s necessary, dictated by the film’s structure. We need to know how bad it can get, because there’s a second interrogation, subsequently, and when Pandi (who’s now free) attempts to help the new sacrificial lamb, we remember what can happen if he gets caught. I could barely watch.\n\nThe second interrogation occurs in the second act of the film, which is an echo of the scenes with Pandi and his friends. But there’s a crucial difference. This victim (Kay Kay, played by Kishore) is white-collared. He an auditor, he deals with Swiss bank accounts. He speaks English with a cop who questions him in an air-conditioned room. He hobnobs with political bigwigs. And yet...\n\nPart of Visaranai ’s agenda is to show that the System is truly egalitarian. The gods can toy with anyone. But the film isn’t a wail, it isn’t melodramatic. Vetri Maaran doesn’t catch us by the collar and demand empathy. His is a cool approach, almost like a procedural.\n\nVisaranai is an adult movie – not just in the sense of its content being thoroughly unsuitable for children, but also in its refusal to treat the audience like children. The language, too, is refreshingly grown-up – though not in the censored version you’re seeing in theatres now. The beeping out is grim affirmation that the Censor Board is another avatar of the System. They hurl lightning bolts at art.\n\nVisaranai showcases a range of villains. Some of them, like the top Guntur cop Vishweshwar Rao (Ajay Ghosh), are obviously evil. Other villains are subtler, like the cop named Ramachandran (the astonishingly subtle E Ramadas). He’s been in the System so long that he’s seen it all. He’s scarily practical, an amoral science teacher spewing toxic wisdom. (“If someone dies, then that death should be of use.”) Muthuvel is the third kind of cop.\n\nHe wants to do the good thing, the right thing, but is forced by the System to become another bad guy. Samuthirakani is terrific – he shows us a man torn between salving his conscience and saving his ass.\n\nVisaranai is a classy film. Despite the many layers, it doesn’t have a message — at least not overtly. You could say it seeks to open our eyes to the violation of human rights, given the statistics at the end stating that 30 per cent of cases in India are closed this way. You could say it brings up a discussion about caste, that Pandi and his friends belong to marginalised communities, which is why they are treated so – and that caste plays a part even in the police hierarchy. (The overly expository tone of a few lines is the rare misstep in an otherwise impeccable film.) But the only thing the film is about, really, is the terrifying arbitrariness of how the powerful prey on the powerless. Visaranai plays on our deepest cynicism, our deepest fears about the System.\n\nVisaranai is beautifully filmed, though this isn’t a film with much room for beauty. The frames appear to have been snatched from the back alleys of life. The verité illusion is aided by the utterly lifelike performances – even if the word “performance” seems wrong. No one seems to be acting. Dinesh, especially, does extraordinarily physical things – watch him at the end, whimpering like a cornered animal. At this point, he’s knee-deep in a morass – it’s another symbolic touch. Muthuvel is in the morass too. We’re all stuck in shit. The film’s early portions are set in places we identify with the System (the police station, the court), and by the end, the action opens out to a middle-class neighbourhood, the kind of place we live in. That’s the chilling takeaway. There’s no escaping the System. It’s all around us.\n\nbaradwaj rangan\n\nVisaranai\n\nGenre: Thriller\n\nDirector:Vetri Maaran\n\nCast:Dinesh, Anandhi, Samuthirakani, Kishore, Murugadoss\n\nStoryline:An unflinching look at how the powerful prey on the powerless", 
    "section": "national", 
    "title": "A powerful, chilling drama about how the System toys with us", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}