{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Every evening, when Azeez goes to play football at the Corporation playground on Naval Hospital Road, Vepery, he first removes pieces of broken alcohol bottles on the ground and then start playing.\n\nThe ground, situated in ward 58 of Chennai Corporation, has been in the locality for over five years now. However, many anti-social elements used to roam around the ground, making it impossible for women and children to walk past the play area.\n\n“A few days ago, we organised a road-roko demanding that the Chennai Corporation fix a proper gate and lights for the ground. Finally, a gate was fixed on Friday and powerful lights were installed,” said A.V. Afroze Ahmeed, chairman, Central Chennai, District Congress Committee (minority department).\n\nDue to this, children have started using the playground in the evenings.\n\n“It is a nice way to prevent the future generation from getting into crime. However, the anti-social elements still find a way to get into the ground and use a small room on the premises as a cover for their acts,” added Afroze.\n\nMany residents claim they enter the ground by jumping over the compound wall of a building behind the ground.\n\n“It houses some commercial establishments and apartments. The youngsters who drink and smoke weed at the ground throw stones at the houses and create a ruckus,” said Vinod, a teenager who plays football at the ground.\n\nThe liquor bottles are also broken and thrown on the ground. “Children playing here get injured after stepping on them. They also get introduced to tobacco products as they start sniffing the leftover cigarettes,” added Vinod.\n\nMany residents say police patrolling should be increased in the locality. “Though the patrol vehicles come inside the streets, people still drink and smoke ganja in the open. When they see the patrol vehicle, they hide,” he said. Police personnel said that they would look into the issue.\n\nWoman attacked\n\nWorsening the fear of the residents are the recent attacks on an elderly woman in the locality twice this month.\n\n“A few days ago, an unknown person wearing a helmet came into the house and attacked my mother, K. Premakumari, and snatched her gold chain. She sustained cut injuries on her neck and shoulders,” said K. Venkatraman, her son who resides at 12th street, Naval Hospital Road. On Saturday again, a similar-looking man barged into the house.\n\n“This time, before he could snatch my mother’s chain, she raised an alarm and he fled the house after slitting her hands with a blade,” he added.\n\nThe police have registered a case and are investigating.", 
    "section": "national", 
    "title": "Anti-socials have a free run at play ground", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}