{
    "author": [
        "S Senthalir"
    ], 
    "text": "Dance exponent Anita Ratnam gives a demonstration highlighting the connection between art and heritage. (From right) Dance teacher Jayashree Narayanan and dancers Krithiga and Rekha Tandon, at a discussion on Heritage of the Performing Arts, featuring dancers, musicians and theatre personalities in Puducherry on Saturday.— Photos: S.S. Kumar\n\nPlan to work with government as part of Smart City project to bolster local culture and heritage\n\nDancers, musicians and theatre personalities pledged to work with the government in building a performing arts theatre exclusively for cultural events in Puducherry on Saturday.\n\n“There is no auditorium for the cultural events in Puducherry. Why should not we think of building one between Auroville and Puducherry? We can work with the government as part of the Smart City project. We should bank on the culture and heritage present in Puducherry to make it a smart city,” said Aurelio, the creative director of SVARAM, musical instruments and research organisation.\n\nHe spoke during the conversation on Heritage of the Performing Arts held on Saturday.\n\nMr. Auerlio said that Puducherry provides the space to explore the unknown. “It is quite easy to find a rural setting inside with an amazing cosmopolitan global influx here,” he added.\n\nJayashree Narayanan, who runs a Bharatanatyam school in Puducherry, traced the dance heritage in Puducherry to the Devadasi (temple dancers). “Devadasis were called to welcome the French guests during their rule in Puducherry. There are inscriptions in Puducherry that talk about the sibling temple dancers’ role Bangari and Singari in building the Bahour lake. Being a small territory and its closeness to Tamil Nadu, Puducherry does not have a dance unique to its place. Bharatanatyam teacher from Thanjavur came to Puducherry to teach dance,” she said. Indian classical and contemporary dancer and choreographer Anita Ratnam connected the dance to the heritage and how the postures signified the heritage. “In the very first posture in Bharatanatyam, I have to acknowledge the efforts of our predecessors, who made it possible for me to arrive at this point,” she said.\n\nShe spoke about the rich heritage of classical Tamil literature with focus on dance and dancing women as central to the story itself.\n\nRekha Tandon, Odissi dancer, researcher and choreographer, spoke about the link that exists between Odissi and temple sculptors in Orissa.\n\n“Gurus continue to visit temples to learn about the body postures, expressions in temple sculptors,” she said.\n\nExplaining the close link of dance with heritage, she underlined that temple sculptors had been central to the enrichment of Odissi dance form.\n\nSinger Aneesh Raghavan, Bharatanatyam dancer Krithiga and theatre artist Vinay Kumar spoke during the discussion.", 
    "section": "national", 
    "title": "Artists pledge to build an exclusive auditorium in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}