{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Irate public and relatives of the missing infant at Government Hospital in Dindigul on Saturday.— PHOTO: G. Karthikeyan\n\nA three-day-old baby girl was reportedly ‘lifted’ from the Government Hospital in Dindigul on Saturday.\n\nAs the news spread around 11 a.m., the hospital staff closed the gates and conducted a search, but in vain. Though there were cameras fitted in 16 places, including wards, there was none near the family planning section, adjacent to the burns ward. Hence, it is suspected that the one who stole the infant must have known about it.\n\nMariammal (20), wife of Chandrasekar, a lorry driver of Valakaipatti near here, delivered the missing baby on February 4. As she was advised to undergo family planning procedure, the woman was taken to another block in the hospital.\n\nThe newborn was under the care of Mariammal’s mother Chandra.A hospital staff is said to have approached Chandra to sign an undertaking form for performing the surgery on Mariammal. In a hurry, Chandra handed over the baby to a woman seated next to her. When she returned in a few minutes, the woman had vanished with the newborn.\n\nOn information, Joint Director (Health) Ravikala visited the spot and conducted inquiries. Dindigul (North) Town police inspector Para Vasudevan enquired the family members and hospital staff. The CCTV footage was of little help.\n\nThe relatives of Mariammal were upset on learning that the newborn was missing. The couple, with a two-year-old son, and her relatives resorted to an agitation.\n\nThe incident comes at a time when the police are perplexed over a baby missing case in Government Rajaji Hospital in Madurai. The High Court had directed the police and government to take steps to ensure protection for the newborns.\n\nThe incident comes at a time when the police are perplexed over a similar case in Madurai GRH", 
    "section": "national", 
    "title": "Baby goes missing in Dindigul hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}