{
    "author": [
        "B S", 
        "Satish Kumar"
    ], 
    "text": "A British firm has come forward to help Bengaluru to turn used cooking oil into bio-diesel as part of a project to covert waste into wealth. If this proposal materialises, a few KSRTC or BMTC buses may run on bio-diesel generated from waste cooking oil.\n\nA British delegation met Bengaluru City Development Minister K. J. George in Bengaluru on Friday and discussed the potential of the project. A similar one in London was successful with 20 to 25 buses running on this fuel, said the minister.\n\nThe proposed project in Bengaluru envisages collection of used cooking oil through private agencies and processing it. The minister said the government was ready to get the British expertise in helping the local entrepreneurs on the project and the fuel could be used for KSRTC or BMTC.\n\nMr. George said several foreign companies had come forward to help set up waste-to-energy projects in Bengaluru, which was facing problems related to disposal of garbage. “In fact, we have such an overwhelming offer that the waste requirement for these projects has overshot the actual availability of garbage in the city,” he said.\n\nThis includes the proposal by the Yokohama city corporation of Japan to set up a pilot waste-to-energy project with a capacity of 100 metric tonnes at a subsidised cost of 50 per cent. They wanted the State government to share 50 per cent of the cost of the project. Their proposal was being studied by the officials concerned, he noted.\n\nSimilarly, a Poland-based company had come forward to offer technology for generating electricity from the sludge in the sewage treatment plants.\n\nA German firm too had offered to provide technology for setting up waste-to-energy project.\n\nAll these proposals were being examined, the minister said.\n\nThe Minister said 50 more stretches of important roads in Bengaluru city were being finalised for developing them under the TenderSure project.", 
    "section": "national", 
    "title": "British offer to turn used cooking oil into bio-diesel", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}