{
    "author": [
        "K Manikandan"
    ], 
    "text": "Students from the National Institute of Fashion Technology painting the walls at Chennai Central Railway station —Photo: B. Jothi Ramalingam\n\nIt is close to noon and a few passengers waiting at Chennai Central to board express trains in the long journey to their destinations park themselves near platform no. 12.\n\nSeated comfortably, their backs resting on huge pillars, they watch a bunch of young men and women who are working on a huge wall that separates the platform from Buckingham Canal.\n\nThe wall has just been given a fresh coat of white and students use measuring instruments and then draw in gentle black strokes — soon, figurines take shape.\n\nThese youngsters are the first-year students of the National Institute of Fashion Technology (NIFT), Taramani, and are sprucing up the compound wall as part of their contribution to the ‘Swachch Bharat’ campaign.\n\nAbout 100 of the students are engaged in this beautification project and their painting on the wall is based on themes of Chennai and Tamil Nadu.\n\nThe paintings will reflect the cultural mosaic of the city and the State, explains Karthikeya Rayan, one of the faculty members who are guiding the students.\n\nFor the students too, it is a learning process and they go about it in a very professional manner to make sure that the “canvas on the wall” is received well by passengers and visitors to the station, in addition to people who are working there.\n\nSouthern Railway officials say that they are only too glad to extend their cooperation to the institution. The aim is not to just spruce up the wall, but also to bring out a thematic representation of all that Tamil Nadu is known for — its people, arts, crafts and landscapes, among others.\n\nThe students had earlier volunteered to create a similar painting on a wall on the concourse, officials added.\n\nStudents spruce up walls as part of their contribution to the ‘Swachch Bharat’ campaign", 
    "section": "national", 
    "title": "Central station walls to sport colours of Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}