{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "The Chettinad cotton saree, which inherited the intricacies of now out-of-vogue and over a century-old‘Kandangi’ pure silk sarees, has won the ‘India Handloom’ tag for its unique designs and identity.\n\nThe Textiles Committee, Union Ministry of Handlooms and Textiles, Mumbai, registered the Chettinad cotton saree under the India Handloom Brand Scheme after checking various quality parameters stipulated by the Standard Operating Procedure (SOP) and offered a logo.\n\nThe Ministry, in its recent communication, authorised the Amarar Rajiv Gandhi Handloom Weavers Cooperative Society, which produced the sarees, to use the brand and logo for marketing the product.\n\n“We passed through five different quality tests to get the brand,” said S. Palaniappan, president of the society. The group has been making the sarees since 2007 by uniting weavers, whose forefathers were instrumental in bringing out the ‘Kandangi silk sarees’ patronised by the ‘Nattukottai Nagarathars,’ the wealthiest community in the region, he said.\n\n“We have used the designs and colour combinations of Kandangi sarees to produce the Chettinad cotton sarees,” Mr. Palaniappan told The Hindu . The brand and logo would help the society to promote its sales in the domestic as well as international markets.\n\nThe sarees are already popular in New Delhi and Mumbai and countries such as Malaysia and Singapore, he said.\n\nThe procedure for the branding began in October last year when the weavers service centre in Chennai and the textiles committee in Madurai made a site inspection followed by inspection of looms and interaction with weavers, Mr. Palaniappan said. About 650 weavers attached to three societies in the region produced the sarees, he added.", 
    "section": "national", 
    "title": "Chettinad cotton saree wins India Handloom tag", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}