{
    "author": [
        "S Senthalir"
    ], 
    "text": "The manner in which the Promenade Beach is shrinking by the year should sound a clarion call to protect the disappearing beaches in India, coastal conservation experts warn.\n\nThe harbour built in 1986 has already eroded an estimated 10km of sand beach and continue to erode the beaches along Tamil Nadu coastline, and failing concerted action, this could have an impact on Andhra Pradesh and, in fact, the entire Indian coastline, participants at a session hosted as part of the Pondicherry Heritage Festival said.\n\nAurofilio Schiavina, an expert on coastal management, called for immediate action to protect the sand beaches during the discussion on the Conservation and Restoration of the Natural Heritage of Puducherry – the coast, wetlands and tanks and forests as part of the Pondicherry Heritage Festival 2016 on Saturday.\n\nHe added that this harbour has caused immense loss of Rs. 1,000 crore. “The revenue that could be generated through real estates has been lost. The erosion has damaged the ecological function and services. Building sea walls with rocks is not the solution to the problem. It requires at least Rs. 13 to Rs. 15 crore in a year for dredging,” he added.\n\nSand beaches protect people from cyclones, big waves and prevent ground water from becoming saline. It supports the livelihood of fishermen and provides better space for recreation. The erosion of sand in Puducherry was man-made.\n\n“We had begun a campaign to restore the sand beach in 1999 under the aegis of Pondicherry Citizens Forum. Slowly, we invited people and experts, after many years we got the government to understand and accept that the main cause is the harbour. It was in 2010 that the government decided to fix the problem. Over the last two to three years, they have started making studies to restore the beach. It has been a long drawn affair,” he said.\n\nDue to unscientific planning, the country has lost at least 40 per cent of sand beaches.\n\nDr. M.V. Ramana Murthy, scientist at National Institute of Ocean Technology, said that man-made developments of ports, damming of rivers and dredging of tidal inlets have led to erosion. “Besides implementation of short-term strategies for immediate protection, there needs to be long term plans to protect the sand beaches,” he said.\n\nNithyanand Jayaram, environmentalist from Chennai spoke about the government’s apathy in protecting the natural resources.\n\nThe Pondicherry Heritage Festival, co-hosted by INTACH, The People for Pondicherry’s Heritage and PondyCAN, with the support of a host of government departments, will conclude on Sunday.", 
    "section": "national", 
    "title": "Clarion call to protect beaches at Pondicherry Heritage Festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}