{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Greater Chennai Corporation’s vigilance officials have started an inquiry into the stormwater drain de-silting works that had been carried out ahead of the northeast monsoon last year.\n\nThe investigation follows allegations that de-silting had not been carried out in some stormwater drains, although reports presented by the respective wards indicated otherwise.\n\nOfficials have started visiting these wards to collect information on stretches that have been de-silted ahead of the northeast monsoon.\n\nOwing to the unwillingness of ward-level officials to share information on de-silting, councillors had filed RTI petitions to get data about de-silting works, which were proposed at an estimated cost of Rs. 16.5 crore in August 2015.\n\nThe inquiry was launched after councillors belonging to various parties, including the AIADMK, voiced their grievances relating to MLAs who reportedly controlled the mechanisation of de-silting operations in various neighbourhoods.\n\nAccording to sources, there are allegations that works in many neighbourhoods had not been carried out fully.\n\nFor example, the vigilance officials are trying to find out how in Thiru-Vi-Ka Nagar zone, which prepared an estimate of Rs. 1.88 crore for desilting, bills for many of the works are yet to be settled.\n\nEstimates were prepared to the tune of Rs. 6.46 crore in some of the flood-affected zones of Kodambakkam and Adyar.\n\nGreater Chennai Corporation officials said the compilation of the works done in 1,880 km of the drains was underway.\n\nDe-silting operations severely affected\n\nDe-silting operations in many parts of the city were severely affected owing to a delay in the commissioning of machines to replace manual scavengers in 2015, they added.\n\nWork on cleaning drains as part of monsoon-preparedness failed to take off before July 31.\n\nIn the past few years, the Corporation has been setting July 31 as the deadline for completion of de-silting operations.\n\nThe stormwater drain network and canals are usually readied by September to prevent flooding during the northeast monsoon.", 
    "section": "national", 
    "title": "Corporation launches inquiry into de-silting works", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}