{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Participants taking part in the field exercise in detecting wildlife crimes at the Tamil Nadu Forest Academy in Coimbatore, on Saturday. —Photo: S. Siva Saravanan\n\nPrincipal Chief Conservator of Forests and Chief Wildlife Warden V.K. Melkani stressed the need to form crime control cells at vulnerable districts, involving personnel from the forest, police and other departments to curb wildlife related crimes.\n\nAddressing forest officers from 18 States and personnel from various border security forces at the valedictory of the three-day national workshop on capacity building for combating wildlife crime in India at Tamil Nadu Forest Academy, Coimbatore, on Saturday, he said there is a proposal to form a state-level wildlife crime control bureau.\n\nHe also suggested forming special teams at airports, sea ports, railway stations at vulnerable pockets and trans boundary to check smuggling of wildlife and related products.\n\nThe chief wildlife warden also stressed on the need for socio-economic rehabilitation of communities that are dependent on poaching for their livelihood.\n\nSecretary General and Chief Executive Officer of World Wide Fund for Nature-India, Ravi Singh, expressed the need for giving awards to field-level forest department staff such as forest watchers and guards who has gone the extra mile to stop poaching.\n\nHe said that such field level personnel could play a key role in curtailing poaching and an award or recognition would boost their morale.\n\nDirector of the Tamil Nadu Forest Academy Rajeev Srivastava emphasised on the need to document crimes concerning wildlife at the district, state, regional and the national level.\n\nAt the deliberations towards the end of the three-day programme the participants and experts suggested formulating welfare measures for field level poorly paid staff and to increase manpower in the forest department, which faces a heavy dearth of field level personnel.\n\nThey also suggested forming wildlife conservation clubs at colleges.\n\nShekhar Kumar Niraj, Head of TRAFFIC India, which organised the workshop, said that outcome of the deliberations would be forwarded to the Central and State Governments to formulate solutions to curtail wildlife crimes.\n\nEarlier in the day, the participants were divided into teams for a field level exercise on identifying poaching at various levels.\n\nDuring the three hour exercise the participants were taken to a market investigation and surveillance scene, the modes of gathering intelligence and identifying poaching scene, collecting samples in a scientific way, tracing for remains of the animals, arresting culprits and documentation.\n\nExperts from the Wildlife Crime Control Bureau, TRAFFIC-India and Freeland Foundation guided the participants in the exercises that were organised at the Tamil Nadu Forest Academy premises. Special Task Force personnel demonstrated on how traps set for animals should be dismantled.", 
    "section": "national", 
    "title": "Crime control cells at district level stressed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}