{
    "author": [
        "Poorvaja Sundar"
    ], 
    "text": "Students taking part in a group dance competition at VIT Riviera '2016, an international sports and cultural festival in Vellore, on Saturday.— Photos: C. Venkatachalapathy.\n\nSemi-classical and western dance performances and rock show by Parikrama were the highlights of the day\n\nThe spotlight of ‘Riviera 2016’ on Day 3 at VIT University on Saturday was on Dances and Dramatics.\n\nAt the international sports and cultural festival, ‘Frisk Factor’, the group dance competition, brought together a variety of dance styles on stage, including fusion, semi-classical, hip-hop, freestyle and folk.\n\nWhile ‘Thaandav’ the team from SASTRA University put up a semi-classical performance, the western dance team from IIT Madras ‘Frequency’ had the audience up on their feet for their dance presentation which had a mix of western styles.\n\nMyriad of emotions\n\nRadhika, a member of the team from SASTRA, said that they had chosen to weave the story of Cinderella into their semi-classical performance, which enabled them to explore a myriad of emotions through dance.\n\nThe finalists of ‘Frisk Factor’ battled it out in the evening at the finals on the main stage on the college campus, cheered by hundreds of students. Following the dance performances for the night was the pro-show, which had Parikrama, the famous rock and roll band from Delhi, perform some of their popular songs.\n\nDramatics teams from colleges across the country brought the best of their histrionics for ‘Thalia and Melpomene’, the stage play event. “We worked on an idea that we got and developed a script in the mystery genre. The competition has been good here,” said Sachin Singhania, a student of the SRM University Chennai about their play ‘Am there for you’.\n\nAmong the other participating teams, a team from the Siddaganga Institute of Technology took up a theme with undercurrents of patriotic fervour and presented a play on the life of an Army jawan.\n\nShort films made by students from across the country found a place at the Dream World Film Festival, where they were screened on Saturday.\n\nMembers of the VIT Film society who were organising the event said that they had received over 20 entries on varied themes and that the short films would be screened across two days.\n\nAmidst the various competitions, participants from various college checked out the various stalls which had a number of games put up such as water zorbing and blacklight dodgeball.", 
    "section": "national", 
    "title": "Dance and drama enliven cultural fest at VIT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}