{
    "author": [
        "Vishal Menon"
    ], 
    "text": "S aagasam is a film you must see to believe. It’s not every day that you get to watch such an abundance of resources get reduced to rubble so quickly. It’s even quite cathartic in much the same way one finds dark pleasure in the implosion of skyscrapers. Never before have I heard such deafening silence when an actor delivers a punch line.\n\nYou can almost hear crickets chirp each time. The camera often lingers over a smirking Prashanth, if only so the audience can appreciate his ‘boyish good looks’. We often keep hearing big actors complain about how they get pigeonholed into similar characters and films because their fans demand a certain kind of film from them. Why then would Prashanth, who isn’t burdened by stardom, need to make such a crowd-pleaser? With all the financial clout (the film was apparently shot in three countries) and the acting talent at the film’s disposal (cast includes Sonu Sood, Nassar, M. S. Bhaskar, Thambi Ramaiah, and Robo Shankar), couldn’t the makers have been free to make any film they wanted? Doesn’t a film’s screenplay not deserve a bigger budget than the hero’s shoes?\n\nIt’s almost impossible for us to invest in Ravi’s (Prashanth) character because the writer (Thiagarajan) doesn’t seem to have either. Ravi is a wastrel, who at any given time seems capable of predicting every move of a criminal mastermind, while casually solving a Rubik’s cube.\n\nIt’s almost ironic that in a film that’s already so empty and predictable, we have a hero who can predict exactly how events are going to unfold. It’s like we are watching each predictable scene, twice. Take, for instance, the scene where Ravi needs to catch up to a villain during a car chase. Not only do we have to see this tacky action scene unfold once, but we also have to see a comical animated graph emerge from the hero’s head showing him calculate the distance, speed and time required for him to drive his car through a glass building to surpass the bad guy.\n\nAnd when he isn’t shooting down kidnappers while sucking on a lollipop, he is busy breaking into duets with the heroine in exotic locations.\n\nOne can only watch in disbelief as the actor dances in colour-coordinated clothing, pretending that not a day has passed since the 1990s when he was called ‘Top Star’.\n\nYou wish some of the character’s ability to predict events had rubbed off on the actor himself… the fate of this film would have been obvious.\n\nvishal menon\n\nSaagasam\n\nGenre:Action\n\nCast:Prashanth, Amanda, Nassar, John Vijay\n\nDirector:Arun Raj Varma\n\nStoryline:An unlikely hero helps the police recover a large sum of money", 
    "section": "national", 
    "title": "Dated film for an outdated star", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}