{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The All India Sanyaasis Conference Committee, Kumbakonam, has appealed to Prime Minister Narendra Modi to take steps to declare Kumbakonam as a heritage town.\n\nA group of office-bearers of the committee led by its organiser ‘Thavathiru’ Marudasala Adigal, chief coordinator Swami Ramananda and Media and Public Relations in-charge V. Sathyanarayanan met Mr. Modi during his visit to Coimbatore recently and submitted a memorandum containing this demand.\n\nThe memorandum said temple town Kumbakonam had several shrines which were centuries old, including the globally famed Darasuram Temple besides housing ancient mutts and Veda Patasalas. Kumbakonam was a spiritual town with celebrations organised every year and a culturally rich place where music and art flourished. Taking into account all these aspects, the Centre should declare Kumbakonam as a heritage town, the memorandum further said. The committee members appealed to the Prime Minister to execute the Kumbakonam–Jayamkondam–Vriddhachalam new railway line project.\n\nKumbakonam was a spiritual and tourist town and a central place for devotees visiting the ‘Navagraha temples’.\n\nIf the new line was approved and executed, it would elevate Kumbakonam as a railway junction and reduce the distance to Chennai, Tirupati, and Bengaluru by 40 km, 60 km and 100 km respectively. The new line would prove beneficial to travellers besides helping in boosting trade, tourism, and freight movements, it said. The estimate for the 74.3-km new railway line had been sent and was pending approval from the Railway Board and the Railway Ministry, it further said requesting the Prime Minister to take steps to implement the project.\n\nThe committee will be organising an all-India saints’ conference at Govindapuram near Kumbakonam in connection with the forthcoming ‘Mahamaham’ celebration.\n\nThe conference to be held on February 18, 19,and 20 will see the participation of matathipathis and saints.", 
    "section": "national", 
    "title": "Declare Kumbakonam a heritage town: seers urge Prime Minister", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}