{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Local admin. will make a move after hearing public views\n\nIn a move towards conducting local body polls, the Local Administration Department has announced that it would complete delimitation process after hearing views of public soon.\n\nAn official press release from Local Administration Department said the last delimitation was carried out in the Union Territory of Puducherry on the basis of 1991 census.\n\nOn the basis of 2011 census\n\nAt present, due to rapid population in the Union Territory of Puducherry during the past 20 years, delimitation has to be done on the basis of 2011 census. The government has formed a committee for the delimitation.\n\nOn the basis of recommendations of Delimitation Committee, draft proposal for fixing the number and boundaries of the wards in the municipalities, commune panchayats and village panchayats has been notified.\n\n“As per notification, the details of delimitation of wards in the municipalities, commune panchayats and village panchayats on the basis of 2011 census will be placed/ available in the respective municipalities, commune panchayats and village panchayats of UT for suggestions and objections by the general public”, said G.Ragesh Chandra, Local Administration Secretary.\n\nThe objections and suggestions regarding the delimitation of wards in the municipalities, commune panchayats shall be sent to the Director, Local Administration Department, on or before March 3.\n\nThe objections or suggestion so received shall be considered by government.\n\nOriginally, the polls to local bodies were conducted in December 1968 before the legislation of Panchayat Raj Act came into effect from 1993.\n\nFollowing this, several States including the neighbouring Tamil Nadu conducted the polls to the local bodies while Union Territory of Puducherry did not do so for long.\n\nPublic interest litigation\n\nUnder these circumstances, the Court ordered the Puducherry Government to conduct polls on public interest litigation filed by the Communist Party of India-Marxist(CPI-M), unit secretary V. Perumal. Eventually, the polls to local bodies were conducted in July 2006---a hiatus of 38 years.\n\nHowever, when the term of local body representatives ended, the ruling All India NR Congress Government which promised local body polls ahead of Assembly polls in 2011, however preferred to appoint special officers to the local bodies.\n\nOnce again, the matter was taken to court by CPI (M) unit then the secretary in 2011 seeking the conduct of polls immediately. He had stated that following a High Court order, the local body elections were held in 2006.\n\nThough the tenure of the elected representatives ended in that year, the authorities had not appointed a State Election Commissioner (SEC).\n\nThey were duty-bound to hold panchayat and municipal elections every five years. On March 2012, the Madras High Court had directed the Puducherry government to hold elections to the local bodies in the union territory within six months.\n\nThe elections, which were originally scheduled to be held on 4, 8 and 10 December, 2012 by the State Election Commission (SEC), were deferred as per the direction of Madras High Court that had asked the territorial administration to carry out the delimitation and reservation of municipal, commune and panchayat wards based on 2011 census data.\n\nThe direction was given by the court following a petition filed by J. Anandalakshmi. Disposing of the matter recently, the Madras High Court has directed the government to complete delimitation process.\n\nMr. Perumal said, “The present notification for delimitation is a mere eye wash. The present ruling AINRC had promised to conduct local body polls in the run-up Assembly polls in 2011, but gone back on its word on coming to power.”\n\nHe further added that the government should soon complete the delimitation process and conduct polls local bodies immediately within three months after the forthcoming Assembly polls are over.\n\nHighlights\n\n* Decks cleared for long overdue local body polls\n\n* Process begun after a recent directive from Madras High Court\n\n* LAD initiates delimitation exercise based on 2011 Census\n\n* Delimitation committee notifies draft proposal\n\nLast delimitation process was carried out in Puducherry on the basis of 1991 census", 
    "section": "national", 
    "title": "‘Delimitation process will be completed soon’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}