{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "The Commissioner of Railway Safety, on Saturday, approved the modified design of Linke Hofmann Busch (LHB) coaches rolled out by the Integral Coach Factory (ICF) here, enabling the Southern Railway to put them to use. However, the coaches will remain idle in the yards due to short supply of power coaches required to operate them.\n\nA week ago The Hindu had reported that several lightweight LHB coaches worth several crores of rupees built with German technology were idling in the yard pending safety clearance. The cost of manufacturing each coach is roughly around Rs. 2.5 crore. According to sources in Southern Railway, the CRS accorded safety clearance to the modified design of the LHB coaches. Since there were no power coaches, 20 of the 30 odd new coaches allotted to the zone were likely to be moved to South Central Railway.\n\n“There is no request from the Southern Railway either for new LHB coaches or power coaches. So most of the allotment is going to zones that have placed a demand, a senior railway official said.\n\nThe use of LHB coaches with inbuilt world class safety and comfort features was recommended by a high-level safety review committee, led by Anil Kakodkar, that submitted its report in 2012. It strongly recommended stopping production of conventional coaches and completely switching over to LHB design coaches immediately”.\n\nIt had suggested creation of commensurate facilities in production units and workshops.\n\nThe committee, including ‘Metro Man’ E. Sreedharan, stated, “With the Introduction of long formation of trains running at moderately high speed of 110 to 120 Kmph, use of ICF designed coaches is not desirable from safety point of view. The latest design of LHB coaches was far safer and secure to bear the impact loads arising out of accident scenarios.”\n\nThe report also noted that ICF-designed coaches for Mail or Express trains with as many as 22 to 24 carriages were unsafe in the event of collision or sudden derailment. Despite this warning, factories of Indian Railways continue to manufacture the conventional coaches. In fact, the number of conventional coaches rolled out of ICF is double that of LHB coaches.\n\n“Though the high-level safety review committee concluded four years ago that conventional coaches are not safe and recommended that we totally migrate to LHB coaches, we are nowhere close to achieving that target. Southern Railway has the largest number of conventional coaches in the country and the lowest number of LHB coaches,” an official said.\n\nThe sophisticated carriages have safety clearance but require power coaches to run", 
    "section": "national", 
    "title": "German coaches to remain off track", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}