{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Seminar on non-communicable diseases begins\n\nHealth research in India needs a lot of advocacy and great examples to go forward, said director general of the Indian Council for Medical Research (ICMR), Soumya Swaminthan.\n\n“Many researchers struggle with no peer group or mentors, and we need to see how we can create virtual networks, to share ideas, get inputs and discuss. Research needs intellectual inputs all the time, it cannot be done in isolation,” she said. Dr. Swaminathan was speaking at the inauguration of a seminar on ‘Prevention and control of non-communicable diseases,’ conducted by the Madras Diabetes Research Foundation (MDRF) in collaboration with the University of Alabama, Birmingham, United States.\n\nCapacity building is high in the priorities of the ICMR, Dr. Swaminathan said, adding that multi-disciplinary research units had been set up at 48 medical colleges in the country, including at Madras Medical College. Model rural health research units had also been set up at 12 places, she said. “We are also thinking about how to establish centres of advanced research with public and private partners,” she said.\n\nOn the rising incidence of non-communicable diseases, Dr. Swaminathan said there was need to see whether schoolchildren were receiving the right kind of diet and exercise, adding that a study had shown that the amount of salt Indians consumed on an average was higher than what it should be.\n\nDr. Swaminathan was also conferred the eleventh MDRF-UAB-FIU Gold Medal Oration Award for her contribution to the field of medicine.\n\nMDRF, along with Dr. Mohan’s Diabetes Specialties Centre, had also taken up a programme on ‘Strengthening Indian NCDs clinical research and training capacity,’ supported by the University of Alabama and the Florida International University and University of Minnesota, said V. Mohan, president, MDRF.\n\nThe seminar will end on February 7.", 
    "section": "national", 
    "title": "Health research lacks peer support, mentors: ICMR chief", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}