{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Stay operation of show cause notice and suspension order issued by MSU\n\nThe Madras High Court Bench here has stayed the operation of a show cause notice as well as suspension order issued by Manonmaniam Sundaranar University (MSU) in Tirunelveli against a Muslim research scholar, also a part-time parotta master, after doubting allegations of criminal intimidation levelled against him due to his activism.\n\nPassing interim orders on a writ petition filed by Mohamed Khan, Justice D. Hariparanthaman said the order passed by the university on October 1 directing the petitioner to abstain from attending research and other related activities and restricting his presence on the campus was against the Centre’s aim of providing higher education opportunities to minorities.\n\nThe judge pointed out that the petitioner, a Senior Research Fellow pursuing his doctorate in the Department of Criminology of MSU, had claimed to have made applications under the Right to Information Act, 2005 to the university seeking details of fund transactions of a particular organisation and alleged illegal absorption of Assistant Professors in the varsity.\n\nSubsequently, he also supported a group of women students who levelled sexual harassment charges against an Assistant Professor. As an aftermath, another teaching faculty member of the university lodged a police complaint on September 25 accusing the petitioner of having threatened him on September 1 and this turned out to be the reason for the suspension.\n\nWondering why the complainant waited for 25 days to approach the police and pointing out that a lawyer’s notice issued by the complainant to the petitioner, prior to registration of FIR, does not state anything about the alleged incident that took place on September 1, the judge said: “For all the aforesaid reasons, I am of the view that the FIR itself has to be viewed with suspicion.” Further, the judge said the university’s decision to suspend the petitioner “was opposed to formulations of the Government of India with regard to inclusiveness of minorities in higher education.”", 
    "section": "national", 
    "title": "High Court comes to the rescue of research scholar", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}