{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Indian Institute of Crop Processing Technology (IICPT), Thanjavur, has signed a memorandum of understanding with SRG Organic Foods, a company jointly promoted by the Southernland Research Group and Origin ITFS, for carrying out collaborative programme of research, new product development, training, application trials, and analytical services.\n\nThe MoU says the technological collaboration will help in making new food products following process such as in vitro and field trials. The tie up will play an effective role in testing the quality and nutritional facts of various products. The pact paves the way to coordinate the application of field and clinical trials on various food products using highly bio-available, bio-active agents from natural origin leading to development of value-added products.\n\nAs per the MoU, there will be a series of joint in-plant training for students, employees and entrepreneurs in the areas of product development, sourcing methodology, and good manufacturing practices.\n\nAs for research, focus will be on the creation of a research wing in the SRG farms and manufacturing centres.\n\nIICPT Director Singaravadivel said the institute's Food Processing Business Incubation Centre, the NABL certified Food Quality Testing Laboratory and Knowledge Centre are the best in business. Such tie-ups with industry will make Indian brands compete in international market by improving the manufacturing and packaging practices.\n\nM. Natchimuthu, Director and Chief Executive Officer, SRG Group, said as the market for food products was growing enormously the competitive edge must grow on a par with the scale of demand. He said the SRG Group was making the largest organic hub in the country and the concept of “Food is Medicine – Medicine is Food” is to be focused.", 
    "section": "national", 
    "title": "IICPT signs MoU with SRG unit for new food products", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}