{
    "author": [
        "B Kolappan"
    ], 
    "text": "The dark green leaves and rosy petals of lotus flap in the wind. Pelicans swimming majestically explore the water for fish along with hundreds of other species and migratory birds. At any given point of time, a picturesque view of waterbodies in Kanyakumari district is guaranteed. The climate has been cool so far.\n\nHowever, the greenery the district was known for seems transient as paddy fields and wetlands are being converted into plots at a feverish pace.\n\n“Soon the fine weather will be replaced by humid conditions and it will be unbearable as the wetlands are fast disappearing,” said Robert Grubh, former principal scientist, Bombay Natural History Society. In almost every village of Kanyakumari district, there is a waterbody on one side and a paddy field on the other. Today, without exception all of them have fallen prey to real estate business.\n\n“The district is losing about 1,000 hectares of paddy field every year. According to information available at the district Agriculture Department, the area of cultivation has come down from 32,153 hectares in 1998-99 to 20,063 in 2007-08. In 2015, the area dwindled to just 16,000 hectares,” said Lal Mohan, convener, Nagercoil chapter of the Indian National Trust for Culture and Heritage .\n\nThe conversion of paddy fields and wetlands is rampant in the northern parts of Kanyakumari and Putheri, a village near Nagercoil.\n\n“What is happening here is a flagrant violation of the Town and Country Planning Act, 1971 and the 47-A amendment brought in 2010. Panchayat presidents give layout permission to real estate agents even though they have no power to do so. Officials of the Revenue Department remain mute spectators as politicians are behind such activities,” Mr. Lal Mohan alleged.\n\nMr. Grubh said destruction of paddy fields would render waterbodies irrelevant and the consequences would be serious. “The aquifer will get depleted and it may lead to incursion of seawater as Kanyakumari is a coastal district,” he added.\n\nImpact on birds\n\nOn the impact of changes on birds, he wondered if anyone was really bothered about the 120 species. “They will be dead and gone and who is going to make it an election issue? But very soon people will also suffer and the disappearance of waterbodies and wetlands will lead to climatic changes in the district which is very vulnerable,” Mr. Grubh said.\n\nMr. Lal Mohan demanded an inquiry into involvement of politicians and officials in converting paddy fields into housing plots. He also urged the Union Environment Ministry to probe the issue.\n\nDistrict losing about 1,000 hectares of paddy field every year, says scientist", 
    "section": "national", 
    "title": "Kanyakumari falling prey to real estate business", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}