{
    "author": [
        "Deepu Sebastian Edmond"
    ], 
    "text": "Job aspirants from in and around OMR attended the special job fair organised by TNSCB and the Department of Employment and Training.— Photo: G. Krishnaswamy\n\nSelva Kumar was thrust repeatedly into the limelight, sometimes quite literally, on Saturday. The local MP and MLA wanted to be seen with him on television. Grassroots AIADMK workers made sure he stood first in the queue when it was time for him to go up on stage; they even made space for Selva in the front row of chairs.\n\nSelva probably landed the best offer at a job fair targeted at those resettled after the floods last year. Organised by the state's Slum Clearance Board, Department of Employment and Skill Development Corporation, it was held at D.B. Jain College in Thoraipakkam.\n\nSelva, who now lives in Kannagi Nagar after having lost his house in Tambaram to the waters, passed out of his Electrical and Electronics Engineering course last year. “I have been offered a job by the VST Group to work in Sales. They told me I would be paid a starting salary of Rs. 15,000 per month. I am supposed to go to their office on Monday to find out more,” he said after receiving the offer letter from Animal Husbandry Minister T.K.M. Chinnaiah.\n\nThe 23-year-old was one of the lucky few who returned home with a sense of assurance. For a number of others, the day was an extension of the uncertain times they have faced since last November. Mangalakshmi was among a group of housewives who began an argument with those in the minister's entourage during his tour of the fair. “I used be a domestic help in Tambaram before the floods; my husband was an electrician. This is the third month without work for both of us. I must have visited at least 20 companies along the OMR since being moved to Perumbakkam,” she said.\n\nSince the floods, the TNSCB has moved 3,753 families to units in Perumbakkam, Ezhil Nagar and Kannagi Nagar — all 20-30 km from Chennai — and along the Old Mahabalipuram Road, lined by the state's Information Technology companies. Kannagi Nagar has 15,656 units while Ezhil Nagar has 8,048 and Perumbakkam, about 13,000.\n\nUnemployment — especially among men — has been high in Kannagi Nagar, the oldest of the settlements which began hosting those resettled by the State, in 2000. Nevertheless on Saturday, there were only a handful from among previous residents at the job fair despite it being open to all — a new wave of settlements seem to have brought along a new generation of the unemployed.\n\nDhanasekhar (23) kept looking out the window of the auditorium at D.B. Jain and into the courtyard below, where a hundred milled about, hopeful of a job. The resident of Pallavaram was better off than them — his presence in the room meant he had a job offer — but he was uneasy. “I have been sitting in this room for two hours, when I could be out there, looking for better jobs,” he said. He had arrived early — around 9 am — and had proceeded to apply for a job at a stall set up by an automobile company. Its representatives sent him to the auditorium, where other firms had already sent about 150 such early birds. “I have no idea what job I will be doing. I merely applied for whatever they were offering. They said I would be paid Rs. 7,000 monthly,” chuckled Dhanasekhar, as he waited for the appointment letter.\n\nWhen The Hindu caught up with Dhanasekhar later, he sounded distraught: “I contacted the firm after receiving the appointment letter. They said that they would call me when they have a job for me. They did not sound like they would anytime soon.”\n\nA large number of prospective employers at the fair seemed to be focusing on building up a database first. “We are collecting phone numbers now and will contact them when suitable jobs come up,” said a representative of a management consultancy who claimed to have cleaning, electrical and plumbing jobs on offer.\n\nA total of 6,022 registered for the job fair with 568 securing appointment letters. Another 1,404 registered for skill development training with the TNSDC.\n\nThe event was targeted at\n\nthose resettled\n\nafter the floods\n\nlast year", 
    "section": "national", 
    "title": "Luck smiles on some at job fair for flood-hit", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}