{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Kalabairavar puja, Railway Colony, 5 p.m.\n\nPanniru Tirumurai Mandram: Pannisai by S.S. Mohanram, Adi Street, 7 a.m., Discourse on ‘Peria Puranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Vallalarin Vaalvum Vaakum’ by Rama. Pandurangan, 5.45 p.m., aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nBharati Yuva Kendra: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Upanishad class, P and T Nagar, 6.45 p.m.\n\nChurch of Christ: Sunday service, Bro. Devamanickam speaks, Thanksgiving by M.S. Raja, Viswasapuri, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nOur Lady of Lourdes Church: 96{+t}{+h}annual festival; holy mass, Rev. Fr Alphonse Lazar leads 5.30 a.m., Rev. Fr. Rex, leads, 9.30 a.m., prayer, K. Pudur, 6 p.m.\n\nThe American College: Sunday vespers service, Dr. M. Gnanavaram preaches, Dr. S. Wellington leads, Jubilee chapel, 6 p.m.\n\nCircuit Assembly of Jehovah’s Witnesses: One-day “imitate Jehovah” Rajah Muthiah Mandram, 9.30 a.m.\n\nCULTURE\n\nThe Hindu and Velammal Medical College: Sangeetha Mahotsavam; vocal concert by Nityasri Mahadevan, Velammal College of Engineering and Technology, Viraganoor, 6 p.m.\n\nSri Sathguru Sangeetha Samajam: Vocal concert by Kottayam Srimathi Mathangi Sathyamurthi, Lakshmi Sundaram Hall, 6 p.m.\n\nImmayil Nanmai Tharuvaar Temple: Kootu Prarthanai Kuzhu conducts prayer by Illampirai Manimaran, West Masi Street, 6.30 p.m.\n\nUniversal Peace Sanchiary: Free meditation class by Sathguru Sundaramoorthi Sachidananda, Mariamman Teppakulam, 138 Kamarajar Road, 7 p.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nJain Vidyalaya: 37{+t}{+h}annual day celebrations, Dr. O.K. Jibreel Oysul, consultant and head – Dept. of Dental Surgery, Meenakshi Mission Hospital and Research Centre, chief guest, school campus, 5.30 p.m.\n\nVivekananda College: One-day special camp by NSS volunteers, Tiruvedakam, 6 a.m. and 5 p.m., Uzhavara kuzhu conducts cleaning camp, Pon Perumal Temple, Vadipatti, 8 a.m. and 5 p.m.\n\nBrainoBrain Kids Academy: 62{+n}{+d}regional competition, Madura College campus, 9 a.m.\n\nVidiyal: Training in ‘Self-hygiene’ Muthupatti, 9.30 a.m.\n\nAlcoholics Anonymous: Meeting, Justice V.R. Krishna Iyer Community Hall, 7 p.m., Alfred Noble Mat. School, 8{+t}{+h}stop, Tirunagar, 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, Melur, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}