{
    "author": [
        "Staff Reporter"
    ], 
    "text": "C. Muthusamy (50) of Udayampalayam, near Chinnavedampatti, died on Friday after consuming poison at his house.\n\nThe police said that it was his fourth attempt to end his life. He was a head loader, and reportedly an alcoholic.\n\nA few months ago, he had tried to commit suicide by hanging.\n\nThen he consumed poised twice. On Friday too, he consumed some poisonous substance and was admitted to the Coimbatore Medical College and Hospital, where he died.\n\nMoney swindled\n\nBased on a court directive the police have registered a case against two employees of an electrical outlet on the Sathy Road in Ganapathy for allegedly swindling several lakh of rupees by cheating the employer between 2008 and 2015. The police said that Rajesh and Selvaraj were taking care of the shop after the demise of its owner and cheated his family members by swindling money.\n\nThey have been booked under sections 406 (Punishment for criminal breach of trust), 409 (criminal breach of trust by public servant, or by banker, merchant or an agent), 420 (cheating and dishonestly inducing delivery of property), 468 (forgery for purpose of cheating) and 467 (forgery of valuable security) of The Indian Penal Code.\n\nJewellery stolen\n\nG. Thilagavathi (49) of Venkateswara Nagar in Kavundampalayam has lodged a complaint with the police on Friday alleging that about 100 gm of gold jewellery, and Rs. 9,000 she had kept in a bag was stolen when she was travelling in a TNSTC bus on December 19, 2015.\n\nThe police registered a case under section 379 (punishment for theft) of the Indian Penal Code.\n\nBody found\n\nThe decomposed body of a man suspected to be aged about 30 was found hanging from a tree with a nylon rope tied around his neck on Friday.\n\nThe police said that forest guard A. Annamalai (42) found the body at JJ Kuttai in Odanthurai Reserve Forests, near Mettupalayam.", 
    "section": "national", 
    "title": "Man ends life in fourth attempt", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}