{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Official says Priyanka’s daughter will emerge as an ace player in future\n\nMiraya Vadra (jersey number 15 ), daughter of Priyanka Gandhi, making a move at the sub-junior basketball national competition at the Rajiv Gandhi indoor stadium in Puducherry on Saturday.— Photo: T. Singaravelou\n\nHaryana, which features Priyanka Gandhi’s daughter Miraya, on Saturday crashed out of the quarterfinals of the 42nd Sub-Junior National Basketball Championship which has been under way since Monday.\n\nMs. Priyanka and her daughter Miraya Vadra have been staying at a private hotel amid a ring of tight security.\n\nCongress president Sonia Gandhi’s grand daughter Miraya is an eighth standard student of a private school in Gurgaon and is actively playing basketball at school- and State-level.\n\nDalbir Singh Kharab, Secretary General of Haryana Basketball Association, is confident that Miraya will emerge as an ace player in future.\n\nFrom day one, she has figured in all league matches. Managing to enter pre-quarter final stage, the Haryana girls team faced Chattisgarh girls on Saturday.\n\nEarly morning, Haryana girls booked a spot in the quarterfinals with a 55-52 victory over Telangana.\n\nHowever, Chhattisgarh girls, who finished runner-up last year, completely outplayed their opponents. Haryana seemed overwhelmed by the seasoned Chhattisgarh side, coached by veteran Rajesh Patel. Elijabet Ekka netted 30 points for Chhattisgarh as they cruised to a 76-32 win.\n\nThis ends the Haryana girls’ run in the tournament and Chhattisgarh girls have advanced to the semi-finals again this year. However, Haryana girls will play again for ranking on Sunday. Haryana team managers cited illness of a couple of players as one of reasons for defeats in the matches.", 
    "section": "national", 
    "title": "Miraya’s team loses in quarterfinals", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}