{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Petitioner is entitled to a government job on compassionate grounds, says High Court Bench\n\nIn a significant order, the Madras High Court Bench here has directed the Home Secretary to provide a suitable job in the State government to a Dalit woman whose elder brother was murdered by a group of four Caste Hindus at Manapparai Taluk in Tiruchi district on April 26, 2015.\n\nDisposing of a writ petition filed by Sudha, sister of Muthukumar, Justice D. Hariparanthaman held that the petitioner was entitled to a government job on compassionate grounds in terms of Clause 21 of Annexure I of Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Rules, 1995.\n\nThe judge pointed out that Rule 12(4) of the statutory rules mandated the district administration to provide immediate relief in cash and kind, including food, water, clothing, shelter, medical aid, transport facilities and other essential items to victims of atrocities, their family members and dependants.\n\nFurther, Clause 21 of Annexure I lists out other reliefs to which victims of murder, death, massacre, rape, mass rape, gang rape, permanent incapacitation and dacoity and those benefits include paying pension to dependants or providing a government job, agricultural land or a residential house. Stating that as per the rules employment to one member of the family of the deceased should be provided within three months of the atrocity, the judge said that the writ petitioner was fully entitled for a government job as more than three months had passed since her brother was murdered.\n\nMr. Justice Hariparanthaman also pointed out that the petitioner had initially filed a petition in the High Court under Section 482 of the Code of Criminal Procedure seeking employment.\n\nFiling a counter affidavit in that case, the police had submitted that a recommendation had already been made to the government.\n\nNevertheless, the court dismissed that petition on the ground that a direction to appoint her in public service could not be issued under the Cr.P.C., and hence she had come up with the present writ petition.", 
    "section": "national", 
    "title": "Murder by caste Hindus: State govt. told to give job to woman", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}