{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Six landing centres proposed at a cost of Rs. 28 crore\n\nThe district administration has planned to build landing centres at nine select places in the coastal villages in the district under the Rural Infrastructure Development Fund (RIDF) of the National Bank for Agriculture and Rural Development (NABARD) so that fishermen would be able to venture into sea or return to land without much trouble, particularly during the low tides and high tides.\n\nThe district accounts for about 42 km coast but does not have a full-fledged jetty or landing point. Being a shallow water coastal zone, the fishermen found it difficult during venturing into the sea and returning to land. The problem of venturing or landing is acute during the low tides and high tides and the Fisheries Department had mooted construction of landing places – six small units and three major landing units. The estimate for the landing points was about Rs. 28 crore.\n\nS. Ganesh, District Collector, has impressed upon NABARD to sanction the funds under the RIDF.\n\nAccompanied by V. Chelladurai, General Manager, NABARD, the Collector visited the coastal areas and explained the need for constructing the landing points.\n\nThe Fisheries Department had identified the places including Ponnagar, Kattumavadi, Ammapattinam, and Pudhukudi.\n\nMr. Chelladurai assured the Collector of prompt action on the proposal in consultation with the technical units of the NABARD.\n\nWater scheme\n\nLater, accompanied by Mr. Chelladurai, Mr. Ganesh inspected the work on the implementation of the Coleroon Combined Drinking Water Supply Scheme being implemented at an estimate of Rs. 350 crore under the RIDF.\n\nChinnasamy, Executive Engineer, Tamil Nadu Water Supply and Drainage Board, which was executing the scheme, explained the significance of the scheme. The scheme aimed at supplying protected drinking water to an estimated population of 7.63 lakh in eight panchayat unions in Pudukottai district and the Vallam town panchayat in Thanjavur district. The per capita per day (lpcd) would be 40 litres and currently, the residents were supplied drinking water got from local borewells.\n\nTo start with, distribution pipelines to a cumulative length of 130 km have been laid from the head works in Tiruchennampoondi on the Coleroon near Tirukattupalli in Thanjavur district to the Mullur panchayat in Pudukottai district, covering 1,751 hamlets. Sumps had been constructed at 249 places.\n\nS. Somasundaram, District Development Manager, said residents of Karambakudi, Tiruvarangulam and Aranthangi would benefit in a big way under the scheme.\n\nThe draw would be 23.23 million litres per day to benefit villagers in parts of five unions — Viralimalai, Annavasal, Kundrandarkovil, Gandarvakottai and Pudukottai panchayat unions and the whole of three major unions — Karambakudi (1.2 lakh population), Tiruvarangulam (2 lakh), and Aranthangi (1.23 lakh population).\n\nThe work would be completed in course of time, Mr. Ganesh told the visiting NABARD officials.", 
    "section": "national", 
    "title": "NABARD aid sought in building nine landing centres in Pudukottai district", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}