{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The details of the police personnel who did exemplary service during January have been displayed at the City Police Commissioner’s office in Salem. —Photo: E. Lakshmi Narayanan\n\nThe City Police has adopted a novel way to motivate its workforce by prominently displaying the details of the police officers and men who did exemplary service in maintaining law and order and in detecting crimes every month in the Police Commissionerate.\n\nThe novel concept was the brain child of Sumit Saran, City Police Commissioner, who assumed charge here a few months ago.\n\nThe display boards carry the names of the police personnel, the police station to which they are attached to and the details of the good work which fetched them the honour.\n\nThe record of six police personnel has found a place in the display board for the month of January.\n\nS. Senthilkumar, head constable attached to Annathanapatti police station rendered able assistance to his superiors in bursting a prostitution gang by effecting the arrest of five persons. He was instrumental too in booking all the five under the Goondas Act.\n\nS. Jayakumar, head constable attached to Ammapettai police station, played a key role in assisting the prosecution in a murder case that took place in 2007, which paved way for awarding life sentence to all the three accused.\n\nJ. Babu, also a head constable serving in Kannankurichi police station, ably assisted the prosecution in a murder case that took place in 2010, due to which the two accused were given life sentence.\n\nThe trio of V. Kumarasamy, Sub-Inspector, and A. Velu and A. Baskar, both head constables of Shevvapet Police Station, managed to nab the accused who burgled Rs. 6.84 lakh from a house within 24 hours of the incident. The entire booty was retrieved intact from them.\n\nThe photos and the details of all the six have been displayed in the Police Commissioner’s office.\n\nWhen contacted, S. Prabakar, Deputy Commissioner of Police, said that the details of the men who did exemplary service are displayed every month from the month of November. The display of details serve the twin purpose of recognising the good work done by the men and also in motivating the entire police force. Equal importance is given to both officers and men on this aspect, Mr. Prabakar said.", 
    "section": "national", 
    "title": "Novel initiative to motivate police personnel", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}