{
    "author": [
        "Balasubramaniyan S", 
        "Vijay Kumar", 
        "A D"
    ], 
    "text": "The crater formed after the object, believed to be a meteorite, fell on the campus of Bharathidasan Engineering College, near Natrampalli, in Vellore on Saturday.\n\nOne person was killed and three others were injured when an object believed to a meteorite fell on the campus of a private engineering college near Natrampalli in Vellore district in northern Tamil Nadu early on Saturday.\n\nAccording to police sources, a loud blast was heard near a water tank shortly after midnight on the Bharathidasan Engineering College premises in K.Bandarappalli village. Kamaraj, a college employee, who had gone to drink water suffered serious injuries and was declared dead when taken to the Vaniyambadi Government Hospital. Three others suffered minor injuries. Window panes and wind screens of buses parked nearby and the water tank were broken in the impact of the blast. A crater was formed at the site of blast.\n\nThough there was suspicion that it was a bomb blast, preliminary investigation by forensic and bomb experts showed no sign of any explosive substance at the scene. Pieces of a rare kind of stone were found and samples taken for analysis by scientists.\n\n“We can rule out the possibility of any terror angle or sabotage. Not a single ingredient pertaining to any kind of explosive was found at the site. We suspect it to be a meteorite fall,” a top police official told The Hindu on Saturday. After a similar blast was reported in a paddy field at Alangayam in the same district on January 26, a senior Astrophysicist of the National Physical Laboratory, Ahmedabad, came to the district for a study. “The scientist was camping nearby and rushed to the college soon after hearing the news of the blast. We are convinced that it is a meteorite that fell with high velocity. In the earlier incident, local people remember having seen an object falling from the sky in the field,” the official said.\n\nA special team of the Bomb Detection and Disposal Squad, led by Deputy Superintendent of Police Asir Vijay Kumar, inspected the scene and ruled out the use of grenades. Vellore Superintendent of Police Senthilkumari also visited the spot. Investigators were trying to check if the college had any CCTV camera covering the disturbed area.", 
    "section": "national", 
    "title": "One dies as ‘meteorite’ falls in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}