{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Following the directions of Election Commission of India (ECI), the Union Territory Government on Saturday effected massive transfers at the level of Indian Administrative Service (IAS), Puducherry Civil Services (PCS) and police.\n\nNotification issued\n\nChief Secretary Manoj Parida issued a notification following approval of Lieutenant Governor allocating subjects among the officers with immediate effect.\n\nAs per the notification, Dr. S. Sundaravadivelu has been posted as District Collector, Puducherry - cum - Special Secretary (Revenue).\n\nThe incumbent D. Manikandan was transferred and posted as Secretary, Information Technology, Economics and Statistics, Stationery, Printing and Fire Service.\n\nSimilarly the present Karaikal District Collector E. Vallavan has been transferred and posted as Labour Commissioner.\n\nKaraikal Collector\n\nHe was also given additional charge as Managing Director, PPCL. In his place, Special Secretary T. Karikalan has been posted and he will continue to hold the additional charge of the post of Managing Director, PIPDIC.\n\nCholleti Prabhakar was appointed as Secretary, Fisheries, Sainik Welfare and Freedom Fighters Cell.\n\nAdditional subjects\n\nB.R. Babu, Welfare Secretary will also hold some additional subjects such as Hindu Religious and Wakf Department.\n\nP.S. Reddy has been allotted the subjects Personnel and Administrative Reforms in addition to Industries and Commerce. R.Kesavan has been appointed as Sub Collector, Karaikal.\n\nY.L.N. Reddy, Additional Secretary (Home)/ Labour Commissioner will continue as Additional Secretary(Home) and hold additional charge of Director of Higher and Technical Education. The present incumbent of Director Local Administration P.T. Rudra Goud shifted to report to Chief Electoral Officer for further assignment.\n\nDeputy Collector of North A. Vincent Rayar was transferred and posted as Director, Survey and Land Records.\n\nS.Kanagaraj was posted in the former’s place. Director, Art and Culture P. Ragini was transferred and posted Block Development Officer, Oulgaret.\n\nIn her place, S. Ganessin, Member Secretary of Bharathiar Palkalaikoodam was posted.\n\nMahe Regional Administrator transferred\n\nMahe Regional Administrator Mangalatte Dinesh has been transferred and posted as Additional Collector, Karaikal.\n\nIn his place, Deputy Collector, Karaikal S.Manickadeepan was posted.\n\nS. Thammu Ganapathy, Deputy Transport Commissioner was posted as Deputy Secretary, Chief Secretary. Project Officer, PUDA D.Subrahmanyeswara Rao was made as Deputy Transport Commissioner.\n\nCivil supplies\n\nDeputy Director of Civil Supplies S.Nagarajan was posted as Deputy Collector, Disaster Management Authority, Karaikal.\n\nA. Rajarathinam, MD Swadeshee Bharathee Textile Mills Limited will hold additional charge as Member Secretary, Bharathiar Palkalaikoodam.\n\nRegional Administrator, Yanam Giddi Balaram was posted as Project Officer, PUDA.\n\nMahe Municipality Commissioner Chaure Ratnaghosh Kishor was transferred and posted as Regional Administrator, Yanam.\n\nPondicherry Housing Board Secretary R. Djeacoumar was posted as Deputy Labour Commissioner and Under Secretary E.Rajeswari was posted Officer on Special Duty in Electricity Department.\n\nThe Officer on Special Duty in Electricity Department N.Anbalagan was made as Under Secretary, Chief Secretariat.\n\nB.Geetha was posted as Deputy Director of Civil Supplies, Karaikal.\n\nChanges in police department\n\nMeanwhile, the Police Department said as per the direction of the Election Commission of India, some of the police personnel who have completed more than three years of service in one place at Puducherry, Karaikal, Mahe and Yanam were transferred.\n\nAn official press release stated that accordingly a total number of 199 head constables and 526 police constables were transferred to different police units across the Union Territory.", 
    "section": "national", 
    "title": "Prodded by EC, govt. reshuffles officials", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}