{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Committee waiting for full details before launching an inquiry\n\nBharathiar University Registrar K.G. Senthilvasan has submitted a food bill for reimbursement saying that he had incurred the expenditure, Rs. 542, towards “official purpose” for attending the Higher Education Department meeting in Chennai.\n\nThe restaurant where he had dined on July 17, 2015 was in R.S. Puram, Coimbatore. On the same day, Mr. Senthilvasan had also submitted another food bill for Rs. 1,745 saying that he had incurred the expenditure “for official purpose” towards higher education meeting in Chennai. This bill is from a restaurant in Chepauk, Chennai.\n\nWhistleblowers who have dug out many such bills submitted by Mr. Senthilvasan ask how the Registrar could dine at two places in two different cities on a given day. Citing this bill as an example, they allege that the Registrar was submitting bills that had nothing to with his work.\n\nReferring to the bills that Mr. Senthilvasan had submitted for reimbursements, the whistleblowers wanted to know if he had purchased cheese sandwich, ‘samai’, ‘seedai’ and also taken food on parcel as part of his official duty.\n\nIn a bill dated November 7, 2015, the Registrar had submitted a bill for Rs. 1,120 towards purchase of jalebi.\n\nThe bill has the seller’s name, ‘Hotel Jalebi, P.N. Pudur’ stamped on it and has no other detail. There are several such cash bills that have been fictitiously submitted, they allege.\n\nTo underscore their argument, they cite another bill, the one dated September 26, 2015 where against the name of a popular chain of restaurants, there is a handwritten bill. When did the restaurant start issuing handwritten bill, they ask.\n\nIn another bill, the Registrar has submitted a bill that includes a bun for Rs. 5, they point out and add that many bills have been generated on Sundays.\n\nAsked about the bill and other such ones submitted for reimbursement, Mr. Senthilvasan says that his office might have purchased the bun to be used in rat trap. As for bills submitted on Sundays, he says that his office and he work on Sundays as well.\n\nIn response to the question on the bills generated the same day in two different cities, he says that he must have had food before leaving Chennai and the other as soon as landing in Coimbatore.\n\nContesting that there is nothing illegal, he says that his office and he are entitled to Rs. 25,000 as contingency expenditure and that he has been spending only for official purposes.\n\nAsked about the allegations, a member of the Vice-Chancellor Committee says that the committee too has received some complaints in this regard. It is waiting for full details before launching an inquiry.", 
    "section": "national", 
    "title": "Questions raised over bills submitted by Bharathiar University Registrar", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}