{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sunny Side Apartments residents handing over segregated waste to volunteers in the presence of Coimbatore Corporation Commissioner K. Vijayakarthikeyan on Saturday.– Photo: S. Siva Saravanan\n\nResidents of Sunny Side Apartments began the process of segregating and managing their waste.\n\nThey have done so with help of non-government organisations - Residents Welfare Association of Coimbatore (RAAC), Siruthuli, and Meiporul, says Roopa Prasanth, a resident.\n\nThe apartments’ builder Arima Constructions Pvt. Ltd. facilitated the process.\n\nCoimbatore Corporation Commissioner K. Vijayakarthikeyan inaugurated the initiative.\n\nMs. Prasanth said the apartment residents read about a few successful waste management practices, and decided to adopt the system. They therefore got in touch with RAAC and Meiporul for help and guidance.\n\nThe volunteers explained the ‘two bin, one bag’ system to the residents. The 200 residential units in the apartment will dump wet kitchen waste in one of the two bins and others in the other. They will store the paper, plastic and e-waste in the bag.\n\nThe apartments’ house-keeping staff will collect the waste and handed it over to the waste management volunteers who have set up a kiosk. The volunteers will take the wet waste to be used as manure.\n\nACC Cements will use hazardous and other waste as fuel. The paper and other recyclable waste will reach recyclers, says R. Raveendran of RAAC.\n\nMs. Prasanth says that the volunteers will collect the waste on all the seven days of a week. This will ensure that no waste from the apartments reaches the road.\n\nTo ensure the success of the project, the residents have also trained their house keeping staff and domestic helps as they are the ones who handle waste.\n\nMr. Raveendran says that the NGOs have taken up the apartments after successfully trying out the garbage disposal system in G.V. Residency, Mayflower and an another apartment in Vellalore.", 
    "section": "national", 
    "title": "Residents begin waste segregation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}