{
    "author": [
        "Deepa H"
    ], 
    "text": "Residents of Tiruvottiyur and Manali are demanding that the Rs. 47-crore road overbridge at Maattu Mandhai, a crucial link for thousands of industrial workers and school children, be completed soon.\n\nThe project to replace level crossing 3, which began in January 2014, has been progressing at a slow pace due to delay in transfer of land belonging to two temples.\n\n“Until the project began, the railway gate was open; and despite having to wait when trains passed by, we at least had a shorter route. But for two years now, we have been taking a circuitous route to reach industrial units, schools and colleges. The project seems to be prolonging. If it is not completed soon enough, residents will take it up as an election issue,” said V. Rajkumar, a resident of Therady.\n\nBecause of the delay, the already congested Tiruvottiyur High Road is taking more traffic than it can handle, said R. Uma, a resident.\n\nThe work is being jointly executed with Railways, which is constructing 38.48 metres of the bridge over the railway tracks. The 13.2-metre-wide, 550-metre-long, two-way facility is likely to take a couple of months to complete with three more deck slabs to be finished.\n\nLand acquisition took some time as a total of 4,259 sq m was needed and many structures were located on the land belonging to the Hindu Religious and Charitable Endowments Department.\n\n“We got permission to enter the land only a few weeks ago. We are also asking Railways to complete their portion of the work so that we can join it with our structure,” said a Highway Department source. Southern Railway officials said the girder was being fabricated in Andhra Pradesh. “We are at an advanced stage and hope to positively finish by March. The delay was due to the rains,” the official said.", 
    "section": "national", 
    "title": "Residents want overbridge project to be expedited", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}