{
    "author": [
        "Staff Reporter"
    ], 
    "text": "H.N. Dastur, Executive Secretary and Director General of Bharatiya Vidya Bhavan, Mumbai (third right), releasing the souvenir at the golden jubilee celebrations of Bharatiya Vidya Bhavan, Coimbatore Kendra, in Coimbatore on Saturday. R. Seshasayee, Chairman of Infosys (second right) is receiving the souvenir. Sanjay Jayavarthanavelu, CMD of Lakshmi Machine Works (left),B.K. Krishnaraj Vanavarayar, chairman of Bharatiya Vidya Bhavan, Coimbatore Kendra (right), and Swami Sankarananda Saraswati, Acharya, Arsha Vidya Gurukulam, are in the picture.— Photo: S. Siva Saravanan.\n\nThe responsibility of empowering India’s youth, rests with elders and institutions such as the Bharatiya Vidya Bhavan. If they fail, little can be done to empower the nation, said R. Seshasayee, Chairman of Infosys. He was speaking at the golden jubilee celebrations of the Coimbatore Kendra of Bharatiya Vidya Bhavan here on Saturday.\n\nCommitment to truth is what is desired of the youth as only truth triumphs (Satyameva Jayate). And, they should act in such a manner that truth is the pivot of their thoughts, words and deeds.\n\nMr. Seshasayee said there were two Indian heroes who held truth to be the pivot of their lives. One was Lord Rama and other Mahatma Gandhi. Both aligned their thoughts, words and deeds with truth and that was the reason that the people looked up to them.\n\nMr. Seshasayee also spoke about Erwin Schrodinger’s cat experiment to speak about relative truths. He said we were all part of the supreme truth that the Indian culture and scriptures always spoke about.\n\nSanjay Jayavarthanavelu, CMD of Lakshmi Machine Works, attributed the resilience of the Indian civilisation to inner strength and peaceful co-existence. That is the reason this civilisation continued to survive when others had come and gone. He said there was some merit in blending Indian culture and heritage with western knowledge.\n\nH.N. Dastur, Executive Secretary and Director General, Bharatiya Vidya Bhavan, urged the Coimbatore Kendra to get into more social service and think of schemes that could empower the under privileged. The down trodden people were getting more marginalised in the globalised world. He suggested the Kendra take up measures to feed the hungry and institute scholarships for students, and promised financial support.\n\nHe also spoke of a few programmes that the BVB had taken up in Kerala and Haryana.\n\nSwami Sankarananda Saraswati, Acharya, Arsha Vidya Gurukulam, appreciated the good work of the Coimbatore Kendra and that of the Bhavan in other parts of the country. B.K. Krishnaraj Vanavarayar, Chairman, Coimbatore Kendra, Bharatiya Vidya Bhavan, spoke of the Kendra’s activities in promoting cultural activities, recognising artistes and publishing books. He also said that the Kendra proposed to start an Academy of Excellence to take forward Swami Vivekananda’s ideals.", 
    "section": "national", 
    "title": "‘Responsibility of empowering youth rests with elders, institutions like BVB’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}