{
    "author": [
        "L Renganathan"
    ], 
    "text": "45 lakh pilgrims from throughout the country expected for the event\n\nVarious religious heads have said that taking a dip in the Mahamaham tank in Kumbakonam on any one of the days between February 13 and 22 is as good as taking a dip on February 22.— PHOTO: K.V. SRINIVASAN\n\nThe hallowed temple town of Kumbakonam is all set to receive the estimated 45 lakh pilgrims who will be congregating from across the country for having a holy dip in the Mahamaham tank on February 22.\n\nWith less than three weeks to go for the once-in-12-years event, authorities coordinating the infrastructure development and other special works are satisfied now after meeting almost all target dates although some works by their nature will carry into the event period.\n\nThe Mahamaham rituals start off on February 13 with the ceremonial flag hoisting in the Siva temples followed by a similar ritual in the Vishnu temples a day later on the Ratha Sapthami day. It has been announced by the religious heads that bathing in the celebrated tank since that day up to February 22 is as good as taking a holy dip on the Mahamaham day itself.\n\nThe various departments and agencies of the State government have executed a plethora of works to the tune of Rs. 133.48 crore in and around Kumbakonam for the benefit of pilgrims.\n\nTemples renovated\n\nThey include Rs. 13.15 crore worth renovation of ancient 12 Siva and five Vishnu temples undertaken by the Hindu Religious and Charitable Endowments Department, Rs. 40.32 crore spent by the Department of Municipal Administration and Water Supply for augmenting a slew of civic amenities, Rs. 30 crore made use of by the Highways Department to strengthen, renovate and lay roads and pathways, another Rs. 20.50 crore spent by the National Highways to strengthen the existing carriageways under its belt and Rs. 12.21 crore utilised by the Rural Development Department to shore up facilities on the periphery of Kumbakonam town.\n\nThe PWD (Water Resources Division) has spent Rs. 7.52 crore in executing numerous projects to meet the pilgrim demands even as the Construction and Maintenance Division undertook new projects and renovated some existing facilities at a cost Rs. 48 lakh. T\n\nhe TANGEDCO has executed some major power grid and distribution strengthening works at a cost of Rs. 5.41 crore.\n\nMost importantly, the authorities are working towards making the mega event people-friendly.\n\nThe planners are devising means to minimise the trek of the devotees inside the town.\n\nSeven temporary bus stands are proposed to be established on the periphery of Kumbakonam town on all sides.\n\nShuttle services have been proposed from these bus stands to the tank. The nine car parking lots established could accommodate more than 25,000 vehicles.\n\nThat apart, a green channel exclusively for ambulance and emergency use, would be created to evacuate people in medical distress to the nearest facility in the town during the Mahamaham day.\n\nFirst Aid Centres numbering around 200 and 250 help booths, all properly staffed with trained volunteers and paramedical professionals, would be established to guide the pilgrims and to provide proximate medical assistance in case of need.\n\nSeventy two police booths, monitoring cameras in 132 locations and revolving cameras in 26 spots besides road blocks in 1,163 places would bolster the security arrangements for the festival.\n\nThe planners are devising means to minimise the trek of the devotees inside the town", 
    "section": "national", 
    "title": "Rs. 133.48 crore spent on sprucing up temple town", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}