{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Criminal law cannot be expressive in all provisions and the judicial dispensation must bear in mind the cardinal principles of criminal jurisprudence in addition to accepting explainable human nature that aligns with human conduct which no law can change,” said S. Nagamuthu, judge, Madras High Court.\n\nDelivering the Knowledge Leadership Forum lecture on “Principles of Criminal Jurisprudence” at the School of Law at the SASTRA University near here on Saturday, Mr. Nagamuthu covered the various elements and dimensions of the criminal justice administration in the country.\n\nDividing India’s history of criminal jurisprudence on pre-constitutional and post-constitutional time lines, he stressed on the rule of law was the basis of administering justice in India.\n\nStressing the salience of constitutional principles, he said the Constitution was the touch stone of every statute.\n\nOn procedural law relating to criminal justice adjudication process, he traced the various stages of arrest enshrined in the Code of Criminal Procedure, 1973.\n\nExplaining the constitutional balance relating to the fundamental rights jurisprudence and the procedural nuances, he dwelt on the basic principles relating to the Criminal Procedure Code and the Indian Evidence Act, 1872.\n\nHe advised lawyers to be familiar with the provisions of the Evidence Act and assist the court in dispensing justice.\n\nMr. Nagamuthu said that India now stood at the transitory phase from following an adversarial model of justice to the inquisitorial system, where justice was to be delivered at the doorstep of the aggrieved.\n\nHe said that lawyers were professionals learned in varied fields and addressed the intricate interface between law, forensic science, and medical sciences.\n\nHe said that delivery of justice to the poor was his priority and the purpose of all the well settled principles of criminal jurisprudence had to culminate in justice for the last, the least, and the lost.\n\nRecent trends\n\nThe judge highlighted some recent trends in jurisdictional issues in registering a case, false complaints implicating the innocent, the people’s perceptive reaction towards the criminal justice delivery mechanism, and the filing of FIRs on receipt of complaints.\n\nHe explained the judgment of the Supreme Court in Lalita Kumari’s case and said the judgment had to be enforced applying practical realities.\n\nExploring the intricacies of the standard of proof in India, he delineated the meanings of admissibility, reliability, and sufficiency and in the context of adjudging criminal evidence.\n\nMr. Nagamuthu congratulated the winning moot team of the SASTRA Law School in the recently concluded Madras Bar Association Criminal Law Moot and appreciated the blend of criminal and constitutional law that the students mixed during the course of their arguments.", 
    "section": "national", 
    "title": "Rule of law is the basis of justice administration: judge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}