{
    "author": [
        "P V"
    ], 
    "text": "Sumitha, wife of Ramamoorthy, and Nanje Gowdu, his father, are entirely dependent on agriculture for survival.\n\nThis May, Sumitha would have celebrated her fourth wedding anniversary, if only 28-year-old Ramamoorthy had escaped the avalanche in Siachen. All of 22-years old, Sumitha is now a soldier’s widow.\n\nOnly that Ramamoorthy was a husband she barely knew. In the three-and-a-half years they were married, he had visited his village Gudisaadhanapalli only twice, thanks to his posting in the armed forces.\n\n“He wanted to retire after 58 years, and he was obsessed with the Army,” says Sumitha in Telugu. He called the Tuesday before last and the call lasted less than five minutes.\n\n“He said there was a long line of jawans waiting to talk to their families. But, he promised he would come in two months time,” says Sumitha. Now, she is unsure if even his body would ever arrive.\n\nSitting by his daughter-in-law, Nanje Gowdu, the severely diabetic 55-year-old father of Ramamoorthy, breaks down often. “I wanted him to join the Army so that all of us could have a better life.” The obedient son joined the Army at the age of 20, and held on to it out of his own love for it and his country.\n\nFor the family, Ramamoorthy’s joining the Army was more of a survival choice, to eke out a living away from the bone-dry landscape of Gudisaadhanapalli.\n\nToday, the family’s only possession is 1.5 acres of land, which is jointly cultivated by his father and uncle.\n\n“This year the ragi crop was better due to the rains. In a normal year, there is only drought,” says Ramakrishna Gowdu, Ramamoorthy’s uncle and the sarpanch.\n\nIt was an SSLC-educated Ramamoorthy’s earnings that shouldered the entire familyDistraught at the premature death of his son, for Nanje Gowdu, equally singeing is the silence of the district administration.\n\n“Not one person has called or visited us. The Collector never called to enquire. It was like nothing ever happened, even as my son died while guarding the country.” This father’s son, died without issue of his own.\n\nNanje Gowdu, looking aged beyond his years, has another worry. “My son used to take me to the Airforce Command hospital in Bengaluru. I wonder if I could still avail the treatment,” he says.", 
    "section": "national", 
    "title": "Soldier’s death leaves family in lurch", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}