{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Minister for State Highways and Minor Ports EdapadiK. Palanisamy presenting the Kalai Valarmani and Kalai Ilamani awards to artistes at a function in Salem on Saturday.— Photo: E. Lakshmi Narayanan\n\nSpecial awards were distributed to 15 renowned artistes in recognition of their exemplary service for the promotion of art and culture, here on Saturday.\n\nEdapadi K. Palanisamy, Minister for State Highways and Minor Ports, presented the awards at a function brought up jointly by the Department of Art and Culture and the Tamil Nadu Iyal Isai Nataka Mandram.\n\nMr. Palanisamy said that in 2001, the Chief Minister introduced the programme of honouring traditional artistes. The government allotted Rs. 3.75 lakh for the artistes in all the districts. Later, the financial allocation was increased to Rs. 8 lakh in 2012-13 and to Rs. 12 lakh during the next year.\n\nThe Minister said that the Iyal Isai Nataka Mandram had been providing monthly financial assistance to the traditional artistes who were living in penury. The monthly assistance was increased from Rs. 1,000 to Rs. 1,500.\n\nThe government had fixed an income ceiling of Rs. 12,000 per annum to get the financial assistance and the same was raised to Rs. 60,000, to cover more artistes. At present, a total of 9,432 artistes were getting the monthly financial assistance across the State, he said.\n\nExplaining various initiatives taken by the State Government for the promotion of art and culture, Mr. Palanisamy said that the government had been sending troupes of folk artistes to foreign countries to take part in tourism festivals. The government had earmarked Rs. One crore for the overseas tour programmes, he added.\n\nThe Minister presented ‘Kalai Muthumani’ award to T. A. Gnanamoorthy, K. Amirthalingam (music drama) and N. Jayalakshmi (vocal); ‘Kalai Nanmani’ award to P. Subramani, P. Rajendran (both street play) and P. Karuppiah (gramiya nagaswaram); ‘Kalai Sudarmani’ awards to P. A. Murugesan (nagaswaram), S. Ravi and M. C. Anguraj (both thavil); ‘Kalai Valarmani’ awards to P. Neelavathi (karagam), P. Ramanantha Murugan (nagaswaram) and P. Karthi (street play); and ‘Kalai Ilamani’ awards to S. Sharmila (flute), S.Swethan (folk dance) and S. Kiruthika (bharathanattiyam).\n\nThe Minister also presented commendation certificates to four persons for rendering service for the promotion of art and culture – Sittibabu (discourse exponent), K. Vijayalakshmi (vocalist), Ilampillai Annadurai (Saxophone) and Kaadayampatti S. Ilangovan (nagaswaram artiste).\n\nKarthik Raja, a Plus Two student of Glaze Brooke Matriculation School, was given a special award for creative writing.\n\nThe Tamil Nadu Iyal Isai Nataka Mandram organised a two-month long programme to impart training in acting for the youth of the district. The participants of the programme staged a drama titled ‘Pavalakodi’ authored by legendary Sankaradas Swamigal. Dindigul P. Sampath Kumar (harmonium and songs); Madurai T. S. Raja Mohammad (lyrics); Salem C. S. Muthukrishnan (acting) and Salem Fairoz (thabela) imparted training to the participants.\n\nV. Sampath, District Collector, presided. S. Soundappan, Mayor, V. Panneerselvam, MP, and B. Hemanathan, Assistant Director of Art and Culture, offered felicitations.", 
    "section": "national", 
    "title": "Special awards given to 15 artistes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}