{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In all, 54 winners given cash awards of Rs.10,000 each\n\nMinister for Sports and Youth Welfare S. Sundararaj distributing a trophy to Anna University women for volleyball at the State-level inter-university championship held in Ramanathapuram on Saturday.\n\nMadras University, Anna University and SRM University shared honours in a three-day Tamil Nadu State-level Inter-University Championship, which drew to a close here on Saturday.\n\nMore than 340 men and women from eight universities vied for honours in volleyball, badminton, tennis and table tennis competitions and 162 of them walked away with cash awards totalling Rs 12.15 lakh.\n\nThe district unit of the Sports Development Authority of Tamil Nadu (SDAT) conducted the championship and the players represented Bharathiyar, Anna, Annamalai, SRM, Hindustan, Madurai Kamaraj, Madras and Alagappa universities.\n\nIn all, 54 winners were given cash awards of Rs 10,000 each and an equal number of runners up Rs.7,500 each. Fifty four others, who secured third place, were given Rs 5,000 each, K. Xavier Jothisargunam, District Sports and Youth Welfare Officer, said. They were also distributed certificates and trophies, he said.\n\nAddressing the prize distribution ceremony, Minister for Sports and Youth Welfare S. Sundaraj said Tamil Nadu topped the country in encouraging sports persons with prize awards and had spent Rs.25 crore last year for identifying budding talents by conducting block, district and State-level competitions.\n\nCollector S. Natarajan said the district would soon emerge as a sports hub thanks to the creation of several infrastructure facilities. The district administration would coordinate with SDAT in identifying budding hidden talents in the district, he said. Assistant Superintendent of Police (ASP) S. Sarveshraj, in his address, said the spurt in sports activities has changed the attitude of youth in the district.\n\nFollowing are the results of three places in the men’s section: Volleyball: SRM University, Anna University and Madras University. Badminton: Bharathiyar University, SRM University and Madras University. Tennis: Madras University, Anna University and Annamalai University. Table tennis: SRM University, Madras University and Anna University.\n\nWomen’s section: Volleyball: Anna University, Madras University and Hindustan University. Badminton: Madras University, Anna University and SRM University. Tennis: Madras University, SRM University and Madras University. Table tennis: Madras University, Anna University and SRM University.", 
    "section": "national", 
    "title": "State-level inter-university championship concludes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}