{
    "author": [
        "Pradeesh Chandran"
    ], 
    "text": "Government sets up Karnataka Investment Company\n\nFree entry was provided to students and public to visit exhibition and interact with exhibitors on the last day of Invest Karnataka-2016 at Palace Grounds on Friday.—Photo: V Sreenivasa Murthy\n\nAfter rolling out the red carpet to investors, it’s time for the State government to mobilise forces to fulfil the promises made at the Invest Karnataka 2016. At the event, 121 agreements — memorandums of understanding and expressions of interest (EoIs) — were signed for Rs. 1,33,177 crore.\n\n“There was a lot of enthusiasm about the event,” said Additional Chief Secretary, Commerce and Industry, K. Ratna Prabha.\n\n“We have signed agreements for various projects. In the next six months, we need to look at each of them, and study in detail both feasibility and viability.” The selected projects would then be taken to the high-level clearing committee and single-window committee before May for approval. “I have asked my department to work hard and make all these become a reality,” she said. To ensure the EoIs are realised, the government has appointed an official to follow up all the projects above Rs. 200 crore. The State has also announced the setting up of Karnataka Investment Company, comprising representatives from the industry and the government.\n\nAccording to the government, it has received around Rs. 3.08 lakh crore investment in the current fiscal, including agreements signed in Invest Karnataka, of which projects worth Rs. 1.75 lakh crore got approval from a high-powered committee.\n\nVisit to industrial areas\n\nOn the final day of the event on Friday, 129 delegates were given an opportunity by the government to visit various industrial areas in the State such as Devanahalli, Vemagal, Mysuru, and Vasanthanarasapura.\n\nDuring the event, the energy sector garnered the highest investment of over Rs. 1 lakh crore, followed by the steel sector, promising around Rs. 38,000 crore and creation of about 6,000 jobs.\n\nSome of the major investments are by Adani Green Energy Ltd. (Rs.18,500 crore), JSW Steel Ltd. (Rs.12,396 crore), Geitso Green Energy Ltd. (Rs.10,000 crore), Essel Infra Projects Ltd. (Rs.7,200 crore), and Shriram Properties Ltd. (Rs. 5,920 crore).\n\nThe government\n\nhas set up Karnataka Investment Company", 
    "section": "national", 
    "title": "Time now to turn proposals into reality", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}