{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram: Radha kalyana mahotsavam, Gita Govindam, unchavruthi, BHEL Township, 7 a.m.; Sri Radha Kalyanam by Udayalur Sri K. Kalyanarama Bhagavathar, 8 a.m.; Anjaneya utsavam, 6.30 p.m.\n\nSri Maruti Vinayagar Temple: Sri Radha Madhava vivaha mahotsavam, sampradaya unchavruthi, CKVI Apartments, Tiruvanaikovil, 7.30 a.m.; Sri Radha Kalyanam, 8 a.m.; Sri Anjaneya utsavam, 6.30 p.m.\n\nSri Govinda Damodara Swamigal Adisthanam: Sri Swamigal’s 12{+t}{+h}annual aradhana mahothsavam, Pazhur Agraharam, 7 a.m.\n\nSrimad Ubhaya Vedantacharya Peetam: Discourse on Bhagavata Dasamaskandam by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Garuda Mandapam, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Ranga Apartment, East Adayavalanjan, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 24, II Street, North East Extension, SMESC Colony, 6 p.m.\n\nOrganising Committee: Sri Radha Kalyana vaibhavam by Sri Ayikudi Kumar Bhagavathar, Rama Bhajan Mutt, Mela Agraharam, Manachanallur, 10 a.m.\n\nCULTURE\n\nBharatiya Vidya Bhavan, Tiruchi Kendra: Thyagaraja aradhana, rendering of pancharatna kritis by musicians of the city, P. Sivakumar, Deputy General Manager, State Bank of India, Tiruchi chief guest, Sri Raghavendra Mutt, Raghavendrapuram, Srirangam, 10 a.m.\n\nSri Rama Gana Sabha Trust: Vadya Sangamam by R. Sengamalam and party, Bala Kala Vidhanam, Renga Nagar II Street, 6.05 p.m.\n\nSri Ranga Vittala Bhajan Mandali: Sri Purandaradasar aradhana, vocal concert by Janani Hamsini and party, Sri Vyasaraja Mutt, Srirangam, 6.30 p.m.\n\nKalai Kaviri College of Fine Arts: Arangetram of final year students, E. Angayarkanni, Dean, Faculty of Arts, Tamil University, presides and releases the college magazine, 5.30 p.m.\n\nGENERAL\n\nSouthern Railway: Inauguration of escalator through video conference by Suresh Prabhu, Minister for Railways, Tiruchi Junction, noon.\n\nNational Association of Geographers, India and Bharathidasan University Department of Geography: Valediction of international conference on “Future earth perspectives in South Asia”, R.B.P. Singh, Vice-Chancellor, Nalanda Open University, chief guest, university campus, 3 p.m.\n\nLions Club International: Leo meet, Nellai Jayantha, chief guest, SRM Annexe, near Palpannai, 10.30 a.m.\n\nNational Institute of Technology Department of Electronics and Communication Engineering: Inauguration of PROBE – annual technical symposium, 10 a.m.\n\nIndian Medical Association: Monthly meeting, Dr. V.Vaithiswaran, consultant laparoscopic surgeon, speaks on “weight loss surgery - when, why, who, what, and where,’ IMA Hall, Salai Road, 6 p.m.\n\nRotary International District 3000 and M.S.Chellamuthu Trust and Research Foundation, Madurai: Inauguration of Mission mental health project centre, Rotary Blossom, Nonaka Genyu, District Governor, Rotary District 2730, Japan, chief guest, Shastri Road, 3 p.m.\n\nNational College Alumni Association: Annual meeting, presentation of outstanding alumnus award to S.Sathiyaseelan, former principal, Urumu Dhanalakshmi College, and N.Seshadri, former principal, National College, 11 a.m.\n\nRotary Club of Tiruchi Central: Leadership seminar, Nonaka Genyu, Rotary District Governor 2730, Japan, Tamilaruvi Manian, speaks, Hotel SRM, 4.30 p.m.\n\nJamal Mohamed College: Graduation Day of self financing courses for women, M.J. Jamal Mohamed, college assistant secretary, delivers graduation day address, 3 p.m.\n\nDistrict Pensioners Association: Meeting, K. Palaniyandi, presides, Bishop Heber Higher Secondary School, 3.30 p.m.\n\nIniya Nandavanam Pathipagam: Felicitations to V.G.Santhosam on receiving the Thiruvalluvar award and book release, Ilasai Sundaram, speaks, Tamil Sangam building, W.B.Road, 4.30 p.m.\n\nTamil Nadu Handicrafts Development Corporation: Crafts Bazaar, Kailasapuram Club, BHEL, 10 a.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation: North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m.\n\nNehru Yuva Kendra and White Rose Service Organisation: Zonal level sports meet, Syed Murthuza Higher Secondary School, 8 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}