{
    "author": [
        "S Ganesan"
    ], 
    "text": "Onion and potato traders need shops of 1,000 to 2,000 sq ft. area and will face difficulty in shifting consignments to upper floors.Thangaraj A.,General Secretary, Tiruchi Onion Commission Mandi Traders’ Association\n\nxpressing apprehensions over a possible move to shift them without any consultation to the new Central Market for Vegetables, Fruits and Flowers, coming up at Kallikudi on the outskirts of the city, some traders’s associations of the Gandhi Market have planned to go on a strike on February 12 to draw the attention of the government to their concerns.\n\nAlthough there was no official word on shifting the market to the new Central Market at Kallikudi, the traders say lack of information on the issue had raised apprehensions that they could be asked to shift to the new market, which they claim did not have adequate facilities.\n\nThe strike call comes in the context of a long-pending proposal of the Tiruchirapalli City Corporation to shift the market to the outskirts of the city. The Gandhi Market, established in 1940, has over 1,000 permanent and pavement shops on about six acres of land, attracting thousands of traders and consumers every day. The market caters not only to the city but also to retail traders from several small and big towns in the neighbouring districts.\n\nThe construction of a central market was announced in July 2014 by the former Chief Minister Jayalalithaa, when she represented the Srirangam constituency. The new market is coming up on 10 acres of land at Kallikudi, off the Tiruchi-Madurai National Highway, about 15 km from here.\n\nOfficials say the market would have all modern infrastructure with 1,000 shops, a cold storage of 2,000 tonne capacity, sorting and grading yards and wide internal roads to facilitate easy movement of trucks and loading and unloading facility. Although representatives of traders associations say they did not mind relocating, they wanted the entire market shifted as a whole.\n\nA meeting of various traders associations held on Friday, with Ve. Govindarajalu, State treasurer, Tamil Nadu Vanigar Sangangalin Peramaippu in the chair, decided to go on a 24-hour strike from 10 p.m. on February 11 to 10 p.m. on February 12 essentially to bring to the notice of the government the concerns of the traders.\n\n“Although we are not opposed to shifting, we want the market to be shifted entirely. Besides, the shops that are being built at Kallikudi are too small and in multiple floors. The government should have consulted the traders,” Mr.Govindarajalu said. Echoing his views, A. Thangaraj, general secretary, Tiruchi Onion Commission Mandi Traders’ Association, said onion and potato commission mandi traders required shops of 1,000 to 2,000 square feet area on the ground floor. Traders would face difficulty in lifting loads to the upper floors.\n\nU.S. Karuppiah of the Gandhi Market United Corporation Approved Permanent and Platform Traders Association said there was no information on who would be allotted shops at the new market and whether the market would be shifted entirely.\n\nHowever, one of the platform traders association has decided not to participate in the strike. A few other associations are also yet to decide.\n\nOnion and potato traders need shops of 1,000 to 2,000 sq ft. area and will face difficulty in shifting consignments to upper floors.\n\nThangaraj A.,\n\nGeneral Secretary, Tiruchi Onion Commission Mandi Traders’ Association", 
    "section": "national", 
    "title": "Traders plan strike on February 12", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}