{
    "author": [
        "Staff Reporter"
    ], 
    "text": "There were complaints from citizens, and Councillors about its quality\n\nCoimbatore Mayor P. Rajkumar looking at a water sample during the quality test conducted at the Pilloor Main Storage Reservoir in Ganapathy.– Photo: S. Siva Saravanan\n\nA test conducted to check the quality of water supplied from Pilloor main storage reservoir in Ganapathy on Saturday showed that the total dissolved solids (TDS) level was well within the prescribed limits.\n\nThe test followed complaints from citizens and Councillors that the water tasted bad.\n\nMayor P. Rajkumar, who was present during the testing, said that residents of the wards that received Pilloor water had been complaining for more than a fortnight that the water quality was not good, it was hard, and that it had lost taste as well.\n\nEngineers from the Tamil Nadu Water Supply and Drainage Board too were present.\n\nThe test for for alkalinity, total hardness and chloride showed that the TDS stood at 102 mg/L (milligram per litre) on Saturday.\n\nThe board engineers K. Dharmaraju and S.S. Sampath Kumar said that it was well within the prescribed limits.\n\nTotal dissolved solids between 500 and 2,000 mg/L was acceptable. The engineers informed the Mayor that the fall in water quality was due to silt removal and cleaning works taken up at the Kundah reservoir in the Nilgiris by the Tamil Nadu Generation and Distribution Corporation.\n\nThe Tangedco uses the reservoir water for hydro power generation.\n\nFrom December, when the cleaning was done, there had been a gradual improvement in the water quality.\n\nThe TDS level fell from 181 mg/L on December 16, 2015 to 100 on February 3. Saturday’s test results showed that the TDS level was at 102 mg/L.\n\nThe engineers told the Mayor that the water quality would reach the usual level of between 60 and 70 mg/L in another fortnight.\n\nThe water from Siruvani has a TDS level of 30 – 40 mg/L.\n\nThe corporation supplies Pilloor water to 60 of its 100 Wards.", 
    "section": "national", 
    "title": "Water from Pilloor potable", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}