{
    "author": [
        "T Madhavan"
    ], 
    "text": "A new coat of paint is given to the staircase on eastern side of the Tambaram railway station as part of the preparations for the inaguration of work on the third broad gauge line up to Chengalpattu —Photo: G. Krishnaswamy\n\nAs the Union Minister of Railways, Suresh Prabhu would lay the foundation stone marking the beginning of work on laying a third broad gauge line connecting Tambaram and Chengalpattu, on Sunday, the Tambaram railway station and its surrounding areas have received a facelift.\n\nThe Union Railways Minister would also flag off a train service between Chennai Central and Howrah, according to railway officials.\n\nAs part of the inaugural ceremony, the Southern Railway has added lustre to the staircases on the eastern side of the station, having painting them in decorative colours.\n\nWorkers at the site said the paint would last for a longer duration than the regular one.\n\nHowever, it requires maintenance and once it gets faded, a new coat should be applied.\n\nWorkers were seen painting the main entrance on the western side and the road around the railway grounds was being black-topped.\n\nApart from this, hundreds of workers were engaged in making a dais ready at the venue of the event – which is the Railway Grounds.\n\nSouthern Railway Divisional Railway Manager - Chennai Anupam Sharma and other officials, along with senior officials of Government Railway Police and Railway Protection Force, visited the railway station and the Railway Grounds to oversee the arrangements for the function on Sunday.\n\nLocated 60 km from Chennai Beach, Chengalpattu is a fast-growing satellite town in neighbouring Kancheepuram district from where thousands travel to the State capital every day.\n\nNow there are four lines between Chennai and Tambaram, two for long-distance trains and the other two for suburban trains.\n\nThousands of commuters from areas between Tambaram and Chengalpattu will, in a year’s time, have better access to Chennai Beach.\n\nThe commissioning of the doubling work from Chengalpattu to Villupuram along with the third line between Tambaram and Chengalpattu will ensure dedicated tracks for operating additional suburban train services between Chengalpattu and Chennai Beach — which are about 250 a day now.", 
    "section": "national", 
    "title": "Work on third line to begin: Tambaram station spruced up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-07"
}