{
    "author": [], 
    "text": "G.K. Pillai says Ishrat could have been an unwitting player in the hands of the Lashkar.\n\nThe former Union Home Secretary G.K. Pillai on Thursday said the affidavit submitted to the Gujarat High Court in 2009 about LeT links of Ishrat Jahan and her accomplices, who were killed in an alleged fake encounter in 2004, was changed at the “political level“.\n\n“I would not know because it was not done at my level. I would say it was done at the political level,” he told a television channel when asked whether the affidavit was changed at the political level.\n\nThe then UPA government had submitted two affidavits — one that the four, who were killed in an alleged fake encounter, were terrorists and the second saying there was no conclusive evidence — within two months in 2009.\n\nMr. Pillai said Ishrat could be an unwitting player in the hands of Pakistan-based terror group LeT and favoured a probe into the statement of David Headley on her terror links. There was no doubt that those killed in the alleged fake encounter in Gujarat had links with Lashkar-e-Taiba, he said.\n\n“They were LeT activists. She [Ishrat] knew that something was wrong. Otherwise an unmarried young Muslim woman would not have gone with some other men,” he told reporters.\n\nCommenting on whether it was a fake encounter, Mr. Pillai said the CBI had already investigated that issue and filed a charge sheet. “The real issue is whether it was a real encounter or fake. The CBI had probed that,” he said.\n\nThe former bureaucrat said LeT did put her name on their website as a martyr, which was later withdrawn. “There was no direct evidence, except that the LeT put her name on the website. So, I would say may be she was an unwitting player.”\n\nComplimenting the Intelligence Bureau, Mr. Pillai said it was a highly successful operation and the IB knew well before that the LeT people were coming.\n\nAsked about Headley’s statement before a Mumbai court that the 19-year-old Mumbra girl was a LeT member, he said it was a matter of investigation. — PTI", 
    "section": "national", 
    "title": "Affidavit on Ishrat changed at political level, says G.K. Pillai", 
    "subsection": "general", 
    "date": "2016-02-26"
}