{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Manohar Parrikar wants to improve the procurement procedures to streamline the process and ensure transparency.\n\nThe Defence Ministry is working on proposals to further open up and streamline the defence procurement process.\n\nThese include allowing the private sector to manufacture ammunition and longer tenures for Army officers in the acquisition wing to ensure continuation, Defence Minister Manohar Parrikar said on Thursday.\n\nAs the requirement for various types of ammunition by the Army keeps changing, the private sector will be given orders for 10 years to ensure financial viability, Mr. Parrikar said, while speaking at the inaugural session of the Defence Innovators and Industry Association.\n\nAs of now, only the Ordnance Factory Board (OFB) is permitted to manufacture ammunition.\n\nAlso the short duration of Army officers in the acquisition wing delays procedures as personnel are frequently replaced.\n\nMr. Parrikar said the Defence Ministry was planning to create a separate set-up for acquisition and OFB, both for capital and revenue streams.\n\nObserving that the Army has a particular rule regarding such short postings, he said it also had to take into consideration the need of the organisation and relaxation had to be given for those involved in this kind of specialised set-up.\n\n“The set-up will be in place in the current calendar year,” Mr. Parrikar said.\n\nMilitary officers are usually not keen on extended stints in the acquisition wing as it would deprive them of field responsibilities, a prerequisite for their promotion to higher ranks.\n\n'Need to tweak Defence Procurement Manual'\n\nIn addition to revising the Defence Procurement Procedure (DPP) which is to be released soon, Mr. Parrikar said there is need to tweak the Defence Procurement Manual (DPM) and the OFB procurement procedures to streamline the process and ensure transparency.\n\nLonger tenure for Army officers in the acquisition wing is also on the cards", 
    "section": "national", 
    "title": "Ammunition from private sector soon, says Parrikar", 
    "subsection": "general", 
    "date": "2016-02-26"
}