{
    "author": [
        "K A"
    ], 
    "text": "‘In 1971, we were promised compensation but nothing happened,’ say the tribals of Muthikulam.\n\nNow aged 62, Soudamini still remembers that distant afternoon when officials of the Kerala irrigation and forest departments trekked through the difficult terrain of Siruvani hills to reach her Muthikulam tribal settlement and told the residents to relocate to the nearest Chingampara area of thick forests. The settlement constituted 24 families of the Muduga tribes, and their forced relocation facilitated the construction of the Siruvani dam, a major source of drinking water for Coimbatore city and its surrounding areas in Tamil Nadu.\n\nThat was in the beginning of the 1970s and the agreement between Tamil Nadu and Kerala was to build a larger dam after destroying an existing one built by the British. “The new reservoir came up in the area from where our families had been forced to move out. The dam was commissioned in 1984, but our settlement remains neglected,’’ said Rajan, a differently-abled member of the Chingampara Colony.\n\nThe settlement, consisting of 35 families, has volumes to talk about the breach of official promises. “In 1971, we were promised pucca housing with water and power connections and toilets, besides compensation of Rs.10,000. Nothing happened,” says Biju, another resident.\n\nFour decades later, most of the houses are in ruins. The tribal people have to walk about 3 km to fetch water from the reservoir as the decades-old water supply mechanism stopped functioning years ago. Most children do not attend school, as the nearest school is about 20 km away.\n\n“We had a school earlier at Muthikulam, but it got submerged in the dam waters. Now the colony has only an Anganwadi. It was as per an advice of the forest and irrigation departments that we planted coconut and arecanut trees in this forest village. Now, wild animals do not allow us to make any profit from agriculture,” says Soudamini.\n\nExcept for the once-in-a-week visit of a junior public health nurse, there is no health care facility for the people here.\n\n“Our rehabilitation was a mockery. We are awaiting justice even after four decades. We are eligible at least for decent housing,’’ says Biju.\n\nMuduga families displaced by the Siruvani dam project are yet to be rehabilitated", 
    "section": "national", 
    "title": "Four decades on, people of Kerala hamlet wait for justice", 
    "subsection": "general", 
    "date": "2016-02-26"
}