{
    "author": [
        "Damini Nath"
    ], 
    "text": "From enduring “the attack of the wasabi” on the International Space Station to momentarily forgetting how to walk, NASA astronaut Captain Sunita Williams has been through many other worldly experiences.\n\nMs. Williams, an American Naval pilot and astronaut, is in India on a three-day visit. Addressing the FICCI Ladies Organisation here on Thursday, she talked about her time in space, a total of 321 days, and how she got the job.\n\nShe holds the record for the highest number of spacewalks by a woman astronaut at seven and has received several awards, including the Padma Bhushan. But, according to her, she was just at the right place at the right time.\n\nShe ended up at the Naval Academy, not because she had always planned to study there, but because she was looking for an affordable college education. She ended up becoming a pilot, because her first choice, diving, had no vacancies.\n\n“There was a pilot opportunity open, so I said I would try it. Getting out there and trying things, and not being afraid to try things, are important,” she said, highlighting the need for science, technology, engineering and mathematics education, especially for girls.\n\nOnce she tried it, she succeeded. In 1998, she was selected by the NASA and had her first flight in 2006. Since then, she has been up to the ISS four times – being the commander during her last trip in 2012.\n\nIn the vacuum of space, staring out of the window of the ISS can take up hours of an astronaut’s time. A 24-hour period has 16 sunrises and sunsets on the ISS. On her 2007 mission, Ms. Williams ended up having to contend with a formidable foe – wasabi. The spicy Japanese condiment was going to be the highlight of an otherwise bland meal, when the mismatch of the pressure led the jar to explode.", 
    "section": "national", 
    "title": "Get out there and try new things: Sunita Williams", 
    "subsection": "general", 
    "date": "2016-02-26"
}