{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The government is open to suggestions on changing the office timings, Chief Minister Oommen Chandy has said.\n\nResponding to Union Railway Minister Suresh Prabhu’s suggestion to stagger the office timings, Mr. Chandy told reporters here after a Cabinet meeting on Thursday that the government was open to all feasible suggestions and would also elicit the views of the service organisations. Since top priority is always attached to the education of wards and also to school timings, all such factors too have to taken into consideration, he said.\n\nInformation Kerala\n\nThe Cabinet has decided to reintegrate the staff structure of Information Kerala Mission into three sections such as Research and Development, operation and maintenance and human resource. It has also been decided to form sub-groups on research and logistics, software development, testing and quality control and also helpdesk and grievance cell. The main posts would be filled up through direct selection, deputation and promotion.\n\nAs much as 25 per cent of the Plan fund of grama panchayats, municipalities and corporations and 10 per cent of the Plan fund of district panchayats and block panchayats would be provided as working capital of mission. This would amount to Rs.10 crore and is in addition to a budgetary allocation of Rs.10 crore and a proposal to mobilise Rs.2 crore through consultancy services.\n\nRehabilitation package\n\nThe government would implement a rehabilitation package of Rs.23.8 crore for the fishermen who have been permanently rendered jobless on implementing the Vizhinjam project. The Cabinet has given the clearance to the Vizhinjam International Seaport Limited (VISL) to provide compensation to fishermen who would be rendered jobless from the budgetary allocation. The compensation would be distributed through bank account or as crossed cheque.", 
    "section": "national", 
    "title": "Govt. open to suggestions on changing office timings: CM", 
    "subsection": "general", 
    "date": "2016-02-26"
}