{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India has given intelligence intercepts that connect Masood Azhar’s organisation to the Pathankot attack.\n\nIn its biggest diplomatic move after the Pathankot attack, India will approach the United Nations on Friday to include the Pakistan-based terror mastermind Maulana Masood Azhar on the list of globally designated terrorists, official sources told The Hindu on Thursday.\n\n“We will be moving the 1267 Sanctions Committee to also include the name of Masood Azhar on the sanctions list. It is a great anomaly that the Jaish-e-Mohammed (JeM) is listed but not its leader,” Vikas Swarup, spokesperson of the Ministry of External Affairs, said, pointing out that Azhar remained unsanctioned though his group, JeM, was included by the 1267 Sanctions Committee on the list of Foreign Terrorist Organisations in 2001.\n\nOfficials said India would formally request the 1267 Sanctions Committee, which consists of 15 members, to schedule a discussion on Masood Azhar on Friday. The decision is significant since it is the second time in less than a year that India will attempt to isolate an international terrorist through the anti-terror committee.\n\nIn June 2015, India moved the committee in the United Nations, demanding an explanation from Pakistan for its decision to release the 26/11 attack plotter Zakiur Rahman Lakhvi from jail.\n\nThe attempt to isolate Pakistan, however, failed at the last moment because of China’s opposition. Officials said that this year too, China’s attitude would be watched.\n\nHowever, according to experts, the attempt to isolate Masood Azhar has a greater possibility to succeed at the 1267 Sanctions Committee.\n\n“India has already given actionable intelligence and technical intercepts that connect Masood Azhar’s organisation to the Pathankot attack. The technical inputs are likely to be presented before the UN committee,” Gen (retd.) Ved Prakash Malik said.\n\nGen. Malik said Pakistan’s recent action arresting individuals connected to the Pathankot attack might also be cited by India to strengthen the case against Masood.\n\nHe said India also had a better chance of getting more support at the U.N. Security Council from members like France who might help in convincing Pakistan’s strategic allies to understand the global threat posed by individuals like Masood Azhar.\n\n“China has its strategic interest in Pakistan and that is why it did not support India’s previous attempt ... ,” he said.", 
    "section": "national", 
    "title": "India moving U.N. to blacklist Masood", 
    "subsection": "general", 
    "date": "2016-02-26"
}