{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Former Finance and Home Minister P. Chidambaram has described the Union government’s case against Jawaharlal Nehru University students charged with sedition as weak, saying, “Any lawyer familiar with the law laid down in this behalf will know that this is not sedition.”\n\nSpeaking to The Hindu , Mr. Chidambaram said it was entirely “possible that there are some students whose sympathies lie with the Maoist movement, but unless there is incitement to violence, it is not sedition”.\n\n“The slogan Pakistan Zindabad, etc. is heard every day in Kashmir. The slogan for Khalistan is heard almost every week in Punjab. There were people in Tamil Nadu who sing the praises of the LTTE and even glorify the LTTE cadres who were behind the killing of [former Prime Minister] Rajiv Gandhi. Some of it is clearly unacceptable and punishable. But is it punishable as sedition? That is the distinction we are drawing. Now which other law is attracted will depend on the nature of the provocation, the exact words that were uttered and the place and time and context in which they were uttered. Any lawyer familiar with the law laid down in this behalf will know that this is not sedition,” he said.\n\n“And even today, I find that the Police Commissioner is defending the charge sheet against Kanhaiya Kumar [president of the Jawaharlal Nehru University Students’ Union] on the ground of sedition. Clearly, going through what Kanhaiya Kumar said on that day, it does not attract the law of sedition. In fact, I don’t think his speech attracts any law at all,” he said.\n\nHe said the government was framing the debate on identities — on the killing of Mohammad Akhlaq in Dadri over the allegation of storing beef or the suicide of Dalit scholar Rohith Vemula in Hyderabad — in a polarising manner, distracting attention from bread and butter issues.\n\nHe said he had been in favour of withdrawing the Armed Forces (Special Powers) Act in Jammu and Kashmir, but did not see it happening in this government.\n\nMr. Chidambaram said events in the rest of India and cases like that of Dadri and JNU would have consequences in Kashmir.\n\n“See, the mind of the Kashmiri youth gets affected not only by what happens in the Kashmir Valley. It also gets affected by what happens elsewhere in India. I think the increased sense of fear and insecurity among the Muslims is playing on the minds of Muslims all over India, including Muslims in Kashmir. How can one say that the Kashmiri youth are not concerned about what happens to other Muslims in the rest of India,” he asked.\n\nHe denied that the previous Congress-led government had doubts over the culpability of Parliament attack convict Afzal Guru.\n\n“I said one can hold an honest opinion that the case was not correctly decided and the degree of involvement of Afzal Guru was not correctly assessed. If someone holds that opinion, he doesn’t become an anti-national. He’s just holding a different opinion,” he said.\n\nOn the Goods and Services Tax (GST) Bill, Mr. Chidambaram said the government was wrong in saying that it was possible to mention a cap in the rate of the GST in the Bill.\n\n“Of course, capping the rate on the Bill can be done. What is the problem with that? [Union Finance Minister Arun Jaitley] Mr. Jaitley’s Bill, in one section, mentions the rate at one per cent. So why can’t the Constitution Amendment Bill mention a rate? His own Bill mentions a rate. Secondly, the profession tax provision of the Constitution — Article 276 — contains a cap of Rs. 2,500. That number is mentioned in the Constitution. So mentioning a cap in the Constitution is not unprecedented.”\n\n(For full interview visit: http://bit.ly/1S3HAL0)", 
    "section": "national", 
    "title": "It’s not sedition, says Chidambaram", 
    "subsection": "general", 
    "date": "2016-02-26"
}