{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Union Finance Minister Arun Jaitley, left, intervening to answer the charges raised by CPI(M) general secretary Sitaram Yechury against the government on the JNU issue in the Rajya Sabha on Thursday.— Photos: PTI\n\nVeterans clash in the Rajya Sabha on JNU issue, leading to an uproar and adjournment of the Upper House\n\nThe Rajya Sabha was adjourned on Thursday while Human Resource Development Minister Smriti Irani was in the middle of a reply during a short-duration discussion on the death of Dalit scholar Rohith Vemula and the filing of sedition cases against students of Jawaharlal Nehru University (JNU), as members took exception to the Minister reading out derogatory references on Goddess Durga in the report on the JNU incident.\n\nMs. Irani, who replied to a similar debate in the Lok Sabha on Wednesday, faced a more vocal Opposition in the Upper House, when the she read out the material, as a sample of the “depravity” in some educational literature allegedly commissioned when the Congress was in power. Matters had started civilly enough in the morning when the discussion commenced, with Communist Party of India (Marxist) general secretary Sitaram Yechury demanding the setting up of a parliamentary committee to look into the situation in various Central universities.\n\nMr. Yechury invoked William Shakespeare’s Macbeth to “forewarn” the advent of a “theocratic, fascist Hindu Rashtra”. Referring to the characterisation of the Left by Meenakshi Lekhi, BJP member in the Lok Sabha, as “witches in the fairy tale of India’s growth story”, Mr. Yechury launched a scathing attack on the government.\n\n“Yes, we are witches. We forewarn. Understand the prophecy of witches,” he said referring to the song of the witches in Macbeth , which he recited, that foresees doom for the rulers, that the king today may not be king tomorrow.\n\nHe asked the government “not to castigate the entire student community and the institutions”, and “stop this tirade for advancing your brand of nationalism”.\n\nReferring to Rohith Vemula, the Dalit student of Hyderabad University, he said the termination of his scholarship led to his suicide.\n\nMr Yechury said such interference was not only limited to the JNU or Hyderabad University, but could be seen in other institutions also, and “today you are castigating the entire university as anti-national.”\n\nOn the JNU and the speech by its students’ union president Kanhaiya Kumar, he said, “I too want aazadi [freedom]. I want freedom from hunger, Manuwad [ancient religious laws] and poverty. You arrest me if you want to for that, but stop conspiring against our children.”\n\nFinance Minister Arun Jaitley, who is the Leader of the House, then made an intervention to answer these charges.\n\nMr. Jaitley trained his guns at the Congress and the Left jointly, suggesting that they had jumped into the JNU issue “without giving prior thought” in view of the Assembly elections in West Bengal. “There are three Congresses in West Bengal — the Congress, the Trinamool Congress and the Congress [Marxist]” he said.\n\nMr. Jaitley cited a Parliament Question of 1983 in which the then Indira Gandhi government justified the entry of the police into the JNU and the arrest of 350 students, including 50 girls, after the Vice-Chancellor was gheraoed.\n\nHe contended that the developments of February 9 at the JNU were “much more serious” as he read out the pamphlets carrying anti-India material allegedly circulated on the campus.\n\n“The core question is, are we going to give respectability to those whose primary ideology is that they want to break this country,” he said.\n\nReferring to slogans which called for war for destruction of the country and lauded terrorists who had been convicted by the highest judiciary, Mr. Jaitley questioned: “Can hate speech be called free speech?”\n\n“It’s a very serious offence. One is Jihadist, the other is Maoist. It’s an alliance of the two. You have been in power for long, you should have thought before making a visit to the JNU campus,” he said in a direct reference to Congress vice-president Rahul Gandhi’s visit to the JNU.", 
    "section": "national", 
    "title": "Jaitley sees threat to India; Yechury seeks end to conspiracies", 
    "subsection": "general", 
    "date": "2016-02-26"
}