{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Women activists were threatened with rape; police yet to register FIR\n\nA joint delegation of Left and Socialist workers, activists and lawyers, including women, was attacked by a mob of lawyers in Allahabad on Thursday when they were at the district collectorate to submit a memorandum demanding revocation of sedition charges against the JNU students and action against officials in the Rohith Vemula case.\n\nFollowing the attack, a police complaint was submitted. Later in the evening, an FIR was registered at the Colonelganj police station under Sections 147 (rioting), 307( attempt to murder) and 354 (outrage modesty of a woman) among others, against a group of “150 unknown lawyers” and others. The delegation of around 40 persons had assembled at the Allahabad collectorate around noon and was staging a dharna when a group of lawyers intercepted them and demanded that they stop the protest.\n\n‘Aggressive’\n\n“Around 10-12 lawyers approached us in an aggressive manner and asked us to stop the dharna. We tried to reason with them saying we had the right to put our views. Then, one of them made a phone call and within a few minutes a mob of 150 to 250 lawyers attacked us with lathis and stones,” K.K. Pandey, district unit secretary of the CPI(M), said.\n\nA trade union worker Avinash Mishra suffered injuries to his head and a dozen others suffered minor injuries in the attack.\n\nSexist remarks\n\nMr. Pandey who suffered injuries to his face said the lawyers who attacked them were shouting “Pakistan wapas jao (return to Pakistan)”, “ deshdrohi ( traitor)” and “ Vande mataram ” even as they assaulted protesters, some of whom were subjected to sexist remarks.\n\n“They even beat up a 70-year-old lawyer Kesar Gopal Tripathi and hurled abuses at women,” Mr. Pandey said.\n\n“‘I will shoot you. I will tear you into pieces,’ one of the assaulting lawyers told me,” said Mr. Pandey, who filed the police complaint.\n\n‘Threatened with rape’\n\nPUCL district secretary Utpala Shukla said women were “even threatened with rape” and physical abuse. She suffered an injury to her ear from a lathi blow. “The kind of abuses they threw at us I cannot repeat. To incite others against us, they even lied that we were shouting ‘Pakistan Zindabad’ slogans,” Ms. Shukla said.\n\nAn FIR was registered at the Colonelganj police station under Sections 147 (rioting), 307 attempt to murder), 354 (outrage modesty of a woman), 506, 427 of the IPC against a group of “150 unknown lawyers” and others.", 
    "section": "national", 
    "title": "Lawyers attack Left rally in Allahabad", 
    "subsection": "general", 
    "date": "2016-02-26"
}