{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "Union Human Resource Development Minister Smriti Irani’s statement in Parliament on Mahishasura may not have gone down well with the indigenous communities of West Bengal, who consider Mahishasura their “greatest hero” rather than Goddess Durga.\n\nWhile the chief of the Santhal Samaj of Bengal, Nityananda Hembram, said it may affect the Bharatiya Janata Party “negatively” in the coming Assembly elections, anthropologist Pashupati Prasad Mahato has asked the Minister to “check history” to find out about the role of the Asura to protect the country from the Aryans. Santhals constitute more than 50 per cent of West Bengal’s tribal population.\n\nMr. Hembram, 80, alumnus of the IIT, Kharagpur, who retired as Chief Architect in the Defence Ministry, is the present majhi [head] of the Santhals. He told The Hindu that Mahishasura was a supremely revered figure among the tribal people of West Bengal, parts of Odisha and Jharkhand.\n\n“He was not a mythical character but an historical icon who resisted the outsiders, the Aryans, before the birth of Christ. When he defeated the Aryans repeatedly, then a woman was sent [by the Aryans] to deceive him and thus society was defeated. Otherwise, eastern India, including Bengal, was under the control of indigenous societies and was called Bongadisum,” Mr. Hembram said. He said Ms. Irani’s comment was “condemnable” and it would “negatively affect” the BJP in the coming election.\n\nThe BJP did well in some of the tribal pockets of Bengal in the 2014 Lok Sabha election. In West Medinipur in south Bengal, the BJP was ahead of others in one Assembly segment and did reasonably well in the district. Undivided Medinipur, a former bastion of the Left, had nearly 20 per cent tribal population. In Bankura, with nearly 10 per cent tribal population, the BJP had scored around 20 per cent in all the 12 seats, emerging as a significant force. In north Bengal’s Jalpaiguri district, which has nearly 15 per cent tribal population, the BJP got more than 30 per cent vote in more than one seat. In all these seats, the BJP could do well in the Assembly election, provided “both Mahishasura and Durga worshippers” stay with them, observers said.\n\nSanthals and others resent Smriti Irani’s statement in Parliament on their ‘greatest hero’", 
    "section": "national", 
    "title": "Mahishasura is a revered figure of tribes in West Bengal", 
    "subsection": "general", 
    "date": "2016-02-26"
}