{
    "author": [
        "Somesh Jha"
    ], 
    "text": "Besides proposing to tap new revenue streams and optimising expenses, Railway Minister Suresh Prabhu in his budget presented on Thursday announced a radical overhaul of its organisational structure, more transparency and a hard look at the status quo on its operational parameters such as the average train speed.\n\nSignificantly, the Minister said more powers have been delegated to the zonal railways for faster decision-making. He has also introduced accountability for officials not usually seen in the government. This includes defining key result areas (KRAs) for general managers and divisional railway managers to evaluate their performance. He also said a single official would be made accountable for each train’s on-board experience to address passenger concerns, even as a third party audit will be conducted to ensure the quality of services on trains and stations.\n\nWhile the government stuck to its stand on not announcing new train routes in the Rail Budget, it however committed to expediting critical projects to connect the North-East and Jammu and Kashmir with the rest of the country.\n\nThe Railway Minister also announced three new dedicated freight corridors to connect North-South (Delhi to Chennai), East-West (Kharagpur-Mumbai) and East Coast Corridor connecting Kharagpur to Vijayawada. The projects, he said, will be taken up on a priority basis.\n\nOver the next four years, the Minister said the Railways will work on ensuring reserved accommodation to travellers on demand, time tabled freight trains (for which a pilot will be started in 2016-17) and semi-high speed trains along the Golden Quadrilateral.\n\n“That new project announcements are limited indicates adherence to implementation focus, highlighted in the previous Budget,” said Manish Agarwal, Partner and Leader-Infrastructure, PwC India. “Among the new announcements, East Coast connectivity through Dedicated Freight Corridor is perhaps the most impactful, as it would contribute to India participating in global production networks in South East Asia, and to Make in India,” he said.\n\nCritical projects to be expedited; three\n\ncross-country freight corridors announced", 
    "section": "national", 
    "title": "More powers to zonal railways for faster decision-making", 
    "subsection": "general", 
    "date": "2016-02-26"
}