{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Move comes in wake of alleged sexual assault during Jat quota stir\n\nUnable to trace any victim in the alleged ‘mass rape’ case in Murthal, Haryana, during the Jats’ quota agitation, the National Commission for Women has urged possible complainants to approach it.\n\nSpeaking to The Hindu , NCW member Rekha Sharma said although no complainant had come forward, the possibility of the incident having taken place could not be ruled out.\n\n“The NCW has so far been able to contact eight families whose cars were burnt down or damaged. Of these, two families had women members. But all of them have denied they were sexually assaulted or that they saw anyone being raped,” said Ms. Sharma. In addition, the NCW had got through to six truck drivers and cleaners whose vehicles were set ablaze by the mob around the same time and the same place as the alleged rapes, but they had maintained there was no sexual abuse.\n\nThe reason Ms. Sharma believes these persons could have been tutored is before she could speak to them, most of them had received phone calls from the police.\n\n“We promise complete confidentiality to those who approach us. We can be reached at 011-26944823/4,” she said on Thursday, a day after visiting Murthal.\n\nEfforts are also on to trace eyewitnesses or saviours in the alleged crime that according to a media report took place around 3 a.m. on Monday. Besides the authors of the report, there is also an RTI activist who claims to have spoken to “eyewitnesses”.\n\n“Four of the six persons I interacted with in the two villages near Murthal said the mob had dragged the women into the fields, torn their clothes and made sexual advances towards them. But they stopped short of using the ‘rape’ word,” said P.P. Kapoor, the RTI activist pursuing the case.\n\nHe claimed that he would not lead the police to these “eyewitnesses” because they feared for their safety. “If there is an external investigating agency, they will be willing to reveal everything,” Mr. Kapoor told The Hindu .\n\nOn Wednesday, the Punjab & Haryana High Court took suo motu cognisance of the report of the alleged incident.\n\n“Today (Thursday) we requested the court to order a CBI probe or at least transfer the officials of the riot-torn area to ensure a fair investigation in the case, but the court said it may do so in due course of time,” said Utsav Bains, a lawyer.\n\nMr. Bains said the court would wait for some complainants to appear.\n\nThe Haryana police claimed on Thursday that their questioning of the locals and possible victims suggested that the reports of rape were “incorrect”.\n\nYashpal Singhal, DGP (Haryana), however, added that proper investigations would be conducted if any complainant came forward at any time.\n\nThe Haryana police claims that the allegation of rape\n\nis incorrect, but it\n\nwill probe the issue", 
    "section": "national", 
    "title": "NCW urges ‘rape victims’ to come forward, promises confidentiality", 
    "subsection": "general", 
    "date": "2016-02-26"
}