{
    "author": [
        "National Bureau"
    ], 
    "text": "Prime Minister Narendra Modi termed the Railway Budget, tabled on Thursday, as one that caters to all sections of society and passenger-centric. The budget saw no increase in fares. It would “stand out,” the Prime Minister said, because, “it is an infrastructure-led and employment-generating budget.”\n\nInterestingly, Mr. Modi singled out announcements to strengthen rail connectivity in Manipur and Mizoram, saying that it was “gladdening” as connectivity in the northeast is “one of our core priorities.”\n\nThe RSS is especially keen to expand its reach in the northeast, and the area has been a priority for the government, with over 200 visits by various Union Ministers to the area ever since the NDA government came to power.\n\n“Rail Budget showcases a vision to reorganise, restructure and rejuvenate railways with new processes, structures, norms and sources of revenue,” Mr. Modi said. He said ‘Vision 2020’ in the budget will make the railways free from capacity constraints with higher train speed, punctuality and safety.\n\n“In the last year, we have seen a lot of success and this budget is an effort to further improve on this,” he said, while noting that along with IT, investment has been given importance.\n\nHe said railways have witnessed 2.5 times more investment compared to what was seen in the budgets presented by previous governments and expressed the confidence that this budget would have long-term and positive contribution to the economy.\n\nDisappointing, say former Railway Ministers\n\nFormer Railway Ministers have expressed disappointment with the Railway Budget presented on Thursday.\n\nRJD president Lalu Prasad, who was the Railway Minister in UPA-I, called the budget a “fraud” on the people and said it had nothing new. There was no plan to increase the facilities for consumers and improve safety. “Train is off the track,” he said.\n\nThe former Railway Minister, Dinesh Trivedi, termed the budget a statement of illusion and said the government was misleading the nation. “This budget has no direction. It doesn’t have any vision,” Mr. Trivedi said.\n\nThe Congress leader and former Railway Minister, Pawan Bansal, said that except bio-vacuum toilets, there was nothing new. Bihar Chief Minister Nitish Kumar, a Railway Minister once, said the budget did not have anything impressive. “There’s nothing for enhancing safety or improving cleanliness and timely running of trains,” he said.", 
    "section": "national", 
    "title": "People-centric: PM", 
    "subsection": "general", 
    "date": "2016-02-26"
}