{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "It was a present from my friend, who is a Dubai-based cardiac surgeon, says the Karnataka CM, adding he will also pay tax on it\n\nSiddaramaiah says he will provide information to the Income Tax Departmentbefore March 15.\n\nBreaking the long silence on his controversial watch that had the Opposition gunning for him, Karnataka Chief Minister Siddaramaiah on Thursday announced that it was a “gift” from a Dubai-based doctor and friend Girish Chandra Varma.\n\nThe Chief Minister, who came under severe attack from the JD(S) and the BJP on the “expensive and imported” watch, said: “Dr. Varma gifted me the watch last July when he visited India. I have been a close friend of Dr. Varma since 1983.”\n\nMr. Siddaramaiah said he would pay gift tax for the watch and provide information to the Lokayukta before July-end, during the declaration of assets and liabilities.\n\n“I received the gift in July (2015) and I will provide information to the Income Tax Department before March 15. I will not wear the watch, instead I will donate it to the government to preserve it,” the Chief Minister said.\n\nMr. Siddaramaiah said Dr. Varma studied MBBS in Davangere and completed his post-graduation in Mangaluru. He later practised in France and the U.S.\n\nHe now resides in Dubai. When the doctor visited India in July 2015, he removed the watch from his wrist and gifted it to Mr. Siddaramaiah.\n\nThe doctor will provide all details of the watch, including bill receipt and payment of taxes, when he visits India this July.\n\n“The doctor meets me whenever he comes to Bengaluru,” the Chief Minister said.\n\n“Dr. Varma is a cardiac surgeon. He has been my friend for more than 30 years. He gave me the gift as a gesture of affection and friendship. According to Dr. Varma, the value of the watch is 75,000 dirham,” Mr. Siddaramaiah said, adding that Janata Dal (Secular) leader H.D. Kumaraswamy has been making the watch “a big issue without any basis”.\n\nDuring the run-up to the elections to the local bodies, Mr. Kumaraswamy had alleged that Mr. Siddaramaiah, who boasts of socialist credentials and pro-poor policies, was wearing a watch worth Rs. 50 to Rs. 60 lakh, and sunglasses valued at Rs. 2 lakh.\n\nIn its petition to the Enforcement Directorate, the BJP had urged the ED to conduct an inquiry into the Rs. 70 lakh Swiss wrist watch.\n\nAsked whether he would file a defamation case against the JD(S) leader, the Chief Minister said he would not indulge in such “low-level politics”.\n\n‘I have known\n\nDr. Varma for over 30 years. The gift was a gesture\n\nof affection’", 
    "section": "national", 
    "title": "Siddaramaiah to donate ‘expensive’ watch to government", 
    "subsection": "general", 
    "date": "2016-02-26"
}