{
    "author": [], 
    "text": "(From left) Sania Mirza, Virat Kohli and Saina Nehwal have been recognised as both successful and highly-paid.— Photos: AFP/AP\n\nSania Mirza, Virat Kohli and Saina Nehwal among young leaders from various fields under the age of 30\n\nTennis star Sania Mirza, Indian batting mainstay Virat Kohli and top-seeded badminton player Saina Nehwal lead the pack of over 50 Indians in Forbes’ inaugural list of top “promising young leaders and game changers” under the age of 30, in Asia.\n\nThe Forbes ‘30 under 30 Asia’ list includes 300 “young and driven entrepreneurs and game-changers” from countries including India, Indonesia, China, Hong Kong, Singapore, Japan, Pakistan, Vietnam and Australia, who are contributing to their industries in a significant way.\n\nAs many as 56 Indians feature in the list with Kohli, Mirza and Nehwal and actress Shraddha Kapoor leading the pack.\n\n“At the top of India’s cricket culture is batting prince Kohli, who led India to clean sweep in their Twenty 20 series against Australia in January,” Forbes said of Kohli, who was named among India’s highest earning celebrities in 2015 at $11.3 million.\n\nForbes said from the moment 29-year old Mirza turned pro at the age of 16 in 2003, she has been the “most successful female Indian tennis player ever” and one of the highest paid and highest profile athletes in the country.\n\nShe is currently the world’s number one female doubles tennis player with partner Martina Hingis. Describing 25-year old Nehwal as a “role model” and “Indian badminton queen”, Forbes said the number one ranked women’s singles player in the world is one of 24 top sportspersons from around the world standing for election for the International Olympic Committee’s Athletics Commission during the Rio Games this August.\n\nWith 10 categories in total, the Forbes 30 Under 30 Asia list highlights inspiring young leaders in various fields covering consumer technology, enterprise technology, arts, healthcare and science, media, social entrepreneurship, finance, industry and retail.\n\nThe entertainment and sports category also includes Arunima Sinha, who is the first female and first Indian amputee to climb Mt Everest in 2013 and Chaitanya Tamhane, writer and director of the critically acclaimed movie ‘Court’.\n\nRetail and e-commerce\n\nThe retail and e-commerce category features Raghav Verma, who co-founded Indian tea chain ‘Chaayos’ with IIT-Mumbai alumnus Nitin Saluja.\n\nForbes said Chaayos, which also sells tea in disposable kettles via an app, has received at least $5.3 million in venture capital and is expected to end 2015-16 with revenues of about $1.5 million. The category also includes Mehul Agrawal, cofounder of automotive e-commerce site ‘Cars24’ and online furniture store ‘FabFurnish’.\n\nKanika Tekriwal co-founded and heads ‘JetSetGo’, an India-based private jet concierge service that links passengers to planes through an online marketplace. Ritesh Agarwal, founder and CEO of the “disruptive hospitality business and app” ‘OYO Rooms’, leads the consumer technology category. — PTI", 
    "section": "national", 
    "title": "Sportspersons lead Indians on Forbes Asia list", 
    "subsection": "general", 
    "date": "2016-02-26"
}