{
    "author": [
        "Pradeesh Chandran"
    ], 
    "text": "He has had tussles with Diageo since the Birtish firm picked up majority stake\n\nUB Group Chairman Vijay Mallya has resigned as the non-executive chairman of United Spirits Limited (USL) with immediate effect. The announcement was made by Mr. Mallya on Thursday evening in a statement.\n\nRecently, there have been allegations and uncertainties over Mr. Mallya’s relationship with British alcoholic beverages company Diageo, the majority stakeholder in the USL.\n\nEver since Diageo purchased a majority stake of about 54 per cent in the USL in July 2014, tussles between Mr. Mallya and the firm have been reported.\n\nAfter the acquisition of majority stake in the USL, Diageo pushed for the exit of Mr. Mallya, which he refused. As on December 31, 2015, Mr. Mallya held around 3.99 per cent stake in the USL.\n\n“The time has now come for me to move on and end all the publicised allegations and uncertainties about my relationship with Diageo and United Spirits Limited. Accordingly, I am resigning my position with immediate effect,” Mr. Mallya said in the statement forwarded to the media.\n\n“Having recently turned 60, I have decided to spend more time in England, closer to my children,” the statement added.\n\nIn another statement, Diageo said Mahendra Kumar Sharma, currently the independent non-executive director and Chairman of the Audit Committee of the USL, will be appointed new Chairman of the USL.\n\n“The financial terms of today’s (Thursday) agreement with Dr. Mallya provide for a payment of $75 million (approximately £53 million) to Dr. Mallya over a five-year period. This payment will be charged to exceptional items in the year ending June 30, 2016,” Diageo said.\n\nAs per the agreement with Diageo, Mr. Mallya has also signed a global (excluding United Kingdom) five-year non-compete arrangement. Mr. Mallya will now be the Founder Emeritus of United Spirits.\n\nEarlier, there were reports that the board of directors of the USL had asked Mr. Mallya to resign from the board after an internal probe found financial irregularities in the company.\n\n“I have agreed to a mutual release with both Diageo and United Spirits from claims concerning alleged irregularities disclosed by the USL in April 2015,” he said.\n\nMeanwhile, Ivan Menezes, Chief Executive of Diageo, said: “India is an exciting growth opportunity, and USL has the management team, strategy and capability to deliver on that opportunity. The agreement announced today is in the best interests of both Diageo and USL, and allows USL to build on its strong platform in one of the biggest spirits markets in the world.”", 
    "section": "national", 
    "title": "Vijay Mallya steps down as United Spirits chairman", 
    "subsection": "general", 
    "date": "2016-02-26"
}