{
    "author": [
        "Pradeesh Chandran"
    ], 
    "text": "The time has now come for me to move on, says UB Group Chairman Vijay Mallya\n\nUB Group Chairman Vijay Mallya has resigned as the non-executive chairman of Unites Spirits Limited (USL) with immediate effect. The announcement was made by Mr. Mallya on Thursday evening through a statement.\n\nRecently there were various allegations and uncertainties regarding Mr. Mallya’s relationship with Diageo, the majority stakeholder of USL. British alcoholic beverages company Diageo had purchased majority stake of about 54 per cent in USL in July 2014 and since then there was tussle between Mr. Mallya and Diageo.\n\nAfter the acquisition of majority stake in Mr. Mallya’s USL, Diageo had pushed for his exit, which he had declined. As on December 31, 2015, Mr. Mallya holds around 3.99 per cent stake in USL.\n\n“The time has now come for me to move on and end all the publicised allegations and uncertainties about my relationship with Diageo and United Spirits Limited. Accordingly, I am resigning my position with immediate effect,” stated Mr. Mallya in a statement which was forwarded to the media.\n\n“Having recently turned 60, I have decided to spend more time in England, closer to my children,” the statement added.\n\nNew chairman of USL\n\nDiageo said Mahendra Kumar Sharma, who is currently the independent non-executive director and Chairman of the Audit Committee of USL will be appointed as the new Chairman of USL.\n\n“The financial terms of today’s agreement with Dr. Mallya provide for a payment of $75 million (approximately £53 million) to Dr. Mallya over a five-year period. This payment will be charged to exceptional items in the year ending 30 June 2016,” Diageo said in a stament.\n\nAs per the agreement with Diageo, Mr Mallya has also signed a global (excluding United Kingdom) 5 year non-compete arrangement. Mr Mallya will now be the Founder Emeritus of United Spirits.\n\nEarlier, there were reports that board of directors of USL had asked Mr. Mallya to resign from the board after an internal probe which found financial irregularities in the company.", 
    "section": "national", 
    "title": "Vijay Mallya steps down as USL chairman", 
    "subsection": "general", 
    "date": "2016-02-26"
}