{
    "author": [], 
    "text": "A visitor uses a virtual reality device during the Mobile World Congress Wireless show in Barcelona, Spain. Companies like Samsung, LG and HTC are showing off their latest virtual reality headsets as others are showing new content or new applications for a virtual reality world. — Photo: AFP\n\nPhone makers, trying to renew consumer appetite, are turning to virtual reality headsets that can be paired with their devices to view videos and play games.\n\n“With a slowing smartphone market, one of the ways to generate additional profit is to become a major player in new categories like smartwatches, cameras or virtual reality goggles,” said Ian Fogg, head of mobile at research firm IHS.\n\n“These are markets where there is not yet a leader so there is a lot more room for growth,” he said.\n\nFreebie with phones\n\nSamsung, the world’s number one smartphone maker, announced at the Mobile World Congress trade fair in Barcelona that it would give away its Gear VR headset for free with every pre-order for its new flagship Galaxy S7 phone.\n\nThousands of people donned the headsets — which have a slot where you insert a smartphone — to view the presentation of the firm’s new phones at a Barcelona congress centre on the eve of the start of the fair.\n\nThe crowd gasped and applauded as the new phones appeared to be floating in the air before their eyes.\n\nWhen they removed their headsets they saw that Facebook’s Mark Zuckerberg had made a surprise appearance at the presentation.\n\nSaturated market\n\nThe headsets — which went on sale in November — are powered by technology developed by Oculus, a virtual reality company Facebook bought in 2014 for $2 billion.\n\n“VR is the next platform where anyone can experience anything they want,” he said.\n\nRival South Korean tech firm LG, which lost money from its mobile business last year, unveiled its own virtual reality goggles to go with its new G5 smartphone at the fair.\n\n“If this does not tell you the industry is moving to virtual reality, I don’t know what does,” said Jefferson Wang, senior partner at IBB Consulting that focuses on the wireless and tech sectors.\n\nThe emphasis on virtual reality comes as the increasingly-saturated smartphone market begins to slow.\n\nResearch firm TrendForce predicts global smartphone sales will grow by 8.1 per cent in 2016, down from 10.3 per cent last year.\n\nStruggling Taiwanese smartphone maker HTC has decided to refocus completely on virtual reality and away from smartphones.\n\n“Yes, smartphones are important, but to create a natural extension to other connected devices like wearables (watches...) and virtual reality is more important,” the company’s new chief executive Cher Wang said last month in an interview with The Telegraph .\n\nThe smartphone virtual reality headsets sparked huge interest at the trade fair in Barcelona, which ended on Thursday.\n\nLong lines formed outside a pop-up virtual reality theatre set up by Samsung that allowed people to experience a roller coaster ride using the Gear VR headset as their seats rocked from side to side.\n\nTilt your head back with the headset on and you see a clear blue sky. Turn sideways and you see the rest of an amusement park and mountains in the distance. Look down and you see a fast approaching plunge.\n\nPeople gripped the arms of their seats even though they were not moving and raised their hands in the air during the simulations.\n\nHere to stay\n\nResearch firm CCS Insight predicts the number of sold virtual reality devices will grow from 2.2 million last year to 20 million in 2018, with smartphone-based devices representing the vast majority.\n\n“Smartphone virtual reality is poised to be the big volume driver for virtual reality in coming years,” the company’s chief of research, Ben Wood, said.\n\nMore sophisticated virtual reality headsets that run on an expensive computer will remain a niche product because of their high cost, he added.\n\nSome users of the smartphone virtual reality headsets complained of being able to see the pixels in the images being broadcast.\n\n“The quality of the systems is not quite there yet,” said Edward Tang, founder and president of Avegant which makes virtual reality headsets.\n\n“But there is no doubt virtual reality is here to stay,” he said. — AFP\n\nThousands of people tried on the headsets at the Mobile World Congress show", 
    "section": "national", 
    "title": "Virtual reality is next as smartphone sales slow", 
    "subsection": "general", 
    "date": "2016-02-26"
}