{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "I am not a terrorist. I was convicted under the Arms Act, the actor says after his release from jail\n\nActor Sanjay Dutt’s 23-year-old tangle with the law finally ended on Thursday, when he was released from the Yerawada central jail in Pune after getting a 144-day remission even as a petition challenging his acquittal in the Bombay High Court was posted for hearing on Monday.\n\n“I am not a terrorist. I have been honourably acquitted by the Tada court from both the conspiracy and terror charges in the 1993 bomb blasts case. I was convicted in the Arms Act, a conviction which even the Supreme Court has upheld. I was acquitted of Section 120 (b) and all Tada charges. I request the media not to mention the 1993 bomb blasts. Because I was not involved in it,” the 56-year-old actor said during a media interaction at his Imperial Heights residence in Bandra, surrounded by his close family and friends.\n\nDressed in a dark blue shirt and denims, Dutt walked out of the Yerwada central jail at 7 am clutching some files and a shoulder bag, waving to a crowd of fans gathered outside the jail. He bowed down to touch the ground, turned around and saluted the Indian Tricolour fluttering atop the jail premises.\n\nWife Maanyata, film-maker Rajkumar Hirani, and script-writer Abhijat Joshi were present to receive him. Hirani, who is making a bio-pic on Dutt’s turbulent life starring Ranbir Kapoor, also filmed the sequence of Dutt walking out of jail. The footage will be included in the biopic, according to Dutt’s well-organised public relations team which carefully choreographed his release and return home.\n\nFrom the jail, Dutt drove to Pune’s Lohegaon airport and landed in Mumbai by a chartered flight at 11 a.m. He first went to Siddhivinayak temple in Prabhadevi, offered prayers at his mother Nargis Dutt’s grave at Bada Kabrastan in Marine Lines before arriving at his house in Pali Hill where his sister Priya and Namrata Dutt welcomed him.\n\n“I have been waiting for 23 years to get a taste of freedom. Finally, that day has arrived, and I am a free man. That feeling is still not sinking in. I feel like I am on furlough or leave from jail. It will take me some time to convince myself that I am free,” Dutt told reporters.\n\nDutt said he missed and remembered his father Sunil Dutt the most as he had waged a legal and political battle to get the “terrorist” tag removed from his name. “Honourable Judge Kode said you wanted to know if you are a terrorist, and the court says you are not a terrorist. I wish my father had heard that. The Supreme Court also endorsed it, and whatever sentence I was awarded I have completed,” he said.\n\nAs prisoner number 16656 in Yerwada jail, Dutt was trained to weave chairs, and make environment-friendly paper bags during his 835-day stay. He was also part of a community radio initiative where he was one of the radio jockeys. “The prison regime included listening to songs on radio from 11a.m. to 4 p.m. Prison inmates were told about behavioural improvement and rehabilitation so that there is a message along with entertainment. I spoke about my experiences, about the film industry. I did whatever I could do,” Dutt said adding that he handed the sum of Rs 440 he earned at the jail to his wife.\n\nHugging his twins Shahran and Iqra, Dutt said he was looking forward to spending time with his family and children. “Most of all, I want to get back to my work,” he said.", 
    "section": "national", 
    "title": "Waited 23 years to taste freedom: Sanjay", 
    "subsection": "general", 
    "date": "2016-02-26"
}