{
    "author": [
        "Sweta Goswami"
    ], 
    "text": "Under attack from the Opposition for mishandling both the Jawaharlal Nehru University and Hyderabad University crises, Human Resource Development Minister Smriti Irani delivered an aggressive response.\n\nWhat she said: It was the Executive Council appointed by the UPA Government that expelled Dalit scholar Rohith Vemula.\n\nFact: The decision to expel him first was taken during the temporary tenure of Professor R.P. Sharma in September 2015 and a proctoral board under him. This was revoked pending inquiry, following which an EC sub-committee was formed under Appa Rao Podile, an appointee of the BJP government. It is the final decision of this committee that led to the expulsion of Rohith and four others from the hostel.\n\nAs a counter to BSP leader Mayawati, who asked why there was no Dalit member on the panel to inquire into the expulsion, Ms. Irani said a Dalit member was co-opted.\n\nPrakash Babu was on the panel because he was Dean of student’s welfare and not because he was a Dalit.\n\nHe quit his administrative responsibility following Rohith’s death and the subsequent press conference held by Ms. Irani.\n\nAccording to a report submitted to the Telangana High Court, the police reached Rohith’s hostel at 7.20 p.m. They found the room open and the body was on the table. This is what the police said. Ms. Irani said no one allowed a doctor near this child, to revive this child. Instead, his body was used as a political tool.\n\nRohith was examined by a duty doctor of the University’s Health Centre, Rajashree P., at 7.20 p.m. and he was declared dead at 7.30 p.m. A requisition for post-mortem from the Gachibowli police station to Osmania General hospital reiterates this, and states that Rohith was found dead at 7.20 p.m.\n\nMs. Irani brought up references to Mahishasura celebrations at the JNU in the context of documents submitted by the Registrar and how it was resisted by some students belonging to the SC/ST communities who also were beaten up for protesting.\n\nDurga in some small traditions, notably Santhal tradition, is portrayed as someone who did seduce a local king. There are countless such small traditions that celebrate Mahishasur and Ravan too.\n\nOn February 25, when Ms. Irani brought this up again, Congress MP Anand Sharma protested and questioned Ms. Irani’s attempts to draw customs and traditions and Gods into a debate on JNU — leading to an adjournment.", 
    "section": "national", 
    "title": "What Smriti Irani said… and didn’t", 
    "subsection": "general", 
    "date": "2016-02-26"
}