{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Some of the Dalit students who were forced out of a Bhubaneswar college.— Photo: Sujit Pathak\n\nSixty Dalit students from Bihar, who are studying engineering in Orissa, have threatened to commit suicide after the Bihar government allegedly stopped paying their stipends to the college, and the students were forced to leave the institution.\n\nAll the 60 students had secured admission in Rajdhani Engineering College, Bhubaneswar, in 2014 under the Bihar government’s Dalit Students Stipend Scheme. However, six months after the students’ admission to the college, the State government allegedly stopped the payment of the stipend, despite repeated requests by the college authorities.\n\nUnder the Dalit Students Stipend Scheme, the State government pays Rs.1.1 lakh for each student annually. One of the 60 students, Gajendra Kumar, said: “The college authorities forced us to leave the institution and the hostel on January 8 this year, saying the Bihar government had failed to pay our stipend despite their repeated requests”.\n\nAnother student, Mukesh Kumar, told The Hindu over the phone, “the principal asked us to come only after our dues are cleared.”\n\n“Now, if the Bihar government fails to pay our stipend, there will be no option left for us except to commit suicide”, said a group of students, all in the second year of their course. The parents of some of the students had met officials of the department concerned, but “despite assurances, nothing has been done yet”, said the father of a girl student, Pooja Kumari.\n\nDeputy Chief Minister Tejaswi Yadav said the issue would be resolved soon, and appealed to the students “not to take extreme steps”. State Minister for Welfare of the Scheduled Caste/Scheduled Tribes, Santosh Kumar Nirala, said there might be some mix-up in the bank account numbers given by the students. “The stipend for the students was released on January 22. The government is sensitive to Scheduled Caste/Scheduled Tribe students and nobody will be denied stipend”, said the Minister.\n\nThe Odisha govt.\n\nhas allegedly stopped paying their stipends to the college", 
    "section": "national", 
    "title": "60 Dalit students in Bihar threaten suicide", 
    "subsection": "general", 
    "date": "2016-02-03"
}