{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Members of the LGBT community and their supporters celebrate after the Supreme Court agreed to re-examine the colonial-era law that criminalises homosexual acts, in Mumbai on Tuesday— Photo: AP\n\nThe Supreme Court’s decision to refer a bunch of petitions challenging Section 377 of IPC, which criminalises consensual sexual acts of Lesbian, Gay, Bisexual and Transgender (LGBT) adults in private, to a five-judge Constitution Bench has kindled the hope of Mumbai’s LGBT community, which welcomed the move on Tuesday.\n\nHopeful of a positive outcome, Namrata Bajaj, a marketing professional, said, “This is definitely a ray of hope that we will get equal rights. We are also tax paying citizens of this country.”\n\nWhile members of the LGBT community face a slew of problems from not finding houses on rent and discrimination at workplace and general society, Bajaj hoped that a favourable judgment in the end would take the ‘criminal’ tag off homosexuality.\n\n“At least we won’t be blackmailed and shamed,” Bajaj said. “This is a stepping stone to an open dialogue. At workplaces we are still checked for criminal records. In rural areas, the situation in worse.”\n\nGender rights activist Harish Iyer, whose matrimonial ad for an Iyer groom created a flutter last year, also welcomed the Supreme Court’s decision.\n\n“It is a positive step. It gives me hope that we haven’t closed our ears and that we are parallel to science,” said Iyer.\n\nHailing Tuesday’s decision as “a progressive step” Ashok Row Kavi, founder chairman of Humsafar Trust and editor of ‘Bombay Dost’ said, “The very fact that the curative petition has been admitted is a big step forward. With more number of judges, we will have more opinions and the chances of success will be greater. This is the beginning of the fight for LGBT rights. In Mumbai, we have waged a 20-year-long struggle.”", 
    "section": "national", 
    "title": "A ray of hope, says Mumbai’s LGBT community", 
    "subsection": "general", 
    "date": "2016-02-03"
}