{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "How students were allowed to enter beach waters despite presence of teachers, ask parents\n\nA pall of gloom descended on Abeda Inamdar College here as the bodies of 14 students who drowned at the Murud beach arrived on Tuesday.\n\nAmid disbelief and despondency, parents performed the final rites of the children.\n\n“It is yet to sink in that they are no more,” said a disconsolate Mumta Ansari, father of the twins Rafiya and Shafiya, both of whom died in the tragedy.\n\nAccording to their neighbour Ashfaque Sheikh, Mr. Ansari, who runs a bakery in Shivajinagar, initially believed that his daughters were safe.\n\n“The news has shattered him ... both girls were very bright students,” said Mr. Sheikh.\n\nA shocked silence envelops the home of Madki Saif Ahmad at Kondhwe Khurd. Saif’s body was the last to be retrieved by the search teams on Tuesday morning. “The family is yet to come to terms with the tragedy. He was alive and well a few hours before the mishap … and then he was no more,” said a neighbour. Anger, recrimination and confusion permeated the tense atmosphere on the Abeda Inamdar College campus on Monday night with fraught parents and relatives of the students angrily questioning the authorities on how the group could venture into the sea despite the presence of teachers in the picnic.\n\n“I am told my brother risked his life to save other students ... he was fond of cricket ... he died a hero’s death,” said Parvez Shaikh, younger brother of Iftekar Shaikh who died in the tragedy.\n\nThe tragedy has triggered a debate as to who was responsible for the accident. While heart-broken parents have accused the college authorities of ‘negligence’ for failing to dissuade the students from entering the treacherous waters, the college authorities deflected the blame on lack of adequate security personnel on the beach. “The tragedy might have been averted had there been enough lifeguards on the beach,” said P.A. Inamdar, president of the Maharashtra Cosmopolitan Education Society which runs the college.\n\nAccording to some locals, the students plunged into the waters recklessly, ignoring warnings.\n\nIn the wake of the tragedy, the Deputy Director of Education has issued a circular prohibiting picnics around risky places.", 
    "section": "national", 
    "title": "Beach tragedy: anger at Pune college", 
    "subsection": "general", 
    "date": "2016-02-03"
}