{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The BJP may be disputing the Dalit origins of Rohith Vemula, the research scholar who ended his life at the University of Hyderabad, but it is stepping into the breach between itself and Dalits, especially those looking at a resurgent Bahujan Samaj Party in Uttar Pradesh.\n\nNewly re-elected BJP president Amit Shah, who earned his stripes at the party’s national level by engineering a spectacular score of 71 out of 80 seats in U.P. in the 2014 general elections, will helm the charge himself this time too.\n\nMr. Shah will be travelling to Balrampur in U.P. on February 24 when he will inaugurate an office for the district-level BJP unit and then travel to Bahraich in to participate in a programme organised to commemorate the 11th Century Pasi ruler Maharaja Suheldev.\n\nMaharaja Suheldev is an important historical figure not only because he was a Pasi or belonging to the second largest Dalit community in U.P. (around 16% of all Dalits) but also because he is seen as someone who blocked the Islamisation of the place by defeating the nephew of Mahmud of Ghazni, Sayyad Salar Masud.\n\nAccording to legend, Masud had laid waste to the cities of Meerut, Kannauj and Malihabad but came a cropper when faced with Maharaja Suheldev. The Pasis were also active in the Ramjanmabhoomi movement and in 2014 voted en bloc for the BJP. The party had won all 17 Scheduled Caste seats in the State.\n\nThe BSP too had in the past invoked Maharaja Suheldev, commissioning his statues in several districts, but the BJP feels that as a non-Jatav community already sympathetic to Hindutva forces, the Pasis may be won over.\n\nIn a meeting with party office-bearers last week, Prime Minister Narendra Modi said while the BJP may find itself at odds with certain kinds of Dalit articulation, there were several points on which a consonance could be drawn, the biggest being the appropriation of certain Dalit icons such as Mahatma Jyotiba Phule in Maharashtra and Suheldev in U.P.\n\nMaharaja Suheldev is said to have defeated Salar Masud, nephew of\n\nMahmud of Ghazni", 
    "section": "national", 
    "title": "BJP to commemorate medieval Dalit ruler", 
    "subsection": "general", 
    "date": "2016-02-03"
}