{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "There is a perception that Anar (left) and Shwetank, children of Anandiben Patel (right), “interfere in governance and influence decision making.”— Photo: Special Arrangement.\n\nConcerned about a widely shared perception regarding Gujarat Chief Minister Anandiben Patel’s children Anar and Shwetank (Sanjay)’s emergence as ‘parallel power centres’ who “interfere in the governance and influence decision making,” Prime Minister Narendra Modi has asked his successor to “dispel the perception” and “rectify her image” that has taken a beating.\n\nThis has given rise to speculation about her continuation at the helm.\n\n“The way the perception has been built and spread, it is a matter of great concern. The Prime Minister and others have conveyed to her to rectify and improve the image,” said a top source close to her and the Prime Minister.\n\n“Not only in Gujarat, even in Delhi her children’s involvement in the governance process has become a point of discussion,” he said, stressing that “this perception has been created by her rivals from within the party as well as opponents.”\n\n“Neither of the two, Anar or Shwetank, has ever tried to interfere in our work,” the official added.\n\nIt is learnt that Mr. Modi had a word with Anandiben on the issue when she visited Delhi on January 25, the day Amit Shah was elected BJP president.\n\nSome BJP workers and bureaucracy have even started drawing comparisons between her government and that of Keshubhai Patel, who also faced allegations of interference and corruption by his family members, which eventually led to his removal in October 2011.\n\nEver since the 73-year-old Anandiben Patel took over as Chief Minister of Gujarat succeeding Mr. Modi following the May 2014 Lok Sabha polls, an impression has gained ground that her two children wield influence in the government.\n\nShwetank Patel, (who changed his name from Sanjay) is a businessman and owns a Bombay stock exchange-listed company Anar Industries Ltd, which, as per its website, “is an integrated construction, infrastructure development and management company in India.”\n\nHis 44-year-old sister Anar is a social entrepreneur and business woman.\n\nA prominent factor that has apparently given rise to the perception is their proximity to top builders and real estate players in Ahmedabad where land and realty prices have skyrocketed in the last decade.", 
    "section": "national", 
    "title": "Dispel wrong impression about your children’s ‘role’, Modi tells Anandiben", 
    "subsection": "general", 
    "date": "2016-02-03"
}