{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "A week after the visit of President Francois Hollande, which failed to produce a breakthrough in pricing for the Rafale aircraft deal, French Ambassador Francois Richier says the price and the terms of delivery will be better than those negotiated by the previous United Progressive Alliance government, and the terms “should take no more than four weeks”.\n\n“The price will be better, the conditions for delivery will be better, each and every part of the deal will be better than before,” he told The Hindu in an exclusive interview here.\n\nMr. Richier rejected criticism over delays, given that nine months have passed since Prime Minister Narendra Modi announced, during a visit to Paris, that India would buy 36 planes in a flyaway condition. He said it was “completely wrong to draw any link” between the President’s visit to Delhi and the conclusion of the Inter-Governmental Agreement, as had been widely speculated. “It would have been an artificial timeline and in a deal which will commit the countries for decades, that would have made no sense,” he said. India’s demand for “Make in India” components to the deal “would be done”. However, he said that once the India-France negotiations were completed, India could take a longer time to scrutinise the deal internally.\n\nMr. Richier’s comments come after questions whether the deal would go the way of the Indo-French “Make in India” Maitri missile partnership to build a surface-to-air missile that had made little movement on the ground since its announcement in 2009.\n\nAlso under question has been the Indo-French nuclear project at Jaitapur, which was started in 2009, but has not gone beyond the demarcation of land.\n\nMr. Richier said that during Mr. Hollande’s visit, several steps had been taken to expedite the nuclear partnership, and France was now committed to providing India nuclear fuel for the entire lifetime of the Jaitapur plant comprising six reactors of 1,650 MW each. However, the construction would take at least a year to start as the negotiations on pricing for Jaitapur and other elements were yet to be finalised.\n\nTwin benefit\n\nMr. Richier said the reactors, when ready, would serve a twin purpose. “India needs electricity desperately and also is committed to increasing the share of non-polluting energy sources. So Jaitapur is part of the solution for India to cope with electricity crunch and the climate change challenge,” he said. In the first reaction to India’s decision to ratify the IAEA convention on supplementary compensation, four years after India signed it, Mr. Richier said France welcomed the announcement and felt “more comfortable” with the nuclear negotiations.\n\nMr. Richier also disclosed that while France welcomed any cooperation by India in fighting the Islamic State, Mr. Hollande had not asked Mr. Modi to join the coalition conducting air strikes in Syria and Iraq. Marking out the separate joint declaration on terror as a “platform for action,” he said France would also share with India a full brief on the Paris terror attacks in which 130 people were killed in November 2015. “So, we discuss our operations, we share information, and we have exchanges like the joint exercises between the armies,” Mr. Richier said, disclosing that French counter-terror forces GIGN and NSG that deal with urban terror would soon perform joint exercises.\n\nHe said France was disappointed by India’s decision to award the high-speed Ahmedabad-Mumbai rail link to Japan, but said it would now focus on the Delhi-Chandigarh sector, where it hoped to shrink the travel time from about 4 hours to just 1 hour. “Everything that India and France have discussed [during Mr. Hollande’s visit] is to set the stage for decades of cooperation.”", 
    "section": "national", 
    "title": "French envoy promises a cheaper Rafale", 
    "subsection": "general", 
    "date": "2016-02-03"
}