{
    "author": [
        "Brooks Barnes"
    ], 
    "text": "A startup has come up with an app which alerts users when indie films that generate a lot of buzz at Sundance film fest are released. The subject and director of documentary film Sonita are seen accepting an award at this year's festival.— File Photo\n\nMany of the movies that played at this year’s Sundance Film Festival, which ended on Sunday, have already been forgotten. It is harsh but true. Buzz comes and goes fast in the social media age.\n\nBut David Larkin says he believes he has a digital solution. Mr. Larkin is chief executive of Plexus Entertainment, a startup behind the website and app GoWatchIt. The service has multiple functions, but a primary one allows users to add the titles of unreleased movies to a digital queue. When the film does become available, GoWatchIt sends an alert. Mr. Larkin’s research indicates that Sundance entries are released, on average, 206 days after their festival premieres.\n\n“It’s pretty obvious that more people read about and are interested in Sundance films than actually go to Sundance, but the challenge is converting that buzz into paying customers,” Mr. Larkin said. “Generating awareness is great, but it does very little good unless the consumers you have made aware are then escorted to a purchase.”\n\nGoWatchIt expanded its partnership with Sundance this year — there was a GoWatchIt button on each page of the festival’s digital program guide — and Larkin said that “low tens of thousands” of people added films to queues. For the art films that play Sundance, that could be a significant number, “helping kick-start word of mouth for a limited theatrical run or helping get on the iTunes top-seller list,” he said.\n\nMr. Larkin said tests showed that GoWatchIt users opened emails notifying them of film availability in theaters, or on sites like Amazon, Netflix and iTunes, at a rate of up to 62 per cent and then click through to a movie service where a film can be bought or rented in up to 18 percent of cases. Those rates are sharply higher than the industry norm for entertainment-related emails, according to Constant Contact, an online marketing company.\n\nGoWatchIt makes money by charging fees to studios access to the site’s data for specific films. (The company has a partnership with the online movie section of The New York Times .) — New York Times News Service", 
    "section": "national", 
    "title": "Giving Sundance movies a second chance", 
    "subsection": "general", 
    "date": "2016-02-03"
}