{
    "author": [
        "National Bureau"
    ], 
    "text": "Manmohan accuses Centre of curtailing funds, but Jaitley says allocation has been stepped up\n\nSeparate functions organised by the government and the Congress party on Tuesday to mark the 10th anniversary of the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) saw them clashing over fund allocations to the MGNREGS programme launched under the Act, now that the NDA coalition is in power.\n\nWhile former Prime Minister Manmohan Singh, speaking at the Congress’ event in Anantapur district in Andhra Pradesh, accused the Narendra Modi government of “killing the soul and spirit of the MGNREGA”, Finance Minister Arun Jaitley said that his government had, in fact, “boosted” the funding for the programme.\n\n“The Modi government is seeking to kill the soul and spirit of the Mahatma Gandhi National Rural Employment Guarantee Scheme by withholding payments to States for MGNREGA works,” Mr.Singh said at Bandlapalli village in Anantapur where he and Congress president Sonia Gandhi had launched the rural job scheme a decade ago. “In 2014-15 alone, the government of India did not make payment of Rs.6,000 crore to States for already executed MGNREGA works,” he said.\n\nThis was disputed by Mr.Jaitley, who was speaking at a government organised event on the same issue in Delhi. “This government has not followed the practice of just making higher provisions and later cutting it. I think this would be the first year when Rs.34,000 crore-Rs.35,000 crore, which was allocated has not only been spent fully, but also more resources could be given to MGNREGS,” he said.\n\nHe said that the actual spending under the scheme in the fiscal year ending March 31 “would be highest”. “This country’s financial system had a practice that when the Budget is presented, people discuss how much money has been allocated. But in a full year, how much money is spent and by how much the allocation is cut, that doesn’t attract attention,” he said.\n\nThe MGNREGS has not been popular with the current government, with Prime Minister Narendra Modi referring to it in Parliament as a living example of the Congress’ mistakes. “People can doubt my understanding on some subjects, but no one can doubt my political sense. My understanding tells me never to remove MGNREGS because it is an example of six decades of failure of the Congress party; it has to pay people to dig ditches,” Mr.Modi had said in February last year.\n\nThis year, however, battered by a drought and rural distress, it seems the government is finding virtues in the “mistakes of the past”.", 
    "section": "national", 
    "title": "Govt. stifling scheme, charges Cong.", 
    "subsection": "general", 
    "date": "2016-02-03"
}