{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Kapil Sibal says penalising expression of consensual sexuality in private is unconstitutional\n\nIn his opening argument on Tuesday before the three-judge Bench of Chief Justice T.S. Thakur and Justices Anil R. Dave and J.S. Khehar, hearing a batch of curative petitions against Section 377 of the Indian Penal Code, senior advocate Kabil Sibal said: “Any provision that penalises an adult person’s expression of consensual sexuality in private is significantly unconstitutional.”\n\nThere was a galaxy of senior lawyers representing the petitioners, including senior advocates K.K. Venugopal, Ashok Desai, Shyam Divan, Anand Grover and Colin Gonsalves.\n\nThe open court hearing was the fruit of two years of waiting since the batch of eight curative petitions was filed in March 2014 by parents, civil society, scientific and LGBT rights organisations against a January 28, 2014 apex court verdict dismissing their review petitions on the ground that Section 377 is Constitutional and applies to sexual acts irrespective of age or consent of the parties.\n\nThe Review Bench in January 2014 had agreed with its original appeal judgment on December 11, 2013, setting aside the historic and globally accepted verdict of the Delhi High Court. The High Court had declared Section 377 unconstitutional, and said it was in violation of the fundamental rights enshrined in Articles 14, 15 and 21 of the Constitution.\n\nThe High Court, led by its then Chief Justice A.P. Shah, had read down Section 377 to apply only to non-consensual, penile, non-vaginal sex, and sexual acts by adults with minors.\n\n“Your past judgments not only affect the present but will bind future generations to a life of indignity and stigma,” Mr. Sibal submitted. “If not corrected now, your verdicts may result in ‘immense public injury,’” he argued.\n\nMr. Sibal, joined by Mr. Grover, appearing for petitioner Naz Foundation, argued that the apex court struck down the 2009 Delhi HC judgment despite the Centre not challenging the lower court’s verdict.\n\n“The matter is of such importance that it should go to a five-judge bench,” Chief Justice Thakur responded.\n\nMeanwhile, when Chief Justice Thakur asked if there was anyone opposing the petitioners, the Apostolic Churches Alliance made it clear that “homosexuality is an abomination in the Bible” and decriminalisation of Section 377 would lead to legalisation of homosexuality. It argued that such a situation would make the Prevention of Immoral Trafficking Act redundant. The petitioners have contended that homosexuality was not a mental disorder, but a normal and natural variant of human sexuality. Even the International Classification of Diseases (ICD-10) of the World Health Organisation (WHO) and the Diagnostic and Statistical Manual (DSM IV) of the American Psychiatric Association, the globally accepted standards for classification of mental health, no longer considered non-peno-vaginal sex between consenting adults as mental disorders.", 
    "section": "national", 
    "title": "It’s no mental disorder: petitioners", 
    "subsection": "general", 
    "date": "2016-02-03"
}