{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "India and Bangladesh are expected to discuss India’s access to the Chittagong port as part of their discussions under the joint task force set up to deepen maritime cooperation, visiting Bangladesh Foreign Secretary M.Shahidul Haque said here on Tuesday.\n\n“One area, which is relatively new, is about the joint task force with India to look at that particular understanding we signed (on maritime cooperation). In the first week of March, there will be the first meeting in Dhaka to discuss the modalities and translate the understanding to delivery,” Mr.Haque said.\n\nHe said talks on the Chittagong port were progressing well and the modalities of its use were being discussed. Asked if it would be discussed by the joint task force, he said all issues would be taken up.\n\nDuring Prime Minister Narendra Modi’s visit to Dhaka in June last year, the two countries had signed two Memorandums of Understanding (MoU) on “blue economy and maritime cooperation in the Bay of Bengal and the Indian Ocean” and on “use of Chittagong and Mongla ports”.\n\nPact on coastal shipping\n\nFollowing this, the two countries signed a Standard Operating Procedure (SOP) in November to operationalise the agreement on coastal shipping. China had earlier offered to develop the Chittagong port, raising concerns in India which sees it as an encirclement move by Beijing under its “string of pearls” strategy.\n\nDuring his two-day visit, Mr. Haque held discussions with his Indian counterpart S.Jaishankar and also called on National Security Advisor Ajit Doval and Special Secretary, Ministry of Water Resources, Amarjit Singh. The two sides reviewed the progress of implementation of the agreements signed during Mr.Modi’s visit in these meetings.\n\n“We primarily discussed four clusters of issues. One was peace, development and security and talks ranging from border management, anti-trafficking and terrorism and countering extremism,” he told the media but refused to give out details.\n\nOn the progress made in settling the Teesta river water sharing, Mr.Haque expressed optimism. “Let’s wait and see. We are very optimistic,” he said.", 
    "section": "national", 
    "title": "Joint task force to discuss India’s access to Chittagong port", 
    "subsection": "general", 
    "date": "2016-02-03"
}