{
    "author": [
        "N J"
    ], 
    "text": "They will meet Chief Minister Chandy for another round of talks today\n\nWhile getting ready for another round of parleys with Kerala Chief Minister Oommen Chandy on Wednesday, the endosulfan victims of Kasaragod, who have been waging a relentless battle to win their legitimate rights, are expecting palpable action to redress their woes.\n\nScores of victims have lived without medicines for eight months. The alleged laxity of the government in implementing the National Human Rights Commission (NHRC) recommendations for their welfare in full, and the apathy of nationalised, scheduled and cooperative banks in waiving off their loans have forced them to take the plunge. The victims and their families were reluctant to expose their plight before the world.\n\nBut the alleged political and bureaucratic indifference in complying with the commission recommendations forced the Endosulphan Virudha Samyukta Samara Samithy to bring the victims from Kasaragod for an agitation before the Secretariat. Braving the scorching heat, the victims and their relatives have been staging a protest since January 26.\n\nSamithy convener Ambalathara Sahadevan says that the main concern is the deteriorating health of the victims. “All of them are seriously ill and do not have the immunity to bear climatic vagaries. Their relatives do not have the wherewithal to provide medical care too. Being driven to the wall, we decided to move to the capital for a concrete solution,” he says.\n\nWhile the government claims to have disbursed substantial sums as relief, Mr. Sahadevan has a different tale to tell. Against the commission recommendation to give Rs.5 lakh to the kin of the dead and to the bedridden and mentally challenged victims and Rs.3 lakh each to others, the officials have been disbursing only sums ranging between Rs.1 lakh and Rs.3 lakh so far. Pension disbursal too has been erratic. Free medicine supply has virtually come to a halt. Banks are forcing the victims to repay the loans they took for treatment. A proposal for setting up a bio-village with education, health and other facilities in the district is hanging fire.", 
    "section": "national", 
    "title": "Kerala’s endosulfan victims hoping for an end to their woes", 
    "subsection": "general", 
    "date": "2016-02-03"
}