{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Raghuvansh Prasad Singh has been left out of the celebrations to mark 10 years of the Act.\n\nSomewhere in the middle of the battle between the Congress and the government over the ownership of the Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS) is former Union Minister Raghuvansh Prasad Singh, the man who guided the job guarantee scheme through choppy financial waters.\n\nMr. Singh had been the Minister for Rural Development from 2004 to 2009, the crucial years between conceiving the programme and etching it in the law books. The flagship programme of the UPA government had been handed over to Mr. Singh, a member of the Lalu Prasad-led Rashtriya Janata Dal, in the division of portfolios within the alliance.\n\nBetween the reformist leanings of former Prime Minister Manmohan Singh and Deputy Chairperson of the Planning Commission Montek Singh Ahluwalia, and the rights-based approach advocated by Congress president Sonia Gandhi and her National Advisory Council (NAC), it was Mr. Singh’s obduracy that carried the day.\n\n“It is 10 years since the programme was launched, first implemented in 200 districts, then 120 and then the whole country. Over Rs. 3,14,000 crore have been spent on this programme. As a poverty alleviation programme, it has no parallel the world over,” he told The Hindu from Patna.\n\nMr. Singh says that he feels no bitterness towards the Congress or the government for shutting him out of the celebrations to mark 10 years of the scheme. “They are all using either party platforms or official ones for it, why should they call me? I got the opportunity to do a particular job and I did it. Haani laabh, yash apyash, vidhi haath (profit and loss, fame and notoriety is all in the hands of fate),” he said.\n\n‘Funds not enough’\n\nHe did, however, feel upset over the “dilution” of the job guarantee act. “The NDA government is not allocating enough funds for it. There has to be more transparency on payouts.”\n\nNowadays, Mr. Singh is busy with the Madhesi movement in the Terai region bordering Nepal. “This blockade is ruinous and the Indian government, that played such a positive role in the past in Nepal, has sold out on the interests of the Madhesis,” he said.", 
    "section": "national", 
    "title": "Man who steered plan has no grouse", 
    "subsection": "general", 
    "date": "2016-02-03"
}