{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Not a single BJP leader could muster courage to visit the University of Hyderabad, says Punia\n\nStudents of various universities and colleges during a protest over Rohith Vemula’s suicide at the University of Hyderabad.— file Photo: PTI\n\nP.L. Punia, Chairman, National Commission for Scheduled Castes, has said there is a design in the assertion of senior Ministers of the Narendra Modi government that Rohith Vemula, a research scholar of the University of Hyderabad, was not a Dalit.\n\nThe statements by Human Resource Development Minister Smriti Irani, External Affairs Minister Sushma Swaraj and Minister for Social Justice and Empowerment Thaawar Chand Gehlot point to their desperate attempt to help out their Cabinet colleague Bandaru Dattatreya, if he is booked for the violation of the Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Amendment Act, Mr. Punia told The Hindu . “Why is the BJP so worried about discussing the caste of Rohith Vemula [who committed suicide] if it is not to bail out the Minister, while continuing to show commitment to the Dalit cause,” he asked.\n\nThe Act, which received the President’s assent on December 31, 2015, provides for stringent punishment. It has widened the definition of atrocities and provides for a trial to be completed within two months from the date of filing of a charge sheet. The commission which Mr. Punia heads is a constitutional body, empowered to go into complaints of denial of the rights of the Scheduled Castes.\n\nMr. Punia said the Ministers were now worried by the time-bound trial mandated by the Act, which was passed by the BJP government.\n\n“Not a single BJP leader could muster courage to visit the University of Hyderabad after the suicide of Vemula. All they could do was to deny that he was a Dalit,” he said, underscoring the two visits of Congress vice-president Rahul Gandhi to the campus.\n\nMr. Punia said he had certificates to prove that Vemula belonged to a Scheduled Caste.\n\n“There is no doubt that Rohith was a Scheduled Caste, brought up by his mother after his father deserted the family. The mother holds a Scheduled Caste certificate. I have also asked the Police Commissioner, the university Vice-Chancellor and the Telangana Chief Secretary to submit an action-taken report,” he said.", 
    "section": "national", 
    "title": "‘Ministers trying to bail out Dattatreya’", 
    "subsection": "general", 
    "date": "2016-02-03"
}