{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Prime Minister Narendra Modi, on Tuesday, accused the Congress of trying to instigate Dalits against him and assured the nation that as long as the name of B.R. Ambedkar existed in the hearts of the people, reservations for the oppressed classes would continue.\n\nAddressing a meeting, which many observers say signals the start of the BJP’s election campaign, at the CODISSIA grounds here, Mr. Modi avoided any reference to the major regional players — AIADMK and DMK. Rather, he took on the Congress accusing it of trying to instigate the Dalits against him as the Opposition had no real issues to target the Centre. The comments assume significance in the backdrop of the death of Dalit research scholar Rohith Vemula at the University of Hyderabad, an incident that has led to widespread protests, including a fast attended by the Congress vice-president Rahul Gandhi.\n\nReiterating his commitment to the Dalit cause, Mr. Modi said the Centre had paid rich tributes to Ambedkar on the occasion of his 125th birth anniversary. Even a special debate was held in Parliament to commemorate the occasion.\n\n“When we dedicate ourselves and work for the Dalits and backward communities, some get worried. For long, they have thought that it was [the community] was their vote. So they now want to stop the Dalits from going to Modi. In the name of Dalits, lies are being spread,” the Prime Minister remarked, charging the Opposition with an inability to digest the fact that a person who was once a tea seller now has control over the administration. “Now they are propagating falsehood that Modi will kill reservation. I assure you, as long as the name of Ambedkar exists, no one can destroy reservation for Dalits,” he said. Mr. Modi exhorted the public to look back at how the country was two years ago. Scams and scandals surfaced almost on a daily basis during the previous UPA regime and hurt the confidence of the nation and its youth.\n\n“After we took over, enthusiasm has been restored and the youth are upbeat. There has not been a single incidence of corruption,” he claimed.\n\nSince the Opposition had no real issues to target him, they have resorted to stalling the Rajya Sabha to block passage of crucial Bills. “We work hard and pass the laws in the Lok Sabha. But in the Rajya Sabha, they says let’s see what we could do to him and are blocking every thing. Is this good politics? They are hurting the people in trying to teach me a lesson,” Mr. Modi said. On the economic front, he said there was an overwhelming global consensus that among the larger economies, India was the fastest growing. “Under our government, FDI inflow has gone up by 39 per cent,” he claimed.\n\nThe Prime Minister also dwelt on welfare measures initiated by the Centre, including the crop insurance scheme, the launch of ‘Make in India’ and ‘Start Up India’ and administrative reforms.", 
    "section": "national", 
    "title": "Opposition trying to instigate Dalits against me: Modi", 
    "subsection": "general", 
    "date": "2016-02-03"
}