{
    "author": [
        "Sampath G"
    ], 
    "text": "There is thus no question of this being a Dalit versus non-Dalit issue, says Gehlot\n\nEchoing the stand taken by his Cabinet colleagues, Union Minister for Social Justice and Empowerment Thaawar Chand Gehlot, speaking at a media event in Jaipur on Tuesday, said Rohith Vemula’s suicide was not a Dalit issue as he was not a Dalit. He was responding to a question from The Hindu on whether the Social Justice Ministry, in the aftermath of Vemula’s suicide, was planning any awareness campaign to sensitise the upper castes to the problems faced by Dalits.\n\n“Before Vemula’s suicide, there had been nine suicides on the same campus [University of Hyderabad]. This was the tenth suicide. Why didn’t the first nine suicides become a big issue?” asked Mr. Gehlot. “Vemula’s suicide note does not name anyone as responsible for his decision. Rather, if you read his letter you will find the needle of suspicion pointing at his own companions, to the members of the association to which he belonged. Despite this, we have not taken action against anyone.”\n\n“Secondly, Vemula and his entire family belong to the Vaddera caste and that makes him an OBC. There is thus no question of this being a Dalit versus non-Dalit issue,” Mr. Gehlot said.\n\nHis statement comes in the wake of media reports that Vemula’s mother was a Mala (a Dalit caste) and that Vemula had grown up as the son of a Dalit single mother, following her separation from her OBC husband.\n\nMr. Gehlot reiterated that the issue of Vemula’s suicide “should be restricted to one about getting justice, support and compensation for his family, and should not be politicised.”\n\nHe said the letters to the Hyderabad Central University by Union HRD Minister Smriti Irani were merely to seek a status report on the situation on the campus and not to apply pressure on the university administration to take action. “Coming to the issue of Bandaru Dattatreya’s involvement, the Ambedkar Students Association had opposed the hanging of Yakub Menon through SMSes and Facebook messages in which they said that you have killed one Yakub Memon but we will produce a hundred Yakub Memons – and it was this that the ABVP had opposed and sought the intervention of Mr. Dattatreya.”\n\nAmbedkar Jayanthi\n\nListing the various initiatives of the Social Justice Ministry, Mr. Gehlot said that in connection with Dr. Ambedkar’s 125th birth anniversary, his Ministry had decided to celebrate Ambedkar Jayanthi in a big way.\n\n“All the places associated with Dr. Ambedkar, such as his birthplace Mhow, his chaitya bhoomi, diksha bhoomi, the residence where he breathed his last, 26, Alipore Road, will be developed as memorial places. An Ambedkar International Study Centre will also be established at a cost of Rs. 152 crore, and its foundation ceremony was held recently,” he said.\n\nMr. Gehlot was speaking to the media at the All India Conference of Regional Editors in Jaipur.\n\nWhy didn’t other suicides in UoH become a big issue, asks Thaawar Chand Gehlot", 
    "section": "national", 
    "title": "Rohith was not a Dalit, says Social Justice Minister", 
    "subsection": "general", 
    "date": "2016-02-03"
}