{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court on Tuesday set up a committee headed by the former Chief Justice of India, R.M. Lodha, to oversee the process of refund of amounts allegedly collected by Pearls Group companies for a ponzi scheme involving over Rs. 45,000 crore and around six crore investors.\n\nThe amounts were collected allegedly through Pearls Agrotech Corporation Ltd. (PACL) and Pearls Golden Forest Ltd. (PGFL) on the promise of allotting agricultural land to investors from Delhi, Punjab, Haryana, Rajasthan and other States, including Kerala.\n\n'No deposits from public'\n\nA Bench of Justices Anil R. Dave and A.K. Goel ordered the companies to not accept deposits from the public.\n\nThe court directed the CBI to hand over title deeds of the companies’ landed assets to the SEBI, which will take appropriate steps to ensure their sale for the purpose of refunding investors.\n\nThe Bench restrained other courts from interfering with the sale proceedings.\n\nIt directed the SEBI to assist the Justice Lodha Committee with the refund process.\n\nFour arrested\n\nThe CBI had recently arrested Pearls Group chief Nirmal Singh Bhangoo and his three colleagues in connection with the scam.\n\nThe orders came on a batch of petitions, including that of PACL Customers and Employees Association represented by Supreme Court advocates Vipin Nair, P.B. Suresh and Prithu Garg. Senior advocate Arvind Datar appeared for the SEBI, while senior advocates Anil Diwan, Kapil Sibal and Aryama Sundaram appeared for PACL Group companies.\n\nPACL and PGFL had launched a ponzi scheme by the name of Collective Investment Schemes (CIS).\n\nInvestors file complaints\n\nHowever, various complaints of fraud and serious irregularities were filed by investors in Haryana, Punjab, Maharashtra, New Delhi, etc, pursuant to which local police, CBI and SEBI initiated investigations into the affairs and schemes of the companies.\n\nThe Association argued that the alleged scam affected investors in Kerala to the tune of over Rs. 500 crore.\n\nThe case has been listed to August 2.\n\nThe amounts were collected on the promise of allotting agricultural land\n\nto depositors", 
    "section": "national", 
    "title": "SC panel to oversee refund to investors in Pearls ponzi case", 
    "subsection": "general", 
    "date": "2016-02-03"
}