{
    "author": [
        "Jaideep Deo Bhanj"
    ], 
    "text": "Twenty-nine-year-old Rijul listens patiently every weekend to pleas from his family to get married and they have used almost every trick in the book to get him to meet girls. Rijul, however, keeps brushing them off saying that he needs to settle down financially before starting a family.\n\n“The real reason is that I am scared to tell my parents that I am gay... It will just push them away from me and I do not want to ruin a girl’s life by hiding my sexual orientation. I have come to terms with it and until the laws change in the country, I will live in my world in the company of my close friends I can confide in as family,” says Rijul.\n\nHospitals to godmen\n\nThe troubles faced by his cousin when he was in college convinced Rijul that he would not open up to his parents. “I remember the drama that took place in the family when my cousin told his parents that he had a boyfriend. From mental hospitals to godmen, the poor boy was tormented and he finally fled home,” says Rijul.\n\nStories like these are not uncommon as the fear of what society will think restrains many from leading their life the way they want to.\n\nTransgender activist Abhina Aher says every Indian should take a keen interest in the court proceedings with regard to Section 377 because “we are moving towards securing the Constitution for a modern India and the law affects everybody.”\n\n‘There is still hope”\n\nOutside the Supreme Court on Tuesday, people and petitioners gathered to celebrate the hope that the law may be scrapped. And in living rooms and offices, hundreds who did not have the courage to come out also exulted.\n\nVineeta, a college student, said: “I was in the bus going home after class and I kept refreshing my twitter feed. A little after 3 p.m. some journalists reported that the matter has been referred to a five-judge Bench. I did not understand what it meant but I was happy that there is still hope that I will be able to lead a life as a lesbian and not be treated as a criminal by society.”", 
    "section": "national", 
    "title": "Waiting to throw away the mask", 
    "subsection": "general", 
    "date": "2016-02-03"
}