{
    "author": [
        "Soumya Das"
    ], 
    "text": "Twenty per cent of the candidates in the first phase of the Assembly elections in West Bengal have criminal cases pending against them, says a report published by a civil society organisation.\n\nWhile polling will be held in 18 constituencies in the south and western districts of the State in Phase 1(A) on April 1, 31 will go to the polls in Phase 1(B) on April 11.\n\nThe report, which was released by West Bengal Election Watch here on Wednesday, said that in their affidavits to the Election Commission, 21 of the 133 candidates in Phase 1(A) had declared that they faced criminal cases.\n\nSeventeen of the candidates faced “serious criminal cases” of murder, attempt to murder, rape, kidnapping, robbery and crimes against women.\n\nThree of the 18 candidates of the Bharatiya Janata Party; two of the 18 of the Trinamool Congress; two of the five of the Congress; and one of the 11 of the Communist Party of India (Marxist) face the serious cases.\n\nElection Watch has named constituencies where three or more candidates face criminal cases as red-alert constituencies. In Phase 1(A), Salboni in Paschim Medinipur district and Purulia in Purulia district fall in this category, the report said.\n\nIn Phase 1(B), 37 of the 163 candidates face criminal cases.\n\nAmong them, 32 face “serious” allegations.\n\n“One candidate namely Hemant Prabhakar of the CPI(M) from the Asansol Dakshin constituency has declared one charge related to murder and six candidates have declared cases of attempt to murder,” the Election Watch report stated.\n\nTwelve candidates of the BJP, 10 of the 31 of the Trinamool, seven of the 19 of the CPI(M) and three of the Congress face criminal cases.\n\nJamuria, Pandabeswar, Indus and Kulti are red-alert constituencies.\n\nWomen candidates\n\nThe report said that in Phase 1(A), only nine per cent of the candidates are women and in Phase 1(B), only 13 per cent.\n\nTwenty-three of the 296 candidates are crorepatis. In Phase 1(A), three candidates, all from the Trinamool, have declared assets worth over Rs. 1 crore.\n\nIn Phase 1(B), 20 candidates have declared assets worth over Rs. 1 crore.\n\nThe cases include murder, rape, kidnapping and crimes against women", 
    "section": "national", 
    "title": "‘20% of Bengal candidates in Phase 1 face criminal cases’", 
    "subsection": "general", 
    "date": "2016-03-31"
}