{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The Union Cabinet on Wednesday approved the issuing of two ordinances, one to authorise expenditure beyond April one in Uttarakhand which is under President’s Rule, and the other to amend the Enemy Property Act, 1968.\n\nIn the second case, the Cabinet recommended the re-promulgation of an earlier ordinance that had been issued in January as Parliament failed to pass a bill to replace it within the stipulated time.\n\nInterestingly, the decisions were taken at a meeting of the Union Cabinet chaired by Home Minister Rajnath Singh as Prime Minister Narendra Modi is in Brussels.\n\n“The Union Cabinet met today [on Wednesday] and in view of the situation in Uttarakhand has recommended an Ordinance for the consideration of the President,” Union Telecom Minister Ravi Shankar Prasad told journalists, adding that it had become necessary as in the government’s view the State’s Assembly had failed pass the Budget and Appropriation Bill.\n\nThis meant, he continued, that no money could be withdrawn from the State’s Consolidated Fund. And since Uttarakhand was under President’s Rule “the Cabinet has recommended an Appropriation Ordinance for Uttarakhand, so that valid withdrawal of the government revenue can be done.”\n\nThis comes in the wake of the Cabinet Committee on Parliamentary Affairs (CCPA) recommending proroguing the Budget session of Parliament, a rare development, followed by the seeking and receiving of Presidential assent. This has enabled the government to recommend the promulgation of the two ordinances in what would have otherwise been the middle of the session.\n\nParliament’s Budget Session that began on February 23, has been in recess since March 16 and was to meet again on April 25.\n\nWith just two days left for the next financial year to begin, there was no time to pass the State Budget in Parliament — hence the Ordinance route to enable the State to meet its expenditure needs beyond April one.\n\nOn Tuesday, the CCPA had also recommended proroguing of the Rajya Sabha to enable the government to issue an ordinance on the Enemy Property Bill.\n\n“We had passed an Enemy Property Ordinance, which was ratified by the Lok Sabha and, when it went to the Rajya Sabha, it was referred to a Select Committee. The duration of this ordinance is going to expire in the first week of April. Therefore that ordinance has also been re-promulgated till the receipt of the report of the Select Committee,” Mr. Prasad said.\n\nThe ordinance for amendments in the 48-year-old Enemy Property Act was promulgated in January this year. The Bill to replace the ordinance was passed by the Lok Sabha on March 9 after the government rejected demands by some Opposition parties that it be sent to the Standing Committee. However, it could not be cleared by the Rajya Sabha where the government is in a minority and the Enemy Property (Amendment and Validation) Bill, 2016, was eventually sent to a Select Committee.", 
    "section": "national", 
    "title": "Cabinet nod for Uttarakhand, enemy property ordinances", 
    "subsection": "general", 
    "date": "2016-03-31"
}