{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The Union government will use the space provided to it by the proroguing of the Budget session – that is in recess till April 24 – to seek the promulgation of an ordinance related to the controversial Enemy Property Bill that was passed by the Lok Sabha on March 9, official sources told The Hindu . Fearing that the Bill will not be cleared by the Rajya Sabha where the government is still in a minority, it is resorting to the ordinance route.\n\nEarlier, this year on January 7, too, the government had passed an ordinance related to the Enemy Property Bill. On March 9, when the Bill came up before the Lok Sabha, the Opposition, with some even describing it as “anti-minority”, had asked that it be sent to a Standing Committee. The government, however, used its majority to get it through the House.\n\nOf course, the Bill to amend the original Enemy Property Act, 1968, was brought in by the previous UPA government (that too was called “anti-minority”), but with consensus on it eluding the 15th Lok Sabha, it lapsed. The 2016 Bill is, however, an even more draconian Bill. Normally, an ordinance has to be approved by Parliament: if it is not cleared within six weeks of the commencement of the session, the ordinance lapses. But since the second half of the session is less than six weeks – roughly a month – it can continue till the monsoon session.\n\nThis comes in the wake of the Cabinet Committee on Parliamentary Affairs (CCPA) recommending proroguing of the Budget session, followed by the seeking and receiving of Presidential assent. This was apparently done to empower the Centre to “exercise legislative powers under a Proclamation issued under Article 356” regarding the Appropriation Bill for Uttarakhand as, according to the Centre, the Assembly did not pass the Finance Bill for 2016-’17 on the day of its last sitting.\n\nIn short, when a State is placed under President’s Rule, Parliament can “confer on the President the power of the Legislature of the State to make laws, and to authorise the President to delegate, subject to such conditions as he may think fit to impose, the power so conferred to any other authority to be specified by him in that behalf.”\n\nIndeed, on March 28, in a blog entitled “A State without a Budget” that he had posted on Facebook, Union Finance Minister Arun Jaitley had hinted as much: “It is now incumbent upon the Central Government to ensure that steps are taken under Article 357 to authorise expenditure of the State with effect from 1st April 2016.”\n\nIn the wake of the India-Pakistan war of 1965, the Indian Government took over the properties and companies of those who migrated to Pakistan and became citizens of that country. These “Enemy Properties” – as well as the properties left behind by those who went to China after the 1962 Sino-Indian war — were vested by the Central government in the Custodian of Enemy Property for India through the Enemy Property Act, 1968. The Central Government, through the Custodian, is in possession of enemy properties spread across many States.\n\nThe amendments to the Enemy Property (Amendment and Validation) Bill, 2016, passed by the Lok Sabha, intended to guard against claims of succession by or transfer of properties to descendants of those who migrated after the wars. The amendments even deny legal heirs even if they are Indian citizens any right over such property, and disallows any civil court or other authority from entertaining any suit or proceeding in respect of any enemy property or any action taken by the Government or the Custodian.\n\nThe main aim is to negate the effect of a Supreme Court judgment of 2005 in favour of the current Raja of Mahmudabad, who fought legal battles for 30 years to gain possession of the estates of his father after the latter’s death.", 
    "section": "national", 
    "title": "Centre to promulgate ordinance on Enemy Property Bill", 
    "subsection": "general", 
    "date": "2016-03-31"
}