{
    "author": [
        "Somesh Jha"
    ], 
    "text": "New jobs in eight labour-intensive industries fell to a six-year low in the first nine months of 2015 — with just 1.55 lakh new jobs being created compared to over three lakh jobs over the same period in 2013 and 2014, according to Labour Bureau data.\n\nAnalysts said this was not a healthy sign, especially since the July-September quarter usually sees more jobs being added compared to other quarters in the year as companies conduct recruitment drives.\n\n“Our industrial growth has been low and employment takes place only when production is up. There is a lot of rationalisation of staff in the corporate sector and the government itself is not recruiting people. The main idea of growth is to create jobs. Ultimately, we need to create jobs at all levels, which is not happening,” said Madan Sabnavis, chief economist, Care Ratings.\n\nThe latest quarterly survey conducted by the Labour Bureau showed 1.34 lakh jobs were created in July-September 2015, the lowest in the similar quarters since 2009 when the survey was started. In January-March 2015, though the number of jobs increased by 64,000, it declined by 43,000 in the quarter ended June taking the net addition of jobs during 2015 to 1.55 lakh.\n\nBy contrast, 3.04 lakh new jobs were added in January-September 2014 and 3.36 lakh in the same period of 2013, a Labour Bureau survey showed.\n\nThere was a sharp decline in hiring of contract labour in 2015. Contractual jobs declined by 21,000 in January-September 2015 against an increase of 1.20 lakh in the corresponding period of 2014.\n\nDirect employment rose by 1.76 lakh in 2015 compared to an increase of 1.84 lakh in 2014.\n\nThe Labour Bureau, under the Ministry of Labour and Employment, started conducting this quarterly survey after the 2008-09 global crisis to gauge its impact on employment in eight crucial sectors — textiles, leather, metal, automobiles, gems and jewellery, transport, information technology (IT) and handloom.\n\nWhile fewer jobs were added in all the eight sectors, the sharpest fall was seen in the gems and jewellery sector where the number of jobs declined by 11,000 in 2015 compared to job addition of 16,000 in 2014. There was a sharp decline in the job additions in the automobile sector as only 5,000 new jobs were created in January-September 2015 compared to 48,000 in the same period last year. Most of the new jobs were seen in the IT sector where job additions went up by 90,000 in 2015. Transport and handloom continued to show a declining job growth.\n\nIndian Staffing Federation President Rituparna Chakraborty expressed surprise at these numbers. “The staffing industry is going at a healthy 18-20 per cent. The data released by the Labour Bureau doesn’t give a comprehensive landscape of the job growth in the country as it doesn’t capture many sectors,” she told The Hindu .", 
    "section": "national", 
    "title": "Employment growth slows to six-year low", 
    "subsection": "general", 
    "date": "2016-03-31"
}