{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Coffee with Captain:Amarinder Singh is most likely to be the chief ministerial candidate of the Congress in the Assembly elections in Punjab in 2017.— PHOTO: Sushil Kumar Verma\n\nAmarinder Singh, the likely chief ministerial candidate of the Congress in the elections due next year in Punjab, has been asked to become more accessible to the people. For that, one of the key outreach programmes is “Coffee with Captain”, an interactive session launched in Amritsar on Wednesday.\n\nNearly 500 people participated in the first round of the programme, which is somewhat similar to the “Chai Pe Charcha” programme of Prime Minister Narendra Modi during the campaign for the Lok Sabha elections in 2014.\n\nSitting on a dais, Capt. (retd) Singh talked about the compelling political and social issues, and took questions from the crowd.\n\nThe author of “Chai Pe Charcha” and “Coffee with Captain” is the same — the celebrity poll strategist Prashant Kishor. The Congress leader is expected to shun his princely habits and mingle with the people on the ground.\n\nThe aim of the programme, said the Congress general secretary in charge for Punjab, Shakeel Ahmed, is to send Capt. Singh “out to charm the younger generation”.\n\n“As a common man, Captain will be open to all ideas. He will take inputs from people and also promise them some significant changes — that if he becomes the Chief Minister, he will eradicate the drug menace [in Punjab] within four weeks and also break the nexus among drug cartels, politicians and police,” Mr. Ahmed said.\n\nFormer Chief Minister of Punjab and one of the few older leaders in the Congress who had a close proximity with former Congress Prime Minister Rajiv Gandhi, Capt. Singh has a reputation of being a strong-headed politician who would never back down from his demands.\n\nIn December 2015, he reportedly “arm-twisted” the Congress high-command to take over the party office in Punjab by replacing PCC president Pratap Singh Bajwa, a former youth Congress activist, who a few years ago was handpicked for the president’s post by Congress vice-president Rahul Gandhi.\n\nMany embittered\n\nThe change in the leadership had left several young Congress leaders embittered as Mr. Singh is known to be comfortable around his own coterie.\n\nTo change those perceptions, a senior Congress leader said Mr. Singh is “working in tandem” with Mr. Kishor.\n\nSo far, Mr. Kishor has “convinced” Mr. Singh to encourage people that instead of calling him “Maharaja Sahib,” he should simply be called “Captain.”", 
    "section": "national", 
    "title": "For Punjab 2017, Congress thinks much can happen over coffee", 
    "subsection": "general", 
    "date": "2016-03-31"
}