{
    "author": [], 
    "text": "The Karnataka High Court on Wednesday asked the State government and the authorities of the Puttur Mahalingeshwara temple to print and distribute some additional invitation cards for the temple’s annual festival without mentioning the name of A.B. Ibrahim, Deputy Commissioner of Dakshina Kannada district.\n\n‘Mistake’\n\nA Division Bench, comprising Chief Justice Subhro Kamal Mukherjee and Justice Ravi Malimath, passed the order after Advocate-General Madhusudan R. Naik admitted on behalf of the State government that printing Mr. Ibrahim’s name was a “mistake” and he [Mr. Ibrahim] will not participate in any religious ceremony of the temple.\n\nRecording the A-G’s submission, the Bench said: “To avoid embarrassment to the DC [Mr. Ibrahim] himself, and to buy peace, we feel that an additional invitation cards be printed and distributed without mentioning the name of the DC.”\n\nBut the A-G told the court that “personally he [Mr. Naik] feels that there was no problem in including the name of particular person on the invitation card while also clarifying that Mr. Ibrahim had delegated the powers under the Karnataka Hindu Religious Institutions and Charitable Endowments Act 1997 to the additional DC within two day’s of he assumed the post of DC, Dakshina Kannada, in December 2013\n\n‘To buy peace’\n\n“We feel that the said Deputy Commissioner concerned cannot perform any religious function in the temple as he belongs to a different religion, which does not believe in idol worship,” the Bench observed, while referring to Mr. Naik’s submission that Mr. Ibrahim will not participate in any religious function of this temple.\n\nEarlier, the Bench orally observed that the row over printing of Mr. Ibrahim’s name had become “a prestige issue” for the parties involved.\n\nAlso, Mr. Mukherjee said that in West Bengal, his native State, a large number of persons hailing from Muslim community celebrate Durga pooja during Dasara festival, while pointing out that ultimately everyone worships “God” though in different names and religions.\n\nMeanwhile, Justice A.S. Bopanna disposed of another petition, that was filed by Naveen Kulal, a devotee of temple, based on the order passed by the Division Bench.\n\nDuring the hearing of Mr. Naveen’s petition last week, the State had defended the printing of Mr. Ibrahim’s name by stating that it was done as per the “protocol” but the petitioner had contended that State cannot have a protocol that violated the law.\n\n“I will consult Advocate-General, and the Muzrai Minister to decide the future course of action. We are also mulling amendment to the Hindu Religious Institutions and Charitable Endowments Act, 1997.\n\nT.B. Jayachandra\n\nLaw and Parliamentary Affairs Minister\n\nThe Bench observed that the row had become “a prestige issue” for the parties", 
    "section": "national", 
    "title": "High Court: print, distribute additional invitation cards without DC’s name", 
    "subsection": "general", 
    "date": "2016-03-31"
}