{
    "author": [
        "Ramya Kannan"
    ], 
    "text": "Chief Electoral Officer Rajesh Lakhoni has set tough targets: 100 per cent enrolment and turnout\n\nith a month-and-a-half to go for the polls in Tamil Nadu, one slogan doing the rounds is a clear favourite. It’s not quite what you are imagining, unless you are thinking “100 per cent”.\n\nRun a Google search on Rajesh Lakhoni, and a few of the results will take you to pages which slots him variously and loosely as “officer”, “celebrity” and “Indian politician”. They couldn’t have been so right and wrong at the same time, but that’s the thing with being a high-profile Chief Electoral Officer of a State going to polls — everyone has an opinion on you.\n\nMr. Lakhoni, heading the election process in Tamil Nadu, where polling will be held during the last phase, on May 16, is a man who is obsessed with “100 per cent”. His only aim, he says in his characteristic modest manner, is “to get a 100 per cent voter turnout”. No modest goal this.\n\nIf you take it at face value, that’s getting every single member on the electoral rolls to the booth to vote. If you take the historical context, then you realise what a tall order it is. The best voter turnout in the State was in the 2011 Assembly elections, at 78.01 per cent. During the Assembly elections in 1967, 76.57 per cent of the electorate voted, and in the 2014 Lok Sabha elections, 73.7 per cent. Historically, the voter turnout in the State has averaged largely around the 60 per cent mark with an unsettling dip — 59.07 per cent — in 2001.\n\nHuge challenge\n\nRousing the electorate to go there and cast the vote — every single one of the nearly 5.79 crore (that number is likely to go up with the final additions) currently enrolled — is, to put it plainly, no joke. Even if we do not take a literal view of the numbers, the challenge is still huge: how do you get folks to step out of home and vote? For Mr. Lakhoni’s team, the answer is: keep it simple, inspire them. And the “100 per cent” slogan appeared in a Eureka moment, as a heuristic solution: this time, it would fit the bill.\n\n“It is not just 100 per cent voter turn out, if you can remember we also have ‘100 per cent registration’ for new enrolment, ‘100 per cent fairness’ for the fair conduct of polls. 100 per cent is an absolute, true, but unless we aim for that, we cannot address all the bottlenecks,” he says.\n\nAnd the way ahead was also clear: create as loud a buzz as possible and make the message simple. And thus the team, under the leadership of this IIT-Delhi graduate, began to think out of the box. An ad agency was roped in to make smart ads and harness the power of social media.\n\nBanners and posters came up all over town, awareness camps, enrolment drives, quizzes on Twitter were held, and celebrities were roped in for endorsements. “The trick is to run it like an election campaign,” Mr. Lakhoni says. “Everyone gets involved, and frankly it is quite boring otherwise, isn’t it?”\n\nTarget group\n\nA clear target group was the 18-29 age group, comprising nearly 23 per cent of the electorate. Much of the early part of the campaign targeted this segment, exhorting them to enrol themselves, using the classic tools of persuasion — providing inspiration, shaming the laggard, giving “how-to” information — and it caught on with the youth. If social media performance alone is any indicator, then the Election Commission is running a successful campaign in a State where parties are yet to begin theirs.\n\nBut let’s go beyond social media. Simultaneously, the team geared itself up to move from awareness campaigns into actual intervention. People would want to enrol themselves, and when they do, they should be able to, or the campaign fails. Harnessing technology right from the word go, the election team sought requests for enrolment on the electoral rolls. Requests came from rehabilitation homes for beggars, homes for senior citizens, and in one case, from the Banyan: the EC took advantage of a loophole in the law — the specification of “unsound mind” — to grant permission to enrol to women who might have been mentally ill at some point but can take informed decisions now.", 
    "section": "national", 
    "title": "In campaign, EC is the front runner in T.N.", 
    "subsection": "general", 
    "date": "2016-03-31"
}