{
    "author": [
        "Yunus Y"
    ], 
    "text": "Apart from the fact that they are all students of the University of Hyderabad, Amol Singh, Deepak Sudevan and Rajat Thakur have another thing in common: they were prison buddies for five days, after they were jailed by the police along with 24 others.\n\nBut the time spent in prison was the better part of the week, after they were arrested. Amol, Deepak and Rajat said on Wednesday that they were brutally assaulted in the van while being taken to the police station on March 22. “After removing their badges, the cops, three or four of them, took turns to beat up each one of us, picked up from the Vice-Chancellor’s lawn last Tuesday,” recalled Amol, a student from the Political Science department.\n\nAmol said he was with 17 others in a police van after being picked up, while nine others were detained separately. Describing the van as ‘torture room on wheels,’ he said: “Deepak was shooting a video of the cops beating up the students using his phone, which is why he was picked up. His device has still not been returned to him.”\n\nThe trio said they were taken to the Miyapur police station last Tuesday after being picked up, then to the Balanagar station and, finally, to the judicial magistrate’s house in Tarnaka on Wednesday night. “We were abducted, as no one was informed of our whereabouts. Some faculty members who had come searching for us at the Miyapur police station saw us,” said Deepak.\n\nAll 27 accused finally met at the Kondapur Government Hospital on Wednesday, where they were taken for medical examination. It was here that Professor K.Y. Ratnam’s blood pressure was found to be over 200, said Amol. “We were also asked to sign the arrest document by the Gachibowli police inspector, without reading it,” alleged Deepak.\n\nAll three said they were not allowed to speak to the magistrate, when they were taken to her house, after which they were taken to the Cherlapally jail. Reaching prison turned to be a boon for all of them, where they even attended classes conducted by the professor. Among the other batch of nine who were picked up was Munsif, a student from the communication department. While their ordeal was the same as that of Amol and Deepak, the group was shown some kindness by a constable from the Chandanagar police station.", 
    "section": "national", 
    "title": "‘It was torture on wheels’", 
    "subsection": "general", 
    "date": "2016-03-31"
}