{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Explosion triggered by Maoists left a 5-foot crater on the road\n\nSeven CRPF jawans were killed in the explosion triggered by the Maoists in Dantewada district.— Photo: Special Arrangement\n\nSeven jawans of the Central Reserve Police Force (CRPF) were killed in a landmine explosion triggered by Maoists in Dantewada district of Chhattisgarh on Wednesday.\n\n“A vehicle of the CRPF’s 230th battalion was blown up by Maoists near the Malewara market on the Dantewada-Sukma road around 3 p.m. Seven jawans were martyred in the blast,” Dinesh Pratap Upadhyay, Deputy Inspector-General of the paramilitary force, Dantewada Range, told The Hindu . The blast left a five-foot crater and blew the Tata 407 vehicle into pieces.\n\n“The jawans belonged to the Ghusaras CRPF camp in Dantewada and were returning after leave for Holi,” Superintendent of Police Kamlochan Kashyap said.\n\nThe bodies of two of the seven CRPF men bore bullet injuries, suggesting the presence of Maoists at the spot.\n\nAccording to some local sources, the Maoists had brought some people carrying traditional weapons, possibly to snatch the weapons from the CRPF men. However, a reliable police source confirmed that all seven jawans belonged to the “non-combat” staff and were carrying no weapons with them.\n\nMr. Upadhyay confirmed that his men were shot at by Maoists even after the explosion.\n\n“The blast was so powerful that the bodies were thrown 100-150 metres away. Almost all of them might have died in the explosion or would have been on the verge of death. But it is true that Maoists shot some of the bodies,” he said.\n\nMr. Kashyap said two bodies had bullet injuries.\n\nThe deceased jawans were identified as Sub-Inspector D. Vijay Raj, constables Pradeep Tirkey, Rupnarayan Das, Devendra Chourasia, Ranjan Dash and Mritunjoy Mukharjee and driver Saindane Nana Usesing. The jawans were going in a single vehicle without any support party or a road opening party.\n\nAsked whether there might have been some lapses on the part of the jawans, Chhattisgarh Special DG (Anti-Naxal Operations) D.M. Awasthi told reporters on the Assembly premises that the all CRPF men were in plainclothes.\n\n“We issued instructions a few days ago. We will begin a probe to find out what went wrong,” he said.\n\nChief Minister Raman Singh said a probe would be conducted to find out whether or not the norms were followed [by CRPF men].", 
    "section": "national", 
    "title": "Jawans were returning from holiday", 
    "subsection": "general", 
    "date": "2016-03-31"
}