{
    "author": [
        "N Ravi Kumar"
    ], 
    "text": "It will be a progressive policy, looking to ride the next wave of growth, says IT Minister KTR; foundation stone laid for Amazon campus in Hyderabad\n\nTelangana Information Technology Minister K. Taraka Rama Rao greets senior vice-president and general counsel of Amazon.com David Zapolsky at the foundation-stone laying ceremony of the Amazon India campus in Hyderabad on Wednesday.-Photo: Mohammed Yousuf\n\nChief Minister K. Chandrasekhar Rao will launch Telangana’s Information Technology policy on April 4 in the presence of several front ranking leaders of the IT industry, including Infosys co-founder N.R.Narayana Murthy.\n\nIt will be one of most progressive policies, IT Minister K.T.Rama Rao declared, adding the focus is on riding the next wave of growth. Four sub-policies -- Innovation, Rural Technology, Electronics manufacturing and Gaming -- are also to be launched at the same function.\n\nThe Minister, interacting with presspersons after laying the foundation stone for Amazon’s campus at Gachibowli here, said the policy will be in “alignment with our thought process”.\n\nWhile the policy on Innovation is intended to support start-ups, the one on Rural Technology is to encourage rural entrepreneurship and promote innovation from villages.\n\nWithout sharing specifics, he said the Chief Minister is expected to make announcements, including in all likelihood on the seed investment fund proposed at the time of setting up of T-Hub incubator for technology start-ups.\n\nThe launch, he said, will see participation of another co-founder of Infosys Mohandas Pai, Intel Managing Director-South Asia Debjani Ghosh, Nasscom leaders B.V.R. Mohan Reddy and R. Chandrasekhar, Microsoft India head Bhaskar Pramanik, Samsung’s vice-president Deepak Bharadwaj and senior officials from the Centre.\n\nCompanies with plans to invest on facilities in the State will also sign MoUs with the government at the function, he said. Noting that the State’s rate of growth in IT exports was better than the country’s, Mr. Rama Rao said whether the Centre provided adequate funding for the ITIR project or not, the State government is keen on taking IT investments beyond Hyderabad. Google, he added, is expected to start work on a large campus in Hyderabad in May or June.\n\nAt the foundation laying programme, Amazon’s senior vice-president David Zapolsky said the e-commerce giant’s proposed campus here will be the largest outside of the US.", 
    "section": "national", 
    "title": "KCR to launch IT policy on April 4", 
    "subsection": "general", 
    "date": "2016-03-31"
}