{
    "author": [
        "Sriram Lakshman"
    ], 
    "text": "Prime Minister Narendra Modi arrived here on Wednesday for an official state visit to Belgium as well as the 13th EU-India Summit hosted by Donald Tusk, European Council President, and Jean Claude Juncker, President of the European Commission.\n\nMr. Modi’s day started off with meeting Members of the European Parliament and interacting with Indologists.\n\nThe symbolic high point was perhaps Mr. Modi’s visit to the Maalbeek metro station, shortly after noon, where he laid a wreath in tribute to those who were killed in last week’s terror attacks in Brussels. One of the bombs exploded on a train passing through Maalbeek, killing, among others, an Indian national, Raghavendran Ganeshan, whose body was repatriated to Chennai on Tuesday.\n\nMr. Modi was received at the metro entrance by Didier Reynders, Deputy Prime Minister and Foreign Minister of Belgium, as well as India’s Military and Air Attaches from Paris. Commerce Minister Nirmala Sitharaman, Foreign Secretary S. Jaishankar and India’s Ambassador to Belgium Manjeev Singh Puri were among those who accompanied Mr. Modi to Maalbeek.\n\nThe delegation then proceeded to Egmont Palace, where the Belgian Foreign Ministry is located, for a ceremonial welcome and a private dialogue between Mr. Modi and Belgian Prime Minister Charles Michel. Their interaction included a discussion on the need for a comprehensive convention on terrorism, visa issues, as well as areas of possible cooperation such as ports and infrastructure. Also discussed were agreements on mutual legal assistance and an extradition treaty. “These have been pending with Belgium for some time, and both sides have now agreed to initiate discussions on these and on a treaty for the transfer of sentenced persons,” Vikas Swarup, spokesperson for the MEA, said in response to a question from The Hindu .\n\nThere was a lunch meeting with CEOs and business leaders that was followed by the remote activation of the India Belgium AIRES (Aryabhatta Research Institute for Observational Sciences) telescope, the largest fully steerable optical telescope in Asia.\n\nUpon arriving at the Egmont Palace for the press statement following the telescope activation, private media were told that Prime Minister Charles Michel had cancelled the event. MEA sources at the media centre at the delegation’s hotel did not seem aware of this initially. When it became evident that Mr. Modi was speaking on television, the press were told the session had been “reinstated.” An embassy source told The Hindu that no private media were present.", 
    "section": "national", 
    "title": "Modi pays tribute to blast victims in Belgium capital", 
    "subsection": "general", 
    "date": "2016-03-31"
}