{
    "author": [
        "Alison Flood"
    ], 
    "text": "A fable by Ngugi wa Thiong’o titled The Upright Revolution: Or Why Humans Walk Upright is now available in over 30 languages\n\nA fable by the major Kenyan author Ngugi wa Thiong’o has been translated into over 30 languages, making it “the single most translated short story in the history of African writing”, according to its publisher.\n\nPan-African writers’ collective Jalada Africa released its latest issue, focusing on translation, last week. It includes Ngugi’s story Ituka Ra Mrngar: Kana Kra Gtmaga And Mathi Marngi , which the award-winning author originally wrote in Kikuyu, a Kenyan language, and then translated himself into English as The Upright Revolution: Or Why Humans Walk Upright .\n\nThe fable tells the story of how “a long time ago humans used to walk on legs and arms, just like all the other four limbed creatures”, but how “their rhythm and seamless coordination made the other parts [of the body] green with envy”, and “they started plotting against the two pairs”.\n\nJalada says it worked with translators of “all levels of experience, from a recent high school graduate to distinguished professors”, to pull together its huge range of translations of Ngugi’s story , which is available in Amharic, Dholuo, Kamba, Lwisukha (Luhya), Kipsigis, Kinyarwanda, French, Arabic, Luganda, Kiswahili, Afrikaans, Hausa, Meru, Lingala, IsiZulu, Igbo, Ibibio, isiNdebele, XiTsonga, Nandi (Kalenjin), Rukiga, Bamanankan, Lugbara, Lubukusu, Kimaragoli, Giriama, Sheng, Ewe, and Naija Langwej. It is now looking for writers and volunteers to volunteer more translations.\n\nEmpowering readers\n\nNgugi said the project would “empower Africa by making Africans own their resources from languages — making dreams with our languages — to other natural resources — making things with them, consuming some, exchanging some.”\n\n“The moment we lost our languages was also the moment we lost our bodies, our gold, diamonds, copper, coffee, tea. The moment we accepted (or being made to accept) that we could not do things with our languages was the moment we accepted that we could not make things with our vast resources,” said the novelist and playwright.\n\nJalada is now planning to periodically publish a Translation Issue featuring a previously unpublished story, which it will ask writers and translators to translate into their own African language. Its ultimate goal is to translate each story into 2,000 African languages. “Despite long-running conversations on the need for publishing in indigenous languages on the African continent over the past five decades, writing and translations remain minimal and the little that exists continues to rapidly decline,” said the writers’ collective.\n\n“There are millions of speakers in African languages and not many writers in African languages. Why? Can this be changed?”\n\nManaging editor Moses Kilolo, in an introduction to the issue, said Ngugi was “uniquely placed to be the first distinguished author and intellectual featured in our periodical Translations Issue” as he “has, for many years, been the most vocal proponent in publishing in African languages”.\n\nKilolo said the story itself was “a reminder that we are one, and that in our togetherness we have the power to transform the future that we hope for ourselves”.\n\n“For many of these translations, Jalada was very fortunate to find willing editors with considerable orthographical knowledge of their language’s textual application,” Kilolo writes. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Most translated story in African writing", 
    "subsection": "general", 
    "date": "2016-03-31"
}