{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Murder of two CPI(M) workers in Malampuzha constituency in 2007\n\nFive workers of the Rashtriya Swayamsevak Sangh (RSS) were sentenced to life imprisonment by an additional district court here on Wednesday for hacking to death two CPI(M) workers over political differences in 2007.\n\nPronouncing the verdict in a packed court hall, Judge Suresh Kumar Paul imposed a fine of Rs.2 lakh on each of the convicts. The court acquitted two RSS activists giving them the benefit of doubt. The prosecution said it would go on appeal against the decision to acquit the fourth and sixth accused.\n\nDelivering the judgment in the politically sensitive case, the judge expressed the hope that the verdict would help end the growing trend of political murders in the State. He also hoped that political parties would settle their differences through democratic negotiations.\n\nThose sentenced to life imprisonment are Kadukkamkunnu Parayil Manikandan (33), Panchikara Rajesh, alias Kuttayi (33), Nambanpura Murugadas (35), Parayil Suresh (35) and Puzhakkal Gireesh (34). The prosecution said the accused are active workers of both the RSS and the BJP.\n\nThe court acquitted Thekkinipura Vatsakumar and Cheenampura Suresh, fourth and sixth accused in the case.\n\nThe incident occurred at Kadukkankunnath under the Malampuzha constituency on October 29, 2007. The area was witnessing frequent clashes involving the BJP-RSS and the CPI(M). The Malampuzha constituency was then represented by veteran CPI(M) leader V.S. Achuthanandan, who was also the then Chief Minister.\n\nSome clashes related to the Assembly election campaigning provoked the BJP-RSS workers to plot and execute murder of local CPI(M) activists K. Gopalakrishnan (45) and C. Raveendran (35). Raveendran was a close relative of Gopalakrishnan. Both were headload workers at a cattle feeds factory of the Malabar Regional Cooperative Milk Producers’ Union.", 
    "section": "national", 
    "title": "Murder case: 5 RSS workers get life imprisonment", 
    "subsection": "general", 
    "date": "2016-03-31"
}