{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Visiting team seeks call records of former Gurdaspur SP Salwinder Singh, his cook and friend\n\nPakistan’s Joint Investigation Team (JIT) probing the terror attack on the Pathankot airbase has told the National Investigation Agency (NIA) that so far it has not found any evidence against Jaish-e-Mohammad (JeM) chief Masood Azhar linking him to the January 2 attack.\n\nThe team said it was still verifying whether the JeM founder — who was released from an Indian jail in 1999 in exchange for passengers of the hijacked IC 814 aircraft — had any role in the storming of the forward base of the Indian Air Force, a senior security establishment official told The Hindu . At multiple forums, India has in the past said Masood Azhar and his brother Abdul Asghar Rauf were directly linked to the attack, which was planned at the JeM’s Bahawalpur headquarters.\n\n“We posed pin-pointed questions about Masood Azhar; they neither confirmed nor denied that he was in detention. The JIT told us that though it had made a few detentions in the case, so far no direct evidence has surfaced against Masood Azhar,” the official said. India has sought the voice samples of Azhar and his brother Abdul Rauf Asghar, who planned and coordinated the attack. Asghar was also involved in the 1999 hijack.\n\nUnion Home Minister Rajnath Singh, addressing an election rally in Assam, said Pakistan had acknowledged the Pathankot attack and filed an FIR. “Pakistan had been continuously saying that it has no involvement in militant and terror activities in India. But now it has acknowledged the Pathankot attack and filed an FIR. Their [probe] team has come here and our team is going to Pakistan,” he told rallies in Assam.\n\nOn Wednesday, the NIA handed over to the JIT a list running into 34 pages. The list pertains to the evidence required by India to build a foolproof case against the JeM.\n\nThe JIT is learnt to have informed the NIA of the progress made in an independent investigation being done by it.\n\nPakistan has asked for a series of documents and evidence from India.\n\n“The call detail records of the former Gurdaspur SP, Salwinder Singh, his cook Madan Gopal and friend Rajesh Verma have been sought by the JIT. The terrorists had made calls to their handlers in Pakistan through these phones only after they snatched them from their owners. They also sought the post-mortem reports and other details,” the official said.\n\nOn Thursday, Singh, Gopal and Verma, along with the doctors who conducted autopsies on the four terrorists (whose bodies were found at the airbase), will interact with the JIT as “witnesses” to assist in their investigations.\n\n“We have asked for the voice samples of Masood Azhar and his brother Abdul Rauf, as also those of Khayyam Baber [mother of terrorist Nasir killed during the Pathankot attack],” NIA chief Sharad Kumar said after the meeting. Nasir was said to have spoken to his mother during the attack.\n\nThe NIA sought access to Azhar and Rauf and told the visiting team that till the time India’s request was pending with authorities in Islamabad, it would like the Joint Investigation Team to question them about their role in the attack and hand over their statement to the Indian agency.", 
    "section": "national", 
    "title": "No proof against JeM chief, says Pak.", 
    "subsection": "general", 
    "date": "2016-03-31"
}