{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "Govt. exempts academic institutions from taking DCGI permission; move a setback, say health experts\n\nWith the aim to speed up innovation and research in India, the Health Ministry has amended the Drug and Cosmetics Act, exempting clinical trials conducted at academic institutions from taking the hitherto mandatory permission from the Drug Controller General of India (DCGI).\n\nPublic health experts say the move is a setback for those working towards a safer, more transparent clinical trials regime. The once booming clinical trials in India came under the Supreme Court scrutiny in 2013, after at least 370 deaths were attributed to Serious Adverse Events (SEAs) during such trials. In September 2013, the apex court ruled that no new clinical trials be permitted until the regulatory mechanism was reformed.\n\nMeanwhile, the latest amendment to the D&C Act follows recommendations by the Professor Ranjit Roy Choudhury Committee, which had suggested that academic research should be approved by the Institutional Ethics Committees. “We want to create a system in which research and innovation are not caught in red tape. This is part of the government’s ease of regulation reforms. Many students test existing drugs and their study is delayed because of permissions required from the DCGI. Now, their institutions’ ethics committees are authorised to allow them, which should nurture an environment of research in the country,” said G.N. Singh, DCGI, Central Drugs Standard Control Organisation.\n\nChances of misuse are obviously higher if you give anyone a free hand, said C.M. Gulhati, Editor of Monthly Index of Medical Specialities . “The only defence for this decision can be that this is academic, not commercial, research. These are academic exercises. They cannot experiment with new molecules. The element of risk is lower but ethics committees need to be independent. It will depend on the institutions how they use it, which leaves a huge loophole.”\n\nViolation of rights\n\nIn 2013, the Supreme Court banned trials after a public interest litigation petition brought to light that trials conducted in various parts of the country had violated patient rights as informed consent was not taken, and the patients subjected to clinical trials included newborns, children, pregnant women and mentally challenged persons.", 
    "section": "national", 
    "title": "Norms for clinical trials eased", 
    "subsection": "general", 
    "date": "2016-03-31"
}