{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "About 30 legislators have raised their voice seeking to replace the Karnataka in-charge AICC general secretary\n\nThe legislators said thatMr. Digvijay Singh (in photo) was too busy a leader and he has not been able to concentrate enough on the party affairs in Karnataka.\n\nA section of like-minded Congress legislators held a dinner meeting at a private club here on Wednesday to put pressure on Chief Minster Siddaramaiah and the party high command to carry out a Cabinet reshuffle and to replace Karnataka in-charge AICC general secretary Digvijay Singh.\n\nThe legislators have placed eight demands before Mr. Siddaramaiah and the party leaders in Delhi. The major demands were dropping 25 Ministers who have served for the last three years; appointment of a more dynamic and active AICC general secretary for Karnataka; appointment of party workers for boards and corporations and directors posts; and induction of young and energetic MLAs into the Cabinet.\n\nAbout 30 legislators have raised their voice seeking to replace Mr. Digvijay Singh, who has been looking after the party’s affairs in the State for the past two years.\n\nThey claimed that Mr. Digvijay Singh was too busy a leader and he had not been able to concentrate enough on the party affairs in Karnataka.\n\nAccording to sources, Mr. Digvijay Singh had also not taken any initiative to direct the Chief Minister or KPCC president G. Parameshwara to fill vacancies in State-owned boards or corporations.\n\nSpeaking to presspersons, S.T. Somashekar, Congress MLA, said that the legislators met to discuss the affairs in the party and the government. The Congress government will complete three years on May 13.\n\nThe legislators also demanded that “inefficient” Ministers be dropped from the Cabinet. They demanded proper representation in the Cabinet on the basis of region and caste. They sought fresh faces in the Cabinet to help the Chief Minister to rebuild the party’s sagging image before the Assembly elections in 2018.", 
    "section": "national", 
    "title": "Replace Digvijay Singh, say Congress legislators", 
    "subsection": "general", 
    "date": "2016-03-31"
}