{
    "author": [], 
    "text": "British man’s photo, clicked aboard EgyptAir plane, goes viral\n\nA British man has shot to fame after clicking “the selfie of a life time” with the hijacker of the EgyptAir jet during the hostage drama in Cyprus, an act he said was aimed at staying “cheerful”.\n\nBenjamin Innes was one of the last captives to be released by Seif al-Din Mustafa during Tuesday’s six-hour hijacking episode and took a picture with the man who claimed to be wearing a suicide vest.\n\nA photograph shows Mr. Innes grinning broadly as he stands next to Mustafa in the cabin of the hijacked Airbus 320 as it sat on the runway of Cyprus’s Larnaca airport. “I’m not sure why I did it, I just threw caution to the wind while trying to stay cheerful in the face of adversity. I figured if his bomb was real I’d nothing lose anyway, so took a chance to get a closer look at it,” Mr. Innes said.\n\nHe was among the 62 people on board an EgyptAir flight from Alexandria to Cairo on Tuesday when Mustafa seized control and threatened to detonate a bomb belt, which was later discovered to be a fake. Mustafa forced the Airbus A320 to land in Larnaca.\n\nMr. Innes said panicking passengers calmed down once the plane landed and Mustafa allowed women and children to leave. Later, Mustafa disembarked and surrendered to the police.\n\nAt a court hearing on Wednesday in Larnaca, a judge ordered Mostafa to be detained for eight days. Mustafa, aged 58, had earlier told police that he diverted the flight to see his Cypriot ex-wife and children.\n\n‘Wanted to see wife’\n\n“What’s someone supposed to do when he hasn’t seen his wife and children in 24 years and the Egyptian government won’t let you?” Mostafa told authorities.\n\nPolice told the court that Mustafa — described by officials as “psychologically unstable” — faces possible charges of hijacking, kidnapping, reckless and threatening behaviour, and breaches of the anti-terror law.\n\nEgypt has asked Cyprus to extradite Mustafa. Egypt’s interior ministry said Mustafa had a long criminal record but had finished serving a one-year prison term in March 2015. — Agencies", 
    "section": "national", 
    "title": "Say cheese, with the hijacker", 
    "subsection": "general", 
    "date": "2016-03-31"
}