{
    "author": [], 
    "text": "People walk by the cultural center Rex in Belgrade, that was owned by Jews before the WWII and confiscated by Nazis during the occupation of Belgrade from 1941-1945.— Photo: AFP\n\nIn 1945, Aleksandar Lebl returned to Serbia after escaping the extermination of Jews in World War II and reclaimed his family’s confiscated house.\n\nBut the 93-year-old is one of the very few of Serbia’s Holocaust survivors who came back to recover their homes.\n\nMany thousands of others were murdered or left no heir and their property, seized by the Nazis or the puppet government in Belgrade, was incorporated into the Communist state after the war.\n\nToday, more than seven decades later, Serbia has passed a law offering some belated redress to its now tiny Jewish community.\n\nOne of the first of its kind in eastern Europe, the “heirless property restitution law” passed in February will see thousands of previously Jewish-owned buildings handed to the country's Association of Jewish Communities.\n\nThe association plans to rent out most of the properties, and from 2017 Serbia will also pay an annual €9,50,000 (Rs. 7,13,24,694) for 25 years in financial support to the community. The funds will be spent on education, fighting prejudice and preserving the memory of Holocaust victims, along with supporting survivors, said its president, Ruben Fuks.\n\nLebl is one of the last of Serbia’s Jews who remembers the war. By the spring of 1942, more than 80 per cent of the 33,000 Jews living in Serbia before the war had been killed, and the Nazis declared the country “free of Jews.”\n\nEven today, there are fewer than a thousand Jews in Serbia. “After the war the authorities decided to return the property, but as so many people were killed, there was no one left to take back most of it,” said Lebl. “The Jewish community has never recovered, because the loss [of human life] was so high.”\n\n‘Moral obligation’\n\nPresenting the new law in Parliament, Justice Minister Nikola Selakovic said Serbia had a \"moral obligation\" towards Jews who “dedicated their lives and work to our Serbia.”\n\nHe said the move would also “contribute to a greater understanding of human rights, which is crucial for fighting and preventing racial and religious discrimination.” — AFP", 
    "section": "national", 
    "title": "Serbia returns seized property of Holocaust victims to Jews", 
    "subsection": "general", 
    "date": "2016-03-31"
}