{
    "author": [
        "Amit Baruah"
    ], 
    "text": "Hurling allegations and using rhetoric comes naturally to officialdom in India and Pakistan. It’s an art that the two countries have perfected down the decades.\n\nBut when a former Indian Navy official is “arrested” in Pakistan and the Army goes to town making allegations about the Indian “role” in subversive activities in Pakistan the spying game gets raised to a new level.\n\n“The arrest [of Kulbhushan Yadav] is good for domestic politics in Pakistan. The government and the Army have been saying that R&AW [Research & Analysis Wing] is behind what is happening in Balochistan and Karachi. Now it seems their contentions are confirmed,” Kamal Siddiqi, editor of the Pakistani newspaper Express Tribune , told The Hindu .\n\nRana Bannerji, a retired R&AW officer with long experience of dealing with Pakistan, feels that this is an “outlandish attempt” by Pakistan to pin the blame on India’s external intelligence agency. “It’s possible that some other [intelligence] agency may have lured him [Mr. Yadav],” Mr. Bannerji told this correspondent.\n\nGiven that Indian and Pakistani versions of the truth are vastly different, it’s quite likely that the full story of what the former Naval officer was doing and whether he was actually arrested in Pakistan may never be known.\n\nIt’s interesting that the Ministry of External Affairs has confirmed that Mr. Yadav is an Indian national without securing consular access to him. Given that a forged documentation may have been used, this does raise questions.\n\nEven in the case of the arrest of a fisherman, the Indian High Commission in Islamabad normally sends a query to the person’s village and only after receiving the police report would the issue of nationality be settled.\n\nThe former R&AW chief C.D. Sahay is of the opinion that Mr. Yadav’s arrest will not impact bilateral relations between India and Pakistan. “Even the Pathankot incident has not derailed bilateral relations,” Mr. Sahay said.\n\n“I must say that the timing of the alleged revelations is interesting given that the Pakistani Joint Investigation Team probing the Pathankot attack is in India,” the former intelligence chief maintained. Mr. Siddiqi, too, felt that the arrest of Mr. Yadav will not impact the bilateral relationship that revived after Prime Minister Narendra Modi’s sudden decision to stop over in Lahore on December 25.", 
    "section": "national", 
    "title": "Spy case won’t derail ties", 
    "subsection": "general", 
    "date": "2016-03-31"
}