{
    "author": [], 
    "text": "Scientists have created a virtual Earth-space telescope system with the highest resolution of any astronomical observation ever made, that helped unveil an unusually hot quasar jet in the Milky Way.\n\nResearchers combined the Russian RadioAstron satellite with the ground-based telescopes to produce a virtual radio telescope more than 160,934 kilometres across.\n\n“The amazing resolution we get from RadioAstron working with the ground-based telescopes gives us a powerful new tool to explore not only the extreme physics near the distant supermassive black holes, but also the diffuse material in our home galaxy,” said Michael Johnson, from Harvard-Smithsonian Center for Astrophysics in the U.S.\n\nThey pointed this system at a quasar called 3C 273, more than 2 billion light-years from Earth. Quasars are supermassive black holes at the cores of galaxies.\n\nQuasars like 3C 273 propel huge jets of material outward at speeds nearly that of light. These powerful jets emit radio waves.\n\nJust how bright such emission could be, however, was thought to be limited by physical processes. That limit, scientists say, was about 100 billion degrees.\n\nThe researchers were surprised when their Earth-space system showed a temperature hotter then 10 trillion degrees.\n\n“Only this system could reveal this temperature, and now we have to figure out how that environment can reach such temperatures,” said Yuri Kovalev, the RadioAstron project scientist.\n\n“This result is a significant challenge to our current understanding of quasar jets,” he added.\n\nThe observations also showed, for the first time, substructure caused by scattering of the radio waves by the tenuous interstellar material in our own Milky Way Galaxy.\n\n“This is like looking through the hot, turbulent air above a candle flame,” said Mr. Johnson.\n\n“We had never been able to see such distortion of an extragalactic object before,” he said. The RadioAstron satellite was combined with the Green Bank Telescope in West Virginia, The Very Large Array in New Mexico, the Effelsberg Telescope in Germany, and the Arecibo Observatory in Puerto Rico.\n\nThe research was published in the Astrophysical Journal Letters . — PTI\n\nScientists combined telescopes on Earth and in space to study the quasar called 3C 273", 
    "section": "national", 
    "title": "Telescope system finds super-hot core of quasar", 
    "subsection": "general", 
    "date": "2016-03-31"
}