{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Honour:Shobana Ramachandran, president of Sri Sathguru Sangeetha Samajam, honouring S. Sai Lakshmi at the 64th anniversary celebrations of the Samajam in Madurai on Monday.— Photo: G. Moorthy.\n\nThe annual 10-day music and arts festival at Sri Sathguru Sangeetha Samajam here commenced on Monday.\n\nSpeaking on the occasion, Canara Bank General Manager K. Velusamy said that the Samajam had been conducting music and arts festival continuously for the last 63 years. He appealed to the people of Madurai and southern districts to utilise the Samajam’s services rendered in disseminating music.\n\nFrom time immemorial, he said, “music has been a part of our rich tradition. Good music, be it vocal or instrumental, is remembered for decades”. The soothing effect the music gave could not be gauged. Institutions like the Samajam were platforms for music lovers, and youngsters should come forward to learn the nuances of the art, Mr. Velusamy said.\n\nIn her welcome address, Samajam president Shobana Ramachandran said that every year deserving artists were honoured by the Samajam. The prestigious award of ‘Madhurakala Praveena’ was being presented to renowned musicians since 1967. A total of 49 vidwans, including Semmangudi Sri Srinivasa Iyer, D.K. Pattammal, M.S. Subbulakshmi, Embar Sri Narayana Iyengar, Maharajapuram V. Santhanam, N. Ramani, M.L. Vasantha Kumari, T.R. Mahalingam and D.K. Jayaraman, were honoured.\n\nSimilarly, conferment of ‘Birudhu – Madhuralakala Mani’ to an eminent artist of Madurai had been in practice since 2006. Conferment of ‘Madurai Sri Meenakshi Award’ was introduced last year in memory of M.S. Subbulakshmi, she added.\n\nPopular Carnatic vocalist Sanjay Subramanyan would be presented with Madhurakala Praveena award on January 10.\n\nLater, the winners of the annual music competition received prizes, and among them S. Sailakshmi bagged four prizes in different categories – Tamil songs (first prize), Purandaradasar kritis and Maharaja Sri Swathi Thirunal (second prize), and Smt. Ambujam Krishna (third prize).\n\nSamajam office-bearers Dr. L. Rajaram, S. Venkatanarayanan, B. Ganapathi Sarma and G. Sivaraman were present.", 
    "section": "national", 
    "title": "10-day music festival begins at Sangeetha Samajam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}