{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Joint liability groups enjoy have good track record of pompt repayment\n\nAfter promoting the women’s self-help groups, banks are now focussing on promoting joint liability group mostly comprising men farmers and livestock owners.\n\nThe fact that Rs. 8 crore sanctioned by the Thuraiyur branch of Indian Bank about three years ago, had been repaid without any overdue testifies to the success of the joint liability group.\n\nThe principle of joint liability group has gone down well with not only the borrowers but also the bank officials.\n\n“It has cleared a myth that men often turn defaulters. Given some assured economic activity, men groups in the form of JLGs can prove their mettle,” said S. Suresh Kumar, Assistant General Manager, National Bank for Agriculture and Rural Development (NABARD).\n\n“An initiative on a small measure by NABARD taken in 2012 to promote 25 JLG for dairy activity in Thuraiyur area in the district has been registering its success,” he said. In this context, he underlined the role of non-governmental organisations in motivating farmers to constitute the JLGs.\n\n“We conducted periodical sessions and imparted training to members before floating the JLG,” says K.K. Marimuthu, Managing Trustee of Shalom Foundation, which has been coordinating with the JLGs in ensuring prompt utilisation of loans and its cent per cent recovery.\n\nAbout 400 JLGs had been floated in the Thuraiyur belt with a credit flow totalling Rs. 8 crore. “Not even a single case of overdue has been reported among the JLGs,” says the bank official.\n\nThe smaller strength of JLGs ranging between 4 and 10 members per group has been a facilitating factor for the bank officials in persuading farmers to take to micro activity allied with agriculture.\n\nHe said the Thuraiyur model had proved that men groups too are prompt in repayment of loan.\n\nBanks in Thuraiyur have been vying with one another in sanctioning credit to the JLGs.\n\nApart from Indian Bank, a few other banks, including the Karur Vysya Bank and Indian Overseas Bank, have been sanctioning the credit for setting up dairy units.\n\nFelix Edward, Branch Manager, Indian Bank, Thuraiyur, says the JLG has been facilitating the banks for promoting bank’s products and implementing the Prime Minister’s social security scheme.\n\nThe JLG member is considered so trust-worthy that his recommendation for fresh borrowers was given due weightage, he added.\n\nMicro credit\n\n400 JLGs have been floated in Thuraiyur block with Rs. 8 cr. credit flow\n\nNABARD started it by floating 25 JLGs in 2012", 
    "section": "national", 
    "title": "Banks now encourage joint liability groups", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}