{
    "author": [
        "Staff Reporter"
    ], 
    "text": "After years of being in cold storage, the project is expected to be completed by January 15\n\nAfter years of being in the cold storage and having had false starts and failed attempts, Bangalore Metropolitan Transport Corporation’s (BMTC) ambitious Intelligent Transport Solution (ITS) is in sights of the finish line.\n\nFor the passenger, the Rs. 79-crore project offers a real-time interaction with public transport.\n\nFor instance, currently, a wait at the bus-stop is mired with uncertainty over when the next bus will come or even if it comes, will there be a jostle for space.\n\nThe ITS, however, envisions electronic boards that display estimated time of the arrival of the next bus; while, mobile apps will be calibrated to even show whether the oncoming bus is crowded or not.\n\nIn the first phase of the project — which is expected to be completed by January 15, and then will be tested for a month or so before being available for the passenger — conductors have been trained to use GPRS-enabled electronic ticketing system, said Bishwajit Mishra, Director for Information Technology at the BMTC.\n\n“The infrastructure will be ready by mid-January, after which we will start to test the systems before we go live,” he said, and added that a majority of the buses had already been fitted with GPS units.\n\nThe challenges are plenty for the project that has taken more than a decade to transition from proposal to implementation.\n\nIn 2013, the first pilot should have taken place in Yelahanka, and this was put on the backburner, with several issues popping up.\n\n“Training the conductors to use the devices took time as it is a new system. Moreover, other issues were met. Finding out real-time traffic conditions for the system was difficult and we had to buy licences from Google,” said Mr. Mishra.\n\nCumulatively, the information will first be fed into the basic mobile app of the BMTC which is scheduled for a revamp to make it “more useful” in a couple of weeks. Currently, the app doesn’t have real-time data, and displays bus schedules, irrespective of traffic or availability.\n\nHowever, Mr. Mishra said the ITS would see the app suggest alternative bus routes from a source to destination based on timings of the bus as well as a colour-coded scheme to suggest “congestion” in oncoming buses.\n\nAfter years of being in cold storage, the project is expected to be completed by January 15", 
    "section": "national", 
    "title": "BMTC’s ITS close to the finishing line", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}