{
    "author": [
        "S Prasad"
    ], 
    "text": "A high definition set top box streaming digital content at the office of the Sky World Digital Head End in Puducherry; (right) A view of the full-fledged control room. —Photos: T.Singaravelou\n\nDeadline for digitisation of signals through Set Top Boxes ended on Dec. 31\n\nCable Television operators in the city have sought adequate time from the Puducherry Government for implementation of digitisation of signals through Set Top Boxes (STB) with the deadline for digitisation ending on December 31.\n\nHowever, the District Administration has directed Cable TV operators to abide by the notification of the Centre failing which action would be initiated against them under the Cable Television Networks (Regulation) Act, 1995\n\nThe digitisation of cable television network follows the recommendations of the Telecom Regulatory Authority of India (TRAI) on ‘Implementation of Digital Addressable Cable TV Systems in India,’ signalling the transition from the analogue system.\n\nPractical difficulties\n\nA.M. Saleem, president of Puducherry Cable TV Operators Association said that operators were trying to speed up the process but attributed the delay due to practical difficulties in the wake of the recent incessant rains and subsequent flooding.\n\n“Around 20 per cent of connections in the city have switched over from analog to digital transmission and three months more time is required for all connections to switch over to the digital system. There are only two to three players supplying STBs in the country and there is a huge demand,” Mr. Saleem added.\n\nPuducherry falls under the third phase of digitisation and around 5 crore STBs are in demand in the country for the third phase alone. We have already placed orders and the STBs are likely to be shipped in a week’s time.\n\nThe switch from analogue to digital will include the introduction of the Conditional Access System (CAS) by which customers can choose the television channels they want. We have requested the administration to extend the deadline by three more months, said Mr. Saleem.\n\nHowever, cable operators are unlikely to cut off signals. Multi System Operators have been asking the local Cable Television operators to urge consumers to install STBs. Several states have already approached the court seeking extension of the deadline, a cable operator said.", 
    "section": "national", 
    "title": "Cable operators seek more time", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}