{
    "author": [
        "Special Correspondent"
    ], 
    "text": "As negotiations between India and Russia are in the advanced stages for installing the third and fourth units of the Kudankulam Nuclear Power Plant in Tamil Nadu, anti-nuclear activists have intensified their campaign against the expansion of nuclear assets in Kalpakkam and Kudankulam.\n\nDistributing pamphlets to the public advocating against nuclear power at the Egmore Railway Station on Monday, S.P. Udayakumar, Convenor of People’s Movement Against Nuclear Energy (PMANE) said, “As the first unit in Kudankulam is not operational for over six months and the second unit is further delayed, we have serious doubts about the project.”\n\nClaiming that the project was “inherently flawed” and the components supplied to the project were sub-standard, he said the Site Evaluation Report, Safety Analysis Report and the Environment Impact Assessment Report, which were to be made available to them as per the Central Information Commission’s order were not provided yet, as the Nuclear Power Corporation of India Limited had obtained a stay on the order in the Delhi High Court in 2014.\n\nThe activists wanted the first two units in Kudankulam to be shut down and cancellation of the other units in the pipeline. “The 101 cases pending against us for protesting against nuclear power should be withdrawn and the political parties should make their stand clear on nuclear projects before the polls,” he said.\n\nIn a joint press statement with Russian President Vladimir Putin, Prime Minister Narendra Modi stated that the pace of cooperation in nuclear energy was “increasing” and they were “making progress” in their plans for 12 Russian nuclear reactors at two sites.\n\nThe Department of Atomic Energy has planned for more nuclear assets in Kalpakkam too.\n\n“KKNPP inherently flawed and components\n\nare of\n\nsub-standard”", 
    "section": "national", 
    "title": "Campaign against expanding nuclear projects in TN", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}