{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Former DMK Minister Pongalur N. Palanisamy, election coordinator for Coimbatore districtMu. Kannappan and former MP Mu. Ramanathan (all three seated) leading the protest in Coimbatore on Monday.— Photo: M. Periasamy\n\nDravida Munnetra Kazhagam cadre led by former State Minister Pongalur N. Palanisamy, election coordinator Mu. Kannappan and other senior leaders staged a protest on Monday condemning the Coimbatore Corporation for poor civic amenities in the city.\n\nThe DMK leaders said that the Corporation was yet to fully implement the schemes it had started under the Jawaharlal Nehru National Urban Renewal Mission programme, had failed to rectify faulty street lights and curb corruption that was prevalent in every department and affected the public who sought name change in property tax, water connection and other services.\n\nThey said that around 10,000 lights were faulty in the city and the Corporation had failed to attend to those in time.\n\nCouncillors who spoke at the protest venue faulted the Corporation for delay in re-laying roads dug for implementing the underground drainage scheme, developing the tanks that it took on lease from the Public Works Department, not developing the Semmozhi Poonga (park) announced during the previous DMK government, and diverting a good portion of funds to those wards that fell under Municipal Administration Minister S.P. Velumani’s constituency.\n\nThe protestors also said that poor supervision of development projects led to deterioration in quality of works carried out by the Corporation and blamed the officials for poor water supply in added areas.\n\nSources said that around 800 party men from the Coimbatore north urban and south urban units of the party participated in the protests, which also saw district secretaries Veeragopal and Nachimuthu, former Deputy Mayor N. Karthik and councillors A. Nandhakumar, Meena Loganathan, Lakshmi Ilanselvi, S.M. Samy and others participate.", 
    "section": "national", 
    "title": "Corpn. not providing amenities: DMK", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}