{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A councillor raising an issue at the regular District Panchayat Council meeting in Salem on Monday.—PHOTO: E. LAKSHMI NARAYANAN\n\nCouncillors at the District Panchayat Committee meeting urged passing of a resolution demanding setting up of a computerised passenger reservation centre at Omalur Railway Station.\n\nAt the meeting held here on Monday, councillor K.K. Madeswaran said that there are six railway tracks with three platforms in the station and passengers board and align from trains in the station.\n\nHowever, due to absence of reservation centre, passengers have to either go to Mettur or Salem to reserve their tickets. “This poses hardship for passengers as they have to spent time and money.”\n\nHe urged the committee to pass a resolution demanding reservation centre at Omalur Railway Station.\n\nMr. Madeswaran also said that water was drawn from overhead tanks in Chikkampatty panchayat in Omalur taluk by realtors without obtaining permission from the panchayat.\n\nHe warned that water shortage will happen if the situation continues and demanded action against the realtors.\n\nCommittee Chairman Sathish Kumar said that a resolution would be passed and sent to the Railway authorities for necessary action.\n\nEarlier, when the meeting began AIADMK councillor of Mecheri block Ayyandurai said that he has 3.55 acres of land at Thippampatti in Konur panchayat. But, the land was encroached.\n\nThe councillors opposed his reference and demanded discussion on people’s problems.\n\nThe House witnessed noisy scenes and he attempted to stage a walkout.\n\nHowever, other councillors pacified him and the meeting continued.\n\nMembers also contributed Rs. 37,500 towards flood relief and rehabilitation.\n\nSecretary Rajendra Prasad, vice-chairman Vasantha and other were present at the council meeting.", 
    "section": "national", 
    "title": "Councillors demand reservation centre at Omalur Railway Station", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}