{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector says it’s a government land which doesn’t have approach pathway\n\nCaught in the row:The sheds erected by 40 Dalit families in the land adjacent to Yadava College in Madurai. The college administration claims to have been using the land for over 40 years.— Photo: R. Ashok\n\nThe land reportedly allotted to 40 Dalit families on the west side of Yadava College in Madurai has stirred up an issue with both the beneficiaries and the college administration submitting petitions to Collector L. Subramanian on Monday.\n\nThe families said that they had erected sheds in the land after it was measured and allotted to them by the local revenue officials. However, the college administration claimed that they had been using the land for more than four decades and termed the sheds encroachments.\n\nWhile conceding that they did now own the land, the college administration said that a bore well pump supplying water for the college was functioning in the land, which was also until recently used as a playground by students of the hostel located nearby.\n\nOn the other hand, the Dalit families said that they were allotted the land after prolonged struggle for 13 years. “We were evicted from Uchaparambumedu many years ago for carrying out maintenance work in a closely located canal,” said V. Nallathambi from one of the affected families.\n\n“Now, every family was given close to 1.5 cents of land and we had erected sheds by spending Rs. 2,000 to Rs. 3,000. It is unfair to ask us to leave now,” he added.\n\nN. Jothi from one of the families said that they would vacate the land only if the district administration assured them that they would be provided land elsewhere.\n\nRefuting the claims made by the 40 families, the Collector said that the administration had not allocated the land to them. “It is a government property which does not have an approach pathway.” He said that he had ordered eviction of the sheds and also warned the college administration that the land should not be used by them either. “Depending on the merits of the petition submitted by the 40 families, we will allocate land to them elsewhere,” he added.", 
    "section": "national", 
    "title": "Dalit families and college lock horns over claim of land", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}