{
    "author": [
        "Staff Reporter"
    ], 
    "text": "For the last 23 years, 42-year-old K. Munisamy, a daily wage labourer, has spent most of his time and resources waging a battle for a job that his family was assured in exchange for a land in 1982. With his efforts going futile, he along with his wife and two children – a son and daughter - appealed to the Collector for mercy killing on Monday.\n\nA resident of Puliyanthangal in Walajah taluk, Munisamy, in his petition, said that Bharat Heavy Electricals Limited (BHEL), Ranipet had acquired one acre of land from his mother Amaravathi in 1982. Families who gave their lands to BHEL were assured of employment for one member each. “My mother was seeking a job for her from 1982 but she did not get one. When I turned 19 years in 1993, she sought employment for me. My mother fought for a number of years and passed away in 1998,” he said.\n\nThe families waiting for jobs approached the Madras High Court in 1994. “The court directed BHEL to grant jobs but the order was kept pending. BHEL then called for interview and assured to grant employment,” he said.\n\nHowever, many of them, including Munisamy, were denied jobs. “A GO was issued saying that we should be given jobs without following any eligibility conditions. But nothing was taken into consideration,” he added.\n\nOnce again, they approached the Madras High Court, which in 2012 ruled that these persons should be given employment. The administration too recommended that jobs be given to 124 persons, of which 109 were employed by BHEL.\n\n“Jobs were denied to 15 of us citing educational qualifications below class VIII. . So, I wrote the class VIII exam and cleared it,” he said.\n\nThe mark sheet was sent to BHEL but Munisamy is yet to receive a reply. Following this, he petitioned the administration to approach BHEL.\n\n“We do not have the strength or resource to file cases any more. So, I along with my wife and children appealed to the district administration for mercy killing,” he added.", 
    "section": "national", 
    "title": "Denied job for land, man appeals for mercy killing", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}