{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Govt. prefers writ appeal against temple dress code\n\nThe State government on Monday preferred a writ appeal in the Madras High Court Bench here challenging a specific dress code framed and imposed by a single judge of the court for devotees and other visitors to various temples across the State.\n\nDespite being numbered as the first writ appeal of the year, High Court sources said that it would not be listed for hearing on Tuesday since a request has been made to defer the listing to facilitate the appearance of Advocate General A.L. Somayaji on the day of admission itself.\n\nAccording to the dress code prescribed by Justice S. Vaidyanathan and ordered to be implemented from January 1, men should wear “dhoti or pyjama with upper cloth or formal pants and shirts” and women “sari or half sari or churidhar with upper cloth.” Children could come in “any fully-covered dress.”\n\nThe order was passed while disposing of a writ petition filed by Rasu seeking permission for Bharatanatyam and Gramiya Aadal Paadal (cultural programmes) in view of Shenbaga Vinayagar Temple festival at Akkiyampatti village in Marungapuri Taluk in Tiruchi district on November 21 and 22. The judge had initially passed an interim order on November 20 granting permission for the events on condition that the devotees and other attendees should adhere to a dress code prescribed by him to “enhance the spiritual ambience among the devotees” and report compliance by November 26.\n\nSubsequently, while disposing of the main writ petition, he suo motu impleaded the Secretary, Tourism, Culture and Religious Endowments Department, as a respondent to the case and directed him to implement the dress code in all temples until the State Government takes a policy decision on the issue.\n\nAssailing the correctness of the single judge’s order in the appeal, the Hindu Religious and Charitable Endowments Secretary said that it was unsustainable in law and deserved to be set aside since the judge had gone beyond the scope of the writ petition.\n\n“The honourable judge ought to have seen that maintenance of order and decorum in a particular temple is within the powers of the temple administration and dress code differs from temple to temple based on the custom and no direction to follow uniform dress code in all temples can be issued.\n\n“There are famous temples like the Meenakshi Sundareswarar Temple visited by foreigners and North Indians. They cannot be compelled to wear a particular form of dress. The prescription of fully covered dress for children also is not feasible of compliance,” the State claimed in its appeal.\n\n‘No compulsion’\n\nNevertheless, concurring that those going to temples must wear a decent dress, the State said that “it could only be on their volition and not compulsion. Further, the Tamil Nadu Temple Entry Authorisation Act, 1947 is already governing the field… and no untoward incident has been reported as to give such directions.”", 
    "section": "national", 
    "title": "Devotees can’t be compelled to wear particular form of dress: State", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}