{
    "author": [
        "A D"
    ], 
    "text": "An outfit called Tiruvannamalai District Differently Abled Federation staged a sit-in agitation in the District Differently Abled Welfare Office in the Collectorate campus here on Monday.\n\nThe Federation demanded suspension of the District Differently-Abled Welfare Officer (DDAWO).\n\nThe agitation started by in the morning and continued till evening. The Federation’s secretary E. Venkatesan who leads the protest told The Hindu , that Nine motorised tricycles due to be distributed to differently-abled people in 2012-13 were kept locked for three years.\n\nIt was distributed only on Sunday at the Social Welfare Minister’s function. The Niramaya Scheme that provides health insurance up to Rs.1 lakh to the people with autism, cerebral palsy, mental retardation and multiple disabilities has not been properly implemented in Tiruvannamalai district.\n\nThree per cent of Pasumai Veedu housing scheme allocations should be given to differently abled people.\n\nBut out of 4,000 houses allotted in Tiruvannamalai district in the current fiscal year only 19 houses are actually given to differently abled.\n\nAssistances distributed\n\nSocial Welfare Minister Valarmathi distributed welfare assistances at a function held in a marriage hall here on Sunday.\n\nBut there was no arrangements like tricycle, ramp or special toilets for the differently-abled participants. The DDAWO is responsible for these failures hence we demand his suspension,” said Mr. Venkatesan.\n\nWhen asked about their protest, district collector A. Gnanasekaran told The Hindu that about 40 motorised tricycles were distributed on Sunday’s function.\n\nOf them, the pending tricycles were only a part. They were pending since their original allocations to beneficiaries were disputed.\n\n“The federation has given a petition to me about some other grievances only on Monday. We need time to go through them and take action based on their merits. But they began a sit in immediately on the same day.", 
    "section": "national", 
    "title": "Differently abled people seek suspension of officer", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}