{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has directed a private engineering college to pay by Thursday Rs.50,000 as costs to an engineering aspirant who was denied a seat in civil engineering despite being selected under Single Window Counselling conducted by Anna University in Chennai in August 2010 since the college reportedly demanded more money.\n\nDismissing a writ appeal preferred by P.S.N. Institute of Technology and Science at Melathediyoor in Tirunelveli district and pending in the court since 2011, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran refused to interfere with the cost imposed by a single judge and directed the college to report compliance by Thursday.\n\nThe Division Bench pointed out that in 2010, P. Ramkumar, then 17, was allotted B.E., civil engineering course in the appellant institution. However, when the student approached the college to pay the government prescribed tuition fee of Rs.7,500, it reportedly demanded Rs.94,150 apart from a monthly fee of Rs.1,700.\n\nSince he could not pay the money, he filed a writ petition challenging denial of admission. Defending the case, the college denied all the allegations levelled against it. But the judge disbelieved its version on the basis of a complaint lodged by the student with the Commissioner of Technical Education who in turn had warned the college against demanding more money.\n\nHowever, since the academic year had gone past by the time the writ petition could be taken up for final hearing in 2011, the judge directed the college to compensate him by paying a cost of Rs.50,000 and hence the appeal. Agreeing with the single judge’s decision, the Division Bench said that the college was liable to pay the money for having turned away the student illegally.", 
    "section": "national", 
    "title": "Engineering college told to pay Rs. 50,000 to student", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}