{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A fire broke out in ward 213, the surgical intensive care unit of Rajiv Gandhi Government General Hospital in the early hours on Monday, forcing staff to shift 16 patients to other wards.\n\nThe fire, believed to have been caused by an electrical short circuit, broke out in cubicle 2 of the ward. The patient in that cubicle, N. Pandurajan, died a little later, but hospital authorities said the death was due to complications from his ill health. Two other patients of the ward, 60-year-old Mannammal and 52-year-old Raja, died later in the day.\n\nThis is the second fire to break out in the ward in less than six months. Last August, a fire broke out, but in a different part of the ward, leading to evacuation of eight patients. No one was injured, and the fire was then thought to have broken out from a ventilator unit’s switchboard. Dr. Elango said Monday’s fire broke out sometime between 3.15 and 3.30 a.m. in the surgical intensive care unit that had both pre-operative and post-operative patients — 11 male and five females, including a 13-year-old girl. Three of them were on ventilators.\n\n“There was a short circuit in one of the wires leading to the cubicle. There were some sparks and smoke. The staff immediately turned off the mains and evacuated all 16 patients to various other wards,” he said.\n\nStating that Mr. Pandurajan’s death was not due to the fire, Dr. Elango said the 39-year-old patient was shifted to ward 201 by 3.30 a.m., and he died around 4 a.m. “He was not on a ventilator at the time of the fire, and he had just undergone a double barrel ileostomy — a procedure to treat his perforated intestine. He also had tuberculosis and uncontrolled diabetes, and died due to these complications,” he said.\n\nOn Mr. Manammal who had been on a ventilator, Dr. Elango said the 60-year-old had had atrial fibrillation, hypertension and diabetes and had been admitted for thrombosis of a major blood vessel in the digestive system. “He too died of complications of his illness and not due to the fire. He died at 9.35 a.m., several hours after the fire was put out,” he said.", 
    "section": "national", 
    "title": "Fire breaks out at GH in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}