{
    "author": [
        "Parshathy J Nath"
    ], 
    "text": "I Love Book , and Friendship , the short films directed by Coimbatore-based Madhan Kumar P. and Prasanna Kumar (both hearing and speech impaired) have respectively won the first and second prizes at the India International Deaf Film Festival, recently organised by the Deaf Leaders Foundation at PSG College of Arts and Science.\n\n“This film festival is held once a year, exclusively for the deaf,” says Madhan, through an interpreter.\n\nThe films featured actors who are hearing and speech-impaired, and celebrated human values.\n\nFor instance, I Love Book is about a student who sought alms to buy A.P.J. Abdul Kalam’s Wings of Fire . “Mahatma Gandhi’s words ‘Be the change you wish to see in world’ always inspired me. I wanted to inculcate reading habits in younger generation, and a passion towards knowledge,” signs Prasanna, and the interpreter communicates it.\n\nFriendship is about love and camaraderie on campus, with subtle commentary on class discrimination.\n\nThere were 1,000 participants from across the country. The films from Kerala were especially moving. It felt great to be one of the participants, representing Coimbatore, says Madhan.\n\n“We felt honoured to receive the awards competing with best of filmmakers. The competition was tough, but it helped us gain confidence to face a bigger challenge.”\n\nMadhan is an employee at AutoCAD and Prasanna is an artist. But, both are passionate about movies. Madhan is a self-taught video editor too.\n\nPrasanna says that this was their debut film and that he was astonished at the results.\n\nHe sees movies as a powerful tool that can bring about a change in the sensibilities of society.\n\n“The audience learns new ideas and easily gets influenced by visuals. Our aim is to create awareness, and to prove that the differently abled too can produce great movies.”", 
    "section": "national", 
    "title": "Getting heard through movies", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}