{
    "author": [
        "S Senthalir"
    ], 
    "text": "Students at an interactive session in Vellai Thamarai School library; (right) a view of the school building run by Vellai Thamarai Educational Social and Cultural Organisation at Chinnakattpalayam in Cuddalore.— Photo: T. Singaravelou\n\nEverything about education is free for students at the Vellai Thamarai School\n\nSitting cross-legged with a Tamil book on a small portable desk, a fifth grade standard student Srimathi. S at Vellai Thamarai (White Lotus) School dreams about studying medicine.\n\nHer logic for reasoning out this profession is rather simple. She wants to provide free medicines to the poor.\n\nBorn in a very poor family in Reddiyarpalayam, she envisions the need for free medicines to the impoverished. She realises this importance as she receives free education provided to her in this school.\n\n“Everything here is free and we like coming to this school. We learn many languages, dance and even yoga,” she says. She has spent eight years of her schooling here, starting from pre-kindergarten.\n\nSandwiched between Thavalakuppam and Bahour of Puducherry, the school is located in Chinnakattupalayam, about 17 km from Puducherry. This school provides free education for the children of daily wage labourers, broken families and single parents who struggle to make their ends meet. The school selects the poorest among the poor from nearby villages including Poosaripalayam, Keelalinjipattu, Melalinjipattu. The economy of these villages dependent mainly on agriculture, it provides less opportunity for the landless. “Many of the parents of the children in this school work in nearby hospitals and as tailors or housemaids,” said Aravamudu, manager, Vellai Thamarai School.\n\nOnly 20 students are enrolled in each class. With a strict ‘no’ to punishments and homework, Vellai Thamarai School envisages to reach out to the impoverished children.\n\n“After we receive requests for admission, we conduct a survey and select the poorest of poor,” says Ajit Sarkar, founder of Vellai Thamarai School.\n\nHailing from villages that still practice caste discrimination, the children sit together in a class without any caste differences. The teaching methods are designed to train children coming from the economically backward sections. “Since many parents are not educated, we do not impose homework. Sometimes when the children request us, we oblige and give them homework,” he says.\n\nIt is an English-medium school which follows Tamil Nadu State board syllabus. However, the students here have an added advantage of learning four languages (Tamil, English, Hindi and French) starting from pre-school. Every month two volunteers from France visit this school to teach French.\n\n“We decided to teach French and English because it would open up many opportunities for these children,” he says. A total of 39 personnel manage the school including 12 teachers and four assistants.\n\nThe founders Ajit Sarkar and Selvi Sarkar, who are French citizens, run the school through donations from friends and well-wishers. Ajit Sarkar worked with National Institute of Sport, Expertise and Performance (INSEP) in Paris. “We use the money we get through teaching yoga and dance to fund the school. My students who have started their own dance or yoga schools share a percentage of their salary to the school,” says Selvi, who is a trained Bharatanatyam dancer.\n\nIn a day, there are nine to 10 periods. For older students from V standard, the classes are held between 8.30 a.m and 5.15 p.m. For the younger ones, it is between from 8.30 a.m to 4.30 p.m.\n\n“Each class is conducted for 40 minutes. After every two hours of intellectual activity there is a break for cultural activities,” says Selvi.\n\nAjit and Selvi Sarkar believe that without education there is nothing. When the school began in 2008, there were 80 students. Among them, 37 were diagnosed to be anaemic. In 2015, there are 200 students and none are anaemic. They provide three breaks – at 10.30 a.m. they provide milk and cereals, for lunch – rice, sambar and a vegetable and in the evening they provide milk and snacks. After lunch, it is ‘quiet time’ for 45 minutes. The children can sleep, play some indoor games or go to the libraries to read.\n\nTill last year, they had pre-crèche facilities as well. Parents who work as daily wage labourers come to feed their children. But due to shortage of rooms, they had to stop it. They are now waiting for the government’s approval to construct classrooms for higher secondary school.", 
    "section": "national", 
    "title": "Giving wings to dreams of the poorest", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}