{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Agitation:Congress MLAs stage a protest on the premises of the Puducherry Legislative Assembly on Monday. (Below) Tension prevailed when the police prevented Congress from entering the Legislative Complex.- Photos : T.Singaravelou\n\n‘People in constituencies held by Opposition have not received them’\n\nCongress MLAs including Leader of Opposition V.Vaithilingam, Pradesh Congress Committee President A.Namassivayam and K.Lakshiminarayanan along with supporters staged a dharna on the premises of the Legislative Assembly condemning the alleged discrimination shown by the ruling government in the distribution of freebies such as mixers and grinders to beneficiaries in the Union Territory.\n\nThe MLAs also accused the government of being partial towards people who are living in the constituencies held by the Opposition political parties.\n\nThe police and marshals of Assembly closed the gates of the Legislative Assembly Complex when the supporters went inside to conduct the dharna. Heated words were exchanged between the Congress volunteers and police personnel who attempted to prevent them from entering the complex.\n\nHolding a large banner, Mr. Vaithilingam, Mr. Namassivayam and Mr. Lakshminarayan squatted in dharna on the corridor of the Assembly Complex and raised slogans condemning the ruling government for allegedly showing partiality in extending the freebies such as mixers and grinders. They made it clear that they would not move from the place until they got any concrete assurance on extending the freebies to the people who are living in the constituencies held by Opposition MLAs.\n\nTokens given 4 months ago\n\nMr. Vaithilingam said the residents were given tokens four months ago for the distribution of free mixers and grinders but most of them did not receive the materials still. Such freebies are being given only to residents in the constituencies held by the ruling party while the people of constituencies which are being held by Opposition were ignored.”\n\nHe charged the administration of being lethargic in announcing the distribution time, date or venue. He said since there was no proper information, the people were dragged to pillar to post for getting the freebies. Mr. Vaithilingam also said similarly the rain-relief assistance of Rs.4,000 has not reached several.\n\nSpeaker V. Sabapathy, who was deputed by Chief Minister N. Rangasamy held talks with protesting MLAs. Not convinced with this, Mr. Namassivayam warned of massive agitation and road blockade in respective constituencies unless the government gave them a concrete assurance. Mr. Sabapathy said the distribution of freebies was affected due to unprecedented floods and rains. He assured them that the distribution will be completed before the end of this month. Following the assurances of the Speaker, the Congress MLAs dispersed from the place.", 
    "section": "national", 
    "title": "Govt. partial in giving freebies: Congress", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}