{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court has made a suggestion to amend Industrial Disputes Act, 1947 and empower Labour Courts to directly initiate criminal action against employers for non implementation of their awards in lieu of the present practice of forcing the employees to obtain sanction from bureaucrats before initiating such action.\n\nJustice S. Vaidyanathan made the suggestion while dismissing a writ petition preferred by Tamil Nadu Khadi and Village Industries Board in 2009 to quash an award passed by a Labour Court in Chennai in 2008 to grant permanent status to a group of carpenters who were engaged by the Board on piece rate basis for over 10 years since 1998.\n\nIn the judgement reserved in the Principal Seat of the High Court in Chennai and delivered here on Monday, the judge said: The Industrial Disputes Act was enacted in 1947. Now, it is almost 70 years and the moot question is whether there is speedy redressal to industrial disputes or not… Awards passed by District Judges are being scrutinized by the bureaucrats in a snail’s pace.\n\n“The purpose of the statute is to enable the parties to get proper relief during their lifetime. Now the order passed under various Labour enactments are only posthumous. If the power vested with the Government under Section 29 of the ID Act is taken away and given to respective Labour Courts for punishment of non-implementation of the award, definitely, the Act will be a workable legislation.”\n\nFurther, expressing concern over TNKVIB employees not having been able to reap the benefit of the Labour Court order in their favour for long, Mr. Justice Vaidyanathan said: “Even in the great epic Ramayana, Rama went back to Ayodhya after 14 years, but, in the case on hand, the employees are yet to get any relief from the Management/Khadi Board, even after struggling for nearly 14 years.”\n\n“The purpose is to enable the parties get proper relief during their lifetime. Now the order passed under various Labour enactments are only posthumous.”", 
    "section": "national", 
    "title": "HC suggests amendments to Industrial Disputes Act", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}