{
    "author": [
        "R Sivaraman"
    ], 
    "text": "The city’s star hotels, bars, restaurants and other outlets garnered more revenue than ever before cashing in on New Year Eve but failed to pay the required entertainment tax which is due to the municipalityAccording to reliable sources in the municipalities, huge sum of money, which ought to have come to the public treasury, has not reached to its kitty due to political intervention.\n\nBuzz of activities\n\nThe city witnessed buzz of activities at the hotels, restaurants, pubs as they organised more entertainment programmes to woo customers from other cities since the Chennai hoteliers cancelled their New Year events.\n\nThey had to pay entertainment tax from the range of Rs. 10,000 to Rs.80,000 for the tickets but only a few of them paid a meagre amount Rs.5,000 compared to their huge profit.\n\nThe officials said the Pondicherry Municipality (Entertainment) Rules clearly stipulate,\n\n“No enclosed place or building, whether permanent or temporary, shall be used for public resort or entertainment unless a licence has been obtained. One should pay entertainment tax for the conduct any entertainment in New Year eve.”\n\nThe municipalities had insisted the hotels and other outlets to pay entertainment tax in advance if they wished to sell the entry tickets as Pondicherry Municipality (Entertainment) Rules and added if they failed to pay the tax, appropriate criminal action would be initiated.\n\nIssue taken up with CM\n\nJust a few days before December 31, some of the influential office bearers of hoteliers’ association took the issue with the Chief Minister N. Rangasamy and complained that the municipal administration had been demanding high amount as tax. Municipality Commissioners and others were firm in their stand.\n\nAfter much persuasion, the municipalities were asked to accept Rs.5,000 as tax across the board.\n\n“Though they agreed to pay the tax which was compounded at the instruction of Chief Minister, several of them are yet to pay the amount. It would have fetched more than Rs.one crore from these entertainment programmes which had been organised on the single New Year Day,” said an official on condition of anonymity.\n\nBrisk business till 3 a.m.\n\nThough liquor bars and pubs continued business until 3 a.m and also organised some festivities, they refused to pay the entertainment tax reasoning that they were governed by Excise Department, added the officials.\n\nAhead of New Year Day, the municipal commissioner also warned, “If any establishment is found conducting any entertainment programmes without necessary permission or without payment of entertainment tax or action will be initiated against such institutions as per Pondicherry Municipality Rules and trade licences will be cancelled.\n\nEven as the Puducherry Municipality deployed three special teams to monitor hotels, restaurants and bars, they could collect only Rs.2.5 lakh as entertainment tax on the day. Several are yet to come forward to pay the tax since there is no strong mechanism in place, the officials complained.", 
    "section": "national", 
    "title": "Hotels, bars fail to pay entertainment tax", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}