{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prafulla Agnihotri says the campus would have world class classrooms\n\nPrashant Joshi, MD and Head, PBC Deutsche Bank, handing over an award to Vivek Agarwal, a student, at the Foundation Day celebrations of IIM Tiruchi on Monday. At left is D. Shivakumar, CEO of PEPSI Co India Holdings Private Ltd. Prafulla Agnihotri, Director, IIM Tiruchi, is at right.— PHOTO: M. SRINATH\n\nThe Indian Institute of Management-Tiruchi will move to its own campus near the Bharathidasan University on Tiruchi-Pudukottai Road in June, according to its Director Prafulla Agnihotri.\n\nSpeaking at its fifth foundation day celebrations here on Monday, Prof. Agnihotri said that construction of various buildings on the new campus had been progressing at a fast pace.\n\nIt would be completed soon.\n\nThe classrooms would be of world class standards. No other IIMs had moved to their own campus within five years of inception.\n\nIt would reinvigorate the campus atmosphere for students, faculty members, and so on.\n\nProf. Agnihotri said that it had been planned to provide green cover as much as possible on the new campus.\n\nAround 2,000 saplings had been nurtured for planting on the new campus. Besides beautifying the campus, it would create a cool atmosphere.\n\nStating that it continued to achieve 100 per cent placement every year, he said the institute was working to be among top 10 IIMs as soon as possible. It had taken a number of steps to achieve the target.\n\nD. Shivakumar, Chairman and Chief Executive Officer, Pepsico India Private Holdings, who was the chief guest at the event, said students could scale great heights in their career if they went about what they wanted at achieve with passion. Hence, the students should first identify their passion.\n\nJob hopping\n\nFrowning upon the tendency to change jobs among the youth, money should not be the lone criteria for changing jobs. If they worked for more years, they could achieve excellence and thereby earn more. They should be up-to-date in their field to survive in a competitive environment.\n\nPrashant Joshi, Managing Director and Head, PBC Deutsche Bank, said that practical experience on management was more important than theoretical lessons.\n\nHe stressed on the need for professional integrity, gratitude, and intellectual honesty.\n\nV. Gopal, Dean, Academics, IIM-T, spoke.\n\nEarlier, Mr. Shivakumar presented award of certificate of appreciation to three students for “Make a Difference” project.\n\nRavikumar, Centre-in-charge, IIM-T Chennai Centre, was felicitated for his service during the floods in Chennai.", 
    "section": "national", 
    "title": "IIM-T will move to its own campus in June", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}