{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A five-day workshop on computational brain research at the Indian Institute of Technology-Madras, inaugurated on Monday, aims to offer students a glimpse into how they could channel their curiosity and innovation to be part of creation of path-breaking products.\n\nAt the inaugural session on Monday, alumnus and co-founder of Infosys Kris Gopalakrishnan ran the audience, comprising predominantly students, through the birth of computers and the speed with which India adopted new technology.\n\n“Computers are going to change our life. More exciting things are about to happen in the next 35 years in computing, biology and brain science,” he said. The workshop will introduce interested students and faculty to research in computing and brain studies in progress across the world.\n\nIndia, as a big supplier of IT professionals to the world, has a large pool of talent that could be used for collaborative research, said Mr. Gopalakrishnan. “The workshop will be a key milestone as India could leverage its ecosystem and look at larger goals, and come up with innovative solutions,” he said.\n\nIf for scientists Mriganka Sur from Massachusetts Institute of Technology and Partha P Mitra, organisers of the workshop, it is about understanding how the circuitry of the brain works, scientist Anand Raghunathan of Purdue University is looking for opportunities to understand how to apply the circuitry of the brain and improve computer systems.\n\nTo a question on how the scientists could draw the students away from high-paying IT sector jobs, Mr. Gopalakrishnan said, “A substantial number of students are already into innovating with applications. What they need is a role model, incentives and aspirations to achieve their goals. We are here to do that.”\n\nWorkshop to\n\nfocus on ongoing research in computing and brain studies across the world", 
    "section": "national", 
    "title": "IIT-M alumnus introduces students to cutting-edge research", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}