{
    "author": [
        "Deepa H"
    ], 
    "text": "Senthamizhan removed from post of secretary of Chennai south district\n\nAIADMK general Secretary and Chief Minister Jayalalithaa on Monday removed former Minister and MLA G. Senthamizhan from the post of secretary of Chennai south district.\n\nAccording to party sources, the former Minister could have been dropped after negative reports in a section of the media about the flamboyant manner in which the AIADMK’s general council and executive committee were organised in south Chennai, coming in the aftermath of the historic floods and widespread destruction. It was only in November that Mr. Senthamizhan was reinstated as the district secretary.\n\nM. M. Babu, councillor of ward 142 in the Chennai Corporation, has been appointed as the new secretary of Chennai south (south) district. Party sources said he is close to Finance and PWD Minister O. Panneerselvam.\n\nElection Wing secretary\n\nMs. Jayalalithaa also effected a few changes among the party’s office-bearers. Deputy Speaker Pollachi V. Jayaraman was appointed as secretary of the election wing of the party. Coming at the time of Assembly elections, the appointment is being looked as a huge responsibility given to the old-timer.\n\nThe election wing will coordinate with office-bearers at various levels including district, town panchayat, panchayat union, panchayats and finally the booth-level committee.\n\n“Once the candidates are declared, the election wing will monitor and coordinate the work of party functionaries,” a senior leader said.\n\nUdumalai K. Radhakrishnan, Chairman of Tamil Nadu Arasu Cable TV, lost his post as election wing secretary within three months since he was appointed to the post. However, he will replace Mr. Jayaraman as Tirupur (moffusil) district secretary.\n\nMohan appointed organising secretary\n\nMs. Jayalalithaa also appointed Rural Industries Minister P. Mohan as an organising secretary. Apart from senior ministers O. Paneerselvam, Natham R. Viswanathan, R. Vaithilingam, Edapadi K. Palanisamy and P. Palaniappan, Social Welfare Minister B. Valarmathi, Revenue Minister R.B. Udhayakumar and Handlooms Minister S. Gokula Indira hold key party posts.\n\n“It just shows that he is being given more importance,” said a source.", 
    "section": "national", 
    "title": "Jayalalithaa rings in more changes ahead of elections", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}