{
    "author": [
        "K Raju"
    ], 
    "text": "Bid to counter TN’s petition in SC seeking deployment of CISF personnel at dam site\n\nPolicemen guarding the Mullaperiyar Dam in Idukki district of Kerala. The dam has been in the centre of controversy, as the Kerala government contends that it has become weak, which is vehemently opposed by Tamil Nadu.— File Photo\n\nThe Kerala government has planned to open a full-fledged modern police station near the Mullaiperiyar dam site shortly and deploy 20 police personnel. Tamil Nadu has been demanding deployment of CISF personnel for the security of the dam.\n\nThe main dam, baby dam, and all the nearby forest areas will come under the purview of the new station, official sources here said.\n\nIt has already renovated a building owned by the Forest Department, on western side of the dam near the 13 vents. One Inspector of Police, two Sub-Inspectors and 20 police personnelwould be deployed.\n\nAll necessary facilities had been created on the new premises to inaugurate the station immediately after Makara Vilakku festival in Sabarimala. Wireless sets, communication equipment, furniture and other facilities have been provided. The proposed station police will have easy access to Vallakadavu through forest road.\n\nThe objective is to counter Tamil Nadu’s petition in the Supreme Court seeking deployment of CISF personnel at the dam site and face the hearing in the Supreme Court on the security threat to the dam, sources claimed.\n\nThe recent visit of Kerala Irrigation Minister with Idukki MLA Biju Mol and Collector V. Ratheesan without obtaining prior permission and persistent threat to PWD officials had prompted the demand for deployment of CISF.\n\nA Supreme Court panel has banned unauthorised entry to the dam and advised Kerala to inform Tamil Nadu PWD before any official’s visit. Kerala had announced its decision to set up the police station in the Assembly on July 23 last year.", 
    "section": "national", 
    "title": "Kerala to open police station near Mullaperiyar dam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}