{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Patients’ kin narrate harrowing experiences of the GH fire\n\n“The smoke was very dense and my father inhaled quite a lot of it,” said a distraught Jeeva, son of Raja (52), one of the patients who was shifted out of ward 213 of the Rajiv Gandhi Government General Hospital. Mr. Raja died later. The ward was gutted in a fire early on Monday.\n\n“Since the mains were turned off, and the entrance to the ward is somewhat narrow, evacuation was tricky, especially with all the patients on beds and some of them on ventilators. The line hooked to my father’s wrist came off, and he was bleeding a little,” said Mr. Jeeva. He was waiting to receive his father’s body on Monday evening.\n\nMr. Raja, who had been admitted with intestinal obstruction, decompensated liver disease with chronic kidney disease and diabetes mellitus, had been on a ventilator when he was evacuated. He died on Monday evening, Mr. Jeevan said.\n\n“He had undergone dialysis, but the doctors had told me his condition was very serious. He also had a heart attack,” said Mr. Jeevan, adding that he hadn’t slept all night and had been at his father’s side.\n\n“Mr. Raja’s death was due to his illnesses. None of the patients who died had any complaints of respiratory distress or symptoms of smoke inhalation,” said resident medical officer A. Elango.\n\nDr. Elango said the two other patients N. Pandurajan and Manammal, who died a while after the fire, had succumbed to their illnesses. 39-year-old Mr. Pandurajan had been shifted to ward 201 by 3.30 a.m., and had died a short while later around 4 a.m. “He was not on ventilator at the time of the fire, and he had just undergone a double barrel ileostomy – a procedure to treat his perforated intestine. He also had tuberculosis and uncontrolled diabetes, and died due to these complications,” he said. Police said the body of Pandurajan was taken by his relatives, who left for their hometown in Villupuram district around 5.30 a.m.\n\nOn Manammal, who had been on a ventilator, Dr. Elango said the 60-year-old had had atrial fibrillation, hypertension and diabetes and had been admitted for thrombosis of a major blood vessel in the digestive system. “He too died of complications of his illness and not due to the fire. He died at 9.35 a.m.,” Dr. Elango said. Manammal’s body was handed over to his relatives.\n\n\"A duty assistant surgeon, a postgraduate student and a staff nurse were in the ward at the time of the fire, but staff from other wards rushed in to help\" Dr. Elango said. The fire rescue services were called and the smoke put out. Around 4.15 a.m., dean of the hospital R. Vimala and medical superintendent G. Sheelarani also arrived to check on the situation. State health minister C. Vijaya Baska and Health Secretary J. Radhakrishnan, arrived around 6 a.m., he said. The remaining 13 patients are now stable, Dr. Elango said.\n\nA relative of B. Swaminathan, who said he had been admitted for an intestinal obstruction, said the evacuation was very quick. “I saw some of the instruments on fire. The staff rushed in as soon as they heard, the power was switched off and the patients were evacuated,” she said.\n\nOfficials of the public works department said the accident was due to an electrical short circuit and has been rectified. “We plan to check the electrical wiring in the whole hospital to prevent such accidents,” said an official.\n\nThe PWD gets between Rs.1 to Rs. 1.15 crore towards maintenance and the carrying out of civil works at the hospital every year. Of this, nearly 10 per cent is spent on electrical work and annual checks.\n\n“Whenever improvements like air conditioners are made, we check for capacity and renew the wiring,” said the official.", 
    "section": "national", 
    "title": "‘My father inhaled a lot of smoke’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}