{
    "author": [], 
    "text": "In a partial relief for film actor Silambarasan alias Simbu, the Madras High Court on Monday directed him to appear before the Chennai Crime Branch Police for an enquiry in connection with the ‘beep’ song controversy, but made it clear that the offences for which he has been charged were bailable in nature.\n\nThe actor had moved an anticipatory bail application in the court last month after police in Coimbatore, Chennai and a few other places booked him and young music director Anirudh under provisions of the Information Technology Act and the Indecent Representation of Women (Prohibition) Act.\n\nThe All Indian Democratic Women’s Association (AIDWA) and some individuals in separate complaints had accused the two of composing what has come to be known as the ‘beep’ song containing lyrics demeaning women in general. A video of the yet-to-be-released song had found its way online.\n\nThe actor submitted that two FIRs were registered against him in Coimbatore and in Chennai under Section 4 (prohibition of publication containing indecent representation of women) read with Section 6 of Indecent Representation of Women (Prohibition) Act, Section 509 (Word, gesture or act intended to insult the modesty of a woman) of IPC, and Section 67 (Publishing information which is obscene in electronic form) of Information Technology Act.\n\nDenying the allegations, Simbu contended before the court that he had recorded various music tracks and songs personally without using or intention to use the them in films or release them for public exploitation. “Those songs are in a scratch rough format without complete lyrics and in an incomplete version which are not intended to use for public listening. I have exclusive right over such songs and no third party has got any right to infringe my privacy,” the actor added.\n\nPassing orders, Justice B. Rajendran made it clear that all the offences for which the actor has been charged are bailable and there is absolutely no need for such a plea (for anticipatory) before the court. The judge then directed Simbu to appear before the police for enquiry on January 11, setting the actor at liberty to approach Sessions Court for bail plea.\n\nMeanwhile, a Coimbatore-based man P. Elangovan filed a petition before the Judicial Magistrate – II here seeking registration of cases against the two.", 
    "section": "national", 
    "title": "No need for bail plea, appear before police, HC tells Simbu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}