{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Distribution of free mixers and grinders under way at the fish market on the East Coast Road in Puducherry.- Photo: T. Singaravelou\n\nPoor management of freebies distribution\n\nThis is with reference to the news item ‘Freebie distribution leads to chaos in Puducherry’ (December 17, The Hindu ). The government announced freebies like mixies and grinders to card holders In a situation where the poor becomes poorer with their woes multiplying, a free gift comes as a boon.\n\nThe news that its distribution ended in chaos injuring some makes sad reading. It is so unfortunate that an administration which could announce the freebies in style could not take care of its distribution in a proper manner.\n\nT.V. Sreekumar\n\nLawspet, Puducherry\n\nNeed for a State-run IAS coaching institute\n\nThe Chief Minister of Puducherry time and again reiterates that there should be a good number of IAS officers getting selected from the Union Territory of Puducherry. Unfortunately, there is no State-run IAS coaching institute here which could benefit all aspirants irrespective of caste and religion.\n\nThe government should establish such an institute by inducting renowned faculties and retired IAS officers as to encourage aspirants and also to make them competent on par with competitors from other States.\n\nA number of people get selected from our neighbouring State, Tamil Nadu. Hope this plea will be considered sincerely for the benefit of the people who are deprived of proper guidance in realising their potential.\n\nSubasribala Sridar\n\nAriyankuppam\n\nSenior citizens require identity card\n\nMany senior citizens and retired persons do not have a proper identity card. There are errors in the voter identity cards. Aadhar card does not have the exact date of birth either as it mentions only year of birth. As a retired bank official, I request the Government of Puducherry to issue senior citizen government card with the PAN card as proof.\n\nPradip Sen\n\nAmbalatadayar Street", 
    "section": "national", 
    "title": "Page 3/03janpyspd05 readers mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}