{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sri Dhandayuthapaniswamy temple administration has introduced online facility to enable pilgrims to book for various sevas and rooms in advance.\n\nThey can book temporary kattalai and daily kaala pujas – and for chariot procession and golden prarthana cradle through e-seva service. Pilgrims can visit the official website of the temple — www.palanimurugantemple.tnhrce.in — and choose e-seva for a hassle-free darshan.\n\nThey can also book rooms in various cottages under the control of the temple administration online. Date and time and availability of rooms for the next 30 days were displayed in the chart in the official portal.\n\nPrintout of the receipt is a must to have darshan and attend various sevas. For chariot procession, pilgrims will have to report to the hill temple office before 5 p.m. on the scheduled date. Pilgrims will be allowed for the chariot procession only after verification of the original ID proof.\n\nThree persons will be allowed to take part in the procession and five persons allowed for darshan through a special entrance. Cancellation will not be permitted for any e-sevas.\n\nThe temple has also displayed digital signboards at various places, including winch and rope car stations, steps, bus stand and railway stations for the convenience of pilgrims. All details were displayed in both English and Tamil languages.\n\nPuja timings, seva details, availability of rooms and tariff, six kaala puja timings, fares for chariot procession and golden cradle, darshan time, darshan tickets and fares for winch and rope cars were displayed in the digital screen. Information centres functioning at railway station and bus stand were hooked on with the central computer network.\n\nPilgrims can book rooms from these centres also, officials said.", 
    "section": "national", 
    "title": "Palani temple introduces online facility", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}