{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With the Centre reluctant to revive jallikattu ostensibly citing strong legal hurdles, the political blame game on the issue reached feverish pitch in Tamil Nadu on Monday.\n\nWhile DMK president M. Karunanidhi urged the Centre to expedite its efforts in lifting the ban on the sport, the Congress and PMK chose to target the BJP for its failure to keep up the promise of legalising jallikattu.\n\nIn a statement, Mr. Karunanidhi said even though he announced support for the protest to highlight the need to organise the ancient sport, the protests were given up following a promise made by Union Minister Pon. Radhakrishnan to take steps to conduct jallikattu.\n\n“I also faxed him explaining the need for organising the event. He immediately responded to my letter and expressed hope that the Centre would succeed in getting permission for jallikattu. Hopes were raised after Union Environment Minister Prakash Javadekar made similar promise,” Mr Karunanidhi said.\n\nHe also accused the Tamil Nadu government of not taking any steps to conduct the event. “It is condemnable that neither the Chief Minister nor a senior minister of the cabinet has met Prime Minister Narendra Modi in connection with the issue,” he said.\n\nPMK founder S. Ramadoss took the fight to Twitter. In a sarcastic post, the leader said while the BJP and Congress were trading charges and demand resignations, nothing concrete has come out of it. “It is sure that nothing but empty speech will take place,” he said.\n\nThe Congress, on the other hand, passed a resolution in a meeting condemning the BJP for trying to divert the blame. While the 2011 notification of the Ministry of Environment and Forests was being cited as the reason for the ban on the sport, the resolution said the BJP was comfortably hiding the fact that jallikattu was conducted both in 2012 and 2013.\n\nResponding to Mr. Ramadoss’ remarks, State BJP president Tamilisai Soundararajan wondered what the party’s MP Anbumani Ramadoss had been doing over the past many months.\n\n“Every one has the responsibility to ensure the event takes place. This is not the time to politicise the issue,” she added.\n\nTNCC contradicts Manmohan’s stand\n\nMeanwhile, the confusion over the stand of the Congress on this issue deepened on Monday with the Tamil Nadu Congress Committee contradicting the views of senior national leaders and backing the revival of jallikattu. In a response to Human Society International/India on December 15, former Prime Minister Manmohan Singh had extended his support for the campaign against bullfighting and hailed it as a worth objective. Former Union Environment Minister Jairam Ramesh had also slammed the BJP for its attempts to lift the ban.\n\nHowever, TNCC president E.V.K.S. Elangovan said Dr. Singh’s opposition was only to “bullfighting” and not jallikattu. “Bullfighting is what you see in Spain and it involves cruelty. There is no cruelty in jallikattu. Dr. Singh has opposed bullfights,” he contended, reiterating the party’s position backing the sport.", 
    "section": "national", 
    "title": "Parties trade charges over delay in reviving jallikattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}