{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Members of Federation of Retired Employees Associations (FREA) staging a hunger strike in front of the office of the General Manager, TNSTC near Ranithottam depot in Nagercoil on Monday.\n\nOver 1,200 retired employees of Tamil Nadu State Transport Corporation (TNSTC) in Nagercoil region have been denied their terminal benefits, according to Federation of Retired Employees’ Associations (FREA).\n\nCondemning this, a group of retired employees started an indefinite hunger strike in front of the office of the General Manager near Ranithottam TNSTC depot here on Monday. B. Thangappan, president, FREA, said that a makeshift shed erected for staging the agitation was removed by the authorities on Sunday night itself.\n\nHe said that terminal benefits, including gratuity, commutation, EPF, had been withheld since 2011 for the 1,200 retired employees. Premium for life insurance policies and loan repayment to Employees Thrift and Credit Society were also pending, forcing the retired employees to pay interest to the society and penalty to the LIC.\n\nThough the Chief Minister released Rs. 208 crore for disbursing terminal benefits to the employees, the fund was diverted to some other purpose, and EPF only up to 2014 was settled.\n\nThe Chief Accounts Officer of TNSTC-Tirunelveli Division was responsible for the financial mess, the forum said and demanded a CBI enquiry into it.\n\nThe association staged similar strikes on March 5, 2013 and again on July 4, 2013, following which some employees received terminal benefits.\n\nWhen contacted, P. Thiruvambalam, General Manager, TNSTC- Nagercoil region, denied the allegations and said that EPF of retired employees were settled till March 2014 and gratuity up to June 2013 and terminal benefits of 400 employees were pending. The government was working out means to release funds to settle terminal benefits of others, he added.", 
    "section": "national", 
    "title": "Plea to disburse terminal benefits", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}