{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Ban deprived the livelihood of scores of fishermen”\n\nThe Tamil Nadu AITUC Meenava Thozhilalar Sangam has appealed to the district administration to help to lift the ban on fishing sea cucumber, an endangered species listed under schedule I of the Wildlife Protection Act, 1972.\n\nS. Muruganandam, sangam district secretary, who led a group of members, who visited the Collectorate here on Monday, wearing masks used for underwater fishing, questioned the logic behind India imposing the ban when the collection of the organisms for commercial exploitation was allowed in more than 100 countries in the world.\n\nThe ban, since 2001 in the Palk Strait and the Gulf of Mannar, has deprived the livelihood of scores of fishermen in the region but their counterparts in Sri Lanka, across the Strait, were freely fishing sea cucumber, which commanded good demand in the export market, he said.\n\nIn the absence of an effective monitoring mechanism, the ban has not yielded the desired result as fishermen continued to engage in illegal fishing of the endangered species to eke out a living, he said. However, the poor fishermen faced stringent legal action when they were caught by forest officials.\n\nLifting of the ban would provide steady income to hundreds of fishermen living along the coast of the Palk Strait and the Gulf of Mannar, he said. The lifting of ban would also help the fishermen get better price for the catch as they were forced to sell the organisms at throw away price to illegal traders and exporters, said Mr. Muruganandam.\n\nScientists from the Central Marine Fisheries Research Institute (CMFRI) while addressing a “Consultation meet on sea cucumber” in August last, expressed views that sea cucumber played a key role in preserving the ecosystem and acted as good bio-terminators.\n\nMr. Muruganandam said the CMFRI and the authorities had suggested a seasonal ban on fishing sea cucumber in the Palk Strait and the Gulf of Mannar, but no decision was taken even after several years.", 
    "section": "national", 
    "title": "Plea to lift ban on fishing sea cucumber", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}