{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The price fixed by the traders is not up to farmers’expectations\n\nDespite good yield, thanks to the widespread rainfall received by the district in the last two months, the poor price fixed by traders has proved a matter of concern for the sugarcane farmers of Omalur block.\n\nA large number of farmers have raised sugarcane on hundreds of acres in Omalur and the surrounding villages of Kottai Mariammankoil; Muthunayakkanpatti; Palakuttapatti; Semmankoodal; Kadaiyampatti and Kanjayakkanpatti. The good condition of the standing crop brought much joy to the cane farmers.\n\nThe cane crop season commenced in the Tamil month of Panguni and the full sized canes are ready by the months of Margazhi and Thai , well ahead of the Pongal festival. The farmers incur an expenditure of Rs. 1.5 lakh for raising the cane on one acre.\n\nThe high expenditure is due to the increased wages they have to pay to the farm workers. With the Mahatma Gandhi National Rural Employment Guarantee Scheme attracting a large number of workforce, the farmers have to pay higher wages to the available workers.\n\nThe joy of farmers due to good condition of standing crop is short lived, as the price fixed by the traders is not up to their expectations and very much on the lower side.\n\nA section of the farmers of these villages complains that the local traders have fixed a meagre price of Rs. 5 per cane this season. The same cane was procured by traders at Rs. 15 during the last season.\n\nThis has caused much concern to the farmers, as they have to somehow dispose off the cane by Pongal festival.\n\nThe farmers have demanded the government to come to the rescue of the small cane farmers. They have also demanded the government to include farm activities in the implementation of MNREGS so that the farmers can get cheap labour at their doorstep.\n\nThe cane farmers are sitting with their fingers crossed as the next few days will prove crucial for marketing the cane.", 
    "section": "national", 
    "title": "Poor price for sugarcane a concern", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}