{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The recent seizure of a two-wheeler with ‘Press’ sticker, which was used for transporting pirated DVDs, has brought to light the liberal use of vehicles with ‘Press’ stickers.\n\nOne Nambiraj of Tirunelveli Town was picked up by the police on suspicion while he was taking a carton of pirated DVDS on a motorcycle with ‘Press’ sticker’ on Saturday. On being questioned, Nambiraj flashed his ‘identity card’ that claimed that he was a reporter of ‘Dinadharani’ and warned the police that they would have to meet serious consequences. However, Inspector Thillai Nagarajan, on getting instructions from Assistant Commissioner of Police G.S. Madhavan, took him to the Palayamkottai police station and more than 1,000 DVDs were seized. The bike was also confiscated.\n\n“Though investigation proved that a former reporter, who is still introducing himself as a journalist, is the owner of a pirated DVD manufacturing unit, no action was taken against him,” a police officer said.\n\nWhen P. Kannappan was the Deputy Inspector General of Police and Asra Garg the Superintendent of Police, they reined in fake reporters. A policeman attached to the Intelligence Section said that three motorcycles, an omni van and a sedan, all with ‘Press’ stickers but not owned by reporters, were being used for transporting contrabands, including liquor brought from Puducherry and ganja. “When these vehicles were dispatching the contrabands recently, the police were alerted. However, the vehicles were not intercepted as they were carrying ‘Press’ stickers,” he said.\n\nVehicles of reporters working with recognised media alone can carry the ‘Press’ sticker issued by the government. However, photocopies of the stickers are being misused liberally.", 
    "section": "national", 
    "title": "‘Press’ sticker misused", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}