{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Seventeen-year-old A. Rosni Fathima has just stepped into a college but already won more than 70 medals and cups as she practised hard to bring laurels to the country in athletics.\n\nFocussing on 100 meters and 200 meters, Fathima, a first year English literature student of Thassim Beevi Abdul Kader College for Women, was working hard to clock 100 meters in less than 12 seconds.\n\nShe won the gold medals in 100 meters, clocking 12.24 seconds and 200 meter race at the inter-university athletic championship held at Alagappa University in Karaikudi on December 12 and 13.\n\nHer immediate aim was to finish 100 meter race in less than 12 seconds and win gold in the upcoming All India University meet.\n\n“My immediate ambition is to represent India in the Asian athletic meet and the ultimate aim is to take part in the Olympics,” she said. The district administration was very supportive and Collector K. Nanthakumar offered to get her spikes, shoes and the latest starting blocks when she showed him the medals here on Monday. Fathima won gold medals in 100 and 200 meters for six successive years for the Ramanathapuram division, comprising seven educational districts in Ramanathapuram, Sivanganaga and Virudhunagar.\n\nShe hogged the limelight when she won the Tamil Nadu State Junior Athletic Championship in 2012 and won gold in the State-level medley relay, a year later. The district administration honoured her with best sportsperson last year.\n\nVelmurugan, athletic coach, recently appointed by the Sports Development Authority of Tamil Nadu, was extremely helpful and introduced her some new techniques.\n\nThe SDAT promised to provide a synthetic track at the sports stadium here, which would be of great help when she took part in national-level meets, she said.\n\nHer father Aligar Khan, a basket ball player spotted the talents in her when she was hardly 12 years.", 
    "section": "national", 
    "title": "Promising athlete’s eye on Olympics", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}