{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Banana crops were damaged on 3,048 hectares in parts of Tuticorin district after rains during the northeast monsoon season, Collector M. Ravikumar said here on Monday while referring to assessments carried out by officials.\n\nThe officials were still ascertaining damage caused to other crops and a report was expected to be submitted in two days, he said.\n\nApart from banana, crops such as chillies, onion, black gram, green gram, maize and paddy were also damaged in the rains. The State government had already announced compensation for crop damage.\n\nAs for damages caused to irrigated banana crop, compensation of Rs.13,500 was fixed per hectare and Rs.7,410 as compensation for damage caused to a hectare of rain-fed crop. As per inspection by officials, 21,100 houses in district were inundated during the monsoon season, the Collector told the media.\n\nSurpassing the average annual rainfall of 662 mm, Mr. Ravikumar said the district experienced 804.6 mm rain in 2015.\n\nHe said NABARD had sanctioned Rs.1.23 crore under its rural infrastructure development fund to construct a check-dam across Karumeniyar at Kombankulam in Sathankulam taluk. The check-dam would have a 70 meter width and height of one meter, the Collector said, adding that 4,01,449 free dhotis and saris would be distributed to consumers through fair price shops ahead of Pongal.\n\nTourism Minister S.P. Shunmuganathan inaugurated the distribution of dhotis and saris during last week at Sathankulam and so far, 20,546 such items had been given.\n\nAs for as freebies such as grinders, mixers and electric fans were concerned, the government allotted a total of 95,655 sets of these items for distribution during 2015-16 and 25,327 beneficiaries had been covered so far.\n\nTuticorin Sub-Collector S. Gopala Sundara Raj and others were present.", 
    "section": "national", 
    "title": "“Rains damaged banana crop on 3,048 hectares in Tuticorin”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}