{
    "author": [
        "Special Correspondent"
    ], 
    "text": "About 14 lakh families will get the money in their bank accounts; remaining will get it on Jan.11\n\nIf you had been affected by the recent torrential rains and if you are among the 14 lakh families, whose details have been collected during a survey by officials, there is a chance that the relief amount is credited to your bank account on Tuesday.\n\nSurvey\n\nDuring the survey, it was calculated that a total of 25,48,152 houses and huts were surrounded by water during the rains and another 4.93 lakh huts were either completely or partially destroyed.\n\n“The details of about 14 lakh families have been collected and uploaded. The rain relief would be deposited to the bank accounts of these 14 lakh families today (Jan 4) and would be credited into their account tomorrow,” Ms. Jayalalithaa said in a statement.\n\nThe remaining would get the rain relief in their respective bank accounts by January 11.\n\nAs announced earlier, 10 kg rice, a dhoti, a sari, besides Rs. 5,000 or Rs. 10,000 as may be the case, could be collected from ration shops by producing the family cards till the end of February.\n\nCentral team visit\n\nThe Central team that had conducted a survey in the rain-affected areas in the State in November last year would arrive here on Monday for another survey to visit the areas that were affected in the December floods.\n\nA team headed by Home Ministry Joint Secretary T.V.S.N. Prasad met Chief Minister Jayalalithaa on November 26 last year and conducted a survey to assess the impact of the rains.\n\n“The same team would visit the affected areas for two days from tomorrow (January 5) and submit its report,” Ms. Jayalalithaa said in a statement.\n\nThe State government had sought Rs. 25,915 crore from the Centre for paying relief to the affected persons and for compensating damage to public property.", 
    "section": "national", 
    "title": "Rain relief to be credited today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}