{
    "author": [], 
    "text": "Dispense with shirt code in temples\n\nThis refers to the news report on ‘Dress code comes into effect in temples’ ( The Hindu , January 2). It is welcome news that the Hindu Religious and Endowments Department, on the direction of Madurai Bench of Madras High Court, has enforced the dress code for men and women, including children, for entry into temples under its control from January 1. Due to blind adoption of western style, both men and women wear revealing dresses — men enter temples with short pants and young women in transparent leggings and short tops. This indecent attire is likely to distract devotees. Hence, in the interest of preserving our traditions and culture, temple authorities should enforce the dress code strictly.\n\nRegarding men’s attire, it has been stated that wherever the practice of removing shirts is in vogue, as in Tiruchendur and Kanyakumari, it should be followed. But, since, hot climatic conditions prevail for a better part of the year in our State, men sweat profusely while waiting in long queues in the temple precincts. Further when the devotees push and jostle among themselves, a bad odour emanates from them. Hence men must be allowed to wear their shirts. I request that the practice of removing shirts, followed in the very few temples in the State, may be dispensed with in the interest of preserving one’s health.\n\nS. Nallasivan,\n\nTirunelveli\n\nDouble track needed\n\nThe Kanyakumari-Chennai Egmore route trains are always fully booked. While there is an urgent need to introduce more trains on this route, the single track between Madurai and Kanyakumari poses the greatest impediment. Hence doubling of track in this sector and upgrading it to run high-speed trains must get priority over other projects.\n\nThis would not only boost tourism but will also help industrialisation of this region, and support Tuticorin port and upcoming Colachel port. It should be pointed out that the impact of ‘Swachh Bharat’ programme is yet to be seen in trains and railway stations in southern districts. Cleanliness is more important than the ambitious ‘bullet train’ project.\n\nG. Stanley Jeyasingh,\n\nNagercoil\n\nDoors for buses\n\nIt has been suggested that buses in Tuticorin district should be equipped with doors to prevent accidents involving footboard travellers. This suggestion is a step in the right direction. It is the responsibility of the authorities to look into any idea that prevents accidents. Will they look into the door system for buses? The sooner they implement it, the better it would be for all.\n\nP. Senthil Saravana Durai,\n\nVazhavallan\n\nEncroachments on highways\n\nOwing to rapid increase in number of vehicles on roads and rampant encroachment of highways, traffic snarls occur in Nagercoil and Marthandam. It is a long time since the highway authorities cleared encroachments on highways in Kanyakumari district. Though one-way system is introduced on many roads in Nagerocil, new encroachments crop up and gobble carriage ways. The authorities, it seems, are oblivious to temporary roadside shops selling helmets and cotton dresses becoming permanent over a period of time. Automobile and furniture showrooms on highways utilise the space facing the road to the maximum to display their new products much to the inconvenience of the public. This causes congestion and also accidents during peak hours. I request the highway authorities look into these problems and solve them soon.\n\nB. Harikumar,\n\nNagercoil\n\nDirect bus needed\n\nTuticorin has two old (Anna) and new bus stands. Buses plying in the southern direction such as Tiruchendur and Tirunelveli start from old bus stand and those bound for northern destinations such as Kovilpatti and Madurai start from the new bus stand. But all town buses serve only the old bus stand. Hence, a passenger going to Madurai has to board a town bus to reach old bus stand and again take a mini bus to go to new bus stand. Those with children and big luggage find it difficult while changing buses.\n\nMoreover, the mini bus will leave only after it is fully packed. Hence, considerable time is lost. I request the authorities to make arrangements to ply buses directly to new bus stand to mitigate the hardships of the public.\n\nP. Selwyn Basker,\n\nTuticorin\n\nNo toilet for women\n\nI am a one of the hundreds of regular morning walkers using District Sports Stadium grounds on George Road in Tuticorin. The stadium has two toilets under the galleries — one on the northern side and the other on the southern side. One is meant for men and the other for women. But, for the past few months both the toilets have been allocated for boys staying in the sports hostel. This poses difficult for women and when questioned whether any alternative arrangement has been made for them, I was told that they could use the toilet inside the swimming pool complex. But it is a place restricted to members and often closed in the early morning hours. Hence, I request the authorities to construct a toilet for women at the stadium at the earliest.\n\nV. Pandy,\n\nTuticorin\n\nThe Delhi scheme\n\nThe first day of implementation of the ‘odd-even vehicle scheme’ in Delhi on January 1 was found more successful than what was expected by the Aam Aadmi Party (AAP) government ( The Hindu, January 2).The initial readings of air quality levels did not support the claim. But in due course the pollution level in the air will certainly come down. The Tamil Nadu government may introduce this scheme, at least in cities, to reduce pollution level and traffic congestion.\n\nP. Victor Selvaraj,\n\nPalayamkottai\n\nPrevent breeding of mosquitoes\n\nResidential areas in some places in the State still remain waterlogged long after the heavy downpour. There is every possibility of outbreak of vector-borne diseases in these areas. Hence, the Health Department should spray anti-larvae chemicals in inundated areas and prevent breeding of mosquitoes.\n\nK. Chelliah,\n\nAundivillai", 
    "section": "national", 
    "title": "Readers mail – tvl", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}