{
    "author": [], 
    "text": "Elders ill-treated\n\nat check posts\n\nThis is to draw attention to our bitter experience with the staff at the check posts at Katpadi, Vallimalai, and Tiruttani, whose recurrent obnoxious behaviour and free use of vulgar and unprintable language needs to be curtailed. We are an elderly couple aged above 70. We went on a pilgrimage from Thanjavur to Tirupati in a hired vehicle after a night’s stay at Vellore. Apparently there was something wrong with the permit; it had been stamped for Kerala, Karnataka, and Puducherry. Andhra Pradesh had been left out.\n\nOur request for a valid permit to be re-issued at the check post was met with a barrage of vulgarity most unbecoming of a government servant, that too in the presence of an elderly woman. We had to make a large detour to Vallimalai and repeat the request at another check post to be, again, ill-treated. At Tiruttani, the official issued the required permit. And what should have been a two-hour drive took five hours. Will the concerned authorities take cognisance of the unacceptable behaviour of those manning the check-post?\n\nS.N. Siva,\n\nThanjavur\n\nParking fee norms\n\nviolated at Junction\n\nThe parking contractor at the Tiruchi Railway Junction can collect Rs. 20 as parking fee for four-wheelers for two to four hours and Rs. 10 if it was less than two hours. However, the contractor charges Rs. 20 even if vehicles are parked for 10 minutes. This has been highlighted to Railway authorities but action has not been taken. Will the authorities concerned enquire and direct the contractor to collect parking fees as per the contract terms. In the interest of the public, a notice board showing the parking fee should be displayed prominently.\n\nS. Sampath,\n\nThillai Nagar\n\nBridge weakened\n\nRight under the public glare, the Cauvery bridge has been battered. The steel-reinforced perforated parapet were replaced with a weak cement brick wall. The new parapet is bound to crack and also it obstructs the view of the Cauvery to smaller vehicles. The cement road cannot have the same quality after it is relaid.\n\nBrigadier R.Ilangovan (Retd.),\n\nSrirangam\n\nAfter work started on the Cauvery bridge, many accidents occurred because of rash driving by private buses many persons injured. There is need for presence of traffic police to control traffic.\n\nG. Srinivas,\n\nTiruvanaikoil\n\nWhere did appam go?\n\nDuring the Vaikunta Ekadasi festival, a special prasadam called Selvar appam (Tiruvarngar Selvarappam)is in demand. This year, the appam vanished from the devasthanam stall. Will the Executive Officer of the temple conduct an enquiry and ensure at least during next year the appam is made available at the stall?\n\nT.M. Ranganathan,\n\nSrirangam\n\nWiden Vayalur Road\n\nTraffic on Vayalur Road has increased considerably in the recent past. It has become difficult for the pedestrians to walk on the road as there is practically no space. The road is narrow and unsafe for pedestrians. There is an urgent need to widen the road which was never meant to handle the present heavy traffic. The authorities concerned should consider building pedestrian pathways and putting up traffic signals at some places such as KumaranNagar and Srinivasa Nagar.\n\nK. Muthuswamy,\n\nTiruchi\n\nReplace lamppost\n\nAt Mutharasanallur, Vellalar Street (under Tiruparaithurai EB office limit), a lamppost located at the old post office has corroded and stands in a precarious condition. Children play at the spot oblivious to the danger. Representations to the authorities had fallen on deaf ears. I appeal to the Tangedco officials to replace the old pole before any major accident.\n\nS.P. Raghavan,\n\nMutharasanallur\n\nRepair road\n\nThe Nochiam Road is in a bad condition from Mannachanallur Government Boys School. Drivers face difficulty while crossing the 3.5-km stretch. Many dangerous pits, eroded bitumen layers, and two difficult narrow bridges pose a big challenge for motorists. There are pits on Atthani bridge. I request the Highways Department to repair the road immediately.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nRacquet Line\n\nRoad in bad shape\n\nThe Racquet Lane Road near the Central Bus Stand needs urgent repair. Two-and four-wheelers are finding it difficult as several potholes dot the road. Pedestrians bear the brunt. Many buses, share autos, and lorries with heavy luggage go to Dindigul from Central Bus Stand and Manaparai via the road. The damaged road should be repaired immediately.\n\nD. Nishanth,\n\nKarumandapam\n\nLane discipline\n\nnot followed\n\nLane jumping on national highways cause accidents. One of the two lanes on each carriage are meant for slow-moving vehicles and the right lane is meant for fast-moving vehicles. But motorists change lanes without any indication.\n\nSundar,\n\nMambalasalai, Tiruchi\n\nPoor patients left\n\nin the lurch\n\nNow a days there is much awareness on blood donation and many social service organisations are ready to help. The middle and upper class people who need blood reach the donors through social media easily. But at the government hospitals, the poor find it difficult to reach the donors. The hospital managements and social service organisations should display the contact numbers of donors and guide the poor.\n\nM. Karthick,\n\nTiruchi\n\nCurb chain snatching\n\nChain-snatching and robbery are crimes committed every day. The culprits, even if caught and convicted, get light punishment. Police patrolling is a must. The services of Home Guards could be utilised. The police should priority for the safety of people and their belongings.\n\nJanaki S.Raj,\n\nRockfort\n\nNH damaged\n\nThe road between Thanjavur and Nagapattinam has been declared a national highway. It is an important road connecting Velankanni. The widening of this road is going on now. But the existing road has been badly damaged in recent rains. Travelling through this route has become dangerous because of potholes. Vehicles cannot be driven at normal speed.\n\nR. Sivakumar,\n\nPoondi", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}