{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The release of water from Mettur Dam for farm activities will continue for 15 more days. —PHOTO: E. LAKSHMI NARAYANAN\n\nEven while further stepping up the release of water from Mettur dam for the farm activities in the delta region on Sunday evening, the Public Works Department has also extended the release of water in the dam’s East-West Canal for saving the standing crop in the western districts of Salem, Namakkal and Erode till January 18.\n\nThe release of water from the dam into Cauvery river which stood at 12,000 cusecs for the past few days, was stepped up to 15,000 cusecs on Sunday evening for the ongoing ‘samba’ cultivation in the delta region.\n\nThis is fourth time in the last 13 days that water release from Mettur dam has been stepped up for samba cultivation.\n\nThe PWD, on demands of the farmers of Cauvery delta districts, stepped up the water release to 7,000 cusecs on December 23. It further stepped up the release to 9,000 cusecs and 12,000 in the subsequent days following good water position in the dam. The water from Mettur Dam was released in to the East-West Canal for irrigation activities in 45,000 acres in Salem (16,433 acres), Namakkal (11,337 acres) and Erode (17,230 acres) districts on August 20.\n\nPWD sources said that usually water would be released for farm activities under the East-West Canal scheme for 137 days from August 1 to December 15. Since the water storage position in the dam was not adequate enough, the release of water was deferred to August 20. The 137 deadline ended on Sunday (January 3). About six tmc of water had been released under the canal scheme.\n\nInitially about 500 cusecs was released from the dam in the first phase and it was later stepped up based on the need for farm activities.", 
    "section": "national", 
    "title": "Release of water from Mettur dam to continue", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}