{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Kongunadu Makkal Desiya Katchi members on Monday presented a petition at the weekly grievances redress meeting to the district administration seeking removal of encroachments near Sanganoor Canal. In their petition, the party men said that in the canal that runs through Kanuvai, KNG Pudur, Kavundampalayam and Ganapathy, there were a number of encroachments that curtailed the flow of sewage.\n\nIn some stretches, the encroachments were so bad that 75 per cent of the canal had been blocked. This would spell trouble for the city as during heavy rains it was Sanganoor Canal that carried most of the flood water, the party men said. Therefore the Coimbatore Corporation should remove encroachments and clean the canal, they demanded.\n\nThey also sought removal of encroachments and laying of a scheme road between Eru Company on Sanganoor Road and Kavundampalayam Causeway to ease traffic congestion on Mettupalayam Road. The scheme road would benefit people proceeding to Edayarpalayam, TVS Nagar and areas north thereof.\n\n‘Provide reservation in house allotment’\n\nMembers of the Communist Party of India-Marxist and a few residents of Vellalore on Monday petitioned the district administration demanding reservation in allotment of houses that are being constructed by the Tamil Nadu Slum Clearance Board.\n\nIn their petition, they said that the Coimbatore Corporation had in 1980 purchased 740 acre from farmers and low income group members and those people were now daily wagers without proper housing.\n\nTherefore, the district administration should reserve 10 per cent of the 2,862 houses that the Board was constructing in Vellalore for them.\n\n‘Ensure fair treatment of Muslim prisoners’\n\nPeople’s Movement for Justice on Monday petitioned the district administration seeking treatment of Muslim life convicts on a par with other life convicts. In its petition, the organisation said that of the 49 Muslim life convicts in Tamil Nadu, 18 were in the Coimbatore Prison. They were convicted by a lower court in the Coimbatore bomb blasts case and most had moved an appeal before the Supreme Court.\n\nThere were around 25 prisoners in Tamil Nadu convicted for life for murder. The prison officials in the prisons denied them the rights and freedom they gave to other life convicts. The State Government should take steps to release those life convicts who were not connected with the blasts case and had served 20 years in prison.\n\nThe Muslim prisoners should be considered on a par with other life convicts in granting parole and prisoners over 65 years should be released, it added.", 
    "section": "national", 
    "title": "‘Remove encroachments near Sanganoor Canal’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}