{
    "author": [], 
    "text": "The Pallavan Superfast Express Train (No. 12606/12605) is leaving Karaikudi Junction at 04-30 hours, which is inconvenient to passengers, and arrive Tiruchi at 06-15 hours. The distance between the two location is 89 km and the journey time is 105 minutes which means the speed was only at 60 kilometre per hour averagely.\n\nBeing a superfast express train, the speed of the train can be increased to 100 kmph.\n\nThe railway ministry is in favour of speeding-up of trains wherever possible. I request the Southern Railway to consider rescheduling the departure time of Pallavan Superfast Express at Karaikudi Junction at 05-00 a.m. (instead of 04-30 a.m.).\n\nK. Somasundaram,\n\nDevakottai.\n\nDeepen\n\nwaterbody\n\nTowards the west of Ramanathapuram a waterbody known as Mugavai oorani was dug by Kilavan Sethupathi to harvest rainwater. Once this famous reservoir served the drinking water needs of the whole town. There are two big open wells in the reservoir which feed the needs of the town during summer. This reservoir received Vaigai water through the seventh supply channel. There was already a proposal to link three drinking water ooranies i.e., Mugavai, Lakshmipuram and Pamboorani ooranies to the big tank so that the excess water from the tank could go to the ooranies and recharge the wells in the area. The shallow Sakkarakottai tank may also be deepened and filled with water from the big tank. The town may get surface water supply from these ooranies and the Sakkarakottai tank just like Chennai city being fed with surface water from Puzhaleri etc., May I request Collector to look into this issue?\n\nG. Nagasamy,\n\nRamanathapuram.\n\nUnjustified hike\n\nThe Southern Railway has hiked the tatkal charges suddenly from 10 per cent to 40 per cent with effect from December 25, 2015. Prior so this, they have raised the cancellation charges for second class sleeper coaches and also to air-conditioned coaches. The railway budget will be presented in Parliament probably in February 2016. The hike in tatkal charge and cancellation fees are highly arbitrary and unjustified. It is a burden to commuters. I appeal to the railway authorities to reduce the hike.\n\nV. Rajendran,\n\nParamakudi.\n\nNo parking lot at marriage halls\n\nSome marriage halls at Kenikkarai junction do not have any parking place for vehicles. Visitors’ vehicles are parked on roadside causing hindrance to free flow of traffic. Adding fuel to fire, flex boards are permitted to be placed on the road. Kenikkarai is an important junction connecting four major roads and the public are affected by traffic jams often at this junction. It is a wonder as how officials remain silent spectators in spite of public protest in this regard. I appeal to the district administration to inspect the spot and cancel the licences of marriage halls that have failed to provide parking space. The police should avoid granting permission to erect flex boards at this junction.\n\nAsmabagh Anvardeen,\n\nRamanathapuram.", 
    "section": "national", 
    "title": "Reschedule train departure time", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}