{
    "author": [
        "Deepa H"
    ], 
    "text": "The project under CRIDP costs Rs 3,574 crore\n\nWorks including widening of roads, formation of bypasses and improvement of curves and geometrics at a total cost of Rs. 3,574 crore have been taken up across the State under the Comprehensive Road Infrastructure Development Programme (CRIDP) for 2015-16. Of this, Rs. 172.73 crore will go towards construction of 166 bridges and culverts and Rs. 199.37 crore under the road safety component.\n\nWith a steady increase in volume of vehicular traffic, widening of roads is being taken up in a phased manner,” explained a source in the Highways Department, which is implementing the programme. This year, 160 km of State highways are being widened at a cost of Rs.345.95 crore. Major district roads of 175 km and 425 km of other district roads will be widened at a cost of Rs.192.58 crore and Rs. 302.24 crore.\n\n“Converting of other district roads into intermediate lane roads will facilitate connectivity of smaller towns and villages to the important towns in each district. Movement of people and goods will be faster,” said the source.\n\nWidening of the Thiruchengodu- Namakkal road is a major proposal under this year’s CRIDP. The four-laning work that includes land acquisition has been estimated at Rs. 126 crore and this year Rs. 40 crore has been allocated. “The remaining amount of Rs.86 crore would be accommodated in next year’s CRIDP. The existing road would be strengthened too,” the source explained.\n\nUnder the road safety improvement component alone, widening of narrow cross drains and construction of medians have been taken up at a cost of Rs. 199.37 crore. “Last year, the Chief Minister had announced that black spots that are accident-prone would be corrected with proper civil engineering after studying the spots. A total of Rs. 245.30 crore had been allocated for that. Similarly, this year, works are being taken up in an effort to reduce accidents,” explained a source in the department.", 
    "section": "national", 
    "title": "Road works taken up across State", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}