{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Second hand car dealers have been, of late, feeling the heat of competition from online websites specialising in free classified advertisements.\n\nDealers in the district say the impact has been perceptible over the last one year. Customers stand to gain as the websites provide a platform for buyers and sellers to transact directly, without having to shell out commission to brokers.\n\nThere are a handful of dealers owning sheds to display used cars. But, there should be not less than 300 brokers, according to the dealers. The Brokers and Dealers Association formed seven years ago functioned only for two years, due to a lack of understanding created by cut-throat competition amongst the members themselves, sources said.\n\nBrokers, dealers say, are now utilising the websites to their benefit. They post the advertisements of the cars belonging to their clients, most times even with the knowledge of the latter, and, after finding buyers online, charge two per cent commission from both ends.\n\nThere will be no scope for the buyers to know the identity of the sellers, their antecedents, or the condition of the cars, according to Jaishankar, Proprietor of Kumar Cars that has been in the business of buying and selling second hand cars for over two decades.\n\nThe dealers, he said, also utilise the websites for identifying sellers and purchase the cars, to sell them to customers they have cultivated through word of mouth after revamping its condition. While the dealers have a mechanism for determining the authenticity of documents of the cars they purchase responding to advertisements posted in the websites, first-time online buyers cannot rule out the risk of purchasing stolen cars with forged documents, Mr. Jaishankar said.\n\nOne section of buyers depend on dealers as there will be a degree of guarantee to the condition of the cars they buy.\n\nNevertheless, the volume of transactions of the second hand car dealers has come down considerably, and there is no indication for early reversal of the trend, the dealers admit.", 
    "section": "national", 
    "title": "Second hand car dealers face heat", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}