{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A group of senior sitizens from Achankundram near Alangulam who came to submit a petition to the Collector's office in Tirunelveli on Monday.Photo: A. SHAIKMOHIDEEN\n\nA group of senior citizens from Lakshmipuram and Achankundram near Alangulam submitted a petition to Collector M. Karunakaran here on Monday seeking old age pension.\n\nThe petitioners said that they were abandoned by their children and relatives and finding it difficult to eke out a living without any income. The living conditions of mentally ill senior citizens were still worse.\n\nIf they were given old age pension, it would ensure at least two meals a day, they said. The said that a primary health centre should be established in their village so that getting medical assistance would be easy.\n\nQuality of road\n\nOn behalf of Desiya Murpokku Dravida Kazhagam, its Tirunelveli City district secretary A. Mohamed Ali submitted a petition seeking probe into alleged irregularities in the ongoing road re-laying work on S.N. High Road. Mr. Ali said that the badly damaged road was being laid without following stipulated norms.\n\n“The quality of road-laying is poor owing to irregularities. Hence, the Collector should order a probe and ensure laying of a quality road between Thiruvalluvar two-tier bridge and Tirunelveli Town,” he said.\n\n“Stray cattle raid fields”\n\nA group of farmers from Kurichi susbmitted a petition appealing to the Collector to save their paddy crop from raiding stray cattle. The petitioners said that the stray cattle, wandering along the roads during the day as the Corporation had not taken any measure to impound them, invaded their fields at night and caused damage to the crop.\n\n“Since the farmers have spent a lot of money towards fertilizers and pesticides for raising the crop, they suffer a heavy loss on account of the damage caused by the stray cattle. Hence, the Collector should instruct the Corporation to impound the stray cattle,” a farmer said.\n\nNarasinganallur panchayat president R. Vellaiyammal submitted a petition seeking better civic facilities, including drainage channel, bus shelters, toilets, cement road and community hall.\n\nTamil Nadu Manithaneya Makkal Munnetra Kazhagam office-bearer N. Umar Farooq submitted a petition seeking repairs to road connecting Thazhayoothu and Rastha. He said the repair work, which was started 10 days ago following agitations by the public, had been stalled without any reason, causing hardship to the aged, children and the pregnant women. Hence, the Collector should instruct the officials to resume the repair work, Mr. Umar said.", 
    "section": "national", 
    "title": "Senior citizens seek assistance", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}