{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“The government is now focussing on preventive measures to bring down infant mortality rate”\n\nDr. Traci Wolbrink of Harvard Medical School, Boston, USA, addressing a conference organised by Meenakshi Mission Hospital & Research Centre in Madurai on Monday.— Photo: S. James\n\nThe need for a systematic approach to paediatric intensive care was stressed during the two-day training programme inaugurated at Meenakshi Mission Hospital & Research Centre (MMHRC) here on Monday.\n\nDr. Ebor Jacob, Professor in Paediatric Intensive Care Unit (PICU) at the Christian Medical College (CMC), Vellore, said that adequate importance provided to paediatric intensive care could help in bringing down infant mortality rate (IMR), which was high in India compared to other countries.\n\n“The government is now focussing on preventive measures to bring down the IMR. However, importance should gradually be given to paediatric intensive care as well,” he said.\n\nSuperior approach\n\nHe added that even though Indian doctors were experienced in handling more number of infant cases compared to western countries, the process-oriented approach followed at the PICUs in western countries was superior.\n\n“As children, particularly infants, are more vulnerable than adults, no time should be wasted in diagnosis and providing life support at the PICUs,” he said.\n\nDr. Senthil Kumar from the PICU at Meenakshi Mission Hospital said that the course for the two-day training programme, titled ‘Paediatric Basic Assessment and Support in Intensive Care (BASIC)’, was originally designed by College of Intensive Care Medicine in Australia and endorsed by Chinese University of Hong Kong\n\nHands-on training\n\nApart from lectures, Dr. Kumar said that the programme also included hands-on training. The training was attended by paediatricians, postgraduate students, intensive care doctors and nurses.", 
    "section": "national", 
    "title": "Stress on systematic approach to paediatric intensive care", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}