{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Revenue authorities have sought a written explanation from a private sugar mill based in Sathyamangalam regarding a complaint from cane farmers that transportation charges were being deducted from the statutory Fair and Remunerative Price (FRP) of Rs. 2,300 per tonne fixed by the Central Government.\n\nA written explanation was asked for through a notice as the mill authorities have not replied to an oral instruction for allaying the apprehension of farmers. Late last month, the sugar mill was already under instruction from the District Revenue Officer told to pay Rs. 2,300 per tonne in full to the farmers in the wake of an impasse over the preparedness of the industry to pay only Rs. 1,900 per tonne.\n\nThe District Revenue Officer, R. Satheesh. who held a tripartite meeting involving the mill officials and farmers’ representatives gave them 15 days to comply with the FRP norms, to avoid legal action. But, the mill did not give any commitment to that effect, it is learnt.\n\nSubsequently, the farmers had reportedly been informed by the mill that Rs. 92.80 per tonne would be deducted towards transport from the procurement cost.\n\nThe mill had reportedly justified its act reasoning out that the levy of transport charge was inevitable beyond a 10 km radius. Farmers are not prepared to buy this line of thinking. Having sought and obtained an extension of the command area, the onus was on the mill to meet the entire transport cost from the farm to the crushing centre, Subi Thalapathy, representative of Thadapalli-Arakankottai Ayacut Farmers’ Association said.\n\nAgriculture Department sources said the mill had made a partial settlement of dues to farmers, a few days back. Both the private mills in the district, the other based at Aapakodal, have come under severe criticism from farmers for refusing to pay the State Advisory Price. In addition to the FRP, the State Government had fixed Rs. 350, inclusive of Rs. 100 towards transport, as the SAP.\n\nThe farmers are incensed since the mills have not only failed to pay the SAP along with the FRP, but are also attempting to accentuate losses to farmers by deducting the transport charges out of FRP.\n\nFarmers have been complaining that both the private mills have not factored in the revenue generated from sale of by-products: ethanol and power.\n\nSugar mills are expected to settle dues to cultivators within 14 days of procuring the last load from their farms. Beyond that, the mills would be required to pay interest of 15 per cent on the outstanding amount.\n\nBut, farmers in the district have been waiting for months together to receive their outstanding amounts, leave alone the interest component.\n\nThe mill had made partial settlement of dues to\n\nfarmers, a few\n\ndays back", 
    "section": "national", 
    "title": "Sugar mill served notice for deducting transport charges for cane procurement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}