{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The National Fish Workers Forum on Monday urged the Union Government to take immediate steps to release 94 Indian fishermen who have been languishing in prisons in Sri Lanka.\n\nSpeaking to reporters here on Monday, M. Ilango, former MLA and chairperson of National Fish Workers Forum (NFF) said that the incidents of arrest of Indian fishermen was continuing unabated and the Union Government was remaining silent on the issue.\n\nAs many 94 Indian fishermen were detained and 70 boats were still in the custody of the Sri Lankan government. The fishermen have been unable to spend time with their family during Christmas and New Year.\n\nThe inordinate delay in their release could create a Law and Order problem in the coastal villages, he said.\n\nMr. Ilango said that three rounds of bilateral talks were held by the previous United Progressive Alliance (UPA) government to resolve the issue.\n\nBut after the BJP led National Democratic Alliance (NDA) government assumed office no steps were taken to hold talks.\n\nMost of the fishermen had availed themselves of private loans at high rates of interest to purchase boats and other assets. Their debt burden had further increased as the boats valued at Rs.40 crore had not been released so far.\n\nThe Sri Lankan Government has constituted a committee comprising fishermen representatives and officials from the Fisheries,\n\nDefence and External Affairs Ministries and is making necessary arrangements for the next level of bilateral talks.\n\nThe Indian Government should also take necessary steps and arrange a meeting between the fishermen of the two countries, officials of Tamil Nadu and Puducherry and the North and East provinces in Sri Lanka and find a solution to the problems faced by them through dialogue by this month.\n\nMr. Ilango said that fishermen representatives from the East and North provinces of Sri Lanka were keen to find a permanent solution to the issue during discussions he had with them at a South Asia level workshop in Colombo recently. The Centre should now find a lasting solution to the vexatious issue to ensure that the fishing community continued with their vocation.", 
    "section": "national", 
    "title": "‘Take steps to release fishermen’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}