{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam: Sri Hanuman Jayanthi, Manyu suddha homam, pavamana suddha homam, South Chithrai Street, Srirangam, 7 a.m.; Harvayu stuthi parayanam, 9.30 a.m.; krithiga parayanam, 4 p.m.; nadaswaram concert by Thirukarukavur T.D.S.Gowri Shankar-T.D.S.Balasankar & party, 5 p.m.; violin concert by T.V.Ramanujacharyalu-T.V.Ramapriya & party, 7 p.m.\n\nSri Andavan Ashram, Srirangam: Tirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha: Tirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Tirumala Tirupati Devasthanam: Tirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai: Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Lakshmi Narayana Swamy Sannidhi, Melur Road, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Rama Nama parayanam, 62, Thiruvalluvar Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nRotary Club of Tiruchi Midtown: Dr. V. Karpagam, consultant psychiatrist, speaks on “Uravugal”, Hotel Sangam, 7 p.m.\n\nSeethalakshmi Ramaswami College Department of Computer Science: Seminar on “advanced networking concepts” by G. Swaminathan, Technical Head, CMS Info Systems Ltd., speaks, 10 a.m.\n\nSt. Joseph’s College: National workshop on “Big data analytics and business intelligence”, 10 a.m.; valedictory, K.A. Jayakumar, Controller of Examinations, SJC, distributes certificates, 4 p.m.\n\nSaranathan College of Engineering and Yokogawa India Ltd: Workshop on “DCS and FF Overview”, Udhayakumar and Ramkumar, resource persons, 9.30 a.m.\n\nM.A.M. College of Engineering: Faculty development programme on “prefabricated structures, 9.30 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}