{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Say move will ruin livelihood for residents of 64 villages\n\nVillagers from various places in Vilathikulam taluk staged a demonstration in front of the Collectorate here on Monday, in protest against the government’s proposal to establishg a sand quarry on Vaippar river.\n\nThe protestors said that the proposed quarry would seriously affect their livelihood since the river was the only source for drinking water and irrigation for 64 villages. P. Shanmugaraj of Sithavinayakampatti said that Madras High Court of the Madurai Bench had passed an order not to establish sand quarry on the river in response to a writ petition filed by Karunakaran, a former Village Administrative Officer, on April 27, 2005. However, in defiance of the court order, preliminary works had started for establishing a quarry on the Vaippar.\n\nIn 2004, sand quarrying was carried out on the river on a large scale with the aid of earthmovers. Large quantities of sand was lifted and transported by government and private parties. Hence, the illegal acts were taken to the attention of the High Court, he added.\n\nK. Vedhamanickam of Velidupatti said that leave alone agriculture, the villagers were hard-pressed to get even drinking water. Last summer, a pot of water was bought for Rs. 18, he said. S. Narayanan of the same village said that Vaippar was their lifeline as was their only source for drinking water. There were 25 borewells and several pumping stations on the Vaippar, he added.\n\nVedhamani of Sithavinayakampatti said that when their fear of the quarry proposal was taken to the notice of officials concerned, they said that it would start functioning only after the government gave its approval.\n\nIf the quarry started functioning despite their strong objections, they would surrender their family cards and there would be no other alternative but to migrate from their villages, he said.\n\nThe villagers submitted a petition to Collector M. Ravikumar.", 
    "section": "national", 
    "title": "Villagers against sand quarry on Vaippar", 
    "subsection": "tamilnadu", 
    "date": "2016-01-05"
}