{
    "author": [
        "City Bureau"
    ], 
    "text": "Biologically, Piyush Doshi would be turning 52 soon. But officially, he would be turning only 13. Being a leaper — someone born on February 29 — helps one maintain the notion of eternal youth. “Everybody around me seems to be excited about my birthday — even more than I am — for it comes only once in four years,” says Doshi, a businessman and a resident of Purasawalkam.\n\nWhenever his birthday finally heaves into sight, preparations for it begin a month in advance, which include signing up an orchestra group and booking a hall at a star hotel.\n\n“I am a great fan of Mohammed Rafi and Kishore Kumar. This year, I am having an orchestra from Kerala performing at my birthday party for which over 120 guests are invited,” he says.\n\nSucharita Anand was born just four minutes into February 29 and became a leaper. “Some of my friends wish me on February 28 and some on March 1 and my parents and grandparents wish me on my star birthday. So, it is an extended celebration,” says Sucharita, who turns 40 and is officially celebrating her 10th birthday.\n\nR. Preetha, a class XI student, was at first upset that she was unable to celebrate her birthday annually unlike her friends who would distribute birthday goodies every year.\n\nHer parents started celebrating her horoscope birthday every year.\n\n“My parents make me happy celebrating my birthday on two days,” says Preetha.\n\nSai Kumar doesn’t think being a leaper comes with any advantages. For this 20-year-old, the inability to celebrate his birthday every year is a big disappointment.\n\n“My family celebrates my birthday on March 1, but it is always low-key. The midnight calls, treats and outings are the things I miss. When friends call, they wish me a ‘happy fake birthday’,” he says.\n\nBut, come the leap year, birthday celebrations are four times grander.\n\n“Friends, who never wish otherwise, land up at my house. A surprise party is also planned,” says Sai. It is an extended two-day celebration for 27-year-old Tasleem too. “I was born in Saudi Arabia on February 29 at 10.30 p.m. It was March 1 in India, which has a time gap of two-and-a-half-hours. So every year, I celebrate my birthday on March 1.”\n\n(Reporting by Liffy Thomas, K. Sarumathi, L. Kanthimathi and D. Madhavan)\n\nWhen they finally turn up, the birthdays of those born on February 29 are extra special. Meet some of the city’s ‘leapers’ and learn about their plans\n\nfor the big day", 
    "section": "national", 
    "title": "A giant leap in celebrations", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}