{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As part of Chennai Photo Biennale, photographs have been displayed at public places\n\nIt came as a whiff of fresh air for the commuters at Light House MRTS station — the photos were striking and seemed to redeem the defaced walls.\n\nAs part of Chennai Photo Biennale, jointly organised by Goethe-Institut Chennai and Travelling Lens, photographs have been displayed at public spaces and art galleries across the city.\n\nThe Urban Water exhibition at the Light House MRTS station saw the works of 15 photographers from across the country, who came to the city as part of a workshop during the floods in December and captured some defining images.\n\nVarun Gupta, co-organiser of the Chennai Photo Biennale, said the decision to choose public spaces was aimed at taking art to a wider audience.\n\n“The response at the station was fabulous today. Art in public spaces makes a huge difference and helps in reaching out to people from all walks of life,” Mr. Gupta added.\n\nDelhi Photo Festival at Lalit Kala Akedemi comprised works of photographers like Kishor Parekh, Olivier Culmann and Raghu Rai, he said.\n\n“Apart from this, there was an exhibition — ‘Surrealistic by Nature’ — at Nageswara Rao Park on Sunday where works of photographers like Cristina De Middel and Denis Dailleux were put up,” he said.\n\nPhotographs are also displayed at Apparao, Art Houz and Focus.\n\nThese exhibitions will be on till 13 March. Entry is free.\n\nMore taking\n\nto cycling\n\nSuresh Mehta is a software professional who has been cycling all the way from his home at M.G.R. Nagar to his office in Taramani for the past one year.\n\nLike Mr. Mehta, there are many who cycle to work for health and fitness.\n\n“It is the most cost-effective and healthy means of travel. You only have to cover your face during rush hours,” he says.\n\nSeveral cycling clubs have come up in the city, organising long trails and marathons for cyclists.\n\n“I recently went on a 50-kilometre cycle ride to Mamallapuram with friends from this club. We are planning to go on another one soon. But we also travel every day to work on our cycles. Some of my colleagues too have taken this up,” says Siddharth Pachauri, another software professional.\n\nSeveral health and fitness experts across the world have recommended this low-impact exercise that helps improve focus, wellbeing and, most importantly, reduces stress levels.\n\n“I used to ride a bicycle till I was 60 years old, but had to give it up due to health reasons. But I keep encouraging my grandchildren to take it up seriously as it is the best and low-cost measure to ensure wellbeing,” sums up N Krishnamurthi, an 86-year-old retired teacher.\n\n(Reporting by Sunitha Sekar and Aditi. R)", 
    "section": "national", 
    "title": "Adding flavour to insipid spaces", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}