{
    "author": [
        "C Jaisankar"
    ], 
    "text": "I welcome the creation of new alternative road. But, it is insufficient to cater to a large number of vehicles\n\nhough the road users have welcomed the formation of alternative road from Mannarpuram to Viralimalai road junction, where the multiple Road Over Bridge is being constructed, they express concern that the arrangement is highly insufficient to cater to the need of large number of vehicles.\n\nA portion of the ROB being built at an estimate of about Rs.82 crore is likely to be opened for traffic in a few days from now. Since the works related to a portion from Dindigul Road to Railway Junction are almost over, the focus of the authorities has been shifted to the second portion, from Viralimalai road junction to Mannarpuram. The works are expected to gain momentum in the next few weeks. To facilitate the construction works, the authorities have created an alternative road from Mannarpuram to Viralimalai road junction along the alignment of ROB being constructed.\n\nThe new road has become a relief for the vehicle users, who want to go to Edamalaipatti Pudur from Mannarpuram.\n\nThe same road is also used for the vehicles originating from Edamalaipatti Pudur and Crawford to reach various destinations in the city via Mannarpuram. Since two-way traffic is allowed on a narrow road, it is experiencing heavy vehicular traffic, leading to traffic snarl.\n\nThe vehicle users originating from Crawford area are feeling the pinch due to confusion over traffic diversion and insufficient space on alternative road.\n\n“I welcome the creation of new alternative road. But, it is insufficient to cater to a large number of vehicles,” said a resident of Mannarpuram.\n\nMany vehicle users are of the view that one more alternative road should be formed to ensure trouble free passage of vehicles from Viralimalai road junction to Mannarpuram.\n\nI welcome the creation of new alternative road. But, it is insufficient to cater to a large number of vehicles", 
    "section": "national", 
    "title": "Alternative road inadequate", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}