{
    "author": [], 
    "text": "Personnel sent SMS to top officers with name and phone number of caller without detailing the grievance\n\nA month after the launch of the Amma Call Centre, some staff members manning the toll free grievance redressal number 1100 appear clueless on escalating the people’s complaints to the right authority. This has led to some rather embarrassing moments for some top officials. It is learnt that some personnel at the call centre send an SMS to top officers of the department concerned in the respective districts with the name of the caller and his/her phone number without detailing the grievance that is sought to be redressed. But in some cases when the department officials get in touch with the complainant, they get to know that the grievance pertains to some other department. For instance, senior officers in a uniformed service department in the western region said that they even received complaints that pertain to the library and revenue departments. “We informed the call centre that it was not a matter that could be resolved by our department,” an officer said. He was clueless if the grievance was forwarded to the official concerned.\n\nElectoral alliances are still being formed and the Election Commission is yet to notify the dates for the Assembly election but some politicians have started luring voters with incentives in Dindigul. Some enthusiastic DMK functionaries have been distributing a set of saree and dhoti to voters in many villages. The idea seems to be to ensure that a regional satrap not just wins but also polls the maximum number of votes. Party functionaries are meeting every family in the earmarked villages and are handing over the gift packs personally to them.\n\nThe Congress, AIADMK and DMK have vied with each other in claiming credit for the implementation of the noon meal scheme in Tamil Nadu. Now the CPI has joined the bandwagon.\n\nThe other day at a press conference in Salem, CPI state secretary R Mutharasan said it was ‘Sinthanai Sirpi’ Singaravelar, one of the founding fathers of the Communist movement in the country, who laid the foundation stone for the scheme, even before Independence. According to him, as a Municipal councillor Singaravelar noticed depleting attendance in schools and learnt that poverty was the villain.\n\nAnother son is set to rise in the DMK in Madurai. P.T.R.P Thiagarajan, son of late Assembly Speaker P.T.R. Palanivelrajan, has decided to continue his family’s political legacy nearly a decade after his father’s death. An engineering graduate, who had had lived in the US for about 20 years and served in top positions in a few American companies, he has applied for a ticket to contest from Madurai Central. Incidentally, at a remembrance meeting to mark the 10th anniversary of P.T.R. Palanivelrajan, retired Supreme Court judge Justice AR Lakshmanan, urged him to take up the unfinished task of his father.\n\nThe selection of a Vice Chancellor for the Madurai Kamaraj University, which has been headlines for several months now, is stuck with the resignation of Mu. Ramasamy from the three-members search committee. However, grapevine has it that his resignation is yet to be accepted and that desperate attempts are being made to get him back on board. In a bid to convince Mr. Ramasamy, persons considered close to him are apparently being approached by emissaries from a key person in the Ministry of Higher Education with assurances that names shortlisted by Mr. Ramasamy for the V-C post will be given preference.\n\n(Contributions from M.K. Ananth, Raju, Syed Muthahar Saqaf, L. Srikrishna and Pon Vasanth Arunachalam )", 
    "section": "national", 
    "title": "Call centre staff clueless on escalating complaints", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}