{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(From top) Collector Sajjansingh R. Chavan inspecting an exam hall in Nagercoil on Sunday. Candidates writing the exam at Palayamkottai. Job aspirants at a centre in Thoothukudi.— Photos: A. Shaikmohideen and N. Rajesh\n\nA total of 22,850 candidates appeared for the examination conducted by Tamil Nadu Public Service Commission (TNPSC) for the post of village administrative officer across Thoothukudi district.\n\nOf the 29,454 candidates who had applied for the exam, 6,604 applicants were absent.\n\nA total of 101 centres were formed at 83 locations in Thoothukudi, Ettayapuram, Kovilpatti, Ottapidaram, Sathankulam, Srivaikuntam, Tiruchendur and Vilathikulam. The district administration made necessary arrangements for candidates.\n\nCollector M. Ravikumar inspected a centre at The Vikasa School here.\n\nTirunelveli\n\nIn Tirunelveli district, 40,611 candidates wrote the exam. Of the total number of 52,353 candidates who had applied, 11,742 were absent. Collector M. Karunakaran inspected an exam hall at Shaffter Higher Secondary School in Tirunelveli.\n\nThe candidates sat for the exam at centres in Tirunelveli, Alangulam, Ambasamudram, Nanguneri, Palayamkottai, Radhapuram, Sankarankovil, Shencottah, Sivagiri, Tenkasi, Vallioor and V.K. Pudur, sources added.\n\nKanyakumari\n\nA total of 18,742 candidates appeared for the exam in Kanyakumari district on Sunday.\n\nA total of 6,388 candidates of the 25,130 who had applied for the exam did not write the exam.\n\nExaminations were conducted at 92 examination halls in 74 centres – 31 in Nagercoil, 4 in Kanyakumari, 24 in Kuzhithurai, 13 in Thuckalay and 2 in Thovalai.\n\nTen officials in the rank of Deputy Collector and 16 flying squads monitored the examinations.\n\nCollector Mr. Sajjansingh R. Chavan inspected the exam centres at Women’s Christian College and CSI Matriculation Higher Secondary School in Nagercoil.\n\nAgasteeswaram Tahsildar A.V. Murthy and revenue officials accompanied him.", 
    "section": "national", 
    "title": "Candidates write VAO examination in districts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}