{
    "author": [
        "V S"
    ], 
    "text": "Team Step Up dance company performing flash mob on NSR Road as part of 'Car Free Sundays’ an initiative of the Corporation of Coimbatore, and the Coimbatore Traffic Police, presented by The Hindu, in Coimbatore on Sunday. —Photo: M. Periasamy\n\nOn Sunday morning (February 28), the 800-metre stretch of NSR Road in Sai Baba Colony was all for the pedestrians and residents of the locality from 6 a.m. to 9 a.m. as it was Car- Free Sundays, an initiative of The Hindu in association with Coimbatore Corporation and city traffic police, on NSR Road.\n\nPedestrians, who never had or got the least priority on roads, took over the roads and were free from the fear of being knocked down by vehicles or the menace of blaring horns and suffocation caused by vehicular emission. The public used the space as they liked as the police cordoned off the stretch for vehicular traffic for three hours.\n\nThe Car Free Sundays initiative aims to re-route traffic temporarily for a few hours every Sunday morning and transform the stretch into a vibrant space where everyone can walk, jog, cycle, play, relax, meet friends, etc.\n\nCorporation Commissioner K. Vijayakarthikeyan said the initiative was to reclaim the road space for the residents for a few hours so that they could use it the way they want. The initiative reduces the carbon footprint, fear of accidents and pollution. Thanking the residents for turning up in good numbers, he exhorted them to extend their support for the event in the weeks to come. Even as the event began, groups of kids turned up with balls, bats, and stumps. Velraj, who was in his late sixties, was seen shaking legs competing with the two flash mob dances by Step Up dance team.‘Silambattam’ kept the urban audience spell bound; the photo expo by Osai on Save Mother Earth drew a huge crowd who waited patiently for their turn to look at the photographs, especially the ones on pollution; a team of experts imparted yoga training to the residents, and two artists who indulged in caricature and portrait sketching remained busy for the entire three hours; magic show by Vignesh Prabhu kept the audience spellbound; ‘Thappattam’ proved to be a crowd puller; students from SBOA School played the band at the start and marched through the stretch pausing at all the four zones - education, entertainment, games and fun.\n\nTattooing also drew a large number of fans. The Coimbatore District Chess Association had made arrangements for drawing enough number of chess players to display their skills on the traffic-free road.\n\nA skit by students of PSG College on Chennai floods won the appreciation of every one and three kids who were skating on the stretch drew the attention of many.\n\nMark 1 Events is the Event Manager and Radio City is the Radio partner. The three hour-long event recorded by Radio City will be aired on Friday as a prelude for the next Sunday and to listen to the capsule of the first Car Free Sunday just tune into 91.1.\n\nEvents conducted for the kids included running race, sack race, lemon and spoon, throw ball, skating, cycling and trampoline. It was a beeline by the tiny tots for their turn in the jumping castle.\n\nThe organisers plan to scale up the number of events and have also invited the residents who want to display their talent to register their names (individuals and teams) with Mr. Madhan of Mark 1 events 97150-63000.\n\n(with inputs from\n\nM. Soundariya Preetha)", 
    "section": "national", 
    "title": "Car- Free Sundays kicks off on NSR Road in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}