{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Chamber of Commerce and Industry has threatened to go on an agitation\n\nTerming the amendments made recently to the Tamil Nadu Value Added Tax (VAT) Act and Rules in relation to availing of input tax credit ‘detrimental to businesses’, Tamil Nadu Chamber of Commerce and Industry has threatened to go on an agitation if the changes were not withheld before March 7.\n\nAs per the TNVAT Act, ‘input tax’ was earlier defined as tax ‘paid or payable’ on capital goods bought from one seller by another seller who may, in turn, process the purchased goods and sell them to a third seller or an end-user. While doing so, the seller could avail imself of ‘input tax credit’ by subtracting ‘input tax’ from the total tax to be paid for the sale of the processed goods.\n\nHowever, in the amendment, definition of input tax has been modified from tax ‘paid or payable’ to just ‘paid.’ “With this simple change in definition, the government has made it difficult for businesses which operate mostly on credits,” said chamber’s senior president S. Rethinavelu. “It is customary to buy capital goods on credit and pay after the sale of finished goods, which may take a few weeks to months. So, how can we avail ourselves of input tax credit ? ” he asked.\n\nAccording to him, the TNVAT rules have no clear procedures to prove that input tax has been paid. “The amendment also says that assessing officer, however, can demand the proof whenever he feels it necessary,” he said.\n\ne-C Tax flaws\n\nThe chamber has also condemned the move to make all transactions related to commercial taxes payment online through the newly launched e-C Tax portal, “as it has flaws.”\n\n“Even the officers are not trained properly in the system. They are not able to provide clarifications. So what is the hurry in shifting everything online at one go?” Mr. Rethinavelu questioned.\n\n“Many small-scale entrepreneurs are not tech-savvy…,” he added.\n\nPointing at an issue with the system, he said that it allowed a mobile number and an email to be used for one company alone. “Many, including me, run more than one business. When all critical communications are to come through mobile and email, how can registration be restricted to one company?,” he asked.\n\nIncome Tax system provided an option to register 10 enterprises for one mobile number and email, he added.", 
    "section": "national", 
    "title": "“Changes in VAT rules detrimental to business”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}