{
    "author": [
        "R Srikanth"
    ], 
    "text": "Work has begun on a facility on Race Course Road in Guindy; it will have bus shelters and seats\n\nLand has been acquired from the Madras Race Club for the facility — Photo: M. Karunakaran\n\nThe Chennai Corporation is experimenting with the creation of model bus bays in an attempt to prevent traffic snarls at bus stops on congested roads in the city.\n\nThe Corporation has started work on one such bus bay on Race Course Road in Guindy even as it is in the process of creating a similar facility in Anna Square. This is based on a survey conducted along with Institute for Transportation and Development Policy, a non-governmental organisation on ways to ease traffic congestion in key locations.\n\nCorporation officials said after the traffic police diverted Metropolitan Transport Corporation (MTC) buses bound for Tambaram, Velachery and Porur through the Race Course Road to ease congestion on the Guindy flyover, traffic pile-ups would keep occurring whenever buses halted at the stop opposite Guindy railway station.\n\nTo ease the congestion, the Corporation not only proposes to widen the road but also build a dedicated bus bay, officials said, adding that land was acquired from the Madras Race Club. A bus bay is being constructed comprising bus shelters and seating arrangements for commuters in the space measuring 360 square metres, officials said.\n\nOfficials noted that exclusive sheltered bus bays at Central Railway Station, Guindy, Saidapet and Ekkaduthangal had helped in easing traffic congestion.\n\nMotorists have complained that in the absence of such dedicated facilities, buses halted on the carriage way, causing problems on several stretches such as Lattice Bridge Road, Adyar, Velachery, Tiruvanmiyur and Vadapalani.\n\nThe civic body has also decided to undertake a survey in association with ITDP on shortcomings in existing bus stops. As part of the study, the ITDP would be analysing five bus stops in Adyar (near Fortis Malar Hospital), Madhya Kailash, Velachery Main Road and Anna University.", 
    "section": "national", 
    "title": "Dedicated bus bays may ease congestion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}