{
    "author": [
        "Special Correspondent", 
        "M Soundariya Preetha"
    ], 
    "text": "General\n\nGanga Hospital, Round Tables and Ladies Circles of Coimbatore, Coimbatore City Police: Event on Project Road Safety, N. Ram, Chairman of Kasturi & Sons Ltd, chief guest, Rajendra Sports Hall, Stanes High School, 2 p.m.\n\nKarpagam College of Engineering: Start-up conclave, 10 a.m.; CIENCIA Fest’16, 9.30 a.m.\n\nKarpagam Academy of Higher Education: Workshop on modelling of Spreadsheets, 10 a.m.\n\nDr. GR Damodaran College of Science: 9{+t}{+h}Avtar International film festival, Kailash Auditorium, 10 a.m.\n\nPioneer College of Arts and Science: Workshop on Campus to Corporate, 10 a.m.\n\nGovernment Arts College: Clusters 2016, 9.30 a.m.\n\nCoimbatore Institute of Technology: Conference on energy, environment and engineering, Mylsamy Annadurai, Director of ISRO Satellite Centre, chief guest, 11 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Workshop on “Advanced IC Engines”, 10 a.m.\n\nSri Krishna College of Engineering and Technology: Lecture on “Quality Control Techniques in Foundry Industries”, 10.30 a.m.\n\nPSG Tech Alumni Association: Induction of diploma, UG and PG students and felicitation of Mylsamy Annadurai, Director – ISRO Satellite Centre, 3 p.m.\n\nEnglish Language Teachers’ Association of India, Coimbatore chapter: Meeting, PSG Sarvajana Higher Secondary School, 4.30 p.m.\n\nThe Coimbatore Productivity Council: Training on PF and ESI records maintenance, 9.30 a.m.\n\nCMA: Lecture on “How to Stay Calm During Difficult Situations”, 6.30 p.m.\n\nGKNM Hospital: Diabetic footcare and treatment clinic, 2 p.m.\n\nAxis Bank: Re-location of Trichy Road branch, K. Vijayakarthikeyan, Commissioner of Coimbatore Corporation, chief guest, 9 a.m.\n\nCentral Ground Water Board: Inauguration of workshop and training on Jal Kranti Abhiyan, Archana Patnaik, District Collector, chief guest, TNAU Campus, 10 a.m.", 
    "section": "national", 
    "title": "Engagements. Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}