{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Karur Medical College Hospital Dean Revwathy Kailairajan, right, and Additional Superintendent of Police S.V. Maha Bharathi, second from right, interacting with a patient at Netravathi Hospice and Palliative Care Centre, which was inaugurated in Madurai on Sunday.Photo: R. Ashok\n\nPalliative care units should be opened in every government hospital, said Revwathy Kailairajan, Dean, Karur Medical College Hospital, while inaugurating Nethravathi Pain and Palliative Care and Rehabilitation Centre at Kadachanendal here on Sunday.\n\nCiting the example of Kanyakumari Government Medical College Hospital where an old building had been modified as a palliative care unit, Dr. Revwathy said that the same should be replicated in all hospitals. “The government is considering proposals in this regard. I hope the initiative is launched across the State soon,” she said.\n\nPointing out that palliative care remained a neglected field owing to which a large number of the terminally-ill, particularly cancer patients, with none to care were left to suffer, Dr. Revwathy appreciated a young group of doctors who had come together to start the centre.\n\nThe 12-bed facility has been started by seven doctors practicing in Madurai and surrounding regions. R. Balagurusamy, one of the founders, said that care would be provided free of cost to the destitute. “If a family wants to admit a member and are willing to pay, we will charge a nominal fee,” Dr. Balagurusamy said. He added that it would gradually be upgraded to a 30-bed centre.\n\nAdditional Superintendent of Police Maha Bharathi, who took part in the inauguration ceremony, assured all possible help from the police to the centre. L. Amuthan, Member of Madura College board, participated.", 
    "section": "national", 
    "title": "“Every Government Hospital should have a palliative care unit”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}