{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Holy flag being hoisted at Sri Ramanathaswamy Temple at Rameswaram on Sunday.— Photo: L. Balachandar\n\nThe 12-day Maha Sivarathri festival began at Sri Ramanathaswamy Temple here with flag hoisting on Sunday.\n\nHundreds of devotees witnessed the ceremony conducted in ‘Mesha lagnam’ between 9 a.m. and 10.30 a.m. amid chanting of mantras and rituals by temple gurukal Nambu Vaidya. Temple priest Ganapathy Raman would conduct ‘Sarva jadagam.’\n\nN. Kumaran Sethupathy, Thakkar of the temple, and S. Selvaraj, Joint Commissioner, were among those present at the flag hoisting ceremony. Maha Sivarathri fete would begin on the ninth day on March 7 with the procession of Swamy and Ambal in Indira Vimanam along the four streets of the temple.\n\nK. Mayilvahanan, Assistant Divisional Engineer of the temple, said that after the car procession, Lord Ramanathaswamy and his consort Goddess Parvathavardhini Ambal would be taken out in ‘Golden Rishaba vahanam’ in a procession around noon to Agnitheertham seashore at the eastern entrance of the temple for ‘Theerthavari’.\n\nAfter Theerthavari and ‘Deepa Oli’ worship at the Agnitheertham, the idols would be brought back to the temple in the evening and the temple would remain open throughout the night for the devotees to offer worship.\n\nA special ‘Anna Abishekam’ would be performed around 11.30 p.m. on the occasion, he said.\n\nAs local people would prefer to visit temples of their family deities, sadhus and pilgrims from north India were expected to witness the Sivarathri on the night of March 7, he said.\n\nHowever, hundreds of devotees from all parts of the country would throng the temple for ‘Masi Amavasya’, the next day, he said. The festival would draw to a close on March 12, he added.\n\nThe temple authorities have made arrangements for drinking water and sanitary facilities.\n\nThe district police have made elaborate security arrangements and installed CCTV cameras at strategic points to regulate crowds during the festival.", 
    "section": "national", 
    "title": "Flag hoisted for Maha Sivarathri festival at Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}