{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "In an effort to inspire the present and future generations of foresters, the Tamil Nadu Forest Department has brought out a book – ‘Hall of Fame’, illuminating the life and work of 25 illustrious foresters of the past.\n\nThe book begins with Dr. Cleghorn, considered the father of scientific forestry in the country, right down to ‘Elephant Doctor’ V. Krishnamurthy and naturalist par excellence M. Krishnan.\n\nThrough these personalities, the book traces the forests’ history over a 160-year period. If you travel to the Tamil Nadu Forest Academy in Coimbatore, you may have to take the Cowley Brown Road, named after its founder principal.\n\nIts first Indian principal C.R. Ranganathan also finds a mention in the book for his outstanding working plans in Madras province. His theory of dual climax about montane sholas and grasslands is a pioneering one.\n\nIf you have been to the grave of Hugo Wood at Mt. Stuart at Anaimalais surrounded by teak, you might have seen the inscription ‘SI MONUMENTUM REQUIRIS CIRCUMSPICE’ meaning “If you want to see me, look around”. He had successfully carried out artificial regeneration method of teak.\n\nThe present-day foresters still refer to V.S. Krishnaswamy’s book, ‘Thoughts on Indian Forestry’ and T. Jayadev happens to be the forest chief with 17 years’ standing in the history of the forest department.\n\nThere are vignettes too. K. Andiappan, as an assistant conservator of forests, was responsible for the Javadis road scheme at Tiruppattur before independence. K Venkatakrishnan was the ‘Architect of Rubber Plantations’.\n\nT. Achaya the ‘Planter’ finds a place for his invaluable contributions to the development of tea plantations, particularly the TANTEA, and, Mohammed Ansar Badsha for his dedication to the formation and development of wildlife sanctuaries.\n\nThen there are others who were not part of the department. ‘Elephant Doctor’ Krishnamurthy, a veterinarian, had treated more than 3,000 elephants in his career, captured 160 wild elephants and treated them, oversaw the birth of 99 calves in captivity. He was the one to perform the first post-mortem on an elephant.\n\nM. Krishnan is known for his magical writing, delightful prose and original thinking and one who had great respect for natural history. What is not known is that he had conducted surveys for 14 States and their forest departments across the country in amazing detail and depth.\n\nOne cannot miss out on Richard Radcliff, the man who stood like a Banyan tree - protecting and nurturing the Nilgiri Wildlife Association for over 30 years or E.R.C Davidar, who fell in love with Ooty as a child and went on to do a pioneering work on the elephant corridors of the Nilgiris and Anaimalais “to preserve them in perpetuity”.\n\n“This is only the beginning and more such compilation will be brought out in future,” says a forest official involved in the project.\n\nThe book ‘Hall of Fame’ illuminates the life and\n\nwork of 25 TN foresters", 
    "section": "national", 
    "title": "Foresters who made a difference", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}