{
    "author": [
        "D Madhavan"
    ], 
    "text": "Work at the Konnur sub-registrar office has been hit due to internet issues\n\nIn the past fortnight, staff at the Konnur Sub-Registrar Office (SRO) on Fourth Main Road in SIDCO Nagar, Villivakkam had to regularly visit the nearest browsing centre to check the status of application forms.\n\nInternet connectivity issues plague Konnur SRO, forcing the staff, especially data entry operators, to often visit the browsing centres to check the number of applications for various documents. “Though connectivity was restored a few days ago, this is not the first time the server has crashed. Every time, we have to complain to the Chennai Collectorate where the private operator, who manages online government services, is based,” an official with the Department of Registration told The Hindu .\n\n30 applicants a day\n\nEvery day, on an average, around 30 applicants seeking documents to do with land and marriage registration among others visit the Konnur SRO after they register their applications online with the Department of Registration.\n\nThrough this online facility, applicants can get documents like encumbrance certificates (EC), marriage certificates, stamp vendors, circulars, society registrations, chit documents.\n\nFurther, applicants can also download public utility forms such as sale deeds and power of attorney documents.\n\n‘Work gets stalled’\n\nI have been visiting the Konnur SRO office every day for more than a week to get a marriage certificate but due to internet issues, my work keeps getting stalled,” said S. Vijayan of Nolambur.\n\nLocated off the Chennai-Tiruvallur High (CTH) Road, the Konnur SRO was opened in November 1994 after the bifurcation of the Ambattur registration office.\n\nThe existing online facility was introduced in the Konnur SRO three years ago to bring about hassle-free registration of land.\n\nPoor infrastructure\n\nOfficials blamed last year’s rains for the connectivity issues and said they would soon set it right.\n\nThe Konnur SRO also functions from a dilapidated, rented premises and lacks basic facilities like seating and lighting arrangements.\n\nThe SRO covers areas like Mannurpet, Villivakkam, Nolambur, Mogappair and Pattaravakkam.\n\n“ A 25-cent plot of land in Nolambur has been allotted for permanent building. However, the project has not taken off due to lack of funds,” said an official.", 
    "section": "national", 
    "title": "Glitches mar online registration", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}