{
    "author": [], 
    "text": "(Clockwise from top left) A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, distributing a certificate to a student at National College in Tiruchi; students of A.V.C. College of Engineering at Mayiladuthurai receiving certificates at the annual sports meet; Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, giving away a certificate to D. Elakiya, the first-rank holder, at the Cauvery College for Women in Tiruchi; a State-level workshop in progress at Nehru Memorial College, Tiruchi; Students participating in an inter-school drawing competition in Tiruchi.— Photos: M. Srinath and B.Velankanni Raj\n\n(Clockwise from top left) A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, distributing a certificate to a student at National College in Tiruchi; students of A.V.C. College of Engineering at Mayiladuthurai receiving certificates at the annual sports meet; Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, giving away a certificate to D. Elakiya, the first-rank holder, at the Cauvery College for Women in Tiruchi; a State-level workshop in progress at Nehru Memorial College, Tiruchi; Students participating in an inter-school drawing competition in Tiruchi.— Photos: M. Srinath and B.Velankanni Raj\n\n(Clockwise from top left) A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, distributing a certificate to a student at National College in Tiruchi; students of A.V.C. College of Engineering at Mayiladuthurai receiving certificates at the annual sports meet; Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, giving away a certificate to D. Elakiya, the first-rank holder, at the Cauvery College for Women in Tiruchi; a State-level workshop in progress at Nehru Memorial College, Tiruchi; Students participating in an inter-school drawing competition in Tiruchi.— Photos: M. Srinath and B.Velankanni Raj\n\n(Clockwise from top left) A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, distributing a certificate to a student at National College in Tiruchi; students of A.V.C. College of Engineering at Mayiladuthurai receiving certificates at the annual sports meet; Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, giving away a certificate to D. Elakiya, the first-rank holder, at the Cauvery College for Women in Tiruchi; a State-level workshop in progress at Nehru Memorial College, Tiruchi; Students participating in an inter-school drawing competition in Tiruchi.— Photos: M. Srinath and B.Velankanni Raj\n\n(Clockwise from top left) A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, distributing a certificate to a student at National College in Tiruchi; students of A.V.C. College of Engineering at Mayiladuthurai receiving certificates at the annual sports meet; Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, giving away a certificate to D. Elakiya, the first-rank holder, at the Cauvery College for Women in Tiruchi; a State-level workshop in progress at Nehru Memorial College, Tiruchi; Students participating in an inter-school drawing competition in Tiruchi.— Photos: M. Srinath and B.Velankanni Raj\n\n“Education is the fulcrum of life, peace, progress and development. It provides seedlings for culture and civilization. It is a passport to freedom and liberty and a higher calling in life,” A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, said in his Graduation Day address at National College. He elaborated on the education and skill development programmes implemented by the Union government in recent years. The Global Initiative of Academic Networks (GIAN), among others, assumes significance with its global sweep. Besides, a series of steps for accreditation and ranking systems aim at transforming the Indian educational scenario and to set it firmly on a relentless pursuit of excellence. Six hundred candidates were awarded degrees and 300 in absentia. K. Raghunathan, secretary of the college, K. Anbarasu, Principal, and R. Sundhararaman, Controller of Examinations, were present.\n\nDegrees handed over\n\nOver 1,575 graduates and post graduates, including 71 university rank holders, received their degrees at the Graduation Day of Cauvery College for Women. Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, Sriperumbudur, was the chief guest. V. Ramanathan, secretary, college governing council, and V. Sujatha, Principal, were present.\n\nDrawing contest\n\nAbout 325 students from various schools in and around Tiruchi took part in ‘Pictura’16,’ an inter-school drawing competition, organised by the Department of Visual Communication, Holy Cross College. The competition was conducted under three categories – “Sceneries” (for primary level), “Save Planet Earth” (for secondary level), and “India 20-20” (for higher secondary level). J. Margaret Suganthi, head of the department, and J. Josephine, Professor, spoke.\n\nWorkshop\n\nAround 100 participants from various colleges took part in a two-day workshop on “Code Yourself with PYTHON,” organised by the PG and Research Department of Computer Science of Nehru Memorial College. Pon. Balasubramanian, president of the college, inaugurated the workshop. The workshop was conducted by the faculty members of the college. S.T. Rajan, Associate Professor, Department of Computer Science, St. Joseph’s College, in his valedictory address, said that both teachers and students have to constantly update their knowledge. Prizes were given to the winners of the software contest organised by Code Venture, a student voluntary association.\n\nSports meet\n\nContinuous practice could only help reach goals in sports, said R. Natarajan, former international athlete and Superintendent, Customs, Chennai, speaking at the annual sports meet of A.V.C. College of Engineering, Mayiladuthurai. He gave away prizes to the winners. G.V. Raghavan, member, board of management, presided.\n\nGlobal meet\n\nExperts from various fields elaborated on disaster management and mitigation during an international conference hosted by the National Institute of Technology, Tiruchi. S. Gomathinayagam, Director General, National Institute of Wind Energy, in his inaugural address at the international conference on “Disaster Mitigation and Management for Sustainable Development and Risk reduction (ICDMSDR’2016),” emphasised the need for awareness about threats of calamities and ways to manage them. Biswajeet Pradhan of University of Putra, Malaysia, S.A Sannasiraj of IIT Madras, R. Venkatesan of National Institute of Ocean Technology, Suman Karna, Recovery Specialist, Sangham Shrestha, Abdul Hakkam, Director, Disaster Study Centre, and Venkata Reddy of NIT, Surathkal, were present.\n\nPrizes distributed\n\nM.A.M. Business School and M.A.M. College of Engineering and Technology organised “TALGEN’16” for the first year students of both the institutions. B. Annette, Director, M.A.M. Business School, inaugurated the meet.\n\nEvents such as ‘business quiz,’ ‘Ad zap,’ ‘paper presentation,’ ‘business plan,’ and ‘best budding manager’ were conducted. Padmalatha Suresh, Adjunct Faculty, IIMK and Director, DMS Financial Services, gave away the prizes.\n\nSymposium\n\nThe Department of Computer Science, Deen College of Arts and Science, Mayiladuthurai, organised a symposium “BITS Fest 2016.” S. Muthukumar, Director, inaugurated the event. It attracted participants from various colleges. V. Sivakumar, Director, Cambridge English School, gave away the prizes.\n\nFocus on biodiversity\n\nThe Department of Biotechnology, Periyar Maniammai University, Thanjavur, organised an international conference on biodiversity and biotechnology with Department of Biotechnology, Bharathidasan University, Tiruchi. The meet was inaugurated by V. M. Muthukumar, Vice-Chancellor, Bharathidasan University. S. Sridharan, Registrar, Periyar Maniammai University, delivered the conference theme address on biodiversity and biotechnology. K. Murugan, Vice-Chancellor, Thiruvalluvar University, spoke on “Biodiversity and Conservation of Butterfly in the Western Ghats.” S. Sivaramakrishnan, conference secretary, outlined the themes of the meet. Delegates from Iran, Taiwan, South Korea and China participated and presented their findings. In addition, there were 150 participants from various universities and colleges from all over India. Various issues in biodiversity notably fish, birds, plants diversity in historically important “Samuthiram Lake” in Thanjavur were discussed. Registrar of Bharathidasan University C. Thiruchelvam delivered the valedictory address. N. Ramachandran, Vice-Chancellor, Periyar Maniammai University in his presidential address stressed the need for protection of biodiversity globally while taking care of basic requirements of common man.\n\nSoul of India in village\n\nPrime College of Architecture and Planning, Keexhvelur, Nagapattinam district, organised “Choriolpolis” meaning “Village City,” a national level symposium.\n\nIts focus was addressing the top five essentials of safety, education, healthcare, infrastructure and housing for living in a village. Pramod Gawari of New Delhi pointed out that “the soul of India lives in its villages and villages have a very beautiful and attractive lifestyle.” Villages form the base of the economic pyramid of India and are very much livable, he said. Subramani Prabhakaran, chairman of Prime Group of Institutions, and N. Govindaraj, Principal, were present. Students from over 10 colleges presented wall paintings, iconic sculptures using various elements.\n\nImportance of budget\n\nThe Gnanam School of Business, Sengipatti, Thanjavur district, conducted a workshop on “Macro economic indicators and pre-budget discussion.” Resource person Ramesh Subramani from the Institute for Finanancial Management and Research, Chennai, dealt with the basics of banking and its process, how the bank career would be and some important economic indicators that the bankers would focus on. He spoke on bank rate, financial inclusion and financial strategies for sustainable development. He explained some of the strategies with a real time stories. The second session was devoted to the annual budget and its various aspects that have a bearing on the common man, traders and other sections of society. He described the purpose of budget and its importance. The programme was attended by the Chairman of Gnanam School of Business S.P.Selvaraj and Chief Executive Officer S. P. S. Arul Doss, among others.\n\nSports Day\n\nThe Annual Sports Day was celebrated at the TANUVAS Veterinary College and Research Institute, Orathanadu, Thanjavur district, recently. Superintendent of Police, Civil Supplies CID, Madurai, P. Saminathan, distributed prizes to winners of various events. An alumnus of the institute, Namakkal, belonging to the 1987 batch of B.V.Sc. course, he said that losing or winning does not matter in sports but the happiness lies in participation as it develops the qualities of leadership, self-confidence, working in team, co-operation and is linked with good health, physical fitness and prevents many diseases.\n\nHe said a burning desire is the starting point of success. Veterinary students have ample job opportunities as the curriculum provided them vast avenues to work with. K. N. Selvakumar, Dean, Veterinary College and Research Institute, Orathanadu, spoke. He stated that participation in sports events improved productivity as it enhanced fitness of the individual. Earlier, S.Arunkumar, sports secretary, welcomed the gathering and presented the annual sports report. P.R.Bhuvanesh Kumar delivered a vote of thanks.\n\nContributed by\n\nL. Renganathan\n\nand G. Prasad", 
    "section": "national", 
    "title": "Graduation Day", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}