{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The State government promoted and reshuffled several IPS officers on Sunday.\n\nSantosh Kumar, Superintendent of Police (SP), Tamil Nadu Commando Force, Chennai, has been promoted as Deputy Inspector General of Police (DIG) and posted as Joint Commissioner of Police (JCP), West Zone, Greater Chennai Police, in the place of Najmul Hoda who has been posted as DIG, Kancheepuram range.\n\nS. Paner Selvam, DCP, Traffic, West, Greater Chennai Police, has been promoted and posted as DIG Tamil Nadu Uniformed Services Recruitment Board, Chennai.\n\nG.Karthikeyan, SP, Principal, Police Training College, Chennai, has been promoted as DIG, Dindigul range. K.Joshi Nirmal Kumar, DCP, Anna Nagar, Greater Chennai Police, has been promoted and posted as JCP, North Zone, Chennai, in place of R. Dhinakaran, who will take over as DIG, Tirunelveli range.\n\nThe present Tirunelveli DIG, T.S. Anbu, has been transferred and posted as JCP, South Zone, Greater Chennai Police in place of A. Arun who has been posted as DIG, Tiruchi range.\n\nP.Nagarajan, JCP, Traffic, South, Greater Chennai Police, has been posted as DIG Salem range, in place of Vidya Jayant Kulkarni who has been posted as DIG, CB-CID, Chennai.\n\nA. Kayalvizhi, SP, Tamil Nadu Uniformed Services Recruitment Board, Chennai, has been posted as SP, Chief Security Officer, Chennai Metro Rail Ltd. in place of K. Bhavaneeswari who has been promoted and posted as JCP, Traffic, South, Greater Chennai Police. Rupesh Kumar Meena, SP, Vigilance and Anti-corruption, Central Range, Chennai, has been posted as DCP, Anna Nagar, Chennai.\n\nS.Kapil Kumar Saratkar, Assistant IGP/Special Protection Group, Ministry of Home Affairs, has been promoted as DIG without prejudice to his deputation.\n\nSimilarly, N. Kannan, First Secretary, Embassy of India, Kathmandu, Nepal, and P.C. Thenmozhi, SP, Economic Offences Wing, Central Bureau of Investigation, Chennai, have been promoted as DIGs without prejudice to their deputation.", 
    "section": "national", 
    "title": "IPS officers promoted and transferred", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}