{
    "author": [
        "Deepu Sebastian Edmond"
    ], 
    "text": "Opinion among former justices divided on impeaching the controversial High Court judge\n\nOne of the three Madras High Court judges who were part of the collegium that recommended Justice C.S. Karnan’s appointment in 2009 says he regrets his decision and raises serious questions about the way the collegium system for judicial appointments functions.\n\nJustice P.K. Misra, chairperson of the Goa Human Rights Commission, said he did not even know Justice Karnan while recommending him for appointment.\n\n“I am extremely sorry that I was part of the collegium that recommended such a name. It was Justice Ganguly [Chief Justice A.K. Ganguly, who later went to the Supreme Court] who suggested his name. I said that I do not know him and he replied that he (Justice Karnan) is on the panel of the Central government counsel,” Mr. Misra told The Hindu over telephone.\n\nJustice Karnan has had a controversial tenure. He has complained twice to the National Scheduled Castes Commission about alleged insulting behaviour towards him by other judges, made other grave charges against his peers and recently stayed his own transfer to another high court. Subsequently, he wrote to the CJI acknowledging that he had “passed an erroneous order” due to mental frustration that led to loss of mental balance”.\n\nA case of misconduct\n\nMr. Misra said Justice Karnan’s actions amounted to misconduct. “If what is being reported about him in the media is correct – since I do not have first-hand access to information anymore – then it is a fit case for impeachment,” he said.\n\nUnder the Constitution, a High Court Judge can be removed only by impeachment on grounds of proven misbehaviour or incapacity.\n\nHowever, Mr. Misra – a former Chief Justice of the Patna High Court – admitted that he did not object to Justice Karnan’s appointment at the time of making his final recommendations. “I had not raised any dissent on Karnan. I had raised dissent about two others, whom I would prefer not to name…. Karnan had never appeared before me. When signing the formal letter of consent, I didn’t raise any objection,” he said.\n\nJustice A.K. Ganguly, then Chief Justice of the High Court and Justice S.J. Mukhopadhyay – later the Chief Justice of the Gujarat High Court - were the two other judges on the collegium. In a phone conversation with The Hindu , Mr. Ganguly said Justice Karnan had never appeared before him.\n\nWhen asked how he came to recommend his name, he said he had done so for purposes of social justice. “He was representing a particular caste that should have been represented in the choice of judges. Therefore, I thought he should be considered,” he said.\n\nMr. Ganguly – elevated to the Supreme Court before Justice Karnan was sworn in an Additional Judge on March 31, 2009 – said he knew Justice Karnan personally. He then added, “Not very personally. I don’t remember (how his name came up), after such a long time, I was there in 2008 – I don’t remember all the details.”\n\nNot for impeachment\n\nMr. Ganguly does not agree that it might be a case for impeachment. Justice Karnan, he thinks, may have exceeded his limits, but that itself was not ground enough for his removal. “He was a docile man. A very quiet kind of a person and a fairly able lawyer – as a lawyer, he was not bad,” Ganguly recalled.\n\n“He is otherwise not a bad person. He’s a fairly good man. I don’t know why he is doing all sorts of things. I have a soft corner for him. I still feel that he is misled and misguided. I am sure he is a man with good intentions,” Mr. Ganguly said.\n\nRetired judge, Justice K. Chandru, joins Mr. Misra in calling for the impeachment. “Transfer is not the solution to proved misbehaviour. Impeachment is the only alternative provided in the Constitution,” he said.\n\nJustice Karnan turned down a request for an interview for this story, citing ill health.\n\nThough not widely known among the legal fraternity at the time of his appointment, Justice Karnan had a fairly long stint as a lawyer. His elevation came after 24 years at the bar. He was legal adviser to the Madras Metro Water Supply and Sewerage Board from 1989, Government Advocate (Civil Suits) from 1991-1996 and Central Government Standing Counsel from 2006 till his elevation to the bench.\n\nSometime late in 2014, a memorandum signed by 20 judges of the High Court was sent to the Chief Justice of India against Justice Karnan. This newspaper has a copy of the undated letter. The complaint sought “a solution that would relieve the anguish and agony hitherto suffered by almost all the Judges of this High Court at the hands of this abovementioned Gentleman.” They prayed that the complaint should not the same fate as previous complaints by Chief Justice R.K. Agrawal and Acting CJ Satish K. Agnihotri.\n\nThe immediate provocation for the letter seems to be Justice Karnan’s conduct at an August 13, 2014 dinner at the State Judicial Academy to welcome the new Chief Justice Sanjay Kishan Kaul.\n\n“He went on taunting every Judge assembled at the Dinner Meet and challenged them to reply to his unwarranted and unpalatable questions, which no man of any eminence would even venture to think of,” the letter said.\n\nAlienated many\n\nHe seems to have alienated many in the High Court. “I defended the collegium system before a Parliamentary committee. But now I feel bad after seeing what he has done. I do not know why he is doing this,” said S. Prabakaran, co-chair of the Bar Council of India, and President of the Tamil Nadu Advocates’ Association.\n\nK. Arumugam, the founder and secretary-general of the All India Dr. B.R. Ambedkar Advocates’ Association, said his organisation will not support Justice Karnan.\n\n“I made my decision when I noted that on Ambedkar Jayanti, he was the only one who did not garland the statue of Ambedkar within the High Court premises,” he said.", 
    "section": "national", 
    "title": "Judge regrets recommending Karnan", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}