{
    "author": [], 
    "text": "Pet dogs are judged during the 2nd Open Show of Puducherry Canine Club and 110th and 111th Championship Shows of Madras Canine Club’s held in Puducherry recently.— Photo: S.S. Kumar\n\nOrganisers forgot to have a first-aid kit with them and faced the wrath of dog owners as one of the puppies was bitten by another dog\n\nWhen canines are participating in a show, it is also important to anticipate the problems that might arise. The veterinary block at The Madras Canine Club 110th and 111th Dog Show and 2nd Open Show of Puducherry Canine Club in Puducherry forgot to have a first-aid kit with them.\n\nThe organisers had to face the wrath of the dog owners as one of their puppies was bitten by another dog. There was no ice or first aid kit to stop the bleeding. The organisers had to seek help from other participants who had carried ice blocks with them to treat the injured puppy. An indigenous breed had bitten a foreign breed near the venue of Fatima Higher Secondary School.\n\nNearly 175 dogs participated in the Madras Canine Club 110th and 111th All Breeds Championship Dog Show and Puducherry 2nd Open Show on Sunday. Of these, 16 were indigenous breeds including Rajapalayam, Chippiparai, Combai, Caravan Hound and Mudhol Hound. “This is the second show in Puducherry. Besides, there were also rare breeds like Springer Spaniel, American Cocker Spaniel, Afghan Hounds and American Akita.\n\nEngrossed in chat\n\nPolice personnel who were on duty accompanying the Chief Minister N. Rangasamy at a Government function the other day caused eyebrows to raise when they were seen chatting at the venue even as Mr. Rangasamy was going ahead with his address.\n\nAdded to this, the police personnel were also not attentive even as the national anthem was being played at the end of the function. However, a few persons in the audience alerted them. The police personnel stood up along with the rest of the audience after being less attentive during the function.\n\nBy S. Senthalir and S. Prasad", 
    "section": "national", 
    "title": "Lack of preparedness exposed at Puducherry dog show", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}