{
    "author": [
        "K Raju"
    ], 
    "text": "In a first major step towards inter-linking rivers in the State, the 18th channel will be extended to a distance of 14.1 km in Bodi block. The new extension work will ultimately connect both Periyar and Kottakudi rivers in the district benefitting several villages, mostly in rain-fed areas of the district.\n\nExtension of the 18th channel to a distance of 14.1 km in Bodi block will be the first major step in the State in inter-linking rivers. The new extension work will ultimately connect both Periyar and Kottakudi rivers in the district benefiting several villages, mostly in rain-fed areas of the district.\n\nAt present, the 39 km-long 18th channel, which starts at head works of Vairavanar check dam in Uthamapalayam block and ends at Renganathapuram in Bodi taluk, has been used to fill up Periyar water in 44 irrigation tanks to recharge groundwater and to irrigate 4,614.25 acres at 13 villages indirectly.\n\nUnder the new scheme, the existing channel will be extended to a distance of 14.1 km at an estimated cost of Rs.52.8 crore and connected with Kovalinga River, a tributary to Kottakudi river that was already inter-linked with Vaigai river.\n\nOn completion of the project, this channel will interlink Kottakudi and Vaigai rivers with Periyar river. Water diverted from Periyar river at head works will ultimately reach Vaigai river through 18th channel and Kottakudi river after passing through dry belts of Bodi and Thevaram blocks. The new extension channel will be used to fill six major irrigation tanks, including Kattabommankulam, Kottaikulam, Kamaraja Boobala Samudram Kanmai, Kappanurani, Vannanurani and Sulapuram tank. Besides, 4,794.704 acres, mostly rain-fed areas in Bodinayakkanur, Thevaram, Pottipuram, Rasingapuram, Silamalai and Melasokkanathapuram will benefit.\n\nAbove all, 585 irrigation wells will also be recharged. Digging work commenced immediately after Chief Minister Jayalalithaa laid a foundation stone for this project through video conferencing on Saturday.\n\nAll necessary equipment and workforce were kept ready and the work would be done on a war footing to bring it to public use, said PWD officials.\n\nExtension of the 18th channel was a long-pending demand of farmers and its water will assure at least single crop in a year to farmers in this block.\n\nThe PWD has been releasing 296 cusecs of water per year in 18th channel to recharge tanks.\n\nMoreover, the new channel will feed domestic and wild animals as it passes along foot hills of Western Ghats.", 
    "section": "national", 
    "title": "Linking of rivers to help Theni farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}