{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple : Discourse on ‘Sithargalin Anmeegam’ by M. Ilango, Railway Colony, 5 p.m.\n\nPanniru Tirumurai Mandram : Discourse on ‘Sivagnana Botham’ by N.S. Sundararaman, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram : Discourse on ‘Kantha Puranam’ by A. Arumugam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nSwami Tatwananda Ashram : Gita class by Swami Samananda, Ayiram Vaisyar Primary School, South Avani Moola Street, 6.45 p.m.\n\nCULTURE\n\nTamil Isai Sangam : 41st annual Tamil music festival; Bharatanatyam by teachers and students of Rani Lady Meyyammai Achi Tamil Music College, 5.15 p.m.; debate moderated by S.S.M. Sundaram, 6.45 p.m.\n\nInternational Sivananda Yoga Vedanta Centre : Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya : Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nSri Aurobindo Mira Group of Educational Institutions : ‘SAM Utsav 2016,’ District Judge S. Sameena, chief guest, Sri Aurobindo Mira Matriculation Higher Secondary School, 4 p.m.\n\nNehru Yuva Kendra and PAALAM Centre : Inauguration of training programme on ‘Youth leadership and community development,’ PAALAM Centre, Gandhi Nagar, 10 a.m.\n\nFatima College : Release of documentary film ‘River Once’; S. Marimuthu, Superintending Engineer, TWAD Board; chief guest, Jubilee Hall, 10.30 a.m.\n\nAnna University Regional Campus : Department of Management Studies, workshop on Corporate Education by D.J.C. Barnes, former HR, Madura Coats, Madurai, Conference Hall, 10 a.m.\n\nK.L.N College of Information Technology : Inauguration of National Science Day celebration, R. Ramaraj, Head, Department of Physical Chemistry, Madurai Kamaraj University, chief guest, 10 a.m.\n\nN.M.S. Sermathai Vasan College for Women : 23rd Sports Day celebrations, S. Senthil Anandan, Regional Manager, Tamilnad Mercantile Bank, chief guest, S. Palanichamy Nadar-Chermathai Ammal playground, 10 a.m.\n\nSri Ramana Maharishi Matriculation School : 25th Silver Jubilee celebration awards nite, Pushpam Mahal, Anna Nagar, 5 p.m.\n\nVivekananda College : VIVECOM-2016, inter-collegiate meet, P. Ponnuchamy, Deputy Regional Manager, Central Bank of India, chief guest, AV Hall, 9.40 a.m.\n\nSubbalakshmi Lakshmipathy College of Science : Seminar on ‘Quality skill enhancement initiatives in higher educational institutions – role of IQAC,” 9.15 a.m.\n\nSaraswathi Narayanan College : Internal Quality Assurance Cell, release of news bulletin, 11.30 a.m.\n\nCSI College of Arts and Science for Women : Second day of week-long NSS camp; yoga practice, village visit and cultural programmes, Chettikulam, 10 a.m. to 8 p.m.\n\nSLS MAVMM Ayira Vaisyar College : Fine Arts Club competitions; M. Arunagiri, Principal, presides, Kallampatti, 2.30 p.m.\n\nAlcoholics Anonymous : Meeting, Holy Redeemers Church, near Periyar bus stand, 7 a.m.; Quality Care Hospital, Ellis Nagar, 7 p.m.; A.G. Church, Gomathipuram, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today for Feb 29 Monday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}