{
    "author": [
        "Special Correspondent"
    ], 
    "text": "More than three lakh pilgrims thronged the Mahamaham tank here on Sunday as he civic authorities struggled with the arrangements to meet the demands of teeming devotees that poured into the temple town.\n\nBeing the weekend holiday, Sunday saw pilgrims pile up at the tank since early in the morning and by afternoon the numbers had crossed the two lakh mark.\n\nAttendant problems including vehicle parking, traffic movement within the town limits, use of public conveniences including temporary toilets still haunted the pilgrims.\n\nWith word spreading that the spiritual effect of Mahamaham would last through the month of Masi up to Panguni Maham star, devotees are rushing to Kumbakonam and the weekend provided the perfect setting. The smooth conduct of rituals between February 13 and 22 had only emboldened the devotees to visit Kumbakonam.\n\nOver 45 lakh pilgrims had visited the town and the Mahamaham sacred spots during the peak festival period as per official estimates.\n\nOn Sunday, Superintendent of Police, Thanjavur, N.M. Mayilvahanan, arrived in Kumbakonam with a reasonable strength of police and regulated the pilgrims flow. There was more orderliness in the pilgrim movement to the tank and out of it during the day as compared to Saturday.\n\nHowever, several restaurants continued to fleece pilgrims with jacked up rates for food items and with the hotels and eateries teeming with outstation devotees, unbridled charging was the order of the day in many restaurants.\n\n“While officials claim that they were caught unawares on Saturday and Sunday, at least they must be ready for similar number of pilgrims in the weekends ahead. It’s awful that I had to pay Rs. 25 for a cup of watery coffee and four rank bad idlis for which they charged Rs. 40. We hope some officials would intervene and stop the loot,” remarks K. Sadashiva Shetty from Shimoga, Karnataka, who has brought his family to take dip in the Mahamaham tank.\n\nThere was a sizeable crowd in Portramarai tank and Chakra Padithurai bathing ghat on the banks of the Cauvery as well but the focal point of Mahamaham tank and the temples in its vicinity were filled with devotees.\n\nSpecial train and bus services having been withdrawn since February 25, outstation pilgrims found it difficult to enter and leave Kumbakonam.\n\nThose planning to visit the town by train were in for shock as milling crowds gathered and waited for trains in the Thanjavur Junction. Some who had purchased passenger service fare got them upgraded to express fare and left by Cholan Express in the morning and afternoon. Reports say of similar situations in Kumbakonam and Mayiladuthurai stations as well.", 
    "section": "national", 
    "title": "More and more pilgrims visit Mahamaham tank", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}