{
    "author": [
        "Special Correspondent"
    ], 
    "text": "1.35 lakh people have voluntarily asked for deletion from the list\n\nRajesh Lakhoni says the EC might provide some intimation to those in the “Shifted List”.\n\nThe Election Commission of India (EC) has so far identified over 6.47 lakh names for deletion from the electoral list. This includes more than 2.84 lakh voters who have died and 2.58 lakh multiple entries.\n\nInterestingly, 1.35 lakh people have voluntarily asked for deletion from the list under Form-7.\n\nOf this, 97,000 have been verified and the remaining are in the process of verification as part of the rolls purification drive, Chief Electoral Officer, Rajesh Lakhoni told The Hindu .\n\n“We are compiling all the cases of dead persons, comparing it with the list of deaths with the Chennai Corporation, municipalities and village administrative offices. This is cross-checked with the address of the voters. We have checked the addresses and the details and where it matched, we have sent it to the booth level officers for verification before deletion,” Mr. Lakhoni said.\n\nThe EC has also found a number of multiple entries of the same voters. The photos of these voters were matched using a software and was given to the booth level officers for verification, he said.\n\nMr. Lakhoni said the EC might provide some intimation for those in the “Shifted List” – people who have shifted from one area to another, but their names in the voters list remain unchanged. “If you have moved from area A to area B, and your name in the list remains in area A, the Election Commission might allow some kind of additional documentation to go and vote in area A,” he said.\n\nThe EC is also in the process of verifying the list provided by the DMK to check for names of deceased voters and duplicate voters.\n\nGoing the extra mile\n\nSeeking to take advantage of the momentum in its efforts on social media to get first-time voters to enrol and also in trying to ensure cent per cent voting, the EC will put out advertisements and campaigns in cinema halls during movie screenings across the State.\n\nWith the campaign by cricketer Ashwin on Twitter going viral, the EC is planning to work on more such campaigns during the T20 cricket World Cup that begins next month.", 
    "section": "national", 
    "title": "More than 6.47 lakh names to be deleted from voter list", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}