{
    "author": [
        "B Kolappan"
    ], 
    "text": "Stalin rejects criticism of Suba Veerapandian that Vijayakant’s party lacks ideology\n\nEven as the DMK is hoping for a positive response from the DMDK, BJP leader and Union Minister Prakash Javadekar met Vijayakant at his residence in Chennai on Sunday. Tamil Nadu BJP president Tamilisai Soundarrajan accompanied him.— Photo: M.Vedhan\n\nWhile DMDK founder Vijayakant remains non-committal to the DMK’s overtures to strike an electoral alliance, the Dravidian major is not inclined to shut its doors on the actor’s party. The DMK is rather cautions in its approach towards Vijayakant although it acknowledges that talks between the parties have not progressed the way it should have in an election year.\n\nOn Sunday when senior BJP leaders including Prakash Javdekar called on Vijayakant in Chennai, DMK treasurer M K Stalin sought to distance his party from certain politically uncharitable comments made against the DMDK leader by Dravidian ideologue Suba Veerapandian.\n\nMr. Suba Veerapandian, who heads the Dravida Iyakka Tamilar Peravai and is a well known supporter of the DMK, had in a blog post penned on Saturday, accused Mr. Vijayakant of lacking in ideology as he was simultaneously holding talks with three political formations, including the DMK. Mr. Suba Veerapandian urged the DMK to contest in 200 Assembly seats, saying only such an announcement would galvanise the mood of the party cadre.\n\nHowever, when asked about these comments, Mr. Stalin categorically said, “It is his personal opinion and the DMK does not share it.”\n\nThe DMK, clearly, is not ready to write off Mr. Vijayakant as it believes that the coming together of the two parties will give them an edge over other political combinations. But the DMK had made it clear to the DMDK that power-sharing would not be possible.\n\n“We have conveyed that the DMK will certainly allot the DMDK more seats than it was given in the AIADMK alliance in the 2011 Assembly polls. Together, we can face the election,” said a senior DMK leader, who is also instrumental in opening the channels of communication with the DMDK.\n\nA DMK district secretary said his party had agreed to give the DMDK its due share even though opinion polls indicated substantial erosion in the vote bank of Mr. Vijayakant’s party.\n\n“Now the ball is in the DMDK’s court. It has to take a decision. We reiterate that it will benefit more from an alliance with the DMK than any other party,” the district secretary said.", 
    "section": "national", 
    "title": "No progress in DMK-DMDK talks", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}