{
    "author": [], 
    "text": "Clear the garbage\n\nIt is high time the government authorities reviewed the performance of Swatchada Corporation which has been entrusted the job of clearing garbage in various areas of Puducherry. It is doubtful whether the corporation has made any survey with regard to the quantum of garbage collected and removed area-wise. Previously, garbage was removed using tractor trailers but now the corporation uses small cartages and bucket vans in interior areas. But the manpower they have is inadequate. Their idea was that these vehicles should undertake many sorties to remove the garbage, streetwise. But it does not work. When tractor trailers were used, garbage was removed daily but now the corporation vehicles come once in two or three days and that too only after reminding them. Consequently there are mounds of garbage on streets. Hence, the government authorities concerned are requested to take necessary action for to maintain the town.\n\nD. Muthukumarasamy\n\nMohan Nagar, Puducherry\n\nNo to alliance\n\nPolitical parties should contest elections on their own without going for any alliance. This would help parties know where they stand. In case people vote for a coalition government, it would lead to the fall of the government which would either necessitate fresh polls or bring in some other alliance.\n\nPerformance of the parties while in power would be judged by the voters. People have witnessed how the how alliance governments did not last in power to complete the five year term. If it is possible the Election Commission can also come out with rules as it had been doing in respect of various other election related works to ban formation of alliances which is virtually an attempt on the part of the parties to take voters for granted.\n\nParties who were criticising their rivals all along are suddenly showing bonhomie and joining hands. In many instances, people vote for a candidate based on his performance and not to the party he represents. Hence, parties should not forge any alliance.\n\nS.Nadarajan\n\nJawahar Nagar, Puducherry\n\nClean Beach for Puducherry\n\nPeople in Puducherry dream of a clean beach, but in reality it is littered everywhere with plastic, paper, corn husk and discarded tins and bottles between the rocks in the beach. Though changing people’s attitude to maintain cleanliness in public places may take longer time, government should not give up the process of keeping the beach clean.\n\nHigh levels of particulate matter from construction and demolition activity affect the ambient air quality.\n\nHence it is requested that the government of Puducherry may ban the construction or demolition activity during in the morning along the beach road in order to reduce the particulate matter in the air. Similarly diesel vehicles may not be allowed during day time in the beach road to get the cleanest area tag.\n\nV. Ramalingam\n\nSri Ambal Nagar,\n\nThattanchavady Post,\n\nReaders can send their mails to pondy.thehindu@\n\ngmail.com and The Hindu, No. 135 Mission Street, I Floor, Puducherry 605 001", 
    "section": "national", 
    "title": "Page 3 28FEBPYSSM01 READERS MAIL 165713626", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}