{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Aurovillians celebrate the 48th anniversary of the township’s founding day\n\nSpiritual surge:Hundreds of Aurovilians and visitors gathered at the amphitheatre in front of the Matrimandir to celebrate the 48th anniversary of the founding of Auroville near Puducherry with a bonfire on Sunday.— Photo: S.S. Kumar\n\nThe bonfire burned bright in the wee hours of Sunday as Aurovillians celebrated the 48th anniversary of the founding of the universal township by The Mother.\n\nBy custom, the Auroville fraternity which now has members from across 53 countries, gathers for the pre-dawn bonfire ceremony on two special days of the year —February 28 to commemorate the founding of the City of Dawn by Mirra Alfassa, spiritual associate of Sri Aurobindo, on the day in 1968 and Sri Aurobindo’s birth anniversary on August 15.\n\nThis year saw an extraordinary turnout for Auroville’s dawn bonfire, which has always attracted non-Aurovillians, from casual visitors to school children. For participants, the bonfire offers a special moment of meditation and communion. The celebration is marked by playing a music score, the audio recording of The Mother’s address about Auroville’s founding principles, her vision of the experimental township being a place upon earth that no nation could claim as its sole property, a place where all human beings of goodwill, sincere in their aspiration, could live freely as citizens of the world.\n\nThe crux of the Auroville charter is also disseminated in French, English, Sanskrit and Tamil (the four official languages of the “City of Dawn”), which is essentially of being a place of an unending education and constant progress and representing a bridge between the past and the future.\n\nA special team at Matrimandir is in charge of the arrangements of the bonfire ceremony which takes place in the amphitheatre. Floral decorations deck the floor in front of the bud-shaped urn here that contains a handful of soil from the countries across the world that shared The Mother’s vision for a universal township, where in her own words, “men and women of all countries are able to live in peace and progressive harmony, above all creeds, all politics and all nationalities” and strive to achieve the higher purpose of human unity.", 
    "section": "national", 
    "title": "Pre-dawn bonfire, a special moment of meditation and communion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}