{
    "author": [
        "S Senthalir"
    ], 
    "text": "Jipmer and various NGOs observe International Childhood Cancer Awareness Day\n\nChildhood Cancer Survivors take part in an event organised as part of International Childhood Cancer Awareness Day on Beach Road in Puducherry on Sunday.— Photo: S.S. Kumar\n\nWith a golden ribbon pinned to their t-shirts, 60 children rallied from Kargil War Memorial to Dr.B.R. Ambedkar Memorial on beach road on Sunday evening.\n\nThe childhood cancer survivors, all below the age of 10, covering their mouth with mask created awareness about childhood cancer along with their caretakers.\n\nThe department of Medical Oncology, Regional Cancer Centre, Jipmer, along with NGOs like CanKids, Jiv Daya Foundation, The Rotary Club Beach Town and the Rotaract Club of Puducherry Veterinary College observed the International Childhood Cancer Awareness Day.\n\nPriya, mother of a childhood cancer survivor, had come from Villupuram with her four-year old child to participate in the rally. Her child was diagnosed with blood cancer when he was two-and-half years old. “The treatment is over and we are going for regular check up to Jipmer,” she said.\n\nNearly 146 childhood cancer patients were treated at Jipmer in the year 2014-15. Of which, 50 were diagnosed with blood caner, 14 were suffering from brain tumours, five had Neuroblastoma, 25 with Bone and soft tissue cancer, 22 children suffered from Lymphoma and the rest with other forms of cancer.\n\nIn the year 2012-13, 120 childhood cancer patients were treated in Jipmer, followed by 134 patients in 2013-14\n\nNearly 20-25 per cent of patients reached Jipmer at an advanced stage.\n\n“At least 80-90 per cent of childhood cancer is curable. However, only 30-40 per cent patients are cured in India. This is due to lack of awareness where most of the patients reach hospital only at an advanced stage of cancer,” said Gini Gulati, Director, National Outreach Project, CanKids… KidsCan, a charitable society working to create awareness on childhood cancer across the country.\n\nNearly 70 per cent of the children undergoing treatment for cancer are malnourished.\n\n“Treatment for cancer requires the patient to have good nutrition. But impoverished children find it difficult to cope with the treatment, leading to malnutrition and causing side effects,” said Dr. B. Vishnu Bhat, senior professor and Head of the Department of Neonatology and Dean (Research), Jipmer.\n\nHe added that there were many environmental factors that lead to cancer in children and malnutrition could be one of the indirect causes.\n\nThere are no studies to prove that malnutrition causes cancer. However, once the child is affected with cancer it does lead to malnutrition especially in children from below poverty line.\n\nMs. Gini Gulati underlined that government should provide free treatment for childhood cancer patients.\n\nShe added that the international theme for this year’s International Childhood Cancer Awareness Day is ‘Go Gold.’\n\n“Gold is to indicate that children are precious like gold and the healthcare for children should be considered so.”\n\nCanKids have scheduled a ‘Light it up gold Taj Mahal’ initiative in September with 5000 children from across the country.", 
    "section": "national", 
    "title": "Rallying to defeat childhood cancer", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}