{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Research says Tamil Nadu’s clean energy markets can go further as its renewable energy potential is close to 680 GW.picture used for representational purpose\n\nWith solar power companies finding it difficult to raise funds from banks, a proposal for creating a separate refinancing institution for renewable energy projects is being recommended by a taxation panel member of FICCI and will be presented by FICCI-Tamil Nadu State Council at the right forum.\n\n“We need a refinancing institution like a ‘Renewable Energy Refinance Corporation’ on the lines of NABARD. Wherever the gestation period exceeds a certain time period, there is a mismatch of assets and liabilities for the bank. We can mitigate that by refinancing,” S. Sankar, director, Corporate Advisory Group Pvt. Ltd., who is a part of FICCI’s taxation panel, told The Hindu on the sidelines of FICCI’s ‘Energy 16’.\n\n“Solar power projects face two big problems. The first is funding, the second is realisation on selling power to State electricity boards. With respect to realisation out of sale of energy, an escrow account mechanism can be worked out to have a win-win situation between the power generation companies and Discoms,” he said.\n\nK.E. Raghunathan, Managing Director, Solkar Solar Industry Ltd., said it would not be right to compare power purchase agreement pricing in different States. The pricing depends on various factors and cannot be uniform across the country.\n\n“The government has set a target of 100 GW of solar power in the next six years. In the past 30 years, we have achieved only 5 GW. The target for achieving 1,60,000 million units of electricity every year requires evacuation and transmission facilities. Who is going to invest in these,” he asked.\n\n“Tamil Nadu’s clean energy markets can go further — research shows that Tamil Nadu’s renewable energy potential is close to 680 GW, 85 times its current installed capacity and comparable with the U.S. fossil fuel power plant capacity of 781 GW in 2012,” M. Rafeeque Ahmed, Chairman, FICCI- TN State Council, said.", 
    "section": "national", 
    "title": "‘Refinancing institution for renewable energy needed’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}