{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The thrust of Indian diplomacy is to resolve differences through peaceful negotiations and the world should unite for effectively dealing with terrorism, emphasised retired Ambassador K. P. Fabian here on Saturday.\n\nDelivering a lecture at the Central University of Tamil Nadu on “India’s Foreign Policy: Options and Challenges,” he said how foreign policies were linked to economic development, price fluctuation, globalization and relationship with neighbouring countries. India has always been playing a significant role in shaping international relations.\n\nThe talk was co-hosted by the CUTN and the External Publicity and Public Diplomacy Division of the Ministry of External Affairs.\n\nAmbassador K. P. Fabian observed that India’s impact on the world for a more peaceful world order with less injustice and poverty would be even stronger. The government was actively engaged in improving relations with its neighbours keeping in mind the national interests. “India’s basic message is that differences should be resolved through peaceful negotiations and the whole world should be united in dealing effectively with terrorism,” he added.\n\nTracing the historical developments, he dwelt on the measures taken by India in the direction of world peace during the times of Jawaharlal Nehru and Indira Gandhi. Mr. Fabian had served in the Indian Foreign Service from 1964 till 2000 during which time he had worked in Madagascar, Austria, Iran, Sri Lanka, Finland, Canada, Qatar and Italy. His lecture was followed by an interactive session, in which the faculty, students and the public raised a few questions, mostly concerning Kashmir issue. Registrar of the University S. Bhuvaneswari presided. Academic consultant Dr. T. Jayaraman welcomed the gathering. Assistant Registrar B. Thiagarajan proposed a vote of thanks.", 
    "section": "national", 
    "title": "“Resolve differences through peaceful negotiations”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}