{
    "author": [
        "Staff Reporter"
    ], 
    "text": "AITUC cadre taking out a rally in Coimbatore on the concluding day of the 41st session of the trade union on Sunday. —Photo: S. Siva Saravanan\n\nThe All India Trade Union Congress (AITUC) on Sunday urged the Central Government to reverse the insurance reform agenda and to pursue people-oriented insurance policies. This was one of the resolutions adopted at the concluding day of the 41st session of the Union on Sunday.\n\nThe trade union also expressed concern over policies pursued by the Union Government in the name of telecom reforms.\n\nPrivatisation of gold mining was also opposed, while CBI probe was demanded on the alleged fraud of foreign currency derivatives.\n\nAITUC also passed a resolution to fight for the equality of women.\n\nCovering domestic workers under employees’ state insurance corporation and fixing minimum monthly pension of Rs. 3,000 for domestic workers and giving a share of Swachh Bharat Cess to conservancy workers were among the demands.\n\nTo protect the interest of fishery, beedi and coir workers, there should be increase in wage and work days under the National Rural Employment Guarantee Scheme by providing jobs in sectors such as plantation, cashew and coir.\n\nSmart City Project\n\nThe AITUC opposed the ‘Smart City Project’, stating that it looks like a project supporting the corporates.\n\nThe valedictory began with a rally from the Government College of Technology and concluded with a public meeting at Saibaba Colony.\n\nEarlier addressing reporters, AITUC secretary Amarjeet Kaur condemned the government for victimising those who raised their voice against BJP or the Sangh Parivar.\n\nShe said that the AITUC would organise demonstrations in support of JNU students’ union leader Kanhaiya Kumar.\n\nElected\n\nAs many as 42 office-bearers of the trade union were elected for three years from 2016 to 2018 at the session. Ramendra Kumar was elected as the national president. The other officer-bearers included H. Mahadevan (working president), Gurudad Das Gupta (general secretary) and N.P. Munjal (treasurer).", 
    "section": "national", 
    "title": "Review insurance reform agenda, AITUC to Centre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}