{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Five track renewal projects sanctioned at a total cost of Rs. 45.42 crore\n\nThough there is no announcement on new trains, development projects worth Rs. 304.48 crore have been sanctioned for Salem Railway Division in the recently presented Railway Budget.\n\nThis was apart from the announcement on survey for laying of new broad gauge line between Morappur and Dharmapuri and railway electrification work of Bengaluru - Omalur (via Hosur) under joint venture.\n\nThe budget has accorded priority to road safety works and level crossings in Salem Division. The Railway Ministry has announced the following nine road safety works and level crossing projects at an outlay of Rs. 190.30 crore:\n\nRemote Terminal Unit at inter-locked level crossing gates and strengthening of networking to Central Data Logger Server (Rs. 2.82 crore); integrated power supply for non-blanking of signals and earth leakage detectors at level crossings (Rs. 5 crore); Erode – Coimbatore - Podanur road over bridge in lieu of level- crossing with subway (Rs. 25.45 crore); Coimbatore - Mettupalayam road over bridge in lieu of level-crossing with subway (Rs. 24.22 crore); Coimbatore - Mettupalayam road over bridge in lieu of level crossing with subway (Rs. 26.02 crore); Coimbatore - Mettupalayam road over bridge in lieu of level crossing with subway (Rs. 26.68 crore); Vriddhachalam - Salem road over bridge in lieu of level crossing with subway (Rs. 23.60 crore); Coimbatore - Mettupalayam road over bridge in lieu of level crossing with subway (Rs. 24.75 crore); Minnampalli - Salem road over bridge in lieu of level crossing with subway (Rs. 25.20 crore); and Salem Vriddhachalam subways in lieu of three level crossing (Rs. 6.56 crore).\n\nThe Railway Budget has sanctioned five track renewal projects at a total cost of Rs. 45.42 crore.\n\nThe projects sanctioned are:\n\nErode – Irugur - Podanur for a distance of five km at an outlay of Rs. 4.55 crore; Jolarpettai - Erode Junction (12.9 km; Rs. 13.16 crore); Jolarpettai - Erode Junction (5.80 km; Rs. 5.91 crore); Jolarpettai - Erode Junction (19.95 km; Rs. 6.26 crore); and Salem Division - Renewal of Rail Joints- 256 sets (Rs. 15.52 crore).\n\nA couple of bridge works have been sanctioned to Salem Division at an outlay of Rs. 8.52 crore - replacement of steel girders with PSC slabs in bridge No.44 in Jolarpet - Erode section (Rs. 3.72 crore); and rebuilding RCC box in Jolarpettai - Erode section bridge (Rs. 4.80 crore).\n\nThe budget has allotted Rs. 7.40 crore for two signalling and telecommunication works – provision of non-blanking of signals (Rs. 3.92 crore); and provision of dual detection on girder bridges at various stations (Rs. 3.48 crore).\n\nThe Railway Ministry has also accorded priority to works in the Erode Electric Loco Shed and modernisation of Erode Yard with provision of concrete apron and crane, both at a total outlay of Rs. 33.73 crore. In the Erode Electric Loco Shed, works on augmentation of infrastructure facilities to increase holding from 175 to 200 locos have been sanctioned.\n\nThe budget has allotted funds for the replacement of quarters in Erode (Rs. 6.29 crore) and improvement of 600 staff quarters in the entire Salem Division (Rs. 12.82 crore).\n\nA.K.B. Krishnamurthy, vice-president, Salem Railway Users Forum, said that the Railway Minister has done justice to Salem Division by announcing various development works.\n\nHe pleaded for sincere steps for the execution of all the projects as per schedule.\n\nAs a first step, Mr. Krishnamurthy urged the Minister to increase the allocation for the implementation of the projects during the current year, as Rs. 1.63 crore was very meagre.", 
    "section": "national", 
    "title": "Salem Railway Division gets several projects", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}