{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Science Day Awards presented on the occasion of National Science Day\n\nScience education and research are meant for holistic development which includes internal, external and eternal peace as also for economic, social, cultural, spiritual and institutional prosperity, Director of National Assessment and Accreditation Council, D. P. Singh said here on Sunday.\n\nDelivering the National Science Day address and presenting the Science Day Awards, he stressed the need for senior scientists to encourage the youth to take up a career in science for the purpose of innovation with novelty, relevance and implementation.\n\nHe said the present state of science research at higher educational institutions and science education at school levels needed to be improved with more focus by the government and the industry.\n\nWith 59 per cent of secondary schools in the country not having an integrated science lab and with only 32 per cent of higher secondary schools having separate rooms for laboratories, science in schools must aim at reducing the gap between theory and practice, he noted.\n\nAt the research level, investment and output are far below those in advanced countries such as the United States, United Kingdom, China and Brazil, he observed.\n\nHe gave away the SASTRA-Obaid Siddiqi Award to K. Vijayraghavan, secretary, Department of Biotechnology, the SASTRA-G.N.Ramachandran Award to T. V. Ramakrishnan, Distinguished Associate, Indian Institute of Science, Bengaluru, and the SASTRA-CNR Rao Award to T. K. Chandraeskhar, former secretary, SERB and N. Sathyamurthy, Director of Indian Institute of Science Education and Research, Mohali.\n\nEach award winners were presented with a citation and a cash award of Rs. 5 lakh. Vice-Chancellor of Sastra University R.Sethuraman welcomed the gathering.", 
    "section": "national", 
    "title": "“Take up a career in science”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}