{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Knitwear manufacturers in Tirupur cluster are eyeing the North-East States in the country for major market expansion seeing the growing potential for apparels in the region.\n\nTo facilitate easy tapping of the markets there and reduce the marketing costs, the Sripuram Trust formed of different textile stakeholders in Tirupur cluster and NIFT-TEA Knitwear Institute are planning to enthuse the apparel producers in the cluster to utilise the e-portal which the two bodies are planning to host on the internet platform soon.\n\n“The markets for apparels made of ‘heavy GSM (grams per square metre) fabrics’ that could withstand the cool climates in the North East States such as Meghalaya, Manipur, Tripura and Arunachal Pradesh and fashion garments, are growing exponentially in tandem with the increase happening in the ratio of youth among the total population in those States,” pointed out T. R. Vijayakumar, coordinator of Sripuram Trust.\n\nSeeing the immense prospectives, even the knitwear exporters are showing the inclination to venture into the North-East region apart from the garment manufacturers in the cluster who had been into the domestic sales catering to the other parts of the country.\n\nPromotion of e-commerce route is going to help the knitwear manufacturers immensely as it drastically cut the cost of marketing otherwise could be incurred by travelling all the way to that region.\n\n“Knowledge of English is high in North-East States where some of them even have English as official language. People also use the internet well. However, we plan to host the product details on the portal in different regional languages too which will come in handy to generate awareness among other people,” said Raja M. Shanmugam, an apparel exporter and chief mentor of NIFT-TEA Institute.", 
    "section": "national", 
    "title": "Tirupur knitwear manufacturers look to North East States for market expansion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}