{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur : Theppam festival, Thayar purappadu from sanctum sanctorum, 6 p.m.; reaching theppam mandapam, 6.15 p.m.; purappadu from the mandapam, 8 p.m.; reaching sanctum sanctorum, 8.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Anjaneyar Sannidhi, Vasantha Nagar East, Srirangam, 6 p.m.; Sri Vasudeva Perumal Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6.45 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 6/16, II Cross Sundar Nagar, 6 p.m.\n\nGENERAL\n\nDistrict Administration : Public grievances meeting, K.S.Palanisamy, Collector, presides, Collector’s Office, 10 a.m.\n\nTiruchi Corporation : Civic grievances meeting, A.Jaya, Mayor, presides, Corporation Office, 11 a.m.\n\nBharathidasan University Centre for Study of Social Exclusive and Inclusive Policy : Valediction of national seminar on Inclusive policies in higher education in India, R.Christodas Gandhi, former additional chief secretary, chief guest, Khajamalai campus, 3.30 p.m.; Centre for Remote Sensing: Lecture on Coastal Geomorphology by P.Seralathan, 10.30 a.m.; lecture on Marine Geology by R.Jayakumar, 11.45 a.m.\n\nNational College : Nacotech – inter-collegiate technical symposium, Shanmugavadivu, Head, Department of MCA, Gandhigram University, inaugurates, 10.15 a.m.\n\nSeethalakshmi Ramaswami College : National Science Day, John Mohanraj speaks on ‘Energy: Today and Tomorrow,’ 2 p.m.\n\nJamal Mohamed College : Dr. P. Shahul Hameed Endowment Lecture on ‘Environmental science and technology’, P. A. Azeez, Director, Salim Ali Centre for Ornithology and Natural History, Coimbatore speaks on ‘Fetish for growth: challenges to sustainability’, Mohamed Shamsudin, Dean of Science, S. Mohamed Salique, Principal and others speak, Syed Hussainudeen Hall, 11 a.m.\n\nSrimad Andavan Arts and Science College : National Science Day, R.Mohan Kumar, Assistant Professor, Presidency College, speaks, 2 p.m.\n\nShri Angalamman College of Engineering and Technology : Lecture on Android and mobile application development by S.Imran Khan, director, TRR Technologies, 2 p.m.\n\nRotary Club of Tiruchi: Special address by M.R.Krishnan, Hotel Femina, 6.30 p.m.\n\nUrumu Dhanalakshmi College : National Science Day and valediction of Physics Association, R.Sambasivam, associate professor, speaks on Mission to Mars, 10 a.m.\n\nCauvery College of Engineering and Technology: Safety awareness programme, D.Jegan Narayan, Director, Vijay Institute of Safety Training, resource person, 10 a.m.\n\nM.A.M. College of Engineering : Department of Women’s Studies, Bharathidasan University and Tiruchi Obstetrics and Gynaecological Society, Srilakshmi, resource-person, speaks on ‘Adolescent health awareness for women’, M.A. Mohamed Nizam, secretary, inaugurates, S. Ravimaran, Principal, presides, 3-30 p.m.\n\nHallmark Business School : Union Budget – live discussion, 11 a.m.\n\nAIMAN College of Arts and Science for Women: Dental camp, 10.30 a.m.\n\nJamal Mohamed College Ayesha Girls Matriculation Higher Secondary School : Annual day, G. Shahul Hameed, Consultant Dental Surgeon, chief guest, distributes prizes, A. K. Khaja Nazeemudeen, secretary and correspondent, presides, R. Geetha, principal and others speak, Khaja Nagar, 5 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}