{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(From left) Collector N. Venkatachalam inspecting a TNSTC exam centre in Theni on Sunday. Collector T.N. Hariharan at a hall in Dindigul. Candidates writing VAO a exam at centre in Rameswaram on Sunday.— Photo: L. Balachandar\n\nCameras hooked on to the internet were fitted at centres that have 1,200 to 1,500 candidates\n\nAbout 76.31 per cent of the candidates who had applied in Theni district appeared for the Tamil Nadu Public Service Commission exam meant for the post of Village Administrative Officer on Sunday.\n\nA total of 20,631 candidates had applied, and 15,745 of them appeared for the exams in the morning. About 80.2 per cent of candidates appeared in Andipatti, 74.2 per cent in Theni, 79.22 per cent in Periyakulam, 76.03 per cent in Bodi and 75.15 per cent in Uthamapalayam.\n\nA total of 1,034 room supervisors, 74 centre monitoring officers and 14 flying squads monitored the exam. One police constable and a videographer were deputed to each centre to ensure transparency in the conduct of the examination, said Collector N. Venkatachalam after inspecting a centre in Theni.\n\nDindigul\n\nSeventy six per cent of candidates – 23,883 of the 31,423 candidates who had applied – sat for the exam in Dindigul district.\n\nTNPSC member R. Prathap Kumar and Collector T.N. Hariharan monitored the centres in the town. Eighty two centres had been established in seven blocks for conducting the exam, and 108 principal supervisors, 108 inspectors, and hundreds of room supervisors were deputed to monitor the centres.\n\nAll proceedings were videographed. Moreover, cameras hooked on to the internet were fitted at centres that have 1,200 to 1,500 candidates for effective monitoring.\n\nBesides, 20 special teams had been formed to collect answer sheets and bring them back to the strongrooms, the Collector said.\n\nRamanathapuram / Sivaganga\n\nA total of more than 27,000 have appeared and 8,311 absented for the Village Administrative Officers (VAOs) examination conducted by the Tamil Nadu Public Service Commission (TNPSC) on Sunay in the two districts amid tight vigil.\n\nIn all, 20,716 candidates were called to appear for the examination in Ramanathapuram district and 16,259 candidates appeared for the examinations held in Ramanathapuram, Kadaladi, Kamudhi, Mudukulathur, Paramakudi, Rameswaram and Thiruvadanai divisions. There were 4,457 absentees in the district.\n\nIn Sivagana, 15,385 candidates were sent hall tickets and 11,531 of them turned up the examination, while 3,854 absented. Ramanathapuram Collector S Natarajan and Sivaganga Collector S Malarvizhi inspected the examination by visiting some centres at the district headquarters.\n\nAs directed by the TNPSC, the district administrations, police and revenue officials made elaborate arrangements. The TNPSC pressed into service, vigilance and flying squads to ensure that the examination to recruit 813 VAOs was conducted in a fair manner and there were no malpractices.\n\nTNPSC Member M Sethuraman, who camped in Ramanathapuram district, expressed satisfaction over the arrangements. The district police had deputed a team to help the vigilance squads and revenue officials to close down browsing centres and Xerox shops, which were located near the examination centres and prevent any malpractice, he said.\n\nMr Sethuraman visited some of the centres in Paramakudi, Kamudhi and Mudukalathur on Saturday and inspected the arrangements. He visited the centres again on Sunday after supervising the despatching of question papers.\n\nHe was present at 7 45 am at the Treasury office at the district headquarters here and monitored the despatch of question papers to various centres. At his instruction, the Tamil Nadu State Transport Corporation plied special buses to the examination centres for the convenience of the candidates, he said.", 
    "section": "national", 
    "title": "VAO examination conducted in districts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}