{
    "author": [
        "R Rajaram"
    ], 
    "text": "A view of the under vehicle scanner at the main entrance of Tiruchi Railway Junction in Tiruchi.— Photo: B.Velankanni Raj\n\nA few months after it was put into operational use, the hi-tech Under Vehicle Scanners (UVS) at Tiruchi railway junction has become non-functional.\n\nProcured by the railway administration under the Integrated Security Scheme (ISS), the scanners have been gathering dust ever since it ceased to function a few months ago.\n\nCosting nearly Rs. 50 lakhs, the advanced equipment was procured, installed and put into use in September last year. While a scanner was installed at the main entrance, the other equipment was put in place at the Kallukuzhi second entry. Sources said the scanner at the main entrance failed to function from October while the one installed at the Kallukuzhi side ceased to work from December.\n\nTechnical snag is said to be the cause. The scanners were installed to monitor and look out for any foreign / hazardous objects hidden underneath four-wheelers before they approached the station’s entrance. The scanners were linked to a computer terminal installed inside pre-fabricated cabins established at both entrances of Tiruchi Junction.\n\nWhen the vehicle passed over the scanner installed a few metres below the ground, the images of the vehicle’s underneath would automatically appear on the monitor inside the cabin thereby enabling Railway Protection Force constables to find out if any foreign object was placed beneath the vehicle.\n\nAs part of the system, the surveillance cameras installed near the cabins used to capture the images of the registration number of the vehicle and that of the driver. A team of senior officers from the Intelligence Bureau and the Security Branch CID of the State Police that conducted a joint security audit at the Tiruchi Railway Junction to study the existing security measures in place and plug loopholes was conveyed about the non-functioning of the scanners during their detailed inspection of the station and its circulating area.\n\nThe sources said the technical fault would be attended soon. The UVS was among the mosaic of advanced security gadgets that were procured under the ISS to beef up security and surveillance at Tiruchi.\n\nThe ISS was conceived by the railway administration in the aftermath of the Mumbai terror attacks in November 2008. Tiruchi was one among the major stations in the country where the ISS was put in place to strengthen security measures.", 
    "section": "national", 
    "title": "Vehicle scanners at railway Junction non-functional", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}