{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A view of the tank which was declared open at Viswakudi near Perambalur on Saturday.\n\nThe Chief Minister Jayalalithaa, through video conferencing, inaugurated the tank at Viswakudi built at an estimate of Rs. 33.70 crore, including Rs. 7.23 crore sanctioned by the National Bank for Agriculture and Rural Development.\n\nBuilt across the Kallar in Veppanthattai block, the tank aims to harvest the jungle stream realised in the Semmalai and Pachamalai hills. The length of the embankment wall is 665 metre with a capacity to store 40.67 million cubic feet of water up to a depth of 10.30 metres.\n\nSoil erosion will be prevented due to setting up of boulders on the banks. The tank would ensure irrigational facility – directly and indirectly to a total area of 1,449.41 acres. Primarily it would ensure irrigation for the Vengalam tank ayacutdars for 421.41 acres, as the Vengalam ayacutdars are the direct beneficiaries of the Kallar for several centuries.\n\nSince the storage at the tank would stabilise the groundwater potential in the area, another 2,169 acres of dry land would be irrigated, indirectly, including 169 acres through wells. Prior to the project, jungle stream was not only wasted but also turned to be cause of havoc in the form of floods in the down stream villages. The Public Works Department executed the work.\n\nA release said the tank had started realising jungle water and the storage level started rising between October 5 and December 30 last year when the level stood at 8.5 metres with a capacity of 26.53 million cubic feet. The storage would benefit farmers of Thondamanthurai, Viswakudi, Annamangalam, Veppanthattai and Vengalam.\n\nS. Meenatchi, District Revenue Officer, R.P. Maruthairaja, Member of Parliament, R. Tamilsevan, MLA and S. Asokan, Chief Engineer, Public Works Department were present at a function held at the tank to mark its inauguration.", 
    "section": "national", 
    "title": "Viswakudi tank declared open", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}