{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Khwaja to pursue studies at KTH Royal Institute of Technology, Stockholm\n\nNeeraj Gupta, founder and CEO of Formulate IP presenting the scholarship award to Khwaja. Mohammed Kamal Khwaja, a final year B.Tech student of VIT University, was declared the first prize winner of the KTH Master's Challenge 2016 in Wireless Systems track.\n\nA final year B.Tech student of VIT University has been awarded a full scholarship to pursue master’s programme at KTH Royal Institute of Technology, Stockholm, Sweden. The scholarship came after he bagged the first prize at the KTH Master’s Challenge 2016 in Wireless Systems track.\n\nAs part of the challenge, Mohammed Kamal Khwaja, who is studying Electronics and Communication Engineering at VIT, went through a number of quizzes, essays and interviews. He was declared one of the top three students in India during December 2015. The positions of the top three prize winners were announced at a prize ceremony in Bengaluru, a press release said.\n\n“The KTH Master’s Challenge is a nation-wide competition organised by KTH Royal Institute of Technology. The competition has multiple rounds to test various skills and knowledge of students,” he said.\n\nHe added that the first prize winner was offered a full scholarship of INR 23,00,000 to pursue the master’s programme at KTH along with an internship opportunity at FormulateIP.\n\nKhwaja, who is currently pursuing his final year project at Singapore University of Technology and Design, said he was delighted to be declared the first prize winner, and as part of the prize, he has been awarded a two-year scholarship to pursue master’s studies at KTH.\n\nThe Wireless Systems programme, which is part of the Electrical and Electronic Engineering at KTH Royal Institute of Technology, Sweden, is ranked 16th in the world by the QS rankings 2015.\n\nKhwaja has also been offered an internship to work at FormulateIP - an intellectual property, innovation management and consulting firm co-founded by a KTH alumni.\n\nHe has pursued research internships at Hong Kong and Singapore. Presently, he is pursuing his final year semester project at Singapore as part of the Semester Abroad Programme offered by VIT.\n\nVIT Chancellor G. Viswanathan said their goal has always been to help students reach their full potential be it through academics or extra curricular activities, the release added.", 
    "section": "national", 
    "title": "VIT student bags full scholarship for master’s programme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}