{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A campaign titled ‘Vote for Ooty’ ahead of the ensuing Assembly elections was launched at a public meeting held in the tourist hill station on Friday.\n\nDharmalingam Venugopal of the Nilgiris Documentation Centre, who spearheads the ‘Vote for Ooty’ campaign, says that modern Ooty is 193 years old and Ooty as a municipality is 150 years old.\n\nAll along, the hill station had warmed the hearts of millions of visitors from India and outside with its pleasant weather and enchanting charm despite paying a heavy price for its benevolence.\n\nToday Udhagamandalam is nearing a breaking point. Its life supporting system is on the brink and the local population had to bear the burden of this degradation.\n\nPeople will now have to rally together to have a political voice of their own for future survival. ‘Vote for Ooty’ is an initiative towards this objective.\n\nSome of the areas the campaign focuses are: restoring the name of Ooty through consensus; developing a comprehensive plan to promote tourism in such a way that the hardship of the local people is kept to the minimum and benefits to them the maximum; obtaining maximum price for tea through value addition and market development; working towards the long pending demand of the Badaga community for ST status; seeking a plan to fulfil the requirements of the municipal area for the next 50 years in terms of water supply, roads, markets, open spaces, play grounds, parking etc; bringing about a consensus among stakeholders to resolve the HPF crisis; to turn the sports loving town into a centre of state, national and international sports and sporting events and finding a long term solution to man-animal conflict in the district.\n\nThe volunteers of ‘Vote for Ooty’ campaign will undertake a tour of the complete Ooty constituency to list out the ward/booth wise issues and needs of the people to prepare a comprehensive manifesto, he said.", 
    "section": "national", 
    "title": "‘Vote for Ooty’ campaign launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-29"
}