{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The effluent treatment plant coming up on the Aavin premises in Salem.– Photo: E. Lakshmi Narayanan\n\nThe Salem District Co-operative Milk Producers’ Union Limited has installed the most efficient and advanced system to treat the waste water generated from the milk processing unit at its head office at Sithanur here.\n\nThe trial run of the new facility is in progress at present.\n\nThe new facility has been set up as part of the Union’s corporate social responsibility towards sustainable socio-economical growth of farmers and protecting the environment.\n\nThe treatment plant at the Salem District Co-operative Milk Producers’ Union, established in 1983, and at present processing 5 – 10 lakh litres of milk daily, is designed by Pune-based United Envirotech Private Limited.\n\nThe plant has been designed to treat 10 lakh litres of waste water a day at an average COD (chemical oxygen demand) load of 3,500 mg / litre. The plant consists of pre-treatment such as screen chamber, fat remover and chemical doser, said K. Santhi, general manager of the Salem unit.\n\nThe pre-treated waste water is being treated in Anaerobic UASB Reactor as a primary treatment.\n\nThe waste water is further treated in Aerobic process by diffused aeration system.\n\nTo achieve the pollution control board norms of 30 mg / litre BOD (biochemical oxygen demand) tertiary treatment is provided.\n\nThe treated water is crystal clear and being used for farming and gardening.\n\nThe combined treatment process of Anaerobic followed by diffused aeration system saves substantial amount of electrical energy as compared to conventional process.\n\nThe treatment ensures clean environment, trouble-free operation and easy maintenance, the General Manager said.\n\nDuring the anaerobic treatment methane rich biogas is generated. This is being used in the boiler / canteen as fuel thereby saving fossil fuel and generating additional revenue for the union.", 
    "section": "national", 
    "title": "Aavin sets up own treatment plant in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}