{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "JIPMER to undertake more bone marrow transplants, launch more challenging form of allogenic transplants\n\nJIPMER Director S.C. Parija at the third anniversary of the Bone Marrow Transplant programme of the Institute—Photo: Special Arrangement\n\nJIPMER on Wednesday celebrated the third anniversary of its bone marrow transplant programme, using the occasion to review the past and to look ahead at expanding facilities.\n\nThe hematopoietic stem cell transplant (HSCT), commonly referred to as bone marrow transplant (BMT), was started in JIPMER in the Department of Medical Oncology in January 2013.\n\nCorresponding with a heightened general awareness about the indications and outcomes of BMT, growing experience and availability of essential financial support from the Tamil Nadu Chief Minister’s Comprehensive Insurance Scheme and other government schemes, JIPMER’s transplant numbers have been on the increase over the years.\n\nWhile the institution performed 11 procedures in 2013 and 14 in 2014, the number of BMTs clocked 20 last year. So far, till December 2015, the department has performed a cumulative total of 45 transplants, 39 autologous transplants and 6 allogenic transplants for various indications.\n\nThe department is now looking to ramp up facilities for undertaking more transplants and launch the more challenging form of allogenic transplants. Biswajit Dubashi, Associate Professor and Head of Medical Oncology, said that the current two-bedded BMT unit was well equipped with bio-safety laminar hood for sterile chemotherapy preparation and stem cell cryopreservation and deep freezer (-80 degree Celsius) for stem cell storage. The transplant rooms are also provided with laminar flow and HEPA filters for infection control.\n\nRecently, the BMT team opened a third room for transplants and is working on improving laboratory and other facilities — currently some investigations are outsourced to private centres.\n\nAlso, since April 2014, when it performed the first allogenic procedure for a seventeen year old girl with relapsed acute lymphoblastic leukemia, the BMT team has confined itself to using HLA-matched sibling donors.\n\nThe common indications for which autologous transplant were done are multiple myeloma, relapsed/refractory lymphoma and for allogeneic transplant, were high-risk acute leukemias, and aplastic anaemia. “However, autologous transplants are not effective in cases such as leukaemia where allogenic BMTs are the treatment of choice,” said Smita Kayal, Assistant Professor.\n\nIn terms of facilities, allogenic procedures, especially those involving an unrelated donor, require a higher level of sophistication and JIPMER was working towards it, she said.\n\nJIPMER Director S.C. Parija hoped that more patients benefit from this treatment modality as facilities for stem cell transplantation are expanded.\n\nAs the singular government hospital in the region doing bone marrow transplant, JIPMER arranges transplant-related requirements for many of its patients through various government health schemes and support from NGOs.\n\nOverall transplant outcome measures as occurrence of febrile neutropenia, organ toxicities, time to engraftment, duration of hospital stay, transplant related mortality are comparable to reports from other centres nationally and globally, he said.\n\n“On an average, 8-10 patients are on the wait list for BMT at any given time and we believe the additional room will help cut down this wait list,” he added.", 
    "section": "national", 
    "title": "BMT programme celebrates third anniversary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}