{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Residents want the waterbody to be restored on the lines of Retteri, Chetpet and Korattur lakes\n\notorists taking the Padi flyover are greeted by an arresting view of the Villivakkam lake. Over the years, the lake has deteriorated and is now covered with a thick mat of vegetation.\n\nHowever, residents still consider it beautiful and an asset to the neighbourhood. They are convinced that with some effort, the lake can be redeemed – and they have strong views on how it should be done.\n\nThese residents have been campaigning for the lake to be turned into an eco-tourism spot, along the lines of Retteri, Chetpet and Korattur lakes. Such a move, they argue, would give residents of Padi, Villkakkam, ICF and Ayanavaram a place to go to for relaxation and also ensure the protection of the lake.\n\n“We don’t have enough parks here. Making this lake an eco-tourism spot, just as Mangal Eri was, will meet a need,” said S. Srinivasan, a resident of High Court Colony.\n\nAt present, encroachments can be found along the bund along the Padi railway station. According to residents, mud excavated for several projects has been dumped into the waterbody.\n\nResidents say a rejuvenated Villivakkam lake will be of immense help to the areas around it. Residents of South High Court Colony, Villivakkam, believe that the recent flooding in areas like Sidco Nagar could have been minimised if the waterbody had been kept free of encroachments.\n\nMr. Srinivasan says: “I obtained a map from 1906 from the revenue department that shows the lake and its surplus channels. Now, the lake has largely shrunk in size and has been polluted by release of sewage. Surplus channels have also been encroached upon.”\n\nResidents demand that the boundary of the waterbody be demarcated and the surplus courses be defined to ensure that neighbouring areas are not affected. Removal of encroachments is a challenge for the Water Resources Department.\n\nAccording to WRD sources, the lake is also known as Konnur lake.\n\nThey say measures will be taken to rejuvenate the lake after the present projects to revive lakes in Ambattur, Korattur and Retteri are completed.", 
    "section": "national", 
    "title": "Can eco-tourism save Villivakkam lake?", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}