{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "The announcement made on Wednesday about the conduct of Tamil Nadu State Eligibility Test - 2016 (TNSET - 2016) has raised concerns among many aspirants, the foremost being the short notice given for the test.\n\nMother Teresa Women’s University (MTWU) in Kodaikanal has been designated as the nodal agency for conducting this year’s SET, the exam candidates should clear for getting posted as Assistant Professors in colleges in the State.\n\nThe issue started with confusion over the advertisement issued by the MTWU on Wednesday in which the examination date was wrongly mentioned as January 20. Though a correction was issued the next day with the correct examination date as Feb 21, candidates complain that 20 days was too short for the application process and preparation.\n\nThey point out that for the SET, conducted on the same lines as National Eligibility Test (NET), they should ideally have at least two months’ time between notification and exam. “In the last SET conducted in 2012 by Bharathiar University, there was adequate gap,” said M. Mahalakshmi, an aspirant.\n\nTNSET-2016 exam date also overlaps with the national-level Common Teacher Eligibility Test (CTET), thereby leaving those aspiring for both to choose either one.\n\nConcerns have also been raised about the high examination fee. The fees have been set as Rs. 1,500, Rs. 1,250 and Rs. 500 for General, BC/MBC and SC/ST candidates respectively whereas the fees for same categories for the NET conducted in December 2015 were just Rs. 600, Rs. 300 and Rs. 150 respectively.\n\nThe NET/SET Association also questions the need for conducting the exam in a hurry. “The issues with the results of the 2012 SET exams still remain unresolved. The SET-qualified candidates in large numbers are already waiting for appointment. So, what is the urgency for conducting the exam when the MTWU does not even have a Vice-Chancellor,” asked A.P. Nagarajan, secretary of the association.\n\nReacting to the concerns, Dr. N. Kala, Registrar, MTWU, says the university has decided the best dates possible for the exam. “We are committed to conduct of the exams without any hassles for candidates. Five thousand candidates have already applied. With respect to fee, only a nominal increase has been made compared to 2012 SET,” she adds.", 
    "section": "national", 
    "title": "Candidates concerned over TNSET announcement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}