{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Coracle operators have announced yet another ‘indefinite strike’ in what appears to be a festering stand-off with the district administration over safety norms in Hogenakkal.\n\nThe differences between the operators and the administration had been simmering ever since a slew of safety regulations were put in place to regiment coracle operations, following the coracle accident of August-end that claimed six persons.\n\nThe coracle operators have not been on the same page with the authorities, especially on four counts: passenger limit of four persons per coracle; weighing of passengers to ensure the cumulative weight does not exceed 350 kg; age limit of 10 years for children to be let on coracle; and the timing of 10 a.m. to 5 p.m. for operations.\n\nCoracle operators had alleged that the time-limit was restrictive especially during holidays, when the tourist traffic is high. They had already petitioned the district administration that weighing of each passenger before boarding and the filing of trip sheets as part of safety protocols were time-consuming cutting into the already-limited operating hours.\n\nDemanding that the operations be allowed to start at 7 a.m., the operators had called for bypassing the protocol of weighing of passengers, on the premise that it was unlikely for four passengers to outweigh the limit of 350 kg.\n\nAlso, the coracle lobby had also called for relaxing of age limit down to five years for children.\n\nThe differences had snow-balled over, when the operators decided to up their ante during the long-holiday weekend of Pongal. However, following assurances that talks would be held by January 19, the threat of strike was put on hold.\n\nNow, the coracle lobby has announced an ‘indefinite strike’ until their demands are met.", 
    "section": "national", 
    "title": "Coracle operators plan ‘indefinite strike’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}