{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Notices issued to 3,700 structures in Vellore two months ago\n\nThe Vellore Corporation has started to crack down on residential and commercial buildings that have been letting out excreta directly into open drains due to absence of septic tanks.\n\nIt had issued notices to 3,700 structures two months ago, and has started to plug the outlets.\n\nSurvey based on census\n\nIn its survey based on the 2011 Census, the Corporation identified a total of 12,772 houses that were discharging toilet waste directly into drains without constructing septic tanks. It also found that another 7,250 houses did not have toilets.\n\nCorporation’s Commissioner Janaki Raveendran said out of the 12,772 houses that violated rules by letting out human faeces into drains, 9,072 would be covered under the underground sewerage system project.\n\nShe said that discharging human faeces into drains was a violation, and engaging men to clean the drains was prohibited as per law.\n\nNotices issued to homes\n\n“We issued notices to the 3,700 houses two months ago asking them to construct septic tanks. They were informed that letting out toilet waste into drains was an offence as per law. As they continued to let out toilet waste into drains without constructing septic tanks, we have started to plug the outlets.\n\nOn January 18, the outlets of 21 houses in Salavanpet were plugged,” she said.\n\nThis work will continue, and all such outlets would be blocked in a phased manner by January 31.\n\nAnnouncements via public address system\n\n“We will make announcements via the public addressing system. We will also engage our staff in creating awareness on this issue,” Ms. Raveendran said.\n\nPublic can also pay and utilise the Corporation’s sullage tank vehicles to remove sullage from the septic tanks at a cost of Rs. 1,500.\n\nThe Prohibition of Employment as Manual Scavengers and Their Rehabilitation Act, 2013 prohibits persons from being engaged or employed for hazardous cleaning of sewers and septic tanks.\n\nPunishment for violators\n\nFirst time violations are punishable with imprisonment extending to one year or fine of up to Rs. 50,000 or both.\n\nSecond time violations were punishable with a fine of up to Rs. one lakh or two years imprisonment or both. Repeated offences will draw imprisonment extending to five years or fine up to Rs. five lakh or both.\n\nShe said they have started to receive applications from persons for the underground drainage connections.\n\nThe UGD project covering as many as 24 wards of the erstwhile Vellore Municipality area has been completed, she added. So far, they have received 156 applications for UGD connections.\n\nMeanwhile, the Corporation is going to construct 98 public toilets and 23 community toilets in its limits.\n\nFor households without toilets, Swachh Bharat Mission was providing a subsidy of Rs. 8,000 for construction of new toilets. Of this, Rs. 4,000 was provided by the Central government, while the State government and corporation gave Rs. 2,000 each, she said.\n\nPublic can use also the Corporation’s sullage tank vehicles to clean their septic tanks", 
    "section": "national", 
    "title": "Crackdown on buildings without septic tanks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}