{
    "author": [
        "Deepa H"
    ], 
    "text": "The names of the women were among the 200 short-listed by jury members under 20 categories.\n\nAt least eight women from Tamil Nadu will have lunch with President Pranab Mukherjee at Rashtrapati Bhavan on Friday .\n\nThey are among winners of the #100Women Achievers’ Contest organised by the Ministry of Women and Child Development, in collaboration with Facebook to recognise and acknowledge women who are making a difference in their communities across the country.\n\nTheir names were among the 200 short-listed by jury members under 20 categories. Facebook users then voted 100 women from the 200. And they are the women who have been working at various levels to empower women.\n\nChennai-based artist N. Swarnalatha says each incident of woman abuse brings her pain. “It affects me mentally and I translate the anguish into art. All the proceeds I get from selling my paintings goes towards supporting women,” she said.\n\nAcademician Shyama Ramani is trying her hand at improving sanitation in Kameshwaram, a fishing hamlet in Nagapattinam district through her organisation Friend In Need India Trust. “Now that we have constructed toilets and the people are using them, I am looking for a sustainable model to keep the village clean,” she said.\n\n“Every year in Sathyabama University we offer up to 500 seats free to the disabled and to children of army jawans,” says educationist Mariazeena Johnson.\n\nSaundarya Rajesh, Founder – President AVTAR Career Creators & FLEXI Careers India, who has championed the cause of career re-entry of women, says she plans to create greater awareness about the need for women professionals to pursue a career.\n\nVijayalakshmi Devarajan, who has nearly two decades of experience in human resource development, believes in empowering women from the lower income group. She conducts training sessions for young women on how to get through job interviews.\n\nCoimbatore-based Latha Sundaram has been contributing towards women and child empowerment through Aram Foundation Charitable Trust. “We teach girl children concepts of safe touch and also train them in self-defence. For college-going girls and working women we give awareness, self vigilance and self defence workshops,” she said.\n\n“We have imparted skill-based training for 4,000 persons using corporate funds. Our short-term courses are in plumbing, telecommunication, photography and electrician,” says Shima Sendhil, Director, Rathinam Group of Institutions.\n\nThey are winners of achievers’ contest held by Ministry of Women and Child Development", 
    "section": "national", 
    "title": "Eight TN women to have lunch with President today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}