{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Gandhigram Trust will guide SHG women to run the institution\n\nNEW DAWN:Rural women taking part in a workshop on ‘Peace, Justice and Women’ held at Gandhigram Trust at Gandhigram near Dindigul on Thursday.— PHOTO: G. Karthikeyan\n\nFederation for Peace and Justice for Women, a micro-level institution offering free legal aid and support to rural women, will be set up at Gandhigram shortly. Gandhigram Trust will act a catalyst to self-help group women to establish and run the federation, according to K. Shiva Kumar, Trust secretary.\n\nTalking to The Hindu here on Thursday, Mr. Shiva Kumar said that the trust would offer a place on the trust campus for the SHG women to set up the federation. “We will facilitate them by offering legal aid and other required services. Once they identify the village of operation, they will shift the federation office to the village,” he added.\n\nThe federation would also act as a platform for rural women to discuss about women-related issues at villages and help women come out of family and social disputes.\n\nA curriculum would also be drafted on peace and justice to be introduced in academic courses at colleges and schools. The draft would be sent to the University Grants Commission (UGC) and to National Council of Educational Research and Training (NCERT) for further action.\n\nGandhi King Centre would float a fortnightly e-journal on peace issues to propagate ideas of Mahatma Gandhi and Martin Luther King Jr. to bring peace and justice in society, he added.\n\nNarrating the pathetic condition of her village, Kamalapuram, SHG member T. Mary Ajitha said that liquor sale was at its peak in the village. Liquor was sold even in petty shops at four places. Her team fought with drinkers and liquor sellers and managed to close the shops. But they opened after a few weeks, she claimed.\n\nAnother SHG member, S. Asalai of Gandhigram, said that she fought for a Dalit woman who was abandoned by an officer in the rank of Assistant Educational Officer, and made him live with her after making their wedding legal. The woman could not even get community certificate for her son as the officer suppressed all evidences, she said. The new federation would strengthen the hands of the women SHG members in the struggle over women issues, they added.", 
    "section": "national", 
    "title": "Federation to offer free legal aid", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}