{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Pollution Control Board asks erring hospitals to abide by norms\n\nWith biomedical waste piling up in a few hospitals due to the failure of contractors to clear the waste during the Pongal holidays, the Tamil Nadu Pollution Control Board has asked erring hospitals to follow the established system for disposal of waste.\n\nOn Wednesday, a TNPCB team inspected the premises of the Voluntary Health Services, Taramani after a picture, reportedly of deer eating waste dumped there, went viral on social media.\n\nShravan Krishnan, an environmental activist, who shared the photographs on his Facebook page, said the waste looked liked bio-medical waste, and was a hazard to both humans and animals.\n\n“What seems to have happened is that someone down the line has, by mistake, dumped biomedical waste along with municipal solid waste. We have instructed the hospital not to repeat this.\n\nWe had put in place a system for disposal of waste and have reminded them to follow it,” said a TNPCB official.\n\nHospital authorities, however, insisted that this was a one-off situation. “We have an agreement with a company that comes in every day to pick up our biomedical waste.\n\nOn Pongal day it was not collected. A small amount of biomedical waste had gotten mixed up with the general waste. All of it was cleared immediately,” said hospital director J. Sarkar.\n\nGJ Multiclave, the contractor with whom the hospital has an agreement, claimed waste collection had been as per schedule: “We picked up waste from VHS all through the holidays – on January 15, we collected 4 bags, on the 16{+t}{+h}, 4 bags, on the 17{+t}{+h}, 5 bags and so on. On the 20{+t}{+h}, we collected 63 kg,” said P. Sivakumar of the company.\n\nThe hospital generates about 7-8 kg of biomedical waste per day, said V.S. Pradeep Kumar, its director, finance. “We have also just formulated a procedure to check how much waste is generated per day. We have an active system for disposal,” he said.\n\nDoes Pongal affect services?\n\nWhile several hospitals in the city said their biomedical waste had been collected even during the Pongal holidays, a few said theirs had not been picked up. Mohan Kameswaran, managing director of the Madras ENT Research Foundation, said they too, had a pile-up and faced difficulties. “Disease has no Pongal or any other festival so such services should not be stopped during the holidays,” he said. At G.G. Hospital in Nungambakkam, waste collection did not take place on January 15, said a hospital source.\n\nAt a hospital in Royapuram too, the biomedical waste had not been picked up for a few days, a doctor said. Sources at Tamil Nadu Waste Management Ltd., a division of Ramky Enviro Engineers said they had informed their hospital clients that Pongal and the following day would be holidays and collection would not take place.\n\n“Collection was done on Sunday and every day after that,” said a source.\n\nWhat the law says\n\nIn Tamil Nadu, the Biomedical Waste Management and Handling Rules, 1998 are enforced by the Tamil Nadu Pollution Control Board. The rules lay down the procedures for the management of such waste. Hospitals are supposed to use colour-coded bags to dispose of different items, which are then picked up by authorised companies for safe disposal.\n\nDharmesh Shah, a policy advisor with Zero Waste Europe, an organisation working on waste issues said the main problem was that while the rules exist, not all the staff at hospitals are aware of them. “Yellow bags for instance are for infectious waste. But the rules are not followed stringently and waste often gets mixed up. This is a regular practice – the segregation before disposal does not take place properly. The capacity of the companies that pick up the waste is also low – and there are many medical facilities in the city. Cases of hospital waste at the Kodangaiyur dump yard have also come up,” he said.\n\nHospitals directed to produce log-books\n\nActing on a recent petition before it, the Southern Bench of the National Green Tribunal on Monday directed all State-run and private hospitals in Chennai district to produce their log-books showing month-wise segregation of biomedical waste.\n\nThe petitioner had sought to know the details of the biomedical waste segregated in the 41 State-run hospitals and over 350 private hospitals within Chennai district, alleging there was lack of liquid biomedical waste treatment facilities in hospitals.", 
    "section": "national", 
    "title": "‘Follow biomedical waste rules’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}