{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has held that a person missing for long and not heard of for over seven years could be presumed to have died under Section 108 of Indian Evidence Act, 1872 only on the day after the completion of seven years.\n\nJustices V. Ramasubramanian and N. Kirubakaran passed the ruling while disagreeing with a view taken by a single judge of the High Court that a Tamil Nadu State Transport Corporation bus conductor should be considered to have died on the date when he went missing in May 1999 for settlement of terminal benefits to his legal heirs.\n\n‘Inherent danger’\n\n“There is an inherent danger in presuming that the date from which a person went missing could be taken to be the date of death. If it is so taken, many claims that could be made by his legal heirs would become barred by time despite the fact that the very presumption of death could be raised only after seven years from the date on which he was last heard of,” the bench said.\n\nPointing out that Section 108 should always be read along with Section 107, the judges stated that their combined reading would make it clear that whenever a question arose as to whether a person was alive or dead and it was proved by one of the parties to the case that he was alive within 30 years, then the burden of proving his death would squarely lie on the other party.\n\nHowever, “if it is proved that such person, despite being alive within 30 years, has not been heard of for seven years by those who would naturally have heard of him if he had been alive, the burden of proving that he is alive gets shifted to the person who affirms that he is alive…,” the judges said.\n\nGovt. rule\n\nThey also stated that the government had amended Tamil Nadu Pension Rules, 1972 in 1995 and provided for settlement of terminal benefits to legal heirs of missing government employees on receipt of ‘not-traceable’ certificate from police, and submission of an indemnity bond that the payment made could adjusted from dues payable to the government servant if he appeared later and made any claim.\n\n“We do not know whether a provision similar to Rule 49A of Tamil Nadu Pension Rules is available in the rules applicable to transport corporation employees… the logic behind Rule 49A is of universal application,” the judges observed before holding that the legal heirs of the missing bus conductor were anyway entitled to the terminal benefits.", 
    "section": "national", 
    "title": "HC ruling on ‘death’ of missing persons", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}