{
    "author": [
        "S Senthalir"
    ], 
    "text": "The tariff is fixed at Rs 10,000 per room for two people which includes food and accommodation\n\nThe houseboat will be 99-feet-long and 17-feet wide and has two decks.— Photo: Special Arrangement\n\nTourists going to Paradise Beach can enjoy a luxurious stay in a houseboat that will soon be put to service.\n\nThe houseboat comprises two decks. In the lower deck, there will be three A/C rooms attached with rest room, a dining hall and a kitchen. The upper deck will have space to conduct mini conference.\n\nMaking the announcement on Thursday, Tourism Minister P.Rajavelu said that the 99-feet-long and 17-feet wide houseboat will be introduced at the Chunnambar Boat House by this month end.\n\nPuducherry Tourism Development Corporation Limited had signed a memorandum of understanding (MoU) with the Mantra House Boat Private Limited last year to introduce house boat at Chunnambar. While the expenditure to build it would be taken up by Mantra House Boat Private Limited, the Corporation will allot 2400 sq feet of land for construction of hut like structure for the tourists who like to travel in that.\n\n“The interior of one room is designed in French style and the other two rooms on the lines of traditional Tamil style. The rooms will be fully furnished with TV and music player as well,” said R.Anu, director of Mantra House Boat Pvt Ltd.\n\nThe ticket rates are fixed at Rs 10,000 per room for two people which includes food and accommodation. For the conference hall, Rs 2000 per person would be charged. The conference hall can accommodate up to 50 people. “The cost of the project was estimated to be Rs 60 lakh but we had to spend up to Rs 70 lakh to complete building the houseboat. This is similar to the one in Alappuzha. People do not have to go to Alappuzha for a trip on houseboat, they can come to Chunnambar,” she added.\n\nThe houseboat will cover 4 km around Paradise Island. It will start the journey at 11 a.m. from the main land of Chunnambar Boat House. Passengers will be served tea or fruit juice on deck. The houseboat will reach Paradise Island by noon.\n\nPassengers will either be served vegetarian or non-vegetarian food, depending on their choice. The houseboat will have chefs. After lunch, passengers can take a short nap in their room or go to Paradise Island. By 3 p.m., the boat will continue its journey and it will be anchored at 6 p.m. The passengers can spend their night in the house boat. Next day, breakfast would be served on the deck and the house boat will return by 10.30 a.m.\n\nMr. Rajavelu said that house boat will have fire-fighting equipment, sufficient number of life jackets, medical facilities and expert swimmers for safety. This is an effort to promote tourism in Puducherry.\n\nThe corporation will get a minimum of Rs 20,000 per month or a maximum of Rs 45,000 if all the rooms are occupied throughout the month.", 
    "section": "national", 
    "title": "Houseboat at Chunnambar by month end", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}