{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Says he had not discharged his duty as per the statutes since his appointment\n\nThe Joint Action Council – Madurai Kamaraj University (JAC-MKU), a coalition of four teaching and non-teaching associations of the MKU, has written to Higher Education Secretary Apoorva urging that the tenure of the present Dean of the university’s College Development Council (CDC) should not be extended.\n\nIn a strongly worded letter to Ms. Apoorva, the JAC-MKU alleged that M. Rajiakodi, Dean of the CDC, had not discharged his duty as per the statutes ever since his appointment to the post in January 2013.\n\nMr. Rajiakodi, who worked with Pasumpon Muthuramalinga Thevar College, had earlier served as the Controller of Examinations of the MKU.\n\nPointing out that that the primary duty of the Dean was to guide the affiliated colleges in their development, the JAC-MKU stated that not a single meeting of the Principals of affiliated colleges or the CDC was convened during the tenure of Mr. Rajiakodi.\n\nIt urged that the provision available to extend the service of the Dean should be used only under extraordinary circumstances and not for everyone.\n\nThe council members also pointed out that a cheating case was filed against Mr. Rajiakodi at Nagamalai Pudukottai police station in December 2014 for allegedly accepting money from a person by promising him a job.\n\nDenies allegations\n\nWhen contacted, Mr. Rajiakodi denied the allegations that cases were pending against him.\n\nStressing that he had discharged his duties with utmost sincerity, Mr. Rajiakodi said that he did not want to comment further on the allegations, which he termed baseless.\n\n“Not a single meeting of the Principals of affiliated colleges or the CDC was convened during the tenure of\n\nMr. Rajiakodi”", 
    "section": "national", 
    "title": "JAC-MKU opposes extension of tenure for Dean", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}