{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Chief Minister Jayalalithaa on Thursday launched a full frontal attack on the authority of the Karnataka government to move the Supreme Court against her acquittal in a disproportionate assets case, labelling it as an “interference in the internal affairs of Tamil Nadu” and a violation of the federal scheme enshrined in the Constitution.\n\nIn a six-page document highlighting the major points which will be argued in defence of her liberty during the Supreme Court hearings scheduled to start from February 2, Ms. Jayalalithaa asked how the State of Karnataka had any locus standi to file a special leave petition or an appeal in the apex court for an alleged offence which took place in the State of Tamil Nadu.\n\nThe Chief Minister invoked Article 162 of the Constitution, which prescribes that the executive power of the State Executive is co-extensive with that of the State Legislature.\n\n“Karnataka has no legislative power in respect of the affairs of the State of Tamil Nadu and consequently has no power to prosecute the alleged offender in the Supreme Court for offences committed in Tamil Nadu against the State of Tamil Nadu,” Ms. Jayalalithaa contended.\n\nOpening up a legal Pandora’s Box on how far a State government to whom a case is transferred for fair trial by the Supreme Court can proceed, the Chief Minister argued that Karnataka got a role as “prosecutor” in the case only after the Supreme Court transferred the corruption case to it on November 18, 2004.\n\nIf not for this transfer order, Karnataka had no involvement in the corruption case. It was neither the de facto complainant nor the de jure aggrieved party. No crime under the Prevention of Corruption Act or the Indian Penal Code has been committed against Karnataka.\n\nThe transfer to Karnataka, she said, was for the specific purpose of conducting a fair trial, and that goal has now been achieved. There is nothing further left for the State of Karnataka to do in this case.\n\nMs. Jayalalithaa argued that only Tamil Nadu has the “exclusive jurisdiction” to file the special leave petition or appeal against the Karnataka High Court judgment of acquittal on May 11, 2015 as she is a “public servant of the State of Tamil Nadu”. She questioned the locus standi of DMK leader K. Anbazhagan and BJP leader Subramanian Swamy to involve themselves in the Supreme Court appeals.\n\nThe Chief Minister invoked Article 162 of the Constitution, which prescribes that the executive power of the State Executive is co-extensive with that of the State Legislature.\n\n“Karnataka has no legislative power in respect of the affairs of the State of Tamil Nadu and consequently has no power to prosecute the alleged offender in the Supreme Court for offences committed in Tamil Nadu against the State of Tamil Nadu,” Ms. Jayalalithaa contended.\n\nThe Chief Minister asked why the Supreme Court should entertain Karnataka's petition under Article 136 of the Constitution (special leave to appeal by the Supreme Court) when the prosecution had completely failed to prove the gravamen of the charges of criminal conspiracy, abetment and possession of disproportionate assets against the accused.\n\nMs. Jayalalithaa contends why income tax assessments relied on by the High Court after conscious evaluation and testing on the basis of testimonies of several witnesses should now be re-opened.\n\nThe Chief Minister further asked the Supreme Court why it should now review findings of fact already determined by the High Court, including that there is no cogent evidence to show that N. Sasikala, J. Elavarasi and V.N. Sudhakaran got their wealth through Ms. Jayalalithaa.\n\nMs. Jayalalithaa asked whether Karnataka was entitled to maintain the petition against the High Court's judgment setting aside the confiscation of assets of five companies which the prosecution alleged were owned by the accused persons. That too when there was no charge levelled under the Benami Prohibition Act.\n\n‘Only TN has exclusive jurisdiction to file special leave petition’", 
    "section": "national", 
    "title": "Karnataka appeal in SC is interference in TN’s internal affairs, says Jayalalithaa", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}