{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Vellore Corporation looking for public response to the project in crowded places\n\nThe remodelled garbage lorry is being stationed for public use in Vellore.— Photo: C. Venkatachalapathy\n\nThe Vellore Corporation has remodelled a mini-lorry into a mobile toilet for the use of vendors in the congested Mandy Street.\n\nThis mobile toilet facility is now being put to use in crowded places such as exhibitions.\n\nPresently, the mobile toilet has been stationed near the Collector’s office due to the huge inflow of persons, especially women, for the ongoing interviews for the job of noon meal organisers. It is also being stationed at the ongoing government exhibition on Fort Ground in the evening.\n\n“We remodelled a mini-lorry used in garbage collection into a mobile toilet for the use of vendors in Mandy Street nearly a month ago. They were facing difficulty due to absence of toilet facility in the area. Constructing a toilet here will be a hard task for want of space,” said Janaki Raveendran, commissioner, Vellore Corporation.\n\nThe vehicle consists of three toilets for women and one toilet, three urinals for men. It has an attached tank filled with water. “The waste water gets collected and is let out at the underground drainage pumping station,” she said. The Corporation is looking at the response from the public to come up with more such mobile toilets. “Now, we are setting up compost sheds for garbage. So, the usage of lorries should come down. We can remodel more such lorries into toilets and bring it to public use to avoid open defecation,” she added.\n\nFor cleaning toilets\n\nWith manual scavenging being banned, the Corporation has introduced a vehicle for cleaning public toilets. There are 94 public toilets in the Corporation limit.\n\n“We have again remodelled an auto for the purpose. This is to prevent sanitary workers from cleaning toilets owing to laws prohibiting manual scavenging. The vehicle consists of high pressure nozzle fitted with pipe to clean public toilets,” Ms. Raveendran added.", 
    "section": "national", 
    "title": "Mini-lorry remodelled as mobile toilet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}