{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Chief Minister N. Rangasamy participates at the lamp lighting ceremony at Mother Theresa Post Graduate and Research Institute of Health Sciences in Puducherry on Thursday.— Photo: T. Singaravelou\n\nChief Minister N. Rangasamy on Thursday said that talks were being held to conduct open heart surgeries in Government Hospital at Kathirkamam in Puducherry.\n\nHe spoke at the lamp lighting ceremony of the first year students of General Nursing and Midwifery (GNM) at Mother Theresa Post Graduate and Research Institute of Health Sciences here.\n\nThough medical facilities were available in Puducherry, people had to travel to other States for heart-related ailments, Mr. Rangasamy said: “Taking this into consideration, Indira Gandhi Government General Hospital and Post Graduate Institute has started performing open heart surgeries. So far, they have successfully conducted eight heart surgeries. Discussions are now being held to conduct surgeries even at the government hospital in Kathirkamam.”\n\nMr. Rangasamy said: “Earlier there were very few educational institutions. It was very difficult to get admission in those institutions. Even after completing the courses, they had to go to Chennai to receive the convocation certificate. But, Puducherry is not the same now.”\n\nHe stated that there were doctors and technicians from other States who perform surgeries here. In a few years, these surgeries would be performed by doctors from Puducherry. “There are many students from Puducherry who have joined government medical colleges and also private institutions under the Kamaraj Scheme. Few years from now, they would complete their courses. These students should come forward to work in the rural areas and provide their service in Puducherry,” he said.\n\nHe added that students completing the nursing courses with high scores will definitely find job in Puducherry.\n\nDiploma course\n\nfrom this year\n\nThe first year nursing students who joined the diploma course in General Nursing and Midwifery (GNM) pledged to dedicate themselves to nursing during the lamp lighting ceremony held at the Mother Theresa Post Graduate and Research Institute of Health Sciences (MTPG & RIHS) here on Thursday.\n\nThe institute had stopped offering courses in diploma in GNM in 1998 as they had started four-year course in B.Sc in nursing. MTPG & RIHS dean Dr. R. Murali said that as per the direction from the Chief Minister they have started offering the three-year diploma course from this year.\n\n“Nearly 40 students have joined this course. The nursing personnel from our institution will help perform major surgeries at the government hospitals,” he said.\n\nMedical superintendents of Rajiv Gandhi Women and Child Welfare Hospital and Indira Gandhi Government General Hospital and Post Graduate Institute were present.\n\nPeople had to travel to other States for\n\nheart-related ailments earlier", 
    "section": "national", 
    "title": "Open heart surgeries soon at Kathirkamam hospital, says CM", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}