{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The railway police will take up open line patrolling with the active participation of Railway Protection Force (RPF) and village assistants, said J. Bhaskaran, Deputy Inspector General of Police, Railways.\n\nSpeaking to reporters after presiding over a meeting with representatives of Divisional Railway officials, Railway Protection Force and Travelling Ticket Examiners (TTE) here , he said it had been decided to step up security along railway line.\n\nThrust would be on increasing the vigil at vantage points. Field officers had been asked to start open line patrol with other stakeholders. The joint patrol would enable to collect intelligence inputs.\n\nStating that the Railway Police had received some intelligence inputs from various intelligence agencies, he said that the railway policemen had been asked to step up protection at all vulnerable points, police stations and crowded areas.\n\nA total of 1200 policemen, in addition to three battalions of Armed Reserve, had been drafted for providing security at police stations and all vulnerable points along railway line in view of the Republic Day celebrations. Random and surprise checking of bags and passengers would be carried out.\n\nMr. Bhaskaran said the Railway Police had solved 127 out of 153 cases filed in the Tiruchi railway police district in 2015.\n\nThe arrest of seven notorious criminals of a village in Haryana, who stole 194 sovereigns of gold from train passengers at Chidambaram and Tirunelveli recently, was the notable achievement of the railway police in 2015.\n\nAnnie Vijaya, Superintendent of Police, Railways, Tiruchi, said 659 children, who were reported missing at various police stations and platforms, had been found and reunited with their parents in 2015.\n\nAnti accident beat system would be strengthened to safeguard the passengers. A special bandobust plan had been drawn to step up security along rail routes in view of the Mahamaham festival.", 
    "section": "national", 
    "title": "Plan to step up security along railway line", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}