{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Race Course police inquiring people who stopped the vehicle from dumping construction wastes into Valankulam in Coimbatore.— Photo: S. Siva Saravanan\n\nThe flooding in Chennai resulted in a huge cry to revive water bodies by removing encroachments. But on Thursday morning, people using the scheme road connecting Ukkadam Bypass Road with Tiruchy Road at Classic Tower were shocked to see a mini goods carrier with the name ‘Coimbatore Corporation’ dumping construction wastes into Valankulam.\n\nThe vehicle was suspected to be hired by a contractor executing works for the Corporation.\n\nR. Periyasamy from Barathi Nagar near Ramanathapuram, who has prevented such incidents in the past, was annoyed over the act.\n\nSensing something wrong, a few autorickshaw drivers and the public joined him and stopped the persons who brought the vehicle from dumping the wastes into the tank.\n\nInquiry\n\nMr. Periyasamy also alerted the Corporation and the police. The Assistant Commissioner for Central Zone from the Corporation, on conducting an inquiry, realised that the vehicle was not associated with any work for the civic body.\n\nThe vehicle with the waste was taken to the Corporation and the authorities promised action against the vehicle owner and driver.\n\n“The Corporation should put up caution boards to warn people not to dump wastes there. Stringent action should be taken against those violating it,” he said.Legal action\n\nCoimbatore Consumer Cause (CCC) has planned to file a Public Interest Litigation in court seeking legal action against those dumping construction wastes and encroaching upon water bodies. Not only private persons, but also the Corporation and other government departments were indulging in such illegal acts, its general secretary K. Kathirmathiyon said.\n\nIn a notice sent to the Revenue Secretary, the CCC has made a detailed account of the actual area covered by eight major tanks in and around the city and their storage capacity against the existing area after a major portion of the tanks were encroached upon by private parties and the government as well.", 
    "section": "national", 
    "title": "‘Prevent dumping of wastes into water bodies’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}