{
    "author": [
        "R Sivaraman"
    ], 
    "text": "They took stock of the strength and weaknesses of all parties\n\nSenior leaders of Puducherry Pradesh Congress Committee (PPCC) apprised Congress vice-president Rahul Gandhi and other leaders in New Delhi about the political situation in the Union Territory towards formulating the party strategy for the upcoming Assembly polls.\n\nAs Tamil Nadu, Puducherry, Assam, Kerala and West Bengal are going to the polls in a few months, the Congress leadership has been conducting preliminary level discussion with its leaders from these States.\n\nFormer Union Minister of State and All India Congress Committee (AICC) general secretary V. Narayanasamy, Leader of Opposition V. Vaithilingam, PPCC president A. Namassivayam, former PPCC president A.V. Subramanian, senior MLA E. Valsaraj, former Ministers- M.O.H.F. Shajahan and M. Kandasamy took part in the consultation which lasted for more than an hour.\n\nDuring the discussion, AICC general Secretary Mukul Wasnik and secretary Chinna Reddy were also present.\n\nSources said Mr. Gandhi discussed the current political situation in the Union Territory and received inputs on the strength and weakness of the party.\n\nThe leaders also briefed him on the strength of ruling All India NR Congress (AINRC) party and Dravida Munnetra Kazhagam (DMK) in the UT.\n\nHe also discussed about the prospects of the party contesting alone in Assembly polls vis a vis forging alliance with likeminded parties.\n\nSources added that the leaders gave their individual opinions on pre-poll and post-poll formation of alliance.\n\nEven as N. Rangasamy broke away from Congress party and launched the AINRC, the party contested alone in 2011 Assembly polls and bagged seven seats.\n\nMr. Vaithilingam was elected from Kamaraj Nagar while Lakshiminarayanan from Raj Bhavan, Mr. Namassivayam from Villianur, Mr. Valsaraj from Mahe, C. Djeacoumar from Mangalam, Malladi Krishna Rao from Yanam and P.R.N. Thirumurugan from Karaikal (North) were elected as MLAs.\n\nOn an earlier occasion, Mr. Narayanasamy had said, “With the blessings of the Congress president Sonia Gandhi and vice-president Rahul Gandhi, the Congress will come to power in the Union Territory of Puducherry. All should work effectively so that the party will be able to contest alone.”\n\nHowever, he had added that the electoral alliance would be decided by party president and vice- president.\n\nCongress will come to power in the Union Territory of Puducherry. All should work effectively so that the party will be able to contest alone.\n\nV. Narayanasamy\n\nAICC general secretary", 
    "section": "national", 
    "title": "Puducherry Congress leaders appraise Rahul of poll position", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}