{
    "author": [
        "Staff Reporter"
    ], 
    "text": "44 tanks in Chinnamanur, Periyakulam, Bodi and Uthamapalayam unions taken up\n\nThe Public Works Department has taken control of tanks in four panchayat unions in the district to rehabilitate and revive them. To begin with, 44 tanks in Chinnamanur, Periyakulam, Bodi and Uthamapalayam unions were taken up for rehabilitation.\n\nThe main purpose was to improve the capacity of rural tanks, make it store water during rainy season and restore cultivable lands under its ayacut. To revive these tanks, the PWD will coordinate with other departments. Majority of tanks were in Uthamapalayam and Chinnamanur. Already Chinnamanur union had handed over six tanks to the PWD and Uthamapalayam has started handing over 14 tanks.\n\nAt present, several tanks in these blocks were in disuse. They were either encroached upon or abandoned by the panchayat union administration. Acacia trees have grown in several tanks and high silt deposition has scaled down their storage capacity. Complete renovation including desilting, strengthening of bunds, reviving supply channels and evicting encroachments will be done to restore these tanks to their original shape and capacity. Such rehabilitation will not only recharge groundwater but also help local farmers raise single crop in drought-hit areas. These tanks could be utilised to store excess water flowing in Periyar River also.\n\nAlready, Collector N. Venkatachalam, in a circular, advised the panchayat unions to hand over tanks that could not be maintained by them. They were also instructed to hand over all details of tanks along with a resolution passed by the union council in this connection.\n\nDetails of tanks that were not under their control should also be informed to the PWD for alternate plans for rehabilitation. They should furnish all particulars about these tanks immediately, the Collector added.", 
    "section": "national", 
    "title": "PWD to rehabilitate panchayat union tanks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}