{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They demand, among other things, a minimum pay of Rs. 26,000\n\nMembers of the SRMU staging a demonstration in Madurai on Thursday.— Photo: S. James\n\nMembers of Southern Railway Mazdoor Union staged a demonstration here on Thursday pressing for a charter of demands which included fixation of minimum pay for the railway employees at Rs. 26,000 per month.\n\nMembers from all over the division participated in the protest, which was led by union’s divisional secretary J.M. Rafi. Mr. Rafi said that if the Railway Board failed to meet the demands of the railway workers by the first week of February, the National Joint Council of Action would meet on February 8 to finalise the date for launching an indefinite strike.\n\nMr. Rafi said that the minimum pay as per Dr. Aykroyd formula should have been Rs. 26,000 considering the house rent, social expenditure of a family and expenditure on education of children among others.\n\nBut, the Seventh Central Pay Commission had recommended Rs. 18,000 a month, he said.\n\nThe union also demanded that the new pension scheme should be scrapped for the railwaymen and the old pension scheme should be restored.\n\nAmong other things, they also demanded an increase in yearly increment to five per cent instead of three per cent and two increments for each promotion.\n\nBesides, the union wanted the government not to reduce the house rent allowance for the employees.\n\nBonus without ceiling and withdrawal of performance-related increment scheme were the other demands.\n\nDivisional president G. Ramasubbu and assistant divisional secretary V. Ramkumar were among those who addressed the protestors.\n\nRailway engineers\n\nMeanwhile, members of All India Railway Engineers’ Federation staged a demonstration here on Wednesday.\n\nThe protest, led by federation’s divisional president E. Suresh Kannan, demanded Group-B/gazetted status to all railway engineers as per a gazette notification of 2009.\n\nThe engineers sought assured promotions to graduate engineers recruited as senior section engineers and time-bound promotion for all other engineers from junior engineer level to junior administrative grade officer.\n\nRailway engineers should be given a grand technical allowance of 30 per cent and minimum 10 per cent benefit in pay on promotion, and all existing vacancies should be filled, they demanded.\n\nDivisional secretary M. Abdul Rahuman was also present.", 
    "section": "national", 
    "title": "Railway men stage demonstration", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}