{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Residents of Ramapuram also want the waterbody in their area to become a gathering spot —Photo: G. Krishnaswamy\n\nIn recent times, the concept of eco-tourism of water bodies has gained considerable ground in the city. It is increasingly being seen as an effective way to save dying lakes.\n\nResidents of Ramapuram have been battling to save a waterbody, which was originally spread over 27 acres, but now spans only 3.5 acres.\n\nS. Murugan of the Federation of Ramapuram Residents Welfare Association says “We started fighting for the rejuvenation of the waterbody after encroachments started eating into it. Ramapuram doesn’t have any public space for people – such as a park or a playground – for residents to congregate. Developing the lake into an eco-tourism spot could be the only solution to prevent further encroachments.”\n\nMany residents of southern suburbs also subscribe to the view that existing neighbourhood lakes must be developed into eco-tourism spots.\n\nR. Ganesan, a resident of Adambakkam, says the proposal to develop Velachery lake as a tourist site still remains on paper. Such projects must be revived before more such waterbodies vanish from city map.\n\nFor over five years now, residents of Kazura Garden, Palavakkam, are waiting for a waterbody in their area to be rejuvenated with facilities like a park, children’s play area and walkers’ track.\n\nSrilakshmi Mohan Rao of the Kazura Garden Residents’ Welfare Association says the waterbody, spread over nearly an acre, is yet to be revived.\n\nAnother small waterbody near Maraikayar Nagar, Palavakkam, which was restored, is yet to be opened for use by the public.\n\n“Eco-tourism projects seem to be the best solution. But, their success depends on how far the efforts are sustained,” she added.\n\nThe success of such projects however depends on sustained efforts", 
    "section": "national", 
    "title": "Recreation may help conservation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}