{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pilgrims can book their voyage by paying Rs. 1,000 to boat owners\n\nVerkodu Parish, which is coordinating the Katchatheevu pilgrimage for the annual festival of St Antony’s Church in the uninhabited islet, has completed boat registration process by registering 100 mechanised boats for the pilgrimage scheduled for February 20 and 21.\n\nRev. Fr. L. Sagayaraj, Verkodu Parish Priest, who is the chief coordinator of the Indian pilgrimage, said that the total number of boats for the pilgrimage was limited to 100 this year as advised by Jaffna Diocese, which organised the festival.\n\nThose who wished to undertake the pilgrimage could directly approach boat owners and book their voyage by paying Rs. 1,000, including Rs. 300 for administrative expenses, he said, adding each boat could carry about 40 people, including five crew members.\n\nApplications\n\nHe said that the parish began distribution of applications for the pilgrimage on Wednesday and had so far distributed 685 applications.\n\nApplications would be distributed till January 27, and the pilgrims should submit the filled-in applications by February 2, he said.\n\n4,003 pilgrims last year\n\nLast year, 4,003 pilgrims, including 816 women and 229 children, attended the festival. The parish had arranged 110 mechanised boats.\n\n“This year, we plan to take around 3,800 pilgrims,” Fr. Sagayaraj told The Hindu here on Thursday.\n\nThe pilgrims would leave on the morning of February 20 and return after the feast mass, the next morning, he added.\n\nMeanwhile, the district administration had given its consent for the pilgrimage and agreed to hold a meeting here on January 27 to finalise the arrangements and secure security clearances, he also noted.\n\nThe meeting would be chaired by Revenue Divisional Officer (RDO) and would be attended by the representatives of Indian Coast Guard, Indian Navy, Coastal Security Group, Intelligence Bureau, Q Branch and district police, he added.", 
    "section": "national", 
    "title": "Registration of boats for Katchatheevu fest over", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}