{
    "author": [], 
    "text": "The State Consumer Forum has granted Rs. 10 as compensation to the family of a seven-year-old school girl who died after falling through a hole in her school bus. Holding that the incident happened due to the negligence of the private school, the forum directed the correspondent of the school to pay the compensation.\n\nAccording to the complainant E.R. Sethumadhavan, father of the deceased girl E. Shruthi, his daughter was pursuing class two in a private school located in Selaiyur, Chennai. Shruthi was using the transportation provided by the school. On July 25, 2012, while returning back home from the school; she was made to sit on a wooden board which was covering a hole in the school bus. When the bus took a sharp turn, she fell through the hole and was run over by the same bus.\n\nClaiming that the child died due to the poor maintenance of the bus and negligence on part of the school management, counsel for the complainant, Vasugiramanam, sought the forum to direct the management to pay Rs. 25 lakh as compensation to the child’s family.\n\nDenying the allegations, the school contended that the buses engaged for carrying the children was taken on lease from a third party and therefore the management is not responsible or liable for the accident.\n\nThe management also argued that since the Madras High Court had already taken up the issue suo moto and had directed a payment of compensation to the complainant, the present complaint was not maintainable.\n\nWhen the complaint came up for hearing, the forum comprising Judicial Member J. Jayaram and Member P. Bakiyavathi said, “It is the bounden duty of the school to maintain the buses and it cannot shirk its responsibility implicating the owner of the bus.”\n\nThe State forum made it clear that it has jurisdiction to adjudicate the present case.\n\n(With inputs from Prerna Prakash)", 
    "section": "national", 
    "title": "School to pay Rs. 10 lakh for child’s death", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}