{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Ranganathaswamy Temple, Srirangam : Thai car festival, Namperumal purappadu in pallakku, 7 a.m.; reaching Ranga Vilasa mandapam, 8.30 a.m.; purappadu in kuthirai vaganam, 6.30 p.m.; Vaiyali kandarulal and reaching kannadi arai, 8 p.m.; Chinnaperumal sayanam, 8.30 p.m.\n\nArulmigu Mariamman Temple, Samayapuram : Thai poosam festival, Amman thiruveedhi ula in pallakku, 10 a.m.; abishekam, 5 p.m.; maha deeparadhana, 7 p.m.; Amman thiruveedhi ula in Velli Kuthirai vaganam, 8 p.m.; reaching sanctum sanctorum, 9 p.m.\n\nSri Andal Thirupaavai Mahotsava Sabha : Thirupaavai mahotsavam, Sri Vedanata Desikan Sannidhi, discourse by Srimad Andavan Sri Rangaramanuja Maha Desikan, Srirangam Srimad Andavan Ashram, North Chithirai Street, Srirangam, 10 a.m.; discourse by Vaduvur Sri R.Veeragahavachariar, 11 a.m.; discourse by Sri S.Raghuveera Bhattachariar, noon.\n\nSri Lakshmi Narayana Perumal Sannidhi, Keezha Valadi : Sri Radha Kalyana mahotsavam, ashtapathi bhajan, 8 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Anjaneyar Sannidhi, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 24, SMESC Colony, II Street, North Extension 6 p.m.\n\nCULTURE\n\nBharatiya Vidya Bhavan : Kalaiyurum Kaviri 2016 – music, dance and drama festival, Revathy Muthusamy, director, Srirangam Bharathanatyalaya, inaugurates, Kalai Kaviri College of Fine Arts, 6 p.m.\n\nGENERAL\n\nBharathidasan University Institute of Entrepreneurship and Career Development and Bharathidasan University Technology Park: Inauguration of 100 KVA solar power plant, V.M.Muthukumar, Vice Chancellor, Bharathidasan University, chief guest, Khajamalai campus, 4.30 p.m.\n\nYoung Indians: National Conference on ‘Entrepreneurship and start-up competition – sharpen your saw,’ K.S.Bharath, chairman, Aparajith Group, delivers key note address, R.A. Krishnakumar, Chairman, CII, Tiruchi Zone, speaks, Hotel Sangam, 9.15 a.m.\n\nBharathidasan University Economic Forum: P. Sridharan, Deputy Director of Income Tax (investigation), speaks on Income Tax in India – Law and Practice, 2.30 p.m.\n\nShrimati Indira Gandhi College Department of Bank Management: Outreach programme on Practical Banking, Bank of India, Nangavaram branch, 3 p.m.\n\nAIMAn College of Arts and Science for Women Mathematics Association: A .Ramesh Kumar, Head, Department of Mathematics, Srimad Andavan Arts and Science College, speaks on Fundamentals of Algebra, 11 a.m.\n\nHallmark Business School: Release of placement brochure, M.Palpandian, Divisional Manager, Karur Vysya Bank, speaks, 4.30 p.m.\n\nAnna University Centre for Excellence in Nanobio Translational Research : International convention of Association of Pharmacy professionals, Ulrich Pfeffer of IST Istituto Nazionale per la Ricerca sul Cancro, Genova, Italy, inaugurates, Oommen V.Oomen, Chairman, Kerala State Biodiversity Board, speaks, Breeze Residency, 9.30 a.m.\n\nSt. Joseph’s College Economics Association : Lecture on Legal exposure for youngsters by R.Ramachandran, advocate, 11.30 a.m.\n\nDirectorate of Field Publicity: Special outreach programme, K.S.Palanisamy, Collector, chief guest, M.Annadurai, Director, Directorate of Field Publicity, TN and Puducherry, presides, Pallapuram, Lalgudi block, 10.30 a.m.\n\nSeethalakshmi Ramaswami College Youth Red Cross : Workshop on Health for Youth, 10.30 a.m.\n\nNational College English Literary Association : Lecture on Diasporic Writing by Sheeba Princess, associate professor, Bishop Heber College, 12.30 p.m.\n\nCARE Group of Institutions : Hands-on training on e-creativity, 10 a.m.\n\nK.Ramakrishnan College of Engineering : Inauguration of ICTACT and faculty development programme on mobile application development, 10 a.m.\n\nKongunadu College of Engineering and Technology : Seminar on Particle concentration and effectiveness of natural fibre air filter in split air conditioner system, 5.15 p.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nAdayar Ananda Bhavan : Opening of new sweets shop and vegetarian restaurant, A.Muthu Krishna Reddiar, chairman, Abhirami Groups, inaugurates, Twin Towers, Karur By-pass Road, 9.30 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}