{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Salem depot operated 300 special buses for ten days\n\nhe operation of special buses during the Pongal festival season fetched appreciable revenue for the cash-starved Tamil Nadu State Transport Corporation (TNSTC), Salem.\n\nThe TNSTC operated more than 300 special buses from different parts of the western districts of Salem, Namakkal, Krishnagiri and Dharmapuri, divided into Salem and Dharmapuri regions for ten days from January 9 – 19 to clear the rush.\n\nThe operation of the special buses fetched a revenue of Rs. 25.35 crore to the Salem TNSTC. This was additional revenue to the corporation, apart from the revenue achieved from the operation of the regular scheduled services on these days.\n\nThe special buses were operated from the New Bus Stand in the city to Chennai, Coimbatore, Madurai, Bengaluru, Tiruvannamalai, Chidambaram and Tiruchi, Vellore, apart to other centres within the western districts.\n\nBesides, the TNSTC also pressed into service additional buses in Salem city limits round the clock prior to and on the festival days to enable the people to do shopping and also visit the temples.\n\nThis year’s Pongal season revenue was Rs. 78.35 lakh higher compared to last year’s achievement.\n\nDuring the last Pongal season, the TNSTC Salem aggregated a revenue of Rs. 24.57 crore by operating additional buses.\n\nThe officials faced a difficult job mainly after the celebrations were over, with people employed in different cities and towns returning after celebrating the festival in their native places with their relatives.\n\nThe days January 17 (Sunday) and January 18 (Monday) proved testing time for the official machinery and the crew with hundreds of men, women and children thronging the busstands to proceed to their work places.\n\nTo ensure the smooth operation of the buses and to regulate the crowd, senior officials were pressed into service at the New Bus Stand and also in the bus stands in the district headquarters of Namakkal, Dharmapuri and Krishnagiri and other mofussil centres such as Attur, Tiruchengode, Hosur, Sankagiri, Komarapalayam etc. The presence of the senior officials under the watchful eyes of Shanmugasundaram, General Manager, TNSTC, Salem and Arumugam, Deputy Manager, Commercial-Corporation, enabled in streamlining of services, besides introducing additional buses based on need. A senior TNSTC Salem official told The Hindu that all the spare buses and the vehicles detained for maintenance which were found road-worthy were roped in by the Corporation during the festival days.\n\nThe officials are happy that it got total support from the bus crew. Mr. Shanmugasundaram and other officials commended the subordinate officials and the bus crew for their support in operating the special services.\n\nWhile hailing the TNSTC Salem for operating adequate number of special services, a section of the consumer activists complain that the authorities withdraw the regular bus services particularly to remote villages in the guise of operating special buses.\n\nHowever, this charge was refuted by the TNSTC officials.\n\nOnly the spare buses and the buses meant for maintenance were roped in without disturbing the existing regular schedule.\n\n“We operated the buses by reducing the idle hours of the vehicles to the maximum extent”, the officials said.", 
    "section": "national", 
    "title": "TNSTC nets Rs. 25.35 crore revenue", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}