{
    "author": [
        "Staff Reporter"
    ], 
    "text": "He reportedly got off a train at Itarsi railway station in Madhya Pradesh\n\nA 37-year-old man arrested for making hoax bomb threats to Christian Medical College (CMC), Vellore last October slipped away from police escorts while he was being taken in a train to Lucknow on Wednesday night. He reportedly got off the train at Itarsi railway station in Madhya Pradesh.\n\nSyed Ahmed Ali, a resident of Tripura, was arrested by Vellore police on October 16 after he made two bomb threat calls to CMC on October 14. Initially, it was suspected he had terror links as he possessed nearly 10 SIM cards.\n\nHowever, investigation ruled out that he had any terror links, and that he was terminally ill with cancer, police said.\n\nAli has a history of issuing fake bomb threats to various places. He reportedly threatened to blow up Taj Mahal, and a dargah in Ajmer and was being searched by police. Following the call to CMC, Vellore North police traced and arrested him. He was lodged in the Vellore Central Prison for Men.\n\nOn the night of January 19, a team of six police personnel led by a sub-inspector had escorted him in Raptisagar Express for a court hearing in Lucknow. They boarded the train at Katpadi.\n\n“This hearing was in connection with a bomb threat call to railway police. He was to be produced before the Additional Chief Magistrate Court, Lucknow for the hearing. The team left with him on January 19 and was supposed to reach Lucknow on 9.30 a.m. on Thursday. He escaped from the train around 11 p.m.,” a senior police official said.\n\nUnclear\n\nIt remains unclear as to how Ali escaped from the police personnel. There were many versions on his escape from the police escort team. Some said he had slipped away when three police men had alighted to have tea, while the other three were engaged in a conversation with railway police personnel, sources said.\n\nSearch launched\n\nP.K. Senthilkumari, Superintendent of Police, Vellore, said they have lodged a complaint with the railway police of Itarsi station, Madhya Pradesh.\n\n“A search has been launched for him,” she said. However, she ruled out that he had terror links.\n\n“We had made it clear when we arrested him that he is not a terrorist. He was suffering from cancer, and has been making fake bomb threat calls,” she added.\n\nA four-member police team from Vellore will be leaving for Itarsi to inquire with the escort team and assist the local police in nabbing Ali.\n\nA team of six police personnel had escorted him in Raptisagar Express for a court hearing in Lucknow", 
    "section": "national", 
    "title": "Tripura man held for making hoax bomb threat escapes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-22"
}