{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As many as 231 new leprosy cases have been identified in the district from April to December 2015 and treatment is being provided to them. This was disclosed during the National Anti-Leprosy Day observation here on Monday.\n\nAs part of the observation, Collector flagged off an awareness rally on the Collectorate premises in which over 750 students, volunteers and medical staff participated.\n\nParticipants carried placards that said that leprosy could be diagnosed with common symptoms such as pale, patch spots on face, hands and feet and asked the affected people to approach the government hospitals immediately.\n\nImportance\n\nOfficials said that leprosy, if left untreated, could lead to numbness in hands and treatment is essential. Participants also highlighted the importance of getting medical attention at the preliminary stage so that leprosy could be treated properly. The rally passed through Tiruvalluvar Statue, Old Corporation office, Government Hospital and culminated at Nattamai Kazhagam building. Pamphlets were also distributed to the people. At the end of the rally, Collector garlanded the statue of Mahatma Gandhi in the premises.\n\nA.K. Kumudha, Deputy Director of Health Services (Leprosy), said that the number of leprosy patients for every 10,000 population in the district stands at 0.59 per cent.\n\nDuring the period from April, 2011 to December, 2015, 1,031 patients were identified, including 309 women and 107 children. From April 2015 to December 2015, a total of 231 people were identified with leprosy, including 81 women and 43 children. Treatment is being provided to them, she added.\n\nHealth officials said that after the National Leprosy Eradication Programme (NLEP) was launched in 1955, leprosy patients were detected and treatment provided at an earlier stage. This helped reduce the number of affected patients over the years, they added.\n\nA Government Rehabilitation Home for leprosy patients is functioning in the district at Deviyakurichi, in Thalaivasal block, in which 80 patients are currently undergoing treatment.", 
    "section": "national", 
    "title": "231 leprosy cases identified in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}