{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Next camp on February 6; Filled-in forms to be received between 10 a.m. and 5 p.m.\n\nAround 50,000 residents visited 889 special camps in Chennai district on Sunday for inclusion, deletion, correction and transposition of entries on the electoral rolls.\n\nOfficials said that 3,699 booth-level officers in these locations offered services to electors of 16 Assembly constituencies. The next special camp will be conducted on February 6. Designated officers will receive the filled-in forms between 10 a.m. and 5 p.m. on the day of the campaign.\n\nIn a bid to reduce the burden on students who require services related to electoral rolls, the Chennai District Election Office also plans to conduct special camps in colleges across the city.\n\nAt least 60 colleges in 16 Assembly constituencies of Chennai district will be covered in the special camps at colleges shortly. A camp has already been conducted in Ethiraj College.\n\nMore than two lakh students from Chennai district are expected to exercise their franchise in this Assembly election. According to the electoral rolls-2016, published on January 20, as many as 56,135 male voters, 45,338 female voters and 25 others, in the age group of 18-19, have been included in the electoral rolls.\n\nThe number of voters in the age group of 20-24, which also includes many first-time voters, is 3.39 lakh in the district. Around 38.28 lakh electors are on the rolls of the 16 Assembly constituencies in Chennai. According to Chief Electoral Officer Rajesh Lakhoni, In Chennai district, a total of 53,089 forms were received for inclusion in electoral rolls.\n\nVirugambakkam Zone received the largest among zones in Chennai district with 4,793 forms for inclusion.\n\nA total of 1,899 forms for deletion, 4,878 forms for corrections and 6,756 forms for change in address were received in Chennai district.\n\nNext camp on February 6; filled-in forms to\n\nbe received between\n\n10 a.m. and 5 p.m. at\n\nthe camps", 
    "section": "national", 
    "title": "889 special camps for voters conducted in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}