{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "The December deluge has overturned many of our notions about life and, of course, our city. Areas that were considered highly resilient to natural calamities were hopelessly affected during the floods, and took a long time to return to normality. And those that were considered more vulnerable bounced back quicker than expected.\n\nGovernment assistance\n\nAccording to the Resilience Index for Chennai, prepared in 2010, Ayanavaram and its surrounding areas were said to have the highest resilience in old Chennai limits.\n\nHowever, to the surprise of officials in charge of flood rescue and relief operations, these areas were severely affected in the recent floods. The number of persons who received government assistance after the floods in these areas was also higher.\n\nAreas such as Ice House that were said to have the lowest resilience escaped with minor damages.\n\nGiven this, the exercise aimed at revising the climate and disaster resilience index will take into account the new variables that contributed to the recent flooding.\n\n100 Resilient Cities pioneered by the Rockefeller foundation and Greater Chennai Corporation together have already initiated work on assessing existing infrastructure and systems.\n\nOn Monday, civic officials, who had carried out rescue works during the floods, were present at the meeting, as their inputs would be significant while preparing a new index.\n\nNGOs and experts from other countries also participated.\n\nSome of the experts have assessed resilience of various cities across the world, following floods there.\n\nExperts from the Netherlands, Care Earth, Deltares, Teri, NAVIGEM, GIZ- Cities Development Initiative for Asia, World Bank, Asian Development Bank, ARCADIS, C40 and representatives from consultant firms like Waggonner & Ball Architects, Dalberg, Wipro, ICRA, Congnizant, CRN Architects, TARU, Athena Infonomics and IIT- Madras were among the participants.\n\nDisaster management\n\nA revised disaster resilience index will take a holistic view of what makes for resilience and how it can be measured.\n\nDisaster management expert N. Mathavan, who played a role in the preparation of the 2010 resilience index, had pointed to the need for a disaster management plan for the city, back then in 2010. His suggestion has been taken seriously only now, after the recent floods.\n\nA Greater Chennai Corporation official said a comprehensive resilience strategy was expected to address issues caused by flood risk.\n\nThe plan would be drafted shortly.", 
    "section": "national", 
    "title": "A new resilience map in the making", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}