{
    "author": [
        "K Manikandan"
    ], 
    "text": "60 ATVMs have been dumped as they have outlived their ‘codal life’\n\nThe touch screens and other valuable parts from these machines will be auctioned off next week—Photo: S. R. Raghunathan\n\nCommuters going past the ticket counter at the Chintadripet railway station cannot miss a pile-up of huge metal boxes in the corner. These are Automatic Ticket Vending Machines (ATVMs) that have run their course.\n\nMore than seven years after they were introduced on the suburban and MRTS lines to prevent commuters from having to stand in long queues to get their tickets, about 60 ATVMs are being removed as they have outlived their ‘codal’ life. These machines were designed to last between 5 and 6 years, Southern Railway officials told The Hindu.\n\nThe touch screen and other valuable parts, which have been removed from the machines, will be auctioned off next week. The machines cost Rs. 3.5 lakh each when they were introduced in 2008. First installed at important stations, these machines were made available at nearly all stations on the suburban and MRTS routes. The machines were placed near ticket counters so that commuters with smartcards could swipe them to get tickets to the destinations of their choice by operating a touch screen, officials said.\n\nHowever, the smart cards had to be recharged at least once in six months to keep them usable.\n\n“If they do not work, we have to go back to the ticket counters,” said J. Rajan, a commuter at Chintadripet station. The machines and the smartcards were launched by Southern Railway keeping in view occasional travellers. Only those travelling regularly by train would buy season tickets. Out of the total volume of ticket sales, less than 2 per cent of the tickets were purchased through these machines.\n\nRecently, 62 new ATVMs, costing Rs. 5 lakh each, were introduced. These machines will continue to dispense tickets at suburban and MRTS stations. In addition to these, the Southern Railway had also purchased Cash/Smartcard operated Ticket Vending Machines, each of which cost Rs. 10 lakh. They have been installed at 14 railway stations in the city, officials added.", 
    "section": "national", 
    "title": "A pile of discarded ticket machines at Chintadripet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}