{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Shri P. K. Das Memorial Best Teacher and Life Time Achievement Awards 2016 were presented at a function organised by the Nehru Group of Institutions at Nehru Arts and Science College.\n\nShri P. K. Das Memorial Best Teacher and Life Time Achievement Awards 2016 were presented on Sunday at a function organised by the Nehru Group of Institutions at Nehru Arts and Science College.\n\nThe awards were presented to 62 school teachers from Tamil Nadu and 13 teachers from Kerala in memory of P. K. Das, founder chairman of Nehru Group of Institutions. Life Time Achievement Awards were presented to five teachers from Tamil Nadu and two from Kerala besides one more award in Special Category.\n\nChief guest R. Jayakumar, Commandant, RAF 105 Battalion, Coimbatore, said, “the teaching community is the superior community working round the clock for the betterment of the students community. A teacher alone can inspire a student and guide him/her towards perfect path.”\n\nB.Anirudhan, principal and convenor, Nehru Arts and Science College, also spoke.\n\nThe chief guest presented the awards in the presence of P. Krishnadas, managing trustee, Nehru College of Educational and Charitable Trust, and P. Krishnakumar, CEO and secretary, Nehru Group of Institutions. S. Natarajan, District Education Officer, Pollachi, was guest of honour.\n\nS.Sukumaran, SPB Matriculation Hr. Sec. School, Erode, S.Sritharan, Government Higher Secondary. School, Rasipuram, Rieta Paul, Corpus Christi International School, Nagercoil, R.Mohan Kumar, Swamy Vivekanandar MHSS, Salem and Sister Shalini, Avila Convent MHSS, Coimbatore, from Tamil Nadu and A.P. Jyothish K.V., Malappuram from Kerala, received the Life Time Achievement awards.\n\nSpecial category Life Time Achievement Award was received by Joseph K.V., Holy Trinity School, Palakkad.", 
    "section": "national", 
    "title": "Best Teacher awards presented", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}