{
    "author": [], 
    "text": "Teaching methodology inaugurated at Elumalai Polytechnic College in Villupuram\n\nTATA Communications team at the placement support organised by the Manakula Vinayagar Institute of Technology.— Photo: Special Arrangement\n\nDr. V. Iraianbu, IAS, principal secretary/commissioner (Department of Economics and Statistics, Govt of Tamil Nadu) last Thursday inaugurated the new digital teaching methodology through L.M.S Digital Boards at Elumalai Polytechnic College in Villupuram.\n\nThe staff members will teach through this audio visual form. This system works on cloud based servers streaming live information to the classrooms. Er. Selvamani, secretary of Elumalai Polytechnic College and Chairman of ESSM group of institutions explained in detail about the advantages of technical teaching through L.M.S Boards.\n\nIn his presidential address, Dr. Iraianbu stated that this system will certainly create a revolution in classroom teaching and learning and also attract the student community largely.\n\nRepublic Day celebrated\n\nM.R.K Institute of Technology, Kattumannarkoil, celebrated the 66{+t}{+h}Republic Day on the institute premises. M.R. Deivasigamani, correspondent, M.R.K Memorial Education Trust hoisted the flag. The Chairman of MRK Institute of Technology P. Kathiravan, the principal, staff and students participated.\n\nPlacement support extended\n\nManakula Vinayagar Institute of Technology, Kalitheerthalkuppam, came out with extended placement support to the student community by hosting an on campus recruitment drive with TATA Communications, Chennai in December on the college premises for the 2015 batch candidates. Electronics and Communication Engineering students graduated from various institutions.\n\nThe hiring team consisted of Rajesh Arangarajan, Swaminathan, Aroun from TATA Communications. M. Dhanasekaran, chairman and managing director, S.V. Sugumaran, vice chairman and K. Narayanasamy, secretary, Sri Manukula Vinayaga Educational Trust presided over the programme. S. Malarkkan, principal welcomed the gathering.\n\nArt and food fest held\n\nMarudhur Kesari Jain College for Women, Vaniyambadi, conducted a “Food Festive and Interior Dizz’Art” on January 30. It was jointly organised by the Department of NFSM and Dietetics, Department of Interior Design and Décor and Women Entrepreneurship Development Cell Karuna Club. There was an exhibition cum sale of arts, crafts and paintings by students.\n\nReporting by S. Senthalir and Serena Josephine M.", 
    "section": "national", 
    "title": "Black boards make way for digital ones", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}