{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The camps were conducted in 1,217 polling centres\n\nTiruvannamalai Collector A. Gnanasekaran inspecting the special camp organised for inclusion, correction and deletion in the electoral rolls on Sunday.. Photo : Special Arrangement\n\nSpecial camps for inclusion of names, deletion, correction and change of address in electoral rolls were conducted in various polling centres in Vellore and Tiruvannamalai districts on Sunday.\n\nUpdating underway\n\nThe final electoral roll was released on January 20, and work for continuous updating is underway. The electoral roll has been kept for public view at all revenue divisional offices, taluk officers and polling centres.\n\nAs part of this, the Election Commission had advised to hold special camps at all polling centres to enable public to verify their names and other details in the electoral roll, and if needed, apply for inclusion or correction by submitting the appropriate forms, a press release said.\n\nThe special camps are being organised on two days. In Tiruvannamalai district, the special camps were conducted in 1,217 polling centres.\n\nApplications for inclusion of names, deletion, correction and change of addresses in the electoral rolls were received.\n\nPersons who have completed 18 years of age had also applied at these camps by producing proof of residence and age.\n\nThe filled-in forms were also being received at taluk and municipality offices. People can also apply through the website – www.elections.tn.gov.in/eregistration.\n\nTiruvannamalai Collector A. Gnanasekaran inspected the special camps at the polling centres in Tiruvannamalai taluk at Thatchampattu, Nariyappattu, Thalaiyampallam and Paavupattu villages. He also handed over new coloured voter’s identity cards to persons at a camp, a release said.\n\nVellore Collector R. Nanthagopal inspected the special camps in Ponneri panchayat and Mandalavadi panchayat, Tirupattur taluk.. Another special camp will be organised on February 6.", 
    "section": "national", 
    "title": "Camps for electoral rolls held in Vellore, Tiruvannamalai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}