{
    "author": [
        "S Poorvaja"
    ], 
    "text": "15,000 people take part in the Wipro Chennai Marathon; more women runners this edition\n\nSunday dawned earlier than usual for more than 15,000 people of Chennai. They swarmed over Kamarajar Salai, occupied every inch of space on Napier Bridge over the Cooum river. They cut across barriers, but were together to pay tribute to the ‘spirit of Chennai.\n\nThe Wipro Chennai Marathon witnessed exciting scenes at different spots all along its route. Participants of the full marathon began to assemble at the Kasturba Nagar MRTS station from as early as 3:30 a.m. and began their run at 4 followed by the half-marathoners at 4.30 a.m.\n\nAt 7 a.m., the atmosphere at Napier Bridge near Marina Beach was reverberating with the energy of thousands of runners who had assembled for the 10-kilometre run to CPT Grounds in Taramani. The participants were a mix of first-time runners, seasoned athletes, senior citizens, corporate employees, families and students who were seen taking selfies and interacting with professional athletes who were participating in the marathon and taking tips from them ahead of the run.\n\nDifferently abled participants too turned up in large numbers to participate in the event.\n\n“This is my fourth Marathon and I am very excited to be able to able to participate with the runners here who have been encouraging me,” said Manoj Kumar, a Class V student who participated in the marathon in a wheelchair.\n\nPolitician Anbumani Ramadoss and Tennis player Ramkumar Ramanathan, who recently made his presence felt at the Chennai Open, were among Chennaiites who turned up to run.\n\nEnergy levels remained high at the CPT stadium where runners assembled after the marathon was over and many danced to the music being played.\n\n“While it was a bit dark initially, the early start helped us as it began to get humid after sunrise. This is my third full marathon and I am looking forward to participating in Tokyo and Boston marathons this year,” said 35-year-old Shailaja Sridhar, a resident of Gurgaon, who finished first in the full marathon in the women’s category.\n\nMembers of Chennai Runners said that this year’s event had seen a large number of women signing up, compared to the previous editions.\n\nM. Jegadheesan, the 28-year-old Chennai resident who finished first in the men’s full marathon, said the route was good for the runners and said that he would encourage more people who wanted to complete full marathons to consistently keep at running regularly as well as enjoy it.\n\nThe Hindu is the media partner.\n\nMusic bands played popular songs, pepping up the spirit of the participants.\n\nVolunteers distributed glucose water to the runners and picked up plastic bottles and other waste along the marathon route.", 
    "section": "national", 
    "title": "Celebrating the ‘spirit of Chennai’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}