{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Education Secretary has been made its chairman and 11 others, including Health Secretary, members\n\nThe same committee will handle the lateral entry of students to engineering courses in various colleges.— Picture used for representational purpose\n\nMonths ahead of the admissions for next academic year, the government has passed an order entrusting the task of admissions to various professional courses for 2016-17 to a newly constituted Centralised Admission Committee (CENTAC).\n\nThe order of Higher and Technical Education said the various courses are engineering (including lateral entry scheme admission to B.Tech. courses), medical, Ayurveda, dental, veterinary and animal science, B.Pharm., B.Sc. (nursing), BPT, B.Sc. (MLT) and LL.B., which are offered by colleges under the purview of the Government of Puducherry and the Societies fully funded by the government.\n\nThe seats are offered by Pondicherry Engineering College, Puducherry; Perunthalaivar Kamarajar Institute of Engineering and Technology, Karaikal; Indira Gandhi Medical College and Research Institute, Puducherry; Rajiv Gandhi Ayurveda Medical College, Mahe; Mahatma Gandhi Postgraduate Institute of Dental Sciences and Research Institute, Puducherry; Rajiv Gandhi Institute of Veterinary and Educational Research, Puducherry; Mother Theresa Postgraduate and Research Institute of Health Sciences, Puducherry, and Dr. B.R. Ambedkar Government Law College, Puducherry.\n\n“Seats in the courses are also available under government quota to an extent of not more than 50% of the sanctioned intake in other unaided private professional educational institutions within the union territory of Puducherry.\n\nBesides, admissions are also carried out by the CENTAC in respect of the Government of India nomination seats sponsored by the Ministry of Human Resources Development to the above mentioned courses in government institutions all over the country,” said F.P. Verbina Jayaraj, Under Secretary, Department of Higher and Technical Education.\n\nThe Lieutenant-Governor has ordered the composition of CENTAC .\n\nEducation Secretary is the chairman of the committee and 11 others, including Health Secretary, are members.\n\nIn order to coordinate and regulate various activities connected to admission , V. Govindaraj, Director (In-charge), Indira Gandhi Medical College and Research Institute, Puducherry, will be the convener of CENTAC 2016-17, and\n\nK. Pajaniradja of Pondicherry Engineering College will be the joint convener. M. Jonathan Daniel, Mahatma Gandhi Postgraduate Institute of Dental Sciences, will be the coordinator (admission) in-charge for counselling and admission process in engineering (including the lateral entry scheme admission to B.Tech. courses) and biology based courses. The same committee shall also handle the lateral entry of students to engineering courses in various colleges.\n\nThe scheme of financial assistance through Perunthalaivar Kamarajar Financial Assistance Scheme shall be revised and notified separately taking into consideration requirement of assistance to various courses other than medical and engineering, reducing allocation to engineering courses as stipulated in the order dated October 1, 2013.", 
    "section": "national", 
    "title": "Centralised admission panel reconstituted", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}