{
    "author": [
        "R Sujatha"
    ], 
    "text": "After a gap of two years, surviving a recession that had hit even the handloom sector, Co-optex has bagged a sizeable business from overseas customers for its furnishing material.\n\nThe Tamil Nadu Handloom Weavers Cooperative Society, known better as Co-optex, has a niche clientele in Europe and in the United States. The organisation participates in the annual fair held by the European Free Trade Association. For the past two years Co-optex had felt the heat of the recession that had hit the western market.\n\n“Our handloom products are much in demand in these markets. Our clients give us designs based on themes and want us to create products. For every season their demands are different. This year the theme from a UK-based organisation was ‘Tree of life’,” said an official.\n\nIf the Scandinavian countries have sought greys and black-based table linen then another European country has sought a range of fluorescent colours. A UK-based company has gone in for whites and pastels and fuschia. These products would be available in Co-optex’s showrooms in the city too, said T.N. Venkatesh, managing director. “We have been getting enquiries from China and Romania too. Since we are able to cater to their seasonal and regional demand, we are sought out,” he said. '\n\nOne company has sent a flower vase with artwork that it wants reproduced on cloth.\n\nCo-optex has hired a designer who qualified from the Ahmedabad-based National Institute of Design to develop these products.\n\nNew products\n\nAmong the new products that have sold well abroad and in North India are the double jacquard honeycomb design bedspreads, throws and quilts. Co-optex has so far bagged around Rs. 1 crore worth of business in its export segment. The organisation has been chosen by the European Free Trade Association countries as its products comply with their norms of environmental standards in terms of dyeing, chemicals, effluents used, discharge of effluents into the ecosystem, non-use of child labour and fair wages to the weavers, Mr. Venkatesh said.", 
    "section": "national", 
    "title": "Co-optex’s handloom tag gets noticed abroad", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}