{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "It will connect lakes, Ukkadam bus stand, markets, residential areas, TNAU\n\nIf all goes as planned, Coimbatore will have a 30-km corridor for non-motorised transport (NMT) that will link most of the lakes and important places in the city in the next five years.\n\nThis is one of the major proposals in the Smart City plan submitted by Coimbatore Corporation.\n\nCorporation Commissioner K. Vijayakarthikeyan told The Hindu on Monday that the blueprint is based on the Comprehensive Mobility Plan.\n\nThese proposals will be fine-tuned and the details finalised by the special purpose vehicle that will be formed to implement the Smart City project.\n\nAccording to the report, Coimbatore has high vehicle ownership per capita and faces traffic problems on its arterial roads. The mobility plan identifies specific set of actions to address this.\n\nAt the meetings held with the public before preparing the Smart City plan too, one of the main demands was to take measures to ease the traffic problems.\n\nThe plan is to look at completing the corridor and related projects by 2020 and the outlay estimated is over Rs. 600 crore.\n\nA seamless 30-km non-motorised transport corridor and a state-of-the art bike sharing programme are signature initiatives under area-based proposal in the Smart City project here.\n\nThe corridor has been conceived as lake and park connectors with landscaping and greenery and will connect vantage points including the lakes, Ukkadam bus stand, bustling market streets, residential areas, and TNAU, the report said.\n\nDaytime non-motorised streets are planned in the market area between Selva Chinthamani lake and Perur lake.\n\nAnd eco-bridges are proposed on eight roads crossings in the corridor, according to the project proposal.\n\nThis does not require land acquisition and a study has also been done for this, he said.\n\nThe vision is to provide non-motorised transport facilities in 75 per cent of primary and secondary network in five years.\n\nThe 30-km non-motorised corridor will have dedicated biking and walking tracks complemented with green areas, landscaping utilising lake fronts, space along arterial roads, possible conversion of select streets into non-motorised streets and aesthetic bridges.\n\nAnd, it is likely that it will be implemented involving all the related departments.\n\nThe proposal also envisages increasing public transport share from 42 per cent to 60 per cent, modernise and expand the bus system, including feeder routes, and target zero accident fatalities.", 
    "section": "national", 
    "title": "Coimbatore plans corridor for non-motorised transport", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}