{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A section of students of Cheran Nursing and Pharmacy College at Telungupalayam on the Perur Main Road picketed the District Collectorate here on Monday alleging that the management did not provide them basic amenities in the college, and hostel.\n\nThe college is run by K. Palanisamy, a former MP.\n\nRajkumar, a student doing second year pharmacy said that he paid Rs. 1.5 lakh a year for the course.\n\nThere were around 850 students in the college now, he said adding that they have been fighting for basic amenities such as drinking water, toilet, and food, for the last three years.\n\n“When students took up the matter with the management, they threatened to reduce our marks in practical,” he said.\n\nThe students said that the hostel was poorly maintained. Insects from the bushes near the hostel had bitten many students.\n\nA Tasmac outlet was functioning near the hostel. Those in an inebriated condition used to harass students.\n\nThe students asked the district administration to help them get basic amenities, re-locate the Tasmac outlet.Shortage in clay\n\nEarthen workers who make clay pots, stoves, and dolls petitioned the District Collector to expedite steps to grant them permission to collect clay from Kuyavan Kuttai in Kothavadi Lake at Kinathukadavu.\n\nM. Kalidas, petitioner, said that around 150 families were into pottery works in the district.\n\nThey were facing difficulty in doing business due to the bar on mining. They should be allowed to collect 100 units of clay from the tank to continue with their works.\n\nThey said that a petition was submitted last November too.\n\nFuel price\n\nCarrying a two-wheeler on a stretcher, the Thanthai Periyar Dravida Kazhagam came to the Collectorate to ask the Collector to forward their representation on fuel price, to the Union Government.\n\nThe petition said that though the crude oil price has dropped from $145 a barrel to $30, petrol price was around Rs. 60 a litre, whereas it was Rs. 20 a litre in Pakistan, and Rs. 19 a litre in Bangladesh.\n\nThe petition condemned the Centre for increasing excise duty on fuels.\n\nLoans\n\nViduthalai Chiruthaigal Katchi has sought speedy disbursal of TAHDCO loans to Scheduled Castes and Scheduled Tribes.\n\nDistrict secretary of the party, Susi. Kalaiarasan, claimed that the government departments concerned, and officials in nationalised banks were delaying the disbursal of loans. These loans would help persons from downtrodden communities to start a business.\n\nMemorial\n\nThe Bharat Sena petitioned the Collector to press the State Government to construct a memorial at R.S. Puram for the 58 victims who were killed in the serial bomb blasts in the city in 1998.", 
    "section": "national", 
    "title": "Complaint against nursing college", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}