{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Union Minister for Urban Development and Parliamentary Affairs Venkaiah Naidu speaks at the meeting of BJP party members in Puducherry on Monday.- Photo : T.Singaravelou\n\nUnion Urban Development and Parliamentary Affairs Minister M. Venkaiah Naidu on Monday alleged that the Congress party was not allowing Parliament to function.\n\nAddressing Bhartiya Janata Party workers here, the senior BJP leader and Union Minister said “The Congress is not ready to reconcile itself with the defeat in the last parliamentary elections.”\n\n“The Congress party has been disrupting the Parliament to defame the government. Either they should talk out or walk out. If the breakdown in the Parliament continues, there will not be any democracy,” said Mr.Naidu while holding the Congress responsible for dismissal of over 100 State governments since independence and promulgation of 465 ordinances.\n\nIssue of suicide of\n\nRohit Vemula\n\nReferring to the suicide of Rohit Vemula in Hyderabad University, he pointed out that the enquiry was underway. Mr. Naidu charged the Congress party with exploiting the issue.\n\n“During the Congress regime, 10 pupils committed suicide in Hyderbad University, including Dalit boys. But Congress leaders never bothered to visit there,”he charged.\n\nListing out achievements of BJP-led National Democratic Alliance Government, Mr. Naidu said Prime Minister Modi wants a more dynamic nation.\n\nCorruption-free govt.\n\nHe added there was no corruption in the last 18 months in the higher level during BJP ruling whereas the Congress-led United Progressive Alliance faced scams related to Commonwealth Games, Coal allocation, spectrum allocation and procurement of helicopters.\n\nAsking the party workers to expand the base and reach out all sections of people including minorities,\n\nHe appealed to the party workers to take the achievements of Modi-Government to the public\n\nLater talking to reporters, Mr. Naidu expressed happiness over the membership strength of BJP Puducherry unit.\n\nAsked whether his party alliance with ruling AINRC would continue, Mr. Naidu said, “First of all, let election schedule be announced. Both the parties will sit together and decide.”", 
    "section": "national", 
    "title": "Congress does not allow Parliament to function: Venkaiah Naidu", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}