{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Commentators say only social change can bring about political empowerment\n\nWith Dalits getting only a token representation in successive Cabinets in Tamil Nadu, and parties representing the marginalised community not able to play a decisive role in electoral alliances, former VCK MLA D Ravi Kumar has triggered a debate by asking why no Dalit has been able to become a Chief Minister in the State.\n\n“I am not saying that the VCK leader Thol. Thirumavalavan must be announced as the Chief Ministerial candidate, but why a Dalit has not been able to become a Chief Minister (in a State) where the Dalit population is close to 21 per cent, while Bihar (with a Dalit population of 16 per cent) has already had a (Mahadalit) Dalit CM? Political parties and civil society must debate this point,” Mr. Ravi Kumar said in a post on his Facebook page.\n\nSignificantly, even the Left parties are yet to moot such a proposal. When asked about this, Mutharsan, CPI State secretary, which has joined hands with the VCK (a Dalit party), the CPM and the MDMK to form the People’s Welfare Front, said caste alone could not be a deciding factor in projecting a Chief Ministerial candidate.\n\n“While it is true that so far it has not been possible for a Dalit leader to be seen as a representative of people from all castes, this will change. There needs to be a social change first,” he said.\n\n‘An idealistic question’\n\nPolitical commentators and intellectuals familiar with the Dalit movement in Tamil Nadu contend that political empowerment cannot be fully achieved without social equality. “It is an idealistic question,” said professor A.R. Venkatachalapathy of the Madras Institute of Development Studies, adding that such a scenario is impossible without the Dalit parties politically mobilising the masses for the Dalit cause throughout the State. “Right now, the Dalits in the northern and southern districts are mobilised differently. Those in the south don’t see their counterparts in the northern districts as Dalits at all. We need to go through a long process of social transformation and ideological mobilisation to reach that point,” he said.\n\nPunitha Pandian, editor of Dalit Murasu , asked why the Dravidian movement, despite its achievements, is always criticised when it has actually opened up the space for Dalit politics.\n\n“We find that there are similar spaces in Uttar Pradesh, thanks to Kanshi Ram and in Maharashtra because of the influence of Dr. Ambedkar. What is the case in Kerala and West Bengal where the Left has ruled for many years,” he asked.\n\n“The Dravidian movement must be differentiated from the Dravidian parties. It is absurd to raise this question to the mainstream Dravidian parties. Like Dr. Ambedkar has already pointed out, political equality is meaningless without social equality. A party that is only identified primarily as ‘Dalit’ party will struggle to get other communities to support them,” he contended.\n\nRole of Kanshi Ram\n\nAnswering a question about how Mayawati emerged in Uttar Pradesh as the strong leader of the Bahujans in general, Ramu Manivannan, assistant professor of Politics, University of Madras, said it was possible due to the work and mentorship of Kanshi Ram, a popular leader. “Mayawati could be accepted as a leader only after consolidation and politics of Kanshi Ram. She spoke of the broad coalitions with other communities, while the Dalit community in Tamil Nadu hasn’t managed to project a cohesive political project,” he said.\n\n“The situation will change only with sustained mobilisation without allying with the DMK or AIADMK,” he felt.", 
    "section": "national", 
    "title": "Debate over why Tamil Nadu never had a Dalit CM", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}