{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stating that title deeds were not given to over 4,000 petitioners in the past four-and-half years in Mettur areas, Mettur DMDK MLA S.R. Parthiban alleged that Rs. 10,000 to Rs. 25,000 is demanded as bribe by Mettur Tahsildar for issue of title deed and he is ready to pay the money for the petitioners.\n\nThe MLA, along with supporters and a few affected people tried to enter the collectorate premises on Monday. However, police personnel prevented him and said only four persons can be allowed with him to submit petition to the Collector during the weekly grievances day redress meeting. However, the MLA along with supporters staged a sit-in protest outside the premises and later on inside the premises.\n\nThe police closed the main gate and the public and the government officials were forced to stand outside for 30 minutes. Protestors raised slogan and demanded that affected people be allowed to meet the Collector. Later, the police allowed them and the MLA submitted the petition to the Collector V. Sampath.\n\nSpeaking to reporters, Mr. Parthiban said that over 5,000 people in Kolathur and other areas were demanding free house site pattas for the past 50 years. The Mettur Tahsildar had also completed the survey of the land.\n\nBut land was not allotted even after the High Court directed to issue the pattas. “Priority is given for persons who can pay the bribe. I am ready to pay Rs. 10,000 as bribe for 4,000 petitioners. Let them give the patta”, he demanded.\n\nHe said that if title deeds are not given, he along with applicants would enter and reside in the collectorate on February 29. Later, he submitted petition to the Collector who assured to look into it. Their other demands include, issue for community certificate for Konda Reddy , relocation of Tasmac outlets in Sanathur and Chamrajpet, appointment of full-time BDO for Mecheri Union and creating the new Mecheri Taluk from the Mettur Taluk.", 
    "section": "national", 
    "title": "DMDK MLA alleges corruption in issue of title deeds", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}