{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "A. Kalaivani, who had been averse to sticker bindis, wore one out of compulsion at her sister’s marriage two years ago, little realising that she would develop a passion for collecting sticker bindis and an ambition to enter into Guinness Book of World Records.\n\nHaving entered Tamil Nadu Book of Records, India Book of Records and Asia Book of Records for possessing the ‘largest collection of bindis’, the 21-year-old woman, a postgraduate student of Annamalai University (distance education), displayed her collection of 3,000 sticker bindis here on Monday for a Guinness feat.\n\n“The uniqueness about the collection is that all the 3,000 bindis are in different designs and shapes,” Ms. Kalaivani, who developed interest in collecting old coins, different wedding invitation cards, buttons, glass bangles and pens at an young age, said. When she started collecting sticker bindis in June 2014, she found that there were hardy forty designs available in the market. But an undeterred Ms. Kalaivani began designing the bindis on her own and ended up with a huge colourful collection.\n\nAltering the sizes and shapes, she added multi-colour stones to ensure that the ‘bindis’ looked unique and different, she said. “It was an arduous task but one of my friends, S. Tahmitha Banu, encouraged me and helped me a lot,” said Ms. Kalaivani, who hails from Kalanjiam Nagar in Mandapam.\n\nAfter getting into Asian Book of Records in October last year, she entered Limca Book of Records recently for the largest collection of sticker bindis, and was awaiting the certification, she said.\n\nMs. Kalaivani, daughter of a temple priest, also won the accolade from former Collector K. Nanthakumar.\n\nRasika Riaz, a physician at AR Hospital here, inaugurated the display event for the Guinness record. Rotary Club of Golden Ramnad sponsored the event and its president G. Pragalathan and secretary G. Kalidasan were among others present on the occasion.\n\nKalaivani has already entered Tamil Nadu Book of Records, India Book of Records and Asia Book of Records for possessing the ‘largest collection of bindis’", 
    "section": "national", 
    "title": "Dotting her way to Guinness record", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}