{
    "author": [
        "Naresh Gupta"
    ], 
    "text": "With reference to reports of alleged anomalies in final electoral rolls of TN as on January 1, 2016 based on a comparison with data on population of Tamil Nadu according to Census, it may be worthwhile to mention that the Report of the Technical Group constituted by the National Commission on Population (of May 2006) said that the State was expected to have the least growth (15%) in the quarter century 2001-2026. The actual population of Tamil Nadu according to 2001 Census was 6,24,06,000, i.e. 6.24 crores roundly.\n\nThe Technical Group had projected the total population in 2011 (as on 1st March) to be 6,74,44,000 and in 2016 to be 6,93,96,000. The projected population for 18+ age-group in 2011 was indicated as 4.89 crores and for 2016 as 5.16 crores.\n\nHowever, according to Census 2011, the actual population of Tamil Nadu was arrived at 7.21 crores, that is 47 lakhs (7%) more than the projected population. The population in 2016 in proportion to which the number of electors (as on 1st January 2016) should be compared, will also be correspondingly more. However, while the actual data age-wise is available for 2011, the disaggregated age-wise actual data for 2016 is not available and, any comparison of the electorate data for 2016 with the 18+ population size can be only approximate.\n\nAccording to the Provisional Population Census Report 2011, in Tamil Nadu the Census population for 2011 for children in age-group 0+ to 6 arrived at 68.95 lakhs is less than the projected population of 69.97 lakhs indicating that the birth rate has been less than that assumed while making the projections. This would suggest that the population in the higher age-brackets and therefore, the 18+ population would be higher.\n\nThe percentage of 18+ population according to 2011 Census is arrived at about 5.14 crores, that is 71.23% of the total population of the State. Apart from birth and death rates, in and out migration is an important factor in determining the population size.\n\nThe annual compounded growth rate of population from 2001 to 2011 has been 1.46%. Assuming the same growth rate from 2011 to 2016, the projected population in 2016 (5 years from 2011) would be 7.76 crores and that of 18+ population 5.52 crores assuming the same growth rate for this segment as for the total population. Actually, the growth rate for this segment might be higher if there has been a decrease in birth rate. The electorate size according to the rolls as on 1st January 2016 is 5.79 crores. The excess may be due to the fact that when people shift or are working away from their native place, they may seek inclusion of their names without corresponding deletion in their earlier place of registration.\n\nSurplus names\n\nTo take care of the problem of surplus names in the e. rolls, comparison of photos and verification after generation of list of possible multiple entries based on name of elector, relation (spouse/ father) and age is taken up.\n\nWherever there are complaints of surplus names and specific data is given in this regard, such cases/ areas can be specially given focus and field inquiry/ verification taken up.\n\n( The author is a former Chief Electoral Officer, Tamil Nadu )\n\n‘Shifting voters\n\nmay account\n\nfor possible\n\nsurplus\n\nin data’", 
    "section": "national", 
    "title": "Electorate vs. population: is there an anomaly?", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}