{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "“Take all preventive measures and monitor the crop consistently”\n\nConsidering the prevalence of blast disease (or rice blast) in paddy crops in Thanjavur and Tiruvarur districts, Agriculture Department officials have cautioned the farmers in Madurai district to be vigilant about the disease.\n\nSpeaking to The Hindu , S. Kanagaraj, Joint Director (Agriculture), urged the farmers to take all preventive measures and monitor the crops consistently. He said that if there were any symptoms of the disease, the farmers could immediately touch base with Agriculture Department for assistance.\n\nAccording to the officials, preliminary symptoms of blast disease, caused by Magnaporthe grisea fungus, will include white to gray-green lesions or spots with brown coloured borders in any part of the rice plant.\n\nAn official said that during the monitoring taken up two weeks ago for the weekly Pest Surveillance Report, it was found that paddy crop on around 300 hectares in the district was affected. However, a week later, the area had come down by around 100 hectares due to preventive and control measures taken, he said.\n\nHe also said that the disease was more prevalent in Tirumangalam and Chellampatti regions compared to regions like Melur, Madurai East and Madurai West which come under Periyar-Vaigai irrigation system.\n\nHe added that BPT rice variety (or commonly called Andhra Ponni ) was more susceptible to the disease in these regions.\n\nTemperature conducive\n\nHe added that low night time temperatures prevailing at present in the district provided apt conditions for the spread of the fungus.\n\nOfficials said that apart from preventive measures like avoiding late planting, avoiding grasses and weeds, several chemical methods were also available to control the disease. “Affected farmers can contact us and all help and guidance will be provided,” Mr. Kanagaraj said.\n\nDuring the monitoring taken up two weeks ago, it was found that paddy crop on around 300 hectares in the district was affected: official", 
    "section": "national", 
    "title": "Farmers cautioned about blast disease in paddy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}