{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Till 2011, the Congress was the most preferred ally in Tamil Nadu commanding a vote share that was next only to the two major Dravidian parties. But this election season, the national party has been made to wait till the DMDK could make a decision on alliances, putting to halt its plans of kick-starting its poll campaign officially.\n\nKarunanidhi's assurance\n\nDMK president M. Karunanidhi had recently assured that the Congress would not be left out of the alliance equation. Sources in Congress said the DMK leadership had indicated to them that talks could officially begin only after the DMDK decides on its preference.\n\nA senior leader in Congress said the DMDK’s “tactical game of wait and watch” has put the breaks on moving forward in the alliance talks with DMK. “The DMK feels unless the DMDK categorically says yes or no, initiating seat sharing talks was impossible,” the leader added.\n\nCongress not able begin campaign\n\nThis means the Congress is unable to begin its electoral campaign officially since it is not too clear about the position to take. “Only if it is confirmed that we are in an alliance with the DMK could we spare it from criticism. Otherwise, we will also have to take up the position of an alternative to the two principal Dravidian parties,” the leader pointed out.\n\nThe Tamil Manila Congress (TMC) also finds itself is in a similar position. Its president G.K. Vasan has strategically stated that he would decide on alliances by February-end after finishing his tour of the State. But both the AIADMK and DMK are yet to openly indicate if they want the TMC in their front. The party has a standing invitation from the People's Welfare Front.\n\nCommenting on the situation, TMC vice president B.S. Gnanadesikan said the party has never suspended its campaign and meeting the people was a continuous process.\n\n‘Tie up only one aspect’\n\n“Alliance is only one aspect of the elections. Even as we speak, Vasan is touring multiple constituencies,” he claimed, adding that there was enough time for finalising electoral pacts. Also, he said it was not necessary for a political outfit to make public every aspect of its electoral strategy.\n\nCongress has been made to wait till the DMDK could make a decision on alliances", 
    "section": "national", 
    "title": "Indecisive DMDK affects Congress, TMC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}