{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Industrialists running Micro, Small and Medium Enterprises were sensitised to the importance of filing Udyog Aadhaar Memorandum (UAM) introduced last year by the Central Government for ease of doing business, during a CII program: MSME Meet 2016 – ‘Strategizing for Business Excellence’ organised by the Confederation of Indian Industry - Erode Zone, here on Saturday.\n\nThe CII teamed up with Erode District Small Industries Association (EEDISSIA) & Micro, Small & Medium Enterprises (MSME) Development Institute to orient over 100 industry / institute members on the ideal approach to succeed in their ventures in the current industrial and business scenario.\n\nS.M. Rasumani, General Manager, District Industries Centre, explained that UAM replaces the filing of Entrepreneurs' Memorandum, considered cumbersome by many.\n\nLast September, the Central government had notified that every MSME unit had to file UAM under the MSME Development Act, 2006, deeming it a path-breaking step to promote ease of doing business. Entrepreneurs in the MSME sector now only have to file a simple one-page UAM onhttp://udyogaadhaar.gov.into instantly get a unique Udyog Aadhaar Number (UAN). The information sought is on self-certification basis. Individuals could file the UAM with their Aadhaar number. In exceptional cases where the individual does not have an Aadhaar numer, the UAM can be filed in a paper form at the office of the General Manager, District Industries Centre.\n\nThe initiative envisages unlocking the potential of MSMEs alongside improving India's international ranking in doing business index.\n\nMSMEs, Mr. Rasumani said, account for 40 per cent of total production and most of employment generation.\n\nR. Balasubramaniam, EEDISSIA president, emphasised on MSME’s role in economic growth, and said there must be more focus on quality, and improvements in manufacturing process.\n\nKKSK Rafiq, Chairman, CII Erode Zone; D Venkareswaran, past chairman; and VPS Radhakrishnan, Managing Director, Angel Starch & Food Pvt. Ltd, also addressed the gathering.", 
    "section": "national", 
    "title": "Industrialists learn about advantages inherent in UAM", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}