{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Over 300 people from 23 villages under South Valliyoor panchayat submitted a petition to Collector M. Karunakaran here on Monday, urging him to cancel the beneficiaries’ list prepared by the rural civic body for giving free houses to be built under Kudankulam Nuclear Power Project (KKNPP) Neighbourhood Development Programme.\n\nThe petitioners, led by vice-president of South Valliyoor panchayat S. Sivabalan, said that the district administration had planned to construct 261 houses in the 23 villages under the panchayat under the second phase of KKNPP Neighbourhood Development Programme, being implemented on an outlay of Rs. 500 crore.\n\nInstead of identifying the right beneficiaries, village panchayat president P. Inba Thangaraj had allotted houses to those who had already owned more than a house while those below poverty line living in rented, thatched houses had been left out.\n\n“The beneficiaries’ list was not placed in the gram sabha meeting for its approval, and we came to know about the names of the beneficiaries after the list was published online. After all the 261 beneficiaries were compelled to pay anywhere between Rs. 15,000 and Rs. 20,000 as bribe, the orders for receiving free houses have been disbursed,” alleged Mr. Sivabalan.\n\nHe also said that the panchayat clerk, who was against this corrupt practice, had been transferred.\n\nOne of the beneficiaries, who had got the order reportedly after giving bribe, charged that she had been forced to give the contract for constructing the house to Mr .Thangaraj. “Besides, Rs. 3 lakh to be released from the KKNPP Neighbourhood Development Programme, I was compelled to give another Rs. 1.30 lakh for construction of the house,” said the woman, who admitted that she had already owned a house.\n\nMr. Sivabalan said that the Collector, besides cancelling the beneficiaries’ list, should order a thorough probe into the irregularities involved in this issue, and prepare a list afresh in a transparent manner so as to benefit the deserving people.", 
    "section": "national", 
    "title": "Irregularities alleged in KKNPP free housing project", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}