{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Taking it to the street:(Top) JACTTO members blocking AMC Road in Dindigul on Monday. (Above) A protest in Ramanathapuram.— Photo: L. Balachandar\n\nThey demand pay parity with Central government staff, among other things\n\nMore than 2,000 teachers and members of Joint Action Committee of Tamil Nadu Teachers’ Organisation (JACTTO) were arrested when they staged a demonstration and later blocked AMC Road here on Monday, pressing for their 15-point charter of demands.\n\nAddressing the gathering, JACTTO High-Level Committee member P. Patrick Raymond said that political parties that wished to have “alliance with the JACTTO” alone would win in the Assembly election. The JACTTO had one crore votes. The State government should take efforts to fulfil their demands, he said. The JACTTO members had been pressing the government for the fulfilment of their demands for the past five years. But the government did not even invite the association leaders for talks, he noted.\n\nThe members also demanded pay for primary, graduate and postgraduate teachers on a par with the Central government staff, implementation of old pension scheme and scraping of new pension scheme, and regularisation of pay for teachers who were appointed on contract basis. Appointment of a special officer to implement various welfare schemes, periodical promotion, cancellation of teachers eligibility test and continuation of advance of selection grade and special grade were other demands.\n\nTheni\n\nHundreds of teachers and members of JACTTO staged a demonstration in front of the Collectorate here on Monday morning. A total of 1,371 primary schoolteachers and 588 graduate and postgraduate teachers were absent from work. Government schools were functioning with skeletal staff.\n\nRamanathapuram/Sivaganga\n\nAbout 2,000 members courted arrest, ending their three-day picketing agitations in the two districts.\n\nJACTTO district secretary V Ramamurthy claimed that majority of the government schools remained closed.\n\nOfficial sources, however, said that all the more than 1000 schools remained open and the students were managed by Block Resource Centre teachers, Parents Teachers Association members, anganwadi and noon meal workers. In Sivaganga, more than 700 teachers courted arrest.", 
    "section": "national", 
    "title": "JACTTO members court arrest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}