{
    "author": [], 
    "text": "Ensure free passage\n\nThis refers to Prime Minister Narendra Modi’s visit to Coimbatore on February 2.\n\nI wish to point out that the students of Coimbatore Medical College are taking their university examinations in the afternoon. The college is situated on Avanashi Road near the Coimbatore Airport, and very close to the Codissia Grounds where Mr. Modi is to address a meeting.\n\nAuthorities concerned should ensure safe passage of the students to the college around that time.\n\nJ. Victor,\n\nAditya Apartments, Trichy Road.\n\nCitizens’ initiative\n\nOne of the key development proposals of Prime Minister Modi is the creation of several Smart Cities in the country. Tamil Nadu should be happy that its capital Chennai, and its well-developed city of Coimbatore have found a place in the first list itself. While the civic body takes care of the city’s infrastructure needs, and overall development, we, the residents of Coimbatore, can take a pledge to do our best to keep the city clean and eco-friendly.\n\nK.D. Viswanaathan,\n\nThadagam Road.\n\nBus stop\n\nA bus stop was established near the Tangedco office on Perur main road, Selvapuram, in 2013. Initially all buses used to stop there. Slowly many buses started skipping the stop much to the ordeal of passengers. Nowadays women carrying children, or aged persons have to walk all the way to the next bus stop about 1 km away to catch a bus. Every day quarrels break out between passengers, and bus conductors who are adamant on skipping this stop. Authorities concerned should take stringent measures to implement their own order, and take action against erring drivers and conductors?.\n\nR. Jayapal,\n\nSri Ramakrishna Institute of Technology, Pachapalam.\n\nBus pass\n\nThe TNSTC has a schemes of providing tickets at Rs. 50 for a whole day, Rs. 300 for a week, and Rs. 1,000 for a month. Most of the citizens are not aware of the scheme as it is not advertised properly. The corporation should take action to give the scheme wide publicity.\n\nV. Douglas kirpa raja,\n\nThennampalayam.\n\nRace Course\n\nThe civic body deserves kudos for making the walkers’ path at Race Course very conducive even for senior Citizens.\n\nI wish to bring to the notice of authorities concerned that lights installed along the path are not burning properly. This results in chain snatching incidents, and harassment of women.S.C. Jayakumar,\n\n213, Race Course.\n\nUzhavar sandai\n\nAuthorities concerned should take steps to start an Uzhavar Sandai in Coonoor. The citizens now depend on a market here for sourcing vegetables, and fruits. We are forced to pay the prices fixed by the vendors there, which are higher when compared to the prices at Uzhavar Sandai.\n\nG. Rajesh Gopal,\n\nArauvankadu, Coonoor.", 
    "section": "national", 
    "title": "LETTERS (UNEDITED)", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}