{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Film-making competitions, debates, and city tours marked the fourth day of Coimbatore Vizha.\n\nThe movie-making competition, organised by UTV, saw 50 teams presenting short films on themes relating to Coimbatore.\n\nThe five selected movies are to be screened on February 4 at Brookefields mall, during the finale of the Vizha .\n\nMovie buffs also had the option of going on a cinema tour organised by the Vanavarayar Foundation which included places such as Central Studios, Pakshiraja Studios, Delight Theatre and Royal Theatre.\n\nAccording to a release, over thousand school children took part in the Coimbatore Vizha city tour that covered “Coimbatore through Ages” at Lakshmi Mills, “Incredible Coimbatoreans” at Tamil Nadu Mercantile Bank Bungalow, Town Hall, “History of Sarvajana” at PSG Sarvajana Higher Secondary School, “Raja Ravi Varma Art Exhibition” at Jenneys Residency.\n\nThe day also included a campus tour of Tamil Nadu Agricultural University to showcase the architectural heritage of the university, as well as the research and innovations that have happened since its inception.\n\n‘Let’s Talk: The Politics of Food’, a discussion on the influences of policy, politics and economics on food growth, distribution and the future of food sovereignty and ‘Coimbatore - Indru Netru Naalai’, a discussion on Coimbatore’s past, present and future were conducted.\n\nK.Vijayakarthikeyan, Commissioner, Coimbatore Corporation, visited Brookefields mall where various Grammiya Kummi Kolattam, Night at Museum (International Dances), and Traditional dances were performed.\n\nMarathon\n\nThe Commissioner also launched ‘My India Marathon 2016’, an awareness marathon for 100 per cent polling to be held on March 4. India’s Tennis star Sania Mirza will take part in the marathon.", 
    "section": "national", 
    "title": "Movies, tours mark Coimbatore Vizha’s fourth day", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}