{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "India's F1 driver Narain Karthikeyan interacting with the children of Aravanaikum Anbu Illam at Jenney's Club in Coimbatore on February 01, 2016, as part of Coimbatore Vizha.— Photo: M. Periasamy\n\nIndia’s ace Formula One driver Narain Karthikeyan is out of his hometown for most part of the year. One cannot blame him as his racing commitments are such.\n\nSo it was a refreshing change for once to see the Indian racer spending a jolly good time with the children, as part of the Coimbatore Vizha celebration, at the Jenneys Residency here on Monday.\n\nOrganised by Young Indians (Coimbatore Chapter), the one-hour event saw Narain speak his heart out about racing – from fitness to fast lane.\n\nAbout 50 children, who had turned up from the Aravanaikum Anbu Illam here, were also thrilled to shake hands with the champion driver.\n\nAnd, Narain did not disappoint them. He distributed autographed caps to each one of them and posed for a rare photo of two as well.\n\n“I love children, but I don't get to spend time with them. So this occasion was something very special for me,” he said.\n\n“I always liked kids. I think I interact with them much better. Added to that, I am now a father as well,” he quickly added. And, he has named his junior Neel Karthikeyan.\n\nNarain said the city was a great place to live in. “As a 14-year-old, I left Coimbatore to pursue my career as a professional racing driver. But I always look to come back and spend happy time with my family and friends.”\n\n“Coimbatore is a great little city. It used to be a relaxed place once not any more. It is also the fastest growing after Chennai. And as it grows, bottlenecks happen, but I believe it is only short term,” he added.\n\nHowever, the fastest Indian in the world pointed out that driving on Indian roads has now become more dangerous than driving a race car.\n\nThe organisers also had some special video clippings about Narain for the audience. After the video session, Narain interacted with the crowd and answered all their questions. He also had some words of advice for the children.\n\n“Everybody has got talent, but one should know how to harness it and also grab the opportunities that come his / her way.”\n\n“Luck also plays a huge part and I was lucky as well. In fact, that has helped me represent my country in the pinnacle of world motor sport,” he said.\n\nIt was not an easy road to the top for Narain.\n\n“I have had many bad days. I have gone through failures, but I never look back at them because I believe there is always a light at the end of the tunnel.”\n\n‘Everybody has got talent, but one should know how to harness it and also grab the opportunities that come her way’", 
    "section": "national", 
    "title": "Narain Karthikeyan charms young hearts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}