{
    "author": [
        "S Poorvaja"
    ], 
    "text": "The Pallikaranai marsh came into focus in December when large tracts were dry just a few days after the floods —Photo: Shaju John\n\nEnvironmentalists and naturalists decry a key-hole view of conserving wetlands. Protection of any major wetland is possible only if the health of buffer wetlands around it is taken into consideration.\n\nSimilarly, the pollution levels in the whole region and threat from encroachments have to be factored in.\n\n“There is no point in calling a place like Pallikaranai a wetland if no cognizance is taken of the pollution the whole area is subjected to. Instead of simply focussing on the wetland alone, the buffer wetlands around it, which are 32 in number, need to be treated as ecological extensions with equal importance,” said Jayashree Vencatesan, founder of Care Earth Trust.\n\nThe Trust, which had worked on an adaptive management plan for the conservation of the marsh, stressed on the need for people to be a major part of the process.\n\nEven though the northern side of the wetland has becoming a dumping spot for garbage, the southern side, which has fresh water flowing into it, has been a home for many rare migratory birds.\n\n“From clearing out weeds to ensuring that there are no obstructions for the water which flows into the wetland, attention should be given to ensuring water retention in Pallikaranai. With several birds making the place their home, it is the best we can do to ensure that the ecosystem is protected,” said K.V.R.K. Thirunaranan, founder of The Nature Trust, adding that the wetland attracted over 140 species of birds.\n\nThe area came into focus, when after being flooded in the first week of December, large tracts of the wetland were suddenly almost dry a few days later.\n\nThe tranquil Pulicat lake, which is the second largest brackish water lake in the country, has long been attracting people as well as winged visitors.\n\n“Despite having all the necessary characteristics, the place has not been declared as a Ramsar Site. Such a declaration would have probably assisted efforts to protect it,” noted T. Murugavel, a naturalist. Stating that the at least 10 km of the area around Pulicat should be declared as a ‘No-development zone’, Mr. Murugavel pointed out that the Nellapattu channel as well as other surrounding tanks, which are breeding spots for birds, were being appropriated for other purposes.\n\n“Many birds roost and nest in the surrounding wetlands and come to the lake for feeding. Many of these places are being earmarked for real estate and other development,” he said.\n\nIn a similar context, environmentalists pointed out that agricultural lands surrounding Vedanthangal, which are also considered wetlands, were being fast taken over for other purposes, robbing migratory birds of their food source, including insects and reptiles.\n\nThe southern side of the Pallikaranai wetland has been a home for many rare migratory birds", 
    "section": "national", 
    "title": "Needed, a comprehensive view of conservation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}