{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Residents of Oulgaret municipality are disappointed over the Centre not including Oulgaret in the first list of 20 cities selected for the smart cities project. Terming it unfortunate, they also said that the move has deprived fund-starved Puducherry of an opportunity to receive developmental assistance besides making futile the efforts, hard work and planning of officials.\n\nThe selection of 20 cities by the Union government has been made by evaluating the smart city proposal submitted by each State made using three independent panels comprising national and international experts, organisations and institutions.\n\nThe committees had awarded scores to each city on the basis of well-defined and transparent criteria — feasibility and cost effectiveness, citizen participation, smartness of proposals, strategic plans, vision and goals.\n\nThe cities that have made it to the first list have secured a score ranging from 55.47 (Bhopal) to 78.83 (Bhubaneswar). Besides Puducherry, the States which do not figure in the list are Bihar, Haryana, Jharkhand, Uttar Pradesh (where Prime Minister’s constituency lies), Telangana, Chhattisgargh and Jammu and Kashmir.\n\n“There was absolutely no scope for the Centre to interfere in the selection and, therefore, neither the Chief Minister nor the Lt Governor could have played any role in the inclusion of Oulgaret. Perhaps they may be faulted for their casual approach and not being smart in preparing a smart proposal involving experts, including the French experts,” said former Member of Parliament and AIADMK functionary M.Ramadass.\n\nUrging the government to prepare for the second round of competitive challenge by improving the earlier Smart City proposal in the light of the comments offered by the Centre, he also said Puducherry should consider engaging a French expert at this stage besides improving its strategic plans and vision.\n\nPolitical parties also said that without the elected local body in place, Puducherry may not become a smart city at all. To ward off this eventuality, the Chief Minister should shed his innate aversion to local bodies.\n\nUpset over Centre not including its name in the first list for smart cities project", 
    "section": "national", 
    "title": "Oulgaret residents a disappointed lot", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}