{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Study for the next phase of the UGSS is nearing completion\n\nIn the first phase, the underground sewerage network has been laid for a distance of 30 km in the town.- Photo: C. Venkatachalapathy\n\nAn underground sewerage network has become a reality for parts of Vellore Corporation. The much-delayed underground sewerage scheme (UGSS) works in the Corporation has been completed, and study for the next phase of the project is nearing completion.\n\nWork on establishing the underground sewerage network commenced in 2009. The project has been completed at a cost of Rs. 40 crore. With Vellore Corporation consisting of 60 wards, this first phase of works covered 24 of the 48 wards of the erstwhile Vellore Municipality.\n\n“In this first phase, the underground sewer network has been laid for a distance of 30 kilometres in the town. With the works completed, we have provided 49 sewer connections – nine houses and 40 commercial connections so far,” Janaki Raveendran, Commissioner of Vellore Corporation said.\n\nUnder this project, a 10.280 mld capacity sewage treatment plant has also been constructed near Muthu Mandapam.\n\nWhen the pipe-laying works reached the National Highway 234, the works were taken up in four segments – National Theatre to Makkan junction, North police station to Arya Bhavan, Arya Bhavan to SP bungalow and SP bungalow to Arni Road. “The stretches where the sewerage works have been carried out has been handed over to the National Highways Department to take up repair and relaying works,” she added.\n\nNext phase\n\nA private consultancy firm has undertaken study for expanding the UGSS to the rest of the Corporation wards. The study has been completed and the local body has sought a few final changes.\n\n“The detailed project report will be submitted in a few days. This will cover the remaining wards of the Corporation.\n\nThe sewerage system for the entire Corporation will be established in a phased manner,” she added.\n\nMs. Raveendran said the application forms for getting UGS connections are available at the Old Corporation office on Anna Salai and new Corporation building on Infantry Road.\n\n“Once the applicants submit the filled-in forms, the Corporation’s field staff will visit the place to check for the type of building and type of connection applied for. They will inform the applicant of the amount to be paid for getting the connection,” she explained.", 
    "section": "national", 
    "title": "Parts of Vellore Corporation get underground sewerage", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}