{
    "author": [
        "R Rajaram"
    ], 
    "text": "Those who have completed three years of service transferred\n\nWith the announcement of Assembly elections round the corner, the police are getting ready for the election having compiled necessary information including manpower.\n\nEven as the Election Commission is yet to announce the date for Tamil Nadu, the mass transfer of field-level police officers serving in the central and south zones has been initiated.\n\nThe State police headquarters issued an order a few days ago transferring 35 Inspectors of Police serving in various districts falling under the central and south zones.\n\nThis has been done as per the guidelines of election norms with the order having been communicated to top police officers in both zones besides the Tiruchi City Police and Madurai City Police Commissionerate.\n\nAmong those transferred in view of the forthcoming election, includes 10 Inspectors of Police serving in Tiruchi City, police sources told The Hindu .\n\nThe 10 inspectors, as per the order, have been posted to the Central Zone encompassing eight districts. They would be replaced by their counterparts from neighbouring districts.\n\nFive Inspectors from Pudukottai district and one each from Ariyalur, Thanjavur, and Nagapattinam districts have been transferred and posted to Tiruchi city which is headed by commissioner in the rank of Inspector-General of Police.\n\nFourteen more inspectors serving in Thanjavur Range comprising Thanjavur, Tiruvarur, and Nagapattinam districts have been transferred as they have completed three years in their present place of posting.\n\nSome police inspectors serving in southern districts such as Dindigul, Madurai, and Theni districts have been transferred to Madurai City and a few others from Madurai City have been transferred to South Zone.\n\nPolice sources said the State police headquarters had sought a slew of information from every district, including manpower and polling booths.\n\nAccordingly, the existing manpower strength particulars of each district in the central zone had been kept ready. The sources said information pertaining to the number of polling booths, the number of locations, critical and vulnerable booths and the number of counting centres were being compiled.\n\nThe data would be forwarded to the Office of the Director-General of Police. The sources said an Election Control Centre would be constituted in every district. The inspectors, sub-inspectors, special sub-inspectors, and constables had been nominated for the Election Control centre.\n\nA high-level meeting regarding the ensuing elections would be held in Tiruchi on February 5 which would be presided over by the Chief Electoral Officer Rajesh Lakhoni.\n\nDistrict Collectors and Superintendents of Police of the central zone would take part in the meeting, the sources added.\n\nGROUND WORK\n\nDistrict police units have been asked to provide data on manpower, number of polling booths\n\nA high-level official meeting likely to be held on February 5 in Tiruchi by Chief Electoral Officer", 
    "section": "national", 
    "title": "Police go into poll mode", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}