{
    "author": [
        "S Prasad"
    ], 
    "text": "As many as 200 persons likely to be recruited exclusively for it, says CM\n\nChief Minister N. Rangasamy awards a special grade to a police officer at the launch of MITRA in Puducherry on Thursday. (From left) IG Praveer Ranjan and Chief Secretary Manoj Parida are in the picture.— Photo: S.S. Kumar\n\nThe government has proposed to create a separate cadre of Coastal Security Home Guards in the Police Department. As many as 200 persons will be recruited to work exclusively in the Coastal Security Home Guards, Chief Minister N. Rangasamy has said.\n\nApp launched\n\nHe was speaking at the launch of Mobile Initiated Tracking and Rescue Application (MITRA), a mobile application for the safety of women here on Thursday. “The crime rate in Puducherry has considerably decreased when compared to the previous year,” he said, adding that the government was committed to providing all the required facilities for the police force.\n\nLaunching MITRA, Lieutenant Governor A.K. Singh called for increasing the proportion of women police personnel in the Puducherry police force to 33 per cent. At present women police personnel account for just 5 per cent of the total force and this is not enough, he said.\n\nIn Andaman, the percentage of women police in the force was around 19 to 20 per cent. Around 90 per cent of the Traffic police personnel in the Andaman constituted women.\n\nPointing out that women and girls were not coming forward to join the police force in Puducherry, he said that they should take pride in wearing the uniform and come forward to join the force. He also asked the Inspector General of Police to ensure that more women are enrolled in the police force.\n\nAs the MITRA can only be used in smartphones, he asked the developers to devise a similar application for ordinary phones so that women can use it to seek help.\n\nInspector General of Police Praveer Ranjan said that the Police Department had established and notified Crime against Women cell which would be headed by a Superintendent of Police in Puducherry.\n\nThis is a new post which has been created as per the directions of Ministry of Home Affairs. The MHA has already notified the cell and steps have been initiated to post officers in the cell, he said.\n\nMr. Ranjan said that MITRA had additional features and was better when compared with other safety applications. Safety of women has always been a top priority for the Puducherry police.\n\nMobile Initiated Tracking and Rescue Application (MITRA) to assist in the safety of women launched", 
    "section": "national", 
    "title": "Proposal to create Coastal Security Home Guards cadre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}