{
    "author": [
        "B Kolappan"
    ], 
    "text": "VCK leader says Dravidian parties did not give Dalits key posts\n\nViduthalai Chiruthaikal Katchi (VCK) leader Thol. Thirumavalavan broke his silence on his party leader’s demand for announcing a Dalit as a Chief Ministerial candidate, saying that the issue of electing a Chief Minister on behalf of the People's Democratic Front (PWF) would be decided after the outcome of the 2016 Assembly polls.\n\nHe, however, justified the aspirations of his partymen, including general secretary Ravikumar, who first wrote about the issue on Facebook in 2014.\n\n“They have initiated a debate on making a Dalit Chief Minister of Tamil Nadu and it has nothing to do with Thirumavalavan, the leader of the VCK. When States like Maharashtra, Bihar, Andhra Pradesh and Uttar Pradesh have made it possible for a Dalit to become a Chief Minister, why we are not able to even initiate a debate on the subject? We are actually posing the question to the two Dravidian parties – the DMK and the AIADMK – that have alternatively ruled the State,” Mr. Thirumavalavan told The Hindu .\n\nThe VCK leader, who is part of the People's Democratic Front (PWF), said his party leaders did not have any ulterior motive in raising the issue, since the question of projecting a Chief Ministerial candidate on behalf of the PWF was already discussed.\n\n“We decided that there was no need to announce it before the elections. We may reopen the issue if a new party comes forward to join our alliance. But so far we are firm that the Chief Ministerial candidate should be elected only after the elections,” Mr. Thirumavalavan said.\n\nHe said in a democracy, the selection of a Chief Minister should take into consideration the number of seats won by the political parties that came together to contest the election on a common platform. “We are not going to contest in an equal number of constituencies and even if we follow the procedure, we may not win an equal number of seats,” he explained.\n\nMr. Thirumavalavan, however, wondered why Dalits, who accounted for 20 per cent of the population and whose participation in polling has always been enthusiastic, were never considered for any important portfolios by the Dravidian parties and for the district secretary post, while members of other communities enjoyed Cabinet berths disproportionate to their population.\n\n‘An exploited lot’\n\n“Dalits are exploited like the landless agriculture labourers in politics and their work and contributions are never duly rewarded by political parties,” he charged.\n\nHis point of view is that said that the Congress, if they had a chance to continue in power in State, might have made a Dalit Chief Minister. “The party had nominated two Dalits as its State presidents – L. Ilayaperuman and Maragadham Chandrasekar – and allotted important Ministries to the members from the Dalit community: Kakkan for Home and Parameswaran for the Hindu Religious and Charitable Endowments Department.", 
    "section": "national", 
    "title": "‘PWF will decide CM candidate after polls’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}