{
    "author": [], 
    "text": "Bad condition of roads\n\nIt is disturbing to note that fatal road accidents are on the rise in Tuticorin, Tirunelveli and Kanyakumari districts. The Tuticorin-Tirunelveli road, Tirunelveli-Tiruchendur road and Tirunelveli-Nagercoil road are vulnerable to accidents for various reasons like bad condition and high-speed driving. Further, the traffic volume is high in places like Tiruchendur, Kanyakumari, Tuticorin, Nagercoil, Tirunelveli, Marthandam and Kaliyakkavilai. I request the authorities to take urgent steps to improve the condition of roads and safety measures in Tuticorin, Tirunelveli and Kanyakumari districts.\n\nP. Senthil Saravana Durai,\n\nVazhavallan.\n\nSparse sparrows\n\nIn Chennai, Sadhana Rajkumar and many other sparrow conservationists have taken efforts to increase the population of this passerine bird [Jan 28]. The sparrow population in Tirunelveli has also declined considerably over the last few years. According to some ornithologists, two native species have been extirpated in India and 82 species are globally threatened. The main problems for the decline of population of these birds are absence of resting and roosting places and lack of food. To conserve sparrows and other passerine birds, we may set up wooden nest boxes for the birds to rest. In apartments and government offices too such boxes may be fixed. Also interested school students may be enlightened to conserve sparrows and other native species by conducting debates and rallies.\n\nP. Victor Selvaraj,\n\nPalayamkottai.\n\nVehicle parking\n\nIn Tuticorin, the only two arterial roads running east to west are meant for one-way traffic. Since these roads are narrow, traffic is allowed only on one way. Parking of vehicles on West Great Cotton Road, which runs from Chatram bus stop to Beach Road, is allowed on the northern side. Since all vehicles ply from west to east, they naturally take the northern side of the road. When half of the road is blocked by parked vehicles, city buses stop away from the centre of the road. This makes it very difficult for passengers to board buses standing in the middle of the road. When vehicles arrive in succession, they form a queue. To change this situation, parking can be shifted to the right side of the road to allow free movement of traffic on the left. It is my request to the authorities concerned to modify the parking arrangement on Great Cotton Road and West Great Cotton Road.\n\nK. Ramachandran,\n\nTuticorin.\n\nBe disabled-friendly\n\nCertain nationalised banks in Palayamkottai and Tirunelveli are functioning on the first floor of buildings and are not friendly to physically challenged people. I have noticed senior citizens finding it difficult to use staircases. Even many banks that function at the ground level do not have ramps with hand rails. I request that needful measures are taken to alleviate the annoyance and exertion caused to bank users with disabilities.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai.\n\nVital road project\n\nThe Union Minister of Road Transport and Highways Nitin Gadkari laid the foundation stone for the Nagercoil- Thiruvananthapuram four-lane National Highway project at Marthandam on January 19. The effort taken by Pon. Radhakrishnan, the Minister of State, is really commendable. This stretch of the road is part of NH 47, from Salem to Kanyakumari. Trucks carrying goods to Kochi port and Coimbatore, ambulances carrying patients to hospitals in Thiruvananthapuram and other vehicles would save a lot of precious time and fuel, if the four-lane work is completed. Considering the overall development and connectivity, this project must be supported by everyone. The governments at the Centre and State should expedite work on this project.\n\nG. Stanley Jeyasingh,\n\nNagercoil.\n\nKKNPP reactors\n\nI support the statement made by former Chairman of the Atomic Energy Regulatory Board Gopalakrishnan that the Kudankulam Nuclear Power Plant is not safe without proper 'quality check.' (Jan 31). He has also reiterated that the reactor is one of the dangerous reactors in the country. He has alleged that the components that went into the construction were not checked properly for quality. The same allegations were being made by various organisations that are protesting the functioning of the nuclear reactors from the beginning. In such a confusing and unclear situation, sanctioning two more reactors by AERB is highly unfortunate.\n\nS.J. Sylvestine,\n\nKoottapuly.\n\nLay new roads\n\nRoads of Kanyakumari district are more than a century old. The number of vehicles plying on these roads is multiplying, leading to traffic snarls. There is no scope of easing traffic congestion in towns of Kanyakumari district unless new roads are laid and the existing ones widened. As the traffic problem in Kanyakumari district has become a burning issue the district administration should tackle it with prompt action.\n\nK. Chelliah,\n\nAundivillai.\n\nOpen more ATMs\n\nThe Tirunelveli branch of UCO Bank is situated on S. N. High Road. Though it is one of the major nationalised banks, it is functioning with only one branch for the entire Tirunelveli Corporation area. Thousands of its customers and corporation pensioners have to visit the branch for transacting their business from far off places. Further, except the ATM installed in the ground floor of its premises, no other ATM of the bank is available in other pats of the city. Though banks are functioning with a number of branches and ATMs in Tirunelveli, the UCO Bank has not considered opening either additional branches or ATMs in the city.\n\nSince the UCO Bank's own ATM is not available in Palayamkottai and other areas, customers are forced to use the ATMs of other banks for drawing money. While doing so, the UCO Bank deducts an extra amount from the accounts. Hence, in the interest of its customers, it is requested that the UCO Bank may consider opening another branch in Palayamkottai area and also install additional ATMs in Palayamkottai and other parts of the city.\n\nS. Nallasivan,\n\nTirunelveli.\n\nLoudspeaker menace\n\nIn the children’s park at Chinnamani Nagar, the noise from loudspeakers is unbearable whenever sports events are conducted. The noise causes much distress to residents and inconvenience to children, aged, sick people and students preparing for public examinations. I request the Corporation authorities to take steps to curb this menace.\n\nP.Selwyn Basker,\n\nThoothukudi.", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}