{
    "author": [], 
    "text": "Bridge in bad condition\n\nThe over bridge adjacent to Madura Coats is in a very bad shape. Especially, the entry point near Madura coats is almost like a pit. Even four-wheeler riders find it very difficult to negotiate the entry point.\n\nMoreover, the bridge is having a lot of potholes putting the lives of road users at risk.\n\nAlready, the bridge is very narrow and with the bad condition prevailing now, it will cause damage to both riders and vehicles. The need of the hour is the action to be taken on a war footing to protect road users.\n\nS. Muthukumarasamy,\n\nBalasubramaian Nagar.\n\nBurning of garbage,\n\na health hazard\n\nIt is rather unfortunate that people throw away domestic waste on unfenced vacant sites with careless abandon. Although, the collection, transportation and disposal of solid waste are the obligatory functions of the City Corporation, they are not removed by sanitary workers who every now and then heap them up and burn them.\n\nConsequently, the entire area is engulfed in toxic smoke forcing the residents to breathe unhealthy air. Needless to say that when the air gets polluted, it impacts the respiratory system of even healthy people. And the predicament of those with lung and heart diseases can well be imagined than described.\n\nIncidentally, it is regrettable that this un-scientific practice continues unabated notwithstanding the Mayor stating that the focus should be on garbage removal in all wards and stern action should be taken against those who burn it.\n\nOne therefore hopes that the situation will get remedied soon.\n\nV. Krishnamoorthy,\n\nNarayanapuram.\n\nShift electric poles\n\nto the road edge\n\nElectric poles standing in the middle of the New Jail Road cause hindrance to traffic and pose grave threat of road users.\n\nThey have not been moved to the margin even after widening of the road. Will the authorities look into this matter and shift the poles to the road margin?\n\nG. Chitti Babu,\n\nVelmurugan Nagar.\n\nII\n\nThe electric pole in front of Indian Bank, Nagamalai branch, is in a damaged condition. The steel rods of the pole are exposed and the pole should be replaced to avert accidents.\n\nS.N.M.T. Nagarajan,\n\nGurusamy Nagar.\n\nInclude junctions\n\nThanks for giving relief to road users by relaying the Kaalavasal-Palanganatham road. But it is very sad to note that junctions where streets branch off have been left out. I request the Corporation officials to include the junctions also in the road widening project.\n\nD.S.M. Mohaideen,\n\nVelmurugan Nagar.", 
    "section": "national", 
    "title": "Readers’ Mail (Madurai)", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}