{
    "author": [
        "K Lakshmi"
    ], 
    "text": "A group of professors decided to kickstart their retired life by passing on their knowledge to school teachers who want to hone their teaching skills and boost their confidence.\n\nThe session at Dr. B.M. Sundaravadanan Matriculation Higher Secondary School, Shenoy Nagar, appears more like an after-school chat among teachers.\n\nInstead of the usual refresher course routine, the professors, belonging to University Women’s Association and Women’s Voluntary Service, made the sessions more of an interactive.\n\nThe school run by Thiru. Vi. Ka-Mu .Va. Educational Trust has over 1,700 students who are mostly first-generation learners.\n\nNearly 60 teachers participate in the training sessions to improve their spoken English and refresh teaching techniques.\n\nR. Shobana, who initially hesitated to spend an hour daily, started enjoying the sessions.\n\n“I am able to communicate better in English. This has helped boost my confidence,” she said.\n\nThe teaching sessions do not have a set syllabus and the topics vary from philosophy to personal issues. But, the only condition is that participants must sustain the hour-long conversation in English.\n\n“Four of us take turns in hosting the sessions. We just correct their pronunciation and grammatical errors and try to root out the fear,” said Ambika. T., former Head of English department, Meenakshi College.\n\nThe teachers also read poems and discuss different techniques to teach a lesson. A.Thangam, another participant, said: “I learnt how to summarise and explain lessons in simple sentences to make students understand better. I am more confident beyond the classroom and feel a change in confidence levels.”\n\nThis change has also reflected among students who are picking up new words, noted teachers who have participated in the sessions for two months.\n\nYasodha Shanmugasundaram, former vice chancellor Mother Teresa Women’s University and programme co-ordinator said: “We are planning to hold similar sessions in this school and are planning to approach Greater Chennai Corporation to host such interactive training programmes for teachers.”", 
    "section": "national", 
    "title": "Retired professors pass on their knowledge to teachers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}