{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Many children ran away from home after parents scolded them”\n\nVirudhunagar district police have brought smiles in as many as 17 families by reuniting children and adults who went missing or ran away from home – some of them after five long years. Superintendent of Police P. Aravindhan said that these people were reunited with the family members in the last one month of implementing Operation Smile, a special drive to rescue missing children.\n\n“Virudhunagar district stood second in the State in terms of number of missing people reunited with families under Operation Smile last year. This time, we have put in our best efforts to bring back smiles in the faces of the family members,” he said.\n\nUnder Operation Smile, the police have been looking for missing children, missing men, missing women and also for children who are in need of care and protection.\n\nMr. Aravindhan said that many of the children had run away from home after parents scolded them for their poor academic performance. A 16-year-old boy from Krishnankoil fled the home after school authorities summoned his parents for his long unauthorised absence from school.\n\nIn some cases, domestic problems or misunderstanding among family members too had led to people leaving their family. In one case, a 15-year-old boy, who was made to sleep in a farm when her mother went for work went missing on her return.\n\nThe SP said that among the rescued children two were minor girls who had eloped with their boyfriends.\n\n“Since the police personnel were making conscious efforts, one team found three boys in the age group of eight to 11 at Sivakasi bus stand. These boys were attempting to board a bus after running away from home. But, they were rescued,” he said.\n\nHe said that child trafficking was not reported in Virudhunagar district. He said that the role of police was also to provide care and protection to children who went missing from their families and could not be identified immediately. “Such children were put in homes after being produced before Child Welfare Committee. Our men also visit them frequently to know about their well-being,” Mr. Aravindhan said.", 
    "section": "national", 
    "title": "Reuniting missing persons with families, police style", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}