{
    "author": [], 
    "text": "The platform near Teppakulam is full of encroachments. As the other side of the road is occupied by Burma Bazaar, the entire road has shrunk in size. People cannot walk because of dense traffic. The platform should be made free of encroachers.\n\nJanaki S. Raj,\n\nTiruchi\n\nCover all drains\n\nAfter a long time, the stinking gutter was closed in Salai Road in Melur, Srirangam. We appeal to the corporation to take steps to cover all large gutters in the city, especially those near eateries and create an image that Tiruchi can indeed be made a smart city.\n\nT.M. Ranganathan,\n\nSrirangam\n\nChettiapatti crying\n\nfor attention\n\nAlthough Chettiappatti was included in ward 39 in 1996, the cup of woes of the residents of this locality is full. The area does not have a city bus service beyond North Ramachandra Nagar. These buses may be extended up to Ramachadra Nagar subway (south side of the subway) so that the people of Nathar Nagar, Chettiappatti, Anbilar Nagar, Dhobi Colony, and Guru Garden benefit. Similarly, there is no post box on the two-km stretch. The locality needs a sub-post office and a police outpost.\n\nH. Ghouse Baig,\n\nEdamalaipattipudur\n\nRoundabouts\n\nare goo big\n\nRoundabouts are too big in Tiruchi. In Mysore, Bengaluru, and Hyderabad the roundabouts are small. Earlier, the Aristo and now MGR statue junction roundabouts are too big. It is time a standard size keeping in view of traffic density is designed for them.\n\nA.V. Narayanan,\n\nThillainagar\n\nRenovate\n\nKallanai\n\nKallanai is yet to get a facelift on a par with Mukkombu to attract tourists and picnickers. The government should draw up a plan to develop Kallanai as a recreation spot. All required facilities such as parking area, park with lighting and more children entertainment amenities will boost the image of the place.\n\nG. Nallasivan,\n\nKailasapuram\n\nRun adequate\n\nbuses to HAPP\n\nKendriya Vidyalaya No. 2 -HAPP has completed nearly 20 years. Children still suffer because of lack of adequate bus serves. The frequency of government bus services is too less. Route No. 59 is not operated as per schedule. It either comes too early or too late which creates a great stress for students. They are not able to reach the school or home on time. Will the authorities take action?\n\nMahalakshmi S.P,\n\nK.K. Nagar\n\nHave call centre\n\nin each district\n\nThe opening of Amma Call Centre is a good initiative. One call centre, with a little more than 100 employees who can take only 15,000 calls, for more than eight crore people is not enough. It is better to have a call centre in each district headquarters. Even if the public register their complaints on the same number, it should be directed to the district headquarters.\n\nA. Prabaharan,\n\nPuthanampatti\n\nBridge road\n\nneeds blacktop\n\nThe Cauvery bridge road has to be blacktopped at the earliest. The roadwork which was started before Vaikunta Ekadashi has not been completed yet. As a large number of devotees throng important temples in Srirangam and Samayapuram, traffic snarls are a daily affair. Additional traffic police can be posted especially during peak hours to control the traffic.\n\nS.R. Dasarathan,\n\nKarumandapam\n\nSilent sufferers\n\nThe silent processions by major parties on Language Martyr’s Day disrupted traffic at critical routes in city. Routes from Thillai Nagar, Thennur to Junction/Bus Stand area were choked in the evening peak hours. Ambulances were stuck. It is time political parties and traffic authorities get sensitive to the hardship caused to the public.\n\nS. Kannan,\n\nSrirangam\n\nHold book fairs\n\nin every district\n\nThe Tamil Nadu Government should conduct annual book fair at every district headquarters through the Department of Libraries so that reading habit among the young students can be enhanced.\n\nA. Haja Abdul Khader,\n\nAdirampattinam\n\nDeclare it a\n\nnational festival\n\nMore than 20 lakh devotees are expected to take the holy dip and witness the Theerthavari during the Mahamaham in Kumbakonam. The State government and the town municipality deserve praise for their work. The Cenetre should declare the event a national festival.\n\nR. Pichumani,\n\nThippirajapuram", 
    "section": "national", 
    "title": "Rid Teppakulam of encroachments", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}