{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The suicide of Rohith Vemula has brought to national attention the issue of how invisibly and deeply inscribed caste injustice is in our modern institutions, activist and former Aam Aadmi Party (AAP) leader Yogendra Yadav said, also attacking the AAP's stand on caste.\n\nAlluding to the controversy over Rohith Vemula’s caste, Mr. Yadav said any claim about caste injustice was now being seen as a bogus claim: “if your certificate happens to be not SC, but OBC or Extremely Backward Caste”.\n\n“So the government representatives go about presenting the case as if the whole thing hinges on producing an SC certificate or not producing it, which is to say an entire question of caste injustice is reduced to one formal boundary,” Mr. Yadav pointed out while delivering the M.S.S. Pandian Memorial Lecture organised by the Madras Institute of Development Studies and Centre for Studies in Social Transformation.\n\nMr. Yadav also said he was afraid that the standard tactic of “denial and later, appropriation” of an incident in Indian campuses might escalate into “denial, appropriation and amnesia as if nothing ever happened”.\n\nAAP criticised\n\nTaking on AAP, on its position on caste, he charged that it mirrored the RSS’ stand on the issue. There were two ways to look at caste – one was to accept it and act on it as an important component of a larger scheme.\n\n“The second is to completely ignore it. The AAP is trying to completely ignore it, which is not a sustainable strategy in the long term,” he said, adding that the various documents put out by the AAP on caste showed that its stand was “not much different from the RSS”.\n\nMr. Yadav said there was a clear, decisive shift all over the country in the caste composition of elected representatives. “But even within this transition, much of this stops at the upper layer of the OBC. The lower layer continues to be very severely under-represented.”\n\n“One of the sections which has consistently slipped and has not been substantially helped by the politics of social justice is the lower OBC. They have slipped certainly below that of the upper crest of the SC right now,” he added.\n\nPointing out that there was a clear social fragmentation within politics, Mr. Yadav said there has not yet been a single successful experiment of stitching together a social alliance of SC and ST. “The Dalit-Adivasi alliance in Indian politics has simply not happened.”\n\nFormer West Bengal Governor Gopalkrishna Gandhi said there was fear in the country to independently express one's thoughts.\n\n“Our democracy, which we are very proud of, is also host to a great deal of fear. We are constantly seeing signs of fear. If somebody opposes the head of a government or head of a party, that person is asked to explain why, whether it is the BJP or Congress. Independence of thought is being seen as a sign of indiscipline,” he said.", 
    "section": "national", 
    "title": "Rohith suicide has brought to focus caste injustice in institutions: Yadav", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}