{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Over 15 law schools in Tamil Nadu took part in the contest including teams from Srirangam school\n\nThe School of Law at the SASTRA University bagged the N. Natarajan Charitable Trust’s maiden criminal law moot court competition organised by the Madras Bar Association.\n\nIn a closely contested finals on Sunday a team from Sastra comprising Kiran Kanna, Vikas Muralidharan and Sridhar Athreya beat the team from the School of Excellence at the Tamil Nadu Dr. Ambedkar Law University.\n\nThe moot court competition saw the participation of over 15 law schools in Tamil Nadu, including two teams from the National Law School in Srirangam.\n\nAwards presented\n\nVarious awards were presented by Supreme Court judge U.U. Lalit and S.K. Agnihotri, Judge, Madras High Court.\n\nIn his special address, Mr. Lalit recalled the legal genius of senior advocate N. Natarajan and encouraged students to take up criminal law as a specialisation with passion.\n\nMr. Agnihotri requested the Madras Bar Association to prepare a list its great jurists and arrange for memorial lectures in their honour to inspire young students to take up the legal profession with pride.\n\nThe moot problem was related to sedition under section IPC 124 (A) and on Articles 14, 19 and 21 of the Indian Constitution and the finals was judged by High Court of Madras Judges N. Kirubhakaran and T. Raja and Retired Judge T. Sudanthiram.\n\nMr. Lalit launched the N. Natarajan Charitable Trust on the occasion.\n\nSenior advocate Arvind Datar outlined the activities of the trust which included annual criminal law moot, legal aid camps, and scholarships.\n\nMadras Bar president R. Shanmughasundaram welcomed the gathering.\n\nThe former Additional Solicitor General and the first junior of Natarajan, M. Ravindran, spoke of various cases argued by his senior and that included the famous M.R. Radha case.", 
    "section": "national", 
    "title": "SASTRA team wins moot court competition", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}