{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sugarcane farmers in the district have issued a virtual ultimatum to the district administration to secure dues from three private mills.\n\nAccording to the farmers, the mills had failed to comply with the State Advisory Price (SAP) during the last two crushing seasons and were refusing to pay the specified amount for the current season as well.\n\nDuring 2013-14 and 2014-15, the Fair and Remunerative Price (FRP) of the Central Government and SAP of the State Government amounted to Rs. 2,650 per tonne. But, the mills had refused to heed to the SAP, the farmers complained.\n\nThe district administration had convened a tripartite meeting involving the representatives of the mills and leaders of farmers’ associations on January 19, but farmers said there was no tangible outcome. During the monthly grievance meeting on Friday chaired by the District Collector S. Prabakar, farmers expressed disappointment over the delay in settlement.The Collector responded saying that the mills have provided assurance to settle dues as per a time schedule.\n\nRepresentatives of farmers’ associations including Periyasamy, Senniappan, Suba Thalapathy and K.V. Ponnaiyan said the district administration has to be more serious in securing the dues from the mills.\n\nUnpaid balance\n\nThe unpaid balance to cane farmers by the three mills for the last two years amounts to Rs. 175 crore in Erode district alone.\n\nAll over the State, farmers need to be paid Rs. 650 crore as unsettled dues by the mills, Mr. Thalapathy said.\n\nMr. Senniappan said the private mill at Aapakoodal has not settled dues for the sugarcane procured in the last two months, and cautioned that farmers were no longer in a position to accept explanations.\n\nIf the mills fail to settle the dues, their management must be handed over to the farmers.\n\n“We will run the mills and ensure timely payment of Rs. 2,850 per tonne,” Mr. Periyasamy said.", 
    "section": "national", 
    "title": "‘Secure dues from mills within one month’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}