{
    "author": [], 
    "text": "The sub-treasury at Tiruvaiyaru is functioning from a rented building at North Street, catering to nearly 600 pensioners. The sub-treasury is likely to be shifted to Kaduveli village, about 7 km from Tiruvaiyaru. It is about one km from the village bus stop. This will put the aged pensioners to hardship. There is ample space available in the taluk office in Tiruvaiyaru for housing the sub treasury. The government should reconsider the move and locate the sub-treasury within the town limits.\n\nG. Pichai,\n\nRoyampettai\n\nPut up signboards\n\non all streets\n\nThiruthuraipoondi in Tiruvarur district is a municipal town consisting of 24 wards. There are two or three streets in each ward. Visitors to the town find it difficult to locate the streets. The municipality or service organisations should come forward to install name boards for each street.\n\nK. Jambunathan,\n\nThiruthuraipoondi\n\nRepair road in\n\nPudukottai\n\nMost of the commercial vehicles coming from Madurai and Karaikudi route proceeding towards Aranthangi and Pattukkottai route via Pudukkottai take the Maruppini Road instead of going towards Pudukkottai town. So, the Maruppini Road faces heavy traffic. The road near municipality grass farm is in bad shape. I request the municipal authorities to lay the road in good condition.\n\nS. Sahubar Sadiq,\n\nPudukottai\n\nDirty panchayat\n\nAlthough many schemes, including Swachh Bharath, are implemented in Nachiarkoil, the panchayat lacks cleanliness and hygiene. The area around the panchayat office is strewn with garbage, empty liquor bottles, water sachets, and tea cups. The officials should take steps to improve cleanliness.\n\nH. Sheik Abdul Kadhar,\n\nNachiarkoil\n\nMask headlights\n\nTransport and police authorities should take steps to stick bull’s eyes on headlights of vehicles in the district as motorists are facing much difficulty due to the glare at night.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nNo order in\n\nreserved coach\n\nI travelled from Salem to Mayiladuthurai by Mysuru-Mayiladuthurai Express (16232). The lower berth allotted to me was occupied by someone else. Travelling Ticket Examiner was not available. I managed to get into the middle berth and suffered throughout the night. I request the authorities to instruct TTEs to ensure that the berths allotted to senior citizens were not occupied by others.\n\nMali & Mani,\n\nVishnupuram\n\nUnsafe road\n\nUnsafe conditions prevail on the Thanjavur- Kumbokanam Road, especially at Valoothoor and Ayyampet. There is a famous school with more than 1,000 children. The students of this school use this road daily. The structure and quality of the road is poor and the pavements are incredibly narrow. The traffic flow is extremely heavy with many large heavy vehicles plying at high speed. Safety measures should be improved.\n\nShafeeka Basheer,\n\nValoothoor\n\nHold eye camps\n\nin all schools\n\nThe government should organise eye camps in all schools and screen for colour blindness among children. As the affected face much problems, those suffering from the problem should be provided proper advice and guidance.\n\nMannarmannan J.,\n\nPattukottai\n\nHave call centre\n\nin each district\n\nThe opening of Amma Call Centre is a good initiative. One call centre, with a little more than 100 employees who can take only 15,000 calls, for more than eight crore people is not enough. It is better to have a call centre in each district headquarters. Even if the public register their complaints on the same number, it should be directed to the district headquarters.\n\nA. Prabaharan,\n\nPuthanampatti\n\nHold book fairs\n\nin every district\n\nThe Tamil Nadu Government should conduct annual book fair at every district headquarters through the Department of Libraries so that reading habit among the young students can be enhanced.\n\nA. Haja Abdul Khader,\n\nAdirampattinam\n\nDeclare it a\n\nnational festival\n\nMore than 20 lakh devotees are expected to take the holy dip and witness the Theerthavari during the Mahamaham in Kumbakonam. The State government and the town municipality deserve praise for their work. The Cenetre should declare the event a national festival.\n\nR. Pichumani,\n\nThippirajapuram\n\nRenovate\n\nKallanai\n\nKallanai is yet to get a facelift on a par with Mukkombu to attract tourists and picnickers. The government should draw up a plan to develop Kallanai as a recreation spot. All required facilities such as parking area, park with lighting and more children entertainment amenities will boost the image of the place.\n\nG. Nallasivan,\n\nKailasapuram", 
    "section": "national", 
    "title": "Shifting of sub-treasury", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}