{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Based on good response from entrepreneurs in occuping all industrial sites developed by the Small Industries Development Corporation, the SIDCO has planned to expand its area here and set up additional plots.\n\nThe site, measuring 44 acres, was developed in 2009. Though there was some stalemate among entrepreneurs in starting their units at this site as it was located in an interior part, the area witnessed a spurt in terms of development. The four-laning of Tiruchi – Chennai National Highway together with the provision of by-pass road in Perambalur came as a blessing for the entrepreneurs who not only vied with one another in setting up their plots but also starting production on viable grounds, an official of the SIDCO told The Hindu here on Monday.\n\nThe source said that the SIDCO unit here accounted for 20 industrial units – ranging from production of corn flex to furniture goods and from steel rolling unit to food processing unit. Based on a plea from entrepreneurs, the SIDCO has planned to execute the second phase of expansion of the estate here in course of time. In fact, the district administration had identified an additional 7.5 acres where, after formation of roads and other basic amenities, an area of 4.5 acres would be utilised for setting up of about 15 sheds. “The land is located close to the existing industrial shed,” the source said.\n\nThe source said that entrepreneurs at the SIDCO estate in Tiruchi have borne the brunt due to lack of orders. Although the SIDCO took up the initiative in Vazhavandankottai and Thuvakudi, anticipating them to act as ancillary units of major industries, the entrepreneurs could not get the orders. The SIDCO was planning to set up its industrial shed near Manapparai where the SIPCOT estate is to come up.", 
    "section": "national", 
    "title": "SIDCO plans expansion in Perambalur", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}