{
    "author": [
        "K Raju"
    ], 
    "text": "Sirumalai, a haven for wild animals and hub of rare medicinal plants, faces a serious threat to its ecology and environment as it slowly becomes a dump of plastic waste, thanks to the ineffective monitoring and lethargic attitude of forest officials.\n\nPrivate resorts, hotels and big farms are dumping plastic and other wastes on the slopes and the sides of the ghat road. With no proper monitoring mechanism, they do not spare even reserve forest area.\n\nEnvironmentalists and farmers said that despite repeated appeals to the district forest office and Sirumalai forest range office, no action had been initiated to curb the activity. The forest officials neither inspected the ecologically damaged areas nor restrained the polluters from dumping plastic and other wastes at will, they added.\n\nBig farms that raised nurseries in large numbers for commercial purpose discarded waste and used plastic bags at 14{+t}{+h}km point, they said.\n\nSeventeenth ‘U’ turn point of the ghat road had become a permanent dump as people threw plastic, food and garbage wastes in large quantities.\n\nAbove all, the hill station had become a haven for drinkers, who often used to consume liquor on the sides of the ghat road.\n\nThey simply left empty liquor bottles, water pockets, soft drink bottles and plastic covers on the parapet walls of the road and the slopes, without considering that the area was a habitat for several wild animals and birds. Several spots along the ghat road were littered with plastic bottles, plates and cups, they lamented.\n\nNaturalists said that Sirumalai provided shelter for various species of mammals, birds and invertebrates. It was a major habitat for Indian gaurs, leopards, wild dogs, monkeys, hedgehogs, rabbits, mouse deer and barking deer.\n\nAlready, rampant illegal felling of trees and development of uni crops had made considerable damage to the hill. Further delay in preventing such activities would wipe out the flora and fauna from the hill soon, they added.", 
    "section": "national", 
    "title": "“Sirumalai turning into a dump of plastic waste”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}