{
    "author": [
        "S Senthalir"
    ], 
    "text": "Tourism Department to use the first instalment of Rs. 17 crore in the heritage area\n\nThe ever-increasing bustle of tourists combined with urbanisation is posing a greater challenge to the preservation of heritage town.\n\nThe recent Central government’s approval of Rs. 85.28 crore tourist circuit projects under Swadesh Darshan Scheme has raised questions as to how this money would be used while the urbanisation has squandered away Puducherry’s heritage. However, the Tourism Department has its plans set to utilise the first instalment of Rs. 17 crore for the development of heritage area in Puducherry.\n\nPuducherry town is designed based on grid layout. It has two distinct characters within the boulevards (within the grid). Close to the beach, there was the White Town with its colonial mansion basically modelled on the Parisian middle class structures. These buildings were well-adapted to the tropical climate with some infusion of local decorations. The Grand Canal divides still the French quarter from Tamil quarter. The Tamil quarter was full of traditional Tamil houses. That was the strange urban landscape of Puducherry where we can see a village and a city juxtapose each other.\n\nThe Tourism Department is planning to primarily focus and invest the first instalment of money received from the Central Government on French and Tamil quarters.\n\nThe Development of Heritage Area in Puducherry under the Swadesh Darsham Scheme will focus on revitalisation of Bharathi Park including illumination of monuments, Triangular Park, parks at beach promenade, Gandhi Thidal, streetscapes in the heritage area of French Quarter, Vysial Street at Tamil Quarter. It also includes restoration of façade of heritage buildings, information signage for heritage area and lighting and illumination of heritage area and monuments.\n\nTourism Department Director R. Mounissamy said that first they would take the project of beautification and conservation of the French and Tamil quarters.\n\n“The Public Works Department and INTACH would work together for the completion of this project,” he said.\n\nRampant commercialisation\n\nINTACH Senior Architect A. Arul says, “There is a need to maintain what we have today. There is nothing really to showcase except few places. Many heritage buildings have crumbled down. Hence, we need to focus mainly on restoring the footpaths and restore the facades and streetscapes of areas identified.”\n\nWill restoration and revitalisation of these places bring back the urban heritage of Puducherry? Former Chief Conservator in the Ministry of Culture, France, Robert Dulau had been very critical of the methods used in preserving the urban heritage of Puducherry.\n\nBeing instrumental in the restoration of façade at Ishwaran Dharma Raja Koil Street, Mr. Dulau in his book ‘The town…the house…their spirit’ says that Puducherry today has reached a precarious point and any further inroads may profoundly affect the face of the town.\n\n“First, the Tamil house is a part of the living memory in the town that we love and such memories and the heritage they represent out to be preserved,” writes Dulau in his book.\n\nThe rampant commercial development in Puducherry has converted Tamil houses into commercial buildings housing office or hotels. In the French quarters too the mansions are changing to heritage hotels, boutiques.\n\nThe restoration and revitalisations focusing on the façade and lightning of streets only provides for a cosmetic surgery, making it tourists destination rather than brining in a lived experience of our rich heritage.\n\nMany heritage buildings have crumbled down, says INTACH Senior Architect A. Arul", 
    "section": "national", 
    "title": "Swadesh Darshan funds to revitalise French, Tamil quarters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}