{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Members of the Joint Action Committee of the Tamil Nadu Teachers’ Organisation (JACTO) continued their three-day demonstration to press for a charter of demands here in Krishnagiri on Monday.\n\nSixth Pay Commission\n\nThe Tamil Nadu teachers, represented by JACTO, called upon the State government to revise their pay on par with the Central Government teachers as per the Sixth Pay Commission. The Committee also demanded that all allowances covered under the Sixth Pay Commission for Central Government teachers should be extended to State Government teachers.\n\nThe State-wide protest demonstration led by JACTO has called for legislative protection on lines of the protection extended to doctors through a Doctors Protection Act. According to JACTO, there has been an increased “interference” in the functioning of teachers in schools, and that the teachers often faced threat from “external elements”.\n\nAmong other demands, JACTO has called for implementation of Tamil curriculum from elementary education to higher secondary education. Similarly, a six per cent hike should be given to teachers, who have completed 30 years of service without any promotion in government and government aided schools. The hike would be on par with special grade and selection grade teachers, JACTO has said.\n\nThe Joint Committee of teachers has also called for appointment of a special welfare officer at elementary level and higher secondary level to monitor and supervise the various welfare schemes and freebies for students.\n\nAccording to the teachers, placing the headmasters in charge of the freebies had added to the workload and has interfered with efficient discharge of teaching duties in schools.\n\nWith the elections round the corner, JACTO also called upon the government to fulfil its promise of scrapping off of the contributory pension scheme and reverting to the old pension scheme that was made in its 2011 election manifesto.\n\nThe Government should drop its plan to shutdown elementary schools based on student strength and instead ensure their continued functioning, JACTO has said.\n\nIn the wake of the protests, classes did not function in most of the schools.", 
    "section": "national", 
    "title": "Teachers continue their protest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}