{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram : Radha kalyana mahotsavam, musical discourse by Ashwin Kumar, BHEL Township, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Cauvery Thayar Sannidhi, Amma Mandapam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 55, I Main Street, SMESC Colony, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology Department of Instrumentation and Control Engineering : ACODS - international conference on Advances in control and optimisation of dynamical systems, 9 a.m.\n\nBharathidasan University: Department of Environmental Management, Workshop on ‘Entrepreneurship: scope and opportunities in Green energy technologies’, D. Sivalingam, former Chief Engineer, Public Works Department, delivers special address, V.M. Muthukumar, Vice Chancellor, presides, Seminar Hall, 9.15 a.m.\n\nNational College : Department of English and The English Literary Association, Yan Gong, from School of English and International Studies, Beijing Foreign Studies University, speaks on ‘English language teaching in China’, College Auditorium, 10.30 a.m.\n\nSeethalakshmi Ramaswami College : Department of Chemistry, Chemistry Association meeting, S. R. Bheeter, faculty from St. Joseph’s College, speaks on ‘Chemical periodicity’, Sri Meda Saraswathi Hall, 9.45 a.m.\n\nPonsiva Research and Innovation Trust and Innovation Incubator of Nehru Memorial College : Innovation trigger camp, college campus, Puthanampatti, 3.15 p.m.\n\nTamil Nadu Handicrafts Development Corporation : Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m. to 8 p.m.\n\nBishop Heber College : Department of Social Work, Programme on ‘Occupational therapy for children with special needs’, P.M. Arun Kumar, Occupational Therapist, chief guest, Blossom Special School Auditorium, Holy Cross College campus, 9.30 a.m.\n\nM.A.M. College of Engineering: “MATLAB workshop for Electrical Engineers,” S. Saravana Elango of National Institute of Technology, Tiruchi, resource person, 9.30 a.m.\n\nAIMAN College of Arts and Science for Women : Dato Thasleem Mohamed Ibrahim, Executive Chairman, TMI-Group of Companies, Malaysia, speaks on “Interpersonal Relationships,” noon.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation : North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m. to 9 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}