{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In view of Prime Minister Narendra Modi’s visit to the city to inaugurate the ESI Hospital on Kamaraj Road at Singanallur, and to address a public meeting at Codissia Grounds on Tuesday, the city police have announced traffic diversions.\n\nThe traffic diversions would come to effect from 10 a.m. and would continue till Mr. Modi leaves the city.\n\nAll heavy vehicles heading to Coimbatore from Karumathampatty and Avinashi on the Avinashi Road will be diverted to Ramanathapuram Junction on the Trichy Road through Neelambur, L&T Bypass, and the Chinthamanipudur Junction. These vehicles can take a right turn at Ramanathapuram Junction to reach Lakshmi Mills and proceed.\n\nAll vehicles from Avinashi to the city too should follow the same route. All heavy vehicles from Gandhipuram, JM Bakery Junction, and Anna Statue that are heading to Avinashi through the Avinashi Road should take the right turn at Lakshmi Mills Junction to Ramanathapuram Junction and head to Neelambur Bypass through Singanallur and Chinthamanipudur.\n\nAll vehicles from Avinashi Road Flyover, and Anna Statue should take follow the same route.\n\nSSI dies\n\nA Special Sub-Inspector (SSI) of Police from The Nilgiris deputed for security arrangements for Prime Minister Narendra Modi’s visit to the city died of cardiac arrest on Monday.\n\nJ. Nehru (54), from Kallada village, near Aravenu in Kotagiri, joined the service in 1984 as a grade–II constable, and was promoted as an SSI last month. Nehru served in Sholurmattam Police Station under Coonoor sub-division in The Nilgiris.\n\nOn Monday, he was travelling from Nilgiris to Coimbatore with nearly 30 other policemen to Coimbatore. When they reached North Coimbatore flyover, he felt chest pain and was rushed to a private hospital where he was declared brought dead.", 
    "section": "national", 
    "title": "Traffic diversions today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}