{
    "author": [
        "S Prasad"
    ], 
    "text": "Union Minister for Urban Development Venkaiah Naidu in a lighter moment with Lieutenant Governor A.K. Singh and Chief Minister N. Rangasamy at Arts and Crafts village at Murungapakkam near Puducherry on Monday.(Right) A rousing welcome to the minister.- Photos: T.Singaravelou\n\nOfficials have been asked to make improvements in the proposal, says the Union Minister\n\nUnion Minister for Urban Development and Parliamentary Affairs M. Venkaiah Naidu on Monday said that Puducherry would definitely find a place in the second list of Smart cities and asked officials to make some improvements in the proposal. He was speaking at the inauguration of the Arts and Crafts village at Murungapakkam near here.\n\nMr. Naidu said that he asked the Lieutenant Governor, Chief Minister and Chief Secretary to bring in some improvements to the proposal. “It is not a selection but only competition and officials should work hard to ensure that Puducherry finds a place in the second list,”said Mr. Naidu.\n\n“The Central Government will extend all support to Puducherry and whatever help is required for flood relief and rehabilitation measures will surely be given. The Central Government will take care to provide whatever support is required by Puducherry,” said the Union Minister.\n\nModelled on the lines of the Dilli Haat, the Arts and Crafts village will provide an institutional platform for the traditional artisans of Puducherry and neighbouring States. Arts and crafts from the five south Indian states including terracotta, thanjavur paintings, antiques, studio pottery and hand made goods will be presented in this village.\n\nIn the second phase, the Arts and Crafts village will have a River front with jetty and boat facilities for tourists and other leisure activities. The second phase will start after April under the Swadesh Darshan programme of the Central Government. Puducherry is one of the most popular destinations offering a myriad of activities and this village will be an additional attraction, Mr. Naidu added.\n\nSpeaking at the function, Lieutenant Governor A.K. Singh said that the Art and Crafts village is a step of the Puducherry administration along with the Centre to give a platform not only for artisans but people from all over the country and add to their employability.\n\nThe Union Government has sanctioned 85 crore for the Swadesh Darshan scheme under which a large number of tourist related facilities will be upgraded in Puducherry.\n\nBeing a UT we are dependent on the Centre for a large number of things. He expressed hope that all the issues are getting attention and in due course of time we will be finding a solution to the problems that we have shared with the Centre.\n\nChief Minister N. Rangasamy said that the Centre should concede the representations of the Puducherry Government for sufficient funds. Being a Union Territory, Puducherry has to depend on the Centre.\n\nMr. Rangasamy said that as against Rs.125 crore sought by the Government as interim relief the Centre had sanctioned only Rs.50 crore and had directed the administration to divert it from the plan funds. The Centre should understand the predicament of the Government and release adequate funds, he said.", 
    "section": "national", 
    "title": "‘UT will make it to II list of Smart Cities’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}