{
    "author": [], 
    "text": "Commuters flay goverment inaction; voice their concerns over the lack of such services\n\nDespite several women having repeatedly narrated their unpleasant experiences in Metropolitan Transport Corporation buses for many years now, the government has not yet responded to the demand for operating additional ladies special services.\n\nWith many routes having poor frequency of services, some wonder how a demand for a ladies’ special can be accommodated.\n\nRani Kumar, Anna Salai, says she has not seen even one ladies special bus from Anna Salai to Chennai Mofussil Bus Terminus in Koyambedu.\n\n“I have been travelling along this route for many years now. I wonder if they will ever operate one. No one seems to care,” she adds. The need for such a service primarily arises as bunching of buses at times makes them crowded, she says.\n\n“I was molested in a bus sometime ago, but this keeps happening to so many women and often. If there are ladies special buses, we can at least travel safely,” she adds.\n\nHaving CCTV cameras in buses may be a good idea, but do all buses have it? How can we urge people to take public transport if commuting is far from safe, she asks.\n\nExercise to help traffic policemen manage stress\n\nIn the coming weeks, people can expect a visible change in the attitude of traffic police personnel. As part of a personality development and stress bursting exercise, the City Traffic Police is organising a skill development camp at the police headquarters in Vepery.\n\nA senior traffic police official of the City Traffic Police said traffic policemen spend long hours at busy intersections in extreme weather conditions, which leads to severe stress. At the awareness camp that will take place for over a month, traffic police personnel will be given tips and training by a senior psychologist. They will be given specific programmes to help them keep their emotions in check.\n\nThe camp will be held in batches and have former police officers training the personnel . The traffic police face thousands of motorists and pedestrians at work and they often have to deal with frayed tempers. The skill development camps can help them face such situations better.\n\n( Reporting by Sunitha Sekar and R. Srikanth )", 
    "section": "national", 
    "title": "Women demand special buses for a safe travel", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}