{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Ration shop and PACS employees staging a demonstration at R.M. Colony in Dindigul on Monday. (Below) A rally taken out in Ramanathapuram.— Photo: L. Balachandar\n\nHundreds of employees of Primary Agricultural Cooperative Societies and staff and workers in ration and fair price shops would go on an indefinite strike from February 15, demanding pension and other benefits, said A. Ravichandran, district secretary, Tamil Nadu State PACS Employees Association.\n\nThe government constituted a committee to discuss provision of pension to employees in cooperative societies and in ration and fair price shops. But no action had been initiated so far to implement the pension scheme for them, he said.\n\nA total of 4,534 employees in cooperatives societies in the State, 23,000 workers in ration and fair price shops, including 625 fair price shop employees and 510 coop. staff, in the district would boycott work from February 15, he added.\n\nEarlier, they staged a demonstration at R.M. Colony. Distribution of PDS goods was paralysed in a majority of ration shops. Later, they handed over a petition to officials in the Collectorate for quick action.\n\nRamanathapuram\n\nMembers of the Tamil Nadu State Primary Cooperative Banks All Employees Association took out a rally here.\n\nAbout 500 TACBEA members, including 100 women, took out a rally from Kenikarai junction to Aranmanai. Employees of 131 Primary Agriculture Cooperative Credit Societies (PACCS) in the district and 350 fair price shops also took part in the rally.\n\nG. Muthuramalingam, TACBEA district president, who led the rally, said the association had been pressing the twin demands of pension scheme and grace pension for the past nine years but both the DMK and AIADMK governments failed to concede them.\n\nThree pension review committees were formed to look into the demands but failed to submit reports to the government, he said. The third committee was formed in January last year with a direction to submit the report within three months, but it did not submit the report, he said.\n\nThe pension scheme was available for the employees of Tamil Nadu State Cooperative Banks and Central Cooperative Banks but not for the employees of Primary Cooperative Banks and fair price shops, he said.\n\nThe retired employees struggled to make both ends meet for want of pension, he said.\n\nAfter ending the rally, the office-bearers presented a memorandum to the Collector to be forwarded to the Chief Minister’s Office. District vice-presidents R Sekaran, R Ganesan and joint secretaries G Gunjarapandian and K Samiyandi were present among others.", 
    "section": "national", 
    "title": "Workers to go on strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-02"
}