{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "27 more girders are expected to be replaced in 2016-17\n\nAs part of the ongoing process of enhancing safety and strength of the century-old Pamban rail bridge, India’s first cantilever bridge, the Southern Railway has decided to replace 16 highly corroded girders this year and 27 more during 2016-17.\n\nSouthern Railway Chief Engineer (Bridges) M. Suyambulingam, who inspected the Scherzer’s span of the bridge to assess the strength of the foundation of the centre span on Wednesday, said that the railway had sanctioned funds for replacing 16 girders this year, and was expected to give its nod for replacing 27 more girders next year.\n\nA private company, which had replaced 28 corroded girders last year, had been awarded the contract and it would take up regirdering work during the first week of March, he said.\n\nThe corroded girders would be replaced by metalised steel girders, manufactured at the railway workshop in Arakkonam.\n\nAs suggested by the Indian Institute of Technology – Madras, which had conducted a study to assess the strength of the bridge, the Southern Railway had been carrying out retrofitting and replacing of the corroded girders to ensure that the bridge, connecting Rameswaram island with the mainland, served many more years, he said.\n\n“We have decided to replace 27 girders during 2016-17 at a cost of Rs. 10.50 crore and the Ministry of Railways is expected to sanction funds in the Railway Budget to be presented on February 25,” Mr. Suyambulingam said.\n\nAfter the elimination of the old and corroded girders, the bridge would become very safe, he noted.\n\nThe bridge had 144 spans and nearly 73 of them were strengthened during the gauge conversion in 2007.\n\nG. Ramakrishnan, Managing Director of MR Hi Tech Engineers, said that the company had completed preliminary regirdering works and would start the work in the first week of March.\n\nThe work would be taken up on Tuesdays, Thursdays and Fridays in the given window period between 5.50 a.m. and 10 a.m. without disrupting train services.\n\n“We propose to complete the work by May after bringing the metalised girders from the railway workshop,” he added.\n\nWork will be taken up on Tuesdays, Thursdays and Fridays between 5.50 a.m. and\n\n10 a.m.", 
    "section": "national", 
    "title": "16 corroded girders in Pamban bridge to be replaced this year", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}