{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "After a period of lull, the Tamil Nadu State Marketing Corporation Limited (Tasmac) has witnessed a spurt in liquor sales across the State.\n\nIn December 2015 around 41.17 lakh cases of Indian Made Foreign Spirit (IMFS) and 12.29 lakh cases of beer were sold. Last month (January 2016) the sales data stood at 48.23 lakh cases of IMFS and 15.33 lakh cases of Beer.\n\n“If you look at the statistics for January 2015 around 44.94 lakh cases of IMFS and 13.99 lakh cases of beer was sold. As Tamil Nadu is marching towards election, sales will slowly pick up,” said a senior Tasmac official.\n\nLiquor sales across the State dwindled from 2013-14. Beer sales fell by 12 per cent for the first time and this was followed by IMFS.\n\n“Despite the dip in sales (almost six per cent) revenue wise we performed well due to the price hike,” the official said. The official explained that the SWOT (Strength Weakness Opportunities and Threats) analysis that Tasmac did eight months ago in all its 6,814 outlets has transformed the business dynamics.\n\nThe SWOT matrix showed that the strengths were availability of human resources, ample godown space, good transportation and more varieties of brands. On the weakness front it indicated that the stock manufactured was not despatched on time and there was no scientific method of stocking goods in retails outlets.\n\n“The stock was randomly arranged in shelves. We reworked on this and ensured that products that would attract consumer’s interest were kept in front,” the official said. “The Opportunity for us was all these weakness can be rectified. The threat we have is illicit liquor which was not under our control,” he added.\n\nWith elections nearing, Tasmac which has revenues of around Rs. 27,000 crore is confident of touching Rs. 30,000 crore.\n\nPresently around 70 lakh people, less than 10% of the State’s population consumes liquor at their outlets everyday.", 
    "section": "national", 
    "title": "After a period of lull, liquor sale witnesses spurt", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}