{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The three-day ‘Business Expo 2016’ organised by the School of Business Studies of the Periyar University which got under way on the university premises on Wednesday showcased various avenues available for the youngsters for becoming successful businessmen and entrepreneurs.\n\nStudents, business and industrial houses, such as organic and healthy food producers, fashion designers, educational institutions, banking and insurance companies, publishing houses, mobile communications, handloom and handicrafts, automobile companies, world tour operators, furniture firms, speciality hospitals had put up stalls displaying their products and services.\n\nA separate stall put up by planetarium explained the achievements made by the country in the field of science and technology and space technology.\n\nD. Ravichandar, Chief Executive Officer, JSW Steel Limited, in his inaugural address, said that JSW was a flagship company of Jindal Group and has interest in diversified fields such as steel, cement, power and information technology.\n\nHe urged the students to take advantage of the business expo to enhance entrepreneurial skills and also to understand the intricacies in taking a business to the top most level.\n\nC. Swaminathan, Vice Chancellor, in his presidential address, said that the maiden expo has been organised with the sense of social responsibility to the society at large to stress the importance of real time entrepreneurs in the prosperity of the nation.\n\nK. Govindarajan, General Manager, District Industries Centre, explained in detail the salient features of all government schemes available for entrepreneurial activities. N. Rajendhiran, Dean-Humanities and Social Sciences, V. R. Palanivelu, coordinator of the Business Expo and A. Elangovan, Cluster Head, offered felicitations.", 
    "section": "national", 
    "title": "‘Business Expo 2016’ showcases avenues available for youth", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}