{
    "author": [
        "S Senthalir"
    ], 
    "text": "Documentary film ‘Young Syrian Lenses’ was screened at the Pondicherry University\n\nHow does it feel when you lock the doors and leave your house for the last time, not knowing when you would return? What does it mean to see the UNESCO’s world heritage city, inhabited for more than 7,000 years, constantly bombed?\n\nIt was the quest to find an answer to these questions that resulted in the documentary film ‘ Young Syrian Lenses .’\n\nIn a small corner of the 700 acres of the Pondicherry Central University campus facing the Bay of Bengal, three Italians impaled our complacence with the voices from war-torn Syria. They brought to this sleepy town the realities of the Syrian war that has killed tens of thousands and left millions of people homeless.\n\n“As we sit here discussing, there are millions waiting for refuge in the biting cold outside the borders of European countries. The European nations continue to erect fences to stop refugees from entering their countries and those who try entering are ripped off their belongings,” says Italian journalist Filippo Biagianti.\n\nHe, along with Italian filmmaker Ruben Lagattolla and photographer Enea Discepoli was at the Pondicherry University to screen ‘ Young Syrian Lenses ’ for the International Documentary and Short Film Festival here on Thursday.\n\n“We only hear about geopolitics and military strategies in news and forget how it affects normal people. There were so many things in the news that were false and I wanted to tell what the reality was. Rather than resolving the conflict in Syria, the geopolitics has flared up deepening the crisis in this middle-eastern country,” says Ruben Lagattolla.\n\nHe went to Syria crossing Turkey with photographer Enea Discepoli in 2014.\n\nMr. Discepoli wanted to organise a photo exhibition in Aleppo then. “I visited this Syrian city in the 1970s to see its rich culture and heritage, which we had read about in our schools. It had beautiful gardens. But, when Bashar al-Assad’s regime started bombing it, it was heart wrenching to see the heritage city reduced to rubble. So, I went again for the second time in 2013. I took pictures and wanted to tell this story to the world,” he said.\n\nIntrigued by the idea of organising a photo exhibition in Syria, Ruben went along with him. “It sounded crazy and interesting when Enea Discepoli wanted to organise this exhibition. The initial idea was to go to the exhibition and interview media activists and use photographs to show the effects of the war to the world. Once we went there, we realised that the venue of the exhibition was destroyed. Barrel bombs were being dropped by the regime every five to ten minutes terrorising people,” said Mr. Lagattolla.\n\n“Amidst the bombings, we witnessed people attempting to carry on with their routine life. We saw children playing and people sitting and drinking tea. It looked like they were waiting to die. There were citizen journalists who went around documenting and fighting through their cameras. It was scary but I wanted to record their lives. We worked with nine citizen journalists who were between the age group of 21 to 25 for this documentary. It was a collective trauma,” he added.\n\nThrough this documentary, they want to convey that the present humanitarian crisis could have been averted way back in 2011. “If the world nations had acted early to overthrow Assad and encourage civil society to establish a democratic government, the Islamic State would not have emerged. Instead of countering the terrorists, Russia and Assad regime are bombing civilians and rebels,” he claimed.\n\nHe added that there were a good number of rebels who could have played a diplomatic role in establishing democracy.\n\n“We have now destroyed them, declaring them terrorists. While the terrorist Islamic State thrives without coming under attack, the civilians, rebels and those opposed to the regime continue to be killed.”\n\nWill war bring peace in this region? Having travelled and documented conflict areas including Afghanistan, Pakistan, and Libya for nearly 25 years, 64-year-old Discepoli says: “War is not a solution”.", 
    "section": "national", 
    "title": "Capturing Syria’s war through the lens", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}