{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ahead of the tabling of the Union Railway budget before Parliament, Chief Minister Jayalalithaa wrote to Prime Minister Narendra Modi on Monday seeking funds for specific projects in the State. She also urged him to expedite 20 projects which were earlier announced and remained pending for want of sufficient funds.\n\nIn her letter to Mr. Modi, Ms. Jayalalithaa detailed specific proposals and suggestions for the railway budget and hoped that he considered them positively.\n\nCompleting the doubling of railway lines between Chennai and Kanyakumari freight corridor, between Chennai and Thoothukudi, and between Chennai and Bengaluru were some of the projects the Chief Minister highlighted.\n\nAs regards the Memorandum of Understanding (MoU) the State government had signed with the Ministry of Railways over three projects –— Chennai-Thoothukudi freight corridor, high-speed passenger rail link connecting Chennai, Madurai and Kanyakumari, and high-speed passenger rail link connecting Madurai and Coimbatore — she said certain concerns were not adequately reflected.\n\n“The draft MoU would require revision before it becomes acceptable to the government of Tamil Nadu,” she said, and urged for evolving a “fair, balanced and acceptable” draft.\n\nReiterating her government’s specific conditions for the establishment of the Special Purpose Vehicles (SPV), she said since the land was provided by the State government, it should be treated as part of the government’s equity contribution to the SPV at market value.\n\nObserving that a number of railway projects announced for the State in the earlier budgets have not commenced so far due to want of sufficient fund allocations, Ms. Jayalalithaa also listed projects pending.\n\nThe pending projects were a new line from Morappur to Dharmapuri, fifth and sixth line on Chennai to Villivakkam, a new line for Villivakkam and Katpadi Sections, a new line from Chidambaram to Attur Via Ariyalur, doubling from Tindivanam to Kanyakumari, a new line from Bodinayakanur to Kottayam, doubling from Renigunta to Arakkonam, third and fourth lines from Attippattu - Gummidipoondi.\n\nA new line from Jolarpettai to Hosur via Krishnagiri, a new line between Mayiladuthurai –Thirukadaiyur – Tharangambadi – Tirunallar – Karaikal, a new line from Ramanathapuram – Kanyakumari via Thoothukudi – Tiruchendur, a new line between Karaikudi – Thoothukudi via Ramanathapuram, a new line from Karaikal to Sirkazhi, a new line from Salem (Namakkal) – Karaikal via Perambalur, Ariyalur, doubling from Thiruvananthapuram to Kanyakumari via Nagercoil, were also in the list of 20 projects.\n\nExpedite 20 pending projects\n\nin State, Jayalalithaa\n\nwrites to Modi", 
    "section": "national", 
    "title": "CM seeks Central funds for railway projects", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}