{
    "author": [
        "K Lakshmi"
    ], 
    "text": "After personalised stamps, including those with selfies, customers can now own ‘My Cancellation’ on envelopes with special messages.\n\n‘My Cancellation’ allows the customer to get a postal seal with a special message for the specific occasion along with a personalised ‘My Stamp’, which allows their images to be printed on it.\n\nAs part of its efforts to rekindle an interest in philately, the Department of Posts is offering residents a chance to send letters with a personalised touch.\n\nThe idea for the ‘My Cancellation’ cover was born when a philatelist V. Ethiraj recently ordered Rs.1 lakh worth ‘My Stamps’ with a to-wed couple’s photos printed on them. He later sought for a special cancellation on the wedding covers too that would carry personalised stamps.\n\nThe Department usually releases special cancellation covers commemorating an event along with commemorative stamps. Mervin Alexander, Postmaster General (Chennai City Region), said: “We decided to offer the personalised cancellation cover as people will cherish the covers. As it is a special facility, My Cancellation will be available only for those who order a minimum of 100 sheets of My Stamp on the same theme.” My Cancellation facility will be offered for Rs. 1,500. While a good number of people are visiting the Philatelic Bureau at Anna Road head post office campus to get their personalised stamps, the facility offered online has not gained much patronage yet.\n\nSince May 2013, nearly 16, 300 sheets of My stamps have been issued at Anna Road HPO. A sheet comprising 12 stamps costs Rs.300. However, of this, only 60 were booked online through Chennaipost website.\n\nThe Department has earned a revenue of nearly Rs. 49 lakh through the My Stamp initiative. Officials of the postal department said lack of awareness among customers could be behind the poor patronage of the online facility for ordering My Stamp.", 
    "section": "national", 
    "title": "Customers can now own ‘My Cancellation’ covers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}