{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Chennai City traffic police organise workshops to help MTC drivers adopt safe driving practices\n\ne did not know what the family of a bus accident victim could be reduced to. All these years, we did not.” — this is how a bus driver reacted when he saw the photo of a victim’s family at a workshop conducted by the Chennai traffic police at the Adyar bus depot on Thursday.\n\nThe poignant photo helped the traffic police drive home the central message of the workshop, organised to impress upon MTC drivers the necessity to follow the rules of the road and ensure safety for everyone.\n\n“Up to January 27 this year, 68 fatal accidents have been recorded in the city, and eight of them involved MTC buses. All these years, we have been booking cases against them. When an MTC bus driver is involved in an accident, he is put through a three-month refresher course. We are seeking to bring about a psychological change in the bus drivers so that they don’t cause accidents,” said a senior traffic police officer.\n\nTowards this end, the traffic police have been organising one-hour workshops at MTC training centres in Tondiarpet, Adyar, Chromepet and Aynavaram for the last one week.\n\nAround 70 drivers from various depots take part in these workshops and till date, over 700 drivers have been trained at various centres. “We formed a core team consisting of a few Assistant Commissioners and inspectors. They were told how to conduct these workshops,” added the officer.\n\nTrauma\n\n“We never think of the families and the trauma they undergo. You are trained people and are providing yeoman service to society, and, so, you need to be more responsible. Always remember that members of your family are also travelling on the road,” Assistant Commissioner Muthalagan told the MTC drivers at the workshop conducted at the Adyar bus depot on Thursday.\n\nHe used PowerPoint presentations to drive home the message, which included valuing the safety of fellow road users.\n\n“There will be deadlines set by the MTC, but you are trained to achieve that in a responsible manner. Understand that you are responsible for hundreds of people travelling in your vehicle and drive with utmost concentration. Besides, halt the bus at the stop and close to the platform,” he told the drivers.", 
    "section": "national", 
    "title": "Driving home the message of safety", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}