{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Plans strategy with inputs from enforcement agencies and web-based applications to monitor liquor sale, cash flow\n\nDetermined to curb the menace of distribution of money, freebies, liquor and gifts in exchange of votes in the Assembly polls, the Election Commission has planned to come up with a comprehensive strategy with inputs from multiple enforcement agencies, besides rolling out web-based applications to monitor liquor sale and cash transactions.\n\nAddressing a press conference here, Chief Election Commissioner Nasim Zaidi said that the Commission has received “very detailed inputs on the modus operandi of the distribution of money, liquor, gifts, etc., the period and time and various channels through which they are distributed” in the State.\n\nThe Commission has already taken a “review, reassessment and we will re-design our strategy to deal with the menace of distribution of money. The robust strategy will be unveiled at an appropriate time.”\n\nAccording to the Commission, a web-based application was being developed to monitor cash transaction reports from banks which were being used for reporting transactions above Rs. 10 lakh, including money transfer and RTGS/NEFT transactions. The application would also monitor all cash transactions through banks of value more than Rs. 1 lakh.\n\nAs regards purification of electoral rolls, which has been pressed for by several political parties, Mr. Zaidi said a special purification drive between February 15 and 29 in all poll-bound States would be held, in which door-to-door verification would be undertaken involving booth-level agents.\n\nAs political parties have brought to its notice the issue of “paid electoral surveys or motivated surveys,” the Election Commission wanted these surveys to be subjected to monitoring and oversight regulations, he said.\n\nThe Commission would come down heavily on paid news and district level media coordination committees have been set up to monitor this.\n\n“ Many political parties own channels and these are allowed 24 hours whereas physically many parties and candidates are prevented from campaigning. We are going to examine it,” he said.\n\nTo a query on political parties’ request not to impose promulgation orders during days before the polls, Mr. Zaidi said the Commission had taken note of it and would take an “appropriate” call.\n\nDuring its two-day visit to the State, the CEC and his team of officials had met representatives from nine recognised political parties, differently-abled forums, Bar Council, teachers associations, officials and senior police officers of district administrations . The CEC also had a meeting with the Chief Secretary, Home Secretary and the Director General of Police.\n\nWhile 17 constituencies in the State would have the Voter Verifiable Paper Audit Trail (VVPAT) through which voters can check whether their vote to the intended candidate has been registered, over 20,000 polling stations would have web casting CCTV cameras wherever possible. “We have directed officials to ensure that not a single voter is intimidated,” Mr. Zaidi said.\n\nVVPAT EVMs would be used in Anna Nagar, Vellore, Krishnagiri, Salem (North), Erode West, Tirupur (North), Coimbatore( North), Dindigal, Tiruchi (west), Cuddalore, Thanjavur, Kancheepuram, Villupuram, Madurai (east) Thoothukudi, Tirunulveli and Kanyakumari for the polls.\n\nAsked about the date of polling in the State, Mr. Zaidi hinted that the term of the present Assembly was to end on May 22 and the Commission would ensure that the next Assembly be constituted before that date.\n\nIn a bid to making polling stations disabled-friendly, the Commission has initiated online application for provision of wheelchairs and preparing information brochures in Braille for visually-challenged.\n\nThere are over 5.79 voters in the electoral rolls and 65,616 polling stations in the State. While over 78 per cent voting was recorded during the last polls, officials have been directed to try anywhere between 80 and 85 per cent this time.", 
    "section": "national", 
    "title": "EC to tighten grip on cash for votes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}