{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Devotees to be given non-woven carry bags to carry footwear and refuse\n\nTo ensure a cleaner Mahamaham and facilitate pilgrims enjoy a hassle-free event, the authorities are planning to distribute 16 lakh non-woven bags to carry footwear and refuse.The devotees will be given the carry bags once they arrive at the designated temporary bus stations in the periphery of Kumbakonam.\n\nThose who travel by car and park them at the specified locations too would be given the carry bags.\n\nHandling the footwear used to exercise the minds of devotees in such huge gatherings and now we have decided to address the issue by providing them a mode to carry them even as they participate in the festivities with lesser mental agony, according to Collector N. Subbaiyan who is coordinating the arrangements. A total of 2,000 conservancy staff are being deployed to clear frequently the garbage generated in the town’s various localities.\n\nFor the health and medicare requirements, a total of 137 medical camps would be pitched in various areas of the town besides which 20 special medical centres would be established in central locations to attend to emergent situations.\n\nThey would house medical specialists of various disciplines. Medical professionals from Thanjavur, Tiruchi, Tiruvarur and other places have been requisitioned for the purpose, Dr. Subbaiyan said. Twenty there ambulances would be ready to ferry patients requiring urgent medicare.\n\nFor the benefit of the pilgrims, drinking water points will be put up in 307 locations and as many number of temporary lavatories would also be in place.\n\nFor shuttling within the town’s peripherals, 100 mini buses have been readied and the facility would be inaugurated on February 13. While six organisations have been granted permission to conduct annadhanam, another 15 organisations and individuals have petitioned for permission that are being processed, Dr. Subbaiyan said.", 
    "section": "national", 
    "title": "Efforts on for cleaner Mahamaham festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}