{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Congress to take part in ‘Loan Waiver Convention’ on February 19\n\nTamil Nadu Congress Committee president EVKS Elangovan was on Thursday tight-lipped about the party joining any alliance for the Assembly elections.\n\nWhile confirming that Congress leader Ghulam Nabi Azad will, as a representative of the party’s high command, meet DMK leader Karunanidhi on February 13 to hold talks, Mr. Elangovan declined to answer a query on whether he had met DMDK leader Vijayakant for alliance formation.\n\nWhen asked about the change in equation now after his criticism of the DMK when it walked out of the UPA alliance, Mr. Elangovan shot back saying the situation was different then and now.\n\nTo a query on bogus voters in the list, Mr. Elangovan said the DMK has already raised the issue and the Election Commission of India had announced deletion of 1.4 lakh voters in Chennai. If need be, the Congress would approach the court on the issue, he said.\n\nMr. Elangovan charged Chief Minister Jayalalithaa with not doing anything beyond writing letters to the Prime Minister on the GAIL issue. “There has been no serious approach,” he said.\n\nMr. Elangovan said the Congress will take part in the ‘Loan Waiver Convention’ planned by Federation of Farmers’ Associations in Erode on February 19.\n\nMr. Elangovan slammed the AIADMK for saying the Congress was dependent on actor Khushbu’s support in Tamil Nadu. Ms. Khushbu, who was also present, said there was no need for the Congress to rely on an actor and that the party considered her a cadre. “If the AIADMK were to say that I am an actor and the Congress is after me, let them remember that Ms. Jayalalithaa also came from the tinsel world.”\n\n“Why not”, Ms. Khushbu said, when asked if she would share stage with DMK leader Karunanidhi. “I have only left the party, my respect for Kalaignar remains,” she said adding “I have not yet decided about contesting elections.”\n\nStaff Reporter adds from Coimbatore: Later in the day while returning from Erode to Chennai, Mr. Elangovan told journalists at the Coimbatore Airport that the party will decide on the number of seats and where to contest after finalising its alliance. Claiming that the AIADMK is trying to win the election by not imposing a ban on liquor, he hoped that people will bring an end to that party’s rule.Mr. Elangovan also said that the BJP can implement total prohibition across the country instead of blaming other parties ruling in various States for not enforcing prohibition.", 
    "section": "national", 
    "title": "EVKS Elangovan tight-lipped about poll alliance", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}