{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Normal functioning of government offices affected\n\nA section of government employees staging a demonstration at treasury office in Thoothukudi on Thursday.— Photo : N.Rajesh\n\nThe ongoing indefinite strike by the government employees and officials across the State has seriously affected the ‘services’ being extended by the government departments to the public on Thursday also.\n\nDemanding increased salary, withdrawal of contributory pension scheme etc., officials of various government departments have commenced indefinite strike which affected the common man. A group of government employees staged demonstration in front of the administrative building of the Collectorate.\n\nAs the strike intensified on Thursday, the public visiting the government offices had to return empty-handed.\n\nWhen the public in large numbers gathered at the Kovilpatti taluk office on Thursday, no official was there to receive applications from them or give any reply to clarify their doubts. Agitated over this, the public staged a sit-in dharna on the taluk office premises for a while.\n\nNagercoil\n\nAs the indefinite strike called by various associations of the Tamil Nadu Government employees entered the second day on Thursday, members of the associations staged demonstration urging the State to fulfil their 20-point charter of demands including withdrawal of New Pension Scheme, pay anomalies etc.\n\nOver 1,500 employees absented themselves for duty, said Rajkumar, District Secretary, Tamil Nadu Government Employees Association (TNGEA).\n\nMr. Rajkumar said the employees’ strike hit the functioning of government offices. The normal operations were affected in rural development, land survey, Commercial Tax, town panchayat and Municipal offices and also the education department.\n\nThe demonstration in front of the Collectorate was presided over by Leedenstone, District President and the protest before Vilavancode Taluk Office was presided over by Soundarrajan, Taluk President of TNGEA.\n\nThe members of various associations would block the road in front of the Collectorate in Nagercoil on Friday, Mr. Rajkumar added.", 
    "section": "national", 
    "title": "Government employees’ strike intensifies", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}