{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has closed a contempt of court application filed against Home Secretary Apurva Varma and former Additional Director General of Police (prisons) J.K. Tripathy after recording their submissions that “they were caught between the devil and the deep sea” due to conflicting orders passed by the High Court and the Supreme Court.\n\nDespite finding that there was a delay of four months in obeying the High Court order, to release a life convict prematurely, even after the conflict was resolved last year, Justices P.R. Shivakumar and V.S. Ravi closed the case after accepting an unconditional apology tendered by the Home Secretary if the delay caused in obtaining Governor’s approval was viewed as an act of contempt.\n\nThe High Court had on July 30, 2014 allowed a petition filed by the convict Ponnusamy and ordered his release forthwith by according the benefit of a Government Order passed on September 11, 2008 for premature release of 1,405 life convicts, who had completed seven years of imprisonment as on September 15 that year, in view of former Chief Minister C.N. Annadurai’s birth centenary.\n\nHowever, the Home Secretary neither went on appeal against the High Court order nor implemented it since former Law Minister Subramanian Swamy had challenged the validity of the 2008 G.O. before the Supreme Court which on July 9, 2014 passed an interim order restraining all the State Governments in the country from exercising power of remission to life convicts.\n\nAfter the filing of the present contempt of court application last year and after the apex court modified its interim order on July 23, 2015, the State Government released the convict Ponnusamy on November 26 with a pre-condition that he would be incarcerated once again if the apex court happened to quash the 2008 G.O. after final hearing of the case filed by Mr. Swamy.", 
    "section": "national", 
    "title": "HC closes contempt plea against Home Secretary, former ADGP", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}