{
    "author": [], 
    "text": "PIL by Satta Panchayat Iyakkam says Southern Railway has failed to provide basic facilities\n\nThe Madras High Court on Thursday directed the Southern Railways to take necessary steps to provide functional and clean toilets and quality drinking water in all suburban railway stations in Chennai with in two months and make temporary arrangement till then.\n\nThe First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh passed the order on a PIL moved by Satta Panchayat Iyakkam (SPI) that the Southern Railway has failed to provide the basic facilities as mandated by the Indian Railways Works Manual, 2000.\n\n“More than 15 lakh people in Chennai commute through the suburban railway system. This is an important mode of transportation for people in around the city. The network has over 70 railway stations out of which not even 20 per cent of the stations have functional, clean toilets or quality drinking water facility,” the petitioner said.\n\nWhen the petition came up for hearing, the counsel for Southern Railways stated that a tender has been floated on January 21 for 84 stations in Chennai division to provide toilet facilities on pay- and-use basis.\n\nThe tender will be opened on February 12 and the situation will show great improvement within about one month’s time, he said.\n\nRecording the submissions the Bench said, “It is completely unpalatable situation that even in suburban railways in Chennai, such a situation would prevail.”\n\nPointing out the submissions of the counsel for railways that endeavours made earlier through floating of tenders have not been successful, the judges said, “If that be the position, is it not necessary that even the present tender would evoke same response? All that can be said is that the tenders are on such terms and conditions as it is not eliciting any response, or other wise, the requirement would be for the railways to make necessary arrangements in-house for these facilities.”\n\nDisposing of the PIL, the Bench listed the matter on April 15 for compliance.\n\nOf the 70 railway stations, not\n\neven 20 per cent have functional, clean toilets", 
    "section": "national", 
    "title": "HC for clean toilets in stations", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}