{
    "author": [
        "R Rajaram"
    ], 
    "text": "Advanced surveillance cameras covering the city are non-operational\n\nouted once as a model city in implementing a hi-tech monitoring system aided by a chain of surveillance cameras in checking traffic-related violations and offences, Tiruchi has practically lost that status now.\n\nThe technology-oriented Traffic Regulatory Management System (TRMS) which raised the standards of surveillance elevating Tiruchi in the forefront has been virtually defunct for over a year. A string of sophisticated speed dome cameras and the more advanced Automatic Number Plate Reader (ANPR) cameras deployed at vantage points to cover the entire city have ceased to function and simply rotting at those spots.\n\nThe cameras-based TRMS which functioned vibrantly for over three years since its launch is today in a sorry state of affairs with the hi-tech gadgets having become unserviceable. With the cameras having gone blank, the modern police control room where “live” movements of vehicles and activities taking place at busy spots were being monitored is no longer a nerve centre of the virtually defunct TRMS.\n\nThe futuristic TRMS project implemented with the lofty aim of raising the standards of policing using technology was wholly funded by the State government under the Police modernisation programme.\n\nThe technology-oriented system with wireless connectivity was commissioned at a cost of Rs. 2.93 crore in April 2010 in Tiruchi. In fact, it was touted as the first city in the State to have a Wi-Fi surveillance system in place at the time of launch.\n\nUnder the TRMS, 12 speed dome PTZ (Pan Tilt Zoom) cameras were deployed at major traffic junctions, Central and Chathram bus stands and at NSB road and Gandhi Market – the two key commercial hot spots.\n\nForty two ANPR cameras were deployed at major traffic intersections besides at the eight check posts falling within the city. All cameras were linked to the control room through wireless connectivity by putting up 42 Wi-Fi towers at vantage locations covering the entire city.\n\nFour big plasma screens, 19 desk top systems, three application servers and a couple of storage servers were installed at the control room which were also linked to the cameras.\n\nThe hi-tech system enabled law enforcers to monitor movements “live” taking place at the major traffic junctions, check posts and other key spots sitting inside the control room. Not only did the system help the city police in effectively monitoring traffic-related violations such as signal jumping, over speed and accused who caused accidents, but also acted as a deterrent to criminals committing offences at commercial spots and bus stands.\n\nVehicles entering and leaving the city through check posts was monitored from the control room and the chamber of the Commissioner of Police through this system. The effective functioning of the TRMS attracted police personnel from Kerala, Karnataka, Hyderabad, Gujarat and Delhi besides those from other cities in the State. All these are history now with the TRMS having virtually become nonoperational.\n\nNon-renewal of AMC\n\nSources say the annual maintenance contract had not been renewed after the expiry of the three-year period with the private company which was entrusted with the task of managing the system.\n\nThe non-renewal of the contract resulted in the system in a state of limbo now. Sources say the cameras which became non-functional since May 2014 and dangling at the same spots had become non-serviceable.\n\nAlthough the police authorities had sent communications to the headquarters at different intervals to renew the annual maintenance contract, nothing tangible had emerged till now, say the sources.\n\nAnnual maintenance contract had not been renewed after the expiry of the three-year period with the private company which was entrusted with the task of managing the system.", 
    "section": "national", 
    "title": "Hi-tech traffic regulatory system in limbo", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}