{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nThe Vedapatashala Jagathguru Sri Jayendra Saraswathi Trust: Programme on ‘Hamasavahini Venna Sawaswathi Alangaram,’ Sri Annapoorneshwari temple, R.S. Puram, 9 a.m.\n\nSri Hamuath Jayanthi Mahotsava Committee: Aradhana Mahotsavam, Sri Narashimha Acharya Kothe, Sri Raghavandra swamy Brindavanam, Sullivan Street, 6 p.m.\n\nSri Rathna Vinayakar Temple: Chathurthi, D.B. Road, R.S. Puram, 8.30 a.m.\n\nVarasidhi Vinayakar, Varadaraja Perumal, Varada Anjaneyar Mahalakshmi Temples: Samvadssarabishga Peruvizha, 5 a.m.\n\nGENERAL\n\nKGISL Institute of Information Management: Conference on ‘Advance computing and IT applications,’ 10 a.m.\n\nMasonic Medical Centre for Children: Clinical meeting, 8.30 a.m.\n\nP.S.G.R. Krishnammal College for Women: Seminar on ‘Regional Indian literature in translation,’ 8.30 a.m.\n\nKumaraguru College of Technology: Inter-Collegiate Techno Cultural festival, 9.30 a.m.\n\nAJK College of Arts and Science: Seminar on ‘ Academic and administration audit,’ 9.30 a.m.\n\nS.N.R. Sons College: Graduation day, 10 a.m.\n\nBuild Intec: Building and construction trade fair, Codissia, 10 a.m.\n\nSNS College of Technology: Seminar on ‘Cloud computing,’ 10 a.m.\n\nIndian Association of Neonatal Nurses: Conference on ‘Champions for survival neonates,’ 9:30 a.m.\n\nDr. R.V. Arts College and Science: Conference on ‘Computing technologies and its applications,’ 10 a.m.\n\nNehru Arts and Science College: Symposium, 10 a.m.\n\nDr. N.G.P Arts and Science College: Talk on ‘Floral and cultural diversity of Andaman & Nicobar Islands,’ 10 a.m.\n\nNirmala College for Women: Seminar on ‘Echo of mathematics,’ 10 a.m.\n\nThe Coimbatore Productivity Council: National productivity day and productivity week inauguration, 9.30 a.m.\n\nThe Amateur Athletic Sports Association: Athletic events for children and Sri G. Vardaraj Memorial Sports, PSG Medical College,\n\n7.30 a.m.\n\nPSG Institute of Technology and Applied Research: Workshop on ‘Fundamentals of data analysis,’\n\n8.30 a.m.\n\nGandhian Institutions: 68th Sarvodaya Mela, Thevar Mandapam, Perur, 8 a.m.\n\nUDHAGAMANDALAM\n\nTamil Nadu Orthopaedic Association: Conference, Sterling hotel, 6 p.m.\n\nBird Count India: The Great Backyard Bird Count, 8.30 a.m.\n\nTIRUPUR\n\nAngel College of Engineering: Workshop on ‘Mobile application development using android,’ 9.30; seminar on ‘Life skill development,’ 10.30 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}