{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Protest Centre’s decision of making PAN compulsory\n\nMore than 500 jewellery shops in Ramanathapuram and Sivaganga districts downed shutters on Thursday as part of the State-wide stir, protesting against the Centre’s decision to make PAN card mandatory for gold purchases above Rs. 2 lakh.\n\nIn response to a call given by the Ramanathapuram gold and silver jewellery merchants’ association, about 300 jewellery shops – small and big – downed shutters to draw the attention of the Centre about the difficulties faced by jewellery merchants.\n\nSmall and mid-range jewellery shops in Paramakudi, Karaikudi and Sivaganga also downed shutters and expressed their solidarity with the big traders, B. Parthiban, secretary of the association said.\n\nThe one-day strike as part of the State-wide protest was to urge the Centre to enhance the purchase limit to Rs. 10 lakh as the new regulation seriously affected the sales of gold jewellers.\n\nAs the sales have witnessed a slide, the regulation had also affected the livelihood of goldsmiths, he said.\n\nChanging the PAN card regulation, which came into force in January 2016, caused practical difficulties as majority of the customers do not have PAN cards, he said.\n\nAsking the customers, who do not have PAN cards to fill Form 60 was all the more difficult as it contained a huge questionnaire, he said.\n\nThe merchants expected Union Finance Minister Arun Jaitely to address the issue while presenting the Union Budget later this month, he said.\n\nDindigul\n\nMore than 200 jewellery shops and 1,000 jewellery making units in Dindigul and 180 jewellery showrooms in Theni downed shutters here on Thursday with an appeal to the Centre to scrap PAN card requirement for buying gold over Rs.2 lakh.\n\nThe Main Road in Dindigul wore a deserted look owing to the bandh by jewellers. They appealed to the government to scrap the mandatory requirement of PAN Card for buying gold jewellery as it would be impractical to implement it and it would ultimately affect the jewellery sector.\n\nThe worst-affected would be the rural buyers who did not have PAN cards. Moreover, women were the major buyers of gold ornaments and rural women did not have PAN card.\n\nDemanding PAN cards was a negative step, said the jewellers. They appealed to the government to increase the purchase limit to Rs.10 lakh from Rs.2 lakh.", 
    "section": "national", 
    "title": "Jewellers down shutters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}