{
    "author": [
        "K Lakshmi"
    ], 
    "text": "They are seeking to revoke Centre's rule to produce PAN card for purchases above Rs. 2 lakh\n\nHundreds of jewellery shops downed their shutters across the State on Thursday in protest against the Centre’s mandatory ruling to produce PAN card on purchases above Rs.2 lakh.\n\nIt is estimated that jewellers lost business worth nearly Rs.300 crore owing to the one-day strike.\n\nBusy jewellery shopping hubs like T.Nagar in Chennai and Chinna Kadai Street and NSB Road in Tiruchi wore a deserted look as most shops were closed with banners announcing the bandh against the Centre’s move. Nearly 35,000 jewellery shops remained closed across the State seeking withdrawal of the ruling or increasing the limit to produce PAN card for purchases.\n\nThe Union government’s rule, which came into force from January 1, has already dented business volume, note jewellers. The sales have dipped by 30 to 35 per cent as buyers without PAN cards are hesitant to make a purchase, jewellers in Coimbatore and Chennai said.\n\nIn Coimbatore alone, the closure of 600 jewellery shops and 12,000 units for a day resulted in business loss of Rs. 25 crore. Members of the Coimbatore Jewellery Manufacturers’ Association demanded that the Centre should bring gold under the category ‘special commodity’.\n\nN. Ananthapadmanabhan, zonal chairman, All India Gems and Jewellery Trade Federation said: “Not all have PAN cards and about 70 per cent of buyers are farmers. Many customers hesitate or feel cumbersome to fill form 60 if they don’t have PAN cards.”\n\nDenying charges that bills are split up and arranged so that buyers can avoid producing PAN cards, he said “It is not an easy task and cannot be sustained. However, jewellers fear that this may increase unaccounted sales. N. Chandrasekaran, president, Tiruchi Jewellers Association said the number of people who have PAN card was limited and the new rule will only lead to unaccounted business and revenue loss to the government.\n\nLKS Syed Ahmed, chief advisor of Tamil Nadu Jewellers Federation said: “On an average, wedding jewellery purchase is made to a tune of nearly Rs. 7 lakh. The government must focus more on gold bullion trade where black money hoarding is more rather than retail sellers.”\n\nIn many cases, confidentially of PAN card data is a concern as people are hesitant to share the data for normal services. Somasundaram P.R., Managing Director, World Gold Council, India Operations, said misuse can’t be ruled out unless the PAN card holder has a system to know each time the PAN number is used to process a transaction.\n\n(With inputs from L.Srikrishna, R.Rajaram, M.Soundariya Preetha, and Sangeetha Kandavel)", 
    "section": "national", 
    "title": "Jewellers down shutters across State", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}