{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Protest Centre’s instruction on making PAN compulsory\n\nWhile the smaller shops transacted business as usual, the leading jewellery showrooms across the district downed shutters on Thursday in protest against the Centre’s recent instruction on making submission of Permanent Account Number mandatory during purchase of gold ornaments worth Rs. 2 lakh and above.\n\nAs the Union Government made it mandatory the submission of PAN during every purchase of jewels for Rs. 2 lakh, the jewellery shop owners opposed it saying that it would seriously affect their business, especially the business of larger establishments. Demanding the withdrawal of this direction, all leading jewellery showrooms in the district downed their shutters on Thursday.\n\nMarket leaders having their shops in Tirunelveli Town and on S.N. High Road closed their showrooms as a mark of protest. However, the smaller shops functioned as usual.\n\nIn neighbouring Thoothukudi district, almost all jewellery shops including the smaller ones, remained closed on Thursday in protest against the Centre’s instruction on making the PAN card compulsory for every purchase for Rs. 2 lakh.\n\nNagercoil\n\nAs many as 300 small and big jewellery shops and over 10,000 goldsmiths in Kanyakumari district closed their shops on Thursday urging the government to increase the gold purchase limit to Rs. 10 lakh from Rs. 2 lakh for mandatory submission of PAN Card.\n\nH. Shajakhan, president of Kanyakumari District Jewellers’ Association said the associations were fighting for the cause of agriculturists and villagers who do not have PAN cards. They should not be denied the opportunity to buy gold for marriage of their daughters, he said.\n\nDue to the one-day strike, the jewellers lost business to the tune of Rs. 10 crore on Thursday, Mr. Shajakhan said.\n\nMandatory revealing of PAN for purchase of gold jewellery worth Rs. 2 lakh and above came into effect from January 1, this year.", 
    "section": "national", 
    "title": "Jewellery showrooms down shutters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}