{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Fee determination panel announces the structure applicable till 2017-18\n\nEven as long queues outside the top schools in the city are becoming a familiar sight this admission season, the Private Schools Fee Determination Committee for this year has released the revised fees fixed for the current academic year. The revised fee structure will be applicable till 2017-18.\n\nThe committee has fixed the fees for 80 private schools in the city which include matriculation and Central Board of Secondary Education (CBSE) institutions. The National Public School, like last year, will be the most expensive school for parents whose wards are joining LKG there this year with an annual fee of Rs 42,680 having been fixed.\n\nPadma Sesahdri Bala Bhavan, Vidya Mandir Senior Secondary School, Lady Andal Venkatasubbarao Matric Higher Sec. School and Bhavan’s Rajaji Vidyashram will charge a fee of over Rs 30,000 per annum for LKG.\n\nWhen compared to the 2015-16 academic year, there has been a uniform 10 per cent hike in the fees fixed across all the schools for 2016-17. A 10 per cent hike in the fees will be implemented again by all the schools for the 2017-18 academic year.\n\nAn interim order which was recently passed by the Supreme Court exempted nearly 600 CBSE and ICSE schools from the purview of the fee fixation committee.\n\nHowever, a number of CBSE schools still feature in the list. “The CBSE schools that no longer fall under the committee’s purview are the ones which were getting their fees fixed under the committee on an annual basis. Many did not have to get the fees fixed this year again under the committee after the court order and hence do not feature on the list. The CBSE Schools for which fee has been revised are the ones which got their fees fixed last year for a two-year period,” a school principal from the city said. Sources also said that the CBSE had sent a circular earlier this week to all affiliated schools in the city stating that the fees that they were fixing must be in accordance to the facilities and infrastructure being offered.", 
    "section": "national", 
    "title": "LKG education gets dearer", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}