{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Kandapuranam’ by Shanmuga Tirukkumaran, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: Discourse on ‘Tiruvilayadalpuranam’ by N.S. Sundararaman, 5 p.m.; Abirami Anthathi parayanam, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Avvai Kural’ by A.K.S. Tirumavalavan, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nAnushaththin Anugraham: Discourse on ‘Sri Maha Periyavar Mahimai’ by Indira Soundararajan, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Viveka Choodamani class, Sri Kuttaiah Swami Mutt, 164 South Veli Street, 6.45 p.m.\n\nRamakrishna Mutt: Yogasana class, 6 a.m.; aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGandhi Museum: Inter-faith prayer, S. Jayaraj, Research Officer, delivers message; T. R. Dhinakaran, chairman, presides, Peace Park, 4.30 p.m.\n\nLady Doak College: Kalidasa’s Abhijana Shakuntalam, an adaptation by Daughters of the Stage, J.X. Miller Auditorium, 10 a.m. and 5 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: 49{+t}{+h}annual convocation; K. Rosaiah, Governor, presides; D.J. Pandian, Director General, Pandit Deendayal Petroleum University, Gandhi Nagar, and P. Palaniappan, Minister for Higher Education, address, Palkalai Nagar, 5.30 p.m.\n\nVivekananda College: 45{+t}{+h}annual sports meet; P. Karthikeyan of Annamalai University distributes prizes; Swami Sadananda, president, Sri Ramakrishna Tapovanam, Tirupparaithurai, presides; Swami Niyamananda, secretary, addresses, Tiruvedakam West, 8.20 a.m.\n\nThiagarajar College: C. Ramasubramanian, State Nodal Officer, District Mental Health Programme, inaugurates Counselling Support Centre; D. Helen Christina of Sri Meenakshi Government College for Women speaks on ‘Online and mobile counselling;’ Ramya Maheswari of Ethiraj College on ‘Student counselling;’ Uma Kannan, chairperson, Women’s Studies centre, presides, Main Hall, 10 a.m.; K. Kohila of Rail Net Software Solutions speaks on ‘Introduction to ASP.net programming,’ M. Eyini, Principal, presides, Computer Science Lab, 2.15 p.m.\n\nSaraswathi Narayanan College: Founder’s Day celebration; R. Mohan, former Professor of Tamil, Madurai Kamaraj University, delivers L. Narayanan Chettiar memorial lecture, M. Kannan, Principal, presides, Perungudi, 10 a.m.\n\nSourashtra College: G.R. Mahadevan, former Vice-Principal, inaugurates Tagore English Association; L. P. Ramalingam, Principal, presides, Department of English, 10.30 a.m.\n\nMadurai Institute of Social Sciences: Susie B. Varghese, Principal Commissioner of Income Tax, inaugurates training programme in specialised care for children affected by drug abuse; D.V.P. Raja, chairman, presides, Alagarkoil Road, 11 a.m.\n\nSourashtra High School Council: Annual Day celebration; A. Tiruneela Prasad, Special Judge, TNPID Court, addresses; T. Selvarani distributes prizes; M. N. Sankaran presides, Sourashtra Higher Secondary School, Kamarajar Road, 4 p.m.\n\nMahatma Montessori Matriculation Higher Secondary School: Inauguration of ‘Kalam’s Sparkles 2016,’ art and science exhibition by Perumalsamy Navaraj, Principal, Annai Fathima College of Arts and Science, K. K. Nagar, 9 a.m.; by Rachana Binani, Director, Kidss Talk, Baba Building, 10 a.m.\n\nSarasavani Mount Litera Zee School: KG Annual Day celebration; Nihar Ranjan, District Forest Officer, distributes prizes, T. Cecil Gilbert, Forest Range Officer, addresses, Nagari-Sholavandan, Road, Rayapuram, 5.30 p.m.\n\nMadurai Productivity Council: K. Nagaraj, Managing Director, Aparajitha Corporate Services, inaugurates Productivity Week celebration; K.N.K. Karthick and K.N.K. Ganesh address, 11 a.m.; C. Muthuraja, Dean, American College, speaks on ‘Empowerment of students and skill development,’ PG Conference Hall, K. L. N. College of Engineering, Pottapalayam, 2 p.m.\n\nYoung Indians and Nativelead Foundation: Aarambam, start-up contest, award ceremony; Ganapathy Venugopal, CEO, Axilor, and Latha Rajan, Director, MaFoi Strategic Consultants, address, Thiagarajar College of Engineering, 4 p.m.\n\nCol. Pennycuick Educational Trust: 175{+t}{+h}birth anniversary of Col. Pennycuick; C. Raghavan, Principal District Judge, presides, Setupati Higher Secondary School, 10.30 a.m.\n\nRotary Club of Madurai West: Meeting, Hotel Sangam, 6 p.m.\n\nTopkids: Counselling session at All-Women Police Station, Tallakulam, 10.30 a.m.\n\nAlcoholics Anonymous: Meeting, RC School, Sivaganga Road, Melur, 6.30 p.m.; Parasakthi Nagar, Avaniapuram; CSI Church, Narimedu, and Maniammai Nursery School, North Masi Street, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}