{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A group of workers from Tamil Nadu building infrastructure for the 2022 football World Cup claims they were exploited by their employers in Qatar and want the Indian government to ratify the UN convention of 1990 that ensures protection of migrant workers and their family members.\n\nThe workers also want the Indian government to publish the names of exploitative recruiters and employers and grant domestic workers legal protection of labour rights accorded to other workers in foreign countries.\n\nNearly 20 persons who claim they were cheated want the government to change the sponsorship or “kafala” system that ties workers to their employers and encourages forced labour.\n\nThey also demanded that the government abolish “supply companies” and companies which want workers to build infrastructure in Qatar for the World Cup in 2022, recruit the workers directly, to prevent them from being exploited or cheated by dubious agents.\n\nThe workers, brought together by the National Domestic Workers Movement (NDWM), alleged that their employers in Qatar did not pay them their promised salary of 1,800 Riyals per month while making them work under extreme conditions.\n\nQatar has been in the limelight for the poor working conditions to foreign construction workers who are building the stadia and other infrastructure in the country.\n\nAt least three workers from Tamil Nadu on Thursday claimed that they had been imprisoned in Qatar for nearly two months under false cases as they tried to file a complaint against their employer’s exploitative practices.\n\nThe workers said many of them worked a minimum of 18 hours per day and were not given food. Some of them accused the agent based in Kerala of misleading them and alleged that the sub-agents in various parts of the country had assured them that their salaries would be paid, but had done nothing so far.\n\n“We have not filed any complaint with the police so far since the agents have promised us that we will get our salaries. But some of us returned to India 5-6 months back and we are yet to see a single rupee. For every one of us, the salary will be at least Rs. 1 lakh, of which we have received nothing,” Veera Kumar from Virudhunagar said.", 
    "section": "national", 
    "title": "Migrant workers claim they were cheated in Qatar", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}