{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Southern Railway has announced more special trains in view of the mahamaham at Kumbakonam to clear the extra rush of pilgrims attending the event.\n\nThe Nagercoil – Villupuram (Train No. 06189) superfast special fare train will leave Nagercoil at 5 p.m. on February 21 and reach Villupuram at 4.15 a.m., the next day. The Villupuram – Nagercoil (Train No. 06190) special fare special train will leave Villupuram at 2.05 p.m. on February 22 and reach Nagercoil at 4.15 a.m., the next day.\n\nThe trains will stop at Valliyur, Tirunelveli, Kovilpatti, Sattur, Virudhunagar, Madurai, Dindigul, Tiruchi, Thanjavur, Kumbakonam, Mayiladuthurai, Chidambaram and Tiruppadiripuliyur. The Rameswaram – Villupuram special fare special train (Train No. 06191) will leave Rameswaram at 11 p.m. on February 21 and reach Villupuram at 9.45 a.m., the next day. The Villupuram – Rameswaram special fare special train (Train No. 06192) will leave Villupuram at 12.30 p.m. on February 22 and reach Rameswaram at 11.55 p.m., the same day.\n\nIt will stop at Mandapam, Uchipuli, Ramanathapuram, Paramakudi, Manamadurai, Sivaganga, Devakottai Road, Karaikkudi, Pudukottai, Tiruchi, Thanjavur, Kumbakonam, Mayiladuthurai, Chidambaram and Tiruppadiripuliyur. The Tiruchi – Chennai Egmore superfast special fare special train (Train No. 06193) will leave Tiruchi at 1.45 p.m. on February 20 and reach Chennai Egmore at 9 p.m. the same day. The Chennai Egmore – Tiruchi superfast special fare special train (Train No. 06194) will leave Chennai Egmore at 11.10 a.m. on February 23 and reach Tiruchi at 6.25 p.m., the same day.\n\nIt will stop at Thanjavur, Kumbakonam, Mayiladuthurai, Chidambaram, Tiruppadiripuliyur, Villupuram, Chengalpattu and Tambaram. Train No.06193 Tiruchi – Chennai Egmore superfast special fare special train will stop at Mambalam also. The Tiruchi - Chennai Egmore superfast special fare special train (Train no. 06195) will leave Tiruchi at 9.15 a.m. on February 21 and reach Chennai Egmore at 4.15 p.m., the same day. The Chennai Egmore – Tiruchi superfast special fare special train (Train No. 06196) will leave Chennai Egmore at 8.20 p.m. on February 21 and reach Tiruchi at 3.30 a.m., the next day. Train No.06195 Tiruchi – Chennai Egmore superfast special fare special train will stop at Thanjavur, Kumbakonam, Mayiladuthurai, Chidambaram, Tiruppadiripuliyur, Villupuram, Tindivanam, Melmaruvathur, Chengalpattu, Tambaram and Mambalam. Train No.06196 Chennai Egmore – T iruchi superfast special fare special train will stop at Tambaram, Chengalpattu, Villupuram, Tiruppadiripuliyur, Chidambaram, Mayiladuthurai, Kumbakonam and Thanjavur. The Coimbatore – Mayiladuthurai special fare special train (Train No. 06199) will leave Coimbatore at 7.45 p.m. on February 21 and reach Mayiladuthurai at 2.40 a.m., the next day. The Mayiladuthurai – Coimbatore special fare special train (Train No. 06200) will leave Mayiladuthurai at 10 p.m. on February 22 and reach Coimbatore at 6.40 a.m., the next day. It will stop at Coimbatore North, Tiruppur, Erode, Pugalur, Karur, Kulithalai, Tiruchi, Thanjavur and Kumbakonam.\n\nThe Coimbatore – Mayiladuthurai special fare special train (Train No. 06201) will leave Coimbatore at 7.10 a.m. on February 23 and reach Mayiladuthurai at 1.40 p.m. the same day. The Mayiladuthurai – Coimbatore special fare special train (Train No. 06202) will leave Mayiladuthurai at 2.50 p.m. on February 23 and reach Coimbatore at 9.15 p.m., the same day. It will stop at Irugur, Tiruppur, Erode, Karur, Tiruchi, Thanjavur and Kumbakonam. Advance reservations for the trains will commence on Friday, a press release said.", 
    "section": "national", 
    "title": "More special trains for Mahamaham", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}