{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Say storage level comfortable; rule out scarcity in summer\n\nWith no rainfall in catchment areas and water depleting steadily in Vaigai reservoir, a meeting chaired by Mayor V.V. Rajan Chellappa reviewed the situation here on Thursday.\n\nThough the officials maintained that there would be no scarcity this summer as the combined storage in Periyar credit was comfortable at 2,856 mcft on Thursday, compared to 1370 mcft during the corresponding period last year, water scarcity in extension areas such as Chintamani, Iravathanallur and Avaniapuram has become a cause for concern.\n\nSenior officials in the Corporation and Tamil Nadu Water and Drainage (TWAD) board said that the Cauvery integrated drinking water scheme, which was commissioned last month, had teething problems.\n\n“Against the promised 12 mld of water a day, we have been distributing close to 11 mld. There are complaints of leakage from pipelines in Iravathanallur and Chintamani. Similarly, residents of some areas in Avaniapuram want their localities to be covered under the scheme. We are laying pipelines,” they said.\n\nResidents of DRO Colony said water supply was erratic in their area. It had become a common scene to see empty pots lined up in front of the Collector’s camp office on New Natham Road. Water scarcity was faced in Alagappan Nagar and Karpaga Nagar near K. Pudur also.\n\nA residents’ welfare association office-bearer in Anna Nagar said that the Corporation could have a dedicated complaint mechanism to deal with water supply so that officials could keep tabs on number of complaints received and redressed, he said.\n\nPublic Work Department (PWD) officials, at a meeting chaired by Collector K. Veera Raghav Rao on Thursday, said that water for irrigation would be released on turn system until March-end. With the storage in dams depleting and no sight of rain, farmers must use the available water judiciously, the Collector said.\n\nMeanwhile, Agriculture Department officials said that there was no cause for alarm as of now and that results of harvest indicated high yield in the region, especially in Vadipatti block.", 
    "section": "national", 
    "title": "Officials take stock of water availability", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}