{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With Smart Cities requiring huge funding, officials have started focussing on project planning and building capacity for right systems of governance.\n\nSpeaking at the conference on Smart Cities here on Thursday, Chennai Metrowater Managing Director Vikram Kapur said funds to the tune of Rs.80,000 crore was estimated to be required for the development of smart water supply and sewage network for Chennai. But the city is expected to get Rs.1,000 crore under the Smart Cities project over a period of five years.\n\n“If you can work out a bankable proposal, funding options are available. The bigger problem today is capacity. If you have your governance systems right, you can implement a smart city,” said Mr. Kapur.\n\n“Smart City is doable. Funds are available. However, what we need to do is build capacity, both within the government and outside,” Mr. Kapur said.\n\nThe U.S. Trade and Development Agency (USTDA) Director Leocadia I. Zak said, “Everyone talks about the initial 20 projects. They talk about seed financing, which they hope to be matched by additional financing from local governments and also from the private sector. But how do you get them to match that initial seed funding? The Germans are coming forward. The Japanese are coming forward. We are here with money. Well-prepared projects are going to find money. I have never seen a well-prepared project that cannot find financing.”\n\nRaising concerns about regulatory environment for the municipal bond market, Ms. Zak said, “We have to find ways to de-risk some of these financial instruments. That is the big question now.” Participants at the conference underscored America’s deep commitment to the U.S.-India relationship, pointing to two-way trade that has almost tripled in the last decade.", 
    "section": "national", 
    "title": "‘Planning crucial to find funds’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}