{
    "author": [
        "S Ganesan"
    ], 
    "text": "NHAI hopeful of getting the no-objection certificate\n\nThe National Highways Authority of India (NHAI) is hopeful of getting the no-objection certificate from the Public Works Department soon for the revised alignment of the proposed by-pass road connecting the Tiruchi-Madurai and Tiruchi-Karur national highways around the city.\n\nThe road was to run from Panchapur on the NH45 via Thayanur to Jeeyapuram on NH 67.\n\nThe project was taken up as part of the widening of the NH 67 being executed on Build Operate and Transfer (BOT) basis.\n\nThe work had remained grounded over the past four years initially after farmers raised objections against the road being laid across irrigation tanks.\n\nThe project, mired in controversy relating to its alignment and land acquisition since 2006-07, would bring about a semi ring road for the city and could substantially reduce traffic congestion in the city.\n\nWhile the total length of the by-pass was around 17 km, the alignment between the Tiruchi-Dindigul and Tiruchi-Karur highways, a distance of about 4.5 km, was opposed by farmers as it was proposed to be laid across irrigation tanks.\n\nWork on the project was halted midway after the Madurai Bench of the Madras High Court, based on petition filed by local farmers, struck down the NHAI’s plan to lay the road across the Kothamangalam, Kallikudi and Punganur tanks in 2010. The farmers alleged that laying the road across the tanks would affect irrigation and their livelihood. It was suggested that the NHAI could build the bypass road without affecting the irrigation sources.\n\nSo, a public hearing was held in December 2011 to elicit the views of locals on the possible alternative alignments for the road.\n\nAlthough the district and NHAI authorities were said to have agreed on a revised alignment to take the bypass road along the bunds of the irrigation tanks, the work has not restarted pending the issue of a no-objection certificate (NOC) from the Public Works Department for the revised alignment.\n\nMeanwhile, farmers who took up the issue to the court opposing the laying of the road across the tanks, however, say that they were not against the project as such. They contend that they were not against laying the bypass road but only wanted the water bodies to be protected.\n\n“The project has been hanging fire since 2010 and the Chief Minister during her campaign had assured that it would be executed as per the court directions. If no decision is taken at the next Cabinet meeting, I have planned to go on a hunger fast in front of the Secretariat in Chennai from February 22,” said M.P.Chinnadurai, district president, Tamizhaga Vivasayigal Sangam, who was among the farmers leaders who had opposed the laying of the road across irrigation canals.\n\nSources in the NHAI said that they were hopeful of getting the NOC from the PWD soon as the matter has been taken up with the higher officials of the department in Chennai.\n\n“We have been assured that the NOC will be issued within a week. We are ready to execute the work even though it will involve cost escalation. After the NOC is issued, further action will be initiated,” a senior official of NHAI said.", 
    "section": "national", 
    "title": "PWD nod for revised alignment of by-pass road awaited", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}