{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, Namperumal purappadu from sanctum sanctorum in pallakku, 6.30 a.m.; reaching Transporter Rama Rao mandapam, 11 a.m.; purappadu from the mandapam in Karpaga Viruksham, 6.30 p.m.; reaching vagana mandapam, 8.30 p.m.; purappadu, 8.45 p.m.; reaching sanctum sanctorum, 9.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Udhayalakshmi Flats, Raghavendrapuram, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 9/23, Venkatesa Street, LIC Colony, 6 p.m.\n\nGENERAL\n\nBharathidasan Institute of Management : Athenaeum – international conference on management research, Sunder Ramaswamy, Officiating Director, Madras School of Economics, inaugurates and speaks on Trade, Technology and Economic Transformation, Hotel SRM, 9.30 a.m.\n\nBharathidasan University Department of Environmental Management : Lecture on Sustainable water resources management in India by V.Subramanian, UGC Emeritus Professor, School of Environmental Studies, Jawaharlal Nehru University, university campus, 11.15 a.m.; Department of Women’s Studies: Valediction of national seminar on Women in public administration, S.Padmavathy, principal (in-charge), Bharathidasan University Constituent College, Navalurkuttapattu, chief guest, Khajamalai campus, 3.30 p.m.\n\nIndian Society of Nephrology Southern Chapter: Annual conference, Maj.Gen.Tejender Ahluwalia, Commandant, Command Hospital, Eastern Command, Kolkata, inaugurates, Ramdas Pisharody, chairperson, ISNSC, presides, Hotel Sangam, 6.30 p.m.\n\nSt.Joseph’s College : Seminar on Extension activities – challenges and opportunities, S.Xavier Alphonse, coordinator, Jesuit Higher Education, St.Joseph’s College, delivers key note address, 9.30 a.m.\n\nHoly Cross College : Acme – inter-collegiate literary fiesta, Sr.Jeusin Francis, principal, inaugurates, 9 a.m.; valediction, Prabhu Solomon, film director, chief guest, 4.30 p.m.\n\nNational College Department of Tamil: Seminar on Management thoughts in Tamil literature, M.Thirumalai, former Vice Chancellor, Tamil University, inaugurates, 10 a.m.; Department of Physics: Inauguration of Physics Association, P.Premchander, Head, Department of Electronics and Communications, Kamaraj Government Arts College, speaks on Trends in nano science, 11 a.m.\n\nRotary Club of Tiruchi Sakthi and MAM Group of Institutions : ‘Ezhuchi,’- programme for students of government and government aided schools, S.Sekar, Principal, Urumu Dhanalakshmi College, chief guest, 10 a.m.\n\nSeethalakshmi Ramaswami College : Lecture on Industrial Disputes by C.Paramasivan, assistant professor, Periyar E.V.R.College, 3.30 p.m.\n\nBHEL Women’s Welfare Association : Annual day, S.Gopinath, Executive Director, BHEL, Tiruchi, chief guest, MD Hall, BHEL Township, 5.30 p.m.\n\nNehru Memorial College, Puthanampatti : Think Quest – inter collegiate competition, 10 a.m.; Sivakumar Natarajan, Manager, Projects, Cognizant Technology Solutions, distributes prizes, 3 p.m.\n\nChidambaram Pillai College for Women : Valediction of NSS special camp, A.Lakshmi Prabha, NSS Coordinator (in-charge), Bharathidasan University, chief guest, college campus, Manachanallur, 1 p.m.\n\nM.A.M.College of Engineering: Workshop on Innovative Electronics, K.C.Tamilventhan, Director, LIFT Technologies, resource person, 9.30 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Workshop on e-waste management approaches and its impact on environment and health, 10 a.m.\n\nAlpha Plus Education Campus : Alps Fete – cultural extravaganza, Vivek, actor, chief guest, K.K.Nagar, 6 p.m.\n\nSanta Maria Montessori Matric Higher Secondary School : Annual day, M.Ravindran, chief guest, 5.30 p.m.\n\nSt.Joseph’s College Department of Physical Education : Centenary tournaments – volleyball, 7 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}