{
    "author": [
        "R Sujatha"
    ], 
    "text": "It will prevent students from using mobile phones, other gadgets for copying\n\nThe University Grants Commission has decided to allow universities to deploy low-powered jammers in examination halls to prevent students using mobile phones, bluetooth and other gadgets for copying.\n\nIn a notice to all universities, UGC secretary Jaspal S. Sandhu said the government has a policy to provide the jammers on lease in order to prevent unfair means used through radio frequency based devices by the examinees.\n\nHowever, the universities can’t procure jammers on their own due to security reasons.\n\nThe Cabinet Secretariat has informed the UGC that prior permission from it is necessary to prevent security threat.\n\nOnly from ECIL and BEL\n\nAnd that the jammers could be procured only from two companies – ECIL and BEL.\n\n“The examination conducting bodies must provide all the details such as the centres (and colleges) and the number of jammers required to the officials. Universities cannot individually invite tenders from other unauthorised manufacturers,” said Arti Bhatnagar, Joint Secretary (Security), Cabinet Secretariat, in the letter to UGC Chairman Ved Prakash.\n\nComplaint\n\nUGC Vice Chairman H. Devaraj told The Hindu that the decision to permit universities to use jammers followed complaint from a medical university that students had carried mobile phones into the exam hall and had used it for copying.\n\nIn 2012, a case had come up in the Madras High Court stating that two students of Government Stanley Medical College had copied using a mobile phone.\n\nThe college had sought the help of cyber crime officials to prove that the students had indeed used bluetooth to copy in the exams. One student was barred from taking the exam for three subsequent sessions.\n\n‘Mobile phones\n\nnot allowed’\n\nAccording to S. Thirumagan, controller of examination, University of Madras, the directive on the use of jammers should come from the Syndicate, the statutory body.\n\n“We don’t allow mobile phones inside the examination hall. Invigilators and the chief superintendent have the authority to physically verify the students. It is one of the 10 instructions for the invigilators that mobile phones cannot be carried into the examination halls,” he said.\n\nThe universities can’t procure jammers on their own due to\n\nsecurity reasons", 
    "section": "national", 
    "title": "UGC allows varsities to use jammers in exam halls", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}