{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Popular faces of Tamil civil society, who have openly backed the People’s Welfare Front (PWF), are increasingly facing personal attacks, both off and online that seek to paint them as personalities with vested interests.\n\nOver the past two weeks, several writers and publishers have openly declared their support to the PWF, arguing that a true change in the current scenario would put an end to the rule of the major Dravidian parties in the State. The DMK cannot be the best alternative to the ruling AIADMK given its past performance and hence their support to the PWF, they said.\n\nThe response to such statements on social media has ranged from calling them “proxies” of the ruling party to personal attacks questioning their life’s work. The PWF itself has been deemed as ‘Team B’ of the AIADMK.\n\nBadri Seshadri, promoter of ‘Kizhaku,’ a publishing house, bore the brunt of vulgar attacks by trolls on Facebook after he penned his reasons for supporting the PWF. Mr. Seshadri said the major parties do not encourage the emergence of an alternative and hence their supporters vilify anybody who dares to think beyond.\n\nHe said that there was also an attempt to make personalities prisoners of their past positions and deeming any change in thought a sign of hypocrisy. “In 2014, I supported the BJP. I still support the Centre though I have differences in many issues. In Tamil Nadu, I feel the BJP has not presented a credible alternative programme. The DMK has not done anything to feel it is different from 2011,” he claimed, adding that in the past he had backed the DMK.\n\nWriter A. Marx said rather than attacking the ideas put forth, the past of the personalities were being misrepresented to weaken the credibility of the voice. “When I questioned the handling of the 1998 Coimbatore blasts and incidents leading to it by the DMK government, I was accused of trying to dissuade Muslims from the DMK,” he said, adding that AIADMK sympathisers too engage in “character assassination.” Political commentator Gnani said personal attacks were a display of frustration. “If you do not have concrete answers, you divert by attacking the person,” he opined. Writers and journalists too have faced such charges. “This is not a new trend in Tamil Nadu nor is it confined to one party,” he added.\n\nSenior DMK leader T.K.S. Elangovan alleged that there could be no doubt that the media has been soft on the government. He said those rooting for third front tend to focus their energies on the DMK much more than the AIADMK. “By doing so, focus is being diverted from core issues and the government escapes criticism,” he said.", 
    "section": "national", 
    "title": "Under fire for backing PWF", 
    "subsection": "tamilnadu", 
    "date": "2016-02-12"
}