{
    "author": [
        "Devesh K"
    ], 
    "text": "As Jat protesters target public and private property, over 5,000 security personnel have been deployed in the affected districts\n\nTraffic on the Chandigarh-Shimla highway in Panchkula was severely hit after Jat community protesters blocked it on Sunday.— Photo: AFP\n\nven as fresh incidents of violence by agitating members of Jat community broke out in Haryana, the Union Home Ministry said on Sunday that the situation was fast returning to normality. Over 5,000 security force personnel have been deployed in the affected districts.\n\nThe protesters targeted police posts and private property in Bhiwani and Sonipat, forcing the government to deploy over 1,700 more paramilitary force personnel, apart from the Army columns. Protests were organised in Hisar, Jind, Rohtak and Jhajjar.\n\nCabinet Secretary P.K. Sinha reviewed the ground situation and had a video conference with Haryana Chief Secretary D.S. Dhesi and the Union Ministries.\n\n“It was informed that the situation is fast returning to normalcy. The civil administration has been effectively strengthened by the deployment of the paramilitary forces and the Army columns, which have restored law and order in affected districts. The blocked road between Rewari and Jhajjar has been opened. Other road blockades are being cleared fast,” a Home Ministry official said.\n\nThe Cabinet Secretary said the government’s top priority was to restore water supply in Delhi. He directed the authorities to take stringent action against those indulging in violence and other anti-social activities. The National Crisis Management Committee, headed by the Cabinet Secretary, asked the Haryana government to ensure uninterrupted water supply.\n\nThe Delhi government has announced closure of schools on Monday in the wake of the water crisis in the State. Chief Minister Arvind Kejriwal also called upon the residents to conserve water.", 
    "section": "national", 
    "title": "Amid violence, Centre says normality returning fast", 
    "subsection": "general", 
    "date": "2016-02-22"
}