{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Two Captains, one Lance Naik and two CRPF constables among those killed\n\nGeneral Officer Commanding, 15 Corps, Satish Dua, pays tribute to Captain Pawan Kumar, who was killed in the Pampore encounter on Sunday. —Photo: Nissar Ahmad\n\nCaptain Pawan Kumar (22), one of the three Army personnel killed fighting terrorists in Pampore in Kashmir Valley on Sunday, was an elite para commando.\n\nThe Captain hailed from Jind district in Haryana, where the Jat agitation is currently on.\n\nThe Army also lost Capt. Tushar Mahajan from Udhampur and Lance Naik Om Prakash (32), both from 9 Para Special Forces, who succumbed to injuries in hospital. Two personnel from the Central Reserve Police Force (CRPF) — Head Constable Driver R.K. Rana and Head Constable Bhola Singh — were also killed in the operation. “Capt. Kumar was killed as he was leading his men. The operation was tricky as the possibility of some civilians being trapped inside the building was not ruled out,” said an officer.\n\nOn hearing about his son’s death, Capt. Kumar’s father, Rajbir Singh, said, “I had one child, I gave him to the Army, to the nation. No father can be prouder.”\n\nCapt. Kumar’s death and his father’s comments could not be any starker to the developments in their home State Haryana burning due to the agitation by the Jat community. “He was destined to be in the Army as he was born on Army Day,” the father said.\n\nAccording to Army officers, Capt. Kumar had taken part in two successful operations, including the one on February 15 in Pulwama where one terrorist and two civilians were killed.\n\nCapt. Kumar was born on January 15, 1993, graduated from the 123 course of the National Defence Academy and was commissioned into the Army on December 14, 2013. He was with the 10 Para Special Forces and in service for less than three years.\n\n“Pawan Kumar was a young and a dynamic officer. He was a true commander,” said Lt. Gen. S.K. Dua, General Officer Commanding of the Udhampur-based 15 Corps.", 
    "section": "national", 
    "title": "Army loses elite commandos", 
    "subsection": "general", 
    "date": "2016-02-22"
}