{
    "author": [
        "Samarth Bansal"
    ], 
    "text": "The unemployment rate in urban areas reduced from 4.5 per cent in 2004-05 to 3.4 per cent in 2011-12, new data from the National Sample Survey Office show. In rural areas, the rate has been stable at around 1.7 per cent during this period.\n\nAccording to the survey, which was conducted in 2011-12 and released on Friday, the unemployment rate across all the religious groups in rural areas was on the lower side than those in urban areas for both males and females. Unemployment rate is defined as the number of persons unemployed as a proportion of the labour force (persons who are either ‘working’ or ‘seeking or available for work’), not the total population.\n\nChristians have the highest rate of unemployment in both rural (4.5 per cent) and urban (5.9 per cent) areas in 2011-12. The rate in urban areas for Christians stood at 8.6 per cent in 2004-05 while the rural rate stays constant.\n\nSpeaking to The Hindu , Alakh Sharma, Director of Institute of Human Development, said: “Unemployment level in India is highest among those people who are richer and more educated. The reason is that poor people can’t afford to stay unemployed, and hence, opt for any kind of work, irrespective of the nature of the job. The better off have the capacity to be unemployed as they look for the right job. Christians are the most educated group, hence unemployment rate is higher among them.” Data from the report supports the claim. ‘\n\nAmong the persons of age 15 and above, the proportion of people who are not literates was the lowest for Christians. Also, the proportion of persons with educational level secondary and above is highest for Christians.\n\nWhile the unemployment rate in rural areas has decreased for Sikhs (from 3.5 to 1.3 per cent) — now the lowest across all religious groups — it has slightly increased for Muslims (from 2.3 to 2.6 per cent). At 3.3 per cent, Hindus have the lowest unemployment rate in urban areas.\n\nCasual labour\n\nSelf-employment is the major source of income for almost half the households, across all religious groups, in rural areas, followed by casual labour.\n\nIn urban areas, the proportion of households deriving major income from regular wage or salary earnings is the highest. Half the Muslim households in urban areas have self-employment as major source of income, the highest among all religions, while regular wage or salary earnings was the highest for Christians with 45.8 per cent households.\n\n\n\n\n\nUnemployment level highest among those people who are richer and\n\nmore educated\n\n(The headline has been edited for errors)", 
    "section": "national", 
    "title": "Christians most educated, but highest unemployment rate: Survey", 
    "subsection": "general", 
    "date": "2016-02-22"
}