{
    "author": [
        "K S"
    ], 
    "text": "Complaints on demarcation of Coastal Regulation Zones (CRZ) in coastal areas of Kerala will be reviewed shortly.\n\nThe Kerala Coastal Zone Management Authority (KCZMA) has received around 200 complaints on the draft Coastal Zone Management Plan (CZMP) prepared for the coastal districts of the State. The CRZ notification 2011 mandates that coastal States should have a plan in place, which will decide on the land use near waterbodies.\n\nThe CZMP details the geo-morphological and ecological features of each coast while marking the high tide and low tide lines from where the CRZ regime begins. The specialities of each coast, including the presence of mangroves, intertidal zones, various other ecological and sensitive areas zones, and ‘no’ development zones would also be marked in the plan.\n\nOnce the plan is approved, it would serve as the base document for identifying the areas in which the development activities would be regulated.\n\nA four-member committee has been constituted to look into the complaints regarding the plan. The committee will have N.R. Menon, Eapen Varghese, K.V. Thomas, and Kamalakshan Kokkal as its members. Coastal communities have been complaining that the CRZ norms restrict the construction and even repair and reconstruction of the dwelling units.\n\nSeveral local bodies along the coast had demanded that they be excluded from the purview of the CRZ notification which would help them construct housing as well as commercial structures along the coast.\n\nThey had also asked for reassessing the salinity test, which formed the basis for determining the CRZ. If salinity of five parts per thousand was recorded in a waterbody during the driest part of summer, the coastal area adjoining the waterbody would come under the ambit of the CRZ.\n\nVembanad violation\n\nMeanwhile, a move to identify the CRZ violations along Vembanad Lake have met with limited success. Though the authority had identified around 5,000 “land modifications” along Vembanad Lake and asked the local bodies concerned to verify them, only a few responded to it. It was following an order from the Supreme Court that the authority identified the modifications, sources said.\n\nNotification says States should have a plan which will decide on land use near waterbodies", 
    "section": "national", 
    "title": "Complaints on Kerala’s Coastal Regulation Zones to be reviewed", 
    "subsection": "general", 
    "date": "2016-02-22"
}