{
    "author": [], 
    "text": "It’s a harrowing documentary about Europe’s refugee crisis\n\nGianfranco Rosi, director of Fuocoammare , with the Golden Bear on Saturday.— Photo: AP\n\nItalian film Fuocoammare ( Fire at Sea) , a harrowing documentary about Europe’s refugee crisis, clinched the Berlin film festival’s Golden Bear top prize from a jury led by Meryl Streep on Saturday.\n\nAs Europe grapples with its biggest migrant influx since World War II, the picture by Italian director Gianfranco Rosi offers an unflinching look at life on the Mediterranean island of Lampedusa, where thousands of asylum seekers from Africa and the Middle East have arrived trying to reach the European Union over the last two decades.\n\nThousands more have perished on the dangerous journey in rickety, overcrowded boats. Mr. Rosi, who spent several months on Italy’s Lampedusa making the film, dedicated the prize to its residents “who open their hearts to other peoples”.\n\n“I hope to bring awareness,” he said as he accepted the trophy from Ms. Streep.\n\n“It is not acceptable that people die crossing the sea trying to escape from tragedies.”\n\nThe picture is told through the eyes of a 12-year-old local boy, Samuele Pucillo, and a doctor, Pietro Bartolo, who has been tending to the dehydrated, malnourished and traumatised new arrivals for a quarter-century.\n\nThree-time Oscar-winner Streep said her seven-member jury was “swept away” by Fire at Sea which she called “urgent, imaginative and necessary filmmaking”.\n\n“It's a daring hybrid of captured footage and deliberate storytelling that allows us to consider what documentary can do,” she said.\n\n“It demands its place in front of our eyes and compels our engagement and action.”\n\nIn other prizes, France’s Mia Hansen-Love won the Silver Bear for best director for her drama Things to Come . Tunisia’s Majd Mastoura won the Silver Bear for best actor for his role in Hedi , a love story set in the aftermath of the Arab Spring, which also won best debut feature.\n\nThe Silver Bear for best actress went to Denmark’s Trine Dyrholm for her role as a wronged wife in Thomas Vinterberg's The Commune , a semi-autobiographical take on his 1970s childhood.\n\nGrand Jury Prize\n\nOscar-winning Bosnian director Danis Tanovic took the runner-up Grand Jury Prize among 18 contenders for Death in Sarajevo about the corrosive legacy of the 1990s Balkan wars.\n\nA more than eight-hour-long historical epic by Filipino director Lav Diaz, A Lullaby to the Sorrowful Mystery , claimed the Alfred Bauer Prize for a feature film that opens new perspectives in cinema.\n\nBest screenplay went to Polish filmmaker Tomasz Wasilewski, his portrait of the pivotal 1989-90 period in his country as told by four women, played by some of Poland's best-known theatre actresses, at crossroads in their lives. — AFP", 
    "section": "national", 
    "title": "Fire at Sea is awarded Golden Bear at Berlinale", 
    "subsection": "general", 
    "date": "2016-02-22"
}