{
    "author": [], 
    "text": "A language becomes national only when everybody in the country speaks it, says Adoor Gopalakrishnan.\n\nNational Award-winning filmmaker Adoor Gopalakrishnan on Sunday said though Hindi was a “beautiful language” and it should be counted as a regional one, it should not be imposed on others.\n\n“Hindi is a very beautiful language. There are very fine writers in Hindi, no doubt about that, but you cannot impose Hindi over and above others... not only administratively but even otherwise,” he said on the sidelines of the second edition of Gateway LitFest here.\n\nAdoor said he felt that since India was made up of various cultures and traditions, an “exclusive” attitude would not work.\n\n“Hindi is imposed only officially. Because, officially they want to have one language kind of attitude from everybody... that’s a very exclusive kind of attitude. India is a country of several different cultures, languages, styles of living. Naturally, you have to allow and understand that,” he said.\n\nEntire country\n\nAdoor said for a language to be classified as national, it should be spoken by the entire country. “It is wrong when you think Hindi is a national language and other languages are regional. All the languages are regional, it becomes national only when everybody in the country speaks a particular language, but that doesn’t happen,” he said. Adoor added that he felt Hindi should be counted as a regional language as people in many parts of the country do not speak it.\n\n“In the north-east and in South, they don’t speak Hindi. So, you cannot call it a national language. These are languages used for inter-community dialogues, not more than that. Hindi is reaching more people because most of the North is speaking it. It should be treated as regional language only,” he said.\n\nAdoor (74) played a major role in revolutionising Malayalam cinema and is regarded as one of the finest filmmakers of India. He pioneered the new wave cinema movement in Kerala with his first film Swayamvaram in 1972. His last work was Oru Pennum Randaanum (A Woman and Two Men) in 2008 which won the Kerala State award for best director. — PTI", 
    "section": "national", 
    "title": "Hindi can’t be imposed on others, says Adoor Gopalakrishnan", 
    "subsection": "general", 
    "date": "2016-02-22"
}