{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "There was no attack, everyone is lying, says Dantewada SP\n\nThe attack on tribal activist and Aam Aadmi Party (AAP) leader Soni Sori late on Saturday comes days after her failed attempt to lodge a police complaint against controversial IPS officer and Bastar range Inspector General (IG) of Police S.R.P. Kalluri for allegedly intimidating her.\n\n“We went to the Dantewada police to lodge a police complaint against Mr. Kalluri in the second week of February under the Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Act. But the police refused to register our complaint saying that Mr. Kalluri is a tribal himself and so no case under the Act could be made out against him,” Ms. Sori’s nephew, Lingaram Kodopi, told The Hindu .\n\nMr. Kalluri was not available for comment. However, Dantewada Superintendent of Police (SP) Kamlochan Kashyap termed the attempt to lodge a complaint against Mr. Kalluri “a big drama.”\n\nMs. Sori was attacked by unknown assailants in Dantewada district of South Chhattisgarh on Saturday evening as she was returning from Bastanar town to her residence in Geedam town.\n\n“Two persons threw something on her face. It looks like acid. Her eyes and face are burning,” said Mr. Kodopi.\n\nMs. Sori was taken to New Delhi on Sunday evening for further treatment and she is likely to be admitted to the AIIMS. Speaking to reporters at Raipur airport, Ms. Sori said she would speak in detail after reaching New Delhi. “What is happening is not good. Now I fear for my life and the safety of my kids.”\n\nAsked who could be the possible attackers, the tribal activist said she received a call at 6.12 p.m. on Saturday that some people were conspiring to attack me. “I told the person that I would meet him today [Sunday]. I was getting constant reminders from the people that the police wanted to eliminate me. But I ignored them. Most of my fight has been against the police department in Bastar.”\n\nHer face continues to be swollen and the chemical could not be removed from her face at the Jagdalpur hospital, where she was first taken.\n\nDantewada SP sceptical\n\nThe Dantewada SP questioned the sequence of events and circumstances leading to the attack on Ms. Sori. “There was no attack on her. Wrong vocabulary is being used for the incident. . There was nothing like that… everyone is lying here,” he said.", 
    "section": "national", 
    "title": "I fear for my life and my children’s safety: Soni Sori", 
    "subsection": "general", 
    "date": "2016-02-22"
}