{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prime Minister says new scheme is aimed at ‘reducing the burden of migration to the cities’\n\nPrime Minister Narendra Modi at the launch of the Shyama Prasad Mukherji National Rurban Mission, in Rajnandgaon district of Chhattisgarh on Sunday.— Photo: PTI\n\nPrime Minister Narendra Modi said on Sunday that he has successfully brought the government to the people of the country from the corridors of New Delhi.\n\nLaunching ‘Rurban Mission’ in Dongargad, a town in Rajnandgaon district, he said: “Previous governments had the habit of doing everything by sitting in Delhi. They would invite 200 to 400 people to the Vigyan Bhavan in Delhi and light some candles [at the launch of programmes]. Some media friends also used to help them. But I have brought the government out of Delhi and among the people.”\n\nHis government is for the Dalits, the tribals and the poor, Mr. Modi said.\n\nPraising Kovarbai, a 104-year-old woman from the State, for selling her goats to build a toilet in her home, Mr. Modi called her a “symbol of new development.”\n\n“This is the signal and a proof of a new beginning. Don’t show my speech, but show my mother Kovarbai’s achievement,” he asked the media covering the event.\n\nHe said the ‘Rurban Mission’ was aimed at “reducing the burden of migration to the cities”.\n\n“It is the culmination of rural and urban. Development should be in such a way that its soul should be in the villages and the cities should be its body. The mission will reduce pressure on cities and provide a new avenue to people living in villages.”\n\nUnder the mission, around 300 “urban growth centres” would be developed in different parts of the country for “proper economic development.”\n\nMr. Modi made a special mention of Ambagad village in Rajnandgaon for “levying a tax on open defecation.”", 
    "section": "national", 
    "title": "I’ve brought government closer to people: Modi", 
    "subsection": "general", 
    "date": "2016-02-22"
}