{
    "author": [], 
    "text": "Hakeem was making women employees watch objectionable clippings on his official laptop\n\nActing tough against harassment against women employees in the judiciary, the Karnataka High Court has dismissed a District Judge from service on charges of sexually harassing women employees.\n\nFifty-seven-year-old A.N. Hakeem, who was serving in Belagavi district, was dismissed from the service on January 22, 2016 after an inquiry that took nearly four years to complete after receipt of the complaint. He had joined the judicial service as a Munsif in 1987.\n\nBased on the outcome of the inquiry report submitted in July 2015, the Full-Court of the High Court on November 20, 2015 decided to terminate his services.\n\nThe inquiry conducted against Mr. Hakeem concluded that he was making women employees watch clippings of pornographic videos and photos on his official laptop.\n\nThe tip-off about alleged sexual harassment by the judge was received by the then Chief Justice of the Karnataka High Court in the form of an anonymous letter on November 1, 2011. After the Chief Justice asked the High Court’s Vigilance Cell to initiate preliminary inquiry, a woman employee lodged a complaint on November 8, 2011 accusing the judge of sexual harassment.\n\nAs the complaint included that the judge was “forcing” women employees to watch clippings of porn videos and photos on the laptop officially allotted to him, the laptop was seized and the engineers of the High Court’s computer wing, with the help of experts, retrieved pornographic materials stored in it. During the inquiry more women employees, who worked under him during 2008-2011 in different courts, disclosed particulars of “exhibition of sexual proclivity” by him.\n\nThe women employees revealed the details about how he “misbehaved” with them both at his court’s chamber and at his home, where he used to call them to take dictation.\n\nBesides, Mr. Hakeem was also making adverse remarks on their official work when they did not cooperate for his sexual overture.\n\nThough the judge did not lead any evidence in his support, he raised some objections besides claiming that some materials were “inserted” into his laptop by others.\n\nStating that the judge had “not” suggested that the “evidences against him were created,” the IA found that woman employees had identified porn photos and videos that they were forced to watch, etc.\n\nObserving that the district judges enjoy unquestionable trust of the colleagues and employees, the Inquiry Authority concluded that the material was sufficient to prove the charge of sexual harassment as per the guidelines of the Supreme Court in the case of Apparel Export Promotion Council of India Vs A.K. Chopra, and Vishaka case verdicts.\n\nCharges were “proved” that the district judge’s conduct was “unbecoming of a judicial officer” and committed “misconduct” as per the Karnataka Civil Services (Conduct) Rules, the IA held.", 
    "section": "national", 
    "title": "Karnataka HC sacks district judge for sexual harassment", 
    "subsection": "general", 
    "date": "2016-02-22"
}