{
    "author": [
        "Jennifer Crossley Howard Katherine Webb"
    ], 
    "text": "Kith and kin gather at Monroeville to pay final respects to Harper Lee\n\nThe grave of Harper Lee, on the day of the author’s burial in her hometown of Monroeville, Alabama.— Photo: NYT\n\nFriends and family from around the corner and across the country gathered here on Saturday to pay final respects to Harper Lee, the author whose Pulitzer Prize-winning novel about racial inequality in the South during the Jim Crow era inspired generations of readers.\n\nA dense fog that had shrouded this small town lifted as mourners filed into the First United Methodist Church, which Lee had attended for many years, for a simple, private service that lasted about two hours.\n\nThe relatively small guest list included nephews and other relatives of the publicity-shy author, as well as friends from her hometown and places afar like New York City, where she had once lived and had written her celebrated book, To Kill a Mockingbird .\n\n“She controlled what world she wanted to live in,” said Joy Brown, a close friend from New York who, with her husband, financed Lee’s writing pursuits during the period when she wrote Mockingbird .\n\nThe mood in this town of about 6,300 was muted, like Lee’s approach to celebrity, which she eschewed. She may have written a book that has sold more than 40 million copies worldwide since its publication in 1960, but there were no television news trucks and no police officers outside the church as her coffin, adorned with a spray of red and white roses, was wheeled into the church.\n\n“She wanted to be buried before anyone knew she was dead, and we’re getting as close to it as possible,” said George Landegger, an industrialist and philanthropist, who attended the service.\n\nIn addition to the private memorial service, the church opened in the afternoon to allow people to offer their sympathies and best wishes to Lee’s extended family and her lawyer, Tonja B. Carter.\n\nUntil she died in her sleep early on Friday, at age 89, Lee had lived at the Meadows, an assisted living facility here. She was to be buried at Pineville Cemetery near the church, next to her father, Amasa Coleman Lee, who was the role model for her fictional character Atticus Finch, and near the graves of her mother, Frances, and her sister Alice.\n\nLee, known here as Nelle, was a Methodist, and Alice Lee held a number of prominent positions with the church and was also its lawyer.\n\nHarper Lee was a different story, recalled the Rev. Thomas Butts, who was pastor from 1993 to 1998.\n\n“She did not want to do anything that put her in the public eye,” he said, although she attended church regularly, typically sitting in the fourth or fifth pew with her sister.\n\nLee was the most celebrated resident in town, private but not a recluse, and was often seen out at the restaurants with her sister. But she kept an apartment in New York, even after she moved back to the town where she had grown up.\n\n“Nelle loved New York,” the pastor said. “She could keep her privacy intact in New York; she could hide in the open. You see, living in Monroeville is like living in a fishbowl.”\n\nHer impact on Monroeville was evident everywhere, from the mockingbirds that adorn some buildings in the town square to the black funereal bows placed on the doors of the old courthouse, now a museum, where Lee set the scenes for her novel about a lawyer’s fight for justice and tolerance.\n\nOutside the old courthouse on Saturday, Jared Anton, a lawyer from Florida, said the character of Atticus Finch had partly inspired his choice of profession, but he said he was disappointed at how reticent some people in town were to talk about Lee, even after her death.\n\n“I have no problem if the lady wants a private funeral,” he said. “But the impact of this book goes far beyond Monroeville or Monroe County.”\n\nIt was unclear who among Lee’s relatives and friends gave testimonials. But one speaker was Wayne Flynt, a friend of Lee’s and professor emeritus of history at Auburn University, who said before the service that Lee had asked him to speak some 10 years ago.\n\n“She didn’t want me to talk about her, she wanted me to talk about her art,” he said. — New York Times News Service", 
    "section": "national", 
    "title": "Mockingbird author is memorialised as she lived", 
    "subsection": "general", 
    "date": "2016-02-22"
}