{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "The city’s organ donation machinery is on a roll this year, inching close to Tamil Nadu, that has for years had the most robust organ donation system in place. Mumbai has so far recorded 11 cadaver donations, as compared to eight in the first two months of 2015. Not just that, the organs being harvested are no longer limited to kidneys. The total number of organs donated so far stands at 37.\n\nThe developments in Mumbai are in tune with the Centre’s national initiative to boost organ donations . Officials of the Union Health Ministry told The Hindu that it was only last Thursday when a meeting of representatives of all ministries was held to figure out the role each Ministry could play to promote organ donations.\n\nOfficials of the Zonal Transplant Coordination Committee (ZTCC) said that of the many factors enabling more donations was better awareness as well as proactive measures being undertaken by hospitals.\n\n“Of the 11 cadaver donations, six cases were self-driven,” said a ZTCC official.\n\nExperts watching the developments from the sidelines say the trend in Mumbai is a heartening one, and point out that from the national perspective, the Western region has shown the most activity.\n\n“Maharashtra has recorded 16 cadaver donations, which is impressive. There is a high level of political support with the state Chief Minister supporting the initiative. Until now, Tamil Nadu, Andhra Pradesh, Karnataka and Kerala have been doing good. Organ donation in Chandigarh is picking up,” said Dr. Anil Kumar, nodal officer of the National Organ Transplant Programme. While the Southern states have still clocked in higher figures than Maharashtra, the trend is a promising one.\n\nThe Centre is also looking at beefing up storage facilities for tissues and bones in each region of the country. Speaking to The Hindu , Dr. Anil Kumar said even the Union Health Ministry was supporting the cause and as part of its national programme, it is giving up to Rs. 5 crore for setting up biomaterial centres to store tissues and bones that are harvested from cadavers.\n\n“The money is for both setting up such centres in each region and upgrading the existing ones to international standards,” he said.\n\nThe upside of the trend is that organ donations are being viewed positively. “The earlier impression of kidney rackets until a few years ago is gone. The trust is coming back now,” said Dr. Sunil Shroff, managing trustee of the Chennai-based Mohan Foundation. He also pointed out two interesting patterns – one, tier II cities like Aurangabad and Pune too were reporting cadaver organ donations, and, two, the nature of donations were not limited to kidneys.", 
    "section": "national", 
    "title": "Mumbai close to T.N. in organ donation", 
    "subsection": "general", 
    "date": "2016-02-22"
}