{
    "author": [], 
    "text": "A preliminary probe has found “no evidence” to suggest that cow meat was served at Aligarh Muslim University’s college canteen as was claimed by some right-wing groups, the police said.\n\n“A police team led by the Station House Officer, Civil Lines Police Station, visited Jawaharlal Nehru Medical College’s canteen immediately after receiving complaints from some right-wing organisations that beef was being served there.\n\n“However, the team found no evidence whatsoever to suggest that any banned food item was being served in the canteen,” Senior Superintendent of Police K. Ravindra Gaur said.\n\nThe row broke out after right-wing activists alleged that ‘beef biryani’ was being served at the AMU Medical College canteen, an allegation promptly denied by the university.\n\nDemonstration held\n\nBJP Mayor Shakuntala Bharti, along with party leaders and several right-wing activists, held a demonstration outside the office of Senior Superintendent of Police, demanding registration of an FIR against the contractor of the medical college canteen for serving ‘beef.’\n\nA university spokesman clarified that it was common practice in India and abroad to refer to buffalo meat also as beef.\n\nIn fact cow meat had been banned in this institution more than a century back by its founder Sir Syed Ahmad Khan, keeping in view religious sensitivities, he said.\n\nAMU Vice Chancellor, Lt. Gen. (Rtd.) Zameer Uddin Shah, on Sunday said he was “seriously concerned” over the entire episode and the fact the city Mayor had taken up this issue with the police.\n\n“I wish to point out that there is no truth whatsoever in the entire allegation that cow meat is being served anywhere on the AMU campus. This is entirely an attempt to whip up communal tension on a very lame excuse,” Mr. Shah said.\n\n“We, at AMU, are deeply aware of the sentiments involved in such sensitive issues and there is no question of permitting anybody for violating the law on this matter,” he said. — PTI\n\nRight-wing activists alleged that ‘beef biryani’ was being served at the college canteen", 
    "section": "national", 
    "title": "No proof of cow meat in biryani at AMU, say police", 
    "subsection": "general", 
    "date": "2016-02-22"
}