{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Visiting Nepal Prime Minister K.P. Sharma Oli on Sunday described his country’s Constitution as “institutionalised democratic struggle.”\n\n“Where is discrimination in the Nepali Constitution? The Constitution was drafted after consulting all sections of the Nepali people like the Tharus, the Madhesis, and the Janajatis, and does not discriminate against anyone in Nepal,” Mr. Oli said at a press conference in Delhi.\n\nMr. Oli’s comments are significant as it marks a hardening of Nepal’s position, just a day after Foreign Secretary S. Jaishankar spoke of Nepal’s “assurances” on making the Constitution more inclusive.\n\nFollowing Mr Oli’s comments, leaders of the United Madhesi Democratic Front (UMDF) told The Hindu that they too would harden their position and revive the protest against the government. “Madhesi people are upset and we shall soon be back with protests on the streets and blockade on the border, as that is the only way to convince the Nepali government of our demands,” said Upendra Yadav of UMDF.\n\nBut on Sunday, Mr Oli argued that Madhesis do not have a solid basis for reverting to the blockade which froze Nepali economy and hit India-Nepal ties.\n\n“We will ask about the reasons for the unhappiness if anyone wants to reinforce the blockade on Nepal-India border, as the Constitution can address all issues,” Mr. Oli said.\n\nMr. Oli’s colleague and Deputy Prime Minister Kamal Thapa said the government of Nepal was in touch with the Madhesis, but could not clarify the reasons for the trust deficit between the two sides.\n\n“Another blockade will not be in anyone’s interest. I personally briefed the Madhesi leaders before arriving in Delhi and they seemed to be satisfied with our position. So the latest threats appear like public posturing to me,” Mr Thapa told The Hindu .\n\nMr. Oli acknowledged that “some misunderstanding” had appeared between India and Nepal after the promulgation of the Nepali Constitution on September 20, 2015. But the Constitution was drafted through an open consultative process, he said. “Rounds of discussion took place before the draft of the Constitution was finalised. We did not bring the Constitution under the cover of the night,” Mr. Oli said.\n\nHe assured the Madhesi that agitation would not be allowed to spiral out of control into a violent secessionist movement like the Tamil agitation of Sri Lanka.", 
    "section": "national", 
    "title": "Oli defends Constitution", 
    "subsection": "general", 
    "date": "2016-02-22"
}