{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "A committee under Union Minister and senior BJP leader M. Venkaiah Naidu will look into all aspects of reservation for Jats and submit a report to the Centre on the issue.\n\nThe decision was taken at a meeting Union Home Minister Rajnath Singh had on Sunday with leaders of some Jat khap panchayats here.\n\n“While the committee will prepare a comprehensive report on Jat reservation, the Haryana government will introduce a Bill in the State Assembly to provide for reservation for Jats in the State,” Mr. Singh said.\n\n“I appeal to everyone to maintain peace. However, law and order is a State subject. If someone indulges in violence, we will have to take action,” Mr. Singh told the media after a series of meetings, including one with a delegation of members from the Jat community.\n\nAfter the meeting, Mr. Singh, Defence Minister Manohar Parrikar and External Affairs Minister Sushma Swaraj also met to discuss how to resolve the ongoing crisis.\n\nUnion Minister Sanjeev Baliyan, BJP leaders Anil Jain, OP Dhankar and Haryana Finance Minister Captain Abhimanyu were among those present during the meeting.\n\nAfter the meeting with the Home Minister, Jat Sangharsh Samiti leader Jaipal Singh Sangwan said the discussion was “very positive.”\n\nExpressing confidence that the community would accept the decisions, he said, “We appeal to everyone to call off the agitation.”\n\nHooda goes on fast\n\nMeanwhile, Haryana Congress leader Bhupinder Singh Hooda has gone on a fast “for peace to return” to the State.\n\nHaryana Congress chief Ashok Tanwar told The Hindu : “What is of utmost importance is that peace prevails. The Congress wants to soothe tempers.”\n\nWhile Jats have reservation in some States — though not in Haryana — they are not on the central list of those accorded reservation. The Army and paramilitary forces are out in large numbers to control the grim situation in Haryana.\n\nThe committee\n\nwill prepare a comprehensive report, says the Home Minister", 
    "section": "national", 
    "title": "Rajnath meets Jat heads; panel under Naidu to look into quotas", 
    "subsection": "general", 
    "date": "2016-02-22"
}