{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Kimono, a traditional Japanese dress, was a hit among visitors at the cultural extravaganza, Japan Habba 2016, heldin Bengaluru on Sunday.— Photo: V. Sreenivasa Murthy\n\nThe Head of the Consulate of Japan in Bengaluru has expressed concern about the safety of Japanese students in India. It is one of the reasons why they do not pursue their higher studies here, said Jun-ichi Kawaue, Head of the Consulate, on Sunday.\n\nHe did, however, say that Bengaluru was safer than most other cities in India, including Delhi.\n\nMr. Kawaue was talking to presspersons on the sidelines of the Japan Habba, 2016 organised by the Japan Habba Trust in association with Bangalore University.\n\nRecent events such as the attacks on international students and the violence against women had created a lot of buzz in Japan.\n\n“The safety of their children is a major criterion for all parents, which is why only a small number of Japanese students come here to study. The students prefer studying in the U.S. or Australia,” he said, adding that there was a need for the Indian government to improve its public relation activities to promote the country and attract students from Japan.\n\nHowever, when The Hindu spoke to many Japanese students studying in the city, they said that while they had some initial “adjustment” problems, Bengaluru was a relatively safe place.\n\nShunosuke Hiraoka, a M.Sc. student who is pursuing a yoga therapy course, said: “Bengaluru may not be very safe, but at the same time I would not term it a dangerous city,” he said.\n\nHe pointed out that he did have adjustment issues as he his college was located in Jigani and they were cut off from the city’s cosmopolitan nature.\n\nHowever, many are of the opinion that Bengaluru is still safer than other Indian cities", 
    "section": "national", 
    "title": "Safety biggest deterrent for Japanese students in India: official", 
    "subsection": "general", 
    "date": "2016-02-22"
}