{
    "author": [
        "National Bureau"
    ], 
    "text": "The Environment Ministry has extended to December 2018 a scheme granting default Forest Department approval for public utility projects in Naxal-affected regions.\n\nSuch a scheme has been in place since 2011 in 117 districts, including those in Jharkhand, Maharashtra and Telangana.\n\nSunday’s directive is an extension of this programme that lapsed in December 2015.\n\nClearances needed\n\nAll projects require separate forest and environmental clearances, given the specific circumstances of a project.\n\nVarious utilities\n\nA statement by the Environment Ministry noted that the general approval was granted, “keeping in view the importance of creation of public utility infrastructure such as schools, dispensaries/hospitals, electric and telecommunication lines, drinking water projects, water/rainwater harvesting structures, minor irrigation canals, non-conventional sources of energy, skill upgrade/vocational training centres, power substations, rural roads, communication posts, police establishments like police stations/outposts/border outposts/watch towers in sensitive areas identified by the Ministry of Home Affairs.\n\nThey also include underground laying of optical fibre cables, telephone lines and drinking water supply lines in Left-Wing Extremism-affected areas.”\n\nHowever, this default approval is only eligible for projects that take up no more than five hectares.\n\nSuccessful projects\n\nSome of the successes that have resulted from this scheme, according to the Ministry, are, a government polytechnic at Bagodhar in Giridih, Jharkhand; the construction of a Kendriya Vidyalaya at Deogarh, Odisha; Sloni Kanya Ashram Project and Magarlodha Boys School Project in Dhamtari, Chhattisgarh; women ITI training centre in Kanker, Chhattisgarh; construction of a government medical college at Kudwa, Gondia, Maharashtra; Vocational Bamboo Research and Training Centre at Chandrapur, Maharashtra; and establishment of Telangana School of Horticulture in Medak, Telangana.\n\nUnder the plan, public projects will get default Forest Department approval", 
    "section": "national", 
    "title": "Scheme for projects in Naxal zones extended", 
    "subsection": "general", 
    "date": "2016-02-22"
}