{
    "author": [
        "Karnataka Bureau"
    ], 
    "text": "Prasad, who threw a packet at Siddaramaiah, being led away by police in Bengaluru on Sunday.\n\nIt what is being viewed as a “security scare”, a man hurled a paper ball at Karnataka Chief Minister Siddaramaiah, describing it as a bomb, at a cultural function organised at Ravindra Kalakshetra here on Sunday. According to the police, this is the first such instance in the 1,000-day-regime of Mr. Siddaramaiah.\n\nHowever, refusing to term the incident as security breach, the Chief Minister said: “Such incidents are common in a democratic system, or else how can it be a democracy?”\n\nHe felt that someone might have instigated the man. Otherwise, he could not see any reason for somebody to behave in such a manner.\n\nThe function was organised by Udayabhanu Kala Sangha to mark its golden jubilee and release Bengaluru Darshana — a 3,000-page literary work comprising three volumes on history of Bengaluru.\n\nUnion Minister Ananth Kumar and the former Chief Justice of India M.N. Venkatachaliah were present on the occasion.\n\nWhen Mr. Siddaramaiah began his address, the man, who was seated in the balcony of the auditorium stood and shouted: “What have you done to our community? Tell that first”.\n\nHe then hurled a “plastic packet” which dropped almost near the Chief Minister.\n\nThere was commotion for some time, as the audience mistook the paper ball for a “bomb.”\n\nThe police, who were in for a shock, immediately rushed to the balcony and overpowered the man, identified as B.H. Prasad, a member of the Savita Samaja. Normalcy was restored after the police declared that it was just a paper ball containing chocolates and wrappers.\n\nMr. Siddaramaiah, who looked disturbed for a moment, regained composure and asked officials to find out, to which community the person belonged to.\n\nIn his address, the Chief Minister said there was no question of the Congress government doing injustice to any community.\n\nPrasad who was taken to the S.J. Park Police station for questioning, was in an inebriated state, according to the police.", 
    "section": "national", 
    "title": "Security scare as man hurls paper ball at Siddaramaiah during cultural function", 
    "subsection": "general", 
    "date": "2016-02-22"
}