{
    "author": [
        "Satyasundar Barik"
    ], 
    "text": "Prime Minister Narendra Modi on Sunday took a dig at Odisha Chief Minister Naveen Patnaik for ‘hurriedly’ addressing farmer rallies ahead of his meeting here.\n\n“I came to know that the Chief Minister came to this region recently. I thanked him for publicising my rally of farmers,” he said, at the beginning of his address at a rally. On February 18, Mr. Patnaik addressed farmers’ rallies in Bolangir and Kalahandi districts. This was seen as an attempt to upstage Mr. Modi.\n\nAbundant resources\n\nOdisha had huge natural resources, yet the people of the State remained poor, Mr. Modi said. “Odisha has abundant water. Rivers like the Mahanadi and the Brahmani flow in the State. If Odisha wants, it can become the number one State. If there is any State that can lead the second green revolution, it is Odisha. People migrate for work from this region to the western parts of India, where many schemes have been taken up.”\n\nMr. Modi said Madhya Pradesh used to be part of a group of States (BIMARU) where economic conditions were dismal. “The Shivraj Singh Chauhan government increased irrigation coverage from 12 lakh hectares to 32 lakh hectares. Why cannot Odisha replicate this?”\n\n“India will become strong only if its western and eastern States are prosperous. We have prioritised the development of eastern States. Both the Central and State governments should try to double the income of farmers by 2022, when India will celebrate its 75th year of independence,” he said.\n\nHe said the Pradhan Mantri Fasal Bima Yojana was the biggest scheme taken up for the welfare of farmers after Independence, and no political party had found loopholes in it. He urged farmers to take part in Start-Up India, saying it was meant not just for Bengaluru and Hyderabad.\n\nUnion Agriculture Minister Radha Mohan Singh, Tribal Affairs Minister Jual Oram and Petroleum and Natural Gas Minister Dharmendra Pradhan spoke.", 
    "section": "national", 
    "title": "Takes a dig at Naveen", 
    "subsection": "general", 
    "date": "2016-02-22"
}