{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prime Minister Narendra Modi releasing books during the Centenary Celebration of Sri Gaudiya Math and Mission in Kolkata on Sunday.- Photo: PTI\n\nIt is the tradition of spirituality that binds India together, not communities Prime Minister Narendra Modi said here on Sunday.\n\n“We are not people bonded by communities, communities come and go with time, different sects and traditions develop. But we are bound by an unbreakable bond of spirituality, this is what provides us strength,” Mr. Modi said.\n\nAccording to Mr. Modi, a unique feature of India is that in spite of the fact that rulers have come and gone, and there have been attacks and atrocities on the people, nothing could damage the tradition of spirituality.\n\nHe was addressing a function here to mark the centenary celebrations of Gaudiya Mission, a Vaishnav missionary organisation following the teachings of Chaitanya Mahaprabhu, a 15th century spiritual leader from eastern India, and one of the pioneers of the Bhakti movement.\n\nReferring to the teachings of Chaitanya Mahaprabhu and other saints of the period, Mr. Modi said “seeds of India’s freedom struggle were sown with the Bhakti movement.” Speaking on social and religious reformers of the country, Mr. Modi said: “In India, you must have seen that in every age when the society is ridden with evils, it is from the Hindu society that a reformer emerges and challenges the existing system.”\n\nEmphasising on the need for social reform, he said “a society that does not correct itself, does not learn from its history, cannot survive; it only exists like a corpse.”\n\nOn his way back, the Prime Minister was greeted by West Bengal Chief Minister Mamata Banerjee who had rushed to the airport to meet him before his departure.", 
    "section": "national", 
    "title": "We are bonded by our tradition of spirituality, says Modi", 
    "subsection": "general", 
    "date": "2016-02-22"
}