{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The Right and the Left of Indian politics had a pretty good session politically\n\nThe first half of the budget session for 2016 concluded on Wednesday, with both the opposition and the treasury benches claiming some victories.\n\nThe end of the session score card in terms of hours spent on debating and passing legislation, as well as discussions on various issues in both Houses of Parliament, as elaborated by Parliamentary Affairs Minister M. Venkaiah Naidu, showed that MPs worked over time in this session.\n\nApart from the various embarrassments heaped by the opposition on the government — when they managed to get an amendment to the President’s address cleared through the Rajya Sabha, or when, unlike in the Lok Sabha, Human Resource Development Minister Smriti Irani had to face the prospect of privilege motions being pressed against her — the Right and the Left of Indian politics had a pretty good session politically.\n\nMs. Irani’s fiery speech on the suicide of Dalit scholar Rohith Vemula and the JNU sedition case has helped the BJP harden its political positioning around its interpretation of “nationalism.”\n\nGoing into polls in four States and one Union territory, it has helped the party energise its cadre around a primordial emotional issue, and given an outlet for some aggressive posturing.\n\nFor the Left, the JNU sedition case also proved a blessing in disguise. Its battle to prove the futility of sedition laws in a democracy reassured old cadre and found new converts. Participating in a conclave of students in Mumbai, a senior Left leader said he was pleasantly surprised at the participation of students from colleges that had not seen a Left presence even when enrolments to its student bodies were high. “These are colleges like St. Xaviers etc where we didn’t have a presence even in our heydays,” said the senior CPI(M) leader. Clearly, there were students who were looking at the Left as a political alternative, in contrast to the Right.\n\nWhat of the Congress? In simple terms, the party looked good on the day its vice-president Rahul Gandhi spoke in the Lok Sabha, about his kinder, gentler notion of nationhood, and the flag. For that one hour, all confusion and differences in the party over whether Mr. Gandhi should have visited the JNU campus did not matter.\n\nIt proved that the Congress’ more nuanced line on nationhood can only be articulated if there is clear direction from the top.\n\nMr. Gandhi appeared very clear on his reasons for taking a particular political line, may be this session could be the spur for him to clear confusion over leadership issues in his party. Going forward, the main takeaway from the session was the delineation of ideological lines, for Left, Right and Centre.", 
    "section": "national", 
    "title": "A session that sharpened ideological lines", 
    "subsection": "general", 
    "date": "2016-03-17"
}