{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "In rural or semi-rural parts, Mamata Banerjee is still the undisputed leader; but the arithmetic seems to favour the Left-Congress understanding\n\nbout a year ago, Omprakash Mishra, Congress general secretary in West Bengal, said at a private gathering in his South Kolkata residence that the Left Front and the Congress were “wondering” if they could “come together” in the 2016 Assembly polls. A year later, the script for sharing of seats by the erstwhile enemies is unfolding exactly as Mr. Mishra, an academic by profession, had prophesied.\n\n“First, we will start talking about it in the media, then raise issues toeing the similar line, eventually anti-Trinamool momentum would gather by December and we will discuss how we may come together,” he said in 2015. To the dismay of the Trinamool Congress (TMC) and even many within the Left Front, the script uncoiled in line with Mr. Mishra’s predictions.\n\nThe Congress’s State-level leaders decided that even if they needed to confront the party leadership at 24 Akbar Road in Delhi, they would do so to protect the party in its bastion in central Bengal’s two districts. The reason for such thinking was a slow but steady drop in its vote share after the formation of the Trinamool — from nearly 40 per cent in 1996 to nine per cent in 2014.\n\nFor the Left, the crisis was even worse. The Congress — in its worst days during the peak of Left rule — maintained a formidable vote share of around 35-42 per cent in the State. Whereas, within three years of losing power between 2011 and 2014, the Left’s share dropped from approximately 40 per cent (2011) to about 29.5.\n\nThree months ago, the topic of any poll-related discussion was about two things: how many more of their own men Trinamool cadres would end up killing and if Mamata Banerjee would score more than 250 out of 294 seats. Over the last couple of weeks — once the Left-Congress tie-up was finalised — the nature of usual household discussion changed. Observers enquired in public platforms if the Trinamool would be able to break its 2011 record of 184 seats. While the reasonably rational supporters of both sides are still keeping the Trinamool ahead in the race, the gap is reducing between the ruling party and the alliance by the week. And now with a well-timed sting operation, exposing the entire Trinamool brass of taking bribe on camera, doing its rounds on prime time television, the Trinamool is under severe pressure.\n\nThe party’s base is still in South Bengal where it was ahead in 191 of 218 Assembly segments in the 2014 Lok Sabha election. Its primary objective is to hold onto these seats by dividing the majority community’s vote to a plethora of parties, while keeping the minority vote with itself, like it did in 2011 and 2014. But repeating such an outstanding performance may not be easy owing to many factors.\n\n“In pockets of South Bengal, the TMC may have to face the anti-incumbency factor as it is winning in many seats in all polls for nearly a decade, since the 2008 panchayat poll,” said poll analyst and social scientist Biswanath Chakravarty. The party may lose some of the seats that it bagged in 2011 in two of the expansive districts — North and South 24 Parganas — where the Left had performed relatively well in limited pockets in 2014. The BJP’s vote in 2014 — nearly 17 per cent in the State — is also expected to drop as the party is not riding the “Modi wave”. The BJP’s loss could well be the Left-Congress’s gain as it is essentially an anti-Trinamool vote. Based on these factors, conservative poll pundits are now giving at least 30 seats fewer to the Trinamool in South Bengal compared with earlier elections. Yet, the TMC may comfortably form the government, provided the party scores handsomely in five Hindu-majority districts of extreme North or in the Muslim-majority belt of Central Bengal.\n\nThe Siliguri Model\n\nIn five districts — Cooch Behar, Darjeeling, Jalpaiguri, Alipurduar and Dakshin Dinajpur — the Trinamool led in 20 (61 per cent) of 33 segments in 2014, up by seven seats from 2011, when it had an alliance with the Congress. The Congress slipped from six to zero, yielding mostly to the Trinamool. The Trinamool thus was confident of capturing most of the seats in the extreme north of Bengal in 2016.\n\nHowever, the confidence hit a road block with the re-emergence of the CPI(M) leader Ashok Bhattacharya. Mr. Bhattacharya delivered a completely unexpected victory last April to capture the Siliguri Municipal Corporation, the second largest civic body after the Kolkata Corporation, when the confidence of the Kolkata’s Communists was at its lowest.\n\n“Ashok Bhattacharya’s ‘Siliguri Model’ is getting discussed often in Delhi and we are discussing it with some of our friends in the Left ... it is exciting!” exclaimed former Union Minister Jairam Ramesh in one of his private visits to Kolkata.\n\nConservative poll pundits say Trinamool may win at least\n\n30 seats fewer than in the earlier elections in its South Bengal bastion", 
    "section": "national", 
    "title": "As foes turn friends, euphoria around Trinamool dulls", 
    "subsection": "general", 
    "date": "2016-03-17"
}