{
    "author": [], 
    "text": "In the Lok Sabha, Parliamentary Affairs Minister M. Venkaiah Naidu said the reported leakage of the examination paper and suggestions that the mathematics paper was rather difficult “deserve an inquiry.”\n\nMr. Naidu made a statement after N.K. Premchandran (RSP) and K.C. Venugopal (Congress) said, referring to media reports, that most questions of the mathematics paper were very difficult and out of syllabus. Mr. Naidu said he would refer the matter to the HRD Ministry.\n\nMr. Venugopal alleged that there was a conspiracy as many bright students in south India found the questions very tough, on the other hand they were leaked in north India. He wanted the HRD Ministry to intervene.\n\nMr. Premchandran said that as 80 per cent of the questions in the mathematics paper were very difficult and out of syllabus, students suffered a lot.\n\nRamesh Bidhuri of the BJP blamed the UPA government, saying it had set up a system which suppressed bright students.\n\nMeanwhile, appeals by students and parents continued even two days after the examination. Social media was abuzz with complaints and 240 petitions were posted on Change.org which has received support from 25,000 people. While some are demanding a re-test, others are making frantic appeals to the CBSE for leniency in evaluation. The biggest petition, with over 13,571 signatures, was started by a student from Guwahati.\n\n“The CBSE has broken the dreams of several students by setting a paper which was meant for IIT aspirants. This year, CBSE maths paper was tough as well as long and has made several students cry. The CBSE should come out with a statement immediately to take care of their mental agony which will help them to concentrate on their next exam,” read the petition.\n\nOther petitions were initiated by students from Kolkata, Chennai and other cities, including Thrissur.\n\nDelhi Deputy Chief Minister Manish Sisodia has written to Human Resource Development Minister Smriti Irani, urging her to look into the matter with “utmost urgency.” In his letter, Mr. Sisodia who is also Delhi’s Education minister requested Ms. Irani to take an immediate decision on giving “grace marks” to students. He also wanted a fair probe into the allegations of the question paper leak.\n\n“CBSE has broken students' dreams by setting a paper meant for IIT aspirants”", 
    "section": "national", 
    "title": "CBSE offers ‘remedy’ for tough paper", 
    "subsection": "general", 
    "date": "2016-03-17"
}