{
    "author": [
        "C Gouridasan Nair"
    ], 
    "text": "Leaders of rival political combinations in Kerala have never admitted before elections that they are caught in a dead heat. But the unusual has happened this time in the political cauldron that is Kerala with Congress Working Committee member A.K. Antony and CPI(M) general secretary Sitaram Yechury speaking almost in the same voice about the close contest that they are involved in the State. “Unusual” has become the name of the game in Kerala this election season not just on account of the close race between the big two but also because of the huge effort being mounted by the Bharatiya Janata Party (BJP) to force its way into the Kerala Legislative Assembly.\n\nThough they had never spoken about it before the elections, the 2011 Assembly polls had turned out to be the closest in the State’s history with the Congress-led United Democratic Front (UDF) picking up just 72 seats in the 140-member House. Many still see that as an election that slipped out of the LDF’s grip mainly on account of the infighting in the CPI(M). Much has happened after that and the CPI(M) is a far more cohesive unit today and the ruling alliance far less so.\n\nAnd knocking on the doors of the Assembly is the BJP, which has forged an alliance with the Bharatiya Dharma Jana Sena (BDJS), the political outfit floated on election eve by the leadership of SNDP Yogam, the Ezhava community organisation. The BJP has been talking big about not just opening its account in the State Assembly but also emerging as a game changer. This is an election in which the BJP can, if everything works out to its plans, give the big two the blushes in quite a few places. Although the BJP-led National Democratic Alliance (NDA) would have candidates in all the constituencies, the party is focussing all its energies in 20-odd places.\n\nFor the big two, the presence of the BJP is only part of the challenge. For them, the battle is essentially about their own survival and continuance as major players at the national level. Neither can afford to lose Kerala, more so in the case of the CPI(M). The southern foothold is so crucial for the party that it has been going about with great care in choosing its candidates. The party has declared zero tolerance towards any sign of factionalism. It has also decided to field party veteran V.S. Achuthanandan again so that he gets to pull his weight with the masses alongside Polit Bureau member Pinarayi Vijayan. The swiftness with which the decision was arrived at was itself a sign of the CPI(M) leadership’s keenness to avoid any sign of schism in its leadership or ranks.\n\nFor the Congress, the major worry should be the scandals that have rocked its government in Kerala.\n\n‘Unusual’ has become the name of the game in Kerala this election season", 
    "section": "national", 
    "title": "Dead heat in Kerala’s political cauldron", 
    "subsection": "general", 
    "date": "2016-03-17"
}