{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Police have busted an inter-State racket involving illegal removal of kidneys of over a dozen persons in Gujarat, with the arrest of three persons allegedly involved in the trade, linked to Delhi and Tamil Nadu.\n\nThe racket surfaced in Anand district where several people from the Pandoli village complained that their kidneys were surgically removed by an organised gang, which lured them into selling their organs for money.\n\n“We have lodged an FIR based on the victims’ statements and launched an investigation. We have learnt that people were lured into selling their organs in hospitals in Delhi as well as in Chennai,” said Ashok Kumar Yadav, Superintendent of Police, Anand. The police have formed a special investigation team (SIT) to probe the racket.\n\nOn Wednesday, the police arrested Mukesh Chaudhary, Sherali Khan Pathan and Rafiq Ahmed Vora.\n\n“Mukesh Chaudhary is apparently the kingpin and is known as an Ayurveda ‘doctor.’ He was the main contact for people who needed kidneys. The other two accused, Sheru Pathan and Rafiq Vora, had sold their kidneys in the past and were in touch with Mukesh. The fourth accused, Javed, is yet to be arrested,” the SP said.\n\nAccording to Mr. Yadav, Javed coordinated the entire network from Delhi.\n\n“We examined 13 patients who were referred to us by the police. After initial medical examination, we found that the left kidney of 11 patients had been removed,” said Dr. M.M. Prabhakar, Chief Medical Officer of the Ahmedabad civil hospital.\n\n“The organs were removed around seven months back,” he added.\n\nAccording to the police, the victims were taken to hospitals in Gujarat, Delhi and Chennai where their kidneys were removed. Amir Malek, a resident of the Pandoli village in central Gujarat, was the first victim of the organ-selling ring.\n\n‘Big sum promised’\n\n“He was in need of money. So Rafiq Vora approached him and promised a big sum. He was taken to a hospital in Delhi where unidentified doctors operated upon him and one of his kidneys was extracted. Subsequently, his family members, who complained about his disappearance, were paid Rs. 2.8 lakh and Amir returned home,” the police complaint stated.\n\nThree persons arrested from Gujarat allegedly have links in Delhi and Tamil Nadu", 
    "section": "national", 
    "title": "Inter-State kidney racket busted", 
    "subsection": "general", 
    "date": "2016-03-17"
}