{
    "author": [
        "Afshan Yasmeen"
    ], 
    "text": "‘State way behind its neighbours in most of the child-related indicators’\n\nDid you know that the Karnataka government spends just Rs. 5 a day on a child in the age group of 0-6? This spending goes towards health, nutrition, education and mother’s health, apart from legal issues.\n\nAccording to a study done by the Centre for Budget and Policy Studies (CBPS) on public expenditure on children in Karnataka for a period of 15 years (from 2001 to 2015), the State’s spending for children in 0-6 age group hovers around Rs. 2,000 per child a year as against nearly Rs. 6,000 for children in the age group of 6-14 and 14-18 years.\n\nWith funding from the UNICEF Hyderabad office, the CBPS has analysed that although it is commendable that overall the State has been spending considerably on children, it is worrying that the expenses on children in the 0-6 age group is the lowest. A major chunk of the total spending is on education, the study stated.\n\nForming about 32 per cent of the child population (taking children in the age group of 0-18 as the total population), children in the age group of 0-6 receive only about 9 per cent of the total public spending on children. “This needs to be probed further to understand the implications, as research clearly establishes that these are the most critical years for better health and educational performance in children,” Jyotsna Jha, CBPS director, told The Hindu on Wednesday.\n\n“Considering that the State is still way behind its neighbours, especially Tamil Nadu and Kerala, in most of the child-related indicators, it is important that the government retains and increases its spending on children, especially in the areas of health and social protection,” she said.\n\nCut in Centre’s grants\n\nAnother important finding is that the public spending on children in 2015-2016 budget estimates showed a marginal decline. This is probably a result of the Union government reducing its allocation for a number of social sector schemes important for children.\n\n“Although the State government maintained its share, it did not increase the allocations as expected by using the enhanced money received from the divisible pool as a result of the 14th Finance Commission’s recommendation,” Ms. Jha said.\n\nThe findings were presented to the government on Tuesday.", 
    "section": "national", 
    "title": "Karnataka spends just Rs. 5 a day on children in 0–6 age group", 
    "subsection": "general", 
    "date": "2016-03-17"
}