{
    "author": [], 
    "text": "Minister of State for Home Ranjit Patil presented the resolution to suspend Mr. Pathan for the rest of the Budget session.\n\nBJP MLA Ram Kadam asked him how he could oppose a memorial for Chhatrapati Shivaji. He asked both MLAs to chant Bharat Mata ki Jai . Mr. Pathan stood up and said he would not do so, even at the cost of his life.\n\nThis led to an uproar, not only from members of the ruling BJP-Shiv Sena combine but also from the Congress and the Nationalist Congress Party (NCP). The Speaker had to adjourn the House for 10 minutes. After the proceedings resumed, BJP Mumbai chief Ashish Shelar rushed to the two AIMIM MLAs, and he and other BJP MLAs surrounded both and shouted Vande Mataram and Bharat Mata ki Jai . Shiv Sena MLAs, too, shouted slogans like Iss desh mein agar rehna hoga, Vande Mataram kehna hoga [If you want to live in India, you have to say Vande Mataram]. Senior members of the Congress and the BJP tried to calm the situation, but it turned ugly as 25-30 BJP MLAs started shouting at the AIMIM MLAs.\n\nMinister of State for Home Ranjit Patil presented the resolution to suspend Mr. Pathan for the rest of the budget session, accusing him of “taking advantage” of freedom of expression and disrespecting the country. It was passed unanimously.\n\nReacting to his suspension, Mr. Pathan later said: “I love my country. I was born here and I will die here. I can never dream of insulting my country. Don’t judge anyone’s love for the country by just one slogan. Jai Hind , Jai Bharat , Jai Maharashtra .”\n\nEarlier, leaders of all parties demanded the suspension of Mr. Pathan for “disrespecting” the country. “His actions have defamed the country and he must be punished,” said Bhaskar Jadhav of the NCP. Mr. Shelar said the MLA was misusing the freedom of expression.\n\n“You take the oath on the Indian Constitution. Such statements are nothing but the biggest sins committed by you. His suspension is a question of the nation’s pride,” he said.\n\nGulabrao Patil of the Shiv Sena called it a black day in the history of the Assembly. “Why do you live here if you are ashamed of shouting the slogan. How do you dare to oppose memorials for Shivaji, Thackeray and Munde?”\n\nAbdul Sattar and Radhakrishna Vikhe-Patil of the Congress supported the demand for suspension. “These elements utter such remarks, and the entire minority community has to pay the price. Such tendencies must be punished,” Mr. Sattar said.", 
    "section": "national", 
    "title": "Maharashtra MLA suspended for not chanting Bharat Mata ki Jai", 
    "subsection": "general", 
    "date": "2016-03-17"
}