{
    "author": [], 
    "text": "Prime Minister Narendra Modi will join the ranks of prominent global leaders at Madame Tussauds in London, Singapore, Hong Kong and Bangkok next month, the world famous wax museum announced today.\n\nDescribing him as a “hugely important figure in world politics”, the museum said the Prime Minister had given the museum’s team of artists and experts a sitting at his residence in New Delhi earlier this year.\n\n“Madame Tussauds has crafted figures of very distinguished dignitaries from around the world — how could I regard myself worthy of being alongside them? But when I was informed that your decision had emanated from public opinion and public sentiment, I was comforted,” Mr. Modi said in a statement to the museum.\n\n“During my sitting, I observed the team carefully and was deeply impressed by its dedication, professionalism and skill. I have visited Madame Tussauds three or four times and had the pleasure of getting myself photographed standing next to the figures of various dignitaries,” he added.\n\nThe wax figures at each of the museum’s locations around Europe and Asia will be dressed in Modi’s signature kurta-pyjama along with a jacket and he will be featured in a traditional pose “making a namaste gesture”.\n\n“Prime Minister Modi is a hugely important figure in world politics, a position supported by his place in the top 10 of Time magazine’s Person of the Year List 2015,” said museum spokesperson Kieran Lancini.\n\n“His massive social media presence — he is currently the second most followed politician on Twitter after U.S. President Obama — also confirms the intense interest the public have in him, a fact supported by the requests our guests have made for us to create his figure. “We are delighted to be including the Prime Minister’s figure in our attractions in London, Singapore, Hong Kong and Bangkok,” Mr. Lancini said.\n\nEach figure took a team of Madame Tussauds’ artists four months and cost around £150,000 (Rs. 1.42 crore) to create.\n\n“Guests will be able to stand shoulder to shoulder and measure up to one of the most powerful men in the world — and even grab a selfie when the figures arrive in their locations,” the museum said.\n\nThe launch in London and all other centres is expected in April.\n\nA new branch of Madame Tussauds is also set to open in New Delhi as part of the India–U.K. Year of Culture in 2017, as announced during Prime Minister Modi’s visit to the U.K. last November. — PTI", 
    "section": "national", 
    "title": "Modi to join ‘dignitaries’ at Madame Tussauds", 
    "subsection": "general", 
    "date": "2016-03-17"
}