{
    "author": [
        "S Anil Radhakrishnan"
    ], 
    "text": "Travellers along the National Highway (NH) corridors managed by the National Highways Authority of India (NHAI) can soon look forward to basic wayside amenities every 25 km and larger wayside amenities every 50 km. These are being launched to ensure safe and convenient journey for long-distance travellers.\n\nLand will be acquired by the NHAI for the development of the facilities where no land is available now for setting up the amenities, a policy/concept paper on wayside amenities released by the NHAI has said.\n\nThe NHAI has come up with five modes for developing wayside amenities and augmentation of the existing facilities.\n\nIn development, operations and maintenance of wayside amenities in PPP mode, the long-term concession the private party will get will be 29 years with the concessionaire having the first right of refusal for another term of up to 29 years at an yearly concessional fee of Re.1.\n\nThe facilities will have a standard conceptual plan, façade design with flexibility to modify the interiors.\n\nThe NHAI will take up the development in EPC mode where the response from the private sector is poor for developing, operating and maintaining the wayside amenities.\n\nUpon completion of such units, the operation and maintenance will be given to the private sector for 29 years after inviting competitive bids.\n\nThe NHAI has also decided to go for renovation retro-fitting of wayside amenities which have been created earlier under contracts of four-laning and six-laning of the NH stretches.\n\nAnother mode worked out is incentivising the petrol and diesel retail outlet owners on NH stretches for enhancing the quality of basic toilet-cum-drinking water facilities.\n\nGroups and individuals owning adequate land abutting the NH will get the assistance from the NHAI for creating the facilities.", 
    "section": "national", 
    "title": "More wayside amenities along National Highways", 
    "subsection": "general", 
    "date": "2016-03-17"
}