{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Six companies understated revenues, according to CAG report tabled in Parliament\n\nObservers within the government, the Comptroller and Auditor-General of India and outside have expressed surprise at the NDA government’s move to order a special audit of telecom companies, at a time when a Supreme Court-sanctioned CAG audit has reported a significant loss of revenue share to the exchequer because of underreporting by these companies.\n\nThe reaction comes after the government ordered a special audit of telecom companies for the period 2008-09, 2009-10 and 2010-11 just hours after a CAG report tabled in Parliament on Friday indicated a loss of Rs. 12,489 crore to the exchequer because six telecom operators, including Airtel, Idea and Vodafone, understated their revenues by a whopping Rs. 46,045.75 crore in the 2006-10 period.\n\nWhen asked who would be doing the special audit, a Department of Telecom spokesperson told The Hindu : “The CAG will not do the audit. DoT will pick from empanelled CAG auditors.”\n\nUnmatched capabilities\n\nHowever, former CAG Vinod Rai said, “It is presumed that the special audit will be only by the CAG. If they want an authentic audit it has to be by CAG.” The federal auditor has unmatched capabilities as far as auditing of telecom companies is concerned, Mr. Rai told The Hindu .\n\nThe CAG’s audits of 2G and several other major scandals were carried out under Mr. Rai’s supervision. He said the strategy of the “government must be to recover revenue if it was forgone, and plug the loopholes.”\n\nA retired CAG official said the government should be ordering a concurrent audit of telecom companies so that it receives its fair share of revenues in time. “It should also be expanding CAG audit from 1999 [when revenue sharing started] to 2006, and also from 2010 to the present day,” he said.\n\nThe CAG report tabled last week covers only the four-year period from 2006-07 to 2009-10.\n\n“The government is delaying audit and recovery. What is the need for a special audit when the CAG is already auditing based on a Supreme Court order? And why is the special audit only for three years,” a senior official with intimate knowledge of the audit of telecom companies asked.\n\nHe argued that the total revenue understated by telecom companies could be over a lakh crore rupees, and together they would have to pay the government over Rs. 30,000 crore without fines, if the audit covers the entire period between 1999 and 2016.\n\n“The government should be putting its energy into combining all the cases filed all over the country by various companies to stall payment of revenue share, and bring them to the Supreme Court to get a judgment that could pave the way for getting its revenue,” he said.\n\nWith the Supreme Court enabling the audit of telecom companies in April 2014, the CAG picked the four-year period so that an audit could be completed without delay. It has not covered the period from 1999 to 2006, and from 2010 to now, when the telecom business has boomed.\n\n“The CAG report is a clear indication that the rest of the period should also be audited. Which authority, other than CAG, has over 1,200 auditors who are familiar with the telecom sector,” a CAG source said.\n\nCommenting on the CAG findings, Telecom Minister Ravi Shankar Prasad said on Friday that the special audit of the operators’ books would be done for three years from 2009, to check for underreporting of revenues.\n\n“I have taken a grim view of this because this is again a legacy issue of the previous government. Even though in terms of well-established parliamentary procedure, the report will go to the Public Accounts Committee, I have directed Secretary, Telecom, and Member, Finance, to put in place a robust system in order that such gaps do not recur,” Mr. Prasad said.\n\nThe two telecom industry bodies representing the operators said in response to the CAG audit: “The issues pointed out by the CAG pertain to those disputes [regarding interpretation of revenue share], which have either been settled or stayed by various courts. We would like to reiterate that our member-companies follow the highest standards of corporate governance and have always been in compliance with all regulations.”\n\nThe telecom operators have in the past opposed auditing of their books by the CAG, and fought legal cases up to the Supreme Court.\n\n(With inputs from\n\nYuthika Bhargava)", 
    "section": "national", 
    "title": "Move on special audit evokes surprise", 
    "subsection": "general", 
    "date": "2016-03-17"
}