{
    "author": [], 
    "text": "NASA said it will test the effects of a large fire in space by setting off a blaze inside an orbiting unmanned space craft.\n\nNASA has set off tiny controlled fires in space in the past, but never tested how large flames react inside a space capsule in space.\n\nThis research “is crucial for the safety of current and future space missions,” Gary Ruff, one of the engineers heading the experiment at the U.S. space agency’s Glenn Research Center in Cleveland, Ohio, said.\n\nThe goal is to measure the size of the flames, how quickly they spread, the heat output, and how much gas is emitted.\n\nThe experiment will be conducted in an Orbital ATK Cygnus capsule after the craft ferries supplies to the International Space Station.\n\nThe Cygnus capsule is scheduled to blast off from Cape Canaveral, Florida, atop an Atlas 5 rocket on its final mission on March 23. Once the capsule undocks from the ISS and is far away from the space station, ground control will trigger the fire on board, Mr. Ruff said.\n\nThe results of this experiment, dubbed Saffire-1, will determine how much fire resistance is needed in the ultra-light material used in the spacecraft and the astronaut’s gear. It will also help NASA build better fire detection and suppression systems for their spaceships, and study how microgravity and limited amounts of oxygen affect the size of the flames.\n\n“Understanding fire in space has been the focus of many experiments over the years,” said Mr. Ruff.\n\nWhile many “small, centimetre-sized fires have been lit in space before, to really understand fire, you’ve got to look at a more realistic size.”\n\nTemperature, oxygen and carbon dioxide sensors will record data on the fire, which is expected to last about 20 minutes, in real time. Cameras also will film the material as it burns. A few days after the blaze, NASA expects the remnants of the Cygnus capsule to plunge towards Earth and disintegrate in the atmosphere. — AFP\n\nThe research is crucial for the safety of future missions, say engineers", 
    "section": "national", 
    "title": "NASA to burn capsule to study fires in space", 
    "subsection": "general", 
    "date": "2016-03-17"
}