{
    "author": [
        "Bishwanath Ghosh"
    ], 
    "text": "West Bengal is yet to work itself into a frenzy over the Assembly elections that begin in April, but many in the State capital here already consider it a foregone conclusion that the Trinamool Congress, led by Mamata Banerjee, will retain power in the State.\n\nMs. Banerjee, who rode to power in 2011 on the plank of Paribartan , or change, ending 34 years of Left rule in West Bengal, has not turned out to be the most popular of its chief ministers. From being criticised for insensitive statements to earning flak for a collapsed Ponzi scheme and being accused of patronising political violence, she has always made headlines for the wrong reasons.\n\nIt is surprising, therefore, to find the lay voter predicting her return, sometimes matter-of-factly and sometimes grudgingly. Those supporting her say she will win because of the good work she has done during her tenure, while those opposing her think she might sail through because of the lack of a robust challenge.\n\nThe Left Front, still nursing the wounds it received in 2011, has, for the first time in the State, joined hands with its one-time bitter foe, the Congress, in a bid to dislodge Ms. Banerjee.\n\n“I am a Lal Jhanda [red flag] man, but I can see people voting for her simply because there is no one else to vote for,” Jatin Pal, a taxi driver, said sagaciously as he drove me from Salt Lake City to College Street. “There is no visible leader from the Opposition who can take her on. But why are you asking me about elections? Are you from the intelligence department?”\n\n“Not at all,” I replied, “I just want to get an idea of the public mood.”\n\n“Ah, you want discussion,” he was relieved. “Discussion is always welcome.”\n\nOn College Street, bookseller Amiya Ghosh was more busy obliging passers-by who asked for directions than attending to customers, but he found time for a discussion with me.\n\n“All said and done,” said Mr. Ghosh, “Mamata di has done some good work. The roads are much better now, there are more buses. You hardly see any garbage lying around. And ever since she came to power, there have hardly been any bandhs — that’s a big relief.”\n\n“That’s because she was the one who frequently called for bandhs when she was in Opposition,” I reminded him.\n\n“True, so what prevented the Left Front from calling for bandhs in these five years? They didn’t do it because they could not find any fault with her.”\n\n“Are you a Trinamool supporter?”\n\n“How does that matter,” Mr. Ghosh retorted. “I am only telling you the truth.”\n\nUnlike him, Kunal Saha, who sold wristlets on the pavement in Dharmatala, turned out to be a self-confessed Mamata Banerjee supporter. “She may not win with the same margin, but she will win. She will complete 15 years in power, mark my words,” he said.\n\n“What has she done for you?”\n\n“This stall is my only source of living, and I have six people to feed. During the Left Front rule, I would be thrown out of here every now and then. But for the past five years, no one has touched me. Every week I go to the police station and pay a fine of 60 rupees, that’s it.”\n\nA stone’s throw from the bustle of the pavement, in the plush offices of a corporate giant on Chowringhee Road, sat Kaushik Roy, a finance superintendent with the company, who told me that while he was ideologically opposed to the Trinamool Congress and would never vote for it, he would not deny that there has been development in Kolkata during its rule.\n\n“The development may have been incremental, but there has been development. One remarkable change brought about by this government is garbage disposal. Earlier you saw heaps of garbage all over the city, dogs foraging on them. Now they use compactors, which has made all the difference,” Mr. Roy said.\n\n“And in February last year,” he said, “I was down with flu. So I went to the Beleghata ID hospital to get myself tested, I found it difficult to believe it was a government hospital, so clean it was.”\n\nMany in Kolkata say Trinamool may benefit from the ‘there is no alternative’ factor", 
    "section": "national", 
    "title": "Paribartan narrative in for change; this time for TINA", 
    "subsection": "general", 
    "date": "2016-03-17"
}