{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The Opposition wanted the legislation to have safeguards to avoid sensitive private information of citizens being accessed “on the whim of the executive.”\n\nThe amendments to the controversial Aadhaar Bill pushed through by the Opposition in the Rajya Sabha and later rejected in the Lok Sabha included one that sought to prevent disclosure of “biometric or demographic information” in the interests of “national security” which was seen as too sweeping. It was suggested that “national security” be replaced with “public emergency” or in the interests of “public safety.”\n\nAnother amendment related to permitting individuals with Aadhaar numbers to opt out of the system, with the Central Identities Data Repository deleting all information and authentication records, and giving a certificate to that effect within 15 days.\n\nA third amendment provided for alternative identification for delivery of services, subsidies and benefits to those choosing not to enrol for an Aadhaar number.\n\nA fourth amendment mandated the inclusion of the Central Vigilance Commissioner or the Comptroller and Auditor-General in the Oversight Committee. The fifth amendment sought the deletion of a clause that allows the Aadhaar number to be used for purposes other than those provided in the Bill.\n\nThe government’s contention is that the Aadhaar (Targeted Delivery of Financial and Other Subsidies, Benefits and Services) Bill, 2016, would provide for good governance and efficient, transparent, and targeted delivery of subsidies, benefits and services. The Opposition wanted the legislation to have safeguards to avoid sensitive private information of the individual from being disclosed or accessed “on the whim of the Executive.”\n\nCongress leader Jairam Ramesh, the star speaker in the Rajya Sabha, said: “We are knocking a nail into the coffin of the Upper House. I am sure Lord Krishna had Opposition members of the Rajya Sabha in mind when he advised Arjuna: karmanye vaadhikaraste ma faleshu kadachana (one must do their duty regardless of the outcome).”\n\n“I am questioning the competence of this House to legislate the Bill,” Sitaram Yechury of the CPI(M) said, arguing that the Bill was also being considered by the Supreme Court and was beyond “the legislative authority” of the House. To this accusation, Mr. Jaitley responded: “This is an unprecedented argument in a democracy which has the separation of powers. The court only has power of judicial review.”\n\n“If the principal purpose is money spent out of the Consolidated Fund of India in a particular manner and a machinery is created for spending that money, it is a Money Bill,” Mr. Jaitley said, in reply to the Opposition’s objections to the legislation being framed as a Money Bill.", 
    "section": "national", 
    "title": "Parliament passes Aadhaar Bill amid acrimonious debates", 
    "subsection": "general", 
    "date": "2016-03-17"
}