{
    "author": [
        "N Ravi Kumar"
    ], 
    "text": "President Pranab Mukherjee and Union Minister for Civil Aviation Ashok Gajapathi Raju going around in a golf cart in Hyderabad on Wednesday.- Photo: Mohammed Yousuf\n\nIndia Aviation 2016, fifth in the biennial series of international exhibition and conference on civil aviation, opened here on Wednesday with President Pranab Mukherjee calling for improved air connectivity to small cities and the north-eastern States.\n\nSeveral Tier II and III cities “remain unconnected or inadequately connected” and the northeast faced a paucity of civil aviation infrastructure despite the aviation industry growing rapidly, Mr. Mukherjee said, inaugurating the event.\n\nAddressing a large gathering at the Begumpet airport, the venue for the five-day event, he made a strong case for better connectivity by pointing out how business activities were bound to move to newer destinations with existing economic centres reaching a saturation point.\n\nOn the growth potential, he said the passenger traffic in India was likely to touch 421 million by 2020 — it was 190 million in 2015. India is one of the least penetrated air-markets in the world with 0.04 trips per capita per annum as compared to 0.3 of China and over 2 in the U.S.\n\nNoting that the middle-class would propel the growth, in the backdrop of rising income levels, he said development of tourism and trade were other contributing factors for the increase in passenger traffic.\n\n“It is time the government and the stakeholders leveraged this tremendous business opportunity,” Mr. Mukherjee said, adding India would require at least 800 aircraft by 2020 to cater to the phenomenal increase of passenger and freight traffic.\n\nSupporting infrastructure, he said, it has to be suitably upgraded by building new Greenfield airports, expanding the existing airports and upgrading facilities for maintenance, repair and operations.\n\nUrging participants to draw an action plan to make India a hub for manufacturing, Mr. Mukherjee said the ‘Make In India’ initiative aimed to facilitate investment, foster innovation, protect intellectual property and build world-class manufacturing infrastructure.", 
    "section": "national", 
    "title": "Pranab urges aviation industry to focus on Tier II, III cities", 
    "subsection": "general", 
    "date": "2016-03-17"
}