{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Strike enters day as 15 Union Finance Minister refuses to roll back excise duty\n\nWith no amelioration in the deadlock between jewellers across the country and the Centre over the levying of excise duty, Pune’s jewellers have reported that the strike is costing them Rs 100 crore every day.\n\nThe strike entered day 15 on Wednesday with Union Finance Minister Arun Jaitley refusing to roll back the proposed 1 per cent excise duty on non-silver jewellery (gold and diamond jewellery) as announced in the Union Budget last month.\n\n“The excise duty would bring in its train a regime of Inspector Raj and entail endless harassment of small-time jewellers by excise inspectors,” said Fatehchand Ranka, president, Pune Saraf (Jewellers) Association, adding that the excise duty would not only aggravate corruption but make the process of book-keeping more cumbersome.\n\nDubbing the Centre’s levy as “utterly regressive”, Mr. Ranka said excise inspectors had already knocked at jewellers’ doors in Baramati.\n\nThe Centre continues to remain intransigent over the levy despite top leaders from Maharashtra such as Nationalist Congress Party (NCP) chief Sharad Pawar (whose bastion is Baramati) and Union Transport Minister Nitin Gadkari holding parleys to force a rollback.\n\nMore than 70,000 jewellers and two lakh goldsmiths have gone on strike over the excise tax, vexing the city’s customers.\n\n1,700 jewellery shops\n\nThere are more than 1,700 jewellery shops spread across the Pune and Pimpri-Chinchwad municipal limits, employing around 40,000 workers. The strike has hit them hardest as many of them are daily wage-earners.\n\n“The association has organised food packets to help workers in view of the strike,” said Mr. Ranka.\n\nThe Excise Department’s efforts to allay the fears of the jewellers, with directives stating that only those with an annual turnover of Rs 12 crore would come under the ambit of the levy, have failed to cut any ice with them.\n\n“We are going to join our counterparts in our business fraternity to protest against the Central government’s decision in Delhi on Thursday,” said Sourabh Gadgil of PNG Jewellers.", 
    "section": "national", 
    "title": "Pune jewellers claim loss of Rs. 100 cr. a day", 
    "subsection": "general", 
    "date": "2016-03-17"
}