{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "On average, Mumbai witnessed deaths of seven infants every day in 2015, accepted Maharashtra government in its written reply submitted to the Assembly.\n\nReplying to a question raised by Dr. Milind Mane, Ashish Shelar, Parag Alvani and others seeking information about deaths of infants in Maharashtra and in Mumbai, State’s Health Minister Dr. Deepak Sawant said Mumbai had witnessed the death of 2,784 infants in 2015.\n\n“In 2015-16, rest of the State excluding Mumbai witnessed deaths of 5,785 infants while the number was 2,784 in the city,” said the reply. The Minister’s answer indicates that the State has seen the death of 8,569 infants last year.\n\nDr. Sawant also replied that Pune, during the same period, registered deaths of 334 infants. Yavatmal district in Vidarbha saw 276 such cases.\n\nIn tribal-dominated Melghat in Amravati district, 176 children in the 0-6 age group died between July and December 2015.\n\nLow weight at birth, premature delivery, respiratory problems, accidents, infections and pneumonia are some of the reasons behind the death of infants in the State, cited Dr. Sawant.\n\nHowever, Dr. Sawant said that a slew of measures taken by the government, including check-ups for pregnant women and provision of iron tablets, implementation of the Janani Suraksha Yojana, Janani Shishu Suraksha Yojana, institutional deliveries, focus on breast feeding and complementary nutrition, follow up through home-visits by ASHA workers and immunization had led to a fall in maternal, child and infant mortality rates.\n\nMalnutrition has for long been one of the biggest challenges faced by Maharashtra’s health machinery. The government’s own data says there were 1.17 lakh deaths due to malnutrition between 2008 and 2012.\n\nThe Rapid Survey of Children, 2014, said of the 93 lakh-odd children in the under-five age group in Maharashtra, stunting was recorded in 35.4 per cent, and wasting in about 18 per cent.\n\nReplying to another question raised by Patangrao Kadam, Amin Patel and Aslam Sheikh about the malnutrition in the State, Maharashtra’s Women and Child Welfare Minister Pankaja Munde said malnutrition was on the decline in the State.\n\nMinister cites\n\nlow birth weight, premature delivery, respiratory issues as reasons", 
    "section": "national", 
    "title": "Seven infant deaths a day in Mumbai last year, admits govt.", 
    "subsection": "general", 
    "date": "2016-03-17"
}