{
    "author": [
        "Raghava M"
    ], 
    "text": "VHP activists in Puttur to hold a protest at the place of worship today\n\nThe Karnataka government on Wednesday made its stand clear on the controversy over Dakshina Kannada district Deputy Commissioner A.B. Ibrahim’s name on the invitation card of a temple function. It not only defended the official but categorically stated that there was “nothing wrong” in his name figuring on the invite.\n\n“The DC has done nothing wrong. He acted in his capacity as the Deputy Commissioner, and as per the Muzrai Department’s rules,” Law and Parliamentary Affairs Minister T.B. Jayachandra said.\n\nOn Tuesday, right-wing groups demanded the removal of Mr. Ibrahim’s name from the invitation for a State government-administered temple function because he is a Muslim. Congress Puttur MLA Shakuntala Shetty said she would “consider removing the name of the officer.”\n\nRetracts statement\n\nHowever, on Wednesday, Ms. Shetty retracted her statement under criticism from several party colleagues, and said she had no problem with the invitation. She also denied calling a meeting of devotees to discuss the issue.\n\nMs. Shetty, however, said the temple administration should resolve the issue. “If it fails to do so, I will get invitations printed in my personal capacity.” Ms. Shetty, who was earlier with the Bharatiya Janata Party, maintained she was trying to ensure the peaceful conduct of the festival.\n\nActivists of the Vishwa Hindu Parishad in Puttur have decided to hold a protest near the Mahalingeshwara Temple on Thursday demanding the printing of new invitation cards for the 10-day-long temple festival after omitting Mr. Ibrahim’s name.\n\nThey held a meeting outside the temple on Wednesday insisting that the administration remove the DC’s name. They have also threatened to intensify protests.\n\nIn this backdrop, Assistant Commissioner K.V. Rajendra chaired a coordination meeting of officials to discuss security and other arrangements for the annual festival that draws people from different parts of the State.\n\n“The invitation is printed as per protocol. There is no question of printing new invitations, unless directed by senior officials,” Mr. Rajendra reiterated\n\nSpeaking to The Hindu , Mr. Ibrahim said festivities in the region are conducted in harmony by different religions, and cited Bappa Beary associated with Mulki Durgaparameshwari Temple, Udyavara Manjeshwara Temple and Ali Chamundi Temple in Kumble.\n\nRight-wing groups had demanded the removal of Deputy Commissioner Ibrahim’s name", 
    "section": "national", 
    "title": "Temple invitation: Karnataka stands by its officer", 
    "subsection": "general", 
    "date": "2016-03-17"
}