{
    "author": [
        "National Bureau"
    ], 
    "text": "With the government coming under criticism from the Opposition in the Lok Sabha on Wednesday for its handling of the Pathankot operation, Defence Minister Manohar Parrikar said “small incidents of terrorism have to be treated as war.” Home Minister Rajnath Singh said India wanted good relations with Pakistan but not at the cost of its “pride, dignity and self-respect.”\n\nMr. Parrikar said the route the attackers took to the Pathankot airbase had not been traced yet, but insisted that six terrorists were involved in the attack. The National Investigation Agency had said only four bodies were found.\n\nThe Minister said the operation lasted 43 hours and “the remaining two terrorists” could not be caught alive as “they were hiding in the concrete cupboards” at the Airmen Billet, which was blown up. Mr. Singh said it was established that the two were terrorists as the “charred remains” collected from the building and sent for forensic examination revealed that the “burnt mass material belonged to human male.”\n\nMr. Parrikar and Mr. Singh were responding to a debate during which the Opposition dubbed as a “critical mistake” the decision to hand over the operation to the National Security Guard.\n\nThe Opposition asked what Prime Minister Narendra Modi’s Lahore stopover had achieved, noting that the terror strike had happened just a few days after that.\n\n“We have to understand that Pathankot attack is an accumulation of asymmetric war. We should realise that this is an attempt wherein the opposition forces never expected to win but want to create a sort of discord amongst our political leadership and amongst other leadership, including the military leadership so that moral strength of the military leadership gets weakened,” Mr. Parrikar said.\n\nTechnical Services Division\n\nHe said the Technical Services Division (TSD) set up by the then Army Chief, General V.K. Singh, “fell to the political aspirations, to the political policies and political scoring point.” The TSD was a secret unit and it was scrapped soon after Mr. Singh’s retirement. There were allegations that the then UPA government was in the dark about its functioning and there were alleged misuse of funds.", 
    "section": "national", 
    "title": "Treat all terror strikes as war: Parrikar", 
    "subsection": "general", 
    "date": "2016-03-17"
}