{
    "author": [
        "Jackie Ashley"
    ], 
    "text": "Picture this. It’s a spectacularly beautiful spring day in west London. Friends, many of whom haven’t seen one another for months or even years, are gathered, gossiping. We’ve been instructed, later on, to down a glass of champagne after toasting “love and friendship”.\n\nWe are all of an age — grey and white hair, thinning male tops; deep, creased laughter lines; shoes chosen, slightly regretfully, for comfort. We were all there, along with her family, for a funeral — a heartbreakingly sad but also at times very funny farewell to a remarkable, feisty, politically active woman.\n\nIt being London, the people present generally of the left. And, the year being 2016, this is a determinedly secular funeral. Instead of a priest, there’s a family friend. Instead of readings from the Bible, there are poems and reminiscences from siblings, children, business partners and friends. Instead of hymns, there are lovely renditions of Leonard Cohen and Van Morrison. Instead of stained glass, there are video tributes.\n\nOver the years I have been somewhat nervous of secular sendoffs, though, given my friends and family, they are inevitable. It’s not that I am religious — far from it — but rather that more plainspoken, straight-from-the-shoulder remembrances of the dead person can be simply too much, too traumatic for the bereaved.\n\nSeeing the deceased as a young child, or in a family video, can be like a punch to the solar plexus. I have been to some such farewells, particularly for people who died young, and left barely able to walk with sorrow.\n\nBy contrast, traditional religion can help by being, frankly, slightly dull and predictable. The familiar biblical words, the quavering congregation working its way through Victorian hymns, the priest, who often has never met the deceased: all these deaden and distance. The same goes for the sometimes long-winded rabbi and readings in Hebrew. Ritual can be a wonderful thing — it is calming, rather than provokes — and at times that’s just what we need.\n\nBut this was a thoroughly joyous and well-crafted farewell. One got a pretty accurate picture of a life well-lived and full of achievements. This was a woman of great character and intelligence who had helped the less fortunate all throughout her life, while bringing up a remarkable family; and, in the meantime, she managed to have a huge amount of fun.\n\nHer partner, her children and even the lawyer who helped get her off numerous motoring offences spoke to us directly about the meaning of our lives. If only, many of us said afterwards, we had known so much about our friend before she died. Yes, we recognised the beaming smile, the appetite for life, the daredevil approach to cycling and skiing, but there was much that surprised and delighted in learning more about her life.\n\nAt the same time, her husband assured us that she would have been amazed at such a turnout at her funeral, at such warmth and so many tears. This event seemed more than simply a funeral or a farewell, or even a celebration of a life: it was a coming together of people to hear about and think about our values and the importance of love and friendship. This is what she had wanted.\n\nThe funeral was enormous, brimming with people who knew her well or not so well but had a place in their hearts for her. The only real sadness was that the lady herself wasn’t present with us to see the story of her life so beautifully told, and to raise a glass with us.\n\nWhy shouldn’t we have big celebratory moments towards the end of our lives, looking back while we still can? The same was true of an entirely different ceremony for an elderly aunt last year. In poor health towards the end of her life, she had lost touch with friends.\n\nRecognising the demands on her busy family, she had never got round to going through those old family albums with us, and we simply hadn’t looked back or reminisced about her active and generous life enough.\n\nOnly after her death did we all stop and ponder her remarkable abilities — and again, she would have been surprised and delighted by the love of family and friends, who emerged from years back, to say goodbye.\n\nIt was too late, of course, by then. But how we wished we had invited all her friends to a party while she was still with us. Wouldn’t it be wonderful to decide in one’s mid-70s or 80s — or even earlier — to hold a party that acted as a reflection on one’s life, bringing together all the people one had accumulated as friends over the decades? The playlist alone would be a delight. The darkness of the actual death would still be in the future. — © Guardian Newspapers Limited, 2016\n\nGathering loved ones to reminisce and celebrate a life needn’t come too late for us to enjoy", 
    "section": "national", 
    "title": "Why wait for my funeral? I’d like one hell of a party while I’m around", 
    "subsection": "general", 
    "date": "2016-03-17"
}