{
    "author": [
        "Appaji Reddem"
    ], 
    "text": "It looks like the construction of the proposed Andhra Pradesh secretariat at Velagapudi (16 km from Vijayawada) in Amaravati capital region is likely to be completed much before the stipulated June 15 deadline. Sources from L&T indicate that the efforts are on to expedite the construction of the project to complete it before the deadline.\n\nThe Rs. 230-crore contract related to the secretariat complex consisting of five buildings has been awarded to construction majors L&T and Shapoorji Pallonji. The prestigious project is expected to be completed by June 15, by which time most of the government staff have been to shift from Hyderabad to the Amaravati capital region.\n\nFive weeks after the commencement of the work, the construction firms are leaving no stone unturned to meet the deadlines. Speaking to The Hindu at the construction site, L&T Head, Special Initiatives, AP, T. Krishna said, “Work is going on well. Everything is progressing on the expected lines.” The cautious official further said that the AP Capital Region Development Authority (CRDA) is the authorised agency to comment on the progress of the project. However, another official from the company said that there is an intense focus on completing the work much before the stipulated June 15 deadline. “Workers are engaged in three shifts to expedite the project and all compatible machinery is being used to meet the objectives. With pre-fabricated structures that are underway, it’s very much possible to meet the new deadlines,” said the official.\n\nThe two firms have agreed to build the secretariat at Rs. 3,350 per sft proposed by the AP government. The firms will also get a two per cent of the project cost as financial benefit from the government if they exceed the expectations of the deadline as per agreement.\n\nNaidu visits the site\n\nChief Minister N. Chandrababu Naidu took an aerial view of the construction site in a helicopter on Friday and interacted with the officials of both the construction firms and inquired about the progress of the project. He then proceeded to Vijayawada to announce the Japanese firm Maki and Associates as the successful bidder for designing people’s capital city of Amaravati.\n\nMounting pressure\n\nMeanwhile, pressure is mounting from all directions for the full-fledged capital city and official machinery which is absent ever since the united AP was bifurcated into AP and Telangana States. Administration has come to a virtual standstill in some departments as many officials are stuck in the neighbouring Telangana.\n\nAfter series of negotiations and cajoling, the government staff recently agreed to shift from the congenial erstwhile capital Hyderabad to Vijayawada city which is still graduating into a base capital of the fledgling state.\n\nContruction firms will get two per cent of the project cost as financial benefit", 
    "section": "national", 
    "title": "A.P. Secretariat likely to be completed before deadline", 
    "subsection": "general", 
    "date": "2016-03-26"
}