{
    "author": [], 
    "text": "Enrique Ferrari slips into a double life with ease - as a cleaner and prize-winning writer\n\nWhen the Buenos Aires subway closes at night, Enrique Ferrari goes underground to mop the platforms — and to polish his next thriller.\n\nThe Argentine station cleaner, 44, with bags under his eyes, is also a prize-winning crime novelist. He has been published in several countries, but it is the night-time cleaning job which puts food on the table for his three children. “Live off writing? The money isn’t good enough,” he says.\n\nA representative for cleaning and other unskilled staff in the subway workers’ union, he is seen as a curiosity: a decorated writer who has never been to university. The author — and his gritty, succinct prose — has caught the media’s eye, appearing on television, radio and in news reports where he has been dubbed the “subway writer”. But he is fed up with the sobriquet.\n\n“I understand that people find it surprising, but I am not a strange creature,” says Mr. Ferrari, an easygoing man who himself laughs about his disparate vocations.\n\n“It is a peculiarity of capitalists and the bourgeoisie to think that we workers have no culture,” adds the novelist, whose many tattoos include one of Karl Marx on his left arm.\n\nMr. Ferrari has published five novels and two collections of short stories. His murder mystery Que De Lejos Parecen moscas ( They Look Like Flies From A Distance ) won a prize at the prestigious Gijon crime writing festival in Spain in 2012. That got him published in France, Mexico and Italy. Previously he won a prize in Cuba for Lo Que No Fue ( What Was Not ), a political thriller set in Barcelona during the Spanish civil war.\n\nWriting during breaks\n\nIn the subway, he clears up commuters’ rubbish in an environment that reflects the dark settings of his crime fiction.\n\n“I work in an abandoned city. In a universe which is always overpopulated, I come along after the party.” In the brief breaks during his cleaning shift, he switches on an old laptop and polishes his manuscripts.\n\n“I write whenever I can, wherever I can,” he says. “Although during the day I’m most interested in finding time to sleep.”\n\nHis other work space is a little table piled with books in a corner of his apartment in the Once district of Buenos Aires.\n\nHe has worked as a baker, driver and street vendor. He spent three years living illegally in the United States before being deported, but came back home with his first novel, Operation Bukowski , published in Buenos Aires in 2004.\n\nA fan of River Plate football club and rock ‘n’ roll music, Mr. Ferrari grew up in a modest home. When he was eight, his father gave him a book from the Sandokan series, pirate adventure novels by the early 20th-century Italian writer Emilio Salgari. “Instead of dreaming of being a pirate, I dreamed of writing without stopping, like Salgari.”\n\nBut he doesn’t want to go the same way as his literary hero. “Salgari ended up committing suicide. He was tired of the publishers sucking his blood,” he says. “He wrote them a letter saying: ‘I bid you farewell as I break my pen.’ I’m going to tattoo that on myself,” he says.\n\nDespite the prizes he has won, Mr. Ferrari is on the margins of the literary scene, shunned by major publishers. “I do not think of literature as a career,” he says.\n\n“But at quarter to eleven, 15 minutes before I go to mop the floors, I dream of winning an international prize or of Steven Spielberg wanting to film one of my books.” — AFP", 
    "section": "national", 
    "title": "Argentine prize-winning writer works as a station cleaner at night", 
    "subsection": "general", 
    "date": "2016-03-26"
}