{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "Action follows complaint by the Pollution Control Board against water supply & sewerage authorities\n\nA sewage treatment plant on the bed of Madiwala lake has become dysfunctional, according to the complainant.— File Photo: K. Murali Kumar.\n\nIn a first, the top brass of the Bangalore Water Supply and Sewerage Board (BWSSB), often in the dock for letting sewage into the city’s lakes, is being held accountable. A city court has found prima facie case against it under the Water (Prevention and Control of Pollution) Act, 1974.\n\nThe incumbent BWSSB Chairman, T.M. Vijaya Bhaskar, two former chairmen, Anjum Parvez and Ravishankar, and 10 engineering staff, will face legal proceedings for letting sewage into the Hulimavu, Madiwala and Arakere lakes. If found guilty, they may face a prison term.\n\nThe V Additional Chief Metropolitan Magistrate (ACMM) Court, hearing a private complaint filed by the Karnataka State Pollution Control Board (KSPCB), ordered the registration of the case, and issued summons. The chairman and other heads were supposed to file their reply on March 22. However, the agency has sought more time. The case has been adjourned to June.\n\nThe KSPCB filed the case in 2015, following a complaint by Wing Commander (retd.) G.B. Atri, who is leading a watchdog committee of the three lakes, formed by the KSPCB in partnership with local residents. “It is criminal of BWSSB, which is duty-bound to protect the lakes, to be the biggest polluter. Ironically, BWSSB chairman is also an ex-officio member of KSPCB,” said the retired Wing Commander.\n\nKSPCB had issued several notices, asking the BWSSB to stop letting sewage into these lakes, in 2014, copies of which are available with The Hindu . When all else failed, KSPCB went ahead with the criminal suit, said a senior official.\n\nEven as Mr. Lakshman, chairman, KSPCB, said the Board would aggressively pursue the case to hold the top brass of BWSSB accountable for the first time, Mr. Vijay Bhaskar said the setting up of sewage treatment plants (STP) was a larger systemic issue that needed government investment. “We will defend the agency in the court through legal means,” he said.\n\nHowever, it’s not just the lack of STPs that has ruined the three lakes. An STP on the bed of Madiwala lake has become dysfunctional. “BWSSB has now handed over the dysfunctional STP to the Lake Development Authority (LDA). The drainage line of the BWSSB in the area is leaking, letting the sewage in the lake seep in through the wetlands,” Mr. Atri said.", 
    "section": "national", 
    "title": "Court issues summons to officials over pollution of lakes in Bengaluru", 
    "subsection": "general", 
    "date": "2016-03-26"
}