{
    "author": [
        "Special Correspondent"
    ], 
    "text": "West Bengal Chief Minister and Trinamool leader Mamata Banerjee greets people during her campaign rally in West Midnapore on Friday. — PHOTO: PTI\n\nIn a veiled reference to the Central forces and the Election Commission of India, West Bengal Chief Minister Mamata Banerjee on Friday advised her party supporters “not to be scared by outsiders.”\n\n“Don’t be afraid if somebody comes from outside and scares you. They will go back after three days,” Ms. Banerjee said at a rally at Lalgarh in the Jangalmahal region, which will go to polls in the first phase of the Assembly elections.\n\nTo boost the confidence of her supporters, Ms. Banerjee said: “I am not dead. I will always fight.”\n\nThe remarks came on a day when a delegation of the ruling Trinamool Congress met the State’s Chief Electoral Officer, claiming that six party workers were killed.\n\n“Every day they are killing (our party workers). Who gave them the right to kill? We will not tolerate killing. There is no place for political vendetta in Bengal,” Ms. Banerjee said.\n\nTMC vice-president Mukul Roy asserted that in case of another murder, the party would bring the functionary’s body to the CEO’s office as law and order was “the responsibility of the Election Commission now.” He claimed that no worker of other parties had died in this election season.\n\nOnly a few days ago, the Chief Minister took a jibe at the Opposition parties, asking them to get police “from the United States” if they did not have faith in the Bengal police.\n\nThe Chief Minister also tried to highlight the atmosphere of peace in Jangalmahal, saying her government had “brought back” to the mainstream the youth who had strayed on to the path of left-wing extremism. “Hundreds of people were killed due to violence in Jangalmahal. There are no killings now,” she said, adding that sports and cultural activities were flourishing there.\n\n( With inputs from PTI)", 
    "section": "national", 
    "title": "Don’t let outsiders scare you: Mamata", 
    "subsection": "general", 
    "date": "2016-03-26"
}