{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Hossam Mohamed, the Egyptian national who was arrested here on Thursday on the basis of a Red Corner Notice issued by Egypt, was on Friday produced in a court and remanded in judicial custody. The extradition cell of the Mumbai Police Crime Branch has now initiated the process of confirming his identity before he can be extradited.\n\nRed Corner Notice\n\nThe Hindu had reported how Mohamed, who had landed in Mumbai from Qatar, was detained by the Immigration authorities at the Chhatrapati Shivaji airport after his name was flagged in an RCN, and handed over to the Extradition Cell.\n\nPrima facie inquiries indicate that Mohamed was part of the widespread violence that ripped through Egypt in 2013 following the ouster of the then President Mohammed Morsi.\n\nOn Friday, Mohamed was produced in a holiday court and was remanded in judicial custody till Monday. “As it was the weekend, we produced Mohamed in a holiday court. We will produce him in a regular court on Monday and will seek further custody while the necessary formalities are completed,” said a Crime Branch officer.\n\nThe Crime Branch is now drafting a letter to be sent to Egypt through the Ministry of External Affairs, asking for particulars of Mohamed’s identity, including his photographs and fingerprints. “Once these are received, we will compare them with those of the suspect in our custody. Once we have formal confirmation of his identity, the extradition process will begin. The identification process is crucial. Even when Kumar Pillai was held in Singapore, we had to wait till the Singapore government confirmed his identity before we could begin the extradition process,” the officer said.\n\nThe Crime Branch has also sought details of the case against Mohamed from the Egyptian authorities.\n\nMumbai Police\n\nare trying to\n\nconfirm his\n\nidentity before extraditing him", 
    "section": "national", 
    "title": "Egyptian national in judicial custody", 
    "subsection": "general", 
    "date": "2016-03-26"
}