{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "The terrorist says he hated Indians since childhood\n\nHeadley says he hated India since childhood as his school was bombed in 1971 byIndian fighter planes.\n\nIn a fresh revelation, Pakistani-American terrorist David Coleman Headley testified before a court on Friday that in 2008 former Pakistan Prime Minister, Yousuf Raza Gilani had visited his house in Pakistan to condole the demise of his father, who worked as a Director General of state-run radio, Radio Pakistan and died a few days after the 26/11 terror attacks.\n\nHeadley also spoke about his hatred for India after his school was allegedly destroyed in the 1971 Indo-Pak war.\n\nDeposing via video conferencing from the U.S. before Judge G.A. Sanap in the 26/11 trial against Abu Jundal, one of the alleged plotters of the Mumbai attacks, Headley denied that former Pakistan Prime Minister was present at the funeral of his father on December 25, 2008. “The former Pakistan Prime Minister, Yousuf Raza Gilani, visited my house a few weeks after my father’s demise on December 25, 2008,” he told the court. He said his father had objected to Headley’s association with terror outfit Lashkar-e-Taiba (LeT).\n\nIn another shocking disclosure, Headley said that in a conversation he had with fellow convict Dr Tahawwur Hussain Rana in September 2009, he had said that all the nine attackers who were killed in anti-terror operations during the 26/11 attacks should receive the highest gallantry awards of Pakistani military, “Nishan-e-Haider.”\n\nReferring to the 1971 Indo-Pak War, the 55-year-old told the court that he had hated India and Indians since childhood as his school had been bombed in December 1971 by Indian fighter planes. The bombings destroyed the school and killed some employees, he said. Headley said he wanted to cause maximum damage and loss to India.\n\nHe said that one of the reasons for him joining the LeT was to avenge the bombing, and hence he travelled to Kashmir to assist separatists fighting the Indian troops.", 
    "section": "national", 
    "title": "Former Pak. PM Gilani visited my house: Headley", 
    "subsection": "general", 
    "date": "2016-03-26"
}