{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "Police accompanying those accused in the murder of a dentist in New Delhi on Friday.— Photo: Special Arrangement\n\nCelebrations of India’s dramatic victory over Bangladesh in the T20 cricket match turned ugly for a family in Vikaspuri when one of its members, a 40-year-old dentist, was brutally beaten to death by around 15 people outside their residence on Thursday.\n\nSo far, nine persons, including a woman and four minors, have been held in connection with the attack.\n\nThe incident happened around midnight when the victim, Pankaj Narang, entered into an argument with two bikers who soon returned, joined by a dozen others, to attack the dentist.\n\nDeputy Commissioner of Police (West) Pushpendra Kumar said around 12.15 a.m., the main accused, Nasir, and a minor friend were passing through the service road where the Narang residence is located.\n\nAround the same time, Mr. Narang, having just watched the cricket match, indulged in a game of cricket with his son. It so happened that the ball was hit outside the house and Mr. Narang’s son went to get it back. His father followed him. When the bikers came close to them, Mr. Narang signalled them to stop. His hand brushed one of the accused and an argument ensued,” said Mr. Kumar.\n\nSachin Kapoor, a neighbour, added that the argument escalated into a scuffle, following which Mr. Narang pulled out the ignition key from the motorcycle of the accused, forcing him to abandon it and leave.\n\nThe two, who live in a JJ cluster close by, soon returned with several others residing in their locality and dragged Mr. Narang out of the house.\n\n“They attacked him with rods, sticks and a cricket bat,” said Mr. Kapoor.\n\nA police team rushed to the spot and took the injured victim to a hospital where he died during treatment.", 
    "section": "national", 
    "title": "Four minors among nine arrested a day after dentist’s murder in Delhi", 
    "subsection": "general", 
    "date": "2016-03-26"
}