{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The Missionaries of Charity told The Hindu on Friday that Father Tom Uzhunnalil who was kidnapped by the Islamic State in Aden, Yemen, on March 4 following an attack, remains untraced, though concerns mounted last week about a reported plan by the terror outfit to crucify him around Easter.\n\n“We, at the Missionaries of Charity, are concerned but we have not been contacted by anybody giving information about Fr. Tom Uzhunnalil’s whereabouts in the West Asian region. We have seen online reports informing that the IS has been planning to crucify him on Good Friday. But neither our headquarters in Kolkata, nor our regional centres in West Asia have received message from any of the outlawed groups in the region,” Sunita Kumar told The Hindu.\n\nThe campaign to save Fr. Uzhunnalil intensified in the last few days, when various Christian websites and Facebook pages claimed that they had information about the IS planning his crucifixion on Good Friday. He was last seen on March 4 in Aden, where he served as a priest at a care-giving home run by the Missionaries of Charity which was targeted that day by the IS. One of the nuns who escaped the attack recovered at a hospital and gave a detailed account of the brutal massacre of 16 people, including four nuns.\n\nThe campaign to save the priest, who originally belonged to the Salesian Church, began after that. However, Fr. Uzhunnalil could not be located by the Yemeni police.\n\nThe Salesian Church earlier denied the information on the Internet about the crucifixion, with its spokesperson Fr. Mathew Valarkot saying the order had no information about the priest. The Ministry of External Affairs also declined to confirm the reports about Fr. Uzhunnalil, indicating that the government was closely monitoring the information from Yemen.\n\nIn Bengaluru, several churches held prayers for Fr. Uzhunnalil, in the wake of concerns over a threat to his life. The Salesians’ Province of Bengaluru, with which he had worked, spent the day holding special prayers for his safety at their two churches in the city, and around 40 community centres across Karnataka. The Archbishop of Bengaluru Bernard Moras told the media that while there was no credible information about Fr. Uzhunnalil, they pray for his safety.", 
    "section": "national", 
    "title": "Indian priest in Yemen still untraced", 
    "subsection": "general", 
    "date": "2016-03-26"
}