{
    "author": [
        "Rishikesh Bahadur Desai"
    ], 
    "text": "A mobile application developed by the Karnataka Rural Development and Panchayat Raj Department has drawn the attention of the Union government.\n\nThe App, titled ‘MGNREGA M-platform,’ helps officials monitor the Mahatma Gandhi National Rural Employment Guarantee Scheme, and allows the beneficiaries to monitor progress at every stage.\n\nIt has been devised to increase transparency, reduce fund diversion and interference by middlemen. It can also be used to ensure automatic payment of wages to labourers by transferring data to the central server.\n\nOfficials of the Union Ministry of Rural Development have sought a report on the unique features of the app. They want to encourage its usage across the country, Munish Moudgil, MGNREGA Commissioner told The Hindu . A preliminary technical report has been sent to New Delhi.\n\nUsing it is easy. Panchayat Development Officers (PDOs) can issue work orders and begin work using the app. As the work progresses, it will allow officials to send information to the zilla panchayat and the State government.\n\nThe mobile phones of around 6,000 gram panchayats receive data from the department’s central servers. The data is tagged to the phone number of the PDO attached to each GP.\n\nThe most important aspect of the app is citizen interface. It helps the labourers or below poverty line families to communicate with senior officials and tell them how they are progressing.\n\nIf a beneficiary plans to build a pond in his field, he does so by telling the PDO and starts feeding data through pictures. He posts ‘before and after’ pictures at every stage of construction. Once the construction is complete, he poses at his pond and uploads the picture to the M-platform. This initiates the process of payment of wages and material cost to him.\n\nThe money is transferred electronically to his account. This speeds up the process and ensures that there is no misuse of funds, officials say.\n\nThe app also helps collate data for the government. Officials can get real-time feedback.\n\n“Sitting in Bengaluru, I can find out how many Scheduled Caste women have built rainwater structures on their rooftops, but that their wages have been delayed by a week. Earlier, such data would have taken weeks, if not months, to flow to the head office,” the Commissioner said.\n\nThe Centre is\n\nkeen on encouraging\n\nits use across\n\nthe country", 
    "section": "national", 
    "title": "Karnataka develops mobile app to monitor rural employment scheme", 
    "subsection": "general", 
    "date": "2016-03-26"
}