{
    "author": [], 
    "text": "The feat may help Tim Chittock earn a Guinness World Record\n\nHe had a close shave with danger numerous times on the busy Indian roads, but that did not deter the ‘world’s fastest Kiwi’ Tim Chittock from completing his bicycle journey on the Indian Golden Quadrilateral.\n\nMr. Chittock, 24, set upon his cycling journey from the New Zealand Embassy here on February 27 to cycle close to 6,000 kilometres across Chennai, Kolkata, Delhi, Mumbai, Ahmedabad, Bengaluru, Bhubaneswar, Jaipur, Kanpur, Pune, Surat, Guntur, Vijayawada, and Visakhapatnam.\n\nThe cyclist, who hails from New Zealand and holds a Bachelors degree in Law and Economics from University of Waikato, pedalled about 250 km a day and covered the distance in 24 days.\n\nTwo years ago, he cycled the length of New Zealand and more recently the width of Australia.\n\nMr. Chittock says travelling on the Indian roads was a great experience but challenging.\n\n“The national highways are okay for cycling. However, the inner and link roads were challenging. I had a close shave at least three times. Once I was almost mowed down by a truck and I narrowly escaped,” the cyclist said.\n\nCurious questions\n\nMr. Chittock describes the people he met on the way as always affectionate and curious about his journey.\n\n“People will always come for a handshake. They would ask me questions like ‘Where are you from?’, ‘Where you have to go?’, and ‘What is the cost of your cycle’,” he said.\n\nMr. Chittock is attempting to set a Guinness World Record for cycling on the Indian Golden Quadrilateral in a limited time. He was contacted by Guinness and asked if would give it a try.\n\nMr. Chittock practices every day cycling about 80 km on average. — PTI\n\nThe national highways are okay for cycling. However, the inner and link roads were challenging. I had a close shave at least three times. Once I was almost mowed down by a truck and I narrowly escaped", 
    "section": "national", 
    "title": "Kiwi cyclist covers the Indian Golden Quadrilateral", 
    "subsection": "general", 
    "date": "2016-03-26"
}