{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Congress and BJP have rendered the policy ineffective, says BSP leader\n\nMayawati said Narendra Modi’s stance on reservation was comparable to the ‘jumlabaazi’ of his promise of bringing back black money.\n\nLashing out at Prime Minister Narendra Modi for his stance on reservation, Bahujan Samaj Party chief Mayawati on Friday said despite his repeated attempts to clarify on the issue, it had become impossible for people to believe that the reservation policy was not under threat.\n\nThe former Uttar Pradesh Chief Minister said Mr. Modi’s stance on reservation was comparable to the “jumlabaazi” of his promise of bringing back black money and ushering in “ Acche din .”\n\nShe urged Mr. Modi to refrain from mere rhetoric and instead rein in elements of the RSS and the BJP who were engaged in issuing wrong statements on reservation. She said if Mr. Modi was really concerned about the welfare of Dalits, he should bring reservation under the IX Schedule of the Constitution. She also called for the extension of quota in the private sector and in promotions.\n\nWhenever the RSS delivered “casteist and controversial statements” on the issue of reservation, Mr. Modi sought to clarify that reservation was the “right of Dalits” and no one could snatch it from them, Ms. Mayawati said. However, in reality, she said, the BJP and the Congress had, through a conspiracy, deemed the policy “ineffective.” While the BJP was busy invoking Dr. B.R. Ambedkar, the real motive of the party was to do away with reservation.\n\nThe BSP leader said the BJP and the Congress should seek forgiveness from the real offspring of “Bharat Mata,” the Dalits and the backward classes for the oppression faced by them and the non-implementation of the quota policy in its true spirit.\n\nMs. Mayawati also criticised the BJP and the RSS for their anti-Dalit and anti-OBC mentality.\n\nA key constitutional right of Dalits, reservation had been reduced to something only on paper and a cosmetic measure, she said.\n\nThe Congress and the BJP governments were not honest in implementing the policy. But, today, they were talking of reviewing the system, she alleged.\n\nThe RSS-BJP’s “Hindutvavadi” mentality was clearly reflected through their stance on reservation, she said.", 
    "section": "national", 
    "title": "Mayawati attacks Modi’s stance on reservation", 
    "subsection": "general", 
    "date": "2016-03-26"
}