{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Radhika, mother of Rohith Vemula, Dalit research scholar of the University of Hyderabad who committed suicide recently, asked the government how long the family should wait for justice.\n\nAddressing a press conference here on Friday, along with Rohith’s brother Raja, she said: “While the killers of my son are provided police protection, those who are supporting us are arrested and put behind bars. Our family is being isolated. “\n\nShe said: “In SC, ST atrocity cases, the accused has to be arrested within 24 hours, but University of Hyderabad Vice-Chancellor Appa Rao has not even been questioned. At the same time, false cases are being slapped against the students.”\n\nMr. Raja alleged that brute force was being applied even on girl students. Some were threatened with “rape,” he said.\n\nIt was unconstitutional for so many policemen to enter the campus and beat up students while cutting off essential supplies to them. P. Anupama, an assistant professor at the UoH, said she was “deeply distressed” on witnessing the “unbelievable violence of the police”. She compared living on campus to military rule. She pointed out that the Ministry of Human Resource Development (MHRD) committee had held the university administration responsible for Rohith’s suicide and Appa Rao, who heads the administration, had no right to continue in his position.\n\nPolice action criticised\n\nAcademic and activist G. Haragopal questioned the TRS government’s silence over police lathi-charge on students. He felt the State government should have intervened to prevent the assault.\n\nHe objected to Vice-Chancellor Appa Rao rejoining office even when a judicial inquiry was on.“It is an accepted principle that till a judicial inquiry is completed or the High Court gives orders, the V-C is not supposed to assume charge,” he said.\n\n‘While my son's killers are provided police protection, those supporting us are behind bars’", 
    "section": "national", 
    "title": "Our family being isolated, false cases filed against students: Rohith’s mother", 
    "subsection": "general", 
    "date": "2016-03-26"
}