{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Much to the relief of the Congress party, the Uttarakhand High Court on Friday rejected the petition of Congress dissidents that sought to reverse the notice issued by Assembly Speaker Govind Singh Kunjwal, asking them why they should not be disqualified for violating the party whip and siding with the BJP on March 18.\n\nRelentless in their efforts to justify their protest against the Harish Rawat government, the nine rebel MLAs have decided to move Supreme Court on Saturday to challenge the High Court’s decision.\n\n“We will fight until we get justice. The speaker’s notice is unfair because he’s working on the orders of Harish Rawat. We want an impartial review of our case and we have full faith that the Supreme Court will do justice,” senior Congress leader, now a rebel, Harak Singh Rawat, told The Hindu .\n\nPositive about toppling\n\nSince the speaker had asked the dissident MLAs to respond to the notice by March 26, Harak Singh Rawat said though they are pressed on time, they are still positive about toppling the Harish Rawat government.\n\n“We have a majority and he (Harish Rawat) is in a minority. How can he rule the State?” Harak Singh Rawat said.\n\nThe battle for power in Uttarakhand spilled over to New Delhi on Monday as the Congress, the BJP as well as the rebel Congress MLAs knocked on the door of President Pranab Mukherjee. The BJP leaders, along with the Congress rebels, demanded Mr. Mukherjee to dismiss the Harish Rawat-led government, while the Congress accused the ruling party at the Centre of fomenting defection to destabilise the grand old party.\n\nThe leader of the rebellion, Vijay Bahuguna and the other eight MLAs were served notices by the Speaker under the anti-defection law.\n\nSo far, Chief Minister Rawat has maintained that his government continued to be in a majority and also claimed to have regained the confidence of three rebel MLAs.", 
    "section": "national", 
    "title": "Plea of Uttarakhand rebel Cong. MLAs dismissed", 
    "subsection": "general", 
    "date": "2016-03-26"
}