{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The U.P. Minister had accused Ram Naik of working under the influence of a party\n\nReacting to Uttar Pradesh Cabinet Minister Azam Khan’s alleged controversial remarks about him in the Assembly, Governor Ram Naik on Friday said the statements raised “questions” about his capability. Mr. Naik said he would discuss the issue with Chief Minister Akhilesh Yadav, even as he shot off a letter expressing his concern to Speaker Mata Prasad Pandey.\n\nEarlier this month, concerned over Mr. Khan’s critical references to him in his speech in the House, Mr. Naik asked the Speaker to provide him the unedited copies — audio and video CDs — of the statement. In his address to the Assembly on March 8, Mr. Khan had accused Mr. Naik of stalling several bills by not giving his assent and suggested that it gave an impression that the Governor was working under the “influence of a party.”\n\nReferences were made to the U.P. Nagar Nigam Amendment Bill 2015.\n\nAfter reviewing the unedited transcript of Mr. Khan’s statement, Mr. Naik said the expunging of around 33 per cent of Mr. Khan’s statement in the Vidhan Sabha showed that the Minister’s “language was not favourable to the dignity and tradition of the House.” Out of 60 paragraphs in Mr. Khan’s speech, 20 were expunged. Mr. Khan’s statement raised a “question mark” on whether he was “capable” of executing his duty, Mr. Naik said in his letter to Mr. Pandey.\n\nWar of words\n\nEver since Mr. Naik’s appointment as Governor of U.P., he has shared a sour relationship with the SP leader, with the two engaging in a war of words on many occasions. Mr. Khan accused the Governor of acting like a “ karsevak ” and “communally vitiating” the atmosphere in the State at the behest of the NDA government at the Centre.\n\nMr. Khan had even written a four-page letter to Mr. Naik, accusing him of adopting a negative approach towards him.\n\nWhile Mr. Naik has taken veiled pot shots at the SP leader, last year he had suggested that the controversy surrounding his “pro-activism” stemmed from Mr. Khan’s inability to digest his cordial relations with the junior Yadav.\n\nIn his letter, Mr. Naik also asserted that he was sensitive to people’s issues through his political journey to the Raj Bhavan.\n\nOut of 60 paragraphs in Azam Khan’s speech in the Assembly, 20 were expunged", 
    "section": "national", 
    "title": "Ram Naik writes to Speaker on Azam Khan’s remarks", 
    "subsection": "general", 
    "date": "2016-03-26"
}