{
    "author": [], 
    "text": "Lutheran pastor Kazuhiro Sekino (in pic) and Monk Yoshinobu Fujioka say they hope their duels help them reach more people in a country where Buddhists outnumber Christians.— PHOTO: AFP\n\nMost days, Lutheran pastor Kazuhiro Sekino preaches to his congregation in a soft voice with religious hymns playing in the background of a Tokyo church.\n\nBut as night falls, he hits a smoky stage criss-crossed with whizzing strobe lights, shedding his pious day job in a battle of the bands against a group of Buddhist monks.\n\n“We are rock, pastors are rock!” Mr. Sekino (36) shouts into a microphone to stir up the several hundred concert-goers.\n\nThe band, ‘Boxi Rocks’ — the name is a play on the Japanese word for pastor — features Mr. Sekino and three other pastors, who don church robes during their raucous performances, sometimes with a leather jacket thrown over top. “I like Slipknot, a real hard rock band that has nine masked members. I also like Metallica and Megadeth,” a soft-spoken Mr. Sekino said. “They may look demonic from the Christian church’s point of view, but they are actually shouting to fight the world’s injustice. They talk about truth, no hypocrisy,” he said.\n\nMonk Yoshinobu Fujioka — head shaved and wearing a dark blue kimono — hits back with an acoustic guitar offering as head of the Bozu (monk) band.\n\n“I love the Blues. I love Bob Dylan and sixties music,” said the 39-year-old.\n\nSinging about pain\n\n“Living a worldly life, we always get hurt by pains and suffering which make us feel small. I like to sing about that pain in a tender way,” he said.\n\nThe unlikely pair hope their musical duels help them reach more people in a country where Buddhists far outnumber Christians. Figures released by the government based on data supplied by temples, churches and shrines show that Buddhism accounts for about 46 per cent of religious followers, while Christians make up less than two per cent. About 48 per cent, meanwhile, follow Japan’s native Shinto religion.\n\nBut for many Japanese, religion of any sort is more of a seasonal formality, paying homage at a shrine or celebrating Christmas.\n\n“We’re actually performing secular music. We have feelings just like other people and use the same language, sometimes even more crass,” said Mr. Sekino, who turned to heavenly work after his sister became critically ill. “But I want people to know that God lives there (in people’s lives). I want to share this,” he said.\n\nOpened a bar\n\nMr. Fujioka and his fellow monk-cum-rockers also opened a bar in Tokyo, where they offer another outlet for troubled visitors seeking a better life — over cocktails.\n\n“There are many people who want to talk about their problems and go home with a lighter heart. It’s our responsibility to meet with people like that,” he said.\n\nMr. Sekino initially contacted the monk about his quirky idea for musical evangelism and now they perform several times a year — with backing from above. “I don’t know if I should call this heaven or nirvana, but I think this is what the God would want to see — this is something the church or a temple couldn’t do”, he said. — AFP", 
    "section": "national", 
    "title": "Religious duel: Pastor rock vs. Buddhist monk blues", 
    "subsection": "general", 
    "date": "2016-03-26"
}