{
    "author": [], 
    "text": "The Rolling Stones flew in on Thursday for the free-of-charge concert at Ciudad Deportivo sports centre in Havana in Cuba.\n\nHundreds of thousands of Cubans were expected at the concert late on Friday at the Rolling Stones’ first gig on the communist island, with fans once banned from listening to rock ‘n’ roll heralding a dream come true\n\nCuban state media forecasted that about 500,000 people were to fill the playing fields, with music industry magazine Billboard reporting that as many people again could swarm into neighbouring streets.\n\nWith no tickets on sale, it was impossible to confirm the estimates, but a million fans would amount to one of every 11 Cubans.\n\nComing three days after a groundbreaking visit to Havana by U.S. President Barack Obama, the event was widely seen as another step in Cuba’s emergence from years of cultural, ideological and economic isolation.\n\nThe one party state, run by the Castro brothers for more than half a century, long looked down on British and U.S. rock as subversive.\n\nBetween the 1960s and 1990s, rock ‘n’ roll was discouraged to varying degrees, leading during the most repressive years to clandestine listening sessions and an underground trade in smuggled records and cassettes.\n\n“A Rolling Stones concert in Havana? It’s a dream,” said Eddie Escobar, 45, who founded one of Havana’s few clubs for live rock music, the Yellow Submarine. He remembers secretly searching for U.S. commercial radio frequencies so that he could hear the Stones, Led Zeppelin, Deep Purple and the like.\n\n“Rock music, I hope, will open everything else — politics, the economy, the Internet. We're 20 years behind absolutely everything,” Mr. Escobar said. Official stores still refuse to stock foreign rock so most people go to shops celling pirated CDs. — AFP", 
    "section": "national", 
    "title": "Rolling Stones arrive in Cuba for historic rock concert", 
    "subsection": "general", 
    "date": "2016-03-26"
}