{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "Passengers recall chaos at airport after Tuesday's terror attack in the Belgian capital\n\nIndians, who were stranded in Brussels after an attack on the airport and metro stations, welcomed by relatives at the Indira Gandhi International Airport in New Delhi on Friday.— Photo: Shiv Kumar Pushpakar\n\nThere was a lot of hugging and crying at the Indira Gandhi International Airport (IGIA) on Friday as relatives welcomed back loved ones who were stuck in the Belgian capital of Brussels following the deadly terror attacks there on Tuesday.\n\nA Jet Airways ‘recovery’ flight, 9W 1229, from Amsterdam, carrying 242 Indians including 28 crew members, landed at the IGIA at 5:30 a.m. on Friday, a Jet Airways spokesperson said.\n\nSome of the passengers from Punjab and Uttarakhand immediately called up their relatives after de-boarding to let them know they were back home safe. The flight also had passengers bound for Mumbai as their flight was cancelled at the last minute due to a technical problem, the spokesperson said.\n\nMini Chhawana, who was received by her uncle and father, recalled the nightmare: “I was stranded at Brussels airport for a long time as I had a layover there for I was coming from New York. There was a lot of chaos at the airport. Nobody knew what to do or where to go.”\n\nDelhi residents Satnam Singh and his family were stuck at the Brussels airport with their two toddlers.\n\n“We were coming back from Toronto. We had a transit flight from Brussels. As soon as we entered the airport, we heard explosions. Soon, it was clear that there had been a terror attack. The authorities at the airport told us that we have to evacuate the place immediately,” Mr. Singh said.\n\n“We were taken to an army relief camp where we stayed for two days,” he added.\n\nThe airline had earlier taken all its stranded passengers in Brussels to the Dutch capital by road.\n\nNarrating her ordeal, Chandan Gai said: “Within five minutes of my entering the Brussels airport, there were explosions. All the attendants started shouting — evacuate, evacuate. I somehow managed to find some Indians in the airport’s transit lounge. We formed a group and decided to stick together. We got hotel rooms and stayed there till the next flight to India could be arranged. The locals gave us free rides, food and everything we needed.”\n\n“The blast occurred in the departure area as soon as our flight landed. They took all of us out and we remained stranded there for quite some time,” another passenger said.\n\nWithin five minutes of my entering the Brussels airport, there were explosions. There was a lot of panic and chaos\n\nChandan Gai\n\nPassenger", 
    "section": "national", 
    "title": "Stranded Indians back from Brussels", 
    "subsection": "general", 
    "date": "2016-03-26"
}