{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bollywood actor and former adult film star Sunny Leone allegedly slapped a person posing as a reporter during a Holi event in Surat on Thursday.\n\nThe incident reportedly occurred at a hotel lobby where some media persons had assembled to interact with the actor.\n\n“You were a porn star earlier and now a movie star. How much do you charge for your programmes,” was the question that angered the actor, who is immediately said to have slapped the person who posed it.\n\n“It is true that she lost her temper when she was asked a question. But the person who asked the question was posing as a reporter. He was not a genuine scribe,” said a journalist from Surat who was present at the hotel.\n\nFollowing the incident, Ms. Leone reportedly called the event organisers and asked them to ensure adequate security at the venue where she was supposed to dance in the event called “Holi with Sunny Leone.”\n\nHowever, as the media reported the news on Friday, Ms. Leone denied slapping the person.\n\nSources said her denial was about not slapping any scribe as that was never the case at all.\n\n“The person who was slapped was not associated with any media,” a Surat-based journalist told The Hindu .\n\nNo police complaint\n\nNo police complaint was filed by either the actor or the organisers about the incident.\n\nMeanwhile, the organisers who had invited the Bollywood star for the event went underground as the news spread in the media, particularly social media platforms like Facebook and Twitter.\n\n“The organisers turned off their mobile phones and were not reachable the whole day on Friday,” said another reporter from Surat.\n\nThe actor was reportedly provoked by a question posed by a man during a Holi event", 
    "section": "national", 
    "title": "Sunny Leone accused of ‘slapping’ fake journalist", 
    "subsection": "general", 
    "date": "2016-03-26"
}