{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "As the stalemate over government formation in Jammu and Kashmir has ended, one key highlight of the development is the return of senior Peoples Democratic Party leader and Member of Parliament, Tariq Hameed Karra, into the party’s decision-making circles.\n\nAs PDP legislators assembled on Thursday to endorse party president Mehbooba Mufti as Chief Minister, Mr. Karra was seen sitting alongside Ms. Mufti throughout the session. Even when Ms. Mufti faced the TV cameras, Mr. Karra again stood by her, as if he wanted to convey that the PDP was no longer divided. The party spokesperson, Waheed Parra, told The Hindu that with Mr. Karra’s return, Ms. Mufti wanted to convey that “the party is intact.”\n\nPrior to this, the equation between Mr. Karra and the high command was radically different. Over the last few months, Mr. Karra was considered a disgruntled leader, sidelined by his own party men after he vehemently criticised the idea of forming a coalition government with the Bharatiya Janata Party in March 2015.\n\nIn the first 10 months of the government under the former Chief Minister Mufti Muhammad Sayeed’s command, Mr. Karra was nowhere close to the power ranks. He, in fact, spent most of his time as a parliamentarian in New Delhi. He constantly spoke against the coalition government, expressing his astonishment at the PDP joining hands with an ideological rival like the BJP.\n\nIn mid-February, he told The Hindu that the PDP was a “buffer” between the J&K’s pro-separatists and pro-India people and by aligning with the BJP the party was losing its political identity. Between May 2015 and December 2015, he boycotted the party meetings and did not even visit the AIIMS to see the ailing chief minister and the party patron, Mufti Muhammad Sayeed, when he was battling for his life in early January.\n\nMs. Mufti seems to have left all that behind. In mid-February, she prepared the ground for Mr. Karra’s return when she addressed her party workers at Banquet Hall in Srinagar district. Deploying a metaphor to describe Mr. Karra’s role in the party, she said: “While I was a mason, Karra sahib would bring bricks and mortars.”\n\nA founding member of PDP, Mr. Karra has accompanied Ms. Mufti to almost every district of the State, when she was canvassing support before the launch of the party in 1999. “I remember the time when Mehboobaji was scared of going to Kishtwar district because of the militancy factor. It was Karra who guided her into those dangerous terrain,” said a PDP legislator.\n\nIt remains to be seen, though, what role Mr. Karra would play in the government that is set to become functional soon after Ms. Mufti is sworn in as Chief Minister. And it’ll be testing for him to shelve his objections against the BJP and work with it in the government.", 
    "section": "national", 
    "title": "Tariq Karra’s return proves PDP is no longer divided", 
    "subsection": "general", 
    "date": "2016-03-26"
}