{
    "author": [
        "Rani Devalla"
    ], 
    "text": "In 2005, when Aruna Gali, co-founder of Vikasa Dhatri, launched her web-portal, she never expected it to reach out to a large audience.\n\nEleven years down the line, the medium has not only led her to connect with diverse crowds, but also earned her the highly-coveted Laadli Media and Advertising Award for Gender Sensitivity 2014-2015.\n\nHer Telugu blog ‘ Vivakshaku Mugimpu Palakaali ’ has been selected as the best blog under the web category for bringing to the fore core issues faced by women in the agriculture sector. “It was indeed a pleasant surprise for me as I was one among 75 participants who took part from the southern and western regions. The process involved a fair amount of research, interaction with rural women, disseminating information through videos and improving access to loans, seeds and fertilizers,” says Ms. Aruna, adding that her husband and founder of the web portal, Gali Uday Kumar, supports her in every endeavour.\n\nApart from dealing with themes — Create a better world; Beware of Anti-Ragging Act; Domestic Violence against Women; Sanitation matters; environmental issues — in both English and Telugu, the blog also offers free downloads of e-books. “We conduct workshops in schools and colleges and encourage students to generate ideas on waste management and environment conservation. Incorporating games, radio activities and storytelling sessions, we try to bring about attitudinal change among young minds, making it easy for them to absorb, internalise the content and pass it on,” explains Ms. Aruna who won the National Human Rights Champion Award and Best Performing Project Officer Award for promoting environment education.\n\nAruna Gali’s work chosen for bringing to the fore issues faced by women in agriculture sector", 
    "section": "national", 
    "title": "Telugu blogger wins Laadli media & advertising award", 
    "subsection": "general", 
    "date": "2016-03-26"
}