{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Phenomenal rise of Islamic State prompts move\n\nThe U.S. has proposed to work with India to prepare a road map in countering violent extremism and radicalisation. The phenomenal rise of the terrorist outfit, the Islamic State (IS), is one of the reasons that prompted the move and the U.S. has proposed that both countries exchange information on this aspect, a senior government official told The Hindu .\n\nIndia and the U.S. are to meet for Homeland Security dialogue soon and this is one of the agenda points that will be discussed.\n\n“There are many countries which want to emulate India’s strategy and policies when it comes to stalling the influence of the Islamic State in their territory. Barring a miniscule number of young men who have travelled to Syria to join the IS, the pull of the outfit in India is negligible,” said a senior government official.\n\nIn a countrywide raid in January this year, the National Investigation Agency (NIA) and the police had cracked down on a pan-India IS network and arrested around 25 young men from various parts of the country. The accused had pledged allegiance to the IS and wanted to establish ‘Janood-ul-Khalifa-e-Hind’ or the Army of Caliph of India by carrying out terror strikes at important installations.\n\n“The U.S. wants to collaborate with India on building model programmes to wean away the youth from falling for extremist ideology. It intends to launch such capsules on the Internet and how to counter the influence in the online world,” said the official. The United States has also reiterated its proposal that India agree to the Homeland Security Presidential Directive (HSPD-6), a model text agreement for exchange of terrorist screening information between Terrorist Screening Centre (TCS) of the U.S. and any Indian security agency.\n\nOn its part, the U.S has said that in the past one year, “two dozen people with terrorist links” were arrested in Canada and Australia with the help of HSPD-6 as both countries are signatories to it. In all, the U.S. has finalised the agreement with 30 other countries.\n\nVast database on suspects\n\nIf India signs it, it could get access to the U.S. database of 11,000 terror suspects. Indian security agencies are apprehensive of giving unhindered access to the U.S. on sensitive data related to terrorists and the agreement is stuck for the past several years.\n\nMany countries want to emulate India’s policies on stalling IS influence, says official", 
    "section": "national", 
    "title": "U.S. wants to work with India to curb radicalisation", 
    "subsection": "general", 
    "date": "2016-03-26"
}