{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Law soon to deal with agencies employing infiltrators: Jaitley\n\nThe BJP’s Vision Document for the Assam polls has promised that if voted to power, the party would accomplish the complete sealing of the India-Bangladesh border.\n\nReleasing the document in Guwahati on Friday, Finance Minister Arun Jaitley accused Assam Chief Minister Tarun Gogoi of destroying and changing the demography of the State by allowing infiltration. The document lays emphasis on sorting out the issue of clause 6 of the Assam Accord (1985) that deals with the question of citizenship.\n\nWhile this was in keeping with the larger BJP agenda of keeping illegal immigrants out, the document also had a lengthy chapter on a “historical perspective” on the State and its tradition of assimilation.\n\nThroughout the chapter, Assam’s roots in south-east Asian cultures is traced, and the subsequent assimilation of the kingdom of Kamrup into the “Indian cultural empire”. References to Kamrup in the epic Mahabharata are mentioned, as also the assimilation of Lord Shiva into the Aryan pantheon along with the Goddess Kamakhya who, the document said had “Austric origins.”\n\nAssimilating cultures\n\nThe State’s tradition of assimilating various population groups and cultures has been emphasised, quoting former president S. Radhakrishnan, sage Shankardev and former Jan Sangh president Deendayal Upadhyaya.\n\nAccording to those involved in the process of preparing the document, the historical perspective displaying the assimilative nature of Assamese society is to draw a clear line that goes from keeping infiltrators out, to giving a chance to a political party with different roots (BJP) that is largely seen as Hindi speaking and north Indian in ethos. Not all outsiders are unwelcome, seemed to be the unambiguous message.\n\n“The Ahom kings [the longest ruling dynasty in the State, with their roots in Thailand] took to Hinduism linking it with the cultural empire of India, and we have a leader now [Chief Ministerial candidate Sarbananda Sonowal] who hails from one of the tribes in the State and talks of a greater Assamese identity, including the Ahoms, Hindi speakers, Bengalis and even Assamese Muslims,” said an office-bearer, a part of the team that conducted the Assam Nirman workshops that the party undertook throughout the State to come up with the vision document.\n\nMr. Jaitley said that a law would be enacted soon to sternly deal with industries, businesses, SMEs or any other agencies employing infiltrators.\n\n“We are clear in our mind that 2016 election is a historical chance to defeat and uproot the failed 15-year-old Congress government. That is why all anti-Congress social and political parties have united and are fighting together,” he said.\n\nThe BJP has less than 10 MLAs in the current Assembly but its performance in the 2014 general elections, when it won seven out of the 14 Lok Sabha seats from the State has encouraged its ambitions.\n\nThe long historical introduction therefore appears to be a way for the party to reconcile its anti-outsider narrative to assimilating different sections of alienated insiders.", 
    "section": "national", 
    "title": "We will seal Bangla border, says BJP", 
    "subsection": "general", 
    "date": "2016-03-26"
}