{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "Close to 40 per cent of minors and adults trafficked to and from Andhra Pradesh and Telangana were sold or supplied by well connected, upwardly mobile, tech-savvy traffickers, revealed an assessment of cases taken up by a city-based NGO, Prajwala.\n\nThe NGO and its founder, Sunitha Krishnan, have so far rescued 15,000 minor and adult victims of human trafficking. The age group of those rescued is between three-and-a-half and 25 years.\n\nAs per the trafficker profile, which the Prajwala team is building even as it is on an anti-trafficking on-road caravan campaign, Swaraksha, the involvement of middle and high income groups in the tracking ring is pivotal to solving several cases. The campaign is supported by the U.S. Consulate, Hyderabad.\n\n“Unless you profile the supplier and client, you won’t be able to make a dent in the human trafficking network,” says Ms. Krishnan. It was only a few months ago that an assistant professor of a reputed university in Hyderabad was picked up for being a supplier in a human trafficking chain. In 2005, a woman professor was arrested for running a trafficking chain in Tirupati.\n\nAs against other States, Andhra Pradesh and Telangana are second highest suppliers of minors and adults.\n\nStatistics available with the Union government on human and minor trafficking for prostitution and other crimes paints an abysmal picture of A.P. and Telangana. According to the latest available records on trafficking, 102 cases were under trial in 2013 for procurement of minor girls. Of this, only 44 reached completion with one conviction, 43 acquittals or discharges. Statistics on selling girls for prostitution in the same year, shows that nine cases were under trial, of which only one reached completion with zero conviction.\n\nWith the Swaraksha Caravan set to cover 53 districts in Telangana, A.P. and Odisha, Ms. Krishnan said the 11 volunteers would try to raise awareness among people to look out for offenders who mostly go unnoticed because of their social status.", 
    "section": "national", 
    "title": "‘40 p.c. of minors trafficked by the upwardly mobile’", 
    "subsection": "general", 
    "date": "2016-01-17"
}