{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Getting started:(Right) N. Ram, Chairman of Kasturi & Sons Limited, publishers of the The Hindu , lighting a lamp during the inauguration of The Hindu Lit For Life Festival in Chennai on Friday. Rajiv C. Lochan (second from left), CEO, The Hindu Group; Dr. Nirmala Lakshman (left), Director of The Hindu Group and curator of Lit For Life, and Saleem Yousuff, Area Director & GM, Taj Coromandel, look on. The former Jammu and Kashmir Chief Minister, Omar Abdullah, delivered the keynote address. Many of the sessions were marked by serious discussions and were also laced with humour. —Photos: R. Ragu & R. Ravindran\n\nThe Hindu Lit for Life 2016, a three-day literary festival, started on Friday, offering a platform for readers to interact directly with eminent authors across genres.\n\nDelivering the inaugural address, N. Ram, Chairman of Kasturi & Sons Limited, publishers of The Hindu said: “These festivals are a great learning experience for all the people who come to it.”\n\nEminent speakers celebrated the resilience of Chennai after the recent floods and called for upholding the freedom of speech and expression. The venue remained full as people turned up in large numbers.\n\nMany of the sessions such as ‘The uses and abuses of religion’ that were marked by serious discussions were also laced with humour.\n\nA number of readers asked thought-provoking questions, eliciting answers from speakers on a wide range of subjects, including aspects of the political developments in Jammu and Kashmir (following the keynote address on My Kashmir by Omar Abdullah), creativity, floods in cities, the arts and crafts in India, religion, the Aarushi story, impact of urbanisation, literature for children in India and shifting notions of the Nation State.\n\nNirmala Lakshman, Director of Kasturi & Sons Limited and curator of The Hindu Lit for Life, said “The sixth edition of The Hindu Lit for Life was dedicated to the spirit and the people of Chennai.”\n\nAffirming the commitment of The Hindu Lit for Life as a platform for free speech and free expression, Dr. Lakshman said: “I believe that festivals such as these must always be forums where such freedoms are upheld and defended.”\n\nAwards presented\n\nThe Hindu Young World-Goodbooks Awards 2016, the first Indian awards to promote excellence in Indian children’s books, was also presented. Sujatha Padmanabhan received the best picture book-story award for Bumboo…The Donkey Who Would Not Budge , published by Eklavya last year. Prabha Mallya bagged the award for the best picture book illustrations for The Alphabet of Animals and Birds published by Red Turtle in 2014. Venita Coelho received the award for the best book-fiction for Dead as a Dodo , published by Hachette in 2015.\n\nVishakha Chanchani emerged the winner in the non-fiction category for The House That Sonabai Built , published by Tulika, 2014.\n\nThe festival is being held at Sir Mutha Venkatasubbarao Concert Hall and for details of today’s programmes go to www.thehindulfl.com .", 
    "section": "national", 
    "title": "A lively forum for authors, book lovers", 
    "subsection": "general", 
    "date": "2016-01-17"
}