{
    "author": [
        "Smita Gupta"
    ], 
    "text": "In the wake of the Congress’s success in last year’s Assembly elections in Bihar, thanks to the formation of an anti-BJP Grand Coalition in that State, there appears to be some softening on the subject in the party about the possibility of similar formations elsewhere.\n\nIf a statement late last month by DMK president M.Karunanidhi that the alliance to be forged by the party for the 2016 Assembly polls will include the Congress was on expected lines, the latter’s giving serious thought to forging an understanding with other parties ahead of elections in Assam later this year and in Punjab in early 2017 is not that usual: after all, unlike in Tamil Nadu where the Congress ceased to be one of the two principal poles in the State almost half a century ago, in Assam and Punjab, as of now, it is still a major player. In Assam, it has been in power for 15 years; in Punjab, it has been out of power for almost nine years now.\n\nSo, while Mr. Karunanidhi’s statement is expected to revive the nearly decade-long relationship between the DMK and the Congress that ended just before the 2014 Lok Sabha polls over difference of opinion on the Sri Lankan Tamil issue, if similar arrangements are made in Assam and Punjab, it will be a new experience for the Congress, triggered off by the need to remain politically relevant.\n\nIn Punjab, for instance, the Congress has not just tied up with the People’s Party of Punjab (PPP) that is headed by Manpreet Singh Badal, an estranged nephew of Chief Minister Parkash Singh Badal, and a former Finance Minister, senior Congress sources told The Hindu that the party was also thinking of including the Shiromani Akali Dal (Barnala) faction in a broader alliance.\n\nIf both these parties, the PPP and the SAD(B) are small parties, the Congress feels it needs to mop up all the extra votes it can to take on the Aam Aadmi Party that has emerged as a powerful contender in the state. The ruling Shiromani Akali Dal -BJP alliance seems to be in decline.\n\nPolitical sources point out that in 2011, when Mr.Manpreet Badal had broken away from the SAD ahead of the last Assembly elections in Punjab with an objective similar to that of AAP— to promote an alternative brand of politics. But the party he floated failed to make any impact, even losing his own seat. He, however, played a spoiler for the Congress by polling over 6 per cent of the votes – considered Congress votes – ending up providing another term to the SAD-BJP combine.\n\nThe Congress, therefore, does not want to take chances this time: indeed, party PCC chief Amarinder Singh said recently that though the party was in a very strong position to get a comfortable majority of its own, it was still open to alliances with the likeminded parties to ensure that the secular and progressive vote against the SAD-BJP alliance did not divide. He said that the Bihar experiment had proved to be very successful and there was no harm in trying a similar arrangement in Punjab, too.\n\nMeanwhile, in Assam, the State unit of the Congress is opposing a proposed alliance with the AIUDF and AGP, while the central leadership is pushing for it. Now two compromises are being thought of: not seat-sharing but seat adjustment or else a post-poll arrangement if the Congress can emerge as the single largest party.", 
    "section": "national", 
    "title": "After Bihar, Cong. open to the idea of grand alliances", 
    "subsection": "general", 
    "date": "2016-01-17"
}