{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "With a year left for the crucial Uttar Pradesh Assembly elections, the BJP is attempting to reach out to the most backward castes among the Other Backward Classes in the State.\n\nThe party’s OBC wing has planned to take out rallies to mobilise the numerous but individually small castes, which collectively constitute a large chunk of the population. However, these castes are not politically well organised. Even socially, they are splintered and do not act as a bloc. The party’s attempt at carving out a vote bank from among the most backward castes, however, failed in the Bihar elections.\n\n“We will demand that there be a most backward caste category in the State so that the dominant among the OBCs are stopped from cornering all benefits of quotas,” the party’s OBC morcha chief, S.P. Singh Baghel, told The Hindu . “The Karpoori Thakur and Rajnath Singh formula should be implemented in Uttar Pradesh.”\n\nThis means the splitting of the OBC category into two sections — the backward and the most backward — so that the most vulnerable would not have to compete with the relatively advanced OBC castes.\n\nPolitically, it is an attempt to wean away the most backward castes from the Samajwadi Party and the Bahujan Samaj Party, with which they are believed to have gone in large numbers in 2007.\n\nThe BJP plans to focus on the most backward castes while appointing the district presidents of the morcha in the State. This will take a while, however, as the State head of the morcha will be appointed first in consultation with the new BJP State chief, who will be elected any day now.\n\nOBC morcha functionaries say the party will be eyeing castes such as Kushwahas, Baghels, Kurmis, Gujjars, Naais, Darzis, Telis, Chaurasiyas, Vishwakarmas, Lohars and Sunars.\n\nThe BJP counts on the support of its core upper caste vote, which adds up to 20 per cent in the State as per the caste census in 1931. To this, the party has sought to add non-Yadav OBCs, who it believes are looking for greener pastures as they can play only a secondary role to Yadavs in the Samajwadi Party.\n\nAs for Dalits, they have the support of a powerful party in the BSP and are unlikely to take to the BJP at the State level.\n\n“The BJP’s success in the early 1990s was because of upper castes plus a chunk of non-Yadav OBCs because of Kalyan Singh, who belonged to the OBC Lodh caste,” a BJP leader said.\n\nThe party, however, is organisationally weak in the State, which means such social engineering is not going to be easy. Mr. Baghel said that he had some other key demands: removing the OBC creamy layer so that an OBC person may get quotas at any income level; release of caste census data and providing constitutional status to the OBC Commission.\n\nThese demands, however, may not find favour with the government, observers say, as the BJP would not want to be seen as going too far ahead on the path of backward caste politics so as not to alienate its upper caste support base.\n\nThe OBC card apart, the party is looking to reach out to the rural population as the ‘champion’ of agrarian classes. The BJP Kisan (farmers’) Morcha plans to hold rallies to market the government’s crop insurance scheme among farmers, many of whom are also OBCs.\n\nTraditionally, the BJP has been stronger in urban areas than in villages, an inadequacy it wants to address after being trounced in predominantly rural Bihar.\n\nThese castes aren’t politically well organised. Even socially, they are splintered", 
    "section": "national", 
    "title": "BJP seeks to mobilise most backward castes in U.P.", 
    "subsection": "general", 
    "date": "2016-01-17"
}