{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An anti-corruption court here on Saturday ordered the Vigilance and Anti-Corruption Bureau (VACB) to produce the case diary pertaining to the bar licence renewal bribery case.\n\nIt accorded time for the complainants till February 16 to state their objection to the vigilance report that cleared the accused, former Finance Minister K.M. Mani, of all charges in the politically contentious graft case.\n\nWriter and social activist Sarah Joseph filed the first objection petition stating that the VACB’s further investigation in the case “ was a single-minded exercise to prove the innocence of the accused (K.M. Mani) who is a political leader, coalition partner of the ruling party and, till recently, a Minister.” Leader of the Opposition V.S. Achuthanandan was expected to file his petition soon.\n\nMs. Sarah stated that the investigating officer had sought no fresh evidence in the case. He found no new witnesses nor did he reverify the statements of existing ones.\n\nThere was no new effort to establish facts. No further searches, raids or seizures were conducted. Instead, the office picked holes in the evidence available on record in a ‘‘determined manner.’’\n\nStill, the officer had ‘‘not been able to shake away’’ the suspicion that there was a corrupt motive in Mr. Mani's suggestion at the Cabinet meeting on March 26, 2014, to postpone the decision on renewal of licences of non-standard bars until April 2, 2014.\n\nMs. Joseph said Mr. Mani's action was just one of the many instances where rules and procedures and red tape were used as a pretext to extorting money by those in government. Instead of bolstering the available evidence, the officer had endeavoured to discredit the very same evidence he had painfully collected earlier to justify the registration of the graft case against Mr. Mani.\n\nHe had attempted it through “a smart jugglery of call data records of mobile phones of key participants in the episode,” she said.\n\nMs. Joseph demanded that the court reject the report and frame charges against Mr. Mani. Her objection petition is the first of many the court will consider in the coming days. It will hear the case again on February 26.\n\nComplainants get time till February 16 to file their objections to the Vigilance report", 
    "section": "national", 
    "title": "Court seeks case diary in Kerala bar bribery case", 
    "subsection": "general", 
    "date": "2016-01-17"
}