{
    "author": [
        "Cara Buckley"
    ], 
    "text": "The Australian director said he did not expect how Charlize Theron, who plays Furiosa, was able to bring all she had to do the role in the dystopian action thriller.\n\nOne of the surprise hits in the awards race has been Mad Max: Fury Road , which landed 10 Oscar nominations on Thursday, including best picture and best director. The film’s momentum was one of the many unexpected turns of this season: A sequel to a sequel to a sequel, Fury Road seemed too much a genre flick, and for a good while Oscar watchers didn’t consider it a contender. (Shows how much we know.)\n\nThe enviably fashionable Aussie director, George Miller — that hair! those glasses! — talked about why the Furiosa character had to be a woman, his mild alarm about the proliferation of Mad Max tattoos, and Mel Gibson.\n\nThe film is doing so well with awards. Who would have thunk it?\n\nPerfectly put. Who would have thunk it? Seriously the film was like last year, May, and I did not imagine I’d be back here talking about it, which is fine, you know, which is good. When you’re in these award seasons and people have responded to the film in a positive way, then you say, “OK. I’ll enjoy the party as long as it lasts.”\n\nI tongue-in-cheek wrote once that it should be called Mad Max: Furiosa Road .\n\nThat’s good, yeah. The very, very first sort of germinating idea of the story was to be a continuous chase and to see how much we could pick up that. The so-called McGuffin, the thing that everyone is struggling over, came down to five wives who were basically the breeding stock, as it were, to a decaying warlord. They needed a road warrior. It had to be female.\n\nIt had to be female?\n\nIt had to be female because if it was male, it’s a male stealing the wives of another male. That’s a different story. What I didn’t expect was how Charlize (Theron, who plays Furiosa) was able to take it and bring all she had to it, such that people, you know, are getting tattoos. It’s kind of scary as a storyteller. A couple times I’ve been stopped in the streets where people say, ‘Can I show you my tattoo?’ And these are young people and they’ve got tattoos of characters.\n\nDo you tell them, “That was a terrible idea?”\n\nI didn’t. I just said, “Oh, that’s a beautiful tattoo.” And if it’s a great tattoo, I’m very impressed. But I just think, you know, next year people might have completely forgotten about it.\n\nDo you know if Mel Gibson has seen the film or talked to him about it?\n\nThe first time I saw the film publicly it was the premiere in Los Angeles, back in early May, and Mel was there, and he was sitting next to me during the screening.\n\nWere you expecting that?\n\nI didn’t expect that. We sat together, and Tom (Hardy, who plays Max) was behind us, and I knew he got into the movie because he started digging me in the ribs. As the movie went on I realised he was enjoying it and paid the film a lot of respect and it was great.\n\nDid he wish he was in it?\n\nNo, I think that moment had gone long, long, before. We were going to be doing it back in the early 2000s and then nothing went right there and then he hit all the turbulence in his life. — New York Times News Service", 
    "section": "national", 
    "title": "George Miller on Mad Max: Fury Road and Furiosa Tattoos", 
    "subsection": "general", 
    "date": "2016-01-17"
}