{
    "author": [
        "Afshan Yasmeen"
    ], 
    "text": "Union Minister for Consumer Affairs Ram Vilas Paswan with Minister of State for Food and Civil Supplies Dinesh Gundu Rao (left) and Department of Consumer Affairs special secretaryG. Gurucharan in Bengaluru on Saturday.- Photo: K. MURALI KUMAR\n\nGiving a clear indication that the country will have to depend on import of pulses this year too, Union Food and Consumer Affairs Minister Ram Vilas Paswan on Saturday said that measures were already being initiated to meet the demand of pulses through imports.\n\n“This is because of the huge gap between the demand and supply,” he said, speaking to reporters on the sidelines of the Southern Regional Consultation on Consumer Protection organised by the Union Ministry of Consumer Affairs in the city.\n\nThe Minister said except for pulses, the government was able to manage the price rise of all other commodities.\n\nLast year, the production of pulses was 172 lakh tonnes as against the demand for 226 lakh tonnes.\n\n“Although we had imported 45 lakh tonnes, there was a shortfall of 11 lakh tonnes. This year our production may be a little more, may be around 175 lakh tonnes. But our demand will also be a little more, around 235 lakh tonnes,” he said.\n\n“Unless our production is increased the problem will remain. We have to solve this only through imports,” he said adding that the government had already started initiating measures to expedite the process of importing pulses.\n\n“We have asked the Commerce Ministry to grant permissions at the earliest for imports. We have also had discussions with the Agriculture Ministry as the issue needs to be tackled collectively,” the Minister said.\n\nPrice control measures\n\nTo ensure essential commodities are available to the common man at reasonable prices, the Centre has asked all State governments to step up price control measures.", 
    "section": "national", 
    "title": "Import of pulses inevitable this year too, says Paswan", 
    "subsection": "general", 
    "date": "2016-01-17"
}