{
    "author": [
        "Rukmini S"
    ], 
    "text": "Sunita and Mohammed are the most common names of adults in Delhi, an analysis of data from voter lists has shown.\n\nThe city has 99,273 Sunitas (and an additional 2,265 Suneetas) and 1.61 lakh Mohammeds (and a total of over 2.5 lakh men named versions of Mohammed), the numbers show.\n\nSunita is a distinctly younger name; it does not figure among the top 10 names for women aged 55 and above, but is the most popular among women aged 30 to 50.\n\nAmong women aged 18 to 30, Pooja is the most common name.\n\nRam is the most popular name among men aged 40 and above, while Mohd is the most common among those aged 18 to 40.\n\nThis analysis of names is based on data on first names and ages extracted by SocialCops, a data analytics start-up, from Delhi’s electoral rolls.\n\nThe data covering 1.2 crore registered voters in the city were shared exclusively with The Hindu for the analysis, which showed the changing nature of naming conventions as well as the changing face of the city.\n\nAmong older women, distinctly Punjabi names such as Santosh and Kamlesh are more common, while Monika, unheard-of two generations ago, is the 10th most popular name among women aged 18 to 25.\n\nInitials as first names and religious names — Hari, Om and Jagdish, for instance — are most common among older men, while Rahul, Rohit and Amit are popular names for younger men.\n\nThe lack of a traditional culture of first names and last names, unlike in the West, poses unique challenges both to citizens and authorities.\n\nMuslim men, for example, routinely use “Mohammed” as a prefix, which becomes their first name in government forms, leading to the high number of Mohammeds in Delhi.\n\nMohammed Aslam (80), a retired Assistant Commissioner of Customs, who lives in Preet Vihar, though originally from the Jamia Masjid area, describes himself as a “Pakka Dilliwalla” (quintessential Delhiite).\n\nMr. Aslam writes “Mohammed” as his first name and “Aslam” as his last name in government forms, though Aslam is the name friends and family know him by. His father was M. Yamin, and his sons are M. Rehan Aslam and M. Salman Aslam, the M standing for “Mohammed”.\n\nIn addition to the challenges posed by complicated naming conventions across the country, Election Commission officials frequently err while entering details, former Election Commissioner S.Y. Quraishi says.\n\nMr. Quraishi uses the expanded form of his initials, Shahabuddin Yakub, as his first name on his voter ID card, because he is known more commonly by those. His son-in-law’s name has been incorrectly entered on his voter ID card.\n\nVisit thehindu.com/data to search for your name.\n\nSunita is a younger name as it is the most popular among women aged 30 to 50", 
    "section": "national", 
    "title": "In Delhi, high chance of meeting a Mohammed or a Sunita", 
    "subsection": "general", 
    "date": "2016-01-17"
}