{
    "author": [], 
    "text": "Taking on the government on multiple fronts, he blamed it for the logjam in Parliament over reforms. He said it had turned national security into an “event-like” exercise.\n\n“The government does not believe in a conversation. They don’t want it [solution to the logjam in reforms]. There is a compromise sitting on the table on both GST and Land Bill, but the government is not taking it,” he said.\n\nHe blamed the government and the Rashtriya Swayamsevak Sangh for imposing a “rigid version” of India on the country, without any discussion or deliberation. The vision, he said, differentiates between people on the basis of their faith and religion. “The ruling dispensation, particularly the RSS, has very clear ideas of what the world should look like in their mind. But this country requires flexibility, openness, movement of ideas to succeed,” he said.\n\nMr. Gandhi took a range of questions from those on the Indian agrarian crisis to the scandal in cricket administration and board. While some students felt a management institute was not the right platform to talk politics and intolerance, others felt satisfied with Mr. Gandhi’s choice of subjects.\n\n“He is a much better speaker than what he is made out to be by social media trolls. However, we expected him to bring here his Ivy League experience on business and markets rather than talk of RSS, BJP and intolerance. It was somehow out of place to talk of all that in this setting,” said Geet Aman, a first year management student.\n\nOthers felt intolerance was certainly an issue that needed some deliberation. “I have travelled across the country a lot in the past few months as part of my job, and feel intolerance is certainly an issue in rural areas. That sentiment may not strike a chord in an urban setting within the four walls of a management institute like ours, but it is certainly something that needs to be reflected on,” said another first year student, Rohan Sharma.\n\nCongress leaders was relieved that the event went on without awkward moments such as those reported during his previous interaction at Mount Carmel College, Bengaluru. “That (Mount Carmel controversy) was promoted as part of a malicious agenda by our opponents. Today, he spoke really well on a range of issues, especially his views on start-ups were intriguing and all around,” Mohan Prakash, Maharashtra in-charge, All India Congress Committee, told The Hindu.\n\nMr. Gandhi later took out a five-km march from Bandra to Dharavi in protest against the increase in power tariff. Along with Mumbai Region Congress Committee president Sanjay Nirupam and former MP Priya Dutt, he accepted garlands and greetings from people. Mr. Gandhi has said the march was to pressure the government to limit the power tariff increase.", 
    "section": "national", 
    "title": "“Intolerance, start-ups can’t go together”", 
    "subsection": "general", 
    "date": "2016-01-17"
}