{
    "author": [], 
    "text": "Arun Jaitley says the Centre wants to ensure that the role of the state is that of a facilitator.— PHOTO: AFP\n\nWhile a three-year investment in an unlisted company attracted a long-term capital gain tax of 20 per cent, holdings of equity shares in listed firms for one year were exempt from such a levy, Mr. Adhia said. “Now this gap is too wide … I can assure you of this gap being bridged at the time of the budget …The point is, if somebody is making hot investment in equity market, if he keeps it for one year, after one year, there is zero capital gain … As compared to that, people who have been taking the risk of putting long-term equity investment in unlisted security, like in case of a start-up, they have to pay 20 per cent even after three years.”\n\nHe hinted at further tax incentives aimed at encouraging the start-up ecosystem, such as rationalised service tax rules, in the budget.\n\n“Start-up India will be the final break with the licence raj ... Freedom will be given to the sector from the State,” Mr. Jaitley said.\n\nThe Minister said he was not familiar with most of the participants at the conference, and it was the first time that those other than the “usual suspects” were attending such a meeting. Since May 2014, when Prime Minister Narendra Modi was elected to office, the traffic of industry visiting North Block, where the Finance Ministry office functions, had ended. He said the government aimed to ensure that the role of the State became that of a facilitator.\n\nAt a panel discussion at the launch, Economic Affairs Secretary Shaktikanta Das said the Start-up India mission would be a game changer for India by channelling investments and facilitating job creation.\n\nHe said starting a company in India was akin to entering the mythical “Chakravyuh” as “it is easier to get in than to get out”. The Finance Ministry was in discussions with the Reserve Bank for online filing of returns under the Foreign Exchange Management Act, Mr. Das said. “You will see very quick action on that which will facilitate online filing of returns.”\n\nMr. Jaitley said the government and the Reserve Bank would shore up the lending capacity of banks over the next few months. “The Reserve Bank and the government, acting in tandem, are going to add to bankers’ ability to lend with vigour and in greater amounts,” he said.\n\nHe said credit growth was critical to boosting India’s sluggish economic growth, but had remained subdued, with banks struggling with crippling bad debts and insufficient capital. For that, the government and the RBI were planning to take measures to add to banks’ lending capacity.\n\nOn the global economy, Mr. Jaitley said it had unquestionably slowed down and “We can take limited satisfaction that even in a crisis-like situation in the world, we are growing much faster”.", 
    "section": "national", 
    "title": "Jaitley promises a friendly tax regime", 
    "subsection": "general", 
    "date": "2016-01-17"
}