{
    "author": [], 
    "text": "Prime Minister Narendra Modi during an interaction with entrepreneurs at the launch of the Start-up India mission in New Delhi on Saturday.— Photo: Shanker Chakravarty\n\nPromising easier access to more finance for budding entrepreneurs through a Rs. 2,500-crore fund of funds annually over the next four years, Mr. Modi said Finance Minister Arun Jaitley would address the taxation issues that plagued start-ups, including the tax on investments in start-ups by domestic angel and venture capital funds in the upcoming Budget. “There will be tax incentives for government-recognised funds and they would be exempted from capital gains. The issue of fair market valuation and tax on investments would also be resolved,” Mr. Modi said.\n\nA tax is currently levied on all funding provided by domestic angel and venture capital funds to start-ups, with income tax authorities having the power to determine the valuation at which such investments are made on the basis of a “fair market value”.\n\nIndustry had sought a review of this provision as it could lead to several tax disputes as start-up valuations are often subjective and linked to the power of an idea, rather than traditional valuation methods based on cash flows. These taxes are not levied on foreign financiers who account for over 90 per cent of funding for Indian start-ups. “If someone invests the gains from the sale of property into their own business, it will be exempt from capital gains tax,” Mr. Modi said.\n\nHe announced a moratorium on income tax payments on start-up profits and labour law inspections for the first three years of operations, and said compliance with nine environment and labour laws would be allowed on the basis of self-certification.\n\nCalling upon youth to attempt solving some of India’s unique problems — such as making health care easily affordable or improving farm supply chains so that fruits and crops do not rot —, the Prime Minister said that India had millions of problems, but over a billion minds that could solve them. “Intellectual property is the main asset of new ventures, but sometimes it takes months to process a patent application. We need to merge our Youth Property with IP, so we will fast-track such patents and give start-ups an 80 per cent rebate on the fees, while bearing the entire cost for facilitating quicker clearances,” Mr. Modi said.", 
    "section": "national", 
    "title": "Liberal start-up ecosystem unveiled", 
    "subsection": "general", 
    "date": "2016-01-17"
}