{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "The cyber police station has registered an FIR in connection with the leakage of a copy of recently released Marathi movie Natasamrat , and has initiated investigations into the matter.\n\nNatasamrat , adaptation of the play by the same name by Marathi writer V.V. Shirvadkar alias Kusumagraj, released in cinemas on January 1.\n\nThe movie is jointly produced by Vishwas Joshi and actor Nana Patekar, who stars in the title role, and is directed by Mahesh Manjrekar.\n\nAccording to police, Mr. Joshi approached the cyber police station on Thursday and submitted a complaint about the film being leaked online.\n\nAfter conducting preliminary inquiries into the matter, the police registered a criminal case.\n\n“We found during our investigations that a link to the movie had been shared on a video sharing website. We have registered an FIR under the Information Technology Act and the Copyright Act,” said Deputy Commissioner of Police (Cyber) M. Rajkumar.\n\nMr. Rajkumar added that Mr. Joshi, in his complaint, had not expressed suspicion against anyone.\n\n“The FIR has been filed against unknown persons and further inquires are under way,” he said.\n\nThe police said that what makes the case a serious one is that the leaked version is not of ‘camrip’ quality — in which a movie is recorded using a hidden camera while it is playing and leaked online. The fact that a better quality print of the movie has been uploaded suggests that it could be one of the limited number of people who have access to such a print, said officials.\n\nThe police are now contacting the administrators of the video sharing website.\n\nThey are simultaneously compiling a list of people who had access to the movie print before it could be released as a DVD version, sources said.", 
    "section": "national", 
    "title": "Marathi movie leaked online, FIR filed", 
    "subsection": "general", 
    "date": "2016-01-17"
}