{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Australian Army chief stresses importance of freedom of the seas, respect for the international law\n\nUnderscoring the importance of multilateral cooperation for stability and peace in the Indian Ocean region, Australian Army Chief Lt. Gen. Angus Campbell says Malabar naval exercises are among a spate of opportunities in that regard.\n\nAustralia, which held its first bilateral naval exercise with the Indian Navy last year, has been long keen on joining the Malabar exercises along with the U.S. and Japan.\n\n“Malabar is an example where there is opportunity to build but not in a directed or specific problematic part but one that is more comfortable for the two nations … It is part of a spate of opportunities,” Lt. Gen. Campbell said in an interview to The Hindu .\n\nThe India-U.S. Malabar naval exercises, which began in 1992, have grown in scope and complexity, acquiring geopolitical significance in recent times. The bilateral format gave way to a trilateral one with inclusion of Japan as a permanent member in 2015.\n\nIn 2007, Australia joined the other three in a quadrilateral format for the exercises, but based severe criticism from China which saw it as a containment strategy.\n\nSpeaking separately to The Hindu , the outgoing Australian High Commissioner in India, Patrick Suckling, expressed interest in being part of Malabar, but said: “But that wouldn’t be the same as resurrecting that idea of four democracies doing what they had planned in 2007.”\n\nHowever, clarifying that it was not directed at anyone, Lt. Gen. Campbell reiterated that it was Australia’s position that discussion, negotiations and in some circumstances where appropriate, “arbitration of what might the interest of multiple parties should be considered and where that occurs that is the best pathway to reduce tensions and to build understanding”.\n\nThe statement is important in the backdrop of the Philippines taking China to the International Court of Arbitration over disputed islands in the South China Sea. China has, however, rejected it, saying the international tribunal has no jurisdiction over the matter.\n\nTrading nations\n\nEmphasising that both India and Australia are “maritime trading nations”, Lt. Gen. Campbell said that what that meant was the importance of the freedom of the seas and respect for the international law and the rule of law.\n\n“Those basic principles are important for both our countries and in that regard, we are both keen on working across with many partners to ensure that the security setting in this region does not deteriorate or present a challenge to the security, prosperity and stability of the people of the region.”\n\nChina, which claims the part of the South China Sea up to the nine dash line as its own, has been reclaiming reefs in the region at a rapid pace. Recently, it landed civilian planes on a 3,000-metre airstrip on the Fiery Cross reef raising concern that fighter jets could follow next.\n\nLt. Gen. Campbell said that with growing prosperity, there was an increasing trend of military modernisation across Asia as was evident with India, China, Indonesia and others.\n\n“Where countries are growing and where peoples’ prosperity is developing and that growth is engaged with partnership and dialogue that is very good,” he said adding that concerns arose where action was taken unilaterally or in a non-cooperating way.\n\n“Both our nations seek to understand our security concerns by looking at the constructive security arrangements and the strategic settings across the India-Pacific oceans,” Lt. Gen. Campbell added.\n\nLt. Gen. Campbell is in India on the invitation of the Chief of the Army Staff, Dalbir Singh, and held discussions with the three services “to establish the right framework relationship” to deepen military cooperation.\n\nEarlier this month, on a visit to Delhi, Admiral Scott Swift, the U.S. Pacific Fleet Commander, expressed concern at the lack of transparency on the Chinese motives for military expansion.\n\nWelcoming India’s greater role in the region, Lt. Gen. Campbell said it was for India to decide its role.", 
    "section": "national", 
    "title": "‘Naval exercises will strengthen ties’", 
    "subsection": "general", 
    "date": "2016-01-17"
}