{
    "author": [], 
    "text": "The latest set of witness statements released by a UK-based website set up to unravel the mystery surrounding Netaji Subhas Chandra Bose’s disappearance seem to confirm that the freedom fighter died as a result of a plane crash in Taiwan.\n\nFive witnesses, which include Netaji’s close associate, two Japanese doctors, an interpreter and a Taiwanese nurse, have been quoted as corroborating that the founder of the Indian National Army (INA) died on 18 August 1945 following a plane crash on the outskirts of an airfield in Taipei.\n\n“There are no two opinions between the five witnesses about the fact that Bose’s end came on the night of 18 August 1945,” www.bosefiles.info said in a statement.\n\nColonel Habibur Rehman Khan, Bose’s aide-de-camp who was with him on the fateful day and survived the crash, submitted a statement written and signed on August 24, 1945 — six days after the crash confirming Bose’s last words to him.\n\n“Prior to his death he [Bose] told me that his end was near and asked me to convey a message from him to our countrymen to the following effect: ‘I have fought to the last for India’s independence and now am giving my life in the same attempt. Countrymen! Continue the independence fight. Before long India will be free. Long Live Azad Hind’,” the statement reads.\n\nIn September 1945, two intelligence teams from India led by police officers named Finney and Davis, went to Bangkok, Saigon and Taipei to investigate. They concluded Bose died as a result of the air tragedy. They seized a copy of a telegram from the Chief of Staff of the Japanese Southern Army to Hikari Kikan, a body set up to liaise between the Japanese government and Bose’s “Provisional government of Free India“.\n\nUsing the code “T” for Bose, the cable dated August 20, 1945 said: “T”, while on his way to the capital (Tokyo), as a result of an accident to his aircraft at Taihoku (Japanese name for Taipei) at 2 p.m. on the 18th was seriously injured and died at midnight on the same date.”\n\nBetween May and July of 1946, Lt. Col. J.G. Figgess of the British Army interrogated six Japanese officials in Tokyo in connection with the incident, including Japanese doctor Toyoshi Tsuruta, who was present at the Nanmon Military Hospital near the crash site, where Bose was admitted after the crash.\n\nDr. Tsuruta submitted to Figgess: “...Bose asked him in English if he would sit with him throughout the night. However, shortly after 7 p.m. he suffered a relapse and although the doctor once again administered a camphor injection he died shortly afterwards.” — PTI\n\nIn 1945, two intelligence teams concluded Bose died as a result of the air tragedy", 
    "section": "national", 
    "title": "‘Netaji died of injuries sustained in plane crash, witnesses said’", 
    "subsection": "general", 
    "date": "2016-01-17"
}