{
    "author": [
        "Special Correspondent"
    ], 
    "text": "He pioneered a groundbreaking technique known as optogenetics\n\nThe winner of the Life Sciences Breakthrough Prize for 2016, Karl Deisseroth, is the featured speaker of the Sixth Annual Cell Press-TNQ India Distinguished Lectureship Series.\n\nStanford University neuroscientist and psychiatrist Karl Deisseroth, who developed methods that have revolutionised our ability to visualise and manipulate brain circuits, will give lectures in Bengaluru, Chennai, and Delhi this month.\n\nDr. Deisseroth, who is the winner of the Life Sciences Breakthrough Prize for 2016, is the featured speaker of the Sixth Annual Cell Press-TNQ India Distinguished Lectureship Series, aimed at bringing internationally renowned scientists closer to the Indian scientific community. These lectures are free and open to all.\n\nOn January 18, he will deliver a lecture at the JN Tata Auditorium in Bengaluru; on January 20, at Sri Mutha Venkatasubba Rao Auditorium in Chennai; and on January 22, at the Jawaharlal Auditorium in the All India Institute of Medical Sciences in New Delhi.\n\nDr. Deisseroth pioneered a groundbreaking technique known as optogenetics — in which neurons in the brain are genetically engineered to express a light-sensitive protein that can change their electric properties. Light can then be used to switch neurons on or off in animals, allowing the mapping of neuronal networks that regulate behaviour and that are often disrupted in disorders such as autism or schizophrenia.\n\nMore recently, Dr. Deisseroth developed another important tool that allows high-resolution visualisation of brain circuits. Known as CLARITY (Clear Lipid-exchanged Anatomically Rigid Imaging/Immunostaining-compatible Tissue hYdrogel), the technique makes tissues transparent but leaves the cells and their connections intact. This allows an unprecedented view into the complex circuits that make up the brain.\n\nDr. Deisseroth is the D.H. Chen Professor of Bioengineering and of Psychiatry and Behavioral Sciences at Stanford University. He graduated in the biochemical sciences from Harvard University and went on to complete his MD and Ph.D. in neurosciences from Stanford University.\n\nThe Lectureship Series is co-sponsored by Cell Press, which publishes 34 highly cited journals featuring biomedical research and reviews, and TNQ, a publishing technology and services company focussed on scientific, technical and medical publishing.\n\nTo register online for the lectures, visit www.tnq.co.in/\n\nkarldeisseroth.html", 
    "section": "national", 
    "title": "Neuroscientist Karl Deisseroth to give lectures in India", 
    "subsection": "general", 
    "date": "2016-01-17"
}