{
    "author": [], 
    "text": "They live atop the Bonda hills in Odisha’s Malkangiri district, segregated from the mainstream and have rarely stepped out of their environs, so an invitation to attend this year’s Republic Day parade in the national capital was beyond their dreams.\n\nFor Dhabalu Sisa (41) and his wife Samari (46), a letter from Prime Minister Narendra Modi inviting them for the parade , changed everything and they have not stopped beaming since, an official of the Integrated Tribal Development Agency (ITDA) told PTI today.\n\nThe Bondas are members of the Particularly Vulnerable Tribal Group (PVTG).\n\nDhabalu and Samari reside in Bandiguda village under Mudulipada gram panchayat of Malkangiri district. The couple may be first from the community to go to Delhi and shake hands with President Pranab Mukherjee and Prime Minister Narendra Modi, the official said.\n\n“Meeting the President and Prime Minister is something we could not have imagined in life. We will use this opportunity to highlight our problems and how the tribe suffer due to the vagaries of nature,” said an elated Dhabalu.\n\nHe is younger than his wife Samari as Bonda community has the tradition of girls marrying boys less than their age.\n\nSamari, a mother of five children, one son and four daughters, said she would draw Mr. Modi’s attention on the poor road connectivity to the Bonda Hills. The couple have already started preparation for their traditional dress to suit the Republic Day celebration.\n\nNot just the Sisa couple, the whole village has been celebrating the invitation for one of its own with non-stop dance and music since the time they first heard about it.\n\n“I will accompany the Bonda couple to Delhi. As they do not understand any other language, I need to be by their side,” Ramakrushna Ganda, the project administrator of ITDA, told PTI.\n\nMr. Ganda said the couple would meet Chief Minister Naveen Patnaik before leaving for New Delhi.\n\nThe population of Bonda community is about 7,000. “Now, the State government has set up two high schools and a residential hostel for girls of bonda community students in Mudulipada area,” he said.\n\nMyth has it that the Bondas, who recently learnt use of clothes, believed that they were cursed by Goddess Sita, as they laughed at her while she was bathing in a kunda (pond) which is named as Sita Kunda at Bonda Hill. Since then, they have remained naked or semi-nude. — PTI\n\nThe tribal group is segregated from the mainstream and rarely stepped out of its environs", 
    "section": "national", 
    "title": "Odisha’s Bonda couple gets invite for R-Day parade", 
    "subsection": "general", 
    "date": "2016-01-17"
}