{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "There are at least two wars that India would rather forget and it’s about these and how their stories were written that formed a conversation on Saturday afternoon at The Hindu Lit for Life.\n\nThe difference however, said Raghu Karnad, author of Farthest Field , was that his book was about a war in which India was the victor — the Second World War, while Shiv Kunal Verma’s book 1962: The War that Wasn’t , was about a conflict in which India lost — the military engagement with China.\n\nModerated by veteran journalist Sashi Kumar, the conversation between the authors focussed on differences in writing styles, why these wars are preferably forgotten and the choices made by people that led to the wars. “It is difficult to overestimate how much we have forgotten about World War II,” said Mr. Karnad, explaining that Indians have been involved on three continents and helped turned the tide of the war.\n\nMr. Sashi Kumar’s point on the intersection of the independence struggle with the war had Mr. Karnad reflect that while a divide was writ largely in India — about not supporting the war until Independence was given — delving deep into the personalities of the people he had written about made him realise that the conflict seemed to reside deeply inside all of them.\n\nMr. Verma, on being asked about Nehru being the villain of the 1962 conflict, explained that the leader was very sympathetic towards China and that his own perception had been contradictory to what everyone was advising him. “He also had a deep distrust of the military and was very insecure about it.”\n\nOn the indignation apparent in the book, he said, “The story of 1962 is deliberately suppressed. Not only did we lose, we never fought.” He added that if the army had been given the right kind of capability, the war may not have happened at all.\n\nOn writing styles — didactic and straightforward of Mr. Verma’s and creative of Mr. Karnad’s, the latter said that while the style in which he wrote would never replace formal, methodical works, there needed to be both forms of writing. “My work is non fiction in the sense that it is not fiction. All the movements and anecdotes are factual. But I used forensic license. I integrated the personal stories and impressions I had of the characters in order to narrate the interior experiences. This was integral to the book.”", 
    "section": "national", 
    "title": "Of wars and words", 
    "subsection": "general", 
    "date": "2016-01-17"
}