{
    "author": [
        "Rajulapudi Srinivas"
    ], 
    "text": "Cash-counting machines, seating arrangements for ‘VIPs’ mark the event\n\nEven as the Supreme Court and the High Court of Andhra Pradesh and Telangana passed orders prohibiting cockfights during Sankranti in Andhra Pradesh, punters went ahead and staged fights in many villages. Efforts of the police to stop them were in vain.\n\nFollowing a Public Interest Litigation (PIL) petition, the courts banned cockfights and directed the government to prevent them. However, the locals conducted the event, in which thousands participated and cheered.\n\nMassive tents, makeshift hotels, juice stalls, biryani points, liquor shops, non-vegetarian snacks, and ice cream parlours were seen on the roadside in many villages adding pep to the event. Several participants arrived in posh cars from different places to witness the fights.\n\nRoosters brought from different States took part in the cockfights.\n\nTradition\n\n“Cockfights, like flying kites, organising bullock-cart races, decorating bulls and arranging ‘bogipallu’ for children, are part of our tradition,” said P. Suryanarayana of Kalidindi village in Krishna district.\n\nCockfights were widely organised in Krishna , East and West Godavari districts. The arrangements for the fights were elaborate. Organisers arranged cash counting machines and installed LED screens for the convenience of visitors.\n\n‘Muhurtams’ fixed\n\nPriests fixed ‘muhurtams’ for the fights depending on the feather colour, eyes, weight, height and date of birth of the rooster.\n\nSeating arrangements were made for “VIPs” in many places. In several villages, the fights were held day and night for three days. There was a heavy demand for the meat of roosters killed in the fight. A person who won the fight sold meat at Rs. 1,000 to Rs.1,200 per kg.\n\nCockfights led to clashes at a few places and about 10 persons suffered injuries at Krishnavaram village in Arigipalli mandal in Krishna district on Saturday. No police, revenue or excise department personnel were seen at the venues.", 
    "section": "national", 
    "title": "Punters defy court orders, organise cockfights in A.P.", 
    "subsection": "general", 
    "date": "2016-01-17"
}