{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "At literary meet, Pawar and Fadnavis tell litterateurs to keep off politics\n\nDays after his public apology for his remarks on Prime Minister Narendra Modi, noted litterateur Shripal Sabnis on Saturday launched a broadside against right-wing, fringe elements.\n\nDr. Sabnis was delivering the inaugural lecture at the 89th Akhil Bharatiya Marathi Sahitya Sammelan, Maharashtra’s biggest literary event, which began in Pimpri-Chinchwad on Friday.\n\nThe second day of the event also saw Nationalist Congress Party (NCP) chief Sharad Pawar and Maharashtra Chief Minister Devendra Fadnavis hurling veiled barbs at Dr. Sabnis.\n\nDr. Sabnis, who is president of the literary meet, targeted the fringe right-wing Sanatan Sanstha for stifling intellectual dissent in general and for its alleged role in the murder of rationalist-thinkers Narendra Dabholkar, Govind Pansare and M.M. Kalburgi in particular.\n\n‘Harmful propaganda’\n\n“The Sanstha’s pernicious activities and division of Maharashtra’s social fabric on caste lines has caused each saint to be identified by a particular caste. For instance, the Sanstha has attempted to spread such harmful propaganda like ‘Jnaneshwar was the saint of the Brahmins’, and ‘Tukaram belonged to the Marathas’... this is alarming propaganda,” alleged Dr. Sabnis, reading out from a 135-page speech in which he touched upon surging intolerance and communalism.\n\nThe author himself was embroiled in a raging controversy after describing Mr. Modi as “a man forever smeared with the taint of the 2002 Gujarat riots,” whom he would not endorse.\n\nDr. Sabnis’ remarks threatened the smooth conduct of the Sammelan, with both the BJP and the Sanatan Sanstha demanding that he recant his statement.\n\nDr. Sabnis also alleged that he received a death threat from the Sanstha’s top lawyer. Earlier this week, he was forced to retract his remarks after it became apparent that the BJP activists could disrupt the event.\n\nBoth Mr. Pawar and Mr. Fadnavis, in their speeches, said literary personalities should not “indulge in politics”.\n\n“While it is good news that someone of Dr. Sabnis’ capabilities is heading this meet, there needs to be a rethink on the process of election of the Sammelan president,” remarked the NCP strongman, in a rebuke to Dr. Sabnis.\n\nThe four-day literary meet got off to a grand start with a spellbinding display of literary pageantry manifested as a “granth dindi” (symbolic procession of books), attracting huge crowds on the H.A. grounds in Pimpri on Friday. More than 400 stalls have been put up.\n\nThe four-day meet got off to a\n\ngrand start with a colourful display of literary pageantry\n\nSabnis targeted right-wing Sanatan Sanstha for stifling in ulectual dissent in general and for the murders of rationalist-thinkers", 
    "section": "national", 
    "title": "Sabnis slams Sanatan Sanstha", 
    "subsection": "general", 
    "date": "2016-01-17"
}