{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Security meet discusses strategy to combat radicalisation of youth\n\nHome Minister Rajnath Singh at a meeting with officials of intelligence and investigating agencies and police departments of 13 States, in New Delhi on Saturday.— PHOTO: PTI\n\nInvestigating agencies are in the process of producing messages posted by individuals on Facebook, Twitter and other social media platforms as evidence in court against those arrested for supporting or joining the Islamic State (IS) or any other terrorist outfit, a senior government official said.\n\nOn Saturday, Union Home Minister Rajnath Singh met top officials of Central intelligence and investigative agencies and police forces of 13 States to discuss the influence of the IS in India.\n\nAccording to agencies, 25 Indians have so far travelled to Syria or Iraq to fight for the IS.\n\nThe government has developed a blueprint on the social media strategy against the IS for effective monitoring of the Internet and the dark Web, the hotspot of recruitment by the terrorist outfit.\n\n“So that a case ends in conviction in court, we will use the messages exchanged by an individual on social media websites as well as through his or her e-mails, which reflects his or her inclination towards terrorist outfits like IS as evidence in the court of law,” the official said.\n\nConcerned over the growing influence of the IS in neighbouring countries such as Pakistan, Bangladesh and even the Maldives, the Union Home Ministry has decided to use the existing provisions under the Mutual Legal Assistance Treaty (MLAT) to seek information about the terrorist outfit. The importance of legal cooperation with West Asian countries was highlighted as India received excellent cooperation from the UAE regarding the arrest of Afsha Jabeen, who was deported here and arrested for propagating and recruiting young men on behalf of the IS.\n\n“The influence of the IS in the Khorasan province of the Afghanistan-Pakistan region was a cause of concern; so was its influence in Bangladesh, with which we share a porous border. We have an open visa regime with the Maldives, a country where many youngsters have travelled to Syria to join the IS. It was felt that a careful watch must be kept on young Indians, particularly from the southern States who travel there for work,” a senior government official said.\n\nMr. Singh held the meeting to review the situation arising out of some Indian youths getting attracted towards the IS and how to deal with the emerging challenge.", 
    "section": "national", 
    "title": "Social media posts to be used as evidence in cases", 
    "subsection": "general", 
    "date": "2016-01-17"
}