{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "Defence Minister Manohar Parrikar (centre) with Minister of State for Information and Broadcasting Rajyavardhan Singh Rathore at an Army recruitment rally at Amber Kunda village in Jaipur on Saturday.— PHOTO: PTI\n\nDefence Minister Manohar Parrikar on Saturday said steps were being taken to prevent honey trap cases and officials falling prey to the traps.\n\nRecently, former Air Force technician Ranjith K.K. was arrested for supplying secret information to intelligence agencies across the border.\n\nRanjith passed on secret information to one Damini McNaught, a suspected intelligence operative, who posed as a British journalist on Facebook.\n\n“There needs to be public alertness about Facebook and its dangers and how one could be trapped. Information about this must be propagated in the Army. We have given instructions about such dangers,” Mr. Parikkar said.\n\n“If the Commanding Officer of a unit is alert then such cases can be noticed, so we’ve given instructions that the alertness must be increased,” he said. “The pain that my country and I have borne must be returned to the attackers,” Mr. Parrikar said, while speaking on the recent attack on the Pathankot airbase.\n\nClarifying that it was his personal opinion, Mr. Parrikar said, “I have lost seven of my men [in the Pathankot attack]. We [the agencies concerned] are aware of what is required to be done. You must keep your trust [in us] and you shall see the results.”\n\n“We shall see to it that such incidents [like Pathankot] must not happen again. We, as a country, cannot bear [such attacks] anymore. The ability of the country to bear [such attacks] is over,” he said. Among the actions to be taken as “lessons from the Pathankot attack” are the primary and security audits of the airbase and military stations.", 
    "section": "national", 
    "title": "Steps being taken to prevent honey traps: Parrikar", 
    "subsection": "general", 
    "date": "2016-01-17"
}