{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Cow slaughter issue being misused to ‘communalise’ our image, says Tauseef Ahmad\n\nA group of people wants to drag our family into some controversy or the other, alleges Tauseef Ahmad, father of Mohammed Shami.— File photo: PTI\n\nMohammad Haseeb, elder brother of Indian pacer Mohammad Shami, never thought his curiosity would land him in jail. Last Thursday, when he heard some noise in his vicinity, he went to find out what it was about. At the end of the day, he was arrested by the Amroha police on charges of “forcing” policemen to release a few men who were allegedly detained on charges of cow slaughter. He was later released on bail.\n\nHaseeb claimed that the charges were “fabricated” while his father Tauseef Ahmad alleged that the emotive issue of cow slaughter was being misused to “target” his family. Mr. Ahmad alleged witch-hunting in the name of “cow slaughter” even as a Muslim couple claimed they were harassed in Madhya Pradesh over the issue of beef on Friday.\n\nHaseeb said the police registered a case against him under the influence of a local group. “I went there much after the police arrived to arrest some alleged cow slaughterers. Later I was told, much to my shock, that I had fought with the police and got a few of them released,” Haseeb told The Hindu on phone from Amroha.\n\nHaseeb’s father said his family has become a “target of conspiracies” since his son Mohammad Shami started playing for India. “Since Shami started playing for India, a group of people has wanted to drag our family into some controversy or the other by hook or by crook,” Mr. Tauseef said. He said the cow slaughter allegation was created to finish the goodwill his family members enjoyed locally and to “communalise” their image.\n\n“Those who don’t want a family from our background to enjoy the goodwill people have towards us, finally used the issue thinking it would work,” he added. He said he had complained to the District Magistrate of Amroha last month about attempts by some to target his family.\n\nVed Prakash, District Magistrate of Amroha, confirmed that Mr. Tauseef met him a month ago to complain about threats to his family. “He met me last month with a complaint that he was being threatened on phone by somebody. But he did not tell me who it was,” he added.\n\nAccording to the FIR against Haseeb, he was involved in a scuffle with local policemen when they were taking an alleged cow slaughterer Mohammad Rizwan in a police vehicle.\n\nPraveen Kumar, the Station House Officer of Didoli police station in Amroha, told The Hindu that Haseeb stopped the vehicle. “Because of the fight with Haseeb, the culprit fled from the scene. We arrested Haseeb and filed a case against him under Section 147 (rioting), 153 (promoting enmity between different groups), 332 (voluntarily causing hurt to deter a public servant from doing his duty) and other Sections of the IPC.\n\nMohammad Shami’s father claims cow slaughter issue being misused to “communalise” his kin’s image", 
    "section": "national", 
    "title": "‘Targeted since Shami began playing for India’", 
    "subsection": "general", 
    "date": "2016-01-17"
}