{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In nine crisp points, Member of Parliament and writer Shashi Tharoor laid out the reasons why we need to think beyond world leadership and towards cooperative relationships in an increasingly networked world.\n\nSpeaking at The Hindu ’s Lit for Life on Saturday evening at the Sir Mutha Venkatasubba Rao Concert Hall in Chetpet, Mr. Tharoor’s speech focussed on globalisation, the paradoxes at the heart of it and the importance of mass media. He also touched upon how the new networked world has seen a rise of old problems.\n\n“There is no escaping globalisation,” he said, explaining how issues that once seemed far away were now in our backyards, adding that the choices we make — what we buy and who we vote for, for instance — could affect the world. On the paradoxes this has thrown up, he said the forces of convergence were also bringing in forces of disruption — terrorism and conflict. Would it possible, he asked, to have a world in which religion will be a principled unit of identity — and identity not part of politics.\n\nMr. Tharoor also stressed the need to ensure the world was safe for diversity — to strive to preserve individual identities but ensure they could cooperate and work together — that would be the challenge of the 21{+s}{+t}century, he said.\n\nOn mass media, including social media, he said while it had shrunk the world into one neighbourhood, one market and one audience, it still principally reflected the interests of its users. Only about 15 per cent of India has access to the Internet, he said, and those who do not have computer keyboards are being excluded and marginalised and we must not forget that. The onset of 4G could change this, he said.\n\n“We also need to be conscious that in describing the globalised world, we must not fall into the easy elitism of looking into it from top down,” he said. Mr. Tharoor fielded several questions from the audience, including ones about brain drain. To one on atheism, he said there seemed to be an increased consciousness of religion and its embodiment as identity.", 
    "section": "national", 
    "title": "The paradox of globalisation", 
    "subsection": "general", 
    "date": "2016-01-17"
}