{
    "author": [], 
    "text": "Rosary beads from Pope Francis, a tiny Buddha, a metal poker chip, a Coptic cross from Ethiopia and a statuette of Lord Hanuman are some of the pocket staples of the U.S. President\n\nWhen President Barack Obama feels tired or discouraged, reaching into his pocket can help him get over it.\n\nFor inspiration he carries some of the keepsakes people have given him since he started running for office. He says that helps him cope on a bad day “because somebody gave me this privilege to work on these issues that are going to affect them.”\n\nThe upshot — Mr. Obama realises “I better get back to work.”\n\nThe president made the revelation on Friday during separate interviews with three YouTube personalities. One of his interviewers had asked ahead of time for Mr. Obama to bring a meaningful item and talk about it.\n\nWhen asked, Mr. Obama pulled quite an assortment from his right pants pocket — rosary beads from Pope Francis, a tiny Buddha, a metal poker chip he said came from a bald biker with a handlebar moustache he met in Iowa in 2007, a Coptic cross from Ethiopia and a Hindu statuette of the monkey god Hanuman.\n\nMr. Obama has too many of the mementoes to carry all of them around “but I’ll pick out a few things...to remind me of all the people I’ve met along the way and the stories they told me,” he told Ingrid Nilsen of Los Angeles. She’s known as ‘Missglamorazzi’ on the video sharing website.\n\nThe interviews were part of a continuing White House strategy to reach different audiences and keep alive discussion of themes from Tuesday’s State of the Union address.\n\nMr. Obama was also questioned by Adande Thorne, a video game enthusiast from Orlando, Florida, known online as ‘sWooZie’, and Destin Sandlin, an Alabaman who is into science and makes educational videos.\n\nMr. Sandlin, who said he holds a civilian job at the Department of Defence, asked Mr. Obama to describe the characteristics of ‘Obamium’, a hypothetical element named after him.\n\n“I would want it to be stable,” Mr. Obama said. “I would want it to be a catalyst, but one that didn’t get too hot or too cold, and hopefully, it would be one that was useful to humanity, that we could actually use and wasn’t just some shiny object,” he said.\n\nMr. Obama said his favourite movie last year was The Martian , starring Matt Damon. He has not seen Star Wars: The Force Awakens .\n\nAsked by ‘sWooZie’ who would emerge victorious if musicians Drake and Kendrick Lamar faced off in a rap battle, Mr. Obama chose Lamar. He said Drake is an “outstanding entertainer,” but that Lamar had the best album last year, titled To Pimp a Butterfly . Last year, Obama praised Lamar’s song, How Much a Dollar Cost . — AP\n\n“I’ll pick out a few things...to remind me of all the people I’ve met along the way”", 
    "section": "national", 
    "title": "What does Obama carry in his pocket?", 
    "subsection": "general", 
    "date": "2016-01-17"
}