{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘It is tainted by mischief and coloured by malice’\n\nThe Central Administrative Tribunal (CAT) quashed a charge sheet filed by the Gujarat government on ex IPS Rajul Sharma for keeping the two CDs containing call records of top officials including the Ministers and lawmakers during the 2002 riots.\n\nAhmedabad Bench of the CAT dubbed the charge sheet as “tainted by mischief” and “ coloured by malice and malafides.”\n\nMr. Sharma was Deputy Commissioner of Police (DCP) in Ahmedabad when he prepared a set of two CDs containing call records and location of top officials and politicians, which exposed connivance of some politicians with the rioters during the 2002 communal riots.\n\nIn 2011, the then Modi administration filed a charge sheet against Mr. Sharma on the ground that he had kept the CDs with him instead of submitting them to the investigation officer after he was transfer from Ahmedabad.\n\nDuring his deposition before the Gujarat government appointed inquiry commission headed by Justice G.T. Nanavati, Mr. Sharma submitted the CDs, which were taken on record as evidence by the commission.\n\nThe Bench came down heavily on the State administration for issuing a charge sheet to the officer, who as per the court, aided the cause of truth.\n\n“The charge sheet is illegal, coloured by arbitrariness, tainted by mischief and malice as the actual result of suppression of the mobile tracking records in the CD is to benefit the actual perpetrators of brutal and violent crimes through which hundreds of innocents died needless and violent deaths,” the Bench observed in its order, blaming the State authorities of trying to suppress the CDs that contained vital information regarding the ghastly riots.\n\nTo the Gujarat government’s allegation that the tribunal was biased towards Mr. Sharma, the Bench made a scathing observation. “Bias in the sense of conviction in moral and ethical values is not only unavoidable during judicial determination, but also desirable as otherwise the blood that made red the streets and by lanes of Gujarat would have gone in vain.”\n\nTook VRS\n\nHounded by a series of charge sheets and show cause notices, Mr. Sharma took voluntary retirement from the service and is now a practising lawyer in Gujarat High Court.", 
    "section": "national", 
    "title": "CAT quashes charges against ex-IPS officer", 
    "subsection": "general", 
    "date": "2016-01-24"
}