{
    "author": [
        "Sujatha Raghunath"
    ], 
    "text": "The future of SC, ST students is uncertain as the government does not release the financial aid in time\n\nWhen Vasantha (name changed), a tribal girl, was admitted to the Quaid-E-Millath Government College for Women in June last in Chennai, her family rejoiced as she was a first generation student from her family, which survives on farming. She has enrolled for the Tamil Nadu government’s scholarship.\n\nBut, a few months into her life in the city, nearly 50 of her hostel mates, most of them first generation learners like her, were admitted to a government hospital one night after they suffered from diarrhoea and vomiting. The students had been served leftovers and had fallen sick. Twenty others were treated as out-patients. It took more than a week for the students to recover. Many of them left for their hometowns.\n\nThe college administration did not respond to media outcry. In fact, at a meeting the day after the incident, the teacher who addressed the students accused them of being ungrateful to the institution that was providing them excellent food.\n\nThe hostel rooms, which can accommodate only two students, invariably have five or six. It is much the same situation in the hostels run by the Adi Dravidar Department too. The hostel in Royapuram is a three-storeyed structure but its environs are unhealthy. Since water is at a premium (two tanks have been installed outside the hostel), girls return to their homes during their monthly periods.\n\nThe situation is no better in the boys’ hostel. A few months ago, hostellers complained of stench in piped water. It was only after the students protested that the authorities opened the sump to find a dead dog.\n\nLast month, when Madras University shut down five days earlier than scheduled following protests, students in one of the Adi Dravidar hostels in the city had to eat in roadside eateries as the cook said there was no supply of rice. “We protested and then food supply was restored.”\n\nThe Adi Dravidar department runs 1,314 hostels. Of these, 1,143 are school hostels and 138 are boys’ hostels catering to 98,039 students, according to the department’s policy note for 2015-2016.\n\nAlthough the government claims that the hostels are in good shape, time and again non-government organisations have exposed the lack of amenities in these facilities.\n\nSoon after the recent floods which affected Chennai, Cuddalore, Tiruvallur and Kancheepuram districts, Samakalvi Iyakkam, a voluntary organisation, found that the Scheduled Castes and the Scheduled Tribe students stayed away from residential schools. The organisation also found that in some hostels in flood-hit areas in Kancheepuram, students were asked to clean the premises. In some cases hostels were closed. Since most of the students rely on the food provided in the hostels, their nutritional status had also been compromised.\n\nEven as these problems remain unaddressed, those working for the welfare of the SC, ST community are struggling to ensure that larger issues — such as ending discrimination and ensuring scholarship money — are addressed.\n\nAlthough the State government issued an order in 2011 paving the way for free education of Dalit students, every year meritorious students are left wondering if they would be allowed to take the annual exam. Their future is uncertain as the government does not release their scholarships on time. Families are forced to sell their meagre possessions and students drop out midway as the post-matric scholarships are invariably delayed.\n\nInadequate allocation\n\nIn 2014-15, the government should have allocated Rs. 1,147 crore in its budget for the scholarship. Instead, Rs. 334.77 crore from the current year’s budget was allocated to tide over last year’s deficit, according to M. Barathan, of Dr. Ambedkar-Kalvi Centenary Movement. “Delaying scholarship is also discrimination,” he points out.\n\nFor people like Christodas Gandhi, former secretary of the Adi Dravidar and Tribal Welfare Department, who is continuing his fight for the rights of Dalits to education, it is important to ensure that meritorious SC students who qualify for MBBS in the State also enter the portals of medical college. Last year, 35 SC students did not join for want of financial support, he says.\n\nEven as the State gears up for elections, these activists are concerned about when and how the scholarship money will be released.", 
    "section": "national", 
    "title": "‘Delaying scholarship for Dalits is also discrimination’", 
    "subsection": "general", 
    "date": "2016-01-24"
}