{
    "author": [
        "Jacob Bernstein"
    ], 
    "text": "Clairfoster Josiah Browne, a painter, in his car in Los Angeles driving for the ride-sharing service Uber. (Right) Sue Johnson, 73, a driver, who hopes to augment her retirement income.— Photos: NYT\n\nBeing a driver for hire has replaced waiting on tables as the preferred side job for underemployed actors and artists who throng the city that has launched a million stars\n\nWhen Lauren McKnight, 27, is not appearing on television shows for VH1 and ABC, she is driving a black Scion XA, picking up Hollywood executives on their way to the airport.\n\nWhen Carlton Totten, 23, is not studying old Marlon Brando films, attempting to summon up brooding intensity, he is in a gray Prius taking trust-fund babies from El Rodeo School in Beverly Hills to the nearest branch of the Los Angeles Public Library.\n\nAnd when Clairfoster Josiah Browne, 36, takes a break from his abstract expressionist-inspired art work, he scans his iPhone for fares inside a 2012 Chevy Cruze.\n\nThis is Hollywood’s new creative underclass, where being a driver for hire has replaced waiting on tables as the preferred side job for the city’s underemployed actors and artists. Over the past two years, droves of them have gone to work for ride-sharing services such as Uber and Lyft because of their flexible hours and, until recently, decent pay.\n\nYou can spot them instantly. The men have thick lumberjack beards, the kind typically seen not on old-school chauffeurs but on creative types in Silver Lake. The women wear make-up. The uniforms often include Bonobos jeans, fitted hoodie sweatshirts and faded vintage T-shirts.\n\nCustomised with care\n\nThe trunks of their cars are littered with screenplays from previous auditions. Taped on their dashboards are photographs of their dogs, who are invariably named after their favourite on-screen protagonists.\n\n“He has more followers than I do,” said Richard Martinez, 25, an Uber driver who is striving to be a tech entrepreneur, referring to the Instagram following of his boxer, Apollo Creed.\n\nNot long ago, being a waiter at the Ivy or a salesman at Fred Segal was considered the reliable way to earn a living until one got a big break in a Wes Anderson film and got picked up by a major Hollywood agency such as CAA or WME.\n\nBut Krystal Harris, 27, an actress who appeared in the recent Kevin Hart film, About Last Night , quickly realised those sorts of jobs were over-rated. So now she works primarily for Lyft.\n\n“I was a lead hostess at three different restaurants,” Ms. Harris said. “It really didn’t allow for much flexibility at all. I ended up getting fired for going to an audition. Even when I got my shifts covered, they gave me a hard time.”\n\nIn 2013, she turned her Ford Escape into a roving cash register. She had total control over her hours, never needing to clear her schedule with anyone for a last-minute audition. There weren’t even rules against working for both Uber and Lyft.\n\nWhen acting gigs were hard to come by, she drove as many as 40 hours a week, earning what she estimated was about $20 an hour after Uber and Lyft took their commissions (generally around 20 per cent). If the casting gods shined on her, she simply shut off the apps.\n\n“When I’m really on a roll, I don’t have to work,” she said. “As long as my insurance and registration are up to date, I can go back.”\n\nThere are several other factors that make the popularity of ride-sharing gigs a uniquely Los Angeles phenomenon. For starters, the city has no shortage of underemployed actors. The lack of reliable mass transit means that even those struggling to pay rent own cars.\n\nAnd unlike in New York, another city with lots of underemployed actors, drivers in Los Angeles do not need a special taxi and limousine licence to work for Uber. Pretty much anyone with a driver’s licence and no criminal record can be working within a week, as long as the car is a four-door vehicle manufactured after 2001.\n\nThat is basically how Mr. Browne, the artist, began driving for Uber in 2015. Shortly after losing his job delivering liquor, he filled out an online application and brought in his car for a 19-point vehicle inspection, and 96 hours later, he was picking up customers all over Los Angeles.\n\nHe particularly likes that he can get into the car and start earning money any time he and his wife argue. “If home is happy, I come back quick,” he said. “If there are shenanigans, I stay out.”\n\nNetworking\n\nDriving for Uber also appeals to the city’s penchant for networking.\n\nUber customers who summon rides at the Sunset Tower in West Hollywood or the Upright Citizens Brigade near Silver Lake are likely to get an earful about the last Hollywood-connected client that the driver picked up there. On slow days, drivers frequently work long stretches of time making less than the minimum wage.\n\n“The golden days are definitely over,” said Mr. Totten, who scored just two fares in 90 minutes on a recent Thursday afternoon, driving around Beverly Hills and West Hollywood. Neither fare earned him more than $5 after Uber deducted its commission.\n\nMichael Amodeo, a spokesman for Uber Los Angeles, said that the company does guarantee its drivers $16 an hour during peak times and about $13 during off-peak times (after fees). But even this is a topic of contention with drivers, who say the offering is loaded with asterisks.\n\nRecently, Mr. Totten considered getting a new side job. “I’m probably going to do Postmates,” he said referring to the app-based service that delivers artisanal food in under 60 minutes and guarantees its drivers a minimum of $25 an hour. “You can’t live on this anymore.” — New York Times News Service", 
    "section": "national", 
    "title": "For new Hollywood hopefuls, it’s Uber way to a shot at silver screen", 
    "subsection": "general", 
    "date": "2016-01-24"
}