{
    "author": [], 
    "text": "Academy of Motion Picture Arts and Sciences president Cheryl Boone Isaacs has pledged to double its membership of women and minorities by 2020.— File photo: Reuters\n\nThe Academy of Motion Picture Arts and Sciences on Friday promised sweeping reforms designed to help diversify its membership in the face of a major controversy over the second straight year of all-white Oscar acting nominations.\n\nThe Academy’s board said it was taking “historic action” to double the number of women and minority members by 2020 and launch a global effort to “recruit qualified new members who represent greater diversity”.\n\n“These new measures regarding governance and voting will have an immediate impact and begin the process of significantly changing our membership composition,” Academy president Cheryl Boone Isaacs said.\n\nThe changes were approved in a unanimous vote by the Academy’s board of governors on Thursday, following days of criticism that for a second year in a row, all 20 actors nominated for Oscars were white.\n\nAcclaimed director Spike Lee, who won an Oscar last year for lifetime achievements, wrote an open letter to the Academy decrying the “lily white” nominations.\n\nMega-star Will Smith — one of the black actors seen as having been passed over for a nomination this year — and his wife, Jada Pinkett Smith, followed Lee in announcing that they too would stay away from the ceremony on February 28.\n\nOn Friday, British actor Charlotte Rampling — nominated for best actress for 45 Years — waded into the row by saying Lee had been “racist to whites” in his criticism.\n\n“You can never know for sure, but maybe black actors did not deserve to be in the final selection,” Rampling told Europe 1 radio, speaking in French.\n\nThe Academy announced that beginning later this year — not affecting votes for the 2016 Oscars — each new member’s voting status will last 10 years, and be renewed if they have been active in movies during that time.\n\nMembers will get lifetime voting rights after three 10-year terms, or if they win or are nominated for an Academy Award. The same standards will apply retroactively to current members.\n\nThose who do not qualify for active status will not be able to vote.\n\nTo increase diversity on the board of governors immediately, the Academy said it would establish three new governor seats that will be nominated by the president for three-year terms and confirmed by the board.\n\nIt will also involve new members on decisions about membership and governance, giving them a chance to become more active in decision-making and to help spot and nurture future leaders.\n\nThe announcement was quickly welcomed by Ava DuVernay, director of civil rights movie Selma , which was nominated for best picture last year, but not for best director or actor. — AFP", 
    "section": "national", 
    "title": "For Oscars, change from ‘lily white’ to rainbow", 
    "subsection": "general", 
    "date": "2016-01-24"
}