{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Undertakes padayatra of drought-hit areas of Bundelkhand\n\nCongress vice-president Rahul Gandhi on Saturday accused the Narendra Modi-led government of ignoring the interests of farmers in favour of corporate houses.\n\nTouring drought-hit areas of Bundelkhand, Mr. Gandhi urged Mr. Modi to think of the poor, the backward and labourers.\n\n“If you do not listen to their voice and understand the true power of the unemployed youth and the poor, you will face heavy damage,” he added. Under the Modi-government, “weaker sections are being oppressed,” Mr. Gandhi said.\n\nPadhyatra\n\n“Be it a farmer in Bundelkhand or a Dalit youth in Hyderabad. Whenever you see a weak oppressed, you will find the Congress party and Rahul Gandhi,” Mr. Gandhi told farmers after a 7-km padhyatra in Mahoba district, at the centre of the agrarian crisis. The leader also interacted with women self-help groups.\n\nWith a little more than a year left to the 2017 Assembly elections, Mr. Gandhi’s padhyatra is understood to be part of the Congress’ outreach towards the poor and farmers. Bundelkhand has been Mr. Gandhi’s favourite playing field.\n\n“I have come here to draw the attention of PM Modi and CM Akhilesh to Bundelkhand and the problems of the farmers,” Mr. Gandhi said.\n\nHe listed steps taken by the UPA government for the benefit of farmers and the poor, especially the employment guarantee scheme MGNREGS, and how it had checked drought-induced migration.\n\nEver since the Samajwadi Party government announced drought in 51 districts of the State, politics over Bundelkhand’s agrarian crisis has caught pace, with the Opposition parties targeting the State government for the plight of farmers.\n\nTo beat the crisis, the State has suspended all revenue collection till March 31.", 
    "section": "national", 
    "title": "Govt. ignoring farmers: Rahul", 
    "subsection": "general", 
    "date": "2016-01-24"
}