{
    "author": [
        "Devesh K"
    ], 
    "text": "Netaji Subhas Chandra Bose’s name was never on the British list of war criminals. He was regarded as a traitor and a political figure, not a war criminal, according to the London-based Imperial War Museum.\n\nHowever, the museum’s letter dated November 25, 1998, to the High Commission of India in London adds that even if Netaji had been on any such list, his name would have been removed following his death shortly after the Second World War.\n\nIn response to a query, a senior historian with the museum had written a letter to the Indian High Commission, which is part of the 100 files released by Prime Minister Narendra Modi on Saturday.\n\n“Nigel Jarvis, one of the historians at the Foreign and Commonwealth Office informed me that Netaji Bose’s name was never on any list of war criminals because he was regarded at the time (1945) as a traitor and a political figure, not as a war criminal. Moreover, since he was an Indian subject, his case would have been dealt with under the British/Indian legal system rather than that of international law,” the letter said.\n\nIt added: “Mr. Jarvis told me that this same question has been raised several times before and that in the past, official answers have normally been supplied either by the Foreign and Commonwealth Office or the Army Historical Branch of the Ministry of Defence.” For its part, the British Defence Ministry in December 1998 informed the Indian High Commission that there was no evidence to suggest that Netaji was on the list of war criminals drawn up after the Second World War\n\nThe question of how to treat Netaji and other members of the Indian National Army was considered in 1945 by the Indian government in consultation with “His Majesty’s Government”, said the British Defence Ministry, adding the relevant official papers were in public domain.\n\nAmong the official correspondences on Netaji’s role, which are in public domain, was important communication between Sir E. Jenkins and Sir F. Mudie in August 1945. “I have examined your suggestion that Bose be treated as a ‘war criminal’. He clearly is not one in the ordinary sense of that word. Nor does he appear to come within the extended definition which has now been adopted by the United Nations..,” replied Sir Mudie.\n\nImperial War Museum record says Bose was\n\nbut regarded\n\nas a traitor", 
    "section": "national", 
    "title": "He was not on list of ‘war criminals’", 
    "subsection": "general", 
    "date": "2016-01-24"
}