{
    "author": [], 
    "text": "Appa Rao says he was not Vice-Chancellor of University of Hyderabad when the decision to expel five students for a semester was taken\n\nThe University of Hyderabad is in ferment over the suicide of Dalit research scholar Chakravarthy Rohith Vemula. As students on strike demand the resignation of Vice-Chancellor Appa Rao Podile , they have not only accused him of being casteist but also questioned his proximity to the BJP. In a telephonic interview to Anuradha Raman , the man in the eye of the storm explains his position.\n\nWhy did the Executive Council take the decision to revoke the expulsion order against Rohith Vemula and four others on January 21?\n\nWe wanted no harm to come to our other students and, conscious of the fact that the entire matter was sub judice , the Council decided to revoke the expulsion order of December 12, 2015.\n\nDo you feel now that had you taken this decision last year, a young man’s life would not have been lost?\n\nI am as shocked as anyone else by Rohith Vemula’s death. He was my student in a Master’s programme and was a gifted student. When I read what is being referred to as the suicide note or his last note, my question to everyone is: does he blame the university for taking his life? Please read the note carefully and tell me if he mentions the university as the reason for taking his life.\n\nThroughout the expulsion and the strike episodes, why did you not reach out to the students?\n\nThrough the Dean Students Welfare, I was in constant touch with the students who had been expelled. Initially, when the orders to expel them from their hostel rooms were served on them on December 16, they said nothing. They did not even resist the order. But a few days later, I found that the Joint Action Committee and their protest took an organised shape and things went out of control after that.\n\nThrowing them out of their hostel rooms when they come from far-flung interiors, how wise or insensitive was the Council’s decision?\n\nI wasn’t the Vice-Chancellor when the decision was taken to expel the five students for a semester. But when I took over, I felt the order was harsh since that would have meant a freeze on their scholarships, which is a lifeline for the students. I requested the Executive Council whether we could reconsider the decision to expel them from the hostels. Please also remember, it is for the first time that students have been expelled from the university.\n\nWhy the flip-flop? The Proctorial Board’s findings recommend warning to the ABVP student — incidentally, he was not examined — and five Dalit students on August 12 last year. But on August 31, it suspends them for a semester only to revoke the decision on September 11. It censures only students from the Ambedkar Association, though the initial findings recommend that both the ABVP student and the Ambedkar Association students should be let off with a warning.\n\nAre you telling me that the guy who was attacked should have been punished too? There was one student versus more than 10 students who had gone to his hostel room after he posted something on his Facebook. We don’t understand how the ABVP student should have been punished. Besides, all this was decided by the Proctorial Board before I took over. The board is a statutory body and the decision was upheld by the sub-committee of the Executive Council. It is not our mandate to reopen the board decision.\n\nDid the decision have to do with BJP Minister Bandaru Dattatreya’s complaint before the council forwarded by the HRD Ministry with five reminders? Did it act as a pressure?\n\nWe keep getting letters. I was a novice then as I wasn’t aware that letters from VIPs were meant to be responded to within 15 days. Despite that, we didn’t respond to MHRD. We still haven’t.\n\nStudents say you were responsible in 2002 for the rustication of 10 Dalit students.\n\nBoth the incident and the narrative are not correct and the decision of the then Executive Council has been upheld by the High Court. Offices of the university had been ransacked and even the staff was manhandled. I was one of the victims and I was beaten up.\n\nMr. Rao, have you been accused of being insensitive to the situation?\n\nWe have to understand the dynamics of the university. Can a V-C guide 400 faculty members in the etiquette of inter-personal engagement? Some teachers will be polished and others a little rough in their treatment of students. Where does one draw the line?\n\nHow is it that you never reached out to the students?\n\nOn January 14, I did meet the members of the Joint Action Committee and assured them that at an appropriate time I can help them out.\n\nAre your students, especially the ones you expelled, anti-national?\n\nThat question does not arise. No, they aren’t.\n\nWill you resign?\n\nIt is not appropriate for me to comment. So far, no.", 
    "section": "national", 
    "title": "I am as shocked as anyone else by Rohith’s death, says V-C", 
    "subsection": "general", 
    "date": "2016-01-24"
}