{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Family members of the suspected terrorist, Mohammad Hussain Jamil Khan (not in picture) arrive at a sessions court in Mumbai on Saturday. -Photo: Vivek Bendre\n\nAlleged Islamic State (IS) member Mohammad Hussain Jamil Khan, who was arrested from Mazgaon on Friday, ‘confessed’ in front of a National Investigation Agency (NIA) holiday court, where he was produced for remand on Saturday.\n\nKhan, the 15th suspect arrested by the central agency in a nationwide sweep, is a businessman and lives with two wives and four daughters at Mazgaon’s Mandvi lane.\n\nPublic prosecutor Anand Sukhdeve sought transit remand for Khan like in the case of Mudabbir Sheikh, another alleged IS member arrested from Mumbra and given three-day transit remand.\n\nAsked by Judge N.K. More if he wanted to say anything on his arrest, Khan said “Mujhse galti ho gayi sir” (I have made a mistake sir).\n\nAdvocate Shabnam Shaikh, appearing for Khan, alleged that the businessman, who was reportedly in touch with Mudabbir Sheikh, the ring leader of the group, had been framed in the case. “He made his confession under pressure. He has been falsely implicated,” she said.\n\nKhan’s second wife, also present in the court, pleaded that her husband was innocent. She said he had lost his father several years ago and had the financial responsibility of three families.\n\nAs the news of his arrest reached the family, Khan’s family and well-wishers rushed to the court.\n\nSpeaking to the media, Khan’s wife, unwilling to disclose her name, said the family was shocked to know of his arrest, they were informed of, after 12 hours.\n\nHe was detained by the NIA and the ATS on Friday evening.\n\n“We are clueless about why he has been arrested but are sure that he is innocent,” she said. As for his ‘confession’, his wife said he might have done it under duress.", 
    "section": "national", 
    "title": "IS suspect ‘confesses’", 
    "subsection": "general", 
    "date": "2016-01-24"
}