{
    "author": [
        "Staff Reporter"
    ], 
    "text": "DMRC, KMRL are confident of completing works & getting clearance by Nov. 1\n\nKerala Chief Minister Oommen Chandy rides in a metro train after the first test run of the Kochi Metro Rail project was flagged off on Saturday. Trial runs on the Metro viaduct will begin in February.— PHOTO: PTI\n\nKochi Metro will begin commercial operations on November 1 — Kerala Formation Day, since both Delhi Metro Rail Corporation and Kerala Metro Rail Limited are confident of completing all works and obtaining mandatory clearance by that time, Chief Minister Oommen Chandy said.\n\nSpeaking at the function to flag off test runs of the first three-coach train at Muttom coach depot on Saturday, he reiterated the promise made on June 7, 2013 that the project would be completed in 1,095 days (three years). “Today is the 958{+t}{+h}day and there are 137 days left for works to get over. This much could be achieved thanks to the personal involvement of India’s metro man, E. Sreedharan. Every effort will be made to commission the project on Kerala Formation Day, though June 2017 is the deadline as per the agreement,” Mr Chandy said.\n\nThe Principal Advisor of DMRC, E. Sreedharan lauded the efforts made by the organisation to begin test run within two-and-half years of metro works beginning. Six of the total 12 metro projects that have been completed took much more time. Supply of the first metro train four months ahead of schedule, completion of basic works at the coach depot and cooperation of members of the public helped commence test runs.\n\nTrial runs on the Metro viaduct will begin in February and will be extended up to Maharaja’s Ground in June, Mr Sreedharan said. He earlier broke a coconut on the track as pooja was done. The MD of DMRC Mangu Singh said India is emerging as a builder of metro coaches, with French firm Alstom that would supply 75 coaches to the Kochi Metro.\n\nThe MD of KMRL Elias George said that the metro would ensure a safe, pollution free, clean mode of transport. “Other modes of public transport will be modernised and integrated with metro as part of Unified Metropolitan Transportation Authority - Kochi (UMTA).”", 
    "section": "national", 
    "title": "Kochi Metro to start operations on Kerala Formation Day: CM", 
    "subsection": "general", 
    "date": "2016-01-24"
}