{
    "author": [], 
    "text": "The eminent writer has questioned the timing of the Sahitya Akademi’s announcement of its policy of not taking awards back.\n\nEminent writer Nayantara Sahgal, who spearheaded the ‘Award Wapasi’ campaign, on Saturday clarified that she was not taking back the award and questioned the timing of the Sahitya Akademi’s announcement of a policy not to take back awards.\n\n“I don’t know why this nonsense is being spread that I have taken it back. The Sahitya Akademi rang me today that it is not their policy to keep returned awards and so they are sending back the cheque I sent them,” Ms. Sahgal said on the sidelines of the Tata Steel Kolkata Literary Meet here.\n\nThe Akademi had on Friday said there was no provision in its constitution to accept any honour once conferred upon a writer.\n\nIt had also said that some authors had accepted the award back.\n\nMs. Sahgal said the cheque, which was sent in October by her, had anyway become invalid now as the Akademi had not encashed it.\n\nThe award, given to her in 1986, comprised a small copper plaque-like memento and a cheque of Rs.21,000.\n\n“The Akademi attacked me saying I am returning the money but not the interest. That made me very upset, and therefore, I sent them a cheque of Rs. 1 lakh but that has been lying with them ever since. And now suddenly, they are saying that it is not our policy. It is their problem, not mine,” she said.\n\nShe said they were fighting for freedom of speech and expression but after the Dadri lynching incident, the issue became bigger.\n\n“It worsened when (Mohammad) Akhlaq was lynched. That made it a much wider debate. We were fighting for freedom of speech and expression but that became a country-wide issue of the freedom to live and worship as you choose. Later on, historians and scientists also joined,” the niece of India’s first Prime Minister Jawaharlal Nehru, said.— PTI", 
    "section": "national", 
    "title": "Nayantara Sahgal denies taking back award", 
    "subsection": "general", 
    "date": "2016-01-24"
}