{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Officials feared that Opposition might use it for propaganda purposes as elections were fast approaching\n\nPandit Jawaharlal Nehru with Subhas Chandra Bose at an All India Congress Committee meeting in the then Bombay. At right, Netaji boards a chartered plane to attend a Congress meeting in Delhi.— Photos: The Hindu Archives\n\nUnderscoring the compulsions of electoral politics in Independent India, government officials wrote to the then Prime Minister, Jawaharlal Nehru, in September 1951 that while there was conclusive evidence of Netaji Subhas Chandra Bose’s death in the plane crash, announcing this publicly would be misused by the Opposition as elections were approaching.\n\n“I told the Prime Minister that it would be inadvisable for him to make a statement now. Whether or not Shri Subhas Bose is dead is not a live issue at present. I have no doubt on the evidence that Shri Bose is dead, but Prime Minister’s political opponents would utilise any statement made by him for propaganda purposes, particularly in view of the forthcoming elections,” Foreign Secretary S. Dutt wrote in a letter dated August 27, 1951.\n\nThis was in response to Nehru’s letter a day earlier asking officials if he should make an announcement on Netaji’s death after meeting S.A. Ayer, a former journalist-turned-publicity minister in the Azad Hind government. “The other point Ayer spoke to me about was his inquiry into the air crash which brought about the death of Shri Subhas Chandra Bose,” Nehru wrote to the officials on August 26.\n\nNehru wrote that after the inquiry, Ayer felt sure that there was no doubt at all about Netaji’s death in the crash.\n\n“He showed me some papers and some photographs, some documents signed by the Japanese people,” he wrote.\n\nWhile Nehru felt that “it would be desirable to issue some statement or to make it in Parliament”, he said, “On the other hand, this may lead to some controversy, possibly even with Shri Subhas Chandra Bose’s family.”\n\nHe further wrote that the best way would be to send a report to Bose’s family and a final decision be taken after hearing from them.\n\nLetter to Roy\n\nIn a letter to the then Chief Minister of West Bengal, B.C. Roy, dated March 1, 1952, Nehru wrote, “In answer to a question in Parliament, I am going to place Ayer’s report on the table of the House. I have no reason to doubt the correctness of this report and I think I must accept the final conclusion also.”\n\nOn March 5, 1952, Nehru made a statement in Parliament accepting that Netaji was killed in the crash.", 
    "section": "national", 
    "title": "Nehru was persuaded to delay statement on Netaji’s death", 
    "subsection": "general", 
    "date": "2016-01-24"
}