{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "India’s first Prime Minister, Jawaharlal Nehru, sought to arrange financial help for Netaji Subhas Chandra Bose’s wife and his daughter soon after Independence.\n\nAmong the files released by the Narendra Modi government on Saturday is a series of official exchanges from 1952 and 1954 revealing the government’s attempts to support the family in Vienna.\n\nOn June 12, 1952, Nehru sought the opinion of the Finance and the External Affairs Ministries on whether financial help could be sent to Bose’s widow.\n\n“The lady in Vienna is the wife or rather the widow of Shri Subhas Chandra Bose and we should like to facilitate help being sent to her,” Nehru wrote. The Finance Ministry agreed to the proposal, and Netaji’s nephew Amiya Nath Bose was informed of the same.\n\nAs for the daughter, Anita Bose, now Anita Pfaff, it was decided to set up a Trust — with Nehru and then West Bengal Chief Minister B.C. Roy as the trustees — with the amount to be transferred to her when she turned 21.\n\nIn case of her death by then, this transfer would happen to her mother, and if both had died, to the Congress, as per a document dated April 15, 1954. Nehru confirmed the execution of “a trust deed in favour of Subhas Chandra Bose’s child in Vienna” in a letter on May 23, 1954. The deed was placed in the custody of the All India Congress Committee. As for the sum to be paid to Bose’s widow, the Finance and the External Affairs Ministries had suggested £100 to be sent for the ‘widow’ Frau Schenkl “through private channels, to our Vice-Consul at Vienna, who should disburse it…”\n\nA 1966 letter says that while the AICC paid Anita Bose until her marriage in 1965, Bose’s widow declined to accept any money.", 
    "section": "national", 
    "title": "Nehru arranged financial support for Netaji’s daughter and wife", 
    "subsection": "general", 
    "date": "2016-01-24"
}