{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India’s historic ties with Japan, Germany, Russia/Soviet Union and the United Kingdom came under focus on Saturday as the Netaji papers revealed inconvenient but unverified letters and reports regarding Netaji’s ties with these countries.\n\nFor example, one document written by the Planning Commission member P.D. Mukherjee rigorously argued that Netaji was imprisoned by the Soviet leaders till the early 1960s. Mukherjee claimed that in 1978, his friend Satyanarayan Sinha had deciphered, with the help of a group of German professionals, a coded message between the USSR-Germany and the United States which convinced him that Netaji was alive till a few months before Jawaharlal Nehru passed away in 1964. In view of such cables and papers, diplomats told The Hindu that ties with important world powers would have been affected if the reports on Netaji were given operational importance in the previous decades.\n\nInternational network\n\n“Netaji was part of the international network of sympathisers and supporters of the Nazi Germany and Japan during the World War II which perhaps prevented Berlin and Tokyo from taking up the Netaji mystery with India enthusiastically,” said Kanwal Sibal, former Ambassador in Moscow. Among all the foreign powers, the declassified papers have shed most spotlight on India-Japan ties, especially since the most number of diplomatic exchanges are on the ties of Netaji to Japan.\n\nThe papers reveal that the issue of Netaji heated up in the mid-1990s as preparations began in India to mark the Bose centenary in 1997. “Bringing back the ashes at that time could have disturbed India-Japan political ties as Japan was a major international player under the U.S.-led world order and most of its World War II history was still a taboo,” Mr. Sibal said.\n\nK. Natwar Singh, former External Affairs Minister, told The Hindu that the ashes in Renkoji belonged to Netaji and should have been brought back.", 
    "section": "national", 
    "title": "Netaji’s links with various countries in spotlight", 
    "subsection": "general", 
    "date": "2016-01-24"
}