{
    "author": [
        "K C"
    ], 
    "text": "The three-credit course comprises the uniqueness of the media and entertainment industry.\n\nWho takes the credit for a “box-office hit”, joining the Rs. 100-crore club, or a “small budget film” getting big returns? The content, people or the way the film was marketed? Students of the Indian Institute of Management, Bangalore, (IIM-B) will be able to tell you.\n\nFilms have made inroads into the grey stone buildings of the IIM-B, with the students learning much more than the nitty-gritty of regular management domains. The “Strategic Management in Media and Entertainment Industry” course, that is open as an elective to students of all long-term programmes at the institute, offers them an opportunity to learn about the behind-the-scene aspects of trend-setting films, people and companies.\n\nThe three-credit short-term course content comprises, among other things, the uniqueness of the media and entertainment industry, trends in the environment that are shaping the strategic agenda in the field, firm strategy and performance in media and entertainment industry, the impact of technological change and the role of creativity and innovation.\n\nS. Raghunath, Professor, Corporate Strategy and Policy, IIM-B, said the course dealt with the “business of paying for an experience.”\n\nManish Mundra, founder of Drishyam Films, and producer of movies such as “ Ankhon Dekhi ” and the more recent “ Masaan ”, is the latest case study. He was at IIM-B on Saturday to interact with the students. “Films don’t fail; it is the budget that fails it,” he said. Rooting for a profit-sharing model and placing faith in ‘generation next’, he also said social media, as a tool for promotion, has assumed great importance.\n\nStudents who have opted for the course too were drawn to the curiosity its content created in their minds.\n\nSujoy Ghosh, a student of the Postgraduate Programme in Enterprise Management, said: “The Indian media industry is a blue ocean in terms of organising the unorganised sector and cues from this course will help us to solve the real problems and challenges specifically in this industry.”\n\nThe course has\n\nthe uniqueness of media and entertainment industry", 
    "section": "national", 
    "title": "Now showing at IIM-B: management lessons from film industry", 
    "subsection": "general", 
    "date": "2016-01-24"
}