{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Sameeksha Trust, which runs the Economic and Political Weekly has appointed senior journalist Paranjoy Guha Thakurta editor of the journal from April 1. This follows the resignation of Rammanohar Reddy from the post early this month.\n\nThe EPW , headquartered in Mumbai, is widely recognised as a unique journal-cum-magazine that combines popular commentary with academic research articles in the social sciences.\n\nMr, Thakurta will be only the fifth editor of the journal, which began initially in 1949 as the Economic Weekly edited by Sachin Chaudhuri and adopted the present name in 1966. An independent journalist, he is well known for his commentary on India’s political economy.\n\nSpeaking to The Hindu , Mr. Thakurta said he was keen on “taking forward the steps taken by Dr. Reddy in strengthening the academic aspects of the EPW , while reaching out to the youth and newer audiences … ”.\n\nIn a statement, the Trustees, Deepak Nayyar (Chairman), D.N. Ghosh (Managing Trustee), Andre Beteille, Romila Thapar, Jean Dreze and Rajeev Bhargav, “recorded their deep appreciation” for the work done by Dr. Reddy and his “enormous contribution”.\n\nDr. Reddy, who had been the editor for 11 years after previously working with The Hindu as economics editor, was due to retire in April, but resigned early. The early resignation was due to differences between the editor and the Trust board members on issues related to editorial autonomy. In particular, Dr. Reddy’s efforts to bring out a documentary to commemorate the 50th year of the journal’s existence through external funding had come under the Trust’s questioning.\n\nDr. Reddy’s resignation had spurred 101 long-standing contributors and readers of the EPW to urge the Trust’s members to involve the outgoing editor in the search for his replacement and to continue the activities planned for the anniversary.\n\nThe Trust’s statement says that it is willing to “organise a consultation with persons from the wider EPW community” on the anniversary celebrations, “in consultation with the editor-designate”.", 
    "section": "national", 
    "title": "Paranjoy Guha Thakurta to be EPW editor", 
    "subsection": "general", 
    "date": "2016-01-24"
}