{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘We have fulfilled the aspirations ofthe people and improved their life’\n\nChief Minister Jayalalithaa addressing the Assembly on Saturday during her reply to the discussion on the Governor's address- Photo: By Special Arrangement\n\nChief Minister and AIADMK supremo Jayalalithaa on Saturday told the Assembly that people wanted her government to continue as it has fulfilled their expectations.\n\nIn an emotional speech, Ms. Jayalalithaa said the AIADMK, truly a people’s movement with a woman leader who has dedicated her life for the people, would continue to rule the State even after her and work only for Tamils in the centuries to come without any selfish interests.\n\nWinding up the discussion on the Governor’s address on Saturday, the Chief Minister, in her customary reply, said people in the State had wanted a change in 2011 elections. They wanted an improvement in law and order, life conditions of the deprived classes, farmers, fishermen, weavers and other suppressed and oppressed classes and voted for change.\n\n“We have fulfilled the aspirations of the people and improved their life,” Ms. Jayalalithaa said, reiterating her oft-repeated line that she and her government were there only for the people.\n\n“My government is because of the people and my government is for the people.”\n\nTaking a jibe at those asking why she was reading out a prepared speech, the Chief Minister said she could speak extempore for hours and thunder in classical Tamil as at public meetings. “There are 36 departments. Even if I list out my government’s achievements during the last five years, it will take a day for each department. My reply will take 36 days and the Assembly has to sit for 36 days,” Ms. Jayalalithaa said, adding that it was with great difficulty that she had condensed her government’s achievements in all sectors into a 90-minute speech.\n\nThe main Opposition parties, the DMDK and DMK, stayed away from the Assembly proceedings.\n\n‘If I list out my govt’s achievements in the last 5 years, it will take a day for each dept.’", 
    "section": "national", 
    "title": "People want my govt. to continue: Jayalalithaa", 
    "subsection": "general", 
    "date": "2016-01-24"
}