{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "As stalemate between the coalition partners, the Peoples Democratic Party (PDP) and the BJP, continued for the 15th day in the State on Friday, PDP president Mehbooba Mufti’s silent direction to party leaders to “go back to their constituencies and serve people” seems an apparent hint at preparing for any eventuality, including mid-term polls.\n\nSources said Ms. Mufti’s public posturing on the common minimum programme, called ‘Agenda of Alliance’, seeking guarantees on its implementation, is yet to see any formal response from the BJP brass.\n\nBoth coalition partners have failed to reply to Governor N.N Vohra’s call on government formation.\n\nLeaders of both parties have claimed that “the coalition was on,” however, all is not well. Sources said Ms. Mufti is now planning to hold a feedback session with the lower rung party cadre to “understand how this nine-month coalition was playing out on the ground for the party’s image.”\n\n‘I will take my time’\n\nThe fresh direction has come after Ms. Mufti, mandated to take the final call, made it clear to the party leaders that “she wants to have her conscience clear first on the continuation of the coalition.”\n\n“I will take my time. I will go by Mufti sahib’s decision only if I feel that I can fulfil his dreams,” Ms. Mufti was quoted by party leaders as telling a closed-door meeting five days ago.\n\n“Even if the doable in the Agenda of Alliance cannot be achieved, what should be the PDP motivation to continue,” Ms. Mufti reportedly asked.\n\nVisibility of the late Mufti’s son, Tasaduq Mufti, a cinematographer by profession, has increased at the party meetings, where he had started showing interest in“apolitical issues like urban development and ecology,” according to party sources. Talking to The Hindu , the State-level BJP leaders said, “The PDP is yet to fulfil the constitutional obligation of meeting the Governor for continuation of the coalition.”\n\nMs. Mufti move to play hardball has the BJP leadership in New Delhi weighing its options in the country’s only Muslim-majority State.\n\nAfter the former Chief Minister Mufti Muhammad Sayeed’s demise on January 7, there was visible cozying up of the Congress to the PDP — leaders Sonia Gandhi, Ambika Soni and Ghulam Nabi Azad were seen standing next to the mourning Mehbooba. Similarly, regional player National Conference (NC) president Farooq Abdullah also dropped hints at “keeping the options open.”", 
    "section": "national", 
    "title": "Reluctance of PDP hints at early polls", 
    "subsection": "general", 
    "date": "2016-01-24"
}