{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Security has been beefed up in Kashmir valley in the run up to the Republic Day as separatists and militant outfits have called for a shutdown on the day.\n\nBarricades were set up across the State and more deployments made to keep militants at bay during the R-Day functions.\n\nChief Secretary B.R. Sharma held a meeting at Civil Secretariat, Jammu, on Saturday to review the arrangements for the Republic Day.\n\n“Public should be facilitated to reach the venues to participate in the Republic Day celebrations,” said Mr. Sharma. The militant outfit, Hizbul Mujhadeen, appealed to people to observe January 26 as ‘black day.’\n\nSeparatist groups headed by Mirwaiz Umar Farooq, Yasin Malik and Syed Ali Geelani have also called for a shutdown. Mr. Geelani has warned parents against sending their children for these functions.\n\nMeanwhile, the police have claimed to have thwarted the Harkatul-ul- Mujahideen (HuM) outfit’s revival plan by arresting its last surviving militant along with four other associates in north Kashmir’s Sopore area.\n\n“These terrorists were planning to carry out attacks on police security forces in and around Sopore and Baramulla on the national highway,” said Deputy Inspector General (DIG) north Kashmir, Gareeb Das.\n\nMr. Das said two militants, Ishfaq Ahmad Sofi alias Umer, of Sopore, and Aijaz Ahmad Gojri alias Chota Kalimullah, of Baramulla were first arrested. Later, three more associates Danish Gaffer Gojri alias Kalimullah, Javaid Ahmad Dar and Mohammad Sameer Kandoo alias Sameer Baba were held.\n\n“The youths were motivated by local terrorist Ishfaq Ahmad Sofi alias Umer, who was handled by Sajad Shaheen alias Sajad Afgani, a resident of Pakistan to rejuvenate the HuM terrorist outfit in the Valley. Both of them were in close touch with the said Sajad Afgani through social media,” said the police officer.", 
    "section": "national", 
    "title": "Security stepped up in Valley ahead of R-Day", 
    "subsection": "general", 
    "date": "2016-01-24"
}