{
    "author": [
        "T Appala Naidu"
    ], 
    "text": "The skeleton of the sperm whale at Nagayalanka village in Krishna district of Andhra Pradesh. — Photo: T. Appala Naidu\n\nWildlife authorities of Andhra Pradesh on Saturday inspected the skeleton of the sperm whale ( Physeter macrocephalus ), which is being conserved by local people at Nagayalanka village in Krishna district.\n\nRajahmundry Divisional Forest Officer (Wildlife) V. Prabhakara Rao and M.S. Swaminathan Research Foundation Research Co-ordinator Rama Subramanyam collected data about procurement and preservation of the 30-foot-long skeleton.\n\nAccording to a team of locals led by aqua farmer T. Raghu Sekhar, the skeleton was found off Nagayalanka coast in August.\n\n“The mammal is a schedule-I species under the Wildlife (Protection) Act, 1972. It attracts conservatory measures on the lines of that of the tiger. Skeletones of sperm whale are now available in Chennai and Andhra University in south India”, said Mr. Rao.\n\n‘We have expertise’\n\n“We have expertise to conserve the skeleton at our marine park at Koringa Wildlife Sanctuary in East Godavari district. We will encourage the local communities to collect any remains of the rare marine species if they are found ashore dead”, said Mr. Rao.\n\nIn collaboration with Andhra University, Visakhapatnam, and professors, the wildlife authorities will complete the task of arranging the bones of the sperm whale in an order based on its anatomy structure.\n\nPublic screening\n\nThe wildlife authorities also lauded the efforts of the local youth in preserving the skeleton, which was kept on display on the left bank of river Krishna here. The Rajahumundry-based wildlife division has also promised to provide video screening facility to the Nagayalanka youths to show their work in conservation of the mammal’s skeleton its life cycle in their area.\n\nThe public screening on the conservation efforts was meant for propagating the rich marine ecology and marine species found in the Bay of Bengal. Raghu Sekhar and his team were told to keep the skeleton on display until it was shifted to the Koringa Wildlife Sanctuary.", 
    "section": "national", 
    "title": "Sperm whale skeleton to be preserved at wildlife sanctuary", 
    "subsection": "general", 
    "date": "2016-01-24"
}