{
    "author": [
        "Penelope Green"
    ], 
    "text": "World’s only decluttering celebrity is out with new book\n\nOn Wednesday evening, the tidy and the would-be tidy sat very still on the fourth floor of the Barnes & Noble bookstore at Union Square in Manhattan, craning to hear the soft voice of Marie Kondo, the Japanese author of The Life-Changing Magic of Tidying Up , as she demonstrated her folding technique on ever more complex garments. She was balletic and masterly. When done, Ms. Kondo received a standing ovation.\n\n“Look at her, she’s adorable,” said Rita Wade, 51, a director of student affairs at a language centre who said that she was in attendance because she was fascinated by Ms. Kondo’s global reach.\n\nThe elfin Ms. Kondo, perhaps the world’s only decluttering celebrity, was promoting her new book, “Spark Joy,” a more prescriptive manual (it comes with illustrations) than her last, which is a publishing juggernaut. (Both titles are at the top of The New York Times best-seller list.)\n\nKindly and self-mocking, Ms. Kondo was already a tidy freak, as she said (assisted by an interpreter), by age 5, irritating her family by throwing away their belongings and mystifying her teachers when she skipped recess to organize her classroom’s bookshelves. Now 31, KonMari, as she’s known, exhorts you to ask yourself, “Do your things spark joy?” If not, you must thank them for their service, and send them packing.\n\nIt’s a liberating manifesto, though in practice it can take months. (This reporter once lost an entire weekend to the KonMari method.) Handle each object to properly gauge whether it truly thrills. Kondo suggests giving your clothes a hug, and mimed doing so as the audience gently applauded.\n\nHer approach to stuff isn’t just minimalism, said Yuko DeYoung, 50, an account manager at a news agency, and one of more than 100 attendees at the book signing. “Her method is something more basic, something more …” DeYoung paused to find the right word, “… humane.”\n\nIndeed, this patting and hugging of belongings, a kind of compassionate organising, has resonated beyond all reckoning.\n\nMore than 5 million copies of Ms. Kondo’s books have been sold, along with licenses to print them in 40 languages, including Mongolian. Fox and NBC are working on a sitcom inspired by her.\n\nLast year, Time magazine named Ms. Kondo one of its 100 most influential people, in an encomium by the actor Jamie Lee Curtis, who proclaimed her devotion to Ms. Kondo by announcing that if she ever got a tattoo, it would say, “Spark Joy!”\n\nThe Atlantic analysed Ms. Kondo’s tidying method through the lens of behavioural economics. Consignment stores have been overwhelmed by donations from devotees.\n\nInevitably, there was a backlash, and then a backlash against the backlash. Finally, a parody appeared that wasn’t quite parody: “The Life-Changing Magic of Not Giving a [expletive],” by Sarah Knight, out last month, was mostly practical. “So many books are about hoarding and clutter,” said Christian Freedom, 46. “It’s very shaming. I like her tone and her idea that untidiness is a spectrum.”\n\nMr. Freedom was at Barnes & Noble with a friend, Darren Rosenblum, also 46, who had given him the book for Christmas, and they were disputing their place on that spectrum.\n\nMr. Freedom said he had already filled a large duffel bag with castoffs, delivered to a thrift store. “I thanked my stuff and handed it off,” he said. “My therapist was really happy and said, ‘Can you do that twice a week?'” — New York Times News Service", 
    "section": "national", 
    "title": "The cult of Marie Kondo", 
    "subsection": "general", 
    "date": "2016-01-24"
}