{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Twenty-two others, including BSP State president Armstrong, acquitted\n\nAdvocates who appeared for the students addressing the media in Chennai on Thursday.— Photo: B.Jothi Ramalingam\n\nThe long-drawn legal tussle that followed the brutal clash between two sections of students of Dr. Ambedkar Government Law College, Chennai, in 2008 seemed to have reached its denouement here on Thursday, when an Additional Sessions Court convicted 21 persons to three years of imprisonment and acquitted 22, including BSP state president K. Armstrong, in the case.\n\nAccording to the prosecution, on November 12, 2008, a clash broke out between two groups of students on the college premises, located near the Madras High Court, over “Thevar Jayanthi” celebrations. The two groups attacked each other with deadly weapons, including iron rods and clubs, near the main gate of the college in full public view.\n\nFollowing this, two cases were filed by the Esplanade police based on complaints made by the then students Ayyathurai and Chithirai Selvan.\n\nBased on Ayyathurai’s complaint, 41 persons, including Armstrong, were named accused in the case. And, based on Chithirai Selvan’s complaint, Bharathi Kannan and Arumugam were named accused.\n\nOn Thursday, after examination of 45 witnesses, 73 exhibits, 15 material objects, the XVII Additional Sessions Judge M. Gomathi Nayagam convicted and sentenced 19 persons including Chithirai Selvan to three years of imprisonment along with a fine of Rs.15,000 each in the case, which had been filed on the basis of Ayathurai’s complaint.\n\nSimilarly, in the case filed on the basis of Chithirai Selvan’s complaint, the judge convicted and sentenced Bharathi Kannan and Arumugam to three years of imprisonment along with a fine of Rs. 10,000 each.\n\nSoon after the orders were pronounced, all 21 persons convicted under various sections of IPC moved a memo before the Sessions Court to suspend their sentence as they would like to prefer an appeal against the order.\n\nAdmitting the plea, the judge suspended the sentence for two months allowing them to move the appeal.\n\nMeanwhile, sources said that, according to the order, one copy of the judgment should be forwarded to the Commissioner of Police so that he could take action against investigation officer concerned for failure to discharge one’s duties at the time of the occurrence of the crime and also for commissions and omissions in collecting evidence to prove the offence mentioned in the final report.\n\nSaravanan Karuppasaamy, chairman, World Human Rights Commission and Rescue Center, who had filed a case in the Supreme Court seeking CBI investigation into the clash, told The Hindu that he was happy with the judgment, but not over the investigation.\n\n“I am going to approach the Supreme Court and seek a CBI investigation into the issue. It appears as if the police have not been able to gather enough evidence in the case. The police have not submitted the primary evidence containing a CD which showed all the persons involved in the clash,” he said.", 
    "section": "national", 
    "title": "21 get three-year term in law college clash case", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}