{
    "author": [
        "Annie Philip"
    ], 
    "text": "Under the collective ‘All for Water for All’\n\nRecognising the need for holistic approach to management of water resources in the light of threats like pollution, declining groundwater recharge, saltwater intrusion due to coastal erosion and encroachment of water bodies, a host of citizens and organisations are coming together under the collective ‘All for Water for All’ to host a 7-week Water Festival beginning February 2.\n\nThe Water Festival (February 2 to March 22) will look at management of water resources in the Puducherry-Auroville-Villupuram-Cuddalore (PAVC) bio-region as these places share geographic characteristics.\n\n“Water has no border. The festival will focus on each sub-region. Instead of hosting a one-day workshop on water and forgetting about it the next day, the festival will focus on how to connect community, experts and the government for a sustained effort on water conservation. There will be a consultation on long term strategy and commitment,” said Probir Banerjee of NGO PondyCAN, one of the organisations involved in the collective.\n\nThe activities under the festival will be organised in Bahour (February 3-8), Cuddalore (February 9-15), Puducherry (February 16-22), Auroville (February 23-29), Villianur (March 1-7), Vanur (March 8-14) and Marakkanam (March 15-21).\n\nEvents include films, puppet shows, theatre, competitions and cleaning up of tanks, ponds and irrigation channels by volunteers.\n\nThe festival will observe World Wetland Day (February 2), World Water Day (March 22), World Day of Social Justice (February 20), National Science Day (February 28), World Wildlife Day (March 3) and International Day of Forests (March 21).\n\nSchools and teachers will be roped in and sensitised on water management, said P. Joseph Victor Raj from Holistic approach for People’s Empowerment (HOPE), another organisation involved in the collective.\n\nWater specialist Tom Gerard Gablier from Auroville said that the festival would be a platform for sharing of expertise by those working in the field for long, and would also involve handing over the upkeep of water resources to the next generation. It would pass on the message that ‘water must be respected,’ he said.\n\nThe festival will be attended by environmental activist Rajendra Singh, who won the prestigious Stockholm Water Prize in 2015, and Anupam Mishra who was awarded the 1996 Indira Gandhi Paryavaran Puraskar.\n\nDetails about the festival can be found athttp://allforwaterforall.org\n\nIt will look at water management in Puducherry, Auroville, Villupuram, Cuddalore bio-region", 
    "section": "national", 
    "title": "A 7-week water festival to begin from February 2", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}