{
    "author": [
        "Manish Kumar"
    ], 
    "text": "After holding sway over the city’s airport for over two decades, a group of taxi drivers, who operate black-and-yellow ambassadors, find themselves pushed to the margins. The Chennai Airport Private Taxi Drivers Association (CAPTDA), which offers the black-and-yellow taxi service, is facing several challenges.\n\nThe Airports Authority of India (AAI) is soon expected to announce fresh tenders for dedicated pick-up space within the airport premises, and this is likely to give app-based cab aggregators a strong presence right inside the airport.\n\nCAPTDA’s members say their profits have been dwindling as a result of the entry of big app-based cab aggregators and other transport companies which are also offering cab services through apps.\n\nIn the last two years since app-based aggregators entered the city airport, the Association claims it has lost more than half of its business. R. Subbarao, CAPTDA secretary, said if the government or the AAI does not step in to help them, CAPTDA members will face ruin. Mr. Subbarao also claimed that CAPTDA members charge the least.\n\n“Two years ago, we used to do at least 10-12 trips a day. The number has come down to 2-3,” said R. Ganesh, a driver.\n\nDeepak Shastri, Airport director, said CAPTDA was allowed to operate taxis from a piece of land inside the airport in 1989 through a G.O., and that “they should make the most of it.” He added that the drivers have to understand that they have to adapt to change in order to survive in this era. “AAI will intervene only if app-based taxi operators infringe on the right of CAPTDA to operate taxis inside the airport,” said Mr. Shastri.\n\nHe confirmed that the AAI was finalising modalities for the tender for taxi pick-up space at the airport. “We are in the feedback stage of the process,” said Mr Shastri.", 
    "section": "national", 
    "title": "A tender that may spell doom", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}