{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The court buildings in the Coimbatore Combined Court will be provided with various basic facilities such as ramps for the convenience of differently abled staff and the public. Justice R. Sudhakar from the Madras High Court, who is also portfolio judge for Coimbatore, gave instructions for the same to the authorities here after inspecting various court buildings on Thursday.\n\nThe portfolio judge was here for a two-day inspection that will continue on Friday as well. At the inspection conducted after a gap of five years, Justice Sudhakar also said that a crèche like facility will be inaugurated at the integrated court complex in a couple of days to make it convenient for the women judicial staff and lawyers.\n\nAfter visiting the record rooms, he instructed Public Works Department (PWD) officials to install fire alarms and sensors and carryout other precautionary measures needed to safeguard the records in all the record rooms. He also instructed the judicial officials to switch to modern records management techniques such as digitalisation. Justice Sudhakar inspected the buildings at the Old Magistrate Court (popularly known as the Kudhirai Vandi Court) and asked the PWD to renovate and preserve the heritage structure without delay. He also formed a ‘Task Force Team’ to rectify the defects that he identified during the inspection.\n\nEarlier that day, the portfolio judge also conducted a review meeting with Collector Archana Patnaik, City Police Commissioner A. Amalraj and Superintendent of Police for Coimbatore District, R.V. Ramya Bharathi, in which he asked them to dispose of the pending cases. He also asked the judicial officers to take effective steps for the speedy disposal of cases.\n\nThe judge also listened to the grievances of the judicial staff and inaugurated a health camp for them on the court premises. Principal District Judge R. Pongiappan and the other district judges and magistrates were also present for the inspection and review meetings and inspection.", 
    "section": "national", 
    "title": "Basic facilities in Coimbatore courts to be improved", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}