{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Efforts should be taken to include entrepreneurship as the essential part of Indian higher education system, said Kyungsoo Kim, Consul General of the Republic of Korea, Chennai, here on Wednesday.\n\nAddressing the second International conference on “Role of Management Education in Promoting Entrepreneurship in the Globalised Business Environment”, organised by Periyar Institute of Management Studies, at Periyar University here, Mr. Kyungsoo said that universities should take steps to design appropriate curriculum with regard to entrepreneurship. Cooperation should be enhanced to a greater extent between India and Korea in fostering entrepreneurship education.\n\nHe said that India and Korea had strong relationship between them in many fronts and Tamil Nadu was a major destination for Korean investors. Korea was committed to uplift the standard of living of the consumers by offering consumable products and technology-oriented products with superior quality and performance.\n\nEducation and business were the common platform between India and Korea, he added.\n\nC. Swaminathan, Vice-Chancellor of the university, said that entrepreneurship played a vital role in the economic development of countries all over the world. Since the job market could reach a saturation point and the inventory of available jobs may be exhausted soon, creating entrepreneurs would go a long way towards development of economy as well as job creation, he added.\n\nM.B.M Ismail, South Eastern University of Sri Lanka, Desti Kannaiah, James Cook University, Singapore, and D.V. Venkatagiri, chief executive officer, The Global Trade Driver, Chennai, also spoke.\n\nNearly 400 participants from various institutions participated and presented their papers in various sessions.", 
    "section": "national", 
    "title": "Call to include curriculum on entrepreneurship in higher education", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}