{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Amendments to Export Promotion Capital Goods (EPCG) scheme that came into force during the current fiscal are causing many a hardship to the job working units in the apparel production chain in Tirupur knitwear cluster.\n\nNew procedures of the scheme mandates that the units which imports capital goods like machinery at zero duty should compulsorily have to come out with the finished products (ie garments) which could either be exported by the respective units or by third party as part of the export obligation fulfilment.\n\nMain concern\n\n“This stipulation causes the main concern in a cluster like Tirupur where production chain is disintegrated. For example, dyeing and printing units that constitute only few segments of the production, import lots of machinery but at the same time will not come out with end products by itself,” pointed out S. Dhananjayan, a chartered accountant and industry consultant.\n\nA consultant for EPCG schemes pointed out that interactions with many of the job working units revealed an interesting fact that a good chunk of the entrepreneurs who did not directly make finished goods, were even unaware of the minute nuances of the framework and guidelines in the revised procedures.\n\nMany of them presume that it was enough if the export obligation of six times the duty saved on capital goods imported under the EPCG scheme can be fulfilled in six years, to avail the duty benefits.\n\nM. Velusamy, an apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council), feels that industrial clusters like Tirupur should be treated as a ‘single entity’ when it comes to giving away the benefit of duty exemption under EPCG scheme.\n\n“This is because of the nomenclature of the clusters like Tirupur where contribution from each segment of the production chain was important towards apparel making though the units in the production chain remains mostly scattered.\n\nSo, any high-end machine imported for units at the lower rung of the production chain are used only towards manufacturing of apparels that eventually get exported,” he observed.", 
    "section": "national", 
    "title": "Changes in EPCG scheme cause hardship to units", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}