{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Smart proposals for flood mitigation, non-motorised transport, smart parking management, improved water supply and drainage are all set to be implemented in Chennai under the Smart Cities Mission.\n\nThe proposal made to the Centre focussed on the vision of “an attractive, productive and inclusive Chennai, providing a smart urban network environment, where the majority of its residents live and work within walking distance of high quality rapid transit, with accessible and reliable urban services and whose public spaces support a good quality of life.”\n\n“We will start preparations of detailed project report for the proposals approved under the Smart Cities Mission. In addition to the Rs. 1,000 crore to be released over a period of five years by the Central and State governments, multilateral agencies will fund smart cities mission projects,” said an official of Chennai Corporation.\n\nSome of the projects such as a pedestrian plaza in T. Nagar have been included in the proposal sent by the Corporation. “One of the two parts of the proposal includes implementation of a non-motorised transport policy with solid waste management, better street lighting with LED lights, smart traffic and parking management systems,” said Aswathy Dilip, Manager-Communications, Institute for Transportation and Development Policy, which assisted Chennai Corporation in finalising the proposal .\n\n“Chennai’s streets have seen very high road fatalities with four people dying every day in road accidents, and there is a decline in walking and cycling as modes of transport, indicating a strong need to focus on better streets. This is the reason why promoting non-motorised transport was selected as the main pan-city initiative,” she said.\n\nFor the area-based proposal, T.Nagar was selected following various stake-holder consultations.", 
    "section": "national", 
    "title": "Chennai to focus on flood mitigation measures", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}