{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students of schools and colleges and the public can visit Central Marine Fisheries Research Institute’s Thoothukudi Research Centre here on February 3 as part of the Founding Day celebrations.\n\nSpeaking to reporters here on Thursday, Principal Scientist of CMFRI P.P. Manoj Kumar said Central Marine Fisheries Research Institute, under the Indian Council of Agricultural Research (ICAR), is the premier nodal research organisation conducting research on various aspects of Marine Fisheries in India. CMFRI, with its headquarters at Kochi, has seven research centres and three regional centres and a Krishi Vigyan Kendra situated along the country’s east and west coast catering to the needs of all the maritime States of India in the marine fisheries sector.\n\nThe Thoothukudi Research Centre of ICAR – CMFRI, situated near Roche Park on South Beach Road is conducting researches in various aspects such as fishery resource assessment, environmental monitoring, bio diversity and socio economic studies of fisherfolks of this coast.\n\nThe institute is also known for its contribution towards development of various molluscan fisheries technologies, seed production of sea cucumber over these years.\n\nOn Founding Day\n\n“To cite a few are Bi-valve Seed Production technology, pearl culture technology, farming of edible oysters, technology development on marine ornamental gastropods and tissue culture. TRC of CMFRI throws open its research laboratories and other facilities to the public every year on the occasion of its Founding Day, February3, 1947. This year also the Centre would be kept open for school and college students and the public on February 3 between 10 a.m. and 4 p.m. with break for lunch between 1 p.m. and 2 p.m.,” Dr. Manoj Kumar said.\n\nCorporation Commissioner Poongodi Arumaikkan will formally inaugurate the ‘Open House.’ There will also be continuous video shows on select topics of marine fisheries in the auditorium.", 
    "section": "national", 
    "title": "CMFRI research facilities open for public view", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}