{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Two children, aged less than three with congenital deafness, will soon be able to hear sound for the first time in their lives as doctors at Government Rajaji Hospital (GRH) have recently performed cochlear implant surgeries on them.\n\nThe doctors said that it was the first time cochlear implant surgery was performed in Madurai. Though the surgery, costing about Rs. 7.5 lakh, had been covered under amil Nadu government’s Chief Minister’s Comprehensive Health Insurance Scheme (CMCHIS), only five hospitals in the State — government hospitals in Chennai, Coimbatore and Nagercoil and two private hospitals in Chennai — had been empanelled to perform the surgery under the scheme.\n\nChildren from Madurai and surrounding regions had to go to Chennai for the surgery earlier. Many of the children had to be taken to Chennai even after the surgery as the procedure involved post-operative audio-verbal therapy sessions for a year. “Now, we are collaborating with the Hearing Aid Centre in Madurai so that the children can continue their therapy sessions here itself,” said N. Dhinakaran, Head of the ENT department at the GRH.\n\nBoth the beneficiaries — S. Ajay from Madurai and J. Rudrapriya from Sattur in Virudhunagar district – hailed from poor families. Speaking to The Hindu , their family members said that though they identified their children to be aurally challenged when they were about two years old, they could not get the implants done as they had to go to Chennai.\n\n“Though all medical expenses will be covered under the insurance scheme, we cannot afford accommodation in Chennai for long,” said S. Aarti, Ajay’s mother.\n\nL. Arul Sundareshkumar from the ENT department said that cochlear implants could not be done for everyone with profound deafness. “They have to be screened for other medical conditions, including autism, that can render the cochlear implants ineffectual,” he said.", 
    "section": "national", 
    "title": "Cochlear implants done at Madurai GRH", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}