{
    "author": [], 
    "text": "RELIGION\n\nBaladhandayuthapani Swami Thirukkoil: Abishegam, Sukrawarpet, 10 a.m.\n\nVikasatarangini Trust: Discourse on Bhagavad Gita by Sri Sri Sri Tridandi Chinna Srimannarayanan Ramanjua Jeeyar Swami, Nani Auditorium, 6.30 p.m.\n\nCULTURE\n\nSri Thyaga Brahma Gananjali: Music Festival, Sri Venugopalaswamy Temple, 6 p.m.\n\nGENERAL\n\nCoimbatore Vizha: Launch of 8{+t}{+h}edition of Vizha, Brooke Fields Mall, 4.30 p.m.\n\nWestern Ghats International School: Medical Expo, PG Pudur Ettimadai, 9.30 a.m.\n\nThe Institute of Indian Foundrymen: 12{+t}{+h}IFEX inauguration, 10 a.m.; 64th Indian Foundry Congress inauguration, CODISSIA Trade Fair Complex 4.30 p.m.,\n\nSri Ramakrishna Hospital: Mega blood donation camp, 9 a.m.\n\nJansons School of Business: Industry Connect JSB HR Summit 2016, Sivaganga Auditorium, Karumathampatti premises,\n\n9.30 a.m.\n\nKalaingar Karunanidhi Institute of Technology: One-day national workshop, conference hall, 9 a.m.\n\nThe Coimbatore Productivity Council: Training programme on “Energy Conservation & Harmonics Mitigation’, 9.30 a.m.\n\nThe Indian Chamber of Commerce and Industry: Programme on “Six Sigma Entrepreneur Skills”, Chamber Towers, Coimbatore, 10 a.m.\n\nDr. Mahalingam College of Engineering and Technology: Workshop on “Open Source Technologies”, Campus premises, 9 a.m.\n\nKarunya University: International Conference on Canadian Studies, Elohim Auditorium, 10 a.m.\n\nShri Nehru Maha Vidyala: Workshop on “Visual Basic & Internet and Web Designing”, Computer lab,\n\n8:30 a.m.\n\nGem Hospital & Research Centre: Women’s Health Expo, Pankaja Mill Road, 11 a.m.\n\nSankara College of Science & Commerce: Lecture on “Manampol Vazhkkai and Marundhilla Vaithiyam”, Dhanam hall, 1:15 p.m.\n\nCIMAT: Workshop on “J2EE” for MCA students, Accent Techno Soft, 9:30 a.m.\n\nHindusthan Polytechnic College: State-Level Technical Symposium on Science and Technology, 9:30 a.m.\n\nCODISSIA: Entrepreneur development programme, Huzur road, 3 p.m.\n\nDr. SNS Rajalakshmi College of Arts and Science: Lecture on “Ethical Hacking”, 10 a.m.\n\nSri Jayendra Saraswathy Maha Vidyalaya College of Arts & Science: Lecture on “Big Data Analysis”,\n\n11 a.m.\n\nHindusthan College of Arts and Science: Seminar on “Insight to Futuristic Bioscience”, 9:40 a.m.\n\nSri Kalaivani College of Education: Citizenship Training Camp, Vedic Mathematics and Teacher’s role in the society, 9:30 a.m.\n\nSNR Sons College: Workshop on “ET Market & E-FILING”.\n\nSNS Academy: Annual Sports Meet, Dr. SNS Rajalakshmi College of Arts and Science, 9:15 a.m.\n\nSree Narayana Guru College: Inter-College Cultural Festival, 9:30 a.m.\n\nDr. N.G.P. Arts & Science College: Extension activity on “Online Scholarship Examinations” for the students of Panchayat Union Middle School, 1:30 p.m.\n\nAdwaith GNS Matriculation Higher Secondary School: Annual Day celebrations, 6 p.m.\n\nGRG School of Management Studies: Annual inter-school event Urjith 2016, inauguration 10 a.m., valediction, 5 p.m.\n\nNanneri Kazhagam: Prof. Punithaa Ekambaram speaks on Viduthalaikku Vithitta Thyagigal, Sri Ramakrishna College of Arts and Science for Women, Avarampalayam Road, 10.30 a.m.\n\nPOLLACHI\n\nKongu Naatu Kaalnadai Thiruvizha: Cattle show, Zamin Samathur, near Pollachi, 9 a.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}