{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The farmers’ representatives made a forceful plea to the district administration to take effective steps for the construction of check dama to prevent the water flowing in the jugle streams on Kolli hills going waste into River Cauvery.\n\nChandrasekaran, a progressive farmer, raised this issue at the farmers grievances day meeting held here recently.\n\nHe said that during the monsoon season, the water in jungle streams, after filling the tanks, goes waste into River Cauvery.\n\nThere is much need of water for farm activities in the Kolli hills and its surrounding areas and as such, discharge of water into River Cauvery should be prevented.\n\nThis could be done by constructing check dams across the jungle streams which will go a long way in conserving water and using it for farm activities in the surrounding areas, Mr. Chandrasekaran said.\n\nRajendran, a milk farmer, said that a plea was made in the farmers grievances day meeting held three months ago for including milk in the daily menu of the noon-meal centres and anganwadis in the state to bring solace to the milk farmers and increase milk production in the State.\n\nBut the Government has not given any positive signal in this regard. V. Dakshinamoorthy, District Collector, who presided over the meeting said that the issue had already been taken to the notice of the Government. It is the government which has to take policy decision on the same, he said.\n\nThangavelu, complained that a large number of peacocks damage the standing crops in the field causing much loss to farmers and pleaded for steps to check this menace.\n\nThe official of the farmers department said that peacock is the national bird, and as such it could not be harassed. However, Mr. Dakshinamoorthy directed the forest officials to take steps to drive away the peacocks from the fields.", 
    "section": "national", 
    "title": "Construct check dams: farmers’ petition", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}