{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The fishermen grievance day meeting held at Radhapuram on Thursday witnessed a barrage of complaints levelled by country boat fishermen of the district against mechanised boat fishermen from Kanyakumari district who “cause extensive damage to small boats and fish nets by invading into the prohibited coastal areas in the nights”.\n\nCollector M. Karunakaran was chaired the meeting, in which fishermen from Koottapuli, Idinthakarai and Uvari complained that the mechanised boats from Chinna Muttom and Colachel areas were invading into the prohibited zone of three nautical miles from the coast for fishing. Even though this violation had led to mid-sea battles between both sides in the past as the loss suffered by the country boat fishermen would be enormous, no permanent solution this problem had been identified.\n\n“Since the mechanised boats damage fibreglass boats, fish nets and even kill fishermen on the high seas by callously carrying out fishing operations in the nights, it should either be banned permanently or at least regularised. Whenever such incidents happen, members of the mechanized boat owners’ association and the affected fishermen and their village committee members discuss the issue and determine the quantum of compensation. We want this mishaps to end permanently,” said Raymond of Uvari, who was backed by the fishermen from almost all coastal villages, including the president of Fishermen Federation Jones.\n\nAssurance\n\nDr. Karunakaran assured them that he would discuss this issue with the Kanyakumari Collector and arrive at an amicable solution at the earliest.\n\nRadhapuram panchayat union councillor Initha said that the cases pending against anti-Kudankulam Nuclear Power Project (KKNPP) protestors should be withdrawn as early as possible as the youths from Idinthakarai, the epicentre of anti-KKNPP agitations, could neither apply for passports nor get them renewed.\n\nThe Collector said that he would forward his recommendation to the government in this connection.\n\nMr. Raymond said that construction of a groyne in some coastal hamlets had been taken up without holding any discussion with the local fishermen.\n\nSound knowledge\n\n“We’re not scientists… but we have sound knowledge of the sea in our area. Hence, the knowledge we’ve gained through personal experiences over the past several decades can be utilised for forming the groyne in the most effective manner,” Mr. Raymond also said.\n\nCheranmahadevi Sub-Collector V. Vishnu and senior officials from the Department of Fisheries were present.", 
    "section": "national", 
    "title": "Country boat fishermen allege invasion by mechanised boats", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}