{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Congress councillor stages a sit-in protest against the failure of the Corporation to demolish a shop\n\nAn ordinary meeting of the Tiruchi Corporation Council was adjourned abruptly after the lone Congress councillor R.Hema staged a sit-in protest protesting against the failure of the Corporation to demolish a shop for construction of a dormitory as proposed by the civic body earlier.\n\nRaising the issue as soon as the meeting began, Ms.Hema wanted to speak on an ‘important issue’ but the Mayor A.Jaya, who did not allow her, said she could speak during the zero hour at the ordinary meeting that was to follow. She was shouted down by the Dravida Munnetra Kazhagam members who wanted the Mayor to allow their colleague V.Leela to speak on a subject in the agenda.\n\nMs. Hema who got a chance during the zero hour later demanded an explanation on why the one of the shops on Bharathiar Road in the city that were planned to be demolished for the construction of the dormitory as proposed earlier had not been pulled down so far. The Corporation Council in 2014 had decided to demolish the shops. Though a few other shops were demolished, one particular shop was not demolished due to vested interest, she alleged. A Corporation official replied that the shop could not be demolished as a case was pending in the court.\n\nNot satisfied with the reply, Ms.Hema wanted details of the case and an explanation on the action taken on her representation on the matter so far. She squatted in front of the Mayor’s table insisting that the officials provide the details immediately.\n\nHowever, several members of the DMK and the AIADMK wanted the Mayor to expel her from the meeting and allow councillors to raise other issue. Amidst noisy scenes, the Mayor adjourned the meeting abruptly even before the house could take up any of the items listed on the agenda for the ordinary meeting. Ms.Hema continued the agitation for a few hours after the meeting was adjourned and later withdrew the same after officials agreed to provide her the details.\n\nThe abrupt adjournment resulted in uncertainty over an official resolution on a move to cancel the contract awarded by the civic body, outsourcing garbage clearing operations in some of the wards in the city. The resolution pointed out that M/s.Srinivas Waste Management Services (Pvt) Limited was vested with the task of clearing solid waste from 11 wards and the Gandhi Market and Central and Chathram Bus Stands in the city. But there were complaints from the councillors and public over the performance of the agency. Though show cause notices were issued to the agency, there was no improvement in their performance. As councillors have been demanding the cancellation of the contract, the matter was placed before the council for a decision, the resolution said. But as the Mayor adjourned the meeting abruptly, there was no official word on whether the resolution was approved or not.", 
    "section": "national", 
    "title": "Council meeting adjourned abruptly", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}