{
    "author": [
        "S Senthalir"
    ], 
    "text": "Puducherry Lieutenant Governor addresses university students on India's capablities\n\nLieutenant Governor A.K. Singh delivering a special lecture on National Security and Role of Armed Forces at Pondicherry University on Thursday —Photo: T. Singaravelou\n\nLieutenant Governor of Puducherry A.K. Singh on Thursday said the country’s indigenous defence manufacturing capability had not matured and suggested increased technology collaboration with other countries in this domain.\n\nMr. Singh was participating in a Q&A session with students after his talk on ‘National Security and Role of Armed Forces’ at the Pondicherry Central University after inaugurating a Marine Animal House Building and laying the foundation stone for High Resolution Transmission Electron Microscope (HR-TEM) building.\n\nWhen a student asked why Indian government was not giving contract to private companies to develop military equipment, Mr.Singh said: “All that we manufactured went away after Independence. After Independence, we had to start virtually from the scratch and that is when Defence Research and evelopment Organisation (DRDO) came up. In the earlier years, it all remained confined to the public sector.”\n\nHe added that some these indigenously developed equipment had problems like Arjun Tank, Tejas aircraft.\n\n“I do not want to be critical but DRDO tried to showcase the indigenous capability whereas today the reality is no nation makes military equipment on its own. Even Americans take the best of Germany to manufacture equipment. We could have gone for collaboration. It has taken many years for us to mature. We are not yet matured in defence,” he said.\n\nMr.Singh noted that that the government was now opening up the military to private players.\n\n“We hope those who are making the best of technology will come here and make in India,” he said.\n\nOn the involvement of Army and policemen in Pathankot incident, he said that the instances of sabotage within the army have been few. Mr. Singh said: “This has been from times immemorial as Chanakya writes about the internal and external enemies. However, we have developed our intelligence well.”\n\nThe Lieutenant Governor termed Pakistan to be the principal national security threat while he viewed China as a long-term challenge for India.\n\nMr.Singh said that it was a noble idea to provide military training to all.\n\n“The societal norms have to be developed to the full potential. It is a challenge. We have strong capability but we are reluctant to use the capabilities,” he said.", 
    "section": "national", 
    "title": "‘Defence collaboration, the way to go’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}