{
    "author": [], 
    "text": "ERODE\n\nNandha Engineering College: Innovation Day 2016, P. Kasiannan, correspondent, AET Matriculation Higher Secondary School, Nasiyanur, inaugurates, 9.30 a.m.\n\nBannari Amman Institute of Technology: NSS special camp, 10 a.m.; laboratory inauguration, Panchayat Union Elementary Schools, Kaliyappagoundanpudur and Vettuvanpudur, 6.30 p.m. Erode Sengunthar Engineering College: NSS camp, inauguration by District Collector S. Prabakar, Gundri, 2 p.m.\n\nVelalar College of Engineering and Technology: Inauguration of VCET FOSS Centre by Ramesh Subramaniam, CEO, Flycart Technologies LLP, Coimbatore, and M. Raja, ECE, IRTT, Erode, 9.30 a.m.\n\nSALEM\n\nDistrict Administration: Farmers grievances redress meeting, V. Sampath, District Collector, presides, Collectorate hall, 10.45 a.m.\n\nCity Municipal Corporation: Council meeting, Mayor S. Soundappan presides, 11 a.m.\n\nPeriyar University: Department of Food Science and Nutrition, visiting faculty programme, valediction, M. Manivannan, Registrar, chief guest, 4 p.m. Knowledge Institute of Technology: Campus interview by Wipro Technologies, 10 a.m.; Knowledge Fest 2016, a talent competition for school students, 10 a.m.\n\nDhirajlal Gandhi College of Technology: Workshop on ‘towards creative programming,’ T.N. Raj Vignesh, hear-R and D and partner Salieabs Electrronics Engineers LLP, resource person, 10 a.m.\n\nSri Ganesh College of Arts and Science: Department of Computer Science and Applications conducts seminar on ‘Mobile Ad-Hoc networks and its implications,’ 10 a.m.\n\nShri Sakthikailassh Women’s College: Youth Red Cross conducts AIDS Awareness programme, 1 p.m.\n\nTamil Nadu State Agricultural Marketing Committee: Coconut and copra auction, Uthamasolapuram regulated market, 11 a.m.\n\nNational Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nNAMAKKAL\n\nFederation of Associations of Private Schools in Tamil Nadu: Motivation programme for teachers, Minister for School Education K.C. Veeramani and Minister for Industries and Transport P. Thangamani participates, Paavai Educational Institution, 9.30 a.m.\n\nPaavai College of Engineering: Campus recruitment by INFAC India Private Limited, 10 a.m.\n\nDepartment of Handlooms and Textiles: Handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 9.30 a.m.\n\nMahendra Engineering College: Department of Management Studies conducts investor awareness programme, R. Krupa Sankar, Assistant Manager, National Stock Exchange of India Limited, Chennai, key note address, 10.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}