{
    "author": [
        "P V Srividya"
    ], 
    "text": "First there were stuffed tiger toys to scare off the elephants; then came an organic ‘elephant repellent’; and now there is a blazing “fence of fire”.\n\nCall it enterprise, or desperation – but for farmers cultivating crops bordering reserve forests, any method that holds out a promise to protect crops from the onslaught of migrating elephants is worth a try. Here in the villages surrounding Sanamavu reserve forest, farmers are setting up a “blazing fence” to ward off the elephants after the dark.\n\nFarmers in Birijepalli, D.Kothur, Aliyaalam and the outlying villages have set up 3-feet-wide bunds, padded with plastics, and rubber. This boundary of plastics and rubber is then set on fire.\n\nPeople collect polythenes, plastics and tyres and pile them up . “Tyres and tubes are cut and lit up. The fire lasts for a few hours,” says a local source. Thereafter, the trail of smouldering embers would continue to keep the elephants away, believe farmers.\n\nThe past few days had witnessed significant crop depredation on the Eastern side of Sanamavu reserve forest. The farmers of villages close to the Reserve Forest were worst hit, after 70 elephants unleashed sporadic rampage on crops. A few hundred acres of crops were reportedly destroyed. Early this week, forest department undertook night vigils, chasing the herd into Denkanikottai RF.\n\nIn August 2014, farmers in and around Sanamavu range took to stuffed tiger toys on their fields to scare off the elephants. However, the stuffed toys did little even to ward off the cattle .\n\nThis aside, the forest department tried out on pilot basis an organic product, touted as an ‘elephant repellent’ .\n\nHowever, farmers were least enthused to allow the spraying of an unknown “repellent” on their crops.\n\nAsked about the fire fencing that farmers have resorted in some areas, the District Forest Officer E.Rajendran said the department does not encourage such methods.\n\nFarmers near Sanamavu forest range form a fence and lit fire to it", 
    "section": "national", 
    "title": "Farmers fire fence to ward off elephants", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}