{
    "author": [
        "S Ganesan"
    ], 
    "text": "The city’s failure to make it to the first list of 20 Smart Cities has come as a huge disappointment to civic activists.\n\nExpectations were running high among city residents after the city topped in the rankings in the State among cities shortlisted for being developed as Smart City by the Union government. But Thursday’s announcement came as a huge let down.\n\nActivists pointed out that this was not the first time that the city had lost out on major projects and failed to get the much needed capital infusion for development of civic infrastructure. Under the UPA regime, the city failed to make it to the list of cities that were developed under the Jawaharlal Nehru National Urban Renewal Mission (JNNURM).\n\n“This is not the first time we are losing out. It is highly disappointing to find the city failing to make the grade in the first list after all the extensive deliberations. Though the city deserved better, there is no political lobby to project the city’s cause. We will soon convene a meeting of civic organisations and draw up a plan to register our protest,” said M.Sekaran, president, Federation of Consumer and Service Organisations.\n\nCivic activists also hope that the Corporation would do better and improve on its proposals to get the city included in the next phase. “It is very disappointing to know that Tiruchi Corporation failed to get into the Smart City bus in the first attempt. There was enthusiastic participation from the citizenry and suggestions poured in. They need better understanding, presentation and stronger thrust to be included at least in the second list. We appeal to the Central Government to call for presentations again and prepare the second list at the earliest. The Corporation should make use of the extra time obtained to make the proposals more impressive,” said S.Pushpavanam, Secretary, Consumer Protection Council, Tamil Nadu.\n\nAccording to available indications, the consultant, Jones Lang LaSalle (JLL), in association with Townland Consultants Pvt. Ltd., and Tata Consulting Engineers Ltd., who had drawn up the city’s proposal for the nationwide Smart City challenge, would be involved in improving the proposal for the next phase of selection too.\n\nThe first list of winners of 20 cities made it to the top of the competition based on the implementation framework, including feasibility and cost-effectiveness which has a weightage of 30 per cent, followed by result orientation (20 per cent), citizen participation (16 per cent), smartness of proposal (10 per cent), strategic plan (10 per cent), vision and goals (5 per cent), evidence based city profiling and key performance indicators (5 per cent) and processes followed (4 per cent).\n\nIt was still not clear on where the city’s proposal had lagged behind. The Union Ministry of Urban Development is likely to send observation and comments on the city’s proposal and only then it would be possible to find out where the city had fallen behind. Nevertheless, city could still make to the next list as it was one of the 98 cities shortlisted for the Smart City Mission. The next two years will see the inclusion of 40 and 38 cities, respectively, sources said.", 
    "section": "national", 
    "title": "First list of smart cities: disappointment over failure of Tiruchi", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}