{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Opening day’s show at PTDC Seagulls Restaurant will feature a variety of bands and acts in indipop and rock genres\n\nIndipop meets urban folk and retro rock at the two-day 13th annual Freedom Jam - Pondy Music Festival which gets under way here on Saturday.\n\nThe free-spirited music festival that is a celebration of diverse genres and styles has become the defining features of the city, thanks to a group of music aficionados and the support of the Department of Tourism.\n\nWhile the city, from the days of French rule has been exposed to musical influences from the West, the Freedom Jam festivals can be said to best reflect its spirit of openness to genres as eclectic as reggae and rock to hip-hop and fusion.\n\nExpanding the list of illustrious musicians who have associated with the Freedom Jam sessions, violin virtuoso L. Shankar, blues and folk rock exponent Eric Schaefer and troubadour Alan Rego are gracing the 13th edition.\n\nThe opening day’s entertainment will be organised at the PTDC Seagulls Restaurant, Rue Dumas featuring a variety of bands and acts in the indipop and rock genres.\n\nThe performers include Eric Schaefer, Shivan and Manosh who will croon Hindi golden oldies, fusion band Raging Hormones, classic retro rock band H2O Live, Tamil acoustic funk band Oorka and troubadour Alan Rego.\n\nThe second and final day of the event features a string of post-sunset concerts on the Beach Road near Tourist Information Centre.\n\nThe performances include Tamil folk music by Janarthanan Folk Troupe, electric blues set to desi beats by Baja and a grand finale by EDM stalwarts Radiotronics featuring the legendary L. Shankar who founded experimental acoustic group Shakti along with British guitarist and exponent of East-West fusion John McLaughlin, Zakir Hussain and Vikku Vinayakram.\n\nAccording to Siddhartha Patnaik, a musician and one of the key organisers of the Freedom Jam events in this city and Bengaluru, it would indeed be a privilege for Freedom Jam and Puducherry to witness a live act by Shankar, who has been part of innumerable fusion ensembles during his time at Wesleyan University, Connecticut, US and has composed, played and sung along with Peter Gabriel for the Grammy winning score of Martin Scorcese's 'Last Temptation of Christ'.\n\nMr, Shankar has just completed an EP with progressive EDM songs which is to be released shortly.\n\nIn fact, when invited to perform at the Freedom Jam, Mr. Shankar is reported to have said that he too looked forward to performing at the festival and share “our music which is designed for international audiences and festivals.”\n\n“It will be a first for the Freedom Jam festival to feature proper electronica and we couldn’t have asked for a better initiation than a performance by the maestro” Mr. Patnaik said.", 
    "section": "national", 
    "title": "Freedom Jam music fest tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}