{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The city corporation is keenly pursuing with the State Government its Rs.-98 crore proposal for funding the cost of re-laying roads dug up for laying underground drainage pipelines, under the second phase, sources said.\n\nPromise\n\nThe corporation was promised funds out of the Rs. 1,000 crore administrative sanction accorded by the Municipal Administration and Water Supply Department for restoration of roads in urban local bodies.\n\nThere has been an apprehension among Councillors cutting across party lines that the proposal if not pursued on a war-footing would be delayed inordinately in view of the Assembly elections later this year.\n\nAccording to corporation sources, there was scope for completing the road restoration works before the Assembly elections. However, there is no certainty that the entire amount will be provided\n\nTURIF\n\nErode is among the 12 municipal corporations, 124 municipalities and 528 town panchayats, entitled to a share in the Rs. 1,000 crore road restoration fund that includes Rs. 420 crore under Tamil Nadu Urban Road Infrastructure (TURIF) Programme, and a same amount accruing from 14th Finance Commission grants. The rest constitutes loan.\n\nAccording to corporation sources, the Project Sanctioning Committee for TURIF was on the verge of approving funding for Erode.\n\nThe government had readied the funding responding to repeated requests by urban local bodies.\n\nAs in the case of other local bodies, Erode City Corporation required specific funding to carry out the road re-laying works.\n\nLate last year, the corporation has started the work under Phase I on restoration of roads dug up for laying pipelines for underground drainage project two to three years back.\n\nThe civic body was provided Rs. 25 crore for the purpose by the State Government, the sources said.", 
    "section": "national", 
    "title": "Funds awaited to re-lay roads", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}