{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Residents in the western suburbs often postpone visits to some government offices fearing long wait in cramped spaces.\n\nSeveral offices are functioning either from rented premises or sharing space in other government buildings as they do not have their own office space.\n\nThe Ambattur court complex is functioning from a small space in Chennai Corporation’s zonal office. Residents of Padi and Mogappair have to visit Ambattur Tahsildar office for enquiries and to get certificates from the Revenue Divisional Office on the same premises.\n\nS. Seetha of Ambattur said many government offices in the area are located in interior streets where transport connectivity is poor.\n\nHundreds of people, who throng the Regional Transport Office, Ambattur, endure hardships as they have to vie for space in the cramped office on the first floor of a rented building at Ambattur OT. T.Gunaseelan of Ambattur complained that there is no proper hall for visitors or parking space for the RTO office.\n\nThis was bifurcated from the Red Hills RTO four years ago. While the one at Red Hills has its own premises, Ambattur RTO is still struggling for its own structure.\n\n“Residents often find it difficult to locate the sub registrar office as it is located on an interior street off CTH Road. Such offices must be located on arterial roads,” he added. The Avadi fire station does not have its own building and firemen often get delayed when attending cases in the interior areas of Avadi.\n\nPublic Works Department officials said the increasing land cost becomes a hurdle for government agencies to build their own offices. The department has suggested that a vacant site on Thirumangalam Road can be used to build a court complex in Ambattur. Though Rs. 2 crore has been allotted for a new Madhavaram taluk office at Puzhal, the proposal is pending due to a land dispute. The project to shift Maduravoyal taluk office to a permanent building on Arcot Road, Valasaravakkam, is also waiting for government clearance, sources added.\n\n(Additional reporting by D.Madhavan)\n\nThere are many government establishments that function from borrowed spaces", 
    "section": "national", 
    "title": "Govt. agencies struggle for space", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}