{
    "author": [
        "Staff Reporter"
    ], 
    "text": "SHOWING THE WAY:Justice V. Ramasubramanian of the Madras High Court addressing a function held for the launch of Dindigul Bar Association website in Dindigul on Thursday.— PHOTO: G. Karthikeyan\n\nPatience, perseverance, hard work, tolerance and continuous learning are the basic qualities required for one to shine in legal profession, according to High Court Judge V. Ramasubramanian.\n\nLaunching the official website of Dindigul Bar Association and honouring senior lawyers at a function held here on Thursday, he said that polite speech was the key to success. First, lawyers should instil confidence in clients and win their confidence by giving right advice.\n\nLegal profession was the only profession that crossed all barriers of class, creed, caste and religion. Unlike senior lawyers who depended on books and libraries to update their knowledge, the young lawyers now had internet facility to get all information at their fingertips.\n\nWinning confidence of clients was the first step to victory in this profession. Above all, patience was the basic tool to handle cases.\n\nFour ‘C’s – duty towards clients, courts, colleagues and community at large – will help them succeed. If lawyers followed them sincerely the fifth C – crorepati status – would come to them automatically. Lawyers should not consider legal profession a money making one, but work with dedication, he stressed.\n\nHe stated that only 10 per cent of lawyers had been handling 90 per cent of the total cases pending in courts. He said that the experience of seniors and their subordinates was essential to mould lawyers.\n\nSenior lawyers, in their acceptance speech, appealed to the juniors to restore and preserve the glory of legal profession. Earlier, the High Court Judge honoured senior lawyers K. Subramanian, S. Jeganathan, B. Ragupathi, R.M.K.R. Kasinathan, N. Shahul Hameed, S. Hari Ramachandran and R. Sridharan, who completed 50 years in the field.", 
    "section": "national", 
    "title": "HC judge explains success formula to lawyers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}