{
    "author": [
        "Annie Philip"
    ], 
    "text": "In its second edition, the Pondicherry Heritage Festival 2016, scheduled to be held from February 5 to 7, will expand its scope to include built heritage, natural heritage, as well as heritage of performing arts, written word and visual arts. It will also include several new elements such as the launch of a multimedia mapping project of Puducherry.\n\nThe events include panel discussions, guided tours, art and cultural programmes, exhibitions, and nature walks. The inauguration and line-up of events will see the participation of India Director of UNESCO Shigeru Aoyagi; dancer Anita Ratnam, recipient of the Union government’s 100 top women achievers of India award; Puducherry-based dancer Krithiga Ravichandran; conservation architects K.T. Ravindran and Nilesh Thakkar; environmentalist Nityanand Jayaraman; Vieilles Maisons Françaises (VMF) president Philippe Toussaint; French government architect from Reunion Island Raphael Gastebois; and scientist M.V.Ramana Murthy from National Institute of Ocean Technology, among others.\n\nThe festival is being organised by the Indian National Trust for Art and Cultural Heritage (INTACH) Puducherry, People for Pondicherry’s Heritage, PondyCAN, and the Departments of Art and Culture and Tourism. It is being supported by several organisations such as the French Institute of Pondicherry and the Alliance Francaise of Puducherry and individuals.\n\nOrganisers aim to strengthen residents’ pride about Puducherry and its rich heritage and showcase this town’s “specialness.”\n\nSays Sunaina Mandeen, one of the organisers, “The festival aims to create a sense of identity among residents.”\n\nS. Varalakshmi, one of the festival organisers and former principal of Bharatidasan Government College for Women, says, “We have a beautiful heritage which has been handed down to us, and we must know how to preserve it. This is our legacy and our pride.”\n\nThe festival’s website, http://pondicherryheritagefestival.org/, was launched by Alliance Francaise Director Olivier Litvine on Thursday. Attendance for some events requires prior registration which can be done online.\n\nFocus on children\n\nThe Pondicherry Heritage Festival 2016 will have a special focus on children with the aim of inculcating in them a love for all things heritage — whether it means discovering traditional games or indulging in some story telling.\n\nA large chunk of these activities for children will take place throughout the three days of the festival at the Craft Bazaar at Gandhi Thidal.\n\nThe multimedia mapping project (using an Open Source map) will have children capturing things of interest to them such as arts, music, crafts, cuisines, architectural features and games on the map. Each indicator for a marked spot can include photographs, audio and video files, stories and even drawings, says Virginia Soukup, who is handling the project. It will later be opened to adults as well. The organisers hope to have a web-based version and an Android-based application for users.\n\nThe inauguration on February at 6.30 p.m. at Gandhi Thidal will include the recitation of a special poem on Puducherry, and a Bharatanatyam performance by Ms. Ravichandran. It will be attended by Chief Minister N. Rangasamy, Ministers, government officials, Ms. Ratnam and Mr. Aoyagi.\n\nThe closing ceremony at Gandhi Thidal will have a dance performance on natural heritage by Poojarini Chowdhury’s students from Anegundi Heritage Village and Lycee Français.\n\nIt’s aimed at strengthening residents’ pride about Puducherry and its rich heritage", 
    "section": "national", 
    "title": "Heritage festival expands in scope", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}