{
    "author": [
        "S Annamalai"
    ], 
    "text": "Henri Tiphagne, executive director, People’s Watch, during an interaction with The Hindu in Madurai on Thursday.— Photo: R. Ashok\n\nHenri Tiphagne, the first Indian chosen by Amnesty International for its Human Rights Award, feels that time has come for Indian philanthropists to support hardcore human rights activism.\n\nAmnesty International announced on January 25 that the 8{+t}{+h}Human Rights Award would be conferred on Mr. Tiphagne, executive director of Madurai-based People’s Watch, on April 25 at Maxim Gorki Theatre, Berlin, in recognition of his “exceptional commitment to human rights.”\n\n“Henri Tiphagne and his organisation People’s Watch, while fighting to ensure the rights of others, are themselves being harassed and hampered in their work by the authorities. And there are other civil society organisations in India that are in a similar position. The award is therefore meant to send a strong signal of support to the whole of the Indian human rights movement,” said Selmin Caliskan, Director of Amnesty International Germany, in a statement.\n\nRecounting his tryst with human rights activism, Mr. Henri says that he entered the arena when ‘human rights’ was treated as a “bad word.” There were at least two occasions when he wanted to resume his profession as a lawyer when the government closed the funding channels.\n\n“But I realised that defending human rights outside courts was my calling. When all these attacks on human rights defenders are taking place, I feel comforted that I have made the right option, though a painful option,” he says.\n\n“The Amnesty International Award is not for an individual but for all Indian human rights defenders, who are functioning under terrible restrictions even on protest and dissent. It is also for my mentors like K. Balagopal and K.G. Kannabiran who lived when award culture was not there for the type of work they did,” says Mr. Tiphagne.\n\n“In the modern context, foreign investment for industries is welcome but any funding to protect the rights of people is looked at with suspicion,” he notes.\n\nThe award, presented once in two years, is endowed with 10,000 Euros. The recipients of the award include Monira Rahman of Bangladesh (2006), Women of Zimbabwe Arise (2008), Abel Barrera of Mexico (2011) and Alice Nkom of Cameroon (2014).", 
    "section": "national", 
    "title": "‘Indian philanthropists should support human rights activism’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}