{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Additional Sessions Court acquits 22 others, including BSP State president K. Armstrong, in the 2008 case\n\nThe long-drawn legal tussle that followed the brutal clash between two sections of students of Dr. Ambedkar Government Law College, Chennai, in 2008, seemed to have reached its denouement here on Thursday, when an Additional Sessions Court convicted 21 persons and sentenced them to three years of imprisonment and acquitted 22, including Bahujan Samaj Party (BSP) State president K. Armstrong, in the case.\n\nAccording to the prosecution, on November 12, 2008, a fight broke out between two groups of students on the college premises, located near the Madras High Court, over ‘Thevar Jayanthi’ celebrations. The two groups attacked each other with deadly weapons, including iron rods and clubs, near the main gate of the college in full view of the public.\n\nFollowing this, two cases were filed by the Esplanade police, based on the complaints made by the then students Ayyathurai and Chithirai Selvan. Based on Ayyathurai’s complaint, 41 persons, including Armstrong, were named accused in the case. Similarly, based on Chithirai Selvan’s complaint, Bharathi Kannan and Arumugam were named accused.\n\nOn Thursday, based on the statements of 45 witnesses, 73 exhibits and 15 material objects, XVII Additional Sessions Judge M. Gomathi Nayagam convicted and sentenced 19 persons, including Chithirai Selvan, to three years’ imprisonment along with a fine of Rs. 15,000 each in the case, which had been filed on the basis of Ayathurai’s complaint.\n\nSimilarly, in the case filed on the basis of Chithirai Selvan’s complaint, the judge convicted and sentenced Bharathi Kannan and Arumugam to three years of imprisonment along with a fine of Rs. 10,000 each.\n\nSoon after the orders were pronounced, all 21 persons convicted under various sections of the IPC moved a memo before the Sessions Court to suspend their sentence as they would like to prefer an appeal against the order.\n\nAdmitting the plea, the judge suspended the sentence for two months, allowing them to move the appeal.\n\nMeanwhile, sources said that, according to the order, one copy of the judgement should be forwarded to the Commissioner of Police so that he could take action against investigation officer concerned for failure to discharge one’s duties at the time of the crime and also for commissions and omissions in collecting evidence to prove the offence mentioned in the final report.\n\nSaravanan Karuppasaamy, chairman, World Human Rights Commission and Rescue Center, who had filed a case in the Supreme Court seeking a CBI investigation into the clash, told The Hindu that he was happy with the judgement, but not over the investigation.\n\n“I am going to approach the Supreme Court and seek a CBI investigation into the issue. It appears as if the police have not been able to gather enough evidence in the case. The police have not submitted the primary evidence containing a compact disk which showed all the persons involved in the clash,” Mr. Karuppasaamy added.\n\nTwo groups of students clash on the campus of Dr. Ambedkar Government Law College on November 12, 2008; four are injured. The fight broke out over printing of a pamphlet to mark Thevar Jayanthi on October 30.\n\nFollowing complaints filed at the Esplanade Police station by both the groups, 39 students are arrested.\n\nState president K. Armstrong and lawyer Rajnikanth are added as accused stating that they abetted the offence.\n\nThe police are accused of being a mute spectator to the brutal clash.\n\nA day after the clash, police commissioner R. Sekar is shifted and replaced by K. Radhakrishnan.\n\nVarious political parties condemn the clash. Law colleges in the State are closed and violence spreads to other districts.\n\nA few days after the incident, the then DGP K.P. Jain, admits failure on the part of the police to prevent the clash.\n\nGovernment sets up a one-man commission headed by retired High Court Judge P. Shanmugham. He recommends departmental action against certain police personnel for dereliction of duty.\n\nIn September 2014, the Supreme Court, in a judgment, gives the George Town Metropolitan Magistrate in Chennai a year’s time to complete the trial.\n\nIn October 2015, the Supreme Court grants six months’ extension to complete the trial.\n\nOn 28 January, an Additional Sessions Court convicts and sentences 21 persons to three years’ imprisonment and acquits 22, including Mr. Armstrong", 
    "section": "national", 
    "title": "Law college clash: 21 awarded three years of jail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}