{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Aazhwargal Arulamudam’ by Shanmuga Thirukumaran, Railway Colony, 6.30 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Avvai Kural’ by A.K.S. Thirumavalavan, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPanniru Thirumurai Mandram: Abirami Anthathi Parayanam, mutrothal, Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nSri Swami Tatwananda Ashram: Upanishad class by Swami Samanandar, South Veli Street, 6.45 p.m.\n\nLourdes Shrine: 96{+t}{+h}anniversary celebrations, Holy flag hoisting, Rev. Peter Fernando former archbishop, presides, K. Pudur, 6 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 169{+t}{+h}Sri Thyagaraja Aradana Utsavam, young artistes’ concert, Lakshmi Sundaram Hall, 5.30 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nDistrict Administration: Awareness drive on plastic use, Collector K. Veeraraghav Rao inaugurates distribution of cloth bags to farmers, B.B. Kulam Uzhavar Sandhai, 8.30 a.m.\n\nPress Information Bureau: Public Information Campaign, second day event, Samayamurthi, chairman, Tamil Nadu Skill Development Corporation, speaks, 11.30 a.m.; ICT-ACT CEO Sivakumar speaks on ‘Scope in IT sector for youths in tier-II and tier-III cities,’ Medical College auditorium, 2.30 p.m.\n\nMadurai Kamaraj University: Training programme on ‘Climate change coverage in Indian print media’ by Radhika Mittal of TERI University, New Delhi, 10 a.m.; valediction and certificate presentation, Seminar Hall, Faculty Guest House, 3.45 p.m.\n\nRamya Neuro Hospital: Inauguration of neuro exhibition and neuro rehabilitation ward, Dr. R. Durairaj presides, K. Kuruviah, District Judge, chief guest, Dr. G. Sivaraman delivers lecture on health, IMA Hall, Panagal Road, 7 p.m.\n\nThiagarajar College: Lecture on ‘Adolescent health’ by B. Ashifa, Programme Officer, Family Planning Association of India, Madurai, M. Eyini, Principal, presides, Diamond Jubilee Hall, 9.30 a.m.\n\nSermathai Vasan College for Women: Health Hygienic Club conducts ‘Adolescents’ problems and solutions’ by Dr. Narumalar of Vijay Nursing Home, Conference Hall, 9.55 a.m.; Rotaract Club meeting, V. Bhanumathy, Branch Manager, City Union Bank, chief guest, Seminar Hall, 10 a.m.\n\nLakshmi Vidya Sangham: 52{+n}{+d}Annual Day celebrations, Dr. T. Badrinarayanan (alumnus of TVS Higher Secondary School) Head, Medical Services, Dr. Agarwal’s Eye Hospital, chief guest, Open Air auditorium, TVS Higher Secondary School, Lakshmipuram, 5.30 p.m.\n\nMadurai District Tiny and Small Scale Industries Association: Interaction meeting on ‘Role of TIIC in funding MSMEs’ with P. Ilango, Regional Manager, TIIC, L. Murari, president, presides, Maditssia Hall, Ambedkar Salai, 6 p.m.\n\nSATHYA: Jumbo discount fair, expo-cum-sale of home-needs and consumables, Tamukkum Grounds, 10 a.m.\n\nSaraswathi Narayanan College: Rotaract Club meeting, Raja Govindasamy, chief guest, M. Kannan, Principal, presides, 9 a.m.\n\nSourashtra College: Lecture on Mahatma Gandhi, Mahadev Vidrohi, chairman, All India Sarva Seva Sangam, Wardha, and T.R.N. Prabhu, Managing Trustee, Sevagram Ashram, Wardha, speak, Library Hall, 11 a.m.\n\nMannar Thirumalai Naicker College: 37{+t}{+h}Readers’ Club meeting, S. Muthulakshmi, Principal, Gandhian Thought University, speaks, Moorthy Naidu Andal Ammal Hall, 11.50 a.m.\n\nRotary Club of Madurai West: G. Mathalai Rajan speaks on ‘Conceptual Maths,’ Jain Vidyalaya, Palam Station Road, 6.30 p.m.\n\nThiagarajar College: Lecture on ‘Mobile apps and applications of image processing’ by M. Ganaga Durga of Government Arts College, Sivaganga, and G. Sofia of Lady Doak College, Principal Dr. M. Eyini presides, Diamond Jubilee Hall, 3.15 p.m.\n\nSBOA Matriculation Higher Secondary School: Seven-day NSS camp, third day events, sports competitions for school students, R. Dheenadayalan presides, 9 a.m.; talk on importance of first-aid by B. Jayanthi, Melakuyilkudi Community Centre, 3 p.m.\n\nTOPKIDS: Counselling at All Woman Police Station, Tallakulam, 10.30 a.m.\n\nAlcoholics Anonymous: Meeting, Grace Kennett Hospital, Ellis Nagar, 7 p.m.\n\nMELUR\n\nAlcoholics Anonymous: R.C. School, Sivaganga Road, 6.30 p.m.", 
    "section": "national", 
    "title": "Madurai today for jan 29 Friday", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}