{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Software for giving NOCs online to parties, candidates soon: CEO\n\nRajesh Lakhoni, Chief Electoral Officer, at the regional training for district election officers and police officers held in Chennai on Thursday.— Photo: B. Jothi Ramalingam\n\nChief Electoral Officer Rajesh Lakhoni on Thursday urged district election officers to make Assembly elections “truly accessible.”\n\nSpeaking at a training session for the district election officers and police officers, Mr. Lakhoni said work on development of software for online permission for a wide range of no-objection certificates for election preparations by all candidates and political parties would be completed shortly.\n\nMr. Lakhoni stressed the need for enabling all electors to vote and making information more accessible.\n\nHe also asked election officials to ensure enrolment campaign is done door-to-door.\n\nWith more than 15 per cent of the electors with disability, election officials have been sensitised to the need for explaining to such people why voting is important.\n\n“Some people need help to understand how certain things work. Disabilities can be invisible. Do not ask to show somebody their disability card,” said a trainer at the session.\n\nAs a preparatory measure for the forthcoming general elections to the Tamil Nadu Legislative Assembly, 2016, training for the District Election Officers, Additional District Election Officers along with the Police Officers were already conducted in Coimbatore and Madurai regions on January 12 and 19.\n\nThe regional training for the district election officers, additional district election officers along with the police officers of the Chennai region comprising Chennai, Tiruvallur, Kancheepuram, Vellore, Tiruvannamalai, Villuppuram, Cuddalore and Kirshnagiri was conducted at Anna Institute of Management, Chennai on Thursday.\n\nThe training covered issues related to IT management, election management, facilities for persons with disability and provision of postal ballot.\n\n‘Officials sensitised to the need for explaining to differently abled why voting is important’", 
    "section": "national", 
    "title": "‘Make elections truly accessible’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}