{
    "author": [
        "Special Correspondent"
    ], 
    "text": "3,000 enumerators trained by CMFRI officials to visit 11 lakh fishermen families to collect details\n\nP.P.Manojkumar, Scientist in-charge of CMFRI, addressing the training programme on National Marine Fisheries Census- 2016 in Thoothukudi on Thursday.— Photo: N. Rajesh\n\nAfter a gap of 6 years, the Central Marine Fisheries Research Institute, a research body under the Indian Council of Agricultural Research (ICAR-CMFRI), will begin a month-long National Marine Fisheries Census - 2016 from February 1 in all maritime States and two Union Territories of the country.\n\nSpeaking to reporters here on Thursday, Principal Scientist of CMFRI P.P. Manoj Kumar said the island regions of Andaman and Nicobar and Lakshadweep would be enumerated under the supervision of Fishery Survey of India.\n\nThe marine fisheries census would be conducted for a duration of 30 days from February 1.\n\nThe exercise includes collecting information about marine fishermen families, fishing crafts and gears, social and educational profile and demographic features of marine fishing villages.\n\nThis exercise, funded by Department of Animal Husbandry, Dairying and Fisheries (DAHDF) of Ministry of Agriculture and Farmers Welfare, Government of India is being coordinated by the staff of regional, research, field centres and headquarters of ICAR - CMFRI located along the maritime coast of the country.\n\nAbout 3,000 enumerators trained by ICAR-CMFRI officials will visit 11 lakh fishermen families spread across 4,250 marine fishing villages located in 73 districts to collect details. The entire process would be monitored and supervised by around 220 officials of ICAR - CMFRI posted at the 26 centres.\n\n“The enumerators will be given schedules formatted to collect details pertaining to social, educational, fishing infrastructure aspects of marine fisher families. The schedules are devised to collect information pertaining to each household on the above said details alongside specific fishing occupation particulars such as fishing, processing, handling, marketing and value addition,” Dr. Manoj Kumar said.\n\nThe schedules used at household level have been translated into eight regional languages. Apart from the schedules, the personnel involved have been provided an instruction booklet to clarify various heads under which details are being collected.\n\nAnother set of schedules have been devised to collect information pertaining to infrastructure facilities in fishing villages and other fish harvesting and processing facilities available in various coastal districts.\n\nThe ICAR-CMFRI authorities had already conducted training programmes for supervisors and prospective enumerators at various locations along the coastline.\n\nHelp in policymaking\n\nThe data would be analysed by the scientists of ICAR - CMFRI to develop a comprehensive census database, which would be helpful in facilitating formulation of fisheries related plans and policies in the marine sector, Dr. Manoj Kumar said.", 
    "section": "national", 
    "title": "Marine fisheries census from February 1", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}