{
    "author": [
        "R Rajaram"
    ], 
    "text": "(On top) Winners of The Hindu Young World quiz with the chief guest G. Natarajan, Director, Postal Services, Central Region, Tamil Nadu, in Tiruchi on Thursday. (above) A section ofstudents who participated in the programme.— Photos: A. Muralitharan\n\nIt establishes its lead over rivals right from the beginning in The Hindu Young World quiz\n\nIt turned out to be a superlative performance yet again by G. Siddharth and C. Aneesur Rahman of the Mount Litera Zee School, Tiruchi, who successfully defended their title in The Hindu Young World quiz held here on Thursday.\n\nThe brilliance of the two whiz kids in getting the answers bang on target kept them way ahead of their rivals right from the start of the 16{+t}{+h}edition of the annual contest.\n\nIt was indeed a great moment for the Mount Litera Zee School and for Siddharth, a class IX student, and Aneesur Rahman, studying VII, when they received a standing ovation from the audience at the end.\n\nThe two were winners in the contest held last year too.\n\nThe event in the packed M.D. Hall of BHEL campus was filled with enthusiasm, excitement and exhilaration with participants vying with others to reply in a jiffy to questions put forth by The Hindu ’s resident Quiz Master V.V. Ramanan.\n\nThis time around the contest saw the participation of 398 teams representing 52 schools situated across the central region and a few from neighbouring Salem and Namakkal districts as well.\n\nThe nearly three-hour long event open to students of Standards VII to IX started with preliminary written test containing a set of questions for the teams. Top six teams were eventually selected for the quiz contest based on the scores they had secured in the written test.\n\nIt virtually turned out to be an all Tiruchi show as five of the top teams that made it to the finals were from the city barring one from Karur.\n\nTwo teams from Sri Akilandeswari Vidyalaya, Tiruchi and one each from Sri Vageesha Vidyashram, Kamala Niketan Montessori School, Mount Litera Zee School and Chettinad Vidya Mandir, Karur made it to the finals.\n\nThe slew of questions picked out from different topics including Photo Play and Sight and Sound made it lively with the audience on their feet to reply to those that could not be answered by the participants.\n\nThe right answers from the audience earned them goodies offered by sponsors.\n\nFrom the word go, the team representing Mount Litera Zee School established a clear lead over their rivals which was maintained till the end to emerge victorious yet again scoring 151 points.\n\nThe team comprising Anirudh Renganathan and M.V. Ramanan of Sri Vageesha Vidyashramam were the runner up, while the Chettinad Vidya Mandir team members Nivedhita and Kanyalakshmi finished third.\n\nBicycles were given to the winning team, while trophies and certificates were given to others.\n\nParticipation certificates were given to all students. G. Natarajan, Director, Postal Services, Central Region, Tamil Nadu, distributed the prizes.\n\nThis year’s edition is sponsored by Vellore Institute of Technology. BHEL, Tiruchi, was the venue partner and Eagle Controls - the regional sponsor.", 
    "section": "national", 
    "title": "Mount Litera Zee School team defends title", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}