{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Business rivalry led to murder of cable TV channel owner in Madurai\n\nOne person was sentenced to life imprisonment and nine others were acquitted by the IV Additional District and Sessions Court here on Thursday in the case relating to the murder of ‘Vaigai’ Cable Television channel owner S. Gandhi in 2005.\n\nGandhi was hacked to death on the night of December 12, 2005 at his office in Kakkan Street in Shenoy Nagar here. The murder became sensational for the brazenness with which it was carried out. Rivalry in the then booming business of local cable television channels was cited as the reason. As Mathichiyam police in Madurai city failed to crack the case or arrest anyone, the case was transferred to Crime Branch - Criminal Investigation Department later.\n\nThe CB-CID arrested seven persons in 2008 and further investigations allegedly revealed that 12 persons were involved in the conspiracy and murder.\n\nAs two of them — D. Chandran and Y. Maniraj — died during the course of investigation, charge sheet was filed against 10 persons — A. Velmurugan, A. Balamurugan, R. Chandrasekar, A.T. Mathiyalagan, R. Sundararajan, Kanna Muthupandian, A. Mujibur Rahman, P. Karthik, P. Isakiselvam and P. Rajkumar alias ‘Kumili’ Rajkumar.\n\nThe CB-CID police, in the charge sheet, had alleged that four of the 10 accused were cable operators from different areas of Madurai and were paying commission to Gandhi, who was running the agency for distribution of cable television in the district.\n\nThe police had alleged that as business turned sour between the four and Gandhi, they murdered him with the help of others.\n\nDelivering the judgement on Thursday, Sessions Judge C. Sanjay Baba acquitted nine accused, including the four cable operators, citing that the prosecution failed to establish their involvement with convincing evidence.\n\nHowever, P. Karthik (38) from Thoothukudi district, the eighth accused in the case whom the police had claimed to be one of the persons who committed the murder, was convicted under IPC Sections 302 (murder), 449 (house-trespass to commit a crime punishable with death) and 148 (armed with deadly weapon).\n\nThe judge awarded life imprisonment for murder and another 10 years imprisonment for house-trespass. He ordered that both the imprisonment could run concurrently following which Karthik was taken to jail.\n\nThe murder became sensational for the brazenness with which it was carried out", 
    "section": "national", 
    "title": "Murder: one sentenced to life, nine acquitted", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}