{
    "author": [
        "L Renganathan"
    ], 
    "text": "Carnatic music filled the air in Tiruvaiyaru on the banks of Cauvery river on Thursday as legendary exponents and devout rasikas sang in unison to salute the spirit of poet composer Sri Tyagaraja in front of his samadhi on the occasion of his 169th aradhana celebrations.\n\nDevotion and dedication was in full view as colourful personalities of Carnatic music world lined up to pay their tributes to the saint who attained eternal stature this Pushya Bahula Panchami day in 1847.\n\nThe morning began with the ritualistic unchavritti procession in which the idol of Saint Tyagaraja was carried on a palanquin from the house on the Thirumanjana Street in Tiruvaiyaru where he lived to the music festival pandal.\n\nThen to the accompaniment of nadaswaram and thavil, special abishekam for the Sri Tyagaraja idol in his samadhi mandapam began.\n\nAfter the customary mangala isai by nadaswaram and thavil exponents, flautist Prapancham S. Balachandran and others launched into the traditional keertans and were joined by several hundred musicians and rasikas who congregated at the samadhi grounds to sing in chorus the Pancha Rathna Kritis of Saint Tyagaraja that marked the high point of the whole celebrations that commenced on January 24.\n\nMusicians and artistes who participated in the chorus rendering included Haridwaramangalam A.K. Palanivel, Srimushnam V. Raja Rao, both secretaries of the Sri Tyagabrahma Mahotsava Sabha, O.S. Arun, Rudrapatnam Brothers R.N. Thyagarajan and R.N. Tharanathan, K.N. Sashikiran, P. Ganesh, Tiruvaiyaru Sekhar, Sudha Ragunathan, Nithyashree Mahadevan, Ranjani Gayathri, Mahathi, Mahanadhi Shobana, violinist M.A. Krishnamurthy and percussionist Neyveli Skandasubramanian.\n\nThanjavur Collector N. Subbaiyan, Sri Tyagabrahma Mahotsava Sabha president G.R. Moopanar and other prominent personalities participated in the programme.", 
    "section": "national", 
    "title": "Musicians pay tribute to Tyagaraja", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}