{
    "author": [
        "Special Correspondent", 
        "M Soundariya Preetha"
    ], 
    "text": "Discourse\n\nVikasa Tarangini Trust, Coimbatore, is organising a discourse on Bhagavad Gita by Sri Tridandi Chinna Srimannarayana Ramanuja Jeeyar from January 29 to 31 at Nani Auditorium at 6.30 p.m.\n\nCareer counselling\n\nGITAM University and The Hindu In School will organise a career counselling programme at SBOA Matriculation Higher Secondary School on Friday.\n\nThe programme, which begins at 1 p.m., aims at creating awareness among Plus Two students on professional and general higher education courses, selection of engineering branches and selection of institutes. It will also focus on management education, particularly at the undergraduate level. There will be a special question and answer session.\n\nPrayer festival from today\n\nA three-day prayer festival will be held at VOC Ground on Avanashi Road from January 29 to 31. The event is organised by Jesus Calls, Chennai, in which Paul Dhinakaran will lead the prayers from 5:30 p.m. on all the days. Special buses will be operated from the venue to various places after the meeting.\n\nPower shutdown\n\nOwing to maintenance work to be carried out at the Earipalayam sub-station of Tangedco, there will be no power supply to the following areas from 9 a.m. to 5 p.m. on Saturday : Kamanayakanpalayam, Earipalayam, Thannerpanthalpalayam, Allampalayam, Pudunallur, Nalligoundampalayam, Suripalayam, Charannagar, Vengigalpalayam and Pudupalayam.\n\nAustralian Education Fair\n\nAn Australian Education Fair has been organised at Hotel Vivanta by Taj on February 11 by IDP Education, It will be a platform for students to have a face-to-face interaction with 22 Australian institutions, to apply directly and get information on various courses and scholarship. Students should bring their original educational certificates along with photocopies or can directly register at the IDP office.\n\nAdoption camp\n\nHumane Animal Society will be organising an adoption camp for 40 puppies and 10 kittens at No. 39 and 40, W. Periasamy Road (Opposite Rao Hospital), R.S. Puram at 10 a.m. on Sunday. Indian country dog puppies and kittens will be available free of cost to responsible future owners and free veterinary assistance and free vaccine will be provided to the adopted puppies and kittens for life. People interested for adoption may contact on 93661 27215, 97915 32266, or 93671 44147. Also, people interested to do voluntary work may contact on 93661 27215, 97915 32266, 93671 44147.\n\nRelief fund\n\nAll employees of SNR Sons Charitable Trust contributed their one-day salary, which amounted to a total of Rs. 30 lakh, to the Chief Minister’s Relief Fund. The demand draft was handed over to Coimbatore District Collector Archana Patnaik by chief operating officer V Ramakrishna and chief executive officer C V Ram Kumar.\n\nCII conference\n\nConfederation of Indian Industry, Erode Zone, has teamed up with Erode District Small Industries Association and Micro, Small and Medium Enterprises, Government of India, to organise a conference on ‘Strategising for Business Excellence’ at Hotel Club Melange on January 30.", 
    "section": "national", 
    "title": "Must please. Fillers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}