{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Traffic islands are slowly turning into a safe haven for placing unauthorised hoarding as little action were taken against them in the city.\n\nAround five hoarding that are large in size are placed in the traffic island in front of the Suramangalam Police Station.\n\nThe island is located at the intersection of Junction Main Road and Suramangalam Main Road. Presence of these hoardings on one side of the island poses difficult for vehicle users coming from Junction Main Road as they are unable to see vehicles coming from Railway Junction.\n\n‘The island is turning into a dangerous spot for road users as vehicles coming in the other direction could not be seen due to the presence of these hoardings’, said a motorist V. Prakash.\n\nHe said that the banners are extremely larger in size and questioned why the authorities concerned failed to initiate action to remove it.\n\n‘These unauthorised hoardings are located just opposite to the police station and the traffic division office’, he added.\n\nThough Councillors had complained of unauthorised hoardings in public places many times and how it affects the public, the corporation had taken little action against the installers. ‘Anyone can place any hoardings on the roads without permission and disrupt traffic or the pedestrians’, a social activist said.\n\nThese hoardings include advertisements by showrooms, exhibitors, special camps for certain purpose and by individuals.\n\n‘Failure of corporation officials to initiate action against these unauthorised hoardings led to mushrooming of it in the city. Stern action should be taken’, said L. Pugal of Suramangalam.\n\nRoad users demanded that the corporation initiate action against the unauthorised hoardings so that these hoardings do not disturb the public.", 
    "section": "national", 
    "title": "No action against unauthorised hoarding in traffic island", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}