{
    "author": [
        "Special Correspondent"
    ], 
    "text": "If particular three identity proofs are submitted\n\nPeople seeking passport with three important proofs of identity — Aadhaar card, Permanent Account Number (PAN) card and Elector’s Photo Identity Card (EPIC) — are likely to get it within four working days even before police verification is carried out.\n\nThis announcement made by Union External Affairs Minister Sushma Swaraj came into effect from Wednesday, said Madurai Regional Passport Officer S. Maniswara Raja. Talking to reporters here on Thursday, he said that those three proofs of identity were mandatory to get the passport before police verification. The applicants would also have to submit an affidavit claiming that no criminal case was pending against them. Mr. Maniswara Raja said that the three documents provided ample proof that the applicant was an Indian national.\n\nHowever, he said that the RPO authorities would impound the passports and initiate legal proceedings against the applicants if they came to know through police verification report about any criminal case pending against them.\n\nThe RPO conducted a special camp for those who had applied for passport to undertake Haj pilgrimage.\n\n“With February 8 being the last date for Haj pilgrims to submit their applications along with their passports, we will strive to give them the passports before this deadline,” Mr. Maniswara Raja said.\n\nDeputy Inspector General of Police (Madurai Range) Anand Kumar Somani and Deputy Commissioner of Police (Law and Order-Madurai City) Bandi Gangadar participated in the special camp. The officials heard the grievances of Haj pilgrims and promised to clear their passport applications if they were in order. The DIG of Police promised to expedite the process of police verification.\n\nStating that passport application processing had become more efficient over the years, the RPO said that the number of Haj pilgrims coming for special camp had come down drastically from 450 in 2013 to less than 100 this year.", 
    "section": "national", 
    "title": "Now, get passport even before police verification", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}