{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Several groups of health workers are either on strike or are threatening to do so as the Health Department has not addressed their demands.\n\nThe Government Contract Nurses Welfare Association is demanding the regularisation of as many as 3,500 nurses who have been on contract for over five years. They should have been regularised after three years of service as per the original Government Order, the association said.\n\n“When we went on protest last year, Health Secretary J. Radhakrishnan had assured us hem that by December 400 nurses would receive postings and later in January the rest would be placed in hospitals. But nothing has come through,” said N. Nagajothi, association treasurer, which has around 10,000 members. The nurses were appointed on a salary of Rs. 4,000 and are eligible for one day’s leave every month.\n\nIn primary health centres that work 24x7, contract nurses are overburdened as they fill in when the permanent nurse takes leave. “Sometimes, we are on duty for two or three days at a stretch,” she said.\n\nThe nurses have threatened to go on strike if the government does not respond to their demands.\n\nMeanwhile, at the Directorate of Medical Services, a group of public health workers has been on strike since Tuesday.\n\nThe workers employed in the leprosy division had been bypassed while effecting promotions. They had protested last year and are now demanding that they be given their rightful dues. Despite assurances by the health department, they have not been promoted.\n\nTB workers’ plea\n\nOn Wednesday, TB employees went on a day-long hunger strike with a warning that it would be indefinite strike if their demands of better work conditions were not met.\n\nTheirs is a two-year struggle for higher salaries, insurance and leave benefits.\n\nDespite several petitions their appeals have not borne fruit they say.\n\nThe Central government TB division funds the programme, but the State government had not raised their salaries, said S.Anandhan, general secretary of the Tuberculosis Employees Association of Tamil Nadu.", 
    "section": "national", 
    "title": "Nurses seeking regularisation threaten to go on strike", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}