{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Dashing expectations, Oulgaret Municipality failed to find a place in the first list of 20 smart cities released by the Union Minister of Urban Development Venkaiah Naidu in Delhi on Thursday.\n\nWhile this is by no means the end of the road as the municipality continues to be in contention for resubmission of proposals in the second round of the Smart Cities Challenge, there is a sense of disappointment among administrators who believed that the municipality stood a good chance to be in the first list of cities to receive funding of about Rs. 100 crore over five years.\n\nIn fact, Puducherry had been the first off the blocks to submit the smart city nomination in July — barely within a month of the launch of the Smart City Mission —and had also figured among the early birds in the 20 cities on the short list that were required to submit detailed Smart City Proposals subsequently.\n\nThe detailed proposal which was submitted in December had outlined a vision to make Oulgaret - Puducherry a vibrant, enduring, and green economic and inclusive growth city with good governance using smart applications.\n\nEven as the government exuded confidence in Oulgaret making it to the first list, Chief Minister N. Rangasamy appealed to the Centre to also consider Puducherry in the list of cities included for the AMRUT scheme.\n\n“As of now, we will prepare for a resubmission of the Oulgaret proposal when the second round of the challenge is announced. However, our immediate focus is to take forward the agreement signed with the French agency on developing Puducherry as a smart city,” said Manoj Parida, Chief Secretary.\n\nAgence Francaise de Developpement (AFD), the French bilateral development finance agency, had inked agreements to develop Puducherry, along with Chandigarh and Nagpur as smart cities coinciding with the French President Francois Hollande’s visit to India a couple of days ago.\n\nThe MoU for a period of three years envisages technical and financial assistance for development of Puducherry as a smart city.\n\nWhile the AFD has committed to provide 2 billion euros of loan over the next three years to support smart cities and sustainable development, the technical cooperation programme will make available to the Puducherry Government a pool of French experts from the public sector (French municipalities, local public companies, agencies for urban planning), complemented by experts from private sector.\n\nMunicipality continues to be in contention for resubmission of proposals", 
    "section": "national", 
    "title": "Oulgaret misses the mark in Smart Cities Challenge", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}