{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Post graduate and research scholars pursuing biotechnology course at the Pondicherry University will have a Marine Animal House exclusively to carry out scientific research.\n\nLieutenant Governor of Puducherry A.K.Singh inaugurated the Marine Animal House Building in Pondicherry University on Thursday.\n\nThis house will be used to rear fish, shrimps and other marine organisms.\n\nThis facility will be used to test probiotics isolated from the fish and shrimps intestines, marine environment, immunostimulants like chitosan, chitin, glucan on different marine shrimp and fish to control fish and shrimp diseases like Vibriosis, Hemorrhagic Septicemia and White Spot Syndrome Virus (WSSV).\n\nThe facility is also used for testing of extracts (secondary metabolites) of sea weeds, mangrove plants and marine microbes on zebra fish atherosclerosis model.\n\nThe animal house has sea water and fresh water storage facilities in terrace in two overhead tanks (capacity 5000 liters each). Filtered sea water was brought from the shrimp hatchery near Anumanthai and stored in the tank.\n\nUsing the sea and fresh water both marine and freshwater organisms fish and shrimp, can be cultured in Fiber Reinforced Plastic Tanks (500 liters) in the ground floor.\n\nTwo Air –compressors (1 hp) in the ground floor also provides continuous aeration for the culture of animals.\n\nElectronic balance for weighing, refrigerator for storing feeds and samples, instruments for testing salinity, oxygen and pH of the water is also provided\n\nHe also laid the foundation stone for High Resolution Transmission Electron Microscope (HR-TEM) building.\n\nThis will pave way to advanced scientific research since this instrument can be used for high magnification studies of materials.\n\nMicro and nano world could be viewed through this instrument.\n\nThis High resolution makes it possible to view materials of atomic scale. This was used to develop IVT (In-vitro fertilisation).\n\nPondicherry University Vice-Chancellor (i/c) Professor (Mrs.) Anisa Basheer Khan presided over the function and Registrar (i/c) Dr. J. Sampath welcomed the august gathering.\n\nThe facility to be used to test probiotics isolated from the fish and shrimps intestines", 
    "section": "national", 
    "title": "Pondicherry varsity gets new Marine Animal House", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}