{
    "author": [], 
    "text": "SALEM: Salem’s not listed for the first phase of Smart Cities Mission is very much on the expected lines as the Smart City Proposal (SCP) submitted by the Corporation did not reflect the opinions of the stakeholders or the active participation of the residents.\n\nOf the 8.5 lakh residents in the city, less than 1.5 per cent participated in the polls as the civic body took no steps to devise any strategy to improve the public participation. Salem Citizens Welfare Association secretary P. Arulmani said that only one meeting with stakeholders was conducted in which less than 10 people participated.\n\nMany residents said that they are unaware of the proposal submitted by the civic body and it does not reflect the public opinion.\n\nThe civic body submitted a proposal for Rs. 2,162.30 crore. “Let the city roads turn motorable first,” said P. Mathew, an employee at a private concern. Corporation Commissioner K.R. Selvaraj expressed hope that the corporation would be short-listed for the year 2016-17 so that more development works could be undertaken.\n\nERODE: Trade and industry organisations, in particular, and the public in general are not entirely disappointed over exclusion of Erode from the first-phase implementation of ‘Smart City’ project by the Central and State Governments.\n\nThere was, no doubt, expectations from the Confederation of Indian Industry, Federation of All Trade and Industry Associations, and other organisations that funding from the Smart City project could be leveraged to set right the road infrastructure, and carry out pollution control measures. There is no cause for disappointment, though there is a pressing need for infrastructural interventions to decongest vehicular traffic.\n\nIn any case, it is only a matter of time before Erode city gets included in the project, KKSK Rafiq, Chairman of CII Erode Zone, said.\n\nIdeally, the development must be planned with focus on hygiene, pollution elimination, and adequacy of drinking water supply for sequential implementation. More importantly, there ought to be employment generation and economic progression, president of the federation Sivanesan said.\n\nTIRUPUR: It is with a disappointment that the knitwear entrepreneurs reacted to Tirupur not figuring in the first set of cities selected for implementation of ‘Smart City’ programme. People by and large feel that the State Government should put pressure on the Centre to get Tirupur listed at least in the second phase.\n\n“Of course, it saddens us considering that there is an urgent need to improve overall infrastructure to overcome the congestions if the turnover from the knitwear industry should increase from Rs. 25,000 crore to Rs. 1 lakh crore by 2020 as envisaged in the master plan,” M. Velusamy, apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council) told The Hindu .\n\nStakeholders involved in the city’s development feel that with delay, it would be difficult for the city managers to tackle the increasing problems arising due to lack of adequate housing facilities for migrant workers, poor road connectivity, garbage disposal and hygiene.\n\n(Inputs by S.P. Saravanan, R. Krishnamoorthy and R. Vimal Kumar)", 
    "section": "national", 
    "title": "Salem, Erode disappointed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}