{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They say varsity delays regularisation of their services despite court order\n\nDemanding regularisation of their services, 23 temporary staff members of Manonmaniam Sundaranar University observed fast in front of the university at Abhishekapatti near here on Thursday. They said that they were appointed on a temporary basis 10 years ago, but were yet to be made permanent, whereas the services of another group of temporary workers appointed in 2007 were regularised recently and they were given their salary arrears from 2011.\n\n“When we took up the matter with the then Vice-Chancellor, A.K. Kumaraguru, he said that regularisation of temporary staff was done based on a directive from the court, and asked us to approach the court to get an order favouring permanent employment for us. Even after we got an order from the court in our favour, Dr. Kumaraguru refused to regularise our services, saying that he could not do so as his three-year tenure was about to end,” said Mookkandi, one of the protestors.\n\nThen, the aggrieved temporary staff aired their grievance with the Secretary, Department of Higher Education, and other officials concerned, and managed to get an order in their favour. As per the decision taken by the Department of Higher Education, the temporary staff, who had obtained the court decree in their favour, should be appointed on a permanent basis at the MSU.\n\nFollowing this direction, the Conveners’ Committee of the MSU placed the directive in the Syndicate Committee meeting for its mandatory approval.\n\n“Consider positively”\n\n“Even though five months have lapsed since the Higher Education Secretary and the Syndicate gave their consent, the Conveners’ Committee members say that regularisation of services of temporary workers would be done only after the new Vice-Chancellor is appointed. Since the Conveners’ Committee has already filled up vacancies at the MSU in the absence of the Vice-Chancellor, our plea should also be considered positively,” S. Leo, another affected worker, said.", 
    "section": "national", 
    "title": "Temporary employees of MSU observe fast", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}