{
    "author": [], 
    "text": "RELIGION\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 29, Main Street, Devaraya Nagar, 6 p.m.\n\nGENERAL\n\nDistrict Administration : Farmers grievances meeting, K.S.Palanisamy, Collector, presides, Collector’s Office, 10.30 a.m.\n\nBharathidasan University Economic Forum : Lecture on Recent trends in India’s foreign trade by V.Loganathan, assistant professor, Madurai Kamaraj University, 2.30 p.m.\n\nSrimad Andavan Arts and Science College : Biofest 2016 - state level inter-collegiate meet, M.Pitchaimani, vice principal, inaugurates, 10 a.m.\n\nUrumu Dhanalakshmi College : Valediction of national seminar on Role of yoga and technology in enhancing sports performance and populace health, V.Mahadevan, Director, Department of Physical Education, University of Madras, distributes prizes, noon.; GCP Book Club: Book reviews, 12.25 p.m.; Department of Tamil : Students seminar, 12.30 p.m.\n\nOrganising Committee: Release of Tiruchi N.Siva’s books, K.Anbazhagan,general secretary, Dravida Munnetra Kazhagam, chief guest, Thevar Hall, 5.30 p.m.\n\nSeethalakshmi Ramaswami College Department of Chemistry : Dr.V.Meenakshi and Dr.T.S.Jani Bai endowment lectures by A.Ponnuswamy, professor, Madurai Kamaraj University, and S.Velmathi, associate professor, National Institute of Technology, 9.45 a.m.; Valediction of NSS special camp, R.Panchapakesan, college secretary, speaks, Mutharasanallur Community Centre, 10.30 a.m.; Department of Music: Seminar on Isai Ulagam Kanda Bharathigal, M.Jayanthi, principal, inaugurates, 10 a.m.\n\nJ.J. College of Engineering and Technology : Technical webinar on ‘MongoDB-a NoSQL Database,’ E. Laxmi Lydia, associate professor, Vignan’s Institute of Information Technology, 3.30 p.m.\n\nFederation of All Teachers and Non-Teaching Staff Associations of High and Higher Secondary Schools of Musiri-Thottiyam: Felicitations and prize distribution ceremony, PSK R.Periyasamy, president, Kongunadu Group of Institutions, speaks, Government Boys Higher Secondary School, Musiri, 3.30 p.m.\n\nMIET Polytechnic College: Awareness programme on eye care and free check up, A.Mohamed Yunus, college chairman, inaugurates, 9.30 a.m.\n\nVetri Vinayaha College of Engineering and Technology, Tholurpatti: ISRO Space science exhibition, 10 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nCauvery Matriculation Higher Secondary School and Cauvery Global School : Annual day, K. Balamurugan, Regional Passport Officer, Chennai, chief guest, 4.30 p.m.\n\nBHEL Matriculation Higher Secondary School : Annual Day, S.Gopinath, Executive Director, BHEL, Tiruchi, chief guest, 5.30 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}