{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Tamil Maanila Congress (TMC) has emerged as the party of people’s trust, according to its president G.K. Vasan.\n\nAfter releasing centenary souvenir for K.T. Kosalram, former Congress MP, here on Wednesday evening, Mr. Vasan said that He said that Kosalram was a freedom fighter and was also instrumental in constructing Manimuthar dam along with former Chief Minister K. Kamaraj.\n\nHe said that victory in the upcoming Assembly polls should be the aim of the TMC cadres. Since its launch in November 2014, the party had enrolled 44 lakh members. It had earned people’s confidence since the party men had joined protests staged by women for implementing total prohibition, farmers demanding compensation for rain-damaged crops, weavers and fishermen pressing for various demands.\n\nHe said that the TMC would implement total prohibition in the State, if voted to power. The party had collected signatures from one crore people in Tamil Nadu demanding total prohibition. The party functionaries carried out relief measures in flood-affected areas in Chennai and Cuddalore.\n\nHe said that during his tenure as Union Shipping Minister, huge funds were allotted for the development of V.O. Chidambaranar Port, and it achieved 60 per cent growth with improved cargo handling capacity.\n\nHe said that promises made by Chief Minister Jayalalithaa on construction of a flyover, subway and widening of roads in Thoothukudi had not been delivered.\n\nDrinking water supply to the city residents was erratic. Srivaikuntam dam and other waterbodies had not been desilted properly. A large quantum of surplus water was let into the sea. Salt pans were inundated by rains. Since the salt pan workers were jobless during the rainy season, he sought relief for them.\n\nMr. Vasan also demanded that safety match industry should be included in small-scale sector, and said that rigid rules of the Forest Department should be relaxed to ensure better livelihoods for manufacturers and workers.", 
    "section": "national", 
    "title": "“TMC is the party of people’s trust”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}