{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Thailand, Singapore and Malaysia replace western destinations\n\nAs the rupee continues to weaken against the dollar, touching Rs. 68 as of Thursday, a survey by travel portal Yatra.com reveals that travellers are making alterations to holiday plans — European vacations, for instance, are taking a backseat to more affordable Thailand trips.\n\nThe survey of 2,000-odd respondents compared responses collected in early 2014 when the rupee was at approximately Rs. 61, to responses collected this week — 89 per cent were planning to travel abroad earlier, compared to 33.8 per cent this time around. While favourite destinations earlier were Europe, the United States and Australia, they had now shifted to Thailand, Singapore and Malaysia, the survey revealed.\n\nAlmost 43 per cent of the respondents also said they would opt for budget accommodation.\n\nSharat Dhall, president, Yatra.com, said in a statement, “We have always seen a change in the Indian traveller’s behaviour with the fluctuation in the rupee. The impact inevitably happens at the international travel — where travellers not only change the choice of destinations but also look at compromising on accommodation in order to stay within their budget. With people going to be planning and booking tickets for summer vacations soon, it is likely to affect their original choices if the rupee continues to fall like this.”\n\nCity-based travel agent M.K. Ajit Kumar, CEO, Asia Pacific Travels, concurs.\n\n“While people are getting used to the rupee weakening and continuing to travel, they are now opting to go for fewer days and to cheaper destinations. Sri Lanka and Bali are the other two popular options for now,” MR. Ajit Kumar said.\n\nCharanya Ramesh, CEO, Shakthi Tours and Travels, said that while travel plans were not extremely affected, travel agents were taking a big hit.\n\n“The weakening of the rupee is hitting us as quotations are given at one rate and when the rupee weakens, everything becomes more expensive. We are now being much more cautious, but we are really hoping the rupee stabilises soon,” she said.\n\nAlmost 43 per cent of the respondents say they will opt\n\nfor budget accommodation", 
    "section": "national", 
    "title": "Weakening rupee altering holiday travel plans: survey", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}