{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With students of the SVS Medical College of Yoga and Naturopathy and Research Institute in Villupuram desperately seeking help to continue their education, the Tamil Nadu Dr. MGR Medical University Vice-Chancellor S. Geethalakshmi on Thursday said she would approach Chief Minister Jayalalithaa to take an appropriate decision. The Vice-Chancellor has been facing criticism from students’ bodies for failing to take timely action on an inspection committee report which indicted the college for functioning with severe deficiencies last month and not being proactive in rehabilitating the students after three girls of the college were found dead inside a well last week.\n\nOn Thursday, a group of parents under the aegis of the Students Federation of India met Dr. Geethalakshmi and handed over their petition seeking closure of the college and action against the college officials. Another group of around 20 students and a few parents, who had come to the city with the aim of protesting outside Tamil Nadu Dr. MGR Medical University, were detained in a marriage hall in Nerkundram. The Revolutionary Students Youth Front members said they had to file a habeas corpus petition in the court to ensure that the protesters were not harmed. The group was released later in the evening.\n\nSoon after parents met her, Dr. Geethalakshmi said, “I will take up the matter at the level of the Chief Minister. I assure you that any action we take will not affect the students’ education.” She later told the media that she was scrutinising the documents submitted by the college. If there was any mistake on the part of the university officials, action would be initiated against them too, she added.\n\nThe VC said since the students were registered with the college it would not be difficult to transfer them to other colleges.\n\nMeanwhile, the body of Monisha, one of the three girls found dead in the well was interred here on Thursday after doctors at the Government Kilpauk Medical College Hospital performed a second post-mortem.", 
    "section": "national", 
    "title": "Will take up students’ case with Chief Minister, says Vice-Chancellor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-29"
}