{
    "author": [
        "Serish Nanisetti"
    ], 
    "text": "The sweet ‘paan’ that most Hyderbadis eat out of the refrigerator or the contraption of glass and steel ice box at neighbourhood ‘dabbas’ has been changed into something else!\n\n“More and more youngsters are eating ‘paan’. And they don’t want their teeth to be stained or spit it out. That is the reason we have stopped applying ‘chuna’ and ‘katha’ on the ‘paan’,” says Shiva, who has been making this digestive dessert near Taj Mahal Hotel in Abids for the last 15 years.\n\nThe snarky ‘sweet paan is for girls’ is now a thing of the past as a new generation of ‘paan’ eaters savour it with a twist. “When we eat this ‘paan’ without the ‘chuna’ and ‘katha’, I can chew it for a long time and don’t have to spit it out. The best part is it doesn’t make the mouth and teeth red,” says a young man, as he picks up the packed ‘paan’ with a cherry on top from the plastic tray fished out of a refrigerator outside a biryani outlet in Himayatnagar.\n\nBut once in a while, a real ‘paan’ connoisseur walks in. His mouth red and the betel juice dripping out from his mouth, Kantiah, stands near Moin’s shop wedged between two pearl shops near Gulzar Houz waiting patiently as Taher prepares the 10 ‘paans’ for the day. He doesn’t say anything but Taher begins making the ‘paans’. Taher cuts the leaf from three sides and dips a wooden pestle into the chuna paste and daubs it liberally and then dips a brass spoon into the katha and dabs it and puts pinches of stuff from various small boxes and the paan is ready.\n\nThen another man steps up and orders: “ Calcutta, 160 chiita, Quimam do chiita, bagar katha, chuna, chhaliya ”, and Taher gets to work.\n\nMohammed Maqdoom at the newest Shah Ghouse outlet at Gachibowli makes a mean ‘paan’. Tuck it into your mouth and the redolent flavour that has beguiled Indians for centuries spreads in the mouth. The constriction in the throat and chest is no longer there. It is almost like a toffee, albeit, that has the flavour of ‘paan’ leaf’s sap.\n\nIn the pre-dawn hours, it’s a different scene at Hyderabad’s ‘Paan’ Mandi as workers stand around and contractors track the baskets being rolled out of a truck that has just reached from Rajampet in Kadapa. This is one of the biggest wholesale market for ‘paan’ in Telangana.\n\n“Today, the prices are okay and I will make some money. The traders are offering Rs. 550 today per basket,” says M. Brahmiah, a four-acre land holding farmer from Borampadu near Kodur railway station watching his wicker baskets being unloaded. Each of them has a small two-tree alphabet code like: GBP, ISP etc. By 8 a.m., the driver pulls away the truck from inside the market and moves out. The journey that Subbarayudu, the driver, began a day earlier at 4 p.m. in Borampadu when he parked the truck at Kammapalli for farmers to load their baskets keeping a count of them, is now nearly over. Some bring two, some four and some bring dozens of baskets packed with 2,000 sada betel leaves.\n\nSubbarayudu gets Rs. 20 per basket for the 11-hour, 500-km trip.\n\nHe will get the money once he goes back, but now, he steps away to grab a bite of idly at Mahalakshmi Tiffins at Aghapura before he dozes off.\n\n“Earlier, the market was much bigger with people from outlying districts coming here to make their purchases. Now, as there are more number of district buses, the farmers are able to send them directly to district headquarters. We supply only to Hyderabad and nearby places,” says Lakshman Rao, in the business for 30 years, running his fingers on a heavy gold necklace.\n\nThe new generation pan eaters have taken to sweet pan that has no chuna and katha to avoid staining their mouth or spitting it out", 
    "section": "national", 
    "title": "A healthy, hygienic turn to eating ‘paan’ in Hyderabad", 
    "subsection": "general", 
    "date": "2016-01-04"
}