{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "An effort spanning three States, a dozen phone calls, and a 15-hour gruelling medical schedule gave two people — a 16-year-old Vikhroli girl and a 47-year-old in Delhi — a new lease of life on Sunday when they received a heart and a liver respectively. This was the first paediatric heart transplant carried out in the city.\n\nThe donor of the two organs was a 20-year-old Indore girl, who had suffered a head injury after a fall and was declared brain dead on Saturday. By Saturday evening, doctors from Fortis, Mumbai, and the Institute of Liver and Biliary Sciences, New Delhi, landed in Indore. They commenced the organ harvesting early Sunday morning and flew back to their respective cities in commercial flights carrying the organs with them.\n\nGreen corridors were created both in Mumbai and Delhi within an hour of each other on Sunday morning. In Mumbai, the harvested heart reached Mulund within 18 minutes of landing at the airport, while the liver reached the hospital in Vasant Kunj in Delhi in 10 minutes. The transplant procedure on the two patients was completed and doctors in both the cities said organ recipients were stable.\n\n“The 16-year-old girl had been on the waiting list for three months. She was second on the list, but the person who was first on the list was not medically sound to undergo a transplant,” said an official of the Zonal Transplant Coordination Committee (ZTCC).\n\nThis was the second inter-State heart transplant in Mumbai, but there were many firsts recorded in this process that was successfully completed within 24 hours, with seamless coordination between States and hospitals being a key first. During the first such transplant, when a heart was flown in from Surat, a chartered flight was taken. This time, doctors took a commercial flight.\n\nRecipients under observation\n\nDr. Vijay Agarwal, head of paediatric cardiac surgery at Fortis hospital, Mulund, said the inter-State transplant was a breakthrough, adding that the patient was stable and would be under observation for the next 42 to 72 hours.\n\nIn Delhi, the 47-year-old was a patient of cryptogenic cirrhosis and had been waiting for a liver for the last six months. “He didn’t have any live donors in the family,” Dr Viniyendra Pamecha, chief liver transplant surgeon with ILBS, told The Hindu from Delhi.\n\nHe said the procedure from liver procurement to implantation was completed in six hours, which was excellent timing.\n\n“The patient is stable,” he added.\n\nFor those involved in the retrieval and transplant, this was a case custody of good networking and coordination.\n\nEfforts span three States, 15-hour schedule to help recipients in Mumbai, Delhi", 
    "section": "national", 
    "title": "A tale of two organ transplants in two cities", 
    "subsection": "general", 
    "date": "2016-01-04"
}