{
    "author": [
        "T Appala Naidu"
    ], 
    "text": "The Andhra Pradesh government plans to utilise the abandoned portion of Andhra National College by setting up a fisheries polytechnic college. Freedom fighters led by Kopella Hanumantu Rao have established the premiere institution in February 1910, offering various courses including technical education and industrial training. Mahatma Gandhi spent two days at the college in 1921.\n\n“I have passed two quiet and what shall always remain with me sacred days on the sacred grounds on this great educational institution… As an Indian I feel proud of it….”, wrote Mahatma Gandhi in the visitors’ book. The National Flag designer Pingali Venkaiah and renowned artist Adavi Bapuraju were a few luminaries who served as teachers in the college.\n\nHowever, at a time when the institution is losing its sheen due to poor percentage of admissions, lack of teaching staff and employment oriented courses, the State government has decided to revive the academic institution. Dilapidated state of several class rooms and abandoned Industrial Training Block present a picture of the present state of the institution, in which Krishna University is being run in one block. It also houses a high school and degree college.\n\n“A fisheries polytechnic college will be set up by using the infrastructure and buildings of the National College. Plans are afoot to set up trust to establish the fisheries polytechnic college as the institution is under the control of department of endowments”, said Excise and B.C. Welfare Minister K. Ravindra.\n\nPromotion of Indian education\n\nThe National College was established to promote the Indian education in the British India as Indian National Congress held in 1906 in Kolkata passed a resolution to promote the Indian education. Apart from conventional courses, it also offered creative courses such as sculpture and painting.\n\nThe block, where several works of great painter Adavi Bapiraju are displayed, is crying for conservation. According to available literature, British theosophist Annie Besant who visited twice to the college has extended necessary financial support in a bid to encourage the Indian education in the port town.\n\n“As an Indian I feel proud of it (National College). As the inhabitants of this great Andhra Pradesh, I hope that all my Andhra friends are equally proud of it..”, stated Mahatma Gandhi. The Indian National Congress has donated Rs. 27,000 for construction of the buildings while freedom fighters Kopella Hanumantu Rao and Gadicharla Harisarvottama Rao raised funds by collecting donations from the villages across the State to realize the dream of establishing the institution.", 
    "section": "national", 
    "title": "A.P. government to revive college where Gandhiji stayed", 
    "subsection": "general", 
    "date": "2016-01-04"
}