{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Three months after 52-year-old Mohammad Akhlaq was lynched in a Dadri village following rumours about cow slaughter, the murder continues to haunt the village.\n\nSanjay Rana, a local BJP leader, suddenly found himself at the centre of the lynching case. His son, Vishal, and his friend Shivam allegedly played the main role in spreading the rumour about cow slaughter that incited a violent mob gathered outside Akhlaq’s house. However, going by the account of events as narrated by Mr. Rana, what happened in the aftermath of the lynching case was a “tragedy” for him as well for several reasons.\n\n“First of all, my son was arrested for no fault of his. Secondly, Akhlaq’s lynching became an opportunity for people to vilify me and the BJP, the political party I am associated with,” he told this correspondent while standing outside the chief judicial magistrate’s court in Greater Noida. Mr. Rana was waiting for Vishal who was expected to be brought to the Dadri court to be given a copy of the case charge sheet.\n\nDuring the media coverage post-lynching, Mr. Rana’s name was reported largely as a local BJP leader but very few know that as a ‘kar sevak’, he played an active role in the Ram Mandir agitation in 1990 when the Hindutva movement to build the temple was at its peak.\n\nIn fact, as he remembered, he was one of the lakhs of ‘kar sevaks’ who had assembled in Ayodhya in October 1990 when the then Chief Minister of Uttar Pradesh Mulayam Singh Yadav ordered firing on ‘kar sevaks’ who attempted to go near the disputed site of Ramjanmbhoomi-Babri structure.\n\n“I can’t forget that day when we were fired at. Several of us were killed. I was arrested and was in jail for about a week,” he said.“I am paying the price for my long association with the BJP,” he said, accusing Chief Minister Akhilesh Yadav of “targeting” him for “vote bank politics”.\n\nMr. Rana told The Hindu that the “lynching” was “indeed horrific and ghastly”. He also claimed that he tried to save Akhlaq whose house is about a 10-minutes walk from Mr. Rana’s house.\n\n“When I got to know about what happened with Akhlaq bhai , I was the one who called the police. I tried to save him,” said the BJP leader whose son and six other relatives are accused of being part of the mob that allegedly dragged Akhlaq out of his house and lynched him.\n\n‘My son innocent’\n\nMr. Rana said as opposed to the claims of the police, Vishal (22) was not in the village that day. “My son is innocent. I can’t imagine him doing anything even remotely like that. He was in Delhi that night. He came home the next day. Police arrested him five days later,” he said.\n\nAccording to the charge sheet, however, Vishal and his friend Shivam told the police that they were provoked by some people on the claims that Akhlaq had killed a cow.\n\nDenying that the murder was premeditated or there was a possibility of “conspiracy”, Mr. Rana said, “Akhlaq bhai died because of the mob frenzy. This is what happens when mob frenzy takes over. Strong sentiments are involved because Hindus consider cow as their mother”.", 
    "section": "national", 
    "title": "BJP leader at centre of Dadri row was a ‘kar sevak’", 
    "subsection": "general", 
    "date": "2016-01-04"
}