{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Acquits official who was named in MSEDCL’s employees suicide note\n\nThe Bombay High Court recently quashed an FIR against a State government officer who was accused of being the reason why his subordinate committed suicide. The court held that mere harassment does not amount to abetment of suicide.\n\nThe incident dates back to April 2014, when an employee of the Maharashtra State Electricity Distribution Company Limited committed suicide by hanging himself from a tree.\n\nHis suicide note said that a senior officer had harassed him and that was the cause of his suicide. A division bench of Justice Ranjit More and Justice V L Achliya said, “In our view, the allegations made in the FIR or alleged suicide note even if taken at their face value do not constitute an offence under section 306 of IPC.”\n\nThe HC said it does not contain anything to suggest the applicant or other officers had instigated the deceased to commit suicide or engaged in conspiracy to bring about his suicide. The court said there was nothing in the note to infer that there was a conspiracy with an intention to bring about the suicide of deceased as a result of abetment.\n\nThe bench said, “Abetment involves a mental process of instigating a person or intentionally aiding a person in doing a thing. Without a positive act on the part of the accused to instigate or aid in committing suicide, the offence under section 306 of IPC cannot be said to have been made out. In order to attract the provisions of section 306, there has to be a direct or clear intention.”\n\nThe court remarked it also requires an active act or direct act, which led the employee to commit suicide. “Even assuming for the sake of argument that there was harassment by the applicant and other officers, it cannot be said to be a positive act on their part that the deceased should commit suicide. It appears that the deceased being hypersensitive, was unable to face ground realities and committed the unfortunate act of ending his life,” the court said.\n\nHolding that the allegations made in the FIR or alleged suicide note, even if taken at their face value, do not constitute an offence under section 306 of IPC, the court said that continuation of prosecution would result in the abuse of the process of law and quashed the FIR.", 
    "section": "national", 
    "title": "Harassment does not amount to abetment of suicide, says Bombay HC", 
    "subsection": "general", 
    "date": "2016-01-04"
}