{
    "author": [], 
    "text": "Internationally acclaimed film-maker Buddhadeb Dasgupta , whose movies are known worldwide for the manner in “which extended reality” is presented with the lyricism of poetry, is waiting for the release of his new film, Tope (Bait) , in 2016.\n\nWith five national awards for best films and two best director prizes and countless international awards, Mr. Dasgupta does not like being called an “award-winning film-maker”. He spoke to Shiv Sahay Singh about his new film.\n\nWhat is your new film about and how did you decide on the subject?\n\nThe film is called Tope in Bengali (Bait in English). The story by Narayan Bandyopadhyay is one of the best stories I have ever read in my life. I had started thinking about making a film on the story as far back as 2000.\n\nBut my style of film-making is different — it is what I call extended reality — and this story is brutally realistic. However, finally, after thinking about it for nearly 15 years, I found the solution to the problem of how to include magic in the story. Like a magician needs a distance between him and an audience to perform his trick, I needed 15 years to pull off this trick.\n\nHow did you go about finding the right characters for the film?\n\nI wanted someone who is not known to the public to do the lead role and, hence, the actions and acting would not be predictable. I wanted an actor who is also a “non-actor”. When I finally got the face I was looking for, my producer said, ‘How can you take him I will lose all my money.’ I then returned the cheque, and he relented .\n\nSo where did you get this actor?\n\nI actually found him on the Internet. His name is Sudipto Chattopadhyay. He is an accomplished theatre person and had practised and taught theatre both in India and abroad. There is another character in the film — a girl barely 11-12 years old, who can do tightrope walking. But the problem was that she had never acted and was initially very diffident. I was terrified thinking that the girl will not be able to act. But when she started playing her role, my jaws just dropped in wonder.\n\nYou are among the most awarded film-makers in the country. What do awards mean to you?\n\nNobody should talk about a film or refer to film or a director based on any awards. In fact, nobody worth anything remembers these awards. Even my wife does not remember what awards I have won. Take the case of Ritwick Ghatak. If I am correct, in his entire lifetime, he got only one best Bengali film award. Does that make him a lesser director?\n\nIn fact, I take it as an insult when somebody introduces me as a national award winning director. The screen tells the truth. The audience believes the screen, not the awards.\n\nThere is a fascination for awards in the film industry but you don’t care much for them. This isolation that you find yourself in, how does it affect your creativity?\n\nI really believe that without this isolation, it is very difficult for me to be creative. This loneliness is not something that has been imposed on me. I have chosen it. I must say that I am unhappy — and thank God for that! Because this unhappiness serves as a catalyst to my creative energy. I am, in fact, very afraid of happiness. This creative unhappiness is what reminds me with every passing day that there remains so many things that are yet to be done.", 
    "section": "national", 
    "title": "‘I now know how to include magic in the story’", 
    "subsection": "general", 
    "date": "2016-01-04"
}