{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Forty hours into the operation against the terrorists who stormed the Indian Air Force base in Pathankot, investigating agencies have not yet made any significant recoveries that could give a clue to their identity or the route they took to enter India.\n\nA top intelligence officer told The Hindu they were not sure whether the terrorists belonged to Pakistan-based Jaish-e-Mohammad (JeM). Their initial presumption was based on a piece of paper recovered from SP Salwinder Singh’s vehicle, which was snatched by the terrorists and abandoned later. “It is all a presumption till now that they belonged to JeM. We have not recovered any GPS sets yet that could have given clues about their location. It could be LeT as well… we don’t know yet,” said the intelligence official.\n\nAll operations to retrieve some kind of identification from the slain terrorists were suspended after NSG commando Lieutenant Colonel Niranjan died while handling a body. A senior official said a grenade, hidden in the terrorist’s shirt pocket, exploded when the Lt. Col tried to drag the body to another location, a standard drill in such cases. A team of the National Investigation Agency, which has been camping in Pathankot for the past two-days, has not made any recoveries as the operation was still on.\n\nA senior government official said the Border Security Force (BSF) had scanned footages from the surveillance cameras installed along Punjab’s and Jammu’s border with Pakistan. “There has been no breach along the fences…. For the past three days, we have also checked the border areas for some kind of tunnel, but haven’t found anything yet,” the official said.\n\nHe said the BSF sent out teams to different locations near the Pakistan border, from the two places where the slain taxi driver’s and SP Salwinder Singh’s vehicles were found abandoned by the terrorists, but failed to trace the route the intruders could have possibly taken.\n\nAnother official said the terrorists stagger themselves in groups during fidayeen attacks and wait for an opportune moment, when a number of security personnel have assembled to clear up the area, to strike. This was done, he said, to inflict maximum casualties.\n\nInvestigating agencies have got no clue to establish the identity of terrorists", 
    "section": "national", 
    "title": "Identity of terrorists still unclear", 
    "subsection": "general", 
    "date": "2016-01-04"
}