{
    "author": [
        "Arun S"
    ], 
    "text": "Starting with a proposed visit by Prime Minister Narendra Modi to Africa in February, India plans to play a leadership role at the World Trade Organisation (WTO) negotiations to boost the trade prospects of the developing and poor nations. To forge strong alliances on the “development agenda” of the WTO’s ongoing Doha Round of talks, the government will, in the coming months, also hold a series of “strategy workshops” of stakeholders, inter-ministerial and Centre-state discussions in addition to summits with African countries and other developing country groups.\n\nSignificantly, in this regard, in the pipeline are visits by Mr.Modi to African countries starting with Kenya likely next month, high-level sources in the government told The Hindu .\n\n“We will soon set up occasions like the recently held Africa Summit in India. The Prime Minister does an outstanding job of flagging the common interests of the developing world during such occasions,” a senior official said, adding that a “collaborative approach” with African countries would be central to India’s future strategy at the WTO.\n\nThe move comes in the backdrop of widespread criticism by the Opposition and civil society groups that the NDA government had failed to protect the interests of India and the developing world at the Ministerial Conference (WTO’s highest decision making body) held in Nairobi last month for negotiations on an agreement to lower global trade barriers.\n\nStrategy workshops\n\n“The Commerce Ministry [the nodal body at the Centre for WTO-level negotiations] will, in a few days, hold the first of the ‘strategy workshops’ to take inputs from the Permanent Mission of India to WTO, Ministries at the Central government level and other stakeholders to take a deep dive on the outstanding issues [of the ongoing Doha Development Round talks of the WTO] and come up with an initial game plan,” a senior official said.\n\nBiswajit Dhar, a trade expert and professor at Jawaharlal Nehru University, said: “Over the years, the alliance that India had with leading developing countries such as South Africa and Brazil on WTO issues weakened to the point that at the Nairobi conference one could not see any coordination between these countries. Therefore, now at this critical juncture, it is left to India to do the agenda setting along with these and other countries.”\n\nThe Nairobi Ministerial Declaration reaffirmed the pre-eminence of the WTO as the global forum for trade rules setting and governance, but noted that there was a lack of consensus on the part of the WTO’s 162-member countries on the way to take forward the Doha Development Agenda (DDA).\n\nThe Ministerial Declaration only said: “We recognise that many members reaffirm the DDA, and the Declarations and Decisions adopted at Doha and at the Ministerial Conferences held since then, and reaffirm their full commitment to conclude the DDA on that basis.”\n\nBiraj Patnaik, Principal Adviser to the Commissioners of the Supreme Court on the Right to Food, said India should adopt a three-pronged strategy.\n\nThis includes ensuring that the Trade Facilitation Agreement (TFA), aiming to ease customs rules and expedite trade flows, does not come into effect till all the Doha Round issues are sorted out.\n\nThe TFA, which is being pushed mostly by rich countries, will come into effect only when two-thirds of the WTO’s members or 108 of the 162 member countries, ratify it. As of now, 63 countries have done so. India is yet to ratify the TFA.\n\nOfficial sources said that India will shortly hold meetings with a group of 47 nations including China and Kenya that had issued a statement on the opening day of the Nairobi Ministerial Conference saying that only a comprehensive conclusion of the DDA, with economically meaningful and balanced outcomes, will provide impetus to global trade liberalisation and facilitation and also, significantly, correct the development deficit in the rules resulting from the previous rounds of multilateral trade negotiations.\n\nIn the pipeline are visits by Mr.Modi to African countries starting with Kenya likely next month", 
    "section": "national", 
    "title": "India seeks to lead developing nations at WTO", 
    "subsection": "general", 
    "date": "2016-01-04"
}