{
    "author": [
        "Elaine Sciolino"
    ], 
    "text": "For decades, the collection was kept in locked cages, accessible only with special permission. Restrictions are being lifted now.\n\nAn etching by Italian artist Donato Bertelli with overlays at the New York Public Library shows a couple in embrace on a boat ride.— Photo: NYT\n\n***, the symbol was called. When *** was handwritten on books and periodicals in the New York Public Library’s permanent collection, it meant one thing: supervision required.\n\nThe triple-star code, created some time in the first part of the 20th century, identified the printed works that were considered too hot for the general reader to handle.\n\nPlayboy was once classified with a triple star. So were raunchy pulp novels, fliers for Times Square massage parlours, business cards offering phone sex for $2 a minute, even playing cards with illustrations of naked women.\n\nFor decades, they were kept in locked cages, accessible only with special permission and viewed in a small, secured area in the main research library.\n\nMore recently, hundreds of works that make up the triple-star collection have been liberated from the restricted controls. An adult with a library card can simply fill out a request and peruse the material on the premises. (The library maintains a filter system to restrict access to erotic materials on the Internet.)\n\n“Erotica was not something we were particularly going after, but we needed to collect life as it was lived,” said Jason Baumann, a collections curator. “We needed to understand and document for history what the city of New York was like. That meant collecting the good and the bad. It was always part of our mandate,” he said.\n\nThe triple-star collection is a miniature version of the vast archive of erotica at France’s National Library. That collection, called ‘L’Enfer’ (Hell), dates from the 19th century, when the library in Paris isolated any work considered “contrary to good morals.” In 2008, the National Library mounted its first major exhibition of highlights from the collection. It drew record crowds; no one under 16 was admitted.\n\nThe New York Public Library, by contrast, has never had a similar exhibition. The materials are not as rich, and the standards of what is considered proper for an exhibition in a public institution differ in France from those in the United States.\n\nAnd unlike France’s National Library, whose sexually explicit material is contained in one archive, only a part of the Public Library’s erotica was designated triple star. The rest is dispersed in other collections in the building, including in the Berg Collection of English and American Literature (rare books and manuscripts) and the Spencer Collection (artists’ books and illuminated manuscripts).\n\nA guided visit to the library revealed some of the richness of its erotic (or pornographic, depending on who was doing the classification) material. The works are hidden treasures, many of them awaiting discovery. Not even the curators and librarians know everything that is there.\n\n“There were many materials in the library’s special collections that I had never seen before,” Mr. Baumann said, adding that “The range and depth of our collections never ceases to astonish me.”\n\nThe main building of the Public Library had such an impact on the neighbourhood that there was once a massage parlour a block away on West 43rd Street named the Library. A 1976 flier in the *** collection advertised its $10, tip-included service, with “7 Beautiful Librarians to Service You.” The flier shows a longhaired “librarian” dressed in a necklace and high heels. A large bunch of feathers covers her private parts.\n\nAs part of the library’s mandate to collect life as it was lived, small teams of librarians were dispatched in the 1970s to Times Square pornography shops to scoop up representative samples of the latest erotica. Among the paperback titles in the collection: Animal Urge , The 48-Hour Orgy , Beach Stud and All Day Sucker . — New York Times News Service", 
    "section": "national", 
    "title": "Lifting the veil on the New York Public Library’s erotica", 
    "subsection": "general", 
    "date": "2016-01-04"
}