{
    "author": [
        "Namrata Joshi"
    ], 
    "text": "In an interview to The Hindu a couple of weeks ago, film-maker Rakeysh Omprakash Mehra had spoken about abolishing censorship; certifying films instead of censoring them.\n\n“The Censor Board office building can be used for something more constructive, like an old-age home, a crèche or even a nightclub,” he had said.\n\nOn Saturday, he accepted the invite from the government to be a member of the panel (headed by veteran film-maker Shyam Benegal) to revamp the Censor Board. The appointment of the two, as well as those of the other members (film critic Bhawana Somaya, adman Piyush Pandey, NFDC MD Nina Lath Gupta and JS (Films) Sanjay Murthy), took everyone by surprise.\n\nUnlike the previous appointments, i.e. the chairpersons of the Censor Board and the FTII, there has been no reason to raise a finger at these esteemed names.\n\nBut some niggling questions still remain, pertaining to the mandate of the new committee and the status of the recommendations of the previous Mudgal committee.\n\nGovt. notification\n\nThe government notification states that the committee will provide “holistic framework and enable those tasked with certification to discharge responsibilities” in an effective and transparent way.\n\nDoes this mean that the new committee will just be a teacher and monitor to the current board? Or will it go deeper and look into the procedural rehaul of the process of censorship of films itself?\n\nAnd if it has been formed to usher in sweeping changes then what happens now to the Mudgal Committee report?\n\nThe Mudgal Committee had been set up under the UPA regime and was headed by Mukul Mudgal, former Chief Justice of the Punjab and Haryana High Court. Set up in 2012, the panel members included, among others, FCAT chairperson Lalit Bhasin, the then CBFC chairperson Leela Samson and film personalities Sharmila Tagore and Javed Akhtar.\n\nCensor Board member Vani Tripathi Tikoo feels the new panel is a “welcome move.”\n\nMr. Mehra says he accepted the government invite for the “right reason and cause.” “It will have to be all about policy changes, about changing the Cinematograph Act of 1952 and update it to today’s times,” he says.\n\nImportant question\n\nThis brings up the important question — if it will be about a whole procedural rehaul then what of the Mudgal committee report that had suggested some far-reaching, comprehensive changes in censorship?", 
    "section": "national", 
    "title": "Mandate of Benegal panel unclear", 
    "subsection": "general", 
    "date": "2016-01-04"
}