{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "The three students with Bastar Inspector-General of Police S.R.P. Kalluri and other police officials at Chintalnar CRPF camp on Sunday.— Photo: Special Arrangement\n\nThe three students from Maharashtra abducted by Maoists on December 29 from Bastar region of Chhattisgarh were released on Sunday.\n\n“The three boys reached Chintalnar CRPF camp in Sukma district at 12 am on Sunday,” Dinesh Pratap Upadhyay, Deputy Inspector General of CRPF, Dantewada range, told The Hindu .\n\nThe release comes after Bastar police head S R P. Kalluri suspended all operations in south Bastar to facilitate entry into the forests to secure the release of the students.\n\nVikas Mohite from Pune, Adarsh Patil and Shrikrishna Shevale from Satara district of Maharashtra, all students of Pune University, were taking out a cycle tour as part of ‘Bharat Jodo mission’ in Maoist insurgency-hit areas of Maharashtra, Chhattisgarh and Odisha when they were abducted.\n\n“We were stopped by Maoists after Basaguda police camp on December 29 and taken captive. They did not beat us but tied our hands and interrogated us,” Vikas Mohite said.\n\nThe students were then reportedly taken to Maoist leader Paparao in Sukma district where they were confined for ascertaining their identity. However, the insurgents released them after finding that the students were “no threat” and had only lost their way in the forests.\n\nMr. Kalluri personally went to Chintalnar CRPF camp to receive the boys and brought them back to the Jagdalpur district headquarters.\n\n‘Great relief’\n\n“It’s a great relief that the boys have been released. We are in touch with Gadchiroli district police of Maharashtra and most likely a chopper will be sent by the Maharashtra police to take them back tomorrow,” Mr.Kalluri said.\n\nLocal journalists from Sukma and Bijapur had formed teams to try and negotiate the safe release of the three.", 
    "section": "national", 
    "title": "Maoists release kidnapped Maharashtra students", 
    "subsection": "general", 
    "date": "2016-01-04"
}