{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Despite prior intelligence inputs, death toll in the attack is an unacceptable seven\n\nArmy personnel arrive in Pathankot on Sunday to take part in an operation to ‘sanitise’ the airbase following an attack by terrorists. — PHOTO: AFP\n\nhe terrorist attack on the Pathankot Air Force station on Saturday took the lives of an unacceptably high number of security personnel. A senior National Security Guards (NSG) officer was killed in an accidental explosion during combing operations at the base on Sunday, pushing the casualty count to seven.\n\nThe death toll is unusually high, given that there was prior intelligence of an attack and forces were on high alert.\n\nThis raises questions about the operation that began around 3 a.m. on Saturday and went on for 13 hours and resumed on Sunday with at least two terrorists believed to be inside.\n\nThe officer has been identified as Lt. Col. Niranjan from Kerala and was a member of the bomb disposal squad of the NSG. Officials said that he was killed as an improvised explosive device went off accidentally during combing operations which also injured five NSG personnel.\n\n“Deeply saddened about the loss of Lt. Colonel Niranjan Kumar. Sharing the grief of family,” Kerala Chief Minister Oommen Chandy tweeted.\n\nBrave deeds\n\nAs operations continue to eliminate possibly the sixth terrorist in the attack, details of bravery are slowly emerging. Officials said that Havaldar Jagdish Chand from the Defence Security Corps (DSC) who worked as a cook in the base played a heroic role in the initial moments of the attack. As terrorists breached the perimeter and entered the base, he pursued them and after a scuffle killed one terrorist with his own rifle.\n\nThe other two soldiers who were killed on Saturday are Corporal Gursewak Singh, a Garud Commando of the Air Force, who was married about 45 days ago, and Subedar Fateh Singh, 51, who won a gold and silver medal at the first Commonwealth shooting championships in Delhi in 1995.\n\nThree DSC personnel passed away in the hospital during the night, officials said. They are Lance Naik Phoolwant Singh from Gurudaspur, Sepoy Sanjiv Kumar and Sepoy Mohit Chand. In addition one Garud commando and eight DSC personnel were injured.\n\nLarge base\n\nOn the continuing operations, the former Chief of Air Staff Air Chief Marshal A.Y. Tipnis said that the base was spread over a large area and there were lot of woods around which provided a good cover and made it difficult to locate someone hiding.\n\nHe noted that there was supposed to be a 900-metre buffer zone outside the air base, but that was not to be because of the rapid urbanisation.\n\nCivil dwellings now dot the periphery of most military installations across the country.\n\nA Lieutenant-Colonel was killed as an IED went off during combing operations", 
    "section": "national", 
    "title": "Martyrs held their ground, showed unparalleled bravery", 
    "subsection": "general", 
    "date": "2016-01-04"
}