{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Violence spreads from rally organised to condemn derogatory statement of Hindu outfit leader\n\nVehicles which were set on fire at the Kaliachak police station in Malda on Sunday.— Photo: PTI\n\nMore than a dozen policemen, including an inspector in-charge of a police station, were injured in mob fury in West Bengal’s Malda district on Sunday. Gopal Tiwari, 22, sustained a gunshot while about 30 vehicles were torched.\n\nAn eyewitness said violence spread from a rally of an organisation, Anjuman Ahle Sunnatul Jamat (ASJ). However, an ASJ official claimed that “outsiders” masterminded the rampage.\n\nNational Highway 34 was blocked and train services were disrupted for a couple of hours as the protesters ransacked the nearby Khaltipur station on the main railway line.\n\nInspector-General (Law and Order) Anuj Sharma said the situation was under control and curfew was not imposed.\n\nThe ASJ organised a meeting in the Kaliachak Block 1 in south Malda to protest a derogatory statement made by Uttar Pradesh Hindu Mahasabha leader Kamlesh Tiwari against Prophet Muhammad. Sunday’s meeting was organised to demand the arrest of Mr Tiwari. At least 30,000 people participated in the meeting.\n\nAn eyewitness said, “Midway into the meeting, a section of the crowd broke away from the rally and attacked the Kaliachak police station, started hurling stones and attacked the police.”\n\nThe mob went on the rampage and the vehicles stationed on the station premises were set on fire. Few civilian vehicles were too torched as the crowd moved to a residential enclave, Baliadanga, behind the police station.\n\nAround 3 p.m., a special combat force, supported by a large contingent of district police, reached the area. The police brought the situation under control after several rounds of firing.", 
    "section": "national", 
    "title": "Mob attacks police station in Malda", 
    "subsection": "general", 
    "date": "2016-01-04"
}