{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "PM promises more funds for research\n\nUniversity of Mysore Vice-Chancellor Prof. K.S.Rangappa felicitating Prime Minister Narendra Modi during the 103rd Indian Science Congress in Mysuru on Sunday, in the presence of Chief Minister Siddaramaiah and ISC general president Ashok Kumar Saxena.— PHOTO: M.A.SRIRAM\n\nPrime Minister Narendra Modi on Sunday urged scientists to tackle climate change, the challenges from urbanisation and play their role in encouraging start-ups, while promising to make the pursuit of science easier and increase the resources for research. Addressing the Indian Science Congress here, he said science and technology ought to be geared towards national development and he’d like a “framework” for scientific departments to audit their achievements.\n\nIn keeping with his penchant for slogans, Mr. Modi coined a new one — the ‘5 Es’ of Economy, Environment, Energy, Empathy, Equity — as a talisman for scientists and technologists to ensure that their work had maximum societal impact.\n\nIn one of his rare addresses that was entirely in English, the Prime Minister invoked the contributions of the former President A.P.J. Abdul Kalam, and held him up as the symbol of a scientist and technologist devoted to the nation’s development.\n\n“Good governance is not just about policy but about integrating science and technology into the choices we make,” he said. “Your theme for this congress is a fitting tribute to Dr. Kalam's vision.” The theme for the 103rd edition of the Indian Science Congress is ‘Science and Technology for Indigenous Development in India.’\n\nReferring to his address in Paris at the UN climate change summit, Mr. Modi emphasised that innovation was not only for tackling climate change but also about delivering “climate justice.”\n\nAccording to him, harnessing energy from the oceans as well as the use of geothermal energy and the recently-constituted International Solar Alliance — a global initiative of top industrialists from Bill Gates to Mukesh Ambani — were key measures to achieve a low-carbon, sustainable energy future.\n\nOceans for prosperity\n\nMr. Modi said the world couldn’t ignore the importance of the oceans and their sustainability would be key to economic growth. “We are at the cusp of a new era, where oceans will become important drivers of our economies. Their sustainable use can bring prosperity; and, give us clean energy, new medicines and food security beyond just fisheries,” he said.\n\n“That is why, in the past year, we have increased our focus on ocean or blue economy and have set up an advanced centre of research in marine biology and biotechnology. We have entered into agreements on marine science and ocean economy with several countries and will also hold an international conference on “Ocean economy and Pacific Island Countries” in New Delhi this year.”\n\nThe inaugural session of the five-day congress had about 5,000-7000 students, speakers and scientists from across the country in attendance along with Karnataka Governor Vajubhai Rudabhai Vala; Chief Minister Siddaramaiah; Harsh Vardhan, Union Minister of Science and Technology and Y.S. Chowdary, Minister of State for Science and Technology.\n\nNobel laureates John Gurdon, David Gross, Dan Schechtman and Serge Haroche as also Indian-origin Canadian-American mathematician and Field Medalist, Manjul Bhargava were among those feted by Mr. Modi for their contribution to science.\n\nDr. Harsh Vardhan said that this year he would steer clear of any references to the contributions of ancient India to science. “My remarks last year got more space and took precedence over more important scientific issues,” he said, referring to the furore at the Science Congress in Mumbai last year where ‘scientific sessions’ on ancient aircraft and Vedic surgery took place along with presentations on science.", 
    "section": "national", 
    "title": "Modi promises more resources for research", 
    "subsection": "general", 
    "date": "2016-01-04"
}