{
    "author": [
        "S Bhuvaneshwari"
    ], 
    "text": "Indigenous manufacture of latest equipment is the need of the hour, says Prime Minister\n\nPrime Minister Narendra Modi during the foundation laying ceremony of HAL Helicopter Factory at Bidarahalla Kaval in Tumakuru district on Sunday.— Photo: Bhagya Prakash K.\n\nPrime Minister Narendra Modi on Sunday said the 610-acre military helicopter manufacturing complex that would come up here would be a big leap towards achieving self-reliance in the defence sector.\n\nAfter laying the foundation stone for the new factory of Hindustan Aeronautics Ltd, Mr. Modi said it was expected to produce 600 helicopters over the next 15 years for the armed forces.\n\nThe small village would have a role in keeping the nation secure.\n\nHAL plans to manufacture its Light Utility Helicopter for reconnaissance and surveillance; the Light Combat Helicopter for battlefield offence; and subsequently add a range of heavier and advanced rotary products. Mr. Modi said he hoped to see the first aircraft coming out of the facility in 2018.\n\nRecalling former Prime Minister Lal Bahadur Shastri’s call of “Jai jawan jai kisan”, Mr. Modi said self-reliance in food had been achieved and now it had to be fulfilled in equipment for the defence sector. Indigenous manufacturing of the latest technologies, Mr. Modi said, was a crying need in a global situation where foreign arms suppliers gave costly but outdated arms and ammunition.\n\nThe Rs. 5,000-crore copter complex — easily the biggest investment in this backward region — would boost the government's ‘Make in India’ agenda. It would also provide 4,000 jobs.\n\nDefence Minister Manohar Parrikar said the contribution of HAL had been significant in the past seven and half decades and has spearheaded the national defence and aerospace programmes.\n\nChief Minister Siddaramaiah said Karnataka had introduced an Aerospace Policy and conceived an Aerospace and Defence Park at Devanahalli.\n\nThe government was setting up a Special Process Facility and Aerospace Technology Centre in partnership with National Aeronautical Agency and HAL. They were also encouraging industry to tie up with Industrial Training Institutes for manpower.\n\nHe said Karnataka was hosting a three-day mega investor summit, ‘Invest Karnataka - 2016’, from February 3 at the sprawling Bengaluru Palace Grounds. Aerospace is one of the focus sectors in the Investors’ Meet and there would be a special session, he said.", 
    "section": "national", 
    "title": "New unit a big leap in self-reliance: Modi", 
    "subsection": "general", 
    "date": "2016-01-04"
}