{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Union Minister for Women and Child Development Maneka Gandhi during a visit to an anganwadi near Hampi on Sunday.\n\nUnion Minister for Women and Child Development Maneka Gandhi has denied that budgetary allocation to the department was reduced.\n\nResponding to questions by presspersons here on Sunday, Ms. Gandhi said, “The Finance department had asked all the departments to return 10 per cent of the grants. Immediately, I met Prime Minister Narendra Modi and the Finance Minister to explain the important role played by the department in implementing various welfare schemes for women and children. In turn, they intervened and helped in getting back the entire allocation.”\n\nTo tackle malnourishment among children, the department had proposed to set up 50,000 more anganwadis soon as against the required six lakhs across the country.\n\n“We know that the food provided at anganwadis is uniformly poor across the country due to lack of proper monitoring. We have taken the issue seriously and also initiated steps to set things right. One has to wait for about six months to see the improvements,” she said.\n\nMs. Gandhi said ‘Beti Bachao, Beti Padhao’ programme launched by the Modi government had been yielding positive results.\n\nSex ratio and education of girls had drastically improved in the 100 districts where the programme was implemented, which then prompted the government to extend the programme to 61 more districts.\n\nHowever, the Minister ruled out the possibility of regularising services of anganwadi workers and treating them as government servants, stating that there was no provision and money in this regard.\n\n“Their job is already a permanent one. In addition, we have suggested giving a promotion to anganwadi workers as supervisors for those who have done around ten years of service,” she said.\n\nRegarding amendment of the Juvenile Justice Act to bring down the age from 18 to 16, Ms. Gandhi said the purpose of the amendment was not to punish but to create a deterrent.\n\nMs. Gandhi was participating in the State-level convention of Jain community organised by the State unit of Bharatiya Jain Sanghatana at Vijayashree resorts here.", 
    "section": "national", 
    "title": "No cut in grants for women and child development, says Maneka Gandhi", 
    "subsection": "general", 
    "date": "2016-01-04"
}