{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "When Sabiya Sheikh tried to get girls from Shivaji Nagar, a slum in Govandi, to play in a kabaddi tournament she was helping organise, she met with resistance. She says, the girls’ parents “asked me whether it will be safe for girls to play in track suits; ‘won’t it make them vulnerable to boys? Why don’t you teach them some household work instead of kabaddi?’ There were so many questions!”\n\nMs. Sheikh, a third-year B.Com student, is a volunteer with Parivartan, a programme run by the International Centre for Research on Women (ICRW), Apanalaya (an NGO in Mumbai), and the STRIVE research consortium (from the London School of Health and Tropical Medicine). Parivartan seeks to address gender discrimination using sports, connecting girls with mentors, coaching them on teamwork, skills and empowerment.\n\nFor many of the families of Shivaji Nagar, even the idea of girls entering the playground without an accompanying male family member was alien. Undeterred by the reactions, Ms. Sheikh visited families and personally persuaded them to let the girls play. Her efforts paid off. On Sunday, 75 girls played their first-ever kabaddi tournament at the Dr. Babasaheb Ambedkar ground in Govandi.\n\nSupportive parents\n\nAfter the initial hesitation, many parents were very supportive. Bahadur Sheikh, a resident of Shivaji Nagar who had come to watch his daughter play in the tournament, said, “If they don’t go out and study, how will they progress? People can say what they want, but I wanted to see my daughter happy so I let her play here.” Ms. Sheikh is one of 10 mentors who worked with the girls to train them and make the tournament happen. She, like the others, was herself first trained by coaches from the Maharashtra State Kabaddi Association. Chand Bi, another mentor, said, “Forget about the girls; even we had never done exercise!” She says that she wanted to overturn the perception of kabaddi being a masculine sport: “We want to prove it to all that we too can play it.” Ms. Sheikh’s motivations were similar.\n\nMadhumita Das, project leader from ICRW, told The Hindu , “We wanted to make it a different programme. Instead of going through regular closed door workshops and talks on gender equality, we thought sport would be the best way to bring girls together. And they loved it.”\n\nStarted a year and half ago, Parivartan initially had 174 girls enrolled, a number which has since fallen to 100. “Once a decent marriage proposal comes in, the girls are married off, without seeking her opinion or thinking about her education,” Ms. Das said. The Parivartan team is well aware of the enormity of the task ahead. Ravi Verma, Regional Director, ICRW’s Asia Regional Office, said, “Promoting gender equality won’t happen overnight. It requires hard work, innovation and perseverance.”", 
    "section": "national", 
    "title": "Overcoming gender barrier with sports", 
    "subsection": "general", 
    "date": "2016-01-04"
}