{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "RSS evokes Gandhiji’s vision of ‘Hind Swaraj’\n\nRSS chief Mohan Bhagwat arriving for the 'Shivshakti Sangam' of the Rashtriya Swayamsevak Sangh at Marungi village in Pune on Sunday.— PHOTO: Jingesh Mistry\n\nA society which thrives on discrimination cannot endure, said Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat on Sunday, calling for a discrimination-free society predicated on truth, justice and equality.\n\nMr. Bhagwat evoked Mahatma Gandhi’s vision of ‘Hind Swaraj’ and said the Sangh stood for equality. He was addressing the huge RSS gathering at Pimpri-Chinchwad here.\n\nMore than 1.5 lakh Sangh activists from across 5,000 villages in Pune, Nashik, Ahmednagar, Satara, Sangli, Solapur and Kolhapur districts in western Maharashtra attended the event.\n\nThe tone and tenor of the RSS chief’s address emphasised religious unity and extolled an egalitarian society.\n\n“The bad deeds committed by strong nations are often overlooked, while the good deeds by the weaker nations are often not accorded any value … a nation’s prestige increases only by its strength. This is the way of the world. But that strength must be calibrated by justice,” exhorted the RSS chief, from a massive set resembling Shivaji’s Raigad Fort.\n\nThe set was built by noted art director Nitin Desai. An eco-friendly theme was stressed throughout the conclave, which is the RSS’ biggest effort in recent times to reach out to all sections of society.\n\nMr. Bhagwat cited diversity of India’s culture and its religions as its bedrock and said “all religions in the country preached truth and non-violence.”\n\nCommenting that India could act as a cultural and moral beacon to the world, the RSS chief said that “even if a society was materially impoverished, but disciplined and resolute, it could achieve the impossible.”\n\nCites Israel\n\nIn this context, the RSS chief referred to the birth of Israel in 1948 following 2000 years of continuous persecution endured by the Jewish people since they became a Diaspora.\n\nAccording to political observers, the real agenda behind the RSS’ show of strength was a bid to break the stranglehold of the sugar barons of western Maharashtra and supplanting the influence of the Congress and the Sharad Pawar-led Nationalist Congress Party in the region.\n\nAlso present were Chief Minister Devendra Fadnavis and Sarkaryawah Suresh Joshi — a rare occasion when the latter shared stage with the RSS chief.", 
    "section": "national", 
    "title": "RSS for equality, says Bhagwat", 
    "subsection": "general", 
    "date": "2016-01-04"
}