{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Even as the Shiv Sena termed the Pathankot terror attack a “security failure” and said there should be no talks with Pakistan, the RSS and some key BJP allies stood by the Narendra Modi government’s attempt to engage Pakistan days before the terror strike in the Punjab town.\n\nThe Pathankot terror attack comes days after Prime Minister Narendra Modi made a surprise visit to Lahore to wish his Pakistani counterpart Nawaz Sharif on his birthday, on Christmas. “We are against talks with Pakistan. We had said when Mr. Modi went there that we had apprehensions Pakistan would backstab India. These have come true,” Shiv Sena leader Sanjay Raut told The Hindu .\n\n“The Pathankot attack is an example of intelligence failure and internal security failure.”\n\nThe Sena, a BJP ally, has not been on the best of terms with the BJP in recent times.\n\nThe BJP’s line during the UPA days was that talks and terror could not coexist. However, the BJP government has tried to engage the neighbouring country in talks after it came to power.\n\nThe Shiromani Akali Dal (SAD), which shares power with the BJP in Punjab, however, supported the talks.\n\n‘Talks only solution’\n\n“We [Punjab] are in the direct line of fire. We know that the only solution is talks. We must continue to talk to civilian authorities and civil society in Pakistan but offer a strong reply to any misadventure by the ISI and Pakistani army,” SAD leader Naresh Gujral said, drawing a clear distinction between Pakistan’s civilian government and military authorities.\n\nMeanwhile, Minister of State for External Affairs Gen. (retd.) V.K. Singh was quoted by PTI as saying the civilian government in Pakistan needed to be strengthened. While talks were a good thing, Pakistan needed to control terrorists, he added.\n\nThe RSS backed the Modi government’s engagement with Pakistan.", 
    "section": "national", 
    "title": "RSS, SAD back talks but Sena hits out at engagement", 
    "subsection": "general", 
    "date": "2016-01-04"
}