{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The KPCC president says SNDP Yogam general secretary Vellapally Natesan’s new party is a front of RSS.— Photo: S. Ramesh Kurup\n\nKerala Pradesh Congress Committee president V. M. Sudheeran has fired the opening salvo against SNDP Yogam general secretary Vellapally Natesan on the eve of his much publicised “Jana Raksha Yatra” scheduled to commence in Kasargode on Monday.\n\nIn a lengthy press release that set the tone for his one-month-long political tour of the State, Mr. Sudheeran condemned the RSS move to ‘swallow’ the socially reformist, essentially liberal and inherently progressive SNDP movement.\n\nHe said the Prime Minister’s office and Mr. Natesan were responsible for the last minute withdrawal of the invitation to Chief Minister Oommen Chandy to participate in the unveiling of the R. Sankar statue in Kollam. Mr. Natesan’s newly launched party was an RSS front. The BJP’s bid to usurp the political legacy of R. Shankar would fail. Mr. Natesan’s actions and comments were deeply divisive and communal.\n\nMr. Sudheeran touted the decision to close 730 non-5 star bar hotels as a singular social welfare achievement of the State Government. He claimed there has been a record 20.27 per cent dip in the legal sale of alcohol since the policy was implemented in April last.\n\nThe Supreme Court decision, which vindicated the government’s pro-prohibition stance, had given an added impetus to his ‘yatra’. It would conclude in the capital on February 9. Flagging rubber, coconut and cardamom prices had driven farmers to debt and poverty.\n\nUnrestricted import had caused the prices to deteriorate. The fall in crude oil prices had not benefited the public.\n\nThe ‘yatra’ will highlight the UDF government’s liquor policy and the need the fight communalism, among other issues.", 
    "section": "national", 
    "title": "Sudheeran condemns RSS move to ‘swallow’ SNDP", 
    "subsection": "general", 
    "date": "2016-01-04"
}