{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Leading farmers’ organisations in the district have come together to launch a series of protests against the Kerala Forest Department’s alleged move to attach the farmland of around 40 settler farmers in the hilly regions of Kakkadampoyil.\n\nA joint meeting of major organisations will be convened in two weeks with a mission to take up the issue with the State government in the wake of the suicide of a farmer after the Forest Department initiated measures to attach his farmland.\n\nAccording to farmers’ organisation leaders, Kaniyarathu Jose, the settler farmer from Kakkadampoyil, committed suicide on New Year eve as the Forest Department did not consider his plea to withdraw the legal action.\n\n“As per the Forest Department records, the area where the farmer started cultivation several decades ago was part of forest area and it had to be restored,” they said.\n\nP.V. Chacko, leader of Farmers’ Relief Forum, said the suicide by the elderly farmer had shocked the people in entire region and it would remain a blot on our poor democratic system that had failed to tackle such farm crisis in time.\n\n“It was the Forest Department’s decision to unlawfully attach the farmland that abetted the suicide and it should be taken up seriously,” he said.\n\nLeaders of Indian Farmers’ Movement (Infam), led by Antony Kozhuvanal and James Kottur, said all farmers’ organisations should fight united against the attempt to evacuate poor farmers from their land.\n\n“To begin with, a meeting of all farmers’ organisations would be held in Kozhikode on January 9,” they said.\n\nC. Moyinkutty, MLA, who visited the house of the deceased farmer, said the government should check whether there was any hasty decision on the part of the Forest Department that had led to the suicide of the farmer.\n\nAround 40 settler farmers are up in arms against attempt to take over farmland", 
    "section": "national", 
    "title": "Suicide of farmer: Kerala Forest dept. move to attach land condemned", 
    "subsection": "general", 
    "date": "2016-01-04"
}