{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "External Affairs Minister Sushma Swaraj held a round-table meeting here on Sunday with a group of veteran diplomats, where a mood for dialogue with Pakistan was apparent.\n\nThe participants included the former Special Envoy on Afghanistan S.K. Lambah; the former Foreign Secretaries Shyam Saran and Shiv Shankar Menon; and the former High Commissioners to Pakistan G. Parthasarathy, Sharat Sabharwal and TCA Raghavan. This was the first time after taking charge of the Ministry that Ms. Swaraj had specially summoned veteran diplomats for consultation.\n\nThe meeting focussed on the political risks undertaken by Prime Minister Narendra Modi to restart the Comprehensive Bilateral Dialogue, which is expected to stay on track despite the provocation caused by the Pathankot terror strike.\n\nFormer Foreign Secretary Kanwal Sibal said the consultation showed that the government had taken note of the hardening opinion against Pakistan after the Pathankot attack. “Obviously, the government has committed to talks with Pakistan, knowing well that terror strikes like the one in Pathankot might take place as Pakistan is a very difficult country to handle for any Indian government. Pakistan has also condemned the attack showing its commitment to talk, but it is under less pressure to have a dialogue with India. The issue is how long India can manage public opinion through consultations when terror strikes continue. However, the government seems to be aware that it is not the first Indian government to conduct dialogue with Pakistan while terror strikes continue. A similar situation existed in the past also,” Mr. Sibal said.\n\n‘Firm response’\n\nHe said the government should be imaginative with a firm diplomatic response to the Pathankot attack, as otherwise, the talks held under such circumstances would establish the old Pakistani position that terror should be delinked from dialogue. “India’s diplomatic response has to deter Pakistan from future attacks,” Mr.Sibal said, underlining that the government did not have a wide range of choices as the clock was ticking for the Foreign Secretary-level talks to be held in Islamabad on January 15 and 16.\n\nA veteran journalist, Vijay Naik, said the consultation showed that the government was worried that the Pathankot terror strike might affect ties with Pakistan and related international commitments.", 
    "section": "national", 
    "title": "Sushma consults veteran diplomats on talks with Pak.", 
    "subsection": "general", 
    "date": "2016-01-04"
}