{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Officials said the leopard (left) was hit by a railway engine. (Right) The cause of the full-grown tiger's death will be known only after the post-mortem report arrives.— Photos: Special arrangement\n\nWhile 2015 ended on a sad note with the death of three tiger cubs, 2016 turned sadder. A tiger and a leopard were found dead in Nagpur forest division on consecutive days, raising questions on the State’s claims of protection to tigers.\n\nOn Saturday at 3.30 p.m., the body of a full-grown tiger, about 4-5 years old, was found near a lake in Umari village in Deolapar range of Ramtek tehsil. Interestingly, half-eaten bodies of a spotted deer and a wild boar were found close to the dead tiger.\n\n“The tiger’s carcass was spotted by forest guard, who alerted the officials,” said Shree Bhagwan, principal chief conservator of forests. “The body was then taken for post-mortem. While the body was burnt later, viscera has been sent for further tests to find out the exact reason behind the tiger’s death.”\n\nMr. Bhagwan said the tiger was originally from a forest range in Madhya Pradesh and was roaming in this area probably to establish its territory. “At present, we do not think it is the case of poaching since all organs of the animal are intact. We will know about the reason once the viscera test reports are in,” he said.\n\nThe second incident took place Near Chimanazari in Nagpur forest division, where a leopard was found dead close to a railway track. According to the forest official, the leopard was hit by a moving train engine, resulting in its death.\n\nLast week, three tiger cubs were found dead due to severe malnutrition in Vidarbha. Their mother is said to be missing. The State government has announced the formation of SIT, comprising officers from CBI, forest department and local police to probe the case.", 
    "section": "national", 
    "title": "Tiger, leopard found dead in Nagpur forest division", 
    "subsection": "general", 
    "date": "2016-01-04"
}