{
    "author": [
        "P Sujatha Varma"
    ], 
    "text": "A floating restaurant on the Krishna will be among the projects the Andhra Pradesh government plans to attract tourists.— Photo: Ch. Vijaya Bhaskar\n\nIt’s floating restaurant and cottages in the Krishna near Bhavani Island. Andhra Pradesh is finally stepping into the league of big time tourism.\n\nWith tourism being high on the government agenda, every possible step is being taken to attract investors, both big and small, to change the face of Amaravati, the new capital of Andhra Pradesh which is eager to project itself as an international tourist destination.\n\nCatching up with global tourism trends, the government has designed a slew of world class projects that would put the State on the map of world tourism. A floating restaurant on the pristine waters of the Krishna is one of the many unprecedented joys in the making on tourism front. Imagine the joy of sipping on freshly-brewed coffee sitting pretty on this floating body that’ll give a panoramic view of the tranquil river. A visit to the picturesque Bhavani Island which has been equipped with all the trappings of a picnicker’s paradise, followed by a coffee session floating on the river can be an ideal holiday.\n\nThe floating restaurant in the river is being introduced by the Goa-based Champions Yatch Club, a private yatch club which introduces boats and yatchs in water bodies across the country.\n\nBhavani Island being the prized possession of the Andhra Pradesh tourism sector, has been the cynosure of all eyes ever since the erstwhile Y.S. Rajasekhara Reddy Government decided to beautify this 133-acre stretch of land perched in the Krishna into a tourism destination.\n\nPost-bifurcation, the island has been creating a lot of buzz with Chief Minister N. Chandrababu Naidu evincing keen interest in developing this place on the lines of the world famous Sentosa Island resort in Singapore.\n\nAddition of this enchanting feature near the island will only enhance the pleasure quotient of the place.\n\nSources in the Yatch Club said that there are bigger plans of introducing a floating restaurant and perhaps floating cottages on the river in the days to come. “Introduction of ferry services in Buckingham canal in Vijayawada city also figures in the list of our future projects,” said Yogesh Reddy from the marketing and operations wing of the Yatch Club.\n\nSources in Andhra Pradesh Tourism Department, meanwhile, say that Champions Yatch Club has not yet acquired all the mandatory permissions needed to operate its new project.", 
    "section": "national", 
    "title": "Tuck into your favourite food on river Krishna", 
    "subsection": "general", 
    "date": "2016-01-04"
}