{
    "author": [
        "Rohit Ps"
    ], 
    "text": "If you see youngsters busy swiping on their smart phones while standing at some odd location, do not think they have found a cool hangout. For all you know, they could be guzzling free internet through an unsecured Wi-Fi, unaware of the risks.\n\nInmates of a residential complex in West Marredpally recently noticed that their area was teeming with youngsters who stayed on the pavement till 1 a.m. Puzzled, they made enquires to find out the reason.\n\nIt was only when the security person switched on his phone’s wireless and latched onto an unsecured Wi-Fi connection that the youngsters’ presence made sense.\n\nTo the surprise of building’s management, the unsecured router sending strong signals up to about 100 metres away was housed in the guest accommodation of a reputed nationalised bank. Security experts say that Wi-Fi networks which are open and allow access without authentication are mostly seen in coffee shops of Hyderabad. However, most other networks with passwords are also as unsecured, says security expert Vikas Jain.\n\n“Most people install passwords which are easy to crack. Wireless devices are also left in their default configurations with weak passwords. Accessing unknown networks involves risk of confidential data loss while the owner of the network is inviting trouble,” he said adding that even the tech-savvy in areas like Madhapur and Hitech City did not secure their networks.\n\nEarly last year, unsecured networks became a matter of security for Navi Mumbai police who decided to act. They identified 70 unsecured connections and alerted establishments to the risks of unsecured Wi-Fi, which after the Pune German Bakery blast in 2010, were seen as a threat to public safety.\n\n‘Some Hyderabad coffee shops\n\nhave networks which can be accessed easily’", 
    "section": "national", 
    "title": "Unsecured Wi-Fi networks a risk", 
    "subsection": "general", 
    "date": "2016-01-04"
}