{
    "author": [
        "Namrata Joshi"
    ], 
    "text": "The government’s appointment of a panel headed by veteran filmmaker Shyam Benegal to revamp the Censor Board has raised more questions than answers.\n\nDoes this mean that the new committee will just be a teacher and monitor to the current board? Or will it go deeper and look into the procedural rehaul of the process of censorship of films itself? And if it has been formed to usher in sweeping changes then what happens now to the Mudgal Committee report?\n\nThe Mudgal Committee had been set up under the UPA regime and was headed by Mukul Mudgal, former Chief Justice of the Punjab and Haryana High Court. Set up in 2012, the panel members included, among others, FCAT chairperson Lalit Bhasin, the then CBFC chairperson Leela Samson and film personalities Sharmila Tagore and Javed Akhtar.\n\nCensor Board member Vani Tripathi Tikoo feels the new panel is a “welcome move.” “It is not a kneejerk reaction to any controversy but a breakthrough in terms of policy,” she says.\n\n‘Positive step’\n\nFilmmaker Rakeysh Omprakash Mehra says he accepted the government invite to be part of the revamp panel for the “right reason and cause.” “It is a positive step, in the right direction.”\n\nWhile he admits that he has done enough groundwork in terms of thinking through his own views on censorship, the real mandate of the new panel has not been clearly defined yet. In fact, they have to have a first meeting to create that mandate for themselves. “It is just the start of the journey. We will define the targets and will need two-three months to come out with something substantial,” he says. But what he does assure you is that they will go to the root of the matter than pay mere lip service to the censorship debate. “It will have to be all about policy changes, about changing the Cinematograph Act of 1952 and updating it to today’s times,” he says.\n\nWhich is what brings one back to the important question — if it will be about a whole procedural rehaul then what of the Mudgal report that had suggested some far-reaching, comprehensive changes in censorship? It had spoken to many people — filmmakers, viewers, legal experts and journalists, done the spadework and covered a gamut of critical issues — from certification categories to selection of the board members, issues such as portrayal of women, obscenity and communal disharmony, piracy and also jurisdiction of the appellate tribunal. It was formed in the wake of the controversy over Tamil Nadu’s ban on Vishwaroopam and had even laid down that no State could ban a film without taking the Centre into confidence.\n\nThese recommendations had been forwarded to the Ministry but the government(s) seemed to have developed cold feet on it.", 
    "section": "national", 
    "title": "What happens to Mudgal report?", 
    "subsection": "general", 
    "date": "2016-01-04"
}