{
    "author": [], 
    "text": "Sign boards to denote dead-ends\n\nWith several sign boards — like ‘turn left,’ ‘turn right’ and ‘speed breaker ahead’ — to help motorists navigate safely across the city and avert accidents and traffic jams, there is still one type of sign board missing, and the absence of it causes much inconvenience to most commuters and especially tourists. There are streets that turn from arterial roads in the city and that are dead-ends. It is a hassle, and sometimes a nuisance, when a motorist, drives along a stretch for a considerable distance only to realise that he has reached a dead-end and his only option is to turn back around. And when such roads are narrow, the ordeal of turning the vehicle around is even greater. Thus, it is essential that sign boards denoting dead-ends be installed at street entrances to help motorists save time and gas.\n\nJ. Manohar Singh\n\nAdambakkam\n\nBank turns a blind-eye: pensioner\n\nI retired from the Railway service in 1989 and have since been drawing my pension through Indian Bank, Mylapore Branch. My pension was revised with effect from January 1, as communicated by the FA and CAO of Southern Railways in the letter no. Pen 0601205289 dated October 9, 2015 to the manager of Indian bank, Mylapore branch, a copy of which was endorsed to me.\n\nDespite approaching the bank, no action has been taken by Indian Bank to credit the arrears as communicated to me. I am in frail health and it is regrettable that no action has been taken despite communicating this to the bank through letters and even in person.\n\nT.R. Balasubramanian\n\nMylapore\n\nRestore bus route\n\nI am a resident of Royapettah and commute to work daily by bus. The floods have left the road that connects Luz and Sanskrit College in ruins and therefore renovation work is being carried out. As a result of this, bus services have been suspended between Thiruvalluvar statue, Ajanta and PF Office. Commuters, like me, are forced to walk up to Music Academy to catch a bus which is diverted through Vivekananda College to Royapettah. There are only a few bus stops there which make it even more difficult. I request authorities to ply buses through Royapettah High Road, at least during peak hours.\n\nAnuradha Balachandran\n\nRoyapettah\n\nThe peril of raising road level\n\nThe issue voiced by R. Ganesan (Readers Mail, January 25) is very pertinent. We have been raising the same issue with Tambaram Municipality several times. Although the unusual rainfall has been blamed for all flood-related chaos, raised road levels, defunct underground drainage system and poorly planned stormwater drains majorly contributed to the disaster. With raised road levels, every house turned into a pool of sewage and the pricewe pay for ill-health, is beyond estimates. Unless the Chief Minister takes initiatives to pull the authorities, there will be no solution to ‘raising road levels and poor drainage system’. Let us hope and wait.\n\nR.S. Venkataramanan\n\nEast Tambaram\n\nReaders can share their grievances and send pictures to reporting.thehindu@gmail.com", 
    "section": "national", 
    "title": "31JANCHMAK01_rm READERS’ MAIL", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}