{
    "author": [], 
    "text": "His name is synonymous with Tamil music in Madurai. But it is very difficult to ward off distractions caused by the aroma of food prepared in the kitchen and mellifluous Mohanam from his mobile phone while listening to this musicologist recollect the octaves and sextets in the musical journey of his life from Idaikal near Courtallam in Tirunelveli district to Madurai. After numerous articles and seven books on Tamil music since his retirement as Superintendent in the Department of Highways on December 31, 2004, the crowning glory being the celebrated Tamil Isai Peragarathi, N. Mammathu is currently working on an exposition of 100 ragas to be published by the Tamil Music Research Centre of Thiagarajar College.\n\nMr. Mammathu tells S. Annamalai what attracted him to music and who inspired him to do research.\n\nThe genetic reason for the music flowing in him is his father, a successful farmer and businessman and a lover of music in any form. “I did not have to go out in search of music in my young age. Music was an integral part of life. People were surrounded by music in villages. Every woman born in Tamil Nadu was a singer then and I could hear lullaby at any time of night in my village. Even death featured 16 days of dirge. Temple festivals were filled with music in the form of ‘villu pattu’ or ‘karagattam,’” recalls Mr. Mammathu. The love for music transformed into a passion for musicology during his undergraduate days at MDT Hindu College, Tirunelveli, where he came into contact with scholars of repute and C.S. Mani, an employee of Department of Posts. “Mani was a person with vast knowledge and extraordinary memory. We used to assemble at his house on Friday evenings to listen to discourses on various topics. It was Mani who initiated me into musicology as he felt that there were very few musicologists in the State.”\n\nFrom his college days, he started to collect books on music. His postal service took him to many towns in Tamil Nadu and when he came to Madurai he realised that he had “reached a 2000-year-old city of arts, temples, festivals and stone inscriptions.” “This is a living city, the seat of music. It was here the trimurtis of Tamil music — Sankaradas, Viswanathadas and Baskaradas — lived.” But the turning point was his association with eminent musicologist, V. P. K. Sundaram, a professor of American College and author of Tamil Isai Kalaikalanjiyam published by Bharatidasan University for 20 years. In between, he obtained a postgraduate degree in Philosophy and Religion and M. Phil. in Sufi music from Madurai Kamaraj University.\n\nExplaining the evolution of Tamil music, he says that five of the seven ‘melakartha ragas’ belong to each of the five Tamil landscapes — Kurinji, Mullai, Marutham, Neithal and Paalai — with an additional raga each for Neithal and Marutham. This additional raga is co-terminus with two capitals — on the coast and inland — the ancient Tamil kings had. The Pandyas had Korkkai and Madurai, Cholas Poompuhar and Woriyur and Cheras Musiri and Vanchi. Mohanam was the first raga of Tamils.\n\nChina’s prima raga\n\n“Ragas are universal. China’s prime raga is Mohanam. Its national anthem is in Mohanam,” he says. Mr. Mammathu says that there cannot be a debate over which music is ancient. “Tamil music has different genres — folk, dance, theatre, light, devotional and chamber. These are the primary forms of music which can be sung in any language. But the elite have popularised chamber music. This does not mean that other genres are inferior.”\n\nTurning to popular film music, Mr. Mammathu is of the firm view that one should not be critical of contemporary music. “Every era comes up with a form of music that signifies a change in popular taste. The era dominated by the likes of G. Ramanathan churned out pure Carnatic music and M.S. Viswanathan made it light. Ilayaraja infused folk music and A. R. Rahman is known for fusion music.” While affirming that music is universal, Mr. Mammathu says that a researcher should not be influenced by the love for his mother tongue.\n\n“When he came to Madurai, he realised that he had reached a 2000-year-old city of arts, temples, festivals and stone inscriptions”", 
    "section": "national", 
    "title": "A musicalogist’s journey", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}