{
    "author": [], 
    "text": "Periscope allows people to broadcast live videos on Apple and Android platforms\n\nA mobile phone app that seems to have caught the attention of celebrities these days is Periscope. The most recent of the ones who have been actively using this app seem to be music director A.R. Rahman and DMK treasurer M.K. Stalin.\n\nPeriscope by Twitter that is available both on Apple and Android platforms, allows people to broadcast live videos. It also gives the option of making the video public or only available to some specific persons. Sometime back, Rahman took to this platform and interacted with his followers on Twitter for a while. The video had him speaking and showing the roads of Chennai to his followers while he was on his way to K.M. Conservatory.\n\nAs soon as he started the streaming, there were hundreds of ‘like’s. During the floods, he posted one with the title: “Bangalore feels for Chennai.” A few days ago, Mr. Stalin used this app for his Nammakku Naame campaign. When he met IT professionals as part of the fourth leg of his campaign, there was live streaming of the programme for his followers.\n\nAddressing adoption issues\n\nA young psychologist in the city, who has a personal and a professional connect with the issue about adoption, has been talking about counselling — to families and counsellors as well.\n\nVarsha Swamy says that along with her mother, she hosted an adoption workshop recently for parents who were looking to adopt. “My mother and I engage with such parents as I was adopted as well and can empathise with them,” she says. Explaining the need for a niche area such as ‘adoption competency’ to be addressed, Ms. Swamy says that students of counselling as a broad-based subject need exposure to such issues.\n\n“Adoption is also still a taboo in many families and we need more awareness. We need to encourage people to speak more about it and make them aware as well about what is involved in welcoming a child to one’s home,” she explains. She plans to educate students, drawing from her experiences and professional interest.\n\n(Reporting by\n\nSunitha Sekar and\n\nS. Poorvaja)", 
    "section": "national", 
    "title": "A window to the celebrity world", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}