{
    "author": [], 
    "text": "He gave this reply when asked about TheniDjeacoumar’s statement on contesting from Villianur\n\nLeader of Opposition V. Vaithilingam recently said that MLAs abstaining from party functions and paying tributes to leaders cannot be labelled as being a non-functionary of the party.\n\nMr. Vaithilingam gave this reply when his attention was drawn by media persons to the demand of estranged Congress MLA and former Minister Theni C. Djeacoumar that he would contest in Villianur constituency as Congress party candidate and also field his supporters in Mangalam and Oussudu constituencies.\n\nMr. Djeacoumar has been avoiding the party platforms in the recent past citing personal reasons. His overture towards the ruling AINRC raised many eyebrows a few months ago.\n\nMr. Vaithilingam said that the present Chief Minister N. Rangasamy did not attend most of the party meetings when he was in the Congress. But he was made the Chief Minister. Hence, merely because one abstains from party meetings he cannot be deemed to be a non-functionary of the party, he said.\n\nMessage lost\n\nin Conference\n\nDelegates from other states attending the 13{+t}{+h}All India Conference of Central Health Employees (CHEF) held at Jawaharlal Institute of Postgraduate Medical Education and Research (Jipmer) on Friday were perplexed as the inaugural meeting began. They did not expect that the speakers would talk in Hindi and Tamil.\n\nThe Puducherry journalists left when the speakers spoke in Hindi and the delegates became restive when the trade union leaders from Puducherry and Tamil Nadu spoke for hours in Tamil.\n\nIt was only the Jipmer Director who spoke in English. Only a couple of speakers addressed why the meeting was held. Many of them deviated from the topic and introduced the audience to the different labour movements across the world. Did the meeting serve the purpose? This is a question to be pondered over by the audience.\n\nA mock poll with real-time officers\n\nNormally whenever the election is announced, the officials concerned would demonstrate on how to use electronic voting machine at the time of polling in state-run television and vanish. General public, especially first time voters, who has little knowledge on the electoral process, have to enter the polling booth with slight apprehension. To allay such apprehension, for the first time, the Election Department conducted mock poll.\n\nThe mock poll started with real-time Returning Officer and Deputy Collector A. Vincent Rayar issuing notification for election to a constituency. Like real-time polling process, withdrawal, scrutiny of nominations, rejection and publishing list of candidates followed and symbols were allotted. The young students campaigned and over 400 voters cast their votes in electronic voting machines (EVMs). Results were declared and winners received certificates.\n\nReporting by S. Prasad,\n\nS. Senthalir and\n\nR. Sivaraman", 
    "section": "national", 
    "title": "Abstaining from meets not anti-party: Vaithilingam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}