{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The four basketball players, who represented Tamil Nadu in the second National Wheelchair Basket Ball tournament and won the third place, were felicitated at Christian Medical College in Vellore on Friday. —Photo: C. Venkatachalapathy\n\nSpinal injury might have changed their lives completely. But four young men, who were treated and rehabilitated at Christian Medical College (CMC), Vellore, overcame the challenges to make a difference.\n\nThe four — M. Venkatachalam, Parthasarathi, Kumaresan and Velusamy — represented Tamil Nadu wheelchair basketball team at the second National Wheelchair Basketball Tournament and bagged the third place. The tournament was held from December 2 to 6 last in New Delhi.\n\nThe Department of Physical Medicine and Rehabilitation, CMC, felicitated the four players recently. Alfred Job Daniel, Principal of CMC, lauded their achievement.\n\nThe four persons were part of the 10-member basketball team from Tamil Nadu. The other members were either affected by polio or were amputees.\n\n“The four underwent treatment and rehabilitation at Rehabilitation Institute of CMC, and underwent initial training in basketball there. We incorporated wheelchair basketball into the rehabilitation programme in 2014 to boost the confidence and self-esteem of patients and motivate them,” Raji Thomas, head of the department, said.\n\nDr. Thomas said spinal cord injuries posed numerous challenges for patients as they would lose sensation in the legs and would not be able to move them. The felicitation was to inspire and motivate current patients at the institute.\n\nThe department introduced wheelchair sports into the rehabilitation programme not on a competitive basis, but to expose the patients to sports and make them fit, Senthil Velkumar, in charge of physiotherapy at the department, said.\n\nThe four patients also got the opportunity of getting trained by the Indian Wheelchair Basketball Federation, and went on to get selected for the Tamil Nadu team. They had also participated in State-level tournaments.\n\nTwenty-eight-year-old Venkatachalam, a resident of Gudiyatham, Vellore, sustained spinal cord injury in a bike accident in 2009. While Parthasarathi was injured in a fall from a roof, Velusamy had a fall from a tree and Kumaresan was injured after he fell from a cell phone tower while at work.\n\nIn fact, Mr. Venkatachalam and Mr. Parthasarathi had participated in the national tournament the previous year too. “I have won the athletic events of discus throw, shot-put and wheelchair race in the Paralympics in 2015,” Mr. Venkatachalam said.\n\nThis has helped him in many ways, he said, adding, “I was devastated following the spinal cord injury, and did not know what I was going to do for the rest of my life on a wheelchair. But being part of sports has energised me, made me fit, and has won the recognition of being a national player.”\n\nThe duo is preparing for the selection for international championships to be held in March.", 
    "section": "national", 
    "title": "Aiming at success from wheelchairs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}