{
    "author": [
        "S Prasad"
    ], 
    "text": "Government’s financial requirements were not fully met by the Centre, says Rangasamy\n\nUnion Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan and Chief Minister N. Rangasamy at the function to lay foundation stone for construction of approaches to road over bridge at Arumathapuram in Puducherry recently.- Photo: S.S. Kumar\n\nThe two-year-old alliance between the ruling AINRC and the BJP is under severe strain with AINRC founder and Chief Minister N. Rangasamy expressing his displeasure known in clear terms at various meetings by complaining that the Centre has not been releasing the flood relief assistance sought by the Union Territory Government.\n\nAlthough the BJP and the AINRC worked out an electoral understanding ahead of the Parliamentary elections in 2014, there has been a gradual slide and the alliance is now on a sticky wicket. However, the local unit of the BJP has maintained that the party’s alliance with the AINRC continues.\n\nMr. Rangasamy had openly come out with a statement at a function recently that the Government’s financial requirements were not fully met by the Centre.\n\nThe Chief Minister had complained that against Rs.400 crore sought by the Government as relief assistance, the Centre had granted only Rs.50 crore. He maintained that the Government was going ahead with its own plans to disburse the relief to all sections.\n\nThe two parties have been at loggerheads ever since the AINRC allotted the Rajya Sabha seat to the AIADMK and sealed a deal last year.\n\nThe BJP leaders openly started criticising the Government amid concerns over lack of effective coordination between the two alliance partners.\n\n“Inspite of the Chief Minister raising various issues including grant of Statehood, waiver of loans to the tune of Rs.7,000 crore and financial package during his meetings with the Prime Minister Narendra Modi and Union Home Minister Rajnath Singh no positive action has been taken up by the Centre.\n\nThe Chief Minister has no other option but to make open criticism against the Centre. Mr. Rangasamy will take the decision on the continuation of the alliance with the BJP,” said a senior leader of the AINRC.\n\n“The Central Government will not let down Puducherry in allocation of funds. Certain procedural formalities have to be fulfilled and that has been the reason for the delay in availability of funds.\n\nHowever, funds will definitely be available to the UT.\n\nThe BJP would be a deciding factor in the forthcoming elections and in the formation of the next Ministry in Puducherry,” BJP president V. Saminathan said.", 
    "section": "national", 
    "title": "AINRC-BJP alliance on a sticky wicket", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}