{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Superintendent of Police N. Manivannan launching the hi-tech app system fitted to patrol vehicles at the SP office in Ramanathapuram on Sunday.— Photo: L. Balachandar\n\nThe district police have provided teeth to the patrolling system by introducing vehicles fitted video-recording cameras having an exclusive high security app.\n\nLaunching the hi-tech system here on Sunday, SP N Manivannan said thanks to the ‘fourth generation patrolling vehicles’, he can now monitor any situation in the town sitting in his chamber.\n\n“Before reaching the spot, I can assess the situation by getting a 360-degree view of what is happening at the site, be it the scene of crime, law and order problem, traffic congestion, public meeting or a VIP visit,” the SP told reporters after launching the system.\n\nThe patrolling vehicles are provided with two cameras each at the front and rear sides. Images would be transmitted through a modem and with the help of a static internet protocol, S Vijayan, Operations Executive of the Chennai-based Devatech Info Systems private limited, which developed the app, said. The SP and Assistant Superintendent of Police (ASP) S Sarveshraj, who took the initiative in introducing the system, can access the video footage by downloading the app on their Android mobile phones.\n\nThe app has been developed with high security features, Mr Vijayan said, adding unlike the CCTV cameras system, ‘outsiders’ cannot have access to the footage, he added. Recording facilities with one month back-up were also available in the vehicles, he said. The cameras with night mode feature can capture clean images up to 20-foot distance and there is a zoom-in facility for accuracy, he added.\n\nThe system has been installed at a cost of Rs 1.70 lakh, drawn from the Collector’s fund, the SP said. “We will introduce the system in the sensitive Paramakudi area and the pilgrim island of Rameswaram in the next phase,” he said.\n\nThe district police have also installed 12 static surveillance cameras at strategic points in the town. They propose to introduce a dozen more cameras and connect them all to a control room.\n\nSuperintendent of Police\n\ncan take stock of things\n\nfrom his chamber", 
    "section": "national", 
    "title": "An app to monitor law and order", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}