{
    "author": [
        "M K"
    ], 
    "text": "A transformer and a few telephone junctions on the footpath between Nava India and Lakshmi Mills Junction on Avanashi Road have made it convenient for vehicles to be parked and forced pedestrians to walk on the road.— Photo: S. Siva Saravanan\n\ns air pollution levels increase in different cities, and governments and organisations urging the public to reduce the use of personal vehicles, there is a need to step up infrastructure for public transport system and pedestrians.\n\nWhile using public transport facilities such as buses, people have to go on foot for a short distance. But, lack of proper facilities and concern over safety of pedestrians in Coimbatore continue to be an issue of concern. City police statistics shows that more than a third of the victims killed in road accident are pedestrians.\n\nPersons getting killed or injured in accidents on Corporation roads (in the city) is more than on the National and State highways that run through the city. Most of them get hit while crossing the road by jumping medians or trying to get past speeding vehicles. According to the police, aged persons are among those in the vulnerable segment.\n\n“Flyovers are constructed as the number of vehicles plying on the city roads has also gone up and the growth in the future is expected to be high. But, even basic infrastructure is not available for pedestrians,” says V.R. Gokul, a college goer who faces difficulty like hundreds of other in crossing the busy Gandhipuram Junction to take a bus to college. Footpaths there are mostly occupied by vendors.\n\nCrossing the road is tougher at places such as Sungam Junction as there are no zebra crossings for pedestrians and at Lanka Corner where thousands cross the road on day-to-day basis to reach the railway junction and the Coimbatore Medical Centre Hospital just opposite the bus stand.\n\n“Vehicles from six directions use the Lanka Corner Signal. Coupled with the bus terminal and lack of zebra crossing, it makes it a tough task for patients and attendants to cross the road,” says 75-year-old R. Kathiravan who takes care of his wife admitted in the government hospital.\n\nThe city does not have enough skywalks or subways and even the skywalk available is not used much. Where there are footpaths, in many places, these are damaged or occupied by vendors or the space is used to put up transformers, electric poles and even bus shelters. The roadsides are used for vehicle parking and those who cross the road find it difficult to get on to the pedestrian path.", 
    "section": "national", 
    "title": "Are the roads safe for pedestrians?", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}