{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The unusual delay over completion of a bus terminus at K.K. Nagar has disappointed the commuters.\n\nEver since K.K Nagar came into being about 30 years ago, which is one of the upscale residential localities, it does not have bus stand. Establishment of a bus terminus has been the long felt demand of the commuters and residents of the people.\n\nIn order to fulfil their demand, the Tiruchi Corporation had come out with a plan to set up a bus terminus at a cost of Rs.50 lakh. While the Corporation contributed Rs.25 lakh of it, remaining share was derived from the Members of Legislative Assembly Development Fund.\n\nProvision of eight bays, benches to accommodate 60 to 70 passengers, rooftop cover to the terminus and a sanitary complex were salient features of the project. As per the plan, the bus terminus should have been opened before the start of monsoon in 2015. However, the terminus is yet to get full shape. There were hardly any works for the last four months. After a long lull, work has resumed just recently.\n\n“We eagerly wait for the completion of bus terminus. It should have been opened for public long ago. The Corporation should give top priority for completing the project quickly,” said a passenger.\n\nWhen contacted, an official of the Corporation told The Hindu that it was delayed for a short period due to personal reasons of the contractor. The long spell of rain during the monsoon season also the project a bit. However, all remaining works have been taken up in full swing. Rooftop cover had been completed. Construction of septic tank and toilet and laying of paver blocks on the floor had been taken up. The bus terminus could accommodate five buses at a time. Laying of approach road to link the terminus with main road had been taken up. All works would be completed within 10 days. It would be opened for public use within two weeks.", 
    "section": "national", 
    "title": "Bus terminus: delay irks commuters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}