{
    "author": [], 
    "text": "Workshop\n\nThe PG and Research Department of Zoology of The American College, Madurai, organised a workshop on “Recent trends in biological sciences” on January 21 and 22, which was inaugurated by Ram Rajasekharan, Director, Central Food Technological Institute. Prof. Rajasekharan informed the participants that a majority of Indians had Vitamin D deficiency and a technology called Food-to-Food Fortification had been developed to overcome the deficiency. M. Davamani Christober, Principal, presided over the inaugural session.\n\nT.J. Pandian, former National Professor, spoke on reproduction and stem cells. VR. Muthukkaruppan, Advisor, Research, Aravind Medical Research Foundation, elaborated on how stem cells could be used in regenerative medicine. RM. Pitchappan, Director, Research, Chettinad Academy of Research and Education, explained how knowledge of immunogenetics was used in personalised medicine. K. Veluthambi of School of Biotechnology, Madurai Kamaraj University, spoke on gene targeting and transgenic plants. K. Balakrishnan, Head, Department of Immunology, MKU, explained the association of HLA alleles with certain autoimmune disorders and tuberculosis.\n\nTeachings of Vivekananda\n\nStudents recited poems and delivered talk on the life and teachings of Swami Vivekananda during the National Youth Day celebration at Madurai Sivakasi Nadars Pioneer Meenakshi Women’s College, Poovanthi, on January 12. Glowing tributes were paid to Swami Vivekananda by teachers.\n\nTamil forum\n\nKani Tamil Peravai was inaugurated at K. L. N. College of Engineering, Pottapalayam, on January 22 by K. Umaraj, Deputy Director, Tamil Virtual Academy. Dr. Umaraj explained the activities of Kani Tamil Peravai and the development of engineering through Tamil and Tamil through engineering. Durai. Manikandan of Bharathidasan University motivated the students to develop Tamil applications with a society focus. N. Lakshmi Narasimman, Head, Department of Computer Science and Engineering, welcomed. The coordinator, R. Alageswaran, explained the objectives of Kani Tamil Peravai. The presidential address was delivered by Principal A.V. Ramprasad. The contribution of students to Kani Tamil Peravai was highlighted by first year student Deepthi. G. Saranya, Assistant Professor, proposed a vote of thanks.\n\nTurbo two-wheeler\n\nSecond-year automobile engineering students of Fatima Michael College of Engineering and Technology, Madurai, have developed a new concept called “Turbo two-wheeler” to increase mileage and control air pollution with minimum modification in a two-wheeler. Second-year students S. Vignesh Kumar, P. Karthikeyan and A.G. Ramprasath demonstrated their project in the presence of P. Nelson Raja, Principal, and S. Saravana Kumar, Head, Department of Automobile Engineering, recently. The turbo two-wheeler will give an additional 20 per cent mileage and boosts the power of the engine by 25 per cent.\n\nThe cost of fitting the turbo charger works out to around\n\nRs. 2,000. The technology behind the turbo two-wheeler\n\nis that the density of air sent inside is increased in such a\n\nway to gain maximum utilisation of oxygen to increase the complete combustion within the engine with improved technology. M. Stalin Arockiaraj, chairman, St. Michael Group of Institutions, and Dr. Nelson\n\nRaja appreciated the efforts of the students.", 
    "section": "national", 
    "title": "campus connect", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}