{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Now that the Central Government has selected Coimbatore to be one of the 20 Smart Cities, the action has shifted to the civic body which is drawing plans to incorporate a company.\n\nThe Corporation secured the 13{+t}{+h}place in the list of 20 Smart Cities. The Corporation will not execute the projects. As per the Central Government guidelines, the Corporation will have to incorporate a company, special purpose vehicle (SPV), under the Companies Act, 2013 with it and the State Government having 50:50 equity shareholding.\n\nThe SPV will plan, approve, release funds, implement, monitor and also evaluate the Smart Cities project. A full-time chief executive officer will head the SPV, which will have nominees from the Central, State governments and also the Corporation.\n\nThe State Government and the Corporation should ensure that the SPV gets substantial and dedicated revenue stream so that it becomes self-sustainable, evolves its credit worthiness for raising additional resources from the market. The Central Government has, however, clearly said that its contribution should be used only to create infrastructure that has public benefit outcomes.\n\nCorporation Commissioner K. Vijayakarthikeyan says that the civic body will incorporate the company as soon as it gets necessary instruction from the State Government. The initial paid-up capital of the SPV will be a minimum of Rs. 200 crore.\n\nAs for the funding pattern, the Central Government will give Rs. 194 crore to Coimbatore and each of other selected cities and thereafter pay Rs. 98 crore for the next three years. But it will not be an automatic transfer of funds, like the JNNURM scheme.\n\nFor getting subsequent payments, the SPV will have to submit quarterly reports to the Central Government and that will include satisfactory improvement in works and effective utilisation of the money already granted.\n\nAnd, the SPV board will have to pass a resolution that the conditions have been met.", 
    "section": "national", 
    "title": "Company in corporate style to monitor Smart Cities project", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}