{
    "author": [], 
    "text": "The Madras High Court has directed the Immigration Department to consider issuing an Overseas Citizen of India (OCI) Passport to an infant in the United Kingdom without insisting on his father’s signature.\n\nThe 10-month old boy’s mother, Ambiga Elumalai, had moved the court after the Indian High Commission in London rejected her application seeking a passport for her child.\n\nThe petitioner alleged that due to harassment by her husband, the law enforcement authorities in London made her live in a place of refuge. When she applied for an OCI passport for her son, the Indian High Commission rejected the application, citing absence of signature of the child’s father. The petitioner said her husband is absconding ever since she initiated proceedings.\n\nShe has come to India with the child to attend her brother’s wedding scheduled for February 10. The petitioner through her agent and mother Kamala Elumalai asked the court to direct the Immigration Department to issue the passport to her child.\n\nWhen the petition came up for hearing before Justice M.M. Sundresh, the judge said, “Considering the peculiar and factual situation, the petition is disposed of by directing the petitioner to apply for the passport online at the earliest.”\n\nOn receipt of the same, the Ministry shall consider the process of issuance of passport under the OCI category as was given to the first child without insisting on the signature of the father.\n\nJustice Mr. Sundresh made it clear that the order is passed after taking note of the peculiar facts of the case and there is no dispute on the fact that the petitioner is the mother of the child, even as per the manual, in a given case, the Ministry can consider the processing of issuance of passport without the signature of the father.\n\nIndian High Commission in U.K. had rejected petitioner’s application", 
    "section": "national", 
    "title": "Consider issuing passport without insisting on father’s signature: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}