{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Expressing serious concern over the alleged backdoor recruitments to several organisations of Government , the Communist Party of India- Marxist (CPI-M), Puducherry unit has demanded to stop such recruitments immediately and said youth who have been waiting for long after having registered with the employment exchange should be given jobs forthwith.\n\nLevelling serious allegation against the ruling All India NR Congress(AINRC) Government, CPI-M unit secretary R. Rajangam said, “Several undertakings of the government were pushed to the verge of closure, now the Chief Minister is appointing persons through the backdoor to such organisations with an eye on polls. Over 1000 persons were appointed this way in the last one week at Amuthasurabi, Puducherry Distilleries, PONLAIT, Co-Operative Societies, KVK and Mother Theresa Research Institute.”\n\nThe CPI (M) leader said the youth, seeing this, were seething with anger. He added that apart from initiating legal struggle against the officials who were responsible for backdoor recruitments, the party along with the jobless youth would go to public sector undertakings and would conduct agitations demanding appointments.\n\n“If the law and order problem arises in view of the protests, Chief Minister and officials who indulged in backdoor recruitments should be held responsible”, said Mr. Rajangam.\n\nHigh Court ban\n\nAccording to Mr. Rajangam, in 2009, the Madras High Court passed an order banning backdoor recruitments in all departments and Co-operative institutions in the Union Territory. The then Congress regime said departmental proceedings would be initiated against the officials who were responsible for the backdoor appointments. However, at the fag end of tenure, more than 4000 persons were recruited to public sector undertakings after accepting several lakh rupees as bribes. After AINRC came to power, they were removed from the posts.\n\nHe added police indulged in lathi-charge when the jobless persons agitated against the ruling government and then Chief Minister Mr. Rangasamy said jobs would be given to them if they would leave Congress and turn supporters of AINRC. Thus, over 2000 persons were re-appointed in the Public Works Department and other departments.\n\n“Ministers and MLAs after bargaining Rs.one to two lakh, have regularised the persons who entered into service through backdoor after the order of the Madras High Court in 2009,” Mr. Rajangam charged.", 
    "section": "national", 
    "title": "CPI (M) expresses concern over ‘backdoor’ recruitments", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}