{
    "author": [
        "Special Correspondent"
    ], 
    "text": "R. Karthikeyan (fourth left), Additional Registrar of Cooperative Societies, Chennai, and R. Elangovan (centre), Chairman, Tamil Nadu State Apex Cooperative Bank, holding discussion with the cooperation department officials on the progress of special camps for the distribution of Amma micro loans to the petty traders, in Salem recently.\n\nThe cooperation department staff was directed to create awareness on the recently introduced Amma micro loans scheme for the petty traders among the trading community to enable them to take full advantage of the same.\n\nR. Elangovan, Chairman of the Tamil Nadu State Apex Cooperative Bank and R. Karthikeyan, Additional Registrar of Cooperative Societies, held discussion with the senior officials of the Salem District Central Cooperative Bank and the cooperative societies on the progress of the ongoing special camps for the implementation of this scheme.\n\nMr. Elangovan said that the government provided loan to the tune of Rs. 5,000 to the petty traders without charging any interest. The government will pay the 11 per cent interest on behalf of the beneficiaries to the cooperative societies directly.\n\nThe petty traders will have to repay the loan dues in 25 weekly instalments of Rs. 200 each.\n\nThe Chief Minister has ordered provision of additional loans to the traders who promptly repaid the loan dues, at a paltry four percent interest rate.\n\nMr. Elangovan said that it was a god spent opportunity for the petty traders, pavement traders involved in marketing flowers, fruits, vegetables etc. This initiative was to prevent the exploitation of the small time trades by the greedy money lenders.\n\nHe directed the cooperation department staff to visit the petty traders and explain the salient features of the scheme.\n\nThe department should take steps for covering as many traders as possible within in the given time.\n\nJoint Registrar of Cooperative Societies S. Srinivasan (Salem region) and G. Gandhinathan (Namakkal region), A. K. Sivamalar, Managing Director of the Salem District Central Cooperative Bank and others participated in the meeting.\n\nIn Namakkal, the District Collector V. Dakshinamoorthy gave away interest-free loans to 159 petty traders hit by the recent widespread rainfall in Tiruchengode and surrounding areas at a function held in Tiruchengode town on Saturday.\n\nThe Collector gave away loans sanctioned by the Salem District Central Cooperative Bank to the traders of Tiruchengode, Pallipalayam, Mousi towns.\n\nThe Collector said that Namakkal district has been in the forefront in the distribution of freebies such as table fans, grinders and mixers to the people and 99 per cent of the distribution work had already been completed.\n\nFinancial assistance to the tune of Rs. 450 crore has been extended to the women self-help groups in the last three years.\n\nReferring to the interest-free loan scheme, the Collector said that so far 1,700 applications have been received from the petty traders for assistance and loans to the tune of Rs. 38.45 lakh had been disbursed to 769 petty traders.\n\nG. Gandhinathan, Joint Registrar of Cooperative Societies, Ravikumr, Chief Revenue Officer, Salem District Central Cooperative Bank and other officials spoke.", 
    "section": "national", 
    "title": "‘Create awareness on Amma micro loans scheme’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}