{
    "author": [
        "Special Correspondent"
    ], 
    "text": "ECI’s initiatives have not touched the fringe of main menace: Ramadoss\n\nFormer Member of Parliament and AIADMK functionary M. Ramadass has appealed to the officials of Election Department to take strong initiatives to prevent the abuse of money power during elections.\n\nIn a letter to Chief Electoral officer V. Candavelou, Dr. Ramadass said the system should be purged of money power and the electoral system should open the doors to honest, capable, competent, public spirited men and women to enter the government and obtain maximum social advantage with minimum cost to the Territory.\n\nHe added that the initiatives of the Election Commission of India (ECI) have not touched even the fringe of the main menace challenging the electoral process, namely, abuse of money power and the liberal bribing of voters which sets at naught all your noble ingenuities besides making the election process defunct and meaningless.\n\n“Offering money to induce the voters to vote in favour of a candidate by the political parties and the voters accepting it had become a way of life in Puducherry and every body including officials and law and order machinery were aware of the mechanism of this process. But nobody dares to intervene in this unholy exercise. Consequently the electoral process becomes pro rich and pro political businessmen,” said Dr. Ramadass.\n\nAsking the officers to examine the ways and means of checking the malpractice of money power, he said a meeting of cross section of the government servants including police and revenue officials from Karnam to the Deputy Collector and seeking their views on this issue would be fruitful and rewarding. A blue print based on the suggestions emerging from this meeting may be prepared and implemented.\n\nThe former MP also urged that the Youth Meets in future should be conducted for rural youth too in which the young voters should be persuaded to vote unfailingly and without taking money from political parties.\n\nDr. Ramadass asked the Election Department to organise six to ten orientation programmes in all the four regions to the electoral officers and police officials down to the constables to ingrain in their minds the message that they are an integral part of the constitutionally elected government and not sympathisers of the political parties.\n\nHe added that they should be motivated to discharge their duties during elections in accordance with law.\n\nFormer MP calls for sustained campaign and consultations to root out the problem", 
    "section": "national", 
    "title": "EC asked to prevent abuse of money in elections", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}