{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "Manpower shortage, lack of facilities and recognition leave them demoralised\n\nForest rangers play a vital role in the forest administration and are considered the backbone of wildlife protection.\n\nEach one of them heads a unit of forest administration and executes almost all work in their respective ranges. Here again, 40 per cent of vacancies for the post of rangers are vacant.\n\n“In some districts, the rangers are given additional charge of up to four more ranges. They may not be willing, but are compelled to take up additional jurisdiction and so are stressed out,” says an insider.\n\nIn western districts, the rangers, besides administrative work, have to handle the heightened man-animal conflict situation as well. “From the protection point of view, it is not at all good,” says an official.\n\n“Many of the rangers now are at the fag end of their career. Three or four rangers retire this month,” says a forest official.\n\nAt present, 72 rangers are undergoing training, but the vacancies would be over 30 per cent even if the newly recruited take charge, says the official.\n\nWhat makes things worse is that the rangers have to do the work of foresters – their deputies – in many ranges. “An examination was conducted a year ago for the recruitment of foresters. The results are yet to be published,” says officer in the forest department headquarters here.\n\nWhile the world is going virtual, many of the rangers do not even have net connections or assisted by computer operators. They have to write all the reports by themselves, say activists. To top it all, the rangers have no authority to take decisions on spending even a single rupee. All estimates have to be sanctioned by the district forest officer (DFO), claim activists.\n\nThe DFOs have their own woes. Generally an IFS officer, the DFO is responsible for all that happens in a particular division.\n\nLacking in quantity and quality of manpower, the DFOs suffer on a daily basis. They are also short of ministerial staff and have to work with those promoted from ranks like office assistant and night watchmen. “It can be sapping,” says a DFO.\n\nInvolved in mundane works for most of the time, the DFOs hardly get time to do their real job – of venturing into the forests to plan and execute work required for wildlife management, activists say. They also don’t have secret service funds, an activist adds.\n\nFor the forest officer in charge of the district and entrusted with the task of protection and conservation, the government sanctions 125 litres of fuel per month. “Is it not a joke,” asks a DFO in one of the western districts.\n\nAs the system of assistant conservator of forests exists only in some divisions, the DFOs are overloaded with work. ACFs can take care of 60 to 70 per cent of the DFOs work freeing them to focus on forest management and conservation, activists point out.\n\nIn contrast, the morale of DFOs in the neighbouring States is quite high as they are treated with respect and are given promotions promptly. On January 1 every year when IFS officers at various levels are due for promotion, the GO is issued one day before in neighbouring States, says an officer.\n\nIn Tamil Nadu, promotions are delayed at all levels, officers claim. The files have to be signed at the highest level in the government’s hierarchy. Even if there is delay at one level, the promotions are delayed, they add.\n\nThe DFOs are also affected. While their counterparts in other States have become conservators, some of their promotions are being delayed for over one year now, sources say.\n\n“We are answerable to people, politicians and district administration. At times, there is a fight on a daily basis as we deny entry to forest areas. Timely promotion, due recognition and providing adequate infrastructure could help us do our job better,” says an IFS officer of Tamil Nadu cadre.\n\n(This is the concluding part of the series)", 
    "section": "national", 
    "title": "Forest staff combating a range of problems", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}