{
    "author": [
        "Dennis S"
    ], 
    "text": "A passenger who was denied half-fare tickets for his children two years ago on board a State-run bus and was issued full-fare tickets, has been granted a compensation of Rs. 10,000 by the District Consumer Disputes Redressal Forum in Dindigul.\n\nAntony Joseph Selvan of Madathukulam in Tirupur district was travelling with his family, including his two children – a six-and-half-year old son and four-and-a-half-year old daughter from Madurai to Palani on January 1, 2014. Though he asked for half-fare tickets for his children, the conductor issued them full-fare tickets as he was reportedly advised to issue only full-fare tickets since it was festival season, Mr. Selvan claimed in his application.\n\nAlleging that this amounted to deficiency in the service offered, he claimed compensation for the mental agony he had undergone. He produced the tickets and documents to prove their age and that they were his children. The respondent transport corporation stated there was no such advice to the conductor and he had only issued full-fare tickets, as asked for by the applicant.\n\nAfter examining the documents produced by both sides, the forum comprising its president A. Ayyappan, members V. Meenambigai and M.H. Sheik Abdul Khader held that there was deficiency in the service offered.\n\n“While issuing tickets, any conductor is supposed to check whether the passenger is an adult and in this case too, the conductor should have checked but he has not checked. And his statement that four persons were seen seated in two seats only proves he has not checked whether they were children or adults,” the forum said.\n\nHolding that there was a case of deficiency in service offered to the customer, the forum directed the transport corporation to pay a compensation of Rs. 10,000 to the passenger for the mental agony he underwent, the repayment of the excess fare collected and Rs. 2,000 as litigation costs.\n\nHe was denied half fare tickets to children", 
    "section": "national", 
    "title": "Forum awards compensation to bus passenger", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}