{
    "author": [
        "Special Correspondent"
    ], 
    "text": "All India Congress Committee (AICC) general secretary and former Union Minister of State V. Narayanasamy on Sunday alleged that there has been large-scale diversion of funds under the ruling All India NR Congress Government to distribute freebies and to render rain-relief assistance.\n\nIn a statement, Mr. Narayanasamy alleged, “AINRC Government has been tom-toming about distribution of freebies such as mixers and grinders and claims to have completed the distribution of rain-relief assistance to people. That was not done after properly allocating sufficient funds through the budget proposals. Rather, taking away funds meant for the welfare of government employees, Adi- Dravidar community, construction workers, these programmes have been implemented. People have realised that it was not a big achievement of AINRC Government.”\n\nAllegations\n\nListing several allegations against the ruling government, the Congress leader alleged that the functions of all government departments have been crippled since the government has been diverting the funds of government employees, power corporation, distillery unit and Tirunallar temple and fraying several crore of rupees.\n\nStating that the electricity tariff has been hiked several times, he said the electricity department has been functioning without any remark during the Congress regime. He also accused the Chief Minister and concerned minister for being responsible for the current state of affairs in the department.\n\nPWD dept. criticised\n\nCriticising Public Works Department for not undertaking road works, Mr. Narayanasamy said the public were severely affected due to poor roads and traffic snarls and charged that the Chief Minister Mr. Rangasamy who also holds the portfolio of PWD did not bother to redress the hardships of public.\n\nMr. Narayansamy said free mixers and grinders were not distributed to the people who live in the constituencies held by Opposition political parties.\n\nHe also added that the government has ignored all constituencies of Karaikal.", 
    "section": "national", 
    "title": "‘Funds have been diverted on a large-scale for freebie distribution’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}