{
    "author": [
        "Special Correspondent"
    ], 
    "text": "GRAND EVENT:Alagappa University Vice-Chancellor S. Subbiah giving degree certificate to a graduate at the third graduation day of Syed Ammal Arts and Science College at Pullangudi near Ramanathapuram on Sunday.— Photo: L. Balachandar\n\nS. Subbiah, Vice-Chancellor, Alagappa University, has said that there are lots of employment opportunities, and exhorted graduates to equip themselves well to grab the opportunities to scale great heights.\n\n“When you introduce yourself as a graduate, you should feel that you deserve to be a graduate,” he said while addressing the third convocation ceremony at Syed Ammal Arts and Science College at Pullangudi near here on Sunday. A mere graduation might not suffice unless the graduates developed communication skills and the ability to showcase their knowledge, he said, adding the graduates should be experts in their chosen subjects. “There are so many vacancies and you should present yourself with an authority,” Prof. Subbiah said.\n\nApart from being knowledgeable, the graduates should also be physically and mentally strong, emotionally stable and socially adjustable, the VC said, adding they should not feel inferior for being a graduate from rural background.\n\nThose from rural areas had a tough mind and the ability to achieve, he said, and cited the success stories of great leaders such as former President A.P.J. Abdul Kalam. He too came from a village and went on to become Vice-Chancellor of a university, Prof. Subbiah said.\n\nHe said that the graduates, after reaching high positions in life, should not fail to respect their teachers and parents. “Love your parents and don’t let them knock at the doors of old-age homes,” he stressed.\n\nHe said that 38 per cent of the doctors in the US, 36 per cent of scientists in NASA and 34 per cent of engineers in Microsoft were Indians.\n\nThe function was attended among others by M. Salihu, former Vice-Chencellor of Madurai Kamaraj University, and A. Chelladurai Abdullah, college correspondent.\n\nIn all 360 students received degrees. Ten students in the disciplines of BBA, B.Com, B.Sc (Maths), BA English, B.Sc (IT) and BCA secured university ranks.", 
    "section": "national", 
    "title": "“Graduates should grab opportunities”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}