{
    "author": [], 
    "text": "(Clockwise from top left) G.Bhaskaran, Vice-Chancellor, Tamil University, Thanjavur, giving away degree certificate to a student at Holy Cross College in Tiruchi. Photo: A. MURALITHARAN; supplement to blood donors directory being released in National College in Tiruchi; V. Mahadevan, Director, Department of Physical Education, University of Madras, giving away certificate to a participant at the valediction of a national seminar at Urumu Dhanalakshmi College in Tiruchi; A. Kaliyamurthy, former Superintendent of Police, addressing students of Seethalakshmi Ramaswami College; Graduation Day at Nehru Memorial College in Tiruchi.\n\n(Clockwise from top left) G.Bhaskaran, Vice-Chancellor, Tamil University, Thanjavur, giving away degree certificate to a student at Holy Cross College in Tiruchi. Photo: A. MURALITHARAN; supplement to blood donors directory being released in National College in Tiruchi; V. Mahadevan, Director, Department of Physical Education, University of Madras, giving away certificate to a participant at the valediction of a national seminar at Urumu Dhanalakshmi College in Tiruchi; A. Kaliyamurthy, former Superintendent of Police, addressing students of Seethalakshmi Ramaswami College; Graduation Day at Nehru Memorial College in Tiruchi.\n\n“If we educate women, the whole nation will be educated because education gives knowledge and power. Even during the ancient days when education was denied to women, Tamil literature and epics insisted on women’s education as a mark of social development,” G. Bhaskaran, Vice-Chancellor, Tamil University, Thanjavur, said in his Graduation Day address at Holy Cross College. He advised the young graduates to involve themselves in social development. About 1,520 candidates received their degrees. The college toppers from various disciplines bagged 15 university ranks in UG and 12 university ranks in PG programmes.\n\n793 receive degrees\n\nYoungsters must work hard to become multi-skilled individuals and should be ready to face challenges.\n\nGraduates should try to become entrepreneurs, said S. Thiruchelvam, Registrar, Bharathidasan University, delivering the Graduation Day address at Nehru Memorial College. Seven hundred and ninety three candidates, including 15 university rank holders, received their degrees. M. Ponnambalam, chairman, Pon. Balasubramanian, president, Pon. Ravichandran, secretary, S. Kumararaman, Principal (in-charge), were present.\n\nRole of yoga and technology\n\nOver 100 papers were presented during a seminar on ‘Role of yoga and technology in enhancing sports performance and populace health,’ organised by Department of Physical Education, Urumu Dhanalakshmi College. K. Chandrasekaran, Head, Department of Physical Education, Madurai Kamaraj University, inaugurated the seminar. G.N. Srinivasan, secretary of the college, released the seminar proceedings. V. Mahadevan, Director, Department of Physical Education, University of Madras, gave away certificates to the participants at the valediction in the presence of Mothi. P. Krubasankar, management committee member, S. Sekar, Principal, and N.S. Sivakumar, Director of Physical Education.\n\nMuthamizh Vizha\n\n“Goal-oriented living reinforced by education fetches what one aspires for and makes even the mediocre great,” said A. Kaliyamurthy, former Superintendent of Police, addressing students of Seethalakshmi Ramaswami College at the inaugural of the Muthamizh Vizha celebrations.\n\nHe told the students to learn as many languages as possible for earning a livelihood but breathe and live their mother tongue Tamil. He pointed out that dream, ambition, and determination help a person to climb to the top most rung of the ladder of success. He stated that teachers should update themselves with continuous learning. Jayanthi, Principal, was present.\n\n“Donate blood”\n\nNCC (Air wing) of National College, Tiruchi, released a supplement to Blood Donors Directory containing names, addresses, telephone numbers and blood groups of 600 donors. M. Jothimani Ilangovan, Assistant Director (Programme), All India Radio, Tiruchi, released the supplement that was received by K. Anbarasu, Principal. She emphasized the importance of blood donation. R. Sundhararaman, Controller of Examinations, spoke. Students who had donated blood twice during the academic year were presented mementos.\n\nF aculty development programme\n\nRoever Engineering College, Perambalur, and ICT Academy of Tamil Nadu jointly organised a faculty development programme on ‘Teaching techniques.’ K. Nirmal Kumar, trainer, ICTACT, was the resource person. K. Varadharaajen, founder and chairman, Roever Group of Institutions, inaugurated the programme. A. Allirani, Principal, was present. The programme attracted participants from various institutions.\n\nCompiled by G. Prasad", 
    "section": "national", 
    "title": "Graduation Day at Holy Cross College", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}