{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Walk through heritage structures in the city and some snack en route formed a part of the events on the third day of Coimbatore Vizha on Sunday. A release says that around 30 participants walked the old part of the town covering the Tamil Nadu Mercantile Bank building, Koniamman Temple, Victoria Town Hall, Vysial Street, Thermutti, Raja Street and Oppanakara Street.\n\nOn the way, the participants tasted some snacks as well.\n\nIn R.S. Puram, the residents gathered for some cleaning activity on D.B. Road and T.V. Samy Road. The day also saw more than 100 registrations for the Casa Grande Golfers Classic – golf tournament.\n\nThere was a competition to photograph as many birds on Sunday. The release says that nature enthusiasts and nature lovers in the city gathered at a meeting point and from there went on a photo clicking spree. The competition was to capture as many birds as possible on the camera. The objective of the event was to bring about awareness among people on nature and bird conservation.\n\nSalim Ali Centre for Ornithology and Natural History, which was part of the bird race, said that in the sixth edition of the bird race 35 teams of four participants each participated in the dawn-to-dusk event sighting as many birds as possible. By noon, most teams had said that they had sighted more than 100 species. There was also an adopt-a-thon 2016, where the Vizha organisers encouraged the city’s residents to adopt puppies and kittens that are Indian breeds. The idea behind the event was ‘adopt; don’t shop’. The women gathered at the SNR College to participate in a cookery contest, ‘Kitchen Masters – Kongu Delicacies’. The women prepared traditional delicacies.\n\nAround 20 women took part in the event. Brookefields mall saw youngsters and dance enthusiasts participate in ‘Kummi aattam’, ‘Bharatanatyam’ and international dances.\n\nThere were also the Kirtilal Heritage Exhibition, Coimbatore Through Ages and Ravi Varma Art collections and Incredible Coimbatoreans.", 
    "section": "national", 
    "title": "Heritage and food walk on third day of Coimbatore Vizha", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}