{
    "author": [
        "B Kolappan"
    ], 
    "text": "40 years ago he and other DMK men were detained under the draconian Act\n\nThe Emergency also saw the emergence of M. Karunanidhi as a political leader at the national level and he ensured that the party did not disintegrate.— File Photo\n\nFor DMK leaders Sunday marked the 40th anniversary of the dismissal of the Karunanidhi government when the country was reeling under the impact of the Emergency declared by the Indira Gandhi government. And Monday would mark the 40th year of the first set of detentions of prominent DMK functionaries under the draconian Maintenance of Internal Securities Act (MISA) that was in force then. Among those detained was a young M.K. Stalin, who at that time was an ordinary party member.\n\n“I was in Maduranthakam performing a play on behalf of the youth wing of the DMK when the police came looking for me in Chennai. My father told them that I was out of town and promised to hand over me once I reached Chennai. I was arrested on February 1 after my father called the City Police Commissioner to inform about my arrival,” recalled Stalin. As the cadre across the State was not fully aware of the arrests of party leaders and the DMK mouthpiece ‘Murasoli’ was censored from publishing anything political, Mr. Karunanidhi merely published a list of names of leaders, announcing that they would not be in a position to pay tribute to party founder C.N. Annadurai on his death anniversary (February 3). The party men got the message.\n\n“Prison life taught me a great political lesson, though I had to pay a heavy price. I was beaten mercilessly and former Mayor Chittibabu, who formed a shield to protect me, later succumbed to the injuries. I have a scar on my right hand and it has become one of the permanent body marks for identification,” Mr. Stalin, who was catapulted to the centre stage of the DMK, said.\n\nDravidian scholar K. Thirunavukkarasu recalled that the Emergency and subsequent dismissal of the government created a situation in which the DMK was forced to function like an underground organisation. “But it also helped the party identify who would stand by the party in the face of oppression,” said the veteran, who used to print pamphlets, which would then be smuggled into the prisons to keep the party men abreast of developments outside as newspapers were censored.\n\nNational stature\n\nThe Emergency also saw the emergence of Mr. Karunanidhi as a political leader at the national level. He ensured the party did not disintegrate.\n\n“There was a suggestion that he should step down as the leader of the party to pave way for its control under a committee of leaders. Many leaders, including V.R. Nedunchezhian, mooted the idea of changing the name of the party to escape further onslaught. Mr. Karunanidhi rejected them and single-handedly managed the crisis,” said Mr. Thirunavukkarasu.\n\nHe used to function from Anbagam, now the headquarters of the party’s youth wing, meeting leaders and cadres and coordinating with national leaders who had gone underground.\n\n‘It helped the party identify who\n\nwill stand by it in the face of opression’", 
    "section": "national", 
    "title": "MISA detention taught me a tough lesson, says Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}