{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Various crops have been raised in about 2.07 lakh hectares in the district during the current farm season till December 31 last year.\n\nThe district managed to achieve production of food products to the tune of 5.71 lakh tonnes by December end against the target of 6.54 lakh tonnes.\n\nUnder the ‘Kar’ paddy season, 585 hectares have been covered, against a target of 4,500 hectares. Samba has been raised in 17,566 hectares against a target of 22,500 hectares and the district managed production of 86,636 tonnes of samba paddy.\n\nMillets have been raised on 81,358 hectares – Cholam 38,543 hectares, kambu 1,632 hectares, raghi 6,694 hectares, makka cholam 32,424 hectares and other millets 2,065 hectares and 4.32 lakh tonnes of millets have been produced. About 64,466 hectares have been brought under pulses cultivation and 50,283 tonnes of production has been achieved.\n\nA total of 25,204 hectares have been brought under oilseeds – groundnut 21,633 hectares, sesame seeds 2,596 hectares, castor 837 hectares, soya beans 116 hectares and sunflower 22 hectares.\n\nThe other major field crops such as cotton at present stood on 12,276 hectares and sugarcane on 6,070 hectares.\n\nC. Rajendran, Joint Director of Agriculture in-charge, speaking at the farmers’ grievances day meeting here recently said that the farm activities covered 2.10 lakh hectares during the same season last year.\n\nThe State Government has fixed a food production target of 6.54 lakh metric tonnes for the current year (2015-16). During the year 2014-15, the district achieved food production of 6.384 tonnes against a target of 6.840 tonnes.\n\nThe agriculture department has already distributed 403.9 tonnes of quality paddy seeds, 33.4 tonnes of millet seeds, 232 tonnes of pulses, 91.2 tonnes of oil seeds and 1.7 tonnes of cotton seeds to farmers.\n\nFertilizers\n\nThe district was having adequate stock of fertilizers. The department distributed 31,250 tonnes of urea, 12,325 tonnes of TAP, 14,310 tonnes of potash and 25,375 tonnes of mixed fertilizers. The department was having a stock of 24,150 tonnes of fertilizers for distribution to the farmers at any time.", 
    "section": "national", 
    "title": "More than 2 lakh hectares brought under cultivation in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}