{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Smart Cities mission triggers interest in old proposals and partially-executed projects\n\nThe civic body has set a target of increasing the mode share for pedestrians and cyclists to 40 per cent by 2018.— File photo\n\nEfforts to promote non-motorised transport across the city have been hitting roadblocks, and many proposals have been abandoned even before they crystallised into concrete ideas.\n\nHowever, now with the Smart Cities mission under way, there is fresh hope for non-motorised transport in the city. Old proposals and partially-executed projects may now gain steam. In 2014, the Corporation council approved a non-motorised transport (NMT) policy to promote walking, cycling and other forms of mobility powered by humans.\n\nThe civic body set a target of increasing the mode share for pedestrians and cyclists to at least 40 per cent by 2018. It also planned to implement policy decisions aimed at reducing fatalities involving pedestrians and cyclists to zero. However, these infrastructure works were delayed in many parts of the city.\n\nBut this year, the proposal for commissioning NMT facilities, estimated at Rs.175.66 crore, is expected to take off. The proposals include pedestrian streets at an estimated cost of Rs. 9.9 crore, traffic-calming streets at Rs.7.43 crore, multi-level car parking with ICT application at Rs.120 crore and solar chargers for e-rickshaws at Rs. 6.2 crore.\n\nAll the 471 bus routes would have non-motorised transport at an estimated cost of Rs. 3 crore per km, offering last mile connectivity to Metro Rail, MRTS and suburban stations.\n\nThe public transport mode share is expected to be 60 per cent of motorised trips by 2018. While at least 80 per cent of the streets would have footpaths in five years, at least 80 per cent of those with a right-of-way of over 30 metres would have an unobstructed, segregated, continuous cycle track of two-metre width.\n\nIn 2014, Chennai Corporation council approved a non-motorised transport policy", 
    "section": "national", 
    "title": "Non-motorised transport to gain fresh momentum in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}