{
    "author": [], 
    "text": "Some of the commissions set up by the present government are yet to submit their reports\n\nWith Assembly elections round the corner, whispers are being heard in official circles on the fate of some of the Commissions of Inquiry. In 2011, the Government had constituted a Commission to probe the construction of the new Secretariat Complex (since converted into a multispecialty hospital). It is yet to submit its report and was recently given a three-month extension. Similarly, a commission of inquiry set up in 2013 to probe into the death of Dalit youth Ilavarasan in Dharmapuri is also yet to submit its report.\n\nThe Government has granted the commission a six-month extension.\n\n“Every extension means additional expenditure of public money with no meaningful outcome,” an official quipped.\n\nAt a public meeting recently, DMK leader M K Stalin took a dig at the ‘Amma Call Centre’ launched by the Chief Minister and alleged that calls to the number ‘1100’ never got connected. In contrast, he said, he had an exclusive mobile helpline number to address the grievances of residents of his Kolathur constituency. “If the residents dialled this number, within the next 30 seconds, they would get an SMS giving them a complaint docket number. Within a few hours my team members would physically reach out to the residents,” he said. To demonstrate, he dialled the number and held the phone close to the microphone. And the audience heard,\n\n“This number can’t be reached at the moment.” Mr Stalin could only squirm.\n\nA section of DMK senior leaders went into a tizzy following rumours that expelled Madurai strongman M K Alagiri could meet his estranged father and party president M Karunanidhi on his birthday on January 30 and patch up with him. There were unconfirmed reports that Karunanidhi was not averse to a reunion with his elder son. Many senior leaders heaved a sigh of relief when the meeting did not take place as they were apprehensive a reunion in the family could jeopardise their political careers as some of them have switched loyalties to Karunanidhi’s younger son M K Stalin.\n\nFor a long time, IAS officer U Sagayam was silent as a group of youngsters launched a campaign projecting him as the chief ministerial candidate. But finally spoke up.\n\nIn a video message on Republic Day, Sagayam told the youngsters that positive change can be brought about in society without the youngsters directly getting involved in politics. He has also exhorted them to work on many social causes, including fighting for clean elections, particularly educating people about the ill-effects of taking money for votes. “I will be with you in all these endeavours,” he said.\n\nDMK president M. Karunanidhi’s visit to his constituency Tiruvarur, which is also his native, set off speculation if he would use the occasion to launch the party’s campaign. His visit to his mother’s memorial heightened the expectations of the cadre so much so that at a meeting many passionately said this was the right forum to kick start the campaign.\n\nBut Mr. Karunanidhi did not give in that easily and continued to play his political card close to his chest as the DMK was yet to firm up electoral alliances.\n\nAt least four State Ministers, half-a-dozen MLAs and a MP had to postpone the weddings of their offspring due to the rains in December. Now these couples will tie the knot at a mass wedding to be blessed by Chief Minister Jayalalithaa in Chennai on February 10. Daughters of Housing Minister R. Vaithilingam, HR&CE Minister R. Kamaraj, Tourism Minister S.P. Shanmuganathan and Information and Publicity Minister Mukkur Subramanian will enter into wedlock on that day.\n\n(Contributions by Dennis S Jesudasan, B Kolappan, T K Rohit, L Renganathan and Deepa H Ramakrishnan)", 
    "section": "national", 
    "title": "On extension mode", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}