{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Raising various issues, the NET/SLET Association has demanded the postponement of Tamil Nadu State Eligibility Test (TNSET-2016) being organised by Mother Teresa Women’s University (MTWU), the nodal agency designated by University Grants Commission (UGC) for conducting the exam.\n\nSoon after the notification for TNSET-2016 came out on January 20, the association raised its concerns including short notice, overlapping of the examination date (February 21) with Central Teacher Eligibility Test (CTET) announced two months before and non-inclusion of subjects like Library Sciences and Public Administration.\n\nAddressing the media here on Sunday, the association alleged that all the work for the exam was being carried out in Anna University and not in MTWU.\n\n“Preparations including setting up and storing of question papers should be done only at the nodal university with adequate security mechanisms in place. If everything is being done at Anna University, why have MTWU as nodal agency,” asked A.R. Nagarajan, general secretary of the association.\n\nThe association also pointed out that there was no mention in the notification about providing duplicate copy of answer sheets to participants during the exam. In the UGC National Eligibility Test (NET) conducted in December 2015, participants could take away carbon copies of Optical Mark Reader (OMR) answer sheets.\n\nThey can use these duplicate copies to cross-check and challenge if needed when captured images of their OMR answer sheets also with answer keys are later uploaded in website.\n\n“Like NET, TNSET-2016 notification mentions that answer sheets will be uploaded in website for verification and challenge by participants. But without duplicate copies, how will they check and contest if there were discrepancies between the answers marked and the answers read by OMR,” questioned R. Thanga Muniyandi, the association president.", 
    "section": "national", 
    "title": "‘Postpone SET 2016 exams’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}