{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Adoption of a child, by a couple or a single parent, involves certain criteria that the couple and the child should meet. It is to ensure the safety of the child and the interests of the parents.\n\nIn August 2015, the Central Adoption Resource Authority (CARA) introduced Guidelines Governing Adoption of Children, 2015, in which the upper limit for the combined age of the couple was increased from 90 years to 110 years.\n\nThis was to encourage adoption and rehabilitate more underprivileged children.\n\nBut, the age of a child that the couple can adopt differs. It depends on the age of the couple. Those interested should register online atcara.nic.inand provide 13 details, and documents.\n\nStaff from District Child Protection Unit (DCPU), and the agency from where a child is to be given for adoption will visit the house of the applicant, inquire with neighbours and relatives before approving the online registration.\n\nThe applicant need not have a house on her own, but should be financially stable to take care of the child. Most important is that the applicant should not have been booked by the police for any cognisable offence.\n\n“For the child, an advertisement should be made in a national newspaper with picture and basic details of the baby, so that parents could trace him or her if they were taken away from them,” said P. Samson, chairman of the Child Welfare Committee (CWC). In the case of a baby surrendered by parents, they are given counselling, and a deadline to take back the child, before CWC declares the child legally free for adoption.\n\nOn completing these formalities, based on seniority of the applicant, babies are matched. “Matching is based on the colour and facial features of the baby and adopting parents to make them look somewhat similar, ” said Ms. Vijaya.\n\nLast year a couple from Chennai found a matching baby in Coimbatore.\n\nThe child is given under the care of the new parents for 12 months, during which officials from the DCPU and or the adoption agency visit the child every month. “On satisfaction over the care given to the child, she is legally allowed to be adopted by the couple as their own child,” she added.", 
    "section": "national", 
    "title": "Procedure for adoption", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}