{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Commission safety audit at Kudankulam\n\nKudankulam plant is back to power producing mode after a gap of few months. Coinciding with this is the comment of former AERB chairman that the plant is not safe without proper quality checks.\n\nIt is high time that authorities commission a complete safety audit by global experts and take appropriate action wherever needed.\n\nIndia certainly would not like to have a catastrophe in nuclear plants with the incidents reported in Russia and Japan fresh in our minds. The audit report will drive improvements in existing plants further and also offer valuable inputs for future nuclear projects.\n\nS. Ramamurthi\n\nEllapillaichavadi, Puducherry.\n\nAllot cattle sheds in remote areas\n\nThe Government should allot cattle sheds in remote areas to create interest and confidence among rural youth in dairying and in turn help to increase milk production.\n\nThe Government already provides milch animals at subsidised rate to the cattle farmers and it is high time that it allocated sheds at nominal rates to achieve self-sufficiency in milk product.\n\nV. Ramalingam\n\nThattanchavady, Puducherry.\n\nCancel outsourcing of reservation of tickets\n\nRecently I had a bitter experience while reserving a ticket for my travel to Madurai through State Express Transport Corporation (SETC). The current practice is to collect application forms and money for the tickets from passengers who arrive for advance reservation and finally inform them that the server is at fault.\n\nThe passengers are requested to arrive an hour before the commencement of the actual journey to collect the printed tickets. The passengers are unaware of the seat number and are at the mercy of the staff since the reservation has been outsourced to a third party. I appeal to SETC to rectify the situation and to cancel the outsourcing of reservation of tickets.\n\nS.S. Ramchander\n\nVivekananda Nagar, Puducherry.\n\nReaders can send their mails topondy.thehindu@\n\ngmail.comand The Hindu, No.135 Mission Street, I Floor, Puducherry – 605 001.", 
    "section": "national", 
    "title": "Readers mail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}