{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Coimbatore Corporation's plan to install a skywalk for commuters and pedestrians near the Singanallur bus stand is likely to get delayed.— Photo: S. Siva Saravanan\n\nCommuters using the Singanallur Bus Stand will have to wait longer to safely cross the Kamarajar Road as Coimbatore Corporation’s plans to provide a skywalk will be delayed.\n\nA resolution passed at the Council meeting on January 29 said that the Corporation could take up the skywalk project after the Highways Department completed road widening work.\n\nThe Corporation had first proposed to provide a skywalk across the road in July 2013. The Council passed a resolution on July 26, 2013 and the civic body awarded tender on November 14 that year to the private company, Universys.\n\nThe company was supposed to get the Highways Department’s no-objection certificate so that the skywalk did not reduce the road space but it did not. The Corporation tried to reach the company several times but could not. In April 2015, the company wrote to the Corporation saying that it could not get the Department’s NOC as the deadline for completing the project had expired.\n\nThe company had also wanted the Corporation to revise the rates to factor in the increase in cost of prices between 2013 and 2015.\n\nBut the tender conditions did not allow upward price revision and therefore it had to cancel the tender, the Corporation said.\n\nMeanwhile, the Highways Department wrote to it saying that it could delay issuing the NOC as there was a move to four-lane the road. In these circumstances the Corporation said it had no choice but to abandon the project.\n\nBut Councillors S.M. Samy and a few others, who represent areas in and around Singanllur, asked the Corporation to defer and not abandon the project, the Council passed a resolution saying that it could take up the skywalk construction after the Highways Department widened the Kamarajar Road.\n\nMr. Samy said that the project could take a few more years and until then there was no choice but to wait.", 
    "section": "national", 
    "title": "Singanallur skywalk to be delayed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}