{
    "author": [
        "K Lakshmi"
    ], 
    "text": "13-km long stretch between Okkiam Thoraipakkam and Muttukadu carries sewage\n\nSome stretches of South Buckingham canal continue to remain polluted as lorries dump sewage along the banks in areas such as Akkarai and Uthandi —Photo: M. Karunakaran\n\nThe South Buckingham canal is fast turning into nothing more than a carrier of sewage between Sholinganallur and Muttukadu.\n\nThe 13-km long stretch of the South Buckingham canal between Okkiam Thoraipakkam and Muttukadu was improved and widened to 100 metres under the Jawaharlal Nehru National Urban Renewal Mission two years ago. South Buckingham canal runs for a distance of 105 km between Kotturpuram and Marakkanam and it is the urbanised stretches that suffer the most.\n\nThough the Water Resources Department has installed boards in several locations warning against dumping of garbage and sewage into the canal, lorries lining up to dump sewage in the canal is a common sight in Uthandi, Akkarai, Muttukadu and Kanathur.\n\nMany people who settled along East Coast Road and Rajiv Gandhi Salai for the enchanting view of the South Buckingham canal that runs between the arterial roads are now witness to its degradation. Leena of Muttukadu said: “The canal carried flood water to its brim during the recent floods. But, it has again got polluted with sewage and turned murky in colour.”\n\nResidents note that the problem of dumping sewage and garbage is common between the stretch of Kottivakkam and Thoraipakkam as many fast-developing areas lack underground drainage projects. With several apartment complexes coming up along the canal, many panchayats discharge sewage into it. Satish Galley of Semmencheri, said many lorries dump sewage in the waterway along Kelambakkam-Kovalam Road. The canal has also shrunk in many stretches. Such problems can be arrested only when the areas have better underground drainage facilities and dedicated garbage dumping yards.\n\nMeanwhile, the WRD has written to panchayats along ECR such as Kanathur, Kovalam and Muttukadu asking them to take action against those polluting the canal. “We have built retaining walls along the canal in 10 locations between Sholinganallur and Muttukadu blocking entry into the banks. We have also put up boards warning against such illegal practice. But, such misuse of the canal continues in some places as several sewage lorries are not prepared to travel to Perungudi sewage treatment plant. We plan to intensify checks and levy fine on such vehicles that either dump waste or sewage,” said an official.", 
    "section": "national", 
    "title": "South Buckingham canal polluted", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}