{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The voters’ list revision camp was held in Krishnagiri on Sunday. —Photo: N. Bashkaran\n\nThe special camps for the revision of voters’ list, held in polling booths in all the eleven Assembly constituencies in the district, evoked good response.\n\nThe revised poll rolls were also put on display in the booths.\n\nRepresentatives of political parties and people visited them and verified their names. Youngsters who had crossed 18 years of age submitted applications for enrolling their names afresh. Applications were also submitted for deletion and correction of names in the voters’ list. District Collector V. Sampath paid a surprise visit to the polling booth in CSI Polytechnic College at Hasthampatti and inspected the works. He made enquiries with the staff about the availability of adequate application forms etc.\n\nPoll rolls revision works took place in 130 polling booths in Salem North and Salem South Assembly constituencies in the Salem city limits.\n\nK. R. Selvaraj, Corporation Commissioner, visited various polling stations including Pavadi Girls Higher Secondary School, Ammapettai Boys HSS, Kamaraj Colony Primary School, Kumaragiripettai Primary School, Fort Boys HSS, Sahadevapuram HSS and made enquiries with the officials.\n\nNamakkal\n\nSpecial camps were held in all the 1,569 polling booths spread over six Assembly constituencies in the district on Sunday.\n\nErode\n\nSpecial camps were held in 2,114 booths in 869 polling centres for inclusion and deletion of voters’ names in the final list, name correction, and address change in the district. The next camp is slated for February 6.\n\nDistrict Collector S. Prabakar inspected the polling booth at Girls’ Higher Secondary School. He was accompanied by Corporation Commissioner Elango, Erode Tahsildar Mohana and other senior officials.\n\nThe polling booths were manned by employees of Corporation, Panchayat, and Revenue Departments.", 
    "section": "national", 
    "title": "Special camps to revise voters’ list held", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}