{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In continuation of their protests, members of the Joint Action Committee of Teachers’ Organisation (JACTO) have decided to close down schools and stage protest on Monday. They are demanding salary on par with Central government teachers and want the the Contributory Pension Scheme (CPS) to be scrapped.\n\nMembers of JACTO were arrested on Sunday as they tried to stage a road roko near the Collectorate.\n\nC. Sekar, State high level committee member of JACTO, said they have decided to close all schools on Monday and stage protests for the third day. Twenty four teachers associations at the elementary, middle, high and higher secondary school levels are part of the JACTO.\n\nParity in pay\n\n“We want State government teachers to be paid on par with Central government teachers. There should be parity in pay especially for secondary grade, special teachers, high school and higher secondary school headmasters and post graduate teachers,” he said. There is a difference of at least Rs. 4,000 in each cadre between State and Central government teachers’ pay, he added.\n\nHe said they have been protesting against CPS for nearly six years but the government has not acted on their demand. “Since 2003, teachers and government has been contributing their share for the CPS. But none of the teachers who have retired in the last two years have received the pension under this scheme. Nobody seems to know where the money has gone,” Mr. Sekar said.\n\nHe said nearly 1,200 teachers, who came under CPS, have retired from service in the last two years. Of them, 500 have died.\n\n“Many of the teachers are facing great hardship due to lack of pension. The families of teachers, who have died, have been affected too,” he said.\n\nThey demanded scrapping of CPS and implementation of old pension scheme.\n\nRegularisation of teachers\n\nJACTO is also demanding regularisation of 45,000 teachers, who were recruited on consolidated pay during 2004-2005 in the State. Among other demands is fixing new pay scale on merging 50 per cent dearness allowance with basic pay.\n\n“We are also demanding six per cent increment on promotions across all cadres. Presently, it is three per cent. In addition, selection grade and special grade should be given six per cent increment on grade pay,” he said.\n\nThe teachers’ organisation is also demanding cancellation of Teachers Eligibility Test and following recruitment on seniority basis in employment registration.", 
    "section": "national", 
    "title": "Teachers’ committee decide to close schools", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}