{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "There are no government-run homes to take care of them\n\nA pathetic story of a middle-aged HIV positive woman abandoned by her family and fighting last stage of cancer has highlighted the need for government intervention in providing hospice and palliative care to terminally ill patients.\n\nM. Lakshmi (name changed), who hails from a village in Sivaganga district, was diagnosed with cervical cancer about 10 months back. The tests she underwent revealed that she was HIV positive. The ill-treatment Lakshmi faced at her home after the diagnosis was a phase that she did not want any other person to go through.\n\nAccording to Lakshmi, she was married to her relative as a second wife when she was still in her teens. She brought up her girl child and two sons of her husband’s first wife. “It was through my husband that I became HIV positive. But I didn’t know that he had AIDS until I was tested positive,” she said. Though her husband was taking medicines discreetly for long, when Lakshmi was tested positive, he allegedly vilified her character.\n\n“He hid his illness and projected me as an immoral person in front of my relatives and even my children,” she said. “I couldn’t fight back as the unbearable pain due to cancer made me mentally unstable,” she added.\n\nIt was one of her daughter-in-laws who brought her to Government Rajaji Hospital in the middle of December 2015 under the pretext of treatment and abandoned her. While she was treated as an inpatient for around a month, the hospital authorities later pressurised her to vacate. With the help of some volunteers, she is now admitted at a privately-run home.\n\n“There are no government-run homes for taking care of terminally ill patients. Without financial assistance, it is difficult for private homes as hospice care is expensive and requires skilled staff. There is rarely any help from authorities in accommodating such destitute persons,” said one of the volunteers preferring anonymity.\n\nAn official from the District AIDS Control and Prevention Unit said that though Community Care Centres (CCC) were run earlier where HIV positive persons could be accommodated, the scheme had been stopped now. “However, such persons can be accommodated with the help of Social Welfare Department,” he said.\n\nPilot project\n\nDr. Republica Sridhar of RMD Pain and Palliative Care Trust said that though pilot projects with the help of government had been initiated in few districts where hospice care was being set up in government hospitals, there was an urgent need to implement the project in a full-fledged manner across the State.", 
    "section": "national", 
    "title": "Terminally ill patients have nowhere to go", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}