{
    "author": [
        "Manish Kumar"
    ], 
    "text": "Until two years ago, the black-and-yellow Ambassador's romance with Chennai airport was strong. “There was a time when the black Amby used to be associated with the airport. We were its identity,” says K. Anbagazhan, a taxi driver from Tambaram. “The times have changed now,” he adds with a sigh.\n\nAccording to these drivers, the entry of the app-based taxi aggregators changed everything. P. Murali, a driver from Alandur, once had five ambassadors pressed into service at the Chennai airport. With his savings, he had purchased an apartment. After profits began to dry out, Mr. Murali sold his house and four cars. Mr. Murali says on most days, he goes without a single customer.\n\nIt's 2 p.m. at the airport’s domestic terminal. Three flights have arrived and the arrival bay is teeming with taxi-drivers and the ubiquitous touts. Swanky sedans and SUVs are vying with one another for space at the arrival gate.\n\nAbout ten metres away, counters of various cab operators are busy dealing with serpentine queues. Right next to them, the counter of Chennai Airport Private Taxi Drivers Association is nearly empty. “They call our Ambassadors primitive,” rues S. Subbarao, the Association secretary. “True, our Ambassadors are old, but we can’t sell them. It's our livelihood.”\n\nStep a little outside the arrival bay of the domestic terminal and you see a lot of black-and-yellow Ambassadors parked in clear symmetry. They’ve been parked there for long, due to lack of customers. Their drivers are immersed in a game of cards.\n\nGanesan S., who has an Ambassador of 1980 make, says he is yet to get his first customer for the day.\n\nAsked if he would consider moving to any app-based aggregators and selling his Ambassador, he says, “I don't have the money to get a new sedan and banks don't recognise us at all. Moving to Uber is a dream, but given my shoddy financial health, it’s really tough.”\n\nAmbassador drivers at the airport stare at a bleak future as profits are on a steady decline", 
    "section": "national", 
    "title": "The fading Amby", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}