{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "It was amended 99 times in 66 years without touching its basic features\n\nLast Tuesday, the country celebrated its 67th Republic Day, a momentous occasion when the Constitution, “a living and organic document” in the words of the Supreme Court, came into force way back in 1950.\n\nThe celebrations call for recalling mammoth efforts that went into the creation of the world’s longest written Constitution, a classic yet dynamic document amended as many as 99 times in 66 years without touching its basic features.\n\nThat Madurai is a now the seat of the Madras High Court Bench where the provisions of the Constitution are discussed, analysed and interpreted almost on a daily basis, makes it a valid case for reminiscing its historical journey.\n\nAccording to Subhash C. Kashyap, an expert in Constitutional law, the Constitution was borrowed heavily from indigenous as well as foreign sources and it turned out to be a perfect blend of the salient features of the Constitutions of other countries.\n\n“The concept of Directive Principles was borrowed from the Irish Constitution... The Canadian Constitution, inter alia, influenced the federal structure and the provisions relating to Union-State relations and distribution of powers between them.\n\n“Parliamentary system with ministerial responsibility to the legislature came from the British and provisions making the President the executive head of the State was based on the US model,” Mr. Kashyap states in his book ‘Our Constitution.’\n\nIn fact, after introducing the draft Constitution in the Constituent Assembly on November 4, 1948, B.R. Ambedkar, the chairman of a drafting committee appointed by the Assembly, gave a fitting reply to criticisms on the draft lacking originality.\n\nHe said: “One likes to ask whether there can be anything new in a Constitution framed at this hour in the history of the world. More than 100 years have rolled over since the first written Constitution was drafted. It has been followed by many countries reducing their Constitutions to writing.\n\n“What the scope of a Constitution should be has long been settled... Given these facts, all constitutions in their main provisions must look similar. The only new things, if there can be any, in a Constitution framed so late in the day are the variations made to remove the faults and to accommodate it to the needs of the country.\n\n“The charge of producing a blind copy of the constitutions of other countries is based, I am sure, on an inadequate study of the Constitution. As to the accusation that the draft Constitution has produced a good part of the provisions of the Government of India Act, 1935, I make no apologies.\n\nThereafter, the draft was taken up for consideration by the Constituent Assembly which discussed threadbare between November 15, 1948 and October 17, 1949 every single word, letter and even punctuation marks found in the draft Constitution.\n\nAgain, the draft was read and re-read until Dr. Ambedkar moved a motion “that the Constitution as settled by the assembly be passed” and the Constituent Assembly adopted the motion on November 26 (celebrated as Law Day every year), 1949.\n\nThe Constitution was signed by members of the Constituent Assembly on January 24, 1950, the last day of the Assembly, and it came into force from January 26, 1950.\n\nInterestingly, the preamble, which embodies the fundamental values and underlying philosophy of the Constitution, and which in the opinion of the Supreme Court forms the basic structure, was the last to be adopted by the Constituent Assembly.\n\nThough the opening words of the Constitution ‘We the People of India,’ were inspired from the US constitution which begins with ‘We the People of the United States,’ Mr. Kashyap points out that our founding fathers were careful in referring to the country as one single unit than as a federation of States.\n\nThe words ‘socialist secular’ in the beginning and ‘and integrity’ in the end were added to the preamble by the 42nd amendment during the days of Emergency in 1976.\n\nHowever, addressing members of Madurai Bench of Madras High Court Bar Association last year, Supreme Court judge Rohinton Fali Nariman said it was “wholly unnecessary” on the part of former Prime Minister Indira Gandhi to have included ‘socialist secular’ in the preamble.\n\nHe was of the view that even otherwise, socialism and secularism were very much part of the Constitution which guaranteed social justice and liberty of faith and worship.\n\nOn the other hand, Madras High Court judge D. Hariparanthaman has continued to maintain that the Constitution is “slightly tilted” in favour of one section of people since it contained provisions such as Article 48 which impresses upon the State to take steps to prohibit slaughter of cows, calves and other milch and draught cattle.\n\nAddressing members of Advocates’ Forum for Social Justice here recently, he advocated one more amendment to the Constitution for deleting the last line in Article 48.\n\nExpatiating about this scenario even before the adoption of the Constitution, Dr. Ambedkar had said: “On 26th January, 1950 we are going to enter into a life of contradictions. In politics, we will have equality and in social and economic life we will have inequality.\n\nIn his concluding speech in the Constituent Assembly on November 26, 1949, its President Rajendra Prasad said: “If the people who are elected are capable and men of character and integrity, they would be able to make the best even of a defective Constitution.\n\n“If they are lacking in these, the Constitution cannot help the country.”", 
    "section": "national", 
    "title": "Time to recall efforts made to create the Constitution", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}