{
    "author": [], 
    "text": "RELIGION\n\nPunitha Selvanayaki Ammal Aalayam: St. Sebastiyar Festival, High Mass by Rev.S. Arokiaraj, Parish Priest, Alam Street, 6.30 p.m.\n\nSath Sangh, Kailasapuram: Radha kalyana mahotsavam, Veda gosham by Sri Jaganatha Rao, BHEL Township, 6.30 p.m.; Divya Prabandham – pasurangal by Sri Bashyakara Kaingarya Sabha, 7.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Lakshmi Narasimha Swamy Sannidhi, Sri Ahobila Mutt, Srirangam, 6 p.m.; Ranga Vilasa Mandapam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 54, I Main Street, SMESC Colony, 6 p.m.\n\nGENERAL\n\nDistrict Administration : Public grievances meeting, K.S.Palanisamy, Collector, presides, Collector’s Office, 10 a.m.\n\nTiruchi Corporation : Civic grievances meeting, A.Jaya, Mayor, presides, Corporation Office, 11 a.m.\n\nNational Institute of Technology Department of Instrumentation and Control Engineering: ACODS - international conference on Advances in control and optimisation of dynamical systems, S.Gopinath, Executive Director, BHEL, Tiruchi, inaugurates, 9 a.m.\n\nSt.Joseph’s College and Indian Association for Canadian Studies : International conference on Canadian Studies, Yan Gong, professor, Beijing University, Brenda Beck, professor, University of Toronto, P.Juneja, former president, IACS, Gujarat, and P.Selvam, vice president, IACS, speak, 9.30 a.m.\n\nPonsiva Research and Innovation Trust and Innovation Incubator of Nehru Memorial College : Innovation trigger camp, college campus, Puthanampatti, 3.15 p.m.\n\nChidambaram Pillai College for Women Department of Tamil : Sibi literary seminar, R.Manimekalai speaks, 1 p.m.\n\nPG and Research Department of English, Holy Cross College: Interactive session with Brenda Beck, Adjunct Professor, University of Toronto, 8 a.m.\n\nSaranathan College of Engineering : Valediction of NSS special camp, S.Ravindran, college secretary, presides, Panchayat Union Elementary School, South Paganur, 10 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nTamil Nadu Handicrafts Development Corporation : Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m. to 8 p.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation : North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m. to 9 p.m.\n\nSri Jayendra Matriculation Higher Secondary School : School Day, Thangam Moorthy, correspondent, Sri Venkateshwara Matric Higher Secondary School, Pudukottai, chief guest, 5.30 p.m.\n\nRotary Club of Tiruchi: Weekly meeting, B. S. Prameela Priyadharshini, faculty from Government Arts College, Pudukottai, speaks on ‘Lost art of reading and writing skills in today’s technological world’, Hotel Femina, 6-30 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}