{
    "author": [], 
    "text": "Transfers will NOT AFFECT investigations, say police\n\nTransferring police officers who have served in a particular city or district for more than three years is mandatory before the elections.\n\nSuch transfers have a few advantages and are inevitable. But, the mass transfers also pose a threat to cases in which the inquiry is yet to be completed.\n\nTop police officers denied such claims and said that systems are in place for the successor to follow up the cases, without much difficulty.\n\nA few weeks ago, more than 20 inspectors and six assistant commissioners of police from the city were transferred to other districts.\n\nWhile some of them got relieved the same weekend, a few others got relieved during the course of the week.\n\nHowever, there was a few days gap for the successor to assume office. Department sources as well as advocates said that transfers coupled with the joining gap could affect investigations and reflect with delay in arrest of the accused and in the proceedings in court.\n\nAn investigating officer of a major crime who has been transferred said that any delay in investigation means a lot for both, the police and the accused.\n\nSenior police officers, however, argued that such transfers will not affect investigations. They said that the outgoing investigation officers leave behind a detailed account of the inquiry so far (in writing) and it helps the successor to follow the case from there.\n\nAlso, those in the lower ranks who were involved in the inquiry would not have been transferred.\n\nIt is worth mentioning that in some cases the accused who are wanted in grave cases such as the murders committed by a city-based lawyer were cracked three years after it was committed and the earlier inspectors could not crack it. There are instances where a crime was cracked even after 10 years. “It depends on the dedication of the officers and strategies adapted by them to solve the case,” an officer said on the condition of anonymity.\n\n(Reporting by\n\nM.K. Ananth)", 
    "section": "national", 
    "title": "Transfers and their impact on cases", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}