{
    "author": [
        "Special Correspondent"
    ], 
    "text": "C. Rajalakshmi, a doctor, receives Lifetime Achievement Award at a felicitation function organised by Sakthi Masala Foundation in Erode on Saturday.— PHOTO: M. GOVARTHAN\n\nSakthidevi Trust, a unit of Sakthi Masala Limited, honoured social crusaders in realms of environment, healthcare and social work, and student performers during its ‘Aimperum Vizha’ with awards and cash prizes and assistance amounting to several lakh of rupees.\n\nAfter formal initiation of the event at the Sakthi Duraisami Marriage Hall on Saturday through lighting of lamp by S. Sharmila Prabakar, wife of the District Collector S. Prabakar, the Principal Secretary of Government of Tamil Nadu V. Iraianbu, the chief guest for the occasion, handed over ‘Marangalin Kaapalar Virudhu’ (Trees Protector Award) to individuals and organisations in recognition of the care they had taken to nurture saplings planted under the Trust’s Thalir scheme, in the presence of P.C. Duraisamy, founder of the Sakthi Masala Group, and other dignitaries.\n\nMr. Iraianbu also released the year’s calendar of the Trust.\n\nAs many as 68 students who had secured first marks at the school level in Plus Two exam in the district in 2015 received Rs. 2,000 each from the chief guest. Second mark scorers received Rs. 1,500 each from the former Lions District Governor N. Muthusamy.\n\nSenior doctor of Arcees Maternity Hospital C. Rajalakshmi was honoured with Lifetime Achievement Award.\n\nLikewise, 85 first-mark scorers at school level in SSLC were presented with Rs. 2,000 each by the Programme in-charge of All India Radio, Chennai, Sundara Avudayappan. A total of 86 second mark scorers received Rs. 1,29,000 from the Correspondent of Bharathi Vidya Bhavan Higher Secondary School L.M. Ramakrishnan.\n\nAs many as 530 economically backward students received an overall assistance of Rs. 18,99,500. Besides, the Trust provided Erode Lions Club of Erode Mid Town with Rs. 25 lakh and Periudnruai Amaithi Poonga Trust with Rs. 12 lakh for carrying out welfare activities. The Imayam Trust run by Indian Medical Association was given Rs. 3 lakh.\n\nOther recipients of the cash award included a Thindivanam-based Professor P. Kalyani who runs a school in mother tongue (Rs. 2 lakh), Kasturiba Gandhigram School (Rs. 2 lakh), and Namakkal-based Nambikkai organisation (Rs.2 lakh). They received the cash award from the Administrative Director of Sathyabama University, Chennai, Mariyajeena Johnson.\n\nTrust functionaries Shanthi Duraisamy, Deepa Senthilkumar and Senthilkumar Duraisamy felicitated the achievers.", 
    "section": "national", 
    "title": "Trust honours achievers with awards", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}