{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "The broken gate at the pedestrian underpass beneath the National Highway – 46 near Murugan Theatre Road in Vellore. The facility is frequented by several persons, including school students and elderly persons. Regular users say the stench in the area is unbearable.— Photos: C. Venkatachalapathy\n\nThe facility at Sathuvachari is littered with waste and is being misused at night, say shopkeepers\n\nIt is used by several people throughout the day but the pedestrian underpass near Sathuvachari is in dire need of regular maintenance. In the absence of regular cleaning, the underpass is filled with stench, making it difficult to walk through for pedestrians.\n\nBrought to public use during 2005-2006, this pedestrian underpass beneath the National Highway – 46 near Murugan Theatre Road is frequented by several persons, including school students and elderly persons.\n\nThe underpass is littered with waste, including broken bottles and plastic bags.\n\nHowever, shopkeepers near the underpass and users complained that the sanitary workers seldom cleaned the facility.\n\n“We have been repeatedly requesting the Vellore Corporation to clean the underpass regularly. People cannot walk through the underpass without covering their nose as the stench is unbearable. Sometimes, we engage people on paying a small amount to clean the facility,” said a shopkeeper.\n\nA regular user of the subway said school students utilised the underpass both during morning and evening hours.\n\nThere is a light at one end of the subway that provides lighting for the entire stretch. There is constant movement of pedestrians, including women, till 10 p.m.\n\n“Earlier, the two gates of the subway were locked after 10 p.m. but one of the gates got damaged and has not been replaced till now,” said another pedestrian.\n\nAs a result, shopkeepers said the underpass was being misused at night hours and people turned it into urinals, resulting in the stench.\n\n“We were regularly using the underpass to reach the other side of the road after one of our relatives was admitted to a nearby private hospital. Due to the flyover here, this underpass is the only way to get to the other side, or else we will have to walk up to the Collectorate junction or near RTO Road. It will be helpful if it is maintained properly,” Sankar, a resident said. An elderly woman said it was scary to use the underpass but it was a safer option as it was difficult to cross the NH.\n\nDirtied by people\n\nOfficials of the Vellore Corporation said that sanitary workers regularly cleaned the underpass but it was often dirtied with garbage by people, especially roadside food stall keepers.", 
    "section": "national", 
    "title": "Underpass cries for maintenance", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}