{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Prices of costly vegetables come down by half across the city\n\nVegetable prices have come down in the past 10 days.\n\nThe rains in December last and dip in temperature this winter have brought down the prices of costly vegetables such as broad beans and carrots by half across the city because of an increase in production. Koyambedu wholesale market, Chennai’s hub of perishable goods, gets nearly 550 loads of vegetables from neighbouring States daily.\n\nR. Jamuna, a resident of Nolambur, said: “I am adding more green and seasonal vegetables to the menu. Until a few weeks ago, many vegetables, such as broad beans and carrots, were priced at over Rs.70 a kg.”\n\nWhile retail traders in smaller markets are glad that more customers are visiting their shops, wholesalers in Koyambedu note that sales have not picked up much as other neighbouring places like Tiruttani get produce from local areas. S. Chandran, a wholesale merchant, said the prices have dropped by 10 per cent this winter compared to last year because of sufficient water in Andhra Pradesh, Tamil Nadu and Karnataka. “Many retailers from other places such as Tindivanam, Sulurpet, Arakkonam, Puducherry and Chengalpet usually source vegetables from Koyambedu. They do not frequent market now as they get produce from local areas for the past few days,” he said.\n\nRetailers like P. Sundarraj of MKB Nagar say there has been an increase in the number of customers by at least 40 per cent ever since the cost dropped a week ago. “Many people are buying vegetables like carrots, beans, peas and broad beans as they are much cheaper now,” he said. The prices may remain stable till March. Several vegetables such as cabbage, radish, onion and tomato are priced within Rs. 30 a kg after many months. Drumstick is perhaps among the few costly vegetables, sold for Rs.80 per kg.", 
    "section": "national", 
    "title": "Vegetable prices come down in city", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}