{
    "author": [
        "M K"
    ], 
    "text": "While the police register cases against speeding vehicles and violators of road rules, do they do so on pedestrians, is a question raised by vehicle users.\n\nTraffic police personnel say that the City Corporation and departments concerned should create the required infrastructure for pedestrians before expecting the police to register cases against pedestrians who cross roads between vehicles or jump over medians.\n\nTo begin with, all zebra crossings at signals should be painted and maintained. Timers should be provided at all signals for pedestrians to cross the road, as there is no such facility in the city. The height of median could be increased or saplings planted so that one cannot jump over it. The gap between barricades and medians should also be properly closed.\n\nR. Dhandapani (47), a physically challenged, suggested construction of subways or elevated footpaths with escalators at important junctions such as Avanashi Road. Escalators are needed as people prefer crossing a road by jumping over the medians than climbing a flight of stairs such as the one near Gandhipuram Bus Stand.\n\nAnd, slabs missing on footpaths or those damaged pose a threat to visually impaired persons. During the rains last November, two men walking on the footpath were washed away. Faulty street lights should be mended and localities without one should be provided with street lights to avoid hit-and-run incidents at night.\n\nAll main roads should have wide footpaths. “Encroachments should be periodically removed from them,” says 83-year-old V. Sushil, who adds that making it shady by planting saplings and having benches to rest would come in handy for people like him.\n\nHeight of footpaths should also be increased from the road level by a few inches and should be provided with ramps for the convenience of the differently-abled persons. The footpaths should also be provided with railings to avoid vehicles entering the spaces earmarked for pedestrians.", 
    "section": "national", 
    "title": "What they need", 
    "subsection": "tamilnadu", 
    "date": "2016-02-01"
}