{
    "author": [], 
    "text": "Students practice their skills at the Lee Se-Dol School for ‘Go’ in Seoul. — Photo: AFP\n\nFor the past two years, 12-year-old Cho Sung-bin has spent nearly all his waking hours focused on a wooden board covered with black and white stones, honing the skills he hopes to translate into a lucrative career as a professional Go player.\n\n“It’s fun. I never get tired,” said Cho, one of dozens of preteens sitting at rows of desks topped with playing boards at the Lee Se-dol School of Go in central Seoul.\n\nMany spend 12 hours a day practising match play with each other in the small, neon-lit, largely windowless rooms of the school named after the grandmaster they all hope to emulate.\n\nAlready well known in East Asia, Lee achieved global recognition earlier this month when he took on Google’s artificial intelligence AlphaGo programme in a five-match showdown. The 33-year-old lost the series, but the battle gave an unprecedented boost to the ancient board game’s international profile.\n\nGo originated in China 3,000 years ago and has been played for centuries mostly in China, Japan and South Korea, with more than 40 million fans worldwide. The rules are simple — two players take turns placing black or white stones on a square board with a 19x19 grid. Whoever captures the most territory wins.\n\nBut the strategies needed to secure victory are complex, with reportedly more possible move configurations than atoms in the universe.\n\n‘An art form’\n\n“Go is not just an entertainment. It’s an art form and a natural philosophy as much as a sport,” said professional player Seo Kon-woo.\n\nThe game is also seen as a tool to help children improve their focus, with hundreds of private Go schools across South Korea offering after-hours tuition.\n\nFor those who show a special skill and affinity for the game, Go also offers a possible career path which, in the case of top players like Lee Se-dol, can lead to fame and fortune. “Many talented kids are discovered when they are five or six, and turn pro before they’re even 12,” said Kim Jung-youl, a veteran coach and head of the Lee Se-dol School.\n\nConsidered one of the greatest Go players of the modern era with 18 international titles, Lee started playing at the age of five and turned pro seven years later.\n\nSouth Korea has around 300 professional players certified by the national Go association, and even those who don’t become star names can make a decent living from tournaments and teaching, players said. — AFP", 
    "section": "national", 
    "title": "An ancient game has South Korea hooked", 
    "subsection": "general", 
    "date": "2016-03-29"
}