{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "The arrest of two journalists in Chhattisgarh’s restive Bastar region last week rocked the State Assembly on Monday.\n\nThe Congress moved an adjournment motion after Question Hour over the arrest of journalists Prabhat Singh and Deepak Jaiswal by the police on “fraudulent charges.”\n\n“Chhattisgarh,” it said, “is witnessing excessive police control these days as a result of which journalists are being targeted in the State. Especially in Bastar region of the State, the journalists are being harassed and threatened with false police and court cases. Journalist Prabhat Singh was arrested from Dantewada district on March 21 and tortured in police custody. On March 26, journalist Deepak Jaiswal was arrested for exposing irregularities during an exam at a school in Geedam town.”\n\nThe Congress also drew attention to how journalist Malini Subramaniam was evicted from Bastar in February. The press, it said, was being barred from doing independent reporting.\n\nResponding to the Congress’s allegations, State Home Minister Ajay Chandrakar said the government was committed to ensuring that journalists in the State work in a “free and fearless atmosphere.”\n\n“It is wrong to say that false cases are being slapped on journalists in Bastar. In the case of Prabhat Singh, the police were not the complainant. A person named Santosh Tiwari filed a complaint against him under the IT Act for writing an objectionable message on WhatsApp. He was arrested and produced before the court. The same procedure was followed in the case of. Deepak Jaiswal. In the case of the attack on Malini Subramaniam’s house, a complaint was registered against unknown persons and a probe is on.”\n\nCong. moves adjournment motion even as govt. denies press freedom is being curtailed", 
    "section": "national", 
    "title": "Congress, BJP spar over arrest of Bastar journalists", 
    "subsection": "general", 
    "date": "2016-03-29"
}