{
    "author": [
        "National Bureau"
    ], 
    "text": "Defence Minister Manohar Parrikar unveils policy document\n\nThe Defence Ministry on Monday unveiled the new Defence Procurement Policy, intended primarily to improve indigenous procurement, but left out the most significant reform it had been promising.\n\nThe DPP-2016, made public to coincide with the latest edition of DefExpo in Goa, was expected to herald a new era in the way India’s private sector participates in defence procurement, but that is not to be.\n\nSpeaking at the inauguration of DefExpo, an exhibition of land and naval systems, Defence Minister Manohar Parrikar said the new policy would give top priority to speedy procurement, focus on indigenous design and development and lay emphasis on Make in India.\n\nThe expo, being held in Goa for the first time, has the participation of 1,055 companies from 47 countries and 224 delegations from 48 countries.\n\nThe Minister said the policy had taken care of some of the issues raised by foreign companies and in another two or three months, the Ministry would take care of a few more issues that were pending. The new DPP can push the agenda of Make in India in a big way, he said.\n\nWhile the FDI limit remains 49 per cent through the automatic route, a higher percentage can be considered on special cases, he said. The DPP recognises the role of small and medium enterprises in the sector, and a further boost will be given to it.\n\nPointing out that self-reliance is “a major corner-stone on which the military capability of any nation must rest,” the DPP says it is of “utmost importance that the concept of ‘Make in India’ remains the focal point of the defence acquisition policy/procedure.”\n\nNew category\n\nUnder the new DPP, the government has introduced a newly incorporated procurement class called “Buy (Indian-IDDM)”, where IDDM stands for Indigenous Designed Developed and Manufactured. This would be the first preference in all acquisitions starting April, when the DPP will go into effect.\n\nThe category refers to the procurement from an Indian vendor of either products that have been indigenously designed, developed and manufactured with a minimum of 40 per cent indigenous content or products having 60 per cent of it on a cost basis but not designed and developed indigenously. The policy has also significantly liberalised the offset liability for foreign vendors, which makes it compulsory for companies to invest, or source, at least 30 per cent of the contract value in India.\n\nWhile offset was compulsory for all contracts more than Rs. 300 crore earlier, the minimum contract value has now been increased to Rs. 2,000 crore. For that expert groups had drawn up a recommendation on nominating ‘strategic partners’ from among private companies for major defence projects.\n\nHowever, the DPP has omitted the seventh chapter titled ‘Strategic Partners and Partnerships’, which would have details of the government strategy to give preferential treatment to major private sector players in significantly large projects.", 
    "section": "national", 
    "title": "Defence policy to give a push to ‘Make in India’", 
    "subsection": "general", 
    "date": "2016-03-29"
}