{
    "author": [
        "Mohit M"
    ], 
    "text": "The city pales in comparison to the 13th largest city in China in public transport and commuting\n\nAt the dawn of the millennium, when the IT revolution was scripting the dreams and aspirations of Bengalureans, the city was getting ready to enter the big league. Bengalureans were promised a city that would mirror some of China’s burgeoning metros, particularly the glitzy Shanghai.\n\nThe reality, however, highlights the disparity between what was promised and what was delivered: when it comes to dependence on public transport and commuting, Bengaluru pales in comparison even with Xi’an, the thirteenth largest city in China. This is the finding of a research project by T. V. Ramachandra of the Indian Institute of Science, who co-ordinated with researchers in Chang’an University in Xi’an and from University of Melbourne, Australia.\n\nXi’an and Bengaluru have much in common. Both are among the fastest growing metros in their countries. Both started as research and development hubs and witnessed massive urbanisation. The car population is similar: Xi’an has one million cars while Bengaluru has 1.4 million light motor vehicles and a further 3 million two-wheelers. Travel within the Central Business District is painful, with average speeds lower than 15 kmph.\n\nHowever, the similarities end there. Xi’an has a better developed public transport system while planning has ensured that it is a compact city.\n\nHaphazard planning\n\nIn contrast, Bengalureans continue to depend on personal vehicles while haphazard planning has put the average commute to work at 7.09 km, nearly twice that of Xi’an (3.8 km).\n\nMore importantly, in Xi’an, the top one-fifth of commuters (primarily, those who travel by car and commute long distances) contribute to 78 per cent of the emissions while in Bengaluru the top 20 per cent contribute 56 per cent. What this implies is that a majority of commuters rely on metro and buses at Xi’an while in Bengaluru, they depend on cars and two-wheelers.\n\n“This is a bad sign, and will not improve until we make our public transport more attractive for commuting,” said Mr. Ramachandra.\n\nTravelling by bus in Bengaluru contributes more than four times the carbon dioxide emissions than in Xi’an.\n\nThough the Chinese city has 3,000 more buses than Bengaluru, the adoption of eco-friendly fuel (CNG, electric) as well as traffic decongestion methods has seen their emissions drop. The result is that an average trip in a bus in Xi’an results in emission of 0.087 kg of CO2 while it is nearly 0.3 kg in Bengaluru.\n\n“In Xi’an, dedicated bus lanes see discipline and punctuality. Here, the bus system is unreliable in its timings while roads are so bad that emissions increase. Moreover, buses here run on profit. It becomes easier to travel in groups in autos and cabs rather than take a bus,” said Mr. Ramachandra.\n\nWhile major investment had been made in the bus system there, BMTC’s grand plans of procuring CNG, electric buses or even use of bio-diesel fuels had hit financial roadblocks.", 
    "section": "national", 
    "title": "Forget Shanghai, can Bengaluru match up even to Xi’an?", 
    "subsection": "general", 
    "date": "2016-03-29"
}