{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Chief Minister Khattar says the existing 27 per cent reservation for the OBCs will not be disturbed\n\nThe Haryana Cabinet on Monday approved a Bill to provide reservation to Jats along with four other communities in government jobs and education, official sources said.\n\nA Cabinet meeting, chaired by Chief Minister Manohar Lal Khattar gave the nod to the draft Bill on reservation to Jats and four other castes including Jat Sikhs, Rors, Bishnois and Tyagis. The Bill, likely to be introduced in the Assembly before March 31, proposes reservation for the five communities by creating a new classification in the Backward Classes category, said sources.\n\nMr. Khattar told reporters that the Bill on reservation for Jats could be brought any day in the ongoing Assembly session, which would continue for three more days. “There was no confusion in this regard as a promise has already been made to introduce the Bill in the Assembly. Therefore, it can be in the list of business any day,” said Mr. Khattar.\n\nHe had made it clear that the existing 27 per cent reservation for the Other Backward Classes (OBCs) in the State would not be disturbed. The OBC community has been opposing the inclusion of Jats in their category for reservation. Sources said the government wanted to give reservation to Jats under a new category for backward classes BC-3. The existing BC-1 and BC-2 categories already account for 27 per cent reservation in government jobs for backward classes.\n\nA five-member committee was constituted earlier this month under the chairmanship of the Chief Secretary to prepare a draft of the Bill, after the Chief Minister had promised reservation for the Jats and others by bringing a Bill during the Budget session. Jat organisations have been demanding 10 per cent quota in jobs and educational institutions under the OBC category.\n\nIn February, the Jat agitation for reservation had left the State paralysed for over ten days during which at least 30 people were killed, over 200 injured and property worth hundreds of crores destroyed as the agitation turned violent.", 
    "section": "national", 
    "title": "Haryana Cabinet approves Bill for Jat quota", 
    "subsection": "general", 
    "date": "2016-03-29"
}