{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "On day one of a four-day nationwide strike, about 200 employees of the IDBI Bank demonstrated in front of its eastern zonal office here on Monday, against the Central government’s decision to reduce its stake in the bank below 51 per cent.\n\nWhile employees of the bank’s Assam unit stayed off work, they could not demonstrate in public due to elections. Their colleagues here said “80 per cent” of the bank’s staff across the country participated in similar demonstrations.\n\nThe employees have also expressed concern over the bank’s alleged move to suspend those questioning its practises. “The bank is randomly suspending employees for asking why the senior management has granted such colossal loans to industrialists without collaterals. As we ask questions and tried to stop the privatisation bid, one of our Deputy General Manager was suspended,” said a demonstrator. The DGM reportedly questioned the top management during a town hall meeting on March 19.\n\n“However, he was spot on,” a mid-level manager explained. “Vijay Mallya’s Kingfisher Airlines was granted nearly a thousand crore loan despite negative feedback from internal auditors. Moreover, Rs. 200 crore was disbursed to Mallya without formal approval.”\n\nAnother employee was suspended for her Facebook post that employees should transfer their salary to non-IDBI accounts to teach the top management a lesson.\n\nIn a press release issued in New Delhi, the United Platform of the IDBI Bank Unions said: “We want to protect our customer’s money which defaulters are not paying back. If privatisation happens, there may be no Central Vigilance Commission, no CBI and defaulters like Mallyas may never pay back our customers’ money.”\n\n“If the government manages to reduce its stake below 50 per cent,” it added, “then it amounts to selling public money either to some specific corporate entity or foreign institution Moreover, it will erode the public’s trust in public sector banks,” the release said.", 
    "section": "national", 
    "title": "IDBI staff protest privatisation plan", 
    "subsection": "general", 
    "date": "2016-03-29"
}