{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Wading into the political controversy around the slogan ‘Bharat Mata Ki Jai’ (glory to Mother India), veteran historian Irfan Habib said here on Monday that the idea of Bharat Mata was an import from Europe and there was no evidence of any such imagination in either ancient or medieval India.\n\n“Bharat Mata has nothing to do with India’s ancient or medieval past. It is a European import. Notions of motherland and fatherland were talked about in Europe,” Prof. Habib said, delivering a lecture in the memory of late historian Bipan Chandra at Jawaharlal Nehru University.\n\nThis statement comes at a time when leaders of the BJP and its ideological mentor RSS have upheld the slogan as intimately related to nationalism in India.\n\nIn the Maharashtra Assembly, All-India Majlis-e-Ittehad-ul-Muslimeen (AIMIM) MLA Waris Pathan was suspended recently for refusing to chant ‘Bharat Mata Ki Jai,’ with Congress MLAs also siding with the BJP and the Shiv Sena on the matter.\n\nLater, talking to The Hindu on the sidelines of the event, Prof. Habib elaborated on his statement. “Bharat is mentioned in ancient India. It was first used in an inscription of King Kharavela in Prakrit. But representation of the country in human form as a mother or father was unknown in ancient India or medieval India,” he said. “This was an idea that emerged in Europe with the rise of nationalism, and it was found in Britain, Russia, etc.”\n\nHe added that Madar-e-Watan in Urdu was also a case of the European idea being borrowed.\n\nProf. Habib had irked many in the Sangh Parivar months ago too, when he reportedly drew parallels between the RSS and the IS.\n\nIn another lecture dedicated to the scholarship of Prof. Chandra, historian Aditya Mukherjee recalled freedom as a key value of the Indian national movement.\n\n“Mahatma Gandhi had said that liberty of speech was unassailable even when it hurt. I hope the government is listening,” he said.\n\n“Bharat was\n\nfirst used in an inscription of\n\nKing Kharavela\n\nin Prakrit”", 
    "section": "national", 
    "title": "Idea of ‘Bharat Mata’ is an European import: Irfan Habib", 
    "subsection": "general", 
    "date": "2016-03-29"
}