{
    "author": [
        "Bishwanath Ghosh"
    ], 
    "text": "In Mamata Banerjee’s neighbourhood, people avoid any talk of politics or elections\n\nThe neighbourhood of Kalighat, in south Kolkata, basks in the halo of three women — the first divine, the second on her way to divinity, and the third considered nothing less than divine by her supporters.\n\nEach represents the city, and to witness their auras, you have to walk just a kilometre or even less, south to north, on Kalighat Road. Your starting point will be the famous Kali temple that earned the neighbourhood its name. Kalighat, in fact, is supposed to predate modern Kolkata, though the temple, in its present form, is about 200 years old.\n\nBengalis, while they love Durga, fear Kali. Goddess Durga is all about festivities that last barely five days a year, but Kali, because she is an angry goddess, must be propitiated round the year. Which is why Kolkata, as far as I know, does not have a permanent Durga temple, but has several Kali temples — the one at Kalighat is the most famous.\n\nFarther up the road, you will come across a two-storey building that was built in 1929 as a dharamshala or inn — in all probability, for pilgrims visiting the temple — by three Marwari men in memory of their father, Ramchander Goenka, whose great-grandson, Ram Prasad Goenka, went on to found the RPG Group. In 1952, the municipal corporation handed over the inn to Mother Teresa, who turned it into a home for the dying destitute. Come September and Mother Teresa, who died in 1997, will become a saint.\n\nKeep walking, and you will find yourself walking past shops that sell everything, from steel trunks to conch shells, and also rows of women looking for custom. These women may not possess a halo, but they lend an all-inclusive character to Kalighat Road, which soon terminates into Hazra Road, embedded with tram tracks. And once you cross Hazra Road into a lane called Harish Chatterjee Street, you will come across the shanty where the Chief Minister of West Bengal, Mamata Banerjee, lives.\n\nThe street is as unassuming as its most famous resident, and it is business as usual for shops and stalls located on it. Nothing has changed about it since I last came here exactly five years ago, except that her home now has what looked like a makeshift screening/waiting room for visitors and is guarded by far more men (back then, I had noticed only two Railway Protection Force guards). One more thing: people here now seem to be wary of discussing politics — something Bengalis otherwise love to do — with strangers.\n\n“Who is there to challenge didi (as Ms. Banerjee is called by her supporters),” asked Chandranath Manna, who runs a shop selling steel bars.\n\n“How has your life changed in the past five years,” I asked.\n\n“There is peace in Kolkata.”\n\n“But how have you benefited?”\n\n“If there is peace, I am happy,” he said and looked away, indicating that the conversation had ended.\n\nRoma Mondal, who runs a tea stall, smiled shyly when I asked her if she was going to vote for Ms. Banerjee. Her husband, Samir Mondal, spoke for her, “How can we not vote for her? We have only one child — a son. She got him a job in the Railways when she was the Railway Minister.”\n\n“Has your life improved after she became Chief Minister,” I asked.\n\n“Our son got a job, what more do we want! Our needs are little,” Mr. Mondal said and then, ignoring my presence, picked up a bucket and walked away to a nearby tap.\n\nI strolled on. Children played cricket on the plot of land opposite Ms. Banerjee’s house. Dogs slept on the street. Well-fed cats crossed my path several times. I stopped to read the headlines of Jaago Bangla (Wake up, Bengal), the Trinamool Congress mouthpiece, at a notice board where its pages had been displayed.\n\nA plainclothesman briskly walked up to me and demanded my ID. After examining it, he said, “Please go to the party office, you will get all the information you want.”\n\n“But I have come here to talk to the people.”\n\n“If someone is willing to talk, well and good. But I still suggest you go to the party office,” the young policeman insisted. “There is nothing for you here.”\n\nHe looked hostile, so I retraced my steps. On my way back, I stopped at a grocery shop and asked the shopkeeper what he thought of Ms. Banerjee’s chances in the election. He folded his hands and said, “I don’t know anything about politics.”\n\nI asked the same question to a young man who stood by a cart, waiting for his corn to be roasted. He said, “I am a taxi driver, I stay miles away from politics.” Never before I had met more reticent Bengalis.\n\nI crossed Hazra Road and was back on Kalighat Road. I breathed easy. I stopped at a pan shop and asked for a soft drink. “Looks like didi will continue in power,” I began the conversation.\n\n“Without doubt,” said the shopkeeper, who gave me his name as Rabindra Jana. “And if she stays on for five more years, Kolkata will change beyond recognition. Why Kolkata, even the villages. In my village in Midnapore, there were no roads until five years ago. Today, go there and take a look!”\n\n“How have you benefited?”\n\n“I have been running this shop for 30 years. Lower-level politicians, from all parties, would often demand cigarettes and soft drinks and not pay. All that stopped ever since didi came to power. Today, even Trinamool leaders don’t do that because they think, what if didi comes to know? They are very scared of her.”\n\nNever before I had met more reticent Bengalis … People here now seem to be wary of discussing politics — something Bengalis otherwise love to do — with strangers.", 
    "section": "national", 
    "title": "In Kalighat, where Bengalis lose their political effervescence", 
    "subsection": "general", 
    "date": "2016-03-29"
}