{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A CBI court in Ahmedabad on Monday rejected IPS officer Satish Verma’s application for a copy of the CBI’s supplementary charge sheet against officials of the Intelligence Bureau (IB) in the Ishrat Jahan case.\n\nMr. Verma was the chief investigator in the case, first as part of the Gujarat High Court-appointed Special Investigation team (SIT) and subsequently as part of the CBI team when the court transferred the case to the agency.\n\nOn Monday, Additional Chief Judicial Magistrate D.R. Vyas held that the applicant (Verma) had no “locus standi” in the case now and that he had not specified in his application why he needed to see the charge sheet.\n\nThe supplementary charge sheet naming the IB’s top official Rajinder Kumar and others had not been taken on record as the Ministry of Home Affairs (MHA) refused to grant sanction to prosecute IB officials in the encounter case.\n\nThe CBI insisted that the encounter was staged and that it was a joint operation involving Gujarat police and officials of the IB, who allegedly had custody of the deceased and also supplied the weapons that were planted on the bodies following the “staged” gun battle.\n\nMr. Verma, currently posted as Chief vigilance Officer (CVO) of North Eastern Electric Power Corporation at Shillong, contended in his application that he needed to study the charge sheet to pursue legal action against those named in the document.\n\nThis was the second time the court had rejected Mr. Verma’s plea.\n\nThe first charge sheet filed by the CBI in July 2013 had named top police officials of Gujarat, including P.P. Pandey and D.G. Vanjara, while describing the encounter as a joint operation by the Gujarat police and officials of the IB.\n\nThe supplementary charge sheet naming the IB officials was filed in February 2014, but the trial stalled for two years awaiting sanction to prosecute the IB officials.", 
    "section": "national", 
    "title": "IPS officer Satish Verma’s plea rejected again", 
    "subsection": "general", 
    "date": "2016-03-29"
}