{
    "author": [
        "Varghese K"
    ], 
    "text": "Pakistan securing its nuclear material: U.S\n\nThe U.S cannot ignore the threat of Islamic State (IS) terrorists laying their hands on nuclear material, a senior official said ahead of the fourth Nuclear Security Summit that will bring together leaders from 51 nations on March 31 and April 1. Prime Minister Narendra Modi will be attending the summit.\n\nInitiated by President Barack Obama in 2010 to raise the discussions on securing nuclear material to the highest level in the wake of the increasing threat of terrorism, the summit, in its fourth edition, takes place in the shadow of the Brussels attacks that killed 31 people.\n\nAssistant Secretary of State for International Security and Non-proliferation Thomas Countryman said he would not label a nuclear threat from the IS “remote” or “imminent”, but the U.S could not “ignore or take it for granted”.\n\nHowever, “measures taken by many countries after the 2010 summit have substantially reduced the risk,” Mr. Countryman said. He said the focus of the NSS would be specifically on securing nuclear material from falling into the hands of terrorists and other general non-proliferation efforts would continue in separate tracks.\n\nPat for Pakistan\n\nPakistan, which has been at the centre of U.S concerns regarding nuclear proliferation to terror groups, got a good conduct certificate from Mr. Countryman and U.S Coordinator for Threat Reduction Programs Bonnie Jenkins, who was in Islamabad recently to discuss the issue.\n\n“Without question, Pakistan takes very seriously its responsibility to provide security for both nuclear weapons and nuclear materials. As a consequence of the summit process as well as our bilateral cooperation, they have taken important steps forward in providing that security,” Mr. Countryman said.\n\nMs. Jenkins, who led the U.S. delegation to the annual meeting of the International Network for Nuclear Security Training and Support Centres (NSSC Network) in Islamabad earlier this month, said Pakistan had been taking effective steps to reduce the risk of terrorists accessing nuclear material in the country.\n\n“We had a chance to visit their [Pakistan’s] centre of excellence, went to their nuclear regulatory authority … it showed what they are doing in terms of training on issues of security,” Ms. Jenkins said.", 
    "section": "national", 
    "title": "IS nuclear threat to be focus of summit", 
    "subsection": "general", 
    "date": "2016-03-29"
}