{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Javadekar finds value in how the West Bengal CM held on, did not compromise and came to power\n\nVoters of Tamil Nadu are tired of the DMK and the AIADMK, says Prakash Javadekar.— PHOTO: Thulasi Kakkat\n\nnion Minister for Environment Prakash Javadekar, who is also BJP’s election in-charge for Tamil Nadu, has taken to citing West Bengal Chief Minister Mamata Banerjee as inspiration for taking on the two dominant Dravidian parties in the State.\n\nIn an exclusive interview with The Hindu , Mr. Javadekar said the people of Tamil Nadu were “tired of both regional parties, the DMK and the AIADMK,” and that it was important not to compromise one’s own politics to make headway in the politically tough State.\n\n“I would like to cite the example of West Bengal and its Chief Minister Mamata Banerjee. The State had three decades of Congress, followed by three decades of the Communists, she held on, did not compromise, fought on her issues and managed to win the State,” he said.\n\n“The BJP had been in alliance in the past, once in Assembly and once for the Lok Sabha with the DMK, but we realised the futility of that soon,” he added. “It is not the Mamata model exactly that we choose to follow, but the fact that we need to find our own way in the State,” he said.\n\nHe put down the break-up of the NDA coalition forged before the 2014 general elections to the competing ambitions of the constituent parties.\n\n“As election in-charge, it was my duty to speak to all the parties that had fought with us in 2014, but we could not come to an agreement,” he said.\n\n“The Pattali Makkal Katchi (PMK) wanted Anbumani Ramadoss to be projected as the chief ministerial candidate, while Vijayakanth wanted himself to be projected. We decided then to go in for polls with the Indian People’s Party (IPP), the New Justice Party (NJP), the Indhiya Janannayaka Katchi (IJK), then our ally the Lok Janshakti Party (LJP) led by Ram Vilas Paswan is also contesting some seats as our some candidates whom Dr. Subramanian Swamy has identified from his erstwhile political party,” he said.\n\nMr. Javadekar refused to comment on how many seats the party was hoping to win. “All I can say is, there is a long way to the polls, and we will get an encouraging response,” he said.\n\nBJP’s election\n\nin-charge refuses\n\nto comment on how many seats the party hopes to win", 
    "section": "national", 
    "title": "Mamata ‘inspires’ BJP in Tamil Nadu", 
    "subsection": "general", 
    "date": "2016-03-29"
}