{
    "author": [
        "Puja Mehra"
    ], 
    "text": "‘Govt. plugging leakages in social expenditure, building infrastructure’\n\nSignalling possible mid-course correction in the economic policy, Prime Minister Narendra Modi on Monday said that even more than reforms, India needed improved implementation.\n\nIn an over 40-minute speech before a select audience on how his government proposed to tackle the challenges in the economy, Mr. Modi did not refer to the Goods and Services Tax, labour or land reforms even once. He instead outlined how his government is plugging leakages in social expenditure, building infrastructure and focussing on improving implementation of the Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS), the Sarva Shiksha Abhiyan and the National Food Security Act.\n\n“Mere announcement of policies achieves little … Even more than reformed policies, we need transformed execution,” he said.\n\nThe National Food Security Act was passed in 2013, he said, but its nationwide implementation had been by his government. “We have drastically reduced leakages in the MGNREGA and ensured that money reaches those for whom it is intended,” he said at a Bloomberg event.\n\nTakes on critics\n\nHitting out at the critics, the Prime Minister said that for India to be at the top of global growth table was an unusual situation. “Obviously, there are some who find that difficult to digest and come up with imaginative and fanciful ideas to belittle that achievement.”\n\nHe said his government had not been lucky with both global trade and growth, which, being low had not helped stimulate exports. Similarly, the government has had little luck with monsoons — 2015 and 2014 both being drought years — yet food grains production has remained much higher, and inflation much lower, than in the last comparable drought year, 2009-10, he said.\n\nHe said the Stand-Up India scheme to be launched on April 5 would provide 2,50,000 entrepreneurship loans to women and Scheduled Castes and Scheduled Tribes.\n\nGovt. plugging leakages in social expenditure\n\nand building infrastructure: PM", 
    "section": "national", 
    "title": "‘More than reforms, implementation is key’", 
    "subsection": "general", 
    "date": "2016-03-29"
}