{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The site of the January 2 attack has been cut off from the airbase\n\nThe National Investigation Agency (NIA) has told the Joint Investigation Team (JIT) from Pakistan that it should refrain from asking questions about the operations against terrorists who stormed the Pathankot airbase on January 2. Instead, the team members should focus on NIA’s investigations into the attack, allegedly by Pakistan-based Jaish-e-Mohammed, and evidence gathered until now.\n\n“The five-member JIT met NIA Director-General and other officers. The aim is to provide all evidence so that perpetrators could be prosecuted,” Sanjeev Kumar Singh, Inspector-General, NIA, said in a statement. “The Pakistan team and the NIA team are interacting under extant legal procedures of India and Pakistan. The JIT will be taken to different locations associated with the Pathankot case on March 29,” he said.\n\nA senior official said that on the first day of interaction with the NIA regarding its probe into the terrorist attack, the Pakistan JIT did not raise any “sharp questions”. The JIT has made no specific requirements regarding their visit to the airbase on Tuesday, sources said.\n\nSite shrouded\n\nMeanwhile, in Pathankot, the investigating agency has strung up tent cloth to isolate the “scene of encounter” from the rest of the airbase. The periphery of the airbase, from where the six terrorists entered has been shrouded in red, yellow and blue canvas to prevent the JIT, which includes ISI officials, from seeing the forward airbase, dedicated for operations against Pakistan.\n\n“We have clearly told them that we will not be answering any operational questions regarding the encounter as we were not part of it. The NSG carried out the operation and there is no way we are exposing them to a foreign force. We will only be entertaining questions pertaining to the investigations done by us,” said the official. The NIA gave a detailed presentation on Monday and the JIT did not raise any objection so far.\n\n“We are expecting them to ask questions on Wednesday, when they make a presentation,” said the official.\n\nNIA also handed over DNA samples and other key evidence related to the involvement of Pakistan based terror outfit Jaish-e-Mohammad (JeM) in the attack.\n\nLate on Monday, the NIA released a statement saying that Pakistan JIT will be taken to Pathankot on Tuesday.\n\nThe NIA shared evidence like phone numbers to which calls were made by terrorists, made in Pakistan labels on food and medicine packets found on the terrorists and telephone intercepts of calls exchanged between JeM handlers and the terrorists present at the airbase. NIA also shared the process of 'evidence gathering' so that there was no doubt over its veracity.", 
    "section": "national", 
    "title": "Pak. probe team to visit Pathankot today", 
    "subsection": "general", 
    "date": "2016-03-29"
}