{
    "author": [
        "Natasha Singer"
    ], 
    "text": "Retired judge Sandra Day O’Connor, the first woman appointed to the U.S. Supreme Court, is the brain behind the popular interactive video game\n\nJustice Sandra Day O’Connor, who turned 86 on Saturday, has many achievements to her name, including serving as a State Senator in Arizona and becoming the first woman appointed to the Supreme Court, where she served for almost a quarter-century.\n\nNow she can add an accomplishment for the digital era: video game impresario.\n\nJustice O’Connor is behind an animated civics education game called ‘Win the White House, whose latest edition was recently released. The game has been played by more than 2,50,000 students just this month and is barnstorming its way through middle schools across the United States.\n\nCurrent issues\n\nIn the game — timed to this election cycle — students take on the role of imaginary presidential candidates who must learn how to compete civilly against opponents with divergent views on issues like immigration and gun control. That Justice O’Connor would become an interactive game enthusiast may seem unexpected. Until a few years ago, she had never watched a video game — let alone played one.\n\n“I was one of the uneducated adults,” she joked in a recent telephone interview from her home in Phoenix. Speaking of the learning objective of ‘Win the White House’, she explained: “We have to have a system that allows young people to approach problem solving from many different viewpoints.”\n\nJustice O’Connor became involved in digital games after retiring from the Supreme Court in 2006. She started iCivics, a non-profit civics education group, in 2009. The group has since released 19 free online games, along with accompanying lesson plans, with the idea of making civics education less about rote learning and more about giving middle school students an animated glimpse into how different branches of government and the Constitution work. About 3.2 million students played iCivics games last year, the group said.\n\nJustice O’Connor is getting colleagues involved in the effort as well. Justice Sonia Sotomayor joined iCivics’ governing board in November.\n\nIn a phone interview Friday, Justice Sotomayor said she thought it was “brilliant of Justice O’Connor to realise that computer games could be a very successful way to interest kids in civics education.” Justice Sotomayor, who said she developed an early interest in law after watching the Perry Mason television show, said she had incorporated iCivics into her own frequent visits to schools, where she encourages students to learn how government works and to get involved in their communities.\n\n“I thought this was really in keeping with my message to kids about how laws affect you every single day,” Justice Sotomayor said, adding that she has played the games. “They’re fun. I’ve challenged my clerks to play them to see how they do.”\n\nThe involvement of the two justices in digital educational games underscores a growing belief among educators that interactive tools may improve students’ engagement in their own learning. In January, Microsoft introduced an educational version of Minecraft, the hit game in which players use blocks to construct elaborate virtual worlds. Last fall, Google unveiled Expeditions, a virtual reality system for classroom use that takes students on simulated field trips around the world.\n\nTeachers who have used ‘Win the White House’ said the game helped their students experience and understand the complicated trade-offs that candidates often make.\n\nLearning politics\n\nAnna Nelson, assistant principal at Bronx Latin, a high school in New York City, recently divided her 12th-grade honours civics class into Democratic and Republican teams and assigned them to play the game. Along the way, her students learned the difference between conservative and liberal political beliefs and that candidates had to stick to the platforms they had chosen, she said. They also learned to select running mates from different backgrounds to broaden their appeal with voters.\n\n“It taught them so many things in one short simulation,” Ms. Nelson said. Now, when they come to class, they want to discuss new developments in the actual presidential primaries with her, she said.\n\nJustice Sotomayor suggested parents play the games with their children as well. “Do you know how many adults don’t know anything about civics?” she said.\n\nJustice O’Connor said she started iCivics out of concern that many schools had abandoned the idea of teaching students to become engaged citizens. She said she worried that students would not grow up to become good leaders, or even active voters, if they did not understand, say, the importance of an independent judiciary or their right to due process.\n\n“Government isn’t handed down in the genes,” Justice O’Connor said. “It has to be taught through every generation.” — New York Times News Service", 
    "section": "national", 
    "title": "Play to win the White House", 
    "subsection": "general", 
    "date": "2016-03-29"
}