{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "In a sense, the manner in which Puducherry Chief Minister N. Rangasamy goes about his birthday celebrations can help arrive at a dashboard of his defining traits — piety, understated demeanour and easy accessibility.\n\nEvery August, the entire stretch of Vazhudavur Road leading to his home in Kathirgamam, Mr. Rangasamy’s constituency, is full of giant arches, banners and hoardings. And, when he turned 66 last year, his supporters in the All India NR Congress (AINRC), the party he founded in 2011, took sycophancy to a new level with flex boards depicting the party supremo in a range of avatars from Baahubali to Roger Federer — which is a stretch though he enjoys a game or two of tennis every day at the Gorimedu Grounds.\n\nAmid all this pomp and fanfare around him, Mr. Rangasamy retains simplicity and an unassuming manner as his hallmark. In fact, few political leaders throw open their homes so unreservedly to the people on such occasions as he does.\n\nPuducherry’s longest serving Chief Minister, Makkal Mudhalvar (Chief Minister of the Masses) to his cadres, came up the hard way in political life. Mr. Rangasamy, a bachelor, had been associated with the Congress right from his school days, inspired by former Tamil Nadu Chief Minister K. Kamaraj.\n\nHe lost in his maiden electoral contest in the Thattanchavady Assembly constituency in 1990. During this low point, when he contemplated quitting politics, Mr. Rangasamy was advised by a friend to seek the blessings of a seer, Appa Paithiyam Swamy. The guru convinced him to remain in politics, saying he divined a bright future for him.\n\nMr. Rangasamy contested his second Assembly election in 1991 from the same constituency and won. Since then, his entire life has been governed by the guru’s influence, sometimes exasperatingly so, as many crucial decisions are deferred until he receives the right vibrations — when the Salem saint attained Samadhi, Mr. Rangasamy built a replica memorial in Puducherry.\n\nA strong proponent of Statehood status for the Union Territory, Mr. Rangasamy won five subsequent Assembly elections from 1991 to 2011. He currently represents Kathirgamam, trifurcated from the Thattanchavady constituency after delimitation.\n\nMr. Rangasamy, whose cumulative term as Chief Minister extends for nearly a decade and a half, is the first member from the dominant Vanniyar community in the Union Territory to hold the post. In the 2001 election, he won by a huge margin and was appointed Public Works Department Minister. He became the Chief Minister the same year. He became the Chief Minister for the second time after the Congress-Dravida Munnetra Kazhagam (DMK) combine won 17 of the 30 seats in the 2006 Assembly elections.\n\nHowever, in 2008, he resigned as Chief Minister on the directions of the party high command after his own Ministerial colleagues raised a banner of revolt against him over his style of functioning. He was criticised for taking all development projects to Thattanchavady, while other Assembly segments were left high and dry.\n\nThis led him to break away from the Congress and float the AINRC a few months ahead of the 2011 Assembly elections. The splinter group won 15 of the 17 seats and went ahead to form a government.\n\nWhile Mr. Rangasamy is known to be a master political strategist, for his rivals, many of his moves smack of rank opportunism and compromise of principles in pursuit of power.\n\nFor long, the AIADMK carried a grudge against Mr. Rangasamy for what the Tamil Nadu Chief Minister Jayalalithaa called out in 2011 as a “betrayal” when he reneged on a power-sharing promise to form the government on his own.\n\nMore recently, during the Rajya Sabha elections a few months ago, Mr. Rangasamy did not mind striking a deal with the same bitter rival (AIADMK) when a revolt by a group of dissidents in his party threatened the survival of his government. Eventually, N. Gokulakrishnan, who was being proposed by the Chief Minister, was hastily inducted into the AIADMK and fielded as its nominee.\n\nMr. Rangasamy’s third term as Chief Minister has been racked with a series of controversies, ranging from the ugly spat with former Lt. Governor Virendra Kataria that resulted in the latter’s unceremonious sacking by the new BJP-led government in July 2014, and allegations of a housing scam in the allotment of Puducherry Housing Board properties at Kurumbapet, indiscriminate diversion of funds, filtering benefits of welfare programmes to his supporters and promotion of Kathirgamam at the cost of other parts of the city.\n\nHis third term\n\nas CM has been marked by a series of controversies and scandals", 
    "section": "national", 
    "title": "Rangasamy’s strategy and the battle for Puducherry", 
    "subsection": "general", 
    "date": "2016-03-29"
}