{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Union Home Minister and senior Congress leader Shushil Kumar Shinde said he, along with a panel of MPs, will meet President Pranab Mukherjee on Tuesday to request him to intervene in Rohith Vemula’s suicide case and related protests in the University of Hyderabad (UoH).\n\nMr. Shinde gave this assurance after he heard the woes of UoH students and Rohith’s mother, Radhika Vemula, who had come to meet him on Monday. Mr. Shinde, along with TPCC leaders, met 25 students and two faculty members of the UoH who are currently lodged in the Cherlapally Central Prison. The Congress leader said in his address that UoH Vice-Chancellor P. Appa Rao should either resign from office or the Centre should sack him.\n\n“His return has made the campus tense. The police action on students is highly condemnable. Police should have arrested the V-C, who is currently booked under the Prevention of SC/ST Atrocities Act, instead of arresting students and faculty members,” Mr. Shinde said, as he wondered why the V-C had not taken moral responsibility for Rohith’s death.\n\nAs a former Home Minister and police officer, he had not seen anything like the police action that took place in UoH on March 22 and 23, Mr. Shinde said.\n\n‘Support Rohith Act’\n\nMs Radhika Vemula accused the Vice-Chancellor of not informing her that her son had been expelled from the hostel.\n\n“The Vice-Chancellor is someone who has completed his Ph.D and still he did not have the intelligence to comfort students who were lying out in the open for 14 days till my son’s death.\n\n“The Vice-Chancellor wanted to have a meeting with me at my residence and I refused. Why can’t he meet me in the open in UoH,” she asked, as she demanded that Mr. Shinde ask the Centre to recall Mr. Rao and support the Rohith Act against discrimination.\n\nA panel of 20 students from the university who were present at the meeting too voiced their concerns to Mr. Shinde.", 
    "section": "national", 
    "title": "Shinde to take University of Hyderabad case to Pranab", 
    "subsection": "general", 
    "date": "2016-03-29"
}