{
    "author": [], 
    "text": "The Bombay High Court has asked a suspended employee of Airports Authority of India (AAI) to make a fresh representation to a higher authority against the suspension.\n\nHearing a petition filed by KS Lakshminarasimhan and his wife S Mangla, both employees of AAI, a division bench of Justices Anoop Mohta and AA Sayyed last week allowed Lakshminarasimhan to make a fresh representation to S Raheja, Member (Planning), AAI who is holding charge of the post of AAI Chairman for three months.\n\nLakshminarasimhan contended that he was suspended because his wife was a whistle-blower in a scam in AAI pertaining to high-rise buildings being allowed in the vicinity of the airports, and also because he had appeared with his wife in the HC during the hearing of a PIL about alleged violation of safety rules due to such buildings.\n\nHis wife, a Deputy General Manager (Aviation Safety), had been named as one of the respondents along with AAI in the PIL. He said AAI had suspended him contending he had appeared in the High Court with his wife without taking its approval. However, Lakshminarasimhan said he had documents to show he appeared in the court on orders from his bosses.\n\nHe argued that the order of December 17, 2015 suspending him from service is illegal because it was issued without conducting a preliminary inquiry into the allegations made against him. Moreover, it also included a transfer order under which he was moved from Mumbai to Kolkata. Lakshminarasimhan argued that his wife was in Mumbai and his daughter was studying in the city, so he should not be shifted to Kolkata.\n\nThe PIL filed earlier in the HC, which became the cause of the petitioner’s suspension, involved alleged safety violations by AAI to grant building height clearances to high-rises built in the flight paths of Juhu and Mumbai airports.\n\nThe matter has been adjourned for four weeks to enable respondents Secretary (Civil Aviation) and the present AAI Chairman to file affidavits in reply. —PTI", 
    "section": "national", 
    "title": "Suspended AAI employee gets relief from Bombay HC", 
    "subsection": "general", 
    "date": "2016-03-29"
}