{
    "author": [], 
    "text": "Preserved pair of Ice Age puppies dating back 12,460 years is being studied by scientists in Russia\n\nScientists extract the brain of a puppy, which died 12,460 years ago, and was discovered in Yakutia in Russia.— Photo: Mammoth Museum of the North-Eastern Federal University/AFP\n\nHunters searching for mammoth tusks in northeast Russia in 2011 were drawn to a steep riverbank by a deposit of ancient bones. To their astonishment, they discovered an Ice Age puppy’s snout peeking out from the permafrost.\n\nFive years later, a pair of puppies perfectly preserved in the region of Yakutia and dating back 12,460 years has mobilised scientists across the world.\n\nLink to domestication\n\n“To find a carnivorous mammal intact with skin, fur and internal organs — this has never happened before in history,” said Sergei Fyodorov, head of exhibitions at the Mammoth Museum of the North-Eastern Federal University in the regional capital of Yakutsk. And the discovery could contribute to the lively scientific debate over the origin of domesticated dogs.\n\nWhen the hunters stumbled on the first frozen pup, they alerted Mr. Fyodorov who immediately flew out to the remote Arctic tundra.\n\nWhen he returned for a more thorough look and found the second puppy close to the same spot, farther down the slope. Both had died when they were about three months old. They most likely come from the same litter, said Mr. Fyodorov.\n\nLast week, he oversaw the removal of the second puppy’s remarkably well-preserved brain.\n\n“Puppies are very rare, because they have thin bones and delicate skulls,” he said.\n\nMr. Fyodorov said a preliminary look at the mammoth remains also found at the dig suggested some had been butchered and burned, hinting at the presence of humans.\n\nIt remains to be seen, however, whether the puppies were domesticated or wild.\n\nThe answer can only be determined by reconstructing their genomes, which would take at least a year.\n\n“Thus far, the lineages of wolves that likely gave rise to dogs have not yet been discovered and it’s possible that these puppies could be on that lineage, which would be very exciting,” said evolutionary biologist Greger Larson of University of Oxford, one of the scientists behind a collaborative project aimed at finding out when and where dogs became the first domesticated animals.\n\nWhat makes the dog particularly intriguing is that it managed to become “man’s best friend” even before humans became settled farmers.\n\nIt is still unclear whether dogs were domesticated in one place or in several places independently, and whether the process started when humans took in cubs or whether wolves themselves gradually drifted to human sites in search of food.\n\nWhatever their precise lineage, the Ice Age pups will keep Mr. Fyodorov and other scientists busy for some time.\n\nThe second puppy’s preserved brain will be compared with that of modern dogs and wolves. Parasites found on its body will be analysed, as will the contents of its stomach, which Mr. Fyodorov is particularly excited about.\n\n“When we opened it, we were very surprised. The second puppy’s stomach is mostly full of twigs and grass,” he said, wondering if perhaps the animals were not exclusively carnivorous or whether they started eating grass after they were trapped by a mudslide and began to starve.\n\n“This material is really exceptional and unique,” said Mietje Germonpre, a palaeontologist from the Royal Belgian Institute who partnered with Mr. Fyodorov on the project and came to Yakutsk to oversee the autopsy of the second puppy earlier this month. “The fact that soft tissue is preserved will give much more information compared to information that can be obtained from ‘normal’ fossils.”\n\nMr. Fyodorov lamented the long time it takes to get ancient biological material to suitable labs due to financial constraints, the rugged terrain and red tape which sometimes means that samples reach laboratories only six months later.\n\n“Everyone understands that the tissue of mammoth fauna loses its structure with every passing second, even in the freezer,” he said. — AFP", 
    "section": "national", 
    "title": "The caveman’s best friend?", 
    "subsection": "general", 
    "date": "2016-03-29"
}