{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two personnel of the Special Branch (SB) of the Kolkata police were suspended for allegedly offering bribe to BJP national secretary Rahul Sinha on Monday.\n\nMr. Sinha claimed that Subhasis Roychowdhury, assistant sub-inspector, and constable Aminur Rahman offered him bribe seeking his help in cow smuggling to Bangladesh. The Kolkata police confirmed the incident.\n\nAccording to Mr. Sinha, the police personnel tried to bribe him when they came to meet him at the State BJP headquarters in the city. “They sought my help to facilitate the cow smuggling from Bengal to Bangladesh,” Mr. Sinha told the journalists. He accused Chief Minister Mamata Banerjee of trying to organise a sting operation on the BJP ahead of the Assembly polls “to counter the Narada case.”\n\nThe State BJP has lodged a complaint with the Election Commission.\n\nJoint Commissioner of Police (Headquarters) Supratim Sarkar said both officials had been suspended pending inquiry. “The Deputy Commissioner of Police (Central Division) is heading departmental investigation against them and will submit the report soon,” Mr. Sarkar said. He said the personnel went to Mr. Sinha “for personal interests.”\n\nMr. Sinha claimed that Mr. Roychowdhury and Mr. Rahman did not reveal their identity until the police were called from the local station. Police, however, denied Mr. Sinha’s allegation that the two personnel tried to “conduct a sting operation” on him.\n\n“Do you think they would have introduced themselves as special branch personnel if they intended to do a sting operation,” asked a senior official. Police said no camera or cash was seized from them.\n\nMamata trying\n\nto do a sting operation on BJP to counter Narada case: Rahul Sinha", 
    "section": "national", 
    "title": "Two cops suspended for bid to bribe BJP leader", 
    "subsection": "general", 
    "date": "2016-03-29"
}