{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Jago Manjhi died following illness, claims Nitish Kumar; don’t politicise tragedy, says Tejaswi\n\nThe NDA and other Opposition parties created pandemonium in the Bihar Assembly on Monday, demanding a high-level probe into the death of a 60-year-old man, allegedly of starvation, in the Sheikhpura district of Bihar. The State government, however, said he died of an illness and because there was no one to care for him.\n\nA report in a local television news channel had said Jago Manjhi, 60, a Mahadalit of Sherpar village under the Bar Bigha police station of Sheikhpura district, died of starvation on Friday. Manjhi lived in a thatched hut with his wife.\n\nRaising the issue in the Assembly, Prem Kumar, Leader of the Opposition, said: “The government has failed to distribute food grains to the poor and people like Jago Manjhi are dying of starvation… the government should order a high-level probe.”\n\nLok Janshakti Party chief and Union Minister for Consumer Affairs, Food and Public Distribution, Ram Vilas Paswan told journalists that the Nitish Kumar government had failed to implement the food security programme. “The programme was launched in the State in a hurry ahead of the Assembly elections last year, but its implementation was tardy,” he said. “Our party demands a judicial probe into the death of Jago Manjhi.”\n\nAnother BJP leader and Union Minister Giriraj Singh visited the village and offered help to the victim’s family. “Local people said he had been unable take his quota of food grain … the State government has failed to provide food to poor people like Jago Manjhi,” said Mr. Singh. His alliance partner and leader of the Hindustani Awam Morcha (Secular) Jitan Ram Manjhi too blamed the Nitish Kumar government for Manjhi’s death.\n\nThe State government denied that Manjhi died of starvation. “As soon as the news reached us, we sought a report from the district magistrate. His report said Jago Manjhi died not of starvation, but of an illness. He was covered under the government’s Antyodaya Yojna programme and was getting the benefits intended for poor people,” said Chief Minister Nitish Kumar. His deputy Tejaswi Yadav said one should not politicise the tragedy. “The government will look into the incident.”\n\nEarlier, a three-member inquiry team constituted by Sheikhpura district magistrate Chandrashekhar Singh said Manjhi’s death was due to liver cirrhosis.", 
    "section": "national", 
    "title": "Uproar over ‘starvation death’", 
    "subsection": "general", 
    "date": "2016-03-29"
}