{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "Less than 24 hours before the scheduled visit of French President Francois Hollande at Lodhi Estate’s Alliance Francaise De Delhi, the theft of a car bearing a defence sticker nearly 650 metres from the venue sent the Delhi Police into a tizzy.\n\nThe car, owned by an Indian Army doctor and carrying a Defence Services Officers’ Institute (DSOI) sticker, was stolen from Lodhi Road on Sunday afternoon.\n\nPolice officers confirmed the theft and also the fact that there were no CCTV cameras or added security deployment in the area where Mr. Hollande and Minister of External Affairs Sushma Swaraj are scheduled to visit on Monday. The area houses several ministerial bungalows and other vital installations.\n\nThe stolen vehicle, a white Santro (registration number: HR 51, T 6646), belongs to Dr. Col. Shailendra Singh from the Army, who was visiting the Lodhi Garden with his family. “Mr. Singh reached the area around noon and parked the car outside the Lodhi Road post office, opposite gate number 1 of Lodhi Garden. When they decided to leave around 2.45 p.m., they could not find the car and lodged a complaint with the police,” said a police officer.\n\nFearing a security breach, the police immediately sounded an alert in all the districts. The car had not been traced till late Sunday evening.\n\nThis is the second incident raising security concerns in the National Capital Region in less than a week. On January 20, the official vehicle of an Indo-Tibetan Border Police Inspector General was stolen from outside his residence in Noida’s Sector-23. A similar security alert was issued by the Delhi Police on Friday after the driver of an Alto car hired from Pathankot was found dead in Kangada.\n\nTheft comes 24 hours before the scheduled visit of French President Francois Hollande", 
    "section": "national", 
    "title": "Army officer’s car stolen from Delhi", 
    "subsection": "general", 
    "date": "2016-01-25"
}