{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "BJP president Amit Shah was re-elected, unopposed, by his party for a full three-year term, after he completed the former president, Rajnath Singh’s tenure which was cut short when he joined the Union Cabinet in 2014.\n\nHe will be the party president during the 2019 general election, but much will depend on what he manages to do in 2016, not a very promising year politically for the party. Of the States going to the polls this year — Kerala, Tamil Nadu, West Bengal and Assam and the Union Territory of Puducherry — it is only in Assam that the party has hopes of making headway.\n\nBut that is not the most important challenge for Mr. Shah. The main challenge is two-fold: of perception and an organisational trust deficit.\n\nIn his first tenure, Mr. Shah laid stress on expanding the party’s activities, and his supporters are proud of the fact that not only has the BJP become the largest political party in the world — with a reported membership of over 11 crores, five times more than what it was before Mr. Shah took over — it has also gained toehold in Jammu and Kashmir, the Northeast, Ladakh and Andaman and Nicobar Islands. The party had been pushing the frontiers of its growth and dispelling the perception that it was a largely north-Indian, upper-caste party that did not represent non-hinterland areas.\n\nThis year, Mr. Shah will have to go back to the drawing board.\n\nRSS chief Mohan Bhagwat’s remarks in an interview to Organiser that the reservation system should be reviewed; Minister of State Gen. (retd.) V.K. Singh’s insensitive remarks on the death of two dalit children in Faridabad; and the suicide of Dalit research scholar Rohith Vemula have shattered the BJP’s Dalit outreach. The grand idea of the Hindu vote, regardless of caste, looks more distant now than ever.\n\nThe consolidated Hindu vote that propelled Prime Minister Narendra Modi to power in 2014, wiping out many Opposition parties, shows signs of falling apart, as it did in Bihar, where the party was routed in the Assembly polls because of the consolidation of the backward castes around the Janata Dal (United) and the Rashtriya Janata Dal (RJD).\n\nThe second challenge to Mr. Shah is that he will have to address the first with a team of people who don’t trust each other. Mr. Shah’s style of micro-managing things had alienated the State units in places where elections took place in 2015. This was an organisational grouse that has forced the RSS to take up matters seriously. The result: The State unit chiefs in Kerala, West Bengal and, to some extent, in Assam have the RSS stamp of approval and Mr. Shah’s team selection for this tenure is under watch. His own men may have to be shifted out to accommodate some choices imposed by the exigencies of compromise. That team will be expected to return the party to power in 2019.", 
    "section": "national", 
    "title": "Back to the drawing board for Amit Shah", 
    "subsection": "general", 
    "date": "2016-01-25"
}