{
    "author": [
        "Ashish Rukhaiyar"
    ], 
    "text": "A sex worker (back to camera), who collects moneydoor-to-door, talking to a representative of the bank in Kamathipura in Mumbai.— Photo: Arunangsu Roy Chowdhury.\n\n“You really think I would be here if my husband was with me?” says Papiya when asked about her family. Her tiny home, one unventilated room in a dingy building, has been neatly partitioned, fitting in a kitchen and a bedroom with a sliding door.\n\nShe lives with her five-year-old daughter, who is busy playing with a mirror and forceps. She has two other children, “I was in Kolkata for four months. I got my daughter married there. My son studies in a boarding school in the distant suburbs of Mumbai. I cannot afford to stay away for long. I have to manage the monthly rent and overhead expenses as well.”\n\nRaima, also from West Bengal, has been working to help her family back home, where she has bought some land, and an autorickshaw. “I have been here for five years and am saving money for my family,” she tells us.\n\n‘Here’ is Kamathipura, Mumbai’s biggest red-light district, and Papiya and Raima (both names changed) are among the nearly 20,000 sex workers. And, like many of their neighbours, they dream of being able to leave the profession and going back home.\n\nPapiya and Raima have been able to go some way towards their goals, though. Thanks to being members of Sangini Mahila Seva Cooperative Society Ltd., that, since 2007, has been exclusively working towards providing banking services to the commercial sex workers. It has more than 5,000 accounts, of which more than 3,000 are active with regular deposits.\n\nSangini’s team of four, all volunteers, cover the 14 lanes of Kamathipura on foot to collect deposits from those who are unable to come to their office.\n\nAnjali Desai, one of the three office staff, has been working with Sangini since 2012 and remembers the names of all women. “They are not just our account holders,” she says, “We also educate them on money management. Earlier, clients or brothel-owners used to steal their money. Sangini has helped them overcome this problem.”\n\nSangini’s growing popularity with the sex workers of the area can be gauged from the numbers: most days, the amounts deposited total more than Rs 1 lakh.\n\nSangini was launched with support from Population Services International (PSI), a global health organisation focussing on issues like family planning, HIV and AIDS.\n\nDedicated staffers and volunteers notwithstanding, Sangini desperately needs financial support if it is to succeed with its long-term development programmes.", 
    "section": "national", 
    "title": "Banking their way out of Kamathipura", 
    "subsection": "general", 
    "date": "2016-01-25"
}