{
    "author": [], 
    "text": "President’s rule will be imposed and the Assembly kept in suspended animation, official sources told The Hindu .\n\nTaking cognisance of the situation in the State, based on Governor Jyoti Prashad Rajkhowa’s report, the government felt the State is “heading for a constitutional crisis” and it warranted the Centre’s intervention, sources said.\n\nThe Centre based its decision on Article 174 of the Constitution, according to which six months shall not intervene between the last sitting of the Assembly in one session and the date appointed for its first sitting in the next session. According to one interpretation, the next session should therefore have taken place at the latest by January 21, 2016.\n\nThe other interpretation is that a session was indeed held on December 16 albeit outside the Assembly building (where a majority of the members had voted) as access to the building was denied. Notably, the session which took place on December 16, 2015 has been disputed by Chief Minister Nabam Tuki and his supporters. Whether this session is valid or not is under litigation in the Supreme Court.\n\nEven if the Supreme Court rules in favour of the interpretation that this session was not valid, there will be a constitutional breakdown because the requirement of Article 174(1) would have been breached. On the other hand, if the court holds that the December 16 session was valid, it is clear the government is in a minority and is not allowing a vote of confidence. Therefore, in either case, the State is heading for a constitutional crisis, the sources said.\n\nThe Centre considered the fact that the Speaker, using the State machinery, prevented the session, though it was called by the Governor. The Union government also felt that there was flouting of Article 167(b) of the Constitution as the government was not responding to the Governor’s letters on issues of public importance.\n\nThe Congress said the Centre’s decision exposed Mr. Modi’s double-speak on federalism. Expressing shock at the Centre’s recommendation, Mr. Tuki said there was no constitutional crises in the State and whatever crisis was there it was the Governor’s “creation.”\n\nMr. Tuki said the Governor recommended President’s rule without consulting the State Cabinet at a time when several cases on the matter were in the Supreme Court.", 
    "section": "national", 
    "title": "Centre recommends President’s rule in Arunachal", 
    "subsection": "general", 
    "date": "2016-01-25"
}