{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "Marginalised communities are subjected to discrimination in admission, academic evaluation\n\nThe marginalised communities are subjected to discrimination on university campuses in admission, evaluation of academic performance and even in administrative operations. Such students, once their identity gets revealed, often get treated differently, says V. Krishna, a Dalit faculty member of the University of Hyderabad, who chaired a seven-member committee in 2013 to examine inter-caste bias on the campus.\n\nHe said the assertion of Dalit identity was seen as “out of place” as students often receive bad treatment as soon as they revealed their lower caste backgrounds.\n\nMr. Krishna, who recently laid down his position as the Controller of Examinations, has a long association with the UoH. From1982 to 1983, he studied there in the Hindi department. He remembers what he called “a type of ghettoisation” he and his fellow Dalit students had to go through. “There was no choice but to be in the company of each other,” he said.\n\nAs Dalit PhD scholar Rohith Vemula’s suicide brought to the fore caste-based discrimination on campuses in Hyderabad, Mr. Krishna was not surprised as he and other faculty members on eight different campuses in Hyderabad had predicted that the ongoing suppression might push the lower caste students to dangerous extremes.\n\nThe case of M. Venkatesh, a Dalit research scholar at UoH who committed suicide in 2013, is still fresh in memory. The seven-member team led by Mr. Krishna probed whether caste-based prejudice had something to do with the suicide. The committee pointed out in the end that “the institution and the system” had driven him to death.\n\nSuicides in higher education are quite rampant in Hyderabad. Five Dalit students committed suicide between 2005 and 2015 in the UoH alone. In Osmania University, two women students — Malleswari, a Bahujan, and Rajitha, a Dalit — had killed themselves in 2007 and 2011 respectively. In 2013, two Muslim students committed suicide at English and Foreign Languages University (EFLU).\n\nRecalling the time when he pursued his PhD in Jawaharlal Nehru University in New Delhi, Mr. Krishna said that as the Mandal Commission recommendations were implemented “the caste divide surfaced in a big way.”\n\n“That brought me to the core of Dalit politics,” said Mr. Krishna.Mr. Krishna is not the only one in the UoH who believes that institutional bias is equally responsible for the series of suicides the campus has recorded in the last few years. According to most senior faculty members in the city, including the 14 Dalit teachers of the UoH who laid down their administrative posts recently, ‘ostracisation’ of students coming from marginalised sections on campuses is a matter of routine.\n\n“In Venkatesh’s case it was non-allotment of research supervisor or guide that led to the suicide. In the case of P. Raju, who killed himself in the same year, non-publication of results had led to the suicide,” he said.\n\n“Dalit students find it difficult to get past the biases that surface in all modern academic spaces as teachers, staff and administrators are not concerned about them.”", 
    "section": "national", 
    "title": "Discrimination at every step", 
    "subsection": "general", 
    "date": "2016-01-25"
}