{
    "author": [
        "Andy Newman"
    ], 
    "text": "The rodent is playing a role in The Curious Incident of the Dog in the Night-Time after the regular actor fell sick\n\nRose, a white rat, takes a sip of water in a dressing room at the Barrymore Theatre in New York. (Right) Animal trainer Lydia DesRoche with the rat.— Photos: NYT\n\nThis is the story of 500 rats on the West Side Highway and one who ventured east.\n\nThey were not your typical city rats. They were albinos, white with pink eyes, the kind people keep as pets or tinker with in labs or raise to feed to snakes.\n\nLast July, they began to appear in a kite-shaped median between the highway and an exit lane onto West 57th Street, across from a Sanitation Department garage: first a few rats, then a few dozen, then so many that they were a blur of white in the undergrowth, a scurrying time-lapse.\n\nMysterious origin\n\nHow the rats got there remains a mystery. But one of them was Rose. She was near the end of childhood, five weeks old and fully furred.\n\nThere was no food or water for the rats on their little island. Many of them ran out onto the 10-lane highway, made for the riverfront, met with bad ends. (It did not help that albino rats are mostly blind.)\n\nRose stayed on the median, huddled with her family. Eventually, the rats drew wider attention. On July 14, Gothamist ran an article quoting a biologist who said they were doomed.\n\nThe city’s rat-rescue community sprang to action. Hundreds of beautiful rats, in mortal danger. Rescuers showed up that night with boxes and buckets and cat carriers, grabbing all they could catch.\n\n“At the beginning there’s so many it was like picking up daisies,” said Lisa Anselmo, who helped find homes for more than 50.\n\nThe next day, the city health department, citing “public safety concerns,” set out poison.\n\nThe rescuers raced back to the median, scooping up rats, furious at the injustice.\n\nThese were domestic animals, pets, like hamsters or guinea pigs, except a lot smarter and more social, quicker to bond with their keepers.\n\n“What other species would be treated this way?” Ms. Anselmo asked. “Imagine if they were puppies. The entire thing was insane.”\n\nThat night or possibly the next, Rose was rescued.\n\nShe and two others her age were adopted by an animal trainer named Lydia DesRoche. Ms. DesRoche called them the Golden Girls and named them Rose, Blanche and Dorothy.\n\nShe meant to foster the sisters only long enough to find them a home. But they were so shy they would not come out of their cage, so she kept them at her apartment uptown. She left the cage open and made a little ramp down to her bed so they could visit her. She fed them corn and peas and edamame and yogurt and avocado sushi and bits of dark chocolate.\n\nWeeks turned to months. Rose grew up, grew bolder. She explored Ms. DesRoche’s living room and dominated the other rats.\n\nDestiny was making plans. Ms. DesRoche is the trainer for the Broadway hit The Curious Incident of the Dog in the Night-Time ,” which features a rat, played by an albino named Toby.\n\nIn mid-December, Toby fell ill with tumours. Her understudy, Tulip, stepped into the role, but she was a reluctant performer. She hid in her cage until she had to go on. “Tulip has accepted her fate,” Ms. DesRoche said, “but she has not taken a liking to the stage.”\n\nToby’s recovery grew protracted. She needed more operations. She broke a foot. Tulip, with no understudy, was doing eight shows a week, showing stress.\n\nJust before New Year’s, Ms. DesRoche took Rose to the theatre for a taste of the footlights.\n\nIt was love at first sight. Ms. DesRoche began bringing Rose every day, wearing her in a carrier around her neck as she made her rounds before the show and backstage for Tulip’s entrances and exits.\n\nOn January 14, Rose accompanied Ms. DesRoche to the Ethel Barrymore Theatre and stopped in the green room for some social time with Tyler Lea and Benjamin Wheelwright, the two young actors who play the lead character.\n\nHappy and relaxed\n\nRose crawled across Mr. Wheelwright’s arm, down his shirt, over to Mr. Lea. She sat calmly in Lea’s hand — the first time she had let him hold her. He stroked her back.\n\nAnd then Rose did something special. She bruxed, and she boggled. Bruxing is when a rat grinds its incisors together. Boggling, a muscular side effect of bruxing, is when a rat bugs its eyes in and out rapidly, like a possessed vaudeville comic.\n\nThey are the ultimate indicators of a relaxed, happy rat.\n\n“Oh, my God!” Ms. DesRoche said.\n\n“I found her sweet spot,” Mr. Lea said.\n\nBack upstairs in the fifth-floor rat dressing room, Rose crawled out of her little red cage and over to the identical one Tulip uses onstage, standing atop it like King Kong on the Empire State Building.\n\n“This one is ‘All About Eve,’” Ms. DesRoche said. “I want the real cage! Give me the real cage!”\n\nRose’s wish is coming true: It was decided that she would alternate with Tulip, who has upped her game of late.\n\nThere was a final rehearsal on Wednesday night.\n\nMr. Wheelwright as Christopher, a teenager with Asperger’s, was in a train station, trying to navigate the crowds. He picked up Rose in her cage, ran upstage and down, spun in circles, set the cage down and opened it.\n\nRose popped her head out, unfazed. Mr. Wheelwright leaned toward her with a tsk-tsk noise: Rose’s cue to kiss him. She demurred.\n\n“We’re still working on the kiss,” Ms. DesRoche said. “She’ll get it.” — New York Times News Service", 
    "section": "national", 
    "title": "Enter Rose, a Broadway rat with a past", 
    "subsection": "general", 
    "date": "2016-01-25"
}