{
    "author": [], 
    "text": "‘Those who silently sponsor terror groups may end up being used by them’\n\nMinister for External Affairs Sushma Swaraj and her Bahrain counterpart Khalid bin Ahmed Al Khalifa signing an agreement in Manama on Sunday.— PHOTO: PTI\n\nIndia and the Arab League on Sunday vowed to combat terrorism and called for developing a strategy to “eliminate” its sources and its funding as External Affairs Minister Sushma Swaraj made a strong pitch for delinking religion from terrorism.\n\nWhile addressing the 1st Ministerial Meeting of Arab-India Cooperation Forum here in the Bahraini capital, Ms. Swaraj also warned that those who “silently sponsor” terror groups could end up being used by them, in an apparent jibe at Pakistan.\n\n“Those who believe that silent sponsorship of such terrorist groups can bring rewards must realise that they have their own agenda; they are adept at using the benefactor more effectively than the sponsor has used them,” Ms. Swaraj told some 14 foreign ministers of the 22-member Arab League grouping, with its Secretary General Nabil El Araby in attendance.\n\n‘Turning point’\n\nShe said the meeting marked a “turning point” for India-Arab relations, while pointing out that “we are also at a major turning point in history when the forces of terrorism and violent extremism are seeking to destabilise societies and inflict incalculable damage to our cities, our people and our very social fabric.”\n\n“Equally, we must delink religion from terror. The only distinction is between those who believe in humanity and those who do not. Terrorists use religion, but inflict harm on people of all faiths,” said Ms. Swaraj, who arrived here on Saturday.\n\nThe Manama Declaration\n\nThe meeting, which was opened by Bahrain’s Foreign Minister Khalid bin Ahmed Al Khalifa, culminated with the two sides issuing a joint statement called the Manama Declaration.\n\nThe two sides discussed regional and global issues of mutual concern, including the Palestinian issue, developments in the Arab region and in South Asia, as well as counter-terrorism, Security Council reforms and nuclear disarmament.\n\nThe two sides condemned terrorism in all its forms and manifestations and rejected associating it with any religion, culture or ethnic group.\n\nThey also emphasised the need for concerted regional and international efforts to combat terrorism and to address its causes and develop a strategy to eliminate the sources of terrorism and extremism, including its funding, as well as combating organised cross-border crime, the Declaration stated.\n\nIn this context, the two sides affirmed their respect to the independence, sovereignty, unity and territorial integrity of Iraq and non-interference in its internal affairs and rejecting infringement of such principles, strongly condemned crimes committed by all terror organisations, especially those committed by the Islamic State. — PTI", 
    "section": "national", 
    "title": "India, Arab League vow to check terror, funding sources", 
    "subsection": "general", 
    "date": "2016-01-25"
}