{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "The pieces suggest it may have been a 10-15 metre-long, herbivorous animal\n\nA team of Indo-German geologists and palaeontologists may have found fossils of a 135-million-year old herbivorous dinosaur in Kutch, Gujarat, possibly the oldest such fossil found this century. The pieces of bone — possibly from the limb or hip and about two feet long —suggests that it may have been a 10-15 metre-long animal and, were the researchers’ claims to hold up, only among a handful of Jurassic-era dinosaur fossils from India. That was the time when India and Madagascar were one landmass and the Himalayas yet to form.\n\nThe so-called Jurassic era spanned 250-145 million years during which herbivorous dinosaurs flourished and laid the ground for beasts, such as the Tyrannosaurus Rex. These flourished during the Cretaceous period —145 to 65 million years ago — after which the double blows of a meteor strike and overflowing volcanoes are said to have destroyed these animals.\n\n“We’ll be moving fast to find out if this a known species or a member of a new class,” said Dhiraj Kumar Pandey, palaeontologist at the University of Jaipur and part of the excavation team. About 10 years ago, he was part of a team that discovered bones —again in Kutch — of the Camarasaurus Supremus — a herbivore and among the most frequently-found of dinosaur fossils in North America. “From preliminary observations, this may be related to the Camarasaurus family. We’ll be sending this to Munich and hope to be able to formally publish and describe our finds within 4 months.”\n\nStudents and professors from the Department of Geology, Krantiguru Shyamji Krishna Verma Kutch University (SKVKU); Mr. Pandey, Franz T. Fuersich from Germany and his wife Valsamma Fuersich —born Indian and reportedly first saw the fossil — were among the excavation team in Kutch. The most recent dinosaur fossils from India in this millennium is the “Rajasaurus Narmadensis, a 30-feet-long, carnivorous and stocky animal, which was discovered from the Narmada Valley Basin in Kheda, Gujarat.", 
    "section": "national", 
    "title": "Indo-German team finds dinosaur bones in Kutch", 
    "subsection": "general", 
    "date": "2016-01-25"
}