{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Officials delayed arrests till concrete leads emerged\n\nThe terror suspects linked to the Islamic State (IS), arrested in a countrywide raid over the past few days, had planned to target Goa a few months ago, but Intelligence agencies did not arrest them then as they had not acquired the capability to carry out any terrorist act, a senior government official told The Hindu .\n\nTheir arrest was precipitated this time as some of the suspects had assembled “liquid bombs” and were also found to be in possession of “remote controlled circuits”, said the official. Apart from this, gunpowder, hydrogen peroxide and pipes were recovered from some of them.\n\nUnder surveillance\n\n“As they were under surveillance for the past seven-eight months, we came to know of their intention to target Goa a few months ago. It was decided not to arrest them then as they neither had explosives nor the organisational skill to carry out the attack. Had we arrested them then, the case could have fallen flat in the court of law later on. We decided to wait and watch,” said the official.\n\nThe official refused to disclose the month or the time when the terror suspects wanted to target Goa.\n\nThe arrested men were being brought to Delhi in a phased manner. Abu Anas (24) and Nafees Khan (24), both from Hyderabad, were produced before the Special Judge, NIA court, and remanded in police custody for 13 days, an NIA official said.\n\nAnother investigator said, “So far, we have arrested 14 people, but there could be more men linked to this module. It is too early to divulge details.”\n\nThe officials are scanning the ‘jihadi’ literature and the CDs seized from the accused.\n\nMumbai resident Mudabbir Mushtaq Sheikh, said to be the leader of the group, was in regular contact with former Indian Mujahideen member Shafi Armar alias Yousuf, now the leader of Ansar-ul-Tawhid (AuT), which has pledged allegiance to the IS, said the official. He had declared himself the “Ameer” (head) of ‘Janood-ul-Khalifa-e-Hind’ (Army of Caliph of India).", 
    "section": "national", 
    "title": "IS suspects planned to target Goa", 
    "subsection": "general", 
    "date": "2016-01-25"
}