{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The police, while probing the alleged gang-rape of a woman at a homestay in Fort Kochi two-and-a-half months ago, have stumbled upon another gang-rape: that of a college girl at the same homestay earlier this month.\n\nAccording to the police, the key accused in the first case took his girlfriend to the homestay at Pattalam in Fort Kochi, where Ijas, son of a civil police officer with the Fort Kochi station, and Amal, another co-accused in the first case, allegedly raped the girl with the consent of Althaf.\n\nDuo absconding\n\nThe duo has been absconding ever since the arrest of Althaf.\n\nThe incident came to light on Sunday when the police examined the mobile phones of the accused after the arrest. Althaf’s mobile had video footage of a young girl being gang-raped.\n\nThe police recorded the statement of the girl and registered cases against the trio under Section 376 D of the Indian Penal Code.\n\nPolice officer transferred\n\nFollowing the discovery, City Police Commissioner M.P. Dinesh transferred the civil police officer out of the Fort Kochi station.\n\nThe accused in the first case, identified as Althaf, 20, Ijaz , 19, Christi, 18, John Bristo, 19, Clipton, 18, and Sajith, 20, were arrested on a complaint from a man who alleged that his partner was raped by the gang while they were at the homestay.\n\nThe complainant said the youths forced him out of the room at the homestay and raped the woman hailing from Thanneermukkom in Alappuzha after locking it from inside.\n\nThe accused allegedly recorded visuals after tying her up and made away with their car, Rs.1 lakh, and gold ornaments, the police said. They threatened to upload it on social networking sites.\n\nThey threatened the couple with dire consequences if they told anyone about the incident.\n\nFollowing this, the complainant, a taxi driver from Cherthala, approached the Commissioner and this led to the arrests.\n\nPolice stumble upon case while investigating another incident\n\nat Fort Kochi", 
    "section": "national", 
    "title": "Kerala college girl gang-raped at homestay", 
    "subsection": "general", 
    "date": "2016-01-25"
}