{
    "author": [], 
    "text": "A tiny electric current applied along with topical anaesthetics can do away with the need for injections.— File photo: K.V. Ramana\n\nIn some good news for people who fear painful injections given by the dentist, scientists have found a new method to deliver anaesthesia using a tiny electric current instead.\n\n“Needle-free administration could save costs, improve patient compliance, facilitate application and decrease the risks of intoxication and contamination,” said Renata Fonseca Vianna Lopez, from the University of Sao Paulo in Brazil. Dentists often have to carry out invasive and painful procedures in the mouth. To minimise patients’ discomfort, dentists use anaesthetics that block the pain, which are administered using needles.\n\nFor some patients, an additional step is needed — dentists first give them a topical painkiller to reduce the pain — and associated fear — caused by the needle.\n\nThis can come in the form of a hydrogel, ointment or sprays; the most common are hydrogels that can contain lidocaine and prilocaine.\n\nResearchers studied a way of getting these topical anaesthetics into the body more effectively, to see if they could replace needles altogether. They found that applying a tiny electric current — a process called iontophoresis — made the anaesthetics more effective.\n\nThe researchers first prepared the anaesthetic hydrogels with a polymer to help it stick to the lining of the mouth.\n\nThey added two anaesthetic drugs, prilocaine hydrochloride (PCL) and lidocaine hydrochloride (LCL). They tested the gel on the mouth lining of a pig, applying a tiny electric current to see if it made the anaesthetic more effective.\n\nThe anaesthesia was fast-acting and long-lasting. The electric current made the prilocaine hydrochloride enter the body more effectively; the permeation of the anaesthetic through the mouth lining increased 12-fold.\n\nThe study was published in the journal Colloids and Surfaces B: Biointerfaces . — PTI", 
    "section": "national", 
    "title": "Needle-free method to deliver anaesthesia", 
    "subsection": "general", 
    "date": "2016-01-25"
}