{
    "author": [
        "S Anandan"
    ], 
    "text": "Former Admiral Superintendent says FICs quite good\n\nThe Navy has not suspended operations of its fleet of 60-plus fast interceptor crafts (FICs) in the wake of the sinking of a vessel of this class in a fire accident off the coast of Chennai last week.\n\nSources at the Southern Naval Command, which operates 12 of these FICs of which four are stationed at Lakshadweep archipelago, say there is no embargo declared on the operations of these crafts with fibreglass-reinforced plastic (FRP) hulls.\n\nWhile the craft, T-304, sank after its hull suffered extensive damage in fire, the cause of fire will be investigated by a panel constituted for the purpose. “However, preliminary indications do not point to a problem with the procedures being followed. So it will be presumptuous to suspend the operations of the class of vessels,” says an officer.\n\n“The boat, like any other naval ship, comes fitted with all fire-fighting equipment,” he says.\n\nRear Admiral (retd) K. Ravikiran, who was the Admiral Superintendent of the Naval Ship Repair Yard (Kochi) till recently, says the Navy operated five inshore minesweepers with fibre hulls for sanitising the harbour in the 1980s and an FRP shop had been set up at NSRY (K) for their upkeep.\n\n“So, the Navy has enough experience of operating fibre hull vessels. Fibreglass is not exactly fire-resistant, but they do not burn off just like that. I have been aboard the FICs inducted at the Southern Naval Command. They were quite good. While the initial batch delivered by Solas Marine — the Sri Lankan firm that has been contracted to supply 80 such vessels to the Navy — was observed to have some issues, they immediately rectified it,” he says.\n\n“The FICs have hulls similar to that of yachts. These hulls are prone to de-lamination. That apart, there is enough safeguard to save the hull from being exposed to heat. What actually triggered the fire that sank the ill-fated FIC will only be known after the inquiry,” he adds.\n\nThere is enough safeguard to save the hull from being exposed to heat", 
    "section": "national", 
    "title": "No embargo on FIC operations", 
    "subsection": "general", 
    "date": "2016-01-25"
}