{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "Congress MP Shashi Tharoor with social activist Sanchaita Gajapati Raju during the 'Swachh Bharat: The India Story' session at the Jaipur Literature Festival at Diggi Palace in Jaipur on Sunday.— Photo: PTI\n\nCondemning the Modi government’s execution of the Swachh Bharat mission, Congress MP Shashi Tharoor, on Sunday, said that while no permanent solutions towards making the country clean were being sought, it had been reduced to short cuts where the campaigners were seeking solution with photographs and videos of them cleaning the streets.\n\n“This is the problem. We have become a nation that seems to specialise in sound bites and photo opportunities,” Mr. Tharoor said during a session at the ninth ZEE Jaipur Literature Festival, here.\n\nSpeaking at the session titled ‘Swachh Bharat: The India Story’ Mr. Tharoor lauded Prime Minister Narendra Modi for initiating the Swachh Bharat Mission, but ridiculed the government for resorting to short cuts. “We’ve had Prime Minister [Modi] saying that this country needs more toilets than temples… Mr. Modi echoed that to the surprise of some of his Hindutva supporters, but in practice we need a change of mindset and it is the hardest thing to do,” he said after citing the example of a canal cleanup project where he submitted a proposal for a canal cleanup to the Central government but didn't receive any response from the government.\n\n“Mr. Modi had announced the ‘Swachh Bharat kosh’ [fund]. Where is this ‘kosh’? So far I haven't seen a paisa from it for any cleaning activity,” he said.\n\nHe said that the central government must provide the resources that could make up for the inadequate resources in the local areas and at the same time strengthen the hands of local leaders who want to make a difference.\n\nTaking a dig at some of the Bharatiya Janata Party leaders who have been making hateful remarks against people who question the Central governments inaction over issues of religious hatred and killings he said, “You can't talk about Swachh Bharat while condoning bigotry, hatred, prejudice and asking people to go to Pakistan in your public dialogue.”", 
    "section": "national", 
    "title": "No funds back-up for Swachh Bharat mission, says Shashi Tharoor", 
    "subsection": "general", 
    "date": "2016-01-25"
}