{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "For all the claims of the Trinamool Congress (TMC) government about the development of minorities in West Bengal, statistics tell a different story.\n\nData revealed by a query under the Right to Information Act (RTI) Act 2005 shows that the number of Muslims employed with the Kolkata Police has increased only by 0.3 per cent in the past eight years, of which the TMC had been at the helm for the last four years.\n\nThe statistics show that in the Kolkata Municipal Corporation (KMC), the increase in the number of Muslims employed has been a mere 0.32 per cent during the same period.\n\nDetails of the RTI reply accessed by researcher and activist Sabir Ahamed points out that till March 30, 2015, there have been only 2,585 Muslims working in the Kolkata Police where the total strength is 27,388. This brings the percentage of Muslims employed in Kolkata Police to 9.43 percent.\n\nA similar RTI query filed by Mr. Ahamed during the Left Front regime in 2007, (after the report of Sachar Committee reflected the poor status of Muslims in the State) showed that the percentage of Muslims in the Kolkata Police was 9.13 percent then.\n\nDuring that period, the total number of employees in one of the oldest police force in the country was 24,840, of which only 2,267 were Muslims.\n\nThe representation of Muslims in KMC tells a similar story, according to the RTI replies.\n\nTill March 2015, the percentage of Muslims in the KMC was 4.79 percent, which in 2007 stood at 4.47 percent. While in 2015, the number of employees of the municipal body stood at 27,125, with 1,301 Muslims.\n\nThe KMC in 2007 employed 34,731 employees, which included 1,555 Muslims. Mr. Ahamed said the statistics painstakingly compiled over a decade reflect the status of Muslims in West Bengal.\n\n“If this is the tardy pace of increase of Muslim representation in important institutions like the Kolkata Police and the Kolkata Municipal Corporation, then it is going to take more than 60 years for Muslims to have proportional representation in West Bengal,” the researcher said.", 
    "section": "national", 
    "title": "‘Nominal increase in Muslims in govt. jobs during Mamata rule’", 
    "subsection": "general", 
    "date": "2016-01-25"
}