{
    "author": [], 
    "text": "Mr. Obama lauded Prime Minister Narendra Modi for reaching out to his Pakistani counterpart Nawaz Sharif after the Pathankot attack and said: “both leaders are advancing a dialogue on how to confront violent extremism and terrorism across the region.”\n\nVoicing his belief that the India-U.S. relationship can be one of the defining partnerships of the century, he said Mr. Modi shared his enthusiasm for a strong partnership and “we have developed a friendship and close working relationship, including our conversations on the new secure lines between our offices.”\n\nAsked whether the relationship had achieved its full potential, the President replied: “Absolutely not.”\n\nOn the Pathankot attack, he said: “We join India in condemning the attack, saluting the Indians who fought to prevent more loss of life and extending our condolences to the victims and their families. Tragedies like this also underscore why the U.S. and India continue to be such close partners in fighting terrorism.”\n\nThe President was of the view that Mr. Sharif recognised that insecurity in Pakistan is a threat to its own stability and that of the region. After the December, 2014 school massacre in Peshawar, he vowed to target all militants, regardless of their agenda or affiliation. “That is the right policy. Since then, we have seen Pakistan take action against several specific groups. We have also seen continued terrorism inside Pakistan such as the recent attack on the university in northwest Pakistan.”\n\nThe President said that he still believed that “Pakistan can and must” take more effective action against terrorist groups that operated from its territory. “In the region and around the world, there must be zero tolerance of safe havens, and terrorists must be brought to justice,” he said. Mr. Obama said his visit to India last year reflected how the ties between the two countries had been transformed. — PTI", 
    "section": "national", 
    "title": "Pakistan ‘must’ dismantle terror networks, says Obama", 
    "subsection": "general", 
    "date": "2016-01-25"
}