{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Taking note of India’s substantial role as a defence power and the need to keep the lives of its personnel safe, the Supreme Court upheld the government’s policy against having any open advertisements inviting tenders for critical and specialised defence spare parts.\n\nIn a recent judgment, a Bench of Chief Justice of India T.S. Thakur and Justice R. Banumathi set aside a Delhi High Court decision ordering the government to issue advertisements to invite open tenders for the purchase of submarine batteries.\n\n“For defence critical spare parts like submarine batteries, there cannot be any open advertisement inviting tenders. Advertisements are issued calling for tenders only for common use items which are normally available in the open market with a wide range of sources. Submarine batteries do not fall under this category of common use items,” the apex court held.\n\nIn the verdict delivered on an appeal filed by the Centre, Justice Banumathi, who authored the judgment, agreed with the “justifiable reasons” cited by the government to classify submarine batteries as critical and specialised defence product to be procured only from duly approved suppliers under the close watch of the Directorate General Quality Assurance (DGQA). The dispute arose when a company, HBL NIFE Power Systems Ltd, wanted an opportunity to supply the batteries but did not get the green signal from the government, which gave the contract to its usual approved supplier.\n\nNoting that HBL could not claim any vested right to supply submarine batteries, the Supreme Court judgment observed that the lives of defence personnel could not be put at risk merely on the basis of the company’s claim to have the capability to supply submarine batteries.\n\n“If the country wishes to play a substantial role in the Indian Ocean and the Arabian Sea, India must ensure high standards of defence power comparing with the neighbouring countries and it should have modernised submarines. Modernised submarines require submarine batteries with high sophisticated standard under the aegis of DGQA. The government cannot put the lives of its defence personnel and submarine worth crores of rupees to risk simply because the respondent [HBL] claims to have the capability and can supply submarine batteries,” the judgment said.\n\nThe importance of submarine batteries to a submarine cannot be underestimated as it is strategically a vital equipment for submarines, it said.\n\n“The only source of power to a submarine when it dives beyond nine metres into sea/ocean is submarine batteries. Batteries are unique source of electric energy in underwater navigation ... If the batteries fail, submarine will be without power and it can have catastrophic consequences on men as also submarine would be lost,” the apex court pointed out.\n\nAdvertisements\n\nfor tenders are\n\nonly for items of common use, says Supreme Court", 
    "section": "national", 
    "title": "SC upholds ‘no open tender policy’ for key defence spares", 
    "subsection": "general", 
    "date": "2016-01-25"
}