{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Vinayak Damodar Savarkar, for whom the Shiv Sena is demanding the Bharat Ratna, India’s highest civilian honour, will be the subject of a four-volume study by Sridhar Damle, co-author of the seminal work on the RSS “The Brotherhood in Saffron”.\n\nDr. Damle told The Hindu that his volumes on Savarkar would open new aspects of the incident known as L’Affaire Savarkar, when an international case resulted in The Hague after his escape from the British ship Morea docked in Marseilles and bound for Bombay.\n\n“I have found the file containing the minutes of a meeting where the British police have been shown as having a more direct hand in the arrest of Savarkar than previously supposed,” he said.\n\nThe case, tried in the international court, was about Savarkar being handed over to British authorities after being mistaken for an escaping crew member by the French police. Later, when the French discovered that he was a political prisoner, the case went into arbitration at The Hague.\n\nDr.Damle said that through research and documentation, he wanted to look at Savarkar’s place in Indian history, especially the period immediately preceding the Partition and the assassination of Mahatma Gandhi.\n\n“I have found extensive documentation up to 1943, but I am trying to get my hands on files pertaining to 1946-47. After the assassination of Gandhi, documentation is plentiful, but this period remains in the dark,” he said.\n\n“Maxim Gorky wrote an article in Russian on Savarkar, and others in several other languages. Dr.Coutinho from Goa had possession of Savarkar’s manuscript in Marathi on his book on the revolt of 1857.\n\nDr.Coutinho then went on to meet Madame Cama and Maharaja Sayajirao Gaekwad in Paris, Shyamji Krishna Verma in Geneva and Vladimir Lenin in Zurich. His biography is a rich source, and took me three years to locate,” he said.\n\nHe says he has over 10,000 pages of the Savarkar files held by the British government and nearly 16,000 pages of files from an archive in Mumbai. “My work is 95% complete, and I hope to finish it soon,” he says.", 
    "section": "national", 
    "title": "Sridhar Damle’s four-volume work to go into L’affaire Savarkar", 
    "subsection": "general", 
    "date": "2016-01-25"
}