{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "A child’s precious life should not be left to the mercy of a street dog: Bench\n\nIt is essentially the job of a State government to protect public from stray dog attacks and to rehabilitate victims, the Centre told the Supreme Court.\n\nThis is the response from the Union Ministry of Women and Child Development on a notice issued by the apex court seeking details of steps the Centre has taken to protect and rehabilitate victims of stray dog attacks.\n\nThe case in question pertained to a petition filed by Janaseva Sisubhavan, a Kerala-based organisation for rehabilitation of street children, represented by advocate V.K. Biju, which said children were easy targets for stray dog attacks in the State. It said the victims of stray dog bites suffered due to lack of sufficient and timely health care at both government and private hospitals.\n\nThe petition evoked a strong reaction from the apex court Bench led by Justice Dipak Misra, who observed that a child’s precious life should not be left to the mercy of a street dog.\n\n“Children are fundamental embodiment of human race and they deserve protection from any kind of attack by the stray dogs,” Justice Misra observed while taking cognisance of the petition saying that there was a spike in street/stray dog bites incidents from 88,178 per year to more than one lakh per year. The Centre’s response shows that the Kerala government is solely responsible for maintaining safety of the public against stray dogs. The Ministry urged the apex court to “give directions to the Kerala government to take immediate steps to protect the children from the dangerous attacks of stray dogs.”\n\nIt asked the apex court to order the State government to direct its local municipal bodies to quell the danger as per the provisions of the Prevention of Cruelty to Animals Act, 1960.", 
    "section": "national", 
    "title": "States liable to protect public from stray dog attacks: Centre", 
    "subsection": "general", 
    "date": "2016-01-25"
}