{
    "author": [
        "Parvathi Menon"
    ], 
    "text": "An eminent American academic and Subhas Chandra Bose scholar has tried for the past 15 years to access the Nehru papers in the Nehru Memorial Library for material relating to Bose, but has been denied permission by Congress president Sonia Gandhi in whose hands lies the authority to grant or deny scholars permission to use them.\n\n“Unless you have Sonia Gandhi’s permission, you can’t see the documents, even today. If there is some file in Nehru’s papers about Subhas Bose, I cannot see it. Sonia Gandhi has to give permission for people to see the papers of Jawaharlal Nehru when he was Prime Minister — from 1957 to 64. She has approved about five people and I am not one of them,” Leonard Gordon, the author of the definitive book on the lives of the Bose brothers Subhas and Sarat Chandra Bose, entitled “Brothers Against the Raj: A Biography of Indian Nationalist Leaders Sarat and Subhas Chandra Bose,” published in 1990, told The Hindu in a telephone interview.\n\nProfessor Gordon, who taught at the South Asia Institute in Columbia, currently heads the Taraknath Foundation in the same institute. He is in India for a series of talks on Bose and said this in the context of the controversies that the recent declassification of documents relating to the Indian National Army leader by the Narendra Modi government has ignited.\n\n‘Phoney letter’\n\nProfessor Gordon believes that the letter purportedly written by Prime Minister Jawaharlal Nehru to British Prime Minister Clement Attlee in which he refers to Subhas Chandra Bose as “your war criminal” is definitely “phoney”.\n\nAsked why he thinks the Nehru letter is a fabrication, as after all, Nehru referred to Bose as “your war criminal” in a letter to the head of the country that did indeed regard Bose as a war criminal, Professor Gordon said: “I have not yet seen the document first hand, but I have been told that it is full of misspellings and mistakes. Nehru was a meticulous user of English. The document is phoney. We don’t know when it was put there [in the cache of declassified documents]. I have read hundreds of Nehru’s letters in the files on Nehru in the Nehru Library. He would never write such a thing.”\n\nSubhas Bose’s decision to ally with the Germans and Japanese against the British was condemned by the nationalist mainstream in India and alienated Bose further from the Congress leadership. After World War II, however, once the sacrifices of the soldiers of the Indian National Army in Burma (now Myanmar) came to light, Nehru changed his evaluation of the INA, lauding its spirit but still critical of its tactics. Professor Gordon does not expect much new information in the documents, believing that their classification is a case of undue official secrecy.", 
    "section": "national", 
    "title": "U.S. scholar denied access to Bose papers", 
    "subsection": "general", 
    "date": "2016-01-25"
}