{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The colony at Cauvery Nagar at Alakarai village near Musiri is kept spick and span, thanks to the community's decision to eschew open defacation. Every house in the colony has a toilet.— PHOTO: A. MURALITHARAN\n\nWe are proud residents of our village. We have forgotten the practice of open defecation.S. Gokila,Cauvery Nagar.\n\nn spite of intensive campaign against the practice of open defecation, it is still miles away to bring an end to the practice.\n\nHowever, a Dalit colony at Alagarai near Musiri in Tiruchi shows the way in promotion of total sanitation by constructing toilets in all houses much before the ongoing initiative to make open-defecation free villages.\n\nCauvery Nagar, the Dalit colony, in Alagarai may not be the only village in the district to achieve the target of covering toilets in all houses. However, it is the determination of the residents of the Dalit hamlet in avoiding open defecation that differentiates it from other villages. It is the public board that welcomes outside people to the village. It describes the details of participation of various stakeholders in achieving the target of open defecation free village. Interaction with the residents of the hamlet revealed that most of them had given up the practice of open defecation about four years ago itself thanks to the intensive campaign of a group of volunteers belonging to Non Governmental Organisations assisted by the District Rural Development Agency.\n\nA board had been put up after the hectic efforts had ensured construction of toilets in all 50 houses. Though a few old age people found it difficult to shun their age old practice of open defecation in the beginning, the sustained efforts have brought a change in their mindset.\n\nThough the hamlet had achieved the distinction about four years ago, some of the residents have reconstructed the toilets by utilising the subsidy of Rs.12,000 under the Individual Household Latrine scheme of the State and Central Governments.\n\n“We are the proud residents of our village as we have latrine facility in all houses. We have forgotten the practice of open defecation,” says S. Gokila of Cauvery Nagar in Alakarai village.\n\nWe are proud residents of our village. We have forgotten the practice of open defecation.\n\nS. Gokila,Cauvery Nagar.", 
    "section": "national", 
    "title": "A remarkable turnaround", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}