{
    "author": [
        "Special Correspondent"
    ], 
    "text": "GVK EMRI, the operators of the 108 emergency response service and the 104 health helpline, has issued certain guidelines to all its employees, especially ambulance drivers and emergency medical technicians (EMTs), ahead of the elections.\n\nAccording to the circular, the ambulance should contain no product “except those supposed to be in it.” No unauthorised person can enter the vehicle. If an ambulance must be checked, it can be done only under the supervision of the police and in the presence of authorised GVK EMRI officials and poll surveillance officials.\n\nAmbulance drivers and EMTs must check what the victim and the attendant are carrying. All poll-related papers, pamphlets or products must be kept out of the ambulance. If the victim or attendant refuses to comply, the nearest police station must be informed immediately.\n\nThe EMT and driver must also ask the victim and attendant how much money they are carrying and this must be recorded in their Patient Care Report (PCR). If they refuse to disclose the amount, this too must be recorded, and the attendant’s signature taken. The victim and attendant must be instructed not to touch anything in the ambulance.\n\nIn case of unidentified victims, the EMT and driver must hand over all their possessions to the police or to the health worker at the institution they are taken to.\n\nAt the rest facilities of the drivers and EMTs, only their possessions can be kept. There should be no poll-related material anywhere. EMTs and drivers must rest in only designated rest facilities. EMTs and drivers must not carry or display any poll-related material while at work and refrain from discussing or debating politics during work hours.\n\nIf any poster or symbol has been pasted on an ambulance, it will be declared out of use.\n\nAmbulances may be used for rallies or meetings that have prior police permission and may not otherwise park near any poll meeting arenas.\n\nDrivers asked to check what the victim and the attendant are carrying", 
    "section": "national", 
    "title": "Ahead of elections, ambulance drivers, technicians issued guidelines", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}