{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "If the Coimbatore district administration has its way, Pollachi Assembly Constituency in the district could have an all-women team for the election. This means that the polling staff, micro observers, wherever necessary, police personnel and the political parties’ booth agents will be women.\n\nThe administration made the suggestion to political parties a few days ago by citing precedents in a few constituencies in the recently concluded Bihar Assembly election.\n\nSources in the administration said that the election officials mooted the idea to the political parties’ representatives, explained all that was required to make an entire Assembly constituency manned by women staff and then suggested Pollachi.\n\nThey said that Pollachi was an ideal candidate because the previous elections in the Constituency had been peaceful, the number of booths was fewer and so was the number of vulnerable even fewer. An officer in Pollachi said that the Constituency did not have any sensitive booths but five vulnerable booths.\n\nThe total number of booths in the Assembly constituency – 256. The officer said that the other details that worked in Pollachis favour were that the women participation in elections was high and the number of women per 1,000 men was higher than the district average. Plus, the number of women polling staff, as in the district, stood at 70 per cent.\n\nGiven the constituency profile, it would not have been difficult to scale up the number of personnel from 70 per cent to 100 per cent, they added.\n\nThe officer also said that the even the number of women police personnel for the constituency was higher compared to others in the district.\n\nIn response to the district administration’s suggestion, the political parties promised to get back after discussions with their leaders. An AIADMK representative welcomed the suggestion but said it would be difficult for the political parties to respond positively because they would have to ready over 750 women for booth agents at a booth and two relieving agents for each booth in the constituency.", 
    "section": "national", 
    "title": "All-women polling staff suggested for Pollachi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}