{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Election Control Room, established on the Collectorate premises a couple of days back, has received 30 poll-related complaints till 4.30 p.m. on Wednesday.\n\nSources said that most of the complaints received from the public were about graffiti and posters related to the Assembly elections the on walls of public buildings in Tirunelveli and Palayamkottai. “All the complaints have been forwarded to the officials concerned in the flying and static squads for further action,” the sources said.\n\nThree flying squads\n\nThree flying squads and as many static squads have been deployed in Palayamkottai Assembly constituency to check poll code violations.\n\nIn a statement, Returning Officer for Palayamkottai constituency and Corporation Commissioner S. Sivasubramanian said that monitoring of election code violations had been intensified with the deployment of three flying and as many static squads.\n\nThe flying squads were headed by D. Samuel Selvaraj, Assistant Executive Engineer, Thatchanallur Zone of Tirunelveli Corporation; P. Shanthi, Block Development Officer (circle panchayats), Palayamkottai panchayat union, and S. Muthukumarasamy, Block Development Officer (rural panchayats), Palayamkottai panchayat union.\n\n“Each flying squad has four policemen to help the head of the team and will be on duty for eight hours,” Mr. Sivasubramanian said.\n\nThe static squads were headed by D. Karuppasamy, Assistant Executive Engineer, Tirunelveli Zone of Tirunelveli Corporation; P. Ramesh, Inspector, Audit Section of Government Departments, and Dhanaraj Sathyanathan, Technical Assistant, Palayamkottai Zone of Tirunelveli Corporation.\n\n“Each squad, which will be on an eight-hour duty, will have three policemen,” Mr. Sivasubramanian said. He also said that check-posts had been erected at KTC Nagar on Palayamkottai-Tuticorin highway, V.M. Chathram on Palayamkokttai-Tiruchendur highway, Tuckerammalpuram on Palayamkottai-Nagercoil highway and Karungulam on Palayamkottai-Papanasam highway to check vehicles round-the-clock.", 
    "section": "national", 
    "title": "Assembly polls: control room gets 30 complaints", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}