{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Navalpakkam Narasimhan, Shirdi Sai Baba Temple, 16{+t}{+h}St., Thillai Ganga Nagar, Nanganallur, 6.30 p.m.\n\nMahabharatham: Rama Dikshithar, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nGita: R. Aravindan, A1 118/18, Creation Ragas Apartments, 8{+t}{+h}Main Rd., Anna Nagar, 6.45 p.m.\n\nThirumurai: Saemu Mohammed Ali, Valeeswarar Temple, South Mada St., Mylapore, 7 p.m.\n\nRamakrishna Jayanthi: Celebrations, Ramakrishna Math, Mylapore, 7.30 a.m.\n\nCULTURE\n\nCentral Cottage Industries Corporation: Inauguration of exhibition cum sale of sarees by master weavers, Temple Tower, 2.30 p.m.\n\nHandloom Export Promotion Council: Valedictory of 6{+t}{+h}Edition of India International Handwoven fair, Chennai Trade Centre, Nandambakkam, 5 p.m.\n\nGENERAL\n\nDepartment of Ancient History and Archaeology – University of Madras: Prof. T. Balakrishna Nayar memorial endowment lectures, Chepauk, 2.30 p.m.\n\nCentre for Social Innovation and Entrepreneurship: Inauguration of ‘Entrepreneurship awareness camp’, ICSR Hall, IIT Madras, Taramani, 10 a.m.\n\nAnna University and Confederation of Women Entrepreneurs of India – Tamil Nadu Chapter: International Women’s Day programme ‘Equality in Parity’, Tag Auditorium, Guindy, 10 a.m.\n\nMadras Christian College – Department of Philosophy: C.T. Krishnamachari endowment lecture on ‘The dynamics of Gandhian Thought with special reference to Sarvodaya’, 10 a.m.; and Dr. Michael C. Lockwood endowment lecture on ‘The Legacy of History/Heritage for Today’, East Tambaram, 11.15 a.m.\n\nBillroth Hospital: Public awareness campaign on kidneys, Chennai Community Hall, C.P.Ramaswamy Rd., Alwarpet, 6 p.m.\n\nAsha Nivas Social Service Centre: International Women’s day, Kannagi Nagar, Thoraipakkam, 11 a.m.\n\nDravidar Kazhagam: Annai Maniyammar 97{+t}{+h}birth anniversary, Periyar Thidal, Vepery, 6 p.m.\n\nNarcotics Anonymous: Meeting, Keep It Simple Group, St. Joseph High School, Vepery High Rd., Vepery, 7 p.m.\n\nAl-Anon: Meetings, Divine School, Perumal Koil St., Pudur; CSI Inbarasu Aalayam, Tollgate; Puthiya Shakthi Group, Ezhil Nagar 3{+r}{+d}St., Kodungaiyur; Santhome Boys HSS., Santhome; and Philomina MHSS., Injambakkam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Church of Christ, Anna Nagar; Chennai School, Arunachalam St., Chintadripet; Victory Child Development Centre, Muthalamman Koil St., Selaiyur; Church of Victorious Cross, Jawaharlal Nehru Salai, Ashok Nagar; St. Joseph Church, Cholapuram Rd., Ambattur; St. Sebastian Church, Madhavaram; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; C.S.I. Church, Thiruvottiyur; and Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}