{
    "author": [
        "L Renganathan"
    ], 
    "text": "ollowing a public outcry over the manner in which the Mahamaham sacred spots in Kumbakonam are being maintained and in view of the steady flow of pilgrims into the temple town, authorities launched a cleanliness drive on Wednesday. The endeavour is aimed at meeting pilgrim demands and ensure hygiene in the town.\n\nWhile the Mahamaham rituals peaked on February 22 there were complaints that the quality of the water in the Mahamaham tank, the Portramarai tank, and the Chakra Padithurai on the Cauvery were unfit for human use. Temporary toilets put up ahead of the rituals were not neglected and adequate attention was not paid on ensuring public hygiene leaving the visiting devotees in the lurch.\n\nWater flow ebbed in the Cauvery adding to the woes of the civic administrators and turning Chakra Padithurai into a textile dump and forcing the pilgrims to tread cautiously to reach the meagre flow in the middle of the river.\n\nOn seeing the plight of the pilgrims, the officials sought to address the issues at the three spots where more and more devotees were expected to visit in the coming weekends.\n\nIn the Mahamaham tank, the Kumbakonam Municipal officials have deployed conservancy staff to clear the filth even as they intensified the water recycling efforts.\n\nSources in the civic body told The Hindu on Wednesday that the drain out capacity has now been stepped up from 70 to 100 litres per second at the Mahamaham tank and the inflow from the Valayapatti pumping station on the Coleroon has also been increased.\n\nChlorination is being maintained above three parts per million while liquid bleaching powder is being sprayed every half an hour. Copper sulphate powder is being sprinkled on all the four bunds of the tank to remove the stench and fungal infection.\n\nHowever, the drain out effort hit a roadblock with the enormous refilling of water from the numerous springs in the Mahamaham tank that have come back to life after the recent desilting.\n\nApproximately the spring water ensures that the level in the tank rises by at least 5 cm in a day. Interestingly, if the drain out speed was reduced then the springs receded and if hastened they too fountain out water speedily. Hence, the authorities rule out the possibility of cleaning up the tank to the sill level. Temporary toilets around the sacred spots are now being maintained by deploying 50 conservancy staff during the day while the Portramarai tank was being looked into from the sanitation view point.\n\nThe textile waste of the devotees on the Cauvery bathing ghat would shortly be removed, the authorities said.", 
    "section": "national", 
    "title": "Civic staff start clearing the muck", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}