{
    "author": [
        "Aditi R"
    ], 
    "text": "Two college students were arrested on Wednesday night at Anna Salai for snatching a cell phone from a woman at knifepoint.\n\nThe students — identified as Bharat Babu (20) and Sivanandam (20), pursuing B.Com. (Corporate) and B.A. Philosophy respectively at Pachaiyappa’s College — were on a motorbike when they spotted the woman standing alone outside a retail showroom. They took out a knife and demanded that she hand over her cell phone. “Alone and afraid, she gave in. But she complained to us after the boys left,” said a police official of the Chintadripet police station. The students were taken into custody and the college authorities were informed. “We will be taking strict action against them,” said P. Gajivaradhan, Principal of Pachaiyappa’s College. We have been conducting frequent counselling sessions for students, we hold seminars and invite speakers to motivate the students. But, unfortunately, such incidents continue to happen,” he said.\n\nIn the past one year, officials claim to have received around 50 complaints of bad behaviour by students; and six of them have been suspended.\n\nThe Principal said that the students would first be counselled, but if they continued such behaviour on or off campus, strict action would be initiated.\n\nOn the issue of students getting involved in robbery, academicians emphasise that a holistic approach to education would help check such aberrant behaviour.\n\n“Students who get into trouble are mostly not exposed to any progressive, cultural or extracurricular activity at their respective colleges, apart from sports. The cultural degradation they face outside is prevalent on the campus too; they have no one to guide them and eventually end up without no aspirations,” A. Marx, retired professor-turned- activist, said. \"It is a lot under control today compared to past years. But it still can be brought down using the right means,” said Gnanadevi, a first year M.Sc. student from Pachaiyappa’s.\n\nThey took out a knife and demanded that she hand over her cell phone", 
    "section": "national", 
    "title": "College students snatch phone from woman at knifepoint", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}