{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sixty eight Dalit families from Kuravakudi near Usilampatti, who have been fighting for more than 16 years to get the land allocated to them, sent a petition to Madurai Collector on Wednesday urging him to honour the order of Madurai Bench of Madras High Court.\n\nThe HC Bench on January 29, 2016, had ordered the Collector to either sort out the issues regarding the land already acquired by Adi Dravidar Welfare Department (ADWD) for the 68 families or provide alternative land to them within eight weeks. “Six weeks are already over but the district administration has not taken any steps so far in this regard,” said V. Sasikala, an activist, who accompanied the Dalit families.\n\nThe land, measuring 1.26 hectares, was acquired in Kuravakudi by the ADWD way back in 1998 under Tamil Nadu Acquisition of Land for Harijan Welfare Schemes Act. It was later measured and allocated to 68 landless families in the village.\n\nHowever, the trouble started when a non-Dalit family in the village approached the court alleging that a portion of the acquired land was theirs and the ADWD acquired it without following the due process.\n\nThough the family obtained an order in 2007 quashing the land acquisition notification, a police case was registered later December 2015 as the family allegedly tried to get back the land by forging documents.\n\nMeanwhile, the Dalits filed a writ petition in the HC Bench in which the recent ruling in January 2016 was made.\n\nWhen contacted, a senior official from the district administration said that it will not be possible to allocate land to them as the Model Code of Conduct had come into force with the announcement of elections. “Unfortunately, they need to wait till elections. We will make the arrangements as soon as the elections are over,” the official said.", 
    "section": "national", 
    "title": "Dalit villagers ask Collector to honour court order", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}