{
    "author": [], 
    "text": "SALEM\n\nRamakrishna Mission Ashram: Bhagavan Sri Ramakrishna Jayanthi, homam, 10.30 a.m.; discourse by Swami Yatatmananda, 11.30 a.m., by Narai S. Nellaippan, 6.30 p.m.\n\nEmployment Provident Fund Organisations: PF grievances day meeting, for subscribers, Sub-Regional office premises, Swarnapuri, 10.30 a.m. to 1 p.m.; employers 3 p.m. to 4 p.m.; exempted establishments, 4 p.m.\n\nDepartment of Commerce of Periyar University and NABARD: International conference on ‘corporate and business response to climate change: from awareness to adoption’, panel discussion, 10 a.m.; technical sessions, 11.45 a.m. and 2 p.m.\n\nSri Ganesh College of Education: Training programme on role of youths in the development of the country, A. K. P. Kathirvel, chief guest, M. Thangavel, Correspondent, presides, 10.30 a.m.\n\nThe Kavery Educational Institutions, Mecheri: Placement and training cell, on-campus drive, 10 a.m.\n\nSalem College of Engineering and Technology: Department of Training and Placement, on-campus drive by Energy Efficient Lights, Bengaluru, R. A. Sankaran, principal, presides, 10 a.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Thangam Pattu Maaligai showroom, 10 a.m. to 8 p.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nNAMAKKAL\n\nGnanamani Educational Institutions: Campus recruitment drive by Pothigai Power Solutions Private Limited, Chennai, T. Arangannal, Chairman, presides, 10 a.m.\n\nPaavai Engineering College: Seminar on industry expectations from engineering students, Hareni Jagadeesan, Centre Head, Livewire, Salem, chief guest, 10 a.m.\n\nGnanamani College of Engineering: All India conference on “emerging and sustainable technologies for infrastructure, communication, computing and electrical network developments”, P. Shanmugam, Senior Principal Scientist, Central Leather Research Institute (CLRI), Chennai, chief guest, 10 a.m.\n\nPaavai Polytechnic College: NSS special camp, Panchayat Union Elementary School, Kurukkupuram, 3 p.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Cooptex showroom, 10 a.m. to 8 p.m.\n\nERODE\n\nKongu Engineering College: Inauguration of ENTHUSA’'16 - Cultural Event, 9.35 a.m.\n\nNandha Engineering College: Legal awareness on ‘Women Related Laws’, talk by T. Malar Valantina, Chief Judicial Magistrate, Erode, and G. Bhuvaneshwari, First Additional Sub Judge; V. Shanmugan, Chairman, Sri Nandha Educational Trust, presides, 9.30 a.m.\n\nErode Sengunthar Engineering College: ISTE - Knowledge-Sharing Session on 'Gi-Fi Giga Byte Wireless Technology' by G. Lalli, Assistant Professor, 4.40 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}