{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "Whoever succeeded in killing him was to become caste outfit leader\n\nSuperintendent of Police Ashwin M. Kotnis with the police team deployed at the Government hospital after the gruesome murder of two by a gang in Thoothukudi, on Wednesday.— Photo: N.Rajesh\n\nThe armed gang that killed two persons in an attempt to murder Subhash Pannaiyar in a farm near Pazhayakayal on Tuesday was lured with the promise that anyone who succeeded in killing Subhash would be made the leader of Devendra Kula Velalar Kootamaippu, according to police.\n\n“Everyone in the gang was instigated by the caste-based outfit with the promise that whoever killed Subash Pannaiyar, a relative of slain gangster, Venkatesh Pannaiyar, would become the leader of the kootamaippu,” a police source said.\n\nPrime accused\n\nVenkatesh Pannaiyar was the prime accused in the case of murder of C. Pasupathi Pandian, founder of the koottamaippu.\n\nSuperintendent of Police Ashwin M. Kotnis told The Hindu said it is suspected that the members of the gang are from Thoothukudi and Tirunelveli. Four companies of the Tamil Nadu Special Police had been deployed in Muthaiyapuram, Authoor, Arumuganeri, Deivaseyalpuram and its surrounding areas as preventive measure, the SP said.\n\nThe Authoor police filed have a case under Sections 147, 148, 302 of IPC and Section 3 of the Explosive Substances Act based on a complaint lodged by G. Ashokan (48) of Mullakadu, a worker in the farm.\n\nThe Pudukottai police have also filed a case under Section-302 of IPC in connection with this incident based on a complaint by Shanmugaraj (35), Village Administrative Officer, Deivaseyalpuram.\n\nA post-mortem examination was done on the bodies of M. Arumugasamy (32) of Tirunelveli and A. Kannan (52), who were killed in Tuesday’s attack, at Thoothukudi Government Medical College Hospital on Wednesday.\n\nMembers of the gang suspected to be from Thoothukudi and Tirunelveli: SP", 
    "section": "national", 
    "title": "Gang lured to attack Subhash Pannaiyar, say police", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}