{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Making it clear that though the jurisdiction of the court over the Election Commission exists and it is not the function of the court to interfere with the working of the Commission, which is an independent body with best reputation to carry out the electoral process fairly, the Madras High Court closed a plea moved by Dravida Munnetra Kazhagam (DMK) on inclusion of over 57 lakhs bogus voters in the updated electoral roll.\n\nThe First Bench headed by Chief Justice S.K. Kaul on Wednesday closed the petition moved by the organisation secretary of the DMK, R.S. Bharathi, seeking to appoint Central government officials as electoral registration officers and booth-level officers in all the constituencies to purify the entire voters list, after the Additional Solicitor General assured that action was being taken on the representations from the petitioner.\n\nWhen the petition came up for hearing, senior counsel for DMK P. Wilson submitted that there was a software which can check the list and delete duplication, a copy of which was handed over to the Commission. Recording the submission, the Bench said, “We do believe that if the process achieves the result, the Election Commission may examine and utilise it.”\n\nThe Additional Solicitor General further submitted that the process of additions and deletions is a continuous one, which goes on till the last date of withdrawal of candidates.\n\n“However, the Commission has proposed to complete the exercise by April 19, 10 days before the statutory last date,” he said.\n\nThough best care would be taken, there is no 100 per cent error-free method the Commission can have in such a large exercise. However, even if a name of a voter appears in more than one constituency, the person is entitled to cast only one vote. Once the ink mark is on the finger of a voter, he or she cannot go to another constituency, he said.\n\nClosing the petition, the Bench emphasised that the court would not like to encourage repeated monitoring of the electoral process on aspects which are to be dealt with by the Election Commission unless some violation of any normal law is specifically pointed out. “This is also a caution for other litigants who may be contemplating filing of petitions,” the Bench said.\n\n‘It is not the function of the court to interfere with the working of the Election Commission’", 
    "section": "national", 
    "title": "HC closes DMK’s plea to ‘purify’ voters list", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}