{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here on Wednesday modified an order passed by a single judge on February 19 directing O. Raja, brother of Finance Minister O. Panneerselvam, to appear before a trial court on all days of hearing in a case registered against him on a charge of abetting a Dalit temple pujari, S. Nagamuthu of Theni district, to commit suicide on December 7, 2012.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam modified the last paragraph of the single judge’s order and held that the accused could file petitions before the trial court in Dindigul, under Section 205 or 317 of the Code of Criminal Procedure, to dispense with his appearance whenever necessary and such applications should be considered by the presiding officer on merits.\n\nThe Bench passed the order while disposing of a petition filed by the accused seeking leave of the court to file a writ appeal against the single judge’s order since he was not a party to the writ petition in which the direction was issued. Justice S. Vaidyanathan had passed the order while disposing of the petition filed by the victim’s father to appoint advocate B. Mohan as Special Public Prosecutor.\n\nChallenging the correctness of the order, Mr. Raja’s counsel R. Gandhi contended that the judge ought not to have passed an order against his client when the latter was not a party to the writ petition at all. Pointing out that the SPP had already been appointed, he urged the court to modify only a portion of the order which forces the accused to appear on all dates of hearing without fail.\n\nThe single judge had also ordered the Principal District and Sessions Court in Dindigul to conduct the trial on a day-to-day basis and not adjourn the matter beyond two working days at any point of time. The case had been booked under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989 too apart from the charge of abetment to suicide.", 
    "section": "national", 
    "title": "Hight Court modifies order against O. Raja", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}