{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "A small group of women in Ramalinga Nagar (South Extension) has been setting an example of civic management for nearly 16 years by getting actively involved in maintaining the cleanliness and security of their street.\n\nStarted by long-time residents Damayanthi Kanagaraj and Kalyani Alagusundaram in 2000, the Ramalinga Nagar South Extension 5th Cross Welfare Association represents 50 families and the small commercial enterprises on the street.\n\nWhile it began initially as a means to restructure the drainage of the street, the association today employs its own sweeper and a night watchman who works on eight-hour shift from 9 p.m. to 5 a.m. The group pools in money to pay their salaries.\n\nWith a line-up of shady Indian beech trees (‘punga maram’) outside each home (another association effort), it is no wonder that the 5th Cross looks a little better cared for than the others in the neighbourhood.\n\n“When we came here in the late 1990s, the road was not properly laid, and it was all shabby,” Ms. Kanagaraj told The Hindu . “Ms. Kalyani and I didn’t get much support in the beginning when we suggested that the residents should unite to do something. We used to be turned away at the gate when we came around to ask for the membership fees.”\n\nWhile the initial fee was Rs. 25 per house, it currently stands at Rs. 250 for building owners, and Rs. 125 for tenants. Each association member’s contact information is listed in a directory.\n\nMs. Kanagaraj continues to host meetings at her home and has been unanimously named the group’s president. “The men are too busy to be involved in the daily work of the association, but they support our efforts,” she says.\n\nThe association decided to appoint a watchman after a few burglaries were reported in the adjoining areas. “Once again, many residents were initially reluctant, but then came around to contribute,” said Ms. Kanagaraj.\n\nFormally registered in 2010, the association hosts a “street party” for the residents on occasions such as Women’s Day and festive holidays, where members contribute towards all expenses. Health awareness talks, craft classes and product promotions are organised regularly.\n\nThe association has got a contingency amount of Rs. 20,000 collected from building owners on the street.\n\nWhile their initiative has drawn kudos from visitors and residents of the neighbouring streets, the association members have not been able to persuade authorities to clear up the area near the water tank to be converted into a public park. The 5th Cross may be clean, but the same cannot be said of the arterial road where commercial establishments have started dumping their waste in the inner street rubbish skips.\n\nWith a membership that ranges from women in the mid-20s to those in their mid-70s, the association is often a proxy family for many, said Ms. Sivagami Srinivasan. “There is no generation gap in our group, and we are very tolerant about each other’s religious and cultural practices,” she said.\n\nPersistent efforts by a group of women makes Ramalinganagar 5th Cross stand apart in the heart of the city", 
    "section": "national", 
    "title": "Home-makers join hands for a clean neighbourhood", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}