{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The settlement to workers of the Hindustan Unilever Ltd (HUL) thermometer factory in Kodaikanal has only brought closure to one half of the problem. The larger aspect of cleaning up the mercury contamination on the hills remains, with the Union Environment Ministry is considering making standards more stringent than what the company has proposed for the ecologically sensitive site.\n\nThe proposed guidelines for assessment and remediation of contaminated sites in India, drafted under the National Programme for Rehabilitation of Polluted Sites in March 2015, a two-volume copy of which is available with The Hindu, provide specific standards for remediation of mercury-contaminated sites.\n\nFor both agricultural and residential areas, the document provides a general mercury clean-up standard of 6.6mg/kg of soil. In August 2015, HUL, in a Detailed Project Report (DPR) submitted to the Tamil Nadu Pollution Control Board (TNPCB), had pegged the clean up standard it wanted to adhere to at 20mg/kg of soil in Kodaikanal.\n\nIt is significant to note that not only does the factory site have residential areas around it, the place also has a highly sensitive and pristine forest area all around.\n\nIn a letter to the TNPCB in December 2015, Dilip. B. Boralkar, Member of the Supreme Court Monitoring Committee on the issue, went extensively into the remediation process and the various reports that have come out on the HUL factory situation. As an opinion, Dr. Boralkar stated that a 6mg/kg standard should be proposed “irrespective of land use pattern, considering the possible mercury migration path, its bioaccumulation in the ecosystem and its possible entry into the food chain which could result in acute or chronic neurotoxicity.”\n\nHe had further stated that even this standard should not be construed as final. “Should long-term post-remediation monitoring indicate that the site still remains an active source of mercury loading into the environment, further measures for amelioration shall be undertaken by the occupier [HUL],” the letter categorically stated and flagged the fact that post cleanup monitoring had not been suggested as necessary by any organisation which had gone into the issue.\n\nSignificantly, the Environment Protect Act 1986 and Rules thereunder stipulate permissible mercury level in the environment as 0.01 mg per litre of water, while it is 0.001/litre as per BIS standard for drinking water according to IS 105000: 2012. This is a crucial indicator since activists have consistently claimed contamination of the Kodaikanal lake. HUL has vehemently denied this.\n\nThe Ministry’s guidance document also clearly states that the community had the right to be involved in decisions, including remediation, which affect them. How much the community in Kodaikanal was involved while arriving at the standard of 20mg/kg of soil is a vital question in this context. The guidance documents are still under the consideration of the Ministry.\n\nCentre's draft norms more stringent than\n\nwhat the company has proposed", 
    "section": "national", 
    "title": "HUL: Focus on Operation Clean-Up", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}