{
    "author": [
        "R Sivaraman"
    ], 
    "text": "He will take a call on contesting elections after consulting people in his constituency\n\nEstranged Congress MLA Malladi Krishna Rao representing the Yanam constituency on Wednesday asserted that he is still with Congress and will take a call on contesting the elections after consulting the people of his constituency.\n\nMr. Rao, who was the first representative from Yanam to become a Minister in Union Territory cabinet in 2007 and has made the enclave a virtual pocket borough, has been avoiding party platforms after 2014 Parliamentary elections.\n\nIn the beginning of 2015, Mr. Rao declared that he and his followers would work for the victory of the All India NR Congress (AINRC) in 2016 Assembly elections. His overture towards AINRC was seen as a quid-pro-quo for the Rajya Sabha Seat that fell vacant in October 2015.\n\nOn the contrary, AINRC president and Chief Minister N. Rangasamy decided to field N. Gokulakrishnan as AIADMK candidate.\n\nMeeting with AIADMK secretary\n\nOn Wednesday, AIADMK Puducherry unit secretary P. Purushothaman met Mr. Rao and the meeting triggered speculations in the political circles.\n\nDownplaying the purpose of the meeting, Mr. Purushothaman said, “I went to meet Mr. Rao after hearing that he was unwell. There is no political significance attached to the meeting. When I was with him, a few photographers rushed to the spot and took snaps. Thus it became news.”\n\nChief Minister N.Rangasamy also had called on him on Tuesday.\n\nTalking to The Hindu , Mr. Rao said that leaders from AIADMK, DMK and BJP spoke to him. Pradesh Congress leader A. Namassivayam, senior Congress leader V. Narayanasamy and former minister M.Kandasamy met him.\n\n“As on today, I continue to be in Congress party. I have not yet taken any decision about contesting the forthcoming elections. I will convene a public meeting in my constituency . Depending on the public response , I will take a call on contesting the election,” said Mr. Rao.\n\nMr. Rao rose from scratch and was close to former Congress leader and now AIADMK functionary P.Kannan a few years ago.\n\nWon four times\n\nHe contested in Yanam constituency during 1996 elections. Since then he has contested and won the elections four times in the constituency while opponents had to forfeit deposits.\n\nMr. Rao resigned his post in 2000 so as to enable the then Chief Minister P. Shanmugam to contest there. Mr. Rao won twice as an independent and twice as Congress candidate.", 
    "section": "national", 
    "title": "I am still with Congress, says Malladi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}