{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Protest against the Centre's proposed excise duty on gold jewellery\n\nJewellery shops across Vellore downed the shutters as part of the nation-wide indefinite strike on Wednesday.- Photo: C. Venkatachalapathy\n\nAbout 500 jewellers and 3,000 pawn brokers have shut down their shops across the district in protest against the Centre’s move to impose one per cent excise duty on gold jewellery. This was part of the nation-wide indefinite strike by jewellers.\n\nV.S. Ramesh Kumar, secretary of Vellore District Jewellers Association, said there was no response from the Central government after jewellers went on a five-day strike following the budget announcement to levy excise duty.\n\n“We were not called for talks. Jewellers met leaders of the BJP in Delhi, but there has been no action from the government. Hence, jewellers across the country have decided to go on an indefinite strike,” he said.\n\nOn Tuesday night, Vellore town jewellers, pawn brokers and representatives of corporate companies participated in an urgent general body meeting of the association at Main Bazaar.\n\n“We discussed the difficulties that jewellers will face if the excise duty is levied. We also discussed the national body’s decision to launch an indefinite strike. We decided unanimously to take part in the strike from Wednesday,” he added.\n\nHe said there are about 120 jewellers and 400 pawn brokers in Vellore town alone, while there are 450 to 500 jewellers and 3,000 pawn brokers across the district.\n\n“Imposing the excise duty will cause plenty of problems for jewellers. Smuggling activities will increase, and the cost of gold will also go up. Goldsmiths will not be able to carry on with their business,” he added.\n\nWhile the government is assuring that jewellers will not face any hassles, the law includes provisions that pave way for arrests, seizures and 45 per cent penalty, he said.\n\n“Nearly 15 days ago, we also protested against mandatory PAN cards for transactions of Rs. two lakh and above. Again, the government has not responded to our demand for its withdrawal.\n\nWe will continue the indefinite strike till our demands to rollback the one per cent excise duty and mandatory PAN cards are fulfilled by the government,” Mr. Ramesh Kumar said.", 
    "section": "national", 
    "title": "Jewellers join nation-wide strike", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}