{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "More than 300 jewellery showrooms in Tirunelveli and Palayamkottai remained closed on Wednesday as the traders resumed their indefinite strike.\n\nSince the jewellery showroom owners’ talks with the Union Government officials on withdrawing the recently imposed one per cent excise duty failed to make any headway, the traders announced that they would resume the strike which remained suspended for the past two days.\n\nAfter staging a demonstration for a while in Tirunelvei Town that houses more than 75 per cent of the jewellery showrooms in the city, the owners organised a meeting in which it was resolved that the protest would continue until the excise duty was withdrawn.\n\nExpressing their solidarity with the protesting jewellery showroom owners, the goldsmiths also closed their manufacturing units on Wednesday.\n\nNagercoil\n\nHundreds of small and big jewellery shops and a large number of goldsmiths across Kanyakumari district resumed their strike on Wednesday.\n\nP. Narayanamurthy, secretary, Jewellers’ Association of Kanyakumari District, said that the proposed one per cent excise duty, which, he said, would burden buyers as they have to pay at least Rs. 250 per sovereign, in addition to the one per cent Value Added Tax. Twenty office-bearers of the association would take part in a rally proposed to be taken out in New Delhi on March 11, he said.\n\nThe jewellers closed their shops from March 4 to 6 and have resumed their indefinite strike. Earlier, on February 11, the jewellers closed shop in protest against the mandatory reference of PAN number for purchase of gold jewellery worth Rs. 2 lakh and above.\n\nThoothukudi\n\nAs many as 97 jewellery shops in Thoothukudi remained closed on Wednesday.\n\nA.V.M. Mani, president, Thoothukudi Jewellers’ Association, said that from 1968 to 1972, Gold Control Act was in force, still excise duty was not levied. There were around 300 jewellery shops in the district, he said.", 
    "section": "national", 
    "title": "Jewellers resume indefinite strike", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}