{
    "author": [], 
    "text": "Colleges organise MEETINGS for students\n\nSushmita Ayyagari, a commerce student of the PSG College of Arts and Science, learnt a few things about Union Budget 2016. She got the opportunity to spend some time learning about how the Union Government prepares the budget and also how it apportions money to various schemes because her college had recently organised a budget-related programme.\n\nS. Vidhyaa Sagar, a second year commerce student of the same college, understood how the Government prepared the budget, its income and expenditure and more importantly, deficit. He says the exercise helped him also understand the impact of budget.\n\nThe College’s International Business HoD, R. Krishnakumar, says that as future financial planners the students ought to know how the government spends the money and how its taxes affects individuals and corporate sector.\n\nIt was with this idea that the college had roped in chartered accountants, non-government organisation representatives, industry representatives and others to talk to the students.\n\nIt also asked the students to study and compare the 2015 and 2016 budgets and then make preparations.\n\nStudent Ayyagari also says that in the process of studying the budget, she got to learn a few financial terms and relate to what she has been studying.\n\nSri Krishna Institute of Engineering and Technology’s MBA Director C. Ramakrishnan says that for management students the Union Budget presentation is an important event because they will have to learn how it will impact products, services, wages, etc.\n\nAs future managers it will help them decide on prices of products, plan their companies expenditure and social sector spending.\n\nHis college has organised a Budget analysis exercise for the students. And, this exercise is not about just studying the Budget but also correctly interpreting it.\n\nKarthik Madhavan", 
    "section": "national", 
    "title": "Learning more about Union Budget", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}