{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Kandapuranam’ by Shanmuga Tirukkumaran, Railway Colony, 7.30 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Thayumanavar’ by D. Sundarakannan, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Tirukkural’ by S. P. Balakrishnan, Sakthi Velammal Nagar, S. S. Colony, 5 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nAmerican College: M. Davamani Christober, Principal, inaugurates seminar on “Careers in the US healthcare industry;” R. Raja Govindasamy, Director, Mannar Thirumalai Naicker College, and K. Venkata Giri, assistant vice-president, iSource ITES, address, Seminar Hall, 10 a.m.\n\nMadura College: Seminar on ‘Tirukkural,’ K. Muthuvel, Head, Department of Tamil, presides, Seminar Hall, 10.30 a.m.\n\nThiagarajar College of Engineering: 58{+t}{+h}College Day; Ravi P. Singh, Secretary General, Quality Council of India, addresses; Karumuttu T. Kannan, correspondent, presides, 11 a.m.; Ajit Sabnis, president, Association of Consulting Civil Engineers, inaugurates symposium on “Smart Cities in India: challenges and constraints,” K. S. Auditorium, 2 p.m.\n\nThiagarajar College: K. Ramachandran, former Chairperson, School of Physics, Madurai Kamaraj University, speaks on “Why FT-IR for nanomaterials?” M. Eyini, Principal, presides, Kabilar Hall, 10 a.m.; valedictory function of NSS camp; N. Nallakaman, NSS Coordinator, MK University, addresses, Government Higher Secondary School, Puliyankulam, 10.30 a.m.\n\nFatima College: K. Pitchumani, Director, Centre for Green Chemistry Processes, MK University, delivers Ms. N. Shakunthala endowment lecture on “Biomimetic chemistry,” Jubilee Hall. 11 a.m.\n\nSourashtra College: Venkata Raman Balaji, president, ZF Electronics TVS, speaks on “Recent trends in computer applications,” L. P. Ramalingam, Principal, presides, Silver Jubilee Hall, 9 a.m.\n\nNadar Mahajana Sangam S. Vellaichamy Nadar College: R. Viswanathan, Head, Department of IT, Arul Anandar College, speaks on “Current trends in information technology;” S. Alagarnathan, Principal, presides, Smart Classroom, 9 a.m.\n\nVelammal College of Engineering and Technology: KR. Gnanasambandan, Director, Athma, inaugurates entrepreneurship awareness camp, Department of EEE, 10 a.m.\n\nVickram Polytechnic College: V. Palani Selvam, Principal, inaugurates campus recruitment drive, Enathi, 9 a.m.\n\nMadurai Management Association: World Non-Smoking Day; Dheep, Director, TopKids, addresses, Fatima College, 3 p.m.\n\nLaws Centre: Seminar on ‘IPC Section 124 A;” Bhavanandhi, former student of JNU, and K.S. Murali, advocate, address, 10 Classic Garden, Ulaganeri, 6 p.m.\n\nDhan Foundation Tata-Dhan Academy: Fourth convocation; Harsh Kumar Bhanwala, Chairman, Nabard, addresses, T. Malaipatti, 4 p.m.\n\nAlcoholics Anonymous: Meeting, Rosary Church, Town Hall Road; Kalangarai Vilakkam Church, Anuppanadi, and Dheep Hospital, K. Pudur, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}