{
    "author": [
        "L Renganathan"
    ], 
    "text": "The Mahamaham tank, which just two weeks ago was the destination for several lakhs of pilgrims on the occasion of masimaham , stinks. So does the Portramarai tank nearby while the Chakra Padithurai on the banks of the river Cauvery is a mess.\n\nThousands who are still thronging the Mahamaham sacred spots are putting up with the apathy unable to do anything else as they go through the motions of their spiritual pursuit. More than 60 lakh pilgrims have visited Kumbakonam for Mahamaham-related rituals since February 13 when the sacred flag hoisting took place in temples associated with the event.\n\nGut-wrenching stench hits the pilgrims even as they prepare to enter the Mahamaham tank from the eastern side late on Monday when Mahashivaratri was celebrated and thousands of devotees were waiting on the eastern bund to enter the tank. “I got wind of it as I went down the flight of steps to reach the water front. Muddied waters added to my woes and with the water to just the height of my ankle, I waded for sometime wondering whether to take a dip on just sprinkle on my head and for a moment even thought of getting out of the place. Finally, sanctity got the better of sanitation and I took the holy dip,” says P. Panneerselvam, a devotee from Samayapuram Tollgate, Tiruchi.\n\n“Portramarai tank is wallowing in neglect,” says T. Vellaiyammal who has come with his son from Tirupur. The condition of Mahamaham tank is better compared to Portramarai tank and Chakra Padithurai. While Portramarai tank is filthy, the bathing ghat on the banks of the Cauvery is swathed in outfits left behind by the devotees, leaving hardly any space to reach the small stream of water flowing, Ms. Vellaiyammal paints a grim picture.\n\n“The official machinery did not anticipate the weekend surge of pilgrims even after Mahamaham was over,” says secretary of All Traders’ Associations of Kumbakonam V. Sathyanarayanan.\n\nThe Portramarai tank is wallowing in neglect.”\n\nT. Vellaiyammal,resident of Tirupur", 
    "section": "national", 
    "title": "Mahamaham tank polluted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}