{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Centre is going out in a big way for the overall development of rural areas and is in need of enormous funds for implementing various projects. There is an urgent need for the generation of revenue mainly through the direct taxes for the same, said M. Tirumala Kumar, Principal Commissioner of Income Tax.\n\nIncome Tax payers are the largest share holders of the Centre’s revenue. The government has of late taken effective initiative to bring more eligible people under the Income Tax net for further augmenting its revenue, Mr. Tirumala Kumar said while speaking at the ‘Top Tax Payers Meet’ organised by the Income Tax Department here on Wednesday.\n\nCollection\n\nThanks to the more administrative reforms, the Income Tax revenue which stood at a bare minimum of Rs. 90 crore at the time of Independence, rose to Rs. 50,000 crore by the end of last century.\n\nThanks to the various initiatives, the revenue from the Income Tax collection has touched a whopping Rs. 7 lakh crore at present.\n\nBut much more has to be done to get more voluntary compliance to further hike the IT revenue collection.\n\nAccording to the vision document of the country, of the 20 crore people who have secured PAN cards, only 3.5 crores are filing returns.\n\nThe latest economic survey says only four per cent of the voters in the country pay the income tax.\n\nThe tax payers figures should have been 23 per cent. According to the survey, 19 per cent of the eligible tax payers are not paying even a single paisa as tax.\n\nWhile commending the tax payers, the economic survey points out that of the four per cent taxpaying public, only 15 per cent disclose the true income.\n\nThe rest 85 per cent of the tax payers are not sharing their true income to the department.\n\nMr. Tirumala Kumar said that the department is reaching out to the tax payers to gain first hand information from the tax payers to know their expectations and also to seek their cooperation for generating more revenue.\n\nThe department has been conducting special interaction sessions with the tax payers and has already completed such exercise in centres such as Coimbatore, Erode, Namakkal and Hosur.\n\nK. Parashivaiah, Commissioner of Income Tax (Appeals), said that the income tax revenue played a key role in the nation building and called upon the tax payers to motivate other eligible people too to go for voluntary compliance of the IT.\n\nS. Balasubramanian, Income Tax Officer, said that income tax revenue of Rs. 476 crore was collected in Salem region last year and it has been targeted to collect Rs. 569 crore during the current year.\n\nN. Sukumar, Joint Commissioner of Income Tax, V. Gajendran and F. A. Yasser Arafat, both Assistant Commissioners of Income Tax, participated in the event and clarified the various doubts raised by the tax payers.", 
    "section": "national", 
    "title": "‘Pay tax for welfare programmes’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}