{
    "author": [
        "Staff Reporter"
    ], 
    "text": "He reaches out to the urban poor in 69 cities in India, and 37 countries\n\nG. Viswanathan, chancellor of VIT University, presents the Person of the Year Award to Jockin Arputham, founder of National Slum Dwellers Foundation on Wednesday. —Photo: C. Venkatachalapathy\n\nHe was a school drop-out, a migrant and a slum dweller. But sixty- eight-year old Jockin Arputham wanted to make the lives of urban poor better. His story is not one of rags to riches, but a journey full of rich experiences. He reaches out to the urban poor in 69 cities in India, and 37 countries.\n\nFounder of the National Slum Dwellers Foundation (NSDF), Mr. Arputham, on Wednesday received the “Person of the Year (2015) Award” at VIT University. Born in KGF, Karnataka, he dropped out of school after class VII and migrated to Mumbai where he lived in a slum. He started to educate children and women in slums.\n\n“I work in 37 countries bringing slum dwellers together. I am a slum dweller and, my university is the slum. For any development, we need three ingredients – money, information and communication,” said Mr. Arputham, who was one of the Indian nominees for the Nobel Peace Prize last year. He added that he started to work with women after understanding that women can be strengthened with these ingredients.\n\n“We have been running police panchayats in which we ask police to come to the slums so that civil matters can be sorted out,” he pointed out.\n\nSpeaking on the occasion, Prateep V. Philip, additional director general of police, Economic Offences Wing, Tamil Nadu, stressed the need for identifying talents in students, and develop it to the fullest extent possible.\n\n“Every student excels in one dimension of life; it could be a skill or ability. There is a need to give more opportunities, time and space to develop this dimension,” he said.\n\nNoting that inequality was increasing in the country, G. Viswanathan, chancellor of VIT University, said, “Education, especially higher education for all children, can be the force that can stop this. ”\n\nHe said eight crore people needed houses in the country, but this should not be at the cost of agricultural lands. “It is worrying that every year we are losing one lakh hectares of agriculture lands because of urban growth. We need to bring about a balance. The Central and State governments should evolve a policy to see that agricultural lands do not shrink,” he said.\n\nAmong others, G.V. Selvam, vice president and Anand A. Samuel, vice chancellor of VIT were present.", 
    "section": "national", 
    "title": "Person of the Year Award given to NSDF founder", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}