{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "On Wednesday, officials in charge of enrolling eligible persons as voters in the Pollachi and Valparai Assembly Constituencies, ensured that all the eligible students in the Bharathiar University Arts and Science College in Valparai, who were hitherto not voters, were included in the voters’ list.\n\nThe officials sent a special team which sat with the college administration and enrolled all the 153 identified students after the latter furnished proof of identity, residence and other documents.\n\nA senior officer who was part of the team said that after informing the college management about the drive and the students about the documents they needed to furnish, the team visited on Wednesday to complete the process.\n\nThe team enrolled the students online. It would ensure their inclusion and also provide them with the electors photo identity card.\n\nThe completion of the process of inclusion of eligible young persons as voters in the Valparai college takes the number of 100 per cent enrolled colleges to two in the region as the team had completed a similar process in the Sri Subhash Arts and Science College.\n\nThe officer said that the team was in the process of completing the Sree Sarswathy Thyagaraja College, Pollachi, and in the next few days in all the eight institutions in the two Assembly constituencies, where the team had identified 4,262 students to be eligible to vote.\n\nOf those it had already enrolled 3,854 and was in the process of enrolling the others.\n\nThe team was also enrolling the students who were from other Assembly constituencies in the State as the process was online.\n\nThe election officials were also engaging the students to take part in the Systematic Voters’ Education and Electoral Participation (SVEEP) programme to educate the voters by conducting street theatre of skits. It had identified campus ambassadors and was working with the institutions’ representatives for the purpose.\n\nIn the district, the administration had conducted a meeting with colleges to start the SVEEP campaign. On Tuesday the Collector Archana Patnaik and District Revenue Officer T. Christuraj and other officials had held a meeting with representatives of over 10 colleges for the purpose.\n\nAn officer said that the colleges would soon return with a set of events they would conduct and the campaign would begin in the next few days.", 
    "section": "national", 
    "title": "Poll officials reach out to students", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}