{
    "author": [
        "M K"
    ], 
    "text": "The centenary building at the Coimbatore Medical College Hospital built at about Rs. 60 crore was inaugurated 10 days ago. While the hospital authorities initially said that it would take a couple of months for procuring equipment for about Rs. 4 crore, it looks like it would be delayed by a few more months.\n\nSenior hospital authorities said that it was because of the model code of conduct for the assembly elections that came into effect within three days after the inaugural of the new building. Orders have been placed with the Tamil Nadu Medical Services Corporation, which is the single point for procuring equipment.\n\nThe corporation has completed scrutinising the requirements. But they cannot float the tenders now, since the poll code is in effect. They can do it only after the new government comes to power – by the end of May. It would take a few more months for the process to get completed and equipment to be put to use.\n\nOn the other hand, CMCH is in need of about Rs. 1 crore to procure medicines in various departments, as the requirement has exceeded the funds sanctioned for this financial year.\n\nEvery year the government allots specific amount for hospitals to buy medicines and equipment. It gets exhausted when there is an increase in number of patients or during escalation of medicine cost.\n\nHospital sources said that this shortfall would be made up with additional funds from the government’s cash reserve. But the government cannot sanction it now as the poll code is in effect.\n\nCMCH authorities said that they are reviewing the situation on availability of funds. They also said the DME would intervene when fund requirement reaches the critical mark.\n\nHowever, replacement of worn-out equipment was not hit by this scenario, they said.", 
    "section": "national", 
    "title": "Poll code affects purchase of equipment for CMCH", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}