{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Asks college students to urge the uneducated to cast their votes\n\nDEMOCRATIC DUTY:Collector S. Natarajan receiving Form 6 from a student for enrolment in electoral roll at Sethupathy Government Arts College in Ramanathapuram on Wednesday.— Photo: L. Balachandar\n\nStepping up Systematic Voters’ Education and Electoral Participation (SVEEP) activity to increase polling per centage, District Election Officer and Collector S. Natarajan launched a signature campaign to motivate college students and new voters.\n\nAddressing the students of Sethupathy Government Arts College here on Wednesday after launching the signature campaign, the Collector exhorted the students to discharge their democratic duty by casting their votes in the Assembly elections and motivate others to exercise their franchise.\n\nStudents should play a vital role in educating the uneducated on the importance of asserting their democratic right and casting votes in elections. They might have plenty of other works on the poll day but the highest priority should be accorded to casting vote, he said.\n\n“We are focussing on areas where the lowest number of votes were polled in the previous Assembly elections and striving to achieve 100 per cent polling in all the four Assembly segments,” Mr. Natarajan told The Hindu .\n\nAll those who had completed 18 years of age as on January 1 were eligible to vote and they should enrol their names in the electoral list, he said.\n\nThose who had enrolled should check whether their names figured in the electoral list and others should enrol their names by submitting Form 6 to the concerned election officers, he said.\n\nCollege Principal Chinnaiah, faculty members, Ramanathapuram Tashildar Mari and Deputy Tahsildars Palani and Karthikeyan were among those present at the campaign.\n\nSivaganga\n\nIn Sivaganga, District Election Officer and Collector S. Malarvizhi inspected GPS-fitted vehicles of flying squads.\n\nShe said that 12 flying squads had been formed for the four Assembly segments in the district, and they would carry out round-the-clock vehicle checks.\n\nThe GPS devices were fitted in the vehicles to monitor the movement of vehicles from the Election Control Room, she said.", 
    "section": "national", 
    "title": "Ramnad Collector launches signature campaign", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}