{
    "author": [
        "Parshathy J"
    ], 
    "text": "Singer Ashutosh Dhiman talks about the music industry and his dreams of breaking into Bollywood\n\nA boy, who grew up in Rampur, wanted to break away his hometown and be noticed in a big way.\n\nA chance call from his brother in New Delhi to do a trial session at his club gave 20-year-old Ashutosh Dhiman the much-needed break into the world of music.\n\nTill then, he was, like any other boy, happy to sing for his friends and take on their song requests. But the experience of singing in a big city before a huge crowd increased his confidence.\n\nAnd today, language barriers or cultural differences do not deter him from exploring a new place or audience.\n\nThat is why he was in Coimbatore to perform recently.\n\n“My interest in music began when I was in school. I started learning semi-classical music and listening to filmy numbers with a Sufi influence. I sing a blend of old and new, but not the real classical kind. The ragas and their science are beyond me,” he laughs.\n\nBut there is something instinctive about this self-trained musician’s voice.\n\nHe has a unique style of rendering each song. He tries to maintain eye contact, add his improvisations to the song and respond to song requests from the audience. With his trademark smile and guitar, Ashutosh is a familiar sight in the music circles of New Delhi.\n\n“I am happy performing solo. I have learnt guitar, harmonica and drums.”\n\nThe 20-year-old worked at All India Radio, Rampur for two years.\n\nHe also won a singing competition organised by Delhi Management Association in 2010, came first in Sangam Kala Group (District level) in 2010 and 2011, won an Indian Idol-like contest in Himachal Pradesh and the title of DMA IDOL-Rampur in 2012.\n\nHowever, things didn’t come easy. He struggled to work on his voice range, the high and low octaves while learning under Ustad Junaid Akhtar Khan.\n\n“Today, if you want to be a playback singer, it’s not enough to sing well and have a good voice. You have to work on your pitch. My guru always used to say that singing for films is different from rendering ghazals .”\n\nYou have to be versatile to be successful, he believes.\n\nSo Ashutosh’s repertoire is quite wide: ranging from romantic Bollywood numbers to semi-classical ones.\n\nSufi numbers like Kailash Kher’s ‘Teri Diwani’ and A.R.Rahman’s ‘Kun Faya Kun’ are especially popular.\n\nGiven that he sings mostly in cafes, restaurants and pubs, how involved is the audience in this kind of music?\n\n“You will be surprised. They love Kailash Kher and Lucky Ali numbers. Sufi has so much scope these days.” Making it big in the industry is a big task, he says.\n\n“There are 10 other singers, who can sing as well as me. Some are unheard, and are not allowed to rise.”\n\nHowever Ashutosh is not willing to leave everything to fate. He has figured out a few tricks of this trade.\n\n“Performance is as important as talent. You need to strike a good chord with the crowd and get familiar with them.”\n\nSometimes, there are frustrating moments, as when people go away without appreciating his music.\n\nCapturing the attention of the crowd is difficult, he admits.\n\n“But you should not feel bogged down or pressured. Do not be bothered about what people think of you. Try to explore yourself and widen your exposure.”\n\nWhen he is not singing, he experiments with instruments, plays badminton, reads, travels and meets new people.\n\nHe is now pursuing his B.Com at MJP Rohilkhand University. He is content with what he is doing, he says, but his long-term ambition is to get into the playback industry.\n\nNo wonder then that he sports tattoos like musical notes on his neck and lights up when he starts talking about music.\n\nToday, if you want to be a playback singer, it’s not enough to sing\n\nwell and have\n\na good voice", 
    "section": "national", 
    "title": "Rampur ka Dhiman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}