{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It is said to effectively cure colorectal cancer\n\nA team of researchers at Pondicherry Central University has shed light on the modus operandi of curcumin in quelling some types of cancer cells.\n\nThe research work led by Dr. R. Baskaran, an Associate Professor from Department of Biochemistry and Molecular Biology, Pondicherry University, in collaboration with Pittsburgh Cancer Institute, has uncovered the mechanism by which curcumin, a bioactive ingredient of turmeric, commonly used in every household in India, can not only prevent but also can effectively cure colorectal cancer.\n\nColorectal Cancer (CRC) is a critical health concern because of its incidence as the third most prevalent cancer in the world.\n\nAlthough compared to western countries, colorectal cancer is low in India but changes in food habits and lifestyle has increased risks.\n\nAccording to data of the Indian Council of Medical Research (ICMR) the number of CRC-related deaths is estimated to be approximately 6,08,000 worldwide, accounting for 8 per cent of all cancer deaths and making CRC the fourth most common cause of death due to cancer. In India, the annual incidence rates (AARs) for colon cancer and rectal cancer in men are 4.4 and 4.1 per 1,00,000, respectively.\n\nCurcumin, derived from the dietary turmeric (Curcuma longa) is an effective anti-cancer, anti-inflammatory, and antioxidant agent. Studies on the effect of curcumin on the entire cell death process, both in tumour and normal cells, are useful for the ongoing preclinical and clinical investigations on this potential chemo-preventive agent.\n\nWhile curcumin’s chemoprevention property is well documented, its ability to kill colorectal cancer cells is not as clearly known or understood.\n\nAlthough curcumin-induced cytotoxicity is due to superoxide anion production, the precise mechanism leading to cell death activation remains unknown.\n\nTowards this end, the research group previously reported in a series of publications that human non-polyposis colorectal cancer cells (HNPCC) arising due to genetic mutations in mismatch repair genes (MMR) are highly sensitive to curcumin due to unrepaired DNA damage.\n\nIn a recent report, published in the international peer-reviewed journal “Molecular and Cellular Biochemistry” (Feb 2016), the authors now document that the protein levels of gadd45a (genes activated during DNA damage), are increased following curcumin treatment.\n\nThe study demonstrated how the trigger of genes is required for cell death induced by curcumin in colorectal cancer cells and that the mismatch repair (MMR) status strongly influences curcumin sensitivity.\n\nResults also demonstrate that an attenuated (changed virulence) response to curcumin treatment sensitises MMR-deficient cells to curcumin-induced cytotoxicity. The authors believe that the results have potential therapeutic value, especially in the treatment of tumours with compromised MMR function.\n\nAccording to a press note from the Pondicherry University, Dr. Baskaran has 20 years of experience in cancer research abroad and in India and has published more than 50 articles in internationally renowned journals such as Nature, PNAS and Molecular Cancer.\n\nHe is also an American Research Scholar.", 
    "section": "national", 
    "title": "Researchers in Pondicherry University shed light on how curcumin kills tumours", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}