{
    "author": [
        "S Senthalir"
    ], 
    "text": "People watched the partial solar eclipse using protective glasses, even as clouds shrouded the sun over the Bay of Bengal in Puducherry on Wednesday; (inset) a view of the sun after the partial eclipse. —Photo: S.S. Kumar\n\nFor the first time, a telescope with solar filter was made available to the public\n\nScores of sky-gazers joined the morning walkers on Promenade Beach in the early hours of Wednesday to catch a glimpse of the partial solar eclipse seen over the Bay of Bengal.\n\nA large number of children were among the crowd that eagerly gathered behind Mahatma Gandhi statute to watch the rare celestial event.\n\nThe Dr.A.P.J.Abdul Kalam Science Centre-cum-Planetarium had made elaborate arrangements to enable the public to witness the partial eclipse through solar-filter telescope on Wednesday morning.\n\nHowever, people waiting to watch the partial eclipse were in for disappointment as clouds played spoilsport by hiding the sun.\n\nPeople were seen holding eclipse glasses distributed by the planetarium staff. While reports said that thousands across Indonesia were able to clearly witness a total solar eclipse, people in Puducherry did not get an opportunity to even view the partial solar eclipse as clouds shrouded the sun till 7 a.m.\n\n“The partial solar eclipse was predicted to occur between 6.20 a.m. and 6.48 a.m. in Puducherry. All arrangements were made by 6 a.m. However, clouds shrouded the view of the partial solar eclipse leaving many disappointed,” said Sathish Kumar, Junior Scientific Assistant, Dr.A.P.J.Abdul Kalam Science Centre-cum-Planetarium.\n\nHe added that the public would have got a better view of the eclipse if not for the clouds. “Earlier in Puducherry, solar eclipse was viewed through its reflection on a screen. This was the first time a telescope with solar filter was placed for the public,” he added. Not to disappoint the enthusiastic crowd, junior scientists from the planetarium allowed them to view the sunspot using the solar-filter telescope. The planetarium is now getting ready to organise a similar event to witness the lunar eclipse on March 23.", 
    "section": "national", 
    "title": "Sky-gazers feel let down as clouds shroud solar eclipse", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}