{
    "author": [
        "M K"
    ], 
    "text": "They enter houses to escape the heat, looking for water\n\nOver the last few days more residents in the city have spotted snakes in their houses and gardens. Such incidents are on the rise with the soaring mercury levels. In two weeks, four persons have died of snake bites in Coimbatore district.\n\nSnakes have been rescued from kitchen sinks, grinders, unused water pipelines and public taps, below cots and staircases.\n\nOfficials from the forest and the fire and rescue service departments and volunteers involved in catching snakes usually get one or two call a day. There are days they have not got any call. From the last week of February the number of rescue calls has increased to five a day and it is expected to double in the next few weeks. This scenario is expected to continue till the end of May.\n\n“Snakes can survive without food for a few days but cannot bear the heat or go without water,” says K. Rathish, founder and president of Save Our Snakes (SOS).\n\nThe 11-year-old organisation has 30 members who work elsewhere and also rescue snakes. They assist the forest and fire and rescue departments to rescue snakes.\n\nIncreasing snake sightings also result in man-animal conflicts. There are instances where residents allow their dogs handle such situations, resulting in death of either or both the animals.\n\n“Earlier people called us and by the time we reached the place someone would kill it. Sadly, in most instances they were non venomous,” he said and added that there is better awareness and such incidents have come down.\n\nWhile snakes are spotted even in the heart of the city where roads are buzzing with activity, areas from where more snakes are rescued are at Thudiyalur, Periyanaickenpalayam, Vadavalli, Ganapathy, Singanallur, Ondipudur, Ettimadai, Podanur, Ramanathapuram and Sundarapuram.\n\nThe sightings are more in areas that are close to open drains, have poorly maintained gardens or where there are vacant house sites filled with bushes.\n\n“Last summer we got multiple calls from the residents close to a prominent hotel in Gandhipuram. Food wastes dumped into the drains attracted rats and in turn snakes,” he said. In residential areas, many snakes were rescued from vacant house sites when bushes were cleared.\n\nContact\n\nFor snake rescue call Save Our Snakes at 9787332814 or 9750209000 round the clock.", 
    "section": "national", 
    "title": "Snakes seek shades", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}