{
    "author": [
        "R Sujatha"
    ], 
    "text": "Four friends studying in two different technical institutes are the toast of the students of the Indian Institute of Technology–Madras. The friends have helped students save small change through a payment app. The friends, final year students in civil, electrical and computer science engineering, have developed the app called Paymint, now a big hit on the campus.\n\nRajat Yadav and Shubam Jindal, final year students in civil and electrical engineering at IIT-M and Koushik M.L.N., and Ashish Noel, final-year computer science engineering and electrical engineering students at Birla Institute of Technology, Ranchi, are the brains behind the app. Rajat and Shubam together invested Rs. 2 lakh in the start-up while Koushik and Ashish provided the technical support. The project was mentored by the IIT-M entrepreneur cell.\n\n“A major problem at the institute is getting small change back from shops. There are seven shops on the campus and often, shopkeepers will give us chocolates or some other product. We built a wallet that students can download and use on the campus,” says Rajat.\n\nThe app was launched mid-February and as many as 1,200 students are using it on the campus. Next week, the app will be launched at the annual cultural festival to be held at BIT, Ranchi. It helps that Koushik and Shubam are childhood friends from Hyderabad.\n\n“We had planned to launch it during Saarang but there was a delay in getting approvals from the server. We hope to use it for all vendors during the festival,” says Koushik. Rinkesh Virani, a final-year engineering student at IIT-M, is all praise for the app.\n\n“I deposit a weekly amount of Rs. 600 and I also get cashback offers. It is a relief as small change is a big problem inside the campus. I don’t have to worry about losing the cash to the washing machine as I often forget to remove them from my shirts or trouser pockets,” he said.", 
    "section": "national", 
    "title": "Students launch app that tackles problem of small change", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}