{
    "author": [
        "K Lakshmi"
    ], 
    "text": "The campus of the Highways Research Centre before its inauguration (Right) A view of the building in 2004—Photos: The Hindu Archive and File Photo\n\nThe Highways Department has moved to a campus off Sardar Patel Road, where area where serenity reigns, except for the occasional bird call. This campus also houses the Highways Research Station (HRS) that was inaugurated in 1957.\n\nThe Chief Engineers of the department moved in from their old offices at the Public Works Department-owned Indo-Saracenic heritage structure on Kamarajar Salai, where they had worked from for over 70 years.\n\nThe department is one of the four that had been carved out of the Public Works Department (PWD) over the years and remained with the parent department though the others moved out. The Madras Public Works Department was formed in 1858 and the post of PWD secretary was created in 1860.\n\n“While the electricity board was created in 1934, the Highways Department was carved out in 1946. Tamil Nadu Water Supply and Drainage Board and Tamil Nadu Police Housing were the other departments that were carved out later,” said an official of PWD.\n\nPWD officials recalled that the portion of the complex occupied by the Highways Department had served as a dining hall for labourers of the Nawabs of Arcot during the period till the 1850s when they used to reside at Chepauk Palace.\n\n“We plan to reallocate the newly available space to staff members working in the 11 PWD wings. Many staff members have been working along corridors and suffer due to the lack of sufficient toilet facilities. Lack of space is the cause of the problem,” said an official.\n\nMeanwhile, the quaint old building of the HRS off Sardar Patel Road that was inaugurated by former Chief Minister K. Kamaraj continues to house the station that does research on cement concrete, vehicular traffic, soils, bitumen and new kinds of material.\n\nIt also provides training and offers consultancy for projects. It is situated behind the modern CE’s offices building.\n\n“Not many changes have been made to the building except for air-conditioning and cabins for officials. An auditorium too has been added,” said a source in the department. The lamp lit by Mr. Kamaraj during the inauguration still stands on a pedestal inside.\n\nThe Highways Department recently moved out of its\n\nIndo-Saracenic headquarters to\n\na 59-year-old campus", 
    "section": "national", 
    "title": "The many roads between two buildings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}