{
    "author": [], 
    "text": "RELIGION\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, Yali vaganam, 6 a.m.; kuthirai vaganam, 7 p.m.\n\nSri Ramakrishna Sarada Samithi: Sri Ramakrishna Jayanthi, pooja, Golden Rock, 6 a.m.; Vedic chanting, bhajans, 10 a.m.; discourse by Swamy Veerabhadranandaji, noon and 3 p.m.; arathi, 6.45 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Anjaneyar Sannidhi, Vasantha Nagar, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 14/B, Kamarajar Street, Ayyappa Nagar, 6 p.m.\n\nGovindammal Tamil Mandram: “Kamba Ramayanam” by P.Ravi, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nThe Booksellers and Publishers Association of South India: Book fair, Corporation grounds, Anna Nagar, Thennur, 11 a.m.\n\nNational College Physics Department: Golden jubilee endowment lecture on “Gravitational waves and our wonderful universe”, by R. Jaganathan, former vice chancellor, Middle East University, UAE, 11 a.m.\n\nNational College: Mathematics Association meeting, S. Balasubramanian, assistant professor, Government Arts college, Karur, speaks on ‘A view on topology,’ 11.30 a.m.; Department of Tamil: Musical lecture by S. Ramalinga Swamigal speaks, 12.30 p.m.\n\nJamal Mohamed College: Milad-u-Nabi festival, M. Mohamed Abuthahir, professor, Noorul Islam Arabic College, speaks, 9.30 a.m. and 3 p.m.\n\nShri Angalamman College of Engineering and Technology: Lecture on “Advancement in CAD and NDT”, B. Lawrence, CEO, A Plus Technologies, speaks, 10 a.m.\n\nJayaram College of Engineering and Technology Microsoft Innovation Centre: “Faculty connection on Windows Azure with IoT,” 9 a.m.\n\nKongunadu College of Engineering and Technology: Seminar on “Fuzzy logic in electronics”, Tholurpatti, 5.30 p.m.\n\nSridhar’s Shake N Stir The Mocktail World: Opening ceremony, Vayalur Main Road, Nachikurichi, 3 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}