{
    "author": [
        "B Kolappan"
    ], 
    "text": "The front was the first to appeal to DMDK leader to join its alliance\n\nIndicating that the People’s Welfare Front (PWF) was not averse to projecting DMDK founder Vijayakant as its chief ministerial candidate in the Assembly polls, three of its key leaders on Wednesday said accommodating the latter’s “kingly” aspirations may not be a constraint. The PWF, comprising the MDMK, VCK and Left parties, were the first to formally appeal to Vijayakant to join their alternative alliance.\n\n“Accommodating Mr. Vijayakant’s aspiration would not be a big issue,” MDMK founder Vaiko told The Hindu when asked about PWF’s stand on Mr. Vijayakant’s indication that he wanted to be the ‘king’ and not ‘kingmaker’ of Tamil Nadu politics.\n\n“We are in a battle field. We have to adopt our strategy to overcome financial giants (Dravidian majors),” he said, adding all issues could be sorted out once the DMDK becomes a part of the PWF.\n\n“If he is keen on fighting corruption and liquor, then the PWF is the ideal destination,” he contended.\n\nVCK chief Thol Thirumavalavan endorsed this. Till now, the PWF has been projecting its leaders as a four-man army with no commander. However, taking into consideration the need for expanding the front and making it formidable, it was open to changes in its structure. “We are ready to consider his (Mr. Vijayakant) demand to become the leader of the alliance and Chief Ministerial candidate once DMDK becomes a constituent of the PWF,” Mr. Thirumavalavan told The Hindu .\n\nThe VCK leader pointed out that if the DMDK joined the DMK-Congress alliance, then Mr. Vijayakant could only be a ‘kingmaker’ and not the ‘king’.\n\nThe Left parties too are open to this idea. Asked about the Left’s stand on announcing the actor as the PWF’s chief ministerial candidate, CPI (M) State secretary G. Ramakrishnan said, “Anything can be discussed if he joins our front.”\n\nMr. Vijayakant has worked with the Left parties during the local body polls in October 2011 after he fell out with the ruling AIADMK.\n\nHowever, Mr. Vijayakant is yet to make up his mind on standing offers from the PWF, the BJP and the DMK-Congress combine for a poll tie-up. While there are reports that the DMDK is simultaneously negotiating for a good seat-sharing deal with the DMK-Congress combine and the BJP, so far, Mr. Vijayakant has maintained that no formal talks are on with anyone.\n\n“Äll issues can be sorted out once\n\nthe DMDK\n\nbecomes a part\n\nof the PWF”", 
    "section": "national", 
    "title": "Vijayakant’s ‘kingly’ aspirations not an issue, say PWF leaders", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}