{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Election officials inspecting all the 2,502 polling stations\n\nWheelchairs will be provided in all polling stations in the district to enable differently abled persons exercise their franchise without difficulty.\n\nDisclosing this to reporters after inspecting the arrangements being made at the counting centre at the Saranathan College of Engineering on the outskirts of the city on Wednesday, District Collector K.S. Palanisamy said the wheelchairs would be sourced and kept in readiness at the polling stations on the day of polling.\n\nElection officials were currently inspecting all the 2,502 polling stations in the district and arrangements were being made for providing necessary basic amenities such as ramps, drinking water supply, toilets, and power supply.\n\nAl women polling stations are to be set up all constituencies and they would be set up based on the directions from the Election Commission.\n\nMr. Palanisamy said work on erasing graffiti, removing hoardings and posters across the district was under way and 90 per cent of the work had been completed. In urban centres, wall writings would not be permitted on public and private buildings and in rural areas, wall writings could be done in private buildings with the permission of the owners.\n\nThe district administration was compiling the list of polling personnel and the micro observers.\n\nMr. Palanisamy said there had been no major election-related complaints so far although a few complaints had been received on the violation of model code of conduct. Static vigilance teams and flying squads were maintaining a vigil and conducting regular vehicle checks.\n\nHe said Electors Photo Identity Cards had been distributed among 55,000 new voters included prior to the release of the final electoral rolls on January 20. For voters who were included after this, the EPICs would be distributed in due course.\n\nThere would be two counting centres in the district at the Saranathan College of Engineering at Panchapur and Ramakrishnan College of Engineering near Samayapuram. Counting of votes polled in Srirangam, Manapparai, Tiruchi West and Tiruchi East Assembly constituencies would be taken up at the Saranathan College. For the other five constituencies, Ramakrishnan College of Engineering would be the counting centre.", 
    "section": "national", 
    "title": "Wheelchairs to be kept ready at all polling stations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}