{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Women achievers from various walks of life were felicitated on the occasion of International Women's Day at Jipmer on Tuesday. —Photo: Special Arrangement\n\nVarious organisations and institutions across Puducherry observed International Women’s Day by conducting different programmes to recognise and felicitate women achievers.\n\nSocial Education and Environment Development Association felicitated women writers by awarding them with books. The function was held at Puthaga Poonga on Airport Road in Puducherry. Poet Uma Mohan, Bharatanatyam dancer Krithiga, photographer Raji Saminathan and few others were felicitated.\n\nEducational institutions took the traditional academic path to celebrate International Women’s Day. Pondicherry Central University observed the International Women’s Day celebrations by launching the second phase of the UGC-SAP project. As part of the project, a three-day national seminar on ‘Marginalisation and Resistance: Rethinking the Woman’ was inaugurated on Tuesday. Nearly 71 papers were selected for the three-day seminar.\n\nVice Chancellor in-charge Anisa Basheer Khan inaugurated the seminar and French Consul M.Philippe Janvier-Kamiyama was present.\n\nJawaharlal Institute of Postgraduate Medical Education and Research (Jipmer) recognised the service of their women employees by honouring them.\n\nSubhash Chandra Parija, Director, Jipmer, honoured women achievers from medical education, para medical, ancillary services, sub-staff level, service staffs. Dr. J. Balachander, Medical Superintendent and Dr.S.Mahadevan, Dean-Jipmer presided over the function. Dr. Kadambari, Registrar, Dr. Anita Rustagi, Additional Medical Superintendent and V. Chitraleka, Social Service Officer, were the other dignitaries present on the occasion.\n\nPondicherry AIDS Control Society took out a candle light rally to create awareness on HIV/AIDS on Tuesday. AIDS Control Society Director S.Jayanthi, Director of Social Welfare Meena Kumari, Senior Superintendent of Police (Traffic) Rachna Singh and many students from nursing colleges and members of self help groups participated in the rally.\n\nPrivate institutions planned different initiatives on the occasion of Women’s Day. Integra Software Services of Puducherry planned to focus on career development for women employees to help equal representation of women in supervisory and managerial bands.\n\nThey decided to focus on women’s health by conducting awareness sessions on cancer, heart diseases etc. Awards were distributed to 16 women achievers.", 
    "section": "national", 
    "title": "Women achievers felicitated", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}