{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Only two more days are left for The Hindu World of Women (WoW), an event organised by The Hindu , to celebrate the women of Madurai. WoW, to be held on March 12, is a combination of events intended to bring out the innate skills of participants.\n\nStarting off with a car rally at 8 a.m., the event will conclude with a panel discussion on ‘What empowers women.’ The car and bike rallies, named Heels on Wheels, will not only test the participant’s driving skills but also her patience on the city roads. Participants should adhere to traffic rules. Those registered for the two-wheeler rally must wear a helmet. All participants should bring with them photocopies of driving licence, registration and insurance certificates.\n\nThe car rally will be flagged off at Velammal Medical College and Hospital by M.V. Muthuramalingam, chairman, Velammal group of institutions. The bike rally will be flagged off at Gandhi Museum at 9 a.m. by B. Kalpana of Guru Hospital. It will culminate at Fortune Pandiyan Hotel, where a medical-cum-blood donation camp will be held from 10 a.m.\n\nAnother exciting event, treasure hunt, will be conducted at 11 a.m. Members of Sakthi Porparai of Dindigul and television-fame Sasikala will provide a variety entertainment from 2 p.m.\n\nA panel discussion on ‘What empowers women –education, power/position, money/property or law?’ will be held from 3 p.m. with J. Charukesi, Post-Master General, Helen Christina of Sri Meenakshi Government College for Women, Rajakumari Jeevagan, chairwoman, Women Entrepreneurs, Chitra Ganapathy, entrepreneur, and Hema Sathish, consultant cosmetic dermatologist, as participants.\n\nThe Hindu World of Women is sponsored by Velammal Speciality Hospital and powered by Sri Jeyaprabha Jewellers. The associate sponsors are Canara Bank, Twin Birds, Sprinkle Salt and VVD Oil. The media partner is The Hindu Tamil . Fortune Pandiyan Hotel is the hospitality partner and the radio partner is Hello FM, with Sagar TV as channel partner. The TV branding partner is Ad Inn Advertising Agency and the event will be organised by Rise Advertising.\n\nFor more details, call Rekharani at 98433 64545. For online registration: https://goo.gl/3OU6DN.", 
    "section": "national", 
    "title": "WOW, an eventful day in Madurai is two days away", 
    "subsection": "tamilnadu", 
    "date": "2016-03-10"
}