{
    "author": [
        "Tamil Nadu Bureau"
    ], 
    "text": "The family members of Dalit youth Shankar, who was murdered on Sunday last for marrying a caste Hindu girl, received a threat letter from a man claiming to be a resident of Mettupalayam in Coimbatore, even as one more accused in the case surrendered in a court in Dindigul district.\n\nAccording to police, C. Velusamy, father of Shankar, residing at Komaralingam in Tirupur district, received a letter bearing the name of one Alavudeen.\n\nThe writer abused Mr. Velusamy citing his caste and threatened to behead him. The writer further said had Mr. Velusamy sent his daughter-in-law Kausalya (who was also attacked) back to her parents, he could have saved his son’s life.\n\nMr. Velusamy handed over the letter to the Komaralingam police, who registered a case under Section 507 (criminal intimidation by anonymous communication) of the Indian Penal Code.\n\nV. Vigneswaran (19), younger brother of Shankar, told The Hindu that the family did not feel intimidated by the contents of the letter: “We have no fear at the moment. In our village, we are surrounded by relatives and very friendly neighbours. But we will have a bit of uncertainty when go outside,” he said.\n\nMeanwhile, one more person surrendered before the Judicial Magistrate Court at Nilakottai in Dindigul on Friday in connection with the case. The surrendered person was identified as V. Prasanna (20) of Palani town. He was studying B.Com second year in a private college in Udumalpet.\n\nHe informed the judge that he came to know that the police were in search of him in connection with the murder and hence he was surrendering.\n\nJudicial Magistrate B. Risana Parveen remanded him in judicial custody and advised the police to produce him before the court in Udumalpet on March 23. Later, he was lodged in a juvenile home in Melur near Madurai. The police said that the CCTV video footage showed that he was handing over the key of motorcycle, which was used in the crime, to the accused. He was the cousin brother of Ms. Kousalya.", 
    "section": "national", 
    "title": "Dalit youth’s family receives threat letter", 
    "subsection": "general", 
    "date": "2016-03-19"
}