{
    "author": [
        "National Bureau"
    ], 
    "text": "Investigation is related to IDBI Bank loan fraud case\n\nThe Enforcement Directorate on Friday asked Vijay Mallya to appear on April 2 before it in a money-laundering probe related to one of the bank loan defaults of his group.\n\nMr. Mallya was originally to appear on Friday before the ED in its investigations into the IDBI Bank loan fraud case, which is now a subject of criminal investigation by the CBI. However, a day earlier, Mr. Mallya e-mailed the ED saying he was unable to appear on Friday and suggesting that he could do so in early April, a request the directorate has now accepted.\n\nThe ED had summoned Mr. Mallya to make a “personal appearance” before it in Mumbai on March 18 under the provisions of the Prevention of Money Laundering Act (PMLA).\n\nOfficials said the case was reviewed in Mumbai by senior ED officials, including its Director, Karnal Singh, who was visiting the regional office of the agency.\n\nMeanwhile, the directorate on Thursday questioned A. Raghunathan, former chief financial officer (CFO) of the grounded Kingfisher Airlines, and Ravi Nedungadi, CFO of the UB Group who had taken premature retirement, again about the financial transaction of their companies.\n\nBoth the CBI and the ED are investigating a possible criminal conspiracy and laundering of the Rs. 900 crore borrowed by the defunct Kingfisher Airlines from IDBI Bank.\n\nThe CBI has claimed in its FIR that despite the airlines’ bad financial situation in 2009, Mr. Mallya managed to get the loan from the bank because of a collusion between the tycoon and senior leadership of the bank, which ignored warnings from some of its own officers.\n\nThe FIR says Kingfisher Airlines was given the loan after Mr. Mallya met IDBI Bank chief Yogesh Aggarwal and that their meeting was referred to by the bank while sanctioning the loan.\n\nMoney misused\n\nThe CBI says the loan was then misused to pay off parts of other debts that the company had already accrued, and a significant portion was sent abroad on various pretexts.\n\nThe CBI claims that the loan was sanctioned despite an internal bank memo that warned that Kingfisher had failed to meet basic compliance, including depositing of Rs. 100 crores of tax deducted from its employees.\n\nThe CBI has booked Mr. Mallya, other directors of the airline, Mr. Raghunathan, and unknown officials of IDBI Bank in its FIR.\n\nMr. Mallya had left India on March 2 for the U.K., just days before the Supreme Court heard a plea from several public sector banks seeking recovery of over Rs. 9,000 crore that his group firms owned them.\n\nRecovery efforts have been sluggish at best. The auction of Kingfisher House in Mumbai, once the headquarters of Mr. Mallya’s defunct airline, proved to be a flop show on Thursday with no bids. The reserve price for the house was Rs. 150 crore.", 
    "section": "national", 
    "title": "ED asks Mallya to appear on April 2", 
    "subsection": "general", 
    "date": "2016-03-19"
}