{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "‘Nino neutral conditions may prevail during July-August’\n\nA good number of meteorologists expect the monsoon in 2016 to be normal, though they are unclear whether the El Nino — a weather anomaly blamed for back-to-back droughts over India since 2014 — will completely fade away during the crucial rain months from June to September.\n\nEl Nino refers to an anomalous heating up of the waters in the central-eastern regions of the equatorial Pacific and implies a consistent, average rise in temperature of 0.5 degree Celsius above normal. Historically that translates to the monsoon drying up over India six in 10 years.\n\nConversely, the La Nina, or an anti-El Nino, when waters in the same regions dip at least 0.5 degree Celsius and generally considered favourable for the monsoon, is only expected to set in after September, says an update by the U.S.-based National Oceanic and Atmospheric Administration. “A transition to ENSO-neutral is likely during late Northern Hemisphere spring or early summer 2016, with close to a 50 per cent chance for La Niña conditions to develop by the fall,” the organisation said in a statement.\n\nThe India Meteorological Department is expected to announce its first monsoon forecast later next month.\n\nMeteorologists, to whom The Hindu spoke to, said that “Nino neutral” conditions were likely to prevail during the crucial months of July and August that accounts for nearly 70 per cent of the monsoon rainfall. “Nino neutral (when sea surface temperatures are close to normal) can be a mixed bag for Indian monsoon,” said Sivananda Pai, chief meteorologist, IMD, “but generally an El Nino year is followed by normal monsoon.”\n\nTo be sure, 2015 was only the fourth time in a 100-year span that El Nino-like conditions raged on for two consecutive years.\n\nMr. Pai said key weather parameters needed to prepare the forecast would only be available by March-end and it was yet “too early” to decide how the monsoon would pan out. In April, the IMD traditionally forecasts if the monsoon is likely to be normal and it generally updates this figure around June.\n\nOther meteorologists however say that while no agency expects an El Nino there are doubts on how fast the waters are expected to cool. “I would expect it to dip below 0 around August, though there are still disagreements internationally,” said G.P. Sharma, Vice President-Meteorology, Skymet Weather Services. Irrespective of how the El Nino pans out, normal monsoon doesn’t mean that all parts of the country would receive good rain.", 
    "section": "national", 
    "title": "Experts unsure if El Nino will fade away", 
    "subsection": "general", 
    "date": "2016-03-19"
}