{
    "author": [
        "Devesh K"
    ], 
    "text": "6.57 lakh earned 20 times country’s GDP in 2011\n\nBelieve it or not, figures shared by the Income Tax Department in response to an RTI application by a retired Indian Revenue Service official has revealed that agricultural income recorded an exponential increase from 2004 to 2013, touching a total of almost Rs. 2,000 lakh crore for individual assessees in 2011.\n\nThe sum earned by those 6.57 lakh assesses, who filed income tax returns in 2011, is over 20 times the gross domestic product of over Rs. 84 lakh crore at the time, show Income Tax Department data shared under the RTI Act. Notably, agricultural earnings are exempt from income tax.\n\nVijay Sharma, who filed the RTI application, has now moved the Patna High Court seeking further investigations into the matter, raising suspicion that income from undisclosed sources are being shown as agricultural income to evade tax.\n\n“The other possibility may be that illegal money or black money income is being laundered in a large scale and brought into the white economy. It requires deep investigation,” Mr. Sharma told The Hindu . He said the next date of hearing on his public interest litigation plea was in April.\n\n“I had got these details from the Income Tax Department through an RTI reply last April. Since then I have been writing to the Central Board of Direct Taxes seeking a probe into the matter. Till now, no agency has contradicted the information. In fact, in the Rajya Sabha, the Finance Minister on Tuesday also did not contradict the figures,” said the 1976-batch IRS official.\n\nFinance Minister Arun Jaitley said on Tuesday many prominent people were being investigated by the Income Tax Department for hiding taxable income as agricultural. “Please don’t say it is political victimisation if names come out after that [probe],” he said in reply to the questions raised by the Opposition members.\n\nThe Income Tax Department has launched an investigation on those reporting farm incomes of more than Rs. 1 crore a year. Official data peg this number at 307 in the assessment year 2015-16, up from 180 in 2007-08. The department is probing 2,746 such cases — Bengaluru recording the highest of 321 followed by Delhi with 275 and Kolkata with 239 cases — from across the country.\n\n“Aadhaar will help in this,” Rajiv Kumar, senior fellow at the Centre for Policy Research, told The Hindu . “Now you also really need to do digitisation of land records, and link them to individual identities. This agriculture income figure is completely spurious. It is due to people evading tax.”\n\n“People earning more than Rs. 1 crore from agriculture should pay income tax. They will be an infinitesimal proportion of the total number of farmers, and the argument that the administrative cost of bringing these farmers into the tax net is too high will not apply to such a small number,” Mr. Kumar said.\n\nThe IRS officer again filed an RTI application seeking access to details of top 100 assesses in the past five years. However, the Income-Tax Department refused to share the information, saying that it held the details in fiduciary capacity because the respective assesses have filed their returns along with financials under the Income Tax Act. The department said the disclosure of personal information was prohibited under Section 8 1(J) of the RTI Act.", 
    "section": "national", 
    "title": "Farms grow massive incomes for select few", 
    "subsection": "general", 
    "date": "2016-03-19"
}