{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "Popular flautist and guru A.V. Prakash (74) died in Mysuru on Thursday evening while his concert with popular violinist H.K. Narasimha Murthy was in progress. His student Divyashree had helped him reach the concert venue at 6.30 p.m.\n\nConfirming that Mr. Prakash died of a massive heart attack while he was performing at the Vidya Bharati Prathana Mandira at the Chandramouleeswara temple premises, his son A.P. Krishna Prasad, also a flautist, said, “My father often said he would like to die while performing on the flute. We can’t believe his words turned out to be so true.”\n\nA few minutes into the concert, Mr. Prakash collapsed after feeling uncomfortable. “After the Vasantha varna, he took up Hamsadwani raga and played Tyagaraja’s Raghunayaka impeccably.\n\nAfter a few rounds of swara-prasthara , he pleaded with violinist H.K. Narasimha Murthy to continue as he had started sweating profusely. But everything was over by the time we brought him to a private hospital,” said K.S.N. Prasad, secretary, Nada Brahma Sangeeta Sabha and trustee of Chandramouleeswara temple.\n\nPrakash, born in Channarayapatna taluk in Hassan district, was a student of flautist N. Ramani. He was a popular teacher at the Tyagaraja Sangeetha Sabha Trust and Guruguha Venugana Sabha Trust. Known for his acumen in taking across the popular Ramani techniques and approaches in playing the flute, he had trained thousands of students who are now amongst popular performers.\n\nSome of his top-line students include T.R. Srinath, V.K. Raman, the popular duo Hemantha and Heramba, Smita Kiran, H.S. Venugopal, K.S. Jayaram, and his sons A.P. Srinivas and Mr. Krishna Prasad. In his six-decade-long career as a teacher, he trained over a thousand students.\n\nHe was an ardent admirer of flautist Mahalingam. He and his teacher, Ramani, were close friends who shared their latest interpretations with each other. “Ramani always admired his passion to collect evenly-held shruti flutes for group presentations. His students across the globe will miss him,” said flautist Chandan Kumar.\n\nPrakash would eat and breathe with his flute from 4 a.m. to 10 p.m. The music industry called him a ‘flute factory’ for his collection and the students he moulded.\n\nChandan Kumar\n\nflautist\n\nIf there is one person who took across the sahitya-oriented gayaki stylisations of Ramani and spread them to his students, it was Prakash. Would you believe that he had nearly 500 flutes in all the shrutis in his collection? His sons can open a museum of flutes today. –H.K. Narasimha Murthy,violinist", 
    "section": "national", 
    "title": "Flautist A.V. Prakash passes away", 
    "subsection": "general", 
    "date": "2016-03-19"
}