{
    "author": [], 
    "text": "At the exhibition ‘From Kandinsky to Pollock, the art of the Guggenheim collections’ at the Palazzo Strozzi in Florence.— Photo: AFP\n\nFrom Kandinsky to Pollock, the extraordinary impact collectors Peggy and Solomon Guggenheim had on 20th century art is celebrated by an exhibition of over 100 masterpieces that opens in Florence on Saturday.\n\nSubtitled ‘The Art of the Guggenheim Collections’, the exhibition, which will run in the Tuscan city’s Palazzo Strozzi until July 24, explores how bohemian socialite Peggy, her uncle Solomon and the celebrated New York museum he established influenced European and American art from the 1920s to the 1960s.\n\nCurated by Luca Massimo Barbero, it features paintings, sculptures, photographs and engravings borrowed from the Guggenheim museums in New York and Venice and a small number of other museums and private collections.\n\n“Peggy Guggenheim (1898-1979) did not just buy works, she bet on young artists and supported them thanks to an incredible artistic instinct and curiosity,” Mr. Barbero said. “She was so sure of her own taste, she never compromised.”\n\nThe fruit of those instincts was the acquisition of works by an extraordinary list of artists: Wassily Kandinsky, Marcel Duchamp, Max Ernst (to whom Peggy was married from 1941-46), Mark Rothko, Jackson Pollock and Alexander Calder, to name just a selection.\n\nAs a result, the Florence exhibition is able to offer a rare opportunity to view some seminal works of pre-WWII modern art, including pieces by Max Ernst, Man Ray and Pablo Picasso, alongside illustrations of the divergent post-war trends on either side of the Atlantic.\n\nIt also tells the story of Peggy Guggenheim’s arrival in Europe in 1921, her return to the United States during World War II and her decision to finally base herself and her collection in Venice from 1949.\n\n“Peggy wanted to understand the artistic effervescence of Europe at the time so she simply moved here,” Mr. Berbero said.\n\nImportant purchases during the inter-war period included Italian sculptor Giacometti’s Woman Walking and Picasso’s The Dream and Lie of Franco . With the outbreak of war in 1939, Guggenheim was transformed from socialite collector to a mother figure desperately trying to protect her artists in the face of the Nazi threat.\n\nShe was forced to flee Europe herself in 1941 and Pollock, who has 18 works in the exhibition, was one of the major beneficiaries of the time she spent back in the United States. — AFP", 
    "section": "national", 
    "title": "Florence toasts Guggenheim eye for 20th century art", 
    "subsection": "general", 
    "date": "2016-03-19"
}