{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "Actor Anupam Kher addresses the students before the screening of his film 'Buddha in a Traffic Jam' at JNU in New Delhi on Friday. Film director Vivek Agnihotri and film-maker Ashok Pandit are seen.— PHOTO: PTI\n\nA sessions court here on Friday, while granting interim bail for six months to JNU students Umar Khalid and Anirban Bhattacharya, applied the “principle of parity” with co-accused and JNU Students’ Union president Kanhaiya Kumar, who was earlier released on interim bail by the Delhi High Court.\n\nUmar and Anirban were arrested on sedition charges in connection with a controversial event organised on the university campus on February 9.\n\nThe sessions judge said allegations against the two accused were similar to those made with respect to the JNU student leader in the status report of police submitted to the High Court during the consideration of his bail application.\n\n“The case set up by the police qua co-accused Kanhaiya Kumar was also of organising as well as participating in the said event,” observed the court.\n\nThe court also noted that the video footage of the February 9 incident had been sent to the forensic sciences laboratory and its analysis and final report would take time. “When all the aforesaid circumstances are weighed together and keeping in view that no previous criminal record has been alleged ... then besides the ground of parity, I deem it appropriate to release both the accused on interim bail,” said the judge.\n\nDefence counsel Trideep Pais argued that there was no violence before or after the varsity event. Even the police had admitted that several videos on the incident, available in public domain, were doctored, while a JNU report had said some outsiders had raised the slogans, he said.\n\nThe police had arrested Mr. Khalid and Mr. Bhattacharya when they surrendered on February 23 night after going missing for 10 days in the aftermath of the JNU event.", 
    "section": "national", 
    "title": "For granting bail, court applies ‘principle of parity’", 
    "subsection": "general", 
    "date": "2016-03-19"
}