{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India and Pakistan should depend on their foreign services [to take forward diplomatic ties] rather than on “businessmen”, Pakistan Opposition leader Imran Khan said, referring to Prime Minister Narendra Modi’s surprise stop in Lahore on December 25 last year. Unconfirmed news reports had suggested that the meeting had been arranged by businessman Sajjan Jindal.\n\n“If there is one reason why PM Modi’s visit to Lahore did not generate as much enthusiasm as it should have, it is the impression in the public that the visit had been made possible by an Indian businessman who had links with the Sharif family,” said Mr. Khan, participating in a television programme “Press Conference”, on ABP News in Delhi.\n\n“If it had been arranged by the foreign offices, it would have been better, there would have been better preparation for the visit, and that would have shown,” he added.\n\nBoth the MEA and the Pakistan government have denied reports that Mr. Jindal, brother of Congress MP Naveen Jindal, played any role in Mr. Modi’s visit, although he was present in Lahore then, to attend the wedding of Mr. Sharif’s grand-daughter. Mr. Khan did not elaborate on his evidence that the businessman had arranged the visit.\n\nTies on positive trajectory\n\nDespite his criticism of the talks, Mr. Khan said overall, India-Pakistan ties were on a more positive trajectory now, terming the cooperation between the two governments over the Pathankot attack investigation as “unprecedented.”\n\n“This is the first time that Pakistan has carried out action against the [Jaish e Mohammad] on the basis of evidence from India, and the first time they are sending a team to investigate in India. We have also seen news reports of intelligence sharing between the NSAs, which has never happened before,” Mr. Khan told journalists on the question-and-answer format show which The Hindu was a part of. The programme will be telecast on Saturday and Sunday.\n\nThe cricket icon is in the country as commentator for the India-Pakistan T20 world cup match at Eden Gardens in Kolkata on Saturday. He said he hoped bilateral cricket between the two countries would be revived soon, and had told Mr. Modi the same when he met him in December 2015. Referring to the Lahore court notice issued against Pakistan captain Shahid Afridi for saying he had received a warmer welcome in India than Pakistan, Mr Khan said it was a mistake to criticise Afridi.\n\nMr. Khan also criticised Himachal Pradesh Chief Minister Virbhadra Singh for refusing to allow the India-Pakistan match in Dharamshala as a protest against the Pathankot attack in which 7 Indian soldiers were killed by suspected Pakistani terrorists. “How can the Pakistani cricket team be held responsible for the attack,” Mr. Khan asked on the TV show.", 
    "section": "national", 
    "title": "Imran flags role of businessman in PM’s Pak. visit", 
    "subsection": "general", 
    "date": "2016-03-19"
}