{
    "author": [
        "M Ahiraj"
    ], 
    "text": "It was a trying cinematic experience for 49-year-old Shamal Rao, resident of Gangavati in Koppal district of Karnataka, who is associated with the film industry as an animator and director of animation films, when he was picked up by the Himachal Pradesh Police who suspected him to be the convict in a double murder facing gallows.\n\nFor, the name of both was the same (Shamal Rao), almost equal in height that might have led to the mistaken identity.\n\nShamal Rao, son of Naidu was convicted for double murder of his hotel owner Mr. Sood and his wife in Sadar in Shimla district, and was awarded capital punishment (to be hanged) by the court in May 2004.\n\nNaidu, who was lodged in central jail, managed to escape in August 2004 and is still at large.\n\nA red corner notice was also issued besides announcing of Rs. 1 lakh award to those who help nab the convict.\n\nMeanwhile, the Himachal Pradesh Police who are on the hot trail of the convict, in one of the browsing on Facebook, chanced upon the Shamal Rao of Gangavati, resembling the convict, that brought them to Gangavati thinking that the convict was living here.\n\nOn March 6, a police team from Shimla, with the help of local police, came to the house of Shamal Rao residing in Vidyanagar locality of Gangavathi town.\n\n“After the preliminary inquiries were over, I made it clear to the police that I am not the person whom they were looking for. The same day, they took me to the Finger Prints Bureau in Koppal and verified my fingerprints, which did not match that brought some relief,” Shamal Rao told The Hindu .\n\n“However, as a formality, they wanted me to go with them to Shimla for further verification and I agreed. They flew me to Shimla and began making inquiries. Later, I volunteered to undergo all medical tests, including DNA, which were carried out, and the experts opined that nothing was matching. After that, a couple of police personnel personally escorted me up to Gangavati and handed over me to my family in the presence of local police on March 11,” he recalls.\n\n“I was confident throughout as I had done no wrong on one hand and later the various tests did not match on the other. Himachal Pradesh Police treated me very courteously during my stay with them for over 10 days and were very fair in their investigation too, which helped me to return very safely. God is great”, he says.", 
    "section": "national", 
    "title": "In a case of mistaken identity, Himachal police pick up Karnataka man", 
    "subsection": "general", 
    "date": "2016-03-19"
}