{
    "author": [
        "Arun S"
    ], 
    "text": "Also, beef ban, in States such as Maharashtra, had recently become controversial and the BJP had turned beef into a major political issue.\n\nNew Delhi has emphasised that if the U.S. wants to export pork/pork products to India without trouble, all such consignments must come with an official veterinary certificate that the animal (pig in this case) was not fed with feed derived from cows/beef/ beef products.\n\nThe requirement of a veterinary certificate stating among other things that “the consignment(s) of processed and unprocessed pork and pork products destined to India do not contain beef and beef products in any form” will not be removed, the sources said.\n\nThey said the U.S. claims the condition is not based on a scientific risk assessment and the concerned international standard (World Organisation for Animal Health). However, citing the example of Australia fulfilling all the pork import norms of India to increase their exports, the Indian authorities have asked the U.S. to do the same, they added.\n\nThe sources said the U.S. has restrictions on import of Indian dairy items on fears of foot-and-mouth disease. Pointing out that all dairy product exports from India are tested to ensure quality, the sources said India will shortly take up bilaterally the issue of U.S. restrictions on these items.\n\nOn its part, the U.S. had strengthened its animal feed norms to prevent the spread of diseases such as Bovine Spongiform Encephalopathy (BSE or the mad cow disease that is transmitted to humans).\n\nFollowing the detection of some cases of BSE, the U.S. Food and Drug Administration had tightened animal feed norms in 1997 and in 2008. It had prohibited “the use of high-risk cattle material (including those derived from BSE-positive cattle) in feed for all animal species.”\n\nThe U.S. has won cases against India at the WTO, including in the ones related to its poultry import ban and the domestic content requirement in its solar power programme.\n\nIndia will shortly take up the\n\nissue of U.S. restrictions on\n\ndairy items", 
    "section": "national", 
    "title": "India insists on beef-free norm", 
    "subsection": "general", 
    "date": "2016-03-19"
}