{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The Congress-led government in Uttarakhand faces a fresh challenge with a serious intra-party rift surfacing on Friday in the State Assembly when two senior party leaders supported the demand of BJP legislators for voting to pass the State Budget.\n\nThe BJP MLAs claimed that they had earned the support of 12 Congress MLAs to prove that the Harish Rawat government was in a minority. As the Speaker turned down the demand, the legislators disrupted the proceedings and chanted anti-government slogans.\n\nMuch to the surprise of Congress leaders, former Chief Minister Vijay Bahuguna and Agriculture Minister Harak Singh Rawat joined the BJP leaders. Following this, Mr. Rawat and senior Congress leader Mantri Prasad Naithani reportedly came to blows.\n\nIn less than three months, after Arunachal Pradesh and Manipur, Uttarakhand is the third Congress-ruled State to plunge into a political crisis due to rebellion from within the party. So far, the party has lost power in Arunachal Pradesh after rebel Congress leader Kalikho Pul dislodged the Nabam Tuki government with the support of BJP legislators.\n\nDisgruntled Congress leaders, led by Mr. Bahuguna, claim to have the support of 12 party MLAs in the 70-member strong House.\n\nEmergency meeting\n\nThe party high command in Delhi has called an emergency meeting on Saturday to take stock of the situation. Sources said party general secretary for Uttarakhand, Ambika Soni, is likely to visit the State on Sunday to meet dissident leaders.\n\nSpeaking to The Hindu , Kishore Upadhyay, State PCC president, ruled out any threats to the government.\n\n“We will sort out the differences very soon,” Mr. Upadhyay said. “It is too early to say the government is in danger.”\n\nTwo leaders back demand of BJP legislators for voting to pass State Budget", 
    "section": "national", 
    "title": "Intra-party rift in Uttarakhand Congress", 
    "subsection": "general", 
    "date": "2016-03-19"
}