{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "On a day when the Comptroller and Auditor-General of India (CAG) report placed in the Bihar Assembly highlighted the poor performance of the State government, the MLAs appeared to be the happiest lot. For, cartons of microwave ovens and rows of trolley bags meant for them were seen stacked up inside and outside the Assembly, and most of the legislators scurried to find a place in the queue to receive them. They then dumped the gifts in their luxury vehicles.\n\nDeputy Chief Minister Tejaswi Yadav said the gifts were given to the legislators as they came from a “not-so-good background.”\n\nEarlier, in the ongoing budget session of the Assembly, the MLAs received smartphones and watches from the government. Many government departments hand out such gifts to legislators in the budget session to “thank them for doing their job by raising questions in the House in public interest, which helps the government in preparing the budget,” said an MLA, adding, “it’s been a tradition for over two decades.”\n\nOnly Rs. 30 lakh: Minister\n\nOn Friday, the microwave ovens of a reputed company were gifted to each MLA by the State Education Department, and the Minister concerned, Ashok Chaudhury, said: “It’s just a matter of about Rs 30 lakh.”\n\nWhen reminded that the State schoolteachers had not received their salary for the last several months, Mr. Chaudhury said: “It’s unfair to compare this to other issues like salaries and condition of schools … in fact, our MLAs need to travel in their constituencies to inspect mid-day meals. So when they go, they can take their microwave ovens with them to keep the food warm.” The Bihar Assembly has 243 members and the election affidavits of many of them show they are millionaires and own several luxury vehicles, even firearms. When the session starts, the Assembly premises witnesses a rush of all kinds of SUVs and luxury vehicles.\n\n‘Teachers’ wages not paid’\n\n“It’s a cruel joke on the people of the State. While their representatives get such expensive gifts and bounties, the government is not able to pay salaries to its schoolteachers,” Ramadhin Prasad, a schoolteacher, said.\n\nSmartphones and microwave ovens\n\nto encourage MLAs to do their legislative durty", 
    "section": "national", 
    "title": "It’s raining gifts for Bihar legislators", 
    "subsection": "general", 
    "date": "2016-03-19"
}