{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "After their release from the Tihar jail, Umar Khalid andAnirban Bhattacharya address students on the JNU campusin New Delhi on Friday.— Photo: Shiv Kumar Pushpakar\n\nThe JNU students, who were served show-cause notice by the proctor’s office in connection with the controversial February 9 event on the campus, have in their reply submitted on Friday, questioned the charges on the basis of which they have been held “guilty”.\n\nBased on the high-level enquiry committee’s report, 21 students were served show-cause notice on March 14 and were given time till Friday to reply to the notices.\n\n“All the students have sent their replies to the show-cause notice. They have questioned the charges on the basis of which they have been held guilty. In a meeting of the JNUSU, we have decided that in our reply, we are going to question the composition of the committee and the outcome of the report,” said Rama Naga, general secretary, JNUSU.\n\n“Look at the process that has been followed by the committee. It did not even take the deposition of the students who were debarred. And, in its report, it says JNU students were not involved in anti-India sloganeering. If we were not involved in raising any objectionable slogans, why were we suspended for so long?” Mr. Naga asked.\n\nThe students had refused to accept the committee’s report, maintaining that their reply to the proctor’s office would also be in accordance with that. A call of protest was also given by the JNUSU on Friday afternoon, opposing the enquiry committee.\n\n“What are the charges on the basis of which we have been held guilty, since the report does not clarify anything in its findings,” read the reply of a student.\n\nA meeting of the proctors was also held on Friday to discuss the replies. The quantum of punishment will be decided by the Chief Proctor on the basis of the replies and the recommendations submitted by the committee. The panel is believed to have recommended the rustication of Umar and Anirban and imposition of fines for the others.\n\nThe students served with show-cause notice were Kanhaiya Kumar, Rama Naga, Anirban Bhattacharya, Umar Khalid, Ashutosh Kumar, , Aishwarya Adhikari, Chintu Kumari and ABVP’s Saurabh Sharma among others.", 
    "section": "national", 
    "title": "JNU students question charges", 
    "subsection": "general", 
    "date": "2016-03-19"
}