{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Will you get police from U.S. for Bengal polls?”\n\nA day after the Election Commission issued transfer orders to 40 police and administrative officers in poll-bound West Bengal, Chief Minister Mamata Banerjee on Friday targeted the Commission, asking if it had faith in the State’s police apparatus or would it call in forces “from the United States?”\n\n“Tell me... if you don’t have faith in Bengal’s administrative system, then you ask (U.S. President Barack) Obama. He will supply police for you. Then you take them to the villages and see whether they are giving you votes or not,” Ms. Banerjee thundered during a public meeting in north Bengal.\n\n“What else do you want BJP,… CPI (M),” a visibily angry Chief Minister said, also asking Opposition parties, “Will the EC also help you get votes?”\n\nThe transfer of officials comes after a full bench of the Commission visited the State and expressed concern over “some laxity” in the enforcement of the model code of conduct in certain areas and by some officials.\n\n“There is an elected government (here). Delhi is behaving as if Emergency has been imposed here... more than Emergency,” the Chief Minister said.\n\nDuring the 2014 Lok Sabha elections also, Ms. Banerjee had reacted strongly to such transfers and reinstated the officers after the polls.\n\n‘No objection’\n\nMs. Banerjee however, said she did not have any objection to the transfers since “whoever will get the charge will be our people and the State’s officers.”\n\nMs Banerjee demanded that if State police were not to be used for the polls then the same norms should be used for all State Asselmbly elections. “In Delhi polls, the Delhi Police should not be used. I will see that day...,” she said.\n\nMeanwhile, the Trinamool Congress held a rally here protesting against “canards” of the Opposition, particularly in the wake of a sting operation where a number of leaders of ruling party were allegedly exposed accepting cash from a fictitious firm.", 
    "section": "national", 
    "title": "Mamata rages against pre-poll transfers", 
    "subsection": "general", 
    "date": "2016-03-19"
}