{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The Indian diaspora will no longer have to get a visa affixed on their passports every time they travel to India as the Union government has decided to do away with the process.\n\nThe government has decided that since the categories Overseas Citizen of India (OCI) and Persons of Indian Origin (PIO) were merged last year, the OCI card will suffice to enter the country and hence would require no visa.\n\nCarrying a passport will, however, be mandatory, an official said.\n\n“Till now, every OCI card holder also had to get a visa affixed from the Indian High Commission whenever they planned a visit to India. Now, only the OCI card will be needed,” a senior government official said.\n\nThe government is also planning to make arrangements to print OCI cards at a few big missions such as those in the U.K and the U.S., countries where many Indians reside.\n\nThe OCI card bears certain security features that cannot be tampered with and are made after several layers of checks.\n\nPrime Minister Narendra Modi announced in 2014 that the PIO and OCI categories would be merged for the benefit of the diaspora.\n\nAmendment\n\nThe government amended the Citizenship Act last year and a notification was issued to merge the two cards.\n\n“Since the announcement, there was a lot of confusion among the diaspora regarding the two cards. The respective missions in foreign countries held workshops and tried to clear doubts. The earlier deadline to migrate from PIO to OCI was January 2016, but we have now extended the deadline to June 30,” the official said.\n\nAn official explained that the move would also help create a database of the Indian diaspora as a consolidated figure is not present with the government.\n\nAfter the notification was issued last year, only one OCI card with enhanced benefits is in existence.\n\nOrdinance\n\n“Keeping in view the promise [made by PM Modi in the USA and Australia in 2014], an ordinance was promulgated on January 6, 2015 whereby the eligibility and additional benefits of the PIO card have been incorporated in the OCI card and certain other relaxation to OCI card holders have been given by amending the Citizenship Act, 1955. The PIO and the OCI cards used to exist simultaneously, leading to a lot of confusion among the PIOs residing abroad,” an official said.\n\nThose with the document will not require a visa,\n\nbut passport will\n\nbe mandatory", 
    "section": "national", 
    "title": "OCI cards enough to visit India", 
    "subsection": "general", 
    "date": "2016-03-19"
}