{
    "author": [
        "S Anandan"
    ], 
    "text": "Kerala artist dons black paint to draw attention to cast bias\n\nThe strident outcries for justice to Rohit Vemula, and for Dalits and other socially underprivileged sections in its wake, may be thinning down. But a young Kerala artist has taken it upon herself to keep the focus locked on issues of caste bias through a unique public experiment.\n\nShe is doing it by ‘living’ the surrogate life of a black body in a public space.\n\nP.S. Jaya, a promising artist, wanted to find out how it was being a black body in a fairness-obsessed Indian society. On January 26, she embarked on a performance which involved daubing her body with soot-black kajal every day, as if in a ritual, before stepping out of her home near Tripunithura. Fifty days past the beginning of this daily performance, which invited reactions on the street ranging from the incredulous to the ludicrous and the condescending to sympathetic and affirmative, she has now extended the project till May 5.\n\n“While I’ve never felt not being myself under the skin when I’m in public ‘wearing’ a dark complexion, people have their doubts. Some are anxious. Some are keen to know why I am doing it and engage me in discussions, especially on bus rides. Some look in wonderment, while some others simply laugh it off. There was this middle-aged woman who kept staring at me on the bus the other day and dryly remarking, as I was alighting, as to why someone should appear in the guise of Poothana!,” says the artist.\n\nKalakakshi, a young artists’ collective in town in which she’s a member, organised an in-situ performance of women artists on International Women’s Day in which Jaya had her body wrapped in a wire cage illuminated by LED bulbs.\n\n“Through the network of artists, she’s trying to throw light into the gratuitous renewal of certain morose conceptualisations, like demonising the black body and existence or equating it with anything that is inferior,” explains Jaya’s sister and fellow artist P.S. Jalaja.\n\nJaya intends to document the daily performance in the coming days through photographs, videos, jottings and an inclusive calendar.\n\nA part-time painting teacher and a Bharatanatyam student at a dance school at Panampilly Nagar, she plans to give a Bharatanatyam recital with her face and body painted black.", 
    "section": "national", 
    "title": "Protest gets an ebony face", 
    "subsection": "general", 
    "date": "2016-03-19"
}