{
    "author": [], 
    "text": "He said there was consensus that Punjab did not have even a single drop of water to spare. Hence, there had never been any need to construct the canal. “Neither is it even possible to do so. I wish to state in the most unequivocal terms that we will not allow this canal to be constructed at any cost,” Mr. Badal said.\n\nOn other hand, Haryana Chief Minister Manohar Lal Khattar described the resolution as violation of the Supreme Court’s order and hoped that the court would take a serious note of it.\n\nThe press release issued by the Haryana government said that while replying to the discussion on the Governor’s address during the ongoing session of the Assembly, Mr. Khattar said that in light of the Supreme court’s decision to maintain the status quo, Haryana would present its case in the court along with the resolution passed by the Punjab Assembly.\n\nLater, talking to reporters, Mr. Khattar said: “It appeared the issue now raised by Punjab was aimed at gaining mileage during the ensuing elections.” He said the issue belonged to Haryana and not to Punjab as the Presidential Reference had been pending for the last several years and the Haryana government had pleaded for its early hearing. “As the Supreme Court accepted the request of Haryana, the nervousness of Punjab was revealed. Now, it is between Supreme court and the Punjab government, and Haryana has no role in it,” Mr. Khattar said. Mr. Khattar said Haryana would do everything possible to get its share of the Ravi-Beas waters through the SYL canal.\n\nTaking a dig at the Congress, Mr. Khattar said the Congress had never worked to protect the interest of the people of the State. “It was the pre-planned strategy of the members of the Congress so that they remain outside the House during the budget session,” he said.", 
    "section": "national", 
    "title": "Punjab House passes resolution", 
    "subsection": "general", 
    "date": "2016-03-19"
}