{
    "author": [
        "National Bureau"
    ], 
    "text": "Union Home Minister Rajnath Singh said on Friday he came to know about the arrival of an investigation team from Pakistan “through the media” and was awaiting External Affairs Minister Sushma Swaraj’s return from Nepal to get further details.\n\nMr. Singh’s statement elicited a sharp attack from the Opposition Congress party, which alleged a “lack of coordination in the government” ahead of the visit of a joint investigation team (JIT) from Pakistan to investigate the terror attack in the Pathankot airbase.\n\nAsked about the Pakistan investigation team, Mr. Singh said, “I have come to know through the media that the Pakistan team is coming. We are fully prepared. Let’s wait for Sushmaji [Ms. Swaraj] to be back.”\n\nSenior party spokesman Anand Sharma told reporters that Prime Minister Narendra Modi should have ensured coordination by convening a meeting of the Cabinet Committee on Security before Ms. Swaraj’s visit to Pokhara in Nepal for the SAARC Foreign Ministers Meeting.\n\nThe announcement about the Pakistani team’s visit had come after Ms. Swaraj’s meeting with Pakistan Prime Minister’s Adviser on Foreign Affairs Sartaj Aziz in Pokhara on Thursday.\n\n“There is no coordination in this Cabinet,” Mr. Sharma said, adding that the Defence Minister, the Home Minister and his Minister of State were speaking in different voices. “The Home Minister is not aware of the JIT. The Defence Minister is saying a different thing,” he said.\n\nSeeking to know the government’s road map on Pakistan, Mr. Sharma said the Congress was not opposed to engagement with Islamabad. He, however, said Pakistan had not fulfilled its commitments in the wake of the 26/11 Mumbai terror attack.\n\nMr. Sharma wondered what understanding had been reached during the meeting of the NSAs of the two countries in Bangkok that convinced the Prime Minister to go to Lahore. Making a plea to take the Opposition leadership into confidence, Mr. Sharma said the Congress was justified in asking the Prime Minister what assurances convinced him to go ahead with the peace process.", 
    "section": "national", 
    "title": "Rajnath in the dark about Pak. probe team’s arrival", 
    "subsection": "general", 
    "date": "2016-03-19"
}