{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Ready to face the vote of confidence, says Chief Minister\n\nThe Congress rule in Uttrakhand is in danger as nine of its legislators rebelled and joined 28 BJP MLAs who staked claim to form a new government on Friday.\n\nAt 11.30 p.m., the dissident leaders, along with their BJP counterparts, were on their way to meet the Governor to prove the majority in the 70-member House.\n\nHowever, Chief Minister Harish Rawat told reporters that the BJP could not cobble up the government with the dissident leaders since “five leaders from their camp are ready to join the Congress.”\n\n“We are ready to face the vote of confidence,” Mr. Rawat said.\n\nOn Friday evening, serious intra-party rift surfaced in the Assembly when two senior Congress leaders supported the demand of BJP legislators to conduct voting in the House to pass the financial budget.\n\nThe BJP MLAs claimed that they had earned the support of 12 Congress MLAs to prove that the Harish Rawat government was in a minority. As the Speaker turned down their demand, they disrupted the proceedings and chanted anti-government slogans.\n\nMuch to the surprise of Congress leaders, former Chief Minister Vijay Bahuguna and Agriculture Minister Harak Singh Rawat joined the BJP leaders. Following that, Mr. Rawat and senior Congress leader Mantri Prasad Nithani reportedly exchanged fists.\n\nIn less than three months, after Arunachal Pradesh and Manipur, Uttrakhand is the third Congress-ruled State that has plunged into political crisis because of rebellion stemming from within the party. So far, the party has lost power in Arunachal Pradesh after rebel Congress leader, Kalikho Pul, dislodged the Nabam Tuki government with the support of BJP legislators.\n\nThe disgruntled Congress leaders, led by Mr. Bahuguna, claim to have the support of 12 party MLAs in the 70 member-strong House.\n\nThe party high command in Delhi has called an emergency meeting for Saturday. Sources said Ambika Soni, party general secretary for Uttrakhand, is likely to visit the State on Sunday to meet the dissident leaders.\n\nSpeaking to The Hindu , Kishore Upadhyay, PCC president in Uttrakhand, ruled out any threats to the government. “We will sort out the differences very soon,” Mr. Upadhyay said. “It is too early to say the government is in danger.”", 
    "section": "national", 
    "title": "Rebellion in Cong. threatens Rawat govt. in Uttarakhand", 
    "subsection": "general", 
    "date": "2016-03-19"
}