{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "Finance Minister of Maharashtra Sudhir Mungantiwar (right) and his deputy Deepak Kesarkar garlanding an idol of Chhatrapati Shivaji before presenting the budget in Mumbai on Friday.— Photo: PTI\n\nMaharashtra Finance Minister Sudhir Mungantiwar on Friday presented the State budget with a Rs. 25,000-crore allocation for the agriculture sector amidst growing concerns over a spate of farmer suicides and distress in the rural economy.\n\nThe second budget of the Bhartiya Janata Party (BJP) government was presented in the Assembly with an estimated revenue deficit of Rs. 3,757 crore, but revised to Rs. 9,209 crore mainly on account of relief packages for drought-affected farmers in over 15,000 villages.\n\nThe State agriculture sector has reported a 2.7 per cent decline in growth rate as opposed to the targeted rate of 6 per cent as a result of back-to-back patchy monsoon.\n\n“The State has been facing a severe drought for three successive years due to the vagaries of the monsoon. This budget is dedicated to our farmers, who the government is committed to extending maximum support to, during this time of crisis,” said Mr. Mungantiwar. His 90-minute speech was peppered with poetry dedicated to farmers, tribal people and women, with 27 minutes dedicated to outlining the State’s agriculture strategy.\n\nThe Opposition blasted the budget as nothing but a smart ‘jugglery’ of numbers, which appears to be giving more to farmers but takes away a lot from the middle class. It alleged that the special allocation for the agriculture sector glosses over the government’s mismanagement of the farm crisis.\n\n“The allocation hides the government’s financial indiscipline and has nothing much to bring home for the farming community. The Rs. 25,000-crore number is just statistical jugglery,” said senior Congress leader Ratnakar Mahajan. The budget, with an estimated revenue mobilisation of Rs. 2,20,810 crore as against revenue expenditure of Rs. 2,24,454 crore, turned out to be a reflection of the national budget, which too had focussed on irrigation and agriculture.\n\nFor the irrigation sector, Mr. Mungantiwar proposed an allocation of Rs. 7,850 crore against Rs. 7,272 crore in the previous year.\n\nTo make up for the jump in revenue deficit, the government proposed additional tax proposals worth Rs. 363 crore, which would directly and indirectly affect the middle class.\n\nThese include increasing entry tax on marble and granite, tea and coconut oil, and increasing VAT on all goods and services to 5.5 per cent (excluding declared goods) from 5 per cent.", 
    "section": "national", 
    "title": "Rs. 25,000 cr. for agriculture sector", 
    "subsection": "general", 
    "date": "2016-03-19"
}