{
    "author": [], 
    "text": "While Facebook has evolved with new features, Twitter has changed little since it began\n\nAs Twitter marks its 10th birthday on Monday, it is somewhat of an awkward child — having become a powerful communication tool but still struggling to win users and reach profitability.\n\nSince making a star-quality entrance a decade ago, Twitter has become a must-have tool for journalists, activists and celebrities but has struggled to show it can expand beyond its devoted “twitterati” to become a mainstream hit.\n\nWhile Internet lovers might have trouble envisioning life without Twitter, the San Francisco-based company has seen its stock tank, a chief executive leave, and its staff cut.\n\nTwitter’s woes include a slump in its stock price to all-time lows this year — down nearly half from its 2013 stock market debut — and ongoing losses, even as its revenue grows.\n\nTwitter’s base of monthly active users remained stuck at 320 million at the end of 2015. While that is a big accomplishment, Twitter has failed to keep pace with fast-growing rivals and to expand beyond its base.\n\nThe troubles have forced Twitter to bring back co-founder Jack Dorsey as chief executive, but that has not stemmed rumours about a possible buyout or merger.\n\n“It’s not dead yet,” independent analyst Rob Enderle of the Enderle Group said of Twitter.\n\n“Watching all the metrics, you see they are not getting a lot worse but they don’t seem to be getting better either,” he said.\n\nSome analysts believe Twitter’s true value is being demonstrated in the US presidential race, especially by the Republican frontrunner, Donald Trump.\n\n“Eight weeks ago, I would have said the days of Twitter are over; I don’t say that anymore,” Global Equities Research analyst Trip Chowdhry said.\n\nTwitter has ‘legs’\n\nThe analyst said Mr. Trump has shown how potent Twitter can be for those who embrace it.\n\n“I think that probably the worst for Twitter is over,” Mr. Chowdhry said. “This platform has legs.”\n\nMr. Chowdhry said Prime Minister Narendra Modi also used Twitter effectively to win his campaign and Tesla founder Elon Musk has been shaking up the auto sector with the help of the messaging platform.\n\nTwitter and other social media have been important tools in movements such as the Arab Spring, and in protests in Turkey, where the government has sought to ban it.\n\nAn advantage of Twitter is that it lets users “amplify” messages with tweets that echo on the Internet, and assess public sentiment in real-time by getting quick feedback.\n\nMr. Trump has boosted the number of his followers to nearly seven million, and has managed to beat rivals with a campaign largely based around Twitter.\n\n“I am pretty sure most of his followers are not on Twitter, but they know what he is saying on Twitter,” analyst Omar Akhtar of the technology research firm Altimeter Group, said of Mr. Trump.\n\n“The Twitter effect cannot be ignored. Twitter has a life beyond its platform, the trouble is it doesn’t know how to monetise that part,” Mr. Akhtar said.\n\nThe research firm eMarketer lowered its revenue estimates for Twitter this month, saying its “monetisation” efforts — the selling of advertising or “promoted tweets” for those who use the platform without logging in — are falling short.\n\n“Events like the US election and Summer Olympics this year may prove pivotal to the success of this strategy,” said eMarketer’s Martin Utreras.\n\nChange brings risk\n\nTwitter bears the weight of being measured against Internet titans such as Facebook, which is only a few years older but has eclipsed the billion-user mark.\n\nFlight VC partner Lou Kerner, whose investor group watches emerging companies, said Twitter has done “an amazing job”, creating a new communication medium but appears to have levelled off instead of becoming ubiquitous.\n\n“Like any other company, Twitter is judged on growth,” Mr. Kerner said. “They have stagnated.”\n\nEven more troubling, Mr. Kerner noted, is that engagement at Twitter has been ebbing in an indication that “people have been tired of it.”\n\nWhile Facebook has evolved with new features, Twitter has changed little since it began, according to Mr. Kerner.\n\n“In order to reignite engagement, they would have to make profound changes to what they do,” he said.\n\n“The problem is, you can’t make a make a massive change without a massive risk,” he added. — AFP", 
    "section": "national", 
    "title": "Twitter an awkward child as it turns 10", 
    "subsection": "general", 
    "date": "2016-03-19"
}