{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "Jawaharlal Nehru University students Umar Khalid and Anirban Bhattacharya — who were in judicial custody for more than three weeks after their arrest on sedition charges in connection with a controversial event organised on the university campus on February 9 — were granted interim bail for six months by a sessions court here on Friday.\n\nAdditional sessions judge Reetesh Singh granted relief to the two students, while applying the “principle of parity” with co-accused, JNU Students’ Union president Kanhaiya Kumar, who was earlier released on interim bail by the Delhi High Court on March 3.\n\nThe judge at Patiala House district court observed in his 12-page order that the role attributed to Mr. Kumar did not appear to be different from the allegations levelled against the two accused. The police have claimed that some anti-national slogans were raised at the event, held in the varsity to oppose the hanging of Parliament attack convict Afzal Guru.\n\nThe court released both Mr. Khalid and Mr. Bhattacharya on their furnishing of a personal bond for Rs. 25,000 each with one surety. The court directed the two students not to leave the city without its permission during the bail period and to make themselves available before the investigating officer whenever required.\n\n“The case set up by the police qua co-accused Kanhaiya Kumar was also of organising as well as participating in the said event,” the court said.\n\nIt also noted that the video footage of the February 9 incident had been sent to the forensic sciences laboratory and its analysis would take time. “When all the aforesaid circumstances are weighed together and keeping in view that no previous criminal record has been alleged ... besides the ground of parity, I deem it appropriate to release both the accused on interim bail,” said the judge.\n\nDefence counsel Trideep Pais argued that there was no violence before or after the event. Even the police had admitted that several videos of the incident, available in the public domain, were doctored.", 
    "section": "national", 
    "title": "Umar, Anirban back at JNU", 
    "subsection": "general", 
    "date": "2016-03-19"
}