{
    "author": [
        "Ramya Kannan"
    ], 
    "text": "Anthropologists study how local populations network in different parts of the globe\n\nResearchers say that social media has an impact on gender equations as men and women, especially in conservative societies, have sustained contact online.— photo: AFP\n\nLove it, or hate it, it is rare that you ignore social media. A few anthropologists from across the world took this seriously enough to conduct an eight-country in-depth analysis on how local populations behave and interact across social media and how these platforms are impacting the way we live.\n\n“Why we Post” is the culmination of 15 months of living in these countries and studying social media impact.\n\nThe project has resulted in 11 Open Access books, a free e-learning resource and a website with over 100 films.\n\nFor 15 months the anthropologists asked a number of questions about social media — its effect on education amongst different class groups; what constitutes ‘selfies’ in different places; the conservative nature of social media; how it serves commerce; whether equality is possible online; whether it then transfers offline; and who actually determines the structure and form of social media.\n\nThe project is a joint effort of the Global Social Media Impact Study based at the Department of Anthropology, University College, London, and the European Research Council.\n\nTaking ownership\n\nShriram Venkatraman, one of the researchers, and the project head in India, one of the sites of study, says: “This is how we looked at social media: it is the people who use social media who create it, not the developers of platforms; how has the world shaped social media, not just the usual how has social media changed the world. People appropriate technology and use it, possibly for a completely different purpose.” For instance, the team found that people take ‘footies’ in Chile, ‘uglies’ in the U.K. and that in China, selfies are more popular among young men.\n\nSocial media, they found, had a profound impact on gender politics around the world, especially in conservative societies, where men and women can have sustained and direct contact, often through fake accounts.\n\nThey also found that social media is serving local purposes across the world, wherepeople tweak it to serve them better.\n\nEach team conducted an in-depth analysis into how the local populations behaves and interacts across social media channels and how this impacts life.\n\nThey found that equality in access to technology does not often translate to equality online; for instance in Brazil, domestic help might have the same smartphones as their employers, but that does not lead to employers ‘befriending’ them.\n\nIs social media a threat to privacy? While there is considerable anxiety on that question, there remain pockets in east and South Asia where people live in extended families with limited expectations of individual privacy, where social media seems to offer just that kind of privacy.\n\nDaniel Miller, professor of anthropology, UCL, spearheaded the project. “It is surprising how little we knew about how ordinary people all around the world use social media and the extraordinary consequences it is having on their lives,” he says.\n\nThe results of the project are available at ucl.ac.uk/Why-we-post, and is being offered as a free e-learning course in English, Tamil, Hindi and a few other languages.", 
    "section": "national", 
    "title": "Why we post on social media", 
    "subsection": "general", 
    "date": "2016-03-19"
}