{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "“The work is my way of coming to terms with my loss,” says Shumita Deb\n\nSince the death of her father, legendary playback singer Manna Dey, Shumita Deb has been at the centre of a family feud involving his assets. Now, the daughter of the late Padma Bhushan recipient is writing a book on her father and the Dey family.\n\nShumita Deb, who is based in Bengaluru, told The Hindu that the book, in English, is her way of coming to terms with the loss of the family and the vicious campaign she was subjected to after her father’s death. “In the last three years, I lost my mother, closely followed by my father in 2013 and I lost my elder sister to cancer two months ago. Today, I am the only person left of the lineage, but without a family. It has been a very traumatic time as I continue to fight a legal battle and malicious campaign,” she said.\n\nWriting the book was a herculean task as Manna Dey had left behind no letters. “I have been writing from my memory. Though much has been written about my father, none knows how he was with his family, how he was as a father. He was an intensely private person. This book will be a portrait of a father as seen by his daughter,” said Ms. Deb.\n\nControversy\n\nHer husband Jnan Ranjan Deb said the book would also include Ms. Deb’s version of events following Dey’s death. The family’s decision not to return to Kolkata for the legendary singer’s funeral had, according to Ms. Deb, annoyed West Bengal Chief Minister Mamata Banerjee and triggered a vicious campaign against her and her husband in the Bengali media.\n\n“I lost my father and even before we could come to terms with it, we were appalled to find people who didn’t even know the family well making wild allegations,” Ms. Deb said.\n\nFaced with hundreds of threatening calls after an article in the Bengali press, the couple now request police protection every time they visit Kolkata.\n\nManna Dey lived with his daughter in Bengaluru till his death. “I am the youngest child and was the apple of my father’s eye. I have always lived with him,” Ms. Deb said.", 
    "section": "national", 
    "title": "A daughter’s tribute to father", 
    "subsection": "general", 
    "date": "2016-01-09"
}