{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "CM will have to rein in factionalism in PDP, take BJP along\n\nPeoples Democratic Party (PDP) president and MP, Mehbooba Mufti, tipped to become Chief Minister of Jammu and Kashmir, may have age and dynamism on her side, but faces many uphill tasks — from within the party and the inherent contradictions of the rare PDP-BJP coalition that her father, the late Mufti Mohammad Sayeed, cobbled together.\n\nKnown as a “rabble-rouser” and “grassroots leader” within the PDP, Ms. Mufti, 56, unlike her father, faces factionalism emanating from a generation gap. Her father was able to keep the party together by prevailing upon the ambitious older cadre.\n\n“She faces the serious challenge of holding together the factions. There are small groups within the party despite the ideological and generational gap,” says Gull Mohammad Wani, Professor at the Department of Political Science, University of Kashmir.\n\nHowever, the bigger challenge for Ms. Mufti remains the tenuous coalition with the BJP. The two parties took more than two months to reach an agreement in 2014, overcoming contentious issues, to govern the State based on the common minimum programme, termed “Agenda for Alliance”.\n\n“She has to take the coalition partner BJP along to act like a catalyst of transformation. Unfortunately, Jammu and Kashmir has not seen any significant leaps on account of development, governance, dialogue process, peace initiatives and communal issues. All eyes would be on how she transforms things on the ground without annoying the coalition partner and her own constituency,” Professor Wani said.\n\nThe coalition partners have witnessed periodic friction on issues such as release of separatist leader Masarat Alam, Article 370, hoisting the State flag and ban on beef. However, the Mufti with his persuasion and patience managed to walk the middle path.\n\nFather’s success\n\nPDP supporters expect Ms. Mufti at least to replicate her father’s successes during his last tenure between 2002 and 2008, which saw a new phase of development and resolution, with the opening of cross-LoC services.\n\nMs. Mufti, who has carved out a constituency among secessionists by visiting families of slain militants and pulling out of the PDP-Congress coalition government in 2008 over the Amarnath land row, faces a new phase of militancy and a State in poor economic shape following the devastating floods of 2014.", 
    "section": "national", 
    "title": "A fine line to tread in J&K", 
    "subsection": "general", 
    "date": "2016-01-09"
}