{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Friday asked the Centre and public sector banking authorities to consider providing reservation to Scheduled Castes and Scheduled Tribes employees in promotion to officers’ ranks at all levels.\n\n“The grievance of the employees belonging to the Scheduled Castes and Scheduled Tribes category is that there is negligible representation of employees belonging to their community in the officers’ category at all levels,” a Bench of Justices J.Chelameswar and A.K. Sikri observed in a judgment.\n\nKeeping in view the statistical figures which have been placed on record showing their representation in officer ranks, it would be open to the authorities, namely, the state and the banks to consider whether their demand is justified, and it is feasible to provide reservation to the Scheduled Castes and Scheduled Tribes category in promotion in the officers’ category and if so, upto which scale/level,” said the verdict authored by Justice Sikri.\n\nThe judgment was delivered on review petitions filed by the Centre, Central Bank of India Scheduled Castes and Scheduled Tribes Employees’ Welfare Association and others against the apex court judgment of January 9, 2015.\n\n“We are conscious of the fervent plea raised by the respondent employees that employees belonging to the Scheduled Castes and Scheduled Tribes category should be made eligible for promotion by providing reservation in the promotional posts as well, as their representation is abysmally minimal. Whether there is any such justification in the demand or not is for the state to consider and make a provision in this behalf,” the Bench said.\n\nThe banks contended that there was no rule for reservation in promotion in Class-A (Class-I) to the post having a basic salary of more than Rs.5,700 per month.\n\nThey argued that a 1997 office memorandum merely provided for concessions for Scheduled Castes and Scheduled Tribes category staff in promotion.\n\nEmployees from the community say they have poor representation in officer ranks", 
    "section": "national", 
    "title": "Banks asked to consider quota for SC/ST staff", 
    "subsection": "general", 
    "date": "2016-01-09"
}