{
    "author": [], 
    "text": "Cate Blanchett as Carol Aird in a scene from the film Carol and Tom Hanks in a still from Bridge of Spies .— Photos: AP\n\nThriller Bridge of Spies and Carol , the story of a romance between two women, earn nominations\n\nSteven Spielberg spy thriller Bridge of Spies and Carol , the story of a romance between two women, led nominations on Friday for Britain’s Bafta film awards, seen as a tip for later Oscar success.\n\nBoth Cold War era stories set in the United States in the 1950s, the films have nine nominations each and are both nominated in the best film category.\n\nThey are up against financial drama The Big Short and survival tale The Revenant , which has eight nominations.\n\nAlso in the running for best film is Spotlight — the story of the journalists who uncovered sexual abuse in the Catholic Church, which led the nominations of the Golden Globes along with Carol .\n\nThe awards will be announced on February 14, two weeks before the Oscars.\n\nIrish actor Saoirse Ronan, 21, is nominated for best actress for her performance in Brooklyn , the story of an Irish immigrant to New York which has six nominations.\n\nThe other nominees for best actress are Cate Blanchett for Carol , Brie Larson for Room , Maggie Smith for The Lady in the Van and Alicia Vikander for The Danish Girl — who is also up for best supporting actress for her role in thriller Ex Machina .\n\nVikander’s fellow star in The Danish Girl , British actor Eddie Redmayne, who plays a transgender artist, is nominated for best actor for the same film.\n\nIt is Redmayne’s second best actor nomination in a row after winning the award last year for portraying scientist Stephen Hawking in The Theory of Everything .\n\nRedmayne will be up against Leonardo DiCaprio for The Revenant , Michael Fassbender for Steve Jobs , Matt Damon for The Martian and Trumbo star Bryan Cranston — known for his leading role in television hit Breaking Bad .\n\nIn the best director category, Spielberg is up against Mexico’s Alejandro Gonzalez Inarritu, Britain’s Ridley Scott, and U.S. directors Adam McKay and Todd Haynes. — AFP", 
    "section": "national", 
    "title": "Cold War stories lead Bafta picks", 
    "subsection": "general", 
    "date": "2016-01-09"
}