{
    "author": [
        "Alan Yuhas"
    ], 
    "text": "New evidence shows that they had courtship rituals just like modern birds\n\nPaleobiologists Martin Lockley (right) and Ken Cart kneel beside two large Cretaceous-age scrapes from western Colorado that are the first physical-reported evidence that large theropod dinosaurs engaged in courtship behaviour.— Photo: AFP/Nature/M. Lockley\n\nPredatory dinosaurs performed a ritual, bird-like dance to woo their mates, according to paleontologists who have studied huge scrape marks left behind by the animals in western Colorado.\n\nPaleobiologists have long speculated that dinosaurs had mating rituals like those of their descendants, modern birds, but the scrapes would be the first physical evidence of “dinosaur foreplay”, lead scientist Martin Lockley said.\n\n“We know they had feathers and crests and good vision,” Prof. Lockley said, speaking of theropods, the carnivore family of Tyrannosaurs rex .\n\n“They were visual animals, but there’s never been any actual physical evidence that their anatomy and behavior was co-opted for fairly energetic display. This is physical evidence.”\n\nThe roughly 50 scrape marks were found in 100m-year-old sandstone, in irregular groupings that look like the display arenas some birds gather in to compete for mates. The scrapes run in five- and six-foot patterns that resemble the traces left behind by courting birds.\n\nIn a paper published on Thursday in Scientific Reports , Prof. Lockley and his co-authors compared the patterns to those left by puffins and ostriches, and deduced that the marks did not represent nests or digging for water or food.\n\nProf. Lockley, a professor of geology with the University of Colorado Denver, said the scored and scratched patterns converged nicely with longstanding interpretations of dinosaur behaviour and the study of modern birds.\n\nHe added that he thought the dinosaurs made vocal sounds as birds do during their mating ceremonies. — © Guardian Newspapers Limited, 2016\n\nthe dinosaurs made vocal sounds as birds do during their mating ceremonies", 
    "section": "national", 
    "title": "‘Dinosaurs performed dances to woo mates’", 
    "subsection": "general", 
    "date": "2016-01-09"
}