{
    "author": [], 
    "text": "These events shall take place in these areas at such places as the district magistrate or collector explicitly permits, and that the bull once out of the enclosure shall be tamed within a radial distance of 15 metres.\n\nPolitical reactions to the move in the capital were muted, with both the ruling BJP and the Congress treading safely on the issue, qualifying their support for tradition with a concern for animal and human safety.\n\nFor, many see the custom as cruelty to animals and humans. A senior functionary of the government, however, said the notification has been issued without the Cabinet passing it. Sources say it was just mentioned at a Cabinet meeting without being on the agenda.\n\nA source in the Ministry of Environment and Forests, however, explained this by claiming that the notification just “clarified” the previous notification of 2011, an argument with uncertain legal standing.\n\nThe notification’s bid to regulate the sport is being seen as an attempt not to attract accusations of sidestepping concerns altogether. “What we have allowed is with safeguards ensuring that there is no cruelty to animals,” Environment Minister Prakash Javadekar said.\n\nBJP spokespersons skirted the issue, with three national spokespersons choosing not to respond to the move.\n\nThe Congress on its part advised qualified caution.\n\n“The Congress respects traditional sports that have come down generations. The important issue, however, is to ensure there is no cruelty to animals and that the sport is safe for participants and onlookers. This is something the government must ensure,” spokesperson Randeep Singh Surjewala said.\n\nWhile Union Minister Pon Radhakrishnan of the BJP was seeking a government initiative to permit the event as Pongal comes, Union Minister Maneka Gandhi had early in 2015 said that jallikattu was a “western concept,” supporting the ban on the grounds that both animals and humans were killed because of it.\n\n‘Congress respects traditional sports... However, it is vital to prevent cruelty to animals’", 
    "section": "national", 
    "title": "Jallikattu in T.N. cleared", 
    "subsection": "general", 
    "date": "2016-01-09"
}