{
    "author": [
        "S Anandan"
    ], 
    "text": "Artists of Kalakakshi making a sculpture of art student Liza Herzeline Rapael (left) who was one of the artists of the group allegedly assaulted by the police on New Year night.— Photo : Thulasi Kakkat\n\nIn what its angry proponents claim to be the launch of a ‘sustained’ cultural campaign against moral policing by the police, some 15 artists and art students — part of the collective Kalakakshi — along with activists of groups like Biennale Supporters’ Forum and People Against Fascism took out a unique protest demonstration to the City Police Commissioner’s office on Friday.\n\nWhile the event, Post Carnival, sought to decry the alleged police assault on artists who had made the Cochin Carnival Pappanji in the early hours of January 1, its canvas stretched beyond the immediate issue at hand, maintained the artists.\n\n“It’s not just about one incident of moral policing. Our aim is to evolve a cultural means of protest that’s consistent with the emerging socio-cultural narratives against dominant orthodox narratives,” said Lasar Shine, as artists sculpted, painted and performed in protest at the Vanchi Square on the tri-junction near the High Court.\n\nArtist Chithra E.G. hid her face under thick cakes of clay and made masks at Vanchi Square in a performance, as inquisitive walkers stopped by. In another performance, Anupama Elias had her body covered with texts suggesting emotions and living beings, but her efforts to cull out ‘love’ was masked by P.S. Jalaja, who wrapped Anupama in a plastic sheet, leaving just the nose out for her to breathe.\n\nCampaign mascot\n\nArtists Anil Xavier, Manu C.A., and Arun Poulose, who had been hospitalised following the alleged attack, were joined by Jasinther Rockfeller in carving sculptures of Lisa Herzeline Raphael, the artist who had allegedly been verbally abused by the police on New Year. “We portrayed her as the icon, the mascot, of the campaign against moral policing,” said artist Jalaja.\n\nDrawing inspiration from master painter Edward Munch’s iconic work, The Scream, they sculpted Lisa even as her portraiture in pastel was done by painters, including Jalaja.\n\nA while later, Lisa, Anil, Arun, Jasinther, Manu and Vipin Dhanurdharan trapped themselves in an iron cage as some 150 artists and supporters took out a procession to the Commissioner’s office. As the police stopped them on the way, they came out, cutting open the iron bars of the cage.", 
    "section": "national", 
    "title": "Kerala artists say ‘no’ to moral policing, resort to unique protest", 
    "subsection": "general", 
    "date": "2016-01-09"
}