{
    "author": [
        "Swathi V"
    ], 
    "text": "Forest rights of Scheduled Tribes and other forest dwelling communities have come into sharp focus in connection with Mission Bhageeratha, the drinking water project of Telangana State, which requires the alienation of vast tracts of forest lands.\n\nExercise is on to identify locations where the pipelines would cut across lands on which the rights of the tribals and forest dwellers have been recognised as per the Scheduled Tribes and Other Forest Dwellers (Recognition of Forest Rights) Act.\n\nOnce the locations are identified, it is upon the respective district authorities to conduct ‘gram sabha’ and obtain consent from the villagers for acquiring land.\n\nThe process could be finished in 15 days with coordination among various departments, or take longer than three months in the event of lack of coordination, officials from the Panchayat Raj department said.\n\nDiversion of forest lands\n\nAs per the Act, the authority to divert forest lands for public purposes, which include drinking water supply and water pipelines, is vested with the Central government.\n\nHowever, such diversion is subject to the rider that the land in question is less than one hectare in each instance and the ‘gram sabha’ recommends it.\n\nOf the 26 segments the project is divided into, 21 need forest clearances. They have been further divided into 96 sub-segments for the purpose of convenience, and proposals are being prepared for the same, officials informed.\n\n“District collectors, as chairpersons of the district level committees for recognition of forest rights, have to issue certificates that the requirements under the Act have been fulfilled.\n\nIf tribal lands are involved, alternative land or compensation will be offered,” Principal Chief Conservator of Forests P.K. Sharma said.\n\nAdilabad and Khammam are two districts where the project might come into conflict with forest rights, as they have large number of tribal inhabitants.\n\n1700 hectares needed\n\nOver 1700 hectares of forest land are required for the project, informed the Engineer-in-Chief (Rural Water Supply and Sanitation) B. Surender Reddy.\n\nThe drinking water project might put Khammam, Adilabad in conflict with forest rights", 
    "section": "national", 
    "title": "Mission Bhageeratha brings Telangana forest lands in focus", 
    "subsection": "general", 
    "date": "2016-01-09"
}