{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Officials in New Delhi refused to comment on the Pakistan Prime Minister’s second meeting with senior officials including the Pakistan Army Chief Raheel Sharif.\n\n“We await action on the ground,” said a senior official when asked if the meetings were significant.\n\nOthers conceded that the Pakistani statements of condemnation, and the promise to act on the leads constitute a positive step. “If Pakistan had merely denied any knowledge of the attack, that would have been a setback,” a government official told The Hindu .\n\nOfficials also said there was no further decision on the future of India-Pakistan engagement, beginning with foreign secretary level talks next week.\n\nAziz on talks\n\nThe statement was at odds with the Pakistani position; on Friday in Islamabad, Foreign Affairs Advisor Sartaj Aziz told the National Assembly that the talks would go ahead as scheduled, adding that “all issues including [Jammu and Kashmir]” would be discussed.\n\nMr. Sharif, on Friday, met National Security Adviser Lt. Gen. Nasser Khan Janjua, who has been in contact with NSA Ajit Doval, the Army Chief, Director General of the ISI, Gen. Rizwan Akhtar among others.\n\nAccording to Mr. Sharif’s spokesperson, the officials “reiterated Pakistan’s commitment to cooperate with India to completely eradicate the menace of terrorism afflicting our region.”\n\nPakistani sources said the Prime Minister had instructed IB chief Aftab Sultan to expedite the enquiry, and told Gen. Janjua to “continue his contacts” with NSA Doval.\n\nThe meeting, held in Islamabad, “reviewed the progress made on the information provided by the Government of India. It was decided to remain in touch with the Government of India in this regard.”", 
    "section": "national", 
    "title": "No change in stance on NSA talks", 
    "subsection": "general", 
    "date": "2016-01-09"
}