{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It is difficult to do business as people don’t work even after taking bribes: Kejriwal\n\nDelhi Chief Minister Arvind Kejriwal on Friday said the success of the ‘odd-even’ vehicle programme had proven that the Aam Aadmi Party could also govern and deliver.\n\n“People said they [the AAP] do not know governance, that they only know about dharnas [sit-in protests] ... but the success has shown that we can deliver, govern and do dharnas if need be,” Mr. Kejriwal said at the Global Business Summit here.\n\nSharing the stage with Union Finance Minister Arun Jaitley, West Bengal Chief Minister Mamata Banerjee, her Cabinet colleague Amit Mitra, the Prime Minister of Bhutan, a U.K. Minister and other dignitaries, Mr. Kejriwal said it was difficult to do business in India as people often did not work even after accepting bribes.\n\nCommenting on the complicated system in Delhi, he said his government found it totally unacceptable that anyone should seek a CM’s intervention to secure admission to a nursery school.\n\n“We have taken a host of measures to simplify the [admission] system,” he said, asking the gathering of industrialists to invest in setting-up schools and hospitals. “We want a situation of excess capacity in schools and hospitals in three years,” Mr. Kejriwal urged.\n\nOn the odd-even scheme introduced in Delhi, he said it had invited a lot of scepticism and criticism but had proved that people abide by rules if there was a system in place. “... If there is good leadership ... people are our assets ... Our biggest learning was from odd-even,” he said.\n\nThe Kolkata connect\n\nMr. Kejriwal, whose equation with Ms. Banerjee is well known, said he had a Kolkata connect, having studied at IIT Kharagpur and worked in the city for three months at the Kalighat Ashram of Mother Teresa, but nothing had prepared him for what he saw here this time. “Kolkata has changed so much ...”, he said.\n\nThere were announcements galore at the summit, including one on Singur, where a Japanese company will set up a solar-powered, temperature-controlled warehouse.\n\nInvestments, some ongoing and some in the pipeline, were also highlighted by Reliance Industries Chairman Mukesh Ambani.\n\nThe government will work as your employee, Ms. Banerjee told the gathering.\n\n“Please have faith in us ... election is coming ... this government will come up,” she said, adding that any one facing a problem in setting up an industry should approach her. “I will solve it in a second ... you are the employer ... I am your employee,” she told the gathering.", 
    "section": "national", 
    "title": "‘Scheme proves AAP can govern’", 
    "subsection": "general", 
    "date": "2016-01-09"
}