{
    "author": [
        "C Maya"
    ], 
    "text": ": The Revised National Tuberculosis Control Programme (RNTCP) is grinding to a halt in Kerala because of acute funds shortage, with the government failing to transfer from the State treasury even a single instalment of the Central funds allotted to the RNTCP (unique sanction) for 2015-16.\n\nAll field activities and training programmes have long since stopped with no salaries or fuel expenses paid to the contractual staff engaged by the RNTCP for field activities.\n\nOfficials now fear that even the basic sputum microscopy test for diagnosing TB may come to a standstill in districts as laboratory consumables have been almost exhausted and no more supplies can be procured.\n\nThe RNTCP, like many other health programmes, has been facing funds crunch for the past two years but never before has the crisis been so acute – that too at a time when the State is preparing to move into universal culture and drug-sensitivity tests for all TB diagnosis.\n\nThe RNTCP, at the national level, is making the crucial policy shift from the intermittent drug regimen to the daily drug regimen in April and Kerala is the only State where this policy shift will be implemented in all districts.\n\nWith the current financial year drawing to a close, RNTCP officials fear that it will be difficult to get the programme back on track even if they manage to get the funds released immediately.\n\n‘Saving grace’\n\n“The only saving grace is that we do not have a shortage of drugs as TB drugs are Centrally procured and distributed. But some patients may need additional drugs, which we are unable to supply. We are also unable to reimburse patients for lab tests (thyroid function). No field-level activities have been happening because we have no money to pay either the salaries or field expenses of the 300-odd contractual staff under the RNTCP, many of whom now do odd jobs to make a living,” an official said.\n\nAll field activities have stopped as the State faces\n\nan acute shortage\n\nof funds", 
    "section": "national", 
    "title": "TB control scheme in Kerala gasps for life", 
    "subsection": "general", 
    "date": "2016-01-09"
}