{
    "author": [], 
    "text": "The tagline “white makes you a winner” raised a storm on social networking websites\n\nA Thai company pulled out an advert for skin lightening pills on Friday, following outcry on social media over a product sold with the tagline “white makes you a winner”.\n\nIt is the latest marketing gaffe to draw accusations of racism in a kingdom obsessed with skin colour.\n\nThe advertisement for Seoul Secret’s ‘snowz’ supplement pills featured a veteran Thai celebrity attributing her professional success to her pale complexion.\n\n“It’s not easy to stay at this point for a long time,” the 35-year-old Thai model and actress, Cris Horwang, says in the video.\n\n“If I stopped taking care of my body and white complexion, all that I have invested will be gone.”\n\nThe model is then shown in black make-up, casting an envious look at a second woman with light skin, who appears by her side.\n\n“A newcomer will replace me and turn me into a dark star,” she says in the video, using a Thai idiom to refer to her fame fading.\n\nStandard of beauty\n\nWhitening creams and pills are wildly popular in Thailand, where pale skin is upheld as the standard of beauty in the media and among Thais, who comment freely on the complexion of others.\n\nAdvertisements for the products are standard fare on billboards and TV spots, but some companies have faced a backlash in recent years for going too far.\n\nBefore its removal on Friday, the Seoul Secret video received more than 100,000 views on YouTube, as well as enquiries on the company’s Facebook page regarding how to order the product.\n\n‘Clearly racist’\n\nBut other social media sites drew posts railing against the advert for being racially offensive and reinforcing the country’s narrow beauty ideals.\n\n“It indicates that dark skin people are losers, and this is clearly racist,” a Thai commentator named Tammaijang wrote on the web forum Pantip. Another post said: “Having dark skin can be beautiful — without being ashamed as well.”\n\nThere was also speculation that the advertisement was intentionally provocative as part of a marketing ploy to grab attention.\n\nCalculated strategy?\n\n“I don't think the ad agency made this ad out of ignorance,” a prominent Thai culture blogger, called Kaewmala on her thaiwomantalks.com website, told AFP.\n\n“They haven’t been living on the moon, I’m certain they knew it would be controversial... It was most likely a calculated strategy, which in my view makes it even more objectionable.”\n\nWhile there has been a growing awareness about racism among Thais in recent years, those views have yet to be reflected in a media, which still readily equates dark skin with “low class”, she added.\n\nSeoul Secret has yet to issue a public statement on its decision to remove the video. — AFP", 
    "section": "national", 
    "title": "Thai skin-whitening ad provokes race storm", 
    "subsection": "general", 
    "date": "2016-01-09"
}