{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "Complaints of leakage and corruption in NPCL road project at Palghar\n\nThe Warli and Koli tribes are fully dependent on the forest produce and are trying to save the forest from human greed.— Photo: Arunangsu Roy Chowdhury\n\nEven as the Maharashtra government strives to align corporate funds with its development activities, the Maharashtra Lokayukta has been receiving a steady stream of complaints from tribal pockets around Mumbai alleging diversion of Corporate Social Responsibility (CSR) funds.\n\nFollowing complaints of leakages and corruption at the village and taluka level, especially in tribal gram sabhas and gram panchayats on the city’s periphery, the Lokayukta this week issued orders for FIRs to be filed against officials and gram sabha and panchayat heads for diverting and siphoning off CSR funds meant for development work in Thane and Palghar districts.\n\nComing under the scanner are gram sevaks, engineers and sarpanch of the Akarpatti gram panchayat in Palghar after a Lokayukta investigation established that Rs. 58 lakh of CSR funds meant for road works in villages was siphoned off. The CSR initiative in Palghar was being undertaken by the Nuclear Power Corporation Limited for construction of roads in the remote regions of Dahanu taluka.\n\n“Massive irregularities were found in road works carried out by Meghana Enterprises. While much of the road work was never done, Rs 21.78 lakh was pocketed by the gram sevaks and sarpanch with the help of the engineers. We have ordered an FIR after hearing all sides. There is very little monitoring of CSR funds in the village areas, and the system must be improved by various auditing mechanisms,” a Lokayukta official said.\n\nActivists working in the region say in the absence of sustained funding from the government for local works, CSR activities are a much-needed relief to complete smaller projects.\n\nHowever, they are not monitored efficiently by the district authorities. “In Thane and Palghar districts, development is continuous, carried out with the help of local people and non-profit organisations working with CSR funds in the area. There is little or no monitoring of how these funds are spent,” said forest rights activist Milind Thatte.", 
    "section": "national", 
    "title": "Tribal pockets around Mumbai report diversion of CSR funds", 
    "subsection": "general", 
    "date": "2016-01-09"
}