{
    "author": [
        "S Sundar"
    ], 
    "text": "Minister Sellur K Raju had sought caste details of voters in Madurai\n\nAmid complaints against the ruling party of seeking personal details of voters in the city, Madurai District Collector K. Veera Raghava Rao has said that any appeal to voters on caste or religious basis is a violation of model code of conduct.\n\nHe was responding to a specific question on the complaint lodged by the Dravida Munnetra Kazhagam on Tuesday that the ruling party members were seeking personal details of the voters under the Madurai West Assembly constituency.\n\nMinister for Cooperation and party urban district secretary, K. Raju, while addressing a meeting here on Sunday asked the booth-level campaigners of the All India Anna Dravida Munnetra Kazhagam to get the caste particulars of the voters along with other details like educational qualification, occupation and their mobile numbers.\n\n“There cannot be any appeal on caste or communal lines ... it is a violation of model code of conduct,” Mr. Rao said.\n\nEC warns action\n\nThe Election Commission in a communication to all Chief Electoral Officers in the country had said that “if there is some evidence found that caste is being used for political/electoral purposes, then action may be taken under suitable provisions of law/model code of conduct”.\n\nHowever, when asked about the ruling party asking for personal details like phone numbers, he said the purpose of asking such details needed to be probed to find out whether such actions violated any aspects of model code of conduct.\n\nTo an allegation that bank account details were being sought by the ruling party, Mr. Rao said that all bank transactions were being monitored.\n\n“Any suspicious transactions or transaction from one particular account to multiple accounts would be thoroughly probed into,” he said.\n\nEarlier, the DMK leaders, G. Thalapathi and V. Veluchamy, complained that AIADMK cadres were collecting bank account details to deposit money to voters.\n\nThey also complained that a form seeking the details of benefits the voters had got under various welfare schemes under the AIADMK rule was being collected by the ruling party’s cadre.", 
    "section": "national", 
    "title": "'Appealing to voters on caste, religious basis a violation'", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}