{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise from left) Liaqhat Ali, secretary, The Anjuman Nusrathul Islam Public Library and Free Reading Hall at Kottakuppam near Puducherry; a board at the library and a view of the library.Photos: T. Singaravelou\n\nDiverse collection of journals and books at 90-year-old facility\n\nLittle can we imagine that a low-ceiling three-floored building on Mosque Street in Kottakuppam in Puducherry could treasure the vibrant secular history of freedom struggle, Dravidian movement in Tamil Nadu and live to witness the present with promises of a rich future.\n\nBeginning as a reading room influenced by the Dravidian Movement’s initiatives to educate the middle castes and downtrodden in 1926, The Anjuman Nusrathul Islam Public Library and Free Reading Hall now houses more than 20,000 books, journals and newspaper collection.\n\nPrimarily known as an Islamic library, it has a diverse collection of journals and books, including popular Tamil literary journals like Manikkodi, Ananda Bodhini, Ananda Vikatan, Dinamani Kadhir, Manjari, Jaganmohini (established in 1923 and inaugurated by C.Rajagopalachari), UNESCO Courier .\n\n“This reading hall in 1928 had even subscribed to St.George’s Gazette, newspaper Swadesamitiran and magazine Sutanthiram (Independence). Unfortunately, Swadesamitiran magazine fell prey to termites when the library was in a dilapidated state,” said library secretary Liaqhat Ali.\n\nThe nature of this collection reveals the open-mindedness and secular nature of the founding members of this library. These collections form a gateway for us to understand the reading practices of a village community in those times.\n\nThe person who took the initiative was Quazi Abdul Hamid Hafiz Baqavi, a businessman. He, along with the intellectual class from Muslim community, opened the reading room. The reading room was started with six objectives: Educational improvement, cultural advancement, advancement of civilization, social reform, hygienic propaganda and help to the poor.\n\nThe library houses rare journals which are not available anywhere else. The entire collection of Tamil Muslim magazines like Dar-ul-Islam from 1926 to 1942, Hifazatul Islam and Muslim Murasu are available only there. Even the first issue of Ananda Vikatan i s available. They also have an old collection of novels in Urdu and Parsi. They have given books in Arwi, Tamil works written in Arabic script or Arabic Tamil, to an Arabic School in the neighbourhood.\n\nEntering its 90th year, this library houses old novels, history books including Muslim World History, journals, newspapers, popular magazines, journals published by the Left, books on Islam literature that are now out of print, comparative religious texts Quran and Quranic literature, ‘Hadees’, sayings of Prophet Mohammed, The Bible, Ramayana, Bhagavad Gita.\n\nThese rare collections have attracted scholars from universities in Europe and United States of America over the years. “Unfortunately, no one from the Pondicherry Central University is conducting any research on the treasure of journals, newspapers or books available in this library,” says Mr.Ali.\n\nOne of the oldest libraries, The Anjuman Nusrathul Islam Public Library, lost many old collections during a fire accident in 1949. “We also lost some due to the dilapidated condition of the library in 2004,” he said.\n\nLater, the library was renovated and restored. “Now, at least 20 to 25 readers visit everyday. We are planning to catalogue all the books and computerise. We have started the work and the local youth are being involved in this effort. This will take some time,” said Mr.Ali. The journal section is still alive with the latest English and Tamil journals.\n\nThe 150-member governing body of the library will also take up the work of digitising the books. They are now seeking help to organize resources to digitise the old books.\n\nApart from computerising, they are catering to the competitive world. The library plans to set up a study room for poor students to prepare for competitive exams.", 
    "section": "national", 
    "title": "A treasure trove of a library", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}