{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Advocates practising in the Madras High Court Bench here are elated over the State government’s decision to accede to the court’s request to introduce e-stamps for payment of court fee by amending the Tamil Nadu Court Fees and Suits Valuation Act, 1955.\n\nS. Srinivasa Raghavan, vice-president, Madurai Bench of Madras High Court Bar Association (MMBA), welcomed the move with a rider that the new system should not be made cumbersome and online payment of court fees should be provided round the clock at the click of a button.\n\nReferring to the notification of the Tamil Nadu Court Fees and Suits Valuation (Amendment) Bill, 2016 in the government gazette on February 18, he said that the Bill only provided for amending Sections 74 and 75 of the Act and providing e-stamps also as an acceptable mode of payment of court fees.\n\n“However, the modalities of implementing the new system are yet to be made public. It would be beneficial to the Bar only if advocates and litigants are provided with the convenience of paying the fee online, taking a printout of the challan and attaching it as a proof of payment while filing cases,” he added.\n\nMr. Raghavan also stressed that e-stamps would turn out to be successful only if simple and clear-cut procedures were laid down for returning the court fees to litigants whenever a case got settled through Alternate Dispute Resolution systems such as Lok Adalat.\n\nAdvocate K.P.S. Palanivelrajan said that introduction of e-stamps would put an end to difficulties faced by advocates in procuring court fee stamps whenever there was a sudden shortage of such stamps with the authorised vendors in the High Court as well as the District Court.\n\n“It will also keep a full stop to complaints of sale of counterfeit stamps, reuse of same stamps in multiple cases and loss or damage of stamps. Those who do not have Internet Banking Accounts need not worry too since e-stamps were being introduced only in addition to the existing system of affixing paper stamps,” he said.", 
    "section": "national", 
    "title": "Advocates welcome move to introduce e-stamps for paying court fee", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}