{
    "author": [
        "S Poorvaja"
    ], 
    "text": "With even class IX students joining coaching classes, schools are adapting their syllabus\n\nor H. Aishwarya, the coming academic year is going to be a challenging one, as she has to juggle her Class XI lessons and IIT-JEE coaching classes.\n\n“I have enrolled in an intensive weekend IIT-JEE coaching programme. It will be a bit tough at the start to manage both my regular school classes and the coaching sessions, but I am preparing for the challenge,” she said.\n\nIn terms of facing the pressure of cracking the IIT-JEE, Aishwarya is better off than most other students who are taking a shot at it.\n\nFor, preparations for the IIT-JEE begin really early now — as early as Class IX for some students.\n\nAn increasing number of schools have programmes from Class IX that enable students to start preparing for IIT-JEE.\n\nTo make these programmes less stressful, schools integrate them into the regular syllabus as much as possible.\n\nRise in number of students\n\n“The number of students who are opting for the integrated coaching programme, where they begin to train from Class IX, as well as other programmes has significantly risen in Tamil Nadu, as have the number of students who manage to crack the JEE successfully over the years,” a representative of FIIT JEE, a coaching institute, said.\n\nHe further pointed out that Chennai, alone with cities such as Kota, Jaipur, Mumbai and Hyderabad have a rising number of IIT aspirants every year.\n\n“My daughter had to shift to a new school after class IX to take up coaching classes early on. The competition is getting tougher every year and if an early start is going to give her an edge, why not?” said a parent.\n\nSeats filled up\n\nS. Namasivayam, Senior Principal of Maharishi Vidya Mandir, said the school had already filled up the 200 seats allotted in class IX for the integrated IIT coaching programme.\n\n“Even if not for the JEE, we believe that the children are equipped to handle entrance examinations across a number of competitive examinations for both universities in India and abroad,” Mr. Namasivayam noted.\n\nF", 
    "section": "national", 
    "title": "An early start to the IIT dream", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}