{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The purpose of reservation was being undermined as even the communities doing well as per socio-economic parameters were demanding reservation just because they could arm-twist governments, said Yagati Chinna Rao, Chairperson of Centre for the Study of Discrimination and Exclusion at Jawaharlal Nehru University.\n\nHe made the observation here on Thursday while referring to the recent protests by Jats in Haryana, Patidars in Gujarat and Kapus in Andhra Pradesh during a seminar on ‘Form and content of castes and communities of South India: past and present’ at Madurai Kamaraj University.\n\nHe said that some of these communities had high representation in government jobs, disproportionate to their population percentage. “They are also predominantly powerful in social and economic aspects. For instance, the Patidars control the diamond trade in Gujarat,” he said.\n\nExpressing dissatisfaction over the governments bowing to such demands by these communities, Mr. Rao said, “Things have come to a pass that if a community is dominant and powerful enough, it can demand reservation.” He expressed concern over the recent honour killing of Dalit youth V. Sankar (22) at Udumalpet. “Till now, only Haryana was notorious for honour killings. It is sad that the phenomenon is on the rise in a progressive State like Tamil Nadu,” he said.\n\nEarlier, in a sarcastic remark on the ongoing issue over sedition cases against JNU students, Mr. Rao began his speech by saying that he came from the land of ‘anti-nationals.’\n\nLater, in his lecture, he explained how even Dalit movements were called ‘anti-nationals’ during the freedom struggle as their stand differed on many occasions from the mainstream freedom movement.\n\nScholars from various universities and colleges are presenting their papers at the two-day Indian Council of Social Science Research-sponsored national seminar organised by the School of Historical Studies at the MKU which began on Thursday.", 
    "section": "national", 
    "title": "“Arm-twisting defeats purpose of reservation”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}