{
    "author": [
        "K Lakshmi"
    ], 
    "text": "The Android application is yet to gain popularity in city\n\nNow, consumers have another way to register their complaints with the Bureau of Indian Standards (BIS) — BIS Care, a mobile application.\n\nThough introduced a few months ago, the Android-based application is yet to gain popularity among city residents. The app has been developed exclusively for people to lodge their grievances on quality of products and services, misleading advertisements and misuse of the ISI mark. The application also provides a facility to view the complaint history and track the status of complaints to those who have registered with the system.\n\nAt present, BIS-Southern Region, gets most complaints through phone, online and e-mail. Officials of the BIS said: “We mostly get two types of complaints — on the quality of BIS-certified goods and misuse of the ISI mark. We check on the genuineness of the complaint and draw samples for testing. The redressal period of the complaint varies between one month and three months, depending on the nature of the complaint.”\n\nBesides complaints on misuse of the ISI mark on packaged drinking water, BIS also receives complaints on substandard quality of solar water heaters, pressure cookers and tyres. “We deal with a minimum of 10 complaints on various products and services,” said an official. If deficiency in the product is proven, steps are taken to replace or repair the product and action will be initiated to ensure that licensees do not repeat such failures.\n\nA team of officials often conducts raids in connection with complaints on the misuse of ISI mark and also following a market survey. This year, 45 raids have been conducted on packaged drinking water units and manufacturing units of steel bars and PVC pipes in connection with misuse of the ISI mark.", 
    "section": "national", 
    "title": "BIS has an app for complaint registration", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}