{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Centre for Women’s Studies Pondicherry University looks to expanding existing programmes as well as introducing new courses.\n\nAddressing International Women’s Day Celebrations 2016, R. Nalini, Head (i/c) Centre for Women’s Studies, laid out plans to make the Centre a larger and more vibrant one.\n\nIn a welcome departure from convention, dignitaries were honoured by children from Satya Special School, Puducherry.\n\nIn his felicitation address, S. Suresh Kumar, Finance Officer, stressed the fact ultimately the real celebration of the women’s cause would be the day when the Women’s Reservation Bill is passed by Parliament.\n\nR. Samyuktha, University Librarian, called for both men and women to come forward to share joys and sorrows of the opposite gender.\n\nThe Controller of Examinations, K Tharanikarassu advocated that women should go to the public sphere in large numbers while Prof. N.K. Jha, Dean, School of Social Sciences and International Studies, talked about two approaches regarding issues faced by women.\n\nGuest of Honour Madame De Blic, founder of NGO Volontariat based in Puducherry, was honoured by Vice-Chancellor-in-charge Anisa Basheer Khan.\n\nIn her acceptance speech, Madame De Blic stressed on providing education to all children and also on the two qualities of respect and perseverance.\n\nThe Chief Guest Chitra Shah, Director, Sathya Special School shared her experiences of the journey towards establishing a school for children with special needs.\n\nHer speech was followed by a dance programme by the special children from Sathya Special School.\n\nProf. Anisa Basheer Khan, in her presidential address, stated that a 100 per cent change in mindset was required for gender equality and women should come out from the shell of submissiveness and men from that of dominance.\n\nAashita, Assistant Professor, Centre for Women’s Studies, also participated.\n\nDignitaries were honoured by children from Satya Special School at a programme", 
    "section": "national", 
    "title": "Centre for Women’s Studies considering new courses", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}