{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Confederation of Indian Industry will be launching an exclusive website for non-members within a month for fostering entrepreneurship, through its SME Finance Facilitation Centre.\n\nHaving forwarded loans to the tune of Rs. 650 crore to 120 SME units in manufacturing, IT, ITES and other areas since the launch of the SME Finance Facilitation Centre during June 2014, the CII was now into the process of tying up with other industry organisations to expand the reach of its entrepreneurship promotion initiative, Amit Kumar Tripathi, Deputy Director, CII, said on Wednesday.\n\nMr. Tripathi who addressed a session on ‘MSME Financing - Empowering SMEs through addressing their financial needs’, said that the benefit of its tie-up with 17 banks and non-banking financing companies would be extended to the Southern States.\n\nLast year, the CII conducted similar programmes at Madurai, Mysuru, Coimbatore and Vizag, thereby reaching out to 3,000 SMEs. This year, the session began at Tirupur, and after Erode, the CII will hold the events at Karur, Tiruchi and Tuticorin.\n\nThere were 150 participants at the meet in Tirupur and 100 at Erode.\n\nThe top-down approach of applicants was working well. The money sanction is made within 15 days, Mr. Tripathi said.\n\nThere are four steps: furnishing of finance requirements with basic details throughwww.mycii.in, validation and auto-forwarding of application with required details to the banking partners, expression of interest by the banks, and linking of the applicant with the bank’s branch.\n\nIn the near future, the CII will introduce credit rating for SMEs in association with CRISIL and insurance services, which was thought of after the losses caused to industrial activities due to natural calamities in the recent past. Five to six insurance companies have come forward to partner with CII, he said.\n\nEarlier, Mr. Tripathi, CII Erode Zone Chairman C. Devarajan, Vice-Chairman M. Chinnasami, and president of Erode District Small Industries Association R. Balasubramaniam unveiled the brochure of CII Finance Facilitation Centre.\n\nSessions on SME Financing that followed were addressed by senior officials of Indian Bank, Muthoot Fincorp, Lakshmi Vilas Bank, DHFL, SIDBI, IOB, UBI, and CRISIL SME Ratings.\n\nCII to introduce credit rating for SMEs in association with CRISIL and insurance firms", 
    "section": "national", 
    "title": "CII to launch exclusive website for non-members", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}