{
    "author": [], 
    "text": "Noting that the menace of defacement and illegal hoardings has permeated in the State, and considering the pendency of a Public Interest Litigation (PIL) petition on the issue for over 10 years now, the Madras High Court, on Thursday, directed that the restrictions imposed by the Election Commission on hoardings in view of the impending assembly elections shall continue even after the elections, till further orders from the court.\n\nThe First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh passed the order on a PIL moved by advocate ‘Elephant’ K. Rajendran seeking action against defacement of public properties.\n\nWhen the PIL came up for hearing, the Additional Advocate General submitted a Government Order dated February 26 constituting a committee of five members headed by the Secretary, Home, Prohibition, and Excise Department for monitoring the progress of removal of defacement of open places.\n\nReferring to its earlier orders, the Bench said, “What was contemplated was a committee presided over by a retired judge of this court, but the government in its wisdom, has considered it appropriate to appoint a committee of secretaries and other officers. We leave this issue to the wisdom of the government, but would like to see the performance of the committee at the ground level.”\n\nAdding that various directions passed by the court on the issue were not implemented successfully giving rise to number of contempt proceedings from time to time, the judges said, “We feel this is the appropriate time to properly regulate this issue and courts are facilitated by the fact that in view of impending elections, in pursuance to the directions of the Election Commission, all such hoardings have been removed. We would like this position to continue even beyond the elections till we determine how the government proposes to regulate this area of concern.”\n\nThe Bench then directed that the hoardings and banners and all such materials will not be displayed for the time being till the court considers this aspect in greater depth and the position prevalent in view of the impending elections should continue till the court takes a decision on this issue. The court made the head of the departments concerned to be personally responsible for such enforcement.\n\nThe judges further restrained seven political parties impleaded recently, including the AIADMK and the DMK from defacing or erecting hoardings and posted the PIL for compliance on June 13.", 
    "section": "national", 
    "title": "Continue curbs on hoardings even after elections: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}