{
    "author": [
        "Staff Reporter"
    ], 
    "text": "SPREADING MESSAGE:Collector T.N. Hariharan distributing pamphlets to autorickshaw drivers in Dindigul on Thursday to spread awareness of the importance of voting.— PHOTO: G. Karthikeyan\n\nCriminal action would be initiated against those distributing gifts in the form of cash or kind to people with an aim of inducing them to vote in favour of a particular candidate or party, said Collector T.N. Hariharan here on Thursday.\n\nAddressing a meeting of flying squad members, he said that criminal action could be initiated against such persons under Section 171 B of the Indian Penal Code. Offering, agreeing to give and attempting to procure gifts were also punishable crimes.\n\nThose indulging in such activities could be punished with one-year imprisonment and/or imposed a fine, he said.\n\nMr. Hariharan said that the flying squad officials should alert the standing supervisory committee on distribution of cash, gifts, liquor and free food, intimidation of voters, movement of weapons, explosive materials and antisocials for immediate action.\n\nToll-free number\n\nIf the public had any knowledge of such activities, they could contact the election control room through toll-free number 1800 425 7026, he added.\n\nCampaign\n\nThe district election officials had also roped in autorickshaw drivers to intensify the campaign on the importance of voting and the democratic rights of the voters.\n\nBanners carrying slogans about voting rights were stuck on the backside of autos and pamphlets were given to auto drivers to be distributed to passengers.\n\n“Our aim is to achieve cent per cent polling in the forthcoming Assembly election,” said the Collector after kick-starting the election campaign organised by regional transport officials here in the morning.", 
    "section": "national", 
    "title": "“Criminal action against people distributing gifts, money to voters”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}