{
    "author": [
        "Staff Reporter"
    ], 
    "text": "It will be used in Madurai East constituency alone in the district\n\nCollector K. Veera Raghava Rao, right, at the demonstration of Voter-Verified Paper Audit Trail (VVPAT) machine, held for representatives of political parties, at the Madurai Corporation office on Thursday.— Photo: S. James\n\nDemonstration of Voter-Verified Paper Audit Trail (VVPAT) machines was held for representatives of political parties on the Madurai Corporation office premises on Thursday in the presence of Collector and Election Officer K. Veera Raghava Rao.\n\nVVPAT machines are being used for the first time in Tamil Nadu in select constituencies for the May 16 Assembly elections.\n\nIn Madurai district, VVPAT will be used in Madurai East constituency alone. The machines will be attached to the ballot unit of the Electronic Voting Machines. Soon after a voter presses the button in the ballot unit for the desired candidate, the serial number of the candidate in the ballot unit along with the candidate’s symbol will be printed on the paper roll kept inside VVPAT machine.\n\nThe printed part of paper will be visible to the voter for seven seconds on a small display in the machine, following which the printed slip will get cut and stored inside the sealed compartment in the bottom of the machine. In case of a conflict during counting, the paper slips will be used to cross-check with the votes recorded in the EVMs. Each VVPAT machine will have the capacity to handle 2,000 votes, officials said.\n\nMr. Rao said that 20 percent of the required number of VVPAT machines would be kept ready as a buffer.\n\nMadurai East constituency, with 302 polling booths, is the largest in the district in terms of number of voters. There are 2,86,211 voters in the constituency as per the electoral roll released on January 2.", 
    "section": "national", 
    "title": "Demonstration held on use of VVPAT machine", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}