{
    "author": [], 
    "text": "TIRUNELVELI\n\nDepartment of Commerce – Manonmaniam Sundaranar University: Seminar on ‘Corporate governance and Corporate Social Responsibility’, K. Baskar, Vice-Chancellor, MSU, inaugurates, A. Mohan Kumar, Allsec, Chennai and P. Rajavel, chairman, Madurai Chapter of Institute of Company Secretaries of India, speak, Senate Hall, MSU premises, 10 a.m.\n\nSt. Xavier’s College of Education: Conference on ‘Producing employable teachers: Prospects, challenges and strategies’, K. Alex, Associate Professor, Department of Commerce, St. Joseph’s College, Tiruchi, inaugurates, Mother Teresa Hall, college premises, Palayamkottai, 9.45 a.m.\n\nAlcoholics Anonymous and Al-Anon: Regular meeting, MDT Hindu College Higher Secondary School, Tirunelveli Junction, 7 p.m.\n\nALWARKURICHI\n\nSri Paramakalyani Centre for Environmental Sciences: Career-oriented seminar on ‘Advances in environmental sciences’, A.G. Murugesan, Head, SPKCES, presides, K. Rajesh Bhanu, Head, Department of Environmental Engineering, Anna University, Tirunelveli Regional Centre, speaks, SPKCES premises, 10 a.m.\n\nKOVILPATTI\n\nNational Engineering College, Department of Science and Humanities: State-level technical symposium – CHENMAPH –’16,” V. Manikanda Raman, Expert Architect, Hewlett Packard, Bengaluru, chief guest, K.R. Arunachalam, Member, Managing Committee, presides, college auditorium, 9.30 a.m.\n\nKUMARACOIL\n\nNoorul Islam University: Dr. D. Shalini Punithavathani, Principal, Government Engineering College, Tirunelveli, inaugurates IEEE International Conference on Circuit, Power and Computer Technologies “ICCPCT-2016,” Dr. Shaiful J. Hashim, Associate Professor, Department of Computer and Communication Systems, University Putra, Malaysia, chief guest and Chancellor A.P. Majeed Khan, participates, 9.35 a.m.\n\nNAGERCOIL\n\nScott Christian College: One-day national colloquium on “Challenges of Emerging Social Order: An Indian Perspective,” organised by the RD Foundation Centre for Research in Economics and Social Development (CRESD), 10 a.m.", 
    "section": "national", 
    "title": "enGaGEMENTS", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}