{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Batting for social justice in the appointment of judges to High Courts and Supreme Court, Justice D. Hariparanthaman in his farewell speech on Wednesday bemoaned that “feudal mindset” was still prevailing in the higher judiciary.\n\nJustice Mr. Hariparanthaman who retired on Wednesday after seven years as a judge of the Madras High Court, said he insisted the subordinate judges and the High Court officials who came to visit him to sit, after personally witnessing that they never sit before a High Court judge. “Feudal mindset exists in all top positions,” he said.\n\nNoting that social justice can be adopted in judges appointment only when due representation is given to scheduled communities, backward communities, minorities and women in the collegium, the judge said, “Senior judges from all these communities must be a part of the collegium. I would like to record that until then full implementation of social justice in judges’ appointment cannot be achieved.”\n\nExpressing concern that he was retiring at a time when over 40 advocates had been suspended by the Bar Council, Justice Mr. Hariparanthaman said, “I assumed office when the wounds of February 19, 2009 attack on advocates were still intact and now I demit office when over 40 advocates were suspended. Unfortunately, at both the moments the advocate community was in difficult times.”\n\nReferring to the recent Patiala court violence in Delhi, the judge said the Bar Council of India Chairman was quoted as having said that action against those lawyers would be taken depending upon the outcome of inquiry and probe by authorities. But the Tamil Nadu lawyers are facing suspension for a long period without any inquiry, he said and requested immediate withdrawal of their suspension.\n\nEmphasising that freedom of expression was an integral part of democracy, which cannot be severed away from it, Justice Mr. Hariparanthaman said, “To ensure total freedom of expression as provided in western countries, the reasonable restriction imposed on freedom of speech under Article 19 (2) of the Constitution should be completely repealed.”", 
    "section": "national", 
    "title": "Feudal mindset still prevalent: Justice Hariparanthaman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}