{
    "author": [
        "R Rajaram"
    ], 
    "text": "A five-member gang murdered a security guard while attempting to burgle a jewellery shop in Thanjavur and escaped from the spot in the early hours on Thursday.\n\nArmed with sharp weapons to commit burglary in one of the jewellery shops located along the Kasu Kadai Street, the gang fled the crime scene to escape upon noticing police personnel on rounds at that time nearby.\n\nTwo motorcycles said to have been used by the gang members and found near the spot were seized by the police.\n\nWhile one motorcycle bore a Puducherry registration number, the other had Chennai registration number.\n\nPolice sources said the gang members targeted one of the jewellery shops located along the Kasu Kadai Street and broke the locks of the shutter. The street houses a chain of jewellery shops. The security guard was engaged for a chain of jewellery shops along the street.\n\nThe burglary attempt by the gang members was captured in a closed circuit television unit installed at the shop and the police shifted the video footages later to establish the identity of the culprits.\n\nThe culprits, who were in their mid-twenties, did not wear masks while committing the crime.\n\nThe sources said the security guard R. Govindarajan (67) apparently heard some sound and rushed there. The burglars who caught hold of the watchman banged his head against the wall murdering him.\n\nThe sources said there was bleeding injury in the watchman’s left forehead.\n\nMeanwhile, a few local people of the area heard some sound and apparently opened the door to ascertain the activity.\n\nSensing trouble upon noticing police personnel on rounds at that time, the culprits took to their heels abandoning the motorcycles and aborting the burglary mission.\n\nThe body of the watchman, who died instantly, was found on a roadside ditch by the police personnel at the crack of dawn. On receipt of information, senior police officers rushed to the spot and conducted inquiries. The Superintendent of Police N.M. Mylvahanan inspected the crime scene and held inquiries.\n\nThe investigators later sifted the video footages captured in the CCTV unit to establish the identity of the culprits.\n\nThe Thanjavur West police have registered a case of murder. Police sources said a few people have been picked up by the police for inquiry in connection with the murder case.", 
    "section": "national", 
    "title": "Gang murders security guard in Thanjavur", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}