{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A section of students of Government College of Engineering here stayed away from classes on Thursday protesting the closure of second and third year students’ hostels and demanding the withdrawal of fine imposed on them for breaking a few solar-powered lights on the hostel premises within the college.\n\nThe two-hour-long sit-in protest in front of college’s main entrance was given up after the college authorities decided to withdraw the fine slapped on them and reopen the hostels immediately.\n\nAfter some of the students damaged a few solar panels fitted in the solar-powered lights on the hostel premises recently, the college authorities, following comprehensive enquiry and meeting of heads of all departments, decided to slap a fine of Rs. 2,000 each on the students and collect it in four instalments.\n\nWhen the students refused to pay the fine, the meeting of the heads of the departments with principal Shalini Punithavathani in chair decided to close down the hostels of second and third year students with immediate effect.\n\nAs the students did not expect such a punitive measure from the administration, they staged a road roko on the busy Tirunelveli-Nagercoil Highway in front of the college for a while on Tuesday. They, then withdrew their protest after the police intervened. Subsequently, the college authorities decided to withdraw the fine imposed on them while the hostels remain closed.\n\nProtesting it, a section of the affected students sat in front of the college’s main entrance and denied entry to the college premises. Subsequently, the main gate remained closed even as the students were protesting against the closure of the hostels.\n\nThe agitation that started around 8.30 a.m. continued till 10.20 a.m. after the police pacified the students with the assurance that their hostels would be reopened immediately.", 
    "section": "national", 
    "title": "Government engineering college students stage protest", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}