{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has thwarted an attempt made by a life convict in a murder case to escape punishment by claiming himself to be “insane” and therefore statutorily insulated from being punished for a criminal offence.\n\nDisposing of a criminal appeal filed by M. Jahir Hussain of Tiruchi district, a Division Bench of Justices A. Selvam and G. Chockalingam gave a series of reasons to disbelieve the claim of insanity and held that the appellant was nothing but a “feigned insane person.”\n\nThe judges pointed out that the appellant had not raised the claim of insanity when he was produced before the Judicial Magistrate for remand immediately after his arrest in 2013. He had, however, made the claim during the course of trial and sought immunity from punishment.\n\nThe trial court considered the claim thoroughly by examining the doctor who had reportedly treated the petitioner for mental illness and came to the conclusion that the claim was false. The appellant did not appeal against such a conclusion arrived at by the lower court. Instead, he allowed the court to proceed with the trial and impose life imprisonment.\n\nStating that the present appeal challenging the conviction and punishment had been filed by the appellant directly, the judges said that he would have been represented by his relatives or friends if he was really insane.\n\n“Therefore, it goes without saying that the alleged insanity of the first accused at the time of occurrence is nothing but a concocted story and the first accused is nothing but a feigned insane person,” the Division Bench held before commuting the life sentence to 10 years of rigorous imprisonment on another ground.\n\nThe judges pointed out that on the day of occurrence, the appellant had attempted to assault his neighbour B. Noor Jahan with a bamboo stick. Unfortunately, the stick fell on the woman’s aged father Baba Sahib who breathed his last after being hospitalised for about six days. Hence, the act of the appellant would fall only under Section 304 (ii) (culpable homicide not amounting to murder) and not Section 302 (murder) of the Indian Penal Code, they held.", 
    "section": "national", 
    "title": "HC thwarts life convict’s bid to escape punishment", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}