{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Says married daughters and siblings of those who die in motor accidents cannot be excluded from claiming compensation\n\nMarried daughters and siblings of those who die in motor accidents cannot be excluded from claiming compensation for the death since such exclusion would be against the object of the Motor Vehicles Act, the Madras High Court Bench here has held.\n\nA Division Bench of Justices S. Manikumar and R. Mahadevan passed the ruling while dismissing an appeal filed by an insurance company challenging a 2014 decision of a Motor Accident Claims Tribunal in Kumbakonam to grant compensation to a married sister of the deceased.\n\nAfter considering a host of decisions rendered by the Supreme Court and other High Courts and comparing the provisions of the Motor Vehicles Act, 1939 with those of Workmen’s Compensation Act, 1923 the judges held that marriage of a kin could not be a reason to deny compensation.\n\nThe Bench said that the 1923 Act listed the ‘dependants’ who were entitled to claim compensation under that legislation and it did not confer a statutory right on a married daughter. However, the 1939 Act stated that all ‘legal representatives’ of the deceased were entitled to claim compensation.\n\n“There is a distinction between being dependent on the income of the deceased and receiving a contribution from the deceased, either monetarily or through the services rendered by the deceased to the members of the family, and it is a decisive factor in computing the compensation.\n\n“If the intention of the framers of the Motor Vehicles Act was to restrict the payment of compensation only to the dependants, the word ‘dependant’ as defined in Section 2(d) of the Workmen’s Compensation Act would have been incorporated in Motor Vehicles Act also,” the Bench said.\n\nAuthoring the judgment, Mr. Justice Manikumar said: “The quantum of compensation or loss of contribution is not determined on the basis of monetary loss alone. It is also determined on the basis of invaluable and gratuitous services rendered by the mother or the wife as the case may be.\n\n“The legal representative, particularly a married daughter, may not be totally dependent on the income of the deceased mother for her survival or living, but still, there can be a monetary assistance, during the lifetime of the deceased. A mother can also continuously render her valuable service to her married daughter.\n\n“In the case of a married daughter, her father, mother or brother can continue to help her monetarily depending upon the need or out of love and affection. Contribution either by means of service or income or both can be taken into account to determine the quantum of compensation.”\n\n“There is a distinction between being dependent on income of deceased and receiving a contribution”", 
    "section": "national", 
    "title": "High Court ruling on accident compensation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}