{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madurai Bench of the Madras High Court has directed the Principal Subordinate Judge here to release the official vehicle of the Collector which was attached a couple of days ago following the officials’ failure to pay compensation to the heirs of landowners whose lands were acquired for the establishment of the office of INS Kattabomman in the early 1980s.\n\nProperties of four persons from Palayamkottai were acquired for establishing the office of INS Kattabomman and a compensation for the lands acquired was announced. Unsatisfied with the quantum of compensation, the property owners filed a petition in the Principal Sub-Court, Tirunelveli, which enhanced the award on March 8, 1989.\n\nWhen the Special Tahsildar (Land Acquisition) failed to execute the court order, the heirs of the landowners approached the court again, and it forced the Special Tahsildar to deposit Rs. 10.17 lakh in the court in February last. For the remaining amount, Principal Subordinate Judge, Tirunelveli, Hemant Kumar ordered attachment of the Collector’s vehicle on March 8.\n\nSubsequently, the vehicle, which had been parked in the Collectorate portico, was attached. Opposing the move, the Special Tahsildar (Land Acquisition) approached the Madurai Bench of the Madras High Court seeking cancellation of the attachment order as the Collector is not a party to the proceedings.\n\n“Moreover, the Collector, who is also the District Electoral Officer following the Election Commission of India’s notification of Assembly elections in the State, is unable to discharge his duties due to attachment of the vehicle,” the Special Tahsildar submitted. While granting interim stay on the order on attaching the Collector’s vehicle, Justice V.M. Velumani on Wednesday directed the Principal Subordinate Judge to release the vehicle immediately.", 
    "section": "national", 
    "title": "High Court orders release of attached vehicle of Collector", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}