{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Ashwin Jerome Fernandes, regional director, QS Asia Quacquarelli Symonds Ltd, Singapore, addressing the inaugural function of 'Mechnovate'16. (Right) A student rides a human-powered vehicle designed by his team at VIT University on Thursday.— Photo: C. Venkatachalapathy\n\nNearly 1,600 students vie with each other at VIT University’s meet focused on human-powered vehicles\n\nHaroon Rashid rides around in a semi-recumbent bicycle, only that it has a number of features not available in a regular cycle. Rashid along with his classmates from the Indian Institute of Technology (IIT) in Patna has designed and manufactured a human-powered vehicle that has incorporated innovative and safety features.\n\nThe team from IIT-Patna is among 50 teams from across India and a few foreign nations to take part in the VIT University’s Mechnovate’ 16, which showcases events of the American Society of Mechanical Engineers (ASME)-Human Powered Vehicle Challenge and Student Professional Development Conference.\n\nThe challenge required students to design and build human-powered vehicles based on a number of parameters such as energy required and speed, M. Anthony Xavier, convenor of Mechnovate’ 16 said.\n\nA total of 1,600 students from India, Mexico, Hong Kong and Dubai are taking part in the events.\n\nShubham Shukla, a second year Mechanical Engineering student from IIT-Patna, said the vehicle designed and built by the team has incorporated both comfort and safety factors for a rider. They have also used circular steering.\n\n“The vehicle has multi-gear system that increases the power. So, our semi recumbent cycle uses less power than a regular bicycle. It also has ultrasonic sensors to alert the rider of obstacles both in the front and rear sides, and adjustable seat,” Shiv Jee, another team member said.\n\nThe students said the cycle can ply for an average distance of nine to 10 km per hour, while they have attained maximum speed of 26 kms.\n\nIndraneel Choudhuri, a student of VIT, along with 12 others has also designed and built a two-wheeled semi recumbent cycle. “We have added a safety feature in our vehicle by installing sensors. If a person crosses the vehicle suddenly, the motor will pull the brakes automatically,” he said.\n\nAt the inaugural session on Thursday, Ashwin Jerome Fernandes, regional director, QS Asia Quacquarelli Symonds Ltd, Singapore, said, “Human-powered vehicles can play a role in the development of a sustainable transportation system and provide access to remote areas.”\n\nThese vehicles have a role to play in public health by keeping users fit, he added. He noted that such vehicles were important not just in an emerging economy like India but also in advanced economies like Singapore.\n\nHe said that VIT has been ranked in the top 200 universities among the BRICS economies in the QS rankings.\n\nVIT Chancellor G. Viswanathan said the manufacturing sector had great potential in the country but was not yet fully realised. “Presently, manufacturing sector contributed 16 per cent to the country’s GDP,” he said.\n\nThe Central Government, through its Make in India initiative, was keen on increasing manufacturing and cutting down imports, he said. He urged students to analyse what are the stumbling blocks for increasing manufacturing in the country, and come up with solutions.\n\nAmong others, Madhu Rangi, program manager, ASME, New York and Anand A. Samuel, VIT Vice Chancellor spoke.", 
    "section": "national", 
    "title": "Innovation is the name of the game at Mechnovate’16", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}