{
    "author": [
        "M K"
    ], 
    "text": "A majority of the cases related to violation of the model code of conduct is against the ruling AIADMK.\n\nTill Thursday morning the police have registered 205 cases.\n\nThe AIADMK topped the list with 50 cases, followed by the DMK 38 cases. Eighteen cases have been registered against the DMDK, eight against the KMDK, 19 against the Congress, 16 against the BJP, 13against the Communist parties, eight against the SDPI, seven against MDMK, six against Viduthalai Chiruthaigal Katchi, two each against Manithaneya Makkal Katchi, Kongu Jananayaka Katchi, Samathuva Makkal Katchi, and Popular Front of India. Coimbatore North tops the list with 44 cases followed by Thondamuthur – 21, Coimbatore South – 45, Singanallur – 8, Mettupalayam – 26, Sulur – 12, Kavundampalayam – 11, Kinathukadavu – 2, Pollachi – 10 and Valparai – 9. Most of these cases pertained to party flags, or flag posts, and graffiti. The police have also obtained undertakings from 276 people under Sections 107, 109 and 110 of the Code of Criminal Procedure.\n\nOn Thursday, poll officials seized Rs. 60,000 and 84 demand drafts totalling Rs. 80 lakh from a four-wheeler at Kallar, near Mettupalayam. The amount was returned after verifying documents.\n\nVoting machines checked\n\nPersonnel from Bharat Electronics Limited (BEL), Bengaluru, checked the Voter Verified Paper Audit Trail (VVPAT) machines to be used for the Assembly elections in the city. The personnel checked 350 machines that included 285 to be used in the booths and 65 standby machines and found that 35 of them were faulty. The 315 machines that were certified as fit by the team led by deputy manager S.B. Selvakumar, and junior section officer P. Ramu, will be inspected by the District Electoral Officer on Friday. The faulty machines will be repaired by a team from BEL on Monday. The machines will be fitted with new batteries and printing sheets before the elections.", 
    "section": "national", 
    "title": "Majority of cases against AIADMK", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}