{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Project receives clearance from Finance Ministry, sent to Union Cabinet for final approval\n\nhennai Metro Rail’s phase I extension from Washermenpet to Wimco Nagar may get its final approval soon after elections, and it is likely to be completed by 2019.\n\nAccording to sources at Chennai Metro Rail Limited (CMRL), the project has received clearance from the Finance Ministry and has been sent to the Union Cabinet for final approval.\n\n“We have already called for tenders for the underground section of the project sometime ago. Once the final approval comes in, full-fledged work may begin. Once the work commences, we plan to finish it in three years,” an official said.\n\nWhile CMRL officials have called for tenders for the underground stretch, they are also in the process of acquiring land for the project. After the final clearance comes from the Union Cabinet, they plan to call for tenders for the elevated stretch too.\n\nChennai Metro Rail’s phase I extension is estimated to cost Rs. 3,700 crore and cover 9 km of North Chennai from Washermenpet to Wimco Nagar. The first portion of the corridor from Washermenpet to Korukkupet will be underground and the alignment continues beyond this junction as an elevated stretch up to Wimco Nagar.\n\nThis project has had a long wait for approval. Though the State government gave its approval in 2010 after the soil tests were completed, the Centre’s permission is yet to come. Sometime ago, Union Minister for Urban Development M. Venkaiah Naidu had announced that his Ministry had given clearance and sent the project to the Finance Ministry for approval. Now, the project waits for the final nod of the Union Cabinet.\n\nThe first service of Chennai Metro Rail phase I from Koyambedu to Alandur was thrown open to the public in July last. The next stretch from Little Mount to Chennai Airport is likely to be completed in the next few months.", 
    "section": "national", 
    "title": "Metro Rail phase 1 extension likely by 2019", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}