{
    "author": [
        "L Renganathan"
    ], 
    "text": "Train to Jodhpur via Vridhachalam has poor patronage\n\nRail users and commuters are sore over the apparent neglect of the Main Line connecting Tiruchi and Villupuram via Thanjavur, Kumbakonam, and Mayiladuthurai and are now urging the Railway Ministry to take a look at their genuine demands that could bolster the railway revenues.\n\nEven during the recent Mahamaham, when more than 60 lakh pilgrims from various parts of the State congregated in Kumbakonam, the Railways’ efforts in meeting the passenger demands were found wanting, they said.\n\nPointing out that a special train between Tiruchi and Bagat-Ki-Kothi (Jodhpur) (06208) was operated on Tuesday via Vridhachalam although there was no particular demand from the passengers, vice-president of the Thanjavur District Rail Users’ Association A. Giri says out of 936 sleeper class berths made available for reservation in that train, only 51 were booked from Tiruchi and another 127 from Chennai leaving 758 berths vacant accounting for 12 per cent occupancy.\n\nWhereas Mannargudi-Bagat-ki-Kothi Weekly Express (16864) left Mannargudi on Monday with a passenger waitlist of over 50 reflecting the higher patronage and demand on that route via Kumbakonam and Mayiladuthurai Main Line, he says.\n\nThe railways did not heed the demand for a special train between Tiruchi and Raichur via Thanjavur and Kumbakonam for facilitating pilgrims visiting Mantralayam for Pattabishekam rituals and Raghavendra Jayanthi.\n\nDuring Mahamaham, Southern Railway operated only a few express services from Chennai and one each from Rameswaram and Nagercoil and most of the services reached Kumbakonam during odd hours. That was despite the reservation for tickets reaching the saturated levels three months ahead of the festival and the apathy was there for all to see.\n\nThe attitude of the Railways towards Mahamaham was disappointing. Neither infrastructure was developed nor adequate services operated, says Secretary of All Traders' Association V. Sathyanarayanan.\n\nOthers point out that only about a dozen pairs of shuttle service were operated between Thanjavur and Mayiladuthurai during the peak Mahamaham festival period despite the region’s rail enthusiasts raising the issues connected to Mahamaham requirements since 2013.\n\nEven the pleas by region’s MPs and elected representatives did not find favour with the Railways, they said. The commuters allege that there has been a long-standing deprivation of additional services on the Main Line as the Railways preferred the Chord Line via Ariyalur and Vriddhachalam instead of Thanjavur and Kumbakonam and wanted that issue addressed to dispel the notion of neglect nursed by the delta region.\n\nThe plea to operate the extended Puducherry-Mangaluru Central Weekly Express via Main Line was not met. If operated through the Main Line, the service would provide a direct link from Karaikal to Mahe.", 
    "section": "national", 
    "title": "Neglect of main line irks commuters’ association", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}