{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They demand early release of 23 fishermen jailed in Sri Lanka\n\nTraditional country boat fishermen and their family members staged a demonstration seeking the release of 23 fishermen, arrested by Sri Lankan navy on a charge of poaching in their territorial waters, after opening a ‘kanji thotti’ (gruel centre) here on Thursday.\n\nThe family members of the 23 fishermen, who were arrested by the Lankan navy on the night of March 12 when they were fishing on the high seas in Mannar Thaulpadu area, and a large number of women and children participated in the agitation, jointly organised by Country Boat Fishermen Association and the CITU-affiliated Tamil Nadu Meenpidi Thozhirsanga Koottamaippu.\n\nThe opening of the gruel centre was to symbolically demonstrate the plight of the fisherfolk, especially the country boat fishermen who faced threat to their livelihood as the Lankan navy started targeting them too, Association president S.P. Royappan and coordinator G. Arul said.\n\nKoottamaippu State general secretary C.R. Senthilvel, district secretary M. Karunamurthy, Pamban panchayat president Patrick, Thangachimadam panchayat president Gnanaseelan, Naam Tamizhar Katchi leader Domnic Ravi and CPI(M) leader Vadakoria were among those who participated in the stir.\n\nAfter distributing gruel to the fisherfolk, the leaders said that they would be forced to open ‘kanji thottis’ in all the fishing hamlets in the island to feed the fishing community if the Central and State governments failed to intervene and secure the release of the arrested fishermen at the earliest.\n\n“The country boat fishermen practised traditional fishing methods without causing any harm to the marine resources and the Lankan navy had arrested them just to harass the Indian fishermen from Tamil Nadu,” the leaders said.\n\nThe protest was also to demand the release of 20 Thoothukudi country boat fishermen and their three vallams (boats), they added.\n\nIf the Centre failed to prevail upon the Sri Lankan government and secure the release of the fishermen with their boats in the next few days, the country boat fishermen would lay siege to the office of the Assistant Director of Fisheries in Rameswaram on March 21, Mr. Karunamurthy said.\n\n“We are planning to mobilise about 2,000 fishermen and lay siege to the office,” he also said.", 
    "section": "national", 
    "title": "Pamban fisherfolk open gruel centre", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}