{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Celestial wedding of Murugan with Valliyanaki scheduled on March 22\n\nGRAND BEGINNING:The flag being hoisted at Thiruavinankudi Temple in Palani on Thursday to mark the commencement of Panguni Uthiram festival.— PHOTO: G. Karthikeyan\n\nWith hoisting of the holy flag, the 10-day Panguni Uthiram festival commenced at Thiruavinankudi Temple near Malai Adivaram here on Thursday.\n\nAt first, a special abishekam was performed to the ‘Dwajasthambam’ (flag post) in the outer mandapam.\n\nThe gurukkals tied ‘kaapu’ (holy thread) to Lord Muthukumaraswamy and Goddesses Valli and Deivanai. Later, the idols were taken in a procession around the temple and brought to the outer prakaram to witness the flag hoisting ceremony.\n\nSpecial pujas were performed to the holy flag that has symbols of the holy lance, cock and peacock of Lord Muthukumaraswamy.\n\nOthuvars recited Thevaram hymns and gurukkals chanted holy hymns, and chief gurukkal Amrithalinga Sivachariyar hoisted the temple flag at 11.30 a.m. in ‘Rishabha lagnam’. After flag hoisting, the God and Goddesses were mounted on a ‘sapparam’ for the ‘veedhi ula’.\n\nHundreds of devotees have starting bringing water from the Cauvery from Kodumudi in Erode district in ‘kavadis’ for performing abishekam to the main deity of the hill temple.\n\nThe celestial wedding of Lord Murugan with Goddess Valliyanaki Amman will take place between 7.30 p.m. and 8.30 p.m. on March 22, and the holy car procession at 4.30 p.m. on March 23.\n\nThe car procession will start from Sri Padha Vinayagar Temple at Malai Adivaram and conclude at the same place after passing through four Giri veedhis. Cultural programmes will take place at Kudamuzhukku Mandapam near Malai Adivaram during the festival days.\n\nTamil Nadu State Transport Corporation will operate additional bus services to the temple town from Dindigul and nearby districts during the festival.", 
    "section": "national", 
    "title": "Panguni Uthiram festival begins in Palani", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}