{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Machines assigned to Assembly constituencies, training and awareness programmes\n\nDistrict Election Officer-cum-District Collector S. Sundaravadivelu (right) conducting the first randomisation of electronic voting machines (EVMs) on Thursday —Photo: M. Samraj\n\nThe Election Department on Thursday commenced the process of first randomisation of electronic voting machines (EVMs) to the constituencies.\n\nDistrict Election Officer-cum-District Collector S. Sundaravadivelu conducted the process in the presence of representatives from the recognised political parties.\n\nThe first randomisation of Ballot Units (BUs) and Control Units (CUs) was done to randomly assign EVMs to Assembly Constituencies (ACs), and for training and awareness Programmes.\n\nDuring first randomisation CUs and BUs are assigned to ACs in the presence of the representatives of recognized political parties.\n\nThe randomisation is done in such a way that the units are randomly selected by grouping them to match the poll day requirement including the reserve required for each constituency.\n\nSurplus units after assigning ACs to them will also be randomly grouped and distributed AC wise for the purpose of training and awareness programmes.\n\nOfficials said a sticker of green colour would be affixed on the CUs and BUs assigned to ACs for polling. A sticker of yellow colour would be affixed on the CUs and BUs assigned for training andawareness programmes. The sticker will clearly indicate the name of State/UT and the number and name of assembly constituency.\n\n“Training/Awareness” would be written on the sticker of units assigned for training and awareness.\n\n“Election” would be written on the sticker of CUs and BUs assigned for polling. No current ID would be given during randomization. After randomization the units would be marked “Election” or “Training/Awareness” in the EVM tracking software.", 
    "section": "national", 
    "title": "Randomisation of EVMs begins", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}