{
    "author": [
        "R Sivaraman"
    ], 
    "text": "A file picture of the Chief Minister offering prayers at the samadhi of Swami Sitthananda on the occasion of 178th Gurupuja in Puducherry.\n\nEven as political leaders are breaking their heads on weaving alliances and choosing prospective constituencies, preparing candidate lists, leaving aside the elicitation of public opinion and the party cadres’ suggestions, Puducherry Chief Minister and All India NR Congress (AINRC) president N. Rangasamy prefers to seek divination on forging alliance with political parties .\n\nMr. Rangasamy, who has been keeping undue silence over all those things, set out on a brief pilgrimage on Thursday along with senior party leaders to the jeeva samadhis of his spiritual guru Appa Paithiyam Swami in Salem and Azhukku Swami, the guru of Appa Paithiyam Swamy at Vettaikaranpudur near Pollachi.\n\nSources in the party said only after the visit to these places, Chief Minister will take important political decisions and announce them in due course.\n\nMr. Rangasamy has been strongly attached to Appa Pathiyam Swami ever since he tasted the first electoral victory. Frustrated over the first electoral defeat in 1990, Mr. Rangasamy met Appa Paithyam Swami who was staying in Puducherry, for his divine blessings. Following the advice of Swami, he jumped into electoral fray by selling his land and defeated the then strong man and former Minister V. Pethaperumal.\n\nWhen Congress came to power, he became Agriculture Minister and later rose to the level of the Chief Minister.\n\nThe chamber of Chief Minister Mr. Rangasamy at the Assembly is adorned with statues and portraits. He also built a temple for his guru at Gorimedu. His supporters tell us that Mr. Rangasamy always takes any important decision only after obtaining approval from his guru.\n\nAccording to sources, Mr. Rangasamy also went with the list of probable candidates for getting approval at the samadhis and he is likely to visit the Thiruchendur Murugan temple further.\n\nIn the poll-bound Union Territory, after firming up alliance, Congress and DMK are holding parleys over seat sharing and AIADMK leaders are busy with election related activities. Mr. Rangasamy has been maintaining silence even as PMK and BJP evinced interest in aligning with him. AINRC MLAs and leaders are clueless on whether the party would contest alone or go with the AIADMK as preferred by a section of the MLAs.\n\nHowever, the party indicated that it would not receive any application for aspirants who wish to contest on the party ticket and ticket would be given to the persons whom Mr. Rangasamy selected.", 
    "section": "national", 
    "title": "Rangasamy goes on pilgrimage", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}