{
    "author": [
        "S Prasad"
    ], 
    "text": "A section of MLAs charge CM of bias\n\nAhead of the Assembly elections, a slew of resignations of important party functionaries and reports of exodus of more functionaries over the style of functioning of party founder and Chief Minister N. Rangasamy have rattled the ruling AINRC camp.\n\nOn Monday, ruling AINRC MLA and party secretary P. Angalane tendered his resignation from the primary membership of the party virtually showing the way for other disgruntled MLAs and functionaries within the party.\n\nMr. Angalane’s move follows the resignations of former Puducherry Planning Authority (PPA) chairman K.S.P. Ramesh and N.R. Balan last week.\n\nHistory is repeating itself with the ruling AINRC witnessing the same trend of exodus of party functionaries from the Congress during the 2011 Assembly elections.\n\nA few months before the elections were held in 2011, Chief Minister N. Rangasamy who was then with the Congress quit the party to float his own outfit. T. Thiagarajan who was then the Parliamentary secretary to the Chief Minister also quit the party and joined the AINRC. Political observers point out that Mr. Rangasamy is now being paid back with the same coin.\n\nThe most important issue that has been daunting a section of MLAs in the AINRC was the availability of jobs for unemployed youth in their constituencies. Mr. Angalane minced no words to point out that the Chief Minister deliberately ignored his constituency.\n\n“There is no respect for me in the party and my repeated representations to take care of employment opportunities in my constituency had fallen on deaf ears.”\n\nMr. Angalane is likely to tender his resignation from the post of MLA and said that he would take a final decision on his future political action.\n\nPolitical observers point out that pampering the constituency right from providing jobs to selection of beneficiaries under various welfare schemes has been Mr. Rangasamy’s style of functioning.\n\nA section of MLAs have openly gone on record that development activities were only concentrated in Kathirgamam, Indira Nagar and Thattanchavady while the other Assembly segments were virtually ignored. The opposition Congress has already charged Mr. Rangasamy with being biased towards his constituency.\n\nMeanwhile, AINRC general secretary V. Balan put on a bold face to point out that such resignations would have little impact on the party and its prospects in the forthcoming elections.\n\nHe said that Mr. Angalane who did not find anything amiss with employment opportunities over the last five years was now making allegations at the fag end of the government. Mr. Balan is a close confidante of Mr. Rangasamy who too had quit the Congress.\n\nAINRC general secretary V. Balan says resignations will have little impact on the party", 
    "section": "national", 
    "title": "Resignations rattle Rangasamy’s party", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}