{
    "author": [
        "T Madhavan"
    ], 
    "text": "Proposal seeks to entrust cases relating to passengers’ safety to the Force\n\nIf a proposal sent to the Centre by the Railway Minister is accepted, the Railway Protection Force (RPF), which now investigates only criminal cases relating to railway property, may pursue cases of crime pertaining to passengers’ safety too.\n\n“The Railway Ministry has submitted a proposal to the government to empower RPF to register and investigate passenger-related criminal offences,” a senior railway official said.\n\nThe Ministry has sought an amendment in the RPF Act, 1957, to have this change incorporated in the system. Opinions of the State governments have been received by the Ministry and the proposal is under consideration, officials said.\n\nCriminal cases relating to passengers are now investigated by Government Railway Police (GRP) of the State government, while RPF essentially looks after the protection of railway property. Sources with RPF told The Hindu that if the proposal was accepted, they would soon be able to register and investigate cases, hitherto attended by GRP and investigations of criminal cases pertaining to railway installations would be speeded up, they said.\n\nSince policing in the railways is a State subject, crime cases on railway premises and trains have always been registered and investigated by GRP but RPF also contributes to efforts of GRP in maintaining law and order.\n\n“ Since Law and Order is a State subject, there is objection from the police departments of State governments. It requires Constitutional amendment,” a senior officer said. “As of now, cases of crime in railways detected by the RPF are handed over to the GRP. If this amendment is made, the RFP can register and investigate these cases independently,” he said. “The advantage of empowering the RPF to investigate cases is that victims of crime would not be put to any undue inconvenience,” he added.", 
    "section": "national", 
    "title": "RPF may have a bigger role", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}