{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Work on stone base is gathering momentum; pilgrims’ amenities upgraded\n\nork on the construction of a new rajagopuram at Samayapuram Sri Mariamman temple has been in full swing at an estimate of Rs. 3.5 crore. The rajagpuram, which will be about 100-foot tall, will have stone base (kalkaram) to a height of 29 feet. Upon this, the ‘rajagopuram’ will be built for a height of 71 feet.\n\nWork on the stone base commenced about four months ago and is being executed at a faster phase. “Despite the space constraints for either moving or stocking the building material, including the boulders, the work is being executed using tractors,” an official told The Hindu on Thursday.\n\nRCC mandapam\n\nAnother major work executed is the repair and maintenance of the old RCC mandapam in front of the entrance to the temple. The mandapam, measuring 420 metres in length and 22 feet in height, was built about three decades ago, and now needed adequate maintenance, particularly with regard to the sunshade which had got weakened. As the shopkeepers have not vacated the area, the work was being executed with an eye on safety for them, lest debris should cause some injury to the shopkeepers below. A cross-section of shopkeepers complain that the work was being executed at a snail’s pace.\n\nDrinking water\n\nAdditional RO water units had been set up at a number of places in the temple. A star park at Rs. 13 lakh was coming up at an estimate of Rs. 13 lakh. The 12 zodiac and 27 birth stars would be represented at this part.\n\nAs part of renovation of the temple, the Hindu Religious and Charitable Endowment Department had taken up works for augmenting amenities to the visiting devotees at an estimate of Rs. 2.80 crore at the Master Plan Complex. An ‘Ammaivarthavar mandapam’ at an estimate of Rs. 1 crore, shopping complex at Rs. 80 lakh and an “Annadhana mandapam” at Rs. 1 crore would be built. This apart, a queue complex would come up for accommodating a large number of devotees.\n\n“The design of the queue complex will be finalised in course of time based on the comforts available at a few temples, including Sri Darbaranyeswarar temple (Sri Saneeswarar temple) at Tirunallar,” the source added.", 
    "section": "national", 
    "title": "Samayapuram rajagopuram work in full swing", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}