{
    "author": [], 
    "text": "The St. Joseph’s Institute of Management (JIM) would offer scholarships for its post graduate programme leading to the award of MBA from Anglia Ruskin University, the United Kingdom. Twenty-eight scholarships worth Rs. 18.5 lakh will be offered to the students who enrol for the PG programme. This would include one scholarship of Rs. 3 lakh, two scholarships of Rs. 1.5 lakh each and 25 scholarships estimated at Rs. 50,000 each. The tests for selecting students for the scholarship will be conducted at 10 a.m. on Sunday at St. Joseph’s Institute of Management, according to a press release. For registration and details, call 0431-4226481 or 9840081129.\n\nSpecial train\n\nThe Southern Railway will operate a special train from Chennai Egmore to Tirunelveli on April 7. The Chennai Egmore – Tirunelveli Special Fare Special Train (06001) will leave Chennai Egmore at 8.20 p.m. April 7 and reach Tirunelveli at 9.45 a.m. the next day. The train will stop at Tambaram, Chengalpattu, Villupuram, Vridhachalam, Tiruchi, Dindigul, Kodaikanal Road, Madurai, Virudhunagar, Sattur, Kovilpatti, and Vanchi Maniyachi, a Southern Railway release said. The train would have one AC 2-tier, two AC 3-tier, 12 sleeper class, and two luggage-cum-brake van coaches.\n\nEx-servicemen\n\nfor poll duty\n\nEx-service personnel who wish to be deployed on security duty for the Assembly election could apply to the District Ex-servicemen Welfare Office. Healthy ex-service personnel with identity cards can submit their applications to the office of the Assistant Director, Ex-Servicemen Welfare, 19-A, Warners Road, Cantonment, Tiruchi, in person. For details, call 2410579 or 9626709001, Collector K.S. Palanisamy said here on Thursday.\n\nCollector inspects\n\npolling stations\n\nMr. Palanisamy inspected some polling stations in Manapparai Assembly constituency and verified whether necessary amenities had been provided. Later, in a release, he said cash and articles estimated at Rs. 3.65 crore had been seized till Thursday by election officials during vehicle checks. If proper documents were submitted, the seized cash and items would be returned to the owners after verification, he said.", 
    "section": "national", 
    "title": "Scholarships for MBA students", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}