{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seven companies of paramilitary force to be deployed\n\nSecurity would be strengthened in 195 booths, identified as sensitive, out of the 1,559 polling stations in the district, said Collector and District Election Officer M. Ravikumar here on Thursday.\n\nThe number of sensitive booths had decreased from 240 during the last Lok Sabha election. The entire poll proceedings in these booths would be webcast. One micro observer would also be deployed in each of the sensitive booths.\n\nExclusive booth for women\n\nAt Kayalpatnam, an exclusive polling booth would be set up for women voters with women polling staff. Each constituency would have two model booths, he said.\n\nThis time the district would have 46,042 ‘first time’ voters in the age group of 18 to 19 years.\n\nTo help differently abled persons, 260 wheelchairs had been arranged with volunteers to help them in the polling booths. An exclusive booth for them would also be set up at Periyathalai.\n\nSo far, 45 complaints of violation of Model Code of Conduct had been lodged and reports concerning 42 of them have been sent to the Election Commission.\n\nThe violations mostly were related to graffiti displaying images of political party leaders, flagpoles with party flags and against laying roads.\n\nTwo cases had been booked against cadres for opening party office without permission and a wall poster printed without the address of the printer. Besides, Food Cell police had booked a case over seizure of 35 kilograms of PDS rice.\n\nVoter Verifiable Paper Audit Trail System (VVPAT) would be in place in most of the polling booths in Thoothukudi constituency.\n\nAfter casting the vote, voters would have an opportunity to see the symbol of the party they had voted for with this VVPAT facility.\n\nOut of 271 polling booths in this constituency, the VVPAT facility would not be available in 26 booths since these booths had more than 1,350 voters.\n\nTo create awareness about this VVPAT system among voters, programmes would be organised in key locations including bus stands.\n\nSecurity force\n\nSeven companies of paramilitary force would be deployed to strengthen security in all polling booths in the district.\n\nThree more such companies had been sought to enhance security further, he said.\n\nSub-Collector S. Gopala Sundara Raj, Kovilpatti Revenue Divisional Officer Kannabiran, Tiruchendur RDO Thyagarajan were present.\n\nThis time, Thoothukudi district will have 46,042 ‘first time’ voters in the age group of 18 to 19 years", 
    "section": "national", 
    "title": "Security to be strengthened in 195 sensitive booths", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}