{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "It seeks to know Sri Lankan refugees’ antecedents, passport details and future plans\n\nIn a discreet move, Sri Lankan Tamil refugees living in Tamil Nadu have been served a questionnaire that seeks to know their antecedents, passport details and future plans.\n\nAn NGO is believed to be involved in the survey though refugees apprehend that some other external agency might have initiated the process.\n\nAccording to a couple of refugees, the three-page questionnaire was delivered at their doorstep with an instruction that it be filled and returned on the spot. Volunteers engaged in the work reportedly claimed that the State police were aware of the exercise and even supported them.\n\nSeveral thousands of Sri Lankan Tamil refugees are settled inside and outside camps in Tamil Nadu. A sizable number of them are believed to be living without registering with the competent authority and their existence in Tamil Nadu is not on record anywhere. The issue of repatriating refugees came into focus after the ethnic war ended in Sri Lanka and a new government came to power there, police sources said.\n\nFear of refugees\n\n“The refugees fear that there is a move to forcibly repatriate them. Attempts to migrate to countries like Canada, Australia and some European countries have of late become difficult. Their future in Tamil Nadu is bleak as they have no work permit and live on with the paltry dole,” V. Suresh, national general secretary of People’s Union for Civil Liberties (PUCL), said.\n\nMany countries refuse to give visa to Sri Lankan Tamil refugees in Tamil Nadu thinking that India has already granted them asylum status here.\n\n“But the fact remains that the Government of India has only allowed them to stay here, nothing else. They have not been given a chance to lawfully work live with dignity. Many refugees are exploited and engaged as cheap labour,” Mr. Suresh said.\n\nAfter the devastating floods swept Chennai and its adjoining districts, the same NGO representatives visited Sri Lankan Tamil refugees and offered to help.\n\n“They gave us forms to fill up details of our address, contact numbers, loss of property in floods etc…but no relief came to us later. Perhaps they used that data to reach us now with these forms,” a refugee told The Hindu on Thursday.\n\nOne of the questions in the form sought to know whether the refugees had an Aadhar Card. There is another pointed question which asks the refugees whether they wanted to remain in India, go back home (Sri Lanka) or migrate to some other country.\n\nPolice not aware\n\nWhen contacted, senior police officials in the State said they were not aware of such a survey being conducted. No such activity was brought to the notice of the police. “There is no question of the police permitting any agency to meet and gather sensitive information from Sri Lankan Tamil refugees,” a police official said.", 
    "section": "national", 
    "title": "Sri Lankan refugees baffled over NGO questionnaire", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}