{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Lawyers practising in the Madras High Court Bench here feel that a statutory bar to grant anticipatory bail to those booked under Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989 played a crucial role in the speedy surrender as well as arrest of the accused in the honour killing of Dalit youth V. Sankar at Udumalpet in Tirupur district on Sunday.\n\nAdvocate I. Pinaygash said that Section 18 of the 1989 Act stated that “nothing in section 438 (power conferred on High Courts and Sessions Courts to grant advance bail to accused apprehending arrest) of the Code of Criminal Procedure shall apply in relation to any case involving the arrest of any person on an accusation of having committed an offence under this Act.”\n\nDespite such a specific prohibition, many courts in the country were granting anticipatory bail in cases booked under the SC/ST Act until the Supreme Court on September 10, 2012 held that courts could not grant advance bail to accused booked under the legislation even if there was a simple averment in the complaint of insult or intimidation by referring to the victim’s caste name.\n\nHolding that advance bail plea could be entertained only if there was not even a prima facie case against the accused, the apex court said: “When a provision has been enacted to protect Scheduled Castes and the Scheduled Tribes and a bar has been imposed in granting anticipatory bail, the provision in the Special Act cannot be easily brushed aside by elaborate discussion on the evidence.”\n\nHowever, advocate I. Robert Chandrakumar lamented that those accused of caste-related offences in the State had now devised a novel way to overcome the statutory bar and the apex court ruling. “They have begun to file petitions in the High Court undertaking to surrender before lower courts and seek a direction to the latter to dispose of their bail application right on the day of surrender.\n\n“The High Court too has been allowing these direction petitions liberally resulting in many accused being granted regular bail without undergoing imprisonment even for a single day,” he rued.\n\nOn the other hand, Government Advocate (criminal side) S. Prabha said that the High Court had been issuing such directions only on a case-by-case basis.\n\nShe said that Justice P.N. Prakash had on March 8 dismissed one such direction petition filed by A. Prabhakaran of Tiruchi after she brought it to the notice of the judge that the Dalit victim in that case had suffered head injuries in the clash between him and the accused.", 
    "section": "national", 
    "title": "“Statutory bar on granting AB led to speedy arrest of accused”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}