{
    "author": [], 
    "text": "RELIGION\n\nSri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal purappadu in Garuda vaganam, 7.30 a.m.; reaching Renga vilasa mandapam, 9.30 a.m.; purappadu in Garuda vaganam, 6.30 p.m.; reaching vagana mandapam, 8.30 p.m.; reaching kannadi arai, 9.30 p.m.\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Velli Rishabam-Rishabam vaganams, 7 p.m.\n\nSri Srinivasa Perumal Temple, Indira Nagar: Sri Alamermelmangai Thayar Brahmotsavam, homam, thirumanjanam, 8 a.m.; serthi sevai in hamsa vaganam, 6.30 p.m.\n\nArulmigu Thirumoolanathaswamy Temple, Poovalur: Maha kumbabishekam, 9 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Kothandarama Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6.45 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 41, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary, vocal concert by Mohan Santhanam and party, Mahatma Gandhi Centenary Vidyalaya, Thennur, 6.30 p.m.\n\nGENERAL\n\nBharathidasan University: National conference on “Nanophotonics”, V.M. Muthukumar, Vice-Chancellor, releases the souvenir, M. Lakshmanan, professor, Centre for Non-linear Dynamics, inaugurates, 10.30 a.m.\n\nConfederation of Indian Industry SME Finance Facilitation Centre: Session on ‘Empowering SMEs through addressing their financing needs,’ Hotel Breeze Residency, 5.30 p.m.\n\nNational College: Core group special meeting, Naveen Krishnan, founder, Global Nature Foundation, speaks on Reptile Awareness, 12.30 p.m.\n\nPravaag Transitional Centre and School for Children with Autism, K.K. Nagar: Workshop on Parenting special kids, R.Panchanthan, Director, Talent Consultancy, speaks, 10.30 a.m.\n\nM.A.M. College of Engineering and Technology: Sports day, 3 p.m.\n\nNational College Department of Mathematics: Nacomat 2016 – State-level inter-collegiate competition, K. Anbarasu, principal, presides, 9.30 a.m.; N. Ramanujam, honorary professor, Bharathidasan University, distributes prizes, 4.45 p.m.\n\nBishop Heber College Department of Environmental Sciences: Envirovision 2016 – annual project seminar, N.D. Shrinithivihahshini, assistant professor, Bharathidasan University, speaks on “Environmental literacy”, 9.30 a.m.\n\nK. Ramakrishnan College of Technology: Workshop on “Quadcopter by Wingfotech-Chemclave of IIT”, Madras, 10 a.m.\n\nUrumu Dhanalakshmi College: Book review, 12.30 p.m.\n\nTRP Engineering College: Programme on “Tools and techniques for real time projects”, 9.30 a.m.\n\nMahalakshmi Engineering College: Dynamechs – symposium, V. Pakkirisamy, former professor, National Institute of Technology, chief guest, 10 a.m.\n\nMother Nursery and Primary School: Science exhibition, 10 a.m.\n\nSri Ramakrishna Vidylaya Matriculation School: Annual day, J.Srinivasan, deputy Mayor, chief guest, 5.30 p.m.\n\nSouth India Krishna Oil and Fats Pvt. Ltd.: Traders meet, Hotel Ramyas, 5 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}