{
    "author": [
        "Deepa H"
    ], 
    "text": "Even as political parties are busy finalising their candidates’ lists, city-based transperson Sudha visited the AIADMK office and applied for a ticket on Thursday. “I know that the party has finished collecting applications from cadres. But at that time we hadn’t been able to decide who should apply for a ticket,” said the 44-year-old Sudha, who is in awe of party general secretary and Chief Minister Jayalalithaa.\n\n“I am really impressed by her work. Ever since she came to power, the discrimination against our people has come down. She has been instrumental in setting up drop-in centres in all districts for us, through which we get medical care and counselling. She has set aside Rs. 20 crore for homes for transgenders in Eranavur,” she said.\n\nWill she contest as an independent in the event of her not getting a seat? She said: “I won’t as I do not want to oppose the candidate from Amma’s party.”\n\nShe was accompanied by her friends, who expressed their joy at her submitting the application form.\n\nAt least three other transpersons have either applied for ticket or plan to apply. This is perhaps the first time that more transpersons are planning to contest elections. All the candidates say they would serve the society in a better manner since they do not have families and have no need to become corrupt.\n\nNam Thamizhar has allotted the R.K.Nagar seat to Devi, who has already begun her campaigning. She is now busy addressing public meetings. The DMDK’s Radhika has applied for a ticket from Salem (north) constituency. “I have been with the party since its inception and hope to get a ticket. This is the first time I am applying. I want to create jobs and ensure proper education for my people. I am yet to get any confirmation that I will get a seat,” said Radhika, who has acted with party founder Vijayakant in the Tamil film Vridhagiri .\n\nBharathi Kannamma, who polled 1,226 votes in the Lok Sabha elections in Maruai, said she planned to contest this time too. “I plan to contest from a party that respects transpersons. I was in a party for two years and though the founder was very understanding and respected me, the second rung leaders did not. I think that transpersons must stand in all 234 constituencies so that they can serve the people in a better manner,” she said, adding that standing in elections not only would give them an identity but also create a space for them in democracy.\n\nThere are at least 35,000 transpersons in the State who receive medical attention through the health department.", 
    "section": "national", 
    "title": "Transpersons stand up, want to be counted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-18"
}