{
    "author": [
        "M T", 
        "Shiva Kumar"
    ], 
    "text": "Bulk of the waste is generated by tourists travelling towards Ooty and Masinagudi\n\nLiquor bottles, beer cans and plastic covers — totalling nearly a tonne of waste — are strewn in an area that houses the largest tiger population in Karnataka.\n\nAccording to Forest Department officials at Bandipur, the quantity of waste collected from the national park is anywhere 700 kg and 1,000 kg a month, which includes paper plates, aluminium foil, plastic water bottles, polythene covers, and waste paper. This is particularly bad in the stretch between the Bandipur border near Melukamanahalli in Karnataka and the Tamil Nadu border in Mudumalai.\n\nThe bulk of the waste is generated by tourists, travelling towards popular hotspots of Ooty and Masinagudi. Thousands of tourists travel on the highway every day through the Bandipur National Park, and many dump waste within the eco-sensitive tiger reserve, which has 120 tigers, according to the recent tiger census.\n\nSome tourists, especially youngsters, consume alcohol along the highway and smash the liquor bottles leaving shards of glass there, a worker engaged in collecting waste told The Hindu .\n\nThough the Forest Department recently launched a drive to maintain a garbage-free environment in Bandipur by hiring 10 workers to collect waste by the highway, there is still work to be done. The workers collect waste thrice a week and it is handed over to the Gundlupet municipal authority for disposal.\n\n‘TN authorities stricter’\n\nEnvironmentalists said the Forest Department of Karnataka was not as effective as its Tamil Nadu counterpart in monitoring tourists. At the check-post in Mudumalai, officials check the tourists, seize liquor bottles and issue strict warning against dumping waste in the forests. They even note down vehicle registration numbers. But no such measures have been initiated in Karnataka. The State Forest Department has only installed warning and suggestion boards.", 
    "section": "national", 
    "title": "A tonne of waste a month collected from tiger reserve", 
    "subsection": "general", 
    "date": "2016-03-09"
}