{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "With a sitting vice-president of the JNU unit of the Akhil Bharatiya Vidyarthi Parishad (ABVP), the RSS’ student affiliate, burning the Manu Smriti on the campus on International Women’s Day on Tuesday, something unprecedented in the Sangh Parivar’s history happened.\n\nWhile Dr. B.R. Ambedkar — who was also India’s first Law Minister — had indeed burnt the document, associating it with inequality, it was in sync with the radical Dalit politics he espoused.\n\nBut this time the challenge comes from within Hindutva — which finds Hindu traditions to be meaningful — though the challengers are already marginal within and seem to be on the verge of staging an exit.\n\nPresent with Jatin Goraya, the JNU ABVP unit vice-president, who is a Dalit from Haryana, were Pradeep Narwal and other students who have moved away from ABVP since the arrest of JNUSU president Kanhaiya Kumar — out on bail now — under sedition law. Clearly, young Dalit leaders who had associated with Hindutva’s Dalit outreach seem to have moved away ideologically as the ABVP has clashed with the Ambedkar Students’ Association at Hyderabad University — where Rohith Vemula committed suicide — and with the Left union at the JNU.\n\n“These are contradictions between Hindutva and Dalits surfacing in the wake of recent controversies. Hindutva does not know how much to shift its line to accommodate Dalits, who are also Ambedkarites. And young Dalits also cannot adapt to it beyond a point. This contradiction is already playing out in this case,” said Badri Narayan, who teaches social exclusion at the university.\n\nProf. Narayan says caste as an institution is a prime impediment to the growth of Hindutva and the contradictions between the two are beginning to surface.\n\nMr. Narwal told The Hindu that Mr. Goraya would quit the ABVP if the organisation did not condemn the Manu Smriti, widely seen as an “anti-Dalit” and “anti-women” text.\n\nThe Sangh Parivar, however, seems to be playing down this incident at the JNU for the moment.\n\nABVP Dalit leader burns ‘Manu Smriti’ which is seen as\n\nan ‘anti-Dalit’,\n\n‘anti-women’ text", 
    "section": "national", 
    "title": "At JNU, caste trumps Hindutva", 
    "subsection": "general", 
    "date": "2016-03-09"
}