{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Arun Jaitley says that free speech cannot be allowed to be used to advocate break-up of the country.— PHOTO: PTI\n\nFinance Minister Arun Jaitley hit out hard at the Opposition parties on recent controversies, accusing them of trying to “fix” Prime Minister Narendra Modi in the Ishrat Jehan case.\n\nIntolerance debate\n\nIntervening in the debate on the motion of thanks for the President’s address to Parliament in the Rajya Sabha, Mr. Jaitley said: “You talk about intolerance. During the Delhi polls, news about attacks on religious places of a particular community was played up and an image was created the world over that it was political atrocity. When police investigated, they were found to be cases of theft or simple vandalism under the effect of liquor. But you used it during the Delhi elections.”\n\n“In West Bengal a nun was assaulted and a Bangladeshi was arrested for it. This happened in a State [not ruled by the BJP], but you gave it a political colour. Today, the debate on intolerance is who will be the chairman of an institution.”\n\n“I have read history and remember that when a singer did not sing in a Youth Congress programme, he was debarred from AIR,” he said referring to renowned singer Kishore Kumar and his blacklisting by All India Radio during the Emergency of 1975-77.\n\nReferring to the change in affidavit by the Home Ministry in the Ishrat Jehan case that did not refer to her as a Lashkar-e-Taiba operative, the Finance Minister said: “In the process, you unbarred the entire security apparatus of India because you wanted to fix a political leader. Some day an investigation will take place on how internal security was played with.”\n\nAt this, Leader of the Opposition in the Rajya Sabha, Ghulam Nabi Azad, intervened and said the rulings of the “metropolitan magistrate’s court and the High Court cannot be dismissed.” “Security Agencies are not sacrosanct, that is why there is something called counter intelligence to keep an eye on all this,” Mr. Azad added.\n\nTo this, Mr. Jaitley said that in a country like India, which is frequently the victim of terror attacks, “our agencies have to struggle to keep pace with forces out to attack us.”\n\nOn JNU row\n\nResponding to the JNU row, he said the government has nothing against a “particular student,” an apparent reference to student leader Kanhaiya Kumar, but asserted that free speech cannot be allowed to be used to advocate break-up of the country.\n\n“I expect mainstream political parties like Congress to be in the forefront of being against these people. Please don’t do anything that lends respectability to such people,” the Minister said.\n\nMr. Jaitley rejected Congress vice-president Rahul Gandhi’s charge that the government has let Pakistan off the hook, saying: “We are compelling Pakistan for the first time to own up that the attack in India is taking place from their land.”\n\nPrime Minister Narendra Modi is expected to respond to the debate on the Motion of Thanks to the President address on Wednesday.\n\n‘You unbarred the entire security apparatus of India to fix a political leader’", 
    "section": "national", 
    "title": "Attempt to ‘fix’ Modi in Ishrat case: Jaitley", 
    "subsection": "general", 
    "date": "2016-03-09"
}