{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Allahabad student leader Richa Singh, whose ordeal was raised in Parliament on Tuesday, has received support both from the ruling Samajwadi Party government and the Opposition Bahujan Samaj Party in Uttar Pradesh.\n\nIn a last minute decision, the Akhilesh Yadav government included Ms. Singh’s name in the list of women to be conferred the Rani Laxmi Bai bravery awards on International Women’s Day. Her name was not in the original list and she was surprised to receive a call from the government on the eve of the ceremony. The award was handed to her by Chief Minister Akhilesh Yadav in Lucknow on Tuesday. “He has assured me his full support. I also received assurances from the SP. In this fight against saffronisation of educational institutions and harassment of a woman student leader, we are reaching out to all parties,” Ms. Singh told The Hindu .\n\nBSP chief Mayawati also extended support to the student leader, who has complained of harassment at the hands of the Allahabad University administration and the ABVP. She said the SP government and the university had not learnt any “lesson” from the death of Dalit scholar Rohith Vemula. She said the first woman president of the Allahabad University Students Union since Independence must be provided adequate security by the State government. She called Ms. Singh a victim of oppression.\n\n“Her only crime was that she opposed the entry of Yogi Adityanath.” He is known for vitiating the atmosphere with his communal speeches into the campus, she said.\n\nMs. Singh has also been in the limelight for taking on the ABVP and raising issues of gender insensitivity. She now faces the prospect of having her admission cancelled and a case against her election is pending in the Allahabad High Court. Ms. Singh has said the administration was targeting her to “settle scores.”\n\nMeanwhile, the university has constituted a fresh five-member committee to probe the legality of Ms. Singh’s admission for Ph.D in 2013-14. An earlier inquiry had found that a “wrong process” was followed and there was violation of reservation norms. While Ms. Singh accused the administration of conspiring to “mentally harass” her, the AU student welfare department said her admission “is not cancelled.”\n\nMs. Singh, who won the AUSU election as an independent candidate with the backing of the SP’s student wing, accused the administration of overlooking serious complaints of ragging and harassment of students, while entertaining “baseless” complaints based on vendetta.\n\nAmit Singh, OSD to the vice-chancellor’s office, filed a defamation case against Ms. Singh after she questioned his appointment on the ground that he was once accused of atrocity against a Dalit woman. “The matter was enquired into and documents were sought from the Court. Evidence from different offices was obtained and it is proved that Amit Singh is not a criminal,” an AU spokesperson said.\n\nMs. Singh, however, maintained that the official was yet to be cleared.", 
    "section": "national", 
    "title": "Bravery award for Richa Singh", 
    "subsection": "general", 
    "date": "2016-03-09"
}