{
    "author": [
        "Devesh K"
    ], 
    "text": "More than 150 officials have been summoned on phone without notice, claims the Delhi Chief Minister.\n\nEven as Delhi Chief Minister Arvind Kejriwal on Monday accused the Central Bureau of Investigation of not following proper procedure for summoning his staff, the agency said all actions were being taken as per law and that the three officials in question work under Principal Secretary Rajender Kumar who is facing corruption charges.\n\nMr. Kejriwal in a series of tweets claimed that his staff had been summoned “on phone without notice.” “CBI summons Delhi CM staff ‘informally’ on phone without notice. Staff of other Ministers’ called earlier like this. [sic]” He said the government had nothing to hide, but CBI should follow proper procedure.\n\nKejriwal said: “Which sec (section) of CrPC empowers CBI to summon on ph (phone)? Till now, more than 150 officers summoned on ph (phone) [sic]” We hv (have) nothing to hide. I hv told all officers to cooperate. But CBI shud (should) follow law-summon thro (through) proper notices [sic].”\n\nCBI sources said that the Delhi Chief Minister had given approval for the examination of two personal assistants, J.S. Rawat and Sasi, and lower-division clerk Yogesh, who work under IAS officer Rajender Kumar.\n\nThrough a letter on Sunday, citing a telephonic conversation, Delhi government’s Deputy Secretary (Administration) Bhupender Kumar had informed a Superintendent of Police with the CBI that the matter was discussed with the Chief Minister, who gave his approval on the condition that all of them were not called for examination on the same day.\n\nIn its reply, the agency informed the Deputy Secretary that the officials to be examined worked under the accused 1989-batch IAS officer. The others under CBI scrutiny are Endeavour Systems Private Limited and its two directors Sandeep Kumar and Dinesh Kumar Gupta; A.K. Duggal and G.K. Nanda, former managing directors of public sector unit Intelligent Communication System India Limited; and its incumbent managing director R.S. Kaushik.", 
    "section": "national", 
    "title": "CBI is not following procedure in summoning my staff, alleges Kejriwal", 
    "subsection": "general", 
    "date": "2016-03-09"
}