{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Security agencies in Kashmir are re-strategising counter-insurgency operations in the wake of the growing trend of civilians hampering operations against militants by resorting to stone-pelting in Kashmir.\n\nAccording to the police records, at least six bids were made by the local population in south Kashmir “to help trapped militants escape from the encounter site.”\n\nThree militants, in two separate operations, succeeded in breaking the cordon in Pulwama district as the civilian population used the public address system and pelted stones at the security forces.\n\nOn Tuesday, the Army allegedly opened fire in Ashmuqam, 70 km south of Srinagar, and injured two civilians as protests broke out during a search-and-cordon operation launched after a tip-off about militants’ presence.\n\nThe injured, identified as Javaid Ahmad Wani (22) and Amir Sheikh (21), were shifted to hospitals. A shutdown was observed in protest against the Army action.\n\nSpeaking to The Hindu , Inspector General of Police (IGP), Kashmir range, Syed Javaid Mujtaba Gillani, admitted to the new challenge. “In the past, the security forces would face a law and order problem once the encounters were over. We would send a law and order component of the police only after the operations were over. However, it is seen now that civilians intervene during ongoing operations.”\n\nDespite repeated police advisory to the civilian population “to stay 2 km away from the operation site and not rush towards the area,” it has failed to yield results on the ground.\n\n“We have decided to have a permanent law and order component as part of the counter-insurgency operation now. It will take over as and when the operation starts in an area,” Mr. Gillani told The Hindu .\n\nTwo civilians were killed near an encounter site in Pulwama district on February 14. Another civilian was killed during a raging encounter in the same district on January 20 in south Kashmir.\n\nMeanwhile, the National Conference condemned the firing in Ashmuqam and demanded a judicial probe into it.", 
    "section": "national", 
    "title": "Civilian protests in Kashmir help militants escape: police", 
    "subsection": "general", 
    "date": "2016-03-09"
}