{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The Government will showcase ties between Indian civil society organisations and the foreign policy goals during a conference later this week.\n\nThis comes after the Ministry of External Affairs displayed the achievement of the civil society organisations in the field of sustainable development and renewable energy during the Cop21 Paris climate change conference and the India Africa Summit of 2015. The global-level conference will be part of a year-long mega conference series, kick-started by the MEA last week with the Raisina Dialogue.\n\nAlmost all the major civil society organisations of India will participate in the March 10-11 “Conference on South- South Cooperation”, being organised by the Research and Information System for Developing Countries (RIS) of the MEA, to showcase the expanding space for civil society organisations in the scheme of the External Affairs Ministry.\n\nNew centre of economic activity\n\n“New South-South cooperation is needed in view of the shrinkage of resources in the developed North and the emergence of South as a new centre of economic activity,” said Shyam Saran, Director General of RIS and Former Foreign Secretary, highlighting that Indian civil society organisations in the field of sustainable development will play a key role in the two-day conference.\n\nThe conference, to be attended by at least 100 experts from the field of international affairs and development economics, will be a platform for the Government's long term plan to use development assistance as a tool for India’s diplomacy.\n\nThe Ministry of External Affairs has been showcasing civil society initiatives at the international level and also used organisations like the Barefoot College of Tilonia to highlight India's commitment to the sustainable development goals (SDGs).\n\nIn addition to the civil society connection, the conference will also launch the Network of Southern Thinktanks (NeST) which will connect think tanks across Africa, Southeast Asia, Central and South Americas.", 
    "section": "national", 
    "title": "Civil society takes centre stage at MEA outreach programme", 
    "subsection": "general", 
    "date": "2016-03-09"
}