{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "There have been 16 accidents involving the indigenously built Dhruv Advanced Light Helicopter (ALH) ever since the Hindustan Aeronautics Limited began producing them in 2002, the government informed Parliament on Tuesday.\n\nIn two accidents, the helicopters were civilian variants. Eleven accidents occurred in India and five abroad.\n\n“Out of 16 accidents, 12 occurred due to human error and environmental factors and the remaining four occurred due to technical reasons,” Minister of State for Defence Rao Inderjit Singh said in a written reply in the Rajya Sabha.\n\nThe Dhruv has been indigenously designed and developed by the HAL and is powered by a Shakti engine jointly developed by the HAL and Turbomeca of France.\n\nEcuador ends contract\n\nEcuador had procured seven ALH Dhruvs from India, five in 2009 and two in 2011 in a deal worth $ 45.2 million, of which four had crashed following which the remaining have been grounded. Late last year, the Government of Ecuador had unilaterally terminated the contract with HAL.\n\nOn this, the government said that as per the notice issued by the Ecuador government, ‘non-compliance of the seller of some of the obligations contracted by virtue of the present contract’ and ‘value of the fines exceeding the amount of guarantee of faithful compliance of the contract’ had been cited as the reasons. While two of the crashes have been attributed to pilot error, one was due to a mechanical failure while the reason for the fourth crash is still being debated.\n\nOn this, Mr. Singh said: “After the enquiry, based on the specific nature of the recommendations, the required improvements/corrective measures are implemented by the operator, HAL and other Original Equipment Manufacturers [OEM] as applicable.”\n\nIn addition to Ecuador, two ALHs had been exported to the Maldives and one each to Nepal and Mauritius.", 
    "section": "national", 
    "title": "Dhruv helicopters involved in 16 accidents since 2002, says govt.", 
    "subsection": "general", 
    "date": "2016-03-09"
}