{
    "author": [], 
    "text": "A bird’s-eye view:Top, a member of Laos' paramotor flyers team taking off during an air show in Xayabury, and above, a camera fixed on a wing shows Miss Laos 2015 Soutilack Intsaboung learning flying techniques above the Khoksa airfield, outside Vientiane.— Photos: AFP\n\nThe landlocked country has seen a rise in aerial sports\n\nBad roads, big mountains and dense jungle have gifted Laos a difficult and dazzling terrain — one that is now being enjoyed from the skies by a well-heeled new crop of pilots pursuing a passion for aerial sports.\n\nThe pastime, new to the tiny, poor Southeast Asian nation, was made possible by Ravansith Thammarangsy, a Franco-Laotian flight instructor who returned to the country of his birth to set up Laos's first aerial club in 2010.\n\nNow there are some 20 recreational pilots flying above the country's green hills, with more learning and hoping to compete in global games.\n\n\"It was a childhood dream of mine. I lived near the airport, and every day I saw the planes go by,\" said Soutilack Intsaboung, a student at Lao Airsports Club.\n\nThe club’s founder, known as \"Sith\", said it took time to convince the country's communist rulers to sign off on the venture, which uses an airfield 40 km north of the capital Vientiane.\n\nHe worked with the government to draft regulations for ultra light aircraft — including small helicopters — and had to convince authorities that the sport was not a threat the national security.\n\nPermissions obtained\n\n\"We had to fight to get the necessary permission,\" he said. \"Now they’ve realised that it’s a sport like any other.\"\n\nWhile airplanes are largely only accessible to expats and the wealthiest Laos citizens, paragliding and other airborne endeavours are starting to win a wider fan base.\n\nLaos now has an avid crew of paramotor flyers and even a national paragliding team.\n\n\"We're very proud,\" said Soutilack Intsaboung, one of the team's members.\n\n\"It's a good thing to show that we now know about this sport in Laos, and that we are able to take on international athletes.\"\n\nIn December Laos joined ten other nations from around the region to form the Airsport Federation of Asia. The organisation is seeking a space for sports such as paragliding, paramotoring and parachuting in global competitions.\n\nThey've set their sights on the upcoming Asian Beach Games in Vietnam, and even the 2020 Summer Olympics in Japan.\n\nBut for now, international recognition is still a long way off for Laos. Still lacking large enough facilities, the country's paragliding team was forced to co-host its first competition last month in Thailand. — AFP", 
    "section": "national", 
    "title": "Enjoying Laos from the top", 
    "subsection": "general", 
    "date": "2016-03-09"
}