{
    "author": [
        "Bindu Shajan Perappadan"
    ], 
    "text": "Plea seeks stoppage of construction on the Yamuna floodplains for the World Culture Festival\n\nThe stage under construction for the World Culture Festival being organised by Sri Sri Ravi Shankar, founder of the Art of Living Foundation, in New Delhi on Tuesday.— Photo: PTI\n\n“Has any of the agencies assessed the environmental impact of the Sri Sri Ravi Shankar’s Art of Living Foundation’s three-day ‘World Culture Festival’ to be held in the city starting this Friday?” asked the National Green Tribunal (NGT) on Tuesday. It was hearing a plea seeking stoppage of ongoing construction on the floodplains for the cultural festival. The Tribunal also questioned the Union Environment Ministry as to “why no environmental clearance is required for erecting structures in Yamuna floodplains,” and directed it to file an affidavit detailing its reasons on Wednesday.\n\nThe Bench headed by NGT chairperson Justice Swatanter Kumar sought to know from the Delhi Development Authority (DDA) about who issued permission for the building of pontoon bridge by the Army on the Yamuna for the festival.\n\nIn response, the DDA maintained that it was required only to issue a no-objection certificate for the bridge while the Delhi Government stated that it would be involved in the case of flood. The Union Environment Ministry too chose to pass the buck to the Ministry of Water Resources.\n\nThe NGT chairperson then added: “As per some photos in the media, construction seems to be happening inside the river. The court wants to know exactly the number of persons who are expected to be present at the site for the festival.”\n\nThis, when all the involved agencies — AOL, the DDA or the Delhi Police — gave conflicting numbers of guests expected for the event.\n\nMeanwhile, AOL maintained that they started work at the site after taking requisite permissions. This was refuted by the Delhi Police and the Delhi Pollution Control Committee. They maintained ignorance of any environment assessment being undertaken by the Foundation to assess the environmental damage caused by the event.\n\nThe matter has been adjourned for Wednesday.", 
    "section": "national", 
    "title": "‘Has eco-impact been assessed?’", 
    "subsection": "general", 
    "date": "2016-03-09"
}