{
    "author": [], 
    "text": "Icebergs like the one that sank the Titanic are still a threat to ships today.— Photo: AFP\n\nThe giant iceberg responsible for sinking the Titanic on its maiden voyage may have originated in southwest Greenland in snow that fell about 1,00,000 years ago, scientists say.\n\nGrant Bigg from Sheffield University in the U.K. combined observations obtained from 1912 — the year of the Titanic’s sinking in the Atlantic Ocean — and modern data on ocean currents and winds.\n\nMr. Bigg used a computer model which can calculate the icebergs’ paths in any given year.\n\n“We take what we know about ocean currents, then add in meteorological readings for that year to calculate the prevailing winds,” he said.\n\nApplying those methods to 1912 points to the iceberg emerging from around Qassimiut on the southwest Greenland coast, he added.\n\nThe iceberg that sank the Titanic on April 14, 1912, in which at least 1,517 people died, was estimated to be 400 feet in length and 100 feet above the ocean surface, giving it 1.5m tonnes in estimated size.\n\nThe iceberg, however, had been melting into the water for months prior to the incident. According to Mr. Bigg, it was around 1,700 feet long and 75m tonnes in weight. Mr. Bigg’s research suggests 1912 was a bad year, with icebergs reported floating much further south than normal.\n\n“The presence of extensive ice was widely reported prior to and following the collision,” Mr. Bigg wrote in his new book, Icebergs .\n\nHe said why the number reaching shipping lanes should vary so much from year to year is unclear, because so many factors — wind direction, sea currents and temperature changes — are involved.\n\nOne idea is that the Titanic iceberg broke from its glacier in 1908 when a mild winter accelerated melting and floated south during the much colder winter of 1911-12. — PTI", 
    "section": "national", 
    "title": "Iceberg that sank Titanic was 1,00,000 years old, says study", 
    "subsection": "general", 
    "date": "2016-03-09"
}