{
    "author": [
        "National Bureau"
    ], 
    "text": "Himachal Pradesh Chief Minister Virbhadra Singh had told a visiting Pakistani team that the State government would not provide any security to the cricket team.— PHOTO: AFP\n\nThe Board of Control for Cricket in India (BCCI) has said the India-Pakistan World Twenty20 Cricket match at Dharamsala will be held as per schedule (on March 19) and that “the State government was on board.”\n\nAfter an hour-long meeting with senior officials of the Ministry of Home Affairs (MHA) at North Block on Tuesday, Tournament Director M.V. Sridhar said the Himachal Pradesh government was on board for the cricket match. The statement assumes significance as Himachal Pradesh Chief Minister Virbhadra Singh had opposed the match and even told a visiting Pakistani team a day ago that the State government would not provide any security to the cricket team. Mr. Singh had said he was opposed to the match as a mark of respect for the two martyrs from the State killed in an operation at the Pathankot airbase in January.\n\n“The match is on. The State and Central governments are on board and all security arrangements have been made,” Mr. Sridhar said after a meeting with M.K Singla, Special Secretary (Internal Security) in the Home Ministry.\n\nCM changes stand\n\nGiving the go-ahead for the match, the Himachal Chief Minister on Tuesday said he was “not against the game of cricket.” Talking to media persons after presenting the State Budget, Mr. Singh, said: “We can’t ignore the sentiments of a large number of ex-servicemen and martyrs’ families who are against the India-Pakistan match after the cross-border anti-India activities conducted by the neighbouring country in which soldiers from the hill State have lost their lives.”\n\n(With additional reporting by Kanwar Yogendra in Shimla)", 
    "section": "national", 
    "title": "India-Pak. match will be held as slated: BCCI", 
    "subsection": "general", 
    "date": "2016-03-09"
}