{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "The Aurangabad Bench of the Mumbai High Court on Tuesday awarded the death sentence to the main accused in the 2009 rape-and-murder case of a 21-year-old college student.\n\nObserving that the particularly violent and cruel nature of the crime committed by Javed Habib Khan obviated pleas of mercy, a Division Bench comprising Justices A.V. Nirgude and Indira Jain enhanced the sentence to capital punishment — death by hanging — under Sections 376 and 302 of the IPC.\n\nIn 2012, Khan was sentenced to life imprisonment by the District and Sessions Court, Aurangabad. Not satisfied with the verdict, the State government turned the case over to the Bombay High Court for review.\n\nThe student was sexually assaulted and murdered in the early hours of June 12, 2009, by Khan (then aged 20), a habitual house-breaker from Jalna, and his two accomplices. The victim had been living with her brother, an engineer, in a rented apartment in Aurangabad’s Ahinsanagar area.According to the police, Khan had gained entry into the house through the balcony. He first picked up the girl’s mobile phone.\n\nThe sound of loose change spilling from the purse woke her up. He quickly smothered her and stabbed her with a pair of scissors in the neck, then tied her hands and legs with the help of a mobile handset wire. The accused then made off with the victim’s mobile phone.\n\nThe murder spurred protests by social outfits and Opposition political parties and quickly snowballed into a high-profile case.\n\nLess than a fortnight after the crime, a team of the Aurangabad police, led by then police sub-inspector (PSI) Nita Misal, tracked down the accused in the Nirala Bazaar area.\n\nKhan’s accomplices, Pradeep Chandalia and Ram Bodkhe, were also arrested for abetment, providing the accused with shelter and helping him dispose of the stolen property.\n\nAccording to the police, Khan had allegedly given the stolen mobile handset to Bodkhe.\n\nThe latter had in turn given it to his son, who apparently switched it on to check the balance four days after the crime. This provided a vital clue to the police in cracking the case.\n\nMinor killed, raped\n\nA minor girl was raped and murdered in Satara district in western Maharashtra. According to the police, the nine-year-old girl went missing from her home in Nandanvan Colony late on Monday evening. Her body was later found dumped in the water tank of a building. However, post-mortem reports suggested that she was first killed and then sexually assaulted. The police have apprehended a 15-year-old boy in connection with the incident.", 
    "section": "national", 
    "title": "Man sentenced to death for rape, murder of student", 
    "subsection": "general", 
    "date": "2016-03-09"
}