{
    "author": [], 
    "text": "An image of the planet Mercury produced by NASA'S MErcury Surface, Space ENvironment, GEochemistry, and Ranging, or MESSENGER probe.\n\nMercury appears to be dark due to the abundance of carbon that originated deep below the surface of our solar system’s innermost planet, a new study has found.\n\nThe planet reflects much less sunlight than the Moon, on which surface darkness is controlled by the abundance of iron—rich minerals that are known to be rare on Mercury’s surface, researchers said.\n\nResearchers led by Patrick Peplowski of the Johns Hopkins University in US have confirmed that a high abundance of carbon is present at Mercury’s surface.\n\nThey have also found that the carbon most likely originated deep below the surface in the form of a now-disrupted and buried ancient graphite-rich crust, some of which was later brought to the surface by impact processes after most of Mercury’s current crust had formed.\n\nThe researchers obtained data from NASA’s MESSENGER (MErcury Surface, Space ENvironment, GEochemistry, and Ranging) spacecraft, the first space mission designed to orbit Mercury.\n\n“We used MESSENGER’s Neutron Spectrometer to spatially resolve the distribution of carbon and found that it is correlated with the darkest material on Mercury, and this material most likely originated deep in the crust,” said Larry Nittler, from Carnegie Institution of Washington.\n\n“We used both neutrons and X-rays to confirm that the dark material is not enriched in iron, in contrast to the Moon where iron-rich minerals darken the surface,” said Nittler, who is also Deputy Principal Investigator of the MESSENGER mission.\n\nMESSENGER obtained its data via many orbits on which the spacecraft passed lower than 100 km above the surface of the planet during its last year of operation.\n\nNeutron Spectrometer measurements showed higher amounts of low-energy neutrons, a signature consistent with the presence of elevated carbon, coming from the surface when the spacecraft passed over concentrations of the darkest material.\n\nCombining the neutron measurements with other MESSENGER datasets, including X-ray measurements and reflectance spectra, Scientists found that Mercury’s surface rocks are made up of as much as a few weight per cent graphitic carbon, much higher than on other planets.\n\nGraphite has the best fit to the reflectance spectra, at visible wavelengths, and the likely conditions that produced the material, researchers said. When Mercury was very young, much of the planet was likely so hot that there was a global “ocean” of molten magma.\n\nScientists have suggested that as this magma ocean cooled, most minerals that solidified sank, except graphite, which would have been buoyant and floated to form the original crust of Mercury.\n\nThe study was published in the journal Nature Geoscience . — PTI", 
    "section": "national", 
    "title": "Mystery behind Mercury’s darkness solved", 
    "subsection": "general", 
    "date": "2016-03-09"
}