{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "Rights body seeks reports in 4 weeks; complaint mentions 16 people including 13 policemen\n\nThe National Human Rights Commission (NHRC) has issued a notice to the Mumbai Police in connection with a complaint filed by a Canadian national, who has alleged that he was harassed by a group of policemen from Mumbai at the behest of his former business partner. Jaimini Kumar Srivastava, deputy director (media and communication), NHRC, confirmed that the commission had issued a notice to the Mumbai Police.\n\nAccording to official sources, the complainant, Alnoor Jamal, had approached the NHRC in February with a complaint against 16 people, 13 of whom are policemen of various ranks in the Mumbai Police. Mr Jamal, in his complaint, alleged that on August 29, 2013, he and his wife were sleeping in their hotel room in Marine Plaza hotel in south Mumbai when the 16 people barged into his room, threatened him, and tried to get him to settle a dispute that he was having with his business partner. Of the 16 people, 13 were policemen while three were civilians. Two of the three civilians identified themselves to be lawyers.\n\n“They threatened my wife (62) and me, and coaxed us to settle our disputes with Shobhit Rajan on his terms or face immediate arrest,” Mr Jamal said.\n\nHe subsequently approached the Mumbai Police top brass and an inquiry was initiated into the matter under Additional Commissioner of Police Chhering Dorje, who was Deputy Commissioner of Police (zone IX) at the time.\n\n“The depravity of these policemen was brought out in the report of October 18, 2013, prepared by Mr Dorje. In spite of this report, the local Indian authorities refused to take any action against any one of them,” Mr Jamal had said in his complaint to the NHRC, adding, “The audacity of the police and especially lawyers forcefully entering the privacy of a hotel room in the dead of the night where my wife and I were resting is unheard of even in remote Africa. I’m surprised such lawyers are given licence by the bar council of India. They have acted like criminals.”\n\nMr Jamal’s complaint went on to mention that his uncle, Nasir Mussa, a UK-based businessman, was also booked in a criminal case by the Mumbai Police the same year. Mr Mussa later moved the Bombay High Court. The High Court quashed the matter and the Supreme Court, too, upheld the decision.\n\nAfter examining Mr Jamal’s complaint, the NHRC issued a notice to the Mumbai Police earlier this month. The notice has directed the Commissioner of Police, Mumbai, to look into the matter, and called for reports of any action taken in the matter till date. The Mumbai Police are to submit these reports in four weeks, said officials. When contacted, Mumbai Police Commissioner D D Padsalgikar said, “We will examine the notice and take appropriate action.”\n\n“Audacity of police and lawyers forcefully entering a hotel room is unheard of even in remote Africa”", 
    "section": "national", 
    "title": "NHRC issues notice to Mumbai Police over ‘harassment’ of Canadian national", 
    "subsection": "general", 
    "date": "2016-03-09"
}