{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The National Investigation Agency (NIA) has reportedly informed the government that it will have no objection if a Special Investigation Team (SIT) from Pakistan wants to visit the Pathankot air base, a high security defence installation. The Pakistan SIT is due to visit India in connection with an ongoing probe.\n\nLast week, the Air Force chief, Air Chief Marshal Arup Raha, had said that the force would have no objection if the Pakistan SIT wanted to visit the air base.\n\nA senior government official said that the final decision would be taken by the Prime Minister’s Office (PMO) and the National Security Advisor (NSA) would also have a say in it.\n\nA few days ago, the NIA was asked for its opinion on the Pakistan SIT’s visit to the air base. “The area of operation, where the four terrorists were gunned down and the Airmen’s Billet, which was blown up, are located at the periphery of the air base. The defence installations are much inside and it is highly unlikely that the security of the airbase would be compromised”, said the official.\n\nThe NIA’s decision assumes significance as India and Pakistan have renewed attempts to share real time information on terrorist groups. Last week, Pakistan NSA Naseer Khan Janjua informed his Indian counterpart that 10 Pakistan-based terrorists could have sneaked into India through the Gujarat coast. Following this information, a country-wide alert was issued and security agencies were pressed into action to further tackle the situation.\n\nThe Pakistan SIT is expected to visit India around March 20, an official said. Based on information provided by India, a case has been registered in Pakistan regarding the Pathankot attack and three persons have been arrested.\n\n“The area of operation is still being preserved. We might need to access it again as part of the ongoing investigations. We have identified all the four terrorists who entered the airbase and have already sent their photographs to Pakistan with the letter rogatory,” said the official.\n\nSeveral people in the security establishment are apprehensive of the Pakistan team’s visit.\n\nThe attack on the air base by six terrorists from Pakistan on January 2 went on for five days and claimed the lives of seven security personnel.", 
    "section": "national", 
    "title": "NIA not against Pakistan probe team visiting Pathankot", 
    "subsection": "general", 
    "date": "2016-03-09"
}