{
    "author": [], 
    "text": "Land acquisition in the Mumbai Metropolitan Region for recent big-ticket infrastructure works such as the Navi Mumbai airport, the Mumbai Metro, and many roads and flyovers, has created pockets of instant wealth. But the newly-rich beneficiaries of high-value compensation have been, it turns out, frequently evading their tax liabilities. They owe the Income Tax Department around Rs 350 crore.\n\nA first-of-its-kind report from the I-T Department that studied 600 such ‘project-affected people’ (PAPs) says that from 2009 and 2014, they had surrendered nearly 5,00,000 square meters of land under various schemes of the government and the City and Industrial Development Corporation (CIDCO) and received compensation at prevailing market rates, but did not get themselves assessed for tax. The report, which is in the possession of The Hindu , says. “These PAPs transferred land, received consideration in cash, or constructed spaces attracting a huge capital gain liability. But none of these PAPs paid taxes on the capital gain under the false belief that being dubbed agriculturists they did not have a tax liability in the first place.” The report further said that these lands were transferred within a short period of less than six months, thereby resulting in short-term capital gains. Most of this land was acquired by the government for major infrastructure projects, or for development of Navi Mumbai, between 2009 and 2014.\n\nThe report is a conclusion of a pilot project undertaken to verify whether the capital gains on transfer of land in the MMR had been taxed, said officials of the IT department.\n\nCIDCO was, until 2014, offering high cash compensation to PAPs under various schemes. Subsequently, the state government announced additional relief by giving developed land (12.5 per cent of the area) as part of rehabilitation measures. The transfer of this land was allowed through tripartite agreements between PAPs, the project developers and CIDCO. “We have already served notices to 60 PAPs and received consideration of Rs 8.31 crore on some of these transfers. But even from these defaulters, 31 are yet to reply,” said an IT official.\n\nWhile CIDCO itself has no liability in the matter, senior officials of the company said it has made changes in its land transfer guidelines to make sure that short-term capital gains taxes are paid to the I-T department promptly. Joint MD, CIDCO, V Radha, told The Hindu , “This is purely a concern of the income tax department, but on our part we are ensuring nobody manages to avoid paying taxes.”\n\nNone of those who got compensation was assessed for tax on short-term capital gains", 
    "section": "national", 
    "title": "Project-affected people yet to pay Rs. 350 crore tax in Maharashtra", 
    "subsection": "general", 
    "date": "2016-03-09"
}