{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Norwegian peace envoy defends overtures to LTTE, praises islands democratic processes\n\nErik Solheim (left) in conversation with former Governor of West Bengal Gopalkrishna Gandhi (right) at a panel discussion at the Asian College of Journalism in Chennai on Tuesday,while author Mark Salter looks on.— Photo: K. Pichumani\n\nWith President Maithripala Sirisena at the helm in Sri Lanka, this is the best opportunity to bring about a lasting solution to the country’s ethnic question, Norway’s former special peace envoy Erik Solheim said on Tuesday.\n\n“The strength of Sri Lankan democracy is such that it has removed Mahinda Rajapaksa from the President’s chair. While he assured an inclusive approach post-war to settle the ethnic question, he never acted on the promise of reaching out to Tamils,” the former diplomat said.\n\nParticipating in a panel discussion on the newly-launched book To End a Civil War: Norway’s Peace Engagement in Sri Lanka , Mr. Solheim, who played a key role in the peace treaty signed between the Sri Lankan government and the LTTE in 2002, said there were two main obstacles to reconciliation in the island nation.\n\n“The two main Sinhala parties — United National Party and Sri Lanka Freedom Party — were never able to work together. When one thought about making a move forward, there was always the apprehension of the other using it as a political tool to gain ground,” he said.\n\nThe second was the reliance of V. Prabhakaran, the LTTE chief, on violence. “He genuinely believed that there were military solutions to the political problems. This was political stupidity,” Mr Solheim said and added that the Norwegian peace delegation made it clear time and again to Prabhakaran that killings should stop if he had any hope of proscriptions in different countries being lifted.\n\nNorway’s initiative\n\nOn the accusation that by treating LTTE on a par with the Sri Lankan government, Norway ended up giving legitimacy to the ‘terrorist organisation’ and refurbished its image, Mr. Solheim said whatever was achieved would not have been possible without reaching out to the other side. He added that the greatest achievement of the peace process that Norway initiated was the ceasefire, which saved thousands of lives.\n\nN. Ram, Chairman of Kasturi and Sons Ltd, said the Indian policy on Sri Lanka was contradictory in the earlier stages. Under Indira Gandhi, the country provided sanctuary and training to the various militant groups. It ended up paying a heavy price by losing former Prime Minister Rajiv Gandhi, who was assassinated by the LTTE.\n\nHowever, the positive side of the experience was that since 1991, India has deployed a “hands-off” approach and refused to fall into the trap of the LTTE again. “This was despite pressure from fringe groups in Tamil Nadu and the Tamil diaspora,” he observed.\n\nSquarely blaming the LTTE for derailing the Norway-faciliated peace process, Mr. Ram said while Prabhakaran was a military genius and had committed cadre, at the core, the LTTE was a ‘Pol Potist’ organisation. “Norway and others clearly failed to recognise this. After the death of Rajiv Gandhi, this should have been utterly clear. Norway should not have equated the Sri Lankan state with the LTTE,” he opined.\n\nMark Salter, the book’s author, said ‘Indian culpability’ in the whole affair also needed some reflection. He said the willingness of the parties involved was a crucial factor for the success of the process. “In the Sri Lankan context, when this willingness decreased, it showed on the results.”\n\nFormer West Bengal Governor and former Indian high commissioner in Sri Lanka, Gopalkrishna Gandhi, moderated the discussion.\n\nDefends overtures to LTTE, praises island nation’s democratic processes", 
    "section": "national", 
    "title": "Sri Lanka ready for peace, says Erik Solheim", 
    "subsection": "general", 
    "date": "2016-03-09"
}