{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "They have started selling their wares in local market comprising Gond population\n\nThe tiny community of Ojha artisans in the Adilabad district of Telangana no longer has a reason to complain, as it has made a surprising turnaround in its fortune, It also rediscovered its bonding with the Gond tribe. The comeback has been made possible as the artisan families reverted to their centuries-old traditional local market comprising mainly of the Gond population.\n\nThe Ojhas, also known as Wojaris, experienced a rather longish tryst with misfortune, astonishingly, in the wake of governmental intervention in the mid-1980s. Seeking greener pastures at the national level, the brass metal casters had shunned their traditional market, which had the Gonds ignoring them and even opposing their recognition as a Scheduled Tribe in turn.\n\nThe 80 families-strong artisan community, now based by and large at Jamgaon and Ushegaon in Jainoor and Keslaguda in Kerameri mandal, makes brass objects exclusively for the Gond tribe to be used in agriculture and religious events. Until the crucial time when the Ojhas got alienated from the Gonds, every Adivasi village in the district had boasted at least one artisan family catering to its need all through the year.\n\n“We travelled to different places participating in craft melas and exhibitions in the last 30 years, but our fortunes kept plummeting. All of us found it difficult to make both ends meet,” recalled the winner of the prestigious National Shilp Guru Award-2014, Kova Naneshwar from Keslaguda in Kerameri .\n\n“For two years, we are visiting Gond villages with our ware and have found the Gonds quite receptive,” stated Madavi Bhujang. “The local market has ensured food security and the outside markets are fetching good income,” he added as he differentiated between the period which accounted for losses and the current phase.\n\n“Local market is very important for artisans as it ensures food security because the patrons mostly pay in kind and not in cash,” opined Kala Ratna award-winner and founder of Kala Ashram in Adilabad, Guruji Ravinder Sharma, who had initially trained the artisans in design development. “Once you have food security, you have enough freedom of time and money to make products for outside markets,” he added.\n\nIn addition to the traditional seed sowers, lamps, bells of different sizes, ornamental daggers, etc., used by Gonds, the Ojhas make masks and statuettes.", 
    "section": "national", 
    "title": "Telangana’s Ojha artisans return to their roots", 
    "subsection": "general", 
    "date": "2016-03-09"
}