{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "Sixth spacecraft set for launch tomorrow from Sriharikota\n\nAs national space agency ISRO gets closer to completing the seven-spacecraft regional navigation system in space by April as planned, it also is quickly putting across cities the last pieces of ground-based support infrastructure of the system.\n\nEven as the sixth spacecraft, IRNSS-1F, is slated to be launched on Thursday from Sriharikota, IRNSS-1G, the seventh and last scheduled one apart from a few spares, is slated for March 31 or later in April.\n\nThe IRNSS (Indian Regional Navigation Satellite System) has come to be known as the country’s own ‘GPS’. Its nerve centre, the ISRO Navigation Centre, is at Byalalu on the outskirts of Bengaluru and is part of the 21 ground locations.\n\nISRO is learnt to be adding a back-up for it at Lucknow. Four more centres providing different vital services are also coming up.\n\nAmong them are data receiving and processing centres; units that have instruments such as atomic clocks for keeping accurate time, which is essential in navigation; and those that generate and transmit navigation parameters and maintain the spacecraft in position all the time.\n\nNavigation satellites provide three main data, namely PNT: information on position, navigation and time. The data is important for a host of users, from the military to managers of air land and sea transport up to the man on the street looking to reach somewhere.\n\nThe ground segment, estimated to cost Rs. 300 crore, is part of the Rs. 1,420-crore IRNSS scheme, which was approved in May 2006. “Currently, the IRNSS ground segment is operational on a 24/7 basis [through] 13 IRIMS (Indian Range and Integrity Monitoring Stations; 1 IRNSS Network Timing Centre; one ISRO Navigation Centre and one Spacecraft Control Facility with its data communication network. Along with the deployment of the constellation, the entire ground segment with two more IRIMS and one each of [Network timing Centre,] INC and SCF is planned to be established,” ISRO said.\n\nThe range monitoring IRIMS, which could eventually total 15 to 17, will be spread across Gaggal, Dehradun, Lucknow, Jodhpur, Udaipur, Bhopal, Shillong, Kolkata, Goa, Pune, Kavaratti, Mahendragiri and Port Blair, besides Bengaluru and Hassan.\n\nA Space Control Facility each will be in Hassan — where the Master Control Facility for communication satellites functions since many decades — and its alternative centre in Bhopal.", 
    "section": "national", 
    "title": "With IRNSS almost up in orbit, ground centres get into place", 
    "subsection": "general", 
    "date": "2016-03-09"
}