{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They question notions of ‘purity, hygiene, segregation’ and role of clerics\n\nWomen from different religions protest at Azad Maidan in Mumbai for their right to enter all places of worship, without discrimination .— Photo: Vijay Bate\n\nMale religious heads have for long used religion as a tool to subjugate women. Women’s groups on Tuesday questioned the notions of “purity, hygiene and segregation” in accessing places of religious worship.\n\nWomen and men from the Bharatiya Muslim Mahila Andolan (BMMA), Bhumata Brigade, Sahiyo, Vaghini Mahila Sanghatana (VMS), Muslims for Secular Democracy, and Bharat Bachao Andolan staged a protest march at the Azad Maidan here demanding religious freedom and equal access to places of worship. Former BJP member Sudheendra Kulkarni also attended the protest.\n\nHe said inequality was not in tune with true religious spirit.\n\nChallenging the supremacy of male clerics, Noorjehan Safia Niaz of BMMA, who had filed a PIL petition in the Bombay High Court demanding entry in the sanctum sanctorum of Haji Ali dargah, asked: “Why should I believe their Islam? Can’t I read the Koran myself? We will read the book ourselves and derive our own meaning. What are the governments and judges afraid of? Are they afraid of the ‘maulavis’ and ‘mullahs’?.”\n\nShe said the clergy branded women as ‘dirty’ and ‘impure’ and imposed restrictions on going out of the house. “They use religion to suppress us. Women are to be blamed too for blindly following them,” Ms Niaz said.\n\nSome Bohra women questioned the practice of female circumcision in the community. Ms Insia Dariwala, from Sahiyo, said: “We do not want ‘khatna’ (circumcision in which a girl’s clitoral hood is cut). We don’t know why it is cut. We are in the 21st century, and there is enough soap and water. We can teach hygiene to our children. The scars from this practice are not just physical, but also mental. We are against such ancient practices that crush a woman before she grows up. We are women who have no right to their body.”\n\nWith a section of Bohra women raising the issue, the community has begun discussing the practice.\n\nThe female genital mutilation case in a Dawoodi Bohra community in Australia last year gave an impetus to the campaign back home. “Many were not speaking out of fear,” said Arefa Johari, also associated with Sahiyo.\n\n“The clergy do not give any official reason for carrying out the practice. Everything is kept private. But as some people spoke out, many more are coming forward.”\n\nMeanwhile, Hindu women’s struggle to enter the sanctum of Shani Shingnapur temple also found an echo at the protest. Jyoti Badekar of VMS called for a critical look at religions if they denied women equal rights.\n\nAnother protestor Michelle Vas said while women were allowed in churches, they were not part of decision-making.", 
    "section": "national", 
    "title": "Women across faiths come together", 
    "subsection": "general", 
    "date": "2016-03-09"
}