{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A doctor heading forensic sciences department of a government medical college cannot challenge his transfer order on the ground that he had to spend most of his time in the district from which he was transferred due to the need to attend court proceedings in connection with post mortems conducted by him in many criminal cases, the Madras High Court Bench here has said.\n\n“Such a contention cannot be a ground to set aside the order of transfer for the reason that as a doctor who had conducted post mortem, he has to adduce evidence wherever he is summoned,” a Division Bench of Justices S. Manikumar and C.T. Selvam said while dismissing a writ appeal preferred by G. Natarajan challenging his transfer from the government medical college here to Vellore.\n\nThe Bench also rejected the other ground raised by the appellant, who had spent over nine years in Madurai Medical College that the authorities ought not to have transferred him alone when other doctors working in the college for long had not been disturbed.\n\n“Merely because others are working in the same station for a longer period, that would not become a ground to challenge the transfer,” it said.\n\nThe judges agreed with Additional Advocate General K. Chellapandian that transfer was an incidence of service for government servants holding a transferable post and hence, the appellant would have no option but to accept the transfer, effected on administrative grounds, especially when he had not challenged the transfer order either on the ground of mala fide or procedural lapses, if any.\n\nCiting a series of Supreme Court as well as High Court judgements to substantiate their decision, the judges pointed out that in one of the rulings, another Division Bench of the High Court had held that even reasons need not be mentioned in transfer orders since they were purely administrative in nature.", 
    "section": "national", 
    "title": "A government doctor cannot challenge his transfer: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}