{
    "author": [
        "Vishal Menon"
    ], 
    "text": "What is the local tea shop but a synonym for communion? It’s a place where little disputes are resolved, where India beats Pakistan in cricket, and where personal worries get shared — all over a cup of tea.\n\nThis cup, when made to one’s liking, with good conversation, makes life that much sweeter. Sometimes, lessons are learned here too, and that’s perhaps why we call the guy who makes our tea, a master.\n\nAnjala is about one such tea kadai and one such master. For everyone in the village, he’s Owner (Pasupathy), and not just because he owns the tea shop. The village itself was built around this tea shop after Owner’s grandfather started it as a place to feed thirsty travellers in 1913. Its walls have stood witness to India’s independence movement, the arrival of the first radio, and subsequently, the release of several MGR films. Owner speaks to these walls as though he were to his grandfather. It’s the kind of shop that doesn’t need a lock. The money is ours, so why worry about theft, seems to be the villagers’ perception.\n\nSo, when the government announces a National Highway, cutting across this tea shop, tears are shed, and swords drawn. It’s a question the film begs to ask of us — does progress need to trample over the past? Must we forget tradition in order to move forward? The foundation on which Anjala is built is wonderful. But alas. If only the ambition of the makers was to create something more substantial.\n\nGavas (Vemal), whose life revolves around the tea shop, has plans to start a two-wheeler service centre. He is in love with Uthara (Nandita), who he intends to marry after fulfilling his plans. But the problem is, why suddenly shift the focus away from the tea shop? Shouldn’t the tea shop itself become a character of sorts?\n\nThere are two other sub-plots, apart from the impending highway, aimed at the closure of this tea shop. There’s even a poorly written, one-dimensional villain in Subbu Panchu, whose every effort is to shut down the tea shop, only because a group of people gathered around it to stop his truck of illicit liquor. There’s even another sub-plot involving a bag of counterfeit currency being hoarded in the shop, which leads to its temporary closure. It’s like every force on the planet is working against the tea shop, except for the film’s protagonist (Gavas), whose efforts, weirdly enough, seem to be targeted at something else.\n\nIt’s a case of a great idea getting ruined by the director trying to do too much with it. How about focussing a bit more on the three generations of friendships that were forged around the tea shop? Perhaps, a few minutes explaining why Owner never got married, and how he came to adopt a boy who works there? Why waste so much time narrating yet another village love story and the same-old gags involving fat men? In its present state, Anjala is not my cup of tea.\n\nvishal menon\n\nAnjala\n\nGenre: Drama\n\nDirector: Thangam Saravanan\n\nCast: Vemal, Pasupathy, Nandita, Subbu Panchu\n\nStoryline: A tea shop must make way for a highway, progress", 
    "section": "national", 
    "title": "A lukewarm tribute to the neighbourhood tea kadai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}