{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "When Adarsh Premsan was only eleven, he stood six-foot tall and was ideally suited for basketball. But the youngster was more engaged in athletics. He did not do anything big out there. He realised that pretty soon and quickly switched over. And, it paid rich dividends. Adarsh, now 16, has already represented the country in the FIBA Asia under-16 basketball championship at Jakarta, Indonesia, last year.\n\n“It was an awesome experience and a great path to advance to the next level,” said the class eleven student of Vidhya Niketan MHSS.\n\nFor the ambitious young star, coached by Mr. Murugeshan of Rajalakshmi Sports Club, it was his first maiden international outing. He played the centre position out there and caught the attention of the game’s lovers. He was also rated among the top ten in Asia and the top five in India.\n\n“It was my dream playing for India and it was a different ball game altogether. We played the first game against China and lost, but the lessons learnt were many,” said Adarsh, who enjoys a good reach at the ring.\n\nHe did have butterflies in his stomach playing his debut game. “There were seven footers and I was worried how to cover them. It did affect my game and I was quickly replaced only to get back on court in the second quarter. But after that I was able to handle the situation much better,” he said.\n\n“It was a totally new experience for me. Everything was new – the crowd, the court and the atmosphere. It was electric,” he added.\n\nAgainst Hong Kong, Adarsh was at his best. He was shooting from mid range and also earned foul baskets and converted them with ease. “I scored 26 points, my best in an international game,” he said.\n\nHaving tasted success in his first international outing, Adarsh now wants to play more of them. His ultimate dream is to play for the senior India team. “Five years from now, I hope to realise it. I may grow a few inches more and with some extra brushing of skills I am confident of making an impact,” added Adarsh, who is supported by his family members and more specially his mother Raja Rajeswari.\n\nHe thanked the district association, his coach and the school management for the big support over the years.", 
    "section": "national", 
    "title": "Adarsh ready to play the big league", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}