{
    "author": [
        "Staff Reporter"
    ], 
    "text": "There are agencies such as the Central Vigilance Commission, Central Bureau of Investigation, Lokpal and Lokayuktas and many state-level anti-corruption agencies. More such agencies would come up but they would hardly have an impact in bringing down corruption till people decide not to be corrupt.\n\nChief Vigilance Commissioner, Government of India, K.V. Chowdary said this at ‘Santhosham 2016’ the Rotary District Conference RI Dist 3201 in Coimbatore on Saturday. He stressed the need for Swachh Bharat like drive to remove corrupt practices from the society. “It is sad that people don’t like to talk about corruption,” he said.\n\nReferring to a recent study released by Berlin-based Transparency International, he said that India has been ranked at the 76{+t}{+h}place among 168 in its Corruption Perception Index – for the year 2015. “This is not a desirable position and we cannot afford to be corrupt. We have to start rooting out corruption starting from our home and office,” he said.\n\n“Corruption at the policy level is big but its impact reaches the common man later than street side corruptions that go unnoticed, but immediately affect them.” He strongly felt that punishing the corrupt alone will not put an end to corruption.\n\nExpressing the need for awareness on corruption among all stakeholders, he said organisations like Rotary should organise anti-corruption campaigns. The drive should begin with throwing light on what is corruption. While accepting money or other monetary benefits are predominantly cited as corrupt practices, the CVC said that nepotism, fudging, helping someone based on caste and other grounds by affecting someone who deserved it more are among various forms of corruption.", 
    "section": "national", 
    "title": "‘Agencies alone cannot put an end to corruption’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}