{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Woman who stole the child brings it to the samehospital for vaccination\n\nIn a sudden twist to the missing baby case reported in the Government Hospital here, the police heaved a sigh of relief after it was traced in the same hospital on Saturday.\n\nMariammal (20), wife of Chandrasekar, a lorry driver of Vazhaikapatti near here, had delivered a baby girl on February 4. After about two days, when she had planned to undergo a surgery, she had left her newborn with her mother Chandra. When Chandra went to sign a register, she handed over the child to an unknown woman sitting by her side. After about a few minutes, she found out that the woman had vanished with the child. This resulted in tension at the hospital.\n\nThe Dindigul (Town) North police had registered a case and were on the lookout for the baby.\n\nComes to hospital\n\nMeanwhile, a 55-year-old woman, identified as Diraviam of Anjukuzhipatti near here, turned up at the hospital with a child. Initially, when the paramedical team on duty enquired her, the woman said that she wanted to administer vaccine to the baby that was delivered at their house. As the woman was giving contradictory statements, the nurses sounded an alert to the Hospital Superintendent.\n\nWhen officials made enquiries with Diraviam, she said that her daughter-in-law, Kala (30), who had delivered the child at her mother’s place here was unwell and hence she had brought the baby for vaccination.\n\nAt this stage, the Inspector of Police was alerted, who held investigations with the suspect. When they brought Kala to the hospital, she confessed to having stolen the baby.\n\nDiscreet probe revealed that Kala, who had two sons, was a divorcee. She had recently married one Selvaraj of Tirupur. Since she did not reveal the fact that she could not conceive, her husband and mother-in-law insisted on her having a baby. In a bid to deceive them, she stayed in her mother’s house in Dindigul saying that she was pregnant. As she could not have a child, she was compelled to lift the baby.\n\nAccording to a senior police officer, she had visited the hospital a number of times but failed in the past. “Last Saturday, she succeeded and escaped with the baby, but got caught in the same hospital,” a relieved officer said.\n\nAfter a newborn went missing in Government Rajaji Hospital, Madurai, a few years ago, the government had insisted on recording identity marks.\n\nThe doctors introduced colour tags with names for new borns. In this case, the identity marks matched perfectly with the records, a doctor said.", 
    "section": "national", 
    "title": "Baby missing from GH back with its parents", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}