{
    "author": [
        "R Sujatha"
    ], 
    "text": "Registrar’s circular irks a section of faculty members\n\nA section of the faculty members of the Bharathidasan University is upset over the imposition of what it has dubbed as “seminar tax” by the State institution.\n\nThe university Registrar C. Thiruchelvan on February 8 issued a circular directing the professors to deposit a fixed sum with the university for conducting seminars and workshops both on the campus and outside.\n\nThe academic departments usually get financial grants from the University Grants Commission (UGC) to organise State, national or international-level seminars and workshops. They raise money through sponsorships. The university now wants a cut in these funds – ostensibly to raise revenue – depending upon the number of days an event is conducted.\n\nAccording to the circular, for organising a one-day event on the university’s Suriyur and Khajamalai campuses, the host department would have to pay 15 per cent of the amount to be spent on the seminar or workshop. For events lasting up to three days, a flat 20 per cent of the cost would be charged and if the event goes beyond three days, then the hosts have to pay 25 per cent.\n\nIf the events are held outside the campuses then for one-day events the organisers will have to pay five per cent and 10 per cent for events of longer duration. Normally, the organising department seeks funds from the university as seed money and generates revenue through sponsorship and registration or sends a proposal to the University Grants Commission.\n\n“Usually a proposal is developed and sent to the UGC. The budget includes details such as the kind of auditoria, rent and generator used in case of power failure. The proposal is approved when the UGC committee meets and the amount is forwarded,” said K. Pandiyan, a former office-bearer of the Association of University Teachers.\n\nFor science subjects, the UGC grants up to Rs. 3 lakh and for arts subjects it is Rs.1.5 lakh to Rs 2 lakh.\n\nNew fees\n\nOrganiser should pay 15 p.c. of the expenditure on the event for one day\n\nIt is 20 per cent for events that last up to three days", 
    "section": "national", 
    "title": "Bharathidasan University imposes ‘seminar tax’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}