{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The need to redefine the current education system so as to pursue frontier areas of technology such as nano-technology, bio-technology and bio-engineering aggressively in colleges and universities was highlighted by H. Devaraj, Vice-Chairman, University Grants Commission, here on Saturday.\n\nAddressing the 24{+t}{+h}convocation of Mother Teresa Women’s University, Kodaikanal, held at Madurai Kamaraj University, Prof. Devaraj felt that higher education in the country was at crossroads and needed radical changes so as to catch up with the highest international standards through excellence and accountability. Prof. Devaraj said that education was one of the most important means of empowering women and exhorted the graduates to acquire cutting edge knowledge in a particular field in this era of intense global competition. Rapid development of higher education was one of the remarkable changes to have taken place for the current generation. Though “women represent more than 40 per cent of the global labour force, 43 per cent of the agricultural workforce and more than half the world’s university students, yet we find fewer women at higher levels,” he said. Sharp gender inequalities and discrimination in the labour market were grim realities.\n\nHe insisted that a woman should be allowed the full expression of her potential and had to be empowered to become a dynamic partner in the building of a new India. “Several actions need to be taken, if this has to happen.” The UGC, which recognised women’s education as a force for social and economic development, had initiated unique programmes exclusively for women. He wanted the graduates to wipe out from their minds the attitude of study-for-money’s sake as women’s education could positively influence nearly all aspects of life.\n\nThe Governor, K. Rosaiah, presented degrees to 329 candidates, including 102 Ph. D. scholars, at the convocation. Apoorva, Higher Education Secretary, in her address, said that the Mother Teresa Women’s University, one of the three universities in the country exclusively for women, had won great laurels in a short period of 24 years.", 
    "section": "national", 
    "title": "Call to redefine education system", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}