{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A large proportion of childhood cancers are curable, but they need to be detected quickly and treated properly under standard protocols — this was the message of a campaign to raise awareness of childhood cancer that was launched on Saturday, ahead of International Childhood Cancer Day on Monday.\n\nThe campaign was organised by Freedom from Cancer and Relief Research Foundation. “Childhood cancers are relatively infrequent but because the classic signs and symptoms are rarely encountered, it becomes very important to diagnose them quickly. In India, 40,000 new cancers are diagnosed in children annually,” said Anita Ramesh, medical oncologist and founder of the foundation.\n\nDr. Ramesh said that while a majority of those who got treated were cured, only about three in every 10 children with cancer got complete therapy as many of them did not have access to healthcare services.\n\n“Also, once the child has been treated completely, there need to be regular follow-ups for several years. A paediatrician is crucial to the process as there are risks of health problems either due to the disease or due to cancer therapy itself,” she said.\n\nSpeaking about retinoblastoma, which he said was a common paediatric ocular cancer in India, Vikas Khetan, senior consultant, department of vitreoretina and ocular oncology, Sankara Nethralaya, said there had been a paradigm shift in the treatment approach to this disease.\n\n“There is a genetic basis for it, but that does not mean it runs in the family. If we know that a parent has had retinoblastoma as a child, we can test their baby as soon it is born, check for the gene mutation, and if it is present, start treatment right away,” he said. Dr. Khetan also explained that with advances in treatment, it was now possible for someone who had had retinoblastoma to consider IVF, as this would allow doctors to choose a zygote that did not have the mutation and implant it, thereby preventing the baby from having the disease. Parents of children who had had cancer also participated in the programme and asked questions. The children were given painting materials.", 
    "section": "national", 
    "title": "Campaign on childhood cancer launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}