{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise): Tourism Minister P. Rajavelu inaugurates the 3rd Auroville and Puducherry Village Heritage Festival at Mohanam Cultural and Heritage Centre at Alankupam in Auroville on Saturday; visitors take a look at the craft items displayed at a stall; some of the artefacts on display at the festival; a child tastes ‘vada’ under the watchful eye of her mother. — Photos: S.S. Kumar\n\nTwo-day Auroville and Puducherry Village Heritage Festival begins with fervour\n\n: The two-day Auroville and Puducherry Village Heritage Festival to celebrate the culture and folk history of Tamil Nadu kicked off with fervour on Saturday.\n\nBullock cart ride\n\nChildren from villages surrounding Auroville danced and played showcasing the traditional sports and art forms of their villages. From bullock cart ride to kho-kho, Sillampattam, Kotipul, Thayam and many games were played at the festival venue.\n\nMohanam Center for Culture and Heritage, under the Auroville Village Action Trust, with support from the Department of Tourism organised the festival to promote the rich cultural heritage and folk history of Tamil Nadu.\n\nTraditional millets including foxtail, pearl, barnyard and little millets were displayed at the stalls.\n\nThe herbal plants grown around Auroville region was also on display. Women from the Sanjeevi Nagar, Annai Nagar and Alankuppam showcased the crafts made of recycled paper, ceramic, terracotta, bamboo and crochets. They treated the visitors with hot traditional food like bondas, kelvaragu adai .\n\nThese are many art and craft units in the neighbouring villages. The villagers had the opportunity to exhibit their works and sell them to the visitors.\n\n“Being part of Mohanam Centre, we are putting up stalls for the second time here. This provides us the exposure to meet new people from different parts of the world who would be interested in our works,” says Anjali, who has put up a stall at the festival.\n\nEnjoying the hot traditional food from the stalls, Max Miller, a visitor from England, with his child, said: “I enjoy the traditional food here. People are very friendly and it is a delight to come back to Auroville after 10 years.” He was on a two-month vacation to Puducherry with his wife and child.\n\nTo quench the thirst, juice made of small oranges from the farms in neighbouring villages was ready to be served to the visitors.\n\nTourism Minister P.Rajavelu who inaugurated the festival said that the millets, art which we had seen 30 years back are now showcased in these stalls.\n\n42 stalls\n\n“This festival has recreated the village life and festivities,” he said.\n\nThere were nearly 42 stalls this year and more than 2,500 people visited.\n\n“The plans to continue this yearly event would be discussed on Sunday,” said A.Murugan, programme manager at Mohanam Centre for Culture and Heritage.\n\nThe festival was held between 10 a.m. to 5 p.m. at the Bamboo Land or Mohanam Cultural Heritage Center (near Isai Ambalam, opposite Imagination), Alankuppam, Auroville, Puducherry.\n\nOn Sunday, the ninth year of the Auroville Marathon will be held.\n\nMax Miller who has come from England with his child said: “I enjoy traditional food here.”", 
    "section": "national", 
    "title": "Celebrating TN’s culture and folk history", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}