{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Kidaamby Narayanan, Gangai kondan mandapam, Triplicane, 7 p.m.\n\nBhagavatham: Jaya Srinivasan, Sri Rathnagiriswarar Temple, Besant Nagar, 6.45 p.m.; Sundara Kumar, Harihara Dhyana Nilayam, Chinmaya Mission Yoga Center II, Chinmaya Nagar, 6.45 p.m.\n\nGita: R. Aravindan, Andhra Mahila Sabha, Luz, Mylapore, 7.30 a.m.; Satyaprabhananda, Ramakrishna Mission Ashrama, T Nagar, 5.30 p.m.\n\nVishnu Sahasranamam: Sudha Seshayyan, Krishna Gana Sabha, T Nagar, 6.30 p.m.\n\nPeriyapuranam: Mukilai Rajapandian, Thalainagara Tamil Sangam, Mahalakshmi Street, Otteri, Vandalur, 5 p.m.\n\nThyagarajar and Bhakthi: Radha Baskar, Sitadevi Garodia Hindu Vidyalaya, Tambaram, 6.45 p.m.\n\nRig vedam: Rajagopalan, Asthika Samajam, Venus colony first street, 6.30 p.m.\n\nCULTURE\n\nTamil Nadu Eyal Isai Nataka Manram: Bharat Ratna Dr. M.S. Subbulakshmi centenary celebrations, Youth Hostel, Indra Nagar, 6.30 p.m.\n\nGENERAL\n\nAnglo Indian Suburban Front: Annual Get-together, Minister Abdul Rahim participates, St. Anthony’s Shrine Hall, CTH Road, Avadi, 6 p.m.\n\nSri Pathanjali Maharishi Yogalayam Trust: Yoga camp, 37 Kamakshi Amman Naga Extension, Maangadu, 7 a.m.\n\nMadras Dyslexia Association in association with Rotary Club of Madras Central: Dyslexia week celebrations, Asan Memorial School, Thousand Lights, 9.30 a.m.\n\nRamakrishna Mission Students Home: 111{+t}{+h}Home day, Old boys business meet, PS. Sivaswamy Salai, 2 p.m.\n\nHolistic Philosophy Society: Seminar on ‘Holistic philosophy’, Nehru Vidyashram, Choolaimedu, 4 p.m.\n\nInternational Medical Sciences Academy Tamil Nadu Chapter: Monthly meeting, K.J. Hospital, Poonamallee high road, 11 a.m.\n\nDr Shivaa’s Diabetes Care: Inauguration of online consulting platform, Hotel Green Park, 3 p.m.\n\nSankara Eye Hospital: Free eye cataract Screening Camp, K. Vinayakam Matric Higher Secondary School, Tiruvallur, 9 a.m.\n\nMohamed Sathak College of Arts and Science: College Alumni Association meet, Sholinganallur, 11 a.m.\n\nTamil Nadu Dr Ambedkar Law University: 7{+t}{+h}Cado fiesta 2016, Tamil Nadu Dr Ambedkar Law University premises, 4.30 p.m.\n\nT.S. Srinivasan Charitable Trust: 36{+t}{+h}T.S. Srinivasan Endowment Lecture on ‘The Forgetful Brain’, ITC Grand Chola, Guindy, 4 p.m.\n\nSri Vishnu Mohan Foundation: Lecture on Jayadeva’s Ashtapadhis, New Giri Road , T Nagar, 6 p.m.\n\nVasantha Memorial Trust: Cancer Visitors Day, Sivagami Pethachi Auditorium, MCTM School, 9 a.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}