{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Universities should strive hard to develop ‘brand equity’ like foreign universities which are famous for their courses: UGC Vice-Chairman\n\nWhile expressing immense happiness over the spectacular expansion in higher education system in recent years in the country, Vice-Chairman, University Grants Commission H. Devaraj expressed grave concern over the proliferation of substandard institutions.\n\nDelivering the 23rd convocation address at Manonmaniam Sundaranar University here on Saturday, Dr. Devaraj said the number of universities and university-level institutions had grown from 523 to 573 in the last one year and 32,964 colleges in March 2011 had increased to 35,539 in March 2013.\n\nWhile the number of students enrolled in all levels of universities and colleges stood at 1.86 crore in 2010-11, the number rose to 2.03 crore in the next academic year, an increase of 8.87 per cent.\n\n“At the same time, the expansion in higher education has been accompanied by several problems such as proliferation of substandard educational institutions, which cannot fill up the vacancies with qualified competent teachers and consequently suffer from outdated curricula, lack of motivation and accountability, poor management, failure in maintaining academic calendar etc. It all collectively leads to dilution of quality standards,” Dr. Devaraj observed.\n\nHe said every university, instead of being mere institutions producing good number of Ph. D. scholars, should strive hard to develop ‘brand equity’ like the foreign universities which were famous for the courses they offered in engineering, law, management etc. If the universities failed to stamp their quality in this regard, there was no use in producing so many Ph.D. scholars, who could only be under employed in the highly competitive job market. To make the students of present generation more employable, the UGC had introduced Bachelor of Vocation course and sanctioned 162 community courses. Moreover, 100 new KAUSHAL (Knowledge Acquisition and Upgradation of Skilled Human Abilities and Livelihood) centres were being introduced across the country.\n\nDr. Devaraj exhorted the scholars to be e-literate to extract maximum benefits of e-learning to enrich their knowledge throughout their career. “If you become a teacher, you should have thorough knowledge about your students as such a teacher alone can be a successful master. Moreover, he should be a learner throughout his life,” he said.\n\nThe UGC Vice-Chairman heaped encomiums on the State Government for having taken sustained efforts in ensuring higher Gross Enrolment Ratio in higher education.\n\nSince the MSU is ‘headless’ for the past seven months, Higher Education Secretary Apoorva explained in detail the steps taken by the university in reaching the unreached poor students of the region with its educational programmes. Collector M. Karunakaran, Registrar A. John De Britto, Controller of Examinations S. Prabhakar, Mayor E. Bhuvaneshwari participated.", 
    "section": "national", 
    "title": "Concern over proliferation of substandard institutions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}