{
    "author": [
        "M K"
    ], 
    "text": "To reduce the backlog of cases in special courts for CBI cases across the country, the Chief Vigilance Commissioner (CVC) has requested the Chief Justice of India to issue suitable directions to High Courts to fill up vacancies in special courts and create more courts if needed.\n\nSpeaking to The Hindu on the sidelines of Rotary District Conference on Saturday, Chief Vigilance Commissioner K.V. Chowdary said, “Over 3,000 cases chargesheeted by the CBI are pending before various courts for more than three years. One of the reasons for pendency is vacancy of judges in the special courts for CBI cases,” he said.\n\nMr. Chowdary said that around 75,000 complaints were received by the commission every year. After filtering down anonymous and irrelevant petitions, around 3,500 are found worthy of enquiry. Action is recommended to initiate formal proceedings for 500 to 600 cases, but by the time all formal proceedings are completed (prior to the legal proceedings in court), it takes seven to eight years.\n\n“Over the last eight months, we have been working on a war- footing to reduce these delays,” he said and was hopeful that it could be reduced to less than a year by early next year.\n\nConviction rate\n\nOn the rate of conviction, he said 50 to 60 per cent of banking-related corruption cases that are chargesheeted result in conviction. Only around 35 to 40 per cent of criminal cases chargesheeted by the CBI end up in convictions.\n\nThe CVC cited a 10 per cent increase in the number of worthy complaints due to the increasing awareness on corruption. “Complaints were more against departments that have direct interaction with the public as corruption is visible and directly affects the common man directly,” he said without naming any department.\n\nAnswering a query, he told reporters that they also receive complaints against the investigating agency and officers and such cases are given priority and taken more seriously.\n\nAs part of the commission’s Preventive Vigilance Exercise, the commission is reworking its manual that is more than 50 years old.\n\n“We have also asked public sector enterprises and government departments to rework the manuals to suit the present model, make it public and have checks and balances to reduce scope for corruption,” Mr. Chowdary said.\n\nOver 3,000 cases have been pending\n\nbefore various courts for over\n\nthree years", 
    "section": "national", 
    "title": "CVC blames vacancies in CBI courts for pendency of cases", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}