{
    "author": [
        "Rasmi Binoy"
    ], 
    "text": "On Saturday, a group of students of Kalakshetra explored a different rhythm, a diverse ensemble of mellifluous notes. As the young dancers walked the length of their green, serene campus, inhaling the crisp early morning air, a profusion of chirps and calls seemed to beckon them from the trees and the brownish marshes strewn across the campus.\n\nThe event, organised by Madras Naturalists’ Society (MNS), saw students exploring their verdant campus and getting to know their winged friends in two groups, under the guidance of ornithologists Tara Gandhi and Subramanian Sankar of the MNS, as part of Campus Bird Count 2016.\n\nThe walk started around 6.30 a.m. and recorded more than 40 species of birds in less than two hours.\n\nAs the students made their way to the interiors of Kalakshetra, past thorny bushes, quaint waterbodies and silent sandbanks, the sheer diversity of plumage became more visible. From white-breasted water hens and pond herons to Indian golden orioles and yellow-billed babblers, the campus is home to more than 59 species of birds originally.\n\nThe discrete calls of Blyth’s reed warbler proved that Kalakshetra was host to such winter-time visitors from faraway lands. The students even found a flock of pelicans flying by as they made their way back after the bird count.\n\n“Campus bird counts are becoming more significant as our cities are choking under new constructions and the greenery is shrinking fast. Large campuses and parks are like a sanctuary for birds in urban spaces,” Ms. Gandhi of the MNS told The Hindu.\n\n“I was very reluctant to get up so early in the morning since it is a second Saturday. But I simply loved the experience. I am definitely looking forward to more such initiatives,” said Vijayalakshmi, a third year diploma student in Bharatanatyam.\n\n“It was a very rewarding experience to take this bunch of enthusiastic students, most of them novices, for the bird count. They will take it forward from here every Sunday,” said Mr. Sankar of the MNS.", 
    "section": "national", 
    "title": "Dancers of Kalakshetra follow a different rhythm", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}