{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sri Sarangapani temple gopuram which has been given a facelift in Kumbakonam for the Mahamaham festival.PHOTO: G. GNANAVELMURUGAN\n\nWith the sacred flag hoisting in the Mahamaham related Shiva temple over on Saturday, similar ritual in Vishnu shrines in Kumbakonam would take place on Sunday, the Ratha Sapthami day. The Vishnu shrine deities witness Teerthavari ritual at the Chakra Padithurai on the Cauvery on the Mahamaham day of February 22.\n\nWhile the civic arrangements were good, devotees complained about the mosquito menace especially at night. Clogged drains could have possibly contributed to the inconvenience to the residents who expect the local body to react soon, before the D-day.\n\nWhile scores of temporary toilets were located in several spots around the town in view of the huge influx of pilgrims expected, the authorities could place some in the vicinity of the New Bus Stand where there was no temporary public convenience in sight. That is inconveniencing pilgrims who arrive by bus.\n\nThousands of police personnel and scores of senior officers from various districts had already arrived in the temple town and are moving into position to provide security and to guide pilgrims with regard to traffic arrangements.\n\nMany pilgrims and bus crew initially could not decipher which route to take in the absence of proper direction from the police personnel manning important junctions in the periphery. Hopefully that should be satisfied as the days progress, the devotees expect.\n\nThe State government has arranged for an exhibition to showcase its achievements on the occasion of the Mahamaham.\n\nThe exhibition was declared open on Saturday. A special postal cover was released to mark the Mahamaham 2016.\n\nKumbakonam town wore a festive look with people thronging all thoroughfares and the shops teeming with people. The temples are witnessing huge inflow of pilgrims.", 
    "section": "national", 
    "title": "Festivities in Vishnu shrines today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}