{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Dismayed over “Centre’s inaction in fishermen issue”\n\nDismayed over the Centre’s inaction in securing the release of fishermen arrested by the Sri Lankan navy, fishermen here have decided to launch an indefinite strike from February 26 and lay siege to the Sri Lankan Deputy High Commission office in Chennai on February 29.\n\nCondemning the recent arrest of 12 local fishermen by the Lankan navy on charges of poaching and confiscation of two trawlers, leaders of 11 fishermen associations met here on Saturday and decided to launch the strike after the ‘Katchatheevu festival’ scheduled for February 20 and 21 and step up the agitation by consulting fellow fishermen leaders in other coastal districts.\n\nGiving details of the resolution adopted at the meeting, P. Sesu Raja, leader of a fishermen association, said that they had decided to lay siege to the Sri Lankan Deputy High Commission office in Chennai on February 29 mainly to secure the release of 27 fishermen lodged in Lankan prisons and 71 boats, held back in the island and exposed to the vagaries of weather for several months.\n\nHe said that the leaders had decided to hold a meeting with their counterparts in Nagapattinam next Friday and seek the support of fishermen in other coastal districts when they stage the agitation in Chennai. If the protests failed to yield the desired result, they had decided to chalk out a State-wide agitation, ahead of the coming Assembly elections, he said.\n\nThe meeting, in another resolution, expressed dismay that External Affairs Minister Sushma Swaraj did not take up their plight with the Lankan government during her recent two-day visit to Colombo. The Bharatiya Janata Party (BJP), ahead of the 2014 Lok Sabha elections, promised to find a permanent solution to the problem but did not make a single initiative after coming to power, the fishermen charged.\n\nThey urged the State and Central governments to prevail upon the Lankan government and restrain its navy from preventing their traditional fishing rights in the Palk Bay and protect their livelihood.", 
    "section": "national", 
    "title": "Fishermen to launch indefinite strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}