{
    "author": [
        "S Prasad"
    ], 
    "text": "Disenchanted cadre switch camps for bigger roles: observers\n\nThe All India Anna Dravida Munnetra Kazhagam could be an important force to reckon with in the forthcoming Assembly elections with a number of political functionaries leaving their party for the AIADMK.\n\nAmong political functionaries who made a beeline for the AIADMK are former legislators M.A.S. Subramanian and K. Natarajan who were recently inducted into the AIADMK in the presence of Tamil Nadu Chief Minister Jayalalithaa in Chennai.\n\nPolitical observers feel that there could be many more instances of disenchanted functionaries switching camps as they aspire for a seat or a bigger role.\n\nMr. Subramanian started his political career with the AIADMK and was the party Legislator in 1985 after winning from Orleanpet. However, following differences of opinion with the high command he quit the AIADMK and joined the DMK.\n\nHe emerged victorious from Mudaliarpet constituency in 2001 elections and retained the seat in 2006 elections. However, he lost the 2011 elections to the AIADMK candidate A. Baskar.\n\nMr. Subramanian who was maintaining a low profile after his removal as convenor of the DMK in Puducherry joined the BJP. Subsequently, he quit the BJP and joined the AIADMK.\n\nIt is learnt that Mr. Subramanian will contest from Mudaliarpet constituency on an AIADMK ticket in the forthcoming elections.\n\nK. Natarajan, former MLA of the AIADMK, won the Oulgaret seat in the 1991 elections and retained the seat in 1996. However, he quit the AIADMK and joined the DMK and became the Chairman of Villianur Commune Panchayat in 2006.\n\nMr. Natarajan later joined the AINRC and contested the 2011 elections on an AINRC ticket but lost to A. Namassivayam of the Congress.\n\nPolitical observers point out that the current flow of political functionaries would further strengthen the AIADMK. But the recent developments are a clear message for rebels in the ruling AINRC that the doors of the party are open to them.\n\nRevolt by a section of MLAs in the AINRC camp, which has been brewing since the Rajya Sabha elections, has caused a major rift in the party ranks giving a wide opportunity to the AIADMK to make major inroads ahead of the elections.\n\nAIADMK capitalising on the rift in\n\nAINRC after the Rajya Sabha elections", 
    "section": "national", 
    "title": "Functionaries from many parties join AIADMK", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}