{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Cong may push for 40 seats, but could settle for less if DMDK joins the front\n\nThe DMK has categorically told the Congress on Saturday that any talks on seat sharing will begin only after the DMDK communicates its position on being part of the front. But the Congress is gearing up to push hard and ideally wants to contest 40 seats to improve its vote share.\n\nSaturday was a day of jubilation for the national party in Tamil Nadu, since formalising the alliance with the DMK ended its painful three-year isolation in the State. In 2013, the DMK quit the UPA and left the Congress to fend for itself in the 2014 Lok Sabha polls. The outcome of the parliamentary elections was catastrophic for both the outfits, with neither winning a single seat.\n\nThe Congress later faced a split with former Union Minister G.K. Vasan leading his faction out and reviving the Tamil Maanila Congress. But this seems to have had only a minor effect given how readily the DMK accepted the party into its fold.\n\nA senior leader, on condition of anonymity, said the Congress was not in a position to demand too much given the recent electoral history. However, the party would bargain hard to get a considerable number of seats in the alliance.\n\n“It is electoral common sense that you need more seats to improve your vote share. We want the Congress vote base to get back to 2011 levels of eight per cent. For this, we will have to contest at least 40 seats. Our bargain is likely to begin at 45 seats. But we will not be too rigid, if the DMDK chooses to join us,” said the leader.\n\nThe DMK was also aware how potent the alliance would turn out if the Congress and the DMDK are part of it. “Despite an anti-Congress wave and contesting alone, we polled five per cent votes in the Lok Sabha polls,” the leader pointed out.\n\nThe Congress contested 48 seats in 2006 and its share went up to 63 in 2011.\n\nThe firming up of the alliance with the DMK has become even sweeter given the current position of its archrival BJP, which is staring at isolation given the lack of response from its erstwhile NDA partners.\n\nOn Saturday, senior leader Ghulam Nabi Azad met DMK chief M. Karunanidhi and firmed up the alliance formally. The the leaders met in March 2013 when Mr. Azad was part of three-member team that came down to Chennai to pacify the DMK on the Sri Lankan Tamils issue. A day after this meeting, the DMK quit the UPA.", 
    "section": "national", 
    "title": "Hard bargain for seats on cards", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}