{
    "author": [], 
    "text": "The Seshasayee Institute of Technology at Ariyamangalam in the city would conduct a short term jewellery appraiser training programme from February 15 to 26. Those who complete the training will be eligible to take jobs as jewellery appraisers in banks, cooperatives, and other lending institutions. They could find employment in jewellery shops as appraisers or sales personnel. They could take up self-employment by starting jewellery or pawn broker shops. The course would cover various aspects of appraising jewellery and include practical aspects. Those with a minimum educational qualification of class 8 can join. There is no age limit. The prescribed fee is Rs. 5,000, S. Sangapillai, Principal, SIT, said in a release. For details, call 9976144104.\n\nFarmers\n\nprotest\n\nMembers of the Bharathiya Kisan Sangam staged a demonstration near the Anna Statue in the city on Saturday. They were demanding payment of arrears to all cane growers by sugar mills, increasing the minimum procurement price for sugarcane at Rs. 4,000 a tonne, for paddy at Rs.2,000 a quintal and cotton at Rs.5,000 a quintal. They wanted all crops loans to be written off until remunerative prices were ensured for farm produce. K. Kadirvel, sangam’s district president, led the protest.\n\nGoats distributed\n\nAs many as 24,533 people have been given 98,212 goats worth Rs. 31.76 crore in the district during the past four-and-a-half years, according to T.P. Poonachi, Minister for Khadi and Village Industries. He was speaking at a function to mark the distribution of goats among 322 families in Tiruverumbur union on Saturday. R. Manoharan, Chief Whip, T. Rathinavel, MP, S. Valarmathi, MLA, and K. Tharpagaraj, District Revenue Officer, were present.\n\nSBI donates chairs\n\nfor spastic children\n\nThe State Bank of India, Tiruchi branch, has donated seven special chairs to the Spastics Society of Tiruchi to meet the requirements of children with cerebral palsy. The chairs donated, under corporate social responsibility initiative of SBI, would facilitate mobility and posture correction of the cerebral palsy children. The chairs were handed over to the society by P. Sivakumar, Deputy General Manager (B&O), SBI Administrative Office, Tiruchi, in the presence of P. Sundar, assistant general manager, and C.Shanthakumar, Director, Spastics Society of Tiruchi, according to a SBI press release.\n\nSports hostel\n\nadmissions\n\nThe district administration has said that the Sports Development Authority of Tamil Nadu (SDAT) had invited applications for admission to the Sports Hostel of Excellence at Chennai for 2016-2017 in the following disciplines: Boys: athletics, basketball, boxing, volleyball, taekwondo, swimming, fencing, shooting, weightlifting, judo, badminton, and table tennis. Girls: athletics,boxing, volleyball, football, taekwondo, swimming, fencing, shooting,weightlifting, judo, badminton, and table tennis. Application forms can be downloaded from www.sdat.tn.gov.in or can be had from the office of the district sports and youth welfare officer at Anna Stadium. Last date for submitting filled-in application forms at SDAT in Chennai is February 18. For details, call 0431-2420685.", 
    "section": "national", 
    "title": "Jewellery appraiser training at SIT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}