{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A view of the new bus stand at K.K. Nagar in Tiruchi which was opened on Saturday.— Photo: A. Muralitharan\n\nThe newly built bus terminus at K.K. Nagar in the city was declared open on Saturday, fulfilling a long-felt need of the local residents.\n\nAlthough it had emerged as one of the prime residential localities in Tiruchi, K.K. Nagar had long remained without a proper bus terminus. One of the earliest suburbs to emerge in Tiruchi, the still expanding locality was served by an apology of a bus terminus.\n\nSeveral residential colonies have come up in recent years beyond Rajaram Salai, once the tail-end of K.K. Nagar. Today, scores of residential colonies have spawned up to Udayanpatti and most of the residents have to depend on the terminus at K.K. Nagar as beyond this point very few buses are operated.\n\nA small piece of land at the Rajaram Salai had been serving as the terminus but hardly had any amenities. In the absence of proper shelters, commuters have to wait on the roadside, exposed to sun and rain. Being a lucrative route, a large number of buses operate from this terminus and during peak hours the traffic logjam created much hardship to motorists.\n\nThough a public utility space had been set aside for setting up a bus terminus, it had come under encroachments.\n\nThe corporation had decided to establish the bus stand in an area of about 6,150 sq. ft. of land at a cost of about Rs. 73.60 lakh, including contributions from the MLA’s Local Area Development Fund of R. Manoharan, Tiruchi East MLA and Chief Whip, and the corporation general fund.\n\nApart from bus bays, seating arrangements, LED lighting, and a public toilet had been established at the terminus. The terminus could accommodate about five buses at a time.\n\nOn Saturday, T.P. Poonachi, Minister for Khadi and Village Industries, inaugurated the terminus in the presence of Mr. Manoharan, P. Kumar, MP, A. Jaya, Mayor, M. Paranjothi, and S. Valarmathi, MLAs, and District Collector K.S. Palanisamy.", 
    "section": "national", 
    "title": "K.K. Nagar bus terminus inaugurated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}