{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The country was facing a peculiar situation where murders are committed in the name of honour.\n\nBut the nature of the crime was such that there was no law to register it, and hence a legislation should be made to stop honour killings.\n\nThis was the demand put forth by 20 organisations that met here on Saturday. Attending the meeting, Brinda Karat, Politburo member of the CPI(M) said that the governments of the day had proudly claimed both in the U.N. and in Parliament that there was not a single case of honour killing in the country. There was a law to register murder and rape, but none to account for murder in the name of honour. How can there be data, where there was no law? she asked. The struggle to bring in a legislation in respect of honour killing was not just a legal, social, and political battle, but also economic, since the poor were used as pawns in the caste politics unleashed in the name of caste purity, Ms. Karat said.\n\nReferring to Illavarasan and Divya she accused the PMK of running a campaign that cost the lives of Illavarasan, and Divya’s father. The struggle was to break this cultural concept of women as repositories of community honour. U. Vasuki, All India vice-president, AIDWA, said that there had been a systemic erosion of women’s rights with the proliferation of caste outfits. “These outfits now urge their community not to send girls for higher education, not to teach them computers, not to give them mobile phones.”\n\n“When someone is murdered, a relative of the deceased would file a complaint. But in the case of an honour killing committed by the victim’s immediate kin, who will file a complaint?” she asked, stressing the urgency for a separate law.\n\nMs. Vasuki asked parents to teach their children to make an informed choice, and raise them as equals. Delhi Babu, MLA, said the Left representatives had raised the demand for a legislation and would put pressure on the government for the same.", 
    "section": "national", 
    "title": "Law needed to curb honour killings", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}