{
    "author": [
        "R Arivanantham"
    ], 
    "text": "Huge blocks of stones being carried by lorries posing great danger to road users in Kanyakumari district.\n\nThe mini lorries transporting black stone in small blocks for construction of basement for houses, bridges and Thengaipattinam fishing harbour projects endanger the lives of road users in Kanyakumari district.\n\nOverloading lorries carrying black stone have been causing a lot of trouble to road users who are under threat, as the stones from uncovered lorries may fall on them at any time.\n\nAs there is a ban on stone quarrying in neighbouring Kerala, the entire need of the State is met by over 30 stone quarries in Kanyakumari and Tirunelveli districts.\n\nAs many as 28 stone quarries that were sealed by the then Collector S. Nagarajan were allowed to resume quarrying immediately after his transfer from Kanyakumari.\n\nThe transporters resort to overloading to offset the “low margin and high operational cost.'' They pay a nominal fine if charged by the Transport department officials or police. However, the violation, which jeopardises the safety of other road users, especially those driving smaller vehicles such as two wheelers and walkers, has become a norm now. “We are forced to the edge of the roads when lorries transporting black stone try to overtake us’’ says a social activist.\n\n“Worse still is that they do not cover the load with tarpaulin,'' laments S.R. Sreeram, president, Kanyakumari District Consumer Protection Association.\n\nThe mini lorries/tempos transporting double the weight than the permitted level posed danger to road users, Mr. Sreeram said. “It is the duty of the Transport and Revenue departments and the police to check the dangerous overloading tendency to prevent accidents on highways,” he said.\n\nThe speeding overloaded tempos/mini lorries could be seen passing through the Collectorate on the Nagercoil-Thiruvananthapuram National Highway unchecked, he pointed out.\n\nR. Rajinikanth, Regional Transport Officer, told The Hindu that the officials were checking overloading of vehicles on specific complaints. Recently, large number of tempos/mini lorries were booked in Rajakkamangalam Road for overloading. Violators were fined Rs. 1000 per tonne of black stone over and above the permissible limit and Rs. 2,000 for the crime. Mr. Rajinikanth said that the department would intensify vehicle check on the NH to curb such violations.", 
    "section": "national", 
    "title": "Lorries transporting boulders endanger lives of road users", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}