{
    "author": [
        "L Renganathan"
    ], 
    "text": "Flag hoisting in different temples in Kumbakonam, holy dip in tank mark the occasion\n\nAn elderly couple comes out of the Mahamaham tank after a holy dip in Kumbakonam on Saturday.— PHOTO: G_GNANAVELMURUGAN\n\nMahamaham 2016 got off to an auspicious start here on Saturday with the hoisting of the sacred flag at six Shiva temples associated with the Mahamaham and thousands taking a holy dip at the hallowed tank.\n\nA large number of devotees from various parts of the State have been filing into the temple town since early morning, though the ritualistic flag hoisting took place only past noon to mark the actual commencement of rituals.\n\nThe sacred flags were hoisted in Sri Aadi Kumbeswarar temple, Sri Kasi Viswanathar temple, Sri Nageswarar temple, Sri Abimukeswarar temple, Sri Kalahastheeswarar temple and Sri Vyazha Someswarar temple around 12-40 p.m. to mark the commencement of the rituals. At Sri Aadi Kumbeswarar temple, the priests hoisted the sacred flag in the presence of Food and Hindu Religious and Charitable Endowments Minister R. Kamaraj, Housing Minister R. Vaithilingam, HR & CE Commissioner M. Veerashanmugamoni and other dignitaries.\n\nAt the Sri Kasi Viswanatha Swamy temple, the sacred flag was hoisted with the Kanchi Acharyas Sri Jayendra Saraswati and Sri Vijayendra Saraswati in attendance.\n\nAn hour after the flag hoisting devotees started taking a dip in the Mahamaham tank waters and poured water scooped from the sacred wells within the tank precincts.\n\nDharmapuram Adheenam Shanmugha Desika Gnanasambanda Paramacharya Swamigal, Thiruvavadudurai Adheenam Sri Ambalavana Desika Paramacharya Swamigal, Madurai Adheenam and the Thirupananandal Kasi Vasi Mutt head Sri Yajaman Swamigal were present for the inauguration at Sri Aadi Kumbeswarar temple.\n\nUnion Minister of State for Shipping Pon. Radhakrishnan; Principal Secretary, Municipal Administration and Water Supply Department K. Phanindra Reddy; Director of Municipal Administration Prakash; Director of Rural Development K. Bhaskaran and Thanjavur District Collector N. Subbaiayan participated.\n\nFlag hoisting in temples , holy dip in tank mark the occasion", 
    "section": "national", 
    "title": "Mahamaham off to an auspicious start", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}