{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former MP presents a wish list for Puducherry ahead of the Railway Budget\n\nFlagging Puducherry’s ‘backwardness’ in railway development in spite of its status of an important tourist destination on the Coromandel coast and its French legacy, M. Ramadass, former MP, has urged Union Railway Minister Suresh Prabhu to initiate a plan to improve rail connectivity.\n\nIn a wish list to the Minister ahead of the Railway Budget 2016-17, Mr. Ramadass suggested a five-pronged plan which included establishing direct rail link between the city and exclaves of Karaikal, Mahe and Yanam, connecting all the four regions to some of the State capitals. He wanted to link the city of Puducherry with Delhi and other major State capitals.\n\nMr. Ramadass pointed out that the railway development of the Union Territory did not receive the due attention of the Railway Ministry, as a consequence of which Puducherry remained unconnected to the rest of India at least till 2004 when the first electrification work between Puducherry and Villupuram was completed at a cost of Rs. 9 crore.\n\nThough Puducherry slowly crept into the railway map of India, when viewed from the significance of location, and surging demand for rail connectivity, the development of Railways in the Union Territory hitherto is far from adequate.\n\nAccording to Mr. Ramadass, a unique characteristic of this territory was its isolated, non-contiguous and non-compact nature. It presents a peculiar picture of territorial jurisdiction perhaps the only one of its kind in the world with its exclaves of Karaikal 50 kms south of Puducherry, Mahe situated at a distance of 830 kms while Yanam is at a distance of 870 kms from Puducherry. “However these four regions do not have direct railway connectivity between them. Puducherry, the capital city of the Union Territory is not well connected to New Delhi, the power centre of the Union Territory and other capital cities of States,” he said. Government of India should earmark capital in the range of 0.1 to 0.5 per cent of its total development expenditure for the development of Railways in the Union Territory of Puducherry. He also wanted the Ministry to consider introduction of a Sampark Kranti Express (bi- weekly) between Delhi and Puducherry, a Puducherry to Ajmeer via Jaipur (bi-weekly) service, Jan Shatabdi Express between Chennai and Puducherry (daily), Puducherry - Coimbatore Express (thrice in a week), Puducherry-Trivandrum Express via Vridhachalam, Madurai, Kanyakumari (thrice in a week) and a Puducherry-Goa Express via Tiruchi, Palani, Pollachi, Mangalore (thrice in a week).\n\nHe also sought extension of existing trains including the Kakinada-Chennai Express –Chennai to Puducherry and Hyderabad Kachiguda-Chennai Express- Chennai to Puducherry and upgradation of the Puducherry station from B to A class station.", 
    "section": "national", 
    "title": "Minister urged to improve connectivity", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}