{
    "author": [
        "Dennis S"
    ], 
    "text": "State government is looking at various options to identify a site\n\nEven as it is gradually expanding its fleet, the Navy is looking for land near the State capital to establish a base as marine traffic in Chennai port is steadily increasing.\n\nThough the Navy had considered an option near Muttukadu along East Coast Road, it did not happen for various reasons. “Following the request made by the Navy, the State government is looking at various options to identify a site. We have seven ships now and four more would join the base in Chennai this year and another a year later. We are an expanding Navy and we need space,” a Navy officer said.\n\nFor establishing a separate base, a minimum of 100 acres are required, however, if the land is located adjacent to an operational port, the necessity could be less, he said.\n\nAt present, ships and other assets belonging to the Navy and the Coast Guard are berthed in jetties allotted to them. But, the overall control of the campus is with the Chennai Port Trust management.\n\n“Every time we need to berth a ship, we need to seek space from the port management and it would be allotted to us unlike in our base in Visakhapatnam, where the Navy has its own jetties and separate entrance. Though the port management in Chennai has been prioritising our needs, it would be make a huge difference if we had our own base,” another officer said.\n\nThough there are other bases of the Navy in the State, they all house aviation assets and are not located along the coast. Even in Forward Operation Base (FOB) at Thoothukudi, the Navy ships are being berthed in jetties under the control of V.O. Chidambaranar port\n\n. “We are planning to have our own jetty in Thoothukudi soon,” he said.\n\nA minimum of\n\n100 acres are\n\nrequired for establishing a separate base", 
    "section": "national", 
    "title": "Navy looking to establish base near Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}