{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Dravidian parties have betrayed the cause of Periyar and strayed away from the principles of the Dravidian movement leaving in the lurch the Dalits and the poor of the State, said CPI(M) Politburo member Brinda Karat here on Saturday.\n\nAddressing a public meeting of Makkal Nala Kootani here, the CPI(M) leader said that people had become pawns in the political power play between the two parties.\n\nThe continuing atrocities against Dalits in the State were a pointer to the indifference of the two parties. “Dalits are not allowed to mourn their dead and are lathi-charged for using a common pathway to the graveyard. The oppression of t Dalits continues to rise unchecked in the State.”\n\nThe Modi-led government came to power on the promise of ‘Aacchhe Din.’ Two years had passed since, but the poor farmer and the common man had not yet seen the promised ‘good days.’ “However, the corporate firms and big businesses were enjoying loan write-offs and the good times, as promised by Mr. Modi,” Ms. Karat said.\n\nThe landmark MNREGA guaranteed 100 days of labour was reduced to 46 days a family after the Centre cut down funds for the Scheme.\n\n“Tripura Chief Minister Manick Sarkar sat on a hunger strike in New Delhi for funds for MNREGA, while the Chief Minister of Tamil Nadu never raised a single demand with the visiting Union Finance Minister on MNREGA,” Ms. Karat said. She said that this was not merely a difference of personalities of two Chief Ministers, but a reflection of difference in approach and policies. It was here that the Makkal Nala Kootani would strive to change the face of Tamil Nadu politics, when its cadre would reach out to the masses and help bring in a change in the elections.\n\nAccording to Ms. Karat, the cult of authoritarianism has grown manifold under the Narendra Modi regime.", 
    "section": "national", 
    "title": "Oppression of Dalits continues in State, says Brinda Karat", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}