{
    "author": [
        "Sudhir Srinivasan"
    ], 
    "text": "It appears that chaos theory is quite in vogue, this season. A couple of weeks ago, the Telugu film, Nannaku Prematho , had its protagonist referring to it by its more popular term, butterfly effect. And then, there’s this week’s Vil Ambu , which begins by saying that our lives are often decided by the seemingly insignificant actions of those around us. And then, there’s Jil Jung Juk in which Naanjil Sivaji, or Jil (Siddharth), sets events rolling by talking about a movie he watched—The Butterfly Effect—and in trying to exaggeratedly flap his hands like a butterfly, somehow manages to interfere with his car’s driver, Jaguar Jagan, or Juk (Sananth Reddy), so much that he drives the car off the highway. Later, the theory also, not quite to my taste, gets interpreted literally, when an actual butterfly sets loose a chain of events that save Jil, Juk, and Jungulingam or Jung (Avinash), from being shot down by a man named… Attack. It is that sort of a film.\n\nAs you can see, it’s not so much about chaos theory than it is a quirk fest. Jil Jung Juk could well have been named Quirk Quirk Quirk for all the eccentric ideas that populate the film’s universe. You already know that the names of the characters are inspired by a Vadivelu dialogue in Kadhalan , but here’s more: There’s liquor pouring down a brass tap, there’s a pharmacy called Susumitha (and no, it doesn’t just sell medicine for urinary difficulties), there’s a bus called Soppanasundari (that answers Senthil’s timeless question from Karagattakara n ), there’s a motel called Saaplin, there’s a colour-blind character, there’s a comic strip inserted somewhere, and the most important of all, a pink ambassador… It’s all rather queer, but does oddity necessarily equate to enjoyability?\n\nJil Jung Juk , set in 2020 when petrol has nearly run out and the economy has gone to the dogs, intertwines a few stories: of three men who are smuggling cocaine (a word that’s muted by the censor board for the most part), of the business rivalry between Deivanayagam (Amarendran) and Rolex Rawther (Radha Ravi), and of the gun-toting Attack and his seedy schemes with Pai (Bipin), who threatens to make you laugh out loud throughout the film with his dialogue delivery that’s inspired by the ‘WhatsApp Saamiyaar’, but doesn’t really succeed… except for the one time he comments on Jil’s blue-coloured hair: “ Ujaala-va eduththu uchchila vitrupaan pola ”. The film needed so many more moments like this. And this, is the chief grouse I had with Jil Jung Juk . I could forgive the thrilling moments not really being thrilling, but what when the funny moments aren’t really funny? That just leaves behind a desultory film with stylised visuals and great music (Vishal Chandrashekar). For instance, Jung says there are two people he admires the most in life: one’s Tamil actor Jaishankar (what’s a quirky film without a hat-tip to CID Shankar’s hero), and the other’s a porn star, Jessi Hunger (and that’s a fabricated name whose sole purpose is to rhyme with Jaishankar). The writers also likely considered Ramarajan/Ramona Jane, and T. Rajender/Tyra Gender. Talking of made-up names, a doctor is named Kotalakkal only so he can point to the first part of his name when a man wants to know what prostate cancer is. There’s another ‘joke’ in which one of the characters refers to Arnold Schwarzenegger as Arnold Schwarzshankar. I don’t know if these jokes seemed much better in writing, but they definitely don’t hold up on screen.\n\nAnd for a film that thinks of itself as being so offbeat, it also encourages some mainstream, even discomfiting, ideas. A fat man, for example, is shown as being prone to loud bursts of flatulence. It wasn’t funny in Boys . It isn’t funny here. There’s also the ubiquitous Ajith reference when a Yennai Arindhaal poster of the actor gets unveiled. I couldn’t forgive Jil Jung Juk for these ‘compromises’.\n\nAnother problem is the believability of the strange universe that the actors inhabit. A film like Soodhu Kavvum , which thrived a lot on the quirkiness of its characters, worked so well because the story is rooted to our land, the people seem like they belong here, the dialogues seem relatable. Siddharth’s Madras baashai , for instance, didn’t seem to flow as casually, as comfortably. In such movies, where you aren’t really rooting for any particular character or concerned about their fate, it is important that the individual scenes explode with vivacity. Deeraj Vaidy, the director, tries—like when he makes Juk complain about an inefficient waiter during a crucial scene at a restaurant. But it seems too forced, too inorganic. I went into the theatre rooting for Jil Jung Juk . After all, it isn’t every day that you get a Tamil film that looks as rich, whose sound is so refreshing, and which, almost cockily, dispenses away with a needless heroine (thank god for that).\n\nBut as Vadivelu objectifies women in Kadhalan , if Jil is great, Jung is decent, and Juk is bad, Jil Jung Juk , as it is, would exist somewhere between Jun g and Juk . Vadivelu, in the same movie, explains that there’s another metric for female classification: Bippaa, biffaa, biblack, and pachak . On the evidence of Jil Jung Juk , I definitely wouldn’t be in a hurry to book tickets for Bippaa biffaa biblack pachak .\n\nsudhir srinivasan\n\nJil Jung Juk\n\nDirector: Deeraj Vaidy\n\nGenre: Comedy\n\nCast: Siddharth, Sananth Reddy, Avinash, Amarendran, Radha Ravi, Bipin\n\nStoryline: Jil, Jung and Juk, while smuggling cocaine, get into trouble", 
    "section": "national", 
    "title": "Quirky, but little else", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}