{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Rail passengers are concerned over levy of service charge for tickets reserved from extension counters. An extension counter came into existence at V.O.Chidambaram College in Thoothukudi in February 2013 under the Member of Parliament’s 1,000 Passenger Reservation System (PRS) scheme. V.O.C. Educational Society voluntarily operated the counter.\n\nAlready, passengers were burdened with hike in fares and they would hardly be able to bear the brunt of any further charge, R. Rajmohan, a passenger, said here on Saturday. The aggrieved passenger, who frequently commutes to Chennai, said he often reserved tickets in the extension counter. If service charge was levied on tickets, the passengers, who relied on extension counters, had no alternative but to get tickets at the railway station.\n\nM. Piramanayagam, secretary, District Passengers Welfare Association, said the new regulation on service charge would come into effect from February 15. He added that there must be uniformity in passenger fare. Apart from the regular fare, a passenger had to pay Rs.15 to Rs.30 as service charge. The extension counters should be allowed to collect only the fare in the interest of passengers.\n\nWhile railway authorities were manning a reservation extension counter at Tirunelveli Corporation office in Palayamkottai, they could also rent a building here and operate the extension counter to benefit passengers, said rail users. A.P.C.V. Chockalingam, secretary, V. O. C. Educational Society, told The Hindu that the society was not willing to agree to the conditions of the railways on collecting the service charge for ticket reservation. J. Jeyasingh Thiyagaraj Natterjee, Thoothukudi MP, said the extension counter would be shifted to another location in the town.\n\nNagercoil\n\nReservations made through non railhead passenger reservation system of the railways (NRH PRS) will vary from February 15 as two per cent commission admissible to the government agencies who man the counters has been withdrawn and permission is granted for levying service charges on tickets (not on each passenger), according to a railways release. With this, reservations made through counters manned by Post Offices and NRH PRS will become uniform in rate. Additional service charge admissible for each category will vary from Rs.15 to Rs. 30.", 
    "section": "national", 
    "title": "Rail passengers worried over service charge on tickets", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}