{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Dance troupes from Kashmir perform at the cultural festival organised by the Department of Art and Culture and Thanjavur South Zone Cultural Centre at Gandhi Thidal on Saturday. —Photo : T.Singaravelou\n\n13 ethnic groups from Jammu, Kashmir valley and Ladakh brings alive culture of their State\n\nThe three-day Kashmir cultural festival (Kashmir Kalai Vizha) organised by the Department of Art and Culture and Thanjavur South Zone Cultural Centre got off to a grand start at Gandhi Thidal here on Saturday. Chief Minister N. Rangasamy inaugurated the festival by beating a drum.\n\nThe festival was a new experience for folk enthusiasts in the city with 13 ethnic groups from the three regions of Jammu, Kashmir valley and Ladakh bringing alive the vivid aspects of Kashmir culture through their scintillating dance performances.\n\nAccording to a senior official of the Department of Art and Culture, the festival this year has Jammu and Kashmir as the theme State showcasing the evergreen culture and tradition of the region.\n\nAs many as 150 members including 50 women from Kashmir will present folk music and dance performances during the show. The cultural events will be held at Gandhi Thidal near the Beach promenade, Lawspet and Villianur till February 15.\n\nThe event is being held to promote a better understanding and to unify the diverse and rich cultural ethos of people from Kashmir, he said.\n\nDressed in their ethnic best, the troupes put up an entertaining show through various dance performances. One of the troupes presented a dance-drama using folk instruments while another troupe performed Dumhal, the traditional folk dance performed in Kashmir.\n\nNearly 350 artists from Puducherry would also perform in the festival that would go on till February 15.\n\nDirector of South Zone Cultural Centre, E.N. Sajith, Speaker V. Sabapathy, Electricity Minister T. Thiagarajan and Secretary to Art and Culture A. Muthamma participated.", 
    "section": "national", 
    "title": "Rangasamy inaugurates Kashmir cultural festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}