{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Many facilities damaged during floods are yet to be repaired; residents are forced to travel longer\n\nFor the past two months, residents in various parts of the city have been taking a circuitous route as causeways connecting them to other places remain damaged since the floods.\n\nMany causeways across waterways, including Cooum, Adyar and Kosasthalaiyar river, were either washed away or broken during the floods in December last year.\n\nRail Nagar road bridge in Mogappair, Adayalampattu in Nolambur across Cooum and Gowl Bazaar and Jaffarkhanpet across Adyar river and Muthukondapuram across Kosasthalaiyar river have suffered heavy damages. As a result, residents are finding it difficult to move out of their neighbourhood to nearby areas.\n\nFor instance, people of Adayalampattu travel an additional distance of five km to reach areas like Maduravoyal and Nerkundram on Poonamallee High Road as a single-lane causeway across the Cooum in Adayalamppatti was broken. When the causeway was in use, they had to travel less than a kilometre.\n\nSimilarly, residents of Rail Nagar are now using the bridge in Golden George Nagar, which is two km away or travel up to Thirumangalam to reach Poonamallee High Road. Residents want causeways to be replaced with bridges.\n\nEvery time the sluice gates of Chembarambakkam reservoir are opened, residents of 18 localities such as Poonthandalam, Somangalam, Sirukulathur and Nandambakkam, are cut off as the stretch that provides connectivity to other parts of the city through Kundrathur is submerged.\n\nM. Elango of Democratic Youth Federation of India, Kundrathur branch, said: “Students are the worst-affected. Many travelled double the usual distance to reach other parts of the city during the floods as the Sriperumbudur Kundrathur Road was submerged .”\n\nHe recalled that though the government had allotted Rs. 3 crore towards construction of a causeway across the stretch, no development has taken place. Residents demand that a bridge must be constructed as causeways may not be of help during heavy rains.\n\nSources in the Water Resources Department said makeshift facilities have been provided in some places like Puduchatram near Jamin Korattur in Tiruvallur. “We will coordinate with the Highways to rebuild facilities and provide details like vents for free flow of water in rivers to help design projects,” said an official.", 
    "section": "national", 
    "title": "‘Replace broken causeways with bridges’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}