{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Even before the dust triggered by the awarding of Ph.D. degree to Rajya Sabha MP L. Sasikala Pushpa by admitting her as a ‘full-time candidate’ subsided, the Manonmaniam Sundaranar University encountered another embarrassing moment when a visually challenged scholar refused to receive the degree from Governor Konijetti Rosaiah in the 23rd convocation held on Saturday.\n\nWhen visually challenged Ph.D. scholar R. Periyadurai, 42, of Department of Folklore went up to the dais to receive the degree, he refused to accept the all-important credential he had earned after 10-year-long hard work on ‘The challenges being faced by the differently-abled folklorists’ from Dr. Rosaiah. He had a valid point to say.\n\n“The Manonmaniam Sundaranar University, celebrating its silver jubilee, has no differently-abled teaching or non-teaching faculty, even after the Supreme Court had given its verdict in favour of giving 3 per cent reservation for the physically challenged in education and employment. Then what is the point in me carrying this Ph.D. certificate. Hence, I wanted to give it back to the Governor,” Dr. Periyadurai said after being forced to get down from the dais along with the Ph.D. degree certificate.\n\nWhen he refused to hold the certificate given by the Governor, Higher Education Secretary Apoorva and the security officers standing nearby tried to pacify him, but he did not relent. However, the certificate was stuffed in his hands before he was brought down from the stage by others.\n\nNo scope for employment\n\n“I did not receive it as there is no scope for getting employment with this Ph.D. I was forced to carry it along with me. Differently-abled scholars across the country will return their Ph.D. degrees to the universities concerned, I hope, as nobody is concerned about giving 3 per cent reservation to the physically-challenged candidates. We seek recognition for our educational qualification in the form of giving employment to us. Otherwise, we’ll continue to ignore these ‘fake’ certificates,” a visibly upset Dr. Periyadurai told reporters on getting down from the dais.", 
    "section": "national", 
    "title": "Research scholar refuses to accept Ph.D. degree", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}