{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Residents from areas that were hit the hardest during the December floods are forming groups that work towards creating flood mitigation systems.\n\nLed by former Chennai Corporation engineer N. Mathavan, around 100 residents of Velachery region have carried out a survey of 46 rapidly-developing layouts in and around Pallikaranai with the aim of understanding factors that could aggravate flooding during heavy rains.\n\nThey have completed the mapping of roads in this region that require new stormwater drains. “During the mapping, we found that only 5 percent of the newly developing layouts had stormwater drains,” said Mr. Mathavan, who was part of the team that developed the disaster resilience index for Chennai in 2010.\n\n“The State government has already made proposals for implementation of stormwater drains in developing areas along Rajiv Gandhi Salai. But this requires funding to the tune of Rs. 4,000 crore and is expected to be implemented only after a few years. So, our focus is on simple solutions in each neighbourhood to cope with disaster,” he said.\n\nWith support from government agencies, these groups of residents plan to create awareness about disaster preparedness.\n\nResidents in each of the streets learn about the strength and weakness of existing civic conditions on a weekly basis.\n\nWith many engineers employed in the city participating in the initiative, there is also an effort to find a way to improve disaster management practices among residents of unapproved layouts that are also mushrooming in the area. Civic officials are unable to implement projects in such areas because most of the roads are less than 24 ft in width.\n\n“We are waiting for a nod from the Chief Minister for release of our first handbook on disaster mitigation. Some people are trying to mislead residents on the December floods. The initiative will only empower residents, offering them the right information and getting civic projects implemented in the quickest time possible,” said Mr.Mathavan.\n\nAt least 3 lakh residents could be covered in the initiative before this monsoon.\n\nThe group has surveyed 46 rapidly developing layouts in and around Pallikaranai", 
    "section": "national", 
    "title": "Residents try their hand at flood mitigation systems", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}