{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The Salem - Yercaud State Highways being widened at Hasthampatti in Salem city on Saturday.— Photo: E. Lakshmi narayanan\n\nThe works of widening and strengthening a stretch of Salem – Yercaud road at Hasthampatti in the city with the funds sanctioned jointly by both the Centre and the State Government are progressing at a fast pace.\n\nThe project is being executed by the Construction and Maintenance Wing of the State Highways Department at an outlay of Rs. 1.70 crore under the comprehensive road infrastructure development programme.\n\nThe project included widening and four-laning of the stretch to a distance of 1.1 km from District Court campus to Tamil Nadu Housing Board quarters, strengthening the entire width of the road and black topping it.\n\nThe works are expected to be completed by this month end, according to State Highways sources on Saturday.\n\nAnother road work is in progress in Kondalampatti to a length of 800 m at an outlay of Rs. 2 crore. The project included widening and strengthening the existing road.\n\nThe works on widening of culverts and construction of retaining walls, as part of the project, are already in progress.\n\nThe road widening and strengthening works will commence soon.\n\nThe State Highways Department has also launched the work of widening and strengthening Salem – Veeranam road to a distance of 2.8 km at an outlay of Rs. 2.6 crore.\n\nHere too, the works of widening of culverts and construction of retaining walls had already commenced, the sources added.\n\nIt may be mentioned here that the State Highways Department recently widened the stretches of Suramangalam main road from three roads junction to Tiruvagoundanur roundabout and from Tiruvagoundanur bypass road junction to Salem Railway Junction.", 
    "section": "national", 
    "title": "Road widening works at Hasthampatti progressing", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}