{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Some SBI customers got messages past midnight that a sum has been withdrawn from their a/c\n\nSBI accountholders who panicked and visited the bank branches following an SMS alert in Pudukottai on Saturday.\n\nHundreds of savings bank customers of the main branch of State Bank of India panicked and rushed to the branch to complain about sudden and unauthorised withdrawal of huge sum of money from their savings accounts on Saturday.\n\nA teacher of Pudukottai, Meenakshisundaram, said he spent a sleepless night on Saturday shortly after he got an SMS that Rs. 5.40 lakh had been withdrawn from his account.\n\nHe got the message at 2.35 a.m. Similar was the case of Srinivasan, another account-holder, from whose account Rs. 1.10 lakh was withdrawn.\n\nAlthough it was a holiday, Narasimhan, Senior Manager, came to the branch to offer clarification.\n\nHe said the branch had classified their accounts into three categories “diamond”, “gold” and “silver” based on the quantum of deposit.\n\nA “bulk” part of the deposit had been transferred to the fixed deposit category under the ‘multi option deposit’ (MOD) scheme. About 4,000-odd customers — all salaried sector and pensioners, had been identified for the benefit under the MOD scheme.\n\nMr. Narasimhan clarified that there was no need for panic among the customers. In fact, the transfer of money from the savings account to the MOD had been effected in the interest of the customers. “The saving bank deposit attracts just 4.5 per cent of interest against 7.25 percent under the MOD” he said.\n\nHe said the plan to transfer the deposit from the savings account to the MOD was under serious consideration of the State Bank of India for a prolonged period.\n\nIt had, however, been effected before the benefits could be explained to the customers.\n\nHe said the transfer had been effected without prior intimation to the customers, resulting in panic.\n\n“Their deposits are safe and they can withdraw a part or whole of the deposit,” he added.", 
    "section": "national", 
    "title": "SBI’s SMS alerts causes flutter among account holders", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}