{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Gardening and nature lovers in the city got an opportunity to learn about innovative organic farming and vermicompost from a pioneering soil biologist in a free two-day workshop organised by the Anna Science Centre–Planetarium this week.\n\nSultan Ahmed Ismail, director, Ecoscience Research Foundation (Chennai), conducted two sessions for children and adult delegates on the centre’s Airport Road premises on February 12 and 13.\n\nIn the field of organic farming since 1978, Dr. Ismail, a professor with several decades of teaching and research experience in Chennai-based institutions New College and Dr MGR Janaki College, said he had witnessed a growing eco-awareness among the public, especially among the youth over the years. “In the beginning, when we held seminars on organic farming, only around five people would attend. This week, in Tiruchi, over 60 people responded to our announcement, even though we had expected only around 40,” Dr. Ismail told The Hindu . “I’m beginning to see a commitment among the youth to preserve nature, and to work for the country’s environment safety,” he added.\n\nOn Friday, 67 children were introduced to basic life science through “Simple Tasks, Great Concepts”, featuring simple experiments using commonly available material. All the lessons are also available through apps on Dr. Ismail’s website http://www.erfindia.org/\n\nDr. Ismail is credited with coining the term ‘vermitech’, the science of converting organic waste into useful manure using earthworms. His visual presentation demonstrated ways to expand home-bound operations for other establishments like hostels and industries.\n\nOn Saturday, over 60 city residents turned out for the day-long workshop on eco-friendly gardening and farming conducted by Dr. Ismail. In the interactive presentation, Dr. Ismail outlined several aspects of vermicomposting, and ways to find a commercial potential in recycling. Explaining soil nutrition, Dr. Ismail suggested gardeners and farmers alike should reconsider the pattern of fertilisation for better results, besides homemade tonics for plants. He spoke on ways to filter “grey water” (generated in households) through plants, and warned against growing commercialisation of food production that had introduced chemicals into the dietary chain.\n\nIn the post-lunch session of the workshop, 40 vermicomposting starter kits were distributed among the delegates, who then assembled their first composting pit using the plastic bins, layering material and earthworms provided by the science centre.\n\nThis was followed by a demonstration by Dr. Ismail on formulating soil nutrition tonics and sprays using material from the kitchen.\n\n“The next step from here is to teach more people, as long as I live, as long as I breathe,” said Dr. Ismail. “I’m really happy to see organisations utilising our work,” he added.", 
    "section": "national", 
    "title": "Sowing seeds for an organic way of life", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}