{
    "author": [
        "Special Correspondent"
    ], 
    "text": "FOR A CAUSE:School and college students and members of National Green Corps taking part in a Walkathon in Ramanathapuram on Saturday; (right) students at a 'Clean and green' rally taken out from St. Joseph’s Girls Higher Secondary School to Dudley Boys Higher Secondary School through Kamarajar bus stand in Dindigul.— Photos: L. Balachandar and G. Karthikeyan\n\nHundreds of school and college students and members of National Green Corps (NGC) and women self-help groups (SHG) took out a walkathon organised by DHAN Foundation here on Saturday, coinciding with the Swachh Bharat Mission.\n\nAbout 3,500 students from 19 schools and five colleges in the district and SHG and NGC members took part in the walkathon from Aranmanai to Raja M Dinakar RC Higher Secondary School on Madurai Road through Central Block and Roman Church roads.\n\nAssistant Superintendent of Police S. Sarveshraj flagged off the walkathon and students walked through carrying placards, urging the people to keep their surroundings and waterbodies clean and green. “Rivers and waterbodies are lifelines, polluting them is a crime,” “Plastic is injurious to earth, use cloth bags,” read the placards.\n\nAfter converging on the school premises, the students staged dance and drama events with focus on green and clean theme. Students of Thassim Beevi Abdul Kader College for Women staged a drama on evils of de-forestation, while students of Raja Dinakar school presented a dance-drama about cleanliness.\n\nAt the end of the event, DHAN foundation, which had organised the event in a bid to motivate the people to address the greening and cleaning, the twin challenges faced by villages and cities, distributed about 200 saplings to the students as a green initiative. Addressing the students and SHG members, its regional coordinator G. Sathiskumar emphasised the need to abolish open defecation and protect waterbodies from pollution.\n\nCiting a study, he said 45.7 per cent of the population practiced open defecation in the district and underlined the need for building individual toilets. The foundation had tied up with the district administration to build individual toilets in houses, and with the forest department to provide tree saplings, he said.\n\nNGC Coordinator Bernadict, Dhan Neithal Mutual Movement Coordinator Govindan and Alliance for Release of Innocent Fishermen (ARIF) president U. Arulanandham addressed the students.", 
    "section": "national", 
    "title": "Students take part in walkathon", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}