{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The alliance between the DMK and the Congress, forged in 2004 and continued till March 2013, was the longest political tie-up between a Dravidian party and a national party.\n\nThe DMK-Congress alliance was on firm grounds for nine long years spread over two United Progressive Alliance (UPA) regimes at the Centre. The alliance remained intact for two Lok Sabha elections (2004 and 2009) and two Assembly elections (2006 and 2011). The DMK pulled out of the UPA on the Sri Lankan Tamils issue in March 2013.\n\nTill the 1967 general elections, the Congress and the DMK were the leading parties opposed to each other in every way.\n\nIt was the split in the Congress and the birth of a Congress (new) in 1969 that led to a coalition arrangement.\n\nIndira Gandhi preferred to go with the then ruling DMK to face the formidable challenge from the Congress (Organisation) led by K. Kamaraj in the 1971 general elections. The DMK–Congress alliance as expected swept the polls.\n\nThis alliance did not last long, as Indira Gandhi moved towards AIADMK after its birth and the combine swept the March 1977 Lok Sabha elections.\n\nWhen MGR refused to support Indira Gandhi in the Thanjavur Parliamentary constituency by-election in 1979, the DMK took advantage of it to forge an alliance in the 1980 Lok Sabha elections and handed the AIADMK a humiliating defeat.\n\nThe scenario changed in the next general elections in 1984 with the AIADMK clinching an electoral pact with the Congress, thanks to the help rendered by Indira Gandhi for the treatment of MGR in the U.S.. The AIADMK’s relationship with the Congress continued till MGR’s death in 1987. And then it was renewed with Jayalalithaa at the helm between 1991 and 96.\n\nIn the 1998 Lok Sabha elections, the AIADMK forged an alliance with the BJP, but this alliance could survive only for a year and in the general elections held in 1999, the DMK became a constituent of the BJP-led NDA. The AIADMK renewed its ties with the Congress in 2001.\n\nThe DMK continued to remain in the NDA for the next four years, till it pulled out of the Vajpayee-led government shortly before the 2004 general elections.\n\nIt was after that the UPA story began.\n\nIn a way, the alliance between the DMK and the Congress has\n\ncome full circle", 
    "section": "national", 
    "title": "The alliance story so far", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}