{
    "author": [
        "Zubeda Hamid", 
        "S Poorvaja"
    ], 
    "text": "Efforts to include children with disabilities in mainstream schools are fraught with challenges, say experts\n\nhe last few weeks have been hectic for Sangeetha* (name changed) as she has been looking to admit her 11-year-old son into a new school for the coming academic year.\n\n“My son has mild Pervasive Development Disorder (PDD) and was studying in a private school in Mogappair but he and 17 other children with special needs have been asked to leave now,” she said.\n\nWith not many private mainstream schools receptive to admitting him, she said that among the very few schools in the city that are inclusive, there are other issues such as high fees.\n\nThe Constitution of India and the Right to Education Act, 2009, guarantee the right to education to all children. No child can be denied admission on the grounds of disability to any school, but the reality of children with disabilities being included in mainstream schools is often challenging, say experts. However, it can be done — with the right kind of resources, support and most importantly, the right attitude and climate in the schools, they say.\n\nA senior official of the school in Mogappair said they had tried to be inclusive. “We appointed a special educator in July for the children, but she was not able to handle all the 18 children — with differing abilities. We cannot afford a special educator in every class. We are also receiving complaints from the parents of other children as some of the children are causing disturbances in class. Also, we are not sure if the children are benefitting from sitting in the classes,” she said.\n\nDipti Bhatia, deputy director, Vidya Sagar, an organisation that works with people with disabilities, said that while inclusion did have challenges, it could and should be done.\n\n“The school has to have resources to do this and has to prepare itself. Resources are available — with NGOs and the government to provide support. The school should be able to access rehabilitation professionals or special educators. Teachers and special educators must collaborate. Parents of non-disabled children should be sensitised, as should the children. Certain adaptations are necessary in the curriculum and evaluation modes,” she said.\n\nGayathri*(name changed), another parent, admits that most schools she has been approaching to admit her nine-year-old son to, have been directing her to special schools.\n\n“My son only has mild PDD and has been certified as fit to study in a mainstream school by experts. All we want is for our children to experience and study in a school with other children. But this has become an increasingly arduous task since school managements tell us that they do not have the resources to train their teachers and facilitate inclusiveness,” she said.\n\nL.V. Jayashree, director, The Spastics Society of Tamil Nadu, said empirical evidence had shown that non-disabled children in inclusive schools were more socially and emotionally evolved.\n\n“The school and the management have to see the value of inclusion. There is room for improvement in the system but there are many positive stories too,” she said.\n\nGita Srikanth, director, We Can, a resource centre for children with autism spectrum disorder, said that parents too needed to redefine education for themselves and their children. “Is the education equipping the children with life skills or any skill at all — this is what they need to be looking at,” she said.\n\n“Teachers have to be trained to know how to teach children with disabilities. And if there is a problem, the school should be willing to look for solutions and build linkages with organisations and with the community.\n\nLV Jayasahree, director, The Spastics Society of Tamil Nadu\n\nIf not in classrooms, schools can include children with autism in more unstructured sessions such as craft and playtime, and this would help with building their social skills. There are some children who are social and want to be with other children but do not get the opportunity.\n\nGita Srikanth, director, We Can\n\nAs a school that promotes inclusive education, we are focussed on understanding the needs of such children and catering to them while integrating them in a mainstream classroom. More schools promoting inclusive education is the need of the hour.\n\nMangala Jayachandran, Director-Special Education, Lady Andal School", 
    "section": "national", 
    "title": "The tough task of inculcating the value of inclusion in schools", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}