{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple: Thirupallioda thiruvizha, Namperumal purappadu from sanctum sanctorum in pallakku, 6.30 a.m.; reaching Renga Vilasa Asthana Mandapam, 8.30 a.m.; purappadu from the mandapam in Irattai prabai, 6.30 p.m.; reaching vagana mandapam, 8 p.m.; purappadu, 9 p.m.; reaching sanctum sanctorum, 9.15 p.m.\n\nSri Kanchi Sankara Mutt: Gayathri homam, North Street, Thiruvanaikovil, 8 a.m.\n\nSrimad Ubhaya Vedantacharya Peetam: “Bhagavata Dasamaskandam” by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Varasidhi Vinayagar Temple: “Srimad Ramayanam” by V. Mani, Ganapathi Nagar, Thiruvanaikovil, 6 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Lakshmi Narayana Swamy Temple, Melur Road, Srirangam, 5.30 p.m.; 122, South Chithirai Street, 6.45 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 24, Cheran Salai, Anand Nagar, 6 p.m.\n\nCULTURE\n\nThirukkural Peravai: Thiruvalluvar thiruvizha, competitions for students and presentation of awards, Government Boys Higher Secondary School, Manachanallur, 9.15 a.m.\n\nIndian Medical Association: Pongal festival, presentation of Dr. AR. Ganesan Arts Award to S.Ponnammal and Dr. S. Palaniyandi Trust Tamil scholar award to A. Arivunambi, IMA Hall, 6.05 p.m.\n\nGENERAL\n\nBharathidasan Institute of Management: Sanjeevani, S. Gopinath, Executive Director, BHEL, Tiruchi, chief guest, MD Hall, BHEL campus, 9 a.m.\n\nBishop Heber College Department of Social Work: Medical camp, South Ariyavur, 10 a.m.\n\nTiruchi Arivalar Peravai: Special address by E. Susai, professor, St. Joseph’s College, Sri Sivananda Balalaya, Ramalinga Nagar South, 10.30 a.m.\n\nMakkal Athikaram: Special anti-liquor conference, Kaliappan, presides, Uzhavar Sandhai grounds, Anna Nagar, 4 p.m.\n\nU2Can: Free counselling for MBBS, engineering courses abroad, V Cross Fort Station Road, 10 a.m.\n\nTrichy Plus: Quiz contest, V Cross Fort Station Road, Thillai Nagar, 5 p.m.\n\nM.A.M. College of Engineering and Technology Department of Computer Science and Engineering: Faculty lecture series on Python programming, 10 a.m.\n\nTiruchi District Retired Government Officials Association: Meeting, Bishop Heber Higher Secondary School, Teppakulam, 3.30 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}