{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "T.N. Janakiraman with Pakistani national Bakhtiyar Khan, who was operated upon for a pituitary tumour at the Royal Pearl Hospital and Research Institute, in Tiruchi. Patient's brother Sardar Khan is with them.— PHOTO: B. VELANKANNI RAJ\n\nThe patient had discovered his condition by chance in Quetta last year\n\nteam of city-based surgeons has performed a sophisticated surgery on a young Pakistani national to remove a pituitary tumour.\n\nBakhtiyar Khan, a 30-year-old Pakistani national from the Talli village in Sibi, Balochistan, underwent the surgery here a few days ago.\n\nThe surgery was performed by Dr. T.N. Janakiraman, skull base surgeon and managing director, Royal Pearl Hospital and Research Institute, Dr. Uday Chanukya, Dr. Prayatna Kumar, skull base surgeons, and Dr. Balamurugan, anaesthesiologist.\n\nThe tumour, in the cavernous sinus — a large collection of thin-walled veins creating a cavity bordered by the temporal bone of the skull and the sphenoid bone in the head, was removed through endoscopic surgery.\n\n“Normally surgeons go through the skull and brain to excise the tumour with the help of surgical microscopic glasses. But this doesn’t ensure the removal of the entire tumour, which is why radiation is recommended after the operation,” Dr. Janakiraman told The Hindu .\n\n“In Bakhtiyar’s case, the tumour had gone into the cavernous sinus. We used his nasal cavity as the entry point, and brought the tumour out through the nose as well. This is a scar-less keyhole surgery that ensures complete excision and doesn’t require us to make a new opening in the skull,” he added.\n\nDr. Janakiraman, who was trained in the procedure by internationally renowned neurosurgeon Dr. Amin Kassam in the U.S. 10 years ago, has been doing the procedure for the past nine years in Tiruchi.\n\nFor the patient’s elder brother, Sardar Khan, the experience has been both exhausting yet exhilarating. A file clerk at the local health centre in Sibi, the Khan brothers had taken their father, who is paralysed, to a doctor in Quetta last year, when the physician there suggested that it was Mr. Bakhtiyar who needed medical attention urgently. “None of us knew that he was unwell,” recounted Mr. Sardar. “We were advised by neurosurgeon Dr. Asghar Khan to seek help in India immediately. I couldn’t believe that I, who had never left my village to see even Lahore or Karachi, had to go to India.”\n\nIn a process that took three to six months, Mr. Sardar convinced Mr. Bakhtiyar and his other siblings (they are eight brothers and two sisters) to get ready to meet Dr. Janakiraman, besides applying for passports and organising visas.\n\nThe brothers took the Samjhauta Express from Wagah to Delhi on January 31. The Tamil Nadu Sampark Kranti Express brought them to Tiruchi after a 46-hour journey. As a humanitarian gesture, the hospital has waived all fees (in the range of Rs. 1 to 3 lakhs), except the cost of medicines.\n\n“I’m feeling much better now, and my eyesight has improved,” said Mr. Bakhtiyar Khan. After a few days of observation and a final MRI scan, he will be free to travel back home with his brother.\n\nSaid a gratified Mr. Sardar: “I haven’t seen much of India, or even of Tiruchi, but to me, Dr. Janakiraman and his team are India. I’d like to thank all my new friends in India for taking such good care of me and my brother.”", 
    "section": "national", 
    "title": "Tiruchi surgeons treat Pakistan national for pituitary tumour", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}