{
    "author": [], 
    "text": "Development works SUFFER\n\nThe continuation of standoff between the Revenue Department and the Prison Department over the issue of constructing the new Salem taluk office near the Salem Central Prison premises has been the talk of the town.\n\nThe Revenue Department identified a 30-acre site near the Central Prison in Hasthampatti in Salem for the construction of the taluk office.\n\nThe prison officials, however, opposed the site stating that no construction activity is allowed in the vicinity of the prison premises.\n\nThe revenue officials attempted to launch the construction work thrice in vain.\n\nOnce again, a team of revenue officials visited the controversial site on Friday. On learning about this, the prison staff rushed to the spot leading to tension.\n\nFollowing this, the revenue officials swiftly left the scene. Official sources said that following the confrontation, the district administration has already identified another site near Thadagapatti for the construction of taluk office.\n\nThe regular meeting of the Narasingapuram Municipality in Salem district held on February 9 was over within a few minutes, much to the disappointment of the local people.\n\nS. Dharmarj, chairman in-charge, presided over the meeting. As soon as the meeting commenced, the chairman in-charge, announced the adoption of all the 17 resolutions listed for the day. No discussion was held. As no Councillor evinced interest in raising any other issue at the meeting, the officials waited for a while and announced the adjournment of the meeting.\n\nThe local people complain that the regular meetings of the Narasingapuram Municipality of late have remained very brief for reasons not known. They urged Councillors of different parties to evince interest and take advantage of the municipal meetings to raise and discuss the issues confronting the local people.\n\nThe introduction of 14 new mini-buses to serve particularly the residents of villages situated on the hills of Yercaud, Kolli Hills, Pachamalai hills has brought much cheer to the tribal population. The Chief Minister Jayalalithaa recently flagged of the 14 mini buses allotted to the Salem region of the Tamil Nadu State Transport Corporation (TNSTC). Three mini buses have been introduced from Salem city to different villages in Yercaud hills.\n\nP. Saroja, MLA, flagged off the new service to Sorakkapatti village in Nagalur panchayat from Yercaud on Wednesday. Sorakkapatti village is getting bus facility for the first time. The people of the village have been demanding bus connectivity for a long and they celebrated the occasion by distributing sweets. The village accounted for daily workers and they abstained from their day’s work to accord reception to the first bus. Many of the villagers had come all the way to Yercaud town to travel in the first service to their village.\n\nAt a time when the political parties are busy campaigning for the Assembly elections, the Salem District Powerloom Workers Union have undertaken a campaign in a van in the rural areas to create awareness on the need for protecting the power loom industry. The members of the union have been visiting various areas urging both the Centre and the State Government to take effective steps for protecting the power loom units, setting up a textile market in Elampillai. The campaign has evoked good response in the rural towns and villages which accounted for a large number of power looms.\n\nSyed Muthahar Saqaf\n\nin Salem", 
    "section": "national", 
    "title": "When officials lock horns", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}