{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Encroachments on 3-km-long stretch have been cleared\n\nIn the month-long drive to widen the Adyar river, the Water Resources Department has so far improved the heavily encroached waterway for a stretch of three km, falling within the city limits.\n\nOf the total distance of 42 km, the river runs for 12 km from Manapakkam to the Adyar estuary. The department had identified nearly 10,000 encroachments to be removed on the riverbed. Officials of the WRD said the stretch between Nandambakkam MGR Nagar and Mallipoo Nagar near the estuary, which covers a distance of eight km, was found to be heavily encroached upon.\n\n“We have managed to remove encroachments in four locations including Anusuya Mandapam and MGR Nagar scattered over a distance of three km. On Thursday, we completed the clearing of over 1,000 structures in Aathma Nagar, Saidapet. Residents have been given alternative accommodation in Ezhil Nagar and Perumbakkam,” said an official.\n\nSo far, nearly 4,500 encroachments have been cleared along the waterway. The department has started the work to widen the river beneath the Maraimalai Adigal bridge since Friday.\n\nAt present, within the city limits, the river is only 30 metres to 50 metres wide. Once the widening work is completed, the river’s width will be increased manifold anywhere between 100 metres and 220 metres. The river can carry nearly two lakh cubic feet per second of water near the Saidapet bridge after the work. According to WRD, originally, the waterway was considerably wider near the estuary.\n\nHowever, the department is still struggling to remove encroachments in southern suburbs and near Saidapet and Adyar. “We have been able to clear encroachments only in four of the 15 identified locations. In many places, the drive has slowed down because of residents’ resistance like in Thideer Nagar, Saidapet. These structures had resulted in flooding near Manapakkam,” said an official. Meanwhile, the department is continuing to survey places eating into the riverbed to proceed with widening project.", 
    "section": "national", 
    "title": "WRD makes headway in widening Adyar river", 
    "subsection": "tamilnadu", 
    "date": "2016-02-14"
}