{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "here’s a painting revolution sweeping the city. But few would call it art despite its pervasiveness. Painted advertisements have created an alphabet soup of gigantic fonts all over the walls and medians in Tiruchi’s highways and inner roads.\n\nDoes this quiet colonisation of public space imply its easy availability to advertise a political gathering or a commercial product on the sly? Even as electronic communication and social media make the idea of physical billboards and hoardings redundant, why do the ‘painters’ persist in turning out such eyesores?\n\n“The Department of Town and Country Planning norms are concerned only about what goes into a building. There is no consideration of the exterior, especially the compound wall,” V. Vasudevan, president, Tiruchi Travel Federation, told The Hindu . “These are the aspects that would help the image of a city.”\n\nThe absence of norms has led to a chaotic scenario where flex boards and flags stuck all along the concourse of flyovers compete with medians whose zebra patterns as stipulated by Unified Traffic And Transportation Infrastructure (Planning and Engineering) Centre or UTTIPEC, have been painted over with political messages. It’s likely to get chronic as the elections get closer.\n\nIn places such as the Palakkarai bridge and the T.V.S. Toll Gate junction, sections have already marked out for political party announcements on the medians, making it difficult for motorists to judge the speed of the oncoming traffic.\n\nCampaigns by authorities and non-governmental organisations to beautify public places with artwork have not fared too well either, as public walls continue to function as unofficial rubbish tips and urinals. Only a fraction of the artistic paintings on the walls of the Mahatma Gandhi Memorial General Hospital building in Puthur survives untouched – on the inner stretches, they have either been papered over by political and community event posters or painted over with advertisements for products as diverse as TMT steel bars and life insurance.\n\n“Most tourists who visit Tiruchi prefer to stay indoors because they have been told that there is nothing to explore here,” said Mr. Vasudevan.\n\n“Their priority is to see the sights, which they do in a group, but not many go out for a walk to experience the city on their own. Tiruchi cannot really benefit from tourism in this manner,” he added.\n\n“Even in a venerated and much-visited city like Srirangam, there is no control on the painted walls. At least the authorities could enforce strict regulations on painting the walls of residential neighbourhoods and religious shrines,” said Mr. Vasudevan.\n\nVijaykumar Sengottuvelan, member, Indian Institute of Architects (IIA), said that doing away with the rampant painting would be “the least that we could do for the Swachch Bharat Mission. Cleanliness is not only about dealing with physical waste, but also visual pollution like this.”\n\n“Sometimes we see painted messages advertising events to be held two or three months later – which agency authorises these paintings, and why are they not governed by time limits, as private billboards are?” asked Mr. Sengottuvelan.\n\nHe added that efforts to beautify the city and regulate its traffic flow would be more enduring if the bureaucrats and political authorities included the technocrats and public in the decision-making process.\n\n“Once these four stakeholders are equally involved, the city administration can come up with innovative ideas to manage not just traffic, but also solving accessibility issues by floating design contests among the many educational institutions in Tiruchi,” he suggested.\n\n“Tiruchi’s size and pace of growth make it possible for corrective measures to be implemented easily,” said Mr. Sengottuvelan. “Among Tier II cities, Tiruchi has the highest literacy rate (according to the 2011 Census). So if anything is possible, it has to be here.”\n\nThe authorities could enforce strict regulations on painting the walls of residential neighbourhoods and religious shrines", 
    "section": "national", 
    "title": "A visual pollution sweeping the city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}