{
    "author": [
        "S Sundar"
    ], 
    "text": "NHRC member D. Murugesan, along with State govt officials, inspects Goripalayam Dargah\n\nNational Human Rights Commission will recommend to the Centre and all the State governments a comprehensive method of giving treatment to mentally-ill patients, including best practices adopted in various States, said panel member D. Murugesan.\n\nMr. Murugesan along with State Nodal Officer, District Mental Health Programme, C. Ramasubramanian, on Tuesday inspected the Goripalayam Dargah here, where hundreds of mentally-ill patients are brought for treatment through prayers.\n\n“All that we want to do is include a proper medical treatment at such places of worship without interfering with the religious faith,” Mr. Murugesan told The Hindu .\n\nThe trustees of the dargah, S.K. Syed Ahmed and S. Syed Babujohn, appealed to Mr. Murugesan to take up with the State government their demand to set up a clinic on the dargah premises with a psychiatrist, para medical staff and required drugs.\n\n“Proper medical treatment along with the prayers — dava and duva — will help expedite the cure of the mental illness,” he said.\n\nStating that under the Mental Health Act the mentally-ill persons picked up from roadside by the police and other authorities are produced before courts that order them for their admission in homes or hospitals for their treatment.\n\n“However, there is no mechanism to identify patients who get cured of their mental disorder and take them out of the homes or hospital. The cured people continue to languish there along with other patients,” Mr. Murugesan said. Such a practice makes their lives worse.\n\n“Besides, in many places mentally ill patients are put together with mentally-retarded patients,” he complained.\n\nStating that the dava-duva model of treatment introduced in Erwadi dargah had brought out desired results, he said many patients were coming back to the hospital there for periodical review.\n\nThe level of violence and inhumane way of restraining patients with chains have been done away with.\n\n“In one of the places of the worship in Tirunelveli, the organisers were not aware that they were giving medicines past expiry dates to the patients. This was because the medicines were not handled by a trained pharmacist. These kind problems could be overcome when the government establishes a clinic or hospital on the premises of the places of worship.\n\n“This will also spare the people of the pain of taking the mentally-ill patients to hospitals in far away places,” he said.\n\nDr. Ramasubramanian said that many trustees were ready to give land free of cost for setting up of hospitals on their premises.\n\nThe team also interacted with some of the patients who were visiting the dargah for their mental illness.", 
    "section": "national", 
    "title": "Accent on comprehensive treatment to mentally-ill", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}