{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "In a significant ruling, the Madras High Court Bench here has held that motor accident claims tribunals and appellate courts can award compensation higher than what has been claimed by the victims if there are justifiable reasons to order such enhanced amount.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran passed the order while dismissing an appeal preferred by an insurance company and enhancing from Rs. 25 lakh to Rs. 34.87 lakh the compensation awarded to a fisherman who had suffered 100 per cent disability.\n\nWriting the judgement for the Bench, Mr. Justice Kirubakaran said: “How an accident can play havoc in the life of a person could be well understood by this case… It is disheartening to note that the claimant suffered serious injuries in the accident leading to a vegetative status.”\n\nThe judge pointed out that the fisherman, L. Paulraj of Kanyakumari, was travelling in a mini lorry along with his fishing boat when the vehicle, driven in a rash and negligent manner, capsized on May 6, 2004, causing injuries all over his body, including spinal cord.\n\nThe victim, then 36, was operated for spinal fixation in Kerala Institute of Medical Sciences in Thiruvananthapuram. When the surgery was about to begin on May 11, he developed cardiac arrest in the theatre.\n\nHe was revived and the operation was conducted a week later.\n\n“The claimant is immobile and, therefore, he was unable to appear before the tribunal even for giving evidence,” the judge said, and went on to hold that the tribunal should not have confined the compensation to the claim of Rs. 25 lakh despite finding that he was eligible for more.\n\n“Irrespective of the claim made, what has to be awarded should be just and proper compensation. The award can be even more than the compensation claimed… Therefore, this court enhances the compensation to console and comfort the victim,” he pronounced.\n\nDirecting National Insurance Company to deposit Rs. 34.87 lakh in a nationalised bank, the judge ordered that the victim could withdraw Rs. 15 lakh immediately and leave the balance in a fixed deposit for at least three years and withdraw the interest alone once in three months.", 
    "section": "national", 
    "title": "“Accident victims can be awarded more money than their claim”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}