{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Kanimozhi flays government for not looking into complaints of college students\n\nThe ruling All India Anna Dravida Munnetra Kazhagam was keen on not implementing prohibition while women were totally against functioning of Tasmac liquor shops, DMK Rajya Sabha MP Kanimozhi said here on Tuesday.\n\nAddressing a consultative meeting of women cadre of the party, Ms. Kanmozhi, who is also DMK women’s wing secretary, said that alcohol consumption was disturbing peace in many families and leaving women in tears, but the AIADMK government was taking pride in not implementing total prohibition.\n\nMany breadwinners ruined their lives after spending all their hard earned money on liquor. Liquor shops were making several people alcohol addicts. Hence, it was the moral duty of all women to reach out to the public and make them realise the situation to ensure a massive victory for the DMK, which had promised to bring in total prohibition, if elected to power.\n\nDespite criticism from the AIADMK about the announcement on distribution of one kg rice for one rupee and loan waiver for agriculture farmers, DMK president M. Karunanidhi implemented the announcements during the previous DMK regime, she said.\n\nMs. Kanmozhi said that since the State government ignored complaints of students of SVS College in Villupuram district about lack of basic infrastructure facilities and collection of excess fees, three students of the college were found dead under mysterious circumstances.\n\nHad the State government enquired into their complaints in time, the tragic death of three young students would not have occurred, she said. Terming the AIADMK rule anti-people, she said that the government had never bothered about the welfare of the people. In several villages, old age pension and assistance for destitute widows were stopped. On industrial development, Tamil Nadu was pushed down to the 18{+t}{+h}position from the top three slot and employment opportunities were plummeting, she charged.", 
    "section": "national", 
    "title": "“AIADMK keen on not implementing prohibition”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}