{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Taking a closer look at the various facilities provided to commuters at Alandur Metro Rail and St. Thomas Mount suburban stations\n\nmong the largest stations on the Chennai Metro Rail system, Alandur has better access and adequate lighting compared to the other stations like Vadapalani, Koyambedu and Ekkatuthangal.\n\nSince it is centrally located, close to Kathipara intersection, it needs a pedestrian footpath and has done justice to this facility by providing enough space for it.\n\nFurther, there are three bus stops to various destinations for the convenience of passengers. At the ‘Asarghana’ bus stop, people who reach here can board city buses towards Tambaram and also long distance buses to rest of Tamil Nadu.\n\nHowever, like in other stations, Alandur too lacks a subway or a foot overbridge.\n\nThere is a subway but it is present only close to the service lane leading to Adambakkam. This has made it extremely difficult for passengers to cross the road at this intersection.\n\nA. Prabhakaran, a commuter said: “This is the third time that I am taking the Metro Rail. I like it, but they have to consider reducing the fare and also have a subway right outside the station. Otherwise, we are forced to walk for long time in the heat to get to the other side of the road.”\n\nAlso, for such a huge station created to be one of the hubs, it is essential to have adequate signages that it currently lacks.\n\nOfficials of Chennai Metro Rail Limited (CMRL) said they may have some more signages installed soon. Like in any other city location near a railway station, auto rickshaw drivers here too fleece passengers and refuse to ply by meter.\n\nHowever, the station lacks a subway or a foot overbridge for users to cross at\n\nthe intersection", 
    "section": "national", 
    "title": "Alandur station: a good example of integrated connectivity", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}