{
    "author": [
        "Special Correspondent"
    ], 
    "text": "(Top) Collector S. Natarajan at the gram sabha meeting at Athiyuthu in Ramanathapuram district on Tuesday; (Above)Collector S. Malarvizhi at the gram sabha meeting at Ladanenthal in Sivaganga district.\n\n(Top) Collector S. Natarajan at the gram sabha meeting at Athiyuthu in Ramanathapuram district on Tuesday; (Above)Collector S. Malarvizhi at the gram sabha meeting at Ladanenthal in Sivaganga district.\n\nCollectors of the two districts exhorted people to avoid open defecation and lead a healthy life by keeping the environment clean and hygienic as they addressed gram sabha meetings on the occasion of the 67th Republic Day celebrations on Tuesday.\n\nAddressing a grama sabha meeting at Athiyuthu village near here, Ramanathapuram Collector S. Natarajan said that the district administration was committed to creating all basic amenities for the people in villages and appealed to the villagers to avoid open defecation.\n\nThe district administration was willing to provide individual toilets for men and women, he said, and asked the people to cooperate with the district administration to totally abolish open defecation.\n\nPeople should keep the environment clean and hygienic and prevent spread of communicable and vector-borne diseases, the Collector said. Grama sabha meetings were held in 445 village panchayats in the district.\n\nAddressing a gram sabha meeting in Ladanenthal in Thirupuvanam block, Sivaganga Collector S. Malarvizhi asked the people to avoid open defecation and cooperate with the district administration in building individual toilets. She discussed with the people about removal of ‘Seemakaruvai’ trees and stressed the importance of leading a healthy life by keeping the sorroundings hygienic.\n\nThe State government accorded top priority for public health on the lines of giving importance to education, she said, and asked people to avoid use of plastics.\n\nEvery household should plant at least two trees to address the pollution problem, she suggested.\n\nThe villagers were free to approach the district administration for basic amenities and other developmental works. The grama sabha meetings were held in 429 villages in the district.\n\nAssistant Directors Kalyanasundaram (Ramanathapuram) and Vasanthi (Sivaganga) were present in the meetings.", 
    "section": "national", 
    "title": "Avoid open defecation, people told at gram sabha", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}