{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The order book of the Bharat Heavy Electricals Limited (BHEL), the public sector power plant equipment major, is improving with several new orders including orders secured for 800 MW power plants in Vijayawada and Krishnapatnam, said S.Gopinath, Executive Director, BHEL, Tiruchi, here on Tuesday.\n\nBHEL is also favourably placed in many upcoming power projects including the prestigious 2 X 600 MW EPC (engineering, procurement and construction) project in Bangladesh, he said addressing employees after unfurling the national flag during the Republic Day celebrations at the BHEL Township here.\n\nFor the past three years, BHEL has been consistently commissioning and synchronising around 10,000 MW every year giving a major boost to the nation’s installed power generation capacity. Unit II of BHEL’s High Pressure Boiler Plant has achieved a major success with the award of the prestigious ISO 50001 certification for its energy management system. A 5 MW solar power plant is also being set up at BHEL, Tiruchi. BHEL was also preparing to meet the challenges posed by strict emission norms notified for coal based thermal power plants, he said.\n\nOn technology front, Mr.Gopinath said cross piercing elongation process for the manufacture of seamless steel tubes has been stabilised in the Seamless Steel Tube Plant and business development efforts were being given a thrust in this product group. Technology development activities with respect to advanced ultra super critical boilers and coal gasification are also going on as per plan, he added.\n\nMr.Gopinath presented the BHEL Republic Day Awards to those who had excelled in various aspects of operations during the year. He took the salute at the ceremonial parade of 13 contingents including BHEL Security personnel, NCC cadets, Home Guards, Traffic Wardens, Fire Services personnel and campus school children.\n\nPageantry by the students of the Boiler Plant Nursery and Primary School, Vivekananda Elementary School, Sarada Middle School, BHEL Tamil Medium Middle School and the Boiler Plant Middle School and a light music concert were also held.\n\nEarlier, Mr.Gopinath unfurled the national flag at Arivalayam, BHEL’s Special School and Vocational Training Centre for differently-abled children and distributed sweets to the students.", 
    "section": "national", 
    "title": "BHEL getting several new orders", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}