{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Despite heavy odds, Bharat Heavy Electricals Limited (BHEL) has been able to secure substantial orders of over Rs. 28,000 crore during the financial year 2015-2016, according to K. Mysaiah, executive director of BHEL Ranipet.\n\nIn his address on the Republic Day, he said the market shrinkage had affected the top line and the highly competitive market has reduced the margins. But, despite heavy odds, orders of over Rs. 28,000 crore has been secured, he said, according to a press release. He earlier hoisted the national flag and inspected a parade on the occasion.\n\nThe company was favourably placed in some of the recent tenders, including a 2 x 660 MW project in Bangladesh, he said. Talking about the achievements of Boiler Auxiliaries Plant (BAP), Ranipet unit of BHEL, he said the unit has received orders for retrofitting of Electrostatic Precipitators (ESP) for 3 x 210 MW at Wankabori, Gujarat and 1 x 200 MW at Ukai, (Gujarat) thermal plants, he added.\n\nPunjab State Power Corporation Ltd has placed a repeat order for retrofitting of Air Pre Heater (APH) in a 210 MW unit for Ropar project. BAP Ranipet has executed ESP R & M works within a short time for Tuticorin unit-5, he added.\n\nThe unit had also manufactured the largest ever ID Fan rotors for Nabinagar project with a diameter of 2,660 mm and granted patent for “An improved system for monitoring ash level of electrostatic precipitators.”\n\nBAP Ranipet has filed 32 patents and copyrights during this financial year. So far, more than 275 productivity improvement projects have been completed this financial year.\n\nAmong the all units of BHEL, BAP Ranipet has won the trophy for Energy Efficient Unit 2015. BAP engineers have also bagged the BHEL Excel Award 2015 for a project titled “Design and develop high efficiency gate (99.95 %) for 800 MW boiler.”\n\nAs part of its social responsibility efforts, BAP has spent Rs. 10 lakh for flood relief efforts in Chennai.\n\nThe unit’s efforts towards improving education, safety and hygiene in schools continue this year.\n\nThey have identified seven projects to be completed this financial year including construction of computer lab and toilets benefitting more than 2,600 children at a cost of nearly Rs. 52 lakh, the release added.\n\nBAP Ranipet has filed 32 patents\n\nand copyrights\n\nduring this financial year", 
    "section": "national", 
    "title": "BHEL bags orders for over Rs. 28,000 crore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}