{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Mayor V.V. Rajan Chellappa hoisting the Tricolour in Madurai on Tuesday. (Below) Celebrations in ITBP camp at Iluppaikudi near Madurai.— Photo: S. James\n\nMayor V.V. Rajan Chellappa hoisting the Tricolour in Madurai on Tuesday. (Below) Celebrations in ITBP camp at Iluppaikudi near Madurai.— Photo: S. James\n\nThanking the Chief Minister Jayalalithaa for extending support for development of the city, Mayor V. V. Rajan Chellappa unfurled the national flag at the Anna Maaligai here on Tuesday.\n\nHe gave away ‘Amma’ awards to 50 best employees of the Corporation for their meritorious service to the public. Listing out the ‘achievements,’ including laying roads and providing drinking water, the Mayor said that the Corporation had rendered an ‘excellent’ service to the people on a war-footing at times of crisis.\n\nHe was optimistic of carrying out very many development works in the ensuing year which would give a facelift to the city. New bridges and widening of roads, replacing old markets from the city to outskirts were among the programmes, he read out.\n\nStudents from EVR Nagammaier, Kakkaipadiniyar and Thiru Vi.Ka higher secondary schools presented cultural programmes. Deputy Mayor K. Thraviam, Deputy Commissioner Shanthi, zone chairmen, city engineer Mathuram, city health officer Yasoda, councillors and and others participated.\n\nOrganisations\n\nVarious organisations, including educational institutions, service units, trade and industrial associations, celebrated the 67{+t}{+h}Republic Day with gaiety and enthusiasm on Tuesday. Apart from distributing sweets, they also gave the national flag stickers and exchanged R-Day greetings.\n\nThe Tamil Nadu Chamber of Commerce and Industry president N. Jegatheesan unfurled the national flag on the chamber premises and addressed the members. The Tamil Nadu Foodgrains Merchants Association Limited president S.P. Jeyapragasam hoisted the tricolour and spoke.\n\nThe Tamil Nadu Janata Dal state general secretary K. John Moses hoisted the national flag. In the presence of a large gathering of the students, Saraswathi Narayanan College Principal Dr. M. Kannan unfurled the national flag. Madurai Sivakasi Nadars Pioneer Meenakshi Women’s College at Poovanthi celebrated the republic day.\n\nProf. V.K. Rajamani was the chief guest. Principal C. Ramalakshmi presided.\n\nAt the Recruits Training Centre of Indo-Tibetan Border Police, the personnel celebrated the Republic Day with fanfare at Illupaikudi in Sivaganga district. The day-long events began with flag hoisting by Deputy Inspector General Austine Eapen.\n\nAmerican College Principal M. Davamani Christober hoisted the national flag and addressed the students.\n\nSBOA Matric. and Hr. Sec. School celebrated the day with Dr. Suja Rose, Asst. Professor, Dept. of Remote Sensing, Madurai Kamaraj University, as the chief guest.\n\nPrizes were distributed to winners and the names of recipients of President Police medal for gallantry and among others were read out. The Madurai Chapter of Southern India Regional Council of Company Secretaries of India in Association with Aravind Eye Hospitals and Lions Club of Madurai Victory and Thendral took a pledge to donated eyes as part of the R-Day celebrations.\n\nChairman P. Rajavel hoisted the national flag. Secretary Nagasundaram proposed a vote of thanks.", 
    "section": "national", 
    "title": "City celebrates R-Day with fanfare", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}