{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The poor condition of road linking Rangampalayam with Jeeva Nagar and Nalliampalayam roads in Erode has not been set right for long.— PHOTO: M. GOVARTHAN\n\nThe Rangampalayam residents are disappointed with the corporation for what they term as the undue delay in carrying out road repair works on the stretches linking Jeeva Nagar and Muthampalayam.\n\nAccording to Velmurugan, a businessman, the corporation has not kept its word on relaying the roads at the earliest after the culmination of rainy season.\n\nTo make things worse, there is no night lighting as well along the stretches.\n\nFaster and hassle-free movement of people between Rangampalayam on one side and Thindal and Sengodampallam on the other could be facilitated by setting right the roads.\n\nMore importantly, the need for motorists moving between these locations to take a circumlocutory route through the city could be obviated, and in the process, the traffic congestion could be reduced to some extent.\n\nLate last year, the Nalliampalayam bridge constructed at a cost of Rs. 1.3 crore was inaugurated for public use. There is a proper road till Muthampalayam Housing Unit, but, from there, the ride till Rangampalayam becomes tough. Likewise, the surface of the road from Rangampalayam to Jeeva Nagar is also gouged out at very many locations.\n\nThere are two colleges at Rangampalayam and several institutions of higher learning in and around Thindal, necessitating large-scale movement of people in both directions.\n\nBlacktopping of the roads and provision of street lights will go a long way in broad-basing urban transformation of the city, according to residents of localities surrounding Rangampalayam.\n\nAccording to Corporation sources, levelling of the two stretches would first be carried out shortly as a prelude to black-topping.", 
    "section": "national", 
    "title": "Civic body faulted for tardy pace of road repair works", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}