{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Records reveal that the SVS Education Trust, which administers the SVS Medical College of Yoga and Naturopathy and Research Institute, had fabricated records in a bid to get approval for its Homeopathy College in April 2011.\n\nThe Trust, after obtaining the State government’s No Objection Certificate in 2011 (and subsequently in 2013), had approached the Department of Ayurveda, Yoga & Naturopathy, Unani, Siddha and Homeopathy (AYUSH), a Central government agency, to seek approval for the Homeopathy course.\n\nHowever, in 2011, visitation teams were taken aback to find that though on record the college claimed to have six classrooms, it had only one . There were only 11 teachers against the requirement of 43 and only 15 hospital staff against the required 50. In terms of equipment, only 217 were available and not the required 470. The visitation teams also found serious discrepancies in the appointment letters issued to the teachers as the institution was unable to support their presence with attendance registers. The joining letters given by 13 staff were without signature.\n\nBased on these findings, AYUSH denied approval to the college. However, the Trust challenged this in the Madras High Court.\n\nPassing orders in July 2012, Justice K Chandru had dismissed the Trust’s petition citing the Supreme Court’s order in the AICTE Vs V Surinder Kumar Dhawan case which held that “the court has got no power to interfere with the decision by expert bodies.” Thereafter, the Trust filed multiple petitions against AYUSH, the last of which was settled as recently as August 2015.\n\nIn one case, a Division Bench had, in November 2013, directed AYUSH to consider the Trust’s application and pass orders on merits, within two weeks. Acting on this, the AYUSH once again rejected the Trust’s application for approval citing certain deficiencies and shortcomings. The High Court had set aside AYUSH’s decision but the department in a subsequent proceeding held on to its view that the college did not deserve to be approved.\n\nIncidentally, in November 2014, the court directed the Tamil Nadu Dr MGR Medical University to include the college for single window counselling that year but the university appealed against it.\n\nIn July last year, the SVS Trust filed a contempt petition against AYUSH, which was disposed of as the department had by then gone on appeal against the High Court’s order setting aside the denial of approval for the college. Finally in August last, the court directed AYUSH to conduct a fresh inspection of the college and pass appropriate orders on merit after hearing out the college. But the judges made it clear that this court order would not give right to the college to admit students.\n\nVisitation teams in 2011 found serious discrepancies based on which approval was denied", 
    "section": "national", 
    "title": "College fabricated records for AYUSH approval", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}