{
    "author": [
        "Special Correspondent"
    ], 
    "text": "105 beneficiaries get cheques for Rs. 67 lakh during the celebrations\n\nDistributing of welfare measures to the needy and the poor, honouring of freedom fighters and recognising of 123 government employees for meritorious service marked the Republic Day celebrations here on Tuesday.\n\nUnfurling the national flag, Collector G. Veeraraghava Rao took the salute and inspected a guard of honour presented by police, NCC cadets and others at Armed Reserve Police Grounds. He was accompanied by Superintendent of Police Vijayendra S. Bidari.\n\nThe Collector gave away welfare measures to the tune of Rs 67.05 lakh to 105 persons. Inspector General of Police (South Zone) S. Murugan, Commissioner of Police Shailesh Kumar Yadav, DIG of Police (Madurai Range) Anand Kumar Somani, DCPs Bandi Gangadhar, A.G. Babu, Additional Collector Rohini Ramdas and others participated.\n\nAs many as 65 police head constables received Chief Minister’s medal. Freedom fighters were presented with shawls. Ex-servicemen, elderly women and widows were given financial assistance.\n\nStudents numbering 1,467 from Lady Doak College, Srikala Kendra Cultural Academy, Yadava College, Noyes Matric HSS, Capron Hall HSS and Pappanayakanpatti Sri Kandasami HSS presented cultural programmes.\n\nGram sabha\n\nPresiding over a gram sabha meeting at Veerusankulam near Tirumangalam , the Collector urged the residents to ensure that individual toilets were built in their houses.\n\nHe appealed to parents to send their wards to schools as education alone would instil confidence in their children and help in shaping responsible citizens.\n\nThe government provided a lot of assistance to the needy, and the people should utilise the opportunities, he said. Mr. Veeraraghava Rao assured to the villagers that he would look into their grievances, including non-issuance of old age pension. People had the responsibility to keep their surroundings clean and there was a growing need to stop using plastics, he said.\n\nTirumangalam MLA M. Muthuramalingam, Additional Collector Rohini Ramdas, Assistant Collector (Training) Gilli Chandrasekar, Joint Director (Agriculture) S. Kanagaraj and elected representatives from village panchayats participated.\n\nAn official press release said that gram sabha meetings were held in all village panchayats in the district to mark the Republic Day.", 
    "section": "national", 
    "title": "Distribution of welfare measures marks R-Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}