{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Announcement shocks Congress leaders as PCC chief is likely to seek re-election from there\n\nEstranged senior Congress MLA and former Minister Theni C. Djeacoumar on Tuesday declared that he would contest in Villianur constituency as Congress party candidate and would also field his supporters in Mangalam and Ossudu constituencies.\n\nMr. Djeacoumar has been avoiding the party platforms in the recent past citing personal reasons. His overture towards the ruling AINRC raised many eyebrows a few months ago. He is presently representing the Mangalam constituency.\n\nAfter holding a meeting with his supporters at Villianur on Tuesday, Mr. Djeacoumar stated that his supporters strongly urged him to contest in the Villianur constituency.\n\n“I have support base in both Mangalam and Villianur constituencies. Hence I decided to contest in the constituency this time. As I continue to be in the Congress party, I will contest as Congress candidate only in Villianur and will field my supporters in Mangalam and Ossudu,” he said.\n\nThe declaration of Mr. Djeacoumar to contest in Villianur which is held by the Pradesh Congress Committee (PCC) party president A. Namassivayam shocked several leaders in the party. Mr. Namassivayam is likely to seek re-election from the constituency.\n\nHowever Mr. Djeacoumar said generally PCC presidents didn’t contest in elections. “Hence I wish to contest in that constituency. I expect the seat will be given to me,” he said.\n\nMr. Djeacoumar was first elected as an MLA of Tamil Maanila Congress in 1996 from Villianur constituency and was the Local Administration Minister in the DMK- TMC Alliance Government headed by then Chief Minister R.V. Janakiraman during 1996-2000. Again, he became the Local Administration Minister in the Congress-TMC Alliance Government headed by Chief Minister P. Shanmugam for a period of six months.\n\nHowever, Mr. Djeacoumar continued to be the TMC (Moopanar) party president in the Union Territory, although the TMC merged with the Congress in 2001 in Tamil Nadu. In 2006, he joined the ruling Congress in the presence of the PCC leader Shanmugham and Chief Minister N. Rangasamy.\n\nHe was elected again as Congress MLA from Mangalam constituency in 2011.\n\nAnnouncement shocks Congress leaders as PCC chief is likely\n\nto seek re-election\n\nfrom there", 
    "section": "national", 
    "title": "Djeacoumar declares willingness to contest in Villianur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}