{
    "author": [
        "Staff Reporter"
    ], 
    "text": "RELIGION\n\nCovai Kamatchipuram Adheenam: Ulaga Samadhana Peruvizha, 7 p.m.\n\nSubramanya Swamy Temple: Thai poosam pujas, Marudhamalai, 9 a.m.\n\nArulmigu Bala Dhandayudhapani Swamy Temple: Thaipoosam pujas,Sukrawarpet, 7.30 a.m.\n\nArulmigu Rathina Vinayagar Temple: Sankatahara Chathurthi pujas, RS Puram, 6.30 p.m.\n\nCULTURE\n\nSri Thyaga Brahma Gananjali: Music Festival, Sri Venugopalaswamy Temple, 6 p.m.\n\nGENERAL\n\nCoimbatore Municipal Corporation High School and Higher Secondary Schools old students association: prize distribution to students and felicitation to school principals, R.S. Puram Corporation Girls Higher Secondary School, 4 p.m.\n\nKarunya University: Conference on Canadian studies, Elohim Auditorium, 10 a.m.\n\nSri Kalaivani College of Education: Citizenship Training Camp, 8:30 a.m.\n\nKarunya University: Workshop on Laboratory Quality Control, 10 a.m.\n\nDr. G.R. Damodaran College of Science: Blood donation camp, RD hall, 10 a.m.\n\nMaharaja Arts and Science College: Awareness programme on financial planning, 10 a.m.\n\nBharatiya Vidya Bhavan: Talk on ‘Kongu Nattu Perungadai’, R.S.Puram, 6 p.m.\n\nPioneer College of Arts and Science: Inauguration of Internal Quality Assurance Cell, 10 a.m.\n\nGRG School of Management Studies: Talk on ‘Freedom, Choice and Responsibility,’ 2 p.m.\n\nPPG Institute of Technology: Workshop for diploma students on ‘Hands on Training on PLC,’ 9:30 a.m.\n\nNative Angels Network & Native Lead Foundation: Launch of Native start-up circle, PSG College of Technology, 11 a.m.\n\nUDHAGAMANDALAM\n\nTata Institute of Fundamental Research: Talk on Cosmic Rays, Anna stadium, 2 p.m.\n\nCoimbatore Institute of Management and Technology: Entrepreneurship awareness camp, Providence College for Women, Coonoor, 9:30 a.m.", 
    "section": "national", 
    "title": "Engagements. Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}