{
    "author": [
        "S P"
    ], 
    "text": "V. Sampath, Salem Collector, honouring a freedom fighter at the Republic Day celebrations at Mahatma Gandhi stadium in Salem on Tuesday. (right) V. Dakshinamoorthy , Namakkal Collector, handing over certificate for meritorious services at the celebrations in Namakkal.- Photos: E. Lakshmi Narayanan and Special Arrangement\n\nDistribution of welfare assistance, spectacular parade by police personnel and honouring of freedom fighters marked the 67th Republic Day celebrations at Mahatma Gandhi stadium here on Tuesday.\n\nThe celebrations began with Collector V. Sampath unfurling the National Flag and accepting the guard of honour. As a symbol of peace, white doves and white balloons were released, and it was watched by over 4,000 people, government officials and students.\n\nAs many as 150 freedom fighters were honoured and 139 government officials of various departments were presented certificates for their outstanding services. Seventy-one police personnel were presented the Chief Minister's medal for their service. The Collector handed over welfare assistance of various departments to 14 persons totalling Rs. 63.92 lakh.\n\nA total of 681 students from seven schools danced to patriotic songs.\n\nDeputy Inspector General of Police, Salem Range, Vidya D. Kulkarni, City Police Commissioner Sumit Sharan, Superintendent of Police G. Subbulakshmi and officials from various departments participated.\n\nMayor S. Soundappan hoisted the National Flag on the Corporation premises in the presence of Corporation Commissioner K.R. Selvaraj. Cultural programmes were held.\n\nNamakkal\n\nIn Namakkal district, Collector V. Dakshinamoorthy unfurled the National Flag at the District Sports Stadium and accepted the guard of honour.\n\nHe distributed welfare assistance to the tune of Rs. 1.74 crore to 356 persons .\n\nAs many as 25 police personnel received the Chief Minister’s award while 23 senior personnel received certificates for their outstanding services. Also, 88 government officials from various departments were honoured for their services. The canine sleuths of the police dog squad exhibited their skills and received applause from the crowd. As many as 630 students from seven schools performed cultural shows. Superintendent of Police S. R. Senthilkumar, officials from various departments participated.\n\nLikewise, Republic Day was celebrated at Government Higher Secondary School in Athanur and in other educational institutions and establishments.", 
    "section": "national", 
    "title": "Freedom fighters honoured", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}