{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector T.N. Hariharan and Collector N. Venkatachalam (right) inspecting the police parade during the Republic Day celebrations in Dindigul and Theni respectively on Tuesday.— Photo: G. Karthikeyan\n\nWelfare aid worth Rs.76.35 lakh given to 191 beneficiaries in Dindigul district\n\nHoisting the national flag, distribution of welfare aid, honouring freedom fighters and presentation of seva medals and merit certificates to officials and police personnel marked the Republic Day celebrations in Dindigul and Theni districts on Tuesday.\n\nDindigul Collector T.N. Hariharan hoisted the national flag and took the salute from police personnel at the District Sports Stadium at 8 a.m.\n\nLater, he inspected the parade of the armed reserve police personnel and NCC cadets and honoured freedom fighters with shawls.\n\nBesides, 33 police and fire and rescue services personnel and 167 government officials were honoured with merit certificates for their outstanding service.\n\nWelfare aid worth Rs.76.35 lakh was given to 191 beneficiaries, including self-help groups, unemployed youths, differently abled persons, and poor and destitute women.\n\nMore than 350 students from Annamalaiyar Girls MHSS, MSP HSS, Vasavi MHSS, St. Joseph’s HSS, Government HSS in Kasipalayam and Akkaraipatti and SSM MHSS presented cultural programmes.\n\nDistrict Judge R. Poornima, District Revenue Officer A.M. Nagendran and Superintendent of Police A. Saravanan participated.\n\nDistrict Principal-cum-Sessions Judge R. Poornima hoisted the national flag at Dindigul Court Complex and Sub Judge R. Sathia Thara hoisted the flag at Vedasandur Court.\n\nTheni\n\nCollector N. Venkatachalam hoisted the national flag and took the police salute at the District Sports Complex.\n\nHe inspected the parade taken out by the armed police and NCC cadets and honoured freedom fighters.\n\nThe police, fire and rescue services personnel and the government officials, who performed exceedingly well in the district, were honoured with medals and certificates.\n\nHe distributed welfare assistance worth Rs.50.33 lakh to 248 beneficiaries and honoured 656 officials with certificates recognising their outstanding work.\n\nFlag Day collection\n\nCollector N. Venkatachalam was honoured with the governor’s medal for achieving the highest Flag Day collection. Superintendent of Police J. Mahesh took part in the celebrations.\n\nStudents from seven schools presented an eye-catching cultural programme. At Theni Government Medical College, college dean T. Thirunavukkarasu hoisted the national flag and honoured the best performing staff in the college and hospital.", 
    "section": "national", 
    "title": "Freedom fighters honoured, awards for meritorious service presented", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}