{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Promoting Participation:Collector M. Karunakaran participating in the gram sabha meeting at Narasinganallur near Tirunelveli on Tuesday.— Photo: A. Shaikmohideen\n\nGram Sabha meetings were organised in all the 425 village panchayats in the district on Tuesday as part of the 67th Republic Day celebrations.\n\nBesides getting approval for the already executed development projects in the villages, the meetings discussed in detail schemes to be implemented during this fiscal. The villagers were urged to construct toilets in every house with the subsidy of Rs. 12,000 to avoid open defecation and maintain sanitary complexes clean and tidy.\n\nThe State and Central governments’ welfare schemes, especially assistances being extended to self-help groups, entrepreneurs, rural families with women as heads, rural drinking water schemes, subsidy for sinking deep borewells, Mahatma Gandhi National Rural Employment Guarantee Scheme, ‘Puthuvaazhvu Thittam’, etc. were explained in detail.\n\nExpenditure for the previous fiscal and the current fiscal were placed before the villagers for their approval.\n\nCollector M. Karuanakaran participated in the gram sabha meeting held at Narasinganallur in which Assistant Collector (Training) K.P. Karthikeyan, MPs S. Muthukaruppan, K.R.P. Prabhakaran and Vijila Sathyananth, MLA Nainar Nagenthran and senior government officials participated.\n\nNagercoil\n\nCollector Sajjan Singh R. Chavan participated in the gram sahba meeting held at Elluviali in Rajakkalmangalam block in the district on Tuesday.\n\nThe meet discussed the rural local body’s expenditure, distribution of drinking water, removal of acacia trees, sanitation, Mahatma Gandhi National Rural Employment Guarantee Schemeetc.\n\nAfter receiving petitions, Mr. Chavan said the public should utilise the subsidy being given for constructing individual household toilets to avoid open defecation and appealed to the participants to keep their surroundings clean by removing discarded materials so as to avoid breeding of mosquitoes.\n\nHe urged the public to actively participate in the electoral process by casting their votes in all elections, especially in the forthcoming Assembly polls. Officials of various government departments participated in the meeting.\n\nCollectors urge the villagers to construct toilets with the subsidy of Rs. 12,000 to avoid open defecation and for maintaining clean surroundings", 
    "section": "national", 
    "title": "Gram sabha meetings discuss executed and proposed projects", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}