{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector S. Natarajan honouring a freedom fighter at the Republic Day celebration in Ramanathapuram on Tuesday. — Photo: L. Balachandar; (right) Collector S. Malarvizhi inspecting the guard of honour in Sivaganga while Superintendent of Police Ziaul Haque looks on.\n\nAll schools and colleges celebrated the day by hoisting the national flag and distributing sweets\n\nCultural events, disbursement of welfare assistance, distribution of medals, and gram sabha meetings marked the 67th Republic Day celebrations in Ramanathapuram and Sivaganga districts on Tuesday.\n\nThe celebrations began with Collector S. Natarajan unfurling the national flag at the Armed Reserve Police Grounds here and Collector S. Malarvizhi hoisting the tricolour at the Collectorate Complex in Sivaganga.\n\nHundreds of school students and general public gathered to witness the ceremony in the two district headquarters as the Collectors, accompanied by Superintendents of Police N. Manivannan (Ramanathapuram) and Ziaul Haque (Sivaganga), inspected and accepted the guard of honour, presented by Armed Reserve Police.\n\nThe Collectors honoured freedom fighters, distributed Chief Minister’s medal to police personnel and certificates to employees of various government departments and representatives of voluntary organisations in recognition of their meritorious services.\n\nThe Collectors also distributed welfare assistance to the poor and the downtrodden. Mr. Natarajan distributed welfare assistance of Rs. 20.25 lakh to 76 beneficiaries, while Ms. Malarvizhi distributed welfare assistance to the tune of Rs. 34.54 lakh to 331 beneficiaries.\n\nDistrict Revenue Officers Ali Akbar (Ramanathapuram) Ilango (Sivaganga), Sivaganga MP P. R. Senthilnathan, Ramanathapuram District Panchayat Chairman M. Sundarapandian were present on the occasion.\n\nLater, Mr. Natarajan chaired a grama sabha meeting at Athiyuthu in Ramanathapuram block and Ms. Malarvizhi at Ladanendal in Thirupuvam block.\n\nPrincipal District Judge M.D. Sumathi unfurled the tricolour at Ramanathapuram District Court. Court staff, Bar Association president K. Gunasekaran and secretary M. Somasundaram were present.\n\nAlagappa University\n\nAt Alagappa University in Karaikudi, Vice-Chancellor S. Subbiah hoisted the national flag and accepted the guard of honour given by the students and security staff.\n\nAll schools and colleges in the two districts celebrated the day by hoisting the national flag and distributing sweets.", 
    "section": "national", 
    "title": "Grand Republic Day celebrations in Ramnad, Sivaganga districts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}