{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The 9.92 acres of land worth Rs. 173 crore was sold for just Rs. 5 crore\n\nA dubious transaction in which about 9.92 acres of land situated in prime locality of Chennai and worth Rs. 173 crore (as per the guideline value) was sold for a sham consideration of Rs. 5 crore, has been set aside by the Madras High Court.\n\nAllowing the plea to set aside the land transaction moved by Asset Restructuring Company (India) Private Limited, a financial institution based in Mumbai, Justice M.M. Sundresh made it clear that the order will not stand in way of the parties in approaching appropriate forum, as only the legal issues in the petition are dealt with.\n\nMortgaged to Indian Bank\n\nAccording to the petitioner, in 1992 Indian Bank, Chennai, had extended various financial facilities to a Chennai based MVR Group companies.\n\nAs a security, the company mortgaged immovable properties to an extent of 9.92 acres situated in Alandur village, Chennai.\n\nAs the borrowers defaulted in repayment of loan amount, in 1996 the bank moved several applications before the Debts Recovery Tribunal against MVR Group. The mortgaged property was also taken into possession by the bank.\n\nSubsequently, in 2007 the bank assigned the secured property to the petitioner under the provisions of Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act (SARFAESI), 2002 to recover the loan amount.\n\nIn the meantime, the original owners of the property K.S. Deenadayalu Reddy and K. Venkatakrishnan executed a power of attorney in favour of S.P. Velayutham (who was the VCK candidate for Villupuram constituency in 2009 Lok Sabha election) to deal with the property which was already mortgaged with the bank.\n\nThe petitioner alleged that though the power of attorney does not grant the right to sell the property, Mr. Velayutham somehow managed to sell the property to his son Amar for a consideration of Rs. 5 crore.\n\n“Further, a settlement deed was executed by Amar in favour of his father Velayutham which was registered on October 13, 2008,” the petitioner said.\n\nAlleging that all the four persons have conspired and colluded with each other to execute the transactions to set up a false claim on the title of the mortgaged property, the petitioner sought the court to stay the operation of the transactions and direct the Sub Registrar Alandur to set aside the sale deed.\n\nS.P. Velayutham, VCK functionary, used power of attorney to sell the property to his son", 
    "section": "national", 
    "title": "HC sets aside sale of prime property in Alandur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}