{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Residents attribute problem to water stagnation in stormwater drains\n\nThe claims of Chennai Corporation that mosquito density across the city is not high does not line up with reports from residents across the city. Residents of various areas, including T. Nagar, Mogappair, Arumbakkam, Mylapore, Chintadripet and Adyar, complain of high mosquito density.\n\n‘Fogging a must’\n\nT. Nagar resident Jayaraman said stormwater drains were the source of mosquito breeding.\n\n“Water remains stagnant in stormwater drains. The mosquito density has increased exponentially. The Corporation’s workers are not coming to each flat.\n\n“They should come regularly. Fogging is required to control high mosquito density throughout T. Nagar,” said Mr. Jayaraman.\n\nResidents of T. Nagar have requested the civic body to clear the water stagnating in each of the stormwater drains to prevent any outbreak of vector-borne diseases.\n\nHowever, the Corporation is blaming residents for the rising mosquito density. It attributes the problem to the presence of mosquito breeding sources in households.\n\nBreeding sources\n\nIn a survey conducted recently, Corporation workers found as many as 10,470 houses across the city to be having mosquito breeding sources.\n\nAccording to the data compiled by the Public Health Department of Chennai Corporation in January, 3,326 workers checked at least 21,73,051 households in January for mosquito breeding.\n\nA total of 14,991 of the 56 lakh containers screened in these houses were said to be contributing to mosquito density.\n\nCorporation Councillor P.V. Tamil Selvan said that each of the wards should have a vehicle-mounted fogging machine to check the mosquito menace.\n\n“We have only two vehicle-mounted fogging machines for the entire zone of Ambattur. “Handheld fogging machines are also not used properly,” said Mr. Tamil Selvan.\n\nMogappair resident Santhosh Anto of ward 91 said Corporation workers had not carried out source reduction in their neighbourhood.\n\nOfficials say cases of vector-borne diseases have\n\ncome down\n\nin January", 
    "section": "national", 
    "title": "Households blamed for rise in mosquito density", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}