{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kudankulam Nuclear Power Project (KKNPP), which has so far spent over Rs. 8 crore under its Corporate Social Responsibility programme, has decided to give diesel-operated garbage collection vehicles to the villages surrounding the project site, Site Director R.S. Sundar has said.\n\nDelivering his Republic Day address at KKNPP’s Anu Vijay Township on Tuesday, Mr. Sundar said the KKNPP had spent over Rs. 8 crore for constructing school buildings and providing clean drinking water by installing reverse osmosis plants at schools in the villages around the project site.\n\nAs part of Prime Minister’s ‘Swachh Bharath Mission’, diesel-operated garbage collection vehicle that had already been given to Kudankulam panchayat would be provided to all neighbouring villages shortly.\n\nGadgets\n\nWith the help of Artificial Limbs Manufacturing Corporation of India (ALIMCO), a survey on physically challenged persons had been carried out and about 70 beneficiaries would shortly receive gadgets that would improve their quality of life.\n\nUnder KKNPP’s Neighbourhood Development Programme, Tamil Nadu Water Supply and Drainage Board (TWAD) was implementing a drinking water scheme, costing around Rs. 60 lakh, for providing Tamirabharani water to 13 village panchayats in Radhapuram taluk.\n\n“I would like to make it clear that neither the KKNPP nor Anu Vijay Township will be the beneficiaries of this scheme as water to be pumped by TWAD Board under this scheme will be supplied only to the villages near our site,” Mr. Sundar said.\n\nAs part of Phase I of Neighbourhood Development Programme, 5,000 beneficiaries in 13 village panchayats in Valliyoor and Radhapuram blocks had been allotted houses and the construction work was in full swing.\n\nIn Phase II, the remaining 32 villages of Radhapuram and Vallioor blocks would get benefitted by covering 5,000 more beneficiaries, he also said.\n\nH.N. Sahu, Station Director, KKNPP – Units 1 and 2, P.A. Pillai, Project Director, KKNPP – Units 3 and 4, Jayakrishnan, Chief Construction Engineer, KKNPP 3 and 4, D. Thanasekaran, Additional General Manager, KKNPP, Ivanisov, Head of Russian Specialists Group, Atomstroyexports, and D. Shukla, Deputy Commandant, Central Industrial Security Force, KKNPP, were present.", 
    "section": "national", 
    "title": "KKNPP to provide garbage collection vehicles to villages", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}