{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Sankatahara Chathurthi puja, Railway Colony, 6.30 p.m.\n\nThiruvalluvar Mandram: Anniversary celebrations, Saktivelammal Trust discourse by Rm. Ilakuvan on ‘Valluvam’ prize distribution by industrialist C. Balakrishnan, 4 p.m., Discourse on ‘Sekkilar Pillai Peravai’ by T. Arunachalam, S.S. Colony, 5 p.m.\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPaneeru Thirumurai Mandram: Thiruvasagam Mutrodal by M. Balasubramanian, 7 a.m., Thirupugazh Isai, Adi Street, 6 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 169{+t}{+h}Sri Thyagaraja Aradana Utsavam, Mangala isai 5 p.m., young artists concerts, Lakshmi Sundaram Hall, 5.30 p.m.\n\nSathguru Srimath Thyagabrahmma Aradhanai Mahotsava Samithi: 169{+t}{+h}aradana celebration of Thyagaraja Swamigal, ganapathi homam, Sita Kalyanam by Sri Ramananda Saraswathi Swamigal, 6 a.m. to 2 p.m., Sri Rama Pattabishekam by Nannilam V. Rajagopala Ganapathigal, Seshu Mahal, Satya Sai Nagar, 6.30 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nMadurai Kamaraj University: Inauguration of three-day national training programme on ‘Climate change news coverage for aspiring and young vernacular media persons,’ Syndicate members Dr. V. Venkatraman and Dr. M. Ramakrishnan address, Dr. A. Muthumanickam, Registrar, presides, seminar hall, Faculty Guest House, 10 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: Interactive meeting on ‘Insurance known and unknown,’ N. Rengarajan, Senior Divisional Manager, United India Insurance, speaks, Maditssia Hall, 5.30 p.m.\n\nCentre for Advocacy and Research: Legal awareness on NALSA schemes 2015 for MARPs, Principal District Judge C. Raghavan, chief guest, Paalam Centre, Gandhi Nagar, 11 a.m.\n\nLions Club of Madurai City: 14{+t}{+h}monthly meeting, Dr. M. Gnanapoongothai of Thiagarajar College speaks on ‘Ennathin Valimai,’ Hotel Arasan Sapthagiri, Anna Nagar 80ft Road, 7 p.m.\n\nSaraswathi Narayanan College: Public viva-voce, 9 a.m. and 11.30 a.m.\n\nMannar Thirumalai Naicker College: Department of Business Administration conducts ‘Mime-show on consumer protection,’ Moorthy Naidu Andalammal Seminar Hall, 12 noon.\n\nSBOA Matric Higher Secondary School: Inauguration of seven-day NSS camp, J. Angelo Irudayasami, Chief Education Officer, chief guest, J. Joseph Stalin, correspondent, presides, Melakuyilkudi community centre, 3 p.m.\n\nTOPKIDS: Counselling at All Women Police Station, Tallakulam, 10.30 a.m., workshop on ‘Training the trainers,’ Sacred Heart Nursing College, 9 a.m.\n\nAlcoholics Anonymous: Meeting, Dheep Hospital, K. Pudur, 7 p.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, A. G. Church, near State Bank, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}