{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "here has been a persistent demand from the people of western and central districts for additional trains in the Tiruchi – Bengaluru section via Salem and also direct train service connecting Salem and Tiruchi.\n\nSpeaking at the Republic Day celebration held at Railway ground on Tuesday, Divisional Railway Manager Shubhranshu said that the Salem Railway Division has submitted a proposal to the Railway Board for overnight express train in the Tiruchi – Bengaluru section via Vridhachalam and Salem. The division has also submitted proposals for running passenger trains from Salem to Thanjavur, Salem to Madurai, both via Karur, and for extension of Tiruchi - Karur passenger up to Salem.\n\nThe division had also submitted a proposal for a day time train express train to Chennai Egmore from Salem via Attur and the Railway Board has already responded favourably to this proposal.\n\nReferring to the performance of Salem division, Mr. Shubhranshu said that the division has performed better than last year from April to December, as the passenger earnings have increased by four per cent from Rs. 340 crore to Rs. 355 crore.Due to strict implementation of austerity measures, the division’s expenditure has come down from Rs. 761 crore to Rs. 670 crore. Though there was a slight slump in punctuality to 86 per cent from April to November 2015, during December, 2015, it was brought back to 90 per cent, he added.\n\nHe said the division continued to focus on green initiatives by installing solar PV panels of 2.88 kw capacity at Tirupur and solar water heaters at Coimbatore, Tirupur, and Salem junction passenger retiring rooms. On the security aspects, he lauded the role played by the RPF. He said the newly constructed hospital building in Erode will be opened shortly. About 50 new quarters have been constructed and ready for allotment at Attur and Karur.\n\nMr. Shubhranshu, for the first time, handed over commendation certificate and cash award to five employees in recognition of their exemplary service.", 
    "section": "national", 
    "title": "New train services proposed in Salem Railway Division", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}