{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Human rights had assumed several dimensions in recent times and it was the responsibility of activists and the media to highlight violations in any form, especially violation of rights of women and children, said D. Murugesan, Member, National Human Rights Commission (NHRC) on Tuesday.\n\nAddressing the centenary celebrations of former Supreme Court Judge V. R. Krishna Iyer organised by the Society for Community Organisation (SOCO) Trust here, Mr. Murugesan elaborated how human rights had assumed new dimensions in the fields of health and education. Right to proper treatment was an inalienable human right and wasteful and unwanted expenditure was a violation.\n\nHuman rights activists should take up the issue of strict implementation of the Right to Education Act from the Kindergarten level in all schools. Similarly, they should not rest with the rescue of bonded labour but ensure that the liberated workers were properly rehabilitated and enjoyed all their rights.\n\nHe urged non-governmental organisations to create awareness of human rights among people and make the fight against violations participatory even while assuring human rights defenders that the NHRC would always stand by them. The former Chief Justice of the Delhi High Court recalled that it was Krishna Iyer who gave a definition for human rights.\n\nMr. Murugesan also presented the Justice V. R. Krishna Krishna Iyer Award for Social Justice and Human Rights Crusade to 32 persons on the occasion.\n\nThe awardees included former Additional Chief Secretary Qudsia Gandhi, Henri Tiphagne, Executive Director, People's Watch; C. Ramasubramaniam, State Nodal Officer, District Mental Health Programme; N. Markandan, former Vice-Chancellor, Gandhigram Rural Institute; S. P. Udayakumar, Convener, People's Movement Against Nuclear Energy; Gabriele Dietrich of the National Alliance for People's Movement and B. Thirumalai, writer.\n\nMs. Qudsia Gandhi dedicated her award to the unsung, unseen and fearless heroes who helped people during the recent Chennai floods.\n\nMr. Henri appealed to the Chief Justice of the Madras High Court to intervene in the issue of suspension of Madurai advocates and said that there should be talks to revive the good relationship between the Bench and the Bar.\n\nA. Mahaboob Batcha, Managing Trustee, SOCO Trust, said that 100 people from all over the country had been chosen for the award. It was presented to 32 awardees in Chennai and the Madurai function would be followed by similar functions in Ernakulam and Delhi. M. Salihu, former Vice-Chancellor, Madurai Kamaraj University, proposed a vote of thanks.", 
    "section": "national", 
    "title": "“Onus on activists and media to highlight rights violations”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}