{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students perform at the Republic Day celebrations and a police contingent stages a march past in Vellore on Tuesday.— Photos:C. Venkatachalapathy\n\nWelfare assistance, medals and certificates of appreciation given on the occasion\n\nFlag hoisting, parade by police personnel, colourful performances by students and, cleanliness drive marked the Republic Day celebrations on Tuesday. The day was celebrated with fervour at various government establishments and educational institutions.\n\nCollector R. Nanthagopal hoisted the tricolour, and went on to distribute government welfare assistance worth more than Rs. 53 lakh on the occasion. He presented the Chief Minister’s medals to 40 police personnel and handed over appreciation certificates to 101 government officers in recognition of their services. He also honoured freedom fighters on the occasion.\n\nAmong various welfare schemes, he distributed cheques worth Rs. 3.25 lakh to four persons under the Chief Minister’s Public Relief Fund through the revenue department, Rs. 19,000 to eight beneficiaries under CM’s Farmers Security Scheme, scooters to three differently abled persons through the District Differently Abled Welfare Office and Rs. 1.80 lakh to six women Self Help Groups through Pudhu Vaazhvu Thittam.\n\nThe assistance was provided to a total of 81 beneficiaries. Cultural performances of 650 students from various schools were among the highlights during the celebrations. The first prize went to Government Higher Secondary School, Poigai, while L.F.C. Girls HSS, Ranipet stood second, and St. Mark Matric HSS, Katpadi won the third prize, a press release said.\n\nTransport Corporation\n\nN. Ramesh, general manager of the Tamil Nadu State Transport Corporation, Vellore hoisted the flag and presented prizes to 43 persons, including bus drivers and conductors, during the Republic Day celebrations. Bus conductors, who had fetched high revenue for the corporation, and drivers, who had saved diesel, driving instructors and special checking officers received the prizes.\n\nR. Nambiar, Senior Commandant, 04 Battalion National Disaster Response Force (NDRF), Arakkonam hoisted the flag during the celebration on the NDRF campus.\n\nCleanliness campaign\n\nAs a way to celebrate the day, students of Anuvrat Vidhyalaya School (CBSE) took out a rally and cleaning drive in Virinchipuram near Pallikonda.\n\nThrough the cleaning initiative, the students aimed to popularise the Clean India campaign of the Prime Minister. The students cleaned various parts of Virinchipuram panchayat such as Bazaar Street, Jewellers Street, K.V. Kuppam Road and Temple Street for close to three hours on the day. The panchayat’s sanitary workers also joined them in the cleanliness campaign, a release said.", 
    "section": "national", 
    "title": "Parades, cleanliness drive mark R-Day fete", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}