{
    "author": [
        "Zubdeda Hamid"
    ], 
    "text": "Parties, especially those involving children, generally involve fun and games, but in some cases – as a video going viral on social media on Tuesday illustrated – unexpected mishaps can occur. In the video, an excess of confetti and party foam ruins the cake, upsets the children and ultimately leads to the birthday boy coming close to sustaining severe burns.\n\nThe video, which has been shared on Facebook and is doing the rounds on WhatsApp now, has an adult spaying party foam as the birthday boy cuts the cake. When he bends down to blow the candles, the foam on his head catches fire.\n\nExperts say parents must be cautious when it comes to supervising children and parties and the use of products that could pose a health hazard.\n\n“Party foam contains chemicals that are not good for the eye – it can become an eye irritant. Parents must be careful while using it,” said Mohan Rajan, chairman, Rajan Eye Care.\n\nParty foam is also inflammable as well as most bottles come with warning signs which instruct people not to spray it on a naked flame, which ultimately is what happens in most birthday parties as they are sprayed over candles. The foam and confetti ‘party poppers’ come in small cylindrical containers and are available from Rs 80 to Rs 150.\n\nAnd its not just foam – balloons too, could pose a potential hazard. “Recently, we had a case of a small child who was choking on a balloon. I believe he had seen others blow balloons and tried to do it, but had sucked it in instead of blowing into it. The parents did not know what had happened but they saw the child turn blue and rushed him to hospital where doctors removed the balloon,” said Indira Jayakumar, senior consultant, emergency and intensive care, Apollo Children’s Hospital. Parents must not allow children to use balloons unsupervised, she stressed.\n\n“Other things that could potentially cause a hazard are decorations. Children do not know they cannot be eaten and if they are bright and colourful, could put them in their mouth,” she said.", 
    "section": "national", 
    "title": "Parties may be fun but parents need to stay cautious: experts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}