{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In order to ensure social justice in higher echelons of judiciary\n\nParticipatory judiciary on the lines of participatory democracy was essential to ensure social justice in higher echelons of judiciary, said P. Wilson, High Court advocate, at the conference of advocates’ wing of the Dravida Munnetra Kazhagam held here on Sunday.\n\nMr. Wilson recalled that a memorandum was submitted to the Union Ministry of Law and Justice by R.S. Bharathi on November 12 listing the party’s views on collegium system for appointment of judges in which it had insisted that social justice should be ensured in appointments.\n\nThe DMKwanted the High Court to elicit the views of the State government before finalising the list of candidates. Judges to High Courts and the Supreme Court should be chosen from a list of candidates representing all sections of society.\n\nMr. Wilson said that it was the DMK which paved the way for members of all communities to practise in the Madras High Court.\n\nPointing out that the Supreme Court, in its order of December 16 last year, had taken note of all suggestions made by the DMK, Mr. Wilson said that the State government, in response to a letter from the Centre, should insist that social justice must be ensured in the appointment of judges for which it should recommend rotation system.\n\nHe recalled a judgement in the Second Judges Case on October 6, 1993, in which Justice S. Rathinavel Pandian had said that “if the vulnerable sections of the people are neglected, we cannot claim to have achieved participatory democracy.” In a 2014 judgement, the Supreme Court had said: “Appointments cannot be exclusively made from any isolated group nor should it be predominated by representing a narrow group. Diversity is the guiding factor to be observed uninfluenced by mere considerations of individual opinions.”\n\nThe DMK was of the view, Mr. Wilson said, that social justice could be ensured if the Supreme Court collegium obtained a list of candidates from the State government before finalising judges. If the Apex Court wanted to add names, it could do so by obtaining the opinion of the State. The State government should demand representation for all sections of society when the Centre finalised the memorandum of procedure as directed by the Supreme Court, Mr. Wilson said.", 
    "section": "national", 
    "title": "‘Participatory judiciary on the lines of democracy essential’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}