{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Grand fete:Collector M. Karunakaran saluting the tricolour after hoisting it during the Republic Day celebrations at the Armed Reserve ground in Palayamkottai. — Photo: A. Shaikmohideen; (right) Collector Sajjan Singh R. Chavan inspecting the guard of honour at Nagercoil on Tuesday.\n\nTirunelveli and Kanyakumari Collectors unfurl the tricolour and inspect the guard of honour\n\nStudded with colourful cultural events presented by schoolchildren, the 67th Republic Day celebrations were held at Armed Reserve Police Grounds in Palayamkottai on Tuesday with usual pomp and gaiety.\n\nAfter unfurling the tricolour, Collector M. Karunakaran honoured freedom fighters with shawls, 86 meritorious officials attached to various government departments and sportspersons. He also took the salute from the police, Fire and Rescue Services personnel, NCC cadets and Home Guards after inspecting the guard of honour given by the police along with Superintendent of Police (In-Charge) Santhosh Hadimani. Dr. Karunakaran honoured 27 Head Constables from Tirunelveli City, 35 from Tirunelveli district and 4 Head Constables from Government Railway Police with Chief Minister’s Medals and distributed welfare schemes worth Rs. 1.44 crore to 92 beneficiaries.\n\nA total of 1,075 students from Loyola Convent, Chinmaya Matriculation Higher Secondary School, CSI Matriculation Higher Secondary School, Mary Sargent Higher Secondary School, Palayamkottai, Golden Matriculation Higher Secondary School, Melapalayam, Little Flower Matriculation Higher Secondary School, Tirunelveli Town, presented captivating cultural events for about 45 minutes to enthral the spectators and guests.\n\nPolice Commissioner T.S. Anbu, Sub-Collector, Cheranmahadevi V. Vishnu, Assistant Collector (Training) K.P. Karthikeyan, MPs S. Muthukaruppan, K.R.P. Prabhakaran and Vijila Sathyananth, MLA Nainar Nagenthran, Mayor E. Bhuvaneshwari, Deputy Mayor P. Ganesan alias Jeganathan, Dean of Tirunelveli Medical College Hospital K. Sithy Athiya Munavarah and senior government officials participated in the celebrations.\n\nMs. Bhuvaneshwari hoisted the national flag during the Republic Day celebrations held at Tirunelveli Corporation in the presence of Commissioner S. Sivasubramanian, City Engineer V. Narayanan Nair and senior officials. R-Day celebrations were also organised in all the four zones of the Corporation. Member of Manonmaniam Sundaranar University’s Convenors’ Committee S. Radhakrishnan Nair hoisted the national flag at MSU.\n\nThe Rose Mary Educational Institutions organised ‘Natural Food Festival’ in their school in Tirunelveli Town as part of the Republic Day celebrations. Moreover 400 delectable dishes made with traditional food grains and vegetables, all prepared by the staff and the students, were displayed in 20 stalls and served to the visitors.\n\nRenowned organic farmer Antonysamy of Puliyangudi, who is strictly and successfully practicing organic farming methods on over 100 acres in the foothills of Western Ghats for the past several decades, addressed the students about advantages of toxic-free organic food.\n\nNagercoil\n\nCollector Sajjan Singh R. Chavan unfurled the national flag at the Republic Day celebration held at Anna Stadium here on Tuesday and distributed welfare assistance to the tune of Rs. 17.14 lakh to 146 beneficiaries.\n\nAfter inspecting the guard of honour, he took salute from the police, NCC cadets and the home guards, and honoured 132 government officials for their stupendous service to the public. The Collector also honoured 12 government officials, who excelled in ‘Flag Day’ collection.\n\nMr. Chavan honoured 42 policemen with Chief Minister’s Medals on the occasion and gave away mementoes to the schools that presented colourful cultural events on the occasion.\n\nSuperintendent of Police G. Dharmarajan, Sub-Collector Shreya P. Singh, District Revenue Officer A. Udhayakumar, and senior officials of various government departments participated.", 
    "section": "national", 
    "title": "Pomp and gaiety mark 67th Republic Day celebrations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}