{
    "author": [
        "R Srikanth"
    ], 
    "text": "At St. Thomas Mount, the Metro station is coming up beside the suburban station—Photo: M. Vedhan\n\nThe Beach – Tambaram is among the busiest of the suburban sectors in Chennai and St. Thomas Mount is an important station on it, with even a turn-back service during the morning rush hour – an indicator to the number of commuters who use the station.\n\nThe station – between Guindy and Pazhavanthangal railway stations is strategically and provides quick and low cost public transport connectivity to people from Alandur, Adambakkam, Vanuvampet and West Velachery.\n\nDespite several thousand people using the station everyday, there are plenty of complaints about the overall quality of passenger amenities here.\n\nNeed for more counters\n\nCommuters say ticket counters are always crowded, not just during the morning and evening rush hours. A.Raghavan, a commuter said they needed additional counters for quick purchase of tickets.\n\nPublic toilets are inadequate here and the vehicle parking lot is very poorly maintained.\n\nThe reason, commuters said, was the absence of a contractor.\n\nCommuters also complain that the narrow pathway leading to the station is eaten up by hawkers.\n\nTwo-wheeler theft\n\nCommuters also highlighted the absence of contractors in the parking yard at the railway station posing risk of loss of vehicles. V. Rama Rao of Traffic and Transportation Forum, said instances of two-wheeler theft were common.\n\nThe motorcycle of a Southern Railway was stolen before Christmas last year, he said.\n\nThe vast open space near the station should be put to better use, he suggested.\n\nCommuters also complained about the last mile connectivity of poor bus facilities to reach the station.\n\nSouthern Railway officials said: at present, the construction of the metro and elevated Mass Rapid Transit System works have put the station development work on hold.", 
    "section": "national", 
    "title": "Problems galore at St. Thomas Mount", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}