{
    "author": [
        "S Sundar"
    ], 
    "text": "Envisions itself as alternative to the ‘corrupt’ Dravidian parties; promises to share power with people\n\nGiving a clarion call for an alternative to the “corrupt” Dravidian parties, the leaders of People's Welfare Front (PWF) kick-started their campaign for the Assembly election here on Tuesday.\n\nAddressing a well-attended gathering at the conference for alternative politics at Othakadai, Communist Party of India (Marxist) general secretary Sitaram Yechury said while the national coalition governments framed their common minimum programme only after forming the government, the PWF devised it before forming the government.\n\nHe likened Tamil Nadu politics to football match, wherein people were trying to put the ball in one or the other goal posts, where both the posts were of no difference. “Both are corrupt and pursuing wrong economic policies,” he noted.\n\nEarlier, Communist Party of India general secretary, S. Sudhakar Reddy asserted that the party was one of the four founders of the PWF and would continue to fight the corrupt. The Dravidian parties have given up Periyar’s ideology and were in the centre of grave corruption charges. Vidhuthalai Chiruthaigal Katchi leader, Thol. Tirumavalavan, said the PWF was not just an alternative front to the Dravidian parties, but one with an alternative political ideology of multi-party rule.\n\n“The Dravidian parties have been making piggyback rides on smaller parties by forming poll alliance to fight election, but do not give a share in governance. The PWF aims to give the common man a share in governance in Tamil Nadu for the first time,” he said, amid loud cheer and applause.\n\nThe “PWF is not a substitute, but an alternative,” he said. CPI(M) State secretary G. Ramakrishnan, CPI veteran R. Nallakannu, CPI State secretary R. Mutharasan and MDMK general secretary Vaiko spoke.\n\n‘The Dravidian parties have\n\nbeen riding piggyback on smaller parties’", 
    "section": "national", 
    "title": "PWF kick-starts election campaign", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}