{
    "author": [], 
    "text": "The Road Safety Week was observed with a motorcycle rally in the villages of Ramanathapuram, Pillayarkuppam, Pathukannu, Thondamanatham and Tutipet by the Jipmer Institute of Rural Health Centre (Primary Health Centre) in Ramanathapuram, Puducherry. Talks on health and road safety awareness were conducted at major junctions, and chocolates distributed to motorists wearing helmets. JIRHC also observed Road Safety Week at Christ College of Engineering and Technology. The programmes were held under the guidance of Bijay Naik, senior resident, Department of Preventive and Social Medicine, Jipmer, organisers of the event said. Staff from JIRHC gave a talk on road safety measures . A role play competition was held for the college students. The team conducted an essay competition and gave a health talk at the government high school in Pillayarkuppam.\n\nOn optimisation techniques\n\nEvolutionary computation, machine learning, language technology or natural language processing, information retrieval and text mining were some of the topics covered in a short-term training programme for faculty on ‘Recent trends in optimisation techniques and applications’ held recently at Pondicherry Engineering College.\n\nThe programme was sponsored by Technical Education Quality Improvement ProgrammePhase-II. The faculty development programme was inaugurated by R. Subramanian, Head, Department of Computer Science, Pondicherry University. Participants came from Puducherry, Madurai, Chennai and Surathkal. It aimed at bringing academicians and researchers together and encouraging research and innovation using optimisation techniques. Some of the techniques included scheduling of vehicles by optimising routes, reducing network traffic on the internet, facilitating effective data analysis and predicting business trends, said K. Saruladha, assistant professor, PEC, and one of the coordinators of the programme.\n\nM. Sugumaran, Head, Department of Computer Science Engineering, presided over the programme.\n\nReporting by\n\nAnnie Philip", 
    "section": "national", 
    "title": "Rally, talks on health mark Road Safety Week", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}