{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Bustling crowds of people from the city and suburbs line up on either side of Kamarajar Salai to witness the Republic Day parade on Tuesday —Photos: R. Ragu\n\nCultural programmes reflect culture, values, civic consciousness, heritage and tradition of the country\n\nOn Tuesday morning, nearly all the arterial roads seemed to be leading to only one destination in the city — Marina. Kamarajar Salai saw bustling crowds of people from across the city and its suburbs lining up on the pavements and waving to the young men and women who were participating in the 67{+t}{+h}Republic Day parade.\n\nPeople started lining up as early as 6 a.m. and selected the best possible spot for a clear view of participants marching past in uniforms of different colours and also those taking part in cultural presentations.\n\nRepublic Day was celebrated with fervour all across the city. People pinned the national flag on their clothes and wrapped themselves in tricolour dresses.\n\nAt Ripon Buildings, the headquarters of Chennai Corporation, cultural programmes reflected the spirit of local governance and also reminded participants of the rich culture, values, civic consciousness, heritage and tradition of the country.\n\n“We had fewer events this year owing to floods. But they seemed to reinforce the significant aspects of our sovereign, socialist, secular, democratic republic,” said Carmel Mary, a participant.\n\nAs many as 250 students from city schools participated in cultural programmes. “After the Metro Rail work started, the space for cultural events has reduced on the premises of Ripon Buildings. Chennai Corporation should redevelop the people’s park and lots of open space before next Republic Day,” said S. Nagarajan, a resident.\n\nThe civic body on Tuesday felicitated 67 employees who contributed significantly to the improvement of civic conditions during the challenging phase of 2015. Mayor Saidai Duraisamy, in the presence of Corporation Commissioner B. Chandra Mohan, distributed certificates to such employees who came up with ideas that saved lives during the floods and mitigated disaster.\n\nThiru-Vi-Ka Nagar zone executive engineer P. Rajendran, who suggested methods to mitigate floods in neighbourhoods along highways, was among the key contributors to receive awards during the celebrations. Perungudi Zonal Officer S. Elangovan, another awardee, said the Chennai Corporation workers successfully prevented breach of lakes, saving hundreds of lives in the area.", 
    "section": "national", 
    "title": "Republic Day celebrated with fervour", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}