{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Corporation says the work was about to begin in a few days\n\nC.K. Colony residents in Coimbatore repair the main road that was remaining damaged for long.– Photo: M. Periasamy\n\nWhat could be a better occasion than Republic Day to tell netas, and babus that citizens’ interests take priority and if they fail to take care of those, the former have no choice but to act.\n\nThis is the message that C.K. Colony residents conveyed in no uncertain terms when, after hoisting National Flag, around 8 .am. on Tuesday they armed themselves with construction equipment to repair the damaged road that they have been asking the Coimbatore Corporation to do for over a year.\n\nV. Unnikrishnan, a resident, said that after waiting for the corporation to act, the residents decided to repair the damaged road all by themselves because using the road was proving to be a pain.\n\nThe residents got together, pooled in about Rs. 5,000, bought cement, sand, and blue metal to repair the road.\n\nThey started the work around 9 a.m., levelling the damaged portions with concrete mixture so that their ride to the nearby Sathyamangalam Road at G.P. Signal was smooth.\n\nEach resident contributed his or her bit. K. Kanmani of Ramani Apartments said that she carried water to those who mixed concrete because she wanted a good road. “The damaged road had left many a resident with pain in the spine.”\n\nAfter a good four hours, the residents completed the work by 1 p.m. filling all the damaged portions – there were around 15, Mr. Unnikrishnan said.\n\nThe corporation had dug the road around a year ago to provide water connections to the residents. After digging, it closed the road but not properly and that left damaged strips that criss-crossed the 500-m road.\n\nU. Savithri, Councillor, says took up the issue of damaged road with the corporation officials.\n\nThe corporation did sanction the work but was unable to execute it because the ward has been without an engineer for over three months.\n\nNow with a new engineer in place, the work was supposed to begin in a few days but the residents have taken it upon themselves to solve the problem.\n\n“The damaged road had left many a resident with pain in the spine”", 
    "section": "national", 
    "title": "Residents repair damaged road", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}