{
    "author": [
        "T Madhavan"
    ], 
    "text": "Re-laying of roads that were severely damaged during the flood of December and also earlier during heavy rains the previous month should be taken up before the Election Commission of India announces the schedule for Assembly elections in Tamil Nadu.\n\nThis was a common demand from residents and activists who took part in the ‘grama sabha’ meetings in the city’s southern suburbs on Republic Day.\n\nThe ‘grama sabha’ or village council meetings are convened at village panchayats on important national days where residents, elected representatives and government officials come together to discuss important issues relating to basic amenities.\n\nIn most of the meetings in village panchayats in the city’s immediate suburbs, residents wanted repair works on main roads and streets before the election schedule is announced.\n\nThey said once the model code of conduct was implemented, the government would not be able to announce new development works and hence road re-laying works should be taken up at the earliest.\n\nKancheepuram Collector R. Gajalakshmi participated in the meeting at Villivalam in Walajahbad Panchayat Union. Similar meetings were convened in 633 village panchayats in the district, officials said.\n\nAt Perumbakkam village panchayat, D. Farida Bhanu, Tambaram Revenue Divisional Officer, said they received petitions on problems in flood relief and they were being attended to by the respective departments.\n\nOn complaints about poor amenities, Suhasini Rangarajan, Perumbakkam village panchayat president, said they were taking all steps to meet the ever growing requirements of residents in the newly developing areas in their panchayat. V. Rajasekaran, president of Rayappa Nagar Tiruvalluvar Residents’ Welfare Association in Varadarajapuram, near Tambaram, said the Adyar river continued to be encroached on and they should be removed.\n\n‘Grama sabha’ meetings were organised in southern suburbs on Republic Day", 
    "section": "national", 
    "title": "Residents want new roads before poll announcement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}