{
    "author": [
        "B Kolappan"
    ], 
    "text": "The annual book fair has become part of Chennai’s culture, like the December Music season.\n\nTwo lakh visitors and a good sale at the Chennai Pongal Book Festival at the YMCA Royapettah grounds have proved that book lovers will patronise the fair regardless of who the organisers are and what the venue is.\n\n“Unlike the regular book fair where the sale is mostly confined to some publishers, this book fair has ensured uniform sale for all participants because of the small venue,” said K. Nagarajan, co-ordinator of the Tamil Nool Virpanai Mempattu Kazhagam (TNVMK), the organisers of the book festival.\n\nThe proceeds from the sale of entry tickets will go to the flood relief. The book sellers together contributed 4,000 books to the Ashok Nagar library damaged in the flood.\n\nChennai Book Fair is normally organised by the Publishers and Booksellers of the South India (BAPASI). The event was postponed due to the flood and the TNVMK stepped in to organise the Pongal Book Festival and 250 publishers took part in the fair. Normally 600 publishers would take part in the book fair by the BAPASI.\n\nAs the response to the event was overwhelming, the book fair was extended for two more days.\n\n“When we participate in the annual book fair, we always have some target for sales. Here I put up my stall without any expectation. Still the sales crossed my expectation,” said V. Sridhar of the Om Sakthi Book Store, who sells remainders imported from London.\n\nIn fact, stalls selling remainders have become a special feature of the book festival. “We visit London two times a year and place orders. We sell books at 50 per cent of the market rate in Chennai,” said V. Yuvaraj, another bookseller. Dictionaries, illustrated books for children, encyclopaedias, novels and books on specific subjects printed and published by world’s leading publishers are for a negotiable price. Vasantha Kumar of the Tamizhini said the sale matched almost 50 per cent of what would happen in the annual book fair.\n\nAsked about the high-price of the Tamil books, Kannan Sundaram of Kalachuvadu explained that in Tamil publishing world the price per page had not crossed one rupee. “I agree that the price of a Tamil book is little higher when compared to an English title. We can also bring down the price if books are printed in large numbers,” said Mr Kannan, adding that the sale was beyond his expectation.\n\nThere is a separate stall selling Braille books and the latest inclusion is Imayam’s Pethavan, a novella, depicting a love story with close resemblance to the tragic-love affair of Divya and Ilavarajan of Dharmapuri.\n\n“The regular meetings and debates organised in connection with the book festival were also well received,” said Mr Nagarajan.", 
    "section": "national", 
    "title": "Sale at book fair ‘beyond expectation’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}