{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Winfred Michael Raj completed 111 cubes in two hours\n\nWinfred Michael Raj, a student of Medical Physics in Christian Medical College, Vellore, attempting to enter the Guinness Book of World Records by solving 111 Rubik’s cubes in a little over two hours on Tuesday.— Photo: C. Venkatachalapathy\n\nSolving a Rubik’s cube might be as easy as riding a bicycle for 21-year-old Winfred Michael Raj. But what makes him different is that he does both at the same time – solving cubes while riding a cycle.\n\nOn Republic Day, this student of first year M.Sc. Medical Physics of Christian Medical College (CMC), Vellore, took on an attempt to enter the Guinness Book of World Records by solving 111 Rubik’s cubes in a little over two hours cycling all the while.\n\nRaj, a resident of Chennai, started to learn to solve Rubik’s cubes in class XI, and went on to take part in an event organised by the World Cube Association in Chennai in 2014.\n\n“There are pre-defined methods to solve the cubes and gain expertise. I follow the Jessica Fridrich’s method. I went to the first round of the event. It was then I thought why not try something different in solving these cubes, and came up with the idea of solving while cycling,” Raj said.\n\nHis first thought was to break the record of the most number of Rubik’s cubes solved while running a marathon.\n\nIn fact, Tuesday’s attempt at a record is not the first time for him. In 2014, he solved 66 Rubik’s cubes in 60 minutes in Bangalore entering into the Indian Book of Records.\n\nAfter his application to the Guinness Records got the nod in the same year, he started to prepare to achieve this feat.\n\n“I practiced whenever I had free time after classes. But I started to cycle regularly on the Vellore Bangalore National Highway, covering at least 15 to 20 km a day,” he said.\n\nHe was also keen on not gaining weight in order to help him get through the attempt. He added that he took on this attempt with little practice in the last week. “I actually tried out mock attempts by solving about five to 10 cubes while cycling before this final attempt,” he said.\n\nOn Tuesday, Raj started his attempt close to half past 11 O’ clock on a stretch of around 70 to 100 metres on the campus of CMC at Bagayam.\n\nHe picked up, solved and handed over the cubes at stations set up at both the ends.\n\nHe equalled his own record of solving 66 cubes in close to 1 hour 15 minutes, and went on to surpass his record, solving 100 cubes in 110 minutes.\n\nFinally, he solved 111 cubes in two hours and three minutes.\n\nOn an average, he takes about 20 seconds to solve a cube, and it is one minute while cycling, he pointed out.\n\n“The Guinness Book of World Records fixed my limit at 30 cubes to make a record. But I wanted to set a record as high as possible. There were two expert cubers who witnessed my attempt. I will be sending the evidence to the Guinness Book of World Records this week end,” he added.\n\nRaj, who did his B.Sc. Physics in Madras Christian College, Chennai, wants to become a school teacher.", 
    "section": "national", 
    "title": "Setting record of solving Rubik cubes while cycling", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}