{
    "author": [
        "K Lakshmi"
    ], 
    "text": "For many residents in the western parts of the city, bus terminuses are a source of frustration. Many bus terminuses are plagued by various problems.\n\nFor over a decade, residents of Ambattur are waiting for their bus terminus to receive improvements.\n\nResidents of Korattur board buses several metres away from the bus terminus, whose inauguration is pending for six months now.\n\nS.Merlin, a resident of Thillai Nagar, Korattur, said: “The terminus has been provided with a roof and a concrete floor after several years. But, I still have to walk 200 metres to board buses. Improving the terminus has not helped as many commuters like me continue to wait without a shelter.”\n\nThe bus terminus was developed at a cost of Rs. 55 lakh using MLA’s Area Development Funds. With buses not plying from the facility, it is being misused as a parking bay for private vehicles. Residents also complained that they had to walk for nearly a kilometre from the railway station to reach the temporary bus stop now. The terminus lacks a seating arrangement and a drinking water facility. The bus terminuses in Ambattur OT and Ambattur Industrial Estate have their share of woes too. For two decades now, the Ambattur OT terminus has remained roofless. As there are no proper bus bays, commuters have great difficulty boarding buses. B. R. Prasad, a resident of Vijayalakshmipuram, said: “As this terminus is located along the CTH road junction, people use it as a thoroughfare to reach nearby streets. Without any seating arrangements or drinking water facility, the small shelter is inadequate for hundreds of people.”\n\nResidents also note that the Ambattur Industrial Estate bus terminus does not have a proper flooring and passengers trying to board buses are often at risk.\n\nB. Prathanam, a resident of Ayanambakkam, said the Thiruverkadu bus terminus had a leaky roof and lacked proper toilets and seats. That is the least of his problems.\n\nThe facility is located far from Ayanambakkam. “We have to go either to Thiruverkadu or Ambattur OT to board buses. The government must either implement the proposal to build a bus terminus in Kolladi or on Chetty Street, Mel Ayanambakkam,” he said.\n\nThe same entrance being used as both and entry and exit point at the bus terminuses in Mogappair East and Iyappanthangal, pose a challenge to commuters. Residents demand that the vacant ground near the Mogappair East facility should be used to extend the facility.\n\nS. Karunakaran, executive committee member, CITU Transport Union, said: “The bus stop on Mount Poonamallee Road must be shifted beyond the Iyappanthangal signal. This often leads to traffic chaos. The leaky roof also needs to be replaced.”\n\nSources in the Public Works Department said work would start soon to provide amenities such as drinking water, toilet block, seating arrangement and timekeeper’s room at Korattur. After many years, Ambattur OT terminus too would get a roof at a cost of Rs.30 lakh.\n\nMTC sources said funds were being allocated to improve bus facilities in suburbs. The issues would be addressed soon.\n\nResidents demand that the vacant ground near the Mogappair East facility should be used to extend the facility", 
    "section": "national", 
    "title": "Several bus termini in western areas lack facilities", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}