{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Children perform at the 67th Republic Day celebrations at the Indira Gandhi sports complex in Uppalam on Tuesday. A police contingent stages a march past.— Photos: T. Singaravelou\n\nChief Minister presents awards, medals and trophies\n\nOn the occasion of the 67th Republic Day Chief Minister N. Ranagasamy presented awards and medals to police personnel. The award of President Police Medal for distinguished service was given to Praveer Rajan, IPS, General of Police, Puducherry and the award of President Police Medal for meritorious service was given to Inspector of Police, Puducherry, Rajasankar Vellat.\n\nAfter hoisting the flag, Chief Minister N. Rangasamy inspected the guard of honour by the Puducherry police at Indira Gandhi Sports Stadium on Tuesday.\n\nHe took the salute at the march past by Armed Police, Civil Police (women and men), Home Guards (men), India Reserve Battalion, Traffic Police, Fire Service, Ex-Servicemen, school students and students from different states.\n\nChildren from various schools performed cultural programmes that highlighted the concept of national integration. Three students sketched former Tamil Nadu Chief Minister K. Kamaraj as others danced to a song.\n\nLt. Governor’s recognition\n\nPuducherry Superintendent of Police (CID) S. Venkatasamy, Inspector of Police CI/Grand Bazaar Chinta Kothandaraman and D’Nagar inspector of police L.V. Senthil Kumar received the award of Lieutenant Governor’s Police Medal for Extraordinary Service.\n\nThe award of Lieutenant Governor’s Commendation Certificate was given to Sub-Inspector of Police (Muthialpet) V. Logananthan, Sub-Inspector of Police (Special Branch) T. Thukkan, Sub-Inspector of Police (Sigma-Intelligence) S. Thambiran, Sub-Inspector of Police (Sigma Security) C.V. Renil Kumar and SGASI (HC 1319) FRRO T. Karikalan.\n\nAs per the directions of Lieutenant Governor, Puducherry government introduced new scheme called Government of Puducherry Scheme for Commendation of Meritorious Persons in the various fields in 2015.\n\nThis year, three persons were honoured with a commendation certificate and memento – Herman ep de Blic Madeleine, a native of Belgium, who founded Volontariat in Puducherry, Pudumani Balakrishnan alias K. Balarishnan, a social worker, enrolled as special police officer in 1991 under the Special Police Officer scheme and Bharatanatyam dancer J. Nandhini.\n\nIn recognition of the performance of nearly 38 educational institutions that produced outstanding results in the SSLC Public Examination held in March/April 2015, the Chief Minister’s Rolling Trophy was awarded jointly to these schools. The award of Education Minister’s Rolling Trophy to the Government Higher Secondary School which produced best result in the Higher Secondary Public Examination went to Maraimalai Adigal Government Higher Secondary School, Embalam.\n\nThe Chief Minister awarded Arch Bishop of Puducherry Rolling Trophy and Pondicherry University Vice-Chancellor Rolling Trophy for higher secondary schools producing best results in the Higher Secondary Public Examination jointly to 26 higher secondary schools that secured highest pass percentage in the year 2015.\n\nKamban Government Higher Secondary School was adjudged as the best school for its all-round performance in the academic and co-curricular activities and awarded the Lion Professor Ambady Narayanan Rolling Trophy for the year 2014-15.", 
    "section": "national", 
    "title": "Students highlight national integration on Republic Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}