{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "District Collector S. Prabakar inspecting guard of honour presented by police personnel during Republic Day celebrations in Erode on Tuesday.- PHOTO: M. GOVARTHAN\n\nPolice, Fire and Rescue Service personnel and government officials received medals and certificates for meritorious services from District Collector S. Prabakar during the Republic Day celebrations here on Tuesday.\n\nThe Collector honoured 80 freedom fighters and their wards and handed over cheques amounting to Rs. 81.25 lakh to 349 beneficiaries under various government schemes. Non-Government Organisations that had involved themselves in cleaning up water bodies in and around the city were recognised with certificates. Recipients of certificates for meritorious services included officials and employees of Revenue, Ex-Servicemen Welfare, Adi Dravida and Tribal Welfare, Horticulture, Agriculture, Agricultural Engineering, and Differently abled Welfare Departments.\n\nAlong with Superintendent of Police M.R. Sibi Chakravarthy, the Collector released hundreds of balloons in the tricolours into the sky.\n\nThe highlight of the celebrations was the cultural performances displayed by about 500 students belonging to Komarappa Sengunthar Girls' HSS, Kongu Vellalar Matric School - Perundurai, Kongu Vidyalaya Matric School - Manickampalayam, URC Palaniammal Girls HSS, Govt HSS - Vellankovil, Saratha Matric HSS - Gobi, Sri Swami Vivekananda Matric HSS, and Christhu Jothi Matric HSS.\n\nDistrict Revenue Officer R. Satheesh, Project Officer of District Rural Development Agency P. Periyasamy, Revenue Divisional Officer of Erode R. Narmadadevi, and several other senior officials took part.\n\nSubsequently, Grama Sabha meetings were conducted in 225 panchayats. President of Ingur Panchayat in Chennimalai Panchayat Union N. Balasubramanian presided over one such meeting in which the Collector took part.\n\nDocuments pertaining to fair price shops, final voter list, and Mahatma Gandhi National Rural Employment Guarantee Scheme were placed for public scrutiny.\n\nIn deference to public demand, work on Ingur-Ezhuthingalpatti causeway in Sengulam village at a cost of Rs. 6.5 lakh, and a part-time fair price shop will be carried out, the Collector promised, and exhorted villagers to avail themselves of the Rs. 12,000 subsidy for individual toilets aimed at total hygiene.\n\nSchools and colleges observed the occasion by inviting dignitaries to deliver speeches on patriotism. At the AET Matriculation School, the invitee Sethumathaa Ramanuja Dasar B. hoisted the flag.At the EBET Group of Institutions, Kangayam, the guard of honour presented by a student contingent was accepted by the functionaries of the Erode Builder Educational Trust. At M.P. Nachimuthu M. Jaganathan Engineering College, its Correspondent Vasantha Sudhanandhen took the salute from marching students.\n\nCultural and literary programs by students were held at Erode Sengunthar Engineering College.", 
    "section": "national", 
    "title": "Students commended for impressive performances", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}