{
    "author": [], 
    "text": "Companies sponsor events and develop INFRASTRUCTURE\n\nFor companies in Coimbatore, Corporate Social Responsibility (CSR) activities include development of infrastructure at schools, supporting education initiatives, providing healthcare facilities, focusing on women empowerment, taking up drinking water projects, and contributing for more greenery and environmental projects in the district.\n\nHowever, for years some companies and entrepreneurs have been supporting tournaments and sportspersons here, developing sports infrastructure, and heading sports associations. For instance, CRI Pumps has been supporting All India Women’s Basketball tournament. It also extends financial aid to coaching and providing sports materials to the students in each of its adopted schools.\n\nThere are more marathons in the city and some companies pay the registration fee for the employees. This encourages employees to keep fit and take part in sports activities and the amount goes for a cause.\n\nIndustry sources say spending on sports is mainly in two segments – development of rural sports and promoting individual talent. These are also covered under the CSR activities. Companies plan the funding for each CSR activity annually. There are areas such as rural and public infrastructure, art and culture, renovation of temples, environment projects, education and healthcare initiatives. Sports might not get the focus from all companies as some of the other areas. But, those that have been doing so have now incorporated it as part of the CSR project.\n\nCompanies usually have focus portfolios and also a contingency fund. While the major spending will be in the focus areas, the contingency fund will be used for distributing aid if there is a natural calamity or if there is a new initiative in the city by the Government under the public private partnership mode.\n\nM. Soundariya Preetha", 
    "section": "national", 
    "title": "Supporting sports, sportsmen", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}