{
    "author": [
        "Special Correspondent"
    ], 
    "text": "There have been several tennis stars, both national and international, from this part of the State. The city has played host to top-ranked tournaments too.\n\nTo shape the future of the youngsters, The R.S. Puram Club has come up with the HDFC Bank-Coimbatore Premier Tennis League (CPTL) to be played from January 26 to February 25.\n\nThe CPTL carries a prize Rs. 1 lakh, and the winning club will be richer by Rs. 50,000.\n\nIt is for the first time that the city is hosting a prize-money premier tennis league of this magnitude.\n\n“We feel it is the right time to make a start,” said M. Ramesh Santhanakrishnan, the tournament director.\n\n“The Coimbatore District Tennis Association (CDTA) has been conducting regular league for its players but this one is for all age groups. It is more of club tennis in an entirely new format,” said V.P. Ramanathan, tournament committee member.\n\n“There’s going to be fun, family atmosphere, and sportsmanship,” he added.\n\nThe event has attracted 120 players from ten teams and they have been split into two groups of five clubs each.\n\n“We are extremely delighted to host this event and it’s going to be a grand affair for both players and spectators,” said Dilip B. Shah, the secretary of the club.\n\nIt is not an easy task though but the club has the infrastructure and the manpower to glide through smoothly. The club has installed floodlights at the courts recently.\n\n“All matches will be played under lights, from 6 p.m. to 9 p.m.,” said Mr. Ramesh.\n\nFor the players it will be a new experience too.\n\n“There won’t be hardship for them as the yellow balls will be quite visible against the green background,” said Mr. Ramanathan.\n\nR. Krishnan, the chief referee has also worked his heart out for the success of the tournament.\n\nThe CPTL was inaugurated by Coimbatore Mayor P. Rajkumar. He did get his time to test his skills at the net as well.\n\nK. Ilamurugu, vice-president and cluster head of HDFC Bank said that the bank was glad to be part of the event. The club felicitated seven of its senior tennis playing members too during the occasion.", 
    "section": "national", 
    "title": "Tennis takes a new avatar", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}