{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Patriotic fervour:Collector M.Ravikumar handing over a certificate for best performance to District Supply Officer at the Republic Day celebration in Thoothukudi on Tuesday.— Photo: N. Rajesh\n\nThe 67th Republic Day was celebrated with pomp and patriotic fervour at District Sports Stadium in Thoothukudi on Tuesday. Collector M. Ravikumar unfurled the national flag and inspected the guard of honour along with Superintendent of Police Ashwin M. Kotnis.\n\nAfter honouring the heirs of freedom fighters, and officials from various government departments, the Collector took the salute from the police, fire and rescue services personnel and NCC cadets. He extended financial assistance to the tune of Rs. 1,30,87,344 to 94 beneficiaries under various welfare schemes.\n\nAs many as 35 police personnel received Chief Minister’s medals in recognition of their meritorious services. Besides, certificates of appreciation were given to 24 police personnel and 303 government officials.\n\nAs part of the celebrations, cultural programmes were performed by 1,443 students from various schools across the district. Thoothukudi Sub-Collector S. Gopala Sundara Raj, officials from various departments and parents of students were present.\n\nThe brigade led by E. Balasubramanian, Divisional Officer, Fire and Rescue Services, Thoothukudi, presented a drill. Mayor of Thoothukudi Corporation A.P.R. Anthony Grace hoisted the national flag on the Corporation Office premises. Deputy Mayor of Corporation P. Xavier and officials took part in the celebrations.\n\nRepublic Day was celebrated by Tamilnad Mercantile Bank Limited on its head office premises. The national flag was hoisted by Managing Director and Chief Executive Officer of the bank H.S. Upendra Kamath, M. Gunasekaran, General Manager, TMB said in a statement.\n\nAnshu Goel, Business Head, Copper and Precious Metal, Sterlite Copper hoisted the national flag as part of the Republic day celebrations at Sterlite Copper.", 
    "section": "national", 
    "title": "Thoothukudi Collector unfurls flag, honours freedom fighters, officials", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}