{
    "author": [], 
    "text": "RELIGION\n\nHindu Samaya Mandram : Sri Radha Kalyana mahotsavam, 30 Rajaji Street, Renga Nagar, Srirangam, 8.30 a.m.; Sri Anjaneyar utsavam, 5 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Veli Andal Sannidhi, West Adayavalanjan, Srirangam, 6 p.m.\n\nCULTURE\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha : 169{+t}{+h}aradhana celebrations of Sathguru Sri Thiagaraja Swamigal, Kanya, Suvasini, Vatuka and Dhampathi poojas, Sri Sathguru Thigaraja Bhavanam, Srirangam, 9 a.m.; vocal concert by Vignesh Ishwar & party, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 4.30 p.m.; veena concert by Nirmala Rajasekar and party, 6 p.m.; vocal concert by Bombay Jayashri & party, 8 p.m.\n\nGENERAL\n\nNational College : Rajaji endowment lecture on Maintaining integrity in public services by R.K.Raghavan, former Director, Central Bureau of Investigation, 11 a.m.\n\nThe Book Club: Book review, T.Ganesan, former Director, AIR, Tiruchi, reviews the book ‘The vision of Rajaji,’ Thathachariar House, 152, South Chithra Street, Srirangam, 6.30 p.m.\n\nBharathidasan University Department of Educational Technology : ‘First Clap 2016,’ - short film and photography competition-cum-festival, S.Anthony Tirunelveli, film producer, inaugurates, Khajamalai campus, 10 a.m.; valedictory address by M.Krishnan, Syndicate Member, 4 p.m.; photography exhibition, 11.15 a.m. to 4.30 p.m.\n\nUrumu Dhanalakshmi College Bharathi Vasagar Vattam : Book review by students,12.30 p.m.\n\nSeethalakshmi Ramaswami College : Muthamizh Vizha, A.Kaliyamurthy, former superintendent of police, chief guest, 9.30 a.m.; Exon Association: Lecture on Immunity and immune mechanisms by R.Selvam, former Head, Department of Zoology, Bishop Heber College, 2 p.m.\n\nJamal Mohamed College Consumer Club and Youth Red Cross : Awareness programme on cyber crimes, R.Revathi, Special District Revenue Officer, TN Road Sector Project, speaks, 3.30 p.m.\n\nHoly Cross College : Signing of MoU between Fine Arts Club and Kavin Kalai Kuzhu, 11 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Seminar on Recent trends by T.K.Revathi, 5.30 p.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}