{
    "author": [
        "Coimbatore Bureau"
    ], 
    "text": "Coimbatore Collector Archana Patnaik presenting the Chief Minister’s Medal for meritorious service to a police personnel during the 67th Republic Day celebrations at the VOC Park Grounds in Coimbatore on Tuesday. (Right) The Nilgiris Collector P.Sankar giving certificate to a forest official at the HADP Ground.— Photos: M. Periasamy and M.Sathyamoorthy\n\nChief Minister’s medal presented to police personnel; welfare assistance distributed; freedom fighters honoured\n\nTraditional arts performed by school students were the highlight of the 67{+t}{+h}Republic Day celebrations at VOC Ground here on Tuesday. The celebration began with the hoisting of the tri-colour by Collector Archana Patnaik at 8 a.m. The Collector also accepted the guard of honour and honoured nine freedom fighters and their dependants.\n\nA team of 25 boys and girls of Nachiyar Vidhyalayam Matriculation Higher Secondary School, Pollachi, stole the show by exhibiting their talents by performing Malcom and Rope exercise. Silambam by students of the Government High School, Rasipalayam, was the other event that grabbed the attention of viewers. Around 850 school and college students performed cultural programmes as part of the celebrations. The Collector gave away prizes to the performing teams. Ms. Archana Patnaik also distributed financial assistance and other benefits worth Rs. 2.90 crore to more than 150 beneficiaries under various government schemes.\n\nEarlier, the Collector gave away the Chief Minister’s medal for meritorious service to 75 police personnel - 52 personnel attached to Coimbatore City Police and 23 from the District Police. Certificates of appreciation were handed over to eight Revenue Department drivers for driving without any accidents for more than 30 years.\n\nThree government school teachers, who strived hard for the development of their students in rural Coimbatore, were also recognised at the event. Police Commissioner A. Amalraj, Inspector General of Police for West Zone C. Sridhar and Superintendent of Police R.V. Ramya Bharathi witnessed the event.\n\nAt the Central Training College, Central Reserve Police Force, at Thoppampatti, its principal Ajay Bharatan gave away President’s Police Medal for Gallantry to two personnel, Police Medal for Gallantry to 22 personnel, Police Medal for Distinguished Service to six personnel and the Police Medal for Meritorious Services to 57 personnel.At the prison, ex-convicts Viswanathan, Krishnasamy, Chinnapaiyan and Krishnan shared their experience in prison with the present inmates and how their term in jail had helped in shaping them lead a dignified life after their release. Deputy Inspector General of Police (Prisons), Coimbatore Range, R. Arivudainambi presided over the event.\n\nThe Nilgiris\n\nThe celebrations in The Nilgiris began at 10 a.m. with the hoisting of the National Flag by Collector P. Shankar. After accepting the guard of honour and presiding over the Republic Day celebrations, the Collector distributed financial assistance and benefits worth Rs. 1.02 crore to 83 beneficiaries. He also recognised the president and panchayat secretary of Kukkal Panchayat for successfully executing the Swachh Bharat scheme. Cultural programmes began with dance performed by people from the Toda and Kota tribal communities. More than 650 children took part in the cultural programmes as part of the celebrations.\n\nTirupur\n\nDistribution of welfare assistance, ceremonial parades and cultural programmes marked the celebrations organised by the district administration at Chikkanna Government Arts College grounds.\n\nCollector S. Jayandhi hoisted the National Flag and inspected the guard of honour given by the police in the presence of Superintendent of Police Saroj Kumar Thakur.\n\nAs many as 376 beneficiaries received welfare assistance worth Rs. 68.31 lakh earmarked under various government sponsored schemes. Ms. Jayandhi also gave away certificates of merit to 257 government employees for their services in the last one year. The event came to a close with cultural programmes by students of 11 schools in the district.\n\nMayor Visalakshi Appukutty hoisted the tri-colour in the celebrations held at the Corporation office in the presence of Corporation Commissioner M. Ashokan and councillors.\n\nThe Republic Day was celebrated with fervour at Sainik School, Amaravathinagar. Captain T. N. Sridhar, the school principal, hoisted the National Flag and reviewed the parade by the cadets.\n\n(M.K Ananth in Coimbatore and R. Vimal Kumar in Tirupur)", 
    "section": "national", 
    "title": "Traditional arts steal the show at Republic Day celebrations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}