{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "A road over bridge and a sub way are to be built to ease traffic on NH45A\n\nRoad section at Arumbarthapuram level crossing in Puducherry will be closed until these projects are completed.— Photo: T. Singaravelou\n\nThe Villupuram-Puducherry-Nagapattinam NH 45A will be closed to vehicular traffic at Villianur from Thursday to facilitate construction of approach roads for a Road Over Bridge (ROB) and a Limited Use Subway at Arumbarthapuram level crossing.\n\nThe PWD is building the ROB while the subway is a project of Southern Railway. Once the much-delayed projects are complete, road users on NH45A can expect a considerable easing of traffic woes as the level crossing at Arumbarthapuram presented a bottleneck.\n\nJoint initiative\n\nUnion Minister of State for Road Transport, Highways and Shipping Pon Radhakrishnan, had earlier this month, laid the foundation for works relating to the road-over-bridge in Villianur at an estimated cost of Rs. 28.98 crore, along with a few other projects, while the Rs. 5.13 crore limited-use subway and a two-lane road overbridge project was launched as a Government-Railway joint initiative as far back as in 2013.\n\nTransport Commissioner S.D. Sundaresan said the road section at Arumbarthapuram would be closed until these projects are completed to ensure uninterrupted execution of work and for the safety of road users.\n\nTraffic will be diverted for all categories of vehicles from Puducherry to Villianur and from Villianur to Puducherrry as follows:\n\nTwo wheelers and smaller vehicles like Light Motor Vehicles (LMV) heading from Villianur to Puducherry will be diverted along Koodapakkam, Poraiyur, Perambai road, Pitchaveeranpet and Moolakulam.\n\nOutbound vehicles from Puducherry to Villianur will take a detour via Moolakulam, Pitchaveeranpet, Perambai road and MGR Statue road junction.\n\nSouth-bound heavy vehicles need to go south via Thirukanchi, Abishekapakkam and Thavalakuppam without touching Puducherry while north-bound heavy vehicles from Villianur can go north via Pathukannu, Vazhudavoor road, Mettupalayam, Gorimedu without entering town.\n\nStage carriages including school buses from Villianur to Puducherry will go via Koodapakkam road, Poraiyur, Vazhudavur road, lyyankutipalayam, Mettupalayam road junction to reach NH 45A via the new link road and then reach Puducherry.\n\nThose from Puducherry to Villianur will go via Moolakulam, Pitchaveeranpet, Perambai road and MGR Statue road junction.\n\nAs soon as diversion starts, the stage carriages from Villianur to Puducherry have to travel four kilometres additionally and there will be a proportionate increase in fare for buses from Villianur to Puducherry.\n\nThe indicative excess fare could be in the range of Rs. 2.\n\nHowever, for buses from Puducherry to Villianur there will not be any change in fare.\n\nThe Transport Commissioner has requested the general public and road users to adhere to the traffic diversion and extend their cooperation.\n\nThere will be a proportionate increase in fare for buses from Villianur to Puducherry", 
    "section": "national", 
    "title": "Traffic diversions at Villianur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}