{
    "author": [
        "Staff Reporter"
    ], 
    "text": "S. Anantha Chandra Bose, Chairman, VOC Port Trust, saluting the national flag at the Republic Day celebrations held at Port School Ground in Thoothukudi on Tuesday.\n\nV.O. Chidambaranar Port, Thoothukudi, had been registering an impressive growth rate throughout this financial year and had handled a record cargo traffic of 27.81 million tonnes and 4.44 lakh Twenty-foot Equivalent Units (TEUs) of containers till December 2015, S. Anantha Chandra Bose, Chairman, VOC Port Trust, said after hoisting the national flag on the Republic Day at Port School Ground here on Tuesday.\n\nHe took salute from Central Industrial Security Force, Port Fire Service, Port School NCC cadets and students. He elaborated on the various projects undertaken by the port to augment capacity, improvise productivity, quicker discharge and evacuation of cargo and seamless movement of trucks.\n\nIn his Republic Day message, the Chairman recalled the struggles and sufferings of our forefathers and patriots who struggled to attain freedom for India. He observed that the biggest challenge faced by the country was development of infrastructure to meet the economic growth, and to achieve this, the Centre was in the process of the implementing ‘Sagarmala’ project which envisaged ‘port-led development model’.\n\nAcknowledging the dedicated services, support and cooperation extended by the employees, officers, trade unions and stakeholders for the growth of V.O.C. Port in the recent past, he sought a full-fledged support of maritime community for fulfilling the port’s vision to become a pioneer in providing quality and efficient cargo handling facility in south India.\n\nHe distributed meritorious awards to the officers and staff of various departments of the port, CISF and sportspersons.\n\nPort School students performed a cultural programme on the occasion.", 
    "section": "national", 
    "title": "“VOC Port continues to register impressive growth”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}