{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "(From left) Collector K.S. Palanisamy handing over a certificate to a police woman in Tiruchi. — Photo: M. Srinath; Collector M. Mathivanan honouring a freedom fighter in Tiruvarur and CollectorS. Palanisamy handing over assistance to a student in Nagapattinam on Tuesday.\n\nRepublic Day celebrated in Tiruchi, Thanjavur, Tiruvarur, Nagapattinam, Karur, Perambalur, Pudukottai, Ariyalur and Karaikal districts\n\nPatriotic fervour filled the air across the district during Republic Day celebrations at various places on Tuesday.\n\nCollector K.S. Palanisamy unfurled the national flag and took salute on the District Armed Reserve ground premises at Subramaniapuram. The celebrations organised by the district administration commenced with a ceremonial march past by police personnel followed by cultural events presented by students of various schools.\n\nThe event was marked by distribution of Chief Minister’s medals to a select group of police personnel for their excellent service and certificates to officials of different departments and police personnel in appreciation of their work. He presented medals and certificates besides distributing assistance given by different departments worth Rs. 6.84 lakh. Freedom fighters and their legal heirs were honoured.\n\nCorporation Mayor A. Jaya unfurled the flag in the presence of civic body officials and councillors. Accompanied by Corporation Commissioner M. Vijayalakshmi, she placed wreaths at the Gandhi Asthi Mandapam and at the War Memorial raised at Gandhi Market in memory of 41 soldiers who died in World War – I. Collector K.S. Palanisamy laid a wreath at the War Memorial later.\n\nAirport Director B.C.H. Negi presided over the celebration at the airport. School students presented a cultural programme. Central Industrial Security Force personnel, Airports Authority of India officials and other stake holders took part in the celebrations. At the Golden Rock Railway workshop, the Chief Workshop Manager P. Suresh hoisted the flag.\n\nThanjavur\n\nCollector N. Subbaiyan hoisted the flag and took the salute at the march past at the Police Grounds. He honoured freedom fighters’ descendants and gave away assistance to beneficiaries. An attractive cultural show by school students was another highlight of the proceedings. Superintendent of Police N. M. Mayilvahanan was present.\n\nTiruvarur\n\nCollector M. Mathivanan unfurled the flag at the function held at stadium in the Collectorate Master Complex and took the salute after which he inspected a guard of honour. Columns of Armed Reserve Police, women constables, Fire and Rescue Services personnel, NCC, NSS and Scouts and Guides participated in the impressive march past. He draped shawls on 11 freedom fighters and their descendants and gave away assistance worth Rs. 67.27 lakh to 249 beneficiaries. A total of 21 police personnel and 88 officials belonging to other departments were given certificates for meritorious services.\n\nNagapattinam\n\nCollector S. Palanisamy hoisted the flag and accepted the salute at the main function held at the stadium in the company of Superintendent of Police Abhinav Kumar. He gave away assistance to 166 persons worth Rs. 1.14 crore besides giving away merit certificates to officials who had performed meritorious services in the district. He honoured 14 freedom fighters and five language struggle participants and honoured 17 police men and officials for their remarkable service.\n\nKaraikal\n\nCollector E. Vallavan unfurled the flag and took the salute. Republic Day was celebrated at the commune panchayat offices. M. Chandracasu Minister for Agriculture, participated.\n\nKarur\n\nCollector T.P. Rajesh unfurled the national flag at a simple but majestic function held at the district sports’ stadium. Earlier, accompanied by the Superintendent of Police Vandita Pandey, he inspected the guard of honour of the police personnel. He also released pigeons on the occasion. Later, he met the freedom fighters drawn from different parts of the district and presented shawls to them as a token of appreciation for their contribution to the country.\n\nAs many as 18 policemen were honoured with the Chief Minister’s medals for their meritorious service. Similarly, 24 other officials of the various departments were honoured. Welfare assistance to the tune of Rs.65 lakh was given to 42 beneficiaries. Students of various schools participated in art and cultural programme held on the occasion.\n\nPudukottai\n\nCollector S.Ganesh hoisted the flag and took the salute at the Republic Day parade at the Armed Reserve grounds. He was accompanied by E.S.Uma, Superintendent of Police. He honoured freedom fighters and distributed welfare assistance worth Rs.20.29 lakhs to 77 beneficiaries. He presented certificates to 315 government employees for meritorious services. Cultural teams from about nine schools presented a colourful pageantry.\n\nPerambalur\n\nPomp and gaiety marked the Republic Day celebrations as the Collector K. Nandakumar unfurled the flag at a function held here on Tuesday. After saluting the flag, he accepted the Republic Day parade by the Armed Reserve, Fire and Rescue Service personnel, Home Guard and NSS students. Superintendent of Police Sonal Chandra accompanied him when he inspected the guard of honour. Pigeons were released on the occasion.\n\nLater, he met 14 freedom fighters and members of their families. He honoured them with traditional shawl.\n\nAriyalur\n\nCollector A. Saravanavelraj hoisted the flag at an impressive Republic Day function here on Tuesday.\n\nThe march past of the Armed Reserve police hogged the limelight of the function. Accompanied by the Superintendent of Police Anil Kumar Giri, he inspected the guard of honour by the police personnel. Later, he presented Chief Minister’s medals to 10 meritorious policemen.", 
    "section": "national", 
    "title": "Welfare assistance and medals distributed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}