{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Governor K. Rosaiah and Chief Minister Jayalalithaa watching cultural programmes during the Republic Day Celebrations on Tuesday. (Right) Students performing a dance at the function.— Photos: R. Ragu\n\nChief Minister Jayalalithaa, Governor Rosaiah inspected 14 floats put up by various departments\n\nWelfare schemes of the State Government and efforts taken by it to rescue and rehabilitate people in the flood affected districts recently were showcased at the 67{+t}{+h}Republic Day parade on Kamarajar Road near the Marina Beach on Tuesday.\n\nGovernor K Rosaiah unfurled the national flag and took the salute from various contingents including army, navy, air force, coast guard, TN special police and fire service.\n\nAlong with Chief Minister Jayalalithaa, Mr. Rosaiah inspected the 14 floats put up by various departments. The Tourism Department’s tableau showcased the theme ‘One billion tourists, one billion opportunities’ highlighting the fact that the State topped in attracting domestic and foreign tourists in 2014.\n\nThe last float that went past the gathering was from the Department of Public (Elections) with an objective of promoting awareness on the importance of voting and enhancing voter enrolment among the youth and women. It also had a message on ethical voting in light of the forthcoming elections to the Legislative Assembly. The Indian Coast Guard’s tableau has pictures on Chennai floods.\n\nThe Chief Minister gave away Anna Medals for Gallantry to M.S.Bhaskar, Inspector of Police, K.K. Nagar Police station, Chennai, who rescued more than 1,500 people who were stranded in the recent floods and Mohammad Yunus S who helped many flood-affected people. Gallantry medals were also presented to K Rishi who saved two boys from drowning and G Srinivasan, who rescued two people who were dragged into the sea.\n\nThe Kottai Ameer Award for Communal Harmony was given to M.B.Abubacker from Thanjavur for maintaining communal and social harmony in Adhirampattinam and surrounding areas.\n\nGandhi Adigal Police medals were conferred on K.Rajendhran who is the Additional Superintendent of Police, Prohibition Enforcement Wing at Thanjavur; M. Raju, head constable at Eriyur Police Station at Dharmapuri and S. Ramamurthy who is stationed at Pudupattinam Police Station, Nagapattinam, as Special Sub Inspector of Police.\n\nThe special award by the Agriculture Department to the farmer who obtained the highest yield in the state under System of Rice Intensification (SRI) cultivation method of paddy went to P. Prasana. She had also implemented sheep penning and made extensive use of bio-fertilisers.\n\nIndian Coast Guard’s tableau at the parade had pictures on\n\nChennai floods", 
    "section": "national", 
    "title": "Welfare schemes showcased at R-Day parade", 
    "subsection": "tamilnadu", 
    "date": "2016-01-27"
}