{
    "author": [], 
    "text": "Room and board in the Purrfection Suites begins $28 per night\n\nA staff member places sand in a litter tray for a pet cat in the Purrfection Suite at the Wagington luxury pet hotel in Singapore. Room and board Sg$39 (Rs. 1900) per night— Photo: AFP\n\nCats who are tired of the rat race in fast-paced Singapore have a new high-end leisure option — a top-of-the-range hotel complete with designer beds, Roberto Cavalli wallpaper and Swarovski crystal-studded dining ware.\n\nThe Purrfection Suites are the ultimate in luxury for fussy felines looking for some quality downtime in the most upmarket surroundings.\n\nPurified air is pumped into every room, while some even boast classical music on a Sensurround system to help stressed cats unwind.\n\nThe 14-room extension — exclusively for cats — is part of The Wagington, Singapore’s first five-star dog hotel housed in a converted British colonial-era bungalow in the heart of the city-state’s diplomatic quarter.\n\nThe Wagington owner Estelle Tayler said since the opening of the dog hotel in 2014, cat owners have clamoured for a similar style of upmarket lodging for their pets.\n\n“We decided to make a wing dedicated just for our feline friends, with its own private entrance,” Tayler said.\n\nApart from lodgings, the hotel offers grooming and spa services at additional cost. It plans to introduce “in-room dining” featuring home-cooked food. While their feline friends remain mostly indoors, The Wagington’s doggy guests can frolic in the outdoor bone-shaped swimming pool and work up a sweat on treadmills.\n\nPets are a pampered lot in Singapore, one of Asia’s richest cities. One businessman offers weekend boat cruises for pets and their owners. Pets also have their own obituary section in the country’s leading English language newspaper. — AFP", 
    "section": "national", 
    "title": "A ‘purrfect’ life for Singapore’s cats", 
    "subsection": "general", 
    "date": "2016-02-25"
}