{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A file picture of Army men moving an elderly woman to safety during the floods in Chennai in December last.- File Photo: PTI\n\nDecember 2015. Men in camouflage push boats to take hundreds of stranded people to safety in flood-hit Chennai. Come February 2016, huge placards read “Army” in bold red as Army men in battle gear march through the streets in the violence-hit districts of Haryana. The Army carried them to distinguish themselves from the paramilitary and central armed police forces, who were marching alongside.\n\nWithin hours of the agitation by the Jat community turning violent last Friday, the State government asked for the Army’s help to get the situation under control.\n\nHaryana Director-General of Police Y.P. Singhal had said in Chandigarh that the State government was in touch with the Defence Ministry. “The effort is to deploy the Army as soon as possible to control the situation,” he said last Friday.\n\nSimilarly, in August last year, when the agitation by the Patel community in Gujarat, again for reservation, turned violent, the Army was called in.\n\nFrom Chennai’s floods to Haryana’s Jat protests, the Army is being increasingly deployed as the primary response to assist the civil administrations and state machinery in times of crisis. This despite the fact that there are a large number of Central police and paramilitary forces available and more being added by the day.\n\nSeveral serving officers and experts have expressed concern at the Army being called into Haryana at such a short notice and caution that this is not a healthy trend.\n\nSpeaking to The Hindu , former Director-General of the BSF J.P. Sinha said that in the past, when the police and the Central Armed Police Forces (CAPFs) were not able to cope with the situation, the BSF was called in and only thereafter the Army’s services were requisitioned.\n\n“Of late there is a tendency to immediately call in the Army. It is not a good trend,” he said.\n\n“Ultimately, the fear of the Army in the public, which is the last resort, if it goes away, we will have a tough situation,” he observed.\n\nEchoing the sentiments, Lt. Gen. H.S. Panag, former Northern Army commander, observed that the Army had been called in for civil aid since Independence but in the past it was because there were not enough CAPFs. However, the situation is now very different as many agencies had been created and India had one of the largest paramilitary and CAPFs in the world, he said.\n\nSocial media groups buzzed with messages from officers and veterans expressing similar views.", 
    "section": "national", 
    "title": "‘Army should be used judiciously in civil crises’", 
    "subsection": "general", 
    "date": "2016-02-25"
}