{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Furniture was broken and CCTV cameras went missing on the first day of exam\n\nA file photo of relatives of students climbing the walls of an exam centre to pass answers at Vaishali in Bihar.— Photo: AFP\n\nStudents appearing for the Intermediate Board examinations on Wednesday defied the special arrangements made by the Bihar government to check mass copying at exam centres. Over 465 students were expelled, furniture was broken and CCTV cameras went missing at several centres on the first day of the examination. The Board examinations for Std X will begin from Thursday.\n\nThe State Education Department had set up 1,109 exam centres for the 11,57,950 students appearing for the intermediate examinations which will end on March 5.\n\nEven as students were caught cheating at different centres, at the Rajput school in Chhapra, students vandalised furniture and boycotted the exam. Similarly at Dharampur High School in Bidupur of Vaishali district, the CCTV camera installed to keep a check on cheating students went missing. The police and the invigilators at the centre blamed each other for the missing camera.\n\nLast year, a picture of parents, friends and relatives climbing on to the walls of an examination centre in Vaishali district to help students went viral. State Education Minister Ashok Chaudhury this time had declared that special arrangements had been made to avoid such embarrassment.\n\nAround 70,000 officials, including teachers and policemen were deployed and CCTV cameras installed. A fine of up to Rs 10,000 for those found using unfair means and imprisonment of guardians and friends caught helping their wards were some of the measures put in place. Section 144 was imposed around the exam centres to ensure fair exams.", 
    "section": "national", 
    "title": "Bihar students defy ‘special arrangements’ to prevent cheating in intermediate examinations", 
    "subsection": "general", 
    "date": "2016-02-25"
}