{
    "author": [
        "B S", 
        "Satish Kumar"
    ], 
    "text": "The Karnataka BJP has filed a complaint before the ED to find out who gifted the imported watch to Mr. Siddaramaiah.\n\nThe Bharatiya Janata Party has decided to train its guns on Karnataka Chief Minister Siddaramaiah on the controversial watch issue. It is considering the possibility of dragging the issue to the court by getting someone to file a petition.\n\nAccording to sources, a suggestion was made to the party’s core committee by BJP national president Amit Shah at a meeting of the committee convened by him in Delhi on Monday.\n\nBJP State president Pralhad Joshi has already filed a complaint before the Enforcement Directorate seeking investigation to find out who gifted the imported watch, and whether Mr. Siddaramaiah has paid Customs duty, besides declaring before the tax authorities, and whether any foreign exchange regulations had been violated.\n\nThe party now wants to go to court in a bid to score a political point by embarrassing the Congress.\n\nThe BJP is also preparing to activate its campaign against Mr. Siddaramaiah over the issue of alleged illegal denotification of large tracts of land acquired for the formation of the Arkavathi Layout in Bengaluru.\n\nMr. Shah is learnt to have asked the party to take on the Congress government by launching various campaigns against its alleged failures in different sectors. The BJP has decided to launch the campaigns after the visit of Prime Minister Narendra Modi to Belagavi for the launch of the new crop insurance policy at a convention of farmers on February 27.\n\nNew State chief\n\nThe BJP is likely to decide on its new State president some time in the second week of March. Sources said the party high command is expected to decide on the president through consensus.\n\nFormer Chief Minister B.S. Yeddyurappa and party State general secretary C.T. Ravi are in the race.", 
    "section": "national", 
    "title": "BJP plans to go to court on Siddaramaiah’s ‘costly’ watch", 
    "subsection": "general", 
    "date": "2016-02-25"
}