{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Allegations include those of money laundering and land grabbing in the construction of the building\n\nA day after the judicial custody of his nephew Sameer Bhujbal was extended, a charge sheet was filed against Nationalist Congress Party leader Chhagan Bhujbal in the Maharashtra Sadan scam.\n\nFiled by the Anti-Corruption Bureau (ACB), the charge sheet runs into 20,000 pages and has statements of 60 witnesses.\n\nThere are allegations of money laundering and land grabbing in the construction of the Maharashtra Sadan in Delhi. The charge sheet names Mr. Chhagan Bhujbal’s son Pankaj and 14 others — Manikkalingam Saha, Sanjay Joshi, Deepak Deshpande, Anilkumar Gaikwad, Pravin Chamankar, Prasanna Chamankar, Iram Sheikh, Geeta Joshi, Arun Devdhar, Devadatt Marathe, Bipin Sankhe, Krishna Chamankar, Pranita Chamankar and Tanveer Sheikh.\n\nAll the accused are booked under Section 420 (Cheating and dishonestly inducing delivery of property), 406 (Punishment for criminal breach of trust), 465 (Punishment for forgery), 468 (Forgery for purpose of cheating), 471 (Using as genuine a forged 1 [document or electronic record]), 120 B (Whoever is party to a criminal conspiracy to commit an offence punishable with death), 101 (When such right extends to causing any harm other than death) and 34 (Acts done by several persons in furtherance of common intention) of the Indian Penal Code and relevant Sections of the Prevention of Corruption Act.\n\nOn February 8, 2016, the Enforcement Directorate (ED) submitted an application before a Prevention of Money Laundering Act court that stated: a director of a company has confessed that Sameer Bhujbal was the actual controller of entities and he was working as per instructions given to him by Mr. Bhujbal. He said the company that was awarded the contract for the construction of Maharashtra Sadan had given a sub-contract for supply of furniture to the tune of Rs 6.50 crore and that it reveals the nexus of criminality in the matter.\n\nHe also said that Sameer siphoned off funds in the construction of Maharashtra Sadan.\n\nIn December 2014, the Bombay High Court heard a public interest litigation plea filed by the Aam Aadmi Party alleging that the Bhujbal family had gained kickbacks during the tenure of Chhagan Bhujbal as Public Works Department Minister.\n\nA Division Bench of Chief Justice Mohit Shah and Justice BP Colabawalla had observed that there was merit in the allegations and constituted a Special Investigation Team, comprising the ACB and the ED, to investigate the matter, following which three FIRs were filed in June 2015. On January 28, 2016, Senior Counsel Gayatri Singh informed the court that both the agencies were taking a lot of time to conduct their investigation and asked them to file their charge sheet before February 28, after which the ACB filed the charge sheet on Wednesday.", 
    "section": "national", 
    "title": "Charge sheet filed against Bhujbal", 
    "subsection": "general", 
    "date": "2016-02-25"
}