{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "a Tale of two protests:ABVP members carry a giant flag during a protest march from Ramlila Ground to Jantar Mantar in New Delhi on Wednesday even as JNU students demand the release of their arrested colleagues on the university campus.— PHOTOS: PTI, Sushil Kumar Verma\n\nHigh Court adjourns bail plea hearing to February 29; police say releasing the student leader will embolden those indulging in ‘anti-national’ activities\n\nAccusing JNU student leader Kanhaiya Kumar of “actually organising” the February 9 event on the university campus against the hanging of Parliament attack convict Afzal Guru where some ‘anti-India’ national slogans were allegedly raised, the Delhi Police on Wednesday said it was looking into his source of “finance and foreign connections.”\n\nIn a status report on the investigation in the sedition case filed in the Delhi High Court, police said if Kumar was released on bail, it would send across a “wrong signal” that such “anti-India activities” could be conducted with immunity and, eventually, one could come out after imprisonment for a few days.\n\nThe High Court Bench of Justice Pratibha Rani adjourned the hearing on Kumar’s bail petition to February 29, after the police told the court that it would seek his fresh remand from the trial court following the arrest of the two JNU students, Umar Khalid and Anirban Bhattacharya, accused in the sedition case on Tuesday night.\n\nThe court deferred the bail plea, without giving any relief to Kumar, who is presently lodged in Tihar Central Jail. His judicial custody expires on March 2. The police intend to seek his remand to confront him with the two JNU students.\n\nThe 13-page status report filed after the court’s direction claimed that besides Kumar and other accused persons, some “foreign” elements were also present during the February 9 event and that they had covered their faces to “hide their identity.”\n\n“The investigating agency is looking for linkage between the petitioner, his co-accused and the said foreign elements,” said the report, in which the police opposed Kumar’s bail plea.\n\nThe report said the event held ramifications not only within India but also had an “international impact” and cited a raw unedited video footage as evidence. However, it added that the video footage was not the sole evidence on the basis of which the investigation was proceeding.\n\n‘Similar offence’\n\nPolice alleged that Kumar, who had not cooperated during the interrogation, was likely to commit a similar offence if released on bail. The probe regarding the source of finances for all the activities that resulted in the alleged incident was ongoing and police were also examining the CCTV footage provided by the university, the report said.\n\n“After the seditious act of the petitioner and the co-accused, the said anti-national perception has percolated to other parts of the country and there are stray instances wherein processions were taken out honouring the martyrdom of Afzal Guru, Maqbool Bhat (who was hanged in 1984), etc.” said the report.\n\nPolice said they were conducting a probe regarding the persons and organisations which were behind such “non-educational activities” in the campus and the object behind it in the larger national perspective.", 
    "section": "national", 
    "title": "Delhi police now looking into Kanhaiya’s ‘foreign links’", 
    "subsection": "general", 
    "date": "2016-02-25"
}