{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Former Chief Minister Omar Abdullah says the erosion of Jammu and Kashmir’s autonomy is a breach of faith that has manifested itself as political turmoil.— PHOTO: NISSAR AHMAD\n\nNational Conference (NC) president Farooq Abdullah on Wednesday warned New Delhi against “pushing Muslims to the wall” saying, “this way, it cannot hold on to Jammu and Kashmir.”\n\nSpeaking on the first death anniversary of NC general secretary Sheikh Nazir, Mr. Abdullah said, “Those trying to polarise people on the basis of religion are the biggest enemies of this country. They want to fragment the country for their own interests.”\n\nHe asked the Centre to engage Pakistan on the issue of Kashmir. “There is no alternative to Indo-Pakistan peace. Kashmiris have the most to benefit from peace and dialogue between the two countries. Nothing has ever come out of violence and nothing will come out of violence in the future,” Mr. Abdullah said.\n\nReferring to the composite Jammu and Kashmir, he said that people from various regions on both sides of the divide shared a common culture, language and heritage. “We should grant them the freedom to visit each other’s lands and share common values and dreams.”\n\nNational Conference working president Omar Abdullah said Delhi had dishonoured the terms and conditions of the State’s accession to the Union of India and termed the erosion of the State’s autonomy as a breach of faith that had manifested itself as political turmoil.\n\n“Our flag is our pride. It represents all three regions of the State and we will protect our flag with our blood”, he said.\n\nLashing out at the Peoples Democratic Party, Mr. Omar Abdullah said, “Mehbooba Mufti’s statement that she was neither capable nor prepared to take on the responsibility of leading the State is factually correct. That said, what is this prolonged delay about then? While the PDP and BJP continue to profess their unquestionable allegiance to each other and have adequate numbers, their refusal to form the government is strange. The people were happier under Governor’s rule than they were under the PDP-BJP government. While the PDP promised political packages and economic revolutions in the State, it failed to deliver on a single promise.”", 
    "section": "national", 
    "title": "Do not push Muslims to the wall: Farooq", 
    "subsection": "general", 
    "date": "2016-02-25"
}