{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Letter cautions VC not to allow discussions that are anti-national and anti-government on campus\n\nBJP Member of Parliament from Aligarh Satish Gautam warned the Vice Chancellor of Aligarh Muslim University Zamiruddin Shah against allowing any event which goes against the RSS and the Narendra Modi-led BJP government at the Centre.\n\nIn a strongly-worded letter to the VC, Mr. Gautam suggested that being against the BJP, RSS or the government, was being anti-national.\n\nThe BJP MP’s letter categorically says that the AMU should also not allow events and discussion on subjects and issues which are against the Sangh Parivar, the Government and the BJP. Without substantiating any of his allegations, Mr. Gautam goes on to suggest that the AMU selectively invited people who are “somehow anti-national” in their approach.\n\nThis is not the first time that the BJP leader has attempted what many in the university see as a “baseless but concerted and planned character assassination” of the AMU.\n\nThe letter comes just days after a BJP leader and Aligarh Mayor attempted to create a “beef” controversy out of buffalo meat, alleging that the AMU was serving “beef biryani” in its canteen.\n\nMr. Gautam ‘s letter with the subject line : “regarding anti-government seminars and discussions in AMU”, is dated February 22. “Lately it is being seen that every event organised on the campus digresses from its subject and effectively ends up going against Sangh Parivar, the BJP and the Government. It is also seen that the university selectively invites those people for talks and seminars, who hold anti-government views and who somehow also believe in dissolution and disruption of the country,” Mr. Gautam says in the letter, a copy of which is with The Hindu.\n\n“It is expected of you that in the near future you won’t allow those events that are anti-national and anti-government in nature to happen in the campus. Before allowing any event, do keep in mind the gravity of the topic of the seminar and if you think that the issue goes against the nation or the government then better not allow that programme in the university,” the letter concludes.\n\nThe letter, however, doesn't mention any specific event or any “anti-national” person in the campus. When this correspondent contacted Mr. Gautam, he said he was “merely cautioning the VC so that AMU does not become JNU”.\n\nIn his response to Mr. Gautam's allegations, the VC on Wednesday strongly refuted the charge that “anti-national debates were organised in the University.”\n\nReassuring the Member of Parliament that the AMU respected the government of the day, Mr Shah reiterated that “The AMU is an autonomous institution and there is no prohibition on discussion on any topic within the framework of the Constitution. We have several fora for debate, where divergent views are expressed freely and different shades of opinion are respected. This should not be viewed as being anti-national.”", 
    "section": "national", 
    "title": "Don’t organise ‘anti-Sangh’ events in AMU, warns MP", 
    "subsection": "general", 
    "date": "2016-02-25"
}