{
    "author": [], 
    "text": "Can spending excessive time on Facebook or other social media be as dangerous as addiction to cocaine or gambling?\n\nWell, yes, if researchers from California State University, Fullerton, in the U.S. are to be believed.\n\nThey say social media obsession may lead to something akin to classical addiction. Excessive use triggers two key parts of the brain associated with rewards: amygdala, which is the integrative place for emotions, behaviour and motivation and striatum, part of the forebrain and a critical component of the reward system.\n\nThe findings, recently published in the journal Psychological Reports: Disability and Trauma showed that social media-related ‘addictions’ share some neural features with substance and gambling addictions.\n\nThe meteoric rise of the Internet usage and emergence of various social media platforms has left many young Indians socially isolated and lonely.\n\nTake Krishnan (name changed), a 15-year-old social media addict in New Delhi, who recently visited Sameer Malhotra, a mental health and behavioural sciences expert.\n\nHooked on to Facebook for nearly 16 hours a day, he had developed an obsessive personality profile and was neglecting education.\n\n“I have been seeing many youngsters who are in the grip of social media addiction. In the case of Krishnan, I treated him through both counselling and medication, which helped channelise his energy in positive work,” Dr. Malhotra said.\n\n“Facebook addiction is similar to cocaine addiction to a certain level as there are certain neuro-chemicals such as dopamine which operate across brain reward pathways and are responsible for maintaining addictive behaviour,” he said.\n\nAccording to Dr. Malhotra, teenagers with Facebook addiction-like symptoms may “have a hyperactive amygdale-striatal system, which makes this ‘addiction’ similar to many other addictions.”\n\nAnother mental health expert, Samir Parikh, says that preoccupation with social media leads to an interference in one’s social, occupational as well as other areas of functioning.\n\nPhysiological changes\n\n“Yes, it could be considered similar to drug addiction to a certain level though it is not exactly the same. The difference is more in terms of the physiological manifestations involved,” Dr Parikh said.\n\n“They all display similar patterns of behaviour like inability to abstain, impairment in behaviour control, craving, diminished recognition of significant behavioural problems, interpersonal issues and a dysfunctional emotional response,” says Birendra Yadav, clinical psychology expert.\n\n“Overcoming any kind of addiction is possible with adequate professional interventions,” Dr. Parikh said. One can build the willpower of the person through counselling and medication, Dr. Malhotra added. — IANS\n\nPreoccupation with social media can interfere with normal functioning, warn experts", 
    "section": "national", 
    "title": "‘Excessive social media use is like drug addiction’", 
    "subsection": "general", 
    "date": "2016-02-25"
}