{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kerala Chief Minister Oommen Chandy says the government made a profit of Rs. 9 crore from the import of palmolein while the Leader of the Opposition, V.S. Achuthanandan, says the deal caused a loss of Rs. 2.32 crore to the exchequer\n\nOpposition demands Chandy’s resignation over his alleged involvement in palmolein case\n\nThe Kerala Assembly on Wednesday witnessed stormy scenes after the Opposition shouted slogans and trooped to the well of the House, following the Speaker’s refusal to permit discussion on an adjournment motion on the observation made by a vigilance court against Chief Minister Oommen Chandy in the palmolein case.\n\nReplying to the notice for the adjournment motion moved by Raju Abraham and others, Home Minister Ramesh Chennithala said the court’s observation could not be construed as a verdict in the 23-year-old case. Pointing out that no court had found material evidence against Mr. Chandy to arraign him as accused, he alleged that the case was politically motivated.\n\nOn Tuesday, the vigilance court, while acquitting two key officials involved in the case, observed that Mr. Chandy, the then Finance Minister, was in the know of the deal to import palmolein at an inflated price from Malaysia.\n\nEarlier, moving the motion, Mr. Abraham called on the Chief Minister to step down in the light of the observation. He said Mr. Chandy had tried to withdraw the palmolein case twice during his tenure as Chief Minister, indicating his culpability.\n\nAs soon as the chair invited Mr. Chandy to speak, Opposition members stood up and began shouting slogans demanding his resignation. Unfazed by the din, the Chief Minister continued his speech. He accused the Opposition of trying to create a smokescreen and running away from a debate in the House.\n\nWelcoming the vigilance court verdict, Mr. Chandy said it vindicated his efforts to discharge the officials who were wrongly arraigned. He claimed that the government had not incurred a loss but made a profit of Rs. 9 crore from the import of palmolein.\n\nAfter the Speaker denied permission for discussion on the adjournment motion, the Leader of the Opposition, V.S. Achuthanandan, rose to speak, only to find his voice drowned by shouts.\n\nRefuting Mr. Chandy’s claim, he said the palmolein import deal had caused a loss of Rs. 2.32 crore to the exchequer.\n\nSpeaker denies adjournment motion over court remarks on Chandy in palmolein case", 
    "section": "national", 
    "title": "Kerala Assembly witnesses stormy scenes", 
    "subsection": "general", 
    "date": "2016-02-25"
}