{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "‘Agitations cannot hold the nation to ransom and be a reason to vandalise public property’\n\nAgitations cannot hold the nation to ransom and be a reason to vandalise public property, the Supreme Court said on Wednesday. Organisers of such agitations will have to pay the cost.\n\nThe court’s resolve hit home after the widespread Jat quota agitation saw killings, burning and looting of shops, and mobs destroying canals supplying water to the National Capital. The Haryana government reeled under losses worth several thousands of crores and the Army was brought in to protect public property.\n\nEqual accountability\n\nA Bench of Justices J.S. Khehar and C. Nagappan said parameters should be laid down to pin the blame on organisers and make them pay compensation for agitations which slipped into uncontrolled mob violence against innocents and their property.\n\n“What is happening? Where is our country heading? You cannot burn the country’s property. You can agitate peacefully. But what is all this burning and ransacking? Those who do it must know that there will be consequences for their actions,” the Bench said.\n\nStressing that equal accountability should be applicable to all, the court said: “Whether it is the BJP or the Congress or whichever organisation or party, it may be asked to pay for the property damaged. They will collect the money and pay for the damage.”\n\nThe Bench was hearing a plea by quota agitation leader Hardik Patel to quash charges of sedition against him. Gujarat had also witnessed violence and public property loss during the Patidhar agitation. The police had lodged a case in October against Mr. Patel and five of his aides on the charges of sedition and waging war against the government.\n\nThe apex court had on January 14 asked the AG to assist it on the approach to be adopted in dealing with cases where public property was damaged on a large scale.Hardik has claimed that the charges had been wrongly been invoked against him.", 
    "section": "national", 
    "title": "Leaders must pay for damage: SC", 
    "subsection": "general", 
    "date": "2016-02-25"
}