{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Nalini (right) at the funeral of her father in Chennai on Wednesday.— Photo: K.V. SRinivasan\n\n“Our hands are not stained with anyone’s blood. This is the truth. We did not know whether Rajiv Gandhi was white or dark, tall or short,” said Nalini, one of the convicts in the Rajiv Gandhi assassination case. She was in the city on parole to attend her father’s funeral on Wednesday.\n\nHer father Sankara Narayanan (92), passed away at V.K. Puram in Tirunelveli on Tuesday. Subsequently, Nalini obtained a 12-hour parole to attend the funeral in Chennai. Following this, her father’s body was brought to his son P.S Ravi’s house in Kotturpuram on Wednesday.\n\n“For the past 25 years my husband, me, and five others have been housed in the prison. We have not done any mistake. It is up to you to believe it or not. Now my daughter is 24 years old; she is of marriageable age and I cannot be in the jail. I believe Tamil Nadu Chief Minister Jayalalithaa will release the seven of us. It is this trust that is helping me survive,” Nalini told journalists at her brother’s house.\n\nShe said she was indebted to Congress president Sonia Gandhi for intervening and commuting her death sentence to life. “We also want to urge Rahul Gandhi to help towards our release at least for the sake of my daughter,” Nalini said.\n\nEarlier, Nalini arrived at her brother’s house in a police van comprising 12 personnel.\n\nShe met relatives and paid last respects to her father. “It is after 25 years that many family members are seeing her. Some of them saw her 12 years ago when she attended a marriage in T. Nagar,” said her brother P.S. Bagyanathan, adding that out of the nine children Sankara Narayanan had, Nalini was one of a favourite.\n\nMany political leaders were present at the venue. Viduthalai Chiruthaigal Katchi leader Thirumavalavan and Tamilar Desiya Munnani president Pazha Nedumaran wanted the government to release Nalini and six other convicts.\n\nShe hopes that Tamil Nadu Chief Minister Jayalalithaa will release seven of them", 
    "section": "national", 
    "title": "Nalini attends father’s funeral in Chennai", 
    "subsection": "general", 
    "date": "2016-02-25"
}