{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "A statement from the Pakistan Prime Minister’s Office said India’s new High Commissioner Gautam Bhambawale hoped his role would be “beneficial in normalisation” of ties between the two countries that have been unable to restart the Foreign Secretary-level dialogue since September 2012. Mr. Bhambawale made his first call on Prime Minister Nawaz Sharif on Wednesday.\n\nThere is little clarity on when Pakistan’s special investigation team (SIT) will visit Delhi for its probe into the Pathankot airbase attack. In a television interview last week, Mr. Aziz had said he hoped for the team to travel at the end of February or the beginning of March, and India had approved the visit “in principle”, adding that he hoped it would be in conjunction with the Foreign Secretary talks in Islamabad.\n\nHowever, senior diplomats confirmed to The Hindu that the proposal from Pakistan was yet to be received by the Indian High Commission in Islamabad.\n\nThe clock is also ticking on the Foreign Secretaries meeting, as Prime Minister Narendra Modi and Mr. Sharif had reportedly agreed that the former would meet before the Prime Ministers met again, as they are expected to in Washington on the sidelines of the Nuclear Security Summit from March 31 to April 1.\n\nIf the bilateral meetings don’t take place in March, it would be a clear indicator that the newly resumed dialogue process has gone off the rails again. While India has avoided saying explicitly that the talks have been affected by the Pathankot attack and the terror attack in Pampore, officials have made it clear that talks would move forward in an atmosphere where Pakistan shows it has acted against the groups responsible for the attack.\n\nSenior diplomats say the proposal is yet to be received by the Indian embassy", 
    "section": "national", 
    "title": "No clarity on visit of Pakistan probe team", 
    "subsection": "general", 
    "date": "2016-02-25"
}