{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Leaders of the Left parties and the Janata Dal(United) stage a protest on the JNU issue at Parliament House on Wednesday.— PHOTO: PTI\n\nHuman Resource Development Minister Smriti Irani denied in the Lok Sabha on Wednesday any attempt at “saffronising education” with regard to the events in Jawaharlal Nehru University and offered to quit if it could be proved.\n\nMs. Irani elaborated on the events that led to February 9, when the function to mark the anniversary of the hanging of Parliament attack case convict Afzal Guru was held, even reading out a few of the slogans and the accounts of the university’s security staff about the incidents.\n\n“Many people tell me — they are kids, spare them. But how does this depravity get seeded in the minds of our children? Today I am compelled to say this — are these just slogans? I want to quote a Roman philosopher — a nation can survive its fools and the ambitious but cannot survive traitors,” she said.\n\nShe situated her arguments squarely in the realm of “nationalism” and alleged “betrayal” by Congress vice-president Rahul Gandhi.\n\nThe speech was preceded by a strong showing by the Opposition benches, with the chief whip of the Congress in the Lok Sabha Jyotiraditya Scindia accusing Ms. Irani and Labour Minister Bandaru Dattatreya of bringing down the might of the Indian government on Vemula’s head just because “he opposed the ideology of the RSS and the BJP.”\n\n“With this government, it is either my way or the highway; anyone opposed to them gets branded as anti-national,” Mr. Scindia said.\n\n“A young student ends his life and senior Ministers in this government like Sushma Swarajji, Jual Oramji and Social Justice and Empowerment Minister Thawarchand Gehlotji only say the boy was not a Dalit. Is that the response of the government to the death of a son of poor parents,” he asked.\n\n“This government wants to muzzle the voice of JNU students. Why? Because they raised the issue of Dadri, they demonstrated in front of the Education Ministry over cuts in the allocation for the University Grants Commission, and they raised the death of Rohith Vemula,” Mr. Scindia said.\n\nTathagat Satpathy of the Biju Janata Dal said it was neither the anti-national sloganeering by JNU students nor the Afzal Guru issue that the BJP cared about. The government wanted to divert attention from its failures on the economic front, he added.", 
    "section": "national", 
    "title": "Prove ‘saffronisation’ of education, I will quit, says Smriti", 
    "subsection": "general", 
    "date": "2016-02-25"
}