{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Jail Superintendent says the actor will walk free at 10 a.m. today\n\nA day ahead of actor Sanjay Dutt’s release from the Yerawada jail in Pune, a social worker has yet again moved the Bombay High Court saying his release was reflective of the inequality in the treatment of prisoners. The public interest litigation petition also states that the actor has been given preferential treatment throughout his term in prison.\n\nPradeep Bhalekar, chairperson of the Samajik Karyakarta Saurakhan Samiti, filed the petition on Wednesday pointing out that there are 27,740 others prisoners in the State who deserve to be released on the same grounds as Dutt. The petition also states that the actor has already benefited a lot because of furlough and parole.\n\nMr. Bhalekar wrote a similar letter to the Acting Chief Justice V.K. Tahilaramani on January 7, 2016, a day after the jail superintendent announced that Sanjay Dutt would be freed on February 25.\n\nThe actor was arrested in April 1993 and convicted for illegal possession of an automatic assault rifle — a part of the cache of arms and ammunition that landed ahead of the 1993 Mumbai serial blasts in which 257 people were killed. According to the Maharashtra Home Department, he was given remission (reduction of sentence) on account of good conduct and has spent 18 months in jail.\n\nThe PIL said the remission granted to Dutt is “wrong and illegal.” Appearing for the petitioner, advocate Nitin Satpute asked: “What about all the other convicts, especially in petty offences, who are rotting in jail? They have also filed applications seeking remission but there has been no order on those.” The PIL will be mentioned before an appropriate bench on Thursday.\n\nThe Yerawada Jail Superintendent, U.T. Pawar, said “Dutt will be released tomorrow [February 25] in the morning around 10 a.m.”\n\n(With inputs from PTI)", 
    "section": "national", 
    "title": "Sanjay Dutt’s release challenged", 
    "subsection": "general", 
    "date": "2016-02-25"
}