{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Maharashtra government’s new guidelines for dance bars, which include sending live recordings of CCTV feed directly to the police and a “non-transparent” partition between the dance floor and the restaurant area, did not find favour with the Supreme Court.\n\n“Dance is an art,” said a Bench led by Justice Dipak Misra.\n\nThe court said there was nothing to hide even as dance bar owners alleged that sending live feeds of dance performances was tantamount to violation of the women's privacy. Besides, such a guideline presumed obscenity.\n\n“Why should the stage be covered on all sides? Why should there be non-transparent partition between dance and restaurant areas?” the court asked the State government.\n\nThe Bench asked Additional Solicitor-General Pinky Anand, appearing for Maharashtra, to clarify and report back on March 1, the next date of hearing.\n\nSenior advocate Jayant Bhushan, arguing for the dance bar owners, said the licence was valid only for a stage of 10 feet x12 feet dimension. He listed other restrictive conditions, including permission for only four dancers at one time. These conditions could neither be added nor altered.\n\nThe feed from the CCTV cameras is supposed to be displayed at the police control room according to the guidelines. Recordings up to 30 days would be preserved and placed before a competent authority in case of any dispute.\n\nIn October 2015, the Supreme Court had ushered dance back into the beer parlours and hotels of Mumbai by staying a legal provision in the Maharashtra Police Act prohibiting the entertainment.\n\nBut the court also gave a free hand to the authorities to crack down on the performances if they were found to be “remotely expressive of any kind of obscenity.”\n\n‘Why should there be non-transparent partition between dance and restaurant areas?’", 
    "section": "national", 
    "title": "SC questions Maharashtra guidelines for dance bars", 
    "subsection": "general", 
    "date": "2016-02-25"
}