{
    "author": [], 
    "text": "The Karnataka High Court on Wednesday lifted the stay on enforcement of new rules which enhanced the area for displaying health warning to 85 per cent from 50 per cent of the principal area on the packs of tobacco products.\n\nJustice Ravi Malimath passed the interim order while vacating the earlier interim order, passed on December 4, 2015 staying the Cigarette and other Tobacco Products (Packaging and Labelling) Amendment Rules, 2014 that was notified on October 15, 2014.\n\nThe High Court had stayed the rules on a petition filed by the Karnataka Beedi Industry Association, which had questioned the legality of the rules.\n\nHowever, the Ministry of Health and Family Welfare recently filed an application requesting the Court to vacate the stay by pointing out the direction issued by the Apex Court in 2009 asking the High Courts not to interfere in the implementation of Cigarette and other Tobacco Products (Packaging and Labelling) Rules, 2008, and the matter is still pending before the Supreme Court.\n\nMeanwhile, the counsel for the petitioner-Association had claimed that the Supreme Court’s direction to the High Court was with regard to the rules of 2008 and hence would not apply to the amended rules of 2014.\n\nHowever, Justice Malimath noticed that the Rajasthan High Court in July 2015 had issued direction to the Union government for the strict enforcement of the Rules of 2014 while the Karnataka High Court passed a contrary order of staying the Rules.\n\nJustice Malimath pointed out that the legal issue related to the Rules of 2014 is also pending with the apex court as a litigant had sought a direction for the enforcement of the amended rules of 2014 by questioning the March 26, 2015 notification, which indefinitely deferred display of health warning on the packages of tobacco products.\n\nKarnataka Beedi Industry Assn. had questioned the legality of the\n\nnew rules", 
    "section": "national", 
    "title": "Stay on bigger pictorial warnings on tobacco packs lifted", 
    "subsection": "general", 
    "date": "2016-02-25"
}