{
    "author": [
        "Varghese K"
    ], 
    "text": "Following protests from scholars and students, the University of California Irvine (UCI) has decided to “walk away” from the $3-million grant it received from an Indian American not-for-profit body, the Dharma Civilisation Foundation (DCF).\n\nA faculty committee of the university that reviewed the agreement with the foundation, has decided to drop plans for two chairs in Hinduism and Indian studies immediately and review two other chairs, one in Sikhism and the other in Jainism, which totals another $3 million.\n\nThe DCF has more than 1,000 Indian American donors and the four chairs it agreed with the university through 2015 involved a gift of $6 million in total. Before moving on to setting up chairs, the foundation had funded a series of projects at UCI focusing on Hinduism and Indian culture. The move came in for criticism from scholars and students, who found the conditions set by the foundation restrictive to academic freedom. The faculty committee found the foundation “extremely ideologically driven” with “extreme right wing notions”.\n\nAs the controversy was brewing, the foundation had said it was open to reviewing the agreement with the university. But the faculty review committee has decided that the grant from the foundation was not acceptable.\n\nThe four chairs are Thakkar Family-DCF Presidential Chair in Vedic and Indic Civilisation Studies; Swami Vivekananda-DCF Presidential Chair in Modern India Studies; Dhan Kaur Sahota Presidential Chair in Sikh Studies by Harvinder and Asha Sahota and Shri Parshvanath Presidential Chair in Jain Studies by Meera and Jasvant Modi. One of the stated objectives of the foundation was to have Hindus studying Hinduism, because it thought non-Hindu scholars were misrepresenting the religion — a point that came in for particular opposition from the academic community. “We are troubled by news reports that the [DCF] has put forward its own list of acceptable candidates based on race and religion. Further, we are concerned about reports that the DCF has already brought their favoured candidates to the UC Irvine campus, in the absence of any advertised search for these positions”, a petition signed by professors from Yale, Cambridge, Harvard, and other universities had said earlier.\n\nDharma Civilisation Foundation has more than\n\n1,000 Indian American donors", 
    "section": "national", 
    "title": "U.S. varsity turns down grant for Hindu studies over right wing links", 
    "subsection": "general", 
    "date": "2016-02-25"
}