{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "Aditya-L1, the Indian Sun mission due after three years, may turn out to be a unique formation of not one but two spacecraft looking at the Sun from two stable orbital points.\n\nThat is if the Advisory Committee on Space Sciences, which is the brain behind the country’s extra-planetary missions, has its way. Internal discussions have apparently been launched.\n\nAditya is the nation’s third big extra-terrestrial outing after Moon and Mars, all conceived and designed by ADCOS, the multi-faculty body of the Indian Space Research Organisation.\n\nISRO has started activities to send a 400-kg spacecraft to look at the Sun from a special stable orbital slot called L1 around 2019-20. L1 or ‘Lagrangian’ point # 1 is about 1.5 million km from Earth towards the Sun.\n\nThere are four more Lagrangian points L2 to L5 for Sun and Earth where space objects can resist the pulls of both the celestial bodies and stay relatively stable in that orbit.\n\nAccording to ADCOS Chairman, and former ISRO chief and celebrated cosmic ray scientist U.R. Rao, a second spacecraft can be sent to Point L5, about 1.3 million km away and at a 30-degree angle to L1, for a fuller picture of Sun. It could follow L1 a few months or a year apart, he told The Hindu .\n\nADCOS has designed the 2008 Chandrayaan-1; its future sequel; the 2013 Mars Orbiter Mission and is weighing the pros of either a second Mars mission or a Venus trip — the last of which is attracting other Space agencies as potential partners.\n\nDr. Rao said: “Our ignorance about the Sun is quite large and we need to understand a lot about it. [For example] why is it that the centre of our star is 6,000 degrees Kelvin while the outer corona is two million Kelvin? Some theories are there. So far, we could study the corona from the ground for only a few minutes during total solar eclipses.” Approved by the Centre in 2008-09, the Sun mission was firmed up last year into an upgraded project at the distant L1 point and with a bigger spacecraft.\n\nDr. Rao said early discussions have taken place on a possible L5 mission. ISRO, he said, could use the qualification model of the spacecraft which goes through the same tests and is as good as the final flight model.\n\n“Activities related to the Aditya-L1 mission have started,” confirmed ISRO Chairman A.S. Kiran Kumar. “Two [spacecraft to Sun] together will become unique. Having another one at L5 will give a significant advantage in measurements. We have to still take it up and it must go through all the regular approval processes through the Union Cabinet and budgeting.”\n\nDr. Rao said older L1 Sun missions by the U.S. and Japan could not yield much. The U.S. is now mulling over an L5 mission. “ Personally I think we should go ahead with it.”\n\nThe challenges\n\nThe first task is to build a few ultra-sensitive instruments to accurately measure minute details about the Sun. Dr. Rao said the bigger challenge is to create an all-aluminium 20-metre-high magnetic test facility near Bengaluru to specially assemble and test the spacecraft and instruments in a magnetically clean manner with “not one electric material, not even a car, being nearby”.\n\nA satellite and a launcher each cost around Rs. 200 crore. Can the nation afford a second spacecraft? Dr. Rao said the prototype that qualifies all tests could be sent into L5 as it will be as good as the final one. It would still need another PSLV launcher. “We are trying to see how best to do it at a minimal cost.”\n\nThe mission may be a unique formation of two spacecraft looking at the fiery star", 
    "section": "national", 
    "title": "Aditya gets ready to gaze at the sun", 
    "subsection": "general", 
    "date": "2016-02-09"
}