{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The ruling BJP gathered its allies close after a series of bitter Parliament sessions dealing with the Opposition, not just to ensure better floor co-ordination in the upcoming Budget Session but also to end some of the rancour that certain of its allies feel towards it.\n\nParliamentary Affairs Minister M.Venkaiah Naidu hosted party presidents and floor leaders of the BJP allies, along with the president of his own party, Amit Shah at his residence for a dinner on Monday night for this purpose.\n\n“We thought we should meet and talk of ways in which co-ordination could become easier within our alliance in the upcoming session. We discussed ways in which bills can get passed,” he said.\n\nNDA partners have held a grouse that issues were not being addressed within the alliance. Mr. Shah, in Monday’s meeting assured the alliance partners that he would be meeting each constituent party separately over the next few days. “We will be first holding meetings with the Akali Dal and the Telugu Desam Party,” said Mr.Naidu.\n\nSources said that the Akalis spoke of a package for the State’s farmers that they had asked for from the government, while the Apna Dal, headed by Anupriya Patel, asked that the Backward Classes Commission be given Constitutional status.\n\nThe TDP raised the issue of a special package for Andhra Pradesh as promised at the time of the State’s bifurcation.\n\nThe patient hearing given to NDA partners, a practice till now absent from the discourse, shows that the BJP has learnt the lesson of keeping its friends close.\n\nSources confirmed to The Hindu , that despite urging from its State unit, the BJP has decided to stay with its alliance with the Akali Dal in Punjab and face the Assembly polls in 2017 jointly.", 
    "section": "national", 
    "title": "BJP, allies meet for better coordination", 
    "subsection": "general", 
    "date": "2016-02-09"
}