{
    "author": [], 
    "text": "Lady Gaga’s Hollywood peers have congratulated the pop star on her spectacular performance at Super Bowl 50.\n\nThe 29-year-old Applause hitmaker kicked off the National Football League sporting event by singing her rendition of America’s national anthem The Star-Spangled Banner .\n\nShe belted out the tune in the middle of the playing field at Levi’s Stadium in Santa Clara, California while standing onstage alongside a piano played by a lone pianist.\n\nGaga was visibly moved while singing, tearing up from time to time, but she still delivered a smooth, flawless show nonetheless, ending the gig with a rich long note while jet planes flew overhead in the sky above the venue.\n\nGaga was joined by hearing-impaired Oscar winner Marlee Matlin, who performed the song in American Sign Language, and the 50-year-old actor was elated to have taken part, writing on her Twitter account: She is spectacular. I (love) you @ladygaga. Let’s get together again and make magic — you singing me signing.\n\nOther A-listers were also impressed, with Jessica Jones actress Krysten Ritter gushing: “Well @ladygaga wins the Super Bowl and every other single thing SLAY QUEEN!!”\n\nAlyssa Milano felt shudders as Gaga performed, tweeting: “That was amazing @ladygaga. Chills. Everywhere.”\n\nGaga’s attire for the gig was very patriotic, as she donned a custom sparkly red Gucci suit made from lurex fabric designed by Alessandro Michele. Her make-up matched her clothes, as the star’s bold red eyeshadow was coated in heavy glitter.\n\nComedienne Ellen DeGeneres admired the outfit, joking on Twitter: “Love you so much, @ladygaga. I’m so glad I loaned you my jumpsuit.”\n\nGaga’s singing peers were also dazzled by the act. She is currently in the running for a Grammy in the Best Song Written For Visual Media category for her Oscar-nominated Diane Warren collaboration Til It Happens To You , from documentary The Hunting Ground .\n\nAnd Diane tweeted: “So proud of you @LadyGaga! And 3 weeks from today.....#OSCARS #TilItHappensToYou!” — PTI", 
    "section": "national", 
    "title": "Celebrities praise Lady Gaga for rousing Super Bowl performance", 
    "subsection": "general", 
    "date": "2016-02-09"
}