{
    "author": [
        "S Anil Radhakrishnan"
    ], 
    "text": "The traditional settlements have been declared heritage sites\n\nKerala has banned major architectural changes to homesteads like these at Valiyasala, in Thiruvananthapuram.— Photo: S. Gopakumar.\n\nCenturies-old agraharams, clusters of quaint homesteads built in a row, that represented values of community living and shared space, are set to get a new lease of life with the Kerala government planning to take up restoration work.\n\nThe intervention comes at a time when the traditional settlements of the ethnic Brahmin community are gradually vanishing from the Kerala landscape.\n\nThe government had long ago declared agraharams heritage sites, and banned major architectural changes to the homesteads that dot the streets at Karamana, Valiyasala and Fort in the capital and Kalpathi in the Palakkad district. Now, the Kerala State Welfare Corporation for Forward Communities (Samunnathi) has come forward to undertake repairs and restore 200 residential units in the agraharams of Thiruvananthapuram and Palakkad. Repair and restoration of 200 units belonging to those having an annual income of less than Rs. 2 lakh will be taken up under the scheme.\n\nPriority will be given to households headed by single women, units with differently abled people, children living without protection and transgenders.\n\nOccupationally vulnerable groups such as unskilled workers and casual domestic workers will also get weightage in the selection process.\n\nThe total cost of repair and restoration is pegged at Rs. 4 crore with Rs. 2 lakh for each unit.\n\n“The project is to be taken up during the financial year 2016-17 with the assistance of the government,” said Samunnathi chairman B. Rajasekharan.\n\nA selection committee with representatives from the community and a monitoring committee with experts have been set up.", 
    "section": "national", 
    "title": "Centuries-old agraharams in Kerala to get a facelift", 
    "subsection": "general", 
    "date": "2016-02-09"
}