{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "Culprits zeroed in on families with illegal immigrants in the U.S. and offered to smuggle out their children\n\nThe Bengaluru police on Monday claimed to have cracked a child smuggling racket that used fake documents to secure visa for children who were later sent to the United States. Thirty-two children, under 14 years, from Gujarat, Uttar Pradesh, Bihar and Punjab, have been sent to the U.S. in the past two years, investigations have revealed.\n\nThe children for whom visas were issued by the Chennai Consulate, after fake documents were created to show strangers as parents, were allegedly handed over to their biological parents living illegally in the U.S. The biological parents allegedly paid Rs. 25 lakh per child to be smuggled to the U.S., police said, and added that 16 persons, who posed as parents and flew into the U.S. with children and returned without them, were arrested on Monday.\n\nThe early morning swoop on Monday was the culmination of a year-long probe by a Special Investigation Team (SIT). The arrested include those from Bengaluru, who posed as couples and took the kids, and agents who forged documents.\n\nOnly one real couple was among those arrested, police sources said. More arrests are likely to follow.\n\nUday Pratap Singh, 44, a resident of Jaymahal in the city, alleged kingpin of the racket, reportedly told the police that he scouted villages in Gujarat and Punjab, to zero in on families with illegal immigrants in the U.S. and offered them a deal to smuggle out the children.\n\nThese children would be brought to the city and put up in homes and meticulously trained to act as family. Persons who posed as couples were allowed to interact with the child. Meanwhile, others members in the racket forged and rigged identity documents to show the couple and the child as a family, based on which passports and visas were procured.\n\nThose individuals who posed as couples were given a generous cut in the Rs. 25 lakh and were lured by a free trip to the U.S. In many cases, the couple returned within two days of reaching the U.S., sources said. In some cases, a couple have even taken more than one child during the same trip.\n\nTracking down the 32 kids in the U.S. is key to get to the bottom of the racket, say police officials. Police say some of those to whom kids were handed over in the U.S. may not be the biological parents of the children.\n\nPolice are also not ruling out cases in which people in the U.S. procure kids from their villages claiming to be their biological parents, and later exploit them either for labour or even sell them for adoption.\n\nThe Bengaluru police are now writing to the U.S. consulate authorities in Chennai, but say what is more crucial is collaborating with the U.S. Federal agencies to track the smuggled kids.\n\nPolice say more kids may be flown out of Bengaluru and a similar racket may be active in other cities in the country as well.\n\n“From the documents we have scrutinised and recovered, we have come across 32 kids. But the case has now opened a Pandora’s box and may turn out to be just the tip of the iceberg,” a senior police official said.\n\nDrop box misused\n\nDocuments revealed that none of the children smuggled out faced interviews for visa at the U.S. consulate in Chennai.\n\nThe racketeers misused the drop box facility at the consulate for children below 14 years.\n\nThe facility gives a waiver for visa interview. However, those posing as a couple and parents faced interviews and procured visas.\n\nThe police say more than the misuse of drop-box facility, they are surprised at how the children on temporary visas went under the radar, raising no alarm when their parents returned to India without them.", 
    "section": "national", 
    "title": "Child smugglers in Bengaluru police net", 
    "subsection": "general", 
    "date": "2016-02-09"
}