{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Police arrested three people on Monday after an alleged celebratory firing by Samajwadi Party (SP) workers resulted in a child’s death in Kairana area of Shamli district on Sunday. Vijay Bhushan, Superintendent of Police, Shamli, confirmed that three people were arrested in connection with the death of eight-year-old Sami.\n\nAfter the State government drew severe criticism from several quarters, Chief Minister of Uttar Pradesh Akhilesh Yadav on Monday afternoon ordered the arrest of the SP functionaries responsible for the tragedy. He also suspended senior district administrative officials for their alleged carelessness that led to the boy’s death.\n\nMr. Yadav also expelled the newly-elected block pramukh for “anti-party activities and indiscipline” and served party MLA Nahid Hasan a show-cause notice. The CM directed the Director General of Police and the Superintendent of Police to take stern action against the culprits.\n\n“The State government is committed to ensuring the independent nature of the media and any element obstructing it will not be spared,” Mr. Yadav said. He ordered the suspension of B.P Singh, Kairana SP, and the removal of the Sub-Divisional Magistrate concerned too.\n\nMurder case\n\nSami died when supporters of the ruling party MLA Nahid Hasan were indulging in celebratory firing after the victory of a candidate supported by the party in block-level polls in Kairana subdivision of Shamli.\n\nPolice on Monday registered a case of murder against party member Ghayyur Inam, who won the block pramukh elections, his wife Nafisa and their supporters allegedly responsible for the firing.\n\nThe Chief Minister also tweeted that he directed the DGP to arrest all the culprits and cancel their arms licences. The area DIG was sent to Shamli to supervise the investigation and ensure the arrest of the culprits.\n\nVideo released\n\nA video recording of the incident released by the police showed some six supporters holding revolvers and two-bore guns while firing them.\n\nSami was hit by bullets when he was passing by the area where SP workers were celebrating. He was immediately admitted in the local government hospital, where he succumbed to injuries, leading to protests by local residents.\n\nMeanwhile, alleged attacks on media persons, who were covering protests against Sami’s death, by SP supporters further drew criticism against the ruling government. The administration has ordered an investigation into this incident as well.\n\nTargeting the State government over the attack on presspersons, the BJP and the BSP hit out at the Samajwadi Party, saying “such things were bound to happen when a party of goons was ruling the State.”\n\nChief Minister Akhilesh Yadav suspends senior district officials\n\nfor 'carelessness'", 
    "section": "national", 
    "title": "Child’s death in firing: U.P. police arrest three", 
    "subsection": "general", 
    "date": "2016-02-09"
}