{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "Accused admits to giving falsename in his Indian visa application\n\nLashkar operative David Headley, who deposed before a special court here on Monday through a video link, said he had joined the Lashkar-e-Taiba in 2002 “for a course” in Muzaffarabad in Pakistan, the outfit’s headquarters.\n\n“I heard a speech by Lashkar head and was motivated. Hafiz Saeed ‘saab’ is the head of Lashkar,” Headley said in his deposition in the 2008 Mumbai attacks trial.\n\nHe underwent Daura-e-Am (preliminary training) and Daura-e-Khas (advanced training in weapons and explosives). Another camp called Daura-e-Ribbat (intelligence course) was held in Mansehra, 40 miles from Abbottabad, where Saeed and Lakhvi were present.\n\nThese locations, along with Muridke, are Lashkar strangleholds.\n\nHeadley described Lashkar as “a militant organisation in Pakistan whose goal is to fight the Indian Army and assist the people of Kashmir.” Saeed and Zaki-ur-Rehman Lakhvi would give religious speeches and speak of ‘jihad’ defined as “fight against enemies of Islam.” They, including Headley himself, treated India as their enemy.\n\nHeadley said he visited Pakistan’s Federally Administered Tribal Areas (FATA) with a friend and retired Major Abdur Rehman Pasha to meet a drug peddler Zeb Shah to seek his help in smuggling weapons to India. He was arrested in Landi Kotal, a town next to the Afghan border, on suspicion of being a foreigner in a restricted area. He was carrying literature on India at the time. Major Ali from the Inter-Services Intelligence (ISI) interrogated him and was instrumental in securing his freedom. Headley carried a Pakistani identity card which made things easier.\n\nWhen Headley told Major Ali that he intended to visit India, he introduced him to Major Iqbal, also of the ISI, “because he thought I could be used to gather intelligence,” Headley testified.\n\nChanged identity\n\nHeadley identified Lashkar commander Sajid Mir, also known as ‘Wasi,’ as his Lashkar “colleague.” Mir was his main contact in the outfit. It was on Mir’s instructions that Headley changed his name from Dawood Gilani to David Headley in 2006. He then applied for a U.S. passport under the new name.\n\nThe changed identity was to be used as a cover to enter India. Headley also admitted to giving false information in his Indian visa application to protect his cover. His former schoolmate Tahawwur Hussain Rana, a former Army doctor in Pakistan convicted in the U.S. for providing material support to the Lashkar, helped Headley obtain a multiple-entry business visa through Raymond Sanders, who ran an immigrant law centre in Chicago.\n\nHeadley recognised the names of several 26/11wanted accused from among those put to him by special public prosecutor Ujjwal Nikam. Another alleged Lashkar handler Syed Zabiuddin Ansari alias Abu Jundal is also facing trial in the case. He too appeared in court through a video link from the Arthur Road jail.", 
    "section": "national", 
    "title": "Hafiz speech motivated me, says Headley in deposition", 
    "subsection": "general", 
    "date": "2016-02-09"
}