{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Attorney-General denies that the offices of Tuki, Ministers were sealed\n\nThe Supreme Court on Monday asked the Centre to produce by February 9 a list of all the documents, without sparing any, seized from the offices and residences of the deposed Arunachal Pradesh Chief Minister Nabam Tuki and his Ministers on the orders of Governor J.P. Rajkhowa hours after emergency was declared in the sensitive border State on January 26.\n\n“Give the whole list and they (Tuki and his colleagues) will see what is relevant,” a Constitution Bench headed by Justice J.S. Khehar and comprising Justices Dipak Misra, Madan B. Lokur, P.C. Ghose and N.V. Ramana told Attorney-General Mukul Rohatgi, appearing for the Centre.\n\nNothing secret: Centre\n\nMr.Rohatgi agreed, but added that the information provided by Mr.Tuki’s side that his offices and those of his Ministers were sealed was wrong. “The offices of the Chief Minister and his Ministers were not sealed from day one till today... there is nothing secret,” Mr. Roahtgi submitted.\n\nThe hearing was on the basis of an order passed by the Bench to release the originals of personal papers and copies of office documents and electronic data seized from the Chief Minister’s and his colleagues’ offices as “basic fairness”, so that Mr. Tuki and his colleagues can prepare a capable defence in the Supreme Court against the imposition of President’s rule in the State and personal allegations levelled against them.\n\nThe Governor had issued an office memorandum on January 26, dismissing the State government and directing the seizure of official documents, office equipment and files and sealing of the offices of the deposed Chief Minister and Ministers. Mr.Tuki, represented by senior advocates Fali Nariman and Kapil Sibal, had said the memorandum treated him and his Ministers as “criminals”.\n\nSeized letters\n\nHe had submitted that among the seized documents there were over 100 letters, some acrimonious, exchanged between the Governor and the Chief Minister, which would effectively deal with the personal allegations against him.", 
    "section": "national", 
    "title": "List all documents in court: SC", 
    "subsection": "general", 
    "date": "2016-02-09"
}