{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "Workers give finishing touches to the 400-tonne dump truck kept on display at the Bandra Kurla complex as part of the Make In India Week.- Photo: Prashant Nakwe\n\nMaharashtra will host the biggest pavilion among the 17 State pavilions at the Make in India Week with noted Bollywood art director Nitin Desai showcasing its potential as an investment destination over 10,000 sq ft, even as government officials said the State is likely to sign MoUs worth Rs. 4 lakh crore during the event.\n\nMaharashtra and Mumbai are likely to be among the biggest beneficiaries of the Make in India Week, with the Devendra Fadnavis government going all out to make it a showpiece event.\n\nThe State will begin its pitch for investment on February 14 with the Maharashtra Textile seminar to attract investment in textile parks. “Though Maharashtra is one of the largest cotton producing States, only 25 per cent of its produce gets used here. So in line with from-farm-to-fashion call given by the Prime Minister, we intend to scale it up to ensure that all the cotton gets utilised with direct benefit to farmers,” Chief Minister Devendra Fadnavis said at a curtain raiser press conference on Monday.\n\nIndustry stalwarts such as Ratan Tata, chairman, Tata Trusts, and Mukesh Ambani, chairman and managing director Reliance Industries, along with Finance Minister Arun Jaitley, Railway Minister Suresh Prabhu and Power Minister Piyush Goel, will participate in a Maharashtra Investment Seminar. With the Supreme Court giving clearance for hosting the Maharashtra Night at Girgaum Chowpatty, the Fadnavis government has commissioned art director Nitin Desai to create a huge 160 by 120 feet stage for the cultural extravaganza. The open-to-public event will showcase Maharashtra’s art and culture through entertainment.\n\nActor Amitabh Bachchan will read a specially written poem on Maharashtra with dancers enacting it, and Hema Malini and her troupe will perform Ganesh Vandana.\n\nThe grand coronation of Chhatrapati Shivaji will be recreated followed by a grand display of fireworks and a laser show.\n\nCricket legend Sachin Tendulkar, actor Madhuri Dixit, and singer-composer Shankar Mahadevan have been roped in to feature in promotional films on Magnetic Maharashtra.\n\nIndustry captains Ratan Tata, Mukesh Ambani to attend investment seminar", 
    "section": "national", 
    "title": "Maharashtra bets big on ‘Make in India’ Week", 
    "subsection": "general", 
    "date": "2016-02-09"
}