{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India and the United Arab Emirates are set to strengthen cyber security mechanism to track radicalisation of youth in South Asia and West Asian region. Over the last several months, India-UAE cooperation has prevented several radicalised youths from joining the ranks of the Islamic State (IS).\n\nBoth sides are expected to sign a number of agreements on cyber security and law enforcement during the February 10-12 visit by Abu Dhabi’s Crown Prince Sheikh Mohammed Bin Zayed Al Nahyan.\n\n“MoUs on cyber crime prevention, cooperation in security operations and exchange of critical information will be signed to start a new generation of strategic cooperation between India and the UAE during the visit,” UAE’s ambassador to India Ahmad A. R. Al Banna told The Hindu on Monday.\n\nMr. Al Banna pointed out that security collaboration has become the centrepiece of India-UAE cooperation, especially since Prime Minister Narendra Modi visited Dubai in August 2015. Cyber security experts have pointed out that the cooperation between the UAE and India on cyber security has helped in tracking radicalisation in India as well as inside Pakistan. Agreements on security and cyber security will be part of a total of 16 agreements that are expected to be signed during the visit which will also include an agreement on nuclear research and development, and aerospace collaborations.\n\nThe visit by the Crown Prince is also expected to lead to the signing of an MoU on nuclear cooperation between India and the UAE.\n\n“The nuclear agreement will be signed in conformity with international legal framework. The MoU will focus on exchange of information and experts on nuclear issues. We are building a centre on nuclear research and development in the UAE and our international partnership is aimed at building a support base for the project,” Mr. Banna said.\n\nBoth sides have maintained a steady flow of high level exchanges after the Joint Statement of August 2015 promised to build institutionalised dialogue involving National Security Advisors and other specialists in sensitive areas. Both sides will also work towards better coordinated responses to international crises like Syria that has emerged as the centre of activities for the Islamic State.\n\nCyber security specialist Subimal Bhattacharjee told The Hindu that the visit of the Crown Prince will provide a new opportunity to better coordinate cyber emergency responses from India and UAE and track online attempts at radicalisation. “The strategic and security partnership between India and the UAE shows how the strategy to fight radical ideas is becoming better coordinated both at the bilateral and multilateral levels,” Mr Bhattacharjee said.", 
    "section": "national", 
    "title": "Many pacts await Abu Dhabi Prince’s visit", 
    "subsection": "general", 
    "date": "2016-02-09"
}