{
    "author": [], 
    "text": "A quarterback looks to pass the ball in a football game in Chicago. The way air moves around different shapes plays a significant role in the flight of all sports balls.\n\nAerodynamics engineers are studying sports balls to learn lessons in aerodynamics that will help build aircrafts more earth-friendly and allow spacecrafts to take the most efficient route to Mars in the future.\n\nAerodynamics is the study of how air and liquids, referred to collectively as “fluids,” flow around objects.\n\nBy understanding how fluids flow around basic shapes such as cylinders and spheres, NASA’s engineers predict how even minor alterations in these basic shapes change flow patterns and events like Super Bowl come handy.\n\n“Sports provide a great opportunity to introduce the next generation of researchers to our field of aerodynamics by showing them something they can relate to,” said Rabi Mehta, chief of the Experimental Aero-Physics Branch at NASA’s Ames Research Centre — located less than 16 km from the home of Super Bowl 50 — Levi’s Stadium in Santa Clara, California.\n\nThe way air moves around different shapes plays a significant role in the flight of all sports balls. What is the best way to throw a football? Why does a curve ball curve, why does it knuckle?\n\nResearchers can demonstrate the science behind these complex questions using relatively simple visualisations of fluids flowing over sports balls in small test facilities at NASA.\n\nA football is shaped like a wing and more aerodynamic than a round ball so the flow is very different.\n\nWhen a quarterback throws the football, he ideally wants to throw a tight spiral with high rotation rate to help stabilise the ball as it flies through the air. “This produces lower drag than a wobbling ball so it will get there faster. Wobbling balls are also harder for the receiver to catch and more easily picked off by the defense,” Mr. Mehta added.\n\nKicking is another aspect of football aerodynamics. “We’ve all seen how critical the final kick can be, if the ball is a little bit off you can lose the whole game and the entire season,” said Mr. Mehta.\n\nIdeally the kicker should kick the ball so that it spins along the horizontal axis, if angled the ball veers sideways. Mr. Mehta speaks to athletes using visual tools to illustrate aerodynamics concepts. “The understanding on their faces is remarkable, and that, I find very gratifying,” he said. — IANS", 
    "section": "national", 
    "title": "NASA engineers use Super Bowl to understand aerodynamics", 
    "subsection": "general", 
    "date": "2016-02-09"
}