{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "In a State where progressivism is locked in combat with the forces of dubious spiritualism and superstition, the spectacle of a godman allegedly practising his legerdemain upon Amruta Fadnavis, wife of Maharashtra Chief Minister Devendra Fadnavis, has raised eyebrows, besides generating brouhaha. Pictures and clips of Ms. Fadnavis seen seeking the blessings of godman Guruvanand Swami at a function in a management institute here went viral on Monday, hours after the event.\n\nMs. Fadnavis was in the city to accept an award from the Suryadatta group of institutes, and the godman was the ‘chief guest’ at the ceremony.\n\nThe clips show Ms. Fadnavis seeking the godman’s blessings after her acceptance speech. In an ostensible sleight-of-hand, he conjures up a gold necklace and hands it over to her, astonishing and delighting the audience.\n\n“The Guruji is of my grandfather’s age and as befits our tradition, it was natural that I should go and seek blessings from him when he invited me. The necklace was already in his hand when he offered it to me. It was no trick,” Ms. Fadnavis clarified after the function. Besides causing embarrassment in the context of the Maharashtra anti-superstition law, the incident has upset activists who have been waging a battle against blind faith and sectarians after the recent murders of Communist leader Govind Pansare and rationalist M.M. Kalburgi.\n\nThe murder of rationalist Narendra Dabholkar in August 2013 compelled the Maharashtra government to pass the Maharashtra Anti-Superstition and Black Magic Act that year. The law became the template for the Assam and Karnataka governments.\n\n“It is incumbent upon the godman to answer whether the necklace was a trick or not. If so, the vigilance officer ought to immediately probe the matter as it is a crime under the Act. The incident, if true, is especially embarrassing in a State whose anti-superstition law was the product of long years of tireless struggle against superstition,” said Hamid Dabholkar, son of Narendra Dabholkar.\n\nPictures of a godman conjuring up the jewel for Amruta Fadnavis have gone viral", 
    "section": "national", 
    "title": "Necklace from thin air for CM’s wife", 
    "subsection": "general", 
    "date": "2016-02-09"
}