{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Even as Lashkar-e-Taiba (LeT) operative David Headley deposed in a Mumbai court as an “approver” in the 26/11 case being probed by the Mumbai Police, the National Investigation Agency (NIA) said he continued to be an accused in its case.\n\nAn NIA officer said the agency’s multiple requests to the U.S authorities for Headley’s extradition remained “unexecuted,” but there was a “movement in a positive direction.”\n\nThe NIA is investigating the larger conspiracy behind the attacks, planned by the LeT-Harkat-ul-Jihadi Islami (HuJI) combine, which goes beyond 26/11.\n\n“Our stand is clear. He is still an accused for us and we will continue to press the U.S authorities for his extradition. Our case against him and Tahawwur Rana still hold ground. Till now, we have no intention of making him an approver,” an NIA officer said.\n\nHe said that if at all this possibility of Headley being turned into an approver was explored in future by the NIA, it would be done so by the prosecutors and not by the investigating agency. “There are so many aspects to the conspiracy and their implications, which have not been explored yet. We need Headley’s custodial interrogation to unearth the entire terrorist module,” he said.\n\nAn NIA charge sheet filed in 2011 said Headley did not stop at conducting reconnaissance and planning the 2008 attack, but was also involved in the “execution of other future planned attacks [on various Chabad Houses and the National Defence College, Delhi] at the behest of LeT and HuJI.”\n\nHeadley travelled to India again in March 2009 to conduct recce for the attacks, before being arrested at O’Hare Airport, Chicago, in October that year. Headley has been sentenced to 35 years in prison by a U.S. court.\n\nOur stand is\n\nclear. Headley is still an accused\n\nfor us, says\n\nNIA officer", 
    "section": "national", 
    "title": "NIA to press for extradition", 
    "subsection": "general", 
    "date": "2016-02-09"
}