{
    "author": [], 
    "text": "“We had issued a consultation paper just about 60 days ago on differential pricing …We deliberated on the issue for quite some time … Anything on Internet cannot be differently priced. This is the broad point that we have highlighted in the regulation,” TRAI Chairman R.S. Sharma told reporters at a conference.\n\nThe regulator and Facebook have been at loggerheads over the issue with the authority terming the social networking giant’s attempt to lobby for its Free Basics initiative a “crude” attempt at turning the consultation over differential pricing of data services into an “orchestrated opinion poll” on Free Basics. Facebook had partnered with Reliance Communications in India to offer Free Basics service. However, the services were put in abeyance, post a TRAI order to this effect.\n\nDisappointed: Facebook\n\nIn an emailed statement, a Facebook spokesperson said, “While disappointed with the outcome, we will continue our efforts to eliminate barriers and give the unconnected an easier path to the Internet and the opportunities it brings.”\n\nThe TRAI said tariff for data services could not vary on the basis of the website/application/ platform/ or type of content being accessed. For example, a consumer could not be charged differently based on whether she was browsing social media site A or B, or on whether she was watching streaming videos or shopping on the Internet, it added.\n\nIt, however, said that to bring more users on the Internet, this prohibition would not apply to other forms of tariff differentiation that were entirely independent of content. “For instance, providing limited free data that enables user to access the entire Internet is not prohibited,” the TRAI said.\n\nWhile the move was cheered by Net Neutrality activists and industry bodies such as Nasscom and IAMAI, telecom operators, who had been pushing for allowing of differential tariff for data service, expressed disappointment saying the ruling would impact the Narendra Modi government’s ambitious Digital India initiative.\n\nRajan Mathews, Director-General of operators’ body COAI, told The Hindu : “We are very disappointed with the ruling. Differential pricing is an effective marketing tool and would have helped in bringing online the next one billion people. We are confused as the decision comes at a time when the government is pushing adoption of Internet.”\n\n“It will negatively impact the growth of the industry and the consumers who may need such plans to afford data connections. We are looking at this closely to examine TRAI’s rationale as to how this purportedly hurts customers or negatively impacts markets or even hinders internet access,” he said.\n\nHemant Joshi, Partner, Deloitte Haskins & Sells LLP, said differential pricing for different levels of services was a well-accepted principle across all industries and the concept inherently recognised the economic principle of paying differently for different levels of service and experience.\n\n“For example, the differential pricing for the 2nd class, 1st AC, sleeper class, etc. based on different experiences and service levels … In the telecom sector there are virtual highways that need to follow the same principle. EU is considering allowing ‘specialised services’ with few priority services having fast lane Internet connection. More awareness and education needed around the economics of differential pricing and its long-term implications on the industry and the consumer,” Mr. Joshi said.\n\nPositive indication\n\nMeanwhile, Net Neutrality activists see it as a positive indication for future regulations on issues such as regulation of over the top applications such as WhatsApp and Skype. “The regulations are very progressive. They do not seek a middle ground but take a clear stand …We do expect a positive response on the larger issue of Net Neutrality,” said Karthik Balakrishnan, a member of Savetheinternet.\n\nAs per the regulations released on Monday, existing plans which are in contravention of the rules can continue for six months, post which they will need to be stopped. Within few hours of the regulations being released, Net Neutrality was the top most trending topic on Twitter in India.", 
    "section": "national", 
    "title": "No differential rates for data services, rules TRAI", 
    "subsection": "general", 
    "date": "2016-02-09"
}