{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Amid the stalemate over government formation in Jammu and Kashmir, BJP president Amit Shah has authorised party general secretary Ram Madhav to initiate dialogue with the People’s Democratic Party (PDP) on reviving prospects of an elected government in the State.\n\nTop sources in the party have confirmed to The Hindu that Mr. Madhav, who was instrumental in forging the rather complicated alliance between the BJP and the PDP in the first place, will be travelling to Srinagar in the coming week itself.\n\nThe terms of reference of this dialogue have been restricted to the Agenda of Alliance, or the common minimum programme agreed to between the two parties when the late chief minister Mufti Mohammad Sayeed was alive.\n\n“We stick to the Agenda of Alliance and are willing to go further in some aspects as well, but all that can only be activated once there is an initial decision on forming the government,” said the source.\n\nFebruary 17th is also the 40th day of mourning after the demise of Mr. Sayyeed, when ritual mourning ends among Muslims. Mr. Madhav may attend that ceremony as well. According to sources in the BJP, the party understood that the PDP had lost some ground over its alliance with the BJP, but, “the nature of the mandate was such that no other possibility existed.”\n\nIn the 87-member J&K Assembly, the PDP has 28 seats and the BJP 25. The Congress party and the National Conference have 12 and 15 members each. Sajjad Lone’s People’s Conference with another MLA in tow is allied with the BJP.\n\nA meeting at the highest levels, between party president Amit Shah and PDP leader Mehooba Mufti is not slated as of now. “It can take place only after details are sorted out,” said the source.\n\n“We are keen that there is government formation, but it cannot be all put at our door. The decision on whether or not has to be taken by the PDP, details can be worked out, otherwise the State can see a prolonged tenure of Governor’s rule as it is now,” said the source.", 
    "section": "national", 
    "title": "Ram Madhav to talk to Mehbooba in fresh bid to end J&K stalemate", 
    "subsection": "general", 
    "date": "2016-02-09"
}