{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Hours after a dreaded criminal was gunned down in an encounter by the Gurgaon police in Andheri, another area in Mumbai was witness to a fierce gun battle in the early hours of Monday morning.\n\nThe exchange of bullets, which occurred between policemen and members of the infamous ‘ chaddi banian (shorts and vest)’ gang that had allegedly been terrorising people in the area for the past one week, left six policemen and one robber injured.\n\nChaddi banian robbers are a dreaded criminals, who belong to the Pardhi community. They wear shorts and vests, and apply oil or grease over their bodies to make it difficult for police or people to overpower or catch them. They are also known to be particularly ferocious, and don’t hesitate to attack anyone, including policeman, with any weapons that they may be carrying.\n\nAccording to police officials, the confrontation occurred at around 4am on Monday in the Shimpoli area in Borivali.\n\n“We received information from the Control Room at around 3:30 am that a chaddi bainan gang had barged into the residence of an elderly couple in Satya Nagar, Borivali east. A team headed by Assistant Commissioner of Police Suresh Pujari, Borivali division and comprising senior police inspector Gunaji Sawant and other officials from the Borivali police station was rushed to the spot. Based on the information we had received, the team tracked down the robbers to the forest area in Shimpoli, where they were believed to be hiding,” said DCP Vikram Deshmane, Zone XI.\n\nMr Deshmane said that as soon as the police team approached, stones were pelted and shots were fired at them. The policemen took cover behind their vehicles and returned fire. Three accused, identified as Ashok Shinde, Sanjay Kale and Ramesh Kale were apprehended from the spot.\n\n“Some distance ahead, our team found one more accused hiding in a ditch. He had rubbed mud all over himself to try and blend into the surroundings. The valuables that the accused had robbed from the elderly couple were recovered from him and he was placed under arrest as well,” said Mr Deshmane.\n\nBy late Monday morning, a team of nearly 150 policemen, including police station and Crime Branch personnel, had fanned out into the Shimpoli forest in search of the remaining accused. Preliminary questioning of the arrested accused has revealed that they had three more accomplices with them, said officials.\n\nInvestigations have also revealed that in the early hours of Sunday morning, this gang had burgled two houses in the MHB Colony in Borivali (East). On their way out of the society, they saw a group of three women who were returning home after attending a social function and robbed them as well.\n\nThe accused are also suspected to have been behind a string of similar robberies in the Mira-Bhayander area in the Thane district.", 
    "section": "national", 
    "title": "Six cops, one robber injured in early morning Mumbai gun battle", 
    "subsection": "general", 
    "date": "2016-02-09"
}