{
    "author": [], 
    "text": "Kher’s band treads the path of spiritual Indian music while adding western elements\n\nWhile the definition of Sufi music is getting blurred in these modern times, especially when bands are trying to add different elements to the devotional style, Kailash Kher’s band Kailasa still treads the path where fusion and devotion are juxtaposed with sincerity. The singer says the aim of their music is not just to entertain, but also to enlighten the masses.\n\n“Kailasa’s music is not just entertainment, but it is very enlightening also. The music doesn’t entertain, but creates an awakening in the listener. It opens the mind, gives a vision and at the same time, gives fun to the listener,” Kailash said on the sidelines of the SulaFest here.\n\nKailasa, which treads the path of spiritual Indian music while also incorporating western elements, has existed since 2005 and has released four studio albums till date. The band has played live in India and across the globe, thus spreading their sound and vision on a grand scale.\n\nYet, after all these years of creating and performing music, Kailash says the band always assesses the crowd at their concerts, as he doesn’t want to sound too preachy.\n\n“We decide our repertoire because we have a limited set of time. So among us, we decide what kind of crowd it is. We think that there are so many songs by Kailasa which cater to different moods,” Kailash said.\n\nFor most performers, especially Kailash, having an intimate connection with the crowd is pertinent. However, sometimes it is also important to not go overboard with the message, he says.\n\n“The relation between audience and performer is very intimate. It is a love-based relationship. You know the vibe... how you will impress your lover. You need to feel the love, so in that case, you need to decide the repertoire,” the 42-year-old said.\n\n“Along with fun, our music also teaches. So, we have to think before delivering this kind of music to a particular audience. We have to assess the crowd at each concert and think how much of our message do we need to deliver,” Kailash said. — IANS", 
    "section": "national", 
    "title": "‘The music of Kailasa is enlightening’", 
    "subsection": "general", 
    "date": "2016-02-09"
}