{
    "author": [
        "Josy Joseph"
    ], 
    "text": "David Headley may have appeared before a Mumbai court via video conference to be cross-examined in the 2008 Mumbai attacks, but for many observers it is yet another episode in a scripted drama that is meshed with the larger strategic realities of south Asia and U.S. interests in the region.\n\nA section of the security establishment believes that all the developments surrounding Headley until date is part of the many mysteries surrounding 26/11 Mumbai attacks, while others say that India is just making the best out of a bad situation.\n\nThe deposition of Headley via video link from the U.S. on Monday fits into the theories of those who have not been convinced by the U.S. claims on Headley and even the narrative of how 10 terrorists stormed Mumbai.\n\nThese sceptics believe Headley was not just an informant for the US Drug Enforcement Administration but played a bigger role in South Asia. They point out that there is reasonable evidence to believe that at least some of the inputs regarding a possible attack on Mumbai before the 2008 terror strike, especially in the run up to it, came from Headley. “After the attacks why did they not share information about his movements, especially his visit to India after the attacks?” he asks.\n\n‘He’s a double agent’\n\nMany officials in the past have gone on record to raise their doubts about the conduct of Headley, and even the U.S. agencies. Former Home Secretary G.K. Pillai has pointed out that the U.S. authorities knew more about Headley than they have said in public, arguing that he was a double agent.\n\nSuch lingering doubt about the conduct of the U.S. carried on to the way they hurriedly, and without letting India know, arranged the plea bargain of Headley. The bargain included conditions such as no capital punishment, no extradition and an agreement to depose in foreign courts if required but via video link. “That had effectively sealed any possibility of Headley ever facing trial in the land where he carried out the carnage,” one official argued.\n\nHowever, many others say that it was understandable why the U.S did not disclose the identity of Headley. They point out the stringent provisions of America’s Intelligence Identities Protection Act, under which stringent punishment is meted out to anyone disclosing names of undercover agents. Headley, after all, was officially an informant of the drug enforcement administration.\n\nVappala Balachandran, a former special secretary in the Cabinet Secretariat who was a member of the official committee that probed police performance during the 26/11 Mumbai attacks, says India should now see how best to make use of Headley’s testimony.\n\nHe pointed out that at least Indian prosecutors are getting to ask direct questions to Headley. “He could reveal something new,” he said.", 
    "section": "national", 
    "title": "U.S. claims not convincing", 
    "subsection": "general", 
    "date": "2016-02-09"
}