{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Collection and disposal of garbage after the flood continues to be a challenge for the Chennai Corporation.— Photo: M. Moorthy\n\nConcerned about rising manpower issues faced by private conservancy operator Ramky, the Chennai Corporation has brought in workers from Andhra Pradesh to improve conservancy operations in many areas.\n\nMore than 25,000 conservancy workers are at work in the city. Corporation officials alleged that the conservancy operator Ramky has been unable to cope with manpower issues. Starting Friday, a team of officials from the Ministry of Urban Development will start screening all aspects relating to sanitation for Swachh Bharat Mission Awards, according to officials.\n\nThe additional workers from Andhra Pradesh are expected to improve street sweeping operations on Friday, Saturday and Monday during the inspection of the officials for Swachh Bharat Awards. The team of officials will screen a wide range of good practices across various categories to improve “sanitation service delivery” levels to the residents, officials said. The civic body is planning to showcase innovative, inspiring and sustainable models in sanitation management practices in all the zones to the officials. But manpower remains a challenge.\n\nHowever, Ramky officials denied that workers were brought from Andhra for conservancy operations in zones such as Teynampet, Kodambakkam and Adyar. “The workers from Tirupathi, Ongole and Nellore worked during the floods. They have returned to Andhra,” said an official of Ramky.\n\nHowever, conservancy work continues to be carried out by workers from Andhra in zones cleared by Ramky. According to sources in Chennai Corporation, all the 25,000 conservancy workers have been asked to report to work during Friday, Saturday and Monday.\n\n“Ramky is struggling with manpower. More than 15 per cent absenteeism of workers may affect conservancy. Officials from the Ministry of Urban Development will also interact with residents to assess the condition of open defecation and street cleaning,” said an official of Chennai Corporation.\n\nMore than\n\n25,000 conservancy workers are at work in Chennai", 
    "section": "national", 
    "title": "Absenteeism forces Corpn. to get staff from AP", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}