{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A three-year-old boy began to throw temper tantrums when he returned to playschool following the floods.\n\nHer teacher I. Sangeetha says the child started refusing to colour using crayons.\n\nAfter talking to him for many hours, Ms. Sangeetha came to know that the child had lost his crayons when the floodwaters invaded his home at MMDA Colony, Arumbakkam.\n\n“The reluctance of the boy’s mother to retrieve the crayons from the floodwaters had dealt him a psychological blow. The frustrated child had apparently resolved not to use crayons anymore. He seemed unable to control his frustration. We talked to him and made him tell a lot of stories about the floods. This reduced the impact of the incident, changing his behaviour,” said Ms. Sangeetha.\n\nNot just teachers such as Ms. Sangeetha, but NGOs too are trying to address the issue.\n\nWith support of institutions such as the National Institute of Mental Health and Neurosciences, a few NGOs have started organising psychosocial care and counselling sessions in the city after the floods.\n\nInnovative research\n\n“Often the numbers that need such counselling are far beyond the availability of mental health experts. This has encouraged innovative research and practices on community based psycho-social care and counselling by which the simple tools and techniques of counselling can be taught to the community workers and other local level functionaries including school teachers,” said K. Shanmugavelayutham, Convenor of Tamil Nadu People’s Mental Health Forum.\n\n“Every disaster results in deaths and injuries, damages and destruction, which are always visible. What is not so visible is the mental agony, trauma and stress of the survivors,”\n\n“Often the invisible impact of disasters on people escape the notice of decision makers. Such distress continues for years after the physical damages have been restored and reconstructed. Early recognition and counselling would prevent such prolonged agonies,” said Dr. Shanmugavelayutham.\n\nA few NGOs have been organising psychosocial care and counselling sessions in the city", 
    "section": "national", 
    "title": "Addressing trauma triggered by floods", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}