{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "The textile industry had submitted its suggestions to the Union Textile Ministry and the Ministry has sent its recommendations to the government. -File photo\n\nWith just a few more weeks for the Union Budget, industries here expect reduction of duties on some products and implementation of GST (Goods and Services Tax) after studying its impact on all the sectors.\n\nThe textile industry had submitted its suggestions to the Union Textile Ministry and the Ministry has sent its recommendations to the Government.\n\nSources in the industry here say the main demand is reduction of excise duty on manmade fibre from 12.5 per cent to six per cent, removal of four per cent special additional duty on manmade fibre and restoration of interest subvention scheme covering the entire textile value chain. The import duty on manmade fibre should be reduced so that the domestic textile units are able to get raw material at affordable prices.\n\nMembers of the Indian Texpreneurs Federation have individually submitted their request for reduction of excise duty on man-made fibre. They have also suggested to the Government to organise an annual event in the country that will provide a platform for textile manufacturers from different clusters to showcase their products. Domestic and international buyers can meet suppliers and manufacturers from different States and know more about the products made in India.\n\nIn the case of the engineering sector, the Southern India Engineering Manufacturers’ Association seeks efforts to improve the competitiveness of the domestic units, especially of pumpset manufacturers. The basic price of raw materials available to the industries should be competitive so that the units will have price advantage in international and domestic markets. Otherwise, even in the local market imported products cost less than those made by the units here.\n\nInterest subvention\n\nThe three per cent interest subvention given to exporters should be available to all micro, small and medium-scale enterprises as the cost of finance is high now.\n\nIn the case of GST, association president V. Lakshminarayanaswamy says the pumpset sector fears higher tax compared to the existing rate if the GST is implemented. It is 11 per cent now and the rate might go up to 20 per cent or more. Hence, the impact of GST on the pumpset sector should be studied and streamlined before it is implemented.", 
    "section": "national", 
    "title": "Ahead of budget, industries seek lower tax, financial support", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}