{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Despite the Supreme Court agreeing to hear the case against jallikattu on Tuesday, the uncertainty over the conduct of the sport has not dispirited the bull owners here — they are busy training their bulls and adhering to strict diet routines with the optimism that jallikattu will happen during Pongal.\n\nMajority of the jallikattu bulls are taken for a walk in the mornings for about two to four kilometres. They are also taken for a swimming routine every alternate day. “It is important that the bulls do not put on a lot of weight and become lazy. The walking and swimming routines keep them brisk,” said R Veeranasamy, a bull owner from Karuppukal.\n\nThough the walking and swimming routines are followed throughout the year, the frequency is increased in the run up to the jallikattu event during Pongal.\n\nThe bulls are also let to plough a heap of mud or sand with their horns every morning as a training routine. “The bulls are inherently ferocious. This ploughing also helps them in letting out their ferocity,” said A Prabhu, another bull owner from Avaniyapuram.\n\nApart from the owners, only a couple of men or women are allowed near the bulls to feed and train them to ensure that they do not get accustomed with strangers.\n\nThe bull owners claim that the training was only to keep the bulls fit and not to teach them in attacking the tamers. “With young bulls, we let men near them to see how it reacts and gauge whether it was suitable for the sport. Once the bull faces the arena, it doesn’t require any training to handle the tamers,” said P. Rajasekaran, president of the Tamil Nadu Jallikattu Peravai.\n\nA strict diet routine is also followed with slight variations between the bull owners.\n\nWhile the diet mainly included one kg each of cotton seeds, wheat and powdered toor dal everyday, some bull owners also feed multi-grain mixtures, dates and nuts, mainly for the last two months before the Pongal jallikattu .\n\nThe bulls are generally not fed more than twice a day, apart from regular intake of water and straw.", 
    "section": "national", 
    "title": "Bulls get ready to face the arena", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}