{
    "author": [
        "Annie Philip"
    ], 
    "text": "Visually-challenged clinical psychologist to share his adventures in Puducherry\n\nAdventures are for everyone who has a love for sport, not just for the able-bodied is what Divyanshu Ganatra would have you believe. Mr. Ganatra, a clinical psychologist, in May 2014, is believed to have become the first visually-challenged person to fly solo on a paraglider.\n\nOn Tuesday, he will be sharing his incredible story with Puducherrians on not just his paragliding adventure, but trekking, mountaineering and beating the odds.\n\nWhile Mr. Ganatra lost his eyesight to glaucoma when he was 19, he has also fought off tuberculosis in his journey to success. The Pune-based educationist and researcher has several achievements under his belt including co-founding the Adventures Beyond Barriers Foundation which promotes adventure sports for persons with disability and able-bodied people together, and setting up the Yellow Brick Road which works in the area of human resources and running his own IT company.\n\nHis effort won him the National Award for the Welfare of Persons with Disabilities and was chosen for the ‘Ten Outstanding Young Indians Award’ by a youth organisation.\n\nWith his work in psychology, counselling, personality development and therapy, Mr. Ganatra does much in the field of mental health. In Puducherry, he will also be sharing his vision of changing lives of Children with Special Needs.\n\nThe talk is being organised by Satya Special School, Puducherry. Among participants at the talk will be 35 students and faculty from the India Winterim program of the University of Iowa, US, which is one of the largest study abroad programmes among US universities. The students, who are here for three weeks, spend their time with various NGOs.\n\n“Divyanshu’s attitude towards disability is amazing. He challenges the notions of what is possible. The talk will be a boost to the parents of the children with special needs in our school, and for us who work in this field,” says Chitra Shah, director, Satya Special School.\n\nWhile motivational talks and such programmes are usually organised in metro cities, Ms. Shah says they have plans to bring out a series of talks by achievers and those with special needs to raise awareness. Mr. Ganatra’s talk will take place at Hotel Atithi from 3 p.m. on Tuesday.", 
    "section": "national", 
    "title": "Challenging disability, Ganatra way", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}