{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Residents throng collection centres in zonal offices\n\nPublic waiting in long queue in front of the multi-department service centre in Palayamkottai on Monday for paying tax.— Photo: A. SHAIKMOHIDEEN\n\nThe Tirunelveli Corporation’s intensive tax arrears collection drive has started yielding excellent results with the residents thronging the collection centres in the zonal offices.\n\nThe Tirunelveli Corporation, after a gap of ten years, has sent the ‘demand notices’ to the residents asking them to pay the tax arrears since the cash-starved urban local body is badly in need of funds for executing its development works.\n\nOn receiving Tirunelveli Corporation’s demand notice urging the residents to clear tax arrears immediately to avoid stringent action, including snapping of drinking water and drainage connection, the residents throng the zonal offices of the urban civic body to pay their outstanding taxes including property tax, drinking water tax, vacant land tax etc. However, the number of counters available in the zonal offices is not adequate to meet the sudden spurt in requirement.\n\nAs only one counter was functioning in the multi-department service centre on the Palaymkottai zonal office premises on Monday morning against the sanctioned number of three counters, a long queue was standing in front of the building.\n\n“As the Corporation wants us to pay the arrears immediately, the tax payers’ number has increased manifold. However, the number of counters functioning in the zonal offices doesn’t match the increased number of tax payers coming to clear the arrears. Hence, the Corporation administration should open additional counters,” said N. Rajalingam of Palayamkottai while waiting in the long queue at Palayamkottai zonal office.\n\nCommissioner S. Sivasubramanian said the State government was holding talks with four banks on paying the taxes payable to the Corporations in their counters and a final decision was expected within a week.\n\n“In addition, we’re also holding talks with the Department of Posts for extending the same facility in their counters. On Monday alone (January 11), we’ve collected Rs.24 lakh and this drive will go on until all tax arrears except that are entangled in litigations are collected,” said Mr. Sivasubramanian.", 
    "section": "national", 
    "title": "Corporation tax collection drive fructifies in Tirunelveli", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}