{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Total cost of the contract is Rs. 21.59 crore; contract period is for five years\n\nAs part of Phase II of Mettur – Salem Dedicated Water Supply Scheme, feeder pipeline was laid near Thiruvakavundanur Bypass in Salem.— PHOTO: E. LAKSHMI NARAYANAN\n\nThe City Municipal Corporation has floated tender for operation and maintenance of the Rs. 320.54-crore Mettur – Salem Dedicated Water Supply Scheme for a period of five years at a total cost of Rs. 21.59 crore.\n\nThe scheme to supply 120 Million Litres Per Day (MLD) to residents in 60 wards was being implemented in two phases. The Rs. 188.42-crore Phase I was completed and currently water was drawn from the downstream of Mettur Dam at Thottilpatti and treated and sent to Mamangam, the city’s entry point.\n\nAt present, residents are supplied water through the existing pipelines. The Rs. 132.12-crore Phase II is being carried out with laying of main pipelines and construction of overhead tanks in progress in the city. This work is expected to be completed in another two months and the scheme is to be fully commissioned.\n\nAs per the agreement, the contractors will handover the scheme to the City Municipal Corporation which has to operate and maintain.\n\nBut the Corporation does not have any provisions for the same as there is no man power or technical expertise.\n\nHence, the Corporation has invited bidders at national level for operating and maintaining the system, that includes raw water pumping, water treatment, clear water pumping, storing and conveying of clear water including civil, mechanical, electrical, pipeline and instrumentation components at Thottilpatti, Mettur to the city’s entry point at Mamangam.\n\nThe total cost of the contract is Rs. 21.59 crore and the contract period is for five years. Last date for submission of bidding documents is on January 22 at 3 p.m.\n\nOfficials said that the contractor was responsible for undisrupted supply of protected drinking water to the Corporation round-the-clock.", 
    "section": "national", 
    "title": "Corporation floats tender for operation of water supply scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}