{
    "author": [], 
    "text": "All stations on Koyambedu-Alandur stretch have CCTV cameras and policemen are guarding stations\n\nChennai Metro Rail may have installed a security network, including an elaborate surveillance system for all its stations between Koyambedu and Alandur.\n\nDespite this, there have been recent incidents of theft.\n\nOfficials of Chennai Metro Rail Limited (CMRL) say they found water taps missing from some stations. “We were really surprised to find the accessories gone and so we decided to step up the vigil. We examined the CCTV footage and identified the suspect and he was subsequently arrested too,” an official says.\n\nAll stations along the Koyambedu and Alandur corridor have CCTV cameras and policemen are guarding the stations round the clock. “We have posted staff outside the toilets to monitor any suspicious activity,” he adds.\n\nThis is the not the first time that thefts have been reported on the Metro Rail network. Delhi Metro Rail had a severe problem of theft after miscreants entered construction sites and stole raw material. In fact, once a signalling cable between Yamuna Bank and Dwaraka was stolen.\n\nIt’s tough to find ‘ordinary’ buses\n\nBs commuters in the city and suburbs are finding it difficult to spot ‘ordinary’ services.\n\nThe Metropolitan Transport Corporation (MTC), which operates a fleet of 3,300 buses, has a varied fare structure for different services that include deluxe, express and ordinary, and are identified by colours of the route boards. Ordinary services have white boards and the lowest fare. But regular bus users complain that to augment their revenue, MTC has been slowly curtailing the ‘white’ board services.\n\nRamaraju, a traveller from Madipakkam, complains that the number of ordinary services operated from the locality to different parts of the city is coming down. He says that even the regular route from Madipakkam to T. Nagar has been either converted to deluxe or express bus services.\n\nT. Sadagopan of Pattabhiram says that earlier, the different bus services could be identified by the condition of buses with new buses having LED boards and charging deluxe ticket fare. Today, all the buses are poorly maintained.\n\nHe wants the MTC to publish the details of ‘white-board’ bus services being operated in the city. MTC officials deny reduction in the number of ‘white-board’ bus services.\n\n(Reporting by Sunitha Sekar and R. Srikanth)", 
    "section": "national", 
    "title": "Despite security, theft rampant at Metro stations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}