{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An interesting discussion ensued during the hearing of a State appeal against the imposition of a dress code for entry into temples when Assistant Solicitor General G.R. Swaminathan said he wanted to file an intervening application on behalf of one of his private clients opposing the State appeal and supporting the dress code prescribed by a single judge of the High Court.\n\nWhen he made the submission before a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran on Monday, the senior judge retorted: “When a dress code was imposed in a club, you opposed it. Now you are supporting a dress code in temples. When it came to a club not allowing you inside in a dhoti, you said it is traditional and this and that.\n\n“Therefore, the question is who will decide what is traditional and what is not. You file your intervening petitions. No problem at all. We will expose it.”\n\nMr. Swaminathan was one of the three dhoti-clad men, the other two being Justice D. Hariparanthaman and senior advocate R. Gandhi, who were denied entry into Tamil Nadu Cricket Association Club in Chennai on July 11, 2014.\n\nUproar over issue\n\nThis led to an uproar in the State with many political leaders demanding appropriate action on the issue and the State legislature enacting the Tamil Nadu Entry into Public Places (Removal of Restriction on Dress) Act, 2014, which prescribes up to one year of imprisonment besides other penalties for denying entry on the basis of dress.\n\nEarlier, when advocate U. Nirmala Rani, appearing for a private appellant, wondered why the State government had issued a circular to all temples after the single judge’s order to implement the dress code and also filed an appeal challenging the same order, Mr. Justice Ramasubramanian said that it could be because of the hype created by the media.\n\n“On January 1, when the single judge’s order came into operation, the media covered only those who did not go fully covered to temples. The front page of every newspaper was full of this,” he remarked with a grin.\n\n“When dress code was imposed in a club, you opposed it. Now you are supporting dress code in temples”", 
    "section": "national", 
    "title": "Dhoti issue dominates hearing in HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}