{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "52-year-old is assaulted with sharp weapons after attack; four members of C.D. Mani’s gang arrested\n\nIn a ghastly attack carried out in broad daylight on Monday, a DMK functionary was shot at and then stabbed with sharp weapons by a gang at Old Mambalam Road at Saidapet. Four men were arrested in connection with the incident.\n\nAccording to the police, on Monday morning, Jagan alias Jaganathan (52), who is deputy secretary, 140 Division of the DMK, and into real estate business, and his friend Venkatesan were travelling on a two-wheeler on Karunanidhi Street, Old Mambalam Road, when the gang attacked the former.\n\n“Around 8.10 a.m., two men on a bike, one identified as Vinod, shot at Jagan and injured him on the right arm. Soon after this, a few men on four two-wheelers attacked Jagan with sharp weapons and sped away. Venkatesan rushed Jagan to the Government Royapettah Hospital. After this, he was shifted to a private hospital on Greams Road,” said a police officer. Sources said he was operated on and then shifted to Critical Care Unit of the hospital.\n\nThe police rushed to the scene of crime and gathered evidence including CCTV footage.\n\nJagan is reported to have hatched a plan to murder Padmanabha, who police said, had helped Vinod and his accomplices. When Vinod and others came to know about this, they assaulted Jagan.\n\nVinod and three others, Hariharan, Karthik and Suresh have been arrested. They are in their late 20’s. A country-made gun has been seized from Vinod. Four others – ‘Dokkan’ Raja, Panja, ‘Tokyo’ Mani and a fourth, whose identity is yet to be established are at large.\n\n“It is suspected to be an outcome of a previous rivalry. Vinod is believed to be part of the gang of C.D. Mani, who was arrested in August. “In the past, cases had come up against Jagan. Mani had earlier thrown a crude bomb at a construction site belonging to Jagan,” said an officer.\n\nPolice have registered a case and are investigating.\n\nFour others are absconding; country-made gun seized from prime suspect", 
    "section": "national", 
    "title": "DMK functionary shot at, stabbed in Saidapet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}