{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Not only beauty, even obscenity lies in the eyes of the beholder, says judge\n\nA notice board put up by the HR&CE department announching the dress code for devotees at the Sri Ekambaranathar temple, in Kancheepuram. -Photo: D.Gopalakrishnan\n\nThe Madras High Court Bench here on Monday stayed an order passed by a single judge of the court on November 26 directing the State government to implement from January 1 a dress code stipulated by him for men, women and children wanting to enter temples administered by the State Hindu Religious and Charitable Endowments (HR&CE) Department.\n\nA Bench of Justices V. Ramasubramanian and N. Kirubakaran granted the interim stay on a writ appeal preferred by the State government. Advocate General A.L. Somayaji contended that it may not be possible to force devotees and other visitors to temples to wear only those dresses which were prescribed by the single judge.\n\nHe contended that the code prescribed by the judge was wholly unnecessary when the issue was already governed by Tamil Nadu Temple Entry Authorisation Act, 1947 which lays down several restrictions on entry into temples, besides permitting individual temple managements to prescribe dress code as per their customs. The judge had traversed beyond the scope of a case by prescribing a dress code for temple entry while disposing of a writ petition seeking permission for Aadal Paadal (cultural programmes) in view of a festival at Shenbaga Vinayagar Temple in Akkiyampatti village in Marungapuri Taluk, Tiruchi district on November 21 and 22.\n\nAccording to the dress code formulated by Justice S. Vaidyanathan, men should wear “dhoti or pyjama with upper cloth or formal pants and shirts” and women “sari or half sari with blouse or churidhar with upper cloth.” Children could come in “any fully-covered dress.”\n\nDuring the course of the hearing, Mr. Justice Ramasubramanian said most of the saints, including Naga Sadhus, spotted during Kumbh Mela, could not enter temples if the dress code prescribed by the judge was enforced.\n\nAgreeing with him, the Advocate General said that even Ramana Maharishi, if he was alive, could not be allowed into temples as per the judge’s order. Recalling the proverb ‘beauty lies in the eyes of the beholder,’ Mr. Justice Ramasubramanian said: “Not only beauty, even obscenity lies in the eyes of the beholder.”\n\nLater, the Bench led by him adjourned the hearing on the appeal to January 18 to enable some lawyers, who wanted to argue in support of the dress code, to file their intervening applications.\n\nWomen’s freedom\n\nAppearing on behalf of a private appellant, P. Suganthi, general secretary of All India Democratic Women’s Association (AIDWA), her counsel U. Nirmala Rani said: “Indian women are not living in Afghanistan or Pakistan to cover themselves fully before entering temples. Even women in those countries have been fighting against such restrictions imposed on them.”\n\nShe wondered how prescription of a dress code even for children could enhance the spiritual ambience in temples as claimed by the single judge. Advocate A. Rajini, appearing for another private appellant G. Sarika of Southern Districts Women’s Federation, contended that the dress code interfered with women’s freedom to choose their attire.", 
    "section": "national", 
    "title": "HC stays order imposing dress code for temple entry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}