{
    "author": [
        "Staff Reporter"
    ], 
    "text": "R. Chellappan (left), Managing Director, Numeric Power Systems Ltd, interacts with patients during the first Annual Day function of Ganga Spine Injury Rehabilitation Centre in Coimbatore on Monday. (From second left) Chairman of Pricol Ltd. Vijay Mohan, Directors of Ganga Hospital S. Raja Sabapathy and S. Rajasekaran, president of Rotary Club of Coimbatore SaicityR. Mylsamy and Chairman of the hospital J.G. Shanmuganathan (right) are in the picture.—Photo: M. Periasamy\n\nSuresh was employed and earned a descent living prior to the road accident that made him incapable to continue with it. After surgery he joined Ganga Spinal Injury Rehabilitation Centre, a year ago. After surgery and hours of physiotherapy, he has once again become independent. Seated on a wheel-chair, he works as a receptionist of the rehabilitation centre.\n\nThis was one of the many success stories that were celebrated at the first annual day of launch of the centre, which is a unit of Ganga Orthopaedic Research and Education Foundation. “We have attended to 256 from across India and a few overseas patients,” director of Ganga Hospital S. Rajasekaran said.\n\nFrom January 2015, they have also offered free rehabilitation to the value of Rs. 1.03 crore to 152 patients from financially backward families. “It was made possible by contribution from Ganga Orthopaedic Research and Education Foundation,” Dr. Rajasekaran added. The centre aims at making patients suffering from partial paralysis to be independent and patients suffering from spinal cord injury to take care of themselves, so that their families are able to earn their livelihood. He added that they are providing treatment worth Rs. 5 lakh at a subsidised rate as low as Rs. 65,000. The centre can rehabilitate 33 patients. Vocational training and job placements for rehabilitated persons are offered.", 
    "section": "national", 
    "title": "Helping them become independent again", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}