{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Collector convenes meeting with organising committee members of the sport\n\nThough the Animal Welfare Board of India and animal rights activists seem to have pitched a strong case in the Supreme Court against the recent notification by the union government allowing ‘jallikattu,’ enthusiasts of the bull-taming sport in Madurai are optimistic that the Supreme Court will not stay the notification, at least before the Pongal festival.\n\nR. Govindarajan, former president, ‘jallikattu’ organising committee, in Alanganallur, one of the three places renowned for the sport in Madurai, has based his hopes on the caveat filed by the Tamil Nadu government. “The State government has made a prudent move by filing the caveat, requesting the court that they be given an opportunity to explain before any decision was made. Even if the court provides a week’s time for the government to respond, the Pongal ‘jallikattu’ will be over before that,” he said.\n\nP. Rajasekaran, president, TN Jallikattu Peravai, said that his organisation was also contemplating about filing another caveat petition in the Supreme Court on Tuesday.\n\nK.R. Murugan of Veerakula Amarar Iyakkam in Avaniapuram expressed hope that both the Central and State governments, which have showed keen interest in allowing ‘jallikattu’ this year, would do everything possible to avoid the notification being stayed by the Supreme Court. However, he added that the Centre should also look for a long-term solution to the issue by removing bulls from the list of animals that cannot be exhibited.\n\nMeet convened\n\nMeanwhile, Collector L. Subramanian on Tuesday convened a meeting with the organising committee members of ‘jallikattu’ in Avaniapuram, Palamedu and Alanganallur to discuss arrangements and issuing instructions to them on adhering to all regulations.\n\nThe Collector told the organising committees that the caution deposit of Rs. 5 lakh hitherto collected by the administration from the committees need not be made this year. Officials said the deposit was collected as per the Tamil Nadu Regulation of Jallikattu Act, 2009. However, as the Act was not in effect anymore, there was no need to collect the deposit, sources said.", 
    "section": "national", 
    "title": "‘Jallikattu’ enthusiasts in Madurai optimistic", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}