{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The visitors to Satyam Cinemas were surprised to see that actor Karthi’s face was splashed on their popcorn wrappers. The film’s producer, PVP Cinemas, had recently decided to ‘market’ their film through popcorn wrappers as it is cost-effective.\n\nRajeev Kamineni, executive director, PVP Cinemas, said that this is in continuation to their previous attempt while marketing ‘Inji Iduppazhagi’ efficiently. “We realised that the response was really good and that everyone was noticing it. So we decided to do this for Karthi’s upcoming film too. We are targeting one lakh popcorn tubs every month. This mode of marketing is to a large extent cost effective. The visibility is good,” he said.\n\nKollywood producers are trying to offset high costs incurred in marketing their films through traditional modes by using innovative methods. With the mantra of ‘cost-effectiveness’ driving marketing strategy, producers are investing in social media influencers and managers to ‘get more from less’.\n\nSocial media managers, who are paid by producers to market their films on social media, claim that information about movies are disseminated in a number of ways: through celebrities on social media, using influential people with a large following on social media, putting together campaigns, enlisting those who manage highly active pages and Twitter handles and so on.\n\nSocial media strategist Arun Rajagopalan, who has worked with production companies such as Madras Talkies, UTV Motion Pictures and Fox Star Studios India, says social media marketing treads in many grey areas in South India.\n\n“Taking money to advertise a film on Twitter and Facebook through your profile may not be strictly legal. One could be in violation of the user agreement that they agree to while signing up. Many producers and those popular on Twitter or Facebook are unaware about these legal issues and end up paying/receiving handsome sums for movie promotion,” he says.\n\nWhile corporate production houses have clear set of dos and don’ts, individual producers seldom think about such issues, he says. “Significant amount of money and resources are spent on social media these days. Big corporate production houses set up a team who study how their ads can be tailored in such a way that they target a specific demographic while individual producers don’t have the time or resources to understand how these works. They just end up paying popular handles and pages to market their films. Part of the problem for the existence of this off-the-book market is because the social networks aren’t really concentrating on Indian film industry, especially in the South,” he says.\n\nConsiderable amount of money is being spent on advertising on social media", 
    "section": "national", 
    "title": "Kollywood takes to popcorn tubs, social media to promote films", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}