{
    "author": [
        "P V"
    ], 
    "text": "Orunginaivom Hosurukkaga; Ondrupaduvom Hosurukkaga ; Oru Naal Hosurukkaga – declares the newly created Facebook page “Hosur Bhogi community”.\n\nLaunched over the weekend, the FB page is already being widely circulated. ‘One day for Hosur’ – launched as a garbage removal campaign, has found a common cause with the public in ridding garbage off the streets on Bhogi day.\n\nJust as homes are rid of unwanted items on Bhogi day, the campaign will rally around people to rid garbage off the streets.\n\nSub Collector Senthil Raj told The Hindu that the idea was mooted jointly with the municipal administration. In Hosur, 300 sanitation workers had been engaged in daily collection of garbage for a population of 3.5 lakh.\n\n“People feel it is their right to complain. The initiative will show them the magnitude of the task and the need for collective participation to accomplish the task,” said Mr. Senthil Raj.\n\nSimilarly, counsellors of 45 wards in Hosur will urge the residents of their wards to participate in the drive.\n\nOn Gandhi Jayanthi, the local taluk office was cleaned up with the help of taluk office employees.\n\n“Within 3 hours, a lorry full of garbage was collected. It was an eye-opener of sorts and we realised the extent of garbage that could be collected from the entire town, if only manpower could be mobilised,’ added Mr.Senthil Raj.\n\nBhogi presented the local administration with the best opportunity to bring about participation. The drive will commence at 7 a.m. and will conclude by forenoon. An estimated 250 metric tonnes of garbage is expected to be collected from the streets.\n\nWhen people clean up their homes, they should also come out to the streets and clean the garbage.\n\nEach of the 900 streets in Hosur will have a spot earmarked with a pole with a red cloth tied, to dump the garbage. Municipality lorries would collect the garbage.\n\nWhile the municipality would provide them face masks, gunny bags, and gloves, the residents can carry their own sickles to cut through the bushes.\n\nThere will also be pictures taken before and after cleanup. The best performing street with maximum waste collected will be awarded during the Republic Day celebrations.\n\nA campaign of such intent has found support from various quarters. The JCB association has volunteered to lend all of its 150 vehicles for the community clean-up.\n\n“There are 125 residents’ welfare association. Each association will be given a vehicle to dig out mounds of garbage in their locality. The cost of the diesel will have to be borne by the respective association,” said Mr. Senthil Raj.\n\nEach street will have two student volunteers, who will be the ambassadors of the campaign. They will go door to door and bring people to the streets.", 
    "section": "national", 
    "title": "Massive cleanup initiative in Hosur on Bhogi day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}