{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Work on New Natham Road taken up at a cost of Rs. 61 lakh\n\nDemarking lanes:Highways department has started work to erect a median on the New Natham Road between PTR Palanivel Rajan statue junction and Ramakrishna Mutt.— Photo: G. Moorthy\n\nState Highways Department has taken up the work of putting up concrete median on the New Natham Road in the city.\n\nIn the initial phase, a median of 1.20 metres high would be constructed for a distance of 1.8 km between PTR Palanivelrajan statue junction to Ramakrishna Mutt. However, the department has planned to taken up some of the accident-prone curves on the State highway up to Yadava College.\n\nIts Divisional Engineer, A.K. Rajadurai Velpandian, said that the work taken up at a cost of Rs. 61 lakh was aimed at reducing accidents, especially head-on collision.\n\nHe said that many vehicles were crossing the wide road at the whims and fancy of the riders/drivers leading to accidents. “Once the median is in place, crossing of vehicles can take place only at the openings on the median and thereby unexpected turns made by vehicles will come down,” he said.\n\nSimilarly, good width of the wide road at many spots was being illegally used as parking lot for two-wheelers and four-wheelers posing hindrance to free flow of traffic. “This actually reduces the carriage way. When the median is completed, parking of vehicles cannot be allowed and motorists can use all the 7-metre carriage way on both sides,” he said.\n\nThe height of the median has been put at over one metre to avoid dazzling headlights of vehicles coming on the opposite lane to avoid accidents, he added. Stating that no advertisement hoardings would be put up on the concrete median, he said that flower pots would be put up on it. Medians of shorter lengths have been proposed at the critical stretches near Naganakulam, Iyer Bungalow and Tiruppalai.\n\nMedians of shorter lengths proposed at critical stretches near Naganakulam, Iyer Bungalow and Tiruppalai", 
    "section": "national", 
    "title": "Median coming up to prevent accidents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}