{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Faced with patient after patient who had lost their voice due to surgery after throat cancer and were unable to afford expensive voice prosthesis, Vishal Rao, a Bangalore-based surgical oncologist, came up with a low-cost solution: a device that costs Rs. 50 and would enable patients to speak again.\n\nAt a press conference in the city on Monday, Dr. Rao explained that the device had now been tried out on three patients and study to test its efficacy had begun.\n\n“Every year, there are 25,000 new cases of throat cancer in the country, mostly due to tobacco use. Unfortunately, many of them present at late stages, at which point surgery is required and this removes their voice box, leaving the patients unable to speak. Prosthetic devices from abroad cost between Rs. 20,000 and Rs. 45,000 and have to be replaced every six months, leaving many people unable to afford them,” he said.\n\nThe device, named the Aum Voice Prosthesis, is about 2.5 cm long and weighs about 25 grams.\n\n“It is surgically inserted into the patient, and works by transmitting air from the lungs into the food pipe. This allows for sound to be formed. The patient presses his neck to block the air and to push it into the food pipe,” said Dr. Rao, who is a senior consultant with Health Care Global Enterprises, a cancer care network.\n\nDr. Rao had tied up with an industrialist friend, Shashank Mahesh, for manufacturing, he said.\n\n“Right now, we hope to complete the study by the end of March. We have already applied for a patent for this device, and once the study is completed, we are hoping to reach out to regional cancer centres so that a lot of patients can benefit from this,” he said.\n\nM.S. Senthil Kumar, an endocrine surgeon, said the innovation must go through the study, be tested on a sample size of patients and fit into the market.\n\n“But this is a good step as it is an innovation from our country. More of these would be welcome,” he said.", 
    "section": "national", 
    "title": "New device offers a low-cost voice prosthetic alternative", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}