{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Traders attribute it to delayed start and the recent floods\n\nMany traders have not put up stalls this year because they are not sure about the sales —Photo: R. Ragu\n\nThe sound of work going on along with music on a loudspeaker fills the air at the India Tourist and Industrial Fair being held on Island Grounds.\n\nAn hour before the fair’s inauguration on Monday evening, it seems like hardly anything is ready — most stalls have not been set up yet and many are empty. Traders said that this year, due to the delay in starting the fair and because of the floods, it may take a while for sales to pick up. “Usually the fair starts in the last week of December. But this year, it was delayed because of the floods. Lots of traders also have not come because they are not sure if sales will be as good,” said a worker at a snack stall, who has been coming to the fair for three years.\n\nAnother trader said that some small stall-owners had also suffered losses in the floods and had not been able to make it.\n\n“Other fairs are taking place and some traders may come later,” he said.\n\nSome were unsure if people would want to spend after losses suffered in the floods, said the representative of India Seashell Museum, which, he said, was participating in the fair for the first time.\n\nEven across the bridge, where the State government stalls are set up, not much has been completed. But there are signs of attractions to come: a mini-train station and a haunted house are two of the many entertainment spots being set up.\n\n“The rain delayed the fair, but work should be completed in a few days. Public entry will be from Friday onwards,” said a senior police officer attached to the Fort station.\n\nHowever, another trader said that the crowds would come in from Pongal onwards. “The fair lasts for 70 days. People will start coming in and we may even have more footfall than we had last year,” he said.", 
    "section": "national", 
    "title": "Not much buzz at trade fair", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}