{
    "author": [
        "R Sivaraman"
    ], 
    "text": "District Collectors of Puducherry and Karaikal released the rolls in the form of CD and hard copies\n\nOver 21,612 persons have been added to the electorate of Union Territory of Puducherry as per the final electoral rolls published by the Elections Department, Puducherry on Monday. There are 9,27,128 voters now in the Union Territory and 3.3 per cent of voters were added to the electorate compared to previous year data.\n\nReleased last September\n\nThe draft electoral rolls had been released last September. As per directions of the Election Commission of India (ECI), with January 1, 2016 as the qualifying date, a special summary revision campaign was conducted from October 15 to November 10 last year.\n\nOn Monday District Collectors of Puducherry and Karaikal released the electoral rolls in the form of compact disc (CD) and hard copies which were handed over to political parties.\n\nPuducherry District Collector D.Manikandan released the final voter list for Puducherry, Yanam and Mahe enclaves which come under Puducherry district and Karaikal District Collector E.Vallavan released the electoral rolls for five constituencies of Karaikal.\n\nBriefing the reporters here, Chief Electoral Officer V. Candavelou said there are 9,27,128 voters in the list as per final electoral rolls. As many as 9,793 forms for corrections and 7,697 for transposition were received by the Elections Department. All forms were admitted.\n\nNet addition of voters\n\nDr. Candavelou said, “On a scale of comparison, this year there is a net addition of 29,612 vis-a- vis 12,185 new voters over the last year. The trend of women outnumbering men continued this year also.\n\nAs many as 24,675 applications were received from women compared to 19,994 from men. The left out voters can always get their names included in continuous updation that will commence from Tuesday.\n\nPeople can get their names enrolled in electoral rolls until the last date for filing nomination in the constituencies.”\n\nThe final electoral rolls- 2016 will be displayed for seven days from January 11 in all polling stations and in the offices of the Electoral Registration Officers and Assistant Electoral Registration Officers for public inspection. People can visit the polling station to view the rolls or it can be viewed online by visiting the website www.ceopuducherry.py.\n\ngov.in .\n\nEPIC for new voters from Monday\n\nDistrict Collector Mr. Manikandan said the elector photo identity cards (EPIC) for newly enrolled voters above 19 would be issued in the polling stations from Monday.\n\n“For the age group of 18 and 19 who became the first time voters, the EPIC will be issued on National Voters’ Day celebrations to be held on January 25”, said Mr. Manikandan.\n\nFurtehr he added that the voters who have the EPIC cards already can replace with the new EPIC cards affixed with colour photograph on payment of Rs.25.\n\nThe Elections Department also said in order to facilitate the left out voters to enroll their names and those who might migrate to Puducherry henceforth, the continuous updation of electoral rolls will be taken up from Tuesday till last date for filing nominations to elections.\n\nSpecial campaigns\n\nTwo special campaign on February 7 and 21 will be organised in all polling stations.\n\nThe left out voters can also file applications for inclusion, correction, deletion through online mode.\n\nA mobile van for enrolling left out voters which is in operation since 2015, will continue to visits various localities till last date for making nomination.\n\nThe final electoral rolls will be displayed from January 11 in all polling stations", 
    "section": "national", 
    "title": "Over 20, 000 voters added to final poll rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}