{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Department has diversified online but faces obstacles in getting youth to opt for services\n\nBefore the month ends, the Postal Department will have taken another step towards digitalisation of its services by introducing internet banking. But, it still has a long way to go before ensuring the digital generation is drawn to its services.\n\nIt has already taken several other measures, which are expected to be attractive to youngsters. Of the 2,340 post offices in the Chennai city region, 521 have been networked with core banking solutions so far. This would help customers operate their accounts or carry out transactions from any networked post office.\n\nThough post offices have diversified into a number of services, including e-commerce and retail business, a chunk of its revenue comes from the postal savings schemes. Of the Rs. 10,730 crore earned as annual revenue last fiscal, postal savings schemes contributed to nearly Rs. 6,000 crore. And therefore, the Department has to make these schemes attractive to the youth.\n\nResidents however complain that there are already many problems that are preventing customers from opting for postal savings services and they need to be addressed.\n\nS. Kuppasami, a resident of Pattabiram, said he had to wait for five days before he got money after maturity of recurring deposit. Sometimes, new customers hesitate to invest due to the problem of procedural delays.\n\nS. Rajpandian, president of Tamil Nadu Postal Agents Welfare Association, said many regular customers, including senior citizens and working professionals, take up saving schemes after they are introduced to these by agents. But now, the number of postal agents has also dwindled, and there is a need to adopt new strategies to reach out to people, especially the digital generation.\n\nAs of now, youngsters opt for schemes like national savings certificate to get tax deductions.\n\n“Postal saving schemes provide a better interest rate than banks. But, only 30-40 per cent of the youngsters opt for saving schemes,” he said.\n\nFollowing a dip in earnings from commissions, many agents have diversified into other professions.\n\n“Only 1,000 agents still continue to promote postal schemes along with others. We expect core banking solutions to simplify the process as customers can operate or close accounts from any of the CBS post offices,” he added.\n\nDepartment officials have started campaigning in schools to inculcate thrift. However, the Department is yet to gain access to manufacturing companies or IT companies for such campaigns.\n\nMervin Alexander, Postmaster General (Chennai City Region), said: “We write to government departments about schemes and plan to extend the campaign to college students. There has been an increase by 5 per cent in customers opting for saving schemes this year. We expect more youngsters to use post offices once internet banking is launched for, it offers a feature that will enable them to open deposit accounts and transfer money. We will take measures to rectify delays.”", 
    "section": "national", 
    "title": "Post offices plan to tap digital natives", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}