{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Taking suo motu cognizance of a sedition case launched by the UT Government against Tamil weekly Namadhu Manasatchi for publishing an allegedly seditious report on public health, the Press Council of India has sent notice to the government seeking a report on the facts of the case within two weeks.\n\nOn December 9, 2015, the government had resorted to the unprecedented step of invoking sedition charges against the Tamil news weekly following the publication of a “false, misleading and irresponsible news item” captioned ‘ Kalavathi ’ (Expiry) in the weekly’s October, 28-November 3, 2015 edition alleging that expired medicines are supplied to the patients in Government Hospitals of Puducherry.\n\nOn the basis of a complaint given by the Directorate of Health & Family Welfare, the Grand Bazaar Police Station, Puducherry, has registered a criminal case against Namadhu Manasatchi , under Section 124-A of Indian Penal Code (IPC), which is invoked against “whoever, by words, either spoken or written, or by signs, or by visible representation, or otherwise, brings or attempts to bring into hatred or contempt, or excites or attempts to excite disaffection towards the Government established by law.”\n\nThe government justified the sedition charges claiming that the said news item had created panic and fear in the minds of the general public, damaged the image of the medical profession, tarnished the image of the medical service rendered to the public by the government and created a sense of ill-feeling and enmity between the medical profession and the public.\n\nThe Press Council, in notices to the Chief Secretary, the police chief and director of health and family welfare, stated that since the matter prima facie “discloses a threat to the free functioning of the press,” it had taken suo motu cognizance of the matter under Regulation 13 of the Press Council (Procedure for inquiry) Regulations, 1979.\n\n“In view of the gravity of the matter, the Puducherry Government is, therefore, requested to furnish its reports of the case on facts within two weeks of the date of receipt of this letter to enable the Council to decide the further course of action in the matter,” the Council said.\n\nThe Press Council urged the government to ensure that journalists are able to discharge their duties without any fear or hindrance.\n\nIt has also\n\nasked the Tamil weekly ‘Namadhu Manasatchi’ to furnish its version", 
    "section": "national", 
    "title": "Press Council notice to govt on sedition charge against Tamil weekly", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}