{
    "author": [
        "R Rajaram"
    ], 
    "text": "Dubbing the AIADMK and the DMK regimes as “corrupt”, Communist Party of India (Marxist) general secretary G. Ramakrishnan on Monday claimed that both Dravidian parties had grossly failed to solve people’s problems in the last 38 years.\n\nThe common minimum programme (CMP) brought out by the People’s Welfare Front (PWF) comprising of the two Left Parties, Marumalarchi Dravida Munnetra Kazhagam and the Vidhuthalai Chiruthaigal Katchi had been presented as a credible alternative to the “corrupt” AIADMK and the DMK regimes, Mr. Ramakrishnan told reporters at Srirangam.\n\nThe formation of the alliance in Tamil Nadu with four parties joining hands and releasing a Common Minimum Programme (CMP) was the first time in Tamil Nadu’s political history, he said adding that the CMP had taken up people’s issues.\n\nReplying to a query on the invitation extended by the PWF to the Desiya Murpokku Dravida Kazhagam headed by Vijayakant to join the alliance, Mr. Ramakrishnan said it was up to Mr. Vijayakant to decide his strategy for the forthcoming Assembly election.\n\nAnswering another query, he said the PWF had not discussed the number of seats it would contest in the elections. Alleging that corruption was rampant during the AIADMK and the DMK rule, the CPI(M) leader claimed that both Dravidian parties were not ready to oppose divisive forces and that the social evil of untouchability continued to prevail in the State.\n\nThe People’s Welfare Front (PWF) would face the ensuing polls keeping its CMP as an alternative to the Dravidian parties, Mr. Ramakrishnan said. A mega conference of the PWF would be held at Madurai on January 26 in which CPI(M) national general secretary Sitaram Yechury and CPI general secretary Sudhakar Reddy would take part.\n\nThe CMP would be explained to the people at the meeting and during the campaigns in the run up to the polls, he said.\n\nEarlier, Mr. Ramakrishnan launched the fund mobilisation programme at Srirangam for the party accompanied by CPI(M) members.", 
    "section": "national", 
    "title": "PWF an alternative to corrupt AIADMK, DMK: Ramakrishnan", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}