{
    "author": [
        "K Manikandan"
    ], 
    "text": "In yet another initiative for commuters to get tickets fast, Southern Railway has installed a computer-operated machine at Chennai Central and Velachery. The machines, officials said, had been launched in the Chennai Division as part of nation-wide modernisation scheme.\n\nThis Cash/Smartcard operated Ticket Vending Machine (CCoTVM), as it is called, is the latest in the series of initiatives.\n\nIt is a more advanced version of the earlier Automatic Ticket Vending Machines installed at suburban stations across the city.\n\nOn Monday, engineers briefed Southern Railway staff about how the machine works. The main advantage of CCoTVM is that commuters need not have a smart card as they can get tickets on inserting cash and even coins. The machines have boxes inside to store as many as 25,000 notes and 3,000 coins.\n\nThe unmanned, self-operated machines were installed over a month ago and can dispense platform and suburban journey tickets, renew season tickets and even recharge smart cards that can be used at the ATVMs.\n\nATVMs can be operated only with a smart card.\n\nMany important stations have retired Southern Railway staff who use smart cards to print tickets, officials said, adding they hoped that the new machines would find acceptance among a larger section of commuters.\n\nAn official communication said the machines were very safe and designed to reject soiled notes.\n\nHowever, commuters said it would take a while for people to get used to such facilities. “I prefer getting tickets from such vending machines instead of waiting in a queue, but they can be operated only by people who are comfortable with touch screens. Its operation should be simplified further,” said V. Arun, a young civil engineer.\n\nA. Appanna, a worker from Andhra Pradesh, said people who did not know English and Hindi cannot operate sophisticated machines, however simple they might be and that the best thing for people like him to do was to wait at counters and purchase the tickets.", 
    "section": "national", 
    "title": "Railways turns to a new ticket machine", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}