{
    "author": [], 
    "text": "Non-functional\n\nstreetlights\n\nMuch to the chagrin of the large number of health-conscious early morning walkers, who make regular use of the arterial NSR Road and the adjoining Bharathi Park Cross Roads 2, 4 and 7 in Saibaba Colony right from 4 a.m., streetlights have not been functional and the areas remain plunged in darkness. Potholes on the roads coupled with vehicular traffic on NSR Road have become potential sources of danger for the pedestrians.\n\nThe civic body should ensure proper functioning of the streetlights.\n\nK.D. Viswanaathan,\n\nCoimbatore.\n\nIrresponsible act\n\nDriving vehicles at high speed, especially by young two-wheeler riders, has been a common sight on our roads. Swiftly they overtake other vehicles moving like a snake with zigzag movements. Roads are not meant for showing their riding skills. In fact, what they think as skills may kill them even if a slight mistake occurs inadvertently.\n\nI would suggest that the school and college students must be taught properly on the ill-effects of such ‘heroic’ acts.\n\nParents should be very strict in not allowing their children to ride vehicles before getting licence.\n\nG. Amirthaganesan,\n\nCoimbatore.\n\nPensioners’ woes\n\nCentral Government pensioners and family pensioners are drawing their monthly pension from branches of nationalised banks / post offices.\n\nEarlier, the bank branches were disbursing monthly pension directly to the pensioners based on the individual records kept available with them.\n\nFor the past 3 to 4 years, pension is being drawn by the respective Central Pension Processing Centres (CPPCs) through ECS facility. The branches are not aware of the pension details handled by the CPPCs. However, the pensioners know only the local branch where they receive the pension.\n\nEvery year, it is mandatory that the pensioners submit a Life Certificate during November in person to prove their existence.\n\nPension for December 2014 was not drawn by nearly 100 pensioners of SBI SRKV Branch owing to the intimation regarding the life certificate not reaching CPPC, SBI Chennai. Later, the issue was solved. CPPC was formed by the banks with the good intention to centralise and channelize the payment.\n\nWhenever any complaint is given to the respective banks by the pensioners, it is the bounden duty of the concerned branch to forward grievance to the CPPC after intimation to the pensioner. But in practice, the representations are refused by the branches stating they are not aware of the case.\n\nThe improvement in the system should not hamper the smooth functioning of the existing system.\n\nS. Gopalan,\n\nSecretary,\n\nAll India Central Govt.\n\nPensioners’ Association,\n\nCoimbatore.\n\nLacks parking space\n\nThis is just a note to inform the authorities concerned that several nursery schools are being run on West Club Road without adequate parking facilities.\n\nHowever, the consequence of this inadequacy has left school vehicles to use the narrow one-way West Club Road for parking, resulting in a series of accidents. On behalf of the West Club Road neighbourhood, we would like the authorities to ensure that the schools are equipped with alternative parking arrangements. Besides, we would like the authorities to ensure that the West Club Road is suitably swept and kept clean on a day-to-day basis, which in a way could eliminate accidents.\n\nKorah John,\n\nCoimbatore.\n\nFill vacancies\n\nIt is shocking to read that so many vacancies need to be filled up in the Police Department in Tamil Nadu. Lot of cities are facing accidents due to limited traffic police personnel, especially in Erode, Coimbatore as well as National Highways.\n\nIt is high time State Government forms a committee and fill the vacancies.\n\nIt is better if more men are put on traffic duty in major areas and cities to control traffic.\n\nAlso, traffic rules need to be enforced strictly inside the city areas. On the spot fine should be imposed only to avert traffic accidents.\n\nM. Sampath Kumar,\n\nErode.\n\n(Readers can send mail to\n\ncbereaders.mail@\n\nthehindu.co.in with\n\naddress and\n\nphone number)", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}