{
    "author": [], 
    "text": "Power outages\n\nTuticorin and its suburbs suffered power outages and low voltage on several occasions since the beginning of north-east monsoon. To cap it all, on January 1, power supply got snapped at 6.30 a.m. and resumed around 1.30 p.m. in Muthiapuram area. On January 2, power failed again at 7.50 a.m. and resumed at 2 p.m.. In spite of monthly maintenance, such breakdowns happen. Apart from causing inconvenience to public and traders, it creates revenue loss too. One can infer that these unintended power failures are due to outdated and obsolete power distribution network. Tuticorin must utilise the opportunity provided by the Smart Cities Mission to revamp the distribution network in total.\n\nJ. Edison Devakaram,\n\nTuticorin.\n\nPreserve waterbodies\n\nKanyakumari district is filled with adequate water bodies, enriched natural resources like green mass density and mountains with biodiversity. District authorities and politicians should plan for a sustainable development of the district. Laying roads, constructing bridges and developing real estate should not be at the cost of water bodies and paddy fields. Earlier, both sides of the road from Nagercoil to Thiruvananthapuram, till Thuckalay, used to have lush green fields, coconut plantations and waterbodies. Now, you can see only buildings, granite shops, filling stations, hotels and plots for sale. The fields are well connected in an irrigation system. Our ancestors planned it so well that the Pechiparai canal system reaches the last field through different canals, after filling up small tanks. At this rate of development, our district will soon become dry and water bodies will vanish totally. I request the authorities to initiate action to preserve water bodies and agricultural fields.\n\nB. Harikumar,\n\nNagercoil.\n\nImportance of libraries\n\nI refer to the news report that has brought to light the one and only full-fledged air-conditioned library at Pandian Nedunchezhian Higher Secondary School run by the Madurai Corporation. (Jan 6). It is amazing that out of the 64 schools of the Corporation, this institution has received the special attention of officials and has got the credentials of helping students to come out successfully in competitive examinations as well as in elocution contests. Even the District Library in Palayamkottai is not up to the mark in facilitating the physically challenged persons to utilise the reading room. While there are insufficient classrooms in Corporation and Government schools, how can they provide a quality library with a reading room? Gone are the days when school libraries had the post of librarian and registers were maintained for the books bought and issued to students for reading. In due course, the librarian was engaged in office work and the vacancy was not filled up on superannuation. The importance of the library is not felt and I wonder how many Government and Corporation schools have a library. Even the so called elite schools nowadays concentrate only on producing good results, giving less importance to reading, games, physical and value education. As a retired head of a higher secondary school, I would say it is up to the Headmaster to utilise the available facilities to provide a library. The teachers must also be role models to their students in the habit of reading.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai.\n\nIntroduce EMUs\n\nCommensurate with the phenomenal development of V. O. Chidambaranar Port, Tuticorin has become a major industrial hub in the south. More and more industries have sprung up in and around Tuticorin. Nearly 10,000 MW power plants are in different stages of completion in and around Tuticorin. Once these projects are completed, the passenger and cargo traffic will increase, causing traffic congestion. The neighbouring Tirunelveli has major residential areas with many educational institutions. Since there are not many industries, Tirunelveli is an ideal place to live without pollution. Hundreds of people working in Tuticorin and other places are having their residence in Tirunelveli. Besides this, thousands of traders, students and public belonging to Tuticorin visit Tiruenvleli daily. The train services between these two places leave a lot to be desired.\n\nThe timing of the existing local passenger is not convenient as it takes nearly two hours to cover a distance of 60 km.\n\nIt is presumed that the main reason behind the long duration to cover the short distance is shunting of the engine at Vanchi Maniyachi station.\n\nTherefore, commuters have no choice but to depend upon Tamil Nadu State Transport Corporation buses for which they have to pay exorbitant charges.\n\nThe Southern Railway can introduce ‘pull-and-push’ electric multiple unit trains between the two towns, which will considerably reduce the journey time.\n\nM.K. Swamy,\n\nPalayamkottai.", 
    "section": "national", 
    "title": "Readers’ Mail (Tirunelveli)", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}