{
    "author": [], 
    "text": "Dirty channel\n\nIn Rajapalayam, the Samathanapuram channel, which was carrying good water in the earlier days, now looks dirty. Now garbage is dumped in the channel, in which once people used to take bath, posing a great threat to residents in the form of mosquito and pig menace. Will the authorities concerned make it garbage-free?\n\nRavi Ramanujam,\n\nRajapalayam\n\nSolar power\n\nInstallation of solar panels in houses is the only option to ensure uninterrupted power supply. It will also lead to reduction in electricity charges. The public patronage for solar power is rapidly growing, particularly in one or two KW range. Those who construct new houses must use solar panels by providing a temporary platform from laying foundation. This will avoid heavy financial expenditure in getting temporary supply form Tangedco for maintaining lights and pump.\n\nOn completion of the building, the solar panel could be shifted to the rooftop. The commercial banks which advance home loans should insist on installation of solar panels as a pre-condition.\n\nK. Somasundaram,\n\nDevakottai\n\nSchool grounds\n\nOf late, aided schools have started using their playground for commercial purposes. Temporary exhibitions and game shows take place on these grounds. This amounts to violation of rules since the government distributes annual maintenance grant for playgrounds also as in the case of school buildings. Allowing stalls or exhibitions or meetings or private celebrations on grounds of educational institutions is strictly prohibited.\n\nAsmabagh Anvardeen,\n\nRamanathapuram.\n\nImportance of libraries\n\nI refer to the news report that has brought to light the one and only full-fledged air-conditioned library at Pandian Nedunchezhian Higher Secondary School run by the Madurai Corporation. (Jan 6). It is amazing that out of the 64 schools of the Corporation, this institution has received the special attention of officials and has got the credentials of helping students to come out successfully in competitive examinations as well as in elocution contests. Even the District Library in Palayamkottai is not up to the mark in facilitating the physically challenged persons to utilise the reading room. While there are insufficient classrooms in Corporation and Government schools, how can they provide a quality library with a reading room? Gone are the days when school libraries had the post of librarian and registers were maintained for the books bought and issued to students for reading. In due course, the librarian was engaged in office work and the vacancy was not filled up on superannuation. The importance of the library is not felt and I wonder how many Government and Corporation schools have a library. Even the so called elite schools nowadays concentrate only on producing good results, giving less importance to reading, games, physical and value education. As a retired head of a higher secondary school, I would say it is up to the Headmaster to utilise the available facilities to provide a library. The teachers must also be role models to their students in the habit of reading.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai.", 
    "section": "national", 
    "title": "Readers’ Mail (Dindigul)", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}