{
    "author": [], 
    "text": "The condition of the Thanjavur-Ariyalur National Highway near Keezhapaluvoor is very bad. Union Minister Pon. Radhakrishnan recently visited Thirumanoor, without touching this particular place. Had he travelled on this stretch, he would have empathised with the road users. I appeal to the officials concerned to take step to repair this stretch of the highway immediately.\n\nS. Srinivasan,\n\nThanjavur\n\nKeep toilets clean\n\nIn Kumbakonam, a large number of toilets have been built for public use. Now, for the ensuing Mahamaham, a corporate house has offered to sponsor construction of toilets in large numbers. This is the time to make the toilets clean by the local authorities concerned. Maintenance is too important in bus stand Kumbakonam and surrounding area. I request the municipality to take it up.\n\nS. Krishnan,\n\nThippirajapuram\n\nShift away\n\nfrom Chennai\n\nEncroachment of river banks and lakes was the single biggest reason for the recent floods in Chennai. The multinational companies should relocate their units to some other districts in Tamil Nadu and help in solving the unemployment problem. This will also reduce the pressure on Chennai.\n\nCondeepan M.,\n\nPattukottai\n\nPractise\n\nyoga\n\nThe deep consideration of the government to make yoga a mandatory part of curriculum is the right step. The key message “live life to its fullest potential” during the International Yoga Day can be achieved only by making yoga as integral part of life. Since stress, strain, depression and anxiety envelope the minds of all irrespective of age, yoga can bring renewed health to his body and mind.\n\nR. Pichumani,\n\nThippirajapuram\n\nNeed for more trains\n\nThere is only one train From Villupuram regularly on the main line from Kumbakonam. Many trains take the chord line via Virddhacallam. There are also long-distance trains on this route. Trains offer an affordable transport to the people. At least four more trains should be introduced on the main line from Tiruchi to Villupuram and beyond via Kumbakonam.\n\nMali and Mani,\n\nVishnupuram\n\n“Restore lake”\n\nThe Ramanathan Keni, once a huge water tank in Nachiarkoil and Thirunaraiyur Panchayaths of Kumbakonam Taluk is getting filled up with plastics and other wastes. The government and the local bodies should take steps to restore the lake to its original condition.\n\nH. Sheik Abdul Kadhar,\n\nNachiarkoil\n\nRepair road\n\nThe bad condition of the road between Thiruvidaimarudur and Thirubuvanam in Tanjore district has been posing a great inconvenience to road users, particularly two-wheeler riders. Roads have turned into dust bowls causing hardship to travellers and nearby residents. We request the officials concerned to repair the road.\n\nJ. Gopalakrishnan,\n\nThiruvidaimarudur", 
    "section": "national", 
    "title": "Repair road near Keezhapaluvoor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}