{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A team of representatives from the Indian Institute of Human Settlement, Bengaluru, conducted a survey of water courses, underground drainage system and other amenities prevailing in the city for the implementation of urban sanitation project.\n\nThe project is to be implemented for a period of two years in Tiruchi city for augmenting sanitation, hygienic handling of septic tank waste and well-designed drainage system.\n\nA preliminary study was conducted by the nine member team which visited Crawford, Edamalaipattipudur, K.K. Nagar, Ponmalai, Ariyamangalam, Tiruvanaikovil, Srirangam and Melur on Sunday.\n\n“It is just a preliminary study and we will submit a report in course of time,” said one of the members of the team.\n\nTiruchi is one of the centres in the state selected by the Bill and Melinda Gates Foundation (BMGF) for implementing urban sanitation project to tone up efficiency of sanitary management. The other two centres were Narasimhanaickanpalayam and Periyanaickanpalayam – both town panchayats in Coimbatore district.\n\n‘Gramalaya’, a service organisation and the city corporation will implement the project. S. Damodaran, founder chairman of Gramalaya and M. Elangovan, its executive director, who accompanied the team members, said that the problem caused by direct and unhygienic letting out of the sceptic tank waste into open fields or water bodies on the outskirts of the city would be issued. Adequate awareness would be created among those involved in cleaning and disposing the septic tank. Management of sledge would be another core area which would be implemented.\n\nMr. Damodaran said that it has been noticed that the septic tanks were not properly designed in many places in the city. Overflowing of the waste water was a common phenomenon. Adequate awareness would be created among the masses.", 
    "section": "national", 
    "title": "Report on sanitation project to be prepared shortly", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}