{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Conservancy workers on Monday greeted Collector Archana Patnaik, who, they said helped them get Pongal bonus. —Photo: S. Siva Saravanan\n\nResidents of Kannimar Kovil Street in South Ukkadam on Monday wanted the district administration to renovate their traditional temple.\n\nIn their petition during the weekly grievance day meeting , the residents alleged that majority residents of the area, who belong to a community, continued to disrupt their renovation activities since 1998.\n\nThere were around 20 families that had been living there for generations and taking care of the temple.\n\nOn January 8 when they wanted to restart the renovation work, the members of the community gathered in large numbers and threatened to remove the temple.\n\nThe police did intervene but only tried to broker truce, the petitioners said.\n\nClose liquor shops\n\nMembers of the Indhu Makkal Katchi-Tamilagam have sought closure of liquor shops on Swami Vivekananda birth anniversary on January 12. They also sought a statue for the former President A.P.J. Abdul Kalam in all district headquarters.\n\nResidents seek security\n\nResidents of Sriram Nagar in Podanur demanded protection from burglars.\n\nIn their petition, they said that since the third week of December there had been a series of attempts by burglars in the area.\n\nBut as residents were alert, many burglaries were prevented. The residents took up the issue with the Municipal Administration Minister S.P. Velumani, South Zone Chairman Perumalsamy and also police officials.\n\nThey too had promised protection and did take steps to nab the burglars, who had managed to evade arrests.Protect Kurichi tank\n\nMembers of the Kongunadu Makkal Desiya Katchi wanted the district administration to take steps to protect the Kurichi tank, construct a retaining wall on its bank and widen the National Highway that passes through the area.\n\nCollector thanked\n\nConservancy workers engaged on contract thanked Collector for facilitating payment of Rs. 1,000 to each worker as Pongal bonus.\n\nLed by members of the Arundathiyar Makkal Viduthalai they said that but for the Collector they would not have got the bonus. There are 2,000 workers on contract.", 
    "section": "national", 
    "title": "Residents seek administration support to renovate temple", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}