{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Work on 3,272 roads may be hit by traffic restrictions, encroachments and labour shortage\n\nDeputy Mayor Kabalamurthy Road in Chintadripet was one of the stretches where work was undertaken following the floods —Photo: M. Moorthy\n\nWhile the Chennai Corporation has drawn up an elaborate plan to complete key civic works before the model code of conduct for the Assembly elections comes into force, there are indications that long-standing issues, including traffic restrictions and encroachments, may put a spanner in the works and prevent the civic body from achieving this objective.\n\nAlready, traffic restrictions have led to delay of projects on bus route and interior roads. Having missed the deadline of 30 days after issuance of work order in November, the civic body has finally commenced work on 3,722 interior roads this week.\n\nAccording to estimates, more than 70 per cent of the 3,722 interior roads have encroachments, requiring eviction before commencement of work. In addition to the delay caused by encroachments, the police are denying permission for heavy vehicles with bitumen and concrete mix to enter the city from Perungalathur and Thiruneermalai.\n\nEach of the road contractors would be able to bring a restricted number of vehicles from 10 p.m. to 5 a.m. for road work each night. The heavy vehicles staying in the city beyond 5 a.m. have been penalised by the police delaying the road work further. According to estimates, six loads of bitumen or concrete mix of each contractor is taken to the city each night.\n\nAs a result, just 30 metres of concrete road covering an area of 200 sq.m is being re-laid per day. This is expected to delay the project by three months. Corporation engineers are worried about a possible disruption in work even before completion of 50 percent of the project.\n\nWorkers on most of the projects have already left for their native villages for Pongal.\n\nWork has been suspended on many bus routes owing to the shortage of labour during the Pongal season.\n\n“We are able to carry out work at just 30 sites across the city every day,” said a Chennai Corporation official.\n\nA total of 1,782 cement concrete roads at Rs.140.79 crore and 1940 bitumen concrete roads at Rs. 2,28.73 crore are expected to be taken up after a few days.\n\nA few weeks ago, Chief Minister Jayalalithaa launched the massive road relaying project for the flood-affected parts of the city.\n\nThe project involves the development of 108.43 km of bus routes and 683.02 km of interior roads at an estimated cost of Rs. 643.5 crore by the Chennai Corporation. Most of the works are yet to begin.", 
    "section": "national", 
    "title": "Restoration of stretches faces roadblocks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}