{
    "author": [
        "R Rajaram"
    ], 
    "text": "The ground at Periya Suriyur village near Tiruchi being prepared for the Jallikattu.— Photo: B. Velankanni Raj\n\nhe Centre’s recent notification permitting ‘jallikattu’ has energised the people of Periya Suriyur on the city’s outskirts.\n\nThe otherwise sleepy village is now charged up to play host yet again to the centuries-old bull taming sport after a gap of one year.\n\nTitanic bulls with huge hump will hit the ground in a few days from now at this non-descript village where this traditional sport could not be organised last year because of the ban that was imposed in view of the Supreme Court ruling.\n\nWith the Centre now allowing the bull taming sport in the State in view of the Pongal festivities, the people of Periya Suriyur are determined to make it a grand show this time as well.\n\nA celebratory atmosphere prevails in the village with preparatory work taken up at a feverish pitch for the event slated on January 16 – the second day of the Tamil month “Thai”. It has been an aged-old custom to organise the bull taming sport on the “Maatu” Pongal day at Periya Suriyur, say the local people.\n\nThe people of the village have mobilised funds for hosting the event on the “mandhai” – a sprawling ground where arrangements are being put in place. The “Vaadi Vaasal” from where the huge bulls would emerge is being cleaned up ahead of the event\n\nBarricades which have already landed at the village would be erected to 2 km on either side of the ground up to the collection point. Double barricades would be set up and wire meshes fixed as a safety measure to prevent visitors from entering the arena, say the people of the village.\n\nGalleries that could accommodate nearly 3,000 visitors are on the cards. In addition to this is a VIP stand where government officials would be seated to monitor the event to ensure that it was organised as per the Supreme Court guidelines.\n\nThe event would be organised as per the rules and order, says S. Raja, coordinator of the Jallikattu organising committee.\n\nThe people of the village have pooled in funds for organising the event — the cost of which is expected to be around Rs. 10 lakh to Rs. 15 lakh.\n\nAround 400 bulls from Tiruchi, Pudukottai, Thanjavur, Ramanathapuram, Sivaganga, Dindigul, Perambalur, Ariyalur, and Salem districts and nearly 500 bull tamers are expected to take part in the event, Mr. Raja said.\n\nOfficials from the Public Works Department would carry out stability checks and only upon obtaining their clearance would the event be held, says Mr. Raja who submitted an application to the district administration on Monday seeking permission for the sport. The tokens for registration would be issued on Tuesday.\n\nA team of veterinary doctors would examine every participating bull at the venue before allowing them to participate in the event. The tamers in the age group 21 to 40 would be screened by doctors. The prize for the tamers this time around was also motorcycles, says Mr. Raja.", 
    "section": "national", 
    "title": "Return of ‘Jallikattu’ energises Periya Suriyur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}