{
    "author": [], 
    "text": "With scenes of heavy floods devastating Chennai last month still fresh in everyone’s memory, steps should be taken to prevent such calamities. According to the district administration, nearly 40,000 canals and tanks are spread across the district. If these canals and tanks are not rejuvenated immediately, nature will wreak havoc on Tiuchi. CCTV cameras must be installed, compound walls built and round-the-clock vigil mounted to protect these water bodies. Apart from recharging the groundwater, the water bodies can turn out to be life saviours for farmers of the entire district.\n\nA. Prabaharan,\n\nPuthanampatti\n\nStop overloading\n\nof autorickshaws\n\nDespite all rules and regulations, the autorickshaws ply with impunity overloading with schoolchildren. During rush hour, they race ahead of other vehicles putting the lives of passerby in danger. In Sudarsan Nagar, Srirangam, at about 9 a.m. the other day, an autorickshaw, while taking a U-turn, overturned. But for the help of some cab drivers, the children would have suffered serious injuries. It is common these days for these autorickshaw drivers to have two passengers in the driver’s seat.T.M. Ranganathan,\n\nSrirangam\n\nStreamline\n\npolice set-up\n\nMurder, rape, chain snatching, robbery, house burgling, dacoity, and vehicle thefts have become common these days. People are entitled to a peaceful and secure life. Honest senior police officials should act tough against their subordinates with doubtful credentials. Similarly, High Court should advise the lower courts against granting bail to habitual offenders. Places like Mutharasanallur on the outskirts of Tiruchi have become a safe haven for criminals. A few weeks ago, a special team of the police nabbed two chain snatchers with their high-end motorcycles at Kamarajapuram, Mutharasanallur.\n\nS.P. Raghavan,\n\nTiruchi\n\nRemove kusa grass\n\nThe dazzling beauty of the Cauvery has diminished a little bit with monstrous growth of kusa grass. The bottomless kusa grass blocks the flow of the water Farmers in the nearby villages do not know how to deal with the crisis. The authorities concerned should clear the kusa grasses with the aid of JCB machine for the rapid movement of water in a proper direction.\n\nAravind K. Rao,\n\nSrirangam\n\nBeautify banks\n\nof Uyyakondan\n\nA new bridge has come up on the Uyyakondan in Vayalur Road, which is a long-felt need. Now the corporation to consider beautification of the banks of the river on the stretch between Vayalur Road and Kuzhumayi Amman temple since there are not many parks or recreation facilities in the area. This stretch can be developed into a beautiful picnic spot. It would be a boon to morning walkers if the corporation or the PWD consider building a jogging track alongside the river bank.\n\nK. Muthuswamy,\n\nTiruchi\n\nShift MGR statue\n\nAlthough the new link road from Sastri Road to District Court Complex Road was completed five months ago, the traffic roundtana near the court complex is yet to be completed, posing a problem to motorists using this road. The statue of the late M.G. Ramachandran at Lawsons Road junction seems to be coming in the way of completing the work. The officials concerned should convince people and find an amicable solution to shift this statue to a new spot. This should be a lesson for the government not to allow installation of statues on busy roads.\n\nThirumeni J.,\n\nCantonment\n\nAccidents\n\non bridges\n\nState Highway 62 is maintained by the Highways Department of Government of Tamil Nadu. It connects Tiruchi with Thuraiyur in the northern part of Tamil Nadu. Six months ago a bridge work was taken up near Thuraiyur. The bridge work has been completed but the speed-breakers are not removed. Only polymer flux is shown. It is not visible at night. The speed-breakers have not been painted. Another bridge work has been taken up on the same route in Navamaram stopping, Kannanur Road near Pagalavadi village. Here unexpected accumulation of sand on the bridge causes accident at night.\n\nSaravnan Natesan,\n\nPuthanampatti", 
    "section": "national", 
    "title": "Revive water bodies", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}