{
    "author": [
        "S Prasad"
    ], 
    "text": "Focus will be on creating awareness among road users\n\nGovernment will take steps to promote conscious planning for safe design of roads and related infrastructure in Puducherry.— File Photo\n\nThe Puducherry government on Monday launched a Road Safety policy and Action plan to reduce the number of fatalities and accidents by 50 per cent by 2020.\n\n“The policy has been formulated in accordance with the directives of the Supreme Court and the Union Road Transport Ministry and provides the basis for working towards attaining the vision of an accident-free Puducherry by promoting safe mobility for all,” said Chief Minister N. Rangasamy, who launched the policy here.\n\nAs per the National Crime Records Bureau (NCRB), the Union Territory had the highest rate of accident deaths with – 68.3 per lakh population, compared to the national average of 32.6. In 2013, as many as 1451 road accidents with 228 fatalities were reported.\n\nUnder the policy, various departments such as Transport, Education, Excise, Health, Local Administration, Police, Public Works Department, Revenue, Town and Country Planning Department would coordinate and prepare action plans to reduce the incidence of road accidents from the present trend by 50 per cent by 2020 and to maintain the zero growth level.\n\nThe plan would be revised periodically every three years and the goals would be reset.\n\nIn order to achieve significant improvement in road safety, the government will initiate steps to promote awareness about road safety problems, its social and economic implications.\n\nThe government will also take steps to promote conscious planning for safe design of roads and related infrastructure and rectification of black spots.\n\nLocations with a high incidence of accidents will be mapped and corrective measures taken to reduce conflicts in moving traffic, the notification said.\n\nThe government has also proposed an action plan for Emergency Medical Services (EMS) system with the aim of providing effective and economical emergency care to maintain uniformity and continuity across the State.\n\nThe proposed framework will specify broad specifications, guidelines and protocols for the various components of EMS system.\n\nRoad safety fund\n\nA Road Safety Fund will be set up for improving road safety measures and commensurate allocation of resources, out of the proceeds of the spot fine and compounding fee collection of the Transport Department and the Police Department in the Union territory of Puducherry.\n\nThe Road Safety Cell will be strengthened to create a mechanism for reporting and a Road Safety information data base, the notification added.", 
    "section": "national", 
    "title": "Road safety policy aims to cut accidents by 50%", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}