{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Corporation puts up a temporary roundabout near Ayyappa Temple\n\non a trial basis:A new roundabout has been put up at the busy junction of Lawsons Road and Bharatidasan Road in Tiruchi.— PHOTO: B. VELANKANNI RAJ\n\nThe Tiruchirapalli City Corporation, which had demolished a portion of median on Bharathidasan Road near MGR statue for constructing new roundabout, has planned to raise the road level to remove traffic bottleneck.\n\nAlthough opening the road for traffic on Anna Nagar-Cantonment section has received widespread support, there are dissenting voices. The new arrangement appears to slow down the flow of traffic on Bharathidasan Road from Puthur, and Pattabiraman Pillai Street as the vehicles have to take a small deviation on the Anna Nagar link road to proceed on Bharathidasan Road.\n\nSome motorists are of the view that the area marked for constructing roundabout is large when considering the narrow roads. The pile up of vehicles can be avoided if the corporation shrinks small roundabout. They say that installation of new traffic signal may regulate traffic on all four sides around MGR statue.\n\nA senior official of the Tiruchirapalli City Corporation told The Hindu that it was true that traffic flow had been affected. The current arrangement was temporary. The corporation will monitor the flow of vehicles and difficulties faced by the motorists. All issues will be sorted out to ensure smooth flow of traffic. He said shifting of electric post and high-mast post would ease the problems to an extent. The Tamil Nadu Generation and Distribution Corporation (Tangedco) had been asked to shift them as soon as possible.\n\nStating that the new arrangement had been made with the design of highways research centre in Chennai, he said minor changes could be made based on inputs and suggestions of road users.\n\nMoreover, the corporation had allocated Rs. 46 lakh to make all roads even at the roundabout. Similarly, the rounds would be expanded as much as possible.", 
    "section": "national", 
    "title": "Roundabout throws up new problems at traffic junction", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}