{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Carts transport sand from govt.-run quarry at Rangapuram ply on main roads\n\n: While Vellore city is already battling traffic congestion at key junctions and stretches, sand-laden bullock carts plying on main roads at daytime have been adding to the traffic woes.\n\nThe carts that transport sand from the government-run quarry at Rangapuram have been plying on main roads including Katpadi Road and National Highways service lane, slowing down traffic flow and obstructing movement of vehicles, according to road users.\n\nIn fact, recently, officials changed the bill issuing time at the quarry from the earlier 8 a.m. to 10 a.m. to 10 a.m. to 12 noon to avoid traffic tangles during peak hours, especially during school hours. But this change in timing might have eased the situation to an extent but has not solved it.\n\nRoad users continue to find it difficult as scores of sand-laden bullock carts ply on many of the main roads starting from 10.30 a.m. to noon.\n\nFrom Rangapuram, the bullock carts ply to several areas in and around Vellore city including Bagayam, Kaniyambadi, Katpadi, Latheri, Tiruvalam, Melmonavur and Puttuthakku.\n\nThey travel on the NH service lane, and go through Vellore city roads including Saidapet and Katpadi to reach many of these places. The vehicles pass through the Green Circle, adding to the already existing traffic congestion at the junction.\n\nCarts come in batches\n\n“Between 10 a.m. and 12 noon, we see scores of bullock carts passing through the Green Circle. They come in batches of 20 to 25 vehicles at a time, resulting in traffic congestion here,” said an auto rickshaw driver near Green Circle.\n\nMovement of these carts cause hindrance to other road users. “Vehicles have to stop as these carts line up on the service lane of the NH at Sathuvachari. We get held up behind these vehicles to allow those coming in the opposite direction,” said Ravikumar, an office-goer.\n\nS.K. Sankar, district secretary, Vellore District Puratchi Thalaivar MGR Rettai Maatu Vandi Thozhilalargal Sangam said 300 to 350 bullock carts load and transport sand from the Rangapuram quarry everyday.\n\nThe quarry was opened exclusively for bullock carts in July 2015, and is the only one till now for bullock carts. The carts start entering the quarry to load sand starting from 5 a.m.\n\nBilling time\n\n“Earlier, the billing time at the quarry was from 8 a.m. to 10 a.m. In the last one week, officials changed the timing to 10 a.m. to 12 noon saying that the carts were obstructing traffic flow during school and office hours,” he said.\n\nThe association has already petitioned the district administration and the police to change the timing to 5 a.m. to 7.30 a.m.\n\n“This way, we will cross the city limit by 7 a.m. and will in no way obstruct flow of traffic. The present timing is causing hardship for the bulls too as the animals have to walk for several kms in the scorching sun. The animals become tired in walking for 8 to 10 kms and reach the destination by 3.30 p.m.,” he added. Sand loaded in three carts measure a unit of sand, he said.", 
    "section": "national", 
    "title": "Sand-laden carts hinder traffic", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}