{
    "author": [
        "D J Walter Scott"
    ], 
    "text": "With a view to expanding the area of cultivation and increasing the productivity of pulses, the Department of Agriculture has raised seed farms with the cooperation of progressive farmers to supply quality seeds to farmers during the next season.\n\nFarmers, who had cultivated pulses such as black gram, red gram, green gram and cowpea about two decades ago, and gave up the cultivation after finding them non- remunerative, began to cultivate pulses after the department introduced drought-prone high- yielding varieties.\n\nThis season, farmers have raised black gram, (VBN-Bg 4, 5), green gram (VBN-Gg 2, 3) and cowpea (Co 6,7), best suited for the arid district on about 4,000 hectares, nearly 50 per cent of them in Kamudhi area, and expected to harvest about 1,200 tonnes with an average production of about 300 kg per hectare.\n\nAfter the Food and Agriculture Organisation (FAO) of the United Nations declared the year 2016 as International Year of Pulses, the department has taken fresh initiatives to bring more area under pulses cultivation and increase the production, according to S.S. Shaiek Abdullah, Assistant Director (AD), Seed Certification, told The Hindu after an inspection of a seed farm at Nambiyan Valasai near here on Monday.\n\n“With the supply of certified seeds and technical support to the farmers, we could increase the production by 15 to 20 per cent in the coming season,” he said adding presently the yield was 300 to 400 kg of pulses per hectare and this could go up to 500 to 600 kg with quality seeds.\n\n“We will ultimately achieve the target of 800 kg per hectare,” he said.\n\nWhile encouraging farmers to set up seed farms, the department provided production subsidy of Rs. 15 per kg and certified seed distribution at Rs. 25 per kg under National Agriculture Development Programme and National Food Security Mission (Pulses) respectively, he said.\n\nMr. Abdullah said that the department proposed to procure about 17 tonnes of seeds from the seed farms to be supplied as certified seeds to the farmers.\n\nMore farmers could take up cultivation of short-duration crops, he said adding they were also drought and disease resistant.\n\nAs pulses had nitrogen fixing quality in the roots, the cultivation helped to improve soil fertility, B. Kumaravadivel, AD, Thirupullani block, said.", 
    "section": "national", 
    "title": "Seed farm established to increase production", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}