{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The following special trains will be run to clear the extra rush of traffic in view of Pongal festival.\n\nTrain No.06175 Chennai Egmore-Coimbatore special train via Villupuram, Vriddhachalam and Salem will leave Chennai Egmore at 10.15 a.m. on Wednesday and reach Coimbatore at 9 p.m. the same day.\n\nTrain No.06176 Coimbatore-Chennai Egmore special train will leave Coimbatore at 5.30 a.m. on Thursday and reach Chennai Egmore at 4.15 a.m. the same day.\n\nStoppages: Tambaram, Chengalpattu, Melmaruvathur, Tindivanam, Villupuram, Vriddhachalam, Chinna Salem, Attur, Salem Town, Salem Jn., Sankaridurg, Erode, Uthukkuli, Tirupur and Coimbatore North.\n\nTrain No.06176 Coimbatore-Chennai Egmore special train will stop at Mambalam also.\n\nTrain No.06177 Chennai Egmore-Tirunelveli special train will leave Chennai Egmore at 9.05 p.m. on Wednesday and reach Tirunelveli at 10.45 a.m. the next day.\n\nStoppages: Tambaram, Chengalpattu, Villupuram, Vriddhachalam, Tiruchchirappalli, Dindigul, Kodaikkanal Road, Madurai, Virudhunagar, Sattur, Kovilpatti and Vanchi Maniyachchi.\n\nTrain No.06178 Kochuveli-Chennai Central special train will leave Kochuveli at 1 a.m. on Saturday and reach Chennai Central at 6.30 p.m. the same day.\n\nStoppages: Kollam, Kayamkulam, Chengannur, Tiruvalla, Kottayam, Ernakulam Town, Aluva, Thrissur, Palakkad, Coimbatore, Tiruppur, Erode, Salem, Jolarpettai, Katpadi, Arakkonam and Perambur.\n\nTrain No.06179 Chennai Central-Vizianagaram special train will leave Chennai Central at 7 p.m. on Thursday and reach Vizianagaram at 11.30 a.m. the next day.\n\nStoppages: Sullurupeta, Gudur, Nellore, Ongole, Tenali, Vijayawada, Eluru, Tadepalligudem, Rajamundry, Samalkot, Anakapalli, Duvavada and Visakhapatnam.\n\nAdvance reservations for the above trains are open, said Southern Railway.\n\nChanges\n\nDue to line block to facilitate engineering works between Vandalur and Guduvancheri in Chennai Egmore-Chengalpattu section, the following changes will be made in suburban train services on Tuesday and Wednesday. Train No.40569 Chennai Beach-Chengalpattu EMU local, scheduled to leave Chennai Beach at 9.20 p.m., will bepartially cancelled between Tambaram-Chengalpattu. It will run from Chennai Beach to Tambaram only. Train No.40574 Chengalpattu-Chennai Beach EMU local, scheduled to leave Chengalpattu at 11.10 p.m., will bepartially cancelled between Chengalpattu- Tambaram. It will run from Tambaram to Chennai Beach.\n\nChennai Egmore-Tirunelveli special will leave Chennai Egmore at 9.05 p.m. on Wednesday", 
    "section": "national", 
    "title": "Special trains in view of Pongal rush", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}