{
    "author": [
        "P Sudhakar"
    ], 
    "text": "“Demand from the public will increase from today onwards”\n\nWith the ‘Pongal celebrations’ fast approaching, sale of the goods required for the traditional celebration of the harvest festival is gradually moving to top gear in the district.\n\nSugarcane, the inseparable constituent of Pongal celebrations, from Madurai, Theni, Tiruchi and Thanjavur districts, is flooding the markets across the district. A bundle with 15 canes was sold anywhere between Rs.350 and Rs.400 till a week ago, which is slightly higher than the previous year’s price.\n\nWhen the demand for sugarcane increased manifold with the officials buying sugarcane for giving it to the beneficiaries along with ‘Pongal gift hamper’ as mandated by the State government, each bundle with 10 sugarcanes is being sold for Rs. 300 now.\n\n“We expect the price to go up further as the demand from the public will increase from Tuesday onwards,” said S. Neelakantan, a trader from Theni. When the sugarcane sellers quoted an exorbitant price last year and also in 2013 till Bhogi, the sale dipped drastically and most of the traders from other districts, who had set up roadside selling points, had to leave unsold bundles at the same place as none was prepared to buy at the inflated price even after ‘Kaanum Pongal’.\n\nThe ultimate beneficiaries of this unexpected development were the sugarcane juice sellers, who could either buy the sugarcane bundles at throwaway price or ‘buy one and get one free’ arrangement.\n\nDry palm leaves, which are used traditionally as a fuel for preparing sweet Pongal, have been heaped at several places and are being sold at Rs.15 a leaf while smaller leaves are being sold at Rs.10.\n\nThe palmyrah tuber bundles, having 25 tubers, are being sold at Rs. 40 and the increased supply is likely to bring down this selling price in the next couple of days. “Palmyrah tuber yield is really good this year and hence, the price has come down from Rs.60. Owing to the increased supply, the price will come down further, we expect,” said S. Vedha Manickam, a palmyrah tuber seller.\n\nAnother constituent of Pongal celebrations, turmeric is being sold for Rs.25 per bunch as the yield is good this year, thanks to excess rainfall.", 
    "section": "national", 
    "title": "Sugarcane price may skyrocket soon", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}