{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It is Rs. 550 a tonne more than the Centre's Fair and Remunerative Price\n\nSugarcane farmers have been asking the government to fix SAP for the past three months since the start of the crushing season. -Picture used for representational purpose\n\nThe State government has fixed the State Advised Price (SAP) of sugarcane for the 2015-16 season at Rs. 2,850 per tonne. With the sugar industry in turmoil, both the farmers as well as the mills are highly disappointed.\n\nAfter a high-level meeting at the Secretariat on Monday, Chief Minister Jayalalithaa announced that the State has fixed the SAP at Rs. 2,850 a tonne, which is Rs. 550 a tonne more than the statutory Fair and Remunerative Price (FRP) of Rs. 2,300 set by the Central government.\n\nThe SAP includes Rs. 100 per tonne as cost for transporting sugar.\n\nWith the subsidies given for irrigation to small and medium farmers, the State was ranked first in sugar production, she said in an official release hoping that the government’s decision would bring happiness to the cane farmers.\n\nSugarcane farmers have been asking the government to fix SAP for the past three months since the start of the crushing season. For the last two years, the State had fixed the SAP at Rs. 2,650 per tonne.\n\nFarmers disappointed\n\nMeanwhile, the Tamil Nadu Sugarcane Farmers’ Association has expressed disappointment stating that they were expecting Rs. 4,000 per tonne.\n\n“For the past two years, there was no increase in SAP. This year, they have made it up by giving Rs. 200 more per tonne. In real terms, this is not an increase at all,” said D. Ravindran, association general secretary. Private mills have not paid SAP for the past two years amounting to Rs. 600 crore, he said wondering if they would give it this year. Moreover, the area of cultivation and actual production of sugarcane has gone down over the past three years, he said.\n\nIn a statement, South Indian Sugar Mills Association (Tamil Nadu) secretary S. Chellappa said that paying any higher price over FRP would be beyond the means of sugar mills. Maharashtra, the biggest sugar producing State in the country, has gone for 80:20 formula for payment of FRP, and mills in Karnataka were paying FRP in instalments during the current season, he said.\n\nVAT on sugar sales, restrictions on ethanol production and supply, un-remunerative tariff for power exports and steep fall in sugar prices have taken a toll on the financial health of sugar mills. Most of the mills have gone for debt restructuring, and accumulated losses over the past two seasons have led to a liquidity crunch.\n\nThe SISMA requested the State to remove VAT on sugar sales and the cap on ethanol production and revise power tariff so that mills would have the ability to pay the FRP. The State should consider direct subsidy to farmers to bridge the gap between the SAP and the ability of the mills to pay the same, he demanded.", 
    "section": "national", 
    "title": "Sugarcane SAP fixed at Rs. 2,850 per tonne", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}