{
    "author": [
        "Staff Reporter"
    ], 
    "text": "District administration issues instructions\n\nThe district administration has geared up its activities to conduct ‘jallikattu’ at villages for this Pongal and issued a series of instructions, including constitution of a committee for strict implementation of the guidelines of the Central government.\n\nAddressing a special meeting in this connection at the Collectorate here on Monday, Collector .N. Venkatachalam said ‘jallikattu’ would be allowed only at traditional places where organisers conducted the event even before the ban.\n\n“All safety measures should be observed strictly. All bulls should be controlled within 15 metres from the entrance (‘jallikattu’ vaadi vaasal). Veterinary doctor’s certification was a must for the bulls to participate in ‘jallikattu.’\n\nVeterinary doctors should ensure that bulls were not injected with any steroid and were fit to take part in the event. Basic rights of animals under the Animal Rights Act should be ensured strictly. Animals should not feel hungry, thirsty, pain, fear and other inconveniences.\n\nThere should be no wounds on their bodies. They should not be tortured or humiliated physically or emotionally before taking part in ‘jallikattu,” he advised.\n\nOnly bull tamers will be allowed to enter the ground. Uniform should be given to bull tamers for easy identification.\n\nIron fence should be erected around the ground to ensure safety of spectators. Fire and ambulance facilities should be provided at the event spot.\n\nRevenue officials should monitor the entire activities meticulously.\n\nA special committee, with community participation, should be formed to conduct ‘jallikattu’ safely and follow the procedures and guidelines of the Central government, the Collector said.", 
    "section": "national", 
    "title": "Theni gearing up for ‘jallikattu’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}