{
    "author": [], 
    "text": "RELIGION\n\nSri Andavan Ashram, Srirangam: Tirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha: Tirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Tirumala Tirupati Devasthanam: Tirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai: Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Krishnar sannidhi, Sri Bhandaram, Srirangam Sri Ranganathaswamy temple, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 9/4, 7th cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nSri Kailash Kamala Ganapathy Temple, Kailash Nagar: Pongal festival, cultural programme by students of Vidivelli Special School, 6.45 p.m.\n\nKarivaradan Kainkarya Sabha and Srirangam Educational Society: Painting exhibition on Sri Ramanujar, V.S. Mahal, Keezha Adayavalanjan Street, Srirangam, 10 a.m.\n\nGENERAL\n\nVivekananda Samooga Sevai Amaippu, JCI Tiruchi, Vivekananda Yoga Mayiam and Vivekananda Foundation: Birth anniversary of Swami Vivekananda, photo exhibition and painting competition, S.N. Marriage Hall, 9.30 a.m.\n\nSaranathan College of Engineering NSS unit: National Youth Day celebrations, Ramanujam, chairman, Maharishi Vidhya Mandir & Pravag, chief guest, 3 p.m.\n\nBharathidasan University NCC unit and Tamil Nadu Asthma and Allergy Research Foundation: Smoke-free Bhogi festival, Jothimani Ilangovan Assistant Station Director, AIR, Tiruchi and S. Sivaramakrishnan, Syndicate Member, chief guests, G. Kamal, Director of Foundation and N. Murugeswari, Publication Officer of University, speak, a/c auditorium, 11 a.m.\n\nSt. Joseph’s College: INDEP, inter-departmental cultural extravaganza, Jothimani Ilangovan, Assistant Director / Programme Head, All India Radio, Tiruchi, inaugurates, 9 a.m.\n\nChidambaram Pillai College for Women: Lecture on “Physics of pyramids” by M. Jamal Mohamed Jaffar, head, Department of Physics, Jamal Mohamed College, 1.30 p.m.\n\nRotary Club of Tiruchi Midtown: A talk on “Laughing Therapy” by Kausalya Murugesan, Hotel Sangam, 7 p.m.\n\nPG and Research Department of English, Jamal Mohamed College: National seminar on “Identities and Realities: Texts and contexts in post colonial literatures,” H. Kalpana, Associate Professor, Department of English, School of Humanities, Pondicherry University, inaugurates, 9.30 a.m.; A.K. Khaja Nazeemudeen, secretary and correspondent, Jamal Mohamed College, delivers valedictory address, 4.30 p.m.; PG Department of Zoology: Lecture sessions, A. Veera Ravi, Associate Professor of Biotechnology, Alagappa University, speaks on “Cell to cell communication mechanism in bacteria,” R. Jayakumar, senior scientist, Centre for Fishery Research Institute, speaks on “Business opportunities with marine fisheries,” and M. Kailasam, Principal Scientist, Central Institute of Brackish Water Aquaculture, speaks on “Recent advances on Brackish water fish seed production and farming,” 10.30 a.m.\n\nPeriyar EVR College: Training and Placement Cell, Pan Card camp, Periyar Auditorium, 11.30 a.m.\n\nCampion Anglo Indian Higher Secondary School: Annual day, Mathew T. Thomas, Country Director, U.S. Food and Drug Administration, New Delhi, chief guest, 5.45 p.m.\n\nHoly Cross College: English Literary Association meeting, Christine Gomez, former Reader of Department of English, Holy Cross College, speaks on creative writing, 11 a.m.\n\nBishop Heber College: Department of Social Work, Pongal celebrations, Shape Maiyam, 11 a.m.; seminar on ‘Human rights’, Iniyanallur, Murugan Nagar, 10.30 a.m.; Awareness on toilet usage, Kavalkaranpalayam, 10 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}