{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Prices of vegetables to be fixed on a daily basis depending upon arrivals\n\nChief Minister Jayalalithaa on Monday inaugurated seven farm fresh outlets in Tiruchi through video conferencing.\n\nSoon after the inauguration, Collector K.S. Palanisamy visited an outlet at Chinthamani in Puthur and signalled the sale of vegetables brought from procurement centres in rural areas of the district.\n\nThe outlets are functioning at Chinthamani super market in Puthur, Srinivasa Nagar, Thiruvadi street in Srirangam, Thiruvanaikovil, Subramaniapuram, Kallukuzhi and Sundar Nagar. They will function between 7 am to 11 am and 5 pm to 9 pm.\n\nK.C. Ravichandran, Joint Registrar of Cooperative, Tiruchi, told The Hindu that arrangements had been made to bring fresh vegetables from Thangammapatti in Dindigul district, Thayanur, Somarasampettai, Kovilpatti, Marungapuri and Nagalapuram in Tiruchi district.\n\nThe Primary Agricultural Credit Societies (PACS) in the respective villages would buy vegetables directly from the farmers and transport them to Tiruchi.\n\nSmall and big onions, tomato, brinjal, green chilli, leafy vegetables and others would be procured from rural areas of Tiruchi district.\n\nEnglish vegetables would be procured from wholesale market in Tiruchi for the time being.\n\nTo be cheaper\n\nHe said prices of vegetables would be fixed on a daily basis depending upon arrivals.\n\nThe prices would be at least 20 per cent less than the Uzhavar Sandhai and open market.\n\nMr. Ravichandran said the pricing would be on the basis of stablishing market prices whenever the prices went up. Profit would not be the motto of farm fresh outlets.\n\nThe department could pass the benefits to the customers since there was no role for middlemen at any level in the procurement of vegetables.", 
    "section": "national", 
    "title": "Tiruchi gets seven farm fresh outlets", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}