{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They have been booked under POCSO\n\nThe police have arrested two men and booked them under Protection of Children from Sexual Offences Act (POCSO Act), 2012, in connection with the sexual assault of two school girls from Tiruvottiyur a few days ago.\n\nAccording to the police, Vinod (28), an autorickshaw driver, and Kalainesan (29), a mechanic, have been arrested for allegedly assaulting two girls studying in classes VII and VIII, who went missing from their house in Tiruvottiyur on January 8.\n\nThe two, who left for school in the morning of January 8, did not return home. On Sunday (January 10), they returned home with injuries.\n\nWhen their parents questioned them, the girls revealed that they had gone for a movie on Thursday, bunking school. “They were frightened that their teacher would scold them and ran away from their house on January 8. They spent the night at a temple in Besant Nagar and spent the next day on the beach,” said a police officer.\n\nVinod and Kalainesan spotted the girls and struck a conversation with them. “They promised to take them around the city and the two girls went around in an autorickshaw. After this, the men took the unsuspecting girls to Muttukadu and sexually assaulted them,” said a police officer.\n\nThe same day, they were returning in an autorickshaw on East Coast Road when the vehicle hit the median and the four were injured.\n\n“They got admitted to a private hospital for treatment. Using this as an opportunity, the girls escaped and returned home,” said the officer. Based on a complaint from the parents, the police arrested Vinod and Kalaiarasan and booked them under Section 6 of the POCSO Act (aggravated penetrative sexual assault). The duo has been remanded.\n\nThe girls had gone missing from their house in Tiruvottiyur\n\non January 8", 
    "section": "national", 
    "title": "Two men held for sexual assault of two girls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}