{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They were occupying main road in Villapuram creating disturbance to public: official\n\nMembers of Madurai District Street Vendors’ Association staging a demonstration protesting against police action in Madurai on Monday.— Photo: G. Moorthy\n\nMore than 50 vendors who set up shops in the weekly market at Villapuram filed a petition at the Collector’s office, complaining high-handed treatment by the Avaniapuram police.\n\nM. Nandasingh, president, Madurai District Street Vendors’ Association, alleged that a team of police personnel led by Inspector C. Sethumani Madhavan harassed some of the street vendors last Thursday and threatened to foist cases against them.\n\nArgument\n\nAccording to T. Selvam, a street vendor, the issue broke out over an argument between two women who had set up shops.\n\nThe vendors said that a case was also booked against seven vendors on Thursday.\n\nHe alleged that the Inspector acted in favour of the person who had taken contract of the market. ‘We were among the 60 persons who set up shops eight years back.\n\nNow, the numbers have increased manifold as the new contractor allowed more vendors to collect more rent,” Mr. Selvam said.\n\nLater, the vendors went to the City Police Commissioner’s office to file a complaint.\n\n“The officials assured that they will conduct an inquiry on the officials,” Mr. Nandasingh said.\n\nWhen contacted, Mr. Sethumani Madhavan, refuted the allegations that the police behaved inappropriately.\n\nHe said that the vendors were occupying the main road in Villapuram creating disturbance to the public because of which the police had to take action.\n\n“Moreover, some vendors, claiming to belong to associations, were not allowing other vendors to set up shops,” he said.", 
    "section": "national", 
    "title": "Vendors complain against police", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}