{
    "author": [
        "M Balaganessin"
    ], 
    "text": "(On top) A view of the industrial plots at the SIDCO Industrial Estate at Mallur; (below) a view of the sub-station at Mallur near the SIDCO Industrial Estate.— Photos: M. Srinath\n\n30 industrial plots, each measuring from five to 30 cents, have been developed on 25 acres\n\nAlthough the Small Industries Development Corporation (SIDCO) has set up an industrial estate at Mallur near Pazhuvur, it has not attracted the entrepreneurs so far to the expected level.\n\nIt took up the initiative about a couple of years on 25 acres and developed it into 30 industrial plots, each varying from five to 30 cents.\n\nThe entire village is dotted with thorny bushes and dry land and, obviously, SIDCO had taken extra efforts for clearing the bushes and thick vegetation before levelling the ground.\n\nAccording to the sources, the price had been fixed at about Rs.55 lakh an acre, which was far less compared to the rates available in other estates. The minimum investment on land would be Rs. 2.75 lakh which was very fair.\n\nThe source explained the hard efforts taken by the SIDCO in moving machinery to the site for levelling it.\n\nIncidentally, the Tamil Nadu Generation and Distribution Corporation had set up its sub-station which will ensure immediate quality power supply to the SIDCO industrial units.\n\n“It is a blessing for industrialists and entrepreneurs to avail themselves of quality power from the sub-station,” the source told The Hindu here on Monday.\n\nHe said adequate motivational programmes were being organised by the SIDCO, the district administration and the District Industries Centre to attract the entrepreneurs.\n\nCollector E. Saravanavel Raj said three entrepreneurs have submitted their proposals to set up their sheds so far. He said the SIDCO had planned to let out the shed only on long lease of 30 years and not for outright sale. This was one of the reasons impeding the entrepreneurs from investing on the shed here. Presently, the estate site is being used by local villagers for grazing of livestock.", 
    "section": "national", 
    "title": "Very few takers for SIDCO plots", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}