{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Differences over path for a water supply pipeline have divided villagers of Murungathozhuvu Panchayat in Chennimalai Panchayat Union.\n\nNearly three months after a section of villagers expressed displeasure over alleged alteration of the pipeline path by officials in breach of established procedures, another section of the villagers approached the district administration on Monday charging the panchayat president with not complying with the official decision on the pipeline.\n\nThe pipeline is being laid from downstream Olaikattu where water is harnessed in a check dam located between the LBP Canal and Noyyal river. The alignment of pipeline path through the shortest route was reportedly decided by the panchayat during 2010 based on a resolution.\n\nBut, the circumlocutory path advocated by officials not only crossed a temple land, but also increased the upward gradient height, which would require power unnecessarily for pumping to a higher level according to panchayat president Ravi, who had moved the High Court seeking strict adherence to the panchayat resolution in the issue.\n\nThe project to pump water from Olaikattu to the village tank envisages fulfilling the drinking water needs of 8,500 residents in Murungathozhuvu spread over 26 sq.km., the largest panchayat in Chennimalai Panchayat Union, as also linking two other tanks in Kalikkavalasu and Pudupalayam.\n\nThe villagers who submitted the petition to the district administration on Monday said that the work on laying of pipeline must be put on hold until the High Court decides on the matter later this month.\n\nAnother petition by the villagers urged the district administration to restrain the panchayat from granting fishing rights in the village tank, saying the water body was considered holy by devotees of Lord Shiva.", 
    "section": "national", 
    "title": "Villagers divided over water pipeline path", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}