{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Mahila Court in Srivilliputtur on Monday awarded triple life sentences to a youth on a charge of stabbing to death a 13-year-old boy on a school campus at Pandalgudi in Virudhunagar in 2014, following a strain in their homosexual relationship. His accomplice has also been convicted in the case.\n\nAccording to prosecution, the accused, S. Mareeswaran, of Vilathikulam in Tuticorin district barged into the Boys’ Higher Secondary School in Pandalgudi on November 28, 2014, and repeatedly stabbed the Class VIII boy with a knife, killing him on the spot.\n\nMareeswaran (then 18 years), and his associate, Maheswaran (33), both from Tuticorin district, escaped after the crime. The Pandalgudi police arrested the duo.\n\nPassing orders, the judge Rajalakshmi awarded triple life sentences to Mareeswaran on charges of indulging in unnatural sex, committing murder and under the provisions for Protection of Children from Sexual Offences Act, 2012, and 10 years imprisonment for trespassing into the school. The judge also imposed a fine of Rs. one lakh (failing which three years jail) and Rs. 10,000 fine (failing which three months jail) on him.\n\n“The judge has ordered the convict to undergo two life imprisonments and 10-year RI for offences under the Indian Penal Code concurrently and to undergo the other life imprisonment (under POCSO Act) separately. So, he will have to undergo two life imprisonments one after the other,” the Investigation Officer, A. Dharmalingam, who was the then Inspector of Police, Aruppukottai Taluk station, said.\n\nSince the charge-sheet was filed within 50 days from the date of the occurrence of the crime, the accused could not come out on bail, he added.\n\nThe other convict, Maheswaran, who was also charged of murder (read with abetment), was awarded life sentence and a fine of Rs. 50,000.\n\nThe prosecution said that Maheswaran had hatched the conspiracy with Mareeswaran to murder the boy and also bought him a knife.\n\nHe also dropped Mareeswaran at the school on his bike and after the murder picked him up on the two-wheeler helping him to escape.", 
    "section": "national", 
    "title": "Youth gets triple life sentence", 
    "subsection": "tamilnadu", 
    "date": "2016-01-12"
}