{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Highlighting that around 25 percent of youngsters in the age group of 18 to 19 in the district were yet to register in the electoral roll, Collector K. Veera Raghava Rao said that special camps would be organised in all colleges in the coming weeks to bridge this gap.\n\n“Campus ambassadors have been selected from every college to encourage students to enrol. We have urged the college authorities to facilitate 100 percent enrolment of all eligible voters in their colleges,” Mr. Rao told The Hindu after addressing students of The American College as part of National Voters’ Day celebration on Monday. In his address, Mr. Rao pointed out that of the 1,045,563 youngsters of 18 to 19 years in the district, only 78,099 had enrolled in the voters’ list. Sources at the district administration said that the difference between eligible voters and enrolled voters in the population was highest in the 18 to 19 age group followed by the 20 to 29 age group.\n\nSuperintendent of Police Vijayendra Bidari and Additional Collector and Project Officer of District Rural Development Agency (DRDA) B. Rohini Ramdas also urged the students to exercise their right to vote during the function.\n\nStressing that elections were a humongous logistical exercise, Mr. Bidari said that efforts by the government to conduct a fair and free elections would be meaningless if people, particularly youngsters, did not vote. He urged the students to use the Election Commission of India website to get themselves enrolled as most of the youngsters were tech-savvy.\n\nMs. Rohini said that voting in the elections would be the most basic thing one could do for nation building. Stating that the idea of observing National Voters’ Day was to promote inclusive and qualitative participation in the elections, Ms. Rohini said that first-time voters were generally the ones left behind in the election process.\n\nM. Davamani Christober, Principal of The American College, said that all efforts were being made by the college to get 100 percent enrolment.\n\nEarlier, the Collector took part in a jogging rally at the Race Course Road in the morning to create awareness of voter enrolment.", 
    "section": "national", 
    "title": "25 per cent youth yet to enrol as voters in Madurai district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}