{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Three Inspector-Generals of Police were among 22 police officials chosen from Tamil Nadu for the award of President’s Police Medal for Distinguished/Meritorious Service. The awards were announced by the Union government on the eve of the Republic Day celebrations.\n\nWhile M. Ravi, IGP/Chief Vigilance Officer, Tamil Nadu Cooperative Milk Producers Federation, was chosen for the President’s Police Medal for Distinguished Service, M.C. Sarangan, IGP (Technical Services) and Sanjay Kumar, IGP, State Crime Records Bureau, were among 20 recipients of the President’s Police Medal for Meritorious Service.\n\nG. Sambandam, Deputy Superintendent of Police, Special Investigation Cell, Directorate Vigilance and Anti-Corruption, who was the Investigation Officer in the corruption case against Chief Minister Jayalalithaa, has also been awarded the President’s Police Medal for Distinguished Service. The case ended in acquittal and an appeal is pending in the Supreme Court. The other awardees of Presidents Police Medal for Meritorious Service are R. Russel Samraj, Additional Superintendent of Police (ADSP), Police Computer Wing, SCRB, R. Veeraraghavan ADSP, Headquarters, Krishnagiri, Ponniah Thevar Malaichamy, DSP, Crime Branch CID, Tiruchi, P. Ravi, DSP, Tamil Nadu Uniformed Services Recruitment Board, Chennai, T. Ramamoorthy Assistant Commissioner of Police, Srirangam Crime Range, Tiruchi City, C. Mugilan, DSP, Vandalur Sub-Division, Kacnheepuram district, B. Nandakumar, ACP, Guindy Range, Chennai Police, M. Sirajudeen, DSP, Organised Crime Intelligence Unit, Chennai, S.V. Bargunam, DSP, DVAC, Vigilance and Anti-Corruption, Tirunelveli, V. Kannan, ACP, Home Guards, R. Manonmani, Inspector of Police (technical), Tiruchi, M. Moorthy, Inspector of Police, Tamil Nadu Commando School, Chennai, A. Subramanian, Inspector of Police, Security Branch CID, Chennai, K. Raghu, Inspector of Police (Technical), Purchase Unit, Chennai, S. Balasubramanian, Special Sub-Inspector, V&AC, Virudhunagar, S. Arul Azhagan, SSI, V&AC, Chennai, N. Venugopal SSI, V&AC, Chennai and R. Sekar, SSI, District Crime Branch, Thanjavur district,", 
    "section": "national", 
    "title": "3 IGPs among President’s police medal awardees", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}