{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Armed with comprehensive statistics on voting pattern in all 234 Assembly constituencies in Tamil Nadu during the previous elections, the All India Anna Dravida Munnetra Kazhagam’s Information Technology wing has drawn up a plan of carrying out an effective election campaign in the political opponents’ strongholds to turn their votes in favour of the ruling party.\n\nSpeaking at a meeting organised here by the AIADMK’s Information Technology wing, its secretary, ‘Aspire’ K. Swaminathan said the ‘IT taskforce’ of the ruling party, which had compiled comprehensive data on the voting pattern in the elections held in the past in all 234 Assembly constituencies as part of its ‘Mission 234’, had identified the party’s strongholds and the places where the opponents had their presence.\n\nBesides strengthening the party in the strongholds, the AIADMK cadres, especially members of the IT wings, should visit every house in the opponents’ areas to tell the public about the welfare schemes being implemented by the ruling party.\n\n“We should remind the voters of the freebies they have received since 2011 and the welfare schemes like monthly assistances for aged, widows, physically challenged, marriage assistance etc. being implemented for the uplift of the marginalised. If this exercise is executed with dedication in the next 100 days, the AIADMK will win all 234 Assembly segments,” Mr. Swaminathan said.\n\nMinisters R.B. Udhayakumar, K.T. Rajendra Balaji and S.P. Shanmuganathan, MPs S. Muthukaruppan, Vasanthi Murugesan and K.R.P. Prabhakaran, MLAs Nainar Nagenthran, P.G. Rajendran and S. Muthuselvi, Mayor E. Bhuvaneshwari of Tirunelveli and A.P.R. Antony Grace of Tuticorin participated in the meeting.", 
    "section": "national", 
    "title": "AIADMK plans to use earlier voting pattern", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}