{
    "author": [
        "R Srikanth", 
        "R Sujatha"
    ], 
    "text": "Second-year B. Tech student fell from second floor of hostel on Sunday\n\nThe Chennai City Police is investigating the death of Shanmuga Preetha (19), a second-year B. Tech student of Anna University, keeping two possibilities in mind – suicide and accidental death.\n\nThe student had fallen from the second floor of Nandia Hostel on the university premises on Sunday night.\n\nShe was rushed to a private hospital in Adyar, but was pronounced dead on arrival.\n\n‘Talking on phone’\n\nA senior official of the City Police said that going by the initial investigation, it seemed to be case of accidental death. He said that according to witnesses, the girl, who was talking on a mobile phone standing on the corridor outside her hostel room, may have slipped and fallen to her death, as the parapet was very low.\n\nThe deceased student was supposed to visit her parents Muthiah and Parvathy in Thiruthuraipoondi on Tuesday.\n\nShe had taken a letter of permission from the hostel authorities as her family had planned to visit temples, deputy warden M. Mutharam of Nandia hostel, where Shanmuga Preetha was accommodated, said.\n\nA second-year student of B Tech, Ceramic Technology, she had secured a cut-off of 190 marks and was admitted through counselling.\n\nShe did not have any arrears. She maintained good grades with a CGPA of 7.8 and was a bright student, according to S. Sivanesan, Dean of Alagappa College of Technology, where she was a student.\n\nThe hostel is a two-storey building, which was earlier a guest house for international visitors.\n\nThe guest house has several suites with each suite capable of accommodating 12 students.\n\nA suite has three rooms and a kitchen.\n\nFour students are accommodated in each room. Each suite has two toilets and there is a common toilet on the ground floor, officials said.\n\nOn Sunday, she had had her dinner at around 8.45 p.m. and had told her friends that she was going to the toilet.\n\nShe was sitting on a low 3.5-feet high wall when she is believed to have accidentally fallen to the ground.\n\nA watchman posted outside the hostel on Monday said it was normal for girls to sit on the wall while talking on their mobile phone.\n\n‘No help sought’\n\nCounsellor S. Nagarani, who was the first official to reach her after the fall, said she had not sought help at any of the counselling sessions.\n\nThe university holds periodic sessions.\n\nThe last session was on January 11.\n\nShe may have slipped and fallen to her death, as the parapet on the corridor was low", 
    "section": "national", 
    "title": "Anna varsity student’s death likely to be an accident: police", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}