{
    "author": [
        "M Soundariya Preetha S Prasad", 
        "R Sujatha"
    ], 
    "text": "Expressing her happiness over receiving the Padma Vibhushan, V. Shanta, chairperson of Cancer Institute, said the award was more a recognition of the work done at the institute. Reaffirming her commitment to ensuring availability of and accessibility to medical care, she also called for a district-wise policy for screening every woman for cervical and breast cancer. “We must ensure that the poor get the fruits of research; without it we are stagnant. We must get people who are committed to ethical practice,” she said.\n\n‘Feel honoured’\n\nGastroenterologist T.S. Chandrasekar, the founding chairman of MedIndia Hospital, said he felt honoured to be chosen for the award for his medico-social work in the field of gastroenterology.\n\nDr. Chandrasekar, who has several firsts to his credit including the Braille chart on hygiene that he created last year, is also the founder of the MedIndia Charitable Trust. A graduate of Madurai Medical College, Dr. Chandrasekar also founded the department of medical gastroenterology at Coimbatore Medical College.\n\n‘Aim is to empower women’\n\nArunachalam Muruganantham, the inventor of low-cost sanitary pad making machine who has been honoured with the Padma Shri, said he was happy but only cautiously so. “I am happy about the award but I need to be careful and ensure that I continue the work. Wherever I go, I tell them that I am not here to sell machinery but to create a social change by empowering women. I hope to inspire more youngsters to take the technical platform and become social entrepreneurs,” he said.\n\nIn the last ten years, the social entrepreneur has installed 2,460 machines across the country and 17 other nations. His innovation has already won the Best Innovation for Betterment of Society award in 2006 and the National Innovation Foundation’s Grassroot Technological Innovation award in 2009.\n\n‘Recognition for a lifetime of work’\n\nThe family of N.S. Ramanuja Tathacharya, a senior Researcher at the French Institute of Pondicherry (IFP) who has been selected for Padma Bhushan, is excited about the award. “We are every excited. It is a lifetime achievement award and he is also very happy to receive the award,” said Srinivasa Raghavan, son of Tatacharya.\n\nTathacharya’s original works include Vivriti, a commentary on Jnapaka Sangraha; Balabodhini, a commentary on the Panchalakshani Gadadhari (Nyaya); and Balapriya, a commentary on the Tarkasangraha Dipika Prakasika (Nyaya).\n\nTathacharya was previously conferred with the Chevalier de La Legion d’Honneur by the French government in 2012, Viswabharati Puraskar by the Uttar Pradesh government in 2013 and a Lifetime Achievement award by the Indian Council of Philosophical Research in 2014.\n\n‘Cherish the Indian award’\n\nBelgium-born Madeleine De Blic, another Pondicherry resident and founder of Volontariat India who has been selected for the Padma Shri award in the field of social work, felt her work for the poor and the needy had been recognised. “Although I was born in Belgium, I consider India as my country. An award given by the Indian government and people is more close to my heart,” Ms. Blic said.\n\nMs. De Blic was awarded the title of Chevalier de la Légion d’Honneur for her work in 2013. Volontariat runs a home for street and destitute Children, a home for the aged and a vocational training centre.\n\nGave up business\n\nfor social work\n\nD.K. Srinivasan, an octogenarian, has been involved in social service for more than three decades. A successful businessman, he gave it up to start the Hindu Mission Hospital, Tambaram as its honorary founder secretary, which serves thousands of needy and poor people from the city’s southern suburbs and even beyond.\n\nMr. Srinivasan said it was a recognition for his work in the fields of medicine and education, which he attributed to teamwork. A desire to improve the quality of lives of less-fortunate in society motivated him to take a plunge into social work. He attributes his success to his wife Hema, their sons and daughters-in-law, whom he describes as ‘pillars of strength’. The hospital takes up free eye check-up and general medical health camps in rural pockets around Tambaram.", 
    "section": "national", 
    "title": "Awardees happy, vow to rededicate", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}