{
    "author": [
        "Mohit M"
    ], 
    "text": "Start full-fledged Technology Innovation Council to research and develop products\n\nAfter having the distinction of being, perhaps, the first State-owned electricity supply company to hold a patent, Bescom has gone one step further and started a full-fledged Technology Innovation Council (TIC) to research and develop products.\n\nBudget\n\nComprising engineers, researchers, architects and management experts, the TIC has been given a Rs. 2-crore budget to aid the company ‘make the right decisions’.\n\n“The council will constantly scour around for the best product and other innovations that Bescom can use to make power supply more efficient…the council will provide a long-term vision to Bescom,” said Anil D’Souza, Assistant General Manager (IT Wing), Bescom.\n\nThe mandate will not only be to select technology, but also to improve customer relations and to reach out to start-ups looking to tie up with Bescom.\n\n“A portal has also been launched (in the Bescom website) where suggestions, which will be looked into by the council, can be given either from the public or linemen. Currently, Bescom workers with more than a decade of experience will have a lot of suggestions, but may be hesitant to share them,” said Mr. D’Souza.\n\nH. Rajasimha, former Chief Engineer of ISRO, who is a part of the council, said the council has been meeting every 15 days, and tangible results can be expected soon.\n\nModified transformer\n\nOn the kind of innovations that can be expected, officials point to the modified transformer – for which, Mr. Rajasimha and Bescom are joint patent holders – which solves a problem seen in many Indian cities.\n\nThe rods of the Group Operating Switches of pole-mounted transformers usually are just four feet above the road.\n\nThese transformers are fixed on footpaths. Besides reducing space on footpaths, they pose a threat to pedestrians.\n\nHowever, a cost-effective modification resulted in the rods being raised more than eight feet above the ground. With nearly two-thirds of all transformers in the city modified, other escoms are showing interest in the invention.", 
    "section": "national", 
    "title": "Bescom looks for the ‘light-bulb’ idea", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}