{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Consequent to an inspection by a team of officials and direction by the Child Welfare Committee (CWC) to an unauthorised children’s home, Anbu Karunai Illam at Thuraiyur, the children residing in the home were produced before the committee here on Monday.\n\nThe CWC members, personnel of the Anti-Human Trafficking Unit, Social Welfare Department and District Child Protection Unit officials inspected the home a few days ago following complaints that the home was functioning without renewing its licence and that its basic infrastructure was poor with no proper maintenance of records. The Social Welfare Department had issued notices on three occasions to the home, accommodating over 25 children, sources said.\n\nAs the home failed to reply and respond to the notices of the Social Welfare Department as well as to the queries raised by the District Child Protection Unit, a team inspected the home a few days ago and asked them to produce the minors before the CWC. The renewal of licence was mandatory to run the home whose director Durai Selvam Periyar is a government school headmaster. Accordingly, a total of 23 children were produced before the Child Welfare Committee here on Monday by the home authorities.\n\nFourteen among them were boys and the remaining were girls who were studying in different standards. The children were all below 18 years. Consequent to an order from the Child Welfare Committee upon production of the minors, the rescued children were sent to the Government Children’s Home at Mathur near Tiruchi and to the Government Children’s Home at Thanjavur for stay to enable them continue with their education and enjoy their childhood rights, officials said.\n\nA team of police attached to the Anti Human Trafficking Unit (AHTU) escorted the children to the government homes. Parents and close relatives of few children wanted to take their wards but they were not permitted because they could not produce proper documents before the Committee, a CWC member said.\n\nAHTU police said they had rescued four orphan children from the home as they were accommodated without knowledge of the Child Welfare Committee.", 
    "section": "national", 
    "title": "Children of unauthorised home shifted to govt. homes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}