{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Metrowater MD Vikram Kapur (right) presents the award to Archana Shah, mother of Kamal D. Shah (left). Georgi Abraham, founder trustee, TANKER foundation, is also seen — Photo:B. Jothi Ramalingam\n\nWork, travel, exercise, leisure and entertainment — all of this is possible even if you are on dialysis, said Kamal D. Shah, co-founder and director, patient services, NephroPlus, a dialysis centre network.\n\nMr. Shah, who was delivering the Mrs. Malathi Venkatesan TANKER Foundation Memorial Lecture on Monday, said he had been on dialysis for 18-and-a-half years. “I work fulltime, I swim every morning, I go for movies and I travel. There are many misconceptions about dialysis -- people think it is almost the end of life, that they have to be bedridden or that they will be weak or tired all the time. But it does not have to be that way,” he said.\n\nTaking the audience through his journey with kidney disease, Mr. Shah urged patients to condition their minds to be cheerful and to get as much dialysis as they possibly could. “Chronic kidney disease affects many parts of the body, but the most important part affected is the mind. We need to develop a positive outlook and fight the disease,” he said.\n\nVikram Kapur, managing director, Chennai Metropolitan Water Supply and Sewerage Board, expressed his hope that TANKER’s services would expand to the rest of the State and the country.\n\nThe event also saw the distribution of TANKER's awards. The Muthoot M. George Memorial TANKER and Kerala Kidney Research Foundation Young Investigator Award was given to Pinaki Mukhopadhyay; the Renny Abraham TANKER Foundation Love for Service Award was given to Nandakumar Menon and Shylaja Devi; the La Renon TANKER Foundation Lifetime Achievement Awards were given to N. Gopalakrishnan and M. Thomas Mathew; the K. Venkatanarayana TANKER Foundation Awareness Award was given to V. Mohan — all medical professionals.\n\nThe La Renon TANKER Foundation for the Sake of Honour Award was given to Mr. Shah. The Ashok Sankaralingam TANKER Foundation Patient Endowment went to three patients — Ramdoss, Gandhirajan and Thangappan. Each patient will get 33 free dialyses in 2016 according to their monthly schedules.\n\nThe TANKER Foundation has completed 22 years of service and has provided 1,74,511 free and subsidised dialyses to 883 patients said Latha A. Kumaraswami, managing trustee. Georgi Abraham, founder trustee, and several others also participated.", 
    "section": "national", 
    "title": "‘Dialysis need not affect quality of life’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}