{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Students taking out a voter awareness rally in Ramanathapuram on Monday. (Below) An awareness rally in Dindigul. — Photos: L. Balachandar and G. Karthikeyan\n\n“All those who completed 18 years as on January 1 this year are eligible to vote and enrol their names”\n\nRallies, distribution of prizes to college students and pledges to exercise franchise in elections marked the sixth National Voters’ Day in Ramanathapuram and Sivaganga districts on Monday, the founding day of Election Commission of India.\n\nAfter flagging off an awareness rally at Aranmanai, Ramanathapuram Collector S. Natarajan addressed a function at the Government Women’s College of Arts and Science here and distributed prizes to students who won prizes in various competitions organised in connection with the voters’ day.\n\nThe Collector after administering a pledge, explained to the students, this year theme of “inclusive and qualitative participation” and “no voter to be left behind.” All eligible citizens should register as voters and vote with pride, he said.\n\nAll those who had completed 18 years as on January 1 this year were eligible to vote and enrol their names in the electoral roll, the Collector said, adding that eligible voters who failed to register their names could register their names at the special camps to be held on January 31 and February 6 at various polling stations in the district, he said.\n\nThose who had registered their names could check their names in the electoral roll by sending a SMS to 1950, he said. Earlier, students of Government Women’s College for Arts and Science and voters took out an awareness rally.\n\nIn Sivaganga, Collector S. Malarvizhi flagged off a rally at Aranmanai after students of Mannar Duraisingam Government Arts College, Government Women’s Arts College and St. Michael Arts College took out a rally near Aranmanai. They held placards which read “voting is democratic right’, ‘voting is your voice’, ‘take pride in being a voter’ and ‘my vote my future’.\n\nAddressing the college students, the Collector said all those enrolled their names in the electoral list should exercise their franchise without fail and they should take pride in voting. Eligible voters who could not register their names could register their names in the special camps or through e-service, she added.\n\nDindigul\n\nDindigul Collector T.N. Hariharan said that every one should realise that casting vote was their democratic duty and basic right. Students took out an awareness rally.\n\nTheni\n\nCollector N. Venkatachalam flagged off an awareness rally in the town.\n\nVirudhunagar\n\nCollector V. Rajaraman distributed the prizes and voter identity cards at the Collectorate. He also administered a oath to voters. The voter awareness rally was taken out by students of Kshatriya Vidyasala Middle School through Mariamman Temple, Desabandu Ground and old bus stand.\n\nAccording to an official press release, distribution of 30, 541 new elector photo identity cards began at nine taluk offices in the district on Monday.", 
    "section": "national", 
    "title": "“Eligible citizens should register as voters”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}