{
    "author": [], 
    "text": "TIRUNELVELI\n\nDistrict Administration: Republic Day celebrations, M. Karunakaran, Collector, unfurls national flag, A.R. Grounds, Palayamkottai, 8 a.m.\n\nTirunelveli Corporation: Republic Day celebrations, E. Bhuvaneshwari, Mayor, hoists national flag, Corporation office premises, 7 a.m.\n\nMuslim Higher Secondary School and Golden Jubilee Matriculation Higher Secondary School: Republic Day celebrations, M.A.S. Mohamed Abubucker, correspondent, hoists national flag, T.J.M. Salahudeen, president, Jamaath-Ul-Ulema, chief guest, school premises, 8 a.m.\n\nTirunelveli District Civil Engineers’ Association: ‘Build Tech Expo 2016’, expo of construction materials, valediction, G. Sokkanathan, president, Tirunelveli District Civil Engineers’ Association, presides, E. Bhuvaneshwari, Mayor, chief guest, Centenary Hall, Palayamkottai, 10 a.m. to 9 p.m.\n\nAlcoholics Anonymous and Al-Anon: Regular meeting, V.K. Nursery and Primary School, Tirunelveli Town, 7 p.m.\n\nKUDANKULAM\n\nKudankulam Nuclear Power Project: Republic Day celebrations, R.S. Sundar, Site Director, KKNPP, unfurls national flag at KKNPP site, 7 a.m., at Anu Vijay Township, 8 a.m.\n\nSANKARANKOVIL\n\nTirunelveli Social Service Society and Veeramaamunivar Siddha Hospital: Free siddha medicine awareness camp, Rev. Fr. Joseph Johnson, director, TSSS, Palayamkottai, inaugurates, St. Joseph’s Church premises, from 10 a.m. to 1 p.m.\n\nTHATANKULAM\n\nCMS Suddhanga Suvisesha Sabhai: Book on ‘History of CMS Suddhanga Suvisesha Sabhai’ release function, Rev. S. Samuel, releases book, Rev. V. Jeremiah, receives first copy, CMS Church premises, 11 a.m.\n\nThoothukudi\n\nDistrict Administration: Republic Day celebrations, Collector M. Ravikumar hoists national flag, District Sports Stadium, 8 a.m.\n\nV.O. Chidambaranar Port Trust: Republic Day celebrations, S. Anantha Chandra Bose, Chairman, unfurls national flag, Port School Ground, 8 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}