{
    "author": [], 
    "text": "Only after submitting the copies of relevant documents, Railway station authorities issue ID card for season ticket holders. So I can use this card for all train journey. On January 20, I travelled by C1 AC (seat number 19 and 23) chair car coach with tatkal ticket from Thanjavur to Coimbatore, boarding at Tiruchi in Jan Shatabdi express. The TTE refused to accept the validity of the ID. He threatened me to initiate action as a ‘ticketless traveller.’ But, on January 23, during my return in coach D6 (seat number 26 and 27) I established my ID using the same card. Railway authorities should issue circulars and initiate action against TTEs who are not aware of the rules of the railways.\n\nS.Prakash,\n\nMutharasanallur.\n\nAct without fear\n\nor favour\n\nThe corporation authorities, who have taken up road repair work at Seshadripuram area in Srirangam, have demolished ramps constructed by many apartment and individual house owners outside their houses. But a few households which have encroached upon the road were left out of the demolition exercise. There is also no action against some households letting out waste water into rainwater harvesting structure. I request the authorities treat all as equal before the law. The authorities should exercise their power without fear or favour.\n\nJ. Anantha Padmanabhan,\n\nSrirangam.\n\n‘Computer is slow’\n\nSavings bank account holders get their services done at a snail’s pace in Srirangam, Saathara Veedhi, post office. Quite often, customers are made to wait for over 20 minutes. The tailor-made reply from the staff is ‘computer is slow.’ I request the authorities of the Head Post Office to do the needful.\n\nAravind K.Rao,\n\nSrirangam.\n\nBus facility essential to reach park\n\nRecently, the Chief Minister declared open the Butterfly Park near Melur, Srirangam, through video conferencing. But there is no bus facility to reach the park. I request the authorities to introduce at least a mini bus service from Amma Mandapam and Rajagopuram to the park. It will not only increase tourist flow but also will cater to the needs ever increasing residential colonies towards Melur.\n\nThe corporation has placed signboards at many places mentioning the direction to the park without introducing bus facilities.\n\nWill concerned authorities fulfil this request?\n\nVijayalakshmi Bargavan,\n\nSrirangam.\n\nChain snatching\n\nA couple of days ago, we saw on Karur Bypass Road a two-wheeler rider chasing a woman riding a moped. His action of kicking the moped by his foot repeatedly raised our suspicion. Soon, the rider succeeded in knocking her down and snatching her gold chain. All this happened in broad light. A few passersby rushed her to a clinic on Salai Road. Has chain snatching become a profession for some? It does not augur well for a civilised state.\n\nT.M.Ranganathan,\n\nSrirangam.\n\nExpedite road work\n\nTraffic near mambazha chalai has increased many folds in recent times and the Cauvery bridge is an important connection to the city. Every user of Chennai Road will agree that maintaining the bridge without potholes is a major requirement for smooth flow of traffic. Now the Corporation and Highways Department have embarked on a programme to beautify it. Some layers of the road on the bridge have been removed and left as such. The authorities should know the condition of the road and the plight of vehicles trying to navigate the ups and downs. The work should be completed fast.\n\nKrishnakumar,\n\nSrirangam.\n\nDrinking water supply inadequate\n\nChettiappatti (39th ward) has been included in Tiruchy Corporation 18 years ago and has been getting new facilities such as street lights and road facility. Supply of drinking water is not enough. Household as well as street pipe connections are yet to be provided. People rely on corporation lorries to get potable water. So an overhead tank has to be constructed to cater the needs of the residents. Adequate drainage facility should also be provided.\n\nH.Ghouse Baig,\n\nEdmamalaipattipudur.", 
    "section": "national", 
    "title": "Enlighten TTEs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}