{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "There is notable acceptance by farmers to the training programmes in crop management imparted by the Agriculture Department in the district.\n\nThe Department has formed ‘farmer interest groups’ for delivering the benefit of training programmes imparted through Agriculture Technology Management Agency (ATMA).\n\nForty farmers including 15 women from Kagam, Kulavilaku, Elumathur, Avalpoondurai villages benefitted from one such training programme on integrated crop management training in oilseeds and sugarcane.\n\nRabi crop\n\nAgainst the backdrop of the recent release of water under second turn in the Lower Bhavani Project canal, spot training in cultivation methods and pest management for gingelly and groundnut for ensuing rabi crop was imparted by ATMA Block Technology Manager - Modakurichi Block, Gomathy, and Assistant Professor of Tamil Nadu Agricultural University A.P. Vigneshwari.\n\nFarmers in the region, said Kulandaivelu, Assistant Director of Agriculture, Modakurichi Block, were looking forward to deriving optimal utility of the water release for sugarcane crop.\n\nThe cultivators took part in a seminar at Sakthi Sugars Ltd., at Poondurai where they were oriented on the benefits accruing from trash mulching by way of enhancing soil fertility.\n\nThe farmers learnt about sustainable sugar initiative and crop residue management. They were advised to desist from burning the trash in sugarcane fields after harvest, and instead avail themselves of the utility of the subsidy offered by the Agriculture Department for trash mulching under National Agriculture Development Programme, Mr. Kulandaivelu said, adding that the scheme to shred trash and decompose it for soil fertility benefits 100 to 200 cane farmers in each block.\n\nThe cost per hectare is Rs. 5,500 of which subsidy of Rs. 2,500 is directly transferred to the bank account of the farmer, Mr. Kulandaivelu said, presiding over the programme.\n\nThe Senior General Manager of Sakthi Sugars Limited, Modakurichi Unit, Thiruvengadam also addressed the farmers.\n\nA presentation on sustainable sugarcane initiative was made by the cane manager of the Sugar Unit Nallasamy.", 
    "section": "national", 
    "title": "Farmers gain from various training programmes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}