{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Says, a person fighting for justice should not lose it on technicalities\n\nThe Madras High Court Bench here has come to the rescue of a Group-I officer in State Government service who could not get promoted to Indian Administrative Service (IAS) despite 33 years of experience, partly due to mistakes committed by him by seeking wrong relief before judicial forums and arguing those cases on his own.\n\nObserving that a person fighting for justice should not lose on mere technicalities, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran allowed a writ petition filed by the officer D. Pandian. They directed the State Government to recommend his name for promotion within four months and the Centre to pass appropriate orders within eight weeks thereafter.\n\nThe judges pointed out that Mr. Pandian got employed as Junior Employment Officer in March 1982 and served in the department under various capacities till December 1989. Subsequently, he cleared the Group I service examinations conducted by Tamil Nadu Public Service Commission and got appointed as Divisional Development Officer in the Rural Development Department.\n\nThough he became eligible for promotion to the post of Joint Director of Rural Development in 1996, a charge memo was issued to him that year seeking explanation for initiating disciplinary action against a typist without sufficient cause. The charge was held to be proved in a departmental enquiry and he was imposed with a punishment of censure in March 2000.\n\n“If the petitioner had been prudent and had realised discretion to be the better part of valour, he would have left the matter at that and gained promotions. But, unfortunately, the petitioner filed a petition for review,” the judges said and pointed out that after three years, the State Government in 2003 ordered re-enquiry after citing certain procedural irregularities in the enquiry conducted already.\n\nThe government made it clear that the re-enquiry should commence from the stage of furnishing all copies of documents relied upon in support of the charges. But the Rural Development Commissioner “misunderstood” the issue and issued a fresh charge memo in 2009. The petitioner failed to challenge the validity of the “illegal” second charge memo before the High Court.\n\nInstead, he approached the Central Administrative Tribunal (CAT) challenging promotions granted to his juniors and did not ask for considering his name for promotion. The CAT dismissed his case in 2013 and hence he had filed the present writ petition. “The petitioner, who appears as a party in person, is completely misguided and has spoiled his case by preparing petitions and appearing in person.\n\n“Nevertheless, the Tribunal could have seen the obvious injustice done to the petitioner and moulded the relief… There are no serious allegations impinging upon his integrity. The manner in which he has conducted his own cases discloses the level of frustration that he has reached. But his frustration is understandable,” the Division Bench concluded.", 
    "section": "national", 
    "title": "HC comes to rescue of officer denied entry into IAS", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}