{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Monday warned the accused in the infamous 2007 Dinakaran newspaper attack case against “intimidating” the court by raising technical pleas to evade from facing an appeal preferred by Central Bureau of Investigation (CBI) against their acquittal by the Principal District and Sessions Court here in 2009.\n\nWhen the appeal came up for hearing before a Division Bench of Justice P.R. Shivakumar and V.M. Velumani, the senior judge said that the court would not bow to “intimidation” and tolerate the challenge posed by the accused to the authority of the court. He said arrest warrants would be issued if all the 17 accused do not engage counsel by Wednesday.\n\nOn his part, advocate Rupert Barnabas, appearing for one of the accused, said that the appeal could not be taken up for hearing until the legal procedures related to serving of court notices to the accused had been complied with properly. He claimed that the High Court Registry had also not supplied case documents to lawyers who had been engaged by some of the accused recently.\n\nThe counsel further pointed to several infirmities in a petition filed by CBI, on the suggestion of the High Court, to issue arrest warrants against the accused. He said the CBI, in its petition, had conceded that at least three accused including the prime accused V.P. Pandi alias ‘Attack’ Pandi had engaged counsels. Yet, it had sought warrants to arrest them also along with the other accused.\n\nThree employees of the newspaper had lost their lives when a mob hurled petrol bombs on the newspaper office here on May 9, 2007 objecting to publication of the results of a survey in which Dravida Munnetra Kazhagam (DMK) president’s younger son M.K. Stalin was reported to be the preferred political successor than elder son M.K. Alagiri.", 
    "section": "national", 
    "title": "High Court warns accused against “intimidating” court", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}