{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "What happens when a High Court judge goes on a hunt along with language enthusiasts and scholars for coining new words in Tamil? It helps not only to the development of the language but also to the growth of inquisitive minds. And that’s exactly what Justice V. Ramasubramanian of the Madras High Court has succeeded in doing.\n\nHis Tamil book titled ‘Word Hunt,’ containing a compilation of new words coined by him and the efforts that went into their coinage, was released here on Monday by Professor T. Gnanasundaram. M. Thirumalai, former vice-chancellor, Tamil University, Thanjavur, received the first copy in the function presided over by television personality Solomon Pappaiah.\n\nIn the first chapter of the book, the judge had highlighted how Barbara Wallraff, a columnist for The Atlantic had contributed to coinage of new words in English through her column ‘Word Court and Word Fugitives.’ He pointed out that she coined the word ‘pandephonium’ to denote a confusion created among a group of people when one of their phones ring.\n\nThough people had suggested words such as conphonision and ringxiety to describe the situation, she concluded that the word ‘pandephonium’ would be appropriate to denote the pandemonium caused by a phone. In another instance, she had accepted a suggestion that synchronicity would be the right term to denote synchronism of events that appear to be connected but have no demonstrable relationship.\n\nTaking a cue from her, the judge had begun hunting for Tamil equivalents for English words and ended up with: morph (Uruppunaivu), encrypt (Maraikkuriyaakku), pendrive (Dharavagakkol), digital (Ennurukkooru), logic (Alavaiiyal), Bluetooth (Izhaithavir Inaippu), alter ego (Thanmaatruru), litmus test (Nilaiyarith Thaervu), epistemology (Arivaaiviyal) and much more.", 
    "section": "national", 
    "title": "Judge goes on a word hunt", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}