{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Residents of Reliance Garden, Andalammal Layout, Krishnapuram I and II, Iyer Layout, Chinna Gurusamy Layout and 12 other residential colonies in Singanallur on Monday petitioned the Coimbatore Corporation to not take any step regarding the disputed pathway in Reliance Garden.\n\nThe Corporation had on January 23 fenced off the pathway as it was a part of the reserved site in Reliance Garden.\n\nBut later in the evening, the residents with political support removed the fence to restore the pathway.\n\nThe residents said that they had for the past 17 years been using the pathway to access the park that the Corporation had developed at Rs. 80 lakh. But the residents of Reliance Garden had moved a Coimbatore court in 2008 against the civic body praying that no changes be made to the reserved site. The case is pending to date.\n\nInterim injunction\n\nThe Corporation also wanted an interim injunction in this regard and the court had accepted the petition.\n\nThe Corporation moved a higher court in Coimbatore in 2009 against the order but the court had dismissed the case.\n\nIn these circumstances, on January 23, around 100 policemen and senior officials of the Corporation fenced off the pathway using barbed wire, the residents said in their petition and alleged that the officials acted without necessary orders from the Commissioner.\n\nIf the Corporation officials had acted as per the orders of the Director of Town and Country Planning, as they claimed to have done so, then it was wrong because the Director did not have the powers to issue any such instruction, according to the petition. At the time of layout approval, the promoters’ gift the land to the Corporation through gift deeds and the Corporation was the rightful owner of the land, they argued and wanted to know under which rule did the Director issue orders.\n\nResolution\n\nThe officials also did not have a Council resolution backing their action, they further said in their petition and asked the Corporation to keep off the pathway until the court case was disposed off.\n\nThe residents presented the petition to an Assistant Commissioner.", 
    "section": "national", 
    "title": "Keep off pathway, corporation told", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}