{
    "author": [
        "Special Correspondent"
    ], 
    "text": "SENSE OF PARTICIPATION:College students taking part in the marathon for voter awareness in Erode on Monday.- PHOTO: M. GOVARTHAN\n\nCollector administers National Voters’ Day oath to officials, students in Salem\n\nA mini marathon, bicycle rally, and voter awareness programmes in the form of campaigns and competitions in schools marked the National Voters’ Day celebrations in the district on Monday.\n\nEssay writing, drawing, elocution and cultural competitions on voting rights and rallies were conducted in schools across the district.\n\nIn the city limits, a rally taken out by 1,000 school and college students was flagged off by District Collector S. Prabakar in the presence of Erode RDO R. Narmada Devi. The rally was taken out from the RDO’s office to VOC Park via Gani Market\n\nA mini marathon by 30 sportspersons drawn from colleges, from Thindal to Collector’s Office was initiated earlier in the day by Mr. Prabakar. Likewise, a group of 50 college students in the midst of a bicycle rally from Sathyamangalam were felicitated by the Collector at Sri Vasavi College. Students who had excelled in competitions and senior citizens were honoured at the Kamarajar Higher Secondary School in the city during the day.\n\nAddressing the gathering on the occasion, Mr. Prabakar urged voters to make optimal use of the online facility of Election Commission of India for making inclusions, corrections and deletions. Voters, he said, could determine their respective booths by sending details of their voter number through SMS to 1950\n\nTheir names in voter lists could also be viewed in the Taluk and RDO offices. Special camps will be conducted on January 31 and February 6 for inclusion, correction and deletion of names in the voter list, he said.\n\nSalem\n\nA large number of students from different colleges and government staff participated in a rally taken out in connection with the National Voters’ Day celebrations in the city on Monday.\n\nV. Sampath, District Collector, flagged off the rally from the collectorate and the collector along with the senior officials too walked along with the students.\n\nThe participants carrying placards and banners urging the people to exercise their democratic rights without fail. The rally passed through Tiruvalluvar Statue junction to reach the Nehru auditorium in Bose Maidan.\n\nThe Collector later administered the National Voters’ Day oath to government officials and students.\n\nHe also distributed prizes to the winners of the oratorical and essay writing competitions for the college students held in connection with the day, besides handing over the Electors Photo Identity Cards (EPIC) to a few new voters.\n\nK. R. Selvaraj, Corporation Commissioner, C. Vijaybabu, Revenue Divisional Officer, and others participated in the rally.\n\nThe students of Jayaram Arts and Science College, Vaisya College and Saradha College for Women presented cultural programmes. The day came to an end with the students staging a street play near the old bus stand.\n\nSeminar and oath taking marked the National Voters’ Day at Sri Vidya Mandir College of Arts and Science here on Monday. T. Senthilkumar, NSS programme officer, administered the oath. Later speakers spoke on the importance of strengthening the democracy.", 
    "section": "national", 
    "title": "Mini marathon, bicycle rally mark Voters’ Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}