{
    "author": [
        "Dennis S"
    ], 
    "text": "A mobile phone service provider has been directed by the District Consumer Disputes Redressal Forum in Srivilliputhur to pay a compensation of Rs. 5,000 to its customer for sending bills for three months after he reported the loss of his SIM card.\n\nD. Vijayaraghavan of Rajapalayam town, who started a mobile phone connection from 2004 lost the SIM card in 2011.\n\nHe informed the mobile phone service provider about it on August 24, 2011 by e-mail and the service provider acknowledged it.\n\nHowever, he was sent a bill of Rs. 877 for September, October, November and December of that year. Further, the service provider disconnected the service to his mobile phone in December 2011 without prior intimation. Hence, the plea along with documents, seeking compensation for the mental agony suffered by the petitioner.\n\nThe service provider contended that the petitioner had not reported the loss of the SIM card and hence the bills were sent to him. The forum comprising V. Balasundarakumar, S. Sankar and S. Karpagaselvi went through the communication from the service provider on receipt of the complaint from the petitioner.\n\nThe communication stated, “There is no monthly rental from the date of disconnection request raised and the call charges will be applicable, as per the usage. Hence, we request you to keep your mobile number switched on in order to reach you.”\n\nCiting that the call charges mentioned in all the four bills were nil, the forum said there was deficiency on the part of the service provider in sending bills even after the customer reported loss of the SIM card.\n\nIt underlined the fact that the service provider had not produced documentary evidence to prove that the loss of SIM card was not reported by the petitioner.\n\nThe forum directed the service provider to pay a compensation of Rs. 5,000 for the mental agony suffered by the customer, repayment of Rs. 877, which was collected from him, and Rs. 3,000 as litigation costs.\n\nCustomer received\n\nbills for three months even after he\n\nreported the loss of\n\nSIM card", 
    "section": "national", 
    "title": "Mobile phone service provider directed to pay compensation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}