{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Rallies, administration of voters’ awareness pledge, distribution of Electors’ Photo Identity Cards to young voters and distribution of prizes to the winners of voters’ awareness competitions marked the National Voters’ Day observed in the district on Monday.\n\nCollector M. Karunakaran flagged of the National Voters’ Day awareness rally at Sarah Tucker Girls’ Higher Secondary School, Palayamkottai, in which college students and members of women self-help groups participated.\n\nRally flagged off\n\nFlagging off the rally, Dr. Karunakaran said every Indian citizen, who was 18 years old, should enrol his or her name in the electoral roll and cast his or her vote without fail in all elections as this exercise alone would save and nourish democracy.\n\n“If you are not satisfied with the candidates in fray, you can choose NOTA (None Of The Above) option,” the Collector said.\n\nDr. Karunakaran also participated in the voters’ awareness programme organised at Rani Anna Government College for Women and handed over the Electors’ Photo Identity Cards (EPIC) to students.\n\nHe also distributed prizes to the winners of the voters’ awareness competitions organised in the college.\n\nDistrict Revenue Officer M.G. Kulandaivel, Revenue Divisional Officer, P. Fermi Vidhya, City Engineer V. Narayanan Nair and others participated.\n\nLed by Mr. Narayanan Nair, the staff of the urban civic body took the ‘National Voters’ Day’ pledge at its central office. Assistant Commissioners T. Karuppasamy, T. Subbulakshmi and S. Geetha were present.\n\nThoothukudi\n\nThe district administration organised a rally which was flagged off by Collector M. Ravikumar.\n\nA large number of students and NSS volunteers from various educational institutions took part in the rally to create an awareness of significance of casting vote in elections.\n\nThoothukudi Sub-Collector S. Gopala Sundara Raj, and Superintendent of Police Ashwin M. Kotnis took part.\n\nPrizes were given to students, who won elocution and essay competitions conducted as part of the voter awareness programme.\n\n“If you are not satisfied with the candidates in fray, you can choose NOTA (None Of The Above) option”", 
    "section": "national", 
    "title": "National Voters’ Day observed in districts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}