{
    "author": [
        "Chitra V"
    ], 
    "text": "Civic body proposes to link Completion Certificate (CC) and Occupation Certificate (OC) to property tax data\n\nIf the Bruhat Bangalore Mahanagara Palike (BBMP) has its way, citizens will no longer be able to suppress the extent of built-up area to reduce their property tax burden. False declarations by citizens is a problem that the civic body is trying to solve by proposing to link Completion Certificate (CC) and Occupation Certificate (OC) to property tax data.\n\nThis, sources claim, will help them ascertain who is paying less property tax by fudging built-up area under the Self Assessment Scheme (SAS). The SAS scheme under the Unit Area Value (UAV) was introduced by the civic body in 2008-09 wherein citizens can declare the extent of their property, calculate the tax due and pay the same to the civic body.\n\nSources said that by linking CC and OC to property tax, all data, including carpet area and super built-up area, will be readily available. “There will be no reason to reassess the property to check the tax. As it is, building plan approval has already gone online. This will make the system fool-proof,” they added.\n\nSenior officials told The Hindu that this move is likely to affect big property owners, builders and commercial complexes where the built-up area is usually suppressed. “This is the most effective way to plug leakage of revenue,” they added.\n\nOfficials conceded that earlier attempts to link data from Bangalore Electricity Supply Company (Bescom) and Bangalore Water Supply and Sewerage Board (BWSSB) with property tax had failed. This was to ascertain the number of properties that have commercial power and water connections and have declared falsely as being residential to evade tax.\n\nHowever, sources said the proposal to link the data did not work due to incomplete addresses in the Bescom and BWSSB data.", 
    "section": "national", 
    "title": "No more fudging built-up area to reduce property tax", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}