{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Awarded to IG Praveer Ranjan on eve of Republic Day for distinguished services\n\nThe President’s Police Medal for distinguished services has been awarded to Puducherry Police Chief and Inspector General of Police Praveer Ranjan on the eve of Republic Day celebrations.\n\nA citation said he has put in 22 years of distinguished service, providing not only leadership of a high order, but has also shown initiative in treading into professional areas like law and order, crime investigation, vigilance and economic offences. He served in various capacities in Delhi, Arunachal Pradesh, CBI and now in Puducherry as IGP, Puducherry.\n\nMr. Ranjan, a 1993-batch officer was first posted as ACP, Seema Puri, North East District, Delhi in a highly communally and criminally sensitive area. He handled several communal incidences with tact and sensitivity which prevented any major communal riots in the area. He also served as Addl. DCP, South District in Delhi and was responsible for successful supervision and detection of several sensational cases.\n\nThe highlight was the apprehending of the notorious ‘Bunty Chor’ which led to recovery of several items worth several crores.\n\nFrom 1998 to 2001, Mr. Ranjan was posted as Superintendent of Police in Upper Siang and West Siang districts respectively in Arunachal Pradesh. During his tenure, a terror module belonging to Bengal Tiger Force (BTF) was busted and the arms looted from the Assam Police were recovered.\n\nDuring 2006 to 2013, Mr. Ranjan, served in CBI as SP, ACB, Lucknow with additional charge of ACP, Dehradun and later as DIG, Special Unit and Anti-Corruption-I.\n\nHe made valuable contribution in developing information on corruption at high places in the Central Government Ministries and also successful detection of many sensational cases.\n\nAs DIG, Anti Corruption Unit, he also supervised cases related to Defence scam, Common Wealth Games and NRHM.\n\nHe was awarded the Indian Police Medal for Meritorious Service in the year 2009 while he was serving in CBI.\n\nIn Puducherry, he joined as Inspector General of Police in 2014 and took charge of the smooth conduct of Parliamentary elections 2014. Several new initiatives including the new website of Puducherry Police, implementation of CCTNS for networking of all police stations and crime stations, web based applications for security of women and strengthening of traffic police were undertaken during his tenure.\n\nOne of the highlights of his tenure was the introduction of e-recruitment system. Around 800 recruitments in Puducherry Police were conducted without any complaint.\n\nMedal for meritorious services\n\nPresident’s Police Medal for meritorious services was announced to Rajasankar Vellat now working as Secretary to the Inspector General of Police. The officer has put in more than 29 years of service and he has continuously exhibited his outstanding and exceptional skill in the performance of various police duties.\n\nMr. Vellat had done exemplary service when ‘Tsunami’ hit the coastal villages of Kalapet in 2005 and surrounding areas when he was the Station House Officer. He immediately started rescue operations by searching the collapsed / submerged houses and evacuated the children who were trapped. He himself entered into the sea water and caught hold of the floating dead bodies and recovered 108 dead bodies which were buried under the sand and debris.\n\nLG’s medal\n\nLieutenant Governor’s Police Medal for extraordinary services will be awarded to S. Venkatasamy, Superintendent of Police (CID), Chinta Kothandaraman, Inspector of Police, Grand Bazaar Circle, L.V. Senthil Kumar, Inspector of Police, D’ Nagar Circle.\n\nHe has served in places such as Delhi, Arunachal Pradesh, CBI and Puducherry", 
    "section": "national", 
    "title": "President’s medal for police chief", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}