{
    "author": [
        "K Manikandan"
    ], 
    "text": "Half the number of children rescued in Chennai, western districts were found at two major terminals\n\nA large number of children from different districts of Tamil Nadu, who either run away from their homes or lose their way after getting separated from their relatives, end up in railway stations in the city — mostly Chennai Central and Egmore.\n\nOf the 1,250 children who were rescued in Chennai and the western districts of the State in 2015, half of them — 651 — were rescued at the city’s two important terminals, sources told The Hindu.\n\nIn Chennai, 334 children were rescued in Central station and 197 in Egmore.\n\nThey added that while some of them were united with their relatives, many others had to be sent to welfare homes. While the number of children — 1,250 seems to be high compared to the previous years — 412 in 2013 and over 300 the following year, officials said documentation of such children who had either run away or lost their way had increased and hence the steep figure. Of this, over 30 per cent were from States outside Tamil Nadu.\n\nOfficials said that interaction with such young boys and girls revealed that a number of factors drove them from their homes to far-off destinations. “Poverty drives many children out of their homes. Some of them leave after being scolded by their relatives or by teachers for not completing their homework, some others leave for trivial reasons,” said an officer.\n\nHowever, they have also stepped up efforts to unite the children with their parents and in the worst case of being unable to do so, they will hand the children over to the local child welfare committee. As part of Operation Smile — an initiative to trace missing young boys and girls or unite runway children with their parents — 199 of them were taken back to their homes, while the remaining were handed over to government shelters or private welfare homes authorised by the government. Some of the boys who were rescued were in conflict with the law, officials said.\n\nThey had appointed Child Welfare Officers in 25 railway police stations in Chennai region that include Vellore, Salem and Coimbatore districts.", 
    "section": "national", 
    "title": "Railway stations see many lost kids in 2015", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}