{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The ‘mahasamprokshanam’ of the temple at Koviladi near Tiruchi, one of the 108 Divya Desams, will be performed on January 29 after a gap of 33 years.\n\nThe temple is the eighth among the Divya Desams and is connected with a ruler Upamanyu. It is also noted for the offering of ‘appam’ or ‘neiappam’ which Lord Vishnu had demanded from the ruler.\n\nThe ruler was cursed by Sage Dhurvasar and to be rid of it, the king had to serve free food (annadhanam) to the masses.\n\nOn one such occasion, Lord Vishnu came in the guise of an old man to the venue. He not only consumed the entire food but also demanded one pot of ‘neiappam’ (a sweet dish made of pure ghee). After tasting it, the old man (Lord Vishnu) reclined to rest facing west touching the pot with love indicating that His hunger was quenched.\n\nThe king was then relieved of the curse and so are the devotees who visit this temple today.\n\nTo mark this event, even now, ‘neiappam’ is offered to the Lord here daily. Also, this temple is famous for offering ‘annadhanam’ for attaining liberation.\n\nThis temple is located at an elevated position and one has to reach it through a fleet of 20 steps. It is considered one of the ‘Pancha Rangam’ temples on the banks of the Cauvery, the other four being Srirangapatna near Mysore, Sri Ranganathaswamy Temple in Srirangam, Sri Sarangapani Temple in Kumbhakonam and Sri Parimala Ranganathar Temple in Tiruvindaloor near Mayiladuthurai.\n\nThis temple is ‘Appala Rangam’ as it is further east of Srirangam. It has been sung by four Alwars -- Sri Tirumazhisai Alwar, Sri Nammazhwar, Sri Periyazhwar and Sri Tirumangai Alwar.\n\nThis was the last Divya desam sung by Sri Nammazhwar a decade before he departed to Sri Vaikuntham. The Alwars have glorified the shrine as “Tiruppernagar”. The Lord here, who is known as “Appakkudathan” blessed Sri Bhumidevi and Sri Markandeya whose deities can be seen at the sanctum sanctorum.\n\nThe presiding deity is called as ‘Apoopa Priyan’ indicating the Lord’s choice for Appam. To know more about the glories of this temple a discourse by Sri Velukkudi Krishnan, a noted scholar, has been arranged in the temple premises at 6.30 p.m. on January 28.", 
    "section": "national", 
    "title": "Ritual at Koviladi Temple to be held after 33 years", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}