{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Tennis player Somdev Devvarman, co-founder of MiniSport, offering fitness training at Union Christian School, Chetpet, on Friday. His company works with eight schools in Chennai. —Photo: R. Ravindran\n\nThe ground at the Union Christian School in Chetpet is bustling with activity as a group of middle school boys engage in a game of ‘Touch Rugby.’\n\nEven as the coaches blow the whistle to signify to the boys that the game has ended, girls in the same age group begin their volleyball practice. A coach teaches them the techniques of the game.\n\nThese coaches are here as part of an outsourcing contract. The school has outsourced its physical education (PE) classes to a company, which provides customised sports and fitness solutions for the students.\n\nThe school is among an increasing number of institutions that have taken to the concept of outsourcing PE classes to such professional companies. “We noticed that in most schools, there are single PE teachers who have to handle over a thousand children. As a result, there is less participation from most students,” said Vikram Menon, director and co-founder of MiniSport, an initiative to make PE classes more exciting for children.\n\nOther players in the market, including EduSport, have also tied up with schools and are preparing a curriculum across age groups.\n\nTennis player Somdev Devvarman, co-founder of MiniSport, points out that many children were not lucky enough to get introduced to any sport at an early age.\n\n“Through these classes, we hope to develop a sustained interest in sports which will impact their fitness favourably,” he said. Echoing his view, Arun Karthik, also a co-founder of MiniSport, said that customisation of fitness techniques was part of the programme they offered at schools. “Many schools these days do not have much space and we try to customise a curriculum for the students based on the availability of space. We work with a set of trained coaches and also arrange for interactions with sportspersons. While Somdev interacted with students across schools here, the Bengaluru Kabaddi team taught them the sport,” Mr. Vikram explained. Apart from introducing lesser known sports such as Gaelic Football in the eight schools they are working with in the city, MiniSport also taught a number of traditional games during Pongal.\n\n“We are, most importantly, trying to make PE classes more participative by involving all the children. While schools initially were hesitant to take up such steps for sports and fitness, we have seen a steady shift in mindset,” Mr. Arun said. Annie Mohan, principal of the Union Christian School, said, “These coaches ensure that every student participates.”", 
    "section": "national", 
    "title": "Schools outsource PE classes to fitness experts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}