{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Several youth belonging to SC/ST communities living in and around Hasanur and Kadambur hills have been motivated by the Department of Employment and Training to utilise opportunities for socio-economic progress in the form of the plethora of competitive examinations conducted by the Central and State governments.\n\nCareer Guidance camps were organised by Sathy-based SUDAR, a Non-Government Organisation, last week to expose the youth to the government schemes.\n\nAt Hasanur, the programme organised at the Government Residential School witnessed participation of educated youth from Kalidhimbam, Bejalatti, Thalavadi, Mavallam, Kottadai, and many other villages.\n\nHandbook\n\nReleasing and handing over first copy of a handbook on competitive exams to the School Headmaster S. Sundararajan, S. Vinoth, District Employment Officer - Youth Employment Service, detailed the opportunities for the youth to gain entry into government jobs through exams conducted by the Tamil Nadu Public Service Commission, Union Public Service Commission, Railway Recruitment Board, Teachers Recruitment Board, and other entities.\n\nVacancies\n\nOwing to the reservation in jobs, the youth belonging to SC and ST communities could gain easy entry into government jobs, Mr. Vinod said, informing that there were 18,252 jobs to be filled by the Railway Recruitment Board.\n\nThe Adi Dravida and Tribal Welfare Department has been encouraging youth to excel in civil services examinations by offering Rs. 50,000 as incentive to those who have cleared the preliminary level, alongside providing them free boarding and lodging and further training to clear the main examination.\n\nA similar programme at Kadambur benefitted youth from the town and surroundings including Kottamalam, Karalayam, Pavalakuttai, Pathiripadukai, Nagalur, and Gundri hills.\n\nSudar Director S. C. Natraj and Educational Coordinator Arunachalam also addressed the youth.", 
    "section": "national", 
    "title": "SC/ST youth in Hasanur, Kadambur hills receive career guidance", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}