{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Commissioner of Railway Safety’s inspection on January 28 and 29\n\nOnce the doubling work of the entire stretch is completed, the travel time of express trains would come down significantly.— File Photo\n\nThe second broad-gauge railway line between Tiruchi and Manapparai is likely to be thrown open for traffic soon after the mandatory clearance from Commissioner of Railway Safety, said Sunil Kumar Garg, Madurai Divisional Railway Manager.\n\nThe Commissioner of Railway Safety is scheduled to conduct the inspection of the 36-km-long new line on January 28 and 29, he told reporters here on Monday. This is part of the Villuppuram-Madurai doubling project.\n\nThe work, executed by Rail Vikas Nigam Limited, between Manaparai and Dindigul is in an advance stage and is likely to be completed by August. Once the entire stretch of doubling work is completed, the travel time of express trains would come down.\n\nFor instance, Pandiyan Express would take a little over seven hours, instead of the nine hours it takes now between Chennai Egmore and Madurai.\n\nDisclosing that RVNL General Manager had a discussion with him last week about the doubling of Madurai-Tirunelveli-Nagercoil and Vanchi Maniyachi-Tuticorin sections, Mr. Garg said the work may be taken up soon.\n\nUnion Railway Minister, Suresh Prabhu, had announced the project of doubling the remaining the line in Tamil Nadu (connecting Chennai with Nagercoil) through extra budgetary resources during the Railway Budget, 2016.\n\nUnder the project the railway officials have decided to provide two main lines and two loop lines in each railway station in the section. “This would help smoother running of trains in opposite directions without having to wait for crossings,” he said.\n\nSimilarly, the safety aspect would in Madurai-Tirunelveli section would also be significantly improved with elimination of 73 level crossings under the project, expected to be completed within four years.\n\nThe level crossings would be replaced either with sub-ways or with road overbridges, he said.", 
    "section": "national", 
    "title": "Second Tiruchi-Manapparai line to be opened for traffic soon", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}