{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Family members of 11 fishermen, who were held in Iran, at the Collectorate in Ramanathapuram on Monday.— Photo: L. Balachandar\n\nFamily members of 11 fishermen, who had gone to Dubai for contract fishing and were arrested by Iran navy on charges of poaching, appealed to the Collector to secure their release after taking up the matter with the government.\n\nLed by M. Karunamurthy, district secretary, Tamil Nadu Meenpidi Thozhirsanga Koottamaippu (CITU), the family members presented a common petition to the Collector S. Natarajan here on Monday and urged him to secure the release of the fishermen at the earliest.\n\nThe family members from various fishing hamlets in Kilakarai region said the fishermen went to Dubai in two batches in April and June last year on contract fishing and were working in a fish company owned by an ‘Arabi’ (United Arab Emirates national).\n\nThe fishermen, along with fishermen from Kanniyakumari district, were fishing on the high seas when they were arrested by the Iran navy on charges of trespassing into their waters and detained in an island with their five trawlers, they said.\n\nA Gomathi, wife of Arumugam, one of the 11 fishermen, said her husband spoke to her on Sunday night and said they were detained in the island and made to fend for themselves. After arresting five ‘Arabis’ who accompanied them in the trawlers, the Iran navy left them in lurch in the island, he told her.\n\nThe family members, who visited the Collectorate with their children, urged the State government to take up the issue with the Consulate General of India in Dubai and Embassy of India in Tehran and secure the release of the fishermen before the situation worsened.\n\nMr. Karunamurthy appealed to the government to pay monthly doles to the families till the fishermen returned home on the lines of financial assistance given to families when their breadwinners were arrested by the Lankan navy.", 
    "section": "national", 
    "title": "“Secure release of 11 fishermen arrested by Iran Navy”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}