{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To bring down pollution levels and make cities clean and green, the Ministry of Urban Development on Monday cleared the installation of solar panels on the rooftops of 10,000 houses in Tamil Nadu.\n\nThe beneficiaries of this programme would be those households that belong to the economically weaker segments.\n\nWith an estimated cost of Rs. 253 crore under Prime Minister's Awas Yojana, the proposal for such an infrastructural upgradation had come from the Tamil Nadu government and it has now been approved by an Inter-Ministerial Central Sanctioning and Monitoring Committee (CSMC) chaired by Housing and Urban Poverty Alleviation Ministry (HUPA) Secretary Nandita Chatterjee.\n\nFirst of its kind\n\nAccording to the Ministry of Urban Development, the development is “a first of its kind.” “Unit Cost of greening these 10,000 EWS houses in 157 Town Panchayats is estimated to be Rs.2.53 lakh per house. Of this, Ministry of HUPA will provide an assistance of Rs.1.50 lakh per house,” the ministry spokesperson said. As per the agreement with the ministry, the State government will contribute Rs.60,000 and the beneficiary’s contribution will be Rs. 43,000.\n\nThe committee also approved construction of 7,204 houses under Affordable Housing in Partnership (AHP) component of PMAY scheme in nine cities and towns at a total cost of Rs 572 crore with cost of construction ranging from Rs 7.22 lakh to Rs 8.46 lakh per house.\n\nCentral assistance\n\nOf this, the central assistance will be Rs 1.50 lakh per house and the rest will be borne by the state government and beneficiaries.\n\nAs per the committee’s approval, another 6,272 houses of economically weaker sections will be improved with required additional construction at a total cost of Rs.188 crore under the ‘Beneficiary led Construction’ component of urban housing mission in 9 cities.\n\nFor this, the central government will provide an assistance of Rs 1.50 lakh per each beneficiary while the state government and beneficiary will contribute Rs 60,000 and Rs 90,000 per house respectively.\n\nThe Ministry calls this infrastructural upgradation programme\n\na first of its kind", 
    "section": "national", 
    "title": "Solar panels for 10,000 houses cleared in TN", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}