{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "There are 8 kinds of spiders that eat small insects and help to improve soil health\n\nVarious kinds of spiders along with dragon flies and beetles kept on display at the grievance redressal meeting last week.- Photo: C. Venkatachalapathy\n\nEarthworms are known to be a farmer’s best friend in improving soil health. But the worms are not alone as there are a number of insects and spiders that help farmers in their own way.\n\nLast week, farmers taking part in the monthly grievance redressal meeting were welcomed to the conference hall by various kinds of spiders and insects that were displayed in jars.\n\nPresentation\n\nThere was a five-minute presentation on these spiders and insects that were useful for farmers.\n\n“Earthworms are not the only best friends of farmers. Various kinds of spiders, beetles and dragon fly could also be the farmers’ friends as they eat small insects that are found in fields like that of paddy crops,” G. Ramakrishnan, PA to Collector (Agriculture) told the farmers during the presentation.\n\nThere are eight kinds of spiders that help the farmers by eating the small insects.\n\nThis included Long Jawed spider, wolf spider and dwarf spider. Coccinellid beetle, ground beetle, dragon fly and damsel fly are other friends of farmers, he added.\n\nPhotographs of the spiders, beetles and dragon fly were shown in the presentation.\n\nM. Pandiyan, professor and head, Krishi Vigyan Kendra and Agricultural Research Station, Virinjipuram said these insects and spiders were “bio-agents” that eat the insects causing harm to crops.\n\n“They are an eco-friendly means of getting rid of insects that cause harm to crops. They are found on all kinds of agricultural fields. Many farmers are unaware of the benefits of the spiders and insects and kill them by spraying chemicals,” he said.\n\nMr. Ramakrishnan added that this was actually a vast subject, and they gave only an introduction to the farmers at the meeting.\n\n“This presentation follows the Collector’s instruction to provide some kind of useful information to farmers during the meeting. We wanted to highlight some thing close to nature and to them,” he explained.\n\nIn fact, he along with other staff spent nearly two hours on a paddy field in Arcot to get samples of the insects and spiders a day before the meeting. “We had taken nets to catch the insects in order to display them for the farmers,” he noted.", 
    "section": "national", 
    "title": "“Spiders are also farmer’s friend”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}