{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMK treasurer M.K. Stalin placed wreaths on the gravestones of linguistic martyrs here on Monday on the occasion of their death anniversary, which is being observed as “Veera Vanakka Naal” by leading Dravidian parties in the State.\n\nEarlier, he led a silent march from Salai Road to Anna Nagar, where he paid homage to ‘Keelapaluvur’ Chinnasamy and ‘Viralimalai’ Shanmugam at their “samadhis”, situated on the banks of Uyyakondan river.\n\nA large number of cadres of the DMK, who came from different parts of the district, took part in the silent rally. District secretaries K.N. Nehru (North) and N. Thiyagarajan (south) and former Minister N. Selvaraj were among those participated.\n\nMr. Stalin said the DMK had been regularly remembering the martyrs, who laid their lives for the sake of Tamil language. Their sacrifices would be remembered forever. The DMK would continue to work for the development of Tamil and people of the State.\n\nFloral tributes\n\nDMK treasurer M.K. Stalin on Monday offered floral tributes to Ms. Sampoornam, the pioneer of self-respect marriage who passed away here recently.\n\nMr. Stalin who was in Tiruchi to attend a slew of events took time off to pay his respects to Ms. Sampoornam whose self respect wedding was the first in the State conducted by the late leader C.N. Annadurai in 1941 in Tiruchi.\n\nAccompanied by DMK Rajya Sabha member Tiruchi Siva and DMK south district secretary K.N. Nehru, Mr. Stalin came to Tiruvanaikoil, where Ms. Sampoornam resided, and unveiled her portrait.\n\nAfter offering floral tributes, he interacted with the family members of Ms. Sampoornam for a while. Ninety-four-year-old Ms. Sampoornam died due to old age in her house at Tiruvanaikoil recently. He had made it a point to meet Ms. Sampoornam in February 2015 when he came to Tiruchi for campaigning for the DMK in the Srirangam by election.", 
    "section": "national", 
    "title": "Stalin leads silent march", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}