{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "They highlight the importance of exercising the voters’ democratic right\n\nCollector T.P. Rajesh on Monday flagged off voter awareness rally here on the occasion of National Voters’ Day. More than 400 college students took part in the rally that went along arterial roads in Karur.\n\nThey carried placards and banners highlighting the importance of exercising the voters’ democratic right. They also distributed pamphlets to the passersby. Mr. Rajesh asked the youngsters, who have attained 18 years of age, to apply for inclusion in the voters’ list.\n\nKaraikal\n\nCultural programmes, quiz contest and elocution contest formed part of the awareness programme to mark the National Voter’s Day here on Monday.\n\nStudents from various colleges participated in the events and exhibited their knowledge on the election procedures being adopted across the country.\n\nThey spoke on the importance of democracy.\n\nCollelctor E. Vallavan said the district administration had taken all steps for the enrolment of fresh voters with the qualifying age of 18 years. Several awareness programmes and campaigns were organised throughout the district to enrol voters and also for ensuring accuracy in the details of voters. The competitions for students aimed at sensitising them to the importance of exercising the franchise as part of discharging democratic responsibility, he added.\n\nS. Manick Deepan, Assistant Collector, offered felicitations.\n\nEarlier, Mr. Vallavan gave away Elector’s Photo Identity Card to the new voters and distributed prizes to winners in various competitions.\n\nPerambalur\n\nIn Perambalur, Collector K. Nandakumar, administered a pledge on ‘Voter’s Day’ to the officials and members of the public.\n\nNagapattinam\n\nA special ‘kolam’ contest was organised in Nagapattinam focussing on ‘National Voter’s Day’. Images of the nation and the importance of voting for promoting integration were explained to the visitors. Collector S. Palanisamy inspected the ‘kolam’. Earlier, he administered a pledge on the Day to the officials.\n\nPudukottai\n\nIn Pudukottai, students of various colleges took out an awareness rally in the town about the importance of exercising the franchise. Carrying placards, they marched down through the thoroughfares and distributed pamphlets to the public.", 
    "section": "national", 
    "title": "Students take out rally", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}