{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "The plant set up in 2006 in Chennai was the largest handset manufacturing facility.— File photo\n\nThe Fast Track Task Force set up by the Department of Electronics and IT (DeitY) will be meeting on January 28 in New Delhi to discuss the revival of the Nokia facility at Sriperumbudur.\n\n“A meeting to look at the revival of the plant will be held. The details on the wish list that we had sent to the Tamil Nadu government will also be discussed,” said Pankaj Mohindroo, National President, Indian Cellular Association (ICA), who is also the Chairman of the Fast TrackTask Force (FTTF).\n\nThe meeting will be attended by officials from the Tamil Nadu government and members of the Task Force.\n\nLast August, Mr. Mohindroo along with Josh Foulger the co-chairman of the Task Force and the country head and managing director of Foxconn met State Industries Minister P. Thangamani, I.T. Secretary T.K. Ramachandran and Industries Secretary C.V. Sankar.\n\nWish list to government\n\nIn October, the committee in its wish list to the government had requested the State to clear the decks for a clear resolution for transfer of title from Nokia to the ultimate buyer. It had also requested for de-recognition or scrapping of the labour union, give VAT exemption, 20 per cent capital subsidy and stamp duty waiver.\n\nThe State government had then said that they would look into the wish list and see what best could be done to revive the plant.\n\nIn 2014, when Microsoft acquired Nokia Corporation a $7.5-billion deal it kept away from the Chennai plant due to the dispute.\n\nA few months later Nokia said that it would be suspending its handset production at the Sriperumbudur plant.\n\nThe curtains came down in November 2014.\n\nThe plant in Chennai was set up in 2006 and it was the largest handset manufacturing facility.\n\nDuring its peak, the plant employed over 9,000 employees, of this 55 per cent were women.\n\nMeeting to look\n\nat the revival of the facility will be held in New Delhi on January 28", 
    "section": "national", 
    "title": "Task Force to explore revival of Nokia plant", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}