{
    "author": [], 
    "text": "RELIGION\n\nSri Andal Thirupaavai Mahotsava Sabha : Thirupaavai mahotsavam, discourse by Rangarajachariar, Sri Vedanta Desikan Sannidhi, 10 a.m.; by Ranganathachariar, 11 a.m.; Madhavachariar, noon.\n\nHindu Samaya Mandram : Sri Radha Kalyana mahotsavam, Sampoorna Narayaneeyam parayanam, 8.30 a.m.; discourse on Rukmani Kalyanam by N.Rama Diskshithar, 6.30 p.m., Rajaji Street, Renga Nagar, Srirangam,\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Venugopalan Sannidhi, Sri Ranganatha Swamy Temple, 6 p.m.\n\nCULTURE\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha: 169{+t}{+h}Aradhana festival of Sathguru Sri Thiagaraja Swamigal and Sri Seetharama Vivaaha Vaibhavam, concerts, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 9 a.m., 10 a.m., 4.30 p.m., 6 p.m. and 8 p.m.\n\nSri Rama Gana Sabha Trust : Thyaga Brahma Aradhanai, Bala Kala Vidhanam, 2 p.m; Pancharatna kirtanai, 7.30 p.m.\n\nGENERAL\n\nRepublic Day celebrations : Collector K.S. Palanisamy hoists the national flag, AR Grounds, 8 a.m.; Tiruchi Corporation – A. Jaya, Mayor, hoists the national flag, Corporation Office, 8 a.m.; Southern Railway – A.K. Agarwal, Divisional Railway Manager, hoists the national flag, Kallukuzhi Railway grounds, 8.05 a.m.; Rajaji Vidyalaya – E. Ramganesh, Chair, School of Education, Department of Educational Technology and Director – Curriculum Department, Bharathidasan University, 8.30 a.m.; Cauvery College of Engineering and Technology – N. Senthil Kumar, vice-chairman, presides, 8.30 a.m.; Dhanalakshmi Srinivasan Institute of Technology – Ananthalakshmi Kathiravan, vice-chairperson, chief guest, 9 a.m.; SHARON and JCI Tiruchi Excel – K. Thangarasu, Correspondent, Muthuraja Aided Middle School, chief guest, school campus, 8.30 a.m.; Sri Sivananda Balalaya – Sarubala Tondaiman, former Mayor, hoists the national flag, South Ramalinga Nagar campus, 8 a.m.; Urumu Dhanalakshmi College – Suhasini Ernest, former head of the department of Physics, hoists the national flag, 8.15 a.m.\n\nTiruthavathurai Araneri Kazhagam : Birth anniversary of G. Kanagasabai, Honouring R. Maadhu, with a title by M. Vaidyanathan, LNP Girls Higher Secondary School, 5 p.m.\n\nJ. J. College of Engineering and Technology: NSS wing, special camp, Alampatti, 11 a.m.\n\nKerala Samajam, BHEL : Inauguration of Mahatma Gandhi Memorial Herbal Garden – Phase II by A. Gomathi Thangam, Assistant Director, Agricultural Department, Kerala Samajam Thottam, 10 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}