{
    "author": [
        "S Annamalai"
    ], 
    "text": "STANDING TALL:Winners of the 16th edition of The Hindu Young World Quiz in Madurai with the chief guest, P. Srinivasamurthy, Inspector of Matriculation Schools, on Monday. From right: A. Aadhitya and V. Dhanush Aditya of Aditya Birla Public School, Ariyalur (juniors); B. Selva Muthu Balaji and V. Sai Siva Murugan of Sri Jayendra Golden Jubilee School, Sankar Nagar, Tirunelveli; (Right) An enthusiastic student answering a question.— Photos: R. Ashok\n\nSTANDING TALL:Winners of the 16th edition of The Hindu Young World Quiz in Madurai with the chief guest, P. Srinivasamurthy, Inspector of Matriculation Schools, on Monday. From right: A. Aadhitya and V. Dhanush Aditya of Aditya Birla Public School, Ariyalur (juniors); B. Selva Muthu Balaji and V. Sai Siva Murugan of Sri Jayendra Golden Jubilee School, Sankar Nagar, Tirunelveli; (Right) An enthusiastic student answering a question.— Photos: R. Ashok\n\nThe Hindu Young World Quiz sustains enthusiasm of school children till the last question\n\nIt was a difficult task for quiz master V. V. Ramanan to quell the riot inside Tholkappiar Hall of Thiagarajar College here whenever a question went unanswered by the finalists. The 16{+t}{+h}edition of The Hindu Young World Quiz held on Monday sustained the enthusiasm of school children, as always, till the last question.\n\nIf it was the dominance of the Adityas from Ariyalur in the junior section, the team from Sri Jayendra Golden Jubilee School from Sankar Nagar in Tirunelveli dethroned the reigning champion Mahatma CBSE School, Madurai, by a big margin of 38 points. The event attracted 120 teams in the junior section (Class 4 to 6) and 160 in the senior section (Class 7 to 9). In all, 560 students, accompanied by their parents and teachers, made the prestigious quizzing event among schools in the country vibrant.\n\nThe final rounds were preceded by a written quiz containing 25 questions. The top six teams from each section made it to the finals. The junior game was played on the basis of rounds and seniors had to choose from a grid of 24 questions.\n\nSince the quiz competition in Tiruchi is restricted to the senior section, children from junior classes from the region participated in the Madurai event.\n\nV. Dhanush Aditya and A. Aadhitya of Aditya Birla Public School, Ariyalur, retained the hold over the junior title with 105 points, with B.B. Vikaash and A.G. Kishan Madhav of Mahatma Montessori Matriculation Higher Secondary School, Madurai, closely behind with 90 points.\n\nThe toppers in the senior section were V. Sri Siva Murugan and B. Selva Muthu Balaji of Sri Jayendra Golden Jubilee School, with V. Bipin and R. Sai Vignesh of Mahatma CBSE coming second.\n\nPrizes were distributed to the winners by P. Srinivasamurthy, Inspector of Matriculation Schools.\n\nTop six teams\n\nThe following were the top six teams that made it to the finals:\n\nJunior: V. Dhanush Aditya and A. Aadhitya of Aditya Birla Public School, Ariyalur; B. B. Vikaash and A. G. Kishan Madhav of Mahatma Montessori Matriculation Higher Secondary School, Madurai; Srijan Prsanna and Aditya R. Ram of Pushpalatha Vidya Mandir, Tirunelveli; V. Tamil Isai and Sa. Saketha Raman of Pushpalatha Vidya Mandir; U. B. Sabareesh and Abhay Anand of Lakshmi School, Veerapanjan, Madurai; and G. Harish Adithya and K. Suraj of Velammal Vidyalaya, Viraganur, Madurai.\n\nSenior: V. Sri Siva Murugan and B. Selva Muthu Balaji of Sri Jayendra Golden Jubilee School, Tirunelveli; V. Bipin and R. Sai Vignesh of Mahatma CBSE School, Madurai; S. Lokesh Keshav and J. Jasper Nathaniel of SBOA Matriculation Higher Secondary School, Madurai; B. Hrithik Vel and R. Madhan Prasanna of Jeevana School, Madurai; D. Aditya and Niranjan of Mahatma CBSE School, Madurai; and S. Sanjay and EL, Srinivasa Kannappan of TVS Matriculation Higher Secondary School, Madurai.\n\nThe title sponsor of the event was VIT University. The venue sponsor was Thiagarajar College. The regional sponsors were ARS-HTA, Me Too Snacks and Indian Foods. The event was organised in association with Firefox and Kokuyo Camlin.", 
    "section": "national", 
    "title": "Tirunelveli and Ariyalur schools win battle of wits", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}