{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A group of villagers from Kadamboduvaazhvu in the district submitted a petition at the weekly grievance day meeting held on Monday against the permission granted for granite quarrying near their village.\n\nIn their petition submitted to District Revenue Officer M.G. Kulandaivel, the Kadamboduvaazhvu villagers, led by panchayat president R. Ramakrishnan said an individual, who had purchased 1.46 hectares in the Kadamboduvaazhvu panchayat, had commenced preliminary works for mining granite “without obtaining any permission from the village panchayat.”\n\nBut the Department of Mines had given its nod for the proposed mining activity, they said.\n\n“If granite quarrying is started, groundwater table will be affected. Moreover, the lands getting water for irrigation from Puliyankulam, Kadamboduvaazhvu tank and Alangulam will become barren as quarrying will hit the storage in these waterbodies. Hence, the permission given by Department of Mines should be withdrawn,” Mr. Ramakrishnan said.\n\nThe villagers also charged that the explosives to be used in the quarry would trigger cracks in the houses in the sleepy hamlet.\n\n“Start work on PHC”\n\nVillagers of Periyapillaivalasai, led by panchayat president M. Muthulakshmi, submitted a petition saying that the Department of Public Health, based on the recommendation from the village panchayat, had decided to construct a primary health centre on a land in the village. However, the proposal had been shelved without citing any reason following the opposition by a few individuals. Hence, the Collector should instruct the officials concerned to start the work on constructing the PHC as early as possible.\n\nFacilities sought\n\nA group of Dalits from Anna Nagar near Ambasamudram submitted a petition to the DRO demanding basic infrastructure in their village. The petitioners said the 150 Dalit families of Anna Nagar were suffering a lot due to the lack of drinking water, motorable roads, sanitary complex, community hall and cremation ground for the past several decades.\n\nThough they had submitted petitions for these facilities on several occasions, no step had been taken to provide the poor residents proper facilities.\n\nHence, the Collector should take appropriate action, they said.", 
    "section": "national", 
    "title": "Villagers against nod for granite quarrying", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}