{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Participants at the National Voters' Day celebrations in Puducherry on Monday. (Right) David Annoussamy, former judge of Madras High Court, distributes voter ID cards to first-time voters. District Collector-cum- District Election Officer D. Manikandan and Chief Electoral Officer V. Candavelou are in the picture.— Photos: S.S. Kumar\n\nThose who abstain from voting cannot criticise the functioning of the govt. formed after the polls: former HC judge\n\nAll first-time voters should exercise their franchise in the coming Assembly polls to strengthen democracy, speakers at National Voters’ Day celebrations said here on Monday.\n\nThe National Voters’ Day is being observed to mark the founding of the Election Commission (EC) across the country.\n\nThe Elections Department made elaborate arrangement for the celebrations on Monday. Elector’s Photo Identity Cards (EPICs) were distributed to the first-time voters and also released a manual brought out by the EC.\n\nChief Electoral Officer V. Candavelou said that the theme of the celebration this year was “inclusive and qualitative electoral participation.” The EC had instructed the department to ensure error-free electoral rolls and every voter exercised his or her franchise. “ Voters should not fall prey to any inducement as that will only dilute the sanctity of electoral process,” said Mr. Candavelou.\n\nDelivering a special address, former Judge of the Madras High court David Annousamy said voters should ensure that they did not abstain from exercising their franchise as they should strengthen democracy .\n\nThe voters should thoroughly go through the merits of the parties, candidates in the field and also affordability of the implementation of the promises and assurances made to the voters before casting the vote.\n\nMr. Annousamy said that those who abstain from voting have no right to criticise the functioning of the government formed after the elections. All first-time voters should vote and should also persuade their neighbours and relatives to vote, he said.\n\nThammu Ganapathy, Electoral Registration Officer, R. Nadaradjane, booth-level officer, and several officers were honoured with awards in appreciation of their services.\n\nA. Muthamma, Art and Culture Secretary-cum- Chief Co-ordinator of SVEEP (Systematic Voters’ Education and Electoral Participation), Collector D.Manikandan and Joint Chief Electoral Officer Ravideep Chahar were present. The first-time voters also took a pledge on the occasion.", 
    "section": "national", 
    "title": "Vote for stronger democracy, first-timers told", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}