{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Two women came to the Collectorate here on Monday with their children, one, a Dalit woman urging the Collector to help to unravel the mystery surrounding the sudden death of her husband in Dubai and another woman urging him to secure the release of her husband, a fisherman jailed in Bahrain.\n\nC. Jayanthimala (35), who came with her two sons, aged 13 and 4 here on Monday, said in her petition that her husband S. Chandrasekar (37), a worker employed in a construction company in Dubai, died under mysterious circumstances on January 23 and urged Collector S. Natarajan to unravel the mystery and help her to bring back the body.\n\nShe said her husband appeared normal when he spoke to her on the night of January 22 and died the very next day morning. One Viji from Abiramam who was also employed in the company, called her and informed her that her husband collapsed and died after vomiting while going for work.\n\nThere was no word yet from the company, she said and suspected a foul play in the death. An anganwadi worker at Kiliyur in Paramakudi taluk, Jayanthimala urged the Collector to help her secure compensation from the construction company.\n\n“Secure release of jailed husband”\n\nIn another case, M. Vanitha (28) from Thondi, who visited the Collectorate with her four-year-old son and a three-year-old daughter, requested the Collector to secure the release of her husband B. Magalingam, a fisherman, held in Bahrain.\n\nAfter her husband spoke to her on December 18, she could not establish any contact with him for the next 10 days and later came to know he was arrested and jailed. Her husband spoke to her a couple of days ago from the prison and wanted her to take up the matter with the district administration, she said.\n\nHe was arrested for inadvertently dashing against a boat while fishing on the high seas, he told her. She said she had twice presented petitions to the Collector on January 11 and 16 and visited the Collectorate for the third time this month. She was accompanied by her mother-in-law Ranjitham.", 
    "section": "national", 
    "title": "Woman urges Collector to bring back husband’s body", 
    "subsection": "tamilnadu", 
    "date": "2016-01-26"
}