{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Seeks details of dates on which court notices were served on accused\n\nP. Dhayalu, wife of V.P. Pandi alias ‘Attack’ Pandi, has filed an application under the Right to Information Act, 2005 in the Madras High Court Bench seeking details of dates on which court notices were served on her husband and 16 other accused in a criminal appeal related to the 2007 Dinakaran newspaper office attack case.\n\nIn the application made to the Public Information Officer of the High Court Bench, she wanted to know the date on which the court admitted the appeal preferred by Central Bureau of Investigation (CBI) against the acquittal of all 17 accused by the Principal District and Sessions Court here on December 9, 2009 and the date on which notices were served on the accused after admitting the appeal.\n\nConfirming the news, her counsel, preferring anonymity, said that the information sought under the RTI Act would help in proving that though the CBI had preferred the appeal in July 2010, along with a petition to condone a delay of 118 days and another seeking leave of the court to file the appeal, and got it numbered in June 2011, so far court notices had not been served on any of the accused.\n\n“Even assuming that the accused have been intentionally evading receipt of court notices, it is a matter of record that no further proceeding such as publishing the notice on newspapers had been taken. Therefore, technically, the appeal cannot be heard until these procedures are followed and this is what we want to establish by obtaining information under the RTI Act,” he said.\n\nWhen pointed out that all 17 accused in the case had engaged advocates to oppose petitions to condone the delay and grant leave between 2010 and 2011, the lawyer said: “Those advocates were engaged only for opposing the two petitions and not the appeal which was unnumbered at that time. Subsequently, they withdrew their appearance and the court notices remain unserved till date.”\n\nIn the meantime, High Court sources said that ‘Attack’ Pandi, who was at present lodged in the Central prison here in connection with the murder of ‘Pottu’ Suresh, had filed bail applications in as many as seven rioting and attempt-to-murder cases pending against him in Madurai and Thoothukudi districts.\n\n‘Technically, appeal cannot be heard until these procedures are followed’", 
    "section": "national", 
    "title": "‘Attack’ Pandi’s wife files RTI application", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}