{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Protest mood:Bull owners and enuthusiasts of bull race up in arms against the ban on jallikattu on Wednesday.- Photo: C. Venkatachalapathy\n\nThe Supreme Court’s ban on ‘jallikattu’ sent bull owners and enthusiasts of ‘eruthu vidum vizha’ (bull race) across the district into protest mood. A number of them staged protests on Wednesday near Katpadi and Vaniyambadi. They are planning to intensify the protests, and also defy the ban by holding the bull race.\n\nThe celebratory tone from last Friday when the Centre had cleared the grounds to conduct jallikattu turned into voices of protests on Wednesday following the ban. “Eruthu vidum vizha” is popular across Vellore district for decades now, and the ban has evoked disappointment.\n\nMembers of Tamil Nadu Eruthu Vidum Vilaiyaatu Paadhukaapu Sangam, Vellore district staged protests near Chittoor Bus Stand at Katpadi and Vaniyambadi demanding permission to conduct the bull race.\n\n“This is a traditional sport being held for four to five generations. We spend at least Rs. 500 a day towards feeding the bull and it is reared exclusively for the race,” N. Padmanabhan, treasurer of the association said.\n\nThe members question the timing of bringing up the issue.\n\n“This could have been solved two months ago. The State and Central governments are aware that the Supreme Court can ban jallikattu despite the notification. Why were there no coordinated efforts to pave way to conduct the traditional sport?” he asked.\n\nThe association members are demanding that the State government enact legislation to enable conduct of jallikattu, and other related events like “eruthu vidum vizha” and “manju virattu”.\n\nThe protests are set to intensify in the coming days, he said, adding, “We are planning for protests in various places across the district until the ban is lifted.\n\nThis will continue not only during Pongal but thereafter too. We will also defy the ban and conduct “eruthu vidum vizha” in the district. It will be conducted at Muthukur near Latheri. The sport is being held in various parts of Karnataka now.”\n\nThere were some tense moments when 22 bulls were brought to the protest venue at Ramanaickenthoppu near Vaniyambadi as two bulls were let loose.", 
    "section": "national", 
    "title": "Bull owners to defy ban, hold ‘eruthu vidum vizha’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}