{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Two groups clash following the suicide of a girl\n\nThe district police have invoked Section 107 of the Code of Criminal Procedure against two groups of the Tamizhaga Muslim Munnetra Kazhagam (TMMK) and the Viduthalai Chiruthaigal Katchi (VCK) which had been fighting against each other in Thondi after a teenage girl student of the local Madrasa allegedly committed suicide.\n\nAs the office-bearers and volunteers of the two parties allegedly committed breach of peace and disturbed public tranquillity in the area, Thondi Inspector of Police Ravichandran invoked the section against 13 people and forwarded the first information report to the local executive magistrate.\n\nThose booked under Section 107 of the Cr PC would be required to execute a bond with or without sureties for keeping peace for a year.\n\nIf the person committed breach of the bond executed by him, the executive magistrate, after recording the grounds of such proof, would order the arrest of the person and detain him in prison till the expiry of the bond period, the police said.\n\nThe detention order would be without prejudice to any other punishment to which the person might be liable in accordance with law, the police said. Those booked under the section included M. Sathik Patcha, TMMK east district secretary, J. Meeran, TMMK union students’ secretary, and U. Parakath Ali, town secretary, Manithaneya Makkal Katchi, the police said.\n\nThe VCK office-bearers booked under the section included M. Jajakhan, union secretary, I. Sikkandar, town deputy secretary, and S. Naina Mohamed, town secretary, they added.\n\nThondi police forwarded the FIR to the local executive magistrate on Wednesday and they were likely to be summoned for executing the bond in the coming days.\n\nThe police said that after the 17-year-old girl student of the local Madrasa allegedly committed suicide by consuming poison last week following a family dispute, local VCK party men distributed pamphlets holding the Madrasa responsible for the girl’s death.\n\nThis was objected to by the TMMK members and they clashed at least on two occasions, attacking each other, the police added.", 
    "section": "national", 
    "title": "Case against TMMK and VCK members", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}