{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Civil Services personnel should be upright and not hesitate to stand up against political heads if they committed anything wrong, said former IPS officer Kiran Bedi, during an interaction with students and young entrepreneurs at Thiagarajar College of Engineering here on Tuesday.\n\nAt the event organised by Madurai Chapter of Young Indians, Ms. Bedi said that corruption by politicians at higher echelons could be reduced drastically if bureaucrats refused to remain silent and chose not to collude.\n\nStating that she would rate Indian Civil Services at 3 on a scale of 10, Ms. Bedi said that while the selection process ensured that highly intelligent people entered the services, the ‘emotional quotient’ and ‘spiritual quotient’ of the aspirants should also be considered for selection. Responding to a question by a schoolboy on entering politics, she said that youngsters could certainly enter politics, provided they were committed to working for the welfare of everyone and not indulging in exploitative politics.\n\nShe said that youngsters could take up causes and spearhead movements like Anna Hazare movement but they should ensure that the movement remained non-political. Ms. Bedi made a presentation to the participants with an illustrated story book ‘Making of The Top Cop’ that spoke about her childhood and the incidents that shaped her.\n\n“I learned at an early stage that if I had to help somebody, then I had to be somebody. If I remained a nobody, then I can help nobody. That is what motivated me to enter the police service,” she said.\n\nMs. Bedi shared her experience in bringing reforms in Tihar jail and the challenges she faced as the first woman IPS officer.\n\n‘Emotional quotient’ and ‘spiritual quotient’ should be considered for selection", 
    "section": "national", 
    "title": "‘Civil Services personnel must be upright’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}