{
    "author": [], 
    "text": "It had claimed damages to the tune of Rs. 10 lakh owing to an agitation staged by environmental activists in 2009\n\nA City Civil Court here has dismissed with costs a civil suit moved by Dow Chemicals Private Limited (Dow), which owns the Union Carbide Corporation (UCC), claiming damages to the tune of Rs 10 lakh for business loss, defamation and loss of reputation due to an agitation staged by environmental activists in 2009, demanding fair compensation to the victims of 1984 Bhopal gas leak tragedy.\n\nThe VII Additional Civil Judge, K. Dhanasekaran, dismissed the plea as the company failed to produce any document in support of its claim. “It would be unsafe to impose a nominal cost without any legal basis for actual business loss,” the judge said.\n\nDow Chemicals initiated the civil suit against environmental activist Nityanand Jayaraman, the International Campaign for Justice in Bhopal and four other organisations following a protest staged by the activist on February 10, 2009.\n\nAccording to the plaintiff company, the activist gathered a mob of over 80 and assembled outside their premises at Tamarai Tech Park here.\n\n“The activists held inflammatory and defamatory placards, banners and raised aggressive and abusive slogans against the company and distributed defamatory materials as press releases and pamphlets,” Ramolla Karnani, director (Legal) of the company said in his affidavit.\n\nClaiming that the company incurred a loss of Rs 10 lakh due to the protest, it sought a direction to the defendants to jointly compensate the loss.\n\nThe company also prayed the court to grant a permanent injunction against the defendants from conducting any more such protests near its premises.\n\nMr. Nityanand Jayaraman submitted that the liability of the company as the successor of the UCC is a matter pending before the courts of Bhopal and Jabalpur and the same cannot be adjudicated by the City Civil Court.\n\nAsserting that the protest was peaceful and has not affected the business activity of the company,\n\nMr. Nityanand said, “The damages arrived by the company for the loss is imaginary and unsustainable in the eye of law.”\n\nNot specific\n\nWhen the suit came up for final hearing, the judge noted that the plea for a permanent injunction is not specific and the company sought the relief against the persons who are indefinite and imaginary.\n\n“It would be relevant to note that the civil court order would be binding upon the parties in issue but not against the whole world,” the judge added.\n\n‘Damages arrived by the company for the loss is unsustainable in the eye of law’", 
    "section": "national", 
    "title": "Compensation plea of Dow Chemicals dismissed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}