{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "“Business is dull this year since people prefer stainless steel or brass vessels for Pongal rituals\n\nWith the harvest festival of Pongal around the corner, earthenware sellers and potters are feeling the pinch of dwindling demand due to a variety of reasons.\n\n“Business is dull this year because many people prefer stainless steel and brass vessels for Pongal rituals these days,” R. Alagesan, a pot stall owner on Butterworth Road told The Hindu .\n\nIn the business for over 40 years, he said that small traders like him had been hit by promotion of earthenware by the city’s major department stores.\n\n“Obviously we cannot offer discounts like the bigger stores, but people do bargain hard while buying from us too,” said Mrs. Alagesan, who paints the ‘muhurtham set’ in bright colours. Sold as a set of 3 large pots and 8 accessories, these are used for wedding rituals.\n\nAlagesan stocks pots from Pudukottai district, Thanjavur and Manamadurai. “Since their workmanship is better, they are costlier than our local stuff,” he said.\n\nPongal pots from Kondayampettai near Thiruvanaikovil were being sold for Rs. 100 in the Butterworth Road stalls, while those from places like Madurai were going for Rs. 200-250.\n\n“Even if we don’t sell during the Pongal season, we still have customers who require earthen vessels for funeral rites,” said Mrs. Alagesan. “Other than that, we sell kolam powder and brooms to make ends meet throughout the year,” she added.\n\nFor M.S. Rachel Jebaraj, the recent rainy weather has hit her suppliers in Pondicherry, Dindigul and Cuddalore. “We are still waiting for our stock to arrive,” Mrs. Rachel said. “Even though business has been dull this year, we will manage to sell our stock completely.”\n\nThe outlook is less rosy for Vedavalli, a 70-year-old who has been forced to shift to the street after her stall near Thepakulam was demolished. “It’s a wonder if I get to sell anything worth Rs. 50 in a day,” said the vendor, who has been in the trade for 30 years. “I buy 10 pots each time from a potter who comes from Thiruvanaikovil, because I can’t afford to travel,” she said. “I make-do by selling kolam powder.”\n\nKondyamapettai-based potter S. Ramu says that for a wholesale supplier like him, the orders for earthenware have actually gone up this year. “I’ve got a little more than 500 orders from Tiruchi for Pongal. Last year the rains affected the business in stoves,” he told The Hindu as he prepared to fire 100 Pongal pots in the community yard kiln which is used by the colony’s potters. The items are baked in shallow pits that are lined with straw, coconut husks and firewood.\n\n“My business has become diverted to the restaurants, where earthenware is in great demand,” said Ramu. “In case the Pongal orders die out completely, I do hope clay tumblers can be promoted instead of paper disposables. They are faster to make than pots, and are completely bio-degradable compared to what is being used now,” he said.", 
    "section": "national", 
    "title": "Demand for ‘pongal’ pots dwindles", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}