{
    "author": [
        "M K"
    ], 
    "text": "On January 14, TNRC will organise a signature campaign\n\nDespite ban imposed by the Supreme Court on jallikattu and rekla race and the highest judicial body denying stay on the earlier order, on Wednesday, rekla race organisers here threatened to go ahead with the traditional race during Pongal. However, they did not want to share details of the venues for the race.\n\nTraditional sports\n\nOn January 14, Tamil Nadu Jallikattu Peravai and Tamil Nadu Rekla Club (TNRC) will organise a signature campaign at Olympus in the city to save the two traditional sports and the native breed bulls used in these sports. “For Pongal, hundreds of bull owners have threatened to decorate their animals, perform pujas and abandon them on the roads in Pollachi and in Coimbatore,” TNRC’s organising chairman R.S. Thirumurugan told The Hindu .\n\nSoon after Union Government lifted the ban on the sport, preparations began in full swing in and around Pollachi area to organise rekla race. Festive spirit gripped Kallapuram, Arasampalayam and Thondamuthur in Pollachi and at Chatram and Chandrapuram, in Udumalpet (Tirupur District). They hoped to conduct the sport in a grand manner after 19 months. But directions from the Supreme Court have disappointed them.\n\nStarting with a mass protest and rally at Pollachi on Wednesday, organisers of the traditional sports have decided to organise a series of protests to revoke the ban.\n\nBlack flags\n\nOn Wednesday hundreds of farmers brought their bullock carts with black flags in a procession to the Pollachi Sub Collector’s office and submitted a petition to the Sub Collector, urging the State and Union Governments to lift the ban.\n\n“Ban on the sport would lead to the ultimate extinction of these high quality native breed cattle . Animal lovers and rights activists claiming to protect the animals from alleged torture will be responsible for these breeds getting wiped out,” Secretary of Tamil Nadu Vivasaya Parmpariya Kalachara Trust, S. Jayaprakash said. He said that 300 pairs of bulls used to take part in the race at Pollachi. “But only 60 pairs were registered for the first race that was scheduled to take place in the region at Kallapuram – after the ban came into effect from May 2014.”\n\n“The numbers will go down further as they will now be sold for slaughter,” he said.\n\nThe organisers do not want to share details of the venues for the race\n\nBull owners threaten to decorate their animals, perform puja and abandon them on roads", 
    "section": "national", 
    "title": "Despite ban, bull owners threaten to go ahead with rekla race", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}