{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Engaging higher secondary teachers to perform Census duty and those related to linking Aadhaar card with voter cards would affect the studies of the Plus-Two students, said the TamilNadu Higher Secondary Post Graduate Teachers Association.\n\nIt has demanded that the teachers should not be deployed for these works.\n\nIn a petition submitted to the District Collector, V. Dakshinamoorthy, the association district president A. Ramu said that with Plus-Two examinations and practical examinations fast approaching, teachers were taking effective steps to ensure 100 per cent pass.\n\nTeachers were involved in preparatory examinations, training the students for practical and preparing the students mentally to write the examinations.\n\nFrom Wednesday, post graduate teachers are deployed in the work by revenue officials.\n\n“This affects the students as teachers would not be able to attend the school for many days,” he added. Hence, he urged the administration to immediately relieve the teachers from those work so that they could attend the school and involve in training the students.\n\nPetition\n\nThe petition demanded that a science laboratory be set up in Government Higher Secondary School in Thaneerpandal Palayam as students were forced to undertake their Plus-Two practical examinations in Government Higher Secondary School in Devanankurichi for the last six years. The school was upgraded in 2008 and was producing 100 per cent results in Plus-Two examinations every year.\n\nHence, the association demanded that a laboratory too be set up in the current academic year so that the students can utilise the facilities next month.\n\nWhen contacted, Chief Educational Officer S. Gobidoss told The Hindu that post graduate teachers were deployed for the duty without the knowledge of the Education Department.\n\n“The Revenue Department with the available list had selected the teachers,” he added. The CEO said that the matter would be taken up with the Collector.", 
    "section": "national", 
    "title": "Do not deploy teachers for Census work, says association", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}