{
    "author": [
        "P V"
    ], 
    "text": "Certificate verification process under way in Government schools on the heels of the fake certificates racket in Krishnagiri on Wednesday. —Photo: N.Bashkaran\n\nDogged by the arrests and allegations, the Education Departments of the Dharmapuri and Krishnagiri districts have now launched marathon certificate verification process for all teachers in the Government schools.\n\nIn the past 36 hours, 350 secondary grade teachers of 85 high schools and higher secondary were vetted for genuineness in Dharmapuri.\n\nWhen contacted, Maheshwari, Chief Education Officer of Dharmapuri, said the issue of fake certificates is likely to come up on appointments made prior to 2006. From 2006, the Education Department has followed up verification at the time of appointment, probation declaration and also during increment, and they less likely to be fake certificates, says Ms. Maheshwari. The chances of forgery are high among B.T grade teachers, who come on promotion. As of Wednesday, two more teachers’ certificates were sent for verification of genuineness to the department of examination.”\n\nA total of 210 high schools and 1025 elementary schools are in the district. Similarly, the chances of forged certificates are likely to be high among elementary schools. “There are 1,025 elementary schools and the verification process will be taken up after high schools and higher secondary schools and it is a slow process,” the CEO told The Hindu .\n\nEven as the Education Department is aiming to cast the net far and wide, sources believe that the screening exercise might be an arduous task for the sheer complexity of vetting the authenticity of certificates.\n\nAs of now, net is cast based on tip-offs on the bona fides of specific teachers In Krishnagiri, over 1,846 schools and 8,995 teachers have come under scanner, according to a department release. The CEO of Krishnagiri was incommunicado.", 
    "section": "national", 
    "title": "Education Department officials start verification of certificates", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}