{
    "author": [], 
    "text": "ERODE\n\nErode Sengunthar Engineering College: Pongal celebrations,\n\n9.30 a.m.; knowledge-sharing session by principal L. Boopathi,\n\n4.10 p.m.\n\nSALEM\n\nSri Prasanna Varadaraja Perumal Devasthanam: Margazhi Tiruppavai Upanyasa Mahotsavam, B.M. Sathya Ram Acharya delivers upanyasam, Vasantha mandapam, Chinnakadai street, 6.45 a.m.\n\nTiruvembavai Peruvizha Kazhagam Trust: Tiruvembavai peruvizha, Tiruvembavai parayanam, Arulmigu Sugavaneswara Swamy Temple, 5.15 a.m.\n\nMargazhi Peruvizha Committee: Margazhi festival, Nanjil Sampath speaks on ‘Tamizh yengal uyarvukku vaan,’ 7 p.m.\n\nInfant Jesus Cathedral, Arisipalayam: Pangu Peruvizha, Pongal festival, tiruppali, S. Victor Cruz, presides, 11 a.m.; jabamalai and Navanaal, tiruppali, A. Deva presides, 6 p.m.\n\nNational Child Labour Project: SMILE, integrated child protection programme, training for Nadel teachers of Panamarathupatti and Veerapandi blocks, Blood Resource Centre premises, Veerapandi,\n\n9.30 a.m.\n\nPeriyar University: Pongal celebrations, folk festival, exhibition and folk arts performance by students, C. Swaminathan, Vice-Chancellor, presides, 9.30 a.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation Limited: North East crafts bazaar, Deiveegam Marriage hall, 10 a.m. to 9 p.m.\n\nNational Book Trust and New Century Book House: National Book Festival books exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nCooptex: Handloom Pongal celebrations, Thangam Pattu Maligai,, 10 a.m.; New Year and Pongal handloom textiles exhibition, Bose Maidan, 10 a.m. to 8 p.m.\n\nIndian Oil Corporation Limited and The Hindu: Sales promotion campaign, T. Palanikumar, CDRSM, IOCL, Salem divisional office, chief guest, Arun Kumar, Deputy Manager, participates, Sri Ranganathar and Company, Narasothipatti, 9.30 a.m.\n\nNAMAKKAL\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}