{
    "author": [
        "K Jeshi"
    ], 
    "text": "Catch Pongal releases at the newly opened Maharaja five-screen multiplex in Erode.\n\nMiniature bicycles and an antique clock modelled on a bicycle completes the décor at the newly-opened Maharaja Multiplex in Erode. The multiplex, a first for Erode, opens with five screens.\n\nFour screens are done up in exclusive colour schemes of brown, magenta, red, and blue.\n\nThe fifth is in black and it is the emperor suite. This is a 50-seater suite with leather sofas and an exclusive lounge attached.\n\n“Our objective is to offer a posh movie outing for the public in Erode. There are no entertainment options here and a new movie theatre is opening after 20 years,” says P. Sathiyamoorthy, managing director of Maharaja Theme Parks and Resorts in Neelambur.\n\nIt’s a matter of pride for him to bring this unique movie experience to his hometown.\n\n“Families stopped going to watch movies in theatres because of poor maintenance, especially the toilets. We have changed all that. Now the theatre has superior acoustics, digital projection, and clean toilets,” he says.\n\nBesides Tamil films starting with Pongal releases, the multiplex will also screen 3D English and Hindi movies in the coming days.\n\n“Families who were glued to the TV sets can step out for an exclusive experience. Now, every new movie is released simultaneously across the State which is a great opportunity for us to tap the market. After Coimbatore, Erode is a thriving educational hub and is well-known for the entrepreneurial spirit too. It’s a proud moment for us to bring the multiplex,” he says.\n\nAs for the bicycle décor, Sathiyamoorthy says, “I like bicycles. I remember cycling around Erode town in my childhood. We have tried some novel design ideas for the corridor, cafeteria, and the food court.”\n\nMaharaja multiplex is located at Chennimalai Road. Screen I has 304 seats, while Screen II has 411 seats and screen III and IV accommodates 166 each.", 
    "section": "national", 
    "title": "Five-screen multiplex to be opened in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}