{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Brisk sales:Sugarcane sales has begun to pick up in Vellore markets. (Right) Roadsides in Long Bazaar have turned colourful with sale of rangoli powder. — Photos: C. Venkatachalapathy\n\nLong Bazaar is thronged by people shopping for Pongal festival\n\nThe festival of harvest is here, and the markets are turning busy in Vellore. With sugarcane being integral to Pongal festivities, loads of cane has started to arrive to Long Bazaar from various parts of the State.\n\nLong Bazaar, which has always been a one-stop for all festival needs, is now buzzing with crowd shopping for the harvest festival.\n\nCost of cane\n\nSale of sugarcane has started to pick up in Vellore. “A bundle of sugarcane consisting of 18 to 20 canes cost Rs. 400 to 550 now. The cost depends on the cane’s height and thickness. Last year, a bundle was sold for Rs. 300 to Rs. 500,” Aslam, a shopkeeper said.\n\nVellore gets most of its sugarcane supply from Salem, Chidambaram and Kumbakonam, he said, adding, “The yield was good this year but the rains in November damaged crops severely. Now, it seems that the government is procuring the damaged canes, and hence, farmers have been able to breathe easy.” Vendors sell single sugarcane for Rs. 50 to Rs. 70.\n\nThere cannot be sweet Pongal without jaggery. With jaggery being another key ingredient for the festival, the district’s own-made jaggery is up for sale in Vellam Mandi. “A kilo of jaggery costs Rs. 30 to Rs. 40 depending on colour. Jaggery produced from various parts of the district is supplied to other parts of the State including Chennai and Kancheepuram,” said Rajendran, shop keeper at the mandi.\n\nHowever, he said that the sales were dull now when compared to last year. “The production itself is less this year,” he added.\n\nVegetables cost reasonable\n\nThe cost of vegetables is nothing worrying, say vendors. Prices have been stable for sometime now. “The rates of most of the vegetables are normal. On some days, there is variation in cost due to dip in supply. But consumers have nothing to worry while purchasing vegetables for Pongal festival,” said A. Balu, president of Vellore Town Nethaji Market Kaikari Vyabarigal Sangam.\n\nPeople buy pumpkin, yam, ‘mochaikai’, sweet potato and potato for Pongal, he said. A kilo of pumpkin cost Rs. 15, yam is Rs. 25-Rs. 30, ‘mochaikkai’ is Rs. 30, sweet potato is Rs. 25-Rs. 30 and potato is Rs. 20. From last week’s rate of Rs, 60, the price of tomato (a kilo) is now Rs. 40.\n\nThe roadsides of Long Bazaar have turned colourful with packets of “rangoli” powder being decked up at stalls.\n\nA packet of 100 grams of the colour powder costs Rs. 10. The sales will pick up today, a vendor said.\n\nVendors in the flower market said the prices continue to be affordable for the festival season.\n\nRopes and bells\n\nApart from this, colourful ropes and bells to decorate cows are also up for sale in Long Bazaar.", 
    "section": "national", 
    "title": "Harvest festival keep traders busy", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}