{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Justice V. Ramasubramanian of the Madras High Court at a ‘Pattimandram’ organised by Madurai Bench of Madras High Court Bar Association on Monday.— Photo: G. Moorthy\n\nMadurai Bench of Madras High Court Bar Association (MMBA) celebrated Pongal with a difference this year.\n\nThe association pitched two sets of lawyers against each other and made a senior judge resolve the dispute between them in a ‘Pattimandram’ held in the lawns on the court campus.\n\nClad in a white dhoti and a colourful angavastram, Justice V. Ramasubramanian patiently heard arguments advanced by advocates T.S. Mohammed Mohideen, P. Kalaiyarasi and G.V. Vairam Santosh on their stand that literary works were meant only for entertainment; and lawyers K. Swamidurai, M. Siddharthan and Gugaseela Rooban who contended that literary works were meant for enlightenment.\n\nIn his introductory remarks, the judge said that human beings generally lived by habits and so did animals. But what distinguished humans from animals was the former’s ability to appreciate and enjoy art.\n\nHe recalled that Russian author Maxim Gorky in his famous work ‘Mother’ had spoken about two youngsters – one lay down asleep on seashore and the other enjoyed the beauty of the waves.\n\n“Gorky wrote, the youngster, enjoying the waves, saw a ship sailing on the ocean and wondered how the proud works of man can impose their will upon elements. At the same time, the youngster lamented how by his own side was lying a man who himself was an element,” the judge said before calling upon the debating teams to present their points of view.\n\nDuring the heated debate which contained arguments and counter arguments covering a variety of subjects from ‘beep’ song to compositions of 15{+t}{+h}century saint-poet Arunagirinathar, the gathering broke into laughter.\n\nDig at lawyers\n\nThe lawns reverberated with thunderous applause when the judge, in his concluding remarks, said: “I am happy that the lawyers had prepared well at least today as against their usual practice.”\n\nHe recalled a poem penned by a young girl connecting Rosa Parks, Martin Luther King and Barack Obama, when Mr. Obama was elected as President of the USA.\n\n“The girl wrote: ‘Rosa sat, so Martin could walk. Martin walked, so Obama could run. Obama ran, so we could fly.’ This is the beauty of literature. It enlightens as well as entertains.\n\n“Robert Mugabe, President of Zimbabwe, once wrote: ‘Racism will never end as long as white cars are still using black tyres. Racism will never end as long as we wash white clothes first and coloured clothes later. Racism will never end as long as people use black to symbolise bad luck and white to peace. Racism will never end as long as people wear white clothes to weddings and black to funerals. Racism will never end as long as those who do not pay their bills are blacklisted and not whitelisted. But I wouldn’t bother as long as my toilet tissue is white and not black in colour’,” the judge said.\n\nHe concluded that the primary purpose of literature could only be enlightenment and that entertainment was only a tool to attract attention.", 
    "section": "national", 
    "title": "He delivers a different kind of judgment", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}