{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Repair work was done here just a year ago\n\nA view of the link canal that was damaged in the recent floods near Chettipedu, Poonamallee. — Photo: B. Jothi Ramalingam\n\nThe recent flood has caused severe damage to the link canal transporting the Krishna water from Poondi to Chembarambakkam reservoirs. Due to the heavy rain and also the increased quantity of water flowing in the canal, the concrete lining has been ripped apart.\n\nIt has been only one year since the State government had carried out repair work on the Krishna water canal, running parallel to Chennai- Bengaluru National Highway 4, to prevent loss of water. After its ongoing drive to remove encroachments along waterways, the Water Resources Department is now proposing to initiate repair work on channels that were damaged during the flood.\n\nOfficials of the Water Resource Department (WRD) said they were waiting for funds from the State government to repair the vulnerable portions of the 25-kilometre canal. They will be making an assessment of similar damages to reservoirs and surplus courses soon.\n\nMeanwhile, the department has also intensified its drive against encroachments along the Adyar river. On Wednesday, it started retrieving land measuring one acre that had obstructed free flow of water at Manapakkam near the Nandambakkam bridge across the river on Mount- Poonamallee Road.\n\nSources said they started the work in Nandambakkam based on the report of special monitoring officer of the State government. Once the work is completed, the width of the river will increase to 100 metres from the existing 80 metres. An unauthorised causeway providing access to airport runway was also recently demolished for obstructing the flow of water on the Adyar river near Gowl Bazaar.\n\nNearly 1,600 illegal buidings at Thideer Nagar, New Anusuya Mandapam, Athuma Nagar at Saidapet and MGR Nagar in Nandambakkam have been demolished so far. The department is enumerating encroachments in Dr. Radhakrishnan Nagar along Greenways Road and Thai Mookambigai Nagar, Shanthi Nagar and Quaid-e-milleth Nagar near Anakaputhur bridge, the sources added.", 
    "section": "national", 
    "title": "Krishna water canal damaged by floods", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}