{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The University of Madras on Wednesday finally revoked the suspension of six students after one of the boys climbed up the terrace of the centenary building and threatened to jump off and end his life if the authorities failed to review its decision.\n\nHigh drama was witnessed on the university campus in Chepauk after C. Rajkumar, studying in the final year of M.A. Political Science and Public Administration went up the terrace in the afternoon while classes were under way and announced that he would commit suicide if he and the other five students were not allowed to resume studies. This prompted fellow students to seek the intervention of the university’s Registrar.\n\nThe university had last year suspended the students including, three M.Phil degree pupils, since they had protested on the campus demanding basic amenities and a ban on sale of liquor in Tamil Nadu.\n\nOne of the suspended students T. Karmugil said they had approached the Madras High Court challenging their suspension earlier. “The court had ordered that we be allowed to attend classes but the university did not revoke our suspension and ignored our numerous representations. We are told that today is the last day in office for the incumbent Vice-Chancellor and if he does not revoke our suspension we will have to wait till his successor is appointed. We don’t know when that would happen,” she said. Though Vice Chancellor R. Thandavan’s tenure would end on January 17, the university would be closed for Pongal from Friday and hence Thursday was his last working day in office. Explaining the reason for his protest, Mr. Rajkumar said, “All we wanted is better amenities in the university and a ban on sale of liquor. We were penalised for this . The High Court chided the university authorities for suspending us. Yet the university did not allow us to write the exams.”", 
    "section": "national", 
    "title": "Madras varsity revokes suspension of 6 students", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}