{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Plan has projected a credit potential of Rs. 3,689.33 crore, 15 per cent more than that of 2015-16\n\nIn view of changes brought out by the Reserve Bank of India (RBI) in the classification of activities covered under priority sector lending, more attention was given to specific sectors. Bankers must help meet targets under each sector for holistic development of the district, speakers told the bankers at block level bankers’ meet held at Thirumarugal.\n\nS. Sivaramakrishnan, lead district manager, Indian Overseas Bank, said projections made in the Potential Linked Credit Plan for the district, prepared by the NABARD recently, under various Priority Sector Lending would give sufficient leads to bankers to channelise funds to increase the ground level credit flow in general and agricultural term lending in particular to accelerate the pace of capital formation in agriculture and allied sectors.\n\nThe plan document had taken into account the infrastructure facilities available and identified infrastructure as other support services required to achieve the full credit potential, he added.\n\nNABARD District Development Manager D Ganesh said the PLP had projected a credit potential of Rs. 3,689.33 crore which was 15 per cent more than that of 2015-16.\n\nThe plan envisaged a credit flow of Rs.3,101.27 crore to farm sector, of which crop loan accounts for Rs.2,331.36 crore and term loan for agriculture and allied activities was estimated at Rs.769.91 crore.\n\nAgriculture infrastructure sector was projected with a potential of Rs.139.62 crore, micro, small and medium enterprises another Rs.105.97 crore, export credit Rs.81.20 crore, education Rs.75.40 crore, housing Rs.71.32 crore and renewable energy Rs.29.09 crore.\n\nTo enhance the credit flow to small and marginal farmers and thereby enhance their income, the plan document had prepared an area based scheme for animal husbandry activities for six blocks in the district with a potential of Rs.7.70 crore.", 
    "section": "national", 
    "title": "Meet targets for development of district, bankers told", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}