{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "“All city buses are either SLF or classified as Express”\n\nTicket fares collected by Tamil Nadu State Transport Corporation (TNSTC) in Madurai has come under criticism with passengers alleging that the minimum fares in city buses were higher than in other districts.\n\nWhile minimum fares of Rs. 3 and Rs. 4 are charged in other districts, passengers complain that the minimum fare in Madurai is Rs. 5 in normal buses and even Rs. 9 in Semi Low Floor (SLF) buses.\n\n“Rs. 3 tickets are issued even in Chennai. Madurai seems to be the exception,” said P. Dalit Raja, who submitted a petition at the Collector’s office in this regard recently.\n\nA TNSTC official contacted Mr. Raja as his complaint was forwarded to the TNSTC. “The official told me that fares were set as per the type of services. However, he failed to explain why there was a disparity among districts.”\n\nA TNSTC conductor said that he had often faced complaints from passengers from neighbouring districts like Theni and Dindigul that the minimum fare here was higher.\n\nM. Muthupandian, a commuter, alleged that the minimum fares varied even among the same category of buses. “When I board an SLF bus from Mattuthavani and get down near Apollo hospitals, sometimes I am charged Rs. 7 and sometimes Rs. 9,” he said.\n\nV. Rajendran, Madurai division president of the TNSTC wing of Centre of Indian Trade Unions, said, “The trick is, in Madurai, all the buses are either SLF or classified as Express and a minimum fare of Rs. 7 (SLFs) or Rs. 5 (Express) is charged respectively. Buses operated as ordinary services are almost zero, unlike in other places.”\n\nAlleging that this was a strategy used by the TNSTC Madurai division to increase revenue, he said, “when the fundamental issue is reduced spending by the government, public cannot be overcharged to compensate for increased spending,” he added.\n\nAnother union functionary said that most of the SLF buses were operated in Madurai as other places like Tiruchi and Coimbatore had competition from private players. “People would prefer the cheaper private buses there instead of paying extra for SLF,” he said.\n\nBetter service\n\nAcknowledging that the minimum fares are higher in Madurai, S. Sampath from the TNSTC Staff Federation said that people should also compare the fares with those of share auto. In most places, share autos charged Rs. 10 as minimum fare. “At a time when there is stress on using public transport due to issues like pollution and climate change, people should not hesitate to pay a rupee or two extra to maintain better service,” he said.\n\nSenior officials from the TNSTC were unavailable for comment.", 
    "section": "national", 
    "title": "‘Minimum fare in Madurai TNSTC relatively higher’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}