{
    "author": [
        "R Sujatha"
    ], 
    "text": "In a departure from convention, the Tamil Nadu Open University will hold a meeting of its Syndicate on Thursday, the last working day of its Vice-Chancellor Chandrakantha Jayabalan.\n\nThe Syndicate members were informed by text message on Wednesday evening that the meeting would be held at 11 a.m on Thursday. “There was no indication of this meeting until the message. We have no information about the agenda either. But orally we were told that appointments for teaching positions will be coming up for approval,” said a Syndicate member.\n\n“It is unusual for a Vice-Chancellor to chair a syndicate meeting on her last day in office. This has come as a surprise,” the official added.\n\nA source in the university said the institution had issued advertisements in October 2015 for filling up 15 posts of assistant professors and associate professors. Between December 28 and 31 last, the interviews were conducted and appointments had been decided.\n\nThey require the Syndicate’s approval for issuing appointment orders.\n\nSyndicate meeting without agenda\n\nTNOU Registrar S. Vijayan, however, said that the Syndicate was meeting without any agenda on Thursday. “It is the last working day of the incumbent Vice-Chancellor and the Syndicate has to organise a farewell for her.\n\nThe Syndicate would also form the three-member convenor’s committee that would function in place of the Vice-Chancellor,” he said.\n\nConventionally universities form convenor committees after a Vice-Chancellor demits office to prevent them from influencing the committee’s functioning.\n\nThe University of Madras, where the Vice-Chancellor is demitting office shortly, is expected to form its convenor committee next week.\n\nProf. Vijayan, however, said the university was following the norms.", 
    "section": "national", 
    "title": "Outgoing TNOU V-C to chair Syndicate meet today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}