{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Even while the rest of the State continues to be reeling under tension following the Supreme Court staying the Centre’s notification lifting ban on jallikattu, authorities here are confronting an additional problem in the form of demand from the people to hold ‘eruthattam’ (bull chase), another banned event.\n\n‘Eruthattam’ is a common feature in temples in different parts of the State and it is organised as a form of thanksgiving to God. The villagers confirm that this event was organised without any break for about two centuries, till recently.\n\nThe eruthattam is a traditional festival of chasing the bulls. The villagers hold the rope tied to the nose of the bulls, on both sides. Later, they chase the bulls in the areas surrounding the temple.\n\nWhile jallikattu dealt with taming the animal, eruthattam is a game of chasing the bulls. With Pongal festival fast approaching, the officials held a meeting at the Omalur taluk office on Tuesday to inform the people about the ban on holding this event.\n\nJ. Megnath Reddy, Sub Collector, Mettur, who presided over the meeting of the local panchayat presidents and village heads, said that the ban on holding ‘eruthattam’ during Pongal continued in the district.\n\nAccording to the Supreme Court directive, eruthattam, and manju virattu could not be held in any part of the district. He called upon the people to extend full cooperation to the government authorities and desist from holding this event. The panchayat presidents and village heads said that ‘eruthattam’ was traditional practiced for decades together by farmers as a thanks giving event. It was ritual of taking the bulls which helped in ploughing activities around the local temples in the villages and pleaded for permission.\n\nWhen the officials stuck to their stand, the panchayat presidents including Kuppusamy (Periyeripatti), Thangaraj (Kottamettupatti), Chandramohan (Pannapatti), Arjunan, president of the Kaadayampatti town panchayat, and the village representatives staged a walk out from the meeting in protest.\n\nMr. Kuppusamy said that there was similarity between jallikattu and ‘eruthattam.’\n\nThe villagers take out the decorated bulls around the temple in the presence of villagers and offer worship. The officials should understand the sentiments of the people and accord permission for this event, he said. Even last year, the people of different villages sought permission for holding ‘eruthattam.’ They were informed about the Supreme Court’s guidelines for holding events involving animals.", 
    "section": "national", 
    "title": "Permission to hold ‘eruthattam’ too denied", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}