{
    "author": [
        "R Srikanth"
    ], 
    "text": "The Chennai City police have planned elaborate security arrangements ahead of ‘kaanum pongal’ on Sunday. The annual ‘kaanum pongal’ celebration attracts huge crowds to beaches, Children’s Park in Guindy and Vandalur Zoo, among other public places.\n\n“There were no heavy crowd as anticipated for the New Year revelry, but we are not taking any chances for ‘kaanum pongal.’ Installing temporary barricades, patrolling by the city’s Mounted Branch and operation of beach buggies have begun,” said a senior police officer. He added that policemen had been advised to initiate stern action against people who harassed women.\n\nThe City police are mobilising medical teams to provide first aid and have enlisted the support of fishermen who can help in the event of an emergency. Watchtowers and sound systems have been proposed to be installed on beaches to make announcements regarding missing people. Policemen will be deployed in large numbers at Palavakkam, Thiruvanmiyur and Besant Nagar. Police will keep a watch on the movement of repeat offenders, he said. More than 12,000 policemen would be on duty, assisted by Home Guards.\n\nTamil Nadu Fire and Rescue Services officials said more than 50 firemen from various fire stations, equipped with life jackets, would be deployed on the city’s beaches as part of accident-prevention measures.\n\nAt Vandaloor Zoo, an ambulance with a team of doctors and a fire tender will be in place to handle any emergency. Metropolitan Transport Corporation will operate nearly 200 services from various parts of the city.\n\nMore than 200 student volunteers of National Cadet Corps and National Service Scheme, from Madras Christian College, Vivekananda College, Balaji Polytechnic College, Tagore Engineering College and Loyola College, will assist. Additional water huts have been created on the zoo premises, said K.S.V.V.P. Reddy, Zoo Director.", 
    "section": "national", 
    "title": "Police step up security ahead of ‘kaanum pongal’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}