{
    "author": [
        "Imran Gowhar"
    ], 
    "text": "Allegedly stole Rs. 18 lakh from account of former NHPC chairman\n\nThe city Cyber Crime Police busted a phishing racket and arrested a gang of seven, led by the Deputy Manager of Axis Bank’s Peddapalli Branch in Karimnagar district of Telangana, who allegedly hacked bank accounts of customers and withdrew money from them.\n\nThe gang was tracked and arrested earlier this week, based on a complaint by Bengaluru-based S.R. Narasimhan, a retired Chairman and Managing Director of the National Hydroelectric Power Corporation (NHPC)), who lost Rs. 18,03,751.\n\nIn his complaint, Mr. Narasimhan alleged that the money was withdrawn from his Axis Bank savings account in 17 fraudulent transactions between December 4 and December 5, 2015. He suspected something amiss when his prepaid mobile phone connection was changed to a post-paid one by an unknown person using fake documents.\n\nOn learning about the removal of funds, he approached the police who registered a case under provisions of the Information Technology Act and the IPC. The police found that Gopikrishna Gopi, Deputy Manager at Axis Bank’s Peddapalli Branch, had provided the account details of customers in Karnataka, who were maintaining huge balances to his associates Ramana Ramada Reddy, Nageswara Reddy and Veerabrahmam Anand, who are not employed by the bank.\n\nA spokesperson for the bank said, “Axis Bank had identified an act of irregularity during its internal investigation and had accordingly lodged a complaint with the Bengaluru police. It is based on this complaint that the arrest has been made. The bank is fully cooperating with the police. There has been no loss to our customers.”\n\nHow they did it\n\nA senior police officer said that Nageswara Reddy and Veerabrahmam Anand obtained a duplicate SIM card of the complainant’s registered mobile number by submitting fake documents and changed the plan from pre-paid to post-paid. The duplicate SIM card was issued without proper verification, the officer said.\n\nThe suspects transferred the funds to different mobile numbers using mobile banking and Axis Bank’s digital wallet service ‘Lime Wallet’.\n\nCyber Crime police share information\n\nIt is suspected that this gang might be involved in several other cases registered across Karnataka, including Chikkamagaluru, Tumakuru, Mysuru and Bengaluru, in addition to various cities in Telangana, Andhra Pradesh, Tamil Nadu and other States. The Cyber Crime Police have shared information about the gang with their counterparts in other States. The police suspect the gang of targeting other banks too.\n\nPolice suspect culprits may be responsible for many such cases in several States", 
    "section": "national", 
    "title": "Private bank’s deputy manager arrested for phishing scam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}