{
    "author": [
        "S Ganesan"
    ], 
    "text": "Relief to growers who have suffered losses in the recent months due to fall in prices\n\nBanana prices, which had registered a steep fall over the past couple of months, have registered a sharp increase at the wholesale market in the City ahead of the Pongal festival, when demand normally peaks.\n\nThe hike in the prices of the fruit has come as a relief for banana growers who had complained of huge losses due to the fall in the prices in recent months.\n\nTraders at the Vazhakkai Mandi at the Gandhi Market in the city, one of the biggest wholesale market of the region, reported huge arrivals ahead of the harvest festival.\n\n“Normally we used to get around 15,000 to 20,000 bunches a day. Over the past couple of days, arrivals range at around 40,000 bunches a day,” said K.P. Palanivel, president, Plantain Traders Association of Gandhi Market.\n\nMr.Palanivel said that the price of poovan variety, which is in big demand for the festival, touched Rs.500 a bunch (top quality) at the auction held on Tuesday. The variety had fetched between Rs. 150 to Rs. 350 a bunch at the beginning of the month.\n\nTraders said the price of rasthali ranged between Rs. 100 to Rs. 400, karpooravali between Rs. 50 and Rs. 400 and Monthan between Rs. 100 and Rs. 350 a bunch.\n\nThe Tiruchi market gets supplies from across Tiruchi, Karur and Pudukottai districts. Over the past few days banana bunches were coming in large quantities from Theni and even Thoothukudi districts, Mr.Palanivel said. The fruits are sent to the retail markets in various parts of the State. The increase in prices has gladdened the hearts of banana growers too. “The price has started appreciating. Though it is not up to our expectations, the price rise has come as a big relief,” said A.Nagarajan, State president of the farmers wing of the Tamil Mannila Congress.\n\nMr.Nagarajan reiterated his demand for setting up a cold storage facility at the Gandhi Market for the benefit of farmers. However, traders were not so enthusiastic on the demand. Mr.Palanivel felt that the Horticulture Department and research agencies such as National Research Centre for Banana should first enlighten farmers and traders on how long could the fruits be preserved at the cold storage in bunches.\n\nTraders at the market have been demanding the establishment of a shed and better amenities at the Vazhakkai Mandi as the fruits are now being auctioned from an open space.\n\nMr. Nagarajan said the government should take steps to supply banana in the noon meal to protect farmers from price fluctuation.", 
    "section": "national", 
    "title": "Sharp increase in banana price", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}