{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "Raman (47) and his team were busy arranging dried earthen pots and another batch of men taking turns to fill the indigenously built kiln with thorny shrubs of ‘kattu karuvai’ for firing as they geared up to make the last batch of 1,000 odd Pongal pots on Tuesday.\n\nAs just three days were left for Pongal, the potters were busy firing the last consignment of ‘Pongal pots’ in three different sizes to make them available for marketing in time. “The making of Pongal pots, which began in October last, will draw to a close with this lot today,” M. Raman, who has been making pots since he was eight years old,, told The Hindu .\n\nHe had been in the profession for more than three decades and had never seen a drop in demand for Pongal pots, he said.\n\nThis year, thanks to good monsoon, there was a spurt in demand. They had already recorded sales of about 10,000 pots, K. Veluchamy, president of Manamadurai Pottery Workers’ Cooperative Cottage Industrial Society, said.\n\nUnlike in the past, when the potters transported Pongal pots to markets in Madurai and nearby districts, traders visited their place and procured them this time, he said. The society sold a ‘Pongal set,’ comprising three different sizes of pots, for Rs. 110 to the traders, he said.\n\nAlmost all households were engaged in pottery, but only five families, each comprising 10 to 15 members, were entrusted with the task of making\n\nPongal pots this year, he added. The 150-odd families in the small town were members of the society, which was established in 1946. It had a membership of 377 now, he added.\n\nPottery was a round-the-year work and the members of the society made different varieties according to the order received by the society, he said. Of late, there had been a good demand for kitchen ware, he said. Manamadurai pots, ‘meen kinnies’ and other kitchen ware were exported to Malaysia and some of the Gulf countries, he said.\n\nPlagued with dearth of labour and raw materials, especially clay, pottery was in the doldrums a couple of years ago, but it had recovered with the district administration coming forward to give permits for removing clay from the nearby ‘kanmais’ (waterbodies), he said.", 
    "section": "national", 
    "title": "Turn of prospects for potters with spurt in demand", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}