{
    "author": [], 
    "text": "(Continued from Page 1)\n\nThis factor has been incorporated into rehabilitation efforts as a result.\n\nSensitivity to low frequency sound is key for whales, as they use echolocation for orientation.\n\nInjury caused to one pilot whale could have implications for an entire pod, as these squid-eating creatures generally found in deeper tropical and sub-tropical waters across the world act in a gregarious manner and could fatally follow a sick individual to the shore as a group.\n\nIn a recent episode of mass stranding of 40 short-finned pilot whales recorded in Elizabeth Bay, North Andaman, in 2012, a research team of the Zoological Survey of India and the Ministry of Environment and Forests proposed several possible explanations - including an undersea earthquake of 4.7 Richter magnitude that could have sent out magnetic waves and disoriented them, causing them to change their navigational path.\n\nOther possible causes for the episode reported by the research team in Current Science three years ago are disorientation caused by unfamiliar territory that greeted the whales as they followed fast-moving dolphins, tidal currents, or powerful military sonar from ships off the Andamans that could have resulted in the stranding.\n\nWhat is emphasised by researchers is the need for closer scientific study of the 40 whale, dolphin and porpoise species found in the Indian Ocean in general and 25 species that occur in Indian territorial waters in particular.\n\nBefore the Thoothukudi episode, major short-finned pilot whale stranding episodes reported in the sub-continent involved several dozens in Kolkata (1852), a big school of 147 in Tamil Nadu (1973), and the 40 in the Andamans.\n\nThis protected species is also affected by intensive fishery methods such as trawling, gillnetting and use of long lines, leading to regulations on their use in North America.", 
    "section": "national", 
    "title": "Whales fatally disoriented by sound, magnetism?", 
    "subsection": "tamilnadu", 
    "date": "2016-01-14"
}