{
    "author": [
        "Praveen Paul Joseph"
    ], 
    "text": "A similar incident had taken place in 1973 when 147 of them were stranded\n\nWhales that were washed ashore being buried at Manapad coast in Tuticorin district, Tamil Nadu, on Tuesday.- Photo: N.Rajesh\n\nIn an unusual phenomenon, 45 dead, short-finned pilot whales were washed ashore between Kallamozhi and Manapad in Thoothukudi district on Tuesday. Of these, 37 were adults and eight were sub-adults.\n\nAs many as 36 whales, part of the group which survived the beaching, were rescued in a joint operation by several government agencies and pushed back to sea.\n\nMarine scientists working in the Gulf of Mannar Biosphere Reserve say that the short-finned pilot whales are deep water whales, diving up to 1,000 metres, who form stable matrilineal kinship groups. This particular group could have been stranded while in search of food, the favourite being squids.\n\nNot much is known about the species. In fact, the IUCN Red List of Threatened Species classifies it as ‘data deficient’.\n\nWhile there were rumours that the beaching could be due to climate change or pollution of the waters, the scientists said the group most probably followed an isolated whale and must have been stranded.\n\n“The stranding of these whales is rare. They don’t swim close to the coast,” says J.K. Patterson Edward, Director, Suganthi Devadason Marine Research Institute, Thoothukudi.\n\nHe recalled a similar incident on January 14, 1973 when 147 whales were stranded on the beach between Kulasekarapattinam and Manapad, almost the same location. They survived for a few days but later died.\n\nA team from Fisheries College and Research Institute (FC&RI), Thoothukudi, made observations on the water temperature, salinity and dissolved oxygen content of the inshore region, all of which were found to be normal.\n\n“These whales might have chased the prey in the intertidal areas during last phase of the high tide period [new moon day period] and later must have stranded because of the shallow depth created by receding tide, during which time they must have become disoriented,” says G. Sugumar, Dean, FC&RI.\n\n“The short-finned pilot whales use call dialects to communicate within the group. One of the animals could have been isolated after falling sick or in search of food. The other whales might have followed it and might have been stranded as they could not have communicated effectively within the group,” says M. Sakthivel, a scientist with the Central Marine Fisheries Research Institute, who specialises in cetaceans (marine mammals).\n\nA team of CMFRI officials is on its way to study the reasons.\n\nBy Tuesday night, the 36 surviving whales were pulled by boats into deep waters.\n\n“The whales were exposed for six to eight hours. The younger ones responded well. Only on Wednesday, we will come to know [if the whales will survive],” says Deepak Bilgi, Wildlife Warden, Gulf of Mannar Marine National Park.", 
    "section": "national", 
    "title": "81 whales washed ashore", 
    "subsection": "general", 
    "date": "2016-01-13"
}