{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "2,711 facilities to be linked to National Health Portal\n\nIn a move to introduce transparency in availability and disbursement of blood units, all blood banks in India have been asked to update realtime stock status in public domain.\n\nDirector-General of the National AIDS Control Organisation (NACO), N.S. Kang, has written to all 2,711 licensed blood banks in India, asking them to put data on the National Health Portal (NHP) website. “I have written to the blood banks recently. Nearly 200 banks are already doing this. The idea is ensure people have access to credible data,” Mr. Kang said.\n\nThe NHP site gives real- time data about blood and blood components at the State and the district level. As the data is updated every 48 hours, families looking for blood can use the web-enabled system, taking away the need to tapping into personal sources, social media platforms etc for blood. The e-Blood bank will enable electronic monitoring of blood collection, testing, storage and final use and even disposal. The app also will maintain a database of regular donors, in case of requirement.\n\nThe project was launched earlier this month after a pilot in Delhi and Mizoram during which the NACO found nearly 100 per cent reporting from blood banks in both States. According to the NACO data, out of the 2,760 blood banks in India, 2,711 are already on a digital platform. “We found that the model was scalable and could easily be replicated across the country. Further, this can be done within existing resources,” said a senior NACO official.\n\nFurther, with all the information online and readily available, the onus of procuring safe blood shifts from the individual to blood banks and will lead to even distribution and weed out professional donors and touts etc, the official added.\n\nAs of now, availability of whole blood/components from nearly 200 blood banks in Jammu & Kashmir,Gujarat, Rajasthan and Odisha are being reflected on the NHP app.", 
    "section": "national", 
    "title": "Blood banks asked to post stock data online", 
    "subsection": "general", 
    "date": "2016-01-13"
}