{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Indian industry has given a mixed response to the new guidelines approved by the Defence Acquisition Council (DAC) as part of the Defence Procurement Procedure (DPP) 2016. While some in the industry welcomed the greater role for the private sector and the focus on Micro, Small and Medium Enterprises (MSME), some major industry players seemed disappointed with the guidelines.\n\nThe DAC, headed by Defence Minister Manohar Parrikar, on Monday approved some key changes to the Defence Procurement Procedure while deferring decisions on other issues such as strategic partnerships and procedures for blacklisting companies.\n\n“Overall, the sense one gets from the announcement is that the government intended to push forward ‘Make in India’. However, one has to see the fine print. We will have to wait for the DPP to come out,” said Amit Cowshish, former Financial Advisor (Acquisition) in the Defence Ministry and Distinguished Fellow at the Institute for Defence Studies and Analysis.\n\nAnurag Garg, director of PwC’s strategy and defence vertical, said that the new DPP was significantly better off than the last DPP, given the positive shifts meant to ensure movement at a good pace by putting timelines of 24 months between the prototype developed and the Request For Proposal (RFP) stage.\n\n‘Protracted processes’\n\nHowever, the CEO of one of the largest private industrial groups of the country launched a scathing attack on the policy, stating that the DPP seemed to be the product of “babus and some retired babus,” and there was very little reflection of the problems faced by the industry. A senior executive of another Indian company concurred with it, stating, “The problem is not of new procedures. It is about processes. They are too protracted.”\n\nOn the other hand, there was a positive response to the proposed new category of Indigenous Design Development Manufacturing (IDDM) and government funding for design and development. “We welcome the IDDM category in the DPP as it will back companies like us who have proven competencies in indigenous design, development and manufacturing,” said Puneet Kaura, MD and CEO, Samtel Avionics.\n\nThe new guidelines have put a major focus on the MSME sector to stimulate domestic innovation. The DPP talks about creating a new category for MSMEs as well as funding of up to Rs.10 crore for design and development.\n\nG.Raj Narayan, Founder and MD, Radel Group, said the funding mechanism proposed for the MSMEs and the ranking system were excellent moves.", 
    "section": "national", 
    "title": "Bouquets, brickbats for new defence procurement norms", 
    "subsection": "general", 
    "date": "2016-01-13"
}