{
    "author": [
        "Veerendra P M"
    ], 
    "text": "Unlike Jallikattu and Kambala, no serious efforts have been made to regulate ‘Hori Bedarisuva Spardhe’, prevalent in Shivamogga and Haveri districts\n\nThe controversial bull sport of Jallikattu in Tamil Nadu is on hold for now with the Supreme Court on Tuesday issuing an interim stay on it. Closer home, a bull-taming event prevalent in Shivamogga and Haveri districts, known as ‘Hori Bedarisuva Spardhe’ (meaning “bull scaring event”), has been going on unchecked for a long time and is now a big money-spinner.\n\nThe sport, prevalent during the harvest season, shows scant regard for the safety of the participating humans and animals. Unlike Jallikattu and Kambala (involving buffaloes in coastal Karnataka region), there is no serious efforts to regulate ‘Hori Spardhe’ in any way.\n\nCasualties galore\n\nLess than a month ago, on December 20, 2015, Chandrashekhar Acharya, a farmer from Honnali taluk died of heart attack following a stampede at a bull-taming event near Hirekerur in Haveri district. In November 2014, two youths were killed when they were gored by a bull at an event held in Haramaghatta village in Shivamogga taluk. Three persons were badly injured in a similar incident in Ayanur village in November, 2015. Many other minor events have gone unreported.\n\nBulls of Hallikar and Amruthmahal breeds are brought for ‘Hori Bedarisuva Spardhe’ and decked-up. They are made to run around the ring as the people gathered raise slogans. The one who succeeds in stopping and taming the bull is declared the winner. Those who manage to snatch the garland of copras put around the neck of the bull are also offered consolation prices. The owners of bulls that reach the goal post are also honoured.\n\nNandish Churchigundi, a farmer from Shikaripur, told The Hindu that earlier bull-taming events, considered as a part of tradition, were held on Deepavali with the participation of local farmers. He underscored the need to regulate the event. “The Kambala is being held under strict legal monitoring in coastal Karnataka. It is necessary to evolve a similar legal monitoring mechanism to conduct bull-taming events to ensure the safety of the participants,” he said.\n\nAt present, more than 250 events are being held every year in Shivamogga district alone. It is necessary to enforce a ceiling on the number of events to ensure better monitoring, he added.\n\nGuidelines soon\n\nDeputy Commissioner of Shivamogga, V.P. Ikkeri, has said that the district administration would soon draw up strict guidelines for the conduct of bull-taming events. Taking prior permission from the police and local gram panchayat, arranging fodder and drinking water for the cattle, and taking safety precautions would be made mandatory, he said. “It is being proposed that these events will be videographed in the future,” he said.", 
    "section": "national", 
    "title": "Bull-taming event closer home goes on unchecked", 
    "subsection": "general", 
    "date": "2016-01-13"
}