{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "It protects the animals from cruelty, has prescribed safeguards, says Attorney-General\n\nThe Centre argues that jallikattu could not be compared to the bull-fights of Spain where the bulls or the humans die.\n\nOrdering an interim stay on a January 7 notification issued by the Centre allowing jallikattu, the Supreme Court on Tuesday issued notice to the Centre and the Tamil Nadu government to respond to a batch of petitions led by the Animal Welfare Board of India (AWBI) against the 2016 notification. Some of them have even sought contempt of court action against the Centre for ignoring the Supreme Court’s 2014 judgment.\n\nThe court has given them four weeks to file replies, well past the dates of the Pongal festival this week.\n\nThe day began with a Bench led by Chief Justice of India T.S. Thakur referring the petitions to a Bench of Justices Dipak Misra and N.V. Ramana. This was after Justice R. Banumathi, a puisne judge on the Chief Justice’s Bench, recused herself from the hearing.\n\nIt was Justice Banumathi, as a single judge on the Madurai Bench of the Madras High Court, who first banned jallikattu. That decision was set aside by the High Court’s Division Bench but was redeemed by the Supreme Court in 2014, concluding that the bull-taming sport inflicted inconceivable cruelty on animals.\n\nJustice Misra stopped hearing routine matters listed before him by 12.30 p.m. and called the specially listed jallikattu case for hearing in a crowded court room.\n\nThe session opened with senior advocate Aryama Sundaram appearing for the AWBI submitting that bulls could never be performing animals.\n\n“How can a notification override a judgment which says jallikattu is a clear violation of Sections 3 and 11 of the Prevention of Cruelty to Animals Act, 1960. Cruel treatment of bulls cannot be a matter for human festivity, especially in the 21st century,” Mr. Sundaram contended.\n\nAsked to respond to this, Attorney-General Mukul Rohatgi, appearing for the Centre, said it was true that bulls were being tortured prior to the 2014 Supreme Court ban.\n\n“But the 2014 judgment was talking about what was happening then. The Supreme Court was then dealing with jallikattu when bulls were tortured and ran around in frenzy like mad animals. Now look at our new notification... It protects the animals from cruelty, has prescribed safeguards... Also remember, My Lords, that it was us, and not this court, who stopped the cruelty shown to bulls for the first time in 2011 with our notification,” Mr. Rohatgi said.\n\nMr. Rohatgi argued that jallikattu could not be compared to the bull-fights of Spain “where either the bulls or the man dies.”\n\n“In jallikattu, if anyone dies, it is always the man and never the bull. Certain species of bulls are trained, fed, nourished for jallikattu alone. Certain breeds are meant to do certain things. If they don’t, they will die. Men tame the bulls bare-chested, bare-handed. We have with this notification tried to create a balance between animal rights and tradition and culture.”\n\nSenior counsel L. Nageshwar Rao, appearing for Tamil Nadu, submitted that the sport had been in vogue for centuries and any prohibition would dent Tamil culture. “Do not stop the festival. A stay will interfere with the right to practise religion and customs,” senior advocate Shekhar Naphade, also appearing for Tamil Nadu, said.\n\nBut the clinching words of senior advocate K.K.Venugopal, appearing for the Federation of Indian Animal Protection Organisations, finally prevailed. “You see, Your Lordships, the bull is a very placid domestic animal. Left alone in the jallikattu arena, they will walk from one end to the other looking for someone to give it a banana.”", 
    "section": "national", 
    "title": "Centre defends new notification", 
    "subsection": "general", 
    "date": "2016-01-13"
}