{
    "author": [
        "Devesh K"
    ], 
    "text": "The Enforcement Directorate (ED) has served a show-cause notice involving transactions worth hundreds of crores on Naresh Jain, alleged mastermind of a hawala racket, for suspected violation of foreign exchange rules.\n\nHe purportedly operated for over a decade from Dubai and was accused by the UAE and the Italian governments of laundering money for international drug trafficking syndicates.\n\nAccording to the ED, Mr. Jain is suspected to have violated the Foreign Exchange Management Act (FEMA) provisions. In the past, he has denied all charges against him stating that all the transactions were legitimate.\n\nAccording to enforcement agencies, the accused operated from Dubai from 1995 till 2009. In 2007, the Dubai’s Public Prosecution division had initiated a probe against him and at least seven other Indian nationals, a Pakistani and another suspect from Beirut for alleged illegal transfer of over 20,000 crore Dihram resulting from drugs and bribery crimes.\n\nThe accused was detained in Dubai for about six months. Investigations against him did not reach any conclusion. He later returned to India in 2008-09. The same year, the ED and the Narcotics Control Bureau conducted a joint operation against him for suspected links with drug traffickers.\n\nAccording to sources, Mr. Jain remained in Indian jail for about a year. In 2010, he was also booked under the Conservation of Foreign Exchange and Prevention of Smuggling Activities (COFEPOSA) Act for alleged laundering of international drug money.\n\nThe COFEPOSA charges were later quashed by the High Court.\n\nThe enforcement agencies suspected that Mr. Jain had got front companies set up to cover up fund transfers, which was denied by him.\n\nIn 2006, the Italian police conducted an operation against several entry operators and had alleged that several of them worked in association with Mr. Jain. They zeroed in on the suspects following leads that the alleged hawala network was being used by some Albanian narcotics traffickers operating out of Italy to park drug money.", 
    "section": "national", 
    "title": "ED issues notice to hawala ‘mastermind’", 
    "subsection": "general", 
    "date": "2016-01-13"
}