{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "A message said the video contained content from Saregama, which has blocked it on copyright grounds.\n\nMany who tried to listen to the iconic rendering of ‘Vishnu Sahasranamam’ by M.S. Subbulakshmi on YouTube in the Margazhi morning of Tuesday were in for a shock when they found several links blocked owing to copyrights claim by a recording company.\n\nComing as it has at the concluding part of the musician’s centenary celebrations, many took to social media to register their disappointment at the development.\n\n“Unable to listen to Vishnu Sahasranamam by Smt M.S.Subbulakshmi on YouTube today,” Sudha Umashanker said on Facebook.\n\nThe users found identical messages flashed on their screens when they tried to access links on YouTube to find the rendition. “This video contains content from Saregama, who has blocked it on copyright grounds,” the YouTube screen said.\n\nThis was not the first time Carnatic music has faced such a situation. In 2014, several videos containing kritis of saint Thyagaraja were blocked, leading to a furore.\n\nMusician Lalitha Ram, co-founder of the Parivadini network on YouTube, said when a copyright claim is made, the video hosting website’s algorithm compares content for similarities and blocks the videos. “So any similar-sounding music is taken as the claimed material and is blocked. This is what happened to Thyagaraja compositions like Entharo Mahanubhavulu,” he said.\n\nMr. Ram said the western concept of copyright should not be applied to Carnatic music given how the art form is practiced. “Take the case of Lalgudi Jayaraman. He composed so many thillanas. When others sung his pieces and recorded them, he did not sue them, instead he was happy. That is how Carnatic music functions,” he pointed out.\n\nMost of the compositions sung do not belong to the artists and have been continuously rendered for generations.\n\nKiruba Shankar, social media consultant and professor of digital marketing at Bharatidasan Institute of Management, said the logic behind blocking music content is the belief that the listeners would immediately go to the shop and buy the content if they cannot find it on YouTube.\n\n“This is absurd because in this digital age, it is not a big deal to find an alternative site to get the same content. Recording companies would be better off putting their content on social media as it widens the reach and opens up other revenue sources,” he said.\n\nIn 2014, YouTube said the platform allows uploaders to submit a counter notification, if they believe that their video was mistakenly removed because it was misidentified as infringing, or qualifies as a potential fair use.", 
    "section": "national", 
    "title": "Fans shocked as YouTube blocks MS’ Vishnu Sahasranamam", 
    "subsection": "general", 
    "date": "2016-01-13"
}