{
    "author": [], 
    "text": "A naturally occurring food preservative that grows on dairy products may be used to treat cancer and deadly, antibiotic-resistant bacteria, a new study has claimed.\n\nResearchers at the University of Michigan in US found that feeding rats a ‘nisin milkshake’ killed 70-80 per cent of head and neck tumour cells after nine weeks and extended survival.\n\nScientists studied nisin in cancerous tumours and as an antimicrobial to combat diseases of the mouth. After nine weeks of nisin treatment, tumours were comparable to tumours at three weeks.\n\nResearchers published positive results with less potent nisin, but the highly purified nisin ZP used in the present study nearly doubled its effectiveness.\n\nThe dosage of 800 mg/kg given to mice would translate to a pill a little bigger than a third of an Advil per kilogramme of body weight for people.\n\nNisin, a colourless, tasteless powder, is typically added to food at the rate of .25 to 37.5 mg/kg. Many foods contain nisin, but nowhere near the 800 mg/kg needed to kill cancer cells.\n\nSeveral products available to consumers also contain nisin creams and pharmaceuticals to fight infection and mastitis and a sanitiser in lactating cows. Nisin also fights deadly bacteria such as antibiotic-resistant MRSA (Methicillin-resistant Staphylococcus aureus).\n\n“To date, nobody had found bacteria from humans or living animals that is resistant to nisin,” said Yvonne Kapila, a professor at the University of Michigan School of Dentistry.\n\n“Another positive is that nisin has withstood the test of time,” she added.\n\nNisin is lethal to bacteria for two reasons — it binds to a static area of bacteria, which gives nisin the opportunity to work before bacteria changes into an antibiotic-resistant superbug, and nisin kills biofilms — colonies of bacteria that group together into a fortress that thwarts antibiotics. — PTI", 
    "section": "national", 
    "title": "Food preservative kills cancer cells, superbugs: study", 
    "subsection": "general", 
    "date": "2016-01-13"
}