{
    "author": [
        "Andrew Ross Sorkin"
    ], 
    "text": "Chris Hughes (left), who bought The New Republic in 2012, and Jeff Bezos, who acquired The Washington Post . Mr. Hughes, who is also the co-founder of Facebook, has put the century-old American magazine he acquired in 2012 up for sale. —file Photos\n\n“If you really care about an institution and want to make it strong for the ages, you don’t walk out. You roll up your sleeves, you redouble your commitment to those ideals in a changing world, and you fight.”\n\nThat’s what Chris Hughes, the 32-year-old billionaire Facebook co-founder, wrote just a little more than a year ago about The New Republic , the century-old magazine he acquired in 2012. On Monday, Hughes, said, in effect, “Nah, forget about all of that.”\n\nHe put the magazine up for sale, throwing up his hands in frustration. “I underestimated the difficulty of transitioning an old and traditional institution into a digital media company in today’s quickly evolving climate,” he wrote.\n\nWelcome to the age — and whimsy — of the new billionaire class and the precariousness of vanity projects. With so much money sloshing around, and more and more of the super-wealthy pushing into areas beyond their expertise, it is likely we will see more headlines about the failure of some of these fanciful investments and philanthropic experiments.\n\nJust over the weekend, the Russian billionaire, Mikhail Prokhorov, completed a major shake-up of the Brooklyn Nets, a team he bought five years ago that has struggled both on and off the court. It lost a reported $144 million last season.\n\nOf course, there have been success stories. Jeff Bezos, the founder of Amazon, bought The Washington Post , which so far has had success under his stewardship and he appears to be a long-term investor in the business.\n\nYet, some are learning as they go along. The Facebook chief executive, Mark Zuckerberg, recently pledged to give away his more than $40 billion fortune, but an early $100 million investment in the Newark, New Jersey, public school system was largely squandered.\n\nDov Seidman, the founder of LRN, a firm that advises companies on their cultures and how they can translate them into better performance, said earning gobs of money could often give billionaires a false sense of omniscience.\n\n“Sometimes if you create wealth and value quickly in one domain with one set of skills, however gifted and talented you are, it can give you the sense that you can apply it to any domain,” Mr. Seidman said.\n\nThat’s not to take away from some of the most successful philanthropists, like Bill Gates, a computer programmer who has spent the last two decades devoting himself to learning everything about polio and malaria, for example, and working toward eradicating them. (Though, in truth, he has wasted a lot of money on projects that didn’t work along the way.) Still, as more billionaires are minted amid a ferocious debate about inequality, and the super-wealthy continue to buy up trophy assets and seek to sway public policy, it has created a backlash and some are questioning whether they are amassing too much influence.\n\n“The mega-rich increasingly use their foundations and their celebrity as philanthropists to mould public policy to an extent not possible for other citizens,” Joanne Barkan, who has long been a critic of big philanthropy, wrote in The Guardian .\n\nIdealistic entrepreneurs\n\nThat may be especially true of the spate of new money coming out of Silicon Valley, which has created a generation of young, idealistic entrepreneurs who want to get involved in transforming businesses and institutions at early ages. There are some 40 men and women under the age of 40 who are worth at least a half-billion dollars, according to Forbes .\n\n“A lot of young people aren’t waiting their turn to lead,” Mr. Seidman said, suggesting that successful executives used to wait until retirement to try their hand at new projects.\n\nMr. Seidman added: “Their intent is going to get revealed. Are you deeply committed? How will you act when the path isn’t linear?”\n\nAnd praying for a wealthy benefactor to save a business is also a flawed business model. John Henry, the billionaire owner of the Boston Red Sox, bought The Boston Globe in 2013 from The New York Times .\n\nHe has invested in The Globe , though it continues to struggle amid challenges in the newspaper business. Last year, another round of layoffs hit the newsroom. For Mr. Hughes and The New Republic , that may be what happened. He seemed well-intentioned. He talked about reviving the publication and restoring its glory, and yes, even making it profitable. He sought to remake the magazine for a digital age. But in the process, much of his staff left the publication and today the business is worth less than when he started.\n\n“After investing a great deal of time, energy, and over $20 million, I have come to the conclusion that it is time for new leadership and vision at The New Republic ,” Mr. Hughes added. — New York Times News Service", 
    "section": "national", 
    "title": "For another billionaire buyer, success is no walk in the park", 
    "subsection": "general", 
    "date": "2016-01-13"
}