{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Lalu Prasad, Rashtriya Janata Dal chief and coalition partner in Bihar, is once again caught in a controversy with an official letter mentioning his directions to government health officials and doctors. The Opposition has charged Mr. Prasad with being a “Super Chief Minister” in the government headed by Chief Minister Nitish Kumar, issuing “unconstitutional and extra constitutional” instructions.\n\nA January 11, 2016, letter from the Civil Surgeon of Darbhanga, Sriram Singh, to the Superintendent of Darbhanga Medical College and Hospital (DMCH), mentions Mr Prasad as seeking the reinstatement of the Mamata health workers who were terminated. Mamata health workers are trained workers on contract, deputed at maternity wards of government hospitals. They are paid between Rs. 1,000 to Rs 3,000 per month.\n\nIn his letter, the Darbhanga CS has asked the DMCH Superintendent to take action on Mr. Prasad’s inquiries, made over the telephone, and apprise him of the follow-up “so that he could inform Mr Prasad about the action taken on it”. Mr. Singh also forwarded the letter to the Darbhanga District Magistrate, the State Health Director and the RJD chief.\n\nAsked about the official letter mentioning his name, the RJD chief told journalists: “Yes, I’d made the call and asked the officials why Mamata health workers were being removed from their jobs…They’re from lower castes and had met me with the request…When someone comes to meet me, should I throw them out?”\n\nIn defence\n\nMr. Prasad’s younger son, Tejaswi Yadav, who is also Deputy CM of the state, said: “He (Lalu Prasad) is leader of our party which is in government so he does this social work by meeting people …even the State BJP leaders were earlier inspecting railway projects.”\n\nJD(U) leader and spokesperson Neeraj Kumar also defended Mr Prasad and said there was nothing wrong in his intervention as the BJP leaders too had done such things earlier.\n\nOn January 3, Mr Prasad, whose elder son Tej Pratap is the State Health Minister, made a surprise inspection of a government hospital, the Indira Gandhi Institute of Medical Sciences (IGIMS), and is said to have instructed hospital officials and doctors.\n\nHowever, Opposition parties again charged Mr Prasad with acting like a “Super CM” . “This letter has proved once again that there are two CMs in Bihar today and Lalu Prasad ji is Super CM. If not, in what capacity has he been giving directions and instructions to the government officials?” asked State BJP leader Binod Narayan Jha.\n\n“Why is Nitish Kumar keeping mum over all this unconstitutional and extra-constitutional actions in the affairs of governance? Nitish Kumar should either resign or ask his officials not to follow Lalu Prasad’s directions,” said Jitan Ram Manjhi, former Chief Minister and chief of the Hindustani Awam Morcha (Secular).\n\nYes, I asked why workers were being removed from their jobs: RJD chief", 
    "section": "national", 
    "title": "Furore over Lalu Prasad’s ‘direction’ to health officials", 
    "subsection": "general", 
    "date": "2016-01-13"
}