{
    "author": [], 
    "text": "The weak index of industrial production (IIP) numbers, rising inflation and the overall GDP numbers are also leading to a situation where the government’s statistics are losing credibility, said Rajiv Kumar, Senior Fellow at the Centre for Policy Research.\n\n“The government must reconcile the GDP and IIP data. How can you have 7.5 per cent GDP growth while the IIP is like this and exports are consistently falling? For the first time, the credibility of the data is completely lost,” Mr. Kumar said, adding that it is perplexing why at a time when demand is contracting, consumer inflation is going up.\n\nThe contraction in November’s IIP comes after a 9.8 per cent growth in the index in October 2015. The contraction was mainly driven by a contraction in the manufacturing sector, of -4.4 per cent, the worst the sector has performed since October 2014, when it contracted -5.6 per cent.\n\nThe capital goods sector also saw a significant contraction on a usage basis, of -24.4 per cent in November 2015, compared with a growth of 16.1 per cent in October 2015.\n\nCore sectors had indicated a weakness in industrial output and the economy at large, when their output growth hit a 10-year low in November 2015, shrinking 1.3 per cent in the month, according to data released last fortnight.\n\n“The decline was expected because the base effect was not favourable and the core sector data also suggested poor demand. But nobody expected such a sharp decline. One of the reasons for that could be the Chennai floods because it is a big industrial area,” said D.K. Joshi, Chief Economist at Crisil.\n\nThe contraction in the IIP is owing to a very weak aggregate demand, mainly due to extremely weak global demand as shown by the negative growth in exports for the last 12 months or so, Mr. Srivastava added.\n\nOn a cumulative basis for 2015-16, however, the industrial output index remains in better shape than the previous year. “Cumulative IIP this year continues to be higher in comparison to last fiscal (at 3.9 per cent versus 2.5 per cent last year) signalling the industrial output will inch up in the current fiscal,” a Crisil note said.\n\nCore sectors indicate weakness in industrial output and economy\n\nat large", 
    "section": "national", 
    "title": "IIP shrinks by 3.2%, worst trough since October 2011", 
    "subsection": "general", 
    "date": "2016-01-13"
}