{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "With the BJP’s threat to disrupt Maharashtra’s biggest literary event looming large, author Shripal Sabnis on Tuesday publicly apologised for his remarks on Prime Minister Narendra Modi.\n\nWith barely two days to go for the 89th Akhil Bharatiya Marathi Sahitya Sammelan of which he is president, Dr. Sabnis withdrew his comments against Mr. Modi, at a press conference here.\n\n“I am sorry for any misunderstanding. I am aware that it is my responsibility as president to ensure that the event goes off smoothly. I thank the Prime Minister for his leadership and hope the meeting has his blessings. I again laud him for his courageous trip to Pakistan and the mention of Gautam Buddha and Mahatma Gandhi in his foreign policy speeches,” he said, reading out a letter he had sent to Mr. Modi, mentioning that the misunderstanding was created by “certain elements” in the State.\n\nDr. Sabnis’ statement marked a climb-down from his defiance of the ruling BJP, which filed a police complaint against him for allegedly attempting to “tarnish” Mr. Modi’s reputation.\n\nAt the time, the author had said he would not apologise “even if the BJP hanged him.”\n\n“There seems to be no remorse in Dr. Sabnis’ letter to the Prime Minister. He blames ‘certain’ elements for creating misunderstandings over his remarks. However, we hope there will be no more offending statements on his part during the literary gathering,” BJP spokesman Madhav Bhandari said. Last week, Dr. Sabnis called Mr. Modi “a man forever smeared with the taint of the 2002 Gujarat riots” and a Prime Minister “he would not endorse.”\n\nHe received many death threats, including one allegedly from Sanatan Sanstha, a fringe right-wing group. Then, the Pune police gave him protection. The BJP burned his effigy and threatened to prevent him from speaking at the event. Earlier, the Sahitya Sammelan committee rallied around Dr. Sabnis, deciding to pass a resolution against “tendencies to stifle freedom of speech in a democracy like India.”", 
    "section": "national", 
    "title": "Marathi author apologises for ‘anti-Modi’ remarks", 
    "subsection": "general", 
    "date": "2016-01-13"
}