{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Tamil Nadu Chief Minister Jayalalithaa’s reiteration that an ordinance be promulgated as a last-ditch attempt to allow the conduct of jallikattu in 2016 may be untenable in law.\n\nLegal experts say such an ordinance, if promulgated, would be seen as the legislature usurping judicial powers. Secondly, the ordinance would go against the very essence of the Supreme Court judgment and its conclusion that bulls are not performing animals.\n\nThey say that delegated legislations in the nature of ordinance have no validity if they violate the legislative intent of an existing statute on the same subject, passed by the Parliament and reinforced by the Supreme Court in a judgment.\n\nLegal experts point to the 2005 Supreme Court judgment in Sarbananda Sonowal versus Union of India , which bestows the right to any public-minded citizen to approach the highest judiciary under Article 32 of the Constitution if a law made by the legislature has a “disastrous effect.” An ordinance now in the jallikattu case may trigger a second litigation and further worsen the government’s stand in the highest court of the land\n\nIn the Dr. D.C. Wadhwa versus State of Bihar case, the Constitution Bench of the Supreme Court held that the Executive has no arbitrary right to promulgate ordinances. The apex court held that it is the right of every citizen to insist that he should be governed by laws made in accordance with the Constitution and not law made by the Executive in violation of the constitutional provisions.\n\nPromulgation of an ordinance now would also be seen as defeating the very basis of the 2014 Supreme Court judgment and Tuesday’s interim stay, both of which are based on the fact that jallikattu is “inherently cruel” and the very “nature” of bulls does not allow them to be categorised as performing animals.\n\nJustice K.S. Radhakrishnan’s judgment on May 7, 2014 holds that Section 3 of the Prevention of Cruelty to Animals Act 1960 gives no right to humans to inflict pain on the animals.\n\nIt would go against the very essence of SC verdict that bulls are not performing animals", 
    "section": "national", 
    "title": "Ordinance will amount to legislative overreach", 
    "subsection": "general", 
    "date": "2016-01-13"
}