{
    "author": [], 
    "text": "They were from Pakistani military, says Afghan province police chief\n\nAfghan security forces surround a house which is used by gunmen to attack the Indian Consulate at Mazar-e-Sharif in Afghanistan recently.— FILE PHOTO: AP\n\nPakistani military officers were involved in the attack on the Indian Consulate in Mazar-e-Sharif in which assailants attempted to storm the mission building, a senior Afghan police official said on Tuesday.\n\n“We saw with our own eyes and I can say 99 per cent that those attackers were from Pakistani military and used special tactics while conducting their operation,” Sayed Kamal Sadat, police chief of the Balkh province, said of the attack that took place last week.\n\nMr. Sadat said the attackers — officers from across the border — were well-trained military men who fought the Afghan security forces in the 25-hour siege.\n\n“The attackers were military personnel. They were educated and well prepared and had intelligence. They fought us and only by Allah’s grace were we able to control them and eliminate them,” Mr. Sadat was quoted as saying by Tolo News.\n\nThe police official said efforts were under way to track down, identify and detain those who assisted the attackers to gain access to the building that was opposite the Indian Consulate.\n\nAn intense gun battle between the security forces and the attackers took place outside the Indian Consulate in Mazar-e-Sharif after assailants attempted to storm the mission building on Jan. 3.\n\nThe standoff ended on the night of January 4 after the attackers, who entered the building opposite the Indian Consulate, were killed.\n\nOne police man also lost his life and nine others including three civilians were wounded in the incident.\n\nAs the Consulate came under attack, Indo-Tibetan Border Police guards deployed on the sentry post foiled their attempt by raining heavy fire on them. — PTI", 
    "section": "national", 
    "title": "‘Pak. officers involved in attack on Indian mission’", 
    "subsection": "general", 
    "date": "2016-01-13"
}