{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Former Gurdaspur SP, Salwinder Singh, who was allegedly abducted by terrorists involved in the Pathankot attack, arrives for questioning by the NIA in New Delhi on Tuesday.— PHOTO: PTI\n\nCentral intelligence agencies were unaware that the phones belonging to former Gurdaspur Superintendent of Police Salwinder Singh and his jeweller friend Rajesh Verma were in the custody of the terrorists till they dialled a Pakistani number already under the surveillance of agencies here using one of these phones.\n\nThe Punjab police did not inform the Central agencies about the snatched mobile phones that were later used by the terrorists to make calls to their handlers in Pakistan. It could have averted the delay in planning the operation at the Pathankot Air Force base, a top government official told The Hindu .\n\nThis delay or lapse is being viewed seriously by the Central government. “It was only after a call from an Indian number was made to the number under surveillance that we realised the enormity of the situation. Had we known about the snatched phones, they could have been put under surveillance immediately and the location could have been known since they had already reached the airbase, almost 24 hours before they struck,” said the official.\n\nThough Punjab Deputy Chief Minister Sukhbir Singh Badal said the Centre was informed around 7.30 a.m. on December 1 about the possible entry of terrorists into Gurdaspur, the official said the Centre was informed only around noon as the Punjab police, for the first few crucial hours, refused to believe Mr. Singh’s version because of his “colourful background.”\n\n“It is to be seen whether the delay was deliberate or not. It could also be the case that Salwinder Singh did not inform his counterparts about the snatched phones at all. All these aspects are being looked into. We had asked Punjab for a report, they are yet to get back to us,” said the official.\n\nThe terrorists had four phones with them, two belonging to Mr. Singh, one to Mr. Verma and a fourth belonging to taxi driver Ikagar Singh who was killed hours before the terrorists reached the airbase. Only one phone, that of Mr. Verma, was used to make the calls to Pakistan.\n\nA senior defence official said Mr. Singh, who was questioned for the second consecutive day by the NIA, was a likely accomplice in smuggling activities rampant across the international border. There is a strong possibility that he helped the terrorists thinking they were smugglers, one official said. There may also have been insider help for breaching the base.“We are not satisfied with the replies given by the SP. He is changing his statements too often,” said a Home Ministry official.", 
    "section": "national", 
    "title": "Punjab police ‘slip-up’ may have delayed Pathankot operations", 
    "subsection": "general", 
    "date": "2016-01-13"
}