{
    "author": [
        "Special Correspondent"
    ], 
    "text": "However, long-term study required to establish beedi as a causative factor\n\nBeedi, or hand-rolled tobacco, a known risk for cancers of the lung and oral cavity, could be a risk factor for gastric cancers as well, according to a study conducted by the Regional Cancer Centre (RCC).\n\nThe study, ‘Gastric cancer risk in relation to tobacco use and alcohol drinking in Kerala, India’, published in a recent issue of the World Journal of Gastroenterology , shows that the risk for gastric cancers increased with the number of beedis smoked and the duration of smoking.\n\nGiving out the results of the study here on Tuesday, Paul Sebastian, Director of RCC, and P. Jayalekshmi, cancer epidemiologist who heads the Karunagappally centre of RCC, said the preliminary results of the study showed a clear link between beedi smoking and gastric cancers.\n\nHowever, long-term epidemiological studies are required to firmly establish beedi smoking as one of the causative factors for gastric cancers.\n\nThe study, carried out in Karunagappally, Kollam, covered 65,553 men between the ages of 30 and 84 during the 1990-2009 period. It investigated the association of tobacco use, alcohol drinking and socio economic status with gastric cancer.\n\nBeedi smoking that started at 22 years of age or younger was shown to be significantly associated with a higher risk of gastric cancer.\n\nIn the present study, there was no increase in gastric cancer risk in current cigarette smokers; however, an increase in risk, although non-significant, was observed among former smokers. Helicobacter pylori ( H. pylori ) infection is the most important risk factor in gastric cancer and is known to trigger a sequence of pathological changes leading to it. Tobacco use and alcohol drinking can modify the risk of gastric cancer induced by H. pylori . The current study also suggested that beedi smoking increased the risk of H. pylori -related gastric cancer.\n\nThe study also found a strong association between gastric cancer incidence and occupational patterns. Of the 116 gastric cancers identified at the end of the study period in 2009, 51 were among farmers and fishermen, followed by 28 cases among those doing white-collar jobs.", 
    "section": "national", 
    "title": "Risk of gastric cancer higher among beedi smokers in Kerala, finds study", 
    "subsection": "general", 
    "date": "2016-01-13"
}