{
    "author": [
        "Radhkrishnan Kuttoor"
    ], 
    "text": "The Nair Service Society, the Akhila Bharatha Ayyappa Seva Sanghom, and Sabarimala Tantris (chief priests) have strongly opposed the idea of permitting women of all age groups entry to the Sabarimala Ayyappa Temple.\n\nResponding to the observations made by the Supreme Court, which questioned the logic behind barring women from entering the temple, NSS president P.N. Narendranathan Nair told The Hindu that “this is purely a matter concerning the unique custom and tradition followed at a pilgrim centre and hence a logical analysis has no relevance.”\n\nMr. Nair, a former District and Sessions Judge, said there was no ban on entry of girls up to the age of 10 and women above 50.\n\nMr. Nair said a democratically elected government and the judiciary were bound to protect such age-old custom and tradition. The government could even explore the possibility of protecting such custom and tradition through appropriate legislation, he said.\n\nHe said there were other places of worship such as mosques where women were not permitted and it was grossly inappropriate to question such custom and tradition.\n\n‘Matter of faith’\n\nABASS vice-president D. Vijayakumar said the judiciary was not supposed to interfere in matters relating to faith, custom and tradition prevailing in a place of worship.\n\nHe said the Sanghom had impleaded itself in the case, opposing the affidavit filed by the Kerala government that had favoured entry of women of all age groups to Sabarimala in 2008 itself.\n\nMr. Vijayakumar said women in the age group of 10 to 50 years could offer prayers at various other Ayyappa temples. Why should there be a conscious attempt to break the age-old custom at Sabarimala, he asked.\n\nHe said denial of entry for women in a specific age group was solely on the basis of certain ritualistic and tantric tradition. The ABASS would strongly oppose any move to hurt the sentiments of Ayyappa devotees, he said.\n\nKandararu Rajeevararu and Kandararu Mohanararu, who hold the right to perform tantric rites at Sabarimala, too are against the entry of women who have attained puberty to Sabarimala.\n\nThe Tantris said the idol installation at the temple was made treating the deity as a persistent bachelor.\n\nIt was the Kerala High Court which had, in 1983, said women between 10 and 50 years should not enter the temple, they added.\n\n‘Women between 10 and 50 can pray at other Ayyappa temples. Why break age-old custom?’", 
    "section": "national", 
    "title": "Sabarimala temple entry: govt. urged to protect tradition", 
    "subsection": "general", 
    "date": "2016-01-13"
}