{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "When Congress president Sonia Gandhi showed up at the All-India Institute of Medical Sciences (AIIMS) on Thursday last to condole with the family of J&K Chief Minister Mufti Muhammad Sayeed, there were at least some who speculated that politics had something to do with the visit.\n\nTwo days later, as suspense loomed large over government-formation in the State, Ms. Gandhi fuelled the speculation by arriving in Srinagar and meeting Mr. Sayeed’s grieving daughter Mehbooba Mufti, who is set to step into her father’s shoes.\n\nSources in the Congress, however, told The Hindu that the visit was linked to her January 7 visit to the AIIMS. As Ms. Gandhi was walking to the ICU where Mr. Sayeed breathed his last, she asked for Ms. Mehbooba. A PDP leader informed her that Ms. Mufti had gone to the J&K House at Prithviraj Road to fetch her luggage. Ms. Gandhi then waited for about 30 minutes.\n\n“Her gesture was appreciated and repeatedly discussed by the top PDP leadership,” a senior PDP leader said. “It was a personal touch, which never came from the BJP leadership.”\n\nUneasy ties\n\nA senior Congress leader told The Hindu that Ms. Gandhi knew that a “section” of the top PDP leadership was unhappy with the BJP leadership, particularly with Prime Minister Narendra Modi, who reportedly snubbed Mr. Sayeed in Srinagar last November over his suggestions on India-Pakistan ties.\n\n“Apart from visiting Srinagar to honour her father, I think Ms. Gandhi was also trying to read her [Ms. Mufti’s] mind,” he said.\n\nAlso, the entire PDP leadership, including Ms. Mufti, resented the fact that Mr. Modi did not visit Mr. Sayeed when he was battling for his life in the hospital.\n\n“This is bothering Ms. Mufti. She feels her father did not get the respect he deserved from the Prime Minister; he was a Chief Minister, fighting for his life, and no one came to see him,” another PDP leader said.\n\nIt is quite likely now that Ms. Mufti will stick with the BJP and form a new government in the State. “We must remember that her father meant everything to her. She never went against his decisions even though they had the potential to hurt us politically,” the PDP leader said.\n\n“But in the end, the way the BJP treated Mr. Sayeed will be hard for her to forget,” he said.", 
    "section": "national", 
    "title": "‘She felt her father did not get the respect he deserved from PM’", 
    "subsection": "general", 
    "date": "2016-01-13"
}