{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Mehbooba Mufti has no time to receive suggestions from party colleagues, says PDP leader.\n\nHopes of a quick resolution to the government formation woes in Jammu and Kashmir receded on Tuesday, with both partners in the ruling coalition — the Peoples Democratic Party (PDP) and the Bharatiya Janata Party — refusing to commit to a timetable.\n\nBoth parties seemed to tread cautiously in the sensitive State, witnessing militancy and separatism.\n\nThe confusion in the PDP became evident when its chief spokesman Mehboob Beg set a timeline for government formation in the morning only for it to be retracted by senior party leaders later in the day.\n\n“PDP patron [late Mufti Muhammad Sayeed] worked hard and came up with a vision document, Agenda of Alliance, which will remain the guiding force once the coalition resumes functioning. I expect the coalition to form the government soon after the State mourning ends tomorrow [Wednesday],” Mr. Beg told the media in Srinagar in the morning.\n\nHowever, immediately after this statement, PDP president Mehbooba Mufti directed the party leaders “to wait for her statement”, said party sources.\n\nSpeaking to The Hindu , PDP legislator Nayeem Akhtar said no time frame could be firmed up. “It’s not about the date but about the state of mind. Please respect Mehbooba ji ’s right to privacy at this point in time. There is no timeline finalised so far. Mehbooba ji will take the final call and we all will wait for her,” he said.\n\nMr. Akhtar said there was no internal discussion on the government formation so far. “We haven’t even approached her [Mehbooba] and she has no time to receive suggestions from party colleagues. The process is yet to start,” he said.\n\nIn Jammu, BJP national general secretary Ram Madhav, a key player in the BJP-PDP alliance presided over a meeting of BJP legislators, the first since Governor’s rule was announced.\n\nThe meeting was held at the residence of Nirmal Singh, who was a Deputy CM in the PDP-BJP Cabinet.\n\n“Let the PDP reveal its cards first. We will respond accordingly,” said BJP in-charge of Kashmir affairs Avinash Rai Khanna. BJP State president Sat Sharma added that “a government will be formed soon. There are no issues as such.”\n\nSources said most BJP legislators stressed the need to have a government in place quickly. There was also unanimity on Ms. Mufti taking over as Chief Minister.", 
    "section": "national", 
    "title": "Stalemate continues in J&K; no time frame, says PDP", 
    "subsection": "general", 
    "date": "2016-01-13"
}