{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Club says park and racing can coexist while activists term the idea impractical\n\nYuva Sena chief Aaditya Thackeray on Tuesday reiterated parent party Shiv Sena’s three-year-old demand of turning Mumbai’s iconic Mahalaxmi race course into ‘Mumbai Park,’ on a par with gardens in major cities of the world. Mr. Thackeray met Maharashtra Chief Minister Devendra Fadnavis with the demand.\n\nThe 226-acre race course at Worli in the heart of Mumbai has been hosting horse races since 1883. Over the years, it has become both a magnet and a muse for Mumbaikars, with many, not just race lovers, from across the city descending on the oval-shaped, sea-facing expanse of green.\n\nThe race course is open to the public till 10 a.m. and later in the day from 4 to 7 p.m., even during the race season between November and April. It is closed during afternoon on race days.\n\nThe lease of the Royal Western India Turf Club (RWITC) lapsed in May 2013, when the Sena first raised the demand to shift the race course out of Mumbai and set up a garden there. The then Congress-Nationalist Congress Party (NCP) government kept the matter pending but did not renew the lease either. With the civic elections round the corner, the party has raised the issue again.\n\nOf the total race course area, two-third is with the government, while one-third is owned by the Brihanmumbai Municipal Corporation (BMC).\n\n“It’s 226 acres of green patch that is lying unused, except for a few horse races [that are held here]. Since the lease is over, the government can easily move it out of Mumbai and relocate it at a much bigger place, somewhere in Navi Mumbai or Raigad. This can be converted in to a green park,” said Mr. Thackeray, after meeting Mr. Fadnavis.\n\nHe added that the government could even hold an international competition inviting designs for the park, which can be named Mumbai Park and remain open for the public 24 hours. The Sena had even prepared a presentation to develop it into a park.\n\nVivek Jain, former Chairman of the RWITC, told The Hindu that the club had made several representations to the past and present governments to renew the lease. “This is a genuine green lung of the city. We have said earlier that a park and horse racing can coexist here. Except for the racing days, the race course is always open to the public,” said Mr. Jain.\n\nAccording to Mr. Jain, the club pays around Rs 50 crore a year to the government through taxes on betting, entertainment and also for licences, ground rent and water charge.\n\n“The government gives us a licence every year to hold races. From the very fact that we get permissions from the government, it is clear that we are not doing any illegal activity,” he said.\n\nHe said he had held a meeting with the Chief Minister and interacted with Sena chief Uddhav Thackeray over the matter.\n\n(With inputs from Rahi Gaikwad)", 
    "section": "national", 
    "title": "Turn race course into park, Shiv Sena demands again", 
    "subsection": "general", 
    "date": "2016-01-13"
}