{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The next 10 days are crucial for the growth of the crop.\n\nWheat farmers in the country’s central and northern States have a reason to worry as the weather department sees the ongoing unusual warm temperature and the dry season to continue for at least next 7 to 10 days — a time critical for this winter crop’s growth.\n\nAgriculture experts and farmers told The Hindu that if the temperatures did not drop soon and the dry weather conditions continued, wheat yield would be hit adversely.\n\nRakesh Bains, a farmer in Haryana’s Kurukshetra, who has sown wheat in over five acres said if there was no change in weather wheat grain would not develop.\n\n“We are set to suffer another loss it seems. After cotton crop failure and losses due to basmati rice price crash in the last kharif season, we were pinning our hopes on a good harvest from wheat, but it looks like the crop could fail and our miseries will continue,” said Mr. Bains.\n\nMinimum temperatures have been hovering above 2 to 4 degree Celsius above normal at many places in parts of Madhya Pradesh, Punjab, Uttar Pradesh, Rajasthan and Haryana during the past few days and are expected to continue to be a little higher than usual for the next few days, according to the India Meteorological Department (IMD).\n\n“It will be mostly dry weather prevailing during the next 7 to 10 days across the northern region and parts of central Indian States,” said B.P Yadav, weather official at IMD.\n\nYield may be hit\n\n“Currently temperatures are on the higher side and wheat needs cold conditions to thrive. It’s a crucial period for the crop and if temperatures continue to remain high there would be definitely a yield loss,” said P.S Rangi, agriculture expert, adding that rain was also required at this moment.", 
    "section": "national", 
    "title": "Unusual warm weather worries wheat growers", 
    "subsection": "general", 
    "date": "2016-01-13"
}