{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "A reshuffle of All India Congress Committee (AICC) office-bearers is likely after party vice-president Rahul Gandhi returns here from his European trip on January 8.\n\nSpeculation about the reshuffle, expected to be packed with Mr. Gandhi’s choices from the younger crowd in the party, has been on since he carried out an extensive interview process in which he met some 200 party leaders.\n\nThe exercise is likely to be scheduled around the second or third week of January.\n\nA senior leader confirming the move said the restructuring of the organisation had been on the cards for a while and the party was just waiting for the return of Mr. Gandhi and senior leader Ahmed Patel to Delhi.\n\nApart from the organisational reshuffle, there is speculation about Mr. Gandhi’s ascension to the party president’s post, replacing his mother, Sonia Gandhi. “The reshuffle in the party rank and file is a clear indication that Mr. Gandhi wants to fill the key positions with his own men and possibly ready to take on the top job,” said a senior leader of the party.\n\n“It will be a balanced reshuffle and the administration will be evenly divided between the old and new leaders,” he said.\n\nParty sources said Mr. Gandhi was desirous of holding internal elections for AICC posts and those of the Congress Working Committee (CWC), a suggestion that has been discouraged by several senior leaders in the past.\n\nThe CWC has not held internal elections for about two decades. And Mr. Gandhi, sources said, is strongly advocating having one. Senior leaders fear that democratising the senior guard may dilute the authority of the high command. Mr. Gandhi’s experiment in holding direct elections for posts in the Youth Congress were not exactly a success, neither were the “primaries” that he held for selection of candidates for the 2014 Lok Sabha polls.", 
    "section": "national", 
    "title": "AICC reshuffle likely after Rahul’s return", 
    "subsection": "general", 
    "date": "2016-01-02"
}