{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Centre reluctant to bulldoze through SC verdict\n\nYouth trying to tame a raging bull, during Jallikattu event held at Sakkudi village near Madurai district, Tamil Nadu on Saturday. —Photo: S. James\n\nHaving gone ahead and promised the people of Tamil Nadu the revival of jallikattu as a new year gift, the BJP now finds itself in a soup. The Animal Welfare Board of India (AWBI) has hit out at Union Environment Minister Prakash Javadekar for his remarks promising to bring back the bullfighting sport and advised the Centre not to indulge in any such move.\n\nParty sources said the Centre is now reluctant to bulldoze through the 2014 Supreme Court verdict, which upheld the ban on using bulls as performing animals and said jallikattu was inherently cruel to animals.\n\nAccording to a senior leader, it was first proposed to issue an ordinance to revive the sport, considered by a few communities in southern Tamil Nadu as part of their culture.\n\n“But legal inputs clearly suggested that this might not be a simple task. This is why the ordinance was not placed before the Cabinet this week,” the leader said.\n\nWhile the Supreme Court’s view in the matter is seen as the biggest deterrent to bring back the sport held during the harvest festival of Pongal, the AWBI’s direct intervention, made after a complaint from People for Ethical Treatment of Animals (PETA), has made it a sticky political one.\n\nIn a letter to the Ministry of Environment and Forests late Thursday, the board said by mere participation in such events, the animals were being subjected to cruelty. Therefore, it advised the Ministry to restrain from going against the Spreme Court verdict.\n\nFor the BJP, backtracking on jallikattu may prove costly since it was the party that drummed up the issue a month ago with an eye on votes from southern districts.\n\nThe party source added that a last-ditch effort to push for its revival was still on.\n\n“As the matter currently stands, even if the Centre approves, we expect the decision to be challenged before the Supreme Court. There is also a chance that it might be stayed. But the very act of giving clearance for the sport will be a face saver for the BJP,” the leader said.\n\nAll major political leaders, including Chief Minister Jayalalithaa and DMK president M. Karunanidhi, have demanded the revival of jallikattu.\n\nBJP positive\n\nReacting to the developments, BJP national secretary H. Raja said the Centre had the powers to overrule the Board’s position. “Even an ordinance is not necessary. A mere executive order would do. The order will come before Pongal,” he asserted.", 
    "section": "national", 
    "title": "BJP in soup as Animal Welfare Board opposes revival of jallikattu", 
    "subsection": "general", 
    "date": "2016-01-02"
}