{
    "author": [
        "Special Correspondent"
    ], 
    "text": "People hurling stones at the security forces during a protest in Pulwama district of south Kashmir on Friday.- Photo: Nissar Ahmad\n\nSeveral youths were injured in south Kashmir on Friday as security forces broke up a group of youths who tried to raise a memorial for the slain militants, including Lashkar-e-Toiba commander Abu Qasim.\n\nEyewitnesses told The Hindu that some youths gathered in Pulwama district after Friday prayers and started marching towards the city centre to erect a memorial for the militants killed in 2015. The security forces chased them away. From three sides, the protesters hurled stones at the security forces, who fired pellet guns and tear-gas shells.\n\n“Youths received pellets in limbs and abdomen,” an eyewitness said on the phone. However, there was no official confirmation.\n\nLarge parts of Pulwama shut down against the killing of two militants, including a local, in a gunfight on Wednesday night. Hurriyat faction chairman Syed Ali Geelani had called upon his supporters to register their protest after Friday prayers against the killing of civilians by Village Defence Committee members.\n\nTension prevailed in the old parts of Srinagar when youths clashed with the security forces. They unfurled the flags of Pakistan and the Islamic State (IS) near the Jamia Masjid, a bastion of Hurriyat leader Mirwaiz Umar Farooq. Scores of youths, including minors, threw stones at the security forces, who responded with pepper grenades and tear-gas shells.\n\nEarlier, in his sermon, the Mirwaiz hoped 2016 would foster an atmosphere of better relations between India and Pakistan. “The two nuclear-powered neighbours have no other option but to find a long-lasting solution to the Kashmir issue. This issue and not Siachen, Sir Creek or trade and travel, that has kept peace in South Asia hostage for the past seven decades,” he said.", 
    "section": "national", 
    "title": "Clashes erupt in Pulwama over ‘memorial’ for slain militants", 
    "subsection": "general", 
    "date": "2016-01-02"
}