{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Globally, India lags behind in productivity of most crops and it is of utmost importance that the productivity per hectare is raised urgently to pull out farmers from poverty, Union Agriculture Minister Radha Mohan Singh said on Friday.\n\n“Productivity and production could not be improved till the quality of land improves. Therefore, improving soil health is one of the most important issues in agriculture especially in irrigated areas where extensive use of urea has resulted in deterioration in soil health,” he told a press conference here.\n\nImproving soil\n\nCentre had been emphasising on improving the health of soil by integrated nutrient management and had announced a programme of collection of soil samples, conduct analysis and issuance of soil health card in a time bound manner.\n\n“Many of our farmers are not able to get the optimal yields from their fields, as they are not aware of the soil conditions. Our goal is to communicate benefits of soil health to the farmers so that they can apply appropriate dosage of fertilisers to increase productivity and profitability,” said Mr. Radha Mohan.\n\nHealth cards\n\nHe said the government decided to provide soil health cards to 14 crore farmers of the country.\n\n“Five crore farmers will be provided these card in 2015-16 and remaining farmers will be given the cards in 2016-17,” he said pointing out that under the Soil Health Card Scheme Rs. 109 crore have been released till December 2015.\n\nThe Minister said the national e-Market will be launched by March 2016 under the National Agriculture Market Scheme (NAM).\n\n“As many as 20 States have expressed interest in linking their markets (mandis). While 200 mandis will be connected by September 2016, another 200 mandis will be connected by March 2017,” he said.", 
    "section": "national", 
    "title": "‘Enhancing crop productivity vital’", 
    "subsection": "general", 
    "date": "2016-01-02"
}