{
    "author": [], 
    "text": "Anita Nair has a new recipe – Alphabet Soup for Lovers. The author’s latest work is generously garnished with references from the kitchen\n\nAnita Nair ’s latest book, Alphabet Soup for Lovers , is very different from her sweeping historical saga, Idris , and her police procedural featuring Inspector Gowda, Cut Like Wound. The book follows Lena whose placid life on a tea plantation in the Anamalai Hills is turned upside down with the arrival of the south Indian superstar Shoola Pani. The love between the movie star and memsahib is told partially through the eyes of Lena’s cook and general factotum, Komathi, as she learns the English alphabet through similar-sounding ingredients. The 49-year-old Bengaluru-based author speaks to Mini Anthikad-Chhibber about cooking, the magic of a ball of fur and the nature of love. Excerpts.\n\nThe last time we spoke you said you were following up Idris with a Gowda sequel. How did Alphabet Soup come about?\n\nI was working on the Gowda sequel and it is a very bleak subject. So when my Italian publisher wanted me to write him a food-based short story, I was quite relieved to take a break and write about something else.\n\nHowever, since I cannot, or will not, write to order, I decided I was going to write a short novel on love built on a food-based architecture. I think I wrote this book to heal the battering my emotions had taken while researching Gowda 2.\n\nHow did you hit upon Shoola Pani’s name?\n\nI couldn’t find a name that appealed to me for a while and worked with a proxy name. However, the character refused to come into his own.\n\nThen I went to the home of one of my team members, Nithin, in Kerala. I met his father, a lovely man, and on our way back, I asked my colleague his father’s name.\n\nWhen he said Shoola Pani, I knew I had found the name I was seeking. It is a synonym for Shiva — the bearer of the Shoolam . Shiva isn’t an easily approachable deity; he is known to have a temper — all of which was a perfect personality fit for my hero.\n\nThe structure of the book is interesting and tasty…\n\nI love food — to look at; to buy and cook; to eat; to serve; to read and write about. So when I was commissioned to write a food narrative, I thought I needed to find something to hinge my story of food and love on. And as Lewis Caroll writes in Alice in Wonderland , I thought I would ‘begin at the beginning and go on till I come to the end: then stop.’ So I went to the alphabet and found both a literary conceit and a structural device.\n\nDo you follow recipe books or just throw things together to create a stunning dish?\n\nI am very interested in food. And I do enjoy cooking. Most days I cook one dish. And I am a great believer of recipe books; however, common sense is just as important an ingredient. And yes, once in a while I do create my own dishes.\n\nDid you have any difficulty in getting an ingredient for a particular alphabet?\n\nNo, it happened quite organically.\n\nI have great faith in my subconscious mind and how it distils large tracts of information to land on exactly what is appropriate and right.\n\nWhich was your favourite ingredient/alphabet? Which was your least favourite one?\n\nI think my favourite ingredient is F for filter Kaapi. I love all the ingredients; so don’t have one that I dislike. But I did hit an impasse with X and that’s when I came with what X represents.\n\nWhich is the main love story? Komathi and the terrible tragedy of her Rayar or Lena and Shoola Pani?\n\nThe way I saw it, both love stories are equally important — Komathi’s is about love squandered and Lena’s about new possibilities. One plays off the other; one contrasts with the other.\n\nWho has done the lovely illustrations? What was your brief to the illustrator?\n\nPinaki De has drawn the illustrations. The design team at HarperCollins briefed him; I just added my comments at the end to fine-tune it.\n\nYou have mentioned the importance of a white ball of fur with a tail for the magic of writing...\n\nIn the days before I began writing Alphabet Soup for Lovers , my friend Jayapriya Vasudevan moved from Nairobi to Bangalore. So while they were getting their house in order, their dog, Jojo, came to stay with me. Jojo would insist on sitting on my lap as I wrote and somehow with someone as gorgeous and as loving as Jojo who turned around to lick my face every few minutes, it was inevitable that the magic of his presence would seep into my writing.\n\nHer book, set in a tea plantation in the Anamalai hills, talks about the nature of love", 
    "section": "national", 
    "title": "Food as a metaphor", 
    "subsection": "general", 
    "date": "2016-01-02"
}