{
    "author": [], 
    "text": "Ahead of the 2017 Assembly polls, Punjab Congress chief Amarinder Singh said on Friday free Wi-Fi connectivity would be provided in State educational institutions if his party forms the government.\n\n“Free Wi-Fi zones will be set up where students can have free Internet access within the campus”, he said.\n\nBesides, teachers in government-run schools will be provided better facilities and their postings would be in their native place or nearest to it.\n\nInteracting with a group of students and teachers who had come to greet him on the occasion of the New Year at his residence, Capt. Singh said he understands the importance of Internet connectivity in dissemination of knowledge. An educational institution, whether a school, college or a university without free and unhindered Internet access to the students in modern days is incomplete”, he said, while emphasising the importance of internet in education.\n\nThe PCC president said it was part of his overall plan to revamp and overhaul education system in the State.\n\nHe also expressed concern over “poor results” in government schools. “Our teachers in the government schools are well-qualified and hardworking and still the results are not good”, he claimed, adding, he will be meeting the teachers to seek their views on this matter.\n\nThe former Punjab chief minister said while improving infrastructure in the government-run educational institutions, opinion of teachers would also be sought. Besides, their working condition will also be improved.\n\nHe agreed with a suggestion that the teachers should be posted within a particular radius of their home and there must not be any favouritism or vindictiveness in posting of the teachers. “Ideally a teacher must not be posted very far from the school, he or she is working at, and we will try to work out a system where teachers feel happy and satisfied at the place of their posting and they focus all their energies on educating the students”, he said. – PTI", 
    "section": "national", 
    "title": "If we win, will provide free Wi-Fi in institutions: Amarinder", 
    "subsection": "general", 
    "date": "2016-01-02"
}