{
    "author": [
        "Mithosh Joseph"
    ], 
    "text": "‘Kiss on the Streets,’ a protest event planned by the little-known Njattuvela Cultural Forum Against Fascism on New Year day, ended in an open street fight with activists of the radical Hindu outfit Hanuman Sena in Kozhikode on Friday.\n\nThe police arrested 15 Njattuvela activists, including six women, and 16 Hanuman Sena workers, from the venue near the District Library. They were booked under Sections 147 (rioting), 160 (punishment for committing affray) and 353 (assault or criminal force to deter a public servant from discharge of his duty) of the Indian Penal Code. According to Njattuvela workers, the protest was planned as a sequel to its campaigns against “Brahminical hegemony and the caste system.”\n\nHowever, its secretary Swapnesh Babu had earlier said the event would also help youngsters “declare the status of their relationships and their decision to live together.”\n\nIntent on preventing the event, Hanuman Sena workers had camped from early in the day at the venue. As soon as the Njattuvela workers arrived, the former surrounded and allegedly attacked them, which the latter countered with nailed sticks and wood pieces.\n\nTension prevailed in the area for around two hours as the two groups beat up each other and more people started converging on the spot.\n\nThe police resorted to lathi-charge and hauled up 31 people belonging to both sides.\n\nJournalist held\n\nP.A. Aneeb, a journalist with the Thejas daily, was also taken into police custody after he was allegedly spotted amid the ‘Njattuvela’ workers who tried to manhandle the police. The journalist, who was later admitted to the Government General Hospital in Kozhikode, alleged that he was beaten up by the town police for his attempt to save a physically challenged man who was roughed up by the police.\n\nCity Police Commissioner P.A. Valsan said the police intervened as the fight was getting out of hand. “We did not arrest anybody for being just part of the ‘Kiss on the Street’ protest,” he said. Speaking to The Hindu on phone, Mr. Valsan also clarified that the journalist was arrested for assaulting a policeman.\n\nActivists of Njattuvela and Hanuman Sena confront one another; police resort to lathi-charge", 
    "section": "national", 
    "title": "Kozhikode protest turns ugly", 
    "subsection": "general", 
    "date": "2016-01-02"
}