{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "For the first time in its 102-year-old history of hosting flower shows, Lalbagh Botanical Gardens will have a national flower show in January as a dozen States are expected to participate in the Republic Day flower show this time.\n\nThe 203rd edition of the flower show will have a pan-India presence, with each State showcasing its native specialities to add to the heterogeneous disposition of flower display. Maharashtra, Andhra Pradesh, New Delhi and Tamil Nadu have already confirmed their participation, according to Lalbagh authorities.\n\nWhere the national flower show would bring in a distinct, focussed character is in its presentation, as 13 acres of Lalbagh area would be bedecked with flower beds with innovative ideas. “We did the flower seedling a few months ago and 13 lakh saplings are timed to flower in umpteen hues exactly for the show. This project has cost us roughly Rs. 10 lakh,” said M. Jagadeesh, Joint Director, Horticulture, Parks and Gardens, Lalbagh.\n\nApart from the Glass House and the Band Stand that usually get the crown of flowers, this time a spread of petunias, salvias, dianthus, and tansy, which do not wilt fast, could be seen at 60 locations, including the four entrances, at the foot of the hillock on which there is a Kempe Gowda tower and Glass House, Director’s Building campus, DHO lawn area, tree fossil area, and Java fig area.\n\n“Given the fact that we are commemorating German horticulturist J.H. Krumbiegel’s 150th birth anniversary, and 2016 happens to be our own horticulture specialist M.H. Marigowda’s birth centenary year, we decided to go national to draw in a vibrant variety of flowers from several States, and share the achievements of our own two doyens,” said Mr. Jagadeesh.\n\nCubbon Park’s contribution\n\nNew Year for Cubbon Park authorities means making arrangements for participating in the Republic Day flower show at Lalbagh and the Republic Day parade at Field Marshal Manekshaw Parade Ground.\n\nWhile 10,000 flower pots from Cubbon Park would be sent to Lalbagh, the 4,000 flower pots would adorn the parade ground, and Cubbon Park itself would get an additional 3,000 potted flowers, according to Mahantesh Murgod, Deputy Director of Horticulture, Cubbon Park. “We have been working on the seedlings for the last two months and would send 25 varieties of flower pots, including marigold, red and blue salvia, petunia, celosia, and geraniums for the two venues,” he said.\n\nA dozen States are expected to participate in the Republic Day flower show", 
    "section": "national", 
    "title": "Lalbagh flower show to go national this year", 
    "subsection": "general", 
    "date": "2016-01-02"
}