{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "With the continuing slugfest threatening to snowball into a rift between the Janata Dal (United) and the Rashtriya Janata Dal, forming the government in Bihar, RJD chief Lalu Prasad on Friday asked his party leaders not to make any controversial remark as the government has been working “well and fine.” His remarks came three days after Mr. Prasad pointed to the deteriorating law and order in the State.\n\n“The party spokespersons and leaders should refrain from making any controversial statement as it will affect the interests of the party. Some leaders make controversial comments to increase their TRPs. Such leaders and spokespersons should take permission from the leadership before making any statement,” Mr. Prasad said.\n\nHe denied any rift in the alliance. “The Mahagathbandhan [the Grand Alliance] government is working well and fine. We’ve to fulfil our promises to the people,” he said.\n\nOn Tuesday, after a spate of killings of engineers over extortion demands, the RJD chief expressed dismay at the law and order situation. “The Nitish Kumar government must be more vigilant, and if anyone receives any extortion call, please call me and I’ll ensure speedy action,” he told journalists. JD(U) leaders were upset. They said no one could question Chief Minister Nitish Kumar’s commitment to law and order. The Opposition BJP took a dig at the ruling alliance, calling Mr. Prasad the “super CM.”\n\nOn Thursday, RJD vice-president Raghuvansh Prasad Singh said Chief Minister Nitish Kumar was responsible for law and order. “Nitish Kumar is sitting in the driver’s seat and is responsible for anything that happens in the State. He should take stern measures to prevent law and order deteriorating further,” he said. “The RJD is sitting in the back seat. The man at the wheel is responsible for the safe driving of the vehicle,” he replied, when reminded that the RJD is a part of the ruling coalition.\n\nMeanwhile, the Congress, the third partner in the coalition, backed Mr. Nitish Kumar.\n\n“Law and order has always been the USP of Mr. Nitish Kumar for which he has won praise across the country. Some criminal incidents have taken place, and the Chief Minister is looking into them. He will handle them effectively,” Pradesh Congress Committee president and Education Minister Ashok Chaudhury said.", 
    "section": "national", 
    "title": "Lalu imposes gag order on RJD leaders", 
    "subsection": "general", 
    "date": "2016-01-02"
}