{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chidambaram says party not blocking legislation, has helped pass Bills\n\nThe former Finance Minister P. Chidambaram on Friday rejected Prime Minister Narendra Modi’s charge that the Congress was blocking legislation and had wilfully blocked the Goods and Services Tax (GST) Bill.\n\n“Let me remind everyone that we have cooperated with the government in passing 67 Bills in the Lok Sabha and 45 in the Rajya Sabha during the past 19 months,” he told a press conference here.\n\nHarking back to the meeting between Mr. Modi and Congress president Sonia Gandhi and the former Prime Minister Manmohan Singh in the first week of December to find a way out of the GST deadlock, Mr. Chidambaram said that the Prime Minister heard out the three main objections the Opposition had on the GST and then gave them his word that he would “get back” to them.\n\n“That is almost a month ago. We have not yet received the written response of the government or the revised formulations of the government on the three principal objections. So, the ball is entirely in the government’s court. It is for them to come back to us and tell us whether they are accepting our objections, whether they are revising the formula, whether they are amending the particular section,” he said.\n\nHe also accused the ruling BJP was mismanaging the economy, for which he relied on the government’s most recent analysis that suggests “private investment and export — two of the four drivers of demand — are languishing.” Mr. Chidambaram urged a caution on corporate sheets being “stressed” and net sales falling by “5.3 percent” and profit after tax running “flat”. Non-food credit growth at 8.3 percent, he said, is the “slowest in 20 years”, which means the investment sentiment has become weak. Taking a dig at the government’s foreign policy, Mr. Chidambaram said the country “seems to have lost the goodwill of all concerned —the government of Nepal, the Madhesi parties and the people of Nepal.”\n\n“Rhetoric, U-turns, and impulsive steps do not make a coherent foreign policy,” he said.", 
    "section": "national", 
    "title": "Modi yet to reply to us: Cong.", 
    "subsection": "general", 
    "date": "2016-01-02"
}