{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Senior members wanted to know why India failed to anticipate the crisis\n\nThe panel asked Jaishankar about steps the government had taken to dispel Nepal’s perception that the blockade called by the Madhesi protesters had indirect Indian support.\n\nThe government came under strong criticism during the latest meeting of the Standing Committee of Parliament on External Affairs which convened specially on December 29 for a briefing on Nepal from Foreign Secretary S. Jaishankar.\n\nMr. Jaishankar was asked searching questions for more than two hours by senior members of the committee who wanted to know why India failed to anticipate the crisis in Nepal which has taken a heavy toll on ties.\n\nDuring the meeting, a member asked Mr. Jaishankar why the government did not focus on internal developments in Nepal during the summer when discussions on the Constitution were taking place in Kathmandu. The MPs asked Mr. Jaishankar about his personal trip to Kathmandu of September 18 which was described as too late to prevent the promulgation of the Constitution which triggered the internal crisis between the government in Kathmandu and the protesting Madhesi citizens in Nepal.\n\nThey asked Mr. Jaishankar about steps the government had taken to dispel Nepal’s perception that the blockade called by the Madhesi protesters had indirect Indian support.\n\nAnother MP present at the meeting told The Hindu that the December 25 agreement between Nepal and China establishing secure energy links would reduce the age-old synergy between the Indian and Nepali economies. Nepal’s Foreign Minister Kamal Thapa who signed the agreement in Beijing also announced on returning to Kathmandu that Prime Minister K.P. Sharma Oli, breaking with an unwritten convention, will visit Beijing in his first trip abroad since taking over in October.\n\n“India did not have its eye on the ball and was caught by surprise with the developments in Nepal,” said an MP. “Even the External Affairs Minister had conceded that India did not have details of the Nepal Constitution in advance,” he told The Hindu .\n\nMembers who attended the briefing by Mr. Jaishankar said that Nepal was fast emerging as a vehicle for China’s growing influence in South Asia and the souring of India’s ties with Nepal would send out a negative message to other members of the South Asian region. “We have told the Foreign Secretary that 2016 will test Prime Minister’s “Neighbourhood First” policy which was meant to prevent India’s rivals from getting a foothold in South Asia,” said another MP underlining that India’s inability to prevent growing Chinese influence in Nepal would translate into a landmark diplomatic setback.", 
    "section": "national", 
    "title": "MPs’ panel grills Jaishankar on Nepal crisis", 
    "subsection": "general", 
    "date": "2016-01-02"
}