{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Omar Abdullah says Chief Minister Mufti Muhammad Sayeed has not defended the State’s dignity from the nefarious plans of allies\n\nAs the BJP, a partner of the ruling coalition, moved the court on Friday against a separate State flag for Jammu and Kashmir, the Opposition National Conference launched a scathing attack on Chief Minister Mufti Muhammad Sayeed and his People’s Democratic Party (PDP).\n\nA Division Bench of Justices Tashi Rabistan and Bansi Lal Bhat stayed the operation of an order issued by Justice Hasnain Masoodi on “equal respect for the State flag by unfurling it on government buildings and vehicles.”\n\nIn response to a petition filed in Srinagar to have a separate flag-raising day, the former Inspector-General of Police, Farooq Ahmed Khan, now the BJP’s national secretary, approached the court with a counter-petition to have the national flag “above everything else”.\n\n“The State of Jammu Kashmir is a State of Union of India, and as such there can be no question of the equal treatment of the symbol of the State with the national symbol. The State of Jammu and Kashmir having its own flag is a position which as per law is not sustainable and is open to analysis,” the BJP’s lawyer pleaded before the court.\n\nTo douse any growing friction with the PDP, Minister of State in the Prime Minister’s Office (PMO) Jitender Singh told reporters in New Delhi that “the Jammu and Kashmir government as well as the legislature has the prerogative to take a view on these issues. I am also sure that they are capable enough to take a view and proceed accordingly.”\n\nThe Former Chief Minister and NC working president, Omar Abdullah, however, accused Mr. Sayeed of “not defending the State’s dignity from the nefarious plans of allies.” “So long as J&K is a part of India, the two flags will continue to fly and we’ll take pride in it…Why is only J&K expected to respect the terms of accession while the rest of the country can disregard them with impunity,” Mr. Abdullah asked.\n\nSupporting Mr. Abdullah’s views, NC spokesman Aga Syed Ruhullah Mehdi said: “The State flag continues to derive its validity and sanctity from the Constitution of Jammu and Kashmir, which is a fact that cannot be wished away in the din of political rhetoric and statements. This appeal for a stay order was filed by a BJP leader, who was represented by BJP spokesperson and advocate Sunil Sethi. It is evident the BJP is mounting a legal offensive to challenge the State’s constitutional autonomy. The PDP’s continued nexus with the BJP makes it complicit and culpable.”\n\nCPI(M) leader Muhammad Yousuf Tarigami said: “The silence of the PDP on such an important issue makes it clear that it is playing with the wishes and aspirations of the people of Kashmir.”\n\nDefending the case for having two flags, PDP leader and political adviser to Mr. Sayeed, Waheed Parra said: “Even before the recent judgment, the State abided by the use of two flags, a right drawn from the Constitution. It should not be seen through the separatist prism, but a federal one…”\n\nMeanwhile, Advocate-General Jahangir Iqbal said: “The State government will respond only after going through the copies of the judgment. It will be premature to say anything at this stage.”", 
    "section": "national", 
    "title": "NC says J&K takes pride in State flag", 
    "subsection": "general", 
    "date": "2016-01-02"
}