{
    "author": [
        "National Bureau"
    ], 
    "text": "The Enforcement Directorate’s request for initiating extradition proceedings against Lalit Modi, former IPL head and newly reinstated chief of Rajasthan Cricket Association, has been sent to the External Affairs Ministry.\n\nOfficial sources in the Ministry denied that the file had reached its officials by Friday evening, raising the possibility that there is a rethink or dual views within the government on how to proceed with the case.\n\nIn the natural course, the file on Mr. Modi would have to be scrutinised by the Ministry’s consular passports and visa desk, which would then have to decide whether it would be forwarded to U.K. authorities.\n\nIt is learnt that the directorate had, over two weeks ago, sent the file requesting initiation of extradition proceedings against Mr. Modi. The move came after the authorities in the southern European island country of Malta turned down the agency’s request to arrest him on the basis of a warrant against him.\n\nAbout four months ago, the directorate had approached the Malta agencies and shared Mr. Modi’s address. The agency recently refused to execute the arrest warrant issued by a Mumbai court.\n\nThe Directorate is now hoping that the Ministry would initiate extradition proceedings against Mr. Modi in the United Kingdom. The agency is pursuing a money laundering and 16 foreign exchange rule violation cases against Mr. Modi and other former office-bearers of BCCI-IPL, involving about Rs. 2,000 crore.\n\nMr. Modi is wanted for questioning in the case registered in December 2012 on the basis of an FIR filed by the Chennai Police in October 2010. The police case was registered on a complaint from the former BCCI chief N. Srinivasan alleging embezzlement by Mr. Modi and others in the award of BCCI-IPL media rights in 2009.\n\nIn the past five years, the Chennai Police have not completed investigations in its own case. Government sources said the police findings could have added more substance to the request for extradition proceedings.\n\nDespite repeated reminders and clarifications, the Interpol has also not issued a red-corner notice against the former IPL chief.", 
    "section": "national", 
    "title": "No clarity yet on plea to extradite Lalit Modi", 
    "subsection": "general", 
    "date": "2016-01-02"
}