{
    "author": [
        "Somesh Jha"
    ], 
    "text": "The Road Transport and Highways Ministry was keen on taking the ‘Swiss Challenge’ route to find bidders for building expressways. -File photo: Vijay Soneji\n\nIndia’s ambitious plan to build new expressways across the country by adopting the ‘Swiss Challenge’ method for awarding these projects has become uncertain following an expert committee’s warning to the government against using this approach for infrastructure investments, according to a senior government official.\n\n“Since it’s a difficult task to find builders to develop greenfield expressways, we were keen on taking the ‘Swiss Challenge’ route to find bidders for building around 19,000 km expressways as per the master plan,” said the official of the Road Transport and Highways Ministry, under condition of anonymity.\n\n“However, the recommendation of the [expert] committee on public private partnerships (PPPs), criticising the model, puts us in a difficult spot.”\n\nIn its report on ‘Revisiting and Revitalising the PPP model of infrastructure development,’ presented to the Finance Ministry on Monday, the panel led by the former Finance Secretary, Vijay Kelkar, had discouraged the government from following the ‘Swiss Challenge’ model of auctioning infrastructure projects. Incidentally, the Centre had already approved the use of this model for redeveloping 400 railway stations.\n\n“Unsolicited proposals (“Swiss Challenge”) may be actively discouraged as they bring information asymmetries in the procurement process and result in lack of transparency and in the fair and equal treatment of potential bidders in the procurement process,” according to the panel’s report.\n\nRoad Transport and Highway Ministry officials, involved in formulating a blueprint for developing several expressways through the Swiss Challenge mode, said the contract would be awarded in a fair manner.\n\n“The process is pretty fair. A proposal, in the form of a detailed project report (DPR), to develop a proposed expressway project will be uploaded on our website. We will invite bids and to avoid unsolicited proposals, the bidders can propose project cost of not less than 10 per cent of the cost mentioned in the DPR,” the official said.\n\nThe original proposer will get the right of first refusal in such cases and the cost of the DPR will be covered by the agency which bags the contract, the source said.\n\nIndia plans to build 18,637 km expressways in a phased manner by 2022 under an official Master Plan for the National Expressway Network.\n\nAn express highway is a controlled-access highway, generally six-lane or more, where entrance and exit are controlled by the use of slip roads. Under the ‘Swiss Challenge’ model, any bidder can offer to improve upon a project proposal submitted by another player.\n\nThe Union government has identified building 16 greenfield expressways at present. However, some of the projects put on priority such as the 135-km long Eastern Peripheral Expressway, the 66-km Delhi-Meerut Expressway and the 400-km Vadodara-Mumbai Expressway, are not being bid using the ‘Swiss Challenge’ route.\n\nMinister of State for Road Transport and Highways, Pon Radhakrishnan, had admitted in the Lok Sabha on December 17 that response to PPP projects had been relatively lower due to several factors.", 
    "section": "national", 
    "title": "Panel warns against ‘Swiss Challenge’ route", 
    "subsection": "general", 
    "date": "2016-01-02"
}