{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "The Patels in Gujarat are apparently once again turning their ire on BJP leaders, who are facing strong protests from the community members at functions in various places in the State.\n\nOn Thursday, a top Cabinet Minister Nitin Patel was booed out from a condolence meeting for Mayur Patel, who died last week of injuries he suffered in police firing during a violent agitation. Mr. Nitin Patel, who is also spokesperson of the government and MLA from Mehsana town, was forced to leave by angry Patidar members in the meeting in his own constituency.\n\nSimilarly, another senior Minister Saurabh Patel avoided attending a government-sponsored agriculture festival in North Gujarat, where hundreds of Patidar members had gathered to oppose the Minister’s presence.\n\n“It is again becoming very volatile in several Patel-dominated pockets in North Gujarat and Saurashtra regions. The Patels are in no mood to relent on their demand for quota and strong action against policemen, who committed excesses during the last agitation in which 11 persons died in police firing,” said a BJP MLA.\n\nAccording to him, the situation has become so charged that Chief Minister Anandiben Patel has been advised against visiting or attending any public function in Mehsana, Sabarkantha and Patan districts, where the agitation was originally launched.\n\nRecently, the Chief Minister reportedly reprimanded the junior Home Minister Rajni Patel and some intelligence officials for failing to get inputs on the Patels trying to revive the agitation.\n\n“The government should release agitation leaders like Hardik Patel and others who have been arrested in politically motivated and fabricated cases at the instance of the government,” said Varn Patel, spokesperson of the Sardar Patel Group (SPG), one of the two outfits that launched the agitation last July demanding OBC status to the Patel community.\n\nBJP insiders said the Chief Minister and other top leaders have decided to invite the Patel community leaders for talks to resolve the crisis that has cost the BJP heavily in the recent panchayat elections in the State.\n\n“The Chief Minister held a long meeting with prominent leaders of the Patidar community and there will be many meetings at the top level,” a senior official in the Chief Minister’s Office said.\n\nMeanwhile, the Congress has announced a massive rally to press for the release of Patidar leaders who are in jail. “On January 5, we will hold a rally to demand the release of Patidar leaders who have been jailed by the BJP government in a bid to suppress the agitation,” Congress spokesperson Manish Doshi said.\n\nAnandiben Patel advised against visiting or attending any public function in three districts", 
    "section": "national", 
    "title": "Patels stage protest against Ministers at functions", 
    "subsection": "general", 
    "date": "2016-01-02"
}