{
    "author": [
        "R Rajaram"
    ], 
    "text": "Consultant to be appointed for redesigning work\n\nFaced with the task of maximising the commercial revenue at airports, the Airports Authority of India (AAI) has decided to appoint a consultant for seven international airports, including Tiruchi, to review and re-design the layout of its existing general retail and food and beverage outlets inside the terminal buildings.\n\nThe object was to make optimum use of airport space for passengers’ facilitation and realise the full commercial revenue potential.\n\nApart from Tiruchi, the other airports under this scheme are Thiruvananthapuram, Lucknow, Guwahati, Goa, Amritsar, and Srinagar.\n\nThe Commercial Department of the AAI corporate headquarters has invited quotation from the prospective consultants.\n\nThe applicant should have had experience in providing consultancy services in similar work at least in one Indian or foreign airports having passenger movement of two million annually or more.\n\nThe consultant would be given four months to carry out the work which would be split into two phases.\n\nThe consultant would undertake floor and layout designing besides do overall planning for optimum utilisation of space.\n\nThe existing general retail and food and beverages outlets are run by different private agencies at Tiruchi airport recorded a traffic of 10 lakh passengers, mostly overseas travellers, in the last financial year.\n\nTiruchi, unlike other non-metro international airports, has more overseas flights than domestic operations.\n\nAirport sources said AAI officials would have interaction with the chosen consultant in connection with the redesigning work at Tiruchi airport which would get a new integrated terminal building in a few years from now. The sources said there was a plan to have a single agency for the retail and food and beverage outlets respectively at the Tiruchi airport.\n\nHowever, this would come after the consultant submitted the re-designed layout, the sources said.\n\nAAI wants to realise full commercial potential of the real estate space The consultant will be given four months to complete the planning Plans are afoot to have a single agency for all the retail outlets at the Tiruchi airport", 
    "section": "national", 
    "title": "AAI to redesign layouts of retail, food outlets in airports", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}