{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Nabard likely to extend financial support\n\nNabard (National Bank for Agriculture and Rural Development) has evinced interest in according a financial fillip to the Amma Pannai Mahalir Kuzhu at Vellivalasu that is involved in manufacture of animal feed.\n\nThe group with 20 members has been doing roaring business clocking monthly production of about 50 tonnes. The group started off its venture during November 2014, after undergoing a training program at the Animal Feed Analytical and Quality Control Laboratory attached to Veterinary College and Research Institute, Namakkal.\n\nThe group has obtained feedback from its customers that the milk yield of their cows has increased by 15 per cent to 20 per cent after feeding the animals with the feed produced by the group with the brandname Chinnamman-periyamman. The USP of the brand is quality plus competitive pricing.\n\nAt Rs. 15.80 a kg, the cost is about Rs. 3 rupees lesser compared to the other brands in the market.\n\nQuality\n\nRegular testing of the product at the Namakkal Laboratory for validating the right proportion of inputs: rice bran, groundnut cake, minerals mixture, black gram husk, jaggery, bajra, maize, sorgam, palm cake, cotton seed, common salt, red gram husk, and bengal gram husk, takes care of quality.\n\nThe group is under no compulsion to broadbase the business. Members of milk cooperative societies in the district constitute their customer base.\n\nIn fact, the cost-economics may not work if the group employs workers for production with an eye on expansion. The 20 members look after the nitty-gritty of the production process by themselves and are hence able to enjoy the cost advantage, Assistant Director of Agriculture in Modakurichi block Kulandaivelu explained.\n\nThe Agriculture Department is well into exploring scope for listing the animal feed venture for funding under State Innovative Scheme whereby subsidy benefit could be offered to the group.", 
    "section": "national", 
    "title": "Animal feed making unit on an expansion mode", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}