{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Engineering, machine tool, and automobile industries here were urged to look at opportunities in doing business or setting up facilities in Bavaria, Germany.\n\nJohn Kottayil, executive director of Invest in Bavaria and T.S. Sampath Kumar, senior advisor of Invest in Bavaria, were on a two-day visit to Coimbatore on Tuesday and Wednesday to talk to industries here about opportunities in Bavaria.\n\nThey told The Hindu about 70 Indian companies have facilities in Bavaria and these are mostly in the technology space.\n\nOver 11,000 Bavarian companies do business in India and there are more than 300 joint ventures in India of Bavarian and Indian firms. Bilateral trade between Bavaria and India had grown multi-fold in the last 15 years.\n\nApart from facilitating Indian companies to start business, have trade ties, or set up facilities in Bavaria, Invest in Bavaria also “promotes SME investments from Bavaria in India.” Bavaria has over six lakh small and medium-scale enterprises and the focus in Germany now is on SMEs, they said.\n\nIt is the eighth largest economy in Europe and is ideally located for companies that want to access the European Economic Area markets. Nuremberg offers some special incentives for investors and for start-ups too.\n\nIndustries in Coimbatore already have business ties with Germany. Delegates from the city have visited Germany for trade fairs and have received German delegates here.\n\nMany units here are looking at expansion and business opportunities with Germany and are considering having entities in Germany, they added. Bavaria has 19 clusters for sectors such as materials and mobility and focuses on futuristic technologies. It also has a Digital Bavaria initiative, which was launched last year.\n\n“Coimbatore is strong in automobile components, education, textiles and engineering. I see synergy between Coimbatore and Bavarian industries,” Mr. Kottayil said.", 
    "section": "national", 
    "title": "Bavaria invites investments", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}