{
    "author": [
        "R Sivaraman"
    ], 
    "text": "They will be under strict watch, Nasim Zaidi said after meeting officials and political parties\n\nChief Election Commissioner Nasim Zaidi, Election Commissioners and other officials coming out after a meeting with officials and political parties in Puducherry on Wednesday. - Photo : T.Singaravelou\n\nChief Election Commissioner (CEC) Nasim Zaidi on Wednesday said the Commission has directed the entire election machinery from the district election officer to the booth officer to remain neutral, impartial and fair towards all political parties.\n\nAfter wrapping up the discussions with officials and political parties in Puducherry, he expressed satisfaction over the preparations that have been made by the Election Department in Puducherry.\n\nStrict vigil\n\n“All the officials, connected with election work will remain under our strict watch. We have directed that the entire election machinery to remain fair towards all parties,” said Dr. Zaidi adding that postings and transfers of officials would be reviewed at appropriate time if necessary.\n\nHe added that the Commission would take effective measures to ensure that citizens cast their votes without being disturbed by any external influence. He further reiterated that it would also take necessary steps to ensure a peaceful and violence-free poll.\n\nIntensive drive against history-sheeters\n\nThe Chief Election Commissioner said the Commission has asked police officials to undertake an intensive drive against history-sheeters and hooligans.\n\nHe said they should be prevented from indulging in election-related violence and intimidation.\n\nHe added that there should be special teams to prevent any untoward incident on the roads and along the State borders. “The Commission will see to that no voter is intimidated. They will be given full freedom and encouraged to come to the polling stations and cast their votes.”\n\nTerming the abuse of money as one of the major issues in Puducherry, he said the Commission would devote more time on the issue.\n\nThe number of flying squads and surveillance teams would be increased here.\n\nStating that the Union Territory would set up polling stations specially for physically challenged persons, he pointed out that it would be first time probably in the country.\n\nVVPAT machines in three UT seats\n\nThe Election Commission of India will introduce voter verifiable paper audit trial (VVPAT) in three constituencies in the Union Territory, the CEC said.\n\nThrough the VVPAT system, a printout is generated so that a voter can verify whether his/her vote has been cast correctly.\n\n‘Measures have been taken to ensure that all can cast votes in an undisturbed manner’", 
    "section": "national", 
    "title": "CEC asks poll officials to remain neutral", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}