{
    "author": [
        "D Madhavan"
    ], 
    "text": "For centuries, the Chola-era tank that belongs to Varadharaja Perumal temple on Kulakarai Street in Poonamallee, served multiple purposes. It helped in irrigating paddy fields and water drawn from here was used in homes. The tank was the centre of activity during annual events including the temple car festival.\n\nNow, the tank, which is spread over more than one acre amid fast-developing areas off Poonamalle High (PH) Road, has become a garbage dump. Located a few hundred metres away from the temple and surrounded by homes, the tank is around 15 feet deep and has more than 20 steps, made from the traditional brick and lime mortar method. The tank was known as white lotus pond as it was covered with the flowers throughout the year. Now, it is covered only by sheets of algae.\n\n“Earlier, families used huddle during the evenings and children would play around the tank till sunset. Now, none can even visit the tank due to the foul smell from the stagnant water in the tank,” said 67-year-old Poonamallee resident S. Kandaswamy. Garbage including kitchen waste is dumped around the tank and most steps are damaged.\n\nResidents said the tank on Kulakarai Street is the bigger of the two tanks of the temple. The smaller tank is on Sannithi Street. In the past, the tank had water throughout the year. Over the years, channels feeding the tanks and transporting surplus elsewhere have either been damaged or encroached upon. The existing stagnant water in the tank is due to rains in December.\n\nHR and CE officials told The Hindu that efforts have been taken to renovate the tank. Initially, a sum of Rs. 1.65 lakh has been allotted to build a fence around the tank to protect it from misuse and prevent people from falling into it. They added that the work will begin in March.", 
    "section": "national", 
    "title": "Chola-era temple tank turns garbage dump", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}