{
    "author": [], 
    "text": "ONLINE PLATFORMS help students and faculty\n\nS. Gomathi, Information Technology faculty at Sri Krishna College of Arts and Science, posts on the online platform of the college whatever she teaches in class.\n\nThat includes class notes, reading material and papers and videos available online.\n\nThe use of information technology has made her task easier as she can spend more time teaching in the class then writing down algorithm or programme on the board, she says.\n\nAs for the students, the availability of the material online has spared them the trouble of noting down every word that is spoken or written by the teacher. It helps us concentrate better, says Saundarya Lakshman, a student of Dr. G.R. Damodaran College of Science.\n\nIn the process classrooms are turning paper-less. Yes, a lot of paperwork is reduced, says A. Haripriya, a third year commerce student at the Sri Krishna College of Arts and Science.\n\nThe students carry fewer notebooks and note down only what is essential.\n\nThe reduction use of paper extends to the tests too, she says. The college conducts quiz, placement training and a few other tests online.\n\nSometimes, internal examinations are also conducted online.\n\nEngineering student S. Samuel says the days of paper-less classrooms are not far away and that includes tests as well.\n\nBut for that to happen, universities that affiliate colleges like the Anna University, should also make changes to incorporate technology.\n\nAside from sharing course content, the faculty use online platform to inform students of tests or assignments.\n\nIt may be a novel idea that may be catching up with private colleges but nothing can replace the chalk and talk method, says a faculty at the Government Arts College, Coimbatore.\n\nIn subjects like chemistry, physics or mathematics where problem are solved or derivations arrived at, teaching using the board to explain the steps involved cannot be replaced.\n\nThe simultaneous writing and explaining by the faculty and the students noting down makes the teaching-learning complete as the latter are more attentive in class.\n\nIf the notes were to be available online, the students have no incentive to listen in class, the professor says. It cannot be down away with, he reiterates.\n\n(Reporting by\n\nKarthik Madhavan)", 
    "section": "national", 
    "title": "Classrooms going paperless", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}