{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "‘Civic body spent Rs. 4.55 lakh on a work it did not carry out in Maniakarampalayam’\n\nThe reserved site at Ashok Nagar in Maniakarampalayam where the Coimbatore Corporation reportedly carried out pathway construction work. —Photo: M. Periasamy\n\nCoimbatore Corporation has reportedly spent Rs. 4.55 lakh on a work it did not carry out in Maniakarampalayam in Ward 41. The civic body had said that it had constructed footpath in the reserved site at Ashok Nagar in Maniakarampalayam but it had not carried out the work, alleged M. Krishnasamy, a former councillor and a State committee member of the Marumalarchi Dravida Munnetra Kazhagam.\n\nFlashing copies of the records that contained the expenditure at the Press Club on Wednesday, he said that the Corporation had paid the money to the contractor, but there was no work. He also shared photographs of the reserved site where the Corporation said it had carried out the works to underscore his point.\n\nMr. Krishnasamy said this was only the tip of the iceberg of corruption going on in the Corporation.\n\nHe had sought details under the Right to Information Act of expenditure carried out between April 1, 2015 and August 31, 2015.\n\nAfter several reminders, the Corporation has asked him to pay Rs. 42,000 towards the cost of sending 7,000 pages of document containing transaction for the said period.\n\nHe then asked the details to be sent in a compact disc. Thereafter, the Corporation asked him to pay Rs. 2,700 towards paper cost, which he paid.\n\nBut after 135 days, the Corporation only gave him 880 of the 7,000 pages, he said and added that the missing pages contained details of payment made to lorries used in transport of waste and that was where corruption was.\n\nAt present, the Corporation paid Rs. 180 a km for transporting waste. In 2011-12, it was Rs. 110 a km and in 2002-03 it was Rs. 16 a km.\n\nThe Corporation paid the exorbitant money to the contractor whose lorries it used. And that contractor was close to the ruling party leaders in the district, he alleged. To put things in perspective, exorbitant bill towards transport and contract conservancy workers amounted to Rs. 3 crore to Rs. 5 crore a month.\n\nThe former councillor further said that the Corporation’s reserve fund that was Rs. 240 crore was zero now.\n\nThis was nothing short of mismanagement of funds, he alleged and wanted the State Government to order a probe against the senior officials of the Corporation and a thorough audit of the civic body’s accounts.\n\nA Corporation engineer said that the Corporation had constructed the footpath in the reserved site near Aishwarya Nagar in Ward 41. The records might show that the civic body had carried out the work in Ashok Nagar but it was in Aishwarya Nagar and sometimes there could be errors in the records.\n\nCorporation Commissioner K. Vijayakarthikeyan said that he would look into the allegations and if found true, would act.\n\nHe added that the Corporation was all for ensuring transparency and accountability in administration.\n\nMayor P. Rajkumar was unavailable for comments.", 
    "section": "national", 
    "title": "Corruption alleged in Coimbatore Corporation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}