{
    "author": [
        "S Sundar"
    ], 
    "text": "Central Reserve Police Force personnel on their morning drill on East Chithirai Street around Meenakshi Sundareswarar Temple in Madurai on Wednesday.— Photo: R. Ashok\n\nTo provide security to VIPs with ‘Z’ scale category\n\nIn a tactical move, the city police have deployed a platoon of Central Reserve Police Force (CRPF) meant for providing security to VIPs with ‘Z’ scale security cover in the old District Police Office building, thus increasing police presence in Chithirais streets around Meenakshi Sundareswarar Temple.\n\nThe platoon, with 38 central police personnel, was earlier accommodated on the Mounted Branch premises of the city police.\n\n“We cannot leave such a huge building unoccupied near the temple for security reasons,” the Commissioner of Police, Shailesh Kumar Yadav, told The Hindu . With the CoP office too likely to get shifted to Alagarkoil Road soon, Mr. Yadav made better use of the building by giving it to the CRPF platoon.\n\n“It is a two-fold advantage for the city police. One, the building is put to good use by giving better accommodation to the CRPF men. Two, the presence of additional police force will keep anti-social elements away from the vicinity of the temple,” he said.\n\nThe CRPF barracks, abutting the South Chithirai Street, which is guarded by armed personnel round-the-clock, would certainly provide visible policing in close quarters of the temple that has been brought under a thick security blanket for the past few years.\n\nThe Commissioner has also asked the CRPF personnel to go around the temple to make their presence felt on the Chithirai Streets.\n\n“Though they are not under the control of the city police, I have asked them to make use of the Chithirai Streets for their drill and physical training in the early mornings and evenings,” Mr. Yadav said.\n\nStating that the Code of Criminal Procedure authorises any police to take action in any cognisable offence, Mr. Yadav said that the presence of CRPF police personnel around the temple would enhance the already available security arrangement.\n\nJ. Sathiaraj, in-charge of the platoon, said their duty was to provide security cover for VIPs in 15 districts. The men were going around the temple twice every day to keep themselves fit. “In the early mornings, they do the drills, walking and running. However, in the evening when it is crowded, they just go for walking,” he said.\n\nSporting white T-shirts and khaki pants, the central police personnel join hundreds of city residents who come here for their daily morning stroll.", 
    "section": "national", 
    "title": "CRPF platoon deployed near Meenakshi temple", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}