{
    "author": [
        "Staff Reporter"
    ], 
    "text": "National De-worming Day is observed on February 10 every year to address the problem of malnutrition caused by worms\n\nA health officer giving de-worming tablet to a student at a corporation school in Salem on Wednesday.- Photo: E. Lakshmi narayanan\n\nTo prevent children from becoming anaemic, students were given de-worming tablets across the district on Wednesday.\n\nThe National De-worming Day is observed on February 10 every year to address the problem of malnutrition, and maintain good health.\n\nThe 400 mg tablet removes the growth of hook worm, whip worm, and round worm in the body.\n\nHealth officials said that these worms cause malnutrition among children and prevent growth.\n\nChildren aged between 1 and 19 are given the tablets every year, they added.\n\nTablets were given to students who consumed it after their lunch. They were also asked not to panic in case of giddiness after consuming the tablet.\n\nCity Health Officer R. Selvakumar inspected the distribution of the tablets to students of corporation school, near Mulvadi Gate, on Wednesday.\n\nHe asked students to consume only protected drinking water, wash hands before and after taking food, wash vegetables and fruits before eating them, and keep their nails clean.\n\nHe said that Soil Transmitted Helminthes (STH) is a major health concern as children are at risk of parasitic intestinal worm infections. He said that 2.40 lakh students were covered on Wednesday.\n\nThose who have been left out will be given tablets during the Mop-Up Day (MUD) on February 15.\n\nSpecial Correspondent from Erode adds\n\nThe Health Department has provided de-worming tablets to students in private schools also this year, for unfailingly administering the same to all students.\n\nTill last year, children in anganwadis aged one year and above and students of government and government-aided schools till the age of 19 years were given the tablets twice a year. This year, as many as 4.71 lakh children and students in the district will be provided albendazone tablets, Deputy Director of Health Services, P. Balusamy said. Tablets were distributed at the Government High School, Thindal, by District Collector S. Prabakar, to mark National De-worming Day. The school teachers have already been oriented on administering tablets to the students. The Health Department has teamed up with Education Department and will utilise the Integrated Child Development Services Network to reach out to the targeted number of children and students.\n\nAccording to officials, out of school children and adolescents will be covered by the ICDS centres. Those who had been left out today due to absenteeism or sickness will be given tablets on February 15.", 
    "section": "national", 
    "title": "De-worming tablets distributed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}