{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Corporation plans to free up space for increasing width of stretches\n\nOn Monday night, angry residents gathered at Selvapathi Chettiyar Park on Strahans Road in Pattalam in north Chennai to protest the demolition of the park.\n\nThe action, which was being carried out under the supervision of Greater Chennai Corporation officials, was aimed at freeing up space for road-widening work.\n\nHowever, with the protest gaining in intensity, Corporation workers had to beat a hasty retreat, suspending the demotion work. The protest continued throughout Tuesday, with several political parties joining in.\n\nThe park is considered special for its clock tower which had been built in memory of the pioneering labour union leader Selvapathy Chettiar.\n\nThe attempt to demolish the park is set against the backdrop of Greater Chennai Corporation’s\n\nmove to widen roads by denotifying open spaces, including parks and playgrounds, wherever necessary.\n\nThe State government had given its nod for de-notification of parks for widening 11 bus route roads, following a council resolution on November 20, 2014.\n\nThe demolition of the walls of the 2420 sq m park on Strahans Road was carried out on Monday night following a council resolution on January 27, 2016.\n\nAccording to that Corporation council resolution, a private developer had been asked to develop another park in another land measuring 2701 sq m so that this park could be demolished.\n\nThe developer had planned a large township in a large parcel of land previously owned by a leading textile and engineering major in north Chennai.\n\nThe developer has already demolished some buildings without any sanction or approval of the Corporation. Due to this illegality and non-compliance with demolition norms, a case has been filed with the National Green Tribunal, according to the Corporation council resolution.\n\n“The road has actually been planned to help a private agency develop a bus route for a new township. Residents have not permitted demolition of the clock tower which was built in memory of Selvapathy Chettiar, one of the two founders of the Madras Labour Union at Binny Mills,” said A. Vijayakumar, North Chennai, District Committee Member of CPI(M).\n\n“Very sad. It is a great symbol of our labour struggle. He is the founding father of labour union in the whole country. It should not be demolished under any circumstances,” said historian V. Sriram.\n\nThe clock tower was inaugurated on August 4, 1948 and restored in 2004.", 
    "section": "national", 
    "title": "Demolition of historic park triggers fury in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}