{
    "author": [
        "K Raju"
    ], 
    "text": "Water being supplied by a corporation lorry at Vivekananda Nagar in Dindigul on Wednesday due to damage of main pipeline during underground drainage work.— PHOTO: G. Karthikeyan\n\nIn spite of Dindigul Corporation having spent more than Rs.180 crore to augment drinking water supply, some areas in the town are not supplied water for days together. Residents of Vivekananda Nagar and nearby areas and part of Nehruji Nagar did not getting drinking water for the past 20 days.\n\nWith no groundwater source, they have been forced to depend on private water tankers to meet their requirements.\n\nThe main pipeline at Vivekananda Nagar was damaged and the drinking water supply stopped when workers started digging to construct underground drainage project. Later, the work was abandoned. But the damaged pipeline was not repaired.\n\nWhen the residents appealed to the Corporation to repair it, the officials had reportedly expressed helplessness citing shortage of manpower.\n\nAlready the residents are disgusted over the lethargic attitude of officials and an inordinate delay in completion of the underground drainage project.\n\nAfter vociferous protests, the Corporation that did not want to invite the wrath of residents during election time, sent a tanker load of water. Councillor G. Dhanabalan, who made several appeals to make alternative arrangements to maintain supply, said that supplying water through tankers should be a temporary arrangement and the corporation should expedite the repair work and resume regular supply.\n\nWater supply was disrupted in parts of Nehruji Nagar also as the pipeline was damaged owing to the digging work near Vinayagar Temple on RM Colony Road. Though Athoor dam has sufficient storage, water is supplied once in 20 days and 10 days in other areas.\n\nThe Corporation has spent Rs.110 crore for the Cauvery drinking water project and Rs.70 crore for increasing the capacity of Athoor dam to maintain water supply in the 48 wards once in two days.", 
    "section": "national", 
    "title": "Dindigul residents sore over erratic water supply", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}