{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chief Minister quotes Swami Vivekananda and Anna to motivate cadre\n\nChief Minister Jayalalithaa solemnising the marriage of T. Rani, for whom she expressed special affection, on YMCA grounds in Chennai on Wednesday.Photo: S. R. Raghunathan\n\nAIADMK general secretary and Chief Minister Jayalalithaa on Wednesday urged party cadre to draw strength from the criticisms made against the ruling party by the Opposition.\n\nAccusing the Opposition parties of functioning with the sole aim of speaking ill of the AIADMK, she said her party was a movement which drew its strength from the people.\n\n“Since they [Opposition parties] cannot withstand our growth, they malign us. This is, in fact, the yardstick of our growth,” she said quoting former Chief Minister C.N. Annadurai, who said “You should grow using the criticism as nourishment.”\n\nMarriages solemnised\n\nSolemnising the marriage of 14 couples, including the children of four Ministers at YMCA Grounds in Royapettah here, she told the gathering that the AIADMK would certainly bag a massive victory in the Assembly election. “ I have complete confidence that you can bring home the victory,” she said.\n\nIn this context, she quoted Swami Vivekananda, who said: “You become what you think. If you think you are powerful, you will become so. Never think that is there is anything that you cannot achieve.”\n\nAddressing the couples, she said a home becomes happy and peaceful when one understands that happiness comes when the other is happy.\n\n“In life there will be happiness/ suffering, support/opposition, profit/loss. But never fear anything. Opposition and suffering should only make you stronger like refined gold. If you are to succeed in life, you need to understand the other person’s nature. Then you can predict how he or she will behave and act accordingly,” Ms. Jayalalithaa said.\n\nShe presided over the weddings of children of four Ministers – R. Vaithilingam (Housing), S.P.Shanmuganathan (Information and Publicity), Mukkur N. Subramanian (Tourism) and R. Kamaraj (HR&CE), MLAS – P.K. Vairamuthu, K.P. Munusamy, Bhudhichandran, Kovi Sampathkumar, V. Gunaseelan and M.V. Karupaiya; Sriperumbudur MP K.N.Ramachandran; and AIADMK office-bearer K. Rajan.\n\nShe also conducted the wedding of Thiruparkadal panchayat union president M.G.K. Dhananchezhiyan and that of T. Rani, daughter of V. Thangavel from Tindivanam.\n\nMs.Jayalalithaa said Rani was close to her. She gave a gift to each of the couples and posed for photographs with them and their families.", 
    "section": "national", 
    "title": "Draw strength from criticisms: Jayalalithaa", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}