{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "By the time she was 16 years old, G. Sadhana had lost all her permanent teeth due to a congenital syndrome. “I was wearing a full set of dentures,” said the 17-year-old first-year medical student from Andhra Pradesh. “But I had to keep removing them and putting them on, and had to eat soft foods,” she said.\n\nA few months ago, Sadhana underwent a surgery for Zygoma dental implants – a form of implants that can be placed with minimal bone support, needs no bone graft and that requires just one surgery, said Gunaseelan Rajan, medical director, Rajan Dental Care.\n\nMore and more youngsters are seeking dental implants, say specialists in the city, and for a number of reasons. Increased awareness about the procedure, lower costs and a range of products now available make it the preferred form of treatment. “Also, more research and publications on the procedure have made specialists more comfortable giving implants to younger people,” said Dr. Rajan.\n\nDental implants are gaining importance across all age groups with greater emphasis on older teenagers and young adults, said S.M. Balaji, director, Balaji Dental and Cranofacial Hospital.“I have seen a tremendous increase in patients opting for implants over the last couple of years,” he said.\n\nYashwanth Venkataraman, medical director, Parasu Dental Centre said: “We have now started using implants on teenagers, from the age of 17 upwards. A majority of those who come in have congenital problems – missing lateral incisors, for instance. If they are very young, we put them on braces and a temporary replacement and then, when they are about 17 or 18, they get a permanent implant.”\n\nIn his experience, the number of youngsters coming in has increased by about 200 per cent in the last five years, he said, with at least one case a month.\n\nThe other common reason that necessitates implants, doctors say is trauma – accidents, falls or injuries from contact sports.", 
    "section": "national", 
    "title": "Early dental implants catching on", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}