{
    "author": [
        "L Renganathan"
    ], 
    "text": "A view of the line-up of 11 deities mounted on Golden Garuda during the festival at Thirunangoor, near Sirkali in Nagapattinam district, late on Tuesday night.— PHOTO: M. SRINATH\n\n11 Vishnu deities mounted on golden Garuda vahanams assemble at the ancient pilgrim centre\n\nThe sublime spirit of the bhakti cult radiated remarkably from the thousands of devotees who braved the chilly weather in foggy conditions to congregate from various parts of the southern India at the hallowed Thirunangoor near Sirkali in Nagapattinam district all through Tuesday night on the occasion of the famed 11 Garuda Seva festival.\n\nProcessional deities of 11 Divya Desams adored by the Alwars around the Thirunangoor village arrived on their glittering gold Garuda mount at the Narayana Perumal temple mandapam yard late on Tuesday.\n\nAfter the mangalasasana vaibhavam by Thirumangai Alwar, the last of the Alwars who had sung hymns in Nalayaira Divya Prabhandam on each of those deities, priests from those shrines offered the ritualistic temple honours to the Alwar following which the saint bestowed his grace on the great vaishnavite savant Manavala Mamunigal’s icon.\n\nThereafter, Manavala Mamunigal first left the mandapam followed by the Thirumangai Alwar with his consort Kumudhavalli Nachiyar on the Hamsa mount. The unique aspect of the festival is that the Manavala Mamunigal icon would be carried in the front with him facing the Alwar.\n\nThe other deities in their golden Garuda mount were carried in a procession of grand Garuda Seva around the streets of the Thirunangoor village all through the night accepting offerings from the devotees at their doorsteps.\n\nMore than 50,000 people from various parts of Tamil Nadu, Andhra Pradesh, Telangana, Karnataka, and Puducherry had come to witness the grand spectacle of 11 Garuda Seva. Several spiritual and voluntary organisations arranged for annadanam and Thatheearadhanam through the night.\n\nThe TNSTC operated special buses to various destinations in the region from Thirunangoor to cater to the demands of the devotees.\n\nPolice, led by the Sirkali Deputy Superintendent of Police Venkatesan had made elaborate security arrangements on the occasion.\n\nMedical teams were formed to meet emergency.\n\nNagapattinam District Collector S. Palanisamy offered worship at the commencement of the Garuda Seva rituals.\n\nOver 50,000 from various states thronged the town\n\nto witness the grand spectacle", 
    "section": "national", 
    "title": "Glittering Garuda Seva lights up Thirunangoor", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}