{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Members of Tamil Nadu Government Employees Association staging a protest at the Salem Collectorate on Wednesday (right) an office room in Erode Collectorate looks deserted on the first day of strike.- Photos: E. Lakshmi narayanan and M. Govarthan\n\nUrging the State Government to fulfil their charter of demands, the members of Tamil Nadu Government Employees Association (TNGEA) began their indefinite strike here and also staged a protest outside Collectorate on Wednesday.\n\nMembers said that during the last election campaign for Assembly elections, the AIADMK had promised to scrap the new contributory pension scheme and restore the old pension scheme.\n\nHowever, in five years, the promise remains only on paper, they added.\n\nMembers demanded dearness allowance on par with Central Government employees, demanded distribution of increment in cash and immediately re-appoint Makkal Nala Paniyalargal who were dismissed from service earlier.\n\nVacancies\n\nProtestors said that over one lakh vacancies are yet to be filled in various government departments and demanded filling of vacancies. Also, they urged the government to declare employees of corporation, municipality, town panchayat and other local bodies as government employees and distribute salary through treasury.\n\nAlso, persons who have sought appointment on compassionate grounds and have submitted applications should be given jobs immediately apart from increasing the family protection fund to Rs. 10 lakh.\n\nThey also wanted the government to undertake the medical insurance scheme for the government employees. More than 75 employees participated in the protest.\n\nSpecial Correspondent from Erode adds\n\nStrong impact of the indefinite strike by Tamil Nadu Government Employees' Association was visible on the very first day on Wednesday.\n\nAccording to TNGEA functionaries, not less than 7,000 of its members consisting of officials and employees in various cadres took part in the strike calling upon the State Government to immediately fulfil their 20-point charter of demands that included scrapping of contributory pension scheme and restoration of the old scheme.", 
    "section": "national", 
    "title": "Govt. staff begin indefinite strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}