{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "It was a night to remember for the basketball stars who had lined up for the grand finale of the all India inter-collegiate basketball tournament for men and women, organised by the Jayalakshmi Sports Academy (JASA) at the VOC Park Corporation Sports Complex courts here recently.\n\nThe spectators expected a thrilling contest between the teams but the organisers had something more for them. It aired the best of the NBA games on the big screen much to everybody’s surprise. And, the crowd roared in joy to see their all-time greats in Michael Jordan and Lebron James dazzle like never before.\n\nIt did the raise energy levels of the players. And, they pushed that extra bit to finish on top. To further up their spirit, JASA had some special dance treats between points. This is probably the first time that a tournament of any stature in this part of the region is witnessing such a visual treat. It was, without doubt, a spectacular show of skill, grit and sportsmanship by both the performers and the players.\n\n“We have never seen something like this before,” said G. Selvaraj, president, Coimbatore District Basketball Association (CDBBA).\n\n“We may now have to take extra efforts to further raise the level of our show when we conduct the all India basketball tournament for the Nachimuthu Gounder Cup in May this year,” he added.\n\nR. Syril Irudhayaraj, the CDBBA secretary, was quick to back his statement.\n\nBaboo Vivekandaon, JASA’s founder and secretary, was a happy man too. He was obviously thrilled with the bouquets showered on the conduct of the tournament from various quarters. He called it team work.\n\nThe tournament, which included the big boys for the first time, saw a new winner in SRM University (Chennai). And, the took home the V.R. Kumaravel Memorial Trophy. Assumption College (Changanaserry, Kerala) wrested the Jayalakshmi Memorial Trophy for women.\n\nThe late Kumaravel’s family members Nirmala Kumaravel, Prem, Vikram Senthil and Maragadha Lakshmi gave away the awards.", 
    "section": "national", 
    "title": "JASA lights up the night for players", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}