{
    "author": [
        "B Kolappan"
    ], 
    "text": "Over 1,000 birds participated in the race and but only about 200 birds came back.— File PHoto\n\nPigeon rearers in Chennai and other parts of Tamil Nadu are in a state of shock as more than 80 per cent of the birds released by them from Vinukunda in Andhra Pradesh on January 8 have not returned home. Over 1,000 birds participated in the race and only about 200 birds came back.\n\n“I have never seen such a great loss in 30 years of my experience as a pigeon fancier. I think the birds might have lost their magnetic navigation due to climate change, particularly after Chennai witnessed the flood,” said Mr K. Palaniappan, president of South Indian Racing Pigeon Society.\n\nA few pigeons took part in this race completed the distance in five hours, even though the fixed time was seven hours. Vinukonda is 325 km away from Chennai and a few birds released at 9.30 am reached Chennai on Sunday evening itself.\n\n“I flew 27 birds. But only two of them returned, and that too on Monday. It is a great disappointment and I am wondering if I can afford to continue the hobby, spending a lot of money,” said R.T. Venkatesh, one of the fanciers, whose pigeons have won long-distance championship three years successively.\n\nFilm director and national award-winner Vetrimaran said only 11 of his 23 birds reached Chennai.\n\nS. Gokul, another pigeon rearer says he lost 11 birds.\n\nHomer, a variety of domestic pigeon, is used in the races. Many have imported it from Belgium and Australia.\n\nCostly hobby\n\nA locally-bred bird will cost between Rs. 5,000 and Rs. 10,000, while an imported bird costs up to Rs. 1 lakh. Keeping the bird is also a costly affair as a fancier spends over one Rs. 1 lakh for around 200 birds. They need a special diet, which includes groundnut, linseeds, gingelly seed, sorghum, sunflower seeds, besides vitamin and other nutritional supplements.\n\n“The bird was created by selective and captive breeding of Colomba Livia, a feral pigeon species. The large-scale missing of pigeon could have happened due to a local phenomenon as the species are attracted by opposite sex. We can ascertain the fact only if we have a scientific study,” said ornithologist Robert Grubh, former principal scientist of the Bombay Natural History Society (BSNL).\n\n“Longing for incubating eggs and chicks normally drives the birds to reach home as early as possible. Mating season also plays a role in increasing the flying speed of the bird,” said Mr. Venkatesh, who has over 170 birds.\n\nOne fancier, however, said the environment was not conducive for the birds to fly. “The birds were not ready and they would have lost their orientation and strayed. Even a cloudy sky may encourage a bird to fly high and in the process they might have lost their visual and magnetic sense,” he said.\n\nBut some of them completed the seven-hour race in five hours", 
    "section": "national", 
    "title": "Many pigeons taking part in race fail to return home", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}