{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "he presence of various passenger-friendly amenities in all railway stations on the Salem–Namakkal – Karur section has been hailed by the travelling public.\n\nEven while appreciating these facilities, the commuters of Salem, Namakkal and Karur districts have demanded introduction of more trains in this section to meet the demand.\n\nTrains were introduced in the newly laid broad gauge Salem-Namakkal-Karur section in May 2013. The work of laying the new BG track commenced in 1996-97 at an estimated cost of Rs. 229.88 crore and the project was completed in 2013 at a total cost of Rs. 750 crores. The line covered a distance of 85 km.\n\nA majority of the railway stations such as Rasipuram, Namakkal, Mohanur, Vangal on this section are elevated stations. Mallur and the two halt stations of Puduchathiram and Laddivadi are the other stations on this section.\n\nThe major stations of Namakkal, Rasipuram and Mohanur have spacious car parking lots.\n\nThe other facilities available in these stations are ramps for differently abled, sub-ways connecting main entrance with the platforms, waiting halls with adequate seating arrangements, toilets, approach roads and disaster management boards prominently displaying the emergency phone numbers, hospital phone numbers and distance from the station, and mobile numbers of members of service organisations.\n\nThe Namakkal and Rasipuram railway stations have mini-reverse osmosis plants and water coolers. The separate garbage bins for depositing bio-degradable and bio-non degradable wastes at Namakkal station has been widely appreciated by the people. These stations also have eye-catching paintings depicting the details of the local places of importance.\n\nMallur railway station, located about 10 km from Salem, is a small station. But the station has facilities such as foot over-bridge connecting both the platforms, waiting hall, booking office, and a brand new housing quarters for the station staff.\n\nPassenger reservation system\n\nWhile commending the Railways for creating the facilities, the local people complain that in the entire section, only Namakkal station has the passenger reservation system (PRS) centre. The railway reservation counter that was functioning at the taluk office in Namakkal town was upgraded and shifted to Namakkal Railway Station. But it functions only from 8 a.m. to 2 p.m.\n\nRasipuram in the Salem-Namakkal section and Mohanur in the Namakkal – Karur section are two major railway stations. Rasipuram is a municipal town famous for ghee, handloom silk sari units and various educational institutions. It is also famous for the Lord Shiva Temple constructed by the King Valvil Ori. A large number of workers are employed in the Salem Cooperative Sugar Mills in Mohanur. The commuters of Rasipuram and Mohanur towns and the surrounding areas have to travel for about 25 km either way for reaching the PRS for booking tickets, says K. Murugan, member, Mohanur Rail Commuters Welfare Association. He urged the Railways to set up PRS in Rasipuram and Mohanur railway stations, and also extend the working hours at the PRS at Namakkal Railway Station.\n\nMr. Murugan also pleaded for canteen facility in Namakkal, Rasipuram and Mohanur stations too, besides halting express trains at Mohanur.", 
    "section": "national", 
    "title": "More facilities bring cheer to passengers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}