{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The Tamil Nadu Congress Committee (TNCC) faced a fresh controversy on Wednesday with rival factions questioning the authenticity of the ongoing process of receiving nominations forms for the upcoming Assembly polls.\n\nCadres who turned up at Satyamurthy Bhavan, the TNCC headquarters, had other queries as well. Some wanted to know if the party would return the nomination money collected with the applications in case the particular constituency was not allotted to the Congress in an alliance.\n\nSources said factions opposed to TNCC president E.V.K.S. Elangovan, including supporters of former Union Ministers P. Chidambaram and K.V. Thangkabalu, are gearing up to the take up the matter of ignoring procedures with national secretary Mukul Wasnik on February 12.\n\n“The notification announcing the process did not come from Mr. Elangovan. It was issued by a spokesperson. The AICC has not made any formal announcement,” a supporter of Mr. Chidambaram pointed out.\n\nOn Wednesday, many who turned up to collect the forms had several doubts in mind. “What if the party is not allotted the constituency I am applying for? Since they are collecting for all 234 constituencies, this is a big doubt for many of us,” said a party member from Tirunelveli.\n\nAccording to a former MLA, the TNCC did not collect any nomination money for 2006 Assembly polls.\n\nThe payment process was restored in 2011 since the party faced a funds crunch in Tamil Nadu. This time, the nomination fee has been fixed at Rs. 5,000.\n\nWhen contacted, Congress spokesperson A. Gopanna said the party was indeed collecting applications for all 234 constituencies.\n\n“If we enter an alliance and a particular constituency is not allotted, the amount paid would be taken as a donation for the party. The funds would be used for party work including elections,” he said.\n\nMultiple nominations\n\nMeanwhile, multiple nominations were filed by supporters on behalf of Mr. Elangovan and national spokesperson and actor Kushboo.\n\nTMC receives applications\n\nThe Tamil Manila Congress too on Wednesday began collecting nominations from party members aspiring to contest the polls.", 
    "section": "national", 
    "title": "Nomination process too in trouble in Congress", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}