{
    "author": [
        "K Manikandan"
    ], 
    "text": "Passengers can order two sheets and a pillow for Rs. 140; a blanket for Rs. 110\n\nA good night’s rest on a brand-new bedspread, sheet and pillow after a nice hot meal is the latest that Railways have to offer for passengers boarding long-distance trains from the city.\n\nThere is a bonus: the bedrolls can be taken away by passengers after they reach their destination. The facility, meant for passengers with a confirmed ticket, irrespective of classes, is currently available for trains leaving Chennai Central.\n\nPassengers have to make their bookings with Indian Railway Catering and Tourism Corporation (IRCTC)upto five hours before the scheduled departure of their train from Central, officials said.\n\nThe Southern Railway has rolled out two types of bedrolls — one with two sheets and a pillow and the second with just a blanket. They are priced at Rs. 140 and Rs. 110 respectively.\n\nNeed for more publicity\n\nSince the formal launch of this facility by Railway Minister Suresh Prabhu at a function in Tambaram last week, a good number of orders have come from passengers travelling in air-conditioned compartments, who will continue to get two white sheets, a pillow and a woollen blanket, staff at Tourism Facilitation Centre (TFC) of IRCTC told The Hindu.\n\n“I was not aware of it until today. The railway administration needs to step up publicity about the scheme for more passengers to avail themselves of it,” said A. Rangarajan, a former Central government employee who was travelling to Nagpur.\n\nOn Tuesday, S. Rao, an elderly passenger travelling with his wife in an AC coach to Hyderabad, said that as the bedrolls could be taken away, the IRCTC should improve their quality as they were slightly coarse now.\n\nFacility for all\n\nPassengers also suggested that the facility should not be restricted only to those who had access to internet and that it should be open to others too.\n\nThe IRCTC staff said since its launch, they were supplying about 20 bedrolls a day to passengers at Central.\n\nV. Ganapathy, deputy general manager, IRCTC, Chennai, said they were also planning to expand their e-catering operations.\n\nAt present, only passengers at Central, Egmore, Madurai and Katpadi had the option of booking food supplied by a few restaurants.\n\nThey were working on roping in other e-commerce firms and even voluntary organisations to expand the menu as well as offer wholesome low-cost meals, Mr. Ganapathy added.", 
    "section": "national", 
    "title": "Not just food, buy bedspreads too online with rail tickets", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}