{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Political parties in Union Territory of Puducherry on Wednesday urged the Election Commission of India (ECI) to check money power and freebies to voters during the Assembly polls.\n\nThey have demanded that the ECI should conduct a comprehensive campaign on ethical voting. They have also suggested that complaints made by political parties and candidates should be acted upon promptly and all of them should be kept intimated.\n\nSubmitting a memorandum to the ECI during its consultations, Puducherry Congress Committee vice-president and former minister V. Pethaperumal and former MLA Neela Gangadharan said all the election officers and police officers should be neutral and act as true, representatives of the ECI during polls.\n\nThey also said IAS officers who are recruited directly should be posted as District Election Officer and Returning Officer as per rule and promotee officers should not be posted in election work. Moreover election officers should not be assigned any other executive work except election process.\n\n“Since Puducherry is a small territory, officers working more than two years may be transferred to places which are not connected with their residence or working place. Local school teachers may be allotted for election work such as issue of booth vote slips,” said Mr. Pethaperumal.\n\nFreebies\n\nRepresenting the Communist Party of India (CPI), State Committee Members K.Murugan and T. Geethanathan said ahead of elections, many individuals have distributed freebies such as sugar, rice, induction stove, mixer, grinder and even token for groceries at many places to attract voters. They have requested the commission to conduct a complete enquiry through the Income Tax department about their income and expenditure sources besides stopping such activities.\n\nR.Rajangam, CPI-unit secretary said the ECI should ensure the cases filed against the persons, who indulged in bribing voters, to be disposed expeditiously.\n\nDMK and AIADMK parties demanded that the elector rolls have to be purified further and should be free from error. AINRC General Secretary and MLA V.Bhalan urged the EC to conduct a one day poll along with Tamil Nadu.\n\n“All parties assured the commission of their full support in ensuring free and fair polls,” said Dr. Zaidi during the press conference.", 
    "section": "national", 
    "title": "Parties urge ECI to keep a tab on freebies during polls", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}