{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "For the past two years, I’ve decided to focus on Carnatic musicians because as far as I can see, nobody has specialised in this genre”\n\nBalaji’s charcoal portraits prove Leonardo da Vinci’s observation right: ‘simplicity is the ultimate sophistication.’ Working with powdered charcoal crayon, the artist has created at least 60 portraits of contemporary and yesteryear Carnatic musicians, a selection of which was recently displayed on the sidelines of the 169th Thyagaraja Aradhana music festival (January 24-28) in Tiruvaiyaru.\n\nWhat elevates Balaji’s work from the rest is the fact that he uses just the tip of his little finger to apply the charcoal powder, a process that can leave his skin sore when done for more than 2 days at a stretch. “It’s a simple step, but can really give great results. Sometimes even professional artists come up to ask me how I get the photographic depth in my portraits.”\n\nThe play of light and shadow is achieved with the skilled use of negative space on white board, he added. “You have to be very careful when you work with monochrome, because mistakes show up very clearly in black and white,” said Balaji.\n\nThe son of farmer parents in Thiruvaiyaru, Balaji said his earliest ambition was to learn classical music and become a singer. “But I didn’t get any support at home,” he said. “Then I realised that I had a talent for drawing, so I shifted my goal towards formally learning art.”\n\nHaving done his Masters degree from the Government College of Fine Arts, Kumbakonam, Balaji spent over 12 years working as a 3-D animator for an IT major in Hyderabad. “But it distanced me from art,” he recalled. “I used to make human figures on the computer, after which other teams would add the bone structure, movement and so on. It was an artist’s work, but with far too many technicalities. I never got the time to draw for myself when I was working.”\n\nHit by the slump in the IT industry in 2009, Balaji held out for another two years before deciding to return home and, in a way, to his first love. “For the past two years, I’ve decided to focus on Carnatic musicians, because as far as I can see, nobody has specialised in this genre,” said Balaji. “And since Thiruvaiyaru is known as the cradle of Carnatic music, I can now indulge my love for both art and music through these portraits.”\n\nBalaji finds it easier to draw male singers because they usually don’t wear elaborate ensembles when performing. A portrait of singer Sudha Raghunathan took him six days to complete because of the intricate designs on her silk sari, he added.\n\nFrom K.J. Yesudas, M.L. Vasanthakumari, Bombay Jayshree, Mahathi and so on, the artist reckons he has only been able to portray 20 major Carnatic artistes in a list of at least 70 leading figures in the field. “I’m making trying to do it chronologically, and diversify into portraying music composers as well. Portraits of M. S. Subbulakshmi are always very popular, and I’ve sold at least five of them since I started out.” Balaji’s drawings are priced in the range of Rs. 9,000 to Rs. 12,000.\n\nBalaji hopes to pass on his passion for drawing to the younger generation by becoming an art teacher while remaining an artist. “I want to use my art education to the maximum,” he concluded.\n\nFor the past two years, I’ve decided to focus on Carnatic musicians because as far as I can see, nobody has specialised in this genre”", 
    "section": "national", 
    "title": "Portrait of an artist", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}