{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Out of 1000 ATMs earmarked as target in India, 29 ATMs will come under the southern region\n\nPost offices in the southern region were much ahead in migrating to core banking solutions (CBS), J. Charukesi, Postmaster General, Southern Region, said after inaugurating an ATM on the premises of Arumuganeri sub-post office on Wednesday.\n\nSimilar ATMs would also come up at Thoothukudi and Srivaikuntam. The customers maintaining savings account in the Department of Posts could now withdraw cash through this ATM anytime.\n\nA maximum of Rs.25,000 could be withdrawn at the ATM. With a total of 751 sub-post offices and 29 head post offices in the southern region, CBS network migration had been completed in 714 post offices and the rest of the offices would be equipped with similar facilities within March this year.\n\nShe said Tamil Nadu was the first State to have established this ATM facility in post offices. Out of 1000 ATMs earmarked as target in India, 29 ATMs would come under the southern region.\n\nAs of now, six ATMs, including Arumuganeri sub-post office, had been opened and plans were on to open up this facility at Arasaradi in Madurai on February 19.\n\nThe postal department came forward to open payment banks with Reserve Bank of India’s nod. All financial remittances could be made on a par with other banks, but no option for providing loans, she said.\n\nMs. Charukesi said a proposal had been sent to establish a logistic post centre at Sivakasi citing its business potential and the facility was expected soon.\n\nShe said modernisation at rural post offices was in the pipeline. As many as 274 rural post offices in nine revenue districts under the southern region would come under Information and Communication Technology (ICT).\n\nSuch post office branches would emerge as common service centres. Initially, the rural ICT facility was rolled out in Bihar. Besides, the Postmaster General said the department was stabilising parcel net software and it would take off soon.\n\nWith adequate infrastructure, experience and manpower, no other agency could overcome our postal services. There was a good response from customers, she said referring to ‘Selvamagal Semipu’, a new deposit scheme, for the girl child, which offers high interest rate of 9.3 per cent.\n\nUnder this scheme, as many as 2.53 lakh accounts had been opened in the southern region, so far. As for savings account, this region has 65 lakh accounts, she said.\n\nR. Raju, Senior Superintendent of Post Offices, Thoothukudi Division, M.R.T. Ravi Mohan, Postmaster, K. Shanmuga Priya, Assistant Superintendent, Kalyanasundaram, President, Arumuganeri town panchayat, and others attended.", 
    "section": "national", 
    "title": "“Post offices in south migrating to core banking solutions”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}