{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "To be done on foundations of the old span as they are “strong”\n\nThe railways, which was replacing the ageing Scherzer’s span at the century-old Pamban rail bridge, has decided to erect the new span on the foundations of the old span themselves as they were found to be strong.\n\nThe existing four well foundations, embedded in the sea, were tested to ascertain the grip length and integral damage and they were found to very strong enough for the erection of the new span on them, said Suyambulingam, Chief Engineer (Bridges).\n\n“This is one of the good things we achieved ahead of the replacement work,” he told The Hindu after inspecting the foundations here on Wednesday and assessed the strength of the foundations, using ‘echo sounder’.\n\nAs there was no need for laying new foundations, the replacement work could be carried at a shorter span of time than expected, he said, adding the Rail Vikas Nigam Limited (RVNL), chosen by the Railways to fabricate and build the new span, is likely to take up the work in April or May.\n\nThe Ministry of Railways had already sanctioned Rs.25 crore for replacing the existing manually operated 65.23 metre long rolling type span, named after Scherzer, the German Engineer who had designed the span, which would open up like a pair of scissors for vessels to pass through the bridge.\n\nAfter studying various options, the railways has zeroed in on a ‘single span type’, a 66-meter-long single truss span to replace the existing two leaves Scherzer’s span, Mr Suyambulingam said.\n\nThe Indian Institute of Technology (IIT) Madras, which was entrusted with the task of designing the span, has almost completed the designing, he said.\n\nThe new span would be built using imported Corrosion-Resistant Steel (CRS), he said adding after the IIT(M) presented the design by this month-end, RVNL would commence the fabrication work at Pamban in April or May after bringing the materials.\n\nThe fabrication work was expected to be competed during the last quarter of this year and the new span would be installed by the end of this year or early next year, he said. The actual erection of new span could be done in a month’s time, he said.\n\nThe lesser weight new span could be opened in a minute, just by the press of a button to allow more vessels to pass through, he said. The new span would also facilitate operation of 26 bogie trains on the bridge to Rameswaram island, five bogies more, he said.", 
    "section": "national", 
    "title": "Railways plans to erect new span at Pamban rail bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}