{
    "author": [
        "L Renganathan"
    ], 
    "text": "Neither the biting cold nor the surrounding noisy commercial cacophony could distract them. It was not the midnight fog but simple bhakti that drenched the hundreds of devotees who listened enthusiastically amidst the green fields to the uncomplicated Harikatha by the down-to-earth bhagavathars on a makeshift dais as the night progressed on the 11 Garuda Seva festival at Thirunangoor village on Tuesday night.\n\nRamanuja Dasan Sri Veeranarayanan, sporting a bright thiruman, and his troupe of six bhagavathars performed the Sri Krishna Ganam especially for the Garuda Seva, captivating the spectators. Sri Veeranarayanan from Ramapuram in nearby Cuddalore district has been doing exactly that to his heart’s content — singing in praise of Perumal.\n\nHe is happy to compose songs in praise of the Lord and Saint Ramanuja and render them, spreading bhakti among the masses. His organisation Ramapuram Sri Ramanuja Koodam has been organising “Thatheearadhanam” (anna dhanam) for 10 days during the Chitrai Brahmotsaam at Thiruvaheendirapuram in Cuddalore district. For a small farmer, this has been a tall achievement feeding the pilgrims for the past few years.\n\nSri Veeranarayanan during his early days was going around the streets (he insists thiru veedhi, and not theru) in many divya desams with his group rendering bhajans. Over the past decade or so, he has switched over to the stage performance where he delivers Harikatha peppered with lilting numbers eulogising various deities and acharyas.\n\nSri Veeranarayanan and his troupe have performed the Sri Krishna Ganam programme in Kanchi, Chennai, Tiruvannamalai, Dharmapuri, Krishnagiri, Salem, Coimbatore, Tiruchanoor near Tirupati and Melukote near Mysuru over the past several years. The light music style of rendering Divya Prabhandam does not reduce the sanctity of the songs but in fact helps in reaching them to the common masses instantly. The chorus chanting and clapping they evoked on Tuesday night when he rendered the bhajans stand testimony to this.", 
    "section": "national", 
    "title": "Rendering Divya Prabandam in a popular format", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}