{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Senior citizens oppose any move to remove them even if they draw very few letters daily\n\nThe old, red, bulky letter box is slowly becoming a rarity. With letter boxes having to be cleared only once a day and, often times, taking around five days to gather a sizeable number of letters, they seem to a superfluity.\n\nUntil a few months ago, letter boxes were cleared at least thrice a day. Now, postmen say they check for mails in the red boxes only around 4 p.m. in the evening and sometimes, return with one or just two mails.\n\nChennai has over 1,100 letter boxes, predominantly pillar boxes and TV-shaped square boxes and, at 1,350 letter boxes; the suburban areas are slightly better-placed.\n\nSurprisingly, the Department of Posts’ move to rationalise installation of letter boxes according to specific needs in an area has met with resistance.\n\nThe decision has not gone down well with residents of areas like Tondiarpet, Rajamangalam, Villivakkam, Perambur Barracks and Mehta Nagar.\n\nOfficials say senior citizens, who make use of letter boxes on the street corners, oppose any move to remove them even if these boxes draw very few letters every day. On an average, a letter box is provided for a radius of about two km.\n\n“But, we do install more letter boxes in the same area if the number of mails posted there is on the higher side,” said an official.\n\nMore requests pour in\n\nThe department continues to receive requests from residents in developing suburbs for installing letter boxes. Last year, a total of 25 requests for letter boxes were received from localities such as Saligramam, Taramani, Gerugambakkam, Madipakkam Ram Nagar and Kolathur.\n\nBut, these requests are scrutinised depending on the need and only 10 have been sanctioned so far. This includes those near fuel bunks as patronage has improved there.\n\n“We reduced the number of mail clearances to one every day as manpower is often wasted on checking letter boxes in areas with less mail traffic. We wanted to take stock of the need of letter boxes but met with resistance in some areas,” said Mervin Alexander, Postmaster General, Chennai City Region (CCR).\n\nReplacing damaged boxes\n\nAt present, nearly 2.40 crore unregistered mails are being received and delivered in the CCR every month.\n\nThe department is now focussing on replacing the boxes damaged during floods rather than installing new ones.\n\nThis is probably also because the funds have not been allotted to install new ones this fiscal compared to Rs. 1.65 lakh sanctioned during the previous fiscal.\n\n“Some post offices improved under Pilot Arrow Project have letter boxes with a steel body. We are mulling over whether letter boxes in plastic can be introduced for better maintenance,” said Mr. Alexander.", 
    "section": "national", 
    "title": "Residents don’t want to lose letter boxes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}