{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Sages-Femmes Sans Frontieres and Indian Midwives Association will set up a centre\n\nDelphine Wolff, Medical Coordinator and Head of Mission of Sages-Femmes Sans Frontieres, with newborns at a rural home in Puducherry.— Photo: Special Arrangement\n\nHere is a helping hand from France for rural women in labour lacking access to traditional or tertiary maternity support services.\n\nThe Sages-Femmes Sans Frontieres (SFSF), or the Midwives Without Borders organisation based in France, will be helping the Puducherry unit of the Indian Midwives Association to strengthen trained midwifery.\n\n“We are formulating a project to strengthen the midwifery and newborn care system in Puducherry with French assistance,” said Delphine Wolff, Medical Coordinator and Head of Mission of SFSF.\n\nFor the past couple of years, Ms. Wolff has been engaged in projects to reduce maternal and neonatal mortality through participatory community education in secluded tribal communities such as the inhabitants of the Kalvarayan Hills in Villupuram, Tamil Nadu.\n\nAt present, the Indian Midwives Association led by its president Malar has been holding free medical camps focusing on pregnant women and newborn in rural areas. Already, five such camps have been held.\n\nShortly, in partnership with SFSF, the Association will establish a ‘house of birth,’ which will be a full-fledged centre for performing deliveries and providing post-partum care.\n\nThe centre will be adequately staffed and operational round-the-clock. It will also have ambulances to transport women from their homes for delivery.\n\nThe project is supported by French agencies such as the EDF Foundation, Rotary Club of Cavaillon, Care Midwife and Sanofi Foundation, she said.\n\nAccording to T.R. Anbazhagan of the Indian Midwives Association, there are several pockets in rural Puducherry and neighbouring districts of Tamil Nadu where pregnant women lack easy access to maternity services.\n\nThis seems to be the case in many areas in the hinterlands untouched by the advances brought about by the National Rural Health Mission. In fact, a 2013 UNICEF-commissioned study had highlighted that there remained serious, persistent gaps in safe delivery capacity at the primary level, especially sub-centres and remote PHCs, despite efforts to decentralise care through the NRHM.\n\nIn particular, the study had called for a national commitment to the creation of a nurse-midwife cadre in addition to addressing gaps in rural health worker availability through reforms and strengthening and diversifying health worker cadres to fill key gaps in preventative, curative, intra natal, and immediate postnatal care.\n\nAnd, not just in India, even in countries like France there is a huge shortfall in qualified birth attendants, says Ms. Wolff.", 
    "section": "national", 
    "title": "Rural women can look to ‘house of birth’ soon", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}