{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Chennai’s largest multiplex chain, SPI Cinemas, popularly known as Sathyam Cinemas, will be stepping into the Mumbai market by taking over Globus Cinema, an existing theatre which belongs to the Raheja Group. The theatre in Bandra has a single screen with 200 seats.\n\n“The deal with Globus Cinema has been concluded and the facility will be operational soon. The property has been let out for a nine-year lease,” said a key player from the entertainment industry who was instrumental in sealing the deal.\n\nNeither the SPI Cinemas nor the Raheja Group could be reached for comments.\n\nIt is learnt that SPI Cinemas was scouting for a property in Mumbai for more than a year now.\n\n“Due to space constraints, building a new theatre in Mumbai would not be possible. It makes economic sense to acquire a screen and then experiment with it,” he also added.\n\nBased on the current market price in Bandra, the group would be paying anywhere between Rs. 12-13 lakh as rental per month.\n\nMarket sources also said that SPI Cinemas wanted to expand its presence in this zone and was hunting for more properties there. In Bengaluru, the group has already picked up space and work is in progress. “This will commence operations in another six months,” the source added.\n\nHuge shortage\n\nAnalysts in the entertainment industry pointed out that there is a huge shortage of theatres in India. “Currently, Bangalore has 263 screens and Mumbai has 376 screens,” said Senthil Kumar, co-founder, Real Image Media Technologies.\n\nAccording to a FICCI-KPMG report on the Indian Media and Entertainment Industry 2015, “There are just seven screens per million in India, unlike in the US where there are 125 screens per million people.”\n\nAs per the report, China is adding 18 screens per day and at this rate, is expected to be on a par with the US in terms of screen count over the next three years.\n\nCurrently, SPI Cinemas has five properties in Chennai including Sathyam, Escape, Palazzo, S2 Theyagaraja, and S2 Perambur with a total of 8,342 seats. It has one brand in Coimbatore called thecinema which has 1,561 seats.\n\nOutside Tamil Nadu, the multiplex chain has a property, S2 Cinemas at Nellore in Andhra Pradesh.", 
    "section": "national", 
    "title": "Sathyam Cinemas forays into Mumbai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}