{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The SNS junior athletic meet that made a quiet start five years ago has now grown in stature. It attracted over 5500 boys and girls from various schools in and around the city for its fifth edition which concluded at the Nehru Stadium here on Wednesday.\n\nIt only goes to show that the meet is welcomed by all as it provides the right platform for students from all background level.\n\nThere were all age group athletes from Government, Corporation, Matriculation, Anglo Indian and CBSE schools taking part in the two-day event. It did push the level of competition but they did not mind it.\n\nThe SNS Group of Institutions, the organisers of the show, were definitely pleased with the kind of growth. “It is the effort of our team and that of the Kovai Athletic Club. We will continue to do more in our journey,” said Nalin Vimalkumar, Technical Director, SNS Institutions, Coimbatore.\n\nThis year, the organisers also made it a point to recognise the physical education staffers who had played a major role in moulding these stars and shoring their team for the overall championship in this meet over the years. They were felicitated on the opening day of the event.\n\n“There are many meets that I have participated but this is the only one that has honoured us,” said M. Sivakumar, Physical Director, CRR MHSS, Ondipudur.\n\n“This is the first time in my ten-year career that we have been appreciated and felicitated for our efforts,” said T. Arul, Physical Director, GKD MHSS.\n\n“Recognition apart, this meet helps us identify talents. We would be pleased if the organisers include other disciplines as well,” pointed out P. Mohan, Physical Director, SSVM World School.\n\n“By doing this, the SNS Group has set a benchmark for other colleges,” said R. Velmathi, Physical Directress, Sri Avinashilingam HSS.\n\n“Any individual talent without proper grooming cannot become stars. There might be a few exceptions here and there but I believe the core strength lies in the teaching community,” said Mr. Nalin.\n\n“Once we start to appreciate them and give a pat on their back they are likely to give something more,” he added.\n\nHe promised that the journey from here will be only bigger and better.", 
    "section": "national", 
    "title": "SNS junior meet growing in stature", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}