{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "A deserted District Rural Development Agency office at the Ramanathapuram Collecotorate on Wednesday; Government employees staging a demonstration in Dindigul.— Photos: L. Balachandar and G. Karthikeyan\n\nEmployees stage demonstrations in various places\n\nWork in several government departments in Ramanathapuram and Sivaganga districts were affected on Wednesday as members of the Tamil Nadu Government Employees’ Association and Tamil Nadu Rural Development Officials Association’ launched an indefinite strike, pressing 20-point charter of demands.\n\nAbout 10,000 employees in the two districts joined the strike, launched as part of a State-wide stir to press the demands, including scrapping of the new pension scheme, bringing the employees in non-standard time pay scale to time pay scale and filling up existing vacancies. Ganesamurthy, district president of the Tamil Nadu Government Employees Association, who led a demonstration on the union office complex in Ramanathapuram, said that about 3,500 employees joined the stir and work in rural development, employment, commercial tax and survey departments were affected.\n\nThe offices remained open but wore a deserted look, he said.\n\nSivaganga\n\nS. Kumaresan, vice-president, and district president of Tamil Nadu Rural Development Officers’ Association, who led a demonstration in front of the Sivaganga Collectorate complex, said that about 7,000 employees joined the strike in Sivaganga district.\n\nThe strike received an overwhelming support from noon meal, Anganwadi and road workers, he said.\n\nDindigul\n\nSeveral government offices wore a deserted look in Dindigul district on Wednesday owing to the strike. Government employees staged a demonstration in front of the Government Hospital in Dindigul Retired employees also joined the strike and staged a demonstration in front of the Head Post Office in the town.\n\nSimilar demonstrations were staged in front of the Collectorate and union office. The worst affected were the taluk and panchayat offices. Work in almost all government departments was completely paralysed.\n\nTamil Nadu Government Employees’ Association district president Sivakumar said that majority of the employees did not report for duty. Election work was also affected.\n\nMeanwhile, officials in Commercial Tax Department continued their strike for the past three days.\n\nTheni\n\nMore than 80 per cent of the total government employees took part in the strike. Hundreds of employees laid a siege to the Collectorate in the morning. The protesters said that would stage a protest in Chennai on February 12, if the government did not accept their demands.\n\nThey wanted the new pension scheme to be abandoned and jobs provided to ‘makkal nala paniyargal’ who were sacked.", 
    "section": "national", 
    "title": "Strike paralyses work in government offices", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}