{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To maximise enrolment of first-time voters further, the district administration has roped in colleges to facilitate the process.\n\nOn Wednesday, District Collector S. Prabakar convened a meeting of 'college ambassadors' consisting of students and principals of 47 colleges, to reach out to students of voting age and enrolling them online in the voter list, as directed by the Election Commission of India.\n\nThe district administration came out with the final list on January 20 and followed up with two special camps on January 31 and February 6 for inclusion, deletion, name correction, and address change of voters, at 869 polling centre encompassing 2,114 booths.\n\nA total of 19,470 new voters registered their names through the two special camps.\n\nDeletion of 1,853 names were made, and name correction was carried out for 3,873 voters.\n\nAnd address change was carried out for 1,693 voters.\n\nThe principals and students have been entrusted with the task of accelerating awareness on the importance of voting in the campus through facilitating new voters from amongst students, and involve them in marathon, competitions, processsions, elocution, plays, cultural programs, and other innovative programs to drive home the importance of voting.\n\nThe college administration must facilitate online registration through the websitewww.elections.tn.gov.in.\n\nStudents were encouraged to look for the names of their parents, relatives, and neighbours in the list. If the names are found missing, the students could fill in the particulars online. In case of difficulty, assistance would be offered through phone: 98420-26905, 99429-81001, 98943-66369, the Collector said, adding that the top performers in the colleges would be recognised with certificates.\n\nA demonstration on online filling of particulars was made during the orientation programme.\n\nSenior officials including District Revenue Officer R. Sathish, Erode Revenue Divisional Officer R. Narmada Devi, and Election Tahsildar Sethuraj participated in the programme.", 
    "section": "national", 
    "title": "Students roped in to maximise voter enrolment", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}