{
    "author": [
        "S Senthalir"
    ], 
    "text": "Built in 1932, the heritage structurein Oulgaret is worth a visit\n\nThe Mairie building has not yet been documented by INTACH. —Photo: S.S. Kumar\n\nTourists might have another destination to visit in Puducherry.\n\nLesser-known to the public, but no less significant from a historical viewpoint, is another Mairie building which was built during the French rule in Puducherry. After a long delay and abandonment, the building is now restored and revitalised.\n\nWhile discussions are being held over the reconstruction of the Mairie building built in 1870-71 on Goubert Avenue after the iconic structure collapsed in 2014, this Mairie in Oulgaret is an unsung monument that is worth a visit.\n\nBuilt during the French rule in Puducherry in 1932, it housed the Oulgaret Commune Panchayat till 1990s. In 1994, Oulgaret Commune Panchayat became Oulgaret Municipality. In 2002 the office of the municipality was moved from the Mairie building on Mairie Road in Oulgaret to a new building in Jawahar Nagar.\n\nIt has six rooms with a hall and a huge ground. However, this building was left without any proper maintenance due to lack of funds.\n\nAs it is situated outside the city, this building has not yet been documented by INTACH.\n\nCommissioner of Oulgaret Municipality M.S.Ramesh took up the restoration work three months back and completed painting work without much change to the heritage building. “We restored the building without any major changes to the old structure and style. It is now painted in white,” said an official at the Oulgaret Municipal Office.\n\nThe Commissioner also directed officials to decorate the building with lights for the Republic Day. Many tourists have started visiting this place. For now, the Engineering Cell with 15 employees of the Local Administration Department (LAD) is functioning from this building. Once, a new building is constructed for this department, they would move from here.\n\nThis building has been used as an office space by PUTA and self help groups before LDA (Engineering Cell) occupied it.\n\nThe municipality officials have requested Chief Minister N.Rangasamy who visited the building on Tuesday to provide grants for restoring the compound walls and gardening. There is a proposal to house a Smart City office here in the near future if everything goes to plan.", 
    "section": "national", 
    "title": "The city’s lesser-known Mairie building", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}