{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, Namperumal purappadu from sanctum sanctorum in pallakku, 6.30 a.m.; reaching Renga vilasa mandapam, 7.30 a.m.; purappadu from the mandapam in Hanumantha vaganam, 6.30 p.m.; reaching vagana mandapam, 7.45 p.m.; purappadu, 8.45 p.m.; reaching sanctum sanctorum, 9.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Hayagreevar Sannidhi, Sankar Nagar, Srirangam, 6 p.m.; Meadow Castle Residential Complex, Sankar Nagar, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, Amaravathi Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nNational College Department of Commerce : Seminar on HRM in banking- changes and challenges, J.Natarajan, General Manager (HRD), Karur Vysya Bank,inaugurates, 9.30 a.m.\n\nJamal Mohamed College : National conference on Graph Theory, Fuzzy Graph Theory and Their Applications, 10 a.m.; valedictory address by A.K.Khaja Nazeemudeen, college secretary, 3.15 p.m.\n\nGovernment Arts College, Thuvakudi : Seminar on Energy Savings, P.Konthadaraman, former deputy general manager, BHEL, Tiruchi, and S.Mahadevan, energy consultant, PCRA, speak, 10.30 a.m.\n\nChild Development Committee, Rotary International District 3000, St.John’s Vestry Anglo Indian Higher Secondary School and Mahatma Eye Hospital: ‘Feel the gift of sight,’ – awareness programme, A. Jaya, Mayor, chief guest, school campus, 10 a.m.\n\nRotary Clubs of Tiruchi Midtown and Rockcity: Talk on “Let us save the Earth,’ by G.Sundarrajan, Hotel Sangam, 7.30 p.m.\n\nM.A.M.College of Engineering : Workshop on Innovative Electronics, K.C.Tamilventhan, Director, LIFT Technologies, resource person, 9.30 a.m.\n\nOxford Engineering College : Lecture on Smart engineering and design solution, Karthikeyan Rengasamy, solution architect, TCS, resource person, 10 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Seminar on RF Antenna Design Using Feko Tool, 5.30 p.m.\n\nOrdnance Factories Sports Promotion Board and Heavy Alloy Penetrator Project : All India Ordnance and Ordnance Equipment Factories inter-zonal badminton tournament, M.S.Ranganathan, Member, Ordnance Factories Board, distributes prizes, 9 a.m.\n\nBharathidasan University Department of Women’s Studies : National seminar on Women in Public Administration, B.Nalini, former professor, Madurai Kamaraj University, inaugurates, Manjula Rangarajan, Financial Advisor and Chief Accounts Officer, Southern Railway, delivers key note address, Khajamalai campus, 10.30 a.m.\n\nShivani College of Engineering and Technology : Blood grouping camp, 10.30 a.m.\n\nBishop Heber College : Awareness programme on alcoholism, Mullainagar, 6.30 p.m.; awareness programme on Women Rights, Sembattu, 6 p.m.; dental camp, LEAD Office, Srirangam, 2 p.m.\n\nRotaract Club of Mahalakshmi Engineering College : Installation of new office bearers, A.Alagappan, chief guest, 3 p.m.\n\nSt. Joseph’s College Department of Physical Education : Centenary tournaments – volleyball, 7 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}