{
    "author": [
        "P Sudhakar"
    ], 
    "text": "The ‘Vintage Saris’ of Co-Optex, which were introduced exactly six months ago with aesthetic classical designs of yesteryears, have become close to the hearts of buyers, particularly younger generation, to jack up its revenue to greater heights.\n\nTo compete with the private textile showrooms making costly silk saris for a range of occasions during every festival season, the Co-Optex also has pumped in so much of energy and resources for fabricating superior products and enabling it to give a cut-throat competition to the rivals’ products.\n\nThe informal research done by the top brass of Co-Optex is very interesting.\n\n“After we happened to notice the kind of affinity our women have developed over the years to the saris worn by heroines of the 60s and 70s, we planned to reintroduce the ‘vintage saris’ under the ‘Paalum Pazhamum’ series, which became an instant hit in all places even in metro cities like Chennai,” T.N. Venkatesh, Managing Director, Co-Optex told The Hindu during his recent visit to Tirunelveli.\n\nApart from this, the Co-Optex has also revived the ‘three parts’ pattern, temple border, mango designs, all inseparable constituents of vintage silk saris, now to attract even the younger generation owing to the reduced weight.\n\n“As the younger generation want to wear only lightweight saris, we started using thread work instead of ‘zari’ in the silk saris. Besides reducing the weight, this approach also has brought down the selling price of these saris. This classical combination has in fact triggered a kind of wave among the buyers. Hence, all these saris are selling like hot cakes to take the revenue of Co-Optex to Rs. 208 crore in 2015 from Rs. 196 crore in the previous year,” Mr. Venkatesh said.\n\nThough this idea has yielded desirable results, the efforts taken by Co-Optex for achieving this feat is really laudable. Since it has showrooms in northern India also, it worked with National Institute of Design to give a kind of ‘pan-India appeal’ to its vintage products to attract the customers of northern parts of the country also.\n\n“Besides incorporating aesthetical vintage characters in our saris, we also integrated silk embroidery in our saris to take the products to next level,” he said.\n\nWhen unprecedented flood submerged four northern districts, demand for blankets being marketed by Co-Optex increased manifold as it became the first choice for the philanthropists, Mr. Venkatesh said.\n\n“We started using thread\n\nwork instead of zari”", 
    "section": "national", 
    "title": "‘Vintage Saris’ are a hit", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}