{
    "author": [
        "Udhav Naig"
    ], 
    "text": "This brand-new multiplex on G.N. Chetty Road is surrounded by upscale hotels and residential apartments —Photo: R. Ragu\n\nAGS Cinemas has built a four-screen multiplex in Theyagaraya Nagar, thereby helping the locality regain some of the lost ground in the field of entertainment.\n\nA few decades ago, the neighbourhood had four theatres— Rajkumari, Nagesh, Sun theatre and Krishnaveni— which were either converted into commercial complexes or turned into second-rung theatres that played re-releases.\n\nThis brand new multiplex is situated on G.N. Chetty road and surrounded by upscale hotels and residential apartments.\n\nThe effort to build a ‘stand-alone’ multiplex in T. Nagar, one of the busiest parts of Chennai, was inspired by cities such as New York and Paris, says Archana Kalpathi, CEO, AGS Cinemas.\n\n“Our market study showed that a commercial hub such as T. Nagar, which is already teeming with shoppers, has the necessary demand for a multiplex. In Paris and New York, busy shopping areas will have a multiplex. Also, most of our properties are not in the centre of the city.\n\n“And, because we had a parcel of land on G.N. Chetty Road, we decided to go ahead.”\n\nT. Nagar is not just a commercial hub, but also a thickly-populated residentialarea.\n\n“G.N. Chetty road has many apartments. These residents can now walk to a movie theatre instead of going all the way to theatres on Mount Road,” says Sreedhar Pillai, senior journalist.\n\nStakeholders in the film industry are hopeful that more such multiplexes will be built to meet the growing demand.\n\n“Ideally, a city must have seats equalling 5 per cent of the entire population.\n\nIn Chennai, we have 60,000 seats which is barely one percent of the total population of Chennai,” said Abirami Ramanathan, MD, Abirami Mega Mall.\n\nAsked to quote a ballpark figure, Senthil Kumar, co-founder, Real Image Technologies, said that the city needs as many as twice the number of screens it has now.\n\n“Right now, there are about 250 screens. We could go up to 500 quite easily,” he says.", 
    "section": "national", 
    "title": "With new 4-screen multiplex, T. Nagar is back in the game", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}