{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "With no proper financial assistance, MSMEs hit by the 2015 floods have not been able to revive production. A flood-hit unit at the Guindy Industrial Estate.PHoto: G.Krishnaswamy\n\nFor the last 30 days, S Kumar (name changed) has been running pillar to post borrowing money from friends and relatives to repair his machinery and clean up his small unit at Guindy that was hit by the floods. “The banks have not come forward to help and the insurance firms are asking for several documents. I have lost all the documents in the flood. Insurance firms are also asking for photographs of machines that were under water. Who will even think of clicking pictures when the whole unit was sinking,” lamented Kumar.\n\nIt is not just Kumar; there are several members of MSME units who are struggling to start again. More than 14,000 Micro, Small and Medium Enterprises in industrial estates across the state including Guindy, Ekkattuthangal, Ambattur, Padi, Thirumudivakkam, Thiruvallur, Kancheepuram and Cuddalore have suffered losses due to the floods in December 2015.\n\nThey feel that they have been given step motherly treatment by banks, insurance firms, the state and the central governments. They also pointed out that there is confusion regarding the interest rate to be charged by the banks for the rescheduled loans. “Till date no tangible help has been given by the bankers to the flood affected entrepreneurs,” said one of the members who wished anonymity.\n\nAccording to a statement issued by TANSTIA, several representations were given to the Chief Minister’s Office, Chief Secretary, Advisor to Chief Minister, Additional Chief Secretary, MSME department and others. “All our requests have not been taken to the Chief Minister’s perusal,” the statement says.\n\nC Muthusami, President, Tamil Nadu Small and Tiny Industries Association, said, “Instructions were given to the banks by RBI to disburse loans - this is yet to fructify. We had several meetings with the State Level Bankers Committee but again the recommendations are yet to be implemented fully.”\n\n“Last month, Chief Minister Jayalalithaa had announced that for unemployed youth in flood affected districts there should be a relaxation of training norms. She also announced a loan of Rs. 5 lakh for people starting new units. If this loan could be extended for the existing units affected by floods it would be of great relief,” added Mr Muthusami.\n\nTamil Nadu has a strong MSME base with investments of Rs 67,130 crore providing employment to more than 69 lakh persons who produce different products. The state has 11.5 lakh registered units and more than 4 lakh unregistered units.", 
    "section": "national", 
    "title": "Woes of flood-hit MSMEs continue", 
    "subsection": "tamilnadu", 
    "date": "2016-02-11"
}