{
    "author": [], 
    "text": "Religion\n\nMandukya Upanishad: Sri Sankara Gurukulam, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nMahaperiyava Karunai: Indra Soundararajan, Sri Krishna Gana Sabha, T.Nagar, 6-30 p.m.\n\nBaktha Vijayam: V. Gopalasundar, Arunagirinathar Arangam, Kumaran Kunram, Chromepet, 6-30 p.m.\n\nPerumai Mikka Pen Adiyargal: Asthika Samajam, Venus colony, Alwarpet, 6-30 p.m.\n\nThiru Arutpa - Naayagi Bavathil Vallalar: Mozhi Arasi Asokan, Arulmigu Sakthi Vinayagar Thirukoil, P.T. Rajan Salai, K.K. Nagar, 6 p.m.\n\nCULTURE\n\nOrganising Committee: Launch of Publication, Tamil Nadu Thodakkapalli Asiriyar Kootani Masudar Ramunni-Eswaran Maaligai Arangam, 23/47, Singarachariyar St., Triplicane, 5-30 p.m.\n\nKanchi Shri Krishna College of Arts and Science: K. Venkatesan talks on Avvaiyar Tamil Works in Sangam Literature, Kilambi, 11 a.m.\n\nGeneral\n\nThe Art of Living: Launch of 'Pudhumalarchi' social projects, Chettinad Vidyashram School, R.A. Puram, 6 p.m.\n\nYMCA: K. Sheik Meeran talks on 'Poems of Kasi Anandan', YMCA Esplanade, NSC Bose Rd., 6 p.m.\n\nMIOT International: Founder's day programme, Manapakkam, 6 p.m.\n\nSaveetha Medical College: Convocation, Thandalam, 11 a.m.\n\nSrinivasa Gandhi Nilayam: International Women's Day, Ambujammal Street, Alwarpet, 11 a.m.\n\nDhanraj Baid Jain College: Talk on 'Secret of Success', Jyothi Nagar, Thoraipakkam, 11 a.m.\n\nBharatiya Vidya Bhavan: Tamilkudal Tamilpadal programme, Bharatiya Vidya Bhavan, Mylapore, 6-30 p.m.\n\nNarcotics Anonymous: Meeting, Self Help Group, Community Service Center, Kilpauk, 7 p.m.\n\nAl-Anon: Meetings, St. Andrews Church, Oragadam; CSI James Church, Ullagaram; Ezhil Model School, Kodungaiyur; and Port and Dock Educational Trust HSS., Tondiarpet, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Santhome HSS., Mylapore; CBF Church, Banu Nagar, Pudur, Ambattur; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; St. Josephs Anglo Indian HSS., Vepery; Dr. M.G.R. MHSS., Arcot Rd., Saligramam; Port and Dock Primary School, M.P.T. Quarters, New Washermenpet; Christ the King Church, G.K.M. Colony, Peravallur; St. Teresa Church, Nungambakkam High Rd.; ECI Church, Dr. Ambedkar St., Arumbakkam; Bharath Dass School, Perungudi; Karnataka HSS., Habibullah Rd., T. Nagar; and Church of Christ, Anna Nagar, 7 p.m.", 
    "section": "national", 
    "title": "08FEBSTS01_Engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}