{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Services from Vellore and Gudiyatham to Bengaluru augmented\n\nThe newly added fleet of buses that were flagged off by the Chief Minister via video conferencing in Vellore on Monday.- Photo: C. Venkatachalapathy\n\nThirteen new buses have been added to the fleet of Vellore region of Tamil Nadu State Transport Corporation (TNSTC), (Villupuram) Limited.\n\nThe bus services were launched by the Chief Minister via video conferencing from Chennai on Monday. The routes of the 13 new buses are - two will ply from Gudiyatham to Bengaluru, three from Vellore to Bengaluru, one each from Pernambut to Bengaluru, Arcot to Bengaluru and Chennai to Hosur, while five will be operated from Chennai to Dharmapuri, according to a press release.\n\nBus services were being introduced on several new routes in the region.\n\nIn fact, sixteen new buses have already been brought to public use at the beginning of this financial year on behalf of TNSTC, Vellore region.\n\nStarted with 530 buses in 1982, the corporation’s fleet grew to 1,023 buses in 1992. It was merged with TNSTC (Villupuram) Limited and is functioning as Vellore region since December 30, 2004.\n\nPresently, it is operating 737 buses.\n\nOf this, 435 buses were being operated on district routes, while 254 buses were being operated in city routes, and 48 buses were kept as spare buses. These 48 spare buses were operated as special buses including during festivals.\n\nEach day, the buses were operated for a distance of nearly 3.13 lakh km, and close to six lakh commuters were utilising the services. A total of 5,040 persons were employed in the corporation.\n\nP. Karthiyayini, Mayor of Vellore Corporation, N. Ramesh, general manager of Vellore region and deputy managers K. Dasarathan (commercial), Eswaran (technical) and Jayamoorthy (accounts) were present, the release said.", 
    "section": "national", 
    "title": "13 new buses added to fleet at Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}