{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "After 2-week long exercise, District election office identifies names\n\nAround 1.85 lakh names are likely to be wiped off the electoral rolls in the 16 Assembly constituencies in Chennai District. In an exercise spanning two weeks, the Chennai District Election Office has identified 1.85 lakh names that had been wrongly included in the rolls.\n\nA decision on deleting the names is likely to be taken by the Election Commission shortly.\n\nRepresentatives of various parties participated in the meeting chaired by Corporation Commissioner B. Chandra Mohan on Monday to discuss various issues related to finalising of the electoral rolls.\n\nParties such as DMK urged the District Election Office to rectify anomalies in the electoral rolls published on January 20. The party had already requested the Election Commission to direct the Chief Electoral Officer to re-do the final electoral rolls in all Assembly constituencies in the State.\n\nThe Chennai District Election Office on Monday handed over to the representatives of political parties a list of 54,317 voters who were found to have shifted to other localities, 11,0717 voters who have died, 14,131 voters whose names have been duplicated and 6,006 voters who were not ordinary residents of a locality. The political parties will also conduct yet another round of verification before submitting a list of names to be deleted.\n\nAIADMK representative P. Vetrivel who reportedly played a role in ensuring a high rate of name inclusion of first-time voters in R. K. Nagar Assembly Constituency, participated in the meeting. DMK MLA J. Anbazhagan, who also participated in the meeting, said the officials were reluctant to delete the names that had been wrongly included. Participants of the meeting alleged that corrections were wrongly included by officials in the electoral rolls in Chennai. Transposition of entry within Assembly Constituencies had reportedly been made without following due procedures under Section 22 of the Representation of People Act, 1960, they said.\n\nThe participants also pointed to census data, seeking an explanation to the sudden spurt in the voting population in 2016. As many as 19.03 lakh men, 19.24 lakh women and 786 others are on the electoral rolls in Chennai District.\n\nWith 2.96 lakh voters, Velachery is the Assembly constituency with the largest number of electors in Chennai district. Compared to the draft electoral rolls published last year, there is a 3.09 percent rise in the number of electors in Chennai district.\n\nFor the past few years, the Chennai district election office had been carrying out field verification, deleting names on the rolls.", 
    "section": "national", 
    "title": "1.85 lakh names to be removed, says Chennai District Election Office", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}