{
    "author": [
        "R Rajaram"
    ], 
    "text": "Superintendent of Police S. Rajeswari explaining the images generated from the surveillance cameras to Tiruchi MP P. Kumar on Monday.— Photo: B.Velankanni Raj\n\nThe cameras would provide some leads to the police to identify accused personsinvolved in various cases\n\nrime prone spots falling under the Tiruverambur sub division on the city’s outskirts have been brought under closer watch with the installation of a string of surveillance cameras at vantage points.\n\nThe Tiruchi Rural Police has put in place this technology-oriented surveillance mechanism with the multiple objectives of checking crimes, establishing identity of accused involved in property crimes and traffic-related offences, monitoring law and order and solving traffic-related problems.\n\nThanks to Rs. 15.28 lakh funds provided by the Tiruchi Member of Parliament P. Kumar under the Member of Parliament Local Area Development Scheme, the surveillance system was commissioned on Monday. A total of 26 advanced cameras have been installed in seven highly crime prone spots in the sub-division which has Tiruverambur, Navalpat, Thuvakudi, Manikandam and BHEL police stations under its limit.\n\nThe sub-division has thick residential localities, a slew of educational institutions, villages and industrial units. Property crimes of different types, robberies and burglaries, accidents - both fatal and non-fatal - have been reported at regular intervals in this sub-division.\n\nBarring a couple of cameras installed at Deenadayalan Nagar and Kallanai road, the remaining cameras have been fitted at Tiruverambur bus stand, Manjathidal bridge, Kattur, Amman Nagar Junction point, Shanthi theatre and Ezhil Nagar Junction point. The cameras face different directions covering various key spots including a stretch of the Tiruchi – Thanjavur national highway, Navalpat road, Pappakurichi road, Kothappar road, Kallanai road, Kalkandarkottai road and Tiruverambur railway station road.\n\nThe cameras are linked to the control units put up at seven locations including the Ellakudi outpost for round-the-clock monitoring. They were commissioned by MP Kumar in the presence of the Superintendent of Police S. Rajeswari at the Manjathidal Ellakudi outpost along the Tiruchi – Thanjavur national highway. They have a month-long back facility to enable law enforcers sift through the video footages as and when required.\n\nSP Rajeswari told ‘The Hindu’ that the cameras would provide some leads to the police on the identity of the accused involved hit and run cases, robbery and other crimes. Plans were afoot to link all the cameras to the Tiruverambur police station to have in place a centralised monitoring control system.\n\nThe cameras would provide some leads to the police to identify accused persons\n\ninvolved in various cases", 
    "section": "national", 
    "title": "26 advanced cameras installed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}