{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Some of the paintings of artist N. Tamilarasan\n\nArtist N. Tamilarasan has made 50 paintings to depict the importance of forests and why we should conserve them.\n\nIt is the seventh year the artist from Mannambadi village in Cuddalore district is carrying his paintings for the annual thematic exhibition he organises in one educational institution in every district, across the State.\n\nThe focus of the exhibition this year is that forest cover should be spread everywhere and not in a particular place at select pockets.\n\n“It is not enough if we planted a tree in front of our house,” he said.\n\nThese paintings depict how important forests are for us and many animals and insects, and how death of an animal or felling of a tree left a lasting impact on the forest and eco system.\n\nIll-effects of deforestation, killing wild animals for protecting human interests and careless acts such as abandoning wastes in forests and nearby areas that claim the lives of animals were also illustrated in the acrylic paintings.\n\nUnlike the yesteryears there was a twist to his expo this year.\n\n“My paintings were safe at home and were destroyed when Manimuthar River flooded due to heavy rains that ravaged the north coastal districts in December,” he said.\n\nThere was hip high water in his house and it took about a week for it to drain.\n\nRealising the importance of the exhibition he rented a room at Virudhachalam, two days after the floods, to start preparing for the exhibition afresh.\n\n“I painted day and night for three weeks to complete the 50 paintings. I had to do it as invitations were distributed and the awareness drive cannot take a break,” he said.\n\nThree of his paintings in the exhibition reflect the impact of the flood in his district.\n\nTailarasan started his district-wise exhibitions on January 5 at Nagapattinam district. On Friday, it was held at The Nilgiris.", 
    "section": "national", 
    "title": "50 paintings depict importance of forests", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}