{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The new buses were flagged off by Chief Minister Jayalalithaa in Chennai on Monday.— Photo: E. Lakshmi Narayanan\n\nA total of 85 new buses have been added to the fleet strength of Salem Region of the Tamil Nadu State Transport Corporation (TNSTC). The list included 14 mini buses.\n\nChief Minister Jayalalithaa flagged off the new buses at a function held in Chennai on Monday.\n\nWhile 44 new buses, including 14 mini buses, have been inducted to Salem division of the TNSTC spread over in the districts of Salem and Namakkal, 41 buses have been added to the Dharmapuri division serving the districts of Dharmapuri and Krishnagiri.\n\nIn a release issued here, V. Shanmugasundaram, General Manager of the Salem division of the TNSTC, said that while 19 new buses would be operated in the Salem – Bengaluru section, three buses from here to Chennai and eight buses would be used for non-stop service from Salem to Coimbatore.\n\nOf the 14 mini buses, seven would be operated in the Namakkal – Kolli Hills section, three in the Salem – Kolli hills section, three in Salem – Yercaud section and one for Attur – Pachamalai section.\n\nAs far as the new buses for Dharmapuri division is concerned, 18 buses will be operated on the Dharmapuri – Bengaluru section, 12 on the Dharmapuri – Chennai section, one each on the Dharmapuri – Sittur / Madurai / Tirupur / Salem / Vellore / Pazhani route and two on the Dharmapuri – Tiruppatur section. The division has also got three spare buses.\n\nThe allotment of 14 new mini buses has brought cheer to the tribal people and the tourists alike.\n\nMr. Shanmugasundaram said that the Chief Minister had provided new mini buses to the Salem region for the benefit of the tribal people. The mini buses would be operated to villages on Kolli hills, Yercaud hills and Pachamalai.\n\nA function was held at the TNSTC regional headquarters in the city to mark the introduction of new buses. P. R. Sundaram and V. Panneerselvam, both MPs, M. K. Selvaraj and P. Saroja, both MLAs, and senior officials of the TNSTC were present on the occasion.\n\nERODE\n\nTwenty four new buses were added to the fleet of Erode Region.\n\nThey constitute four buses in Tiruchi-Tiruchengodu routes, two each in Erode-Nagercoil, Erode-Puducherri, Erode-Bengaluru, Erode-Cumbum and, Erode-Coimbatore routes, seven in Coimbatore-Salem route, and one each in Tirupur-Tiruchi and Tirupur-Salem routes.\n\nCity Corporation Mayor P. Malliga Paramasivam, who took part in a formal function organised at the TNSTC depot at Kasipalayam to signify the induction of new buses, distributed sweets to the public.\n\nDeputy Mayor K.C. Palanichamy, General Manager of TNSTC Erode Joseph Dais, functionaries of trade unions and employees took part.\n\nState-wide, 701 new buses and 65 small buses purchased at a cost of Rs. 144.47 crore have been inducted into the fleets in various regions to facilitate economic growth through improved connectivity, according to a release.", 
    "section": "national", 
    "title": "85 new buses added to Salem TNSTC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}