{
    "author": [
        "S Prasad"
    ], 
    "text": "The total liability to be settled by the mill is Rs. 166 crore\n\nThe management has cited labour unrest due to insufficient funds. A file picture of the Anglo French Textiles Mill on Cuddalore Road in Puducherry.\n\nThe government owned Anglo French Textiles (AFT) Mill has extended lay-off for another six months with effect from January 21 in A, B and C units (except Spinning) with the management citing prevailing labour unrest due to non-payment of statutory dues and insufficient funds to settle all liabilities.\n\nThe workers will now continue to draw only 50 per cent of their salary with Provident Fund, ESI and other benefits suspended during the period.\n\nFinancial crisis\n\nAccording to a senior official, “The mill is neck deep in financial crisis and deprived of liquid funds to meet its day-to-day expenses. The bank accounts with the Consortium Banks are classified as Non-Performing Assets (NPA) as per Reserve Bank of India guidelines due to non-settlement of overdrawn amount of Rs. 32 crore which has resulted in denial of financial assistance from banks.”\n\nThe government had released Rs.367.35 crore as Share capital and Rs.232.94 crore as grant-in-aid till October 31, 2015. The PSU which earned marginal profits from 1985-86 to 1992-93 started incurring heavy losses over the years.\n\nThis resulted in drastic reduction of the grant-in-aid and share capital and the present assistance is used for payment of compensation for lay-off only and not adequate to run the mill.\n\nBlatant administrative transgressions committed by non-political chairmen and senior IAS officers who had held the reigns of the mill in the past had led to its present status, sources said.\n\nThe Employees Provident Fund authorities had also started coercive proceedings under the Income Tax Certificate Proceedings Rules (ICTP) as the management had not settled gratuity to the tune of Rs.39.07 crore for 1042 employees as on September 2015.\n\nAround 55 acres of land in Pattanur in Villupuram district, quarter of an acre in Thengaithittu and 1.5 acres in Thirubhuvanai in Puducherry are all valued at Rs.73.38 crore.\n\nThe total liability to be settled by the mill is Rs.166 crore. But the move to dispose of over 55 acres belonging to the mill in Puducherry and neighbouring Tamil Nadu by way of public auction would only procure Rs. 80 crore which will be insufficient to settle all the dues.", 
    "section": "national", 
    "title": "AFT Mill lay-off extended for another six months", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}