{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A campaign vehicle to create awareness on the need to prevent roadkill being flagged off on Monday by the Director of Tamil Nadu Forest Academy Rajiv K. Srivastava.- Photo: S. Siva Saravanan.\n\nTo spread awareness about the impact of vehicles intruding into tiger reserves, national parks and sanctuaries , a team of five naturalists and wildlife conservationists from the Environment Conservation Group – R. Mohammed Saleem, V. Saanthakumar, H. Byju, C.V. Prasath and N. Velmurugan will travel through three biodiversity hotspots in the country including the Western Ghats, the Eastern Himalayan region and the Indo- Burma region.\n\nThey will cover more than 20,000 km across 22 states in six weeks. They will also create awareness on the need to conserve wildlife and avoid roadkills.\n\nThe vehicle was flagged off by Additional Principal Chief Conservator of Forests and Director of Tamil Nadu Forest Academy Rajiv K. Srivastava on Monday.\n\nThis is the first phase of the Project PATH aimed at bringing down roadkills on ghat roads and roads that pass through reserves, sanctuaries and national parks.\n\nThe number of wildlife roadkills on India’s highways is increasing alarmingly with all the road construction and widening projects. Reckless driving is another factor in animals being killed or maimed. Multiple highway lanes and speeding traffic affect the safe movement of the animals.\n\nAccording to the Government’s plans, 3.8 million dollars have been invested to complete 1, 00,000 km of highway by 2017. Road kills could be reduced if the government builds wildlife overpasses and underpasses at vulnerable crossing zones.\n\nThe inauguration was preceded by a workshop called \"A road blocking the way\". Mr. Mohammed Saleem, President Environmental Conservation Group, welcomed the gathering. Mr. Rajiv K Srivatsava Ajay Desai, Elephant Specialist, K.S. Sundararaman, Executive Director of Shivatex and I. Anwardeen, Conservator of Forests, Coimbatore Circle also took part. The team en-route conducted an awareness session at Metro Matriculation Higher Secondary School, Mettupalayam, where it addressed the students on the importance of conserving wildlife and wildlife awareness posters were distributed.", 
    "section": "national", 
    "title": "Awareness drive to prevent roadkill on forest routes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}