{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Following complaints of pilferage, sting operation resulted in arrest of two employees\n\nIn a first, postal vans attached to long-distance trains originating from Tamil Nadu will soon have surveillance cameras affixed, to prevent thefts.\n\nFollowing complaints of pilferage, the Tamil Nadu Postal Circle decided to customise its coaches to have a CCTV network on board.\n\nThe pilot project will be implemented on the Chennai-Mumbai Mail and extended to at least a dozen postal vans in a phased manner.\n\nAccording to J.T. Venkateswarlu, Post Master General (Mails & Business Development), the proposal to install cameras came after complaints of pilferage were reported in some trains, particularly the Chennai-New Delhi Grand Trunk Express. A sting operation revealed that postal employees of Madhya Pradesh were involved in the thefts.\n\nE-commerce\n\ndoing well\n\n“We lodged a complaint with the police and the two employees were arrested and later suspended by the department. Citing this incident, it was proposed to install surveillance cameras in postal vans. The Postal Directorate approved the idea and we are in the process of implementing the project,” Mr. Venkateswarlu told The Hindu on Monday.\n\nConsequent to various business development initiatives launched by Chief Post Master General Charles Lobo, e-commerce was now making a significant contribution to postal business, he added.\n\nThe revenue generated through e-commerce increased from Rs. 1 crore in 2013 to Rs. 7 crore last year.\n\n“We have already crossed Rs. 9 crore in December 2015 and may touch the Rs. 15 crore mark by the end of this fiscal.\n\nAmazon is a major contributor to our business and we are roping in Flipkart as well,” he said.\n\nWith CCTV in postal coaches, the department can avert pilferage and travel of unauthorised persons.\n\nThe handling of consignments can also be monitored as there are some complaints of damaged articles in parcels post delivery, Mr. Venkateswarlu added.", 
    "section": "national", 
    "title": "CCTV cameras on trains to guard postal goods", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}