{
    "author": [
        "S Sundar"
    ], 
    "text": "Minister says the team will study demand for renaming seven Scheduled Castes\n\nThe Centre would soon depute a team of anthropologists to Tamil Nadu to study the demand for rechristening seven Scheduled Castes as Devendrakula Velalar, said Jitendra Singh, Union Minister of State in Prime Minister’s Office.\n\nAfter receiving several volumes of petitions on the issue signed by five lakh people at a function organised by Thevendrar Thannarva Arakattalai (trust) here on Monday, Mr. Singh said that Prime Minister Narendra Modi and his government had already committed to the demands of the trust to put in place honour, dignity and respect for the people of the community.\n\n“It is not a favour that the Modi-led Bharatiya Janata Party government is doing to the people of the community, but it is our duty,” he said.\n\nStating that there was evidence in history and literature about the existence of the name Devendrakula Velalar, he said that the government would do everything to set the records straight. He said that under the Constitution of India, the process of changing the nomenclature of the community required enactment of a legislation.\n\n“But, we will do what no government has done in the last 68 years,” he added.\n\nTrust founder president M. Thangaraj said that the demand was to change the nomenclature for people belonging to Kudumban, Pannadi, Kaladi, Kadayan, Devendrakulathan, Pallan and Vadhiriyan communities. “The change of name is not going to make any change in the Scheduled Caste status of these communities,” he said.\n\nThe signatures were collected from people from 1,450 villages in 80 Assembly constituencies in 19 districts, he added.\n\nSpeaking on the occasion, Prof. R. Srinivasan of Sastra University said that the question was not whether the Scheduled Castes people would support the BJP. “But, the fact is that the BJP is supporting these people,” he said.", 
    "section": "national", 
    "title": "“Centre to depute anthropologists to TN”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}