{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A pair of motorbike-borne thieves, one riding and the other as pillion, robbed four elderly women of their gold chains in separate incidents on Sunday. The modus operandi suggests that they could be the same perpetrators, said the police estimating that they got away with around Rs. 8-lakh worth of gold within eight hours.\n\nThe first attack was at 6.45 a.m.: Ansuyamma (55), a resident of Divanarapalya in Yeshwantpur, was cleaning the front of her house when the duo approached her on the pretext of asking for an address.\n\nThey took off with a gold chain worth Rs. 2 lakh.\n\nThe next incident occurred fifteen minutes later, when two men robbed gold chains from a 62-year-old woman in Maruthinagar, Yelahanka, on the pretext of inquiring a house on rent.\n\nThis time, the pillion rider got down from the motorbike and approached their target, Radha, who was standing inside the compound. As she was trying to help them, his partner snatched away her gold chain weighing 15 gram. Ms. Radha later told the police that the duo was conversing in Hindi.\n\nIn another incident, a 65-year-old was robbed of her gold chain in similar manner at Coffee Board Colony in Amruthahalli around 7.30 a.m. The victim, Rajni Kumari, was taking her morning walk when the duo snatched a chain valued at Rs. 2.5 lakh.\n\nIn the fourth incident, two bikers targeted a 54-year-old woman in Vinayaka Layout in Vijayanagar. Around 2.15 p.m., the victim, Jayalakshmamma, was returning home with a bag of groceries when they snatched her chain.\n\nIn all four cases, the victims alerted passersby or neighbours, but duo sped away.\n\nSaturday’s attacks\n\nThe perpetrators could well be the same people who preyed on four women in Jnana Bharathi, C.K. Achchukatt, K.R. Puram, and Basaveshwaranagar on Saturday. A senior police officer said they could be part of “outside gangs” which enter the city and target elderly people.\n\nDAY OF MUGGINGS\n\nFour women robbed of\n\ngold chains within eight\n\nhours on Sunday\n\nMotorbike-borne thieves target elderly women\n\nGold chains together worth Rs. 8 lakh robbed\n\nPerpetrators could well be the same people who targeted four women on Saturday", 
    "section": "national", 
    "title": "Chain-snatching spree", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}