{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Teachers and alumni of a Hosur school pitch in to improve the infrastructure of the Poonamallee Government Girls School affected by the floods.- Photo: M. Vedhan.\n\nChennai continues to get support from various places to deal with the aftermath of the floods. Sometimes, the support comes from unlikely quarters.\n\nPutting aside their pocket money, school children from Hosur have made artefacts, which they are now putting up for sale at an art show, to raise funds to help a government school in Poonamallee, which was severely affected by the floods.\n\nOn Saturday, a group of 15 teachers and 40 alumni of TVS Academy school, Hosur, travelled to Chennai to help improve the infrastructure of Aringar Anna Government Girls Higher Secondary School, Poonamallee.\n\nThey will spend the weekend painting the flood-damaged walls and blackboards and even help build new toilet blocks for the school. It all started when the school wanted to contribute towards Chennai’s flood relief and they joined hands with Tamil Nadu Floods-Education Supplies (TNFES), a citizen’s initiative, to identify the flood-affected school in Poonamallee.\n\nSnacks, birthday celebrations given up\n\n“Instead of collecting money, our students and teachers wanted to mobilise funds through their own efforts. Students of all classes, even those of class one, gave up snacks and their birthday celebrations and did some small chores to raise the money. They generate fund, they even making artefacts from recycled waste and hosted a sale. Students alone mobilised over Rs.1 lakh. Teachers, parents and alumni have helped in raising upto Rs.7 lakh towards the cause,” said Srividhya Mouli, TVS Academy’s principal.\n\nAnne Josephine, one of the teachers from Hosur said: “We wanted to pitch in by volunteering to improve the infrastructure. Blackboards and walls were severely damaged. We are glad that we contributed to the improved look of the school, though in a small way.”\n\nToilets in the school, which has a strength of 1,500 girls, is grossly inadequate and the team decided to renovate the existing eight toilets and also build eight more facilities.\n\nSeptic tanks constructed\n\n“Furniture too have been damaged and, using the funds, we are also constructing septic tanks and overhead tanks,” said Anandavel.V., an alumnus of TVS Academy.\n\nFloodwater has not completely drained from the school, which was recently upgraded to higher secondary school and a large pit filled with water has rendered the playground useless, note school authorities who have represented the issue to the Public Works Department. The Hosur school will continue its efforts to improve the infrastructure and also host workshops for students on career counselling and environment conservation, noted Sujatha, coordinator of TNFES initiative.\n\nPutting aside their pocket money, school children from Hosur have made artefacts, and put them up for sale to raise funds", 
    "section": "national", 
    "title": "Children from Hosur raise funds", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}