{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "At left, Visalakshi Palaniappan, social activist, giving tips to children of S.K.T. Gandhi High School at Rayavaram in Pudukottai district during the cleanliness campaign. At right, the children donning the gloves took the task seriously and turned out impressive work on the premises of the school.— PHOTOS: B. VELANKANNI RAJ\n\nI feel very sad when I visit Rayavaram, because many people are sick because of lack of clean water and because of the dirty environment.Visalakshi Palaniappan,social activist\n\ngrassroots campaign involving schoolchildren got under way at Rayavaram village in Pudukottai district on Monday with the aim of increasing awareness about cleanliness and sanitation in daily life.\n\nAt least 100 boys and girls studying in Class 8 of S.K.T. Gandhi High School (founded by S. Kadiresan Chettiar in 1927) were counselled about keeping their surroundings clean and about personal hygiene under the initiative of Visalakshi Palaniappan, a resident of the village who is now based in Chennai.\n\n“I hope other villages in the district will be inspired to follow the example set by these students and play a greater role in maintaining a healthy and clean environment,” Ms. Visalakshi told The Hindu .\n\n“While the awareness about this issue is greater in the cities, it has been very hard to make people in rural areas understand the need to dispose waste responsibly,” she added.\n\nMonday’s campaign saw the children, kitted out in blue safety gloves, removing paper and plastic waste within the school premises and in the peripheral areas outside. “The collection of household waste was regularised in Rayavaram around three months ago. There has not been any arrangement to segregate the garbage before it is disposed,” said J. Kalaiselvi, headmistress of the school. “We don’t have any option other than burning the plastic waste, which will lead to air pollution,” she added.\n\nMotivating the children to take the cleanliness campaign’s message to at least four houses in their neighbourhood, AL. Palaniappan, assistant headmaster, said: “It will not be enough if we do this just one day – you must convince yourself first and then make others join you.”\n\nMs. Visalakshi, an active member of a civic cleaning association in Kotturpuram, Chennai, said that while children had always been enthusiastic about these missions in the village, the grown-ups had not shown any interest in getting involved.\n\n“I feel very sad when I visit Rayavaram, because many people are sick because of lack of clean water and because of the dirty environment,” she said.\n\nMost ecological problems faced by the village are interlinked.\n\nIn the past, Ms. Visalakshi had planted 400 tree saplings to revive the water table of the village, but only 200 survived because of poor irrigation. “Rampant eucalyptus plantation has led to soil degradation,” she said. Monkeys, displaced from their natural habitat, had become a menace in Rayavaram. Agriculture in the village had ground to a halt because drying up of water sources.\n\nSandhya, Ahalya, Abhinayasree, schoolchildren who participated in yesterday’s campaign, said they had started to spread the word on cleanliness in their villages, besides taking part in other awareness campaigns.\n\n“Lessons on this subject are there in our textbooks, but it is better to speak to our neighbours about it,” said Sandhya, who then joined her friends in singing a song on clean water and sewage disposal.\n\nFor the past six months, children studying in S.K.T Gandhi High School have been aided in their mission by Subramaniam Polytechnic College. “At least 60 students and staff members have been engaged in clean-up campaigns on our campus on a rotation basis,” said Mr. RM. Meenakshisundaram, principal.\n\nI feel very sad when I visit Rayavaram, because many people are sick because of lack of clean water and because of the dirty environment.\n\nVisalakshi Palaniappan,social activist", 
    "section": "national", 
    "title": "Cleanliness lessons outside the classroom", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}