{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A plea was made to Chief Minister N. Rangasamy to immediately order the withdrawal of all cases filed against fishermen leaders who opposed the setting up of a hover port at Veerampatinam.\n\nThe fisherfolk of Veerampattinam village are protesting against the establishment of a Coast Guard Centre and hovercraft port in their village.\n\nVeerampattinam village is a headquarters of sorts for about 32 fishermen villages of Puducherry where the panchayats of all villages periodically meet and discuss their societal and occupational problems and settle them through the panchayat justice system.\n\n“Their occupational mode, habits and customs, culture and civilisation and the disciplined control over the people are well cherished and traditional in character and is little different.\n\nThey apprehend that all these facets of their heritage would be disturbed if the Coast Guard centre and its men penetrate into the village,” said former Member of Parliament M. Ramadass.\n\nHe also appealed to the Chief Minister seriously to ponder whether this Coast Guard Centre should be established only in Veerampattinam village in the midst of serious opposition by the people and in violation of the rules.\n\nIdeal location\n\nDr. Ramadass said, “It can be set up at a place where the movement of the people is absolutely absent. The ideal location would be in the government area of about 30 to 50 acres between the New Light House and the river mouth at Puducherry away from Veerampattinam village which would be acceptable to every body. The government should construct the long delayed tsunami houses in the 20 acre earmarked to this centre and settle the housing problem of the village.”\n\nHe said that the Chief Minister should order the withdrawal of all cases and hold discussions with the representatives of the village, local MLA, Coast Guard Officers and Police Officers and settle this emotive issue amicably.", 
    "section": "national", 
    "title": "CM urged to withdraw cases against Veerampatinam fisherfolk leaders", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}