{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Clay and residues of immersed idos led to ‘slush trap’\n\nThe Mahodaya Punyakala Theerthavaari festival occurs rarely, and is considered extremely auspicious, temple authorities said, trying to explain the milling crowds and the drowning incident.\n\nA priest said Monday was all the more auspicious as it brought together Thai amavasya (new moon day that comes in the Tamil month of Thai) and the Thiruvonam star. Reports in a section of the vernacular media about this ‘rare’ event led people to rush into the Ayyankulam Theertham at the same time when the ‘urchava murthy’ of the Sri Arunachaleswarar Temple was taking a dip. But locals said though the excitement surrounding the event was all too palpable, no safety arrangements had been made. Only a couple of days ago, members of Hindu Munnani held an agitation urging the authorities to plug a sewage connection that flowed into the tank. One of the deceased, Manikandan, reportedly participated in the agitation.Kabilan, a resident of the street, said that a large number of Vinayaka idols were immersed in the pond after last year’s Vinayaka Chaturthi. The clay and residues of the immersed idols could have acted as a slush trap drowning the devotees. Soon after the stampede, police evicted everyone from the pond, but that some of them could have drowned was not factored in.\n\nIt was only about half an hour later, when reports of missing people started coming in did the suspicion arise.Police have booked a case under Section 174 Cr.PC (unnatural death). Collector A. Gnanasekaran who visited the site said the District Administration would inquire into the incident. Joint Commissioner of HR&CE and temple Thakkar R. Senthilvelan was relieved of his responsibilities related to the temple on Monday following the death of the devotees.\n\nTwo days ago, Hindu Munnani sought plugging of a sewage line that flowed into\n\nthe tank", 
    "section": "national", 
    "title": "District administration to conduct inquiry into stampede", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}