{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "alem is among the twelve cities in Tamil Nadu and 98 across the country, to be developed as smart cities. The residents have been eagerly expecting the government and the Corporation to implement various programmes to create infrastructure for its overall development.\n\nA cross section of the residents feels that dumping of garbage in public places, particularly in the residential localities, has been proving a bane. The Corporation has already privatised the cleaning of garbage in the city. The failure of the private agency to clear the garbage in the residential localities has been a matter of concern for the locals.\n\nThe piling of garbage in Anthonypuram, Anthonypuram Oodai, Azad Nagar, Dharmanagar I, II, III, IV and V streets, Ammapalayam, Jagir Ammapalayam, and on Khader Khan road in Suramangalam and in Junction areas has been cited as the best example for the inaction of the agency.\n\nThese localities are thickly populated with narrow roads. The make-shift Corporation Fish Market is situated on Dharmanagar second street and the fish wastes too are dumped in the open.\n\nEven though dust bins have been kept in many places, they are always over flowing due to the irregular clearing of the same.\n\nThe residents of these localities complain that garbage is cleared once a week, that too after complaints are preferred and people have to bear the stink every day. The stray cattle roaming freely further worsens the situation by scattering the piled up garbage on the road and in front of the residences.\n\nThe residents too have to be blamed for the sorry state of affairs.\n\nThey prefer to throw the garbage in open near the overflowing dustbins without taking care to dispose them of in bags. The Corporation officials say that the residents, particularly office-bearers of residents welfare associations have been sensitised to garbage management techniques. But, people seldom cooperate.\n\nThe residents of Anthonipuram complain that the dustbins are placed very close to the residences. Used syringes and other medical wastes too are dumped by the hospitals and dispensaries functioning in the area, they say.\n\nOne can see garbage dumped in the open near the private high school in Azad Nagar. The hundreds of boys and girls could be seen roaming around the garbage, just 50 m from the school. The Corporation should take steps to removal the garbage regularly, says K. Karthikeyan, a consumer activist.\n\nGarbage on Junction main road and Suramangalam main road are cleared regularly, but sanitary workers never visit the localities situated inside, alleges Mr. Karthikeyan. He also pleads for the placing of adequate dustbins in these localities.", 
    "section": "national", 
    "title": "Dumping garbage in the open a bane", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}