{
    "author": [
        "Aditi R"
    ], 
    "text": "In spite of the school notice asking parents to not wait long hours to buy forms as plenty were available, people continued to stand in queues outside the DAV School in Mogappair; (left) parents examine an LKG admission form they purchased—Photo : K. Pichumani\n\nS Ramanan, a techie, took half a day’s leave from work to collect the LKG admission form for his 4-year-old daughter from DAV Girls Senior Secondary School, Mogappair on Monday.\n\nHe realised he had arrived late – he was there at 6 a.m. — only to find out that many other parents, also seeking LKG admission for their children, had parked themselves at the school much earlier.\n\n“I have been waiting here since six in the morning, but when I came I realised I was late as there were hundreds of them already waiting for their turn,” said Ramanan, who got the admission form after a three-hour-long wait\n\nTo avoid the rush, the school had put up notices outside asking parents to not wait as plenty of forms available, but this did not help.\n\nWhile some came in the morning, a large number had begun queuing up since the previous night.\n\n“Now with so much rush and limited seats, every parent is bound to get worried, and wants to ensure her child gets an admission in the school. We can’t take chances,” said Palani Murugan, another parent, who after waiting for his turn overnight, went along with a friend of his to purchase the application form.\n\n“We only wish they had done all processes online. It would have saved us a lot of time and trouble,” complained Suhasini R, who had come along with her old mother to get the application.\n\nThe forms will be available till Tuesday.\n\nParents are required to bring their wards’ birth certificates to get the applications.", 
    "section": "national", 
    "title": "Eager parents queue up all night for LKG admission at city school", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}