{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector seeks cooperation of parties to ensure error-free poll rolls\n\nThanjavur and Tiruvarur districts got into the election mode with the arrival of electronic voting machines (EVMs) from Bihar.\n\nA total of 1,808 ballot units and 1,235 control units arrived in two consignments from Bhagalpur in Bihar and were shifted to the EVM strong room under safe custody. A further allotment of 3,535 ballot units and 2,265 control units are expected to be transported from Purnia district of Bihar shortly.\n\nEngineers and technicians have come from Bengaluru to inspect the functioning of the EVMs and their first phase of examinations commenced on Monday and would run up to February 22.\n\nMeanwhile, Collector N. Subbaiyan convened a meeting of all recognised political parties in Thanjavur on Monday and solicited their cooperation in ensuring error-free electoral rolls.\n\nThe parties were asked to nominate agents by applying in the prescribed format. He said if any discrepancy were to be found in the rolls then that could be referred to the concerned Assistant Electoral Officer.\n\nHe said efforts would be made to provide Electors Photo Identity Card to the newly enrolled electors while colleges were being approached to enrol students in the 18-19 age group.\n\nIn the two special enrolment camps held in the district on January 31 and February 6, a total of 23.920 applications were received for entry and corrections in the poll roll.\n\nThey were being processed, he observed.\n\nIn Tiruvarur, Collector M. Mathivanan received the consignment of EVMs in the presence of representatives from all parties and officials. The consignment included 993 ballot units and 1,015 control units that came from Jehanabad district of Bihar, 500 ballot units and 55 control units from Arwal district of the same State and a further 430 control units from Aurangabad district of that State. District Revenue Officer T. Mohanraj, RDOs Muthumeenakshi and Selvasurabhi were present.", 
    "section": "national", 
    "title": "EVMs from Bihar land in Thanjavur", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}