{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Accompanied by their children, widows of two murdered Dalits submitted petitions seeking employment during the weekly grievance day meeting held at the Collectorate on Monday.\n\nIn the petitions, families of murdered Dalit labourers Mariappan and Shanmugam said they lost their breadwinners as armed Caste Hindus brutally murdered the duo at Paaraiyadi in Tirunelveli Town on October 12, 2015 in a case of mistaken identity.\n\nWhile Mariappan’s unemployed wife Valliammal is struggling to feed her three girl children in the age between 9 and 12 years, Shanmugam’s family manages to lead a life with the insignificant earnings of his son, a lorry driver in Chennai.\n\n“When the bodies were handed over to the relatives, it was assured that a family member of the deceased would be given employment in a government department based on their educational qualification. However, this assurance is yet to be fulfilled. Since a recent ruling by the Madurai Bench of Madras High Court has guaranteed employment to a Dalit family from Manappaarai near Tiruchi after one of its member was murdered by Caste Hindus, the Collector should consider this plea compassionately and offer employment to the affected families,” said S.K.T. Kanmani Maaveeran, Tirunelveli City district secretary of Thamizhaga Makkal Munnetra Kazhagam, who accompanied the family members while the petition was submitted to District Revenue Officer M.G. Kulandaivel, who chaired the meeting.\n\nHe assured the family members that efforts would be made to secure an early employment for them.\n\nProtected water sought\n\nA group of Dalits from Keezhapaattam on Palayamkottai outskirts submitted a petition to the DRO seeking regular supply of protected drinking water. “Since the little quantity of water being supplied to the residents only for two hours a day through the public drinking water taps is not fit for consumption due to sediments, due steps should be taken to ensure the supply of protected drinking water,” M. Petchikutti, one of the petitioners said.", 
    "section": "national", 
    "title": "Families of murdered Dalits seek employment", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}