{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Verkodu Parish, which coordinated the Indian pilgrimage to Katchatheevu for the annual festival at St. Antony’s Church at the uninhabited islet, heaved a sigh of relief as the Rameswaram fishermen decided to withdraw the boycott call and lend their boats for the pilgrimage.\n\nUncertainty loomed large over the pilgrimage after the leaders of 11 fishermen associations unanimously announced on January 23 that they would boycott the festival and would not lend their boats for transporting the pilgrims.\n\nAs the process for the pilgrimage suffered a setback, Rev Fr L. Sahayaraj, who was the chief coordinator of the pilgrimage, held a meeting with leaders of the associations in Rameswaram on Monday morning and requested them to reconsider their decision in the larger interest of pilgrims and the fishermen community.\n\nBoycotting the festival would amount to foregoing their rights over the Katchatheevu islet as far as the festival was concerned, he said and suggested that they could pursue other modes of agitation to press their demands.\n\nAfter convincing the fishermen leaders, the priest arranged a meeting with the RDO here on Monday evening and thrashed out a solution.\n\nThe RDO assured that the State government would take up the issue with the Centre and secure the release of about 70 boats detained in Sri Lanka.\n\nHe said that Collector S. Natarajan, who was attending a meeting convened by the Chief Secretary in connection with the pilgrimage in Chennai on Thursday, would discuss with him their demand for compensation for 18 boats, which could not be salvaged from Sri Lanka last year.\n\n“Based on the assurance given by the RDO, we have decided to withdraw the boycott call“, P. Sesu Raja, leader of a fishermen association, said. The State government had helped the fishermen to salvage more than 70 boats held in Sri Lanka last year by meeting all the expenses and this time too the Chief Minister should come to our rescue, he said.\n\nCompensation\n\nThe State government should provide compensation for 18 boats and prevail upon the Centre to secure the 70 boats detained in Lanka, he said.\n\nAnthony, N J Bose, Emirat, Sagayam and Thangadurai were among other fishermen leaders who attended the meeting. Fr. Sahayaraj said that pilgrims should submit filled-in applications by Wednesday. The Parish would present a final list to the district administration on Friday. As they restricted the number of boats to 100, they could take a maximum number of 3,700 pilgrims, he added.", 
    "section": "national", 
    "title": "Fishermen withdraw boycott call", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}