{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Former Union Minister and senior Congress leader Ghulam Nabi Azad is likely to meet DMK president M. Karunanidhi this week to negotiate an electoral tie-up between the two parties for the coming Assembly elections in Tamil Nadu.\n\nDMK sources confirmed that Mr. Azad is expected to visit Chennai before February 15 . The proposed meeting has stirred the political scene since the DMDK, to which the DMK had issued an open invitation for an alliance, is yet to communicate its decision.\n\nThe formal meeting could mark the return of the Congress-DMK combination that lasted for nine years from 2004.\n\nAfter the Assembly elections in 2006, the DMK government in Tamil Nadu stayed afloat with the outside support of the Congress. In 2013, the DMK quit the UPA citing the Centre’s “irresponsible” decisions in the Sri Lankan issue.\n\nIn 2011 Assembly elections, the Congress was allotted 63 seats in the alliance.\n\nThe combination faced a drubbing with the DMK losing even the principal Opposition position and the Congress winning in just five constituencies.\n\nHowever, a senior Congress leader said the party would start the negotiations with the number of seats allotted in the last two Assembly elections as the base.\n\n“In 2006, we were given 48 seats. So seat sharing has to be based on past records. Even in the recent Lok Sabha elections, we garnered a vote share of close to five per cent going alone against a national wave in favour of the BJP,” the leader opined.\n\nThe DMK may point to the spilt in the Congress and the emergence of the Tamil Manila Congress to bargain hard. Much would depend on whether the DMDK would be part of the deal.\n\nMeanwhile, TNCC president E.V.K.S. Elangovan chose to play it safe. Speaking to reporters, he said there has been no formal communication from the high command on alliance talks. “If Mr. Azad visits Chennai, he could hold talks with the DMK,” Mr. Elangovan said.\n\n‘Cong. might start negotiations with the number of seats allotted in the last two Assembly polls as the base’", 
    "section": "national", 
    "title": "Ghulam Nabi Azad likely to meet Karunanidhi this week", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}