{
    "author": [
        "R Rajaram"
    ], 
    "text": "Convicts serving lengthy terms have now been provided with an avenue to develop their vocational skills with a Government Industrial Technical Institute (ITI) taking off at the Tiruchi Central Prison premises.\n\nThis is the first time that a full-fledged Government ITI has been established in a Central Prison in the State which accounts for a total number of nine Central Jails. The new initiative at Tiruchi Prison is yet another rehabilitation measure by the State government for the welfare of convicts especially lifers.\n\nChief Minister Jayalalithaa inaugurated the Government ITI set up inside the Tiruchi Central Prison premises through video conferencing from Chennai on Monday. A joint initiative of the Prisons Department and the Directorate of Employment and Training, the ITI will offer a slew of vocational courses for the handpicked convicts. A total number of 168 convicts from Tiruchi Jail and those from other central prisons in the State have been admitted to the vocational courses of their choice in the ITI.\n\nPrison authorities told ‘The Hindu’ that 96 convicts among the total 168 were from Tiruchi Central Prison while the remaining 72 convicts were from Coimbatore, Madurai, Palayamkottai, Cuddalore, Salem and Puzhal Prisons. Convicts lodged in other central jails and admitted to the ITI would soon be shifted to Tiruchi Prison to enable them pursue the course. They would be sent back to the respective jail upon completion of the course.\n\nHeaded by a Principal, the full-fledged ITI would have a team of training officers to take theoretical classes and impart practical training to the convicts in various vocational trades inside the prison. The ITI will offer five vocational trades – Fitter, Electrician, Computer Operator and Programming Assistant, Sewing and Welding. Barring Fitter and Electrician trades which are of two-year duration, the remaining are one-year courses.\n\nThe Deputy Inspector General, Tiruchi Range K. Jeyabharathi said the ITI would function in the VII block and classes would be held every day from 7.30 a.m. to 4.30 p.m. except Sundays.\n\nThe State government has allocated Rs. 2.8 crore for the ITI that includes construction of a separate building within the prison premises and procurement of equipment. The course materials would be supplied free of cost by the Directorate of Employment and Training to the chosen convicts.\n\nThe ITI certificate would help convicts to indulge in some self-employment activity once they were freed from the jail, Superintendent of Prison, Tiruchi Mr. A. Murugesan said.", 
    "section": "national", 
    "title": "Government ITI takes off at Tiruchi Prison", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}