{
    "author": [
        "R Arivanantham"
    ], 
    "text": "Over 250 pairs of the pink bird swarm Manakkudy estuary this season\n\nBlessed with abundant water resources, considered a boon for aquatic avifaunal biodiversity, Kanyakumari district has received Greater flamingos in large numbers in the last few days.\n\nThe rich repository of avifaunal biodiversity was well supported by over 1,000 waterbodies, including eight major reservoirs, said S.S. Davidson, environmental educator and head of Tribal Foundation, here on Sunday.\n\nThe picturesque estuary in Manakkudy in the district attracted a large number of Greater flamingos due to the availability of food, undisturbed environment and favourable climate.\n\nMr. Davidson said that the swarm of Greater flamingos flocking to the flooded salt pans and shallow waters in search of food was eye-catching.\n\nOver 250 pairs of the pink bird swarmed Manakkudy estuary during the current season.\n\n“The district, situated at the end of the Western Ghats, is one among the 15 biodiversity hotspots. It has abundant environmental heritage, including avifaunal diversity. Manakkudy estuary was declared a Bird Reserve recently,” he added.\n\nWhen winter started in European countries and the northern parts of India – from September to November – the birds started flocking to Kanyakumari district and stayed there till March before returning to their native habitats, he said.\n\nWarm, watery regions and like estuaries and saline or alkaline lakes were the habitats of these birds, which were surprisingly fluid swimmers.\n\nBut these birds really thrived on the extensive mud flats where they bred and fed.\n\n“These birds are our uninvited guests, and adequate safety and security should be accorded to them. They are part of our rich environmental heritage and we should protect them. They provide great avenues to promote eco-tourism in the environmentally rich district,” Mr. Davidson noted.", 
    "section": "national", 
    "title": "Greater flamingos flock to Kanyakumari estuaries", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}