{
    "author": [], 
    "text": "Censuring the University Grants Commission (UGC) for taking an ambiguous stand on the issue of whether State Universities should follow UGC guidelines while appointing Vice-Chancellors, the Madras High Court on Monday directed the Joint Secretary of the Commission to appear and clarify its stand.\n\n“We find that the UGC has taken rather an ambiguous stand. On one hand, they seek to suggest in the course of arguments that they agree with the case of the petitioner. Yet seem to be doing nothing about it. This is likely to cause lack of clarity even for the future,” the First Bench of Chief Justice S.K. Kaul and Justice Pushpa Sathyanarayana observed while hearing a PIL moved by moved by Change India organisation and former Vice-Chancellor of Anna University M. Anandakrishnan challenging a notification issued by the Madurai Kamaraj University to fill up the post of Vice-Chancellor.\n\nThe petition alleged that large-scale corruption occurred in various universities and to prevent such scams, the universities must follow the guidelines prescribed by the UGC.\n\nBench questions counsel\n\nWhen the public interest litigation petition came up for final hearing, the Bench questioned counsel representing the UGC whether the Commission proposes to do anything about the issue.\n\nResponding to the query, counsel said that they could only invoke the penal clause available under the UGC Act.\n\nNoting that the UGC in essence sought to abandon its role and put the issue before the court for necessary direction, the Bench said, “We are of the view that to obtain necessary clarity, the Secretary of UGC [must] remain present in the court with records.”\n\nBut considering the request made by counsel, the Bench directed the Joint secretary concerned to appear and posted the matter to February 22.\n\nSummons Joint Secretary with records for clarification", 
    "section": "national", 
    "title": "HC raps UGC for ambiguous stand on V-C appointment", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}