{
    "author": [
        "T K"
    ], 
    "text": "Saut Siringoringo, Consul General of the Republic of Indonesia, during an interview with The Hindu.— Photo: V. Ganesan\n\nTalks on beginning direct flight services between India and Indonesia might move forward when Indonesia’s Transportation Minister Ignasius Jonan visits India next week, a top Indonesian official said.\n\nIndonesia has set a target of attracting 20 million tourists by 2020. Last year, 1.5 lakh Indians visited Indonesia and the country expects 3.6 lakh Indians this year, Saut Siringoringo, Consul General of Indonesia, told The Hindu on Monday.\n\nWith tourist flow from India and China growing about 10 per cent each year, Mr. Siringoringo said direct flights will be beneficial to Indian travellers as well as Indonesia’s tourism sector, which the country hopes will be the biggest contributor to its GDP by 2020. Last October, Indonesia waived off visa fees for Indian tourists travelling to the country. India and China contribute the maximum number of tourists travelling to Indonesia, he said.\n\n“Our Transport Minister will be in Mumbai from February 13 to 18 to attend the Make in India programme. Hopefully after India (visit), we will have an idea to insist our airlines (to start direct flights),” Mr. Siringoringo said.\n\n“When you fly, the closest land for India to the states of South East Asia is Indonesia. Andaman and Nicobar is just a (short) distance to Aceh. In terms of distance, before you enter Singaporean, Malaysian, Thai soil, you cross our country first,” he added.\n\nMr. Siringoringo said there is a huge potential for trade to increase between the two countries. “India’s trade with Indonesia is only $17 billion, almost the equivalent of its trade with the EU. But, China’s is $90 billion.”\n\nIndonesia is planning to hold a two-day exhibition in Mumbai in November to increase B2B relations, he said.\n\nTo help increase tourism in Indonesia, U & I Holidays, is conducting road shows across five cities. The show began in Delhi, moving on to Chennai on Monday. It will travel to Bengaluru on February 9 and Ahmedabad on February 11 before ending in Mumbai on February 12.\n\nIndonesia Transportation Minister’s visit next week likely to take it forward", 
    "section": "national", 
    "title": "Indonesia, India to explore direct flights", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}