{
    "author": [], 
    "text": "Two-day conference focused on creating opportunities for researchers and stakeholders\n\nA two-day conference on International Taxation was held for the second time in Pondicherry University by the Department of Commerce on February 4 and 5. The conference focused on creating opportunities for researchers, academicians, policy makers, taxation authorities and other stakeholders to make their intellectual contribution on the contemporary developments in the field of international taxation.\n\nSeveral experts from CBDT, academic institutions, and industry actively took part in the deliberations and suggested transparent and investor friendly tax policies and Transfer Pricing. The conference was organised in association with the ‘International Taxation division’ of the CBDT, and leading global tax consultants. It was inaugurated by R. Radhakrishanan, Member of Parliament, Puducherry, in the presence of J. Albert, Commissioner of Income Tax (International Taxation), R. Das, Commissioner of Income Tax Puducherry region, Prof. Anisha Basheer Khan, Vice-Chancellor (i/c), Prof. R. Prabhakara Raya, Dean, School of Management, Prof. Malabika Deo, Head, Dept. of Commerce, Dr. P.S. Velmurugan, Assistant Professor, Pondicherry University.\n\nStudents asked not to be complacent\n\nS.K. Acharya, Chairman and Managing Director, NLC, appealed to the students to be contended and not complacent during the graduation day held at Neyveli on February 7 at the Lignite hall. He further added that a lot is expected from the young graduates which would usher in growth.\n\nThe Graduation Day of Jawahar Science College, Neyveli, was held at Lignite Hall, Block-11, Neyveli, wherein Mr. Acharya delivered the Graduation Day address and gave away the degrees to the successful candidates. As many as 347 students obtained their graduation degrees in person and about 400 in absentia. Mr. Acharya appealed to one and all that to be focused on growth oriented activities and that this acknowledgement given by the college on this day would definitely improve your confidence in your future endeavours. Rakesh Kumar, Director (Finance) presided.\n\nMotivational programme\n\nSri Manakula Vinayagar Educational Trust hosted “SigarathaiNokki” a Career Guidance and Motivation Programme for Plus Two students at Sri Manakula Vinayagar Engineering College Campus. More than 7000 students studying in Plus Two and their parents got benefited. S. Mars, Chief Educational officer, Villupuram District, inaugurated the event. Special guests C. Gobinath, anchor, Vijay TV and Jayaprakash Gandhi addressed the participants. The guidance session was led by A. ArockiaDass, Mathematics, Dr. S. Mayilaivelan, Physics, S. Viswakumar, Chemistry, Mullaivanan-Botany and Dr. A. Vijayan, Zoology and Musee Pugazhendhi, motivational speaker.\n\nM. Dhanasekaran, Chairman and Managing Director, Sri Manakula Vinayagar Educational Trust, delivered the presidential address, S.V. Sugumaran, Vice Chairman and Dr. K. Narayanasamy, Secretary offered felicitation.\n\nDr. V.S.K. Venkatachalapathy, Director cum Principal welcomed the gathering. Dr. D. Raja Govindhan, Director, Sri Manakula Vinayagar Medical College and Hospital, Dr. M. Amaranathan, Dean, Dr. S. Malarkkan Principal, Manakula Vinayagar Institute of Technology, Dr. S. Senthil, Principal, Mailam Engineering College, Dr. J. Suresh AnbuSelvan, Principal, Venkateswara College of Education, Dr. R. Dhanusu, Principal, Sri Manakula Vinayagar Nursing College offered their felicitations.\n\nWorkshop held\n\nThe Research Cell of Auxilium College, Vellore, in association with the Indian Academy of Sciences, Bangalore, Indian National Science Academy, New Delhi and The National Academy of Sciences, Allahabad, conducted a two-day Science Academies’ Lecture Workshop on Environmental Biotechnology on February 4 and 5.\n\nEdathil Vijayan, emeritus professor, Cochin University of Science and Technology, spoke on the various research opportunities and laboratory facilities available for science students. He also enlightened students about the summer research fellowship that is offered in many reputed institutions.\n\nThe workshop’s coordinator Sr. Regina Mary, who is also the director of the Research Cell, explained the dynamics of the lecture workshop. Sr. Eugene Fatima Mary, principal of the college and Sr. Amalorpavam, secretary, were present, according to a press release.\n\nIntroducing IDP\n\nA lecture on integrated design approach in building construction was organised at the VIT School of Planning and Architecture, VIT University recently.\n\nSrinivas P. Anchuri, an architect and engineer, while delivering the lecture on the importance of structure in architecture, said for any building, the materials chosen should be based on the availability and climatic conditions of the area. He added that the structure must be safe. On Integrated Design Process (IDP), he said it provided a means to explore and implement sustainable design principles effectively on a project while staying within the budgetary and scheduling constraints.\n\nIDP was a collaborative process that focuses on design, construction, operation and occupancy of a building over its complete life cycle, according to a press release.\n\nReporting by S. Senthalir and Serena Josephine M.", 
    "section": "national", 
    "title": "International taxation in all its dimensions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}