{
    "author": [], 
    "text": "Huge quantity of waste is being dumped behind every house in Valuthoor in Thanjavur district, which is a health hazard. The local body must take efforts in keeping the streets clean, especially safeguarding and rejuvenating the water bodies. I hope the authorities take action in this regard.\n\nNoorun Nazaha Rasheed,\n\nValuthoor, Thanjavur District\n\nMonkeys, dogs\n\ncattle on roads\n\nAt T.P.S. Nagar in Thanjavur, stray cattle roam around freely. Monkeys and dogs are becoming a menace. The authorities must take steps to control them.\n\nT.S.S. Mani,\n\nThanjavur\n\nPit turns a dump\n\nA pit in Sarangapani Vadaku Madavalagam in Kumbakonam has not only become a garbage dump but also a hazardous place for people using the pathway around the temple premises, more so during the rains.\n\nSrinivasa Ragavan,\n\nKumbakonam\n\nCrackdown on\n\nsurge pricing\n\nMost hotel rooms in and around Kumbakonam have been booked and very few rooms are left. The hotels have resorted to surge pricing, cashing in on the demand. The people coming to Kumbakonam from far off places have to suffer. The Government should crackdown on surge pricing by hotels.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nHold special\n\ncounselling\n\nThe recent suicides in Tamil Nadu are unfortunate. Parents should watch their children, especially adolescent girls, to protect them from depression. The Government should organise special counselling camps for college students.\n\nThe youth should take oath to weed out suicidal tendencies.\n\nM. Baluswamy,\n\nKumbakonam\n\nExtend train service\n\nSome of the trains are extended beyond Tiruchi. Why can’t the superfast express trains such as Villuppuram-Puralia and Villuppuram- Kharagpur be extended up to Tiruchi. The Railway ministry should consider the demand and announce it in the budget.\n\nC. Muthu,\n\nUyyakondan Thirumalai\n\nPut up bus timings\n\nMore than 10,000 people travel from the Thuraiyur bus stand every day. But there is no sign board indicating the schedule of buses. Passengers struggle to find out the timings of the buses. I request the authorities to put up a time table.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nAromatic ghee\n\nadulterated\n\nAromatic ghee, which is used in religious ceremonies, is often adulterated. Unscrupulous traders add palm oil to the ghee. I urge the authorities of the Food Safety Department to take stringent action against such unscrupulous traders.\n\nAravind K. Rao,\n\nSrirangam\n\nAllot houses to\n\ntransgenders\n\nTransgenders often find it difficult to rent houses. The government has to provide permanent houses to enable them live peacefully,.\n\nR. Sathish Kumar,\n\nKailasapuram", 
    "section": "national", 
    "title": "Keep the streets clean at Valuthoor", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}