{
    "author": [], 
    "text": "Whichever government is in power at the Centre and in the State, Tiruchi faces discrimination. Development projects elude the city. The city has been left out in the first list of Smart City project. An integrated bus stand in the city is an imperative need. The corporation and the district administration should accord priority to find a suitable location for the integrated bus stand and complete the project within a couple of years.\n\nH. Ghouse Baig,\n\nEdamalaipatti Pudur\n\nBillboards blocking\n\ntraffic signals\n\nTraffic signals are crucial for road safety. Tiruchi has seen proliferation of commercial billboards obstructing the view of the traffic signals. Under the Mannarpuram flyover, billboards of a private cellular company are posing a hazard to pedestrian and vehicles. Corporation officials must immediately remove these billboards. All the encroachments on the main roads and service lanes must be removed.\n\nA. Prabaharan,\n\nPuthanampatti\n\nInstall Sivaji statue\n\nNadigar thilagam Sivaji Ganesan’s statue installed at Palakkarai Junction has remained under wraps for over four-and-a-half years. At Shastri Road, a concrete pedestal has been erected but the statue has not been placed on it for over two years. The MGR Statue at Cantonment should be shifted to the centre of the roundabout that is being created now.\n\nDimple R. Mohan,\n\nMahalakshmi Nagar East Extension\n\nBlacktop Cauvery\n\nbridge quickly\n\nThe work on repairing Cauvery bridge, the lifeline connecting Srirangam with Tiruchi, should be completed quickly. Thousands of commuters who cross this bridge at least twice a day are suffering in silence. To spend a paltry Rs. 1.75 crore on this repair work over such an extended and unjustified long period defies all logic.\n\nT.M. Ranganathan,\n\nSrirangam\n\nExtend trains\n\nup to Tiruchi\n\nSome of the trains are extended beyond Tiruchi. Why can’t the superfast express trains such as Villuppuram-Puralia and Villuppuram- Kharagpur be extended up to Tiruchi. The Railway ministry should consider the demand and announce it in the budget.\n\nC. Muthu,\n\nUyyakondan Thirumalai\n\nPut up bus timings\n\nat Thuraiyur\n\nMore than 10,000 people travel from the Thuraiyur bus stand every day. But there is no sign board indicating the schedule of buses. Passengers struggle to find out the timings of the buses. I request the authorities to put up a time table.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nAromatic ghee\n\nadulterated\n\nAromatic ghee, which is used in religious ceremonies, is often adulterated. Unscrupulous traders add palm oil to the ghee. I urge the authorities of the Food Safety Department to take stringent action against such unscrupulous traders.\n\nAravind K. Rao,\n\nSrirangam\n\nAllot houses to\n\ntransgenders\n\nTransgenders often find it difficult to rent houses. The government has to provide permanent houses to enable them live peacefully,.\n\nR. Sathish Kumar,\n\nKailasapuram\n\nComplete\n\nthe roadwork\n\nTwo years ago, I main road in Ramalinga Nagar was laid but the work has been left incomplete. Just in front of ICICI Bank ATM, a big projection is posing a problem to vehicle users and pedestrians. Since it is a junction and speed-breaker has been laid, accidents have become common. Drivers of buses and lorries can not take a turn at this junction. Often, they have to back up a little and then proceed, causing traffic jams.\n\nM. Kunchithapatham,\n\nWoraiyur\n\nCrackdown on\n\nsurge pricing\n\nWith Mahamaham just a few days away, most hotel rooms in and around Kumbakonam have been booked and very few rooms are left. The hotels have resorted to surge pricing, cashing in on the demand. The people coming to Kumbakonam from far off places have to suffer. The Government should crackdown on surge pricing by hotels.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nHold special\n\ncounselling\n\nThe recent suicides in Tamil Nadu are unfortunate. Parents should watch their children, especially adolescent girls, to protect them from depression. The Government should organise special counselling camps for college students. The youth should take oath to weed out suicidal tendencies.\n\nM. Baluswamy,\n\nKumbakonam", 
    "section": "national", 
    "title": "Let us have bus stand first", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}