{
    "author": [
        "D Madhavan"
    ], 
    "text": "Work is to be completed in June this year; all damaged structures are being repaired simultaneously\n\nWorkers are busy restoring the Madras High Court, a heritage building in the city with extra caution. Work to restore the iconic Indo-Saracenic building back to its former glory, with traditional brick and lime mortar, is in full swing.\n\nSince June last year, a team of experts from Public Works Department (PWD), Archaeological Survey of India (ASI – Chennai Region), Tamil Nadu Archaeology Department and National Centre for Safety of Heritage Structure (NCSHS) in IIT-Madras, have pitched in to restore the 124-year-old heritage structure that houses 36 court chambers on two floors.\n\nThe Rs 17.20 crore-project, funded by the State government and executed by the North Presidency division of PWD, is monitored by the High Court Heritage Committee headed by Justice R. Sudhakar, Judge, Madras High Court. The project covers restoration work in the old building and also subordinate court in George Town.\n\n“Deep cracks on the roof of the old building at the Court developed due to dampness and growth of vegetation,” officials told The Hindu.\n\nThe roof, well known for the ‘Madras Terrace,’ style consists of teak wood joints with brunt bricks laid on lime mortar.\n\nAt the High Court, the terrace of the heritage building, old Law Chamber, Madras Bar Association were affected due to dampness and unplanned construction including 30 concrete beams and five overhead water tanks over the years to support the air-conditioning system in the heritage court buildings. The weight of these extra structures led to the cracks that were around one foot deep. Weeks of labour was involved in removing beams and tanks, experts engaged in the restoration works said.\n\nArtisans, specialised in heritage restoration, have been engaged.\n\nBlack-yellow tiles from Mumbai, terrace tiles ( naattu vodu ) from Rajapalayam, lime stones from Virudhunagar and panaivellam and kadukkai from Kazhuugu Malai in southern Tamil Nadu, seen in the original construction, have been sourced.\n\n“The work will be completed by June,” officials added.", 
    "section": "national", 
    "title": "Madras High Court restoration project on", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}