{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Pugazhendi (47) of Kallimedu was found dead under suspicious circumstances with his flesh at hands and legs eaten away at G.V. Residency on Monday.\n\nAccording to the Singanallur Police, they found Pugazhendi, a painter, lying dead on a vacant plot in the area.\n\nThey took possession of the body and sent it to post-mortem.\n\nHe left home on Sunday night and had consumed liquor at a shop near G.V. Residency.\n\nHis wife Maheswari was a maid and they have a son and daughter, the police added.\n\nYouth found dead\n\nKannan alias Rajkumar (22) of Arasru was found dead with injuries at Devampalayam in Kovilpalayam Police limits on Sunday.\n\nAccording to police, there were injuries on his face and blood near his ears. His motorcycle was a few km away, said the police.\n\nAfter preliminary inquiry, they said that he was last seen with his friend Anil Kumar. The two had gone to Thudiyalur to visit a relative of Kannan.\n\nThe police had recovered the body and sent it to the Coimbatore Medical College Hospital for post mortem.\n\nMan arrested\n\nCoimbatore Railway Police have arrested Pandi (30) on charges of stealing mobile phone, PAN card, cheque book, identity cards and a few other documents from a government official, Kumar, who was on a train to Tirupur.\n\nThe police said that Kumar had boarded the Coimbatore-bound train to get down in Tirupur. But he slept through the journey only after the train reached the Coimbatore yard.\n\nOn being woken up by a train cleaning staff, he realised his bag containing the phone and documents was missing.\n\nHe then lodged a complaint with police and after inquiry nabbed Pandi who was moving around with the bag.\n\nPedestrian\n\nknocked down\n\nM. Selvaraj (51) of Pennagaram in Dharmapuri was killed in a road accident involving a car in Sulur on Sunday.\n\nThe Sulur Police said that the accident took place when Selvaraj tried to cross the Trichy Road.\n\nHe died on the spot. The police have registered a case against the car driver, R. Haridass on charges of rash and negligent driving.\n\nBurglars strike\n\nin Podanur\n\nBurglars struck at J. Stephen’s house at Sithannapuram, Podanur, on Saturday and decamped with jewellery and Rs. 20,000, said the Podanur Police who have registered a case.\n\nThe burglars had gained entry into the house through the rear.\n\nSuffers\n\ninjuries\n\nA one-and-a-half year old boy sustained injuries when he accidentally fell into a bucket containing hot water on Monday at his house at Ammapalayam in Tirupur.", 
    "section": "national", 
    "title": "Man found dead under suspicious circumstances", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}