{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The agreement between Nadigar Sangam and SPI Cinemas to build a multiplex at 18-ground Nadigar Sangam property in T. Nagar, which was the central plank on which actors Nasser, Vishal and Karthi fought and won the elections, has been cancelled after Nadigar Sangam agreed to the terms.\n\nIn a press meet here on Monday, senior actors Prabhu and Sathyaraj announced that the land has been officially retrieved from SPI Cinemas. With the cancellation of the agreement, it was announced that the case filed by actor Poochi Murugan will also be repealed. The announcement was officially done by a visibly emotional actor Prabhu, son of actor Sivaji Ganesan, who said that he still remembers how the previous building was built by senior actors. “I used to accompany my father when the building was being built. My wish is that the actors of today must come together to build the new structure much like how actors such as M.G. Ramachandran, my father and others built the old one,” he said.\n\nTreasurer Karthi said that the agreement has been cancelled after paying a sum of two crore and 48 lakh to SPI Cinemas. “We have paid them. The debt will be cleared in the due course of time,” he said.\n\nA number of initiatives have already been mooted by Nadigar Sangam members to clear the debts and put money in the bank such as jointly starring in a movie and through organising celebrity cricket match. Actor Sathyaraj said that the youngsters have achieved the feat against all odds and revealed that he will be more than happy to act in a movie to clear the debts. “I had two main doubts. First one was whether they will be able to win the elections and if the deal can be actually reversed since it was complicated. The youngster have done it and retrieved the historic Sangam property,” said Sathyaraj.\n\nA source from SPI Cinemas said that they continue to retain the ‘first right of refusal’ if Nadigar Sangam office bearers ever decide to build a multiplex in this property. While the newly elected Nadigar Sangam has maintained that they have no plans to build another multiplex, they said that a ‘state-of-the-art’ building will come up on the site for Nadigar Sangam members.", 
    "section": "national", 
    "title": "Nadigar Sangam cancels deal with SPI Cinemas", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}