{
    "author": [], 
    "text": "Mobile charging points installed as part of passenger-friendly initiatives at Mundagakanni Amman and Tirumayilai stations\n\nCommuters waiting on the platforms at Mass Rapid Transit System stations no longer need to worry if their cellphone battery drains out. The Southern Railways has arranged for mobile charging points at some of the stations. This facility is available at Mundagakanni Amman and Tirumayilai stations .\n\nOfficials say they are part of passenger-friendly initiatives which they have been planning for a while. Mobile charging points were available at the concourse and waiting areas of Chennai Central station and at the platforms in Egmore.\n\nUnlike suburban stations, where the waiting time is not more than 10 minutes for trains during the day, it is as long as 20 minutes at MRTS stations and hence they decided to create the charging points here, officials say.\n\nMobile charging points are available on air-conditioned Metropolitan Transport Corporation buses in the city and on long-distance trains, but this is the first time commuters of city train services can use such a facility. “I was pleasantly surprised that the Southern Railway came up with this idea. Many commuters experience low batteries when we need to make crucial calls and this will be of great help,” says P. Ravichandran, a commuter.\n\nCommuters are also worried, so are officials, about its maintenance. While commuters want the staff to ensure that the plug points are kept safe, officials said commuters too should use it with care.\n\nFactors contributing to traffic jams\n\nAn increase in the number of vehicles and Metro work have combined to make some areas of the city look chaotic at all times of the day.\n\nWith major portions of arterial roads, including Anna Salai and Poonamallee High Road, having been taken over for Metro work, motorists use alternative roads, including Kamarajar Salai (for south-bound traffic) and Puraswalkam High Road (for north-bound traffic).\n\nUnder these circumstances, even a small hold-up of traffic could cause a pile-up on these arterial roads.\n\nTraffic on Monday became bumper-to-bumper on sections of Anna Salai, Kamarajar Salai, and Wallajah Road, due to a protest and a government function. The protest at Ezhilagam clogged vehicular traffic in and around Triplicane, Santhome and Anna Salai, with the interior roads also filled with slow-moving vehicles.\n\nSimilarly, due to the government function organised to flag off more than 700 buses, Rajaji Salai, NSC Bose Road and a portion of Poonamallee High Road were clogged.\n\nR. Abishek, a motorcyclist from Ambattur, said normally on any weekday the Poonamallee High Road would be filled with vehicles. But on Monday, there was heavier traffic, due to which he reached his office late. He requested the City Traffic Police to avoid giving permission to protests during weekdays on roads affecting traffic in the city.\n\n(Reporting by K. Manikandan and R. Srikanth)", 
    "section": "national", 
    "title": "Now, MRTS commuters can charge their phones on the go", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}