{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Sets ultimatum to AIADMK, DMK on Kudankulam Nuclear Power Project\n\nPeople’s Movement Against Nuclear Energy (PMANE), along with its recently floated political wing, ‘Pachai Thamizhagam’, will commence an indefinite fast again if the ruling All India Anna Dravida Munnetra Kazhagam and the Dravida Munnetra Kazhagam fail to make clear their stand on Kudankulam Nuclear Power Project within 30 days, PMANE’s coordinator S.P. Udhayakumar has warned.\n\n“If these two major Dravidian parties fail to make their stand clear within one month on the KKNPP, wherein major breakdowns are happening frequently as it has been executed with equipment fabricated with substandard materials, the PMANE will resume the indefinite fast against the upcoming nuclear park,” Mr. Udhayakumar told reporters here on Monday.\n\nHe complained that KKNPP’s first reactor, on becoming operational again after being under seven-month-long maintenance, stopped generating electricity owing to a punctured steam line and it proved PMANE’s charges on the liberal use of substandard materials in constructing the reactor and its subsystems.\n\nMr. Udhayakumar claimed that there was no slackness in PMANE’s struggle against the KKNPP and no divide among the protestors even after one of his anti-nuke colleagues R.S. Mugilan “had acted in a wayward fashion” (by surrendering before a court in a few cases filed against him when the anti-KKNPP agitation was intense).\n\n“He (Mr. Mugilan) is acting at the behest of somebody, who wants to dent the PMANE. The anti-nukes will always vigorously oppose the KKNPP and anti-people projects like GAIL’s (LNG) gas pipeline, neutrino, etc. We’ll join hands with the protesting people and strengthen their agitation,” he said.\n\nMeanwhile, coordinator of People’s Federation Against Nuclear Energy Kolathur Mani said in Madurai on Monday that when other States were opposing setting up of nuclear power plants, the Centre was trying to establish four more nuclear power units in Kudankulam.“This comes at a time when the first unit has suffered multiple break downs owing to substandard materials used for fabricating equipment. The second unit was yet to start power production,” he said.\n\nThe State government had not withdrawn cases filed against anti-nuclear protestors as instructed by the Supreme Court. “The government is trying to intimidate the common man by issuing summons in connection with those cases,” he said.\n\nThe federation would stage a demonstration in Madurai on Wednesday in this regard, he added.", 
    "section": "national", 
    "title": "PMANE threatens indefinite fast", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}