{
    "author": [
        "P V"
    ], 
    "text": "The three-day old elephant calf that had gone astray from its mother, before it was led back to Udedurgam Reserve Forest on Monday. —Photo: N. Bashkaran\n\nA three-day-old elephant calf that had gone astray from its mother, was guided back to Udedurgam Reserve Forest in the hope that the calf would reunite with its mother, in Rayakottai here on Monday.\n\nThe visibly-fragile female calf was first sighted by locals on Saturday evening near Rayakottai.\n\nAfter being alerted, the forest department, in an hour-long late evening exercise, carefully drove the calf into the forest. However, less than 24 hours later, the calf had strayed out of the forest and was once again spotted by locals late Sunday evening.\n\nThe calf was delivered near Nallarallapalli, about seven km. from Rayakottai, enroute Kelamangalam. “There is a possibility that the calf couldn’t keep up with its mother’s pace and was left behind,” says Babu, forest ranger in-charge of Rayakottai range.\n\nOn Monday morning, the department personnel once again drove the calf in an anti-depredation vehicle into the forest.\n\nThis time, the calf was left deep inside Udedurgam Reserve Forest.The exercise itself was rendered with its own poignant moments, when the petrified calf kept returning to the proximity of humans.“It is rare for the highly protective mother to abandon its calf. Usually, a calf is abandoned if it is seen to be too weak to survive. It may happen in the case of a premature birth. But this calf did not look premature, and is likely to have lost contact, after it fell off the mother’s pace,” says Mr. Babu.\n\nHowever, the chances of the calf reuniting with its mother are high inside the reserve forest than along the fringes. Since the herd is likely to abandon the calf if it detected human scent, forest watchers had dissolved elephant dung and poured it over the calf to stifle the scent from human contact. “As the calf moves inside the forest, the mother might catch the scent of the dung and trace its way to the calf,” hoped Mr. Babu.", 
    "section": "national", 
    "title": "Poignant scenes mark effort to reunite three-day old elephant calf with its mother", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}