{
    "author": [], 
    "text": "Repair road\n\nThousands of vehicles are plying on Madurai-Rameswaram NH 49 every day. But the pitfalls on the road in Paramakudi between Government Hospital and Ottappalam threaten the passengers, drivers and even the pedestrians. Commuters suffer a lot every day when they use the road. Drivers lose control of the vehicles whenever they hit a pothole. The road should be repaired immediately to avert major accidents. I request the authorities concerned to take prompt action to improve the condition of the road.\n\nS. Mohana Murugan,\n\nParamakudi\n\nCollect entry fee\n\nThe newly constructed walking area adjacent to the ring road off Ramanathapuram Collectorate is fully fenced on all sides. Entry of pet dogs should be strictly prohibited inside the campus, besides preventing entry of vendors selling edibles. A large shed with light-roofing at the centre of the ground, if provided, could serve as a shelter in case of any unexpected rain. For enforcing these conditions and for upkeep of the ground, a nominal entry fee may be collected from visitors and regular walkers could be issued a card at a concessional rate. A mini first-aid centre has to be operated at the main gate for attending to emergency needs.\n\nAsmabagh Anvardeen,\n\nRamanathapuram\n\nStray dog menace\n\nRamanathapuram Municipality has not undertaken sterilisation of stray dogs in the recent past. Hence, the stray dog population has increased in the town. To eradicate rabies, dogs must be routinely vaccinated. The canines have not been administered anti-rabies vaccine but left on the streets and they have turned out to be a menace in the town. The municipality should take action urgently to ensure that the stray dogs are not rabid. It should also take action to send the sterilised stray dogs to uninhabited areas.\n\nG. Nagasamy,\n\nRamanathapuram", 
    "section": "national", 
    "title": "Readers’ Mail (Dindigul)", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}