{
    "author": [], 
    "text": "Welcome move\n\nIt has been proposed to construct an elevated parking bay at Tirunelveli Junction bus stand to accommodate at least 170 four-wheelers and 1,200 two-wheelers (Feb 3). If it is built, there will be no need for commuters to park their vehicles on road side and traffic congestion in and around the bus stand will be reduced to a large extent. The improper maintenance of the public toilet in the bus stand causes foul smell and has become a breeding place for mosquitoes.\n\nIn the interest of the public, the Corporation authorities should take steps to construct new toilets with modern amenities.\n\nP. Victor Selvaraj,\n\nPalayamkottai.\n\nWater tax revision\n\nThe Corporation has raised three-fold the water charges for residents of Tuticorin without adequate notice.\n\nThe enhanced tax rate is conveyed to the public only when one visits the collection centre to pay taxes. But water is supplied once a week or once in 10 days.\n\nN. Kasilingam,\n\nTuticorin.\n\nHelp fishermen\n\nFishermen of Tuticorin, Tirunelveli and Kanyakumari districts have reported poor catch in recent times.\n\nThey do not know what to do to enhance their yield.\n\nI request the Central Marine Research Institute to look into this urgent matter and suggest ways and means to improve catch.\n\nS.J. Sylvestine,\n\nKoottapuly.\n\nEvict encroachers\n\nThe 50-feet road in Raja Rajeswari Nagar, Tirunelveli, running parallel to Nagercoil Road and stretching from Sarah Tucker College Road to NGO B Colony terminus has been encroached by some individuals.\n\nSince the Nagercoil Road is flooded with vehicles, pedestrians and residents of Raja Rajeswari Nagar can alternatively use this road. Also, Tirunelveli Corporation has recently built a storm water canal along the Nagercoil Road and the encroachers run their vehicles directly over the canal to enter their premises. Another grave concern is that rainwater course from NGO B Colony and Raja Rajeswari Nagar streets is blocked by these encroachers.\n\nThe 30-feet road in some streets of Raja Rajeswari Nagar has been blocked on the western side adjacent to Nagercoil Road by encroachers.\n\nThe residents and the public are put to much hardship by these encroachers.\n\nThe Corporation and the Collector may view this issue seriously and remove all encroachments and enable the public to enjoy uninterrupted passage.\n\nJemila Samerin,\n\nTirunelveli.", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}