{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Amend relevant Acts to facilitate conduct of Social Impact Assessment’\n\nEven as her government filed a review petition on the Supreme Court judgment over the GAIL pipeline project on Monday, Chief Minister Jayalalithaa wrote to Prime Minister Narendra Modi the same day urging him to rescind all notifications issued in 2011 and 2012 over the project, in an attempt to settle the issue out of court.\n\nIn her letter, Ms. Jayalalithaa urged the Centre to rescind all the notifications and amend relevant Acts to facilitate the conduct of a Social Impact Assessment (SIA) in connection with the project.\n\n“I am confident that this sensitive issue which has huge implications for the farmers and the common people of Tamil Nadu can be resolved through a joint constructive and accommodative approach and a solution can be arrived at to lay the pipelines along the National Highways,” she said.\n\nContending that the project would cause “irreparable damage” to farmers in 7 districts, she said over 1.20 lakh fruit-bearing trees would be uprooted for the project and urged for conducting SIA by making amendments in relevant Acts. Presently, the Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, 1962, among 13 others, are exempted from the requirement to carry out the SIA.\n\nSince her government believed that a re-alignment of the pipeline route along the highways “would be the best way forward” for speedy implementation of the project, Ms. Jayalalithaa sought the Prime Minister to direct GAIL officials to be part of Expert Committee her government had constituted so that a “mutually acceptable solution” can be found.\n\nShe cited an apex court observation that once the right of use of land was notified, the State government had no power to direct as to how the pipeline was to be aligned and that the appropriate government under this Act was the Central government.", 
    "section": "national", 
    "title": "Rescind notifications: CM urges Modi", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}