{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Data obtained through Right to Information (RTI) Act by a health rights activist revealed acute shortage of Obstetrics and Gynaecology (OG) doctors and paediatricians in many Comprehensive Emergency Obstetric and Newborn Care (CEmONC) centres in Tamil Nadu.\n\nCEmONC centres were started across the State in a phased manner from 2004 with the aim of reducing infant and maternal mortality.\n\nThey were set up with round-the-clock emergency care for pregnant women and newborn, mainly at taluk-level government hospitals, so that patients need not travel more.\n\nHowever, data obtained by C. Anandaraj, associated with Madurai-based human rights organisation People’s Watch, revealed that some CEmONC centres are functioning with one OG doctor handling more than 2,000 deliveries a year.\n\nThe data provided by Directorate of Medical and Rural Health Services (DMRHS) for CEmONC centres operating in 56 government and government headquarters hospitals shows that 32 of them are operating with less than five OG doctors while 37 are functioning with less than five paediatricians.\n\nWhile the DMRHS has not provided the required strength for CEmONC centres, senior government doctors said that every CEmONC centre should have five OG doctors and five paediatricians, apart from anaesthetists and nurses to ensure round-the-clock service.\n\nThe situation is worse in places like Mannargudi which has one OG and one paediatrician as on January 2016, but there were 2,294 deliveries in 2014, of which 1,342 were Caesarean Section deliveries.\n\n“The data on number of deliveries in all CEmONC centres were available only for 2013 and 2014. Seeing the trend between 2013 and 2014, the numbers would have certainly gone up by now,” Mr. Anandaraj said.\n\nThere are also CEmONC centres with three or more OG doctors and paediatricians, but the number of cases is disproportionately high. For instance, CEmONC centre in Virudhunagar has three OG doctors and four paediatricians, but there were 2,256 Caesarean Section deliveries in 2014.\n\nWhile officials from the DMRHS could not be contacted for comment, a senior doctor from an association said that even if the government wanted to fill the gap, doctors were not ready to go despite additional allowances.\n\n“Doctors at CEmONC centres are the most overworked. They are also subjected to stringent audits as government is serious about mortality. Government should focus on rationalising the number of CEmONC centres and reallocating available doctors,” he added.", 
    "section": "national", 
    "title": "Shortage of doctors in CEmONC centres", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}