{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A number of major temples in Tiruchi, Perambalur, and Pudukottai districts have gone in for solar power units which has brought down the power consumption bill to a great extent. According to officials, the solar units of varying capacities depending on the requirement have helped bring down the power bill, though the plan involved an initial investment of Rs. 3 lakh to Rs. 9 lakh depending on the capacity of the plants.\n\nAccordingly, the executive officers of the Rockfort Sri Thayumanaswamy Temple, Sri Subramanyaswamy Temple in Kumara Vayalur Sri Vekkali Amman Temple in Woraiyur, Sri Jambukeswarar – Akilandeswari Temple in Tiruvanaikovil and Sri Mathura Kali Amman temple in Siruvachur near Perambalur volunteered to go in for the solar plant.\n\nThe Tamil Nadu Generation and Distribution Corporation (Tangedco) accords special concession to temples and levies Rs. 7 a unit. Even then, the temples had to shell out a huge sum ranging between Rs. 20,000 and Rs. 30,000 as bi-monthly expenditure towards energy bills.\n\nThe temples have been using the green energy during the day while at night, they switch over to the power supply from the Tangedco. Sources said the bi-monthly electricity bills have come down by about Rs. 5,000 at the Rockfort Sri Thayumanaswamy Temple, Rs. 10,000 atr the Sri Subramnyaswamy Temple in Kumara Vayalur and by Rs. 4,000 at Sri Mathura Kaliamman Temple in Siruvachur.\n\nThe Hindu Religious and Charitable Endowments Department introduced the plan about a year ago and the plan was being implemented in a phased manner at the temples where power consumption exceeds Rs. 20,000. However, sources said that additional quality should be ensured for the solar power units.\n\nThe HR and CE officials, based on the efficacy of the solar power unit, want back-up facility to be provided by the Tangedco so that the green energy could be best utilised at night.\n\n“At present, we have been using the solar unit only for meeting the power consumption during the day from 8 a.m. to 5.30 p.m. beyond which the supply from Tangedco is utilised,” says Executive Officer of Sri Subramanyaswamy temple at Vayalur K. Kathiresan.\n\nHe said that back up facility should be added to the solar unit so that the temple expenditure on power bills could be reduced.", 
    "section": "national", 
    "title": "Solar power illuminates temples, reduces bills", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}