{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The statue of freedom fighter and king of Ramanathapuram, ‘rebel” Muthuramalinga Sethupathy, installed at the entrance to the Collectorate complex and remained covered in plastic sheet for nearly three years for want of clearance, was unveiled on Monday.\n\nAfter the district administration and the Department of Information and Public Relations cleared the decks recently, Chief Minister Jayalalithaa unveiled the statue through video conferencing from Chennai. The third corridor, the world’s longest, at Ramanathaswamy Temple in Rameswaram was built by the king.\n\nAfter the Chief Minister unveiled the statue, Collector S. Natarajan garlanded it even as members of “Mamannar Rebel Muthuramalinga Sethupathy Makkal Iyakkam” and a group of All India Anna Dravida Munnetra Kazhagam (AIADMK) volunteers raised slogans hailing the king and the Chief Minister.\n\nAfter the Collector paid floral tributes, Raja N. Kumaran Sethupathy, the heir of the king, A. Anwar Raja, MP, and AIADMK district office-bearers, including Dharmar, K.C. Animuthu and Kavitha Sasikumar, paid floral tributes to the king.\n\nThe statue was made ready in 2010 after the State government passed an order in 1995 to unveil a statue in honour of Muthuramalinga Sethupathy (1760-1809), the first Tamil king to rebel against the British.\n\nA couple of years later, the Public Works Department (PWD) installed the statue on a pedestal but it could not be unveiled immediately following a Supreme Court order on installing statues at public places.\n\nAs a result, the statue of the king, who had spent nearly half of his life in prison, remained ‘imprisoned’ for nearly three years.\n\nThe third corridor, the world’s longest, at Rameswaram temple was built by the king", 
    "section": "national", 
    "title": "Statue of ‘rebel’ king unveiled", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}