{
    "author": [], 
    "text": "The Madras High Court on Monday adjourned a plea seeking a fresh post-mortem examination moved by father of Saranya, one of the three students of SVS Medical College of Yoga and Naturopathy who were found dead in a well near the college.\n\n“The first autopsy report itself is clear and is in favour of the petitioner,” Justice R. Mala said, reading out the contents of the post-mortem examination reports of the three girls conducted at the Villupuram Government Hospital. The judge then adjourned the matter to Tuesday allowing the petitioner to get an opinion from a doctor of his choice.\n\nOn February 3, Elumalai, raising suspicion over the death of his daughter, approached the court seeking a direction for fresh post-mortem examination at the Kilpauk Government Hospital in the presence of a doctor of his choice.\n\nHe also sought Rs. 25 lakh as compensation from the State government.\n\nMr. Elumalai alleged that though he made a complaint on January 24 requesting the district administration to conduct the autopsy in any of the government hospitals in Chennai, the authorities intimidated him to accept the post-mortem examination conducted at the Villupuram Government College.\n\n“When I refused to budge, they threw my daughter’s body out of the freezer box from the autopsy room and forcefully obtained consent from me,” the petitioner said. He added that he has no faith in the post-mortem conducted by the district administration in Villupuram.\n\nThe judge’s observations in court that the post-mortem was in favour of the petitioner set off a flurry of activity on the social media, with speculation that the cause of death was not drowning.\n\nHowever, the post-mortem report does not specify any cause of death, only reserving the final order awaiting analysis of the viscera.\n\nThe first\n\nautopsy report\n\nis in favour\n\nof the petitioner, says judge", 
    "section": "national", 
    "title": "SVS college row: High Court adjourns plea for fresh autopsy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}