{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Spoken Sanskrit class\n\n: A 10-day course on spoken Sanskrit will be conducted by Samskrita Bharati, Coimbatore, from February 11 to 20, for 2 hours at the following places - RS Puram, Saibaba Colony, Ganapathy, Singanallur, Peelamedu, Vadavalli and Edayarpalayam. The classes will be held at two timings - 10.30 a.m. and 6 p.m. These classes will be followed by regular weekly classes on grammar, Bhagavat Gita and slokhas. For registration contact: 94433 94367/ 68\n\nMoU signed\n\nSasi Creative School of Architecture (SCSA) has signed a memorandum of understanding (MoU) with Birla Institute of Technology, UAE. This makes SCSA an institution in Coimbatore to have a Foreign Architectural Twinning Studio. As part of the MoU, the students and teachers of respective institutions will attend exchange programmes.\n\nTraining programme\n\nThe Institute of Forest Genetics and Tree Breeding, Coimbatore, will organise a three-day training programme on ‘Biological Diversity Act 2002’ for college faculty, scientists and research scholars from Tamil Nadu, Kerala and Pondicherry between February 17 and 19. A total of 35 people will be taking part. A field trip to Chadivayal at the foot hills of Siruvani has been arranged.\n\nStomach cancer screening programme\n\nSri Ramakrishna Institute of Oncology and Research will be conducting a free oesophageal and stomach cancer screening programme in February. The programme will include consultation and investigations under the project ‘Deepam’. People can make use of the screening programme between 9 am and 5 pm on all working days at SRIOR premises. Contact: 0422-4389797; 0422-4500203; 95007-22889.\n\nBrands of Coimbatore\n\nCoimbatore Management Association – Student Chapter (CMA-SC) conducted the ‘Brands of Coimbatore’ award presentation function at the PSG College of Technology on Friday. Every year, CMA-SC selects five brands which has created a stamping signature in the mind of the people over the years and awards it as ‘Brands of Coimbatore’. The awarded brands of this year were Mahaveers, Bulls, CRI Pumps, Siruthuli, and Microbiological Laboratory. The event focused on sharing the life experiences of the entrepreneurs of selected brands in building the brand to the students. The entrepreneurs of the selected brands namely B. Balachand, Chairman of Mahaveers; V. Parthiban, Managing Director of Bull Machines; G. Soundarajan, Vice Chairman of CRI Pumps; Vanitha Mohan, Managing Trustee of Siruthuli, and M. Mani, Director, Microbiological Laboratory, shared their experiences with the students.", 
    "section": "national", 
    "title": "TAMIL NADU", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}