{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "In view of the maintenance works to be taken up at the R.S. Puram sub-station, there will be no supply of electricity between 9 a.m. and 2 p.m. on February 10 in the following areas – Arokiyasamy Road, Ramachandra Road, D.B. Road, Part of Lawley road, Thadagam Road, Cowley Brown Road, T.V. Samy Road (East & West), Sambandam Road (East & West), Lokamaniya Street, Sir Shanmugam Road, Subramaniam Road, Azad Road, West Periyasamy Road, P.M. Samy Colony, Sundapalayam Road, Part of Ponniarajpuram, E.B. Colony, Chokkampudur, Ramamoorthy Road, Shanmuga nagar, Sullivan Street, Telegu Street, Edayar Street, Raja street and B.B. Street (West).\n\nKaranampettai substation: Power supply will not be available between 9 a.m. and 2 p.m. on February 10 in the following villages: Karanampettai, Paruvai, Sangothipalayam, Perumakgoundenpalayam, Kadampady, Aero Nagar and part of Kankeyampalayam.\n\nMettuppalayam – Marudur substation: There will be no power supply from 9 a.m. to 2 p.m. on February 10 in Tholampalayam, Chenniveerampalayam, Kalattayur, MG Pudur, Karamadai, Velliangadu, Seeliyur, Thekkampatti, Pujanganur, Chikkarampalayam, Thayanur, Marudur, Kannampalayam and Karichipalayam.\n\nPeedampalli sub station: There will be no power supply between 9 a.m. and 2 p.m. on February 11 in the following villages: Kalangal, Peedampalli, Pattanam, Pappampatty, Akkanaickenpalayam, Pattanampudur, Pappampattypirivu, Kannampalayam, Nadupalayam (One Region), Chinna Kuili, Naikenpalayam, Pallapalayam.\n\nKalapatty substation : There will be no power supply between 9 a.m. and 2 p.m. on February 11 in the following villages: Kallapatty, Vellanaipatti, Veeriyampalayam, Cheranma Nagar, Nehru Nagar, Sitra, Kaikolapalayam, Valliampalayam, Balaji Nagar, K.R. Palayam, Villankurichi, Maheswari nagar, Thanneerpandal, Lakshmi Nagar, Murugan Nagar, Peelamedu industrial estate and Sharp nagar.", 
    "section": "national", 
    "title": "Tangedco announcements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}