{
    "author": [], 
    "text": "RELIGION\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Vinayagar Temple, Sri Vignesh Paradise, Melur Road, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 10, VIII Cross, Renga Nagar, 6 p.m.\n\nSt. Selvanayagi Ammal Church: St. Sebastiyar car procession, Alem Street, 7 p.m.\n\nGENERAL\n\nShrimati Indira Gandhi College CSI Women Students’ Branch and Department of Computer Science: Training on cloud computing for PG students of computer science, A.B. Karthick Anand Babu, web developer, K.K. Infotech, resource person, 2 p.m.\n\nBishop Heber College: Department of History, national conference on “recent trends in prohibition movement in India”, 10 a.m.; N. Manimekalai, director, Department of Women’s Studies, Bharathidasan University, delivers valedictory address, noon; Department of Biotechnology and Bioinformatics, Golden Jubilee BIOFEST 2016, P. Sridharan, Deputy Director of Income Tax, Tiruchi zone, distributes prizes, 5 p.m.\n\nSaranathan College of Engineering, Department of Instrumentation and Control Engineering: Ravi, Director, Mother Cell Regenerative Centre, Kauvery Medical Centre, speaks on “Recent trends in medicine,” 11.30 a.m.\n\nAIMAN College of Arts and Science for Women: V. Mahalakshmi, Senior Grade Assistant Professor, Department of Management Studies, J.J. College of Engineering and Technology, speaks on “Behavioural Finance,” 9.30 a.m.\n\nK. Ramakrishnan College of Engineering: CNC practical training, 10 a.m.\n\nAIMAN College of Arts and Science for Women Nutrition and Dietetics Association: Special address by V. Ravindranath, consultant diabetologist, speaks, noon.\n\nOrdnance Factories Sports Promotion Board and Heavy Alloy Penetrator Project: All India Ordnance and Ordnance Equipment Factories inter-zonal badminton tournament, T.K. Singha, General Manager, HAPP, inaugurates, 9 a.m.\n\nMinistry of Forest, Environment and Climate Change, Peace Trust and Voice Trust: National Environment Awareness Campaign, awareness meetings for marginal farmers, Irungalur, 10 a.m.; for school students, Purathakudi, 2 p.m.\n\nM.A.M. College of Engineering: Workshop on “Embedded systems,” K.C. Tamil Venthan, Director, Lift Technologies, resource person, 9 a.m.\n\nSeethalakshmi Ramaswami College Department of Economics: N. Shyamale, Head, Department of Economics, Holy Cross College, speaks on “Gear up to face the challenge,” 11 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}