{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Says State cannot be a silent spectator to miseries of 5,000 poor farmers\n\nNoting that it cannot be a silent spectator when 5,000 of its poor farmers suffer at the cost of a “corporation”, the Tamil Nadu government on Monday filed a review petition in the Supreme Court to re-consider the apex court’s decision giving Gas Authority of India Limited (GAIL) permission to lay pipelines cutting across seven districts of the State.\n\nOn February 2, a Bench led by Chief Justice of India T.S. Thakur held that a State government had no authority to create a roadblock for a project initiated by the Central government in national interest.\n\nObserving that it was not against the interests of the farmers, the apex court said the State government had neither the expertise nor the authority to demand altering the alignment of the pipeline.\n\nGAIL counsel said pipelines had already been laid out up to 200 km at the cost of Rs. 685 crore.\n\nA pipeline is to be laid between the Kochi terminal, Kuttanad, Bangalore and Mangalore. A pipeline up to about 300 km in Tamil Nadu will pass through Coimbatore, Tirupur, Salem, Erode, Namakkal, Dharmapuri and Krishnagiri districts.\n\nThe State, represented by advocate B. Balaji, argued that the alignment along National Highways was possible, which cause cause least displacement for agricultural activities.\n\n“Laying down pipelines below roads is more expensive than laying down pipelines under the fields,” the State said. It accused GAIL of acting as a “commercial entrepreneur bothered about the miseries of the farmers”.\n\n“The State is not against the project. It only wants to ensure that 5,000 poor farmers and their families do not get affected. The State cannot be a silent spectator and permit a corporation to proceed at the cost of its farmers. It is submitted that it is the bounden duty of the State to take all steps to protect the people living in the State,” the petition submitted.\n\nIt further argued that the apex court gave the go-ahead without examining that the pipeline was laid on lands having educational institutions in Erode, Namakkal, Coimbatore Krishnagiri and Tirupur districts. The pipeline was in the way of 25 educational institutions in Dharmapuri district of the State, leave alone houses and other permanent structures, it pointed out.\n\nThe State accused GAIL of not following the mandatory procedures prior to acquisition of land under the Petroleum and Minerals Pipelines (PMP) Act, 1962.\n\n“More than 85 per cent of landowners were not served notice as per the provisions in the Section 3 of the PMP Act,” it said.\n\nTerming the public hearings hosted by the public company to iron out differences with the local populace as a “farce”, the State said the issue of laying down the GAIL pipeline was not just a law and order problem. “The State, being responsible for the welfare of the people, has to take into account the apprehension raised by farmers and agree for a reasonable solution and that no project can ever be executed by the State government through police operations, thereby alienating the entire local population,” it said.", 
    "section": "national", 
    "title": "TN moves SC, seeks GAIL order review", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}