{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A total of 40 retrofitted scooters have been given with State government funds for the year 2014-2015\n\nPhysically challenged persons with the retrofitted scooters and tricycles on Monday.- Photo: C. Venkatachalapathy\n\nRetrofitted scooters, tricycles and wheelchairs were provided to nine physically challenged persons on Monday.\n\nJoseph D. Ravi, district differently abled welfare officer (DDWO), Vellore said two persons received the retrofitted scooters, while tricycles were given to four persons and wheelchairs to three.\n\nA total of 40 retrofitted scooters have been given with State government funds for the year 2014-2015, while another 26 vehicles have been provided to physically challenged persons.\n\nFunds for these have been used from the Member of Legislative Assembly Constituency Development Scheme during 2013-2014.\n\nTwo vehicles were given for each constituency.\n\nRecipients\n\n“The retrofitted scooters are given to persons aged above 18 years, with deformities in both the legs. Their upper limbs should be normal. Priority is given to college students,” Mr. Ravi said. The applicants can be employed in private firms or self-employed.\n\n“The applications are screened, and scrutinised by a selected committee headed by the Collector. The district differently abled welfare officer, regional transport officer and an orthopaedician are members of the committee. The applicants are called for an interview, and the retrofitted scooters are given to eligible persons,” he said.\n\nHe added that a retrofitted vehicle costs nearly Rs. 56,000, and the government takes care of the registration of the vehicle.\n\n“There is demand for the retrofitted scooters from physically challenged persons,” he noted.\n\nOfficials said a few hundred persons have applied for the scooters and are waiting for the interviews. Collector R. Nanthagopal handed over the keys of the vehicles to the beneficiaries.\n\nHe also handed over cheques for Rs. 1,500 each for 25 indigent artists during the public grievance redressal day, and ration cards to 60 persons belonging to Vellore and Walajah taluks, a press release said.", 
    "section": "national", 
    "title": "Transport aid given to differently abled", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}