{
    "author": [
        "Special Correspondent"
    ], 
    "text": "District Principal and Sessions Judge N. Seshasayee speaking at a meeting organised by Salem Bar Association on Monday to condole the death of the soldiers who were buried in snow at Siachen.- Photo: E. Lakshmi Narayanan\n\nRich tributes were paid to the Indian Army soldiers who were killed by avalanche in the Siachen Glacier in India controlled Kashmir on Wednesday, at a meeting brought up by the Salem Bar Association at the district court premises on Monday.\n\nThe speakers led by N. Seshasayee, Principal District and Sessions Judge, who spoke on the occasion said that the brave soldiers had sacrificed their lives for the nation and have set a worthy example for all others to emulate. Mr. Seshasayee said that the demise of soldiers was very tragic and the entire society should salute the martyrdom. He said that such sacrifices of the defence personnel had played a key role in protecting the country from the attack of enemies and maintaining its unity.\n\nMr. Seshasayee urged the people to contribute their mite for the overall development of the country in all spheres.\n\nLieutenant Colonel R. S. N. Satheesh of No. 12 (Tamil Nadu) NCC Battalion, Salem, said that the soldiers were trapped under snow after an avalanche hit their camp at 19,600 feet in the Northern Glacier sector in the Ladakh region of India controlled Kashmir.\n\nHe explained the difficult terrain the soldiers have to take care of in the border to keep the enemies at bay. The soldiers sacrifice their present life for the betterment of the country’s future. Subedar Major Giridar Singh also spoke. G. Ponnusamy, president of the Salem Bar Association, presided.\n\nK. R. R. Aiyyappamani, secretary of the Association, said that the people should not forget the brave warriors who left their lives in the border. Mr. Aiyyappamani said that the Bar Association will provide free legal aid to soldiers, ex-servicemen and their family members on the Army Day every year.", 
    "section": "national", 
    "title": "Tributes paid to Indian Army soldiers who died in Siachen", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}