{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a bid to optimally utilise the ‘platinum ten’ (the final countdown in the moments following a serious motor vehicle accident) and save human lives just after road accidents, Chief Minister Jayalalithaa flagged off 41 ‘two-wheeler ambulances’ which would be positioned at important road junctions to administer first-aid to the injured.\n\nImmobilisation, resuscitation, oxygen supply and bleeding control procedures performed during these crucial ‘Platinum 10’ minutes have the potential to save the lives of the injured by increasing the chances of their survival.\n\n“Even before the 108 ambulances arrive at the spot, these vehicles would facilitate in administering first-aid to the injured. This would go a long way in reducing the response time,” an official release said.\n\nDuring the last five years, the number of ambulances operating under the '108' scheme has increased from 385 to 755, the release stated, adding the 41 new two-wheeler ambulances at a cost of Rs. 70 lakh would complement the 108 ambulances.\n\nOf the total 41, 31 are customised on motorbikes and the rest on scooters to ensure that women too could use the two-wheeler ambulances. “It is to be noted that this is the first time in the country that women medical assistants would be operating these vehicles,” the release stated.\n\nThese vehicles, which would have sirens, would also have portable oxygen cylinders, pulsoxymeters, BP apparatus, glucometers, and digital thermometers.\n\nThe moment, emergency calls are received at the 108 control centre, these two-wheelers would be sent to the spots to administer first-aid to the injured.\n\n“If the impact of the accident is high and if there is a necessity to rush the injured person to a hospital, they would be rushed to the hospital through a 108 ambulance,” it stated.\n\nIn the first phase, these vehicles would be positioned in important junctions in the city and in spots where the footfalls are high and would be operated during the day time where the traffic flow is high.\n\nBased on the response and the necessity, the scheme would be expanded to other cities.", 
    "section": "national", 
    "title": "Two-wheeler ambulances hit the roads in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}