{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seek Collector’s intervention even as court verdict is in favour of 199 petitioners\n\nA group of Dalit women from Uthapuram who submitted a petition to the Collector seeking compensation for all in Madurai on Monday.— Photo: S. James\n\nA group of Dalits from Uthapuram village on Monday demanded equal distribution of the relief amount, ordered recently by the Madurai Bench of the Madras High Court for those affected in the 2008 communal clash, to all Dalit families in the village.\n\nAlleging partiality by the functionaries of the Communist Party of India (Marxist), the Dalits, who petitioned Collector K. Veera Raghava Rao, said that it was unfair to provide the relief amount to select families as the entire Dalit community in the village was affected in the violence.\n\nHearing a case filed by S.K. Ponnuthai, district president of All India Democratic Women’s Association (AIDWA), affiliated to the CPI (M), the High Court Bench ordered the State government to pay Rs. 1,19,40,000, at the rate of Rs. 60,000 each, to 199 affected Dalit families.\n\nPreparatory work was in progress and cheques were expected to be handed over to the families at District Legal Services Authority office in Madurai on Wednesday.\n\n“We want the Collector to intervene and ensure that all the 500 Dalit families in the village get the money ,” said V. Kasirajan, one of the petitioners.\n\nRefutes allegations\n\nWhen contacted, T. Chellakannu, district secretary of CPI (M)-affiliated Tamil Nadu Untouchability Eradication Front (TNUEF), who was actively involved in the court case, refuted the allegations of partiality.\n\n“The original list of 191 families was based on enquiries conducted by a commission formed soon after the riot. Eight more families who came forward later were also accommodated in the court case filed by us. No one else came forward until now assuming that the case will not succeed,” he said.\n\nStating that the TNUEF was not against granting relief fund to other Dalit families, Mr. Chellakannu, however, said that it was not possible to include them now as the court had issued the final order.", 
    "section": "national", 
    "title": "Uthapuram Dalits demand relief amount for all", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}