{
    "author": [
        "Madruai Bureau"
    ], 
    "text": "The election office here had removed duplicate names of voters and all efforts would be made to prepare flawless electoral rolls, said Collector N. Venkatachalam.\n\nAddressing an all party meeting here on Monday, he said that 9,716 names had been removed, of which 109 were double entries and 161 were of migrants. As per the final roll, total voters in the four Assembly segments of Theni district was 10,30,137 — 5,11,217 men, 5,18,792 women and 128 others.\n\nDravida Munnetra Kazhagam (DMK) members alleged that workers, mostly those employed in estates in Kerala, had been casting their votes in both the States during Assembly elections.\n\nDindigul\n\nThe district election office received 15,313 applications for inclusion, deletion and for making corrections in the electoral rolls through a special enrolment camp held on February 6, said Collector T.N. Hariharan.\n\nVirudhunagar\n\nA total of 25,660 names had been deleted from the electoral rolls of Virudhunagar district during the revision undertaken between January 5 and September 14, 2015, and from September 15, 2015, to January 1, 2016, said Collector V. Rajaraman here on Monday.\n\nAddressing an all-party meeting, Mr. Rajaraman said that the deleted names also included those who had shifted their residence from the respective constituencies. In the special camps held on January 31 and February 6, 18,718 applications were received for inclusion of names, 1,668 for deletion, 3,421 for correction and 2,209 for change of address. According to a press release, the Collector assured the political parties that steps would be taken to remove names from electoral rolls, as per the lists supplied by them, after due verification.\n\nRamanathapuram\n\nAddressing an all party meeting in Ramanathapuram on Monday, Collector S Natarajan said that in the final electoral roll released on January 20, names of 6,992 voters who either died or had double entries were deleted. Earlier, the Collector, accompanied by representatives of recognised political parties, inspected the receipt of electronic voting machines received from Bihar. The district administration received 1,673 ballot units and 2,500 control units and kept them in safe custody at the Tamil Nadu Civil Supplies Corporation godown.", 
    "section": "national", 
    "title": "‘Work under way to ensure error-free electoral rolls’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-09"
}