{
    "author": [], 
    "text": "The Agricultural Engineering Department would extend 50 per cent subsidy for farmers for setting up solar dryers to dry their agriculture produce. Farmers’ groups and individual farmers can avail the subsidy, which is limited to a maximum of Rs. 1.84 lakh. Solar dryer for a 400 sq. ft. area will cost about Rs. 3.68 lakh, Collector K.S. Palanisamy said in a release. The dryers can be used to dry farm produce such as vegetables, fruits, fish, meat, chillies, spices, and herbs in a hygienic manner without resulting in depletion of the nutrition content. They would be helpful in producing value-added products from these produce. Farmers who wish to avail the subsidy can contact the offices of the Assistant Executive Engineers of the Agriculture Engineering Department in Tiruchi, Musiri, and Lalgudi, the release added.\n\nHealth scheme for\n\nex-servicemen\n\nEx-service personnel who participate in the 1962, 1965, and 1971 wars and were discharged without pension can apply for being included under the Ex-servicemen Contributory Health Scheme (ECHS), Collector K.S. Palanisamy has said. In a release, Mr. Palanisamy said the scheme was being planned to extend cover to such ex-service personnel who had participated in the three wars. Those interested can apply to the office of the District Ex-Servicemen Welfare Office before January 10 with original copies of their certificates and identity cards, the release added.\n\nPensioners\n\nplead for parity\n\nThe Central Civil Pensioners Forum has appealed to the Union government to implement the recommendations of the VII Central Pay Commission at the earliest. A resolution adopted at the general body meeting of the forum held here recently, however, expressed disappointment over the 14.2 per cent increase recommended in pay and pension against the 40 per cent increase given in the Sixth Pay Commission. It expressed disappointment that full parity has not been granted to pensioners as recommended by the Fifth Pay Commission. The forum welcomed the suggestion on creating a Permanent Remuneration Authority to regulate pay structure every year and urged the government to initiate talks with service and pensioners associations to implement the same. It urged the Centre to exempt pension from Income Tax.", 
    "section": "national", 
    "title": "50 p.c. subsidy for solar dyers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}