{
    "author": [
        "S Senthalir", 
        "S Prasad"
    ], 
    "text": "(Clockwise) Residents and youth throng Puducherry Beach on Thursday night to usher in the New Year; Our Lady of Immaculate Conception Cathedral glimmers in decorative lights on New Year's eve and devotees line up to have darshan of Sri Manakula Vinayagar on the occasion of New Year in Puducherry on Friday.— Photos: S.S. Kumar and M. Samraj\n\nMid-night mass, all-night parties, outing at beach and boat house mark the occasion\n\nTwo-wheelers zoomed past on the streets of Puducherry at mid-night. Amid loud cheers of Happy New Year, the revellers burst firecrackers welcoming 2016.\n\nThough the New Year was incident-free barring minor scuffles in few areas the police had a tough time in controlling the revellers on Beach Road and other arterial roads in the town.\n\nParty animals thronged the hotels and venues where New Year eve parties were organised. Several luxury hotels were illuminated and lined up a series of events to attract revellers for the New Year. Along with domestic tourists, foreigners also joined in the celebrations that lasted till 1 a.m. Thousands gathered at Puducherry’s most popular spot, the Beach Promenade.\n\nYoungsters turned the Boulevard area into mini-party zones, with many indulging in rash driving. The Traffic Police had turned it into a pedestrian-only zone as early in the evening. Lanulemba Jamia, a Pondicherry University student, who visited the boat house said that Puducherry was a great place for celebrations.\n\n“We stayed at the Rock Beach from Thursday night to Friday morning. We arrived here after that. I am away from home for the first time and I am not homesick. The warmth of people in Puducherry has cheered me,” said Mr. Jamia, a native of Nagaland.\n\nBy Friday morning, signs of the all-night parties were evident on the streets with the roads strewn with litter.\n\nDevotees went to the many temples and churches here since the early hours of Friday on account of New Year to pray that 2016 bring peace and prosperity. The sanctum sanctorum of the Sri Manakula Vinayagar Temple was opened at 4 a.m. to enable the public to have darshan . Special worships were performed and thousands of devotees waited in long queues for more than five hours for a darshan since the morning. Long queues were spotted at Sri Aurobindo Ashram too.\n\nMidnight mass and prayers were also held at Immaculate Conception Cathedral and Sacred Heart Church in the town.\n\nNew Year in Chunnambar\n\nNew Year revelry at Chunnambar passed without any untoward incidents. The rain ravaged Paradise Beach did not hamper the fun and fervour. Nearly 1,320 attended ‘Rock the Boat’ New Year Eve Beach Party on Thursday. Beginning from 7 p.m., it went on till 12 a.m. People stayed on till the next day morning.\n\nApart from this, there were thousands who arrived at the Beach for a boat ride during the New Year eve.\n\nNearly 40 boats including speed, motor, row boats, wind surf, jetties, canoy, banana boats and peddle boats were deployed to ferry tourists to the Paradise Beach on Thursday.\n\nThe Paradise Beach was not completely ready to host the events with work on restructuring of huts and boat jetties still pending, tourists stood in long queues at Chunnambar Resort waiting for their turn to reach the Paradise Beach.\n\n“Though there were little shortcomings as everything was not ready as promised, we were able to manage with what we had done so far. We restructured six huts, the washrooms were renovated and we were able to manage with this. The tourists coming to this beach has increased steadily since Thursday after a lull due to the rains,” said Shaji. O.B., manager of the boat house.\n\nThe celebrations continued even on Friday. For many, this New Year began with peace and fun.", 
    "section": "national", 
    "title": "A grand welcome for New Year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}