{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "It will house a centre of excellence where colleges can collaborate\n\nTamil Nadu Industrial Development Corporation (TIDCO) has prepared the prototype for the proposed Aerospace Advanced Computing Design Centre, which will come up inside the Aerospace Park at Sriperumbudur. From an aerial view, this centre will resemble a drone. A 10-acre plot has been earmarked for this venture.\n\nThe Aerospace and Defence Industry Association of Tamil Nadu has engaged architects for the design. The project would cost Rs. 350 crore.\n\nTIDCO has suggested that funding can be obtained from TIDEL, ELCOT, various industrial bodies, banks, ASIDE, Government of India grants and internal accruals.\n\n“We will present the prototype and the proposals to these stakeholders and ask for their consent,” said a senior official from TIDCO. The first round of meeting regarding this venture took place a week ago is what top officials in the industries department say.\n\n“The feasibility study that was done by TIDCO was presented during the meeting,” said one of the officials who attended the meeting. If the proposals are cleared by the respective stakeholders work would commence by second half of 2016. The design centre will house a centre of excellence where colleges can come and collaborate; a skill development centre where one can learn about latest technology in the sector.\n\n“Space will also be allotted for start-up firms, that are working on the aviation sector. Most of these start-ups have 4-5 engineers and we can easily allocate 500 sq ft space for them to work,” said the TIDCO official.\n\nIt is learnt that TIDCO is also in the process of meeting the ISRO team. “We are ready to allocate space for ISRO if they wish to set up any kind of operations here. We will meet them soon regarding this,” the official added.\n\nTalking about the overall progress of the Aerospace Park TIDCO said that around 14 firms have been allocated land with proposed investment to the tune of Rs 3,000 crore.\n\nA source in the industry says, “When you look at the aerospace industry, Hyderabad and Bengaluru have been faring well for decades. Tamil Nadu has been talking about this for more than five years now. The State should look at this sector seriously and ensure that clearances are given quickly for firms who want to be a part of the aerospace park project.\n\nThe state has some of the best educational institutions in this space and these students migrate to other places for careers. If this can be tapped locally it will make economic sense,” he said.\n\nCurrently, there are more than 50 firms across Tamil Nadu which make components for the aerospace sector.\n\nSpace will also be allotted for start-up firms, that are\n\nworking on the\n\naviation sector", 
    "section": "national", 
    "title": "Aerospace computing design centre prototype ready", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}