{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "The damaged road at Chinnakumarapalayam (right) which was re-laid.\n\nEven basic works were not carried out all these years, say villagers\n\nChinnakumarapalayam is located about 20 km from Mettupalayam , and going to work, school or even just buy groceries or transport agricultural produce means the residents have to travel seven kilometers to the nearest town.\n\nRecently, after several protests and petitions by residents, a kilometer long road connecting Chinnakumarapalayam to Periyakumarapalayam, was finally re-laid at a cost of Rs. 42 lakh.\n\nThe road had remained damaged for over two decades before that. Even basic maintenance work was not taken up, say the villagers.\n\nFor the last two years, the public and the Village Development Organisation of Chinnakumarapalayam have been submitting petitions to elected representatives, local body and the district administration. With no action taken to re-lay the stretch, they resorted to special pujas (yagam) for it.\n\n“There are just two buses that ply to Chinnakumarapalayam and these come seven times a day. The village has a school only up till Class V. The villagers had to travel on that one badly damaged road. On some rainy days, the buses would not turn up at all to the village in the evening hours,” says V. Sivaelango of the Village Development Organisation.\n\nAfter the pujas in June, officials finally visited the village and the 12-feet wide road was re-laid by the Panchayat Union. “It has been re-laid for 1 km from Chinnakumarapalayam to Periyakumarapalayam,” says S. Rajammal, the Periyakumarapalayam panchayat head.\n\nMr. Sivaelango says the stretch beyond that stretch is better. Re-laying this road benefits not only the residents of Chinnakumarapalayam but eight other villages located nearby, he adds.", 
    "section": "national", 
    "title": "After 20 years, 1 km of road is re-laid", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}