{
    "author": [], 
    "text": "RELIGION\n\nGita: Satyavratananda Saraswati, Sankaralayam, Spurtank Rd., Chetpet, 11 a.m.; S. Arunasundaram, Sanskrit College, Thiru Vi Ka Rd., Mylapore, 6.15 p.m.\n\nThiruppavai: N. Rajeswari, Bashyakara Adhi Chenna Kesava Perumal Temple, West Mambalam, 7 a.m.; K. Venkatesan, Kanchi Shri Krishna College of Arts and Science, Kilambi, Kancheepuram, 11 a.m.; Sowmya Narayanachari, 10-C, Ramanujam St., Macmillan Colony, Nanganallur, 1.30 p.m.; Vijayaraghavachari, 15, 2{+n}{+d}Street, Ramalinga Nagar, Virugambakkam, 3 p.m.; Devanathachari, E-55-B, 19{+t}{+h}Cross St., Besant Nagar, 4 p.m.; T.N. Aravamudha Thathachari, Sri Desika Dharna Sabha, Pandiyan St., Taramani, 4 p.m.; V. Ramamurthy Ramanujan, 35, Dr. Azhagappa Rd., Purasawalkam, 6 p.m.; Ram Mohandoss, Sri Prasanna Venkatesa Perumal Temple, Sathanipettai, Guindy, 6 p.m.; Kalian Sampath, Sri Kasi Viswanathar Temple, Krishnapuram, Ambattur, 6.15 p.m.; J. Chinnathambu, Siva Vishnu Temple, Periyar Nagar, 6.30 p.m.; Venu Raza Narayanan, Sri Rama Kulasekara Azhwar Temple, Edward Park St., Kosapet, 6.30 p.m.; T.A. Srinidhi, Narayaniammal Kalyana Mandapam, Mandaveli, 6.45 p.m.; D. Srivallaban, 1, Sriram Nagar 1{+s}{+t}St., Selaiyur, 7 p.m.\n\nUpakara Sangraham: O.R. Devanathachar, 13/1, Kesavaperumal Sannadhi St., Mylapore, 4 p.m.\n\nHanuman Perumai: Harini, Lakshminarasimhar Temple, 24{+t}{+h}St., Thillaiganga Nagar, Nanganallur, 6.30 p.m.\n\nEka Sloka Prakaranam: Rajagopal, PS HSS., Mylapore, 6 p.m.\n\nSri Ramakrishnarin Amudha Mozhigal: Gautamananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nCULTURE\n\nOrganising Committee: Inauguration of exhibition of paintings ‘Lexicon’, Hotel Ambassador Pallava, 5.30 p.m.\n\nGENERAL\n\nAgaram Foundation, The Hindu Group and Puthiya Thalamurai: Seminar on ‘Protection of Environment and Water Resources’, St. Bedes School, Santhome, 10 a.m.\n\nTheosophical Society: Lecture on ‘Theosophy – Science Lecture’, Adyar, 5 p.m.\n\nSociety for Community Organisation Trust, Madurai: Justice V.R. Krishna Iyer’s centenary birthday celebrations and presentation of Justice V.R. Krishna Iyer award for socialjustice and human rights crusade, Asha Nivas, Rutland Gate 5{+t}{+h}St., 10 a.m.\n\nMadras Sanskrit College and S.S.V. Patasala and Kuppuswami Sastri Research Institute: Lecture on ‘Sanskrit and Mathematics’, Thiru Vi Ka Rd., Mylapore, 10.15 a.m.\n\nSoka Ikeda College of Arts and Science for Women: Global harmony day and blood donation camp, Madhananagkuppam, 9 a.m.\n\nYogi Ramsuratkumar Satsang Samithi Trust: Bhagwan Yogi Ramsuratkumar Jayanthi Vizha, 45, Singarachari St., Triplicane, 8 a.m.\n\nAnna Nagar Thamizh Peravai: Talk on ‘Thirumurugatruppadai’, Leo HSS., Anna Nagar West Extn., 6 p.m.\n\nMadras Kerala Samaj: Platinum Jubilee celebrations of Samaj and Golden Jubilee celebrations of Kerala Vidyalayam, Poonamallee High Rd., 4 p.m.\n\nDr. Ambedkar Academy: Meeting, L-73, Kavery Colony, 24{+t}{+h}St., Anna Nagar East, 6.30 p.m.\n\nChennai Bharathi Forum: Meeting, Umapathi Kalaiarangam, Anna Salai, 5 p.m.\n\nNarcotics Anonymous: Meetings, Turning Point Group, Arul Kadal Aikiya Aalayam, Santhome High Rd.; and New Attitude Group, St. Andrews Church, Choolai, 7 p.m.\n\nAl-Anon: Meetings, Community Service Centre, Balfour Rd., Kilpauk; Alagu Andavar Temple, Korukkupet; TPI Kalyana Mandapam, Avadi; and Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; and Iraivan Thantha Vaippu Kuzhu, Thiruvottiyur, 7 p.m.\n\nView full list at thne.ws/ChennaiEng", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}