{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Increased vigil by police; no fatal accident on December 31 night\n\nOn the day dress code came into force, people waited in a long line to enter Sri Prasanna Venkatachalapathy Temple at Tallakulam for New Year worship on Friday.— Photo: G. Moorthy\n\nThe New Year eve celebration was a low-key affair in the city.\n\nWhile many big hotels, which normally organised live band and other events for guests, had cancelled the same due to the recent floods in northern districts of the State, increased vigil by the police in regulating the crowd too had come as a dampener to the youth.\n\nLast year, the Vaikunda Ekadesi festival coincided with the New Year eve celebrations. Apart from the crowd visiting temples and those offering special services at churches, the city was abuzz with action throughout the night. However, this time, with the hotels not organising celebrations in a big way, and regulations coming from the law-enforcers since Christmas, it was a low-key on Thursday night. TASMAC outlets, which were overflowing with guests, were instructed to down shutters by 10 p.m., There was no let-up in the timing though there were requests to keep them open till 12 a.m., officials said and added that zigzag barriers at many points reduced the speed of motorists.\n\nAbove all, the police engaged video-graphers at many stretches and at intersections. Any person, who was found carrying three persons on a two-wheeler or was found talking on a mobile phone and driving, was videographed. After sending notice to the addresses, fines would be collected, officers said.\n\nThough there were a few freak accidents on TPK Road and near Kalavasal junction, the city did not experience any fatal accident on the last day of 2015.\n\nDress code\n\nA majority of the devotees, who visited temples in southern districts, had adhered to the dress code, which came into force from January 1.\n\nDevotees thronged the famous places of worship including Meenakshi Temple in Madurai, Nellaiappar Swamy Temple in Tirunelveli, Dhandayuthapani Swami Temple in Palani and Subramanian Swamy Temple in Tiruchendur on Friday to offer worship on the first day of the year.\n\nWhile the HR and CE officials had displayed huge boards about the High Court directive on dress code, devotees had come in saris and dhotis.\n\n“Only a miniscule number had turned up in either jeans or leggings.\n\nIn some temples, the staff stopped them and advised to wear only dhotis, pyjamas and not to come in jeans or lungi next time,” a senior HR and CE official said.\n\nWelcoming the implementation of the dress code, Swaminathan of S.S. Colony in Madurai who visited Meenakshi Temple said that when temples in Kerala strictly adhered to norms, why not follow them.\n\nIt would be more meaningful to have such an order in Tamil Nadu, where many cities are identified as heritage city or temple city.", 
    "section": "national", 
    "title": "City witnesses low-key New Year eve celebrations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}