{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The scheme will cover residents of Vellore Corporation, 11 municipalities, 5 town panchayats and 944 rural habitations\n\nJubiliation:Officials celebrate the inauguration of the Scheme by distributing sweets to public at Muthumandapam on Monday.- Photo: C. Venkatachalapathy\n\nThe Rs. 1,295 crore Combined Water Supply Scheme (CWSS), which was formally inaugurated by the Chief Minister on Monday, will cover residents of Vellore Corporation, 11 municipalities, five town panchayats and 944 rural habitations in the district.\n\nImplemented in three packages\n\nTouted as an answer to the acute drinking water scarcity faced by residents, the project that commenced during March 2012 was implemented in three packages by Tamil Nadu Water Supply and Drainage Board. Trial run was conducted early this year.\n\nCWSS with river Cauvery as source will supply 115 million litres of water per day (mld), which is the requirement of the current population of the scheme area, officials said.\n\nIt is designed to supply 181 mld to meet the drinking water requirement of residents for the intermediate population of 21.49 lakh in 2027. For the scheme’s ultimate population of 24.46 lakh in 2042, 215 mld will be supplied.\n\nBesides Vellore Corporation, CWSS will provide potable drinking water to residents of Tirupattur, Jolarpet, Vaniyambadi, Ambur, Pernambut, Gudiyatham, Melvisharam, Arcot, Ranipet, Walajapet and Arakkonam municipalities, Natrampalli, Alangayam, Udayendram, Odugathur and Pallikonda town panchayats and 944 rural habitations.\n\nPackage 1\n\nUnder package-1, treated water from the head works near Mettur Dam was being pumped to three booster stations at Komburankadu, Palakkanur and Muthampatti. This was then pumped to Master Balancing Ground Level Service Reservoir at Kadathur. The total length of the pumping main from the head works to this reservoir at Kadathur is 79.26 km.\n\nA number of works, primarily laying of gravity main from Kadathur to Vaniyambadi Break Pressure Tank (BPT), construction of common sumps, rural sumps, service reservoirs and distribution system, constituted package-2.\n\nIn this, there is gravitational flow of water to six common sumps of urban local bodies and panchayat unions. Water is again pumped from the common sumps to feed 20 panchayat sumps, 310 existing service reservoirs and three newly constructed service reservoirs.\n\nWater is distributed through a network of existing distribution system and 65.27 km of newly laid distribution system, according to a press release.\n\nUnder package-III, work to facilitate water flow from the Vaniyambadi BPT to Arakkonam was taken up. Water flows to 27 common sumps of urban local bodies and panchayat unions. This goes on to feed 103 panchayat sumps, 845 existing service reservoirs and 31 newly constructed service reservoirs.\n\nWater is distributed through existing distribution system and 237.74 km of newly laid distribution system, the release added.\n\nRuckus at council meeting\n\nA special resolution thanking the Chief Minister for implementing the Combined Water Supply Scheme (CWSS) created a ruckus at the council meeting of Vellore Corporation held two days later. Councillors of the DMK party opposed to the resolution that gave credit to the AIADMK government for implementing the CWSS. They said that it was the DMK that brought in the scheme, sanctioned funds, called for tenders and laid the foundation stone.\n\nResidents of Tirupattur, Jolarpet, Ambur, Pernambut, Gudiyatham, Arcot, Ranipet will benefit", 
    "section": "national", 
    "title": "CM inaugurates CWSS in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}