{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "It now looks that a common wage pact is coming up for workers in Tirupur knitwear cluster as various textile associations had tentatively decided to hold joint negotiations with the labour unions for fixing wage revisions.\n\nThe existing four-year wage agreement is going to come to an end in January. Till now, South India Hosiery Manufacturers’ Association and a few other associations were signing a wage pact with labour unions and Tirupur Exporters’ Association along with a few other associations had been signing a separate agreement.\n\nSouth India Hosiery Manufacturers’ Association (SIHMA) joint secretary R. Damodaran told The Hindu that a joint wage pact could bring parity in the wage scales across the sector and also the negotiations would become easier with the labour unions.\n\nA preliminary meeting of representatives of SIHMA, Tirupur Exporters’ Association and four other associations held here explored the possibilities of going ahead for a common wage pact.\n\nIn the meantime, the textile associations here had also asked the major trade unions which include CITU, AITUC, MLF, LPF, ATP and INTUC to come up with a joint set of demands prior to the commencement of the wage revision talks.\n\nAs a run up to the wage revision talks, the unions had actually given the representations containing the demands separately.\n\nTrade unionists said that they would be pressing for a substantial hike in the wages along with demands for introduction of perks like house rent allowance and medical allowance, which till now did not find place in the wage pacts.\n\nThe wage scales were usually computed separately for different segments of the production chain namely tailoring, ironing, packing, fabrication, knitting machine operations, damage checkers and labelling.", 
    "section": "national", 
    "title": "Common wage pact for knitwear workers likely", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}