{
    "author": [
        "R Sivaraman"
    ], 
    "text": "‘People are frustrated over the rule of AINRC’\n\nFormer Union Minister and AICC general secretary V. Narayanasamy, addresses the media in Puducherry on Friday.- Photo: S.S. Kumar\n\nSenior Congress leader and former Union Minister of State V. Narayanasamy on Friday asserted that his party would come to power in the Union Territory after Assembly polls as the people has been looking for a change.\n\nDecision on alliance\n\n“People want a change,” said, Mr. Narayanasamy. He expressed hope that the Congress would form the government in the coming year to provide good governance. He said Congress party president Sonia Gandhi and vice-president Rahul Gandhi would take a decision on forging alliances at the appropriate time. The party here led by Pradesh Congress Committee president A.Namassivayam, Leader of Opposition V.Vaithilingam and all others in coordination would face polls, he added.\n\nAddressing reporters here, he alleged that people have been frustrated over the misrule of the AINRC for the four and half years and various sections of people have been adversely affected due to the wrong policies and poor execution of programmes.\n\nAlleging that there was stunted growth in the Union Territory, he said no new employment opportunities were created and several prominent and popular industries were closed.\n\n“The present government had announced several welfare measures but had not fully implemented them. The government is completely dysfunctional. ”, said Mr. Narayanasamy.\n\nIrregularities in relief assistance distribution\n\nStating that the government has grappling with heavy financial burden, Mr. Narayanasamy said as the Central Government has released only Rs.50 crore as interim relief assistance, the Union Territory administration has been spending for relief and restoration works by diverting the fund of Rs.185 crore meant for government employees.\n\nHe alleged that the relief assistance of Rs.4000 which was announced by the government has not reached many cardholders still and more than a lakh have been left out in Puducherry and Karaikal.\n\nHe also added that several people have been still dragged pillar to post daily for the release of relief assistance.\n\nAlleging large-level irregularities in rendering relief assistance, the Congress leader also said the government has not disbursed assistance to the people who had lost their homes or whose houses had been damaged in the recent flood.\n\nNo assistance was extended to the unorganised labours and weavers too, he further added.\n\nScrapping of National Development Council\n\nPointing out that the Narendra Modi-led Government at the Centre is attempting to close down the National Development Council, Mr. Narayanasamy termed it as an unilateral act of silencing the voices of States which would be heard at the Council in regular interval.\n\nCondemned the attacks on journalists, he said appropriate action should be initiated against the attackers whoever it may be.\n\nThe Congress leader furtehr pointed out that the Puducherry government had filed a criminal case against a journalist. He had criticised about the irregularities and had stated in his article that the government has been attempting to strangulate the voice of democracy.\n\nHe pointed out that there was no new exployment opportunity created in the UT", 
    "section": "national", 
    "title": "Congress will come to power: Narayanasamy", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}