{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Encroachments along commercial streets, haphazard parking of vehicles in the absence of sufficient notified parking lots, and large-scale violation of building norms dominated a consultation meeting organised by the Consumer Protection Council, Tamil Nadu, here on Thursday.\n\nM. Vijayalakshmi, Commissioner, Tiruchirapalli City Corporation, was the chief guest of the event.\n\nIn his introductory speech, S. Pushpavanam, secretary, CPC, said although the city had been doing well on some aspects of civic amenities, including street lights and water supply, it had to improve on many aspects. Indiscriminate encroachment continued to be an area of concern. The pavements on shopping centres such as NSB Road, Gandhi Market, and Big Bazaar Street have been occupied by hawkers and roadside shops.\n\nSimilarly, roads had been narrowed down because of encroachment by shopkeepers. Numerous petitions sent to the corporation authorities on this had not evoked any response.\n\nTouching upon the traffic snarl on Pattabiraman Street, a participant said the road had been converted as showroom area for pre-owned two-wheelers. Similarly, two-wheeler workshops had occupied a portion of the road. It had shrunk the already narrow road.\n\nLarge-scale violation of building rules by builders, commercial complexes, and individual houses were the other topics raised by many people at the meeting.\n\nA speaker said that many buildings, apartments, and commercial complexes had been constructed deviating from the approved plan. They could have been averted at the initial stage itself had the authorities been alert.\n\nV. Ganapathy said that a new road from Kallankulam to Collectorate across the Uyyakondam canal could be formed to decongest the traffic to an extent in Puthur, and Vayalur Road.\n\nOn sewage treatment plant at Panjappur, another speaker said the technology being adopted at the plant had become outdated. If latest technology was followed, the plant could become efficient. It would just require one-fourth of the land that was presently used.", 
    "section": "national", 
    "title": "Consumer council interaction turns into a grievance meet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}