{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Anil Swarup, Secretary, Ministry of Coal, inspecting the construction of Neyveli New Thermal Power Station on Friday. S.K. Acharya, CMD, NLC (left) is also seen.- Photo: Special Arrangement\n\nIndia’s coal imports fell by 10 per cent this year due to increase in output and is on track to become self-sufficient, Anil Swarup, Secretary, Ministry of Coal has said.\n\nReviewing the mining operations and power generation procedures in Neyveli Lignite Corporation (NLC) on Friday, Mr. Swarup said the country’s local output had registered an unprecedented increase due to the Central Government’s push and it is on track to become self-sufficient in thermal coal and power production.\n\nAmbitious target\n\nThe Union Government has set an ambitious target of generating 175,000 MW of energy through renewable energy sources. In this, solar is expected to contribute 10,000 MW, he said.\n\nMr. Swarup also visited the open cast lignite mines and thermal power plants in Neyveli and reviewed their performance. He also visited the site of Lignite based 1000 MW Neyveli New Thermal Power Project (NNTPP) and enquired about the status of the project.\n\nThe Coal Secretary also appreciated efforts taken by NLC for installation of solar photo voltaic plants to the extent of 4,000 MW in Tamil Nadu, Rajasthan, Karnataka, Kerala, Andhra Pradesh and Telangana. Mr. Swarup also met the unit heads of various plants and departments and reviewed the status of the ongoing projects.\n\nMaharatna status\n\nSarat Kumar Acharya, CMD, NLC said that NLC was moving towards raising the total generating capacity towards achieving Maharatna status. NLC has also accorded importance for renewable energy in its growth path.\n\nHe said that NLC had plans to achieve a lignite mining capacity of 56.9 million tonnes per annum (MTPA) compared to the present capacity of 30.6 MTPA.\n\nIt was also moving towards raising the total generating capacity of about 19,831 MW against the present capacity of 4,271 MW.\n\nSubir Das, Director (Mines) and V. Thangapandian, Director (Power) participated.", 
    "section": "national", 
    "title": "Country’s coal production on the rise: Secretary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}