{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The New Year's Day mass attracted a large turnout at St. Mary’s Cathedral Church, Melapudur, in Tiruchi.— PHOTO: G. GNANAVELMURUGAN\n\nCrowd management had become a challenge at the Rockfort Sri Thayumanaswamy Temple in Tiruchi on New Year's Day.— PHOTO: A. MURALITHARAN\n\nA large number of devotees visited major temples in the region and prayed to the presiding deities on the occasion of New Year’s Day on Friday.\n\nElaborate security was in place at a large congregation of devotees turned up at Rockfort Sri Thayumanaswamy temple, Sri Vekkali Amman temple in Woraiyur, Sri Ranganathaswamy temple in Srirangam, Sri Subramanyaswamy temple in Kumara Vayalur, and Sri Panchavarnaswamy temple in Woraiyur.\n\nA serpentine queue of devotees was seen at Sri Ayyappa Temple, Sri Thayumanaswamy Temple from the morning and volunteers and police personnel were regulating the queue.\n\nIn Thanjavur, a large number of devotees offered worship at the Big Temple. Special ‘abhishekam’ was performed to Sri Brahadeeswarar and Sri Brahanayaki at the temple.\n\nAt Swamimalai, special abhishekam was performed to Sri Swaminathaswamy (Lord Murugar).\n\nA large turn out of devotees was seen at Sri Punnainallur Sri Mariamman temple.\n\nIn Pudukottai, a large number of devotees prayed at Sri Bhuvaneswari at Sri Judge Swamigal Adhishtanam. Special poojai and alankaram was performed on the occasion.\n\nHundreds of devotees offered worship to Sri Mathura Kali Amman temple at Siruvachur.\n\nSpecial alankaram was done to the presiding deity.\n\nSpecial prayer was held at the Basilica of Our Lady of Good Health to mark the New Year’s Day. Most Rev. Devadas Ambrose, Bishop of Thanjavur Diocese and Fr. A.M.A. Prabakar, Rector of Velkanni Shrine, participated in the prayer.\n\nSpecial mass in Tamil, English, Malayalam, and Hindi was held.", 
    "section": "national", 
    "title": "Devotees throng temples, churches on New Year’s Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}