{
    "author": [
        "Special Correspondent"
    ], 
    "text": "PWF, DMK and BJP are individually trying to strike an alliance with Vijayakant\n\nThe growing demand for the DMDK from three different political groups has clearly strengthened its hands with sources indicating that the party is now bargaining harder. Given that the Assembly elections are just three months away, the cat and mouse game being played by the DMDK has upset many.\n\nSources in the People’s Welfare Front (PWF) claimed that when its leaders met DMDK president Vijayakant two weeks ago, they were told that the DMK had offered him the post of Deputy Chief Minister in case the alliance was victorious.\n\n“This indicated to us that the DMK too was in talks with the DMDK. We persuaded him to consider providing an alternative to the two Dravidian parties against which the resentment is growing,” a senior PWF leader claimed.\n\nHowever, DMK leaders categorically denied making any such assurances and said the party would consider such modalities only after the alliance is confirmed.\n\n“Mr. Vijayakant continues to equate the DMK with the AIADMK and is criticising us heavily,” a leader pointed out.\n\nMeanwhile, the BJP camp said that Mr. Vijayakant did not explicitly place any demands, but clearly indicated that he would want to lead the alliance in case he joined the NDA.\n\n“Our idea was to arrive at a compromise between the DMDK and the PMK and revive the NDA of 2014. But as things stand today, there seems to be no room for this,” a BJP leader said.\n\nWithin the DMDK, the confidence with which BJP leaders have claimed that the alliance talks would be completed by January 20 has created a stir since a strong section within the party wants an alliance with the DMK. A senior DMDK leader said even if the party led the NDA, winning seats would be difficult given that the cumulative vote share of the parties may not cross 15 per cent.\n\nAddressing a press conference on Friday, BJP national secretary H. Raja said the delay in finalising seat sharing in 2014 was the reason why the NDA lost a few seats where prospects were bright. “We want to complete the alliance talks by Pongal,” he said.\n\nBJP's decision to complete talks by January 20 has created a stir within the DMDK", 
    "section": "national", 
    "title": "DMDK’s bargain puts parties on sticky wicket", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}