{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "A banner detailing the High Court directions on dress code for devotees displayed at the entrance of the Nellaiyappar Temple in Tirunelveli.— Photo: Lakshmi Arun\n\nThe dress code for devotees visiting temples that came into effect from Friday following the High Court’s order was not enforced in a stringent manner when hundreds of devotees thronged the temples for New Year special prayers.\n\nSwamy Nellaiyappar Temple administration had kept a huge banner at the main entrance that explained in detail the dress code to be followed scrupulously while entering the temple for darshan.\n\nWhile almost all men came to temple either in pants or dhotis after carefully avoiding jeans, a few girls, who had come to the temple with leggings were also allowed with a warning that the ‘grace period’ would not be extended beyond a week.\n\n“Some of the devotees, particularly girls, are not aware of the dress code prescribed by the court… We’re sensitising those who fail to comply with the instruction. At the same time, the ‘grace period’ will not get extended beyond a week,” a temple official said.\n\nNagercoil\n\nThe temples under the control of Hindu Religious and Charitable Endowments Department in Kanyakumari district have started enforcing the dress code for devotees and visitors as per the directions of the Madurai Bench of the Madras High Court from Friday.\n\nMost of the temples in Kanyakumari district followed the Kerala pattern – men were prohibited from wearing shirts.\n\nUnaware of the court directions on dress code, many foreign tourists and tourists from northern states visited the temples as usual on Friday. They were frisked by the security personnel at the Bhagavathy Amman temple in Kanyakumari, Sthanumalayan temple in Suchindram and Adi Kesava Perumal temple at Thiruvattar and sent back.\n\nMany devotees who were sent back by the security personnel, visited the temple in Kanyakumari again in dhoti, said Siva Ramachandran, Executive Officer of Bhagavathy Amman temple. Banners on dress code to be followed by the devotees were kept in three places around the temple. The banners were printed in Tamil, English and Hindi, Mr. Ramachandran said.\n\nHowever, the directions were not strictly followed in a few temples, as the authorities were yet to create awareness among the devotees. Many girls and men, who visited Nagaraja Temple in Nagercoil with leggings and jeans, said no one objected to their entry into the temple.\n\nSoon after the High Court issued the orders, the Hindu Religious and Charitable Endowments Department directed the temples under its control to enforce the rules pertaining to the attire of the devotees and visitors according to agamas, traditions and customs of the individual temples.\n\nJustice S. Vaidyanathan had ordered that from January 1 men should wear a “dhoti or pyjama with upper cloth or formal pants and shirts” to temples and women should wear “a sari or a half sari or churidhar with upper cloth.” Children could wear “any fully covered dress.”\n\nHowever, temples where men were prohibited from wearing an upper cloth could continue the practice, he clarified.\n\nDevotees not following dress code allowed with a warning that ‘grace period’ will not be extended beyond a week", 
    "section": "national", 
    "title": "Dress code comes into effect in temples", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}