{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "SPECIAL SERVICE:Priests conducting Holy Mass at St. Joseph's Church in Dindigul on Friday, heralding the New Year; (below) midnight special prayer service at Holy Rosary Church in Ramanathapuram.— PHOTOS: G. KARTHIKEYAN AND L. BALACHANDAR\n\nDevotees wait for more than four hours to have darshan at Palani temple\n\nIn the wake of Madras High Court directing Hindu Religious and Charitable Endowments department to implement dress code for devotees visiting temples in the State from January 1, several temples displayed signboards on dress code on Friday. But they were not strict in implementing the order on New Year’s Day.\n\nClad in jeans and leggings, several pilgrims were waiting in a long queue to have darshan at Dhandayuthapaniswamy Temple in Palani. They waited for more than four hours in the morning to have darshan. Sources said that since it was felt that denial of permission to enter the temple on New Year day would hurt the sentiments of the devotees, those who came dressed “improperly” were just given advice. The dress code will be implemented strictly from Saturday.\n\nA majority of men and women and Ayyappa devotees wore traditional dress only.\n\nIn Theni, Gowmariamman Temple administration also was very lenient in implementing dress code on New Year day. However, many young men and women who were wearing jeans and leggings, on coming to know about the dress code, opted not to enter the temple on their own volition. When parents persuaded them to come into the temple, the temple officials advised them to follow the dress code from their next visit.\n\nThe situation was same in other major temples in these districts.\n\nAs per ther dress code, men have been advised to wear dhoti, shirt, pyjama or pant and shirt. Women and girls were advised to wear sari or churidar or half-sari. Devotees wearing lungi, shorts, jeans and tight-leggings will not be allowed into the temples.\n\nRamanathapuram\n\nA large number of Christians and Hindu devotees visited churches and temples in the two districts and offered special prayers on the occasion of New Year on Friday.\n\nChristians attended midnight mass and offered special prayers at Catholic and Protestant churches at Pamban, Thangachimadam, Rameswaram, Olakuda and Oriyur in Ramanathapuram district and Idaikattur in Sivaganga district on Thursday night, while Hindu devotees visited the Temples in the early hours of Friday and offered special worship.\n\nHoly Rosary Church in Ramanathapuram, St. Joseph’s, Annai Velankanni and Infant Jesus Churches in Pamban, St. Arulanandar Church at Oriyur and Church of South India (CSI) Churches here and Rameswaram were specially decorated for the occasion. After offering worship, they exchanged New Year greetings.\n\nA large number of devotees thronged Ramanathaswamy Temple in Rameswaram and offered special prayers. Though the temple authorities have not made any arrangement for special pujas on the occasion of New Year, devotees visited the temple from the small hours.\n\nThey were seen attired in traditional dress as the new dress code for temple entry, which came into effect on Friday.\n\nDevotees visited Adhikesava Perumal Temple at Sakkaravalanallur near Devipattinam and offered special prayers to the 10-foot-high Perumal idol, decorated with Golden ‘kavasam’ and seen with his consort Perundevi Thayar.\n\nDevotees also visited the famous Vinayagar Temple at Pillayarpatti, Koppudainayagi Amman Temple at Karaikudi, Kannudai Amman Temple at Nattarasankottai, Kaleeswarar Temple at Kalayarkoil near Sivaganga.", 
    "section": "national", 
    "title": "Dress code relaxed at temples for New Year’s Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}