{
    "author": [], 
    "text": "The Madras High Court has set aside a Government Order (GO) restricting the minority status of a city-based Christian educational institution to five years noting that a minority status once granted would hold good even if the institution is not run contrary to its by-laws.\n\nThe issue pertains to a GO dated May 20, 2009 issued by the State Higher Education Department restricting the minority status given to St. Christopher’s College of Education located at Vepery, Chennai to a period of five years from the academic year 2007-08.\n\nContending that the restriction made by the government is contrary to the orders of the Division Bench of the court, the college prayed the court to quash the GO and declare the college as a permanent minority institution.\n\nWhen the issue came up for hearing before Justice M.M. Sundresh, the judge referred to a judgment of the Division Bench of the court which read, “It may be noted that Christians are minorities not only throughout India but also in the State of Tamil Nadu. The same is also made clear in the GO issued by the Higher Education Department dated June 17, 1998. The GO stated that to decide whether an applicant is a minority or not based on religion or language, the total population of that minority in the State of Tamil Nadu shall be taken into consideration and not the population of that minority in any particular region, where the educational institution is situated.”\n\nNoting that the order restricting the minority status is contrary to the GO of June 1998, the Division Bench’s had said, “It is also to be noted that the said GO nowhere states that minority status can be given for a limited period. The government is also not doubting the claim of minority status of the college. Hence, the order restricting the period is without any rhyme or reason.” Concurring with the order, Justice Sundresh said, “The government is neither able to distinguish the decisions referred nor produce any record to show that the petitioner institution has to be treated differently.”\n\nBench noted that the order restricting minority status is contrary to GO\n\nof June 1998", 
    "section": "national", 
    "title": "GO restricting minority status of educational institution set aside", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}