{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court has directed its Registry as well as all subordinate courts in Tamil Nadu and Puducherry to do away with varied practices followed by them while entertaining appeals preferred by legal representatives of deceased litigants and follow a uniform procedure of not insisting on separate applications to accept cause titles.\n\nJustice S. Nagamuthu passed the order when he came across an application moved by the children of an aged woman, who died after the dismissal of a first appeal filed by her before a lower court with respect to an immovable property, seeking permission from the High Court to accept their names in the cause title and allow them to pursue the second appeal. Wondering why and from when the High Court Registry began insisting on such applications from legal representatives, the judge pointed out that the law on the issue was settled 134 years ago when a Division Bench of the High Court in 1881 itself held that legal representatives can file appeals directly without making a preliminary application to be bring them on record. That decision in Ramananda Sastri versus Minachi Ammal had been followed by the Lahore High Court in 1939, the Himachal Pradesh High Court in 1954 and the Allahabad High Court in 1971. Hence, it is enough if appellants either submit a copy of legal heirship certificate or explain in the appeal memorandum as to how they claim to be legal representatives of the deceased litigant, the judge said.\n\nSince it was brought to the notice of the judge that there was no consistency on the issue between lower courts in various districts in the State, he ordered that the procedure laid down by the High Court in 1881 and reiterated by him now shall be followed by all courts in Tamil Nadu and Puducherry. He also directed the Registry to place the matter before the Chief Justice for issuing a circular.\n\nAsks Registry not to insist on separate applications to accept cause titles", 
    "section": "national", 
    "title": "HC directs courts to follow uniform procedure in entertaining appeals", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}