{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Renowned mathematician strongly advocates including music in school curriculum\n\nProf. Manjul Bhargava, R.Brandon Fradd Professor of Mathematics, Princeton University, U.S. conferring the title ‘Sangita Kalanidhi’ on Sanjay Subrahmanyan at The Music Academy in Chennai on Friday. Academy president N. Murali is in the picture.— Photo: M. Vedhan\n\nMaking a strong case for including classical Indian music in the school curriculum, renowned mathematician Manjul Bhargava said it “can help the country produce not just better artists, but better scientists, judges, innovators and in general, better humans.”\n\nTo drive home the point that music make individuals highly creative, he quoted Steve Jobs, famous for his products that married top-notch aesthetics and engineering. “When asked how Macintosh had revolutionised computing, Steve Jobs remarked that it was because he loved to hire computer scientists who were also trained in fine arts, who showed far greater innovative ability,” he said.\n\nAddressing the Sadas of the Music Academy and conferring the Sangita Kalanidhi award on vocalist Sanjay Subrahmanyan, Mr. Bhargava, tabla player himself, said classical Indian music was mathematically deep and aesthetically complex and was an extremely expressive art.\n\nMr. Bhargava, the R. Brandon Fradd Professor of Mathematics, Princeton University, said there was something about classical music that made one more creative even in other endeavours, reiterating that great mathematicians including Srinivasa Ramanujan and C.S. Seshadri had a classical musical background.\n\nMr. Bhargava explained what many people were not aware was that Bharatha's Natyasastra and Sharagadeva's Sangita-ratnakara, the two groundbreaking works on music were also groundbreaking works on mathematics. Let us try to make classical Indian music part of school curriculum to make sure that this form of art continues to evoke the best from our young people,” he said.\n\nPresident of the Academy N. Murali said the Academy intended to make its contribution very soon to flood relief and rebuilding, including to musicians, affected by the recent floods. Sanjay Subrahmanyam said the two week of concerts and lecture demonstrations were self-fulfilling and rewarding experience.\n\nEarlier, Mr Bhargava conferred Sangita Kala Acharya award on vidvan T.H. Subash Chandran and Mysore G.N. Nagamani Srinath.\n\nTTK awards were given to nagaswaram player Seshampatti T. Sivalingam and veena player Kamala Aswathama (not present due to ill health). The musicologist award went to Gowri Kuppuswamy.", 
    "section": "national", 
    "title": "‘Indian music mathematically deep’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}