{
    "author": [
        "L Renganathan"
    ], 
    "text": "Thanjavur-Kumbakonam region becoming notorious for bad oads\n\nBad road stretches filled with potholes that are sometimes quarter of one-foot-deep break the back of travellers and commuters who venture to visit Thanjavur.\n\nThe callous attitude of the officialdom in attending to the road damages even a fortnight after the rains have receded has appalled the citizenry.\n\nThe stretches that lead to Thanjavur from Kumbakonam via Karunthattankudi, Tiruvarur through the Mariamman Koil Road and the Nanjikkottai Road that is now the exit point for buses bound for Pattukkottai region are all in bad shape.\n\nRiddled with potholes, the roads have turned into dust bowls causing hardship not just to travellers but to nearby residents. The Karanthai stretch is awful and its condition has worsened after the recent rains. Potholes are too shallow a term to describe the pits that dot the road.\n\n“The stretch from TNSTC bus depot on the Vadavaru banks to the Jambu Cauvery culvert bridge is atrocious. It is difficult to navigate the buses through the stretch. If we have to stomach the scorn of passengers travelling by the bus, we also have to endure the hiding of our senior depot officials for the damages caused to the vehicle,” says a TNSTC bus driver.\n\nOn the Nanjikkottai Road, the dust kicked up by the swaying heavy vehicles has left a thick film of red and brown on the façade of the buildings.\n\nIn spite of fewer encroachments, wider road width and better planning of the entire stretch, official apathy is the derailing quotient here. Not just due to rains, even on normal days, the road has remained bad and neglected,” sales professional S. Gopalakrishnan says.\n\nThe residents inhabiting the maze of lanes leading through the Mission Street, Maharnonbuchavadi, and Tolkappiar Square area are all tolerating bad roads as they step out of their houses.", 
    "section": "national", 
    "title": "It’s a nightmare for tourists in Thanjavur region", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}