{
    "author": [], 
    "text": "RELIGION\n\nRamakrishna Math: Discourse on ‘Mahabharatham’ by A. Ganesan, 5.45 p.m., Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nPaneeru Thirumurai Mandram: Tirupugazh Sindanai Vattam by N.S. Sundararaman, Sri Dhandayuthapani Swami Temple, Iravathanallur, 5 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSri Madanagopalaswami Temple: Discourse on Sri Valmiki Ramayanam by Sri U.Ve. Ananthapadmanabachariar Swami, West Masi Street, 6.30 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85{+t}{+h}year Sreemath Gita siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal 6{+t}{+h}Street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs 6 a.m., Paavai songs and devotional songs, Adi Street 6 p.m.\n\nGita Natanagopala Nayaki Mandir: 173{+r}{+d}jayanthi celebrations, No. 3 Mariamman Teppakulam West Street, 6 p.m.\n\nThiruvalluvar Mandram: Discourse by R. Umarani on ‘Sundarar Tirupaatu,’ Sakti Velammal Nagar, S.S. Colony, 5 p.m.\n\nCULTURE\n\nRagapriya Chamber Music Club: Flute by Ajith Ranganathan, Hotel Fortune Pandiyan, 6 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nBhumi Art Centre: Free winter camp for yoga, Bharati Ula Road, 10 a.m.\n\nGENERAL\n\nSeed Plan Society: 16{+t}{+h}annual day celebration, art exhibition and award ceremony, Additional Collector Rohini Ramdas, Assistant Commissioner of Police B. Saktivel speak, Gandhi Museum, 4 p.m.\n\nMadurai Seed: 17{+t}{+h}anniversary celebration, New Year, New Thoughts, New Actions by Prof. Evangelin Manoharan of American College, Kanavugal Arangam, Karumbalai, 6.30 p.m.\n\nVidiyal: New Year celebration, Rathinapuram, 9 a.m.\n\nMeenavar Urimai Kootamaippu: State-level consultation on ‘Problems of Tamil Nadu fisher people and ways forward,’ Tyagu, guest speaker, St. Xavier’s Community Hall, No. 69 Old Kuyavarpalayam, near St. Joseph’s School, 10 a.m.\n\nTamil Nadu Kungfu Association: Free camp for Kungfu, all age group, behind A.R. Hospital, KK Nagar, 10 a.m.\n\nJan Seva Coop Thrift Sangam: Inauguration of Madurai branch, M.A. Yasin Mohammed presides, 214 Kasim Building, East Veli Street, 10 a.m.\n\nAlcoholics Anonymous: Meeting, Quality Care Hospital, Ellis Nagar 7 p.m., Kalsian Home, Koodal Nagar, 7 p.m.\n\nSPORTS\n\nSaksham: Third State-level chess competition for visually challenged persons, second day, Swami Vivekananda Vidya Mandir School, 10 a.m., prize distribution, 4 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}