{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Self-sufficient: The battery operated vehicle being used by the GV Residency residents. – Photo: M. Periasamy\n\nThe residents from G.V. Residency do no want to send any waste to the city’s dump yard. Nor do they want Coimbatore Corporation lorries to collect waste, says P.R. Pramod, a resident.\n\n“The objective is to manage the waste internally,” he says. There is new waste collection initiative in the area that comes under Ward 57. To make it workable, the residents with support from the Residents Awareness Association of Coimbatore (RAAC) have bought a battery-operated vehicle for Rs. 1.15 lakh to collect waste door-to-door.\n\nThe residents’ association will collect waste only if it segregated, says R. Raveendran, honorary secretary, RAAC.\n\nTo help the residents segregate waste, the association is distributing red and green bins and a bag.\n\nPeople will dump bio-hazardous waste in the red bin, the wet, kitchen waste in the green bin and dry, recyclable waste in the bag.\n\nThey will also handover the waste in segregated fashion to the person collecting it.\n\nMr. Raveendran says that the vehicle makes garbage collection from the 250 houses in the area easier. Initially push carts were used to go door-to-door.\n\nThis was painstaking and time consuming.\n\nThe residents will compost the wet waste in a vacant plot, to be sold as manure.\n\nThey will sell the dry, recyclable waste to waste handlers for proper disposal.\n\nThe residents with help from ‘Marumai’, (a waste management initiative) have also opened kiosks to collect dry, recyclable waste.\n\nSuresh Bhandari, a consultant to Marumai, says that from 7 a.m. to 11 a.m. on all days, residents of GV Residency or even those in its neighbourhood can go there to hand over dry, recyclable waste.\n\nBased on the success of kiosk model, RAAC and Marumai will soon set up more kiosks across the city, he adds.", 
    "section": "national", 
    "title": "Managing waste on their own", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}