{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The unique ‘mid night book exhibition’ at the Palam the Book Meet book stall formed part of the New Year celebrations in the city on Thursday night.\n\nPeople from different walks of life and members of the Tamil Nadu Progressive Writers and Artistes Association along with other book lovers participated in the ‘Readers meet’ held in connection with the exhibition in the midnight.\n\nTheme\n\nThe book exhibition is to motivate people, particularly the younger generation, to commence the New Year on a promising note with books. The book fair is organised on the theme “Puthagangaludan Puthandu” (let us celebrate the New Year with books).\n\nP. Sahasranamam, proprietor of the Palam the Book Meet, said that Palam Readers meeting held at the book stall every Sunday always evoked good response. Similarly, the midnight ‘Readers meet’ too was well attended by people.\n\nPeople shared their reading experience on the occasion. Some of them reviewed the short stories they read in the recent past.\n\nA few others spoke on the books they proposed to read in 2016.\n\nThe highlight of the show was the display of the books brought out by The Hindu publications such as “ The Hindu speaks on Music”, “ The Hindu speaks on Scientific Facts”, “Survey of Indian Industry”, “Survey of Environment”, “Survey of Agriculture” and in Tamil such as “Veedilla Puthagangal”, “Arivom Aangilam” and “Velayai Kaadhali”.\n\nMr. Sahasranamam said some teachers had brought their students to the book fair braving the chill weather. Some people purchased books and presented the same to their friends as New Year gift at the showroom itself.\n\nThe book stall offered a discount of 15 per cent for all the purchases made at the fair.", 
    "section": "national", 
    "title": "Midnight books exhibition draws crowd", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}