{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Potential Linked Credit Plan for 2016-17 drawn up by the National Bank for Agriculture and Rural Development (NABARD) has projected the credit flow potential for Tiruchi district at Rs. 6,698 crore, an 18 per cent increase over the current financial year.\n\nThe Potential Linked Credit Plan (PLCP) forms the basis for the annual credit plan for the district. Of the plan outlay, the lion’s share of 57 per cent is earmarked for agriculture sector, followed by MSME sector with an outlay of 16 per cent, housing at 10 per cent, education at 5 per cent and the rest for other sectors such as export credit, social infrastructure, and renewable energy.\n\nDistrict Collector K.S. Palanisamy released the document at the bankers’ meet held here on Thursday. Mr. Palanisamy stressed the need for stepping up credit flow for capital formation both in agriculture and MSME sector.\n\nHe exhorted the banks to increase lending to self-help groups and joint liability groups as group financing mode will enable “inclusive growth” aimed by the government. He requested bankers to support activities in animal husbandry sector, which would help bring supplementary income for farmers.\n\nS. Suresh Kumar, Assistant General Manager, NABARD, said the PLCP takes into account the revised guidelines issued by RBI with regard to priority sector lending. Emphasising the importance of term credit to agriculture, an area-based scheme to support sheep or goat rearing and native chicken in potential blocks has been made part of the document.\n\nK. Jeevanandam, Deputy General Manager, Indian Overseas Bank, the lead bank, said banks had been advised to increase lending to the micro-enterprises in line with RBI’s guidelines.\n\nS. Prabhakaran, Lead District Manager, advised bankers to go by the PLCP while preparing their bank or branch credit plans.\n\nS. Thyagarajan, Assistant General Manager, Reserve Bank of India, requested banks to increase agri term lending, which will lead to capital formation in agriculture. The first copy of the document was received by K. Jeevanandam, Deputy General Manager, Indian Overseas Bank.\n\nA lion’s share of 57 per cent is earmarked for agriculture sector, followed by 16 per cent for MSMEs", 
    "section": "national", 
    "title": "NABARD pegs potential credit plan outlay at Rs. 6,698 cr.", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}