{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Despite 2,500 traffic policemen staying at their post and 262 vehicle check-points created across Chennai, many accidents were recorded in the early hours of Friday. Revelry in Saidapet led to a murder. In a hit-and-run case, three nurses working at a private college-hospital near Sriperumbudur, were killed\n\nhe floods had cast a shadow over the year-end festivities and there were indications that the New Year would be ushered in quietly. However, the dying hours of the old year, and the first few hours of the new, were anything but quiet.\n\nTo the surprise of many and the chagrin of traffic policemen, the midnight revelry was intense with vehicles roaring down city roads at breakneck speed.\n\nOn Friday morning, five persons were killed and over 100 injured in road accidents reported from various parts of the city.\n\nOver 2,500 traffic policemen and many law and order policemen, who have been working since Wednesday morning for the All India Dravida Munnetra Kazhagam (AIADMK) general council meeting on Thursday, had to continue to be on the roads till Friday morning to ensure that the New Year celebrations were safe. There were 262 vehicle check-points in the city and 300 in the suburbs.\n\n“Despite such a vigil, there were deaths. Last year, around six persons died in road accidents on New Year eve,” said a traffic police officer.\n\nOn Friday morning, an accident took place on Wallajah Road in which Ruben (20), an engineering student and a resident of Old Washermenpet, was killed while he was on his way to celebrate the New Year with his friends. His motorcycle skidded on Wallajah Road and he was rushed to the Government Royapettah Hospital where he was declared brought dead. The Anna Square police have registered a case.\n\nIn another incident, Kaliappan (22), a resident of Madhavaram, fell and sustained injuries when the motorcycle he was riding, with his friend riding pillion, hit a median at Puzhal. Kaliappan was rushed to the Stanley Hospital, where he died. The police have registered a case and are investigating.\n\nAravindan (23), a resident of Pulianthope, was heading towards Kelambakkam to celebrate New Year when he met with a freak accident.\n\n“He stopped his vehicle by the side of the road to answer nature’s call, when he was hit by another motorcycle,” said a police officer. The Kelambakkam police have registered a case.\n\nIn another incident, Sunderaraj (19) fell from the motorcycle on which he was riding pillion and succumbed to injuries when the two-wheeler hit a median in Nandambakkam. Ratnakumar died in Madhavaram when he fell and sustained injuries after his vehicle skidded on the road.\n\n150 accidents\n\nMeanwhile, over 150 accidents, many of them of a minor nature, took place in the city and over 110 motorists were injured.\n\nMost of them were treated as outpatients in different government hospitals.\n\n“None of the accidents occurred on the main roads where the revelry took place,” said a police offcer. There are over 30 lakh two-wheelers in the city.\n\n“Over one lakh would have been on the road on New Year’s Eve. It is difficult to monitor each of the motorists riding these motorcycles. We detained over 1,000 youngsters for driving rashly and then let them off with a warning,” added an officer.\n\nResidents from across the city complain of motorists making a racket through the night", 
    "section": "national", 
    "title": "New Year celebrations marred by nine deaths", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}