{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "Veterinary care professionals also experiencing difficulties in reaching offices\n\nMarooned:Rainwater stagnating on the premises of the Veterinary Hospital in Tuticorin on Friday.— Photo: N. Rajesh\n\nNow, it is the turn of pet owners to experience the impact of water logging on Tuticorin Veterinary Hospital premises following recent rains. Though the rains have stopped, problems caused by stagnant water remain. Owners of pets find it difficult to avail themselves of the hospital’s services as the animal treatment shed has been engulfed by rain water.\n\n“Water stagnation is there for over 20 days,” K. Muthuraj, a pet owner, who frequents the hospital, said here on Friday.\n\nThe stagnant water also emanated foul stench and mosquitoes had started to breed on the pool Not only pet animals, but also their owners stood a chance of becoming vulnerable to diseases, G. Selvaraj, another pet owner, said.\n\nAlready, several pet owners had been demanding round-the-clock veterinary service from this hospital, which remains functional for four hours in the morning from eight o’ clock and two hours in the evening from three o’ clock. Because of water stagnation, pets are not taken to the hospital now for treatment. Even bleaching powder had not been sprayed on stagnant water to prevent outbreak of mosquito-borne diseases, he said. “It is a pity that neither hospital authorities nor corporation officials had bothered to drain the foul smelling water,” he said.\n\nHospital sources said that veterinary care professionals had also been experiencing difficulties in reaching their offices.\n\nAfter repeated pleas , only a small pump was used to dewater the premises on Friday. Corporation Commissioner R. Poongodi Arumaikan told The Hindu that the PWD should ensure draining of stagnant water from any government building.\n\nHowever, stagnant water on the premises of Tuticorin Government Medical College Hospital and District Court were drained by the corporation in response to strong demands. Corporation sources said that except in Adiparasakthi Nagar in north zone stagnant rain water had been drained in all other areas.", 
    "section": "national", 
    "title": "Now, pet owners feel the heat of water stagnation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}