{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Final rolls on January 11, says Chief Electoral Officer\n\nThe Union Territory of Puducherry is entering into the year which will witness Assembly elections in months. The Chief Electoral Officer V. Candavelou said the official machinery has been fully prepared to conduct the polls in due time.\n\nIn an interview with The Hindu , Dr. Candavelou said, “As first step, we completed special summary revision campaign after releasing the draft electoral rolls in September. At the conclusion of special campaign, now we are going to release the final electoral rolls on January 11.”\n\nThe five-year term of present Legislative Assembly of Puducherry is due to expire on June 2, 2016.\n\nBy virtue of its powers, duties and functions under Article 324 read with Article 172 (1) of the Constitution of India and Section 15 of Representation of the People Act, 1951, the Election Commission of India (ECI) is required to hold elections to constitute the new Legislative Assembly in the Union Territory before expiry of its present term.\n\nNo precedent of postponing\n\nThe officials said there was no precedent of postponing the elections in view of unprecedented rains and floods that came in between.\n\nDr. Candavelou said, “The official machinery is fully prepared and geared up to conduct polls in due time. Taking all factors into consideration, the Election Commission will announce the schedule.”\n\nThe Chief Electoral Officer said the Deputy Election Commissioner Sandeep Saxena is likely to come down to Puducherry on January 2 to conduct a preliminary meeting with officials for assessing poll-preparedness.\n\nCircular\n\nMeanwhile, following instructions from the ECI, the Chief Electoral Officer also sent circular to Home Department and other departments stating that no officer connected directly with elections should be allowed to continue in the present district of posting if she or he is posted in home district.\n\nThe circular also stated that an officer, who has completed three years in that district during last four years or completing 3 years on or before June 30, should be transferred.\n\nThese instructions cover not only officers appointed for specific election duties like District Election Officers, Deputy District Election Officers, Returning Officers and Assistant Returning Officers but also other district officers like Additional District Magistrates, Deputy Collectors, Sub-Divisional Magistrates, Tahsildars, Block Development Officers or any other officer proposed to be deployed for election work.\n\nPolice Department\n\nAs far as officers in the Police Department are concerned, these instructions shall be applicable to the Range IGs, DIGs, Commandants of State Armed Police, SSPs, SPs, Additional SPs, Sub-Divisional Head of Police, Inspectors or equivalent ranks who are responsible for deployment of police force in the district at election time.\n\nPolice officers of the level of Sub-Inspectors should not be posted in their home Assembly Constituencies.\n\nThe police officers of level of Sub-Inspectors should be transferred not only out of their police sub-divisions but also out of the Assembly Constituency if they have completed three years during last four years.\n\nThe official machinery is fully prepared and geared up to conduct polls in due time.\n\nTaking all\n\nfactors into consideration, the EC will announce the schedule.\n\nV. Candavelou\n\nChief Electoral Officer", 
    "section": "national", 
    "title": "Officials gearing up to conduct election this year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}