{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "The exercise has been extended to autorickshaw drivers\n\nA database of the fingerprints, photographs, licence and address proof of over 900 taxi drivers has been created, and the exercise has been extended to autorickshaw drivers, Superintendent of Police M.R. Sibi Chakravarthy said on Thursday.\n\nFor crime prevention, it has been made mandatory for auto drivers to display the phone numbers of the Regional Transport Officer and the Police help desk prominently behind their seats for the convenience of passengers intending to convey grievance.\n\nIn crime prevention, the performance of the Department has improved this year, Mr. Sibi Chakravarthy told media persons.\n\nOf the 337 registered crime cases, 318 have been detected. The worth of stolen materials in 226 cases was Rs. 1.59 crore of which recoveries to the extent of Rs. 1.35 crore in 215 cases have been made. The recovery rate was 94 per cent and the percentage of recovery 85. Last year, there were 457 registered crime cases of which 432 were detected.\n\nThirty-seven surveillance cameras installed throughout the city have been linked to the Control Room. Cameras have been fixed in 526 bank branches and 89 business establishments. Flex boards have been installed at vantage points to educate the public about the activities of fraudsters along with their photographs.\n\nActivities of 928 criminals whose antecedents have been documented were under watch.\n\nThe fingerprints of 7,131 suspicious-looking persons have been recorded as a precautionary measure, the SP said, attributing the low crime rate to visible policing. Vehicles were being checked at 19 points.\n\nThere have been 2,317 accidents this year and 568 fatal ones that claimed 599 lives, and caused injuries to 2,664 persons.\n\nFor reduction of accidents, the police department was constantly monitoring road rule compliance through surveillance cameras, and had conducted 20 awareness programmes. About 170 barricades have been erected at 30 locations, and movement of heavy vehicles was restricted during morning and evening hours.\n\nAs many as 13,803 drunken driving cases were registered during the year, the SP said.\n\nThe database will have fingerprints, photographs, licence and address proof of over 900 taxi drivers", 
    "section": "national", 
    "title": "Police create database of taxi drivers for crime prevention", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}