{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "The Smart City proposal submitted by the Coimbatore Corporation to the Central Government is estimated at Rs. 1,500 crore, a sum arrived at by the civic body along with the Smart City project consultant, ICRA.\n\nAround 70 to 80 per cent of the project cost will go to towards area-development project – the integrated development of eight tanks.\n\nThe tanks will be restored to their full capacity, linking channels will be strengthened andlake-front habitats will be developed with recreational facilities. The Corporation will also create a 30-km non-motorised corridor with green pathways, bicycle sharing vantage points and improved connectivity with other parts of the city.\n\nThe proposal also includes rehabilitation of the households that have encroached upon the tanks.\n\nThe sources say the Corporation decided on tank-rejuvenation because even though the area covered is only six per cent of the city, the impact will be felt by the entire city.\n\nThe model can also be replicated and immediately implemented because a detailed project report is ready and waiting.\n\nCity planners and experts were consulted before the corporation zeroed in on this developmental proposal.\n\nThe corporation also took into account the suggestions for a smart city given by the citizens.\n\nEnergy efficient street lights and traffic monitoring were recurring themes.\n\nThe corporation looked at other cities and found that Mumbai and Surat were implementing similar proposals – combining street lighting with surveillance cameras that were connected to the grid for traffic management.\n\nThis gave the civic body the impetus to do the same, said sources from the Corporation.\n\nD. Nandakumar, president of Indian Chamber of Commerce and Industry, Coimbatore.\n\nEncroachments should be removed. The corporation should take up sewage treatment immediately. Untreated sewage is now being let into the water bodies. Rejuvenating of water bodies should be taken up as public/private partnership projects so that maintenance is not affected.\n\nA. Nandhakumar, Councillor, Coimbatore Corporation\n\nThe Coimbatore Corporation should have taken up scheme road development to decrease congestion on city’s roads. The LED project could have been taken up with State Government funds.\n\nV. Eswaran, State youth wing secretary, MDMK\n\nBy proposing the tanks’ rejuvenation project, the corporation is trying to re-sell its old proposal to the Union Government under the Smart City project. This project should have been implemented with the JNNURM funds.\n\nP.R.Natarajan, former MP\n\nPriority should have been given to a mass rapid transport project like the metro as traffic congestion is the biggest problem the city faces.\n\nSarfaraz S. Yaseen, urban planner\n\nConsidering what Chennai went through during the recent rain, it will be a good idea to develop the tanks that provide a natural barrier against floods. The proposal will help people connect better with water bodies. Surveillance cameras is not that great a proposal as watching people over their shoulders is a sensitive issue.\n\nR. Raveendran, honorary secretary, RAAC\n\nThe civic body has to keep in mind the livelihood of those people who have encroached on canals and tanks. They should be provided alternative housing facility.", 
    "section": "national", 
    "title": "Proposal at Rs. 1,500 crore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}