{
    "author": [
        "S Senthalir"
    ], 
    "text": "Contestants taking part in the 12th Senior National Jump Rope Championship 2015-2016 in Puducherry on Friday.— Photo: S.S. Kumar\n\nThe rope jumping was played out in a sports event at Petit Seminaire Primary School in Puducherry for three days. This time, the young students did not skip for fun but to compete for championship with their counterparts from 28 States.\n\nIt was the 12{+t}{+h}Senior National Jump Rope Championship – 2015-16. Interestingly the youngsters displayed their agility and talent jumping the rope in different ways.\n\nThe Championship was organised by Jump Rope Federation of India in association with the South Asian Jump Rope Federation and Asian Rope Federation. The Jump Rope Federation of India was started in 2008.\n\nThe events for the National Jump Rope Championship included freestyle, Chinese-jump rope, Speed Relay, Double Dutch Pair Relay, Double Dutch Pair Freestyle and Wheeling Freestyle.\n\nThe winner will be selected based on the speed and the number of times he/she jumps the rope within 30 seconds.\n\nIf they trip or slow down their chances of winning the game is low.\n\nRejuman Settu, a coach in the Puducherry Amateur Jump Rope Association, said: “There is also double jump. In one of the rope, the players have to jump twice. The winner will be the one who jumps more number of times when compared to others in 30 seconds.”\n\nHe added that in the team event of Double Dutch games, four to five members participate. In this case, two long ropes are turned in opposite directions and two or three players jump simultaneously. Usually, the participants jumping the rope also perform acrobatics.\n\nA peak into the history of this Double Dutch game gives out fascinating details. The National Double Dutch League in its website states that the root of Double Dutch game could be traced to the ancient Phoenician, Egyptian and Chinese ropemakers.\n\nDavid A. Walker, who is said to be the founder of the sport, has written that the rope spinners had developed a leisure time activity of strand-over-strand turning movement into a game. It was the Dutch settlers who brought that game to New York City.\n\nWhen the British arrived, they had termed it Double Dutch Game.\n\nThis game evolved over the period and played at various championship events.\n\nThe students from different schools in Puducherry, who are part of the Puducherry Amateur Jump Rope Association, participated in the event.\n\nThe Puducherry Association began in 2010.\n\nMr. Rejuman Settu said that four students from their association had won the National-level Jump Rope Championship in 2013-14, held at Hospet, Bellary district in Karnataka.\n\nThe winners included R. Riyaz Dheen of Petit Seminaire School, V.K. Manojj of Achariya School, Thengaithettu, Reshivel Rakesh of Sri Annai Rani Convent Higher Secondary School and Sri Ubthiya of Study School. They had won the gold medal for Double Dutch Pairs Freestyle event.\n\n“This team is participating in the 2015-16 championship as well. They have earlier participated in the National-level championships held in Haryana, Andhra Pradesh, Goa and Gujarat in the past five years,” said Rejuman Settu, who has been coaching the students from different schools for the past three years.\n\nThe team from Puducherry is expected to win in at least two events this season.", 
    "section": "national", 
    "title": "Puducherry competes with 28 States in rope jumping", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}