{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Praying for a good start:Christians attending the New Year special mass at a church in Palayamkottai; (below) New Year special mass being conducted at Our Lady of Snows Basilica in Tuticorin on Thursday night.— Photo: N. Rajesh\n\nElaborate security arrangements in place; patrol teams keep vigil\n\nSpecial prayers were conducted in temples and churches across the district in view of New Year celebrations on Thursday midnight.\n\nAfter the traditional thanksgiving prayers conducted between 11.30 p.m. and midnight, New Year Holy Masses were conducted in all churches, aesthetically decorated with colourful lights, stars and balloons.\n\nWhile Bishop of Palayamkottai RC Diocese Most Rev. A. Jude Paulraj led the Holy Mass conducted at St. Antony’s Shrine, former Vicar General of Palayamkottai RC Diocese Rev. Fr. Antonysamy led the Holy Mass organised at St. Xavier’s Cathedral in Palayamkottai.\n\nBishop of Tirunelveli CSI Diocese Rt. Rev. J.J. Christdoss led the New Year special prayers organised at Holy Trinity Cathedral.\n\nSwamy Nellaiyappar Temple was opened at 4.30 a.m. in view of New Year for special prayers in which hundreds of devotees participated. Special prayers were conducted in all important temples in Tirunelveli, Palayamkottai, Tenkasi, Courtallam, Sankarankovil and Nanguneri.\n\nPolice had made elaborate security arrangements in view of the New Year celebrations. Apart from the patrol teams who were moving around throughout the night, good number of policemen had been deployed in front of churches and temples.\n\nThe New Century Book House, in a bid to encourage reading habit among youths, sold books at a discounted price throughout the night as part of its New Year celebrations.\n\nTuticorin\n\nNew Year was celebrated with fervor and gaiety across the district. Scores of worshippers thronged churches, temples and mosques and offered prayers. Special prayer services and midnight mass were held at churches, which were decked colourfully and illuminated.\n\nThere was a huge congregation at Our Lady of Snows Shrine Basilica on Beach Road in Tuticorin and at Subramanya Swamy Temple in Tiruchendur. Fr. Lerin De Rose, Rector and Parish Priest, Our Lady of Snows, Shrine Basilica, Tuticorin, conducted the prayer service. As the clock ticked 12 a.m., scenes of merriment were witnessed heralding 2016. Crackers were burst and people exchanged New Year greetings with one another.\n\nAfter offering prayers, alms were given to the needy. As for the revellers, the celebration started from Thursday evening.\n\nCakes and sweets were distributed to neighbours and friends on Friday morning. Security arrangements were in place at the places of worship. Tuticorin witnessed a festive atmosphere as commercial establishments were decked up with colourful lights. Tiruchendur beach was crowded. The New Year revellers had a pleasant time at the Pearl City beach. Many families were seen thronging the Roche Park on Beach Road.\n\nNagercoil\n\nNew Year celebrations in the southern tip of the land – Kanyakumari was at low ebb this time compared to previous years.\n\nThe hoteliers had decided to keep the celebrations low key due to the recent deluge in Chennai, Kanchipuram, Tiruvallore and Cuddalore districts. No special stages were set up for the midnight celebrations at hotels. However, they celebrated the occasion with limited number of tourists by cutting a cake in a simple manner.\n\nUnlike previous years, tourists flow in Kanyakumari had also come down. The district police had made elaborate arrangements. Over 1000 police personnel were posted in sensitive areas to prevent any untoward incident.\n\nSpecial midnight masses were held in all churches. Kottar Bishop Peter Remugius conducted a special mass at St Xavier’s Church at Kottar and Bishop of CSI Diocese Devakadatsham at Home Church.\n\nSpecial pujas were performed at Kanyakumari Bhagavathy Amman temple, Suchindrum Sthanumalayan temple, Nagercoil Nagaraja temple, Adi Kesava Perumal temple at Thiruvattar and Alamparai Bhagavathy Amman temple at Padmanabhapuram etc.\n\nPoompuhar Shipping Corporation operated ferry services to the Vivekanandar rock memorial and Tiruvalluvar statue as usual. An official attached to the Corporation told The Hindu that the tourist flow was quite low when compared to previous years.", 
    "section": "national", 
    "title": "Special prayers at churches, temples mark New Year fete", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}