{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Banana growers of the district have been advised to insure their crops with State Government’s premium subsidy so as to get compensation in case of crop loss due to natural calamity\n\nNational Agricultural Insurance Company, a Central Government organisation, has introduced an insurance scheme to bail out banana growers in case of natural calamities. The State Government, on its part, extends a ‘helping hand’ by offering subsidy for the premium to this insurance scheme.\n\nUnder the National Agricultural Insurance Scheme, compensation is calculated based on loss of yield. Firka-level yield assessed from ten experiments in different villages in a firka is compared with the average of last five years.\n\nIf the yield is lesser than the average, then the lesser percentage is determined as ‘compensation percentage’ to the sum insured.\n\nPremium for banana crop has been fixed as 5.50 per cent for this 2015 - 2016 rabi season and hence the State Government offers 55 per cent subsidy to small and marginal farmers and 50 per cent subsidy to other farmers.\n\nIf the farmer wants to insure his banana crop for Rs. 1 lakh, the total premium amount is Rs. 5,500.\n\nAfter deducting the State Government’s subsidy, the beneficiary farmer will have to pay Rs. 2,475 in case of small and marginal farmer and Rs. 2,750 in case of other farmers.\n\nA farmer can insure his banana crop up to a maximum of Rs. 2,68,549 for one acre.\n\n“Banana crop insurance is compulsory for farmers, who have availed crop loan from banks and cooperative credit societies and on voluntary basis for non loanee farmers in notified firkas only,” Deputy Director of Horticulture, Tirunelveli, T.C. Kannan said.\n\nIn Tirunelveli District, Tirunelveli, Madhavakurichi, Naranammalpuram, Melapattam, Sivanthipatti, Munnirpallam, Karisalkulam, Pazankottai, Kurukkalpatti, Sernthamangalam, Kadayanallur, Aykudi, Kalluurani, Surandai, Paimpozhil, Ilaththur, Tenkasi, Keezhapavoor, Alangulam, Uthumalai, Senkottai, Vasudevanallur, Venkadampatti, Alvarkuruchi, Mukkudal, Puduppatti, Pappakudi, Cheranmahaevi, Melaseval, Ambasamudram, Singampatti, Kalakkad, Ervadi, Nanguneri, Poolam, Moolaikkaraipatti, Viyanaryanam, Radhapuram, Thisaiyanvilai, Samuugarengapuram, Vallioor, Panagudi, Pazhavur and Levinjipuram firkas have been classified as ‘notified firkas’ for banana crop for the current rabi season.\n\nA non-loanee farmer in a notified firka can pay the premium in commercial banks and cooperative credit societies, in which he holds the account after filling the details in the prescribed application form.\n\nApplicaion forms and more clarifications can be obtained from Block Assistant Director of Horticulture concerned.\n\n“The banana growers should utilize the opportunity and enrol their names before January 15 so that they can get adequate compensation in case of crop loss due to natural calamities,” Mr. Kannan said.", 
    "section": "national", 
    "title": "State subsidy for banana crop insurance premium", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}