{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The textile industry should look at reviving technology and skills to recapture higher share in the global trade, Kavita Gupta, Textile Commissioner, said here recently.\n\nShe was speaking at the inauguration of joint technological conference of textile research associations. The productivity levels of the industry should be to global standards. “The future of textile industry is going to be technical textiles,” she said. In the last five years, there had been 20 per cent growth year-on-year in this segment. The sector should aim to be 40 per cent of the country’s textile industry.\n\nThe centres of excellence created for technical textiles should look at having joint annual conferences as done by the research associations. The Union Government had allocated Rs. 200 crore under the technology mission for technical textiles and there is still some fund that is not spent. The centres should come forward with proposals, she said.\n\nD. Krishnamurthy, chairman of the council of administration of South India Textile Research Association, said the association had conducted 19 training programmes in the last one year. He also elaborated on the projects taken up and completed by the four textile research associations in the country.\n\nThe South India Textile Research Association has launched a portal for textile mills. The units can log in and register. They can submit the required data online and will get a consolidated report on the quality of fibre and yarn. Initially, it will be for 40s, 60s, 80s and 100 count yarn. This effort by SITRA is to establish standards for quality of yarn.\n\nAccording to M. Senthil Kumar, chairman of Southern India Mills’ Association, the average export of cotton yarn a month in 2013-2014 was around 120 million kg. However, it dropped to 100 million kg a month now. In the last 18 months, almost two million new spindles have been added because of incentives announced in the textile policies of individual States (Gujarat, Maharashtra, etc). The cost of production between these new mills and the existing ones is also high. Hence, cotton yarn should be included in the schemes promoting exports.", 
    "section": "national", 
    "title": "Textile industry urged to aim for higher share in global trade", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}