{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The votes for the PWF will only weaken the ruling party as we seek to capitalise on the anti-incumbency factor, says Vaiko\n\nSeeking to dispel the feeling that the People’s Welfare Front (PWF) would merely end up dividing the opposition’s votes thereby helping the ruling AIADMK in the ensuing Assembly polls, MDMK leader Vaiko on Friday said the third front would rather be a serious contender in the fray. The MDMK is a constituent of the PWF and would take on both the DMK and the AIADMK with equal vigour in the elections.\n\n“The votes for the PWF will only weaken the ruling party as we seek to capitalise on the anti-incumbency factor. The DMK is also unlikely to make any gains because we are also projecting it as an anti-people force on a par with the AIADMK,” said Mr. Vaiko during his customary New Year interaction with journalists here.\n\nAccording to him, people’s anger against the DMK over land grabbing when it was in power between 2006 and 2011 had not subsided. “Both the DMK and the AIADMK have thrown to the winds the Dravidian principles and sacrificed the ideology for the personal benefits of its leaders. Today MDMK is the only Dravidian party that refuses to make a compromise. We as part of the PWF would bank on the credibility we enjoy among the people,” he claimed.\n\nMr. Vaiko further said there was no need for the PWF to project anyone as its Chief Minister candidate as it was not a healthy trend in democracy. “If the front wins the elections, the MLAs will meet and decide the Chief Ministerial candidate,” he said.\n\nAsked whether the PWF would be able to make a difference in the elections without the presence of actor Vijayakant’s DMDK, he said, “Let use be positive.”\n\n“Even though Mr. Vijayakant and his wife are highly critical of the DMK, the latter is seeking to persuade the DMDK to join the alliance. This has dented the self-respect of the DMK,” he alleged.\n\nTo a question on the efforts to persuade IAS officer U. Sagayam to join politics, all Mr. Vaiko would say was he was honest officer.\n\nExpressing hope that the efforts taken by Union Minister Pon. Radhakrishnan would pave way for resumption of jallikattu in the State, Mr. Vaiko reiterated the DMK was also responsible for the ban on the ancient sport since it failed to fight the notification of the UPA government excluding the bull from the category of performing animals. The PWF will hold a demonstration in Alanganallur in support of jallikattu on January 3.", 
    "section": "national", 
    "title": "Third Front will weaken AIADMK and DMK: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}