{
    "author": [], 
    "text": "RELIGION\n\nSri Andavan Ashram, Srirangam: Tirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddantha Sabha: Tirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Tirumala Tirupathi Devasthanam: Tirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai: Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Srinivasa Perumal Sannidhi, Bilahari Mutt, Amma Mandapam Road, Srirangam, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Rama Nama parayanam, 94, Bala Murugan Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nRasavelar Shenbaga Tamil Arangu: Special address by Rasa Ilangovan, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nAIMAN College of Arts and Science for Women: “Uthama Nabi Udaya Dina vizha”, T.M. Abdul Khader, former head, Department of Tamil, Islamic College, Vaniyambadi, chief guest, 2.30 p.m.\n\nTamil Kalai Ilakkiya Peravai: Seminar on Supreme Court verdict on appointment of archakas, P.Maniarasan and P.M.Sathyavel Muruganar speak, Ravi Mini Hall, 5.30 p.m.\n\nChidambaram Pillai College for Women Vista Association: Seminar on “Aspects of translation”, S. Kanakaraj, former head, Department of English, Madurai Kamaraj University, chief guest, Manachanallur, 10.30 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Seminar on “Wear resistance rubber for rubber roll in rice milling”, 5.15 p.m.\n\nTamil Nadu Handicrafts Development Corporation: Crafts bazaar – exhibition-cum-sale, Makkal Mandram, Thillai Nagar, 10 a.m.\n\nRockfort Chess Academy: District children chess tournament, Chinmaya Vidyalaya Matriculation School, Srirangam, 11 a.m.\n\nSri Jayendra Matriculation Higher Secondary School: Sports Day, A. Palanisamy, associate professor, Bharathidasan University, chief guest, 3 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-02"
}