{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector L. Subramanian inaugurating solar-powered toilets in Achampatti village in the presence of Additional Collector (DRDA) Rohini Ramdas and V. Ponraj, former scientific advisor to former President A.P.J. Abdul Kalam.— Photo: G. Moorthy\n\nHundred village panchayats will become open defecation-free (ODF) by the end of January 2016, said Madurai Collector L. Subramanian while inaugurating 140 household toilets with solar-powered lamps in Achampatti village near Alanganallur on Thursday.\n\nHe said that while 44 panchayats were declared ODF on October 2, 2015, another 12 panchayats were declared ODF on Thursday. “Work is in progress to declare another 44 panchayats as ODF during the Republic Day celebrations,” he said.\n\nSpeaking to The Hindu , B. Rohini Ramdas, Additional Collector and Project Officer of District Rural Development Agency (DRDA), Madurai, said that with the declaration of 100 panchayats as ODF, nearly one-fourth of the 420 panchayats would have become ODF.\n\n“The bigger challenge though is to ensure that people are consistently using toilets. In the 44 villages that were already declared ODF, we are rigorously monitoring the usage through Village Poverty Reduction Committee (VPRC) members,” she said. However, she said that the situation has improved drastically compared to one and a half years before. “We had difficulties in convincing people on the need for toilets. Now, that has changed a lot,” she said.\n\nShe added that at a recent State-level meeting attended by officials from the Central government, Madurai was recognised as the torch bearer due to the progress it had achieved in total sanitation.\n\nEarlier, speaking at the function, V. Ponraj, former scientific advisor to former President A.P.J. Abdul Kalam, urged the villagers to take up the sanitation project to the next level. “Now that the village has become ODF, you should try to implement the project to generate electricity from human waste so that the village becomes carbon-neutral,” he told the villagers.\n\nThe 140 toilets with solar lamps inaugurated on Thursday were constructed with government incentives and contribution from Devaki Hospital in Madurai as part of its Corporate Social Responsibility initiative.", 
    "section": "national", 
    "title": "100 panchayats in Madurai to be open defecation-free by January-end", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}