{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Vellore Corporation bans them from taking part in future auctions\n\nLessees have not paid toll collected from Nethaji market, parking fee from lots at various places across Vellore.— Photo: C. Venkatachalapathy\n\nThe Vellore Corporation has blacklisted 20 persons for defaulting on payments against lease amount. These persons and their family members have been banned from participating in lease auctions of the Corporation in the future.\n\nThe list of the 20 defaulters was placed before the Corporation council and the nod was obtained to blacklist them. There are a number of lease items such as parking fee, pay and use toilets and market in the four zones that are leased out to lessees for period of three years, officials said.\n\nThe leased out items in Vellore Corporation limits included for collection of toll in Nethaji market, two-wheeler parking fee at parking lots located at fourth cross, Gandhi Nagar, Government Law College, Gandhi Nagar, memorial pillar at Old Bus Stand, old fish market, New Bus Stand, pay and use toilets inside New Bus Stand, Gandhi Nagar in Sathuvachari and for road side shops in Malaikodi in Ariyur.\n\nAn official said the lessees had to pay the lease amount in a phased manner. These defaulters, who had taken these facilities on lease, held the licenses for the period 2012-2013, 2013-2014 and 2014-2015 but failed to pay the amount during the lease ending years.\n\n“We had sent notices to these defaulters asking for the dues, but they did not pay up. Each of these persons has to pay at least Rs. 10 lakh to Rs. 20 lakh. Hence, we created a blacklist of these defaulters and placed it before the council,” an official said.\n\nFollowing this, the Corporation will advertise the names of the defaulters in newspapers. They and their family members have been banned in taking part in public auctions called for by the local body in the future.\n\nIf they continue to fail to pay the dues, legal action will be initiated against them.", 
    "section": "national", 
    "title": "20 lessees blacklisted for non payment of dues", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}