{
    "author": [
        "S Ganesan"
    ], 
    "text": "Initiate action against those who discharge sewage into canal : Collector\n\nAbout 255 residents living along the Uyyakondan canal in the city have obtained underground drainage connections following a drive initiated by the Corporation to prevent discharge of household sewage into the canal in recent months.\n\nThis was stated at a consultative meeting, on prevention of liquid waste discharge and solid waste dumping in the Uyyakondan canal, chaired by Collector K.S.Palanisamy here on Wednesday.\n\nAbout 195 identified households were yet to get the underground sewage connections. The Collector directed the authorities to issue notices to the residents and initiate penal action including disconnection of drinking water supply to those who fail to comply with the directive.\n\nThe meeting decided to create small parks along the banks wherever space was available and involve volunteers in maintaining them. The corporation should monitor and ensure that sewage was not let out and solid wastes were not dumped into the canal. So far, about 900 tree saplings have been planted along the canal bunds, officials said.\n\nThe Collector instructed the Public Works Department to plant more saplings along the canal banks.\n\nThe meeting was a follow up on a cleaning initiative launched by the district administration in coordination with the Corporation, Public Works Department and voluntary organisations some months back. A Uyyakondan Canal Protection Committee was also formed. The district authorities had planned to clean up the canal, which has been subject to heavy urban pollution over the years, in a phased manner. The canal, which takes its flow from the Cauvery, cuts across Tiruchi city. It originates from the Cauvery near Pettavaithalai and traverses about 72 km up to Vazhavanthankottai tank.\n\nOpen drains flow into the canal between Cantonment and Ariyamangalam, apart from a number of small drains carrying sewage from hotels, commercial establishments, and houses. The cleaning drive was planned to be taken up in segments on the 6-km city stretch of the canal starting from Puthur weir. The bunds of the canals were cleaned and beautified at a couple of stretches. The PWD had also launched a drive to clean up the silt accumulation.\n\nThe operation was suspended following the release of water for irrigation in the canal.", 
    "section": "national", 
    "title": "255 obtain underground drainage connections", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}