{
    "author": [
        "S Senthalir", 
        "S Prasad"
    ], 
    "text": "A family gathers on Beach Road in Puducherry to celebrate the New Year.—Photo: S.S. Kumar\n\nEvery street in Puducherry was abuzz with tourists in festive mood on Thursday. The coastal town with its rich French legacy celebrated New Year with fervour. The oldest church in French Town of Puducherry, Eglise de Notre Dame des Anges (The Chapel of Our Lady of Angels) offered mid-night mass in English. The only Catholic Church that offers mass in Tamil, English and French had an evening benediction between 6pm to 7 p.m. on Thursday. “There will be morning mass in French at 8 a.m. on Friday. At least 200 to 300 people visit the church everyday. People of all religious faiths come to pray,” said Reverend Father Pere Cyril Sandou.\n\nImmaculate Conception Cathedral Church offered prayers for world peace and prosperity at the mid-night mass.\n\nMorning mass\n\nReverend Father Alphonse Sandanam, parish priest of the church said: “There will be morning mass at 6.30 a.m. and 8 a.m. on Friday to seek blessings for everyone on the New Year,” he said.\n\nThousands thronged the hotspots in Puducherry including the beach road and Chunnambar Resort greeting everyone.\n\nA Hyderabad-based graduate Teja Sukhavasi preferred to spend time in the coastal town on a New Year away from the cacophony of city life enticed him to this city. A French citizen Bernard felt it apt to come to Puducherry because he felt it reminded him of his home. “This is a French Town and Eglies de Notre Dame de Agnes has writings in French. Besides, it is wonderful to see Joan of Arc statute, our national symbol, which reminds me of home,” he said.\n\nPeople not only offered prayers and greeted their family and friends. They also savoured the fresh cream cakes that adorned the bakeries in Puducherry. Bon Bakes prepared 150 kg of fresh cream cakes just for New Year.\n\nPuducherry has become a destination for families to spend their New Year with children unlike Goa.\n\nLess foreign tourists\n\nThere were not only young men and women on the beach road, but children walked along with their parents and grandparents to spend their vacation.\n\nWith less of foreign tourists this year, there were only domestic tourists mainly from Chennai, Bangalore and Hyderabad to be seen.\n\nA native of Rajasthan, Namrata who came to Puducherry with her two children said she got her children along to visit Ashram and Immaculate Conception Cathedral Church.\n\nPromenade Hotel and Ajanta Hotel on the esplanade of the rocky beach were decked up with colourful lights welcoming their guests and tourists as crowd gathered at the beach road to welcome the New Year.\n\nThe Traffic Police had closed the Beach Road due to heavy traffic with the entire stretch remaining out of bounds for all vehicles from 2 p.m. on Thursday in view of the New Year celebrations.\n\nParking facility\n\nSpecial arrangements were made for residents to park their vehicles.\n\nWhile those who arrived at Bussy Street parked their vehicles in designated slots near the old port and streets near the Beach Road, vehicles from Sardar Vallabhai Patel Salai were parked at Dumas Street.\n\nMotorists and cars from Jawaharlal Nehru Street were diverted through Francois Martin Street and parked at designated parking slots.\n\nThe police had advised motorists to keep their vehicles safe by using double locks. The Traffic police conducted intensive checks to curb drunken driving, rash and negligent driving.", 
    "section": "national", 
    "title": "As New Year dawns prayers go up", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}