{
    "author": [
        "P V"
    ], 
    "text": "The boat house and park at Avadhaanapatty in Krishnagiri are set to come into operation shortly. —Photo: N. Bashkaran\n\nFor the lovers of water jaunt, it could well be a perfect start to a New Year. The Avadhaanapatty Lake that was long restricted for boating, will soon host boating after a long hiatus.\n\nThe boat house is being given a fresh leash of life with 13 new boats being landed from Karnataka Boat Company. As of Wednesday night, three boats have landed, and the remaining will be brought in by the end of this month.\n\nThe boats purchased at a total cost of Rs. 10 lakh, will include two motorised boats, and 11 non-motorised boats of varying capacity of two, four and six seaters. The motorised boats will be equipped to carry 15 passengers each.\n\nIn addition, the Avadhaanapatty children’s park adjoining the lake along with the boat house facility is being renovated and restored at a cumulative cost of Rs. 50 lakhs. Krishnagiri Panchayat Union has contributed Rs.20 lakh from its general fund, and the DRDA is pitching in Rs. 30 lakh from its own funds.\n\nThe park renovation includes a 4,000 metre-paved pathway for walkers; two waiting sheds; and two toilets.\n\nThe entire renovation would be concluded within a fortnight, just in time for the arrival of the remaining boats.\n\nSpeaking to The Hindu , Collector T.P. Rajesh said the boat house and the park restoration will provide much needed recreation opportunity for the people. “Except for Maangani festival, there was no space for recreation. The Avadhaanapatty Lake and park will change that soon,” hopes Mr. Rajesh.\n\nA diver each will accompany every boat and no tourists will be allowed to board without life jackets.\n\nAdding to the already rich thicket of trees in the adjoining park, 250 additional saplings are proposed to be planted in the park.\n\n“We also plan to put in some CCTV cameras in the park. The depth of the water will be marked accordingly. The divers will also be trained in rescue before the boat house is inaugurated,” says the Collector. Police and fire service personnel will monitor during holidays, when the tourist traffic is expected to be high.\n\nThe park and lake management have been leased out to a private party. As of date, 30 life jackets have arrived, and more jackets are scheduled to arrive. The boat house and the park will come into operation by the end of this month, much to the delight of the locals.\n\nThe boat house was shut for visitors after a child drowned in the swimming pool of the stadium. It has since been a picture of neglect and dilapidation, despite the beauteous park that continued to beckon lovelorn couples.\n\nToday, just as safety of all tourist water spots are increasingly under scanner following the coracle tragedy in Hogenakkal late August, the district administration is bent on ensuring that safety precautions are put in place.", 
    "section": "national", 
    "title": "Boat house, children’s park get facelift", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}