{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Countering allegations of Opposition parties that she should be held responsible for the “delayed and sudden” water release from the Chembarambakkam reservoir, Chief Minister and AIADMK general secretary Jayalalithaa asked her partymen to give proper and fitting replies to the “DMK’s bag of lies.”\n\nIn her address at the party general council meeting on Thursday, Ms. Jayalalithaa said the practice was that the government issues order for water release for irrigation purposes after obtaining the Chief Minister’s consent. Similarly, the practice at the time of floods was that the Public Works Department official concerned takes a decision on water release from reservoirs after considering the safety of the tank or reservoir. “This was the practice followed during the previous DMK government also,” she said. Despite the explanation given by the Chief Secretary on the Chembarambakkam issue and knowing well that the Chief Minister orders only the release of water for irrigation purposes, the DMK leaders were spreading false and misleading information among the public.\n\n‘Go and study\n\nVIII std. mathematics’\n\nMs. Jayalalithaa said that she had mentioned in her statement on December 1, 2015, that water was being released from 45 reservoirs controlled by PWD including Chembarambakkam.\n\nThe Chief Secretary had further explained in detail the quantum of water released on December 1 and how flood alert was issued along the banks.\n\nHe had further explained that even if the storage was maintained at 75 per cent, the release could have been delayed only by two hours and how surplus water from numerous lakes along the river contributed to flooding.\n\n“If the Opposition parties can’t understand this, then they can go and study ‘time and work’ unit in Standard VIII mathematics,” she said.\n\nLikewise, the DMK leader and his son were claiming that industries were moving to Karnataka which was experiencing power-cuts for hours and was facing a drought-like situation.\n\nBid to hoodwink people\n\nAs the Assembly elections were approaching, the DMK was repeatedly lying to hoodwink people, she said, asking the Ministers to give fitting replies so that the partymen could take it to the people.", 
    "section": "national", 
    "title": "CM orders water release only for irrigation: Jayalalithaa", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}