{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Special services and prayers were offered at places of worship from the late hours of Thursday to the early hours of Friday as the city stepped into the New Year.\n\nTo sympathise with the flood victims in Chennai, the regular New Year bash was not witnessed in the city. Some star hotels, clubs and a few gated communities organised celebrations Resorts and cottages close to forests organised a simple eco friendly celebration.\n\nThousands of youth hit the road on two-wheelers and cars to greet people on Avinashi Road. Lighting of a series of fireworks began as the clock struck 12 and went on for some time. The Hope College, Fun Mall, Peelamedu, Lakshmi Mills, Anna Statue and Uppilipalayam Junction on Avinashi Road were flooded with vehicles and made the road busy as it used to be in the day.\n\nFrom standing on bikes to clinging outside the windows of cars to speeding and rash and negligent riding, there was large scale violation of road rules.\n\nPolice officials claimed that over 1,200 personnel were deployed to regulate the crowd and for bandobust at places of worship. To avoid accidents, the police erected barricades at vulnerable pockets on Avinashi Road, Race Course and D.B. Road. Special vehicle checking was organised at many places in the city.\n\nTwo hundred and eighty five persons attached to Hindu Munnai, Bharath Sena and Rashtriya Hindu Parishad were detained by the police when they tried to picket hotels at Gandhipuram, Hope College, and R.S. Puram against the New Year celebrations. These were among the half a dozen outfits that were denied permission by the police to stage protests against the celebrations.\n\nThroughout the night, there was unusual rush in fuel stations on Avinashi Road. Staff at a station near Anna Statue said that it was an annual phenomenon. Labourers from North India working at construction sites too had fun playing songs in Hindi and Tamil and dancing till it was well past midnight.", 
    "section": "national", 
    "title": "Coimbatore steps into 2016", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}