{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Communalism and neo-liberalism, two major dangers that haunted the country in 2015, should be curbed and snubbed in the New Year. It was the duty of every one, especially the youth, to eradicate honour killing, another social disease, said Communist Party India (Marxist) leader N. Sankaraiah.\n\nDelivering a special address at the DYFI State-level conference held here on Thursday, he said that the Bharatiya Janata Party was moving closer to the United States, which was a dangerous trend, and against the foreign policy of the country. Non-alignment was India’s policy. The US tried to dominate Asia-Pacific region with the help of India and Japan. India should not yield to the designs of the US. Short-sighted policies of the Central government, led by the BJP, would destroy the integrity and sovereignty of the country, he added.\n\nThe BJP and Rashtriya Swayamsevak Sangh took the issue of constructing Ram temple at Ayodhya for their political gain in the Uttar Pradesh Assembly elections, he noted.\n\nMr. Sankaraiah also appealed to the youth to get public opinion and support to have common crematoriums or burial grounds at villages.\n\nIn his special address, veteran CPI leader R. Nallakannu said that the State had faced untold misery in 2015. Such disasters and misery should not continue in 2016. People who became rulers using Dravdian policies had showed the way to destroy natural resources and paved the way for corruption. Others who followed them made the situation from bad to worse. While flood haunted Chennai and nearby districts, drought and water shortage threatened Thanjavur district. People must strive to bring about change in the new year, he added.\n\nEarlier, DYFI cadres took out a rally from Rock Fort to RM Colony, the venue of the conference.", 
    "section": "national", 
    "title": "“Communalism, neo-liberalism haunted India in 2015”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}