{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Proactive policing clips criminals’ wings, prevents heinous crimes\n\nWhile crimes and movement of criminals in the district have been curbed in 2015, thanks to proactive policing, Rs. 2.44 crore-worth properties have been recovered by the police.\n\nSpeaking to reporters here on Thursday, Superintendent of Police Ashwin M. Kotnis said that proactive policing, which had been ensured at all levels of police department, had resulted in preventing many heinous crimes, including murders, burglaries and robberies.\n\nAfter witnessing 83 murders in 2013 and 86 in 2014, the district had only 75 murder cases reported during 2015. No major heist or theft had occurred in the period.\n\n“At the same time, the district witnessed five major property offences each in 2013 and 2014, and robberies have come down to 58 this year from 65 in 2014 and 82 in 2013,” Mr. Kotnis said.\n\nStringent enforcement of traffic rules has resulted in filing of 1,48,999 cases, including 77,048 ‘helmet cases’, in 2015, and a total fine of Rs. 2.84 crore had been collected and paid in the treasury.\n\nThe SP said that 69 antisocial elements had been detained under the Goondas Act in 2015, while the number stood at 38 in 2014 and 17 in 2013.\n\nThe police had detected 402 cases – 71 murder cases, four murder for gain cases, 33 robbery cases and 294 theft cases – during 2015, and recovered Rs. 2.44 crore-worth properties.\n\n“Vulnerable areas have been brought under constant surveillance with the use of cameras. We’ve fitted 1,103 surveillance cameras in Tuticorin, Kovilpatti and Tiruchendur bus stands, commercial complexes, private financial institutions, banks, etc. Besides fitting cameras on buses being operated via communally sensitive hamlets ‘bus marshals’ have been deployed on these buses. Round-the-clock policing by 29 two-wheeler-laden personnel has been introduced in the district since April 7 last,” Mr. Kotnis noted.\n\nThe SP elaborated on the security arrangements made by the police during important festivals in the district and assured that proactive policing would continue in the days to come in a more intense fashion to curb crimes in all forms.\n\nADSP P. Maduraisamy, DSPs G. Govindaraj, N. Dharmalingam and Rajamani were present.", 
    "section": "national", 
    "title": "Crime rate comes down drastically in Tuticorin", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}