{
    "author": [
        "B Kolappan"
    ], 
    "text": "Bharati's wife Chellamma (sitting third from left) and Thiruloga Seetharam (standing second from right).\n\nFormer Chief Minister C.N. Annadurai, once described Thiruloga Seetharam as a poet, editor and Bharati scholar and another Athisaya Manithar of Akkirakaram (wonder man of Agraharam) . The DMK founder had earlier given the title to freedom fighter and writer Va. Ramasamy.\n\nNow, a documentary on Seetharam explains how he used music as a form to propagate the songs of Subramania Bharati.\n\nThe documentary, Thiruloga Seetharam Enkira Aalumai , by writer Ravi Subramaniam offers glimpses into a life of a school dropout who later inspired a generation of writers. Seetharam would mono act the entire Panchali Sabatham.\n\nEven though Va. Ramasamy, communist leader P. Jeevanandam, Thiruloga Seetharam and Jayakanthan popularised the songs of Bharati, Seetharam declared himself the adopted son of Bharati’s widow Chellamma.\n\n“When he learnt Chellamma was not well, he immediately left his family to take care of her. He served her for three months. Lying on his lap, she breathed her last,” said T.N. Ramachandaran, a disciple of Seetharam and an expert on Sekkizhar, the author of Periyapuranam.\n\nSeetharam was forced to work as a purohit to earn a livelihood after the death of his father.\n\nHe learnt Tamil and poetry from Andhakakavi Ramasamy Padayachi, a visually challenged scholar in Thondamanthurai in Tiruchi.\n\nHe had to read out literary works to his teacher and in the process learnt by heart thousands of poems.\n\nAs the editor of the literary magazine Sivaji, he encouraged young writers and Sujatha’s first short story appeared in the magazine.\n\nLate Tamil writer T. Janakiraman once said three writers — Ku.Pa. Rajagopalan, Na. Pitchamurthy and Seetharam — whose mother tongue was Telugu made immense contribution to the development of modern Tamil literature. He also translated into Tamil, Nobel laureate Hermann Hesse’s Siddartha.\n\nThough a nationalist, he maintained a close relationship with Bharathidasan and even mobilised funds to provide financial assistance.\n\nHe would render Bharathidasan’s Kudumba Vilakku set to music.\n\n“I am yet to come across a person who could excel in poetry reading,” said writer Ashokamitran, who had attended Seetharam’s poetry reading sessions.\n\nHe always faced a financial crisis.\n\nOnce when Bharati’s daughter Thangamma Bharati asked him whether the situation had improved, Seetharam said, “Of course. Once I struggled for five rupees and ten rupees and now I am struggling for fifty and hundred,’” he quipped.\n\nIt offers glimpses of a school dropout who inspired a generation of writers", 
    "section": "national", 
    "title": "Documenting writer who propagated Bharati’s works", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}