{
    "author": [
        "M K"
    ], 
    "text": "A herd of nine elephants, including two calves, created a flutter by blocking traffic on the Palakkad Road for more than half an hour on Wednesday.\n\nThe herd also damaged the tiled roof of a house near Sugunapuram in the city before they were chased into the forest around 5 a.m. on Thursday.\n\nAround 9 p.m. on Wednesday a lone elephant that was roaming in that locality, disturbing residents and vehicle users for about six months, was noticed close to the bypass road.\n\nAround 11.30 p.m. a herd of elephants strayed to the highway through a passage at Mayilkal near the house of Municipal Administration Minister S.P. Velumani.\n\nThey damaged the tiled roof of a house at Sugunapuram with a family of four including two children sleeping inside. The family and neighbours were alarmed hearing the crashing sound of tiles and fled for their lives.\n\nNobody was injured in the incident. The herd then crossed the Palakkad Road, when Forest and Police department personnel rushed to the spot.\n\nForest Range Officer in-charge of Coimbatore Range C. Dinesh Kumar said that the two six-month-old calves in the herd were stranded in the middle of the road as they could not cross the median that was three feet high.\n\nTheir mothers too returned to the highway to help their calves cross the median. Vehicles were stopped on either side of the road at about 100 meters from where the herd blocked the road.\n\nThis affected the inter state traffic for more than half an hour.\n\nA team of 25 forest personnel from Boluvampatti and Coimbatore Range chased the herd into a farmland, where they had to struggle for more than three hours to chase the herd into the forest.\n\n“Four teams of forest personnel are monitoring movement of the herd as it is still close to the city. The teams are equipped with torch lights, crackers and vehicles to prevent the animals from entering the city from the forest area,” Mr. Dinesh Kumar said.\n\nTranquilising\n\nEarlier this week, a team of forest personnel comprising forest veterinarians and WWF representatives started preliminary discussions to tranquilise the lone elephant causing inconvenience to people of Sugunapuram and Madukkarai over the last six months.", 
    "section": "national", 
    "title": "Elephant herd blocks traffic on highway", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}