{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They hold aloft damaged and withered paddy crop to highlight the issue\n\nIrate farmers held aloft damaged and withered paddy crop to highlight the losses incurred in the aftermath of the unusually prolonged and intense rain spell in the delta and sought increased compensation of Rs. 25,000 per acre.\n\nRaising the issue at the grievance day meet here on Thursday, many farmers displayed the withered paddy crops and claimed that they could harvest only chaff and no grains from the crops that suffered massively in the sustained rains that lashed the delta region a few weeks back.\n\nA farmer Selvaraj of Mannargudi claimed that vast stretches of paddy fields as also numerous huts in his area were affected and damaged in the rains and demanded Rs. 25,000 per acre and s. 20,000 per hut as compensation. He also noted that there was scarcity of some essential commodities in the fair price shops.\n\nMarudappa of Nidamangalam sought the intervention of the officials in allowing procurement of paddy with a moisture content of up to 20 per cent at the direct purchase centres instead of normally permissible 17 per cent.\n\nKothandaraman of Edamelaiyur urged the district administration and the officials to present the true picture of damage so that the State Government would get an idea of the devastation caused by the rains in Tiruvarur region.\n\nA farmer Durairaj of Valangaiman alleged that only one of the two irrigation channels in his region was desilted while the officials were dithering on the other. There was no proper response on the status of the other channel and farmers were suffering because of that, he said.\n\nSethuraman of Kudavasal complained that farmers were not getting proper and adequate price for the paddy from the private dealers and traders.\n\nThe State Government must extend subsidised rental facility for harvest machines as it does for transplanting machinery.\n\nVadugakudi farmer Thambusamy sought water for irrigating crops in Arasalaru and Keerthimanalaru ayacuts as also desilting of Serugudi Vaikkal for the water to reach the tail end areas. Some farmers also demanded immediate removal of encroachments to water bodies.\n\nCollector M. Mathivanan assured the farmers that officials would properly and comprehensively undertake assessment of crop damage and the work they had already completed reflected the reality of the damage caused to the crops in the district. All those who had suffered damage would be compensated as per the State Government’s orders.\n\nDistrict Revenue Officer T. Mohanraj, Joint Director of Agriculture Mayilvahanam and others participated in the deliberations.", 
    "section": "national", 
    "title": "Farmers seek increased compensation of Rs. 25,000 an acre", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}