{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Biodegradable waste to be converted into manure\n\nCLEAN MISSION:K. Shiva Kumar, secretary, Gandhigram Trust, giving a dustbin to a beneficiary at Gandhigram near Dindigul on Wednesday evening.— PHOTO: G. KARTHIKEYAN\n\nEven as the district administration excluded Gandhigram panchayat from Clean India campaign, Gandhigram Trust has taken an initiative to create a model for solid waste management on its campus and staff quarters at Gandhigram in Athoor block, AD Colony at Ramarajapuram panchayat in Nilakottai block and Mettur village at G. Thummalapatti panchayat in Batlagundu block.\n\nIt is also engaged in capacity building exercise in two villages. Launching the programme on its campus at Gandhigram on evening, the trust distributed two dustbins to all houses at the staff quarters and nearby areas to segregate biodegradable and non-biodegradable wastes at source.\n\nBriefing about the project, trust secretary K. Shiva Kumar said that Gandhigram panchayat was not included in Swachh Bharat programme in the district.\n\nThe panchayat too did not have adequate funds for implementing the programme. So the trust had taken the initiative to motivate the community to segregate waste and dispose it ofsafely.\n\nThe biodegradable waste collected at the staff quarters would be used for making manure and non-biodegradable wastes would be sent to the trust’s recycling plant manned by self-help groups.\n\nTwo SHGs had been engaged for executing and monitoring the programme. Necessary equipment and materials such as crowbars, iron basins, containers, baskets, shoes, masks and rubber gloves were given to workers.\n\nCompost yard\n\nA compost yard and a shed were established on its campus to process waste.\n\nThe trust was also engaged in capacity building by motivating communities at AD Colony and Mettur to adopt sustainable sanitation practices and facilities through awareness creation and health education, Mr. Shiva Kumar said.\n\nTwo dustbins would be given to each of the 600 households at these places. All materials and equipment would also be given to the workforce.\n\nThe trust had advised the panchayats to use plastic waste to lay rural roads, he noted.\n\nGandhigram panchayat had agreed to dig a collection pit to dump organic waste and prepare manure, he added.", 
    "section": "national", 
    "title": "Gandhigram Trust starts solid waste management programme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}