{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "For the first time, all the 34,947 government schools in the State will get exclusive workers for the maintenance of sanitation facilities.\n\nThe School Education Department issued a G.O. in this regard a few months ago, and this was followed by another GO by the State Rural Development and Panchayat Raj Department allotting special funds to the tune of Rs. 57.63 crore for the implementation of this project during the year 2016.\n\nThe allotted fund is for the provision of salary to the conservancy workers employed in the school for the proper maintenance of the toilets and for the purchase of cleaning materials.\n\nThis project, which will come into force from the new year, 2016, will cover 34,947 government schools in the rural areas – higher secondary schools 2,462, high schools 2,892, panchayat union / government middle schools 6,797 and panchayat union and government primary schools 22,796.\n\nObjective\n\nThe objective of this project is creation of cent per cent sanitation facility in the government schools and posting adequate staff for the proper maintenance of the toilets. The G.O. favoured meeting of the above expenditure involved from the Solid Waste Management Funds.\n\nAccording to the G.O. of the Rural Development Department, the local bodies will be entrusted with the responsibility of maintenance of toilets in the government schools and local body schools.\n\nThe required number of sanitary workers could be decided by the local bodies concerned and they will function under the respective headmasters, school education department sources said.\n\nThe government has estimated that total expenditure per annum towards engagement of part-time sanitary workers for cleaning school toilets will be around Rs. 39.79 crores.\n\nWhile a salary of Rs. 2,000 will be provided as salary to a sanitary worker employed in higher secondary school, Rs. 1,500 has been fixed for the sanitary worker employed in high school, Rs. 1,000 in middle schools and Rs. 750 in primary schools.\n\nThe Rural Development Department has earmarked Rs. 17.84 crore for the purchase of cleaning materials such as bleaching powder, broomsticks, buckets etc. An amount of Rs. 1,000 each has been allotted for the HSSs, Rs. 750 for high schools, Rs. 500 for the middle schools and Rs. 300 for primary schools.\n\nThe department has directed the Directorate of Rural Development and Panchayat Raj to release the funds to District Collectors, who in turn will release the funds to the panchayat unions.\n\nThis project will cover 34,947 government schools in rural areas", 
    "section": "national", 
    "title": "Govt. schools to get sanitary workers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}