{
    "author": [
        "P Sudakar"
    ], 
    "text": "Decision to hand over school taken in December 1999\n\nAfter a wait for 16 years the State government has agreed to take over Thazhaiyadi Patcheri Harijan Primary School.\n\nA primary school run by Dalits to educate their children since 1939 has been handed over to the State government.\n\nThough the beleaguered administrative committee, after the murder of its member Arumugam, decided to hand over the school to the government in December 1999 and was waiting for final orders, it was a report carried by ‘ The Hindu’ on the condition of the school that has helped in completing the process.\n\nWhen a Brahmin philanthropist saw the pathetic living conditions of Dalits around Pappakudi in Tirunelveli district, he donated land, measuring 2,558 square feet, and constructed a building with a plinth area of 1,070 sq ft for a primary school at Thazhaiyadi Patcheri with 80 Adi Dravidar families under Harikesavanallur panchayat in 1939.\n\nThis enabled Adi Dravidar children to enter school for the first time. The school, aided by the government, was subsequently named Committee Harijan Primary School as the philanthropist had handed over the property to Dalits. On October 22, 1999, Arumugam, a member of the managing committee, was murdered by caste Hindus.\n\nFollowing the murder, most of the Dalit families gradually left Thazhaiyadi Patcheri, which is surrounded by caste Hindu hamlets, to settle down in other villages as they feared for their safety.\n\nThe school, which had 90 children, including 60 Dalit students, at that time could not be peacefully run by the committee which resolved on December 1, 1999 to hand it over to the government.\n\nSubsequently, the resolution copy, secretary’s letter and other documents were forwarded to the Department of School Education on December 17, 1999. Even after the property was registered in the name of the Governor as required by the Department of School Education, the government delayed the process.\n\nAfter a wait of 18 months, the committee received a letter from the Director of School Education, saying the government was willing to accept the proposal. But the letter laid a few conditions, like ensuring the building’s sturdiness by a Public Works Department engineer. The PWD took three more years to issue the certificate.\n\nFinally, the Director of School Education sent a letter to the Secretary, Department of School Education, on January 1, 2012, recommending the school’s takeover. However, the Secretary’s office claimed that no such letter was received from the Director. Ultimately, the school’s development and creation of additional infrastructure were affected.\n\n‘ The Hindu’ carried a report in December 2013, which urged the Department of School Education to issue the Government Order on taking over the school, which now has 35 children.", 
    "section": "national", 
    "title": "Govt takes over Dalits’ school", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}