{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Hands at work:Women working at the nursery in Kallanai village set up through MGNREGS to provide employment and livelihood for villagers.— Photo: G. Moorthy\n\nThe only source of income for G. Rukmani (50), a widow living with her physically challenged son in Kallanai panchayat near Alanganallur, is the wage she earns for 100 days a year through Mahatma Gandhi National Rural Employment Guarantee Scheme.\n\nHowever, with the setting up of a nursery garden in the village under the scheme, Ms. Rukmani’s prospects of getting employed for more days under the scheme has increased, besides learning a new skill.\n\n“The work presently done through the MGNREGS is unskilled work. Setting up of a nursery is one of our ideas to gradually shift the workers from unskilled to semi-skilled employment,” said B. Rohini Ramdas, Additional Collector and Project Officer of District Rural Development Agency (DRDA), Madurai.\n\nWhile DRDA in Madurai is planning to develop skills within the present MGNREGS framework, it has to be noted that the Centre has also embarked on an initiative to integrate skill development with the MGNREGS, although it is yet to be implemented fully.\n\nThe nursery set up in one acre at Rs. 18.5 lakh, which includes MGNREGS wages for 8,632 man days, will raise one lakh saplings in batches in the initial phase.\n\nPresently, more than 20 women have been trained by Horticulture Department for the work.\n\n“We teach them techniques of germination, right mixture of silt, red sand and organic manure to be used, and transplanting saplings to packets,” said I. Rajasekar, Assistant Executive Engineer. Saplings of jambu, margosa, tamarind, Indian beech, white silk-cotton and red kondrai are raised.\n\nG. Jayaraman, Block Development Officer, Alanganallur, said that these saplings would primarily be used by the district administration for afforestation on roadsides and massive tree planting initiatives. “The project will, therefore, help in increasing green cover of the district,” he said.\n\nMs. Rohini said that the project could provide sustainable revenue for the panchayat which in turn could provide employment for the villagers throughout the year. “As the initial results are promising, we are planning to launch the project in three other blocks,” she added.\n\nS. Gayathri, a worker who is also in-charge of supervision and maintenance of records, said that the village women found the nursery work more satisfying. “There is happiness of producing something. If we do well, we can even set it up as a business,” she also said.", 
    "section": "national", 
    "title": "Grooming workers and honing their skills", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}