{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court has issued a circular warning subordinate judicial officers in Tamil Nadu and Puducherry of departmental action if they defer cross-examination of witnesses either “at their pleasure or at the leisure of the defence counsel.”\n\nThe circular issued by Registrar General P. Kalaiyarasan, following instructions from Chief Justice Sanjay Kishan Kaul, stated that judicial officers must scrupulously follow directions issued by the Supreme Court on January 21 on the issue granting adjournments or face departmental action, which shall “also be reflected in the service register of the officer.”\n\nWhile coming across a case in which there was a gap of 20 months between examination-in-chief and cross-examination of a witness, the apex court expressed concern over trial courts granting adjournments at the drop of a hat and requested Chief Justices of all High Courts to ensure that trial judges within their jurisdiction do not do so henceforth.\n\nIn that judgment, a Bench of Justices Dipak Misra and Rohinton Fali Nariman had said: “If one is asked a question, ‘what afflicts the legally requisite criminal trial in its conceptual eventuality in this country?’ the two reasons that may earn the status of phenomenal signification are, first, procrastination of trial due to non-availability of witnesses and second unwarranted adjournments.”\n\nWondering how could trial courts postpone cross-examination of witnesses without recording plausible reasons as required under Section 309 of the Code of Criminal Procedure, the judges observed:\n\nMalignancy\n\n“What was a malady at one time, with the efflux of time, has metamorphosed into malignancy. What was a mere disturbance once has become a disorder, a diseased one, at present,” the court said.\n\n“What was a malady at one\n\ntime has metamorphosed into malignancy”", 
    "section": "national", 
    "title": "HC warns judicial officers against unwarranted adjournments", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}