{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chief Minister Jayalalithaa went back to storytelling to ridicule DMK treasurer M.K. Stalin and his Namakku Naame campaign .\n\nAddressing the party’s general council meeting on Thursday, Ms. Jayalalithaa, known for interspersing short stories in her long speeches, had this story of a thief caught while stealing a sack of onions in a landlord’s house as he could not find anything else.\n\nWhen the thief was produced before the king, he was asked if the charges were true. He meekly admitted to stealing. As punishment, the king gave him three options — Pay Rs. 100 as fine or undergo 100 whiplashes or eat the stolen onions in front of the king. After a little thought, the thief decided to eat the onions. After a while, he started crying and could not continue. “Please pardon me. I can’t eat the onions, I agree to be whiplashed.” And so, the whipping began. After ten lashes, he could not tolerate it. He begged the king to let him pay the fine. Like the story, one person dreaming himself to be the Chief Ministerial candidate was going from one place to another seeking pardon from people for all his prior mistakes as an act of atonement. People will not forget their misdeeds in the Cauvery dispute, Mullaperiyar issue, the methane scheme that could make the delta a desert, unprecedented load-shedding and the betrayal of the Sri Lankan Tamils, she said.\n\nMs. Jayalalithaa recalled a story to proudly tell her partymen that she had risen because of them. When C.N. Annadurai was participating in a public meeting, the cadre had laid a podium for him to speak from. But the podium’s height blocked their view of him, and the crowd began shouting for the removal of the podium. A party worker came and placed a stool for Anna to stand on it so that the cadre could see his face. When Anna began his speech, he said, “It should be clear by now that I had risen because of the cadre ( Naan thondargalal uyarndhavan ). Like him and party founder M.G. Ramachandran, Ms. Jayalalithaa, elected as party general secretary for the seventh time, attributed her rise to the cadre.\n\nRidicules\n\nM.K. Stalin and his campaign across the State", 
    "section": "national", 
    "title": "It’s back to storytelling", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}