{
    "author": [
        "S Senthalir"
    ], 
    "text": "If your inability to interact with family members or friends in the Intensive Care Unit (ICU) of hospitals is worrying you, then Jawaharlal Institute of Postgraduate Medical Education and Research (Jipmer) has a solution for it.\n\nIt has opened a new wing – Jipmer Facilitation Unit (JIFU) for research and design. This unit will soon design a kiosk that will provide for screen interaction with the in-patients. Anisa Basheer Khan, vice-chancellor in-charge, Pondicherry University inaugurated the facilitation unit on Wednesday.\n\nAfter inaugurating the unit, Jipmer Director Subash Chandra Parija said: “Generally, patients in the ICU are kept out from regular visitors fearing infection. This screen interaction will help the patients to talk to their family members or friends. We have just begun work on this and it will take at least a year or two to complete the design.”\n\nIn the initial phase, JIFU will focus on developing low-cost operating microscope design as well. There will be five students and five faculty members to start off the projects.\n\n“The objective of this Innovative Facilitation Unit is to allow students studying MBBS and other allied courses to innovate new products and processes. We will send a circular to all the classes (including MBBS and PG courses), faculty members and select the volunteers who would be interested in research and design. After they design a product, we have to get a patent since commercialisation of products needs patenting. This is to encourage research and innovation among young faculty members and students,” he said.\n\nOnce the design is ready, a prototype test has to be conducted and then trials should be done for validation. After validation, the product will be certified to be clinically used. He added that the cost of products would come down and people will be benefitted.\n\n“We are buying expensive diagnostic and surgical instruments from different countries. But, once we start designing and manufacturing our own kits then the cost would come down. Jipmer is strong in clinical research but this one aspect was lacking. Now, we have opened up opportunities for more innovation in the medical field for young professionals,” he said.\n\nJIFU will also have a patent cell that would register their products and look into the legal aspects of patenting the products.\n\nThe JIFU is already in talks with St John’s Medical College, Bangalore-based InnAccel Incubator Facility Company, Healthcare Innovative Technology Centre in Indian Institute of Technology-Madras (IIT-M), Pondicherry Engineering College and Pondicherry University to start collaboration for the research, bio design and manufacturing of products. “We will finalise on the collaboration with the companies and universities within a month or two and sign a memorandum of understanding,” he said.\n\nWork on the Jipmer Facilitation Unit will take an year to two to be completed", 
    "section": "national", 
    "title": "Jipmer to design kiosk for visitors to interact with ICU patients", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}