{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Coimbatore will get nearly half a dozen industrial parks in the next few years, apart from the existing industrial estates, if all the projects go on stream as proposed.\n\nAccording to S. Asokan, the District Industries’ Centre General Manager, MoUs have been signed at the Global Investor Meet for five projects. One major project is by Coimbatore District Small Industries’ Association.\n\nApart from these, Netaji Industrial Park (near Koilpalayam), Anna Park (near Karumathampatti), COSIEMA Industrial Park, and COMSIA Industrial Estate (Kaaliapalayam) are in the pipeline.\n\nThese are mostly for industries in the engineering and automobile sectors and to help many of the micro units relocate from residential areas.\n\nAccording to P. Chandrasekar, treasurer of Netaji Industrial Estate Society, as many as 100 entrepreneurs purchased 55 acres in 1997 and were waiting for approval from the Directorate of Town and Country Planning.\n\nAlmost 90 per cent of the units are engineering industries. The park will also have plastic industries and foundries.\n\nThese units are now located in the city, mainly in Ganapathi area. Of these, 78 units are ready to start operations at the industrial park at the earliest, he says.\n\nThe park is expected to attract investment for plant and machinery to the tune of Rs. 132 crore. Since many units are in the residential areas, they operate just one shift. By relocating to the park, they will be able to increase production, he says.\n\nM. Akbar, administrative officer (in-charge) of Anna Park, says the project will come up on 316 acres. Land has been allotted to 587 members (15, 30, 45 or 90 cents each) and it is planned to develop road and lay pipelines for water supply at a cost of Rs. 12 crore initially. In this project, there will be textiles, powerloom and engineering units. Additional common infrastructure will be developed when the units start developing at the park. About 100 units are ready to start production at the new park, he said. The COSIEMA Industrial Park is still in the preliminary stage, says its Managing Director R. Krishnamoorthy. The project is for about 50 units that are now located at the SIDCO Industrial Estate here. Some of them plan to re-locate from the industrial estate to the new project area or expand production capacities.", 
    "section": "national", 
    "title": "More industrial parks for Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}