{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Alagappa University has signed a Memorandum of Understanding (MoU) with Alagappa Chettiar College of Engineering and Technology (ACCET) to collaborate with academic activities, share human resources and expertise for common benefits of the institutions and student community.\n\n“The main objective of the MoU is to enhance the quality of academic and technical education and augment existing complementary capacities of both institutions,” a university release here said. It was also aimed at becoming dynamic, demand-driven, quality conscious and forward looking in response to rapidly developing economic, academic and technological developments occurring at both national and international levels, it said.\n\nResearch\n\nThe specific interest of activities of both the institutions would be to carry out research in the areas of physics, chemistry, biosensors, electronics, information technology, computer science, management and library science jointly.\n\nThanks to the MoU, the students of ACCET could avail programmes and courses conducted by infrastructure leasing and financial services under the aegis of Alagappa University by following the procedures in force.\n\nEducation and placement\n\n“Students of both institutions will have opportunities to avail the extra-curricular activities using arrangements in both institutions like Alagappa University Study Circle, Entrepreneur Development Cell,” the release said. Both parties will notify the other about the arrangements that they make for the benefit of the students’ community and the cause of education and placement, it added.\n\nSimilarly, the expertise of ACCET in the field of civil, electrical and mechanical engineering could be availed as an advice as and when it was required by the Alagappa University, the release issued also added.", 
    "section": "national", 
    "title": "MoU to enhance quality of academic, technical education", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}