{
    "author": [
        "S Annamalai"
    ], 
    "text": "Arimalam S. Padmanabhan of Puducherry addressing the birth centenary celebration of Tamil musicologist V.K.P. Sundaram at Thiagarajar College in Madurai on Wednesday.— Photo: R. Ashok\n\nThe birth centenary of a “mute, inglorious Milton” of Madurai, Veeranan Kamatchi Paramasivam Sundaram, was celebrated at Thiagarajar College here on Wednesday with a lecture by Arimalam S. Padmanabhan, musicologist from Puducherry.\n\nV.K.P. Sundaram, who was born in Combai in 1915, lived in Pasumalai, Madurai, till his death on March 9, 2003. He did exhaustive research in musicology to establish the ancient nature of Tamil music over other forms of music.\n\nHis works include 40 books and a four-part ‘Tamil Isai Kalaikalanjiyam’ (Encyclopaedia of Tamil Music) published by Bharathidasan University.\n\nIn his tribute to Sundaram, Nirmal Selvamony of Madras Christian College says, “No one has contributed to Tamil musicology as much as Prof. Sundaram has.” Dr. Padmanabhan described him as the “wisest among the wisest,” who made seminal contribution to study and understanding of Tamil music after Abraham Pandithar.\n\nSundaram was the one who pegged the beginning of Tamil music history at Tholkappiam.\n\nProf. Nirmal’s tribute recalls how Sundaram gave “special attention to taalam, which has resulted in novel musicological interpretation of passages that were hitherto considered merely ‘literary’.” Dr. Padmanabhan said that Sundaram established that present day raga ‘Mohanam’ was the first music that originated from Mullai landscape of ancient Tamils. ‘Parai’ was the first percussion instrument that came from Kurinji landscape.\n\nA tribute to Sundaram from Srinivasan Pichumani of the University of Michigan read: “The 82-year-old Dr. Sundaram has cleared many obscurities and errors with regard to Tamil musicology.....and clearly established the basic musical scale of ancient Tamils as ‘Chempalaippan’ or the present raga ‘Harikambodhi’.”\n\nHari K. Thiagarajan, secretary, Thiagarajar College, said that the centenary celebration was an opportunity to learn about a great son of the soil. G. Gnanasambandan, Professor Emeritus, explained the rich contribution of Sundaram to Tamil musicology.\n\nSundaram began his career as a teacher at Teacher Training Institute, Pasumalai.\n\nLater, he served at The American College, Madurai Kamaraj University and Tamil Nadu Theological Seminary. He learnt Tamil under Somasundara Bharathi and music under Sankarasivam of Ramanathapuram.\n\nHe was a recipient of Tiruvalluvar Award, Raja Muthiah Chettiar Award and Isai Kalai Selvar Award. He was writing a research paper an hour before his death.\n\n‘Sundaram established that present day raga ‘Mohanam’ was the first music that originated from Mullai landscape of ancient Tamils '", 
    "section": "national", 
    "title": "“Mute, inglorious Milton” of Madurai remembered", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}