{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In view of New Year celebrations, the Vellore police have stepped up vigil across the district, and have deployed over 1,000 police men.\n\nP.K. Senthilkumari, Superintendent of Police, Vellore, in a press release said the department had set up pickets and deployed police personnel on security in 95 places that included important temples and churches.\n\nTo prevent untoward incidents, the police have formed 34 patrol teams headed by inspectors of police. Vehicle checks are being conducted at important places in the district.\n\nA total of 1,213 personnel have been posted on security duty for the New Year. In addition, the police have cautioned youngsters racing in bikes and disturbing the public of stern action.\n\nAction will be taken against those who try to misbehave with women.\n\nWomen police will monitor eve teasing in plainclothes. Drunken driving and over speeding will draw a fine of up to Rs. 2,500. These vehicles will be seized and taken to the police station.\n\nThe police have urged the public to celebrate the New Year in a peaceful way.\n\nOn its part, the 108 ambulance service has geared up to address emergencies. There are a total of 42 regular ambulances and three neo natal ambulances in Vellore district.\n\nAn official said ambulances have been allotted to cover the National Highways from Sumaithangi to Vaniyambadi for close to 160 to 170 km.\n\nIn addition, separate ambulances have been earmarked for the government hospitals and Government Vellore Medical College Hospital (GVMCH), Adukkamparai to take up referral cases to higher centres.\n\nThe ambulances have been made available at the government hospitals in Ambur, Vaniyambadi, Sholinghur, Arakkonam, Tirupattur, Gudiyatham and Government Pentland Hospital, besides GVMCH.\n\nIn Tiruvannamalai, police have warned of stern action against those who create disturbance to people.", 
    "section": "national", 
    "title": "Police step up vigil", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}