{
    "author": [
        "Udhav Naig"
    ], 
    "text": "As the convoy of Chief Minister Jayalalithaa was making its way back to Poes Garden after the AIADMK’s general council meeting on Thursday, three activists of ‘Arapor Iyakkam’ began removing banners erected by the ruling party on TTK Road. They were detained at the Mylapore police station and taken to the Saidapet sessions court in the evening.\n\nIn the presence of photojournalists and video cameramen, the activists removed the banners that were blocking the vision of motorists.\n\nThe video of the three activists – Akhtar Ahmed, Jayaraman, Chandramohan – taking down the banners has gone viral on the social media.\n\n“We removed the banners which were out on the road. It is unfair that we were detained and are being taken into judicial custody while no action has been taken on the partymen who attacked us,” Ahmed said minutes before being taken to the court.\n\nOn Wednesday, the activists of ‘Arapor Iyakkam’ tried to give a written complaint at the Abhiramapuram police station about the ‘Amma’ banners which were put up on the road . Chandramohan had courted arrest on Wednesday as he went about removing banners. He was detained for a while and released later.\n\n“The Inspector said that they will not file a complaint and that we can do what we want. So the three activists took down banners placed on the road,” said Zakir, an activist belonging to ‘Arapor Iyakkam.’\n\nThe activists tried in vain to file a counter complaint against the “unruly AIADMK partymen who had attacked” the three men and also against the police officer at Abhiramapuram police station who had refused to take action against the banners erected all along the route leading up to Sri Ramachandra Medical College campus in Thiruvanmiyur.\n\n‘Arapor Iyakkam’ activist Nakkeeran said that the organisation has sought bail for those arrested. “We have clear video evidence of them being attacked, yet no action is being taken. If the police had taken action against the banners, we would not have removed them ourselves. Majority of the banners were placed illegally without proper paperwork,” he said.\n\nThe three activists have been booked for causing damage to public property.\n\n( With additional inputs from Anjana Shekar )", 
    "section": "national", 
    "title": "Social activists allege attack", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}