{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mohan Piyare, Principal Secretary, Department of Indian Medicine and Homeopathy, giving away rolling trophy to students during the annual day celebrations at Government Ayurveda College in Kottar on Wednesday.\n\nThe State government had allocated over Rs. 100-crore for the Department of Indian Medicine and Homeopathy during the last four-and-a-half years towards construction of buildings for Ayurveda and Homeopathy colleges across the State, said Mohan Piyare, Principal Secretary, Department of Indian Medicine and Homeopathy here on Wednesday.\n\nParticipating in the 3rd annual day celebrations of the Government Ayurveda College in Nagercoil, Mr. Mohan Piyare said that the construction of buildings for the colleges in various districts are in finishing stages, while in a few places, the buildings are ready for inauguration.\n\nMore and more people prefer Homeopathy medicines supplied by the Government Ayurveda Colleges, Mr. Piyare said.\n\nHe called up on the students pursuing Indian Medicine and Homeopathy to serve the society.\n\nThe secretary also released a souvenir and a compact disc ‘Saral,’ the first copy of which was received by the Collector Sajjansingh R. Chavan.\n\nThose who had served in Indian Medicine and Homeopathy for over 25 years were honoured by Mr. Piyare.\n\nA total of 123 students participated in the cultural programmes, 91 took part in literary competitions and 148 students participated in various sports competitions.\n\nS. Vadivel Murugan, Dean, Kanyakumari Government Medical College Hospital (KGMCH), D. Clarence Devi, Dean, Government Ayurveda College, S. Girija, Deputy Director, Leprosy Control and C. Elisa, District Siddha Medicine Officer, M. Meena Dev, Chairman, Nagercoil Municipality and novelist Ponneelan participated.", 
    "section": "national", 
    "title": "‘State allotted Rs. 100 crore for constructing buildings’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}