{
    "author": [
        "R Srikanth"
    ], 
    "text": "Power distribution company has been accused of disregarding Merit Order despatch\n\nThe Tamil Nadu Generation and Distribution Corporation (Tangedco) seems to have little regard for its financial health, as it purchases power at higher cost even if it is available at a low cost.\n\nThere is also the complaint of Tangedco not following the Merit Order despatch of the Tamil Nadu Electricity Regulatory Commission (TNERC) regarding the power distribution company (discom) to take all steps to purchase power at the ‘lowest-available cost’.\n\nWhen the crude oil price has come down drastically, power corporations producing electricity using oil products like Low Sulphur Heavy Stock (LSHS) have been quoting prices as low as Rs. 4.27 per unit (excluding the fixed cost).\n\nA copy of the price quotation, dated December 16, 2015, from a petroleum company shows LSHSD costing Rs. 20,294.67 per tonne.\n\nHowever, Tangedco has been purchasing power from captive power plants on a short-term basis at a cost of Rs. 5.05 per unit (excluding the fixed cost).\n\nData available from the State Load Despatch Centre (SLDC) between December 17 and December 30 show that Tangedco has not made any purchase from Independent Power Plants which use LSHSD, whereas it has been purchasing power at a cost of Rs. 5.05 per unit from captive power plants through short-term power purchase averaging 20 million units per day.\n\nS. Nagalsamy, a retired member of the TNERC, said not adhering to the Merit Order system by the discom and poor information sharing by SLDC could be cited as reasons for Tangedco opting for purchasing power at a higher cost. He faulted the Tangedco officials for not exploring all available sources for procuring power at low cost.\n\nS. Gandhi of Power Engineers’ Society of Tamilnadu (PESOT) blamed TNERC for remaining a mute spectator.\n\nA senior official of Tangedco while confirming that low cost power was available denied the charge that the organisation had not been following the Merit Order system.", 
    "section": "national", 
    "title": "Tangedco continues to buy power at higher cost", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}