{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Rain Centre will study why temple tanks have not been filled despite the rain\n\nThe Tiruvetteswarar temple tank in Triplicane is one of the many that have not filled up—Photo: K.V. Srinivasan\n\nThe recent heavy rain spells might have had a positive impact on groundwater levels in the city and suburbs. At the same time, there are many temple tanks that have not been filled to the brim despite copious rains. In a bid to find remedial measures, the Rain Centre is surveying the impact of the floods.\n\nBased on the findings of the survey, suggestions will be presented to the Sustainable Water Security Mission, which was recently formed by the government to restore water bodies and meet the city’s drinking water needs. The Mission comprises representatives of voluntary organisations and government departments.\n\nIn Triplicane, the Parthasarathy temple tank is full, while not very far away, the Tiruvatteeswarar temple tank is not. Residents of Triplicane said the stormwater drains and channels were obstructed and not linked properly to the temple tank. The tank of Kasi Viswanathar temple in Ayanavaram, is also in a similar condition. To study the contrast, the Rain Centre recently worked with the Chennai Corporation to improve channels connected to tanks in Madhavaperumal temple, Mylapore and Vadivudaiamman temple, Tiruvottiyur.\n\nThe survey will seek details about the intensity and time of flooding in a specific area and information about temple tanks and groundwater level before and after the heavy rain.\n\nThe Centre’s director Sekhar Raghavan said: “Groundwater level has gone up by 3 metres across the city. We are also inviting residents to write to the centre atsekar1479@yahoo.co.in. This may help to prepare an action plan to prevent floods and also restore ancient water bodies,” he said.", 
    "section": "national", 
    "title": "The puzzle of half-full tanks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}