{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "P. Sasivarma has made his fortune based on his artistic talent\n\nOn any given day, you can see artist P. Sasivarma zipping along the highways on his two-wheeler, either heading out from, or returning to, his home in Kanyakumari. His artworks don’t travel with him – his most recent paintings have been done on the walls of Srirangam’s Butterfly Park and those of the tourist centre at the Pachamalai Nature Reserve – but he is rarely without his basic kit of brush and paints.\n\n“I have wandered from place to place looking for art lessons,” says Sasivarma, who comes from an agricultural family. Interested in drawing from a very young age, Sasivarma, 36, says he knows over a thousand crafts apart from painting. And though it is difficult to independently verify this, he speaks knowledgeably about sand sculpture, Tanjore art, Warli painting, matchstick model-making and chalk carving, while showing samples of his drawings on wildlife.\n\nWith little formal training, except a two-month stint with a master who taught him how to mix colours and a correspondence course (“just for the certificate,” he admits), Sasivarma has made his own fortune, based on his artistic talent.\n\n“I had to become more serious after I became a family man, so I’ve stopped some of the fancier crafts like matchstick models. I offer personal art tuition to 38 students in Nagercoil,” he says.\n\nFor the past year, he has been commuting between Kanyakumari and Tiruchi while working on the Butterfly Park and Pachamalai reserve projects for the Government. What’s the difference between working on a wall and a smaller canvas or board? “Walls are easier to paint, once you scrub them down and give them a coat of primer,” says Sasivarma. “Smaller surfaces take longer to prepare.”\n\nAnd what if he goofs up? “Mistakes can be corrected easily in big drawings,” says Sasivarma breezily. “Only I will know where the correction was made, not the viewer.”\n\nPreferring not to replicate Nature scenes from photographs, he says he is more comfortable using his imagination. Many of the Nature scenes that visitors can see in the Butterfly Park are his handiwork. Sasivarma also has created three-dimensional sculptures of animals on the walls of the Pachamalai tourist centre, which seem to mimic the real wildlife in the area.\n\nAn expert in homeopathy, Sasivarma coaches women’s self-help groups in making easily marketable herbal products such as a shampoo with a curry leaf base. “I studied homeopathy formally for six months, and also combined my mother’s knowledge of home remedies. It’s quite possible for women to earn a livelihood using the resources available to them,” says Sasivarma.\n\nWith plans to offer art classes in Tiruchi in the near future, Sasivarma hopes the city’s residents would stop defacing the walls with posters and graffiti and adorn them with beautiful paintings instead. “We can create beauty anywhere, but we should have the will to look after it,” he says.", 
    "section": "national", 
    "title": "The world is his art kit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}