{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Many families lost a lot of their possessions in the floods. However, they are glad to have a concrete roof over their heads —Photos: S.R. Raghunathan\n\nFlood-affected residents of Saidapet, who have been shifted to flats in Okkiyam Thoraippakam, are happy about their new houses but are also concerned about how to earn their livelihood\n\nll we remember of our houses is that water reached the roofs,” recalled B. Ganesan, a resident of Aathuma Nagar from Saidapet, whose hut was damaged during the flood. His family is one among the over 100 families who shifted into Tamil Nadu Slum Clearance Board (TNSCB) Flats at Ezhil Nagar, Okkiyam Thoraippakam on Wednesday, facilitated by the Chennai Corporation.\n\nPointing to three children fast asleep inside a flat there, G. Valli said many of them were relieved to have a roof over their heads, after spending more than three weeks in relief camps since their huts and all their possessions had been washed away.\n\n“Most of us worked in houses and offices at Saidapet for small housekeeping jobs and we have to start over here. The men in our area either work in construction sites or drive autos and have to look for new jobs in the area here,” she said. Like her, the relief was obvious on the faces of many people who had witnessed the worst flood of their lives.\n\nOfficials on Wednesday disbursed the allowance of Rs 5,000 to people who were moving in. Most of the residents only had meagre possessions. E. Chellam, a vegetable vendor from Saidapet, said they had to buy everything, right from vessels to clothes.\n\nM. Alli, a septuagenarian, who had lived for over twenty years along the Adyar river, said most residents happy with the new houses they were allotted. “Since we are being given lights and fans as well as water supply, we are happy to move in. The challenge however begins when we settle in and begin to look for jobs in a new area where we have no contacts,” she said.\n\nSaidapet was ‘in the heart of the city’, A. Anjalai, said, adding she was worried for her husband and herself since they had a lot of health problems. “We were very familiar with that area and the medical facilities were available nearby. This place feels far-flung, so we need to be prepared for an emergency,” she said.\n\nOfficials of TNSCB said skill-based training and vocational courses as well as government job melas will be held for the people who are resettled. “We will encourage women to form SHGs. Special focus is being given to the children so that they can be accommodated in the schools and ICDS centres nearby to begin classes,” he said.", 
    "section": "national", 
    "title": "The challenges of a fresh start", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}