{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Vaikunta Ekadasi festival, irappathu, sattrumurai, 3 a.m.; theertha viniyoga goshti, 4 a.m.\n\nSri Shridi Sai Baba Public Complex, Mekkudi : Eka dina Sai laksharchanai, 8 a.m.; maha arathi, 12.30 p.m.; nama japam, 3 p.m.; arathi, 6 p.m. and 8 p.m.\n\nOrganising Committee : Sri Radha Kalyana mahotsavam, Sri Anandhakrishna Varadharaja Perumal Temple, Anagarai, 10 a.m.; thiruveedhi ula, 6.30 p.m.\n\nSri Ramakrishna Sarada Samithi : Sri Sarada Devi birth day and Kalpatharu day, mangala arathi and pooja, Sri Ramakrishna temple, Golden Rock, 5.50 a.m.; bhajan, 7.15 a.m.; Vedic chanting, bhajan and homam, 10.25 a.m.; discourse by Swamy Sathyajnananda, noon and 3.05 p.m.; bhajan, 2 p.m.; meditation, 2.45 p.m.; arathi, 6.30 p.m.; inauguration of building at Ramakrishna Vidyalaya, 9 a.m.\n\nMata Amritanandamayi Seva Samithi : Saravaisvara sowbaghya homam and thiruvilakku pooja, Amrita Vidyalaya, Amrita Nagar, Rettai Vaical, 5 p.m.\n\nSriram Bhajan Mandali : Sri Radha Kalyana mahotsavam, S.R.Kalyana Mandapam, Amma Mandapam Road, Srirangam, 7 p.m.\n\nSri Andavan Ashram, Srirangam: Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam : Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, No.144, South Chithra Street, Srirangam, 2.15 p.m.; Maruthi Vinayagar Alayam, CKV Apartments, Thiruvanaikovil, 3.45 p.m.; parayana goshti procession, South Gate, Srirangam, 5 p.m.\n\nSri Rama Nama Sath Sangam : Rama Nama parayanam, 18, V Main Road, Renga Nagar, 6 p.m.\n\nGENERAL\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nTamil Nadu Handicrafts Development Corporation : Crafts bazaar – exhibition-cum-sale, Makkal Mandram, Thillai Nagar, 10 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}