{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Banners erected by the AIADMK prevented people from venturing out of their homes on vehicles. —PHOTO: L. SRINIVASAN\n\nMost of south Chennai came to a standstill with several hundred people trapped in traffic when the AIADMK general council meeting was on.\n\nAdded to this, banners prevented people from venturing out of their homes in vehicles. Those who did manage to found themselves trapped for over one hour, especially on Sardar Patel road.\n\nAhead of the meeting, AIADMK cadre started fixing banners across the city from Wednesday.\n\nFrom Thursday morning, the road from Poes Garden to Thiruvanmiyur was resonating with the beats of percussion instruments played at different spots along the route taken by the convoy of Chief Minister Jayalalithaa.\n\n“It is very insulting. When the city is having low key new-year celebrations, the party is installing a gigantic arch made from vegetables on Kotturpuram Bridge to welcome the Chief Minister,” said K. Moideen, of Nandanam.\n\nResidents were forced to walk to the office due to the congestion.\n\n“I had to drop my friend at his office on Rajiv Gandhi Salai, but he got down near IIT–Madras and walked all the way,” said B. Kamesh of Mylapore.\n\nThe frequency of buses on Rajiv Gandhi Salai was also affected.\n\n“There was one bus every 20 minutes and share autorickshaw service was also affected. I had an important meeting and I could not reach my office on time,” said G. Pranesh, who was trapped at Madhya Kailash.\n\nTraffic police tried their best to regulate traffic, but it did not help.\n\n“We have been working from Wednesday night and tried our best to ensure that traffic flow was smooth. There was not much of a problem from Madhya Kailash junction to Tidel Park junction. Beyond this the cadre could not be controlled,” said a traffic policeman.", 
    "section": "national", 
    "title": "Traffic thrown out of gear, residents fume", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}