{
    "author": [
        "R Sujatha"
    ], 
    "text": "The aim is to ensure greater efficiency and promote transparency\n\nProfessors feel that online admission system will not only usher in a paperless process but also bring about some amount of transparency.— File Photo\n\nThe University Grants Commission has urged universities – private and public - to adopt online admission system for all programmes offered by them from the next academic year.\n\nThe aim is to ensure greater efficiency and promote transparency, besides enabling parents and students to make informed choices, the UGC has said in its notice.\n\nThough professors feel that the system would not only usher in a paperless admission process but also bring about some amount of transparency, they are uncertain if it can be implemented immediately.\n\nWhile Anna University and the Tamil Nadu Dr. MGR Medical University have in place a single window admission process, they also allow candidates to purchase application forms. Thousands of candidates purchase the hard copy of the forms. The 11 State-run arts and science universities have started publishing exam results online, but many candidates rely on hard copy of application forms even in autonomous colleges.\n\nA few years ago government colleges implemented the single-window system of admission. This has cut the cost on application forms for students, says P. Sivaraman, president of the Government College Teachers Manram.\n\nDuring her tenure as Vice-Chairperson of the Tamil Nadu State Council for Higher Education Cynthia Pandian had tried to introduce single-window system of admission for postgraduate programmes in arts and science colleges. “She had wanted all universities to sent particulars but no one responded,” recalls K. Pandiyan, former State president of Association of University Teachers.\n\nIn the 1980s, the government issued an order empowering regional joint director to receive details of admission from colleges on a daily basis during the season. The order also specifies that colleges should submit admission particulars subject-wise and community-wise.\n\nColleges should display vacancies on the notice board too. “Yet, for the last 15 years no college has followed the rule,” Prof. Pandiyan says, adding that universities should not have trouble implementing the notice as already hall tickets and exam results are issued online. But he wonders how private institutions would react.\n\nThe Registrar of a private university in South Chennai points out that such a system would work only for programmes that admit without entrance exams. “It is a good idea but applicability is the issue. We are thinking about taking counselling online but it is in the preliminary stages,” the official informs.\n\nUGC Vice Chairman H. Devaraj, however, says the aim is to expedite the admission process, bring in transparency and create a database.", 
    "section": "national", 
    "title": "UGC asks varsities to adopt online admission process", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}