{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Expressing concern over failure of government officials to defend private ownership claims over many public properties, the Madras High Court has directed the State government to issue an order or a circular warning its officials of departmental action if they fail to conduct court cases on such issues effectively for the State.\n\nIn a judgement ordered to be circulated to the Chief Secretary, Home Secretary, Revenue Secretary and Public Secretary, Justice S. Nagamuthu also directed the government to ensure that competence, merit and integrity alone, and not political allegiance, were considered while appointing lawyers as government pleaders.\n\nCondoning the delay of 1,217 days in filing a second appeal on behalf of the State with respect to the claim laid by an individual over a piece of land inside a police quarters, he said: “From the facts of this case, it is crystal clear that the records pertaining to litigations against the government are not properly maintained in the respective offices.\n\n“It is not the first occasion that the officials have miserably failed to protect government properties by properly defending or prosecuting the litigation. In a number of cases which had come up before this court, it has come to light that the government officers remained ex-parte and thus the litigation ended in favour of the private litigants undefended.”\n\nExpressing surprise over even Collectors and Superintendents of Police feigning ignorance about such litigations despite the cases being conducted before lower courts for decades, the judge wondered how the officials could take such a stand even after the courts had issued notices to them and they were duly represented by government pleaders.\n\n“I am only hopeful that the government would take this issue seriously and issue an appropriate Government Order or circular. This incident and similar other incidents are only reminders to the government,” the judge observed.\n\nHe recalled that in 1961 itself, a Division Bench of the High Court had said: “Though no individual member of the public may be directly affected by or interested in the manner in which the government pleader performs his duties, the public as a whole are because if he mishandles his briefs there would be loss of money to the public exchequer which in the last resort has to be made good by the tax payer.”", 
    "section": "national", 
    "title": "Usurping of public properties: HC orders action against officials", 
    "subsection": "tamilnadu", 
    "date": "2016-01-01"
}