{
    "author": [
        "Gautam S"
    ], 
    "text": "It was a routine evening for autorickshaw driver Sureshchandra Pandey on Friday when he picked up a passenger from outside the Chhatrapati Shivaji International Airport here and started towards Andheri around 6 p.m. What followed, however, was anything but routine.\n\nThe passenger, a 28-year-old woman, first told him to take her to Yaari Road in Andheri. However, after about five, she suddenly told him to take her to Bandstand. While this in itself was not unusual, what she said next caught Mr. Pandey’s attention.\n\n“The woman told me to drop her off at Bandstand so that she could jump into the sea and never be found again. I first thought she was joking and laughed at her statement. However, she repeated the same thing several times during the journey, after which I became worried. I pulled over in Vile Parle and asked her what was wrong, and she told me that she had no one in the world and saw no reason to continue living,” Mr. Pandey, who belongs to Uttar Pradesh and has been driving an autorickshaw in Mumbai since 1985, told The Hindu .\n\nFor the next half-an-hour, Mr Pandey tried to reason with the woman, and asked her what was so wrong, hoping she would feel better. The woman told him that she had recently lost her job, and had been depressed since then. Her mother had come to visit her earlier this week, and she had a fight with her which turned so serious that her mother decided to go back to Delhi.\n\n“I tried telling the woman that suicide was not a solution but soon realised that she was adamant. I also realised that if I refused to take her to Bandstand, she would only hail another auto, and that the next driver might not care. I told her that I would take her to the Airport police station … the police would be able to prevent her mother from boarding her flight. She agreed and I sped to the police station,” said Mr. Pandey.\n\nHe reached the police station within ten minutes, ran straight to the duty officer and told him that he had a passenger who was bent on killing herself. She was then taken to the police station and counselled.\n\nFinally, around two hours later, the girl was taken to the Cooper Hospital, where she is undergoing counselling under the care of experts. An officer with the Airport police station said that her case is being overseen by a female officer.\n\nPandey prevented his passenger from ending her life by driving her to a police station", 
    "section": "national", 
    "title": "A Mumbai auto driver who took the right road", 
    "subsection": "general", 
    "date": "2016-02-21"
}