{
    "author": [], 
    "text": "Researchers have successfully reprogrammed living bone cells that are implanted to treat large, non-healing bone fractures to enhance their capacity to regenerate even in harmful environment.\n\nTo support bone generation, researchers worldwide are developing living implants, consisting of cells seeded on supporting structures made of biological material.\n\n“Often, only 30 per cent of the implanted bone cells will survive the first days. A major reason is that the blood vessels around the fracture, which deliver oxygen and nutrients to the cells, are also damaged,” said Geert Carmeliet from University of Leuven (KU Leuven) in Belgium. “The ingrowth of new blood vessels into the implant takes time and until then, the cells are out of fuel since oxygen and nutrient supply is insufficient,” she said.\n\nAccording to researchers, human body can repair bone fractures by itself in most cases. However, the body’s repair capacity is not sufficient in large bone fractures or defects, which often fail to heal without help.\n\n“At the same time, the starved bone cells produce harmful oxygen radicals and thereby disturb the natural balance between antioxidants and oxygen radicals. An excess of these oxygen radicals causes irreversible cell damage,” Ms. Carmeliet said.\n\n“Reprogramming bone cells obtained from patients might increase their survival rate from 30 per cent to 60 per cent, which will ultimately lead to better bone regeneration,” she said.\n\nResearchers tested in mice how they could better equip the bone cells for that crucial stage between implantation and ingrowth of the blood vessels.\n\nThey managed to switch on a survival mode in bone cells by inactivating the oxygen sensor PHD2 before implantation.\n\n“As a result, bone cells activate a dual defence mechanism. First, bone cells increase storage of an emergency fuel in the form of glycogen, which is in fact a sugar reservoir,” said Steve Stegen, a doctoral student.\n\n“In addition, bone cells start using glutamine — an amino acid — to produce more antioxidants to neutralise the increased production of harmful oxygen radicals,” Mr. Stegen said.\n\n“These two adjustments allow bone cells to be self—supporting in terms of energy generation and to protect themselves against an increased level of oxygen radicals,” he said.\n\nThe oxygen sensor PHD2 can be inactivated via genetic engineering, and also by administering therapeutic molecules, Mr. Carmeliet said. The study was published in the journal Cell Metabolism . — PTI\n\nResearchers are developing implants of living bone cells that treat such injuries", 
    "section": "national", 
    "title": "A new way of healing large bone fractures", 
    "subsection": "general", 
    "date": "2016-02-21"
}