{
    "author": [], 
    "text": "The Congress on Saturday accused the BJP and the RSS of “conspiring to divide Haryana on caste lines,” blaming it for the continued violence in the State over the Jat stir for quota.\n\nParty vice-president Rahul Gandhi appealed to the people to maintain peace and resolve the issue through talks.\n\nMaking a similar appeal, AICC communication department chief Randeep Surjewala appealed for “withdrawing” the agitation in the interest of the State and asked the Central and the State governments to “take strong action against those inciting violence“.\n\n“I am pained to say that while the BJP and RSS are conspiring to divide the nation through communalism and regionalism, they are also engaged in an obnoxious conspiracy of dividing Haryana on caste lines.\n\n“By making controversial and unnecessary statements everyday, the Ministers, MPs and MLAs of BJP have created the current provocative situation. The BJP government has totally failed to solve it after creating the problem,” Mr. Surjewala said.\n\nDivisive politics\n\nAsking the BJP government in Haryana and Modi government at the Centre “to refrain from divisive politics,” Mr. Surjewala called for effective steps, advising the government to follow its ‘rajdharma’\n\n“Requesting the two and half crore people of Haryana to maintain peace and brotherhood, we also appeal for complete withdrawal of the agitation in the interest of the State,” Mr.Surjewala, a former Haryana Minister, said.\n\nThe reaction by Congress came as fresh incidents of violence were reported on Saturday in Haryana as the Jat stir for quota intensified with protesters torching a railway station in Jind even as the Army conducted a flag march in two curfew-bound districts and used helicopters to reach parts of the blocked Rohtak district. — PTI", 
    "section": "national", 
    "title": "BJP, RSS trying to divide State: Cong", 
    "subsection": "general", 
    "date": "2016-02-21"
}