{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "oping to exercise some damage control, the central leadership of the BJP on Saturday decided to issue a show cause notice to its MLA in Haryana, Raj Kumar Saini, who had made comments objecting to reservations for Jats, even as violence escalated in several parts of the State on the day.\n\nThe central leaders also roped in Minister of State for Agriculture and Muzzaffarnagar MP, Sanjeev Balyan (who had been arrested in a case for calling a mahapanchayat while prohibitory orders were in effect in the riot-affected areas) to its crisis management team on the issue, as it fears an escalation of the agitation to western Uttar Pradesh where Mr.Balyan is influential and where the BJP did very well with Jat support in the 2014 general elections.\n\nThe crisis management group comprises, besides Mr.Balyan, BJP president Amit Shah; Haryana Minister O.P. Dhankar; BJP in-charge of Haryana, Anil Jain; and Union Minister for Rural Development Rao Birendra Singh.\n\nMr.Singh, after a series of meetings by these leaders, said that the BJP was favour of quota for Jats and invited agitating Jat leaders for talks to find a peaceful solution to the issue.\n\n“I appeal to the people leading the agitation to hold talks with our leadership”, said Mr. Singh, who addressed a press conference. The party formed a government for the first time in Haryana after it received huge support from non-Jat communities in the State and the backing of the Dera Sachcha Sauda cult that has influence over many backward communities. The political situation for the party in neighbouring western Uttar Pradesh is very different, where after the Muzzaffarnagar riots of 2013, Jats had shifted allegiance on a large scale to the BJP.\n\n“The Jat leaders of the BJP in Haryana, therefore, have been mollified with Central ministerial berths while the State is run by a non-Jat, Manohar Lal Khattar. The Jats feel disenfranchised under that government, while the party knows they are vital for it in the upcoming Assembly polls in Uttar Pradesh in 2017”, said a senior leader of the party.\n\nMr.Balyan is considered influential among Jat communities, far more than the stable of Jat leaders from the party in Haryana, largely brought in from the Congress just before the 2014 general elections. Mr.Balyan also met Home Minister Rajnath Singh on Saturday evening along with several local Jat leaders from western Uttar Pradesh.\n\nThe Congress reacted with disbelief at Mr.Balyan’s role in peace talks. “Sanjeev Balyan to help BJP sort out Haryana crisis. Is BJP serious?” tweeted its Madhya Pradesh unit chief and former Union Minister Arun Yadav. “I don’t get this - how could a rioter help the government contain other rioters? BJP has lost it”, he said in a follow-up tweet.\n\nShow cause notice to be issued to Haryana MLA;\n\nparty forms crisis management team", 
    "section": "national", 
    "title": "BJP crisis management team gets into a huddle", 
    "subsection": "general", 
    "date": "2016-02-21"
}