{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A section of the Bharatiya Janata Party (BJP) leadership on Saturday accused Jadavpur University Vice-Chancellor Suranjan Das of inaction over the raising of slogans on the Afzal Guru hanging and other controversial issues by a few students earlier this week on the campus. While Mr.Das refuted the allegation, he found support from the Trinamool Congress (TMC).\n\nBJP leaders accused Mr.Das of “doing nothing” to identify those who raised “anti-India slogans” and asked why he had not taken any action against the students.\n\n“Right under the nose of Jadavpur University Vice-Chancellor some raised anti-India slogans. If he does not take any action against these elements and curb such activities, then it becomes clear that he is working according to a political agenda”, BJP national secretary Siddharth Nath Singh said. He dubbed Mr.Das as a “Trinamool Congress (TMC) appointee” and alleged that he was working on behalf of the ruling party.\n\nAsking why the Vice-Chancellor had not yet submitted a report to the Chancellor over the incident despite being asked to do so, Mr.Singh said: “The Governor is not only the constitutional head of the State but also the Chancellor of the University. So, how come the Vice-Chancellor is yet to submit a report to him even after the Governor has sought it?”\n\nMr.Das, however, refuted the allegations of working for a “political agenda” and pointed out that a Vice-Chancellor was appointed by the Chancellor. “I have never acted under political influence, and the interest of the university has always been my priority”, he said.\n\n“I am hurt. It is not proper to make such remarks against a Vice-Chancellor. Everybody has the right to freedom of speech. He (Mr.Singh) must have made such remarks under that right and I am also entitled to deny the allegations under the same”, Mr.Das said.\n\nSupporting the Vice-Chancellor over the issue, senior TMC leader and MP, Saugata Roy, wondered whether Mr.Singh was qualified to make such comments. He lauded Mr.Das’ decision of not lodging an FIR against the students and said, “I have seldom heard such a dignified comment from a Vice-Chancellor”.\n\nMeanwhile, a BJP rally reached the gates of the Governor’s house despite Section 144 being in effect there. The BJP supporters raised slogans in front of the north gate of the Governor’s house.", 
    "section": "national", 
    "title": "BJP accuses Jadavpur V-C of inaction", 
    "subsection": "general", 
    "date": "2016-02-21"
}