{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Bus and train services on most routes through Haryana have been cancelled because of the blockades by protesters demanding reservation for the Jats.\n\nNearly 600 trains have either been cancelled or diverted since the agitation began.\n\nHaryana Director-General of Police Y.P. Singhal said the situation was better on Saturday. “A petrol pump and the Sadar police station in Meham were set on fire. The National Highway-1 is blocked, but efforts are on to get the blockade lifted,” he said. Reports said protesters set several buses on fire in the Gohana bus stand in Sonipat. A police station was set on fire in Meham.\n\nA police station and a railway station were set on fire in Jind district. Buildings of the Revenue Department at a few places were also set ablaze, reports said. The protesters also set ablaze a toll plaza on the Panipat-Rohtak Highway and uprooted the rail track in Panipat, disrupting the crucial link between Delhi and other northern States.\n\nMaruti halts production\n\nMaruti Suzuki India Limited has decided to suspend the manufacture of cars at its facilities in Manesar and Gurgaon.\n\n“Supplies of certain components have been disrupted. Hence, the company has to suspend manufacture,” a company spokesperson said in a statement.\n\nJat students protested in the north campus of Delhi University to demand reservation. They stopped vehicles.\n\nOfficials of the Azadpur mandi said the wholesale prices of vegetables had gone up slightly. Milk supply in Delhi-NCR has come under stress.\n\nThe former Haryana Chief Minister, Bhupinder Singh Hooda, said that to spread the message of peace across Haryana, he would go on a fast at Jantar Mantar from February 21.\n\nA police station and a railway station were set on fire in Jind district of the State", 
    "section": "national", 
    "title": "Bus, train services badly affected", 
    "subsection": "general", 
    "date": "2016-02-21"
}