{
    "author": [
        "R Krishna Kumar"
    ], 
    "text": "About 500 acres of forest land feared burnt; Karnataka government orders probe\n\nThe fire that raged for two days has been stomped out by the Forest Department.\n\nA large swathe of Bandipur Tiger Reserve was ravaged by a fire that raged for two days but has been stomped out by the Forest Department.\n\nA departmental inquiry has been ordered to ascertain the cause of the fire and fix responsibility.\n\nThe fire was first noticed on Thursday and again on Friday and it is suspected that about 350 to 500 acres of forest land may have been burnt. Forest officials however, described it as a ‘minor ground fire’.\n\nThe fire was seen in Kembepurahaadi in the Moleyuru range of the tiger reserve. Two incidents were reported. A senior forest department official told The Hindu that the fire was man-made and the moment they put out the fire in one part of the forest, there was report of a fire in an adjoining portion, which was put out on Friday night.\n\nThis is the first major fire reported from Bandipur, which has a history of fires ravaging forests, this year.\n\n“The vegetation is bone-dry, water holes have dried up and there was very little moisture here,” said Venkatesh, Deputy Conservator of Forests of Hediyala range.\n\nHonorary Wildlife Warden of Chamarajanagar Naveen Kumar said that the extent of devastation is speculative and will be known only after conducting a GPS survey.\n\nA similar survey had been conducted in 2013, when 1,500 hectares of forest were ravaged.\n\nThe Forest Department has begun steps to rope in villagers to keep an eye on those who may be causing these fires. Mr. Venkatesh met village heads of adjoining hamlets and took them into confidence.\n\n“They have been apprised to keep a watch on strangers entering the village besides reining in potential trouble-makers in their respective villages. We have also promised them incentives,’’ he said.\n\nA departmental inquiry has been ordered to ascertain the\n\ncause of the fire", 
    "section": "national", 
    "title": "Fire ravages Bandipur tiger reserve; 500 acres gutted", 
    "subsection": "general", 
    "date": "2016-02-21"
}