{
    "author": [
        "Yuthika Bhargava"
    ], 
    "text": "Ringing Bells on Saturday closed the booking for its ‘Freedom 251’ smartphone after receiving over 6 crore registrations for the device in just 2 days, even as the Telecom Ministry has initiated internal inquiry to ascertain the “veracity of this venture”.\n\nOverwhelming response\n\nThe company which has attracted much controversy in the past few days over plans to sell the world’s cheapest smartphone at Rs. 251, said the response received far exceeded the number that they had expected and hence, “we are now closing the invitation to bookings in this phase 1.”\n\nMeanwhile, Telecom Minister Ravi Shankar Prasad has instructed the Department of Electronics and IT (DeitY) “to look into the whole issue in the backdrop of long-term implications.”\n\nThis follows letters written by the Indian Cellular Association and BJP MP Kirit Somaiya “wherein they have expressed doubts about the veracity of this venture [Ringing Bells].”\n\nNo BIS certification\n\nAnother source added that the Ministry had internally started taking actions such as examining the issue and sensitising the State governments to protect the interest of the consumers.\n\nWhile the IT Ministry confirmed that the Ringing Bell is not registered with the Bureau of Indian Standards (BIS) for meeting the safety standards in the country, making the sale of such handsets illegal, the company president Ashok Chaddha said their application was under filing and they expected to have the certification in hand well before delivery commences.\n\nOn allegations that the company showcased a rival company — Adcom’s handset as its own, Mr. Chaddha clarified that “it wanted to show a sample or prototype of what the handsets will look like. This is not the final piece.”\n\n“In view of the shortage of time and given that these were to serve only as prototypes to a limited list of persons, we went ahead. We would clearly mention that the Final Freedom 251 manufactured/assembled in India would be to identical specs - i.e. no change,” he added.\n\nBesides, the firm has also come under the scanner of the Excise and Income Tax departments, with the I-T Department looking into the financial structure of the Noida-based company. “Yes, there was a visit from excise department and income tax department…They issued us some guidelines for future and extended full support and co-operation,” Mr. Chadda added.\n\nExcise and I-T department are looking into the financial structure of the company", 
    "section": "national", 
    "title": "Freedom 251 booking closed; probe ordered", 
    "subsection": "general", 
    "date": "2016-02-21"
}