{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Prime Minister Narendra Modi with his Nepal counterpartK.P. Sharma Oli at Hyderabad House in New Delhi on Saturday.- Photo: Sandeep Saxena\n\nIndia and Nepal signed seven agreements on Saturday at a summit meeting of Prime Minister Narendra Modi and his Nepal counterpart K.P. Sharma Oli, even as leaders of the Madhesi people in Nepal threatened one more blockade.\n\nAddressing the press after the signing ceremony at the Hyderabad House, Mr.Oli said that both sides were determined to avoid the disruption of Nepal’s transit facilities as experienced over the past five months. Referring to Nepal’s dependence on India for receiving essential commodities, Mr.Oli said without naming Madhesi protesters, “Unscrupulous elements should not be allowed to abuse the open borders between Nepal and India”.\n\nNepali sources told The Hindu that differences persisted between India and Nepal over how to address the aspirations of the blockade-enforcing Madhesis, the “unscrupulous elements” in Mr.Oli’s speech.\n\nDuring the talks, the Indian side reportedly displayed a different understanding of the “unscrupulous elements”.\n\nHighlighting the differences over the Madhesi population on the India-Nepal border, a senior official said, “By unscrupulous elements, we refer to the fake currency racket, and other such elements in that region that hurt Indian security”.\n\nThough both the sides tried to address the grievances of the pro-blockade agitators by agreeing to build a road network in the Madhes region, the leaders of the Madhesis are planning more agitation.\n\nUpendra Yadav of the United Madhesi Democratic Front said on Saturday that his organisation would re-launch the blockade. “We do not think the Prime Minister of Nepal will implement the remaining constitutional amendments. We will have to re-launch our economic blockade to end the policy of racial discrimination that the Nepali elite practises against the Madhesi people of the Tarai region”, Mr.Yadav told The Hindu from Kathmandu. “We are mobilising our people and will soon be back on the streets of Madhes region and restart the blockade”, he said.\n\nMeanwhile, more than two dozen Madhesi students from Nepal, arrested here on Friday night, were remanded in judicial custody in Tihar jail. The students were arrested by the Delhi police when they tried to reach the embassy of Nepal where Mr.Oli was attending a public reception.", 
    "section": "national", 
    "title": "India, Nepal sign seven accords", 
    "subsection": "general", 
    "date": "2016-02-21"
}