{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "This Woman’s Day, folk artistes to showcase art forms previously dominated by men\n\nWith the Karnataka Janapada Academy (KJA) set to launch 60 all-woman folk teams representing signature arts of the State, Women’s Day will see hundreds of women artists making waves. On the day of launch on March 8, 60 troupes from 30 districts (two each) will present spectacular performances in Dollu Kunita, Veeragase, Kamsale, Tammate, Patakunita, Venu Kunita, Chittimela, Puja Kunita, Jaggalige Kunita, and other important folk forms.\n\nConsidering the demand performances of artistes like Durgamma of Ballari (Dollu Kunita), Savitha Chirukunaiah of Mandya (Puja Kunita), Yashoda of Tumakuru (Tammate) and Shweta of Chikkamagaluru (Veeragase) have generated at national and international events, including at the Indian Premier League, there is hope of commercial gain as well.\n\n“We plan to utilise the potential of woman folk artists by empowering them economically. The demand for existing artists is so much that their dates are booked for the next three months,” said Pichalli Srinivas, chairperson of KJA. “One need not be surprised if the troupes become permanent fixtures in corporate events in future.”\n\nThough women have contributed significantly to enrich the folk culture, patriarchal society has limited their role to singing ‘Sobane’, ‘Beesukallu pada’ and devotional songs during marriages and other social gatherings. But, of late, some women artists have showed that conquering folk forms essentially dominated by men can have positive results. They have made a mark in art forms like ‘Dollu Kunita’ and ‘Veeragase’, which are widely considered a male bastion.\n\nKJA’s plan is being executed with a government funding of Rs. 1.3 crore. Training is on in five revenue divisions. Artists selected for training are being paid a stipend of Rs. 500 per day, besides being provided boarding facilities.\n\n“Training of all 60 troupes will be completed by February-end and they will perform at a place identified in Central Karnataka on March 8. They will meet the increase in demand for folk performances in the days to come,” Mr. Pichalli told The Hindu .", 
    "section": "national", 
    "title": "Karnataka women break into another male bastion", 
    "subsection": "general", 
    "date": "2016-02-21"
}