{
    "author": [
        "K A"
    ], 
    "text": "Around 300 tribeswomen here, under Thaykula Sanghom, a women’s collective, are on an indefinite agitation seeking the closure of the nearest liquor retail outlet at Anaikatty town. But closure of the shop seems unlikely as it is located in Tamil Nadu, whereas the protest is on in Kerala. The liquor shop, at the eastern edge of Attappady, does brisk business just outside the State boundary.\n\nThough total prohibition has been in force in the Kerala portion of Attappady for 22 years, Thaykula Sanghom members allege that the shop plays a major role in diluting the initiative. Spurious liquor brewed atop inaccessible hills is taking a toll on the health and finances of tribespeople, they say.\n\n“During late evenings, illicit liquor is sold publicly at many points on the road from Agali to Anakkatti. Passengers of most buses from Anakkatti to Agali are drunk,” says Maruthi, a tribeswoman. The agitation has completed five days. However, officials and local politicians are not hopeful of forcing Tamil Nadu to down the shutters of the shop. Many from Agali, Sholayur, and Puthur panchayats (where prohibition is in force) buy liquor from this shop and mix it with local illegal brew. Spurious liquor has resulted in many deaths in the region.\n\nInsecticide Furadan, sulphate, used torch batteries, and reptiles are used in abundance to brew country liquor.\n\nIn the absence of government-authorised liquor retail outlets, residents of most of the 187 hamlets of the Irula, Muduga, and Kurumba tribes in Attappady consume such liquor.\n\nIt is alleged that a lobby of outsiders, supported by contractors-turned-politicians, are making a fortune peddling the spurious drink to indigent tribes.\n\nThey say the outlet in the border\n\nvillage of Anaikatty renders prohibition ineffective", 
    "section": "national", 
    "title": "Kerala women up in arms against liquor shop in T.N.", 
    "subsection": "general", 
    "date": "2016-02-21"
}