{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "‘It is incorrect to believe that those working in the informal sector are poor’\n\n‘If the government assures us that it can control the bribe culture, we are ready to file income tax returns,’ say vendors.— Photo: Vijay Bate\n\nIn a first, Mumbai’s millionaire paanwalas , vadapav walas and juice walas are being screened by income tax sleuths, who are launching a drive to crack down on black money in the informal sector.\n\nSenior I-T officials said the decision was taken after a search in Central Mumbai revealed huge unaccounted wealth and properties of a popular paanwala . The department has, for the first time, started screening data of vendors registered with the Brihanmumbai Municipal Corporation (BMC) and records of small shops available with the Labour Department.\n\nSo far, data of 62,721 vendors obtained from the BMC has been screened to assess their tax liability over the past three financial years, officials said. Data of another 21,500 potential assessees, also small-time shop owners, registered with the Labour Department, has been screened.\n\n“It is incorrect to believe that those working in the informal sectors, such as the paanwalas , vada pav walas and juice walas are poor and all those in the middle class bracket are rich... ” reads a report of the tax department.\n\n‘Unthinkable’\n\nReacting to the move, sellers of paans and vada pav say they don’t mind being dragged into the tax net as long as the safety and security of their street business is assured. “This is the not first attempt by the taxmen to bring us in the net. A decade ago, they had come asking for a tax of Rs 1,400 annually, but we couldn’t comply even after a notice was served. In a scenario where we have to constantly bribe officials for licensing and other permissions, tax compliance is unthinkable,” said Vidvasano Yadav, who runs a paan stall outside the Churchgate station.\n\n“If the government assures us that it can control the bribe culture, we are ready to file tax returns,” he added.\n\nThe next generation, like many others, does not want to be part of the business, but insist that tax returns be filed for documentation purposes.\n\n“I am preparing for studies abroad, and it would be convenient if my father has his documentation in place for visa and other purposes,” says Vidvasano Yadav’s son, Krishna Yadav.", 
    "section": "national", 
    "title": "Mumbai street vendors on taxman radar", 
    "subsection": "general", 
    "date": "2016-02-21"
}