{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "There is no fixed place to accord honour for slain soldiers. A file photo of jawans carrying bodies of soldiers who died in Siachen glacier, at Palam Air Force Station in New Delhi.\n\nIt is a tradition to give a ceremonial guard of honour to soldiers who have laid down their lives in line of duty. However, as the bodies reach Delhi, there is no fixed place to accord honour because the issue is stuck in a web of regulations and red tape. The armed forces are denied a permanent space in the name of security.\n\nIn the recent Siachen tragedy, the bodies of the nine soldiers of 19 Madras Regiment killed in an avalanche were flown to Delhi in a military aircraft and taken to the Palam Air Force station. However the normal practice is to bring them on civilian flights to Delhi, accord them the honours, and fly them to their native places. “We need it close to the airport as we cannot delay civil flights. There is a time constraint,” a senior Army officer told The Hindu . Military aircraft are not used regularly to fly bodies because it will be too expensive.\n\nA new site was to be identified after objections from the Civil Aviation Ministry to the existing unused site, but the process is yet to move forward.\n\nThe Army had built Shradhanjali Sthal near the cargo terminal of the Indira Gandhi International Airport at a cost of Rs. 30 lakh in the area allotted by the Delhi International Airport Limited (DIAL) in 2012. But since its completion in August 2014, the site has remained unused as the Bureau of Civil Aviation Security (BCAS), an independent body under the Civil Aviation Ministry, refused to give security clearance, citing regulations.\n\nIn March last year, Defence Minister Manohar Parrikar wrote to Civil Aviation Minister Ashok Gajapathiraju, requesting him to “pass suitable instructions to the BCAS to accord necessary permission to operationalise” the site so that “out martyrs could be given a befitting tribute which they deserve.”\n\nMr. Raju, who took almost a month to acknowledge the receipt of the letter, wrote back in September, reiterating that there was a ban on ceremonies in the airside of the airport and said shifting the site to a location other than the airside would be a viable solution. To end the impasse, Mr. Parrikar agreed to a proposal to shift Shradhanjali Sthal to a new site. A committee of officials of the two Ministries was constituted in September last to identify a suitable site in the airport area. But the committee is yet to meet.\n\nThe Defence Ministry also wrote to the Civil Aviation Ministry, asking that it bear the cost of the new site as the earlier one was paid for by the Army, and it was the BCAS that did not raise any objection at the time of construction. A response is still awaited.\n\nThe Army had given an assurance that no ammunition would be carried with the 30 guns used to give salute, and they would be kept in the custody of the Central Industrial Security Force. Meanwhile, the Army has spent Rs. 5 lakhs to make an alternative arrangement near the Base Hospital in Delhi Cantonment till the issue is resolved.", 
    "section": "national", 
    "title": "No place to honour martyrs", 
    "subsection": "general", 
    "date": "2016-02-21"
}