{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "AISA activists demanding the release of JNUSU president Kanhaiya Kumar and justice for Rohit Vemula and (right) ABVP activists shouting slogans against AISA activists, at Delhi University on Saturday. —Photos: Sushil Kumar Verma\n\nABVP activists and students demanding release of Kanhaiya Kumar confront each other on the campus\n\nDisplaying solidarity with the students of Jawaharlal Nehru University (JNU), a large number of students gathered outside Delhi University’s Arts Faculty on Saturday.\n\nIn an ‘Open House’ organised by the students of DU, they demanded the immediate and unconditional release of JNUSU president Kanhaiya Kumar and withdrawal of all charges of sedition from all students of JNU.\n\nEven as the majority in DU’s students’ union is Akhil Bharatiya Vidhyarti Parishad (ABVP), students of the university supported the JNU, going beyond party lines. They were, however, disrupted for a short while by ABVP members.\n\nStating that DU was not a saffron campus and stood with the JNU in the time of crisis, Abha Dev Habib, professor at Delhi University, said: “From the past few days, we are seeing that the BJP is running a shrill campaign branding all those who dissent as anti-nationals. The ABVP is organising a march in different colleges spreading jingoism and terror between the student communities. DU, like other campuses, is not a saffron campus and any such move to impose saffron agenda must be resisted”.\n\nA PhD student, Remya Sharma, who was among those participating in the meeting, said that she supported the ongoing agitation.\n\n“I am not affiliated with any political party but I believe that a university should be a space where all sorts of debates and discussions should happen”, she said.\n\nVishwajeet, national general secretary of the AISF said, “It is really shameful and disheartening that some media is using their full might to establish that the JNU students are involved in anti-national activities. We will challenge this through our movement across the country in the coming days”.\n\nThe meeting took place amidst opposition from nearly a dozen ABVP members who shouted slogans such as “ Jo Afzal ka saath dega woh Afzal ki maut marega (those who support Afzal will die like him)”.\n\nThe police prevented a clash between ABVP members and the protesting students, numbering a little over 100. “No one has been detained and the situation was brought under control in due time”, DCP (North) Madhur Verma said.\n\n“The way they are demanding the release of Kanhaiya is not acceptable to us and, therefore, we are here to oppose the meeting. Support for Afzal and opposing the nationalistic ethos of the country will not be tolerated”, said Delhi unit secretary of ABVP, Bharat Khatana.\n\nHe said that the ABVP had given a “Sansad Gherao” call on January 24 at Jantar Mantar where they will demand the suspension of the Members of Parliament who have supported Kanhaiya.", 
    "section": "national", 
    "title": "Police prevent clash at Delhi University", 
    "subsection": "general", 
    "date": "2016-02-21"
}