{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "Gangster was arrested in Singapore after fingerprints confirm his identity\n\nThe Mumbai Police Crime Branch has initiated the process of extraditing gangster Kumar Pillai, wanted for at least five serious crimes in Mumbai, who was arrested in Singapore two weeks back. Officials said that the arrest was the result of two months of joint work with the police in Singapore. Pillai was positively identified after his fingerprints matched the set sent by the Crime Branch.\n\nAccording to Crime Branch sources, information was received in January this year that Pillai was staying in Singapore, and the Crime Branch, along with central intelligence agencies, started verifying the information.\n\nCentre’s efforts\n\nAfter obtaining prima facie confirmation, the Indian government contacted the government of Singapore and efforts were initiated to nab him. Sources said that while the process was under way since the beginning of the year, it only picked up speed after the new Police Commissioner took charge in Mumbai on January 31.\n\nDattatray Padsalgikar got in touch with the contacts that he had cultivated during his 17-year stint with the Intelligence Bureau, and stepped up the process, working in coordination with Joint Commissioner of Police (Crime) Atulchandra Kulkarni. Both IPS officers have worked together in the IB earlier.\n\n“Twice, we had firm information about him being sighted in Singapore, which was conveyed to the Singapore police. However, he managed to slip on both occasions and the team that raided the place he was seen at did not find him. On the third occasion, which was two weeks ago, he was successfully nabbed and being held in custody since then,” said a senior officer with the Mumbai Police.\n\nAfter his arrest, the Singapore police contacted the Mumbai Police and the process was taken to the next stage.\n\nThe Crime Branch sent a set of Pillai’s fingerprints to the Singapore police and these were compared, after which it was confirmed this week that it was indeed Pillai.\n\n“There are five serious cases registered against Pillai. We have sent our extradition proposal to the Singapore authorities and are fulfilling all the requirements. It is a protracted process and will take time to reach some definite stage,” said Mumbai Police spokesperson DCP Dhananjay Kulkarni.\n\nFather’s murder\n\nPillai entered the Mumbai underworld in the early 90s after his father, Krishnan Pillai, was killed by Lalsingh Chauhan, an aide of wanted fugitive and terror accused Dawood Ibrahim Kaskar. Pillai joined gangster Amar Naik’s gang in order to avenge his father’s death and went on to gun down Chauhan in Borivali.\n\nPillai is also believed to have established contacts with the Liberation Tigers of Tamil Eelam (LTTE) and buying sophisticated weaponry from them.", 
    "section": "national", 
    "title": "Process to extradite Kumar Pillai begins", 
    "subsection": "general", 
    "date": "2016-02-21"
}