{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "A church in Chandernagore is an example of transnational architecture. (Right) Young citizen historians speak to visitors on the history of Chandernagore.— Photos: SPECIAL ARRANGEMENT/Aishwarya Tipnis Architects\n\nA unique project to restore forgotten heritage is bearing fruit in West Bengal’s Chandernagore town — the first trading post on the eastern bank of the Hooghly, set up by the French in 1696.\n\nThe project involves not only restoration of the old buildings but also promoting the rich heritage of the erstwhile French settlement among people.\n\nLocated about 50 kilometres from Kolkata, Chandernagore was designed as a trading town and not a military establishment. It grew to a prosperous trading town under the governance of Joseph Francois Dupleix.\n\nChandernagore also reflects the confluence of the French and Bengali cultures as a number of Bengali merchants played an important role in development of the town.\n\n“Heritage is not about academicians, it is not making pretty books and it is not about academic research. If we wanted to do something about heritage it had be at the grassroots, it had to involve the local people of Chandernagore,” said Aishwarya Tipnis, the architect who is involved with restoration of the heritage of town since 2011.\n\nThe initiative to involve the local people resulted in the training of a young enthusiast group of citizen historians, who went from home to home, found stories and documented the history of the place. The group now takes tourists for a heritage walk around the town.\n\nWhile there is a significant amount of information about the French town of Pondicherry, there is a relatively little material on the heritage of Chandernagore.\n\nAll the work done on restoring the heritage of the town has been digitised and memories documented online. A website, heritagechandernagore.com was inaugurated early this month to mark the 65th anniversary of the Treaty of Cession on February 2, 1951. The treaty officially gave control of Chandernagore to the Indian government from the French.\n\nThe project, which received support from the Embassy of France in India and Foundation Vieilles Maisons Francaise (VMF), is executed by Aishwarya Tipnis Architects.\n\nPhilippe Toussaint, President of VMF, said the biggest enemy of heritage is ignorance and the local population’s involvement has raised awareness about the heritage value of the town. As part of the renovation, 106 buildings were identified as historically important. Stories about a bakery and an old furniture store were documented.\n\nOld photographs that tell the story of India’s freedom struggle were collected from the local citizens and now are part of the digital repository.\n\nCitizen historians went from home to home to document stories from the local population", 
    "section": "national", 
    "title": "Restoring the forgotten heritage of Chandernagore", 
    "subsection": "general", 
    "date": "2016-02-21"
}