{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Though children below 18 years of age constitute 41 per cent of the country’s population, the budgetary allocation for them remains dismal, child rights campaigner and Nobel Laureate Kailash Satyarthi said here on Saturday.\n\nUrging the Union government to invest more on children in the coming Union budget, he said: “India is proud of being the youngest society in the world… We all talk about demographic dividend but when it comes to investment on children, on their health, education and protection, it is dismal I would say. This is only four per cent or less of the budget on children health education and protection.”\n\nInteracting with journalists at the Kolkata Press Club, Mr. Satyarthi said no country could accomplish inclusivity and sustain development, along with social development and peace, unless it gave priority to the health and education of its children.\n\nSpeaking on the proposed amendments to the existing law on child labour, he expressed the hope that Parliament would pass a progressive law. “We demand that child labour be completely prohibited up to 14 years of age and employment of children be prevented in any hazardous profession between 15 to 18 years of age,” he said.\n\nWhile the existing law identified 83 hazardous occupations prohibiting children from working, Mr. Satyarthi said the proposed amendment reduced the number of hazardous occupations only to three.\n\nThe child rights activist said he would soon launch a campaign ‘100 million for 100 million’. A 100 million children who are in schools and colleges and have access to education and other facilities will make a difference to the other 100 million who are not so fortunate, he said.\n\nThe campaign would be both online and on the ground and he was trying to reach the media groups and universities.\n\nThough he refrained from giving a direct answer to the recent developments at the Jawaharlal Nehru University, he said youths all over the world were getting frustrated and disillusioned with institutions.", 
    "section": "national", 
    "title": "Satyarthi urges govt. to invest more on children in budget", 
    "subsection": "general", 
    "date": "2016-02-21"
}