{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The Shahi Imam of Jama Masjid, Syed Ahmed Bukhari, on Saturday accused the Samajwadi Party government of “betraying” Muslims in Uttar Pradesh by not fulfilling even a single promise made in the 2012 election manifesto.\n\nThe Imam’s endorsement or rejection of political parties ahead of elections is nothing new, but for the SP it might ring alarm bells for, there is apparent disenchantment of Muslims towards the party as the 2017 polls near.\n\nIn 2012 elections, the Imam openly supported the SP even sharing the dais with party supremo Mulayam Singh.\n\nImam Bukhari presided over a representative convention of Muslim clerics, leaders and intelligentsia here to discuss the SP government’s performance vis-à-vis Muslims.\n\nExpressing “strong displeasure” over the “betrayal of promises” by the SP, a resolution passed by the convention gave Chief Minister Akhilesh Yadav three months’ ultimatum to take steps in fulfilling its promises made to Muslims.\n\nThe Imam may even meet Mr. Yadav to discuss the issue.\n\nAmong the promises made to Muslims by the SP government were bringing in reservation for them, releasing innocent Muslim youths lodged in jail on terror charges and creating educational hubs in Muslim-populated areas.\n\nThe minority community is “not bonded” to any particular party, the Imam said, warning “secular parties” to not take Muslims for granted.\n\n“Deep despondency is evident amongst Muslims as not a single promise has been fulfilled by Mulayam Singh or Akhilesh Yadav in spite of written and verbal reminders sent to them time and again. They feel cheated,” the resolution said.\n\nThe convention expressed “anxiety over vitiation of environment of communal harmony” and the State government’s “coveted support to the vandal and communal elements.” It also raised concerns over the “constant silence of the SP government over various problems and issues” concerning Muslims, who form 19 per cent of UP’s electorate.\n\nThough it is a matter of debate how influential the cleric’s “appeals” among Muslims are, the current expression of unhappiness by the community will worry the SP. The party recently lost two Assembly seats from areas with substantial Muslim population and a prominent Islamic institute, Shibli Academy in Azamgarh, Mr. Mulayam Singh’s seat, rejected the government’s grant.\n\nFrom founding the Atal Himayat Committee in 2004 in support of the then Prime Minister Atal Bihari Vajpayee, to his current criticism of the SP, the Imam has changed tack several times over the years. In 2007, he convened the United Democratic Front and in 2009 he publicly rejected the Congress alleging it had exploited Muslims.", 
    "section": "national", 
    "title": "SP betrayed Muslims in Uttar Pradesh: Bukhari", 
    "subsection": "general", 
    "date": "2016-02-21"
}