{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Says his government has ‘come into life’ with the revocation of President’s rule\n\nThe former Arunachal Pradesh Chief Minister, Nabam Tuki, on Saturday urged President Pranab Mukherjee to discard the new government established on Friday with Kalikho Pul swearing in as Chief Minister.\n\nIn a letter to Mr. Mukherjee, Mr.Tuki said his government “has come into life” with the revocation of President’s rule. “In these circumstances that I am addressing the instant communication to Your Excellency, seeking your benevolence to swear me in as the Chief Minister of the State along with the Council of Ministers as they existed prior to the President’s rule,” Mr. Tuki said in his letter.\n\nA group of dissidents led by Mr. Pul worked for fives months to overthrow Mr. Tuki’s regime, which ceased to function after the President’s rule was imposed in the State on January 26.\n\nCongress president Sonia Gandhi threw her weight behind Mr. Tuki, snubbing Mr. Pul, who, a few hours after the withdrawal of President’s rule on Friday night, was sworn in as the new Chief Minister. Ms. Gandhi assured Mr. Tuki that he is the only elected leader of the Congress Legislature Party in Arunachal Pradesh and the party is “fully backing” him in his fight to re-establish his government.\n\nIn his letter to the President, Mr. Tuki argues that Mr. Pul cannot replace him as the Chief Minister since he is not the elected member of the Congress Legislature Party. If his claim to the position is not rejected, Mr. Tuki emphasises in the letter, it would be in violation of the party discipline, which would amount to the “breach” of the Tenth Schedule of the Constitution.\n\nWhile addressing a press briefing here, Mr. Tuki blamed the RSS and the BJP for his ouster.", 
    "section": "national", 
    "title": "Swear me in as CM, Tuki urges Pranab", 
    "subsection": "general", 
    "date": "2016-02-21"
}