{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Old students of Jawaharlal Nehru University organise meeting in support of protests on Delhi campus\n\nContending that Section 124 A of the Indian Penal Code or sedition charges were being slapped on people, who challenged the basic falsehoods of a regime, former Governor of West Bengal Gopalkrishna Gandhi has urged that Parliament “must now drastically amend if not end this outdated, outmoded and outrageous provision.”\n\nSpeaking at a solidarity meeting organised by the old students of Jawaharlal Nehru University (JNU) in support of the protests on the campus in Delhi on Saturday, Mr. Gandhi observed it was the foreign colonial masters who conveniently clubbed dissent, free thought, and the desire for swaraj, under the red umbrella of sedition through Section 124 A of the IPC.\n\n“And so when the basic falsehoods of a regime or a system or an order are challenged, what is the reaction? Sedition is invoked. One’s patriotism is questioned,” he said. Former Editor of The Hindu Malini Parthasarathy pointed out that JNU got 3.9 out of 4 in the National Assessment Accreditation Council (NAAC) ranking in 2012 – the highest ranking for any educational institution in the country.\n\nObserving that the attack on JNU was an attack on the idea of India as originally meant to be in the Constitution, she said the freedom of speech and spirit of inquiry were the essence of academic pursuit. “Nationalism is of the people, of the communities coming together, it can’t be imposed by a State, which, in a democracy, is an instrument of the people. That’s why governments should respect the voice of the people and protect the right to dissent,” she said. Dr. Parthasarathy also released a booklet containing the Vemula’s note and Kanhaiya Kumar’s speech, and the first copy was received by Congress spokesperson Khushboo Sundar.\n\nFormer Vice-Chancellor of Manonmaniam Sundaranar University V. Vasanthi Devi discussed how the idea of nationalism was being misused by certain groups. “With a national flag in hand, it looked as if anything can be justified.” Former JNUSU general secretary Elangovan Kaniappan spoke.", 
    "section": "national", 
    "title": "‘Time to amend sedition charges drastically’", 
    "subsection": "general", 
    "date": "2016-02-21"
}