{
    "author": [], 
    "text": "Chris Milk stepped onto a TED Conference stage and took the audience on an awe-inducing trip into the future of movies.\n\nWhile much of the early attention on virtual reality has focused on use of the immersive technology in video games, Mr. Milk and his U.S. startup Vrse are using it to transform storytelling and filmgoing.\n\n“We have just started to scratch the surface of the true power of virtual reality,” Mr. Milk said.\n\n“It’s not a video game peripheral. It connects humans to other humans in a profound way... I think virtual reality has the potential to actually change the world.”\n\nHe had everyone in the Vancouver audience at TED, which ended Friday, hold Google Cardboard viewers to their eyes for what was billed as the world’s collective virtual reality experience. Google Cardboard gear is literally that — cardboard with a slot for holding smartphones at act as screens for viewing. Ear buds plug into smartphones to tune into soundtracks.\n\nAudience members gasped collectively at times as they found themselves virtually transported in front of an oncoming locomotive, the sky above a city, a stage with a rock band and elsewhere.\n\n“It is the first medium that actually makes the jump from the author’s expression of an experience to our experiencing it first hand,” Mr. Milk said. Vrse has made more tha a dozen virtual reality films in the past year and Mr. Milk said peers in the industry are tremendously interested in the technology.\n\n“It is amazing that you can just take a cardboard box and add it to someone’s smartphone and have an experience like that together,” Milk said after his TED talk.\n\n“Virtual reality is not just a social experience, but a collective experience.” Mr. Milk sees virtual reality as bringing people together instead of isolating them in fantasy worlds disconnected from what is going on around them. “I can connect you not just with someone across the aisle from you, I can connect you to someone across the world,” Mr. Milk said. — AFP\n\nChris Milk takes audience into the future of cinema and storytelling at TED conference", 
    "section": "national", 
    "title": "Virtual reality promises to transform films", 
    "subsection": "general", 
    "date": "2016-02-21"
}