{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "A few landlords go out of their way to accommodate people with mental illnesses. Some such landlords and their tenants at Villivakkam in Chennai. —Photo: B. Jothi Ramalingam\n\nFor the mentally ill, finding rental accommodationis a huge problem\n\nOver the last 13 years, 54-year-old Ravikumar and his family have moved homes 15 times. It’s only been three months since they arrived at their current home near Perambur, but already, Ravikumar said, their landlord has asked them to vacate.\n\n“Nobody wants us in their homes because of my son, who is mentally ill. He shouts a lot and uses bad language. Landlords tell us they do not want trouble and we just do not know what to do,” he said.\n\nFor families with relatives who are mentally ill, finding rental accommodation is a huge problem. “That’s why most families don’t disclose that they have a member who is ill,” said R. Thara, director, Schizophrenia Research Foundation (SCARF).\n\nIt is difficult for other residents of the building or neighbourhood — some people with illnesses are argumentative, pick fights, some may be aggressive, others paranoid. But in the absence of state-run facilities for housing, the very sick only get more stigmatised and marginalised, said Dr. Thara, and this has to change. At Better Chances, a non-governmental organisation, founder Porkodi Palaniappan is attempting to find a solution, by talking to landlords and helping those with mental illnesses on the road to recovery find homes and live independently.\n\n“We told the landlords about our clients’ illnesses and said we would be there to help with problems. And to our surprise, we found that a few landlords, when they knew, went out of their way to accommodate people with illnesses, despite many problems,” she said.\n\nD. Rajalaksmi is one such landlady in Villivakkam. One set of her tenants were two women with mental illnesses and one of their mothers. “There were many issues. One of the women would lose her temper, jump over the gate, push things off the balcony, shout at me, pull the electricity wires and stand at the neighbour’s window to watch their TV. I had complaints from neighbours too. But I knew they were ill so I would always sit with the NGO and try and sort out their issues,” she said.\n\nMrs. Rajalakshmi currently has a 45-year-old man who had a mental illness as a tenant. His social worker said that Mrs. Rajalakhsmi ensured he went to his computer classes every day.\n\nA. Kodhai, another landlady, first hesitated when she was asked to rent out her property, wondering if there would be bad behaviour. But over a year later, she says, there has been no problem at all.\n\n“This is an attempt to involve the community in helping a person with mental illness towards living and working independently and to de-stigmatise the illness,” Ms. Palaniappan said.\n\nR. Sathianathan, professor of psychiatry, Sri Ramachandra University, said, “Society’s attitude to the mentally ill today is still extremely insensitive. Very few are fortunate to have their own homes and I have seen so many cases of families forced to move or institutionalise their relatives because of social pressure. Communities must be educated to understand and accept persons with mental illnesses, to know that if they are shouting or aggressive, it is due to their illness. Unless society’s attitude changes, these difficulties will remain.”\n\n* Some names have been changed\n\nQuotes:\n\nIn a study in the 1980s, SCARF found that over 10 years, the average number of times a family with a mentally ill member had to change houses was at least seven. “Not much has changed since then. And to add to this, studies abroad have shown the drift effect — families eventually move from affluent areas to less affluent areas, as the poorer the area, the more the tolerance\n\nR. Thara, director, Schizophrenia Research Foundation\n\nThere were many issues and there were complaints from neighbours too. But I always sat with the NGO and the tenants and tried to resolve the problem\n\nD. Rajalakshmi, landlady, Villivakkam\n\nThere is very little government support for rehabilitation. Sometimes even their own families do not understand those with mental illnesses completely. What will happen once I am gone? I would like to ensure that my son’s future is secured. For this, it is important for them to gain confidence and live independently\n\nFather of a 45-year-old recovering from a mental illness", 
    "section": "national", 
    "title": "A glaring case of exclusion", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}