{
    "author": [
        "Udhav Naig"
    ], 
    "text": "When Punitha Pandian realised that Dr. Ambedkar’s ideas have not adequately entered the consciousness of the people, he thought: Why not publish a magazine that presents a Dalit perspective? The result was Dalit Murasu.\n\n“Many think, even Dalits, of Dr. Ambedkar as the father of Indian Constitution and as a man who fought for the rights of Dalits. However, I think there is a need to discuss his revolutionary ideas such as his anti-Hinduism, creating a Buddhist culture amongst the Dalits and the need to bring Periyar and Ambedkar closer to each other. He wanted to create a new society. So, I thought there was space for such a magazine in society,” he says.\n\nBefore founding the magazine in 1997, Mr. Pandian, hailing from Tirupathur, worked to bring out the Tamil version of Amnesty International’s newsletter, which, he says, was his training ground. “After college, I was also involved in anti-nuclear activism and was involved in raising awareness about Eelam struggle,” he says\n\n“So, when I started the magazine, I was clear that the magazine shouldn’t politically lean towards one single party and that we should consistently bring out the magazine every single month,” he adds.\n\nHe was able to achieve his objectives for the first 15 years but, with the cost of printing rising, it has not been easy. “In the last 4 years, we have faced financial issues that have made it difficult for us to meet deadlines and publish regularly. But, it doesn’t matter. I am proud that we were able to run a magazine that consistently wrote against the mainstream political ideology and created more than 50 writers from the Dalit community who are now working in various mainstream magazines.”\n\nSpeaking about underlying politics of the magazine, he says that he sought to keep the magazine apolitical and inclusive. “Though the editorial board is run by Dalits, we have kept the magazine open to writers from all social backgrounds including the upper castes. We have managed to stick to this objective,” Mr. Pandian says.\n\n“We have not just focussed on Dalit issues but written about environment, literature and about issues concerning sexual minorities.”\n\nThe magazine, which steps into its twentieth year, has over 5000 subscribers. “In the last two decades, we have resisted attempts by political parties who either want us to openly support them or become their mouth piece.”\n\nWhat next? “We hope to raise a corpus fund of around Rs. 30 lakh from districts all over Tamil Nadu so that the magazine is published even if I am not there to run it. In the longer run, we want to set up an Ambedkar Centre – which was also one of Dr. Ambedkar’s goal – in all districts which will help those interested in research.”", 
    "section": "national", 
    "title": "After completing 19 years, Dalit Murasu still marches on", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}