{
    "author": [
        "S Prasad"
    ], 
    "text": "The All India Mahila Congress general secretary welcomes DMK-Congress alliance\n\nThe All India Mahila Congress general secretary Nagma has charged the ruling AINRC Government of resorting to frequent open market borrowing increasing the debt burden on the people.\n\nTerming the government a total failure, she said the government had mobilised funds to the tune of Rs.7,000 crore by resorting to frequent open market borrowings. People are now reeling under the debt burden, she told reporters here on Thursday.\n\nAccusing the AINRC Government of adopting anti-people measures, she said that Chief Minister N. Rangasamy had failed to take any steps to get the waiver of accumulated loans due from the Union Territory to the Centre.\n\nThe government was trying to hoodwink people by distributing freebies. The NDA Government was also not concerned about the welfare of the people and Puducherry has been left out of the Smart city scheme.\n\nShe alleged that the poor functioning of the Tamil Nadu Government in the context of the last year floods came to the fore by the way the government handled the situation.\n\nMs. Nagma alleged that the Centre was freezing all the welfare and progressive measures brought in by the previous United Progressive Alliance (UPA) Government.\n\nReplying to a question she said that the AICC president Sonia Gandhi had intention to accord prominence to women to contest the forthcoming elections in Tamil Nadu and Puducherry.\n\nThe Mahila Congress played a big role during the Bihar polls.\n\nIf the Congress had a number of women candidates in Bihar why could not the party do the same in Puducherry and Tamil Nadu, she asked.\n\nThe Mahila Congress will also urge the high command to ensure that women were given adequate opportunities to fight the forthcoming elections.\n\nShe welcomed the formation of the DMK-Congress alliance and said the alliance would emerge victorious in the elections.", 
    "section": "national", 
    "title": "AINRC govt. a total failure, says Nagma", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}