{
    "author": [], 
    "text": "RELIGION\n\nBhagavatham: Narayanan, Asthika Samajam, Venus Colony I St., Alwarpet, 6-30 p.m.; B.Sundar Kumar, The Madras Sanskrit College, Mylapore, 6-30 p.m.\n\nSankara Uvaacha-Vishnu Sahasranamam: Sudha Seshayyan, Sri Krishna Gana Sabha, T.Nagar, 6-30 p.m.\n\nDharma Prachara Parishath: Narayana Vasudeva Yatheendhra Mahadhesika Jeeyar, TTD Information Centre-cum-Temple, Venkatanarayana Road, Thyagaraya Nagar, 6 p.m.\n\nThirukural and Manimegalai: K. Venkatesan, Kanchi Shri Krishna College of Arts and Science, Kilambi, Kancheepuram, 11 a.m.\n\nUlloli: A. Nagalingam, Sri Balasubramaniam Baktha Jana Sabha, TTK Salai, Royapettah, 6-30 p.m.\n\nThe Fall of Human Intellect: R.Aravindan, The Court Yard, Pycrofts Garden Road, Nungambakkam, 6-30 a.m.\n\nVivarana Prameya Sangraham: R.Mani Dravid, Sri Sankara Gurukulam: C.P. Ramaswamy Street, Abhiramapuram, 5 p.m.\n\nCULTURE\n\nMadras Christian College: Media-Fest 2016, ‘EU-Kinoteka, A European Film Fest’, Tambaram, 2 p.m.\n\nOrganising Committee: Inauguration of Rajasthan Grameen Mela, Valluvar Kottam, 12-15 p.m.\n\nSri Krishna Sweets: Programme to recognise extraordinary mothers, ‘Salute Mothers’, The Music Academy, T.T.K. Road, 5-30 p.m.\n\nGENERAL\n\nCREDAI Chennai: Inauguration of ‘Fairpro 2016’, Chennai Trade Centre, Nandambakkam, 9-30 a.m.\n\nRajiv Gandhi National Institute of Youth Development: Lecture, ‘Social Inclusion and Social Justice’, Sriperumbudur, 4-15 p.m.\n\nThe Society of Auditors: B.B. Naidu study circle meeting, Luz Church Road, Mylapore, 6 p.m.\n\nLITCON 2016 — Conference on IP Litigation: Hotel Taj Club House, 10 a.m.\n\nMAR Gregorios College of Arts and Science: Graduation day ceremony, Mogappair West, 4 p.m.\n\nPachaiyappa’s College: Two-day workshop, ‘Pacific White Shrimp, Litopenaeus vannamei – Seed production techniques’, E.V.R. Periyar High Road, 9 a.m.\n\nSRM University: National-level technical symposium and project exhibition, Ramapuram, 9 a.m.\n\nValliammal Matriculation Higher Secondary School: Annual day celebrations, Anna Nagar East, 4 p.m.\n\nSaveetha School of Law, Saveetha University: Valedictory function of ‘Frames 2016’, Poonamallee High Road, 10-30 a.m.\n\nRotaract Club of Loyola College: Clean up event, Child Hospital, Egmore, 2 p.m.\n\nValliammai Engineering College: Workshop on ‘Geometric Dimensioning and Tolerances’, SRM Nagar, Kattankulathur, 2 p.m.\n\nDeaf Enabled Foundation: Deaf children mela, Dr.MGR Janaki College of Arts and Science, R.A.Puram, 9-30 a.m.\n\nNarcotics Anonymous: Meeting, Sangarsh Group, Fatima Church, United India Colony, Kodambakkam, 7 p.m.\n\nAl-Anon: Meetings, Sinagaram Pillai Boys HSS., Villivakkam; A.G. Church, Sivagamipuram, Thiruvanmiyur; Madhurai Siddha Ayurveda Nilayam, Avadi; CSI Emmanuel Church, Vadapalani; and Kevin School, Royapuram, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Kevin School, Royapuram; Singaram Pillai Boys HSS., Villivakkam, Kesari HSS., T. Nagar; C.S.I. Zion Church School, Chintadripet; Assembly of God’s Church, 100 Ft. Rd., Arumbakkam; St. Fathima Church, Velachery Rd., East Tambaram; Magadalona Mariyal Church, Ezhil Nagar, Poonamallee; C.S.I. Peters Church, Vyasarpadi; A.G. Church, Sivagamipuram, Thiruvanmiyur; St. Soosai Church, Ennore; Madurai Siddha Ayurvedha Maruthuva Nilayam, Avadi; and Corporation PHC Adambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}