{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kuppuswamy died of natural causes, says Minister in the Assembly\n\nA member of a disability rights group, who took part in a protest on Wednesday, died early on Thursday morning at the Government Royapettah Hospital.\n\nAccording to B. Radhakrishnan, another protester, E. Kuppuswamy (67), who was hearing-impaired, was a member of the Tamil Nadu Association for the Rights of All Types of Differently Abled and Caregivers. “He had arrived from his hometown on Wednesday morning. We had all been detained by the police in three different locations and then brought to Rajarathinam stadium in Egmore. Around 7 p.m., he said he had a headache, and went to sleep,” Mr. Radhakrishnan said.\n\nAround 9 p.m., when dinner arrived, other protesters attempted to wake him up, but he seemed to be unconscious and his limbs were jerking, said Mr. Radhakrishnan.\n\n“There were no medical facilities at the stadium. We rushed him in a police jeep to the Government Royapettah Hospital where he was admitted around 10 p.m. He was bleeding from the mouth by then. We were told he died around 4 a.m.,” said Mr. Radhakrishnan.\n\nA senior official at the Government Royapettah Hospital said, “He was brought in unconscious, with blood vomiting. He had low blood pressure. Blood tests were performed and he was given a transfusion as well. Around 4 a.m., the blood vomiting began again. He died of haematemesis with aspiration and hypovolemic shock, possibly due to a pre-existing condition,” the official said.\n\nMinister responds\n\nSocial Welfare Minister Valarmathi, in response to a question in the Assembly, said the protestors were detained by the police and were let off later in the evening. Mr. Kuppuswamy had died of natural causes, she added.\n\nNative of Vellore district\n\nA native of Madhanur in Vellore district, Mr. Kuppuswamy had two sons and three daughters. He had been living with another physically disabled person, K. Veerapandian, in Gandhi Nagar for the last five to six years.\n\n“He had come to take part in the protest as he felt that the monthly assistance of Rs. 1,000 was inadequate for persons with disabilities,” Mr. Veerapandian said.\n\nHe added that it was Kuppuswamy who was helping him out in household work all these years. Nearly 20 people from Vellore had taken part in the protest.\n\nTwo other protesters have been admitted to the Government Royapettah Hospital. According to Mr. Nambu Rajan, State General Secretary, Tamil Nadu Association for the Rights of All Types of Differently Abled and Caregivers, Rajaram, another member of the organisation from a village near Chinna Salem was admitted with high temperature around 2 a.m. on Thursday morning.\n\nK. Prabhu, a member of the December 3 Movement, was admitted around 3 p.m. on Thursday after suffering a fit, said T.M.N. Deepak, State president of the movement. The hospital official said both patients were in stable condition.\n\nProtest to continue\n\nMr. Deepak said the police had asked them to leave the stadium but about 400 members continued their protest.\n\nFour organisations working for disability rights are involved in the protest, which was re-started on Wednesday, one of the members said. “We held protests for two days earlier in the month, and then after a meeting with the Chief Secretary, decided to wait until the Assembly session began. But our demands have not been taken into consideration in the Interim Budget and so we re-started our protest,” Mr. Nambu Rajan said.", 
    "section": "national", 
    "title": "Disability rights protester dies, two others in hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}