{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Dravida Munnetra Kazhagam (DMK) Treasurer M.K. Stalin is learnt to have instructed local office bearers of the party in the Union Territory to begin talks with leaders of Puducherry Congress Committee shortly on seat-sharing and identifying winning constituencies.\n\nFollowing the meeting of senior Congress leader Ghulam Nabi Azad and DMK president M. Karunanidhi last Saturday, the alliance between two parties was firmed up in Tamil Nadu and Union Territory of Puducherry. According to sources, the seat sharing talks between two parties has already commenced among the party leaders.\n\nIn the UT, the Congress will be heading the alliance.\n\nDMK treasurer M.K. Stalin held discussions with the office bearers of DMK Puducherry unit including former Minister and convener (north) S.P. Sivakumar and former MLA and convener (south) R. Siva and others.\n\nMr. Sivakumar told The Hindu , “Our party leader discussed with us the prevailing political situation in UT and has issued certain instructions on how the party unit should go about the forthcoming elections. We will act accordingly as per the direction of the party leader.”\n\nHowever sources added that the parties are scheduled to commence the first round of preliminary level talks on seat sharing in the UT shortly.\n\nThe parties are likely to contest more or less the same number of seats which were contested during 2011 Assembly polls.\n\nDuring 2011 Assembly polls, Congress- DMK alliance won nine seats. Congress had contested in 17 constituencies while its alliance partner DMK in 13 constituencies.\n\nAt present, Congress has seven MLAs- V. Vaithilingam representing Kamaraj Nagar constituency , E. Valsaraj- Mahe, Theni C. Djeaucoumar- Mangalam, K. Lakshiminarayan- Rajbhavan, A. Namassivayam- Villianur, P.R.N.Thirumurugan- Karaikal (north) and Malladi Krishna Rao- Yanam.\n\nDMK has two MLAs- A.M.H. Nazeem- Karaikal (south) and Nandha T. Saravanan from Muthialpet.", 
    "section": "national", 
    "title": "DMK, Congress to commence seat-sharing talks", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}