{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Suicides should not be sensationalised in the media, as they could lead to copycat attempts, said Lakshmi Vijayakumar, founder, Sneha Suicide Prevention Centre.\n\nSpeaking at the 30{+t}{+h}anniversary of the centre, Dr. Vijayakumar said suicides had a tendency to spread.\n\n“Suicides should be reported carefully. If possible, there should be no photographs and not many details on how a suicide happened. And, the number of a helpline should be published,” she said, giving the example of copycat incidents after the suicide of a Carnatic singer’s husband from the Kotturpuram bridge.\n\nRecent suicides in the country have also led to this phenomenon, she said.\n\nHighest suicide rate\n\nStating that India had the highest rates of suicide in the world, Dr. Vijayakumar said statistics showed that women between the ages of 14 and 29 and men between the ages of 30 to 49 were the most vulnerable groups. Tamil Nadu, according to National Crime Records Bureau’s 2014 statistics, had the second-highest number of suicides in the country.\n\n“But policy changes can help. For instance, in 2004, after a lot of petitioning, the Tamil Nadu government passed an order allowing students to write supplementary exams if they had failed.\n\n“The number of exam failure-related suicides fell in Chennai from 38 in 2004 to 15 in 2014. In TN, the numbers dropped from 407 in 2004 to 247 in 2014,” she said.\n\nDistancing the method\n\nIn one project, Sneha attempted to tackle suicide through pesticide consumption.\n\n“In two villages, we built a storage system that functioned like bank lockers. Here, all the residents’ pesticide supplies were stored. And we found that suicides dropped considerably — suicides are often impulsive actions, and distancing the method can help,” she said.\n\nOn Sneha’s progress, Dr. Vijayakumar said that over the course of 30 years, the organisation had functioned solely with volunteers and answered around 3,00,000 calls.\n\n“In 30 years, we have worked 365 days of the year, the only exception being one day during the recent floods. In 2006, we became 24x7. We have taken calls from all age groups from 8-year-olds to 80-year-olds,” she said.\n\nWith a population of over 1 billion and only about 5,000 psychiatrists in the country, it was essential to have more mental health initiatives, especially on preventing suicides, she said.\n\nWomen between the ages of 14 and 29 and men between 30 and 49 are the most vulnerable groups", 
    "section": "national", 
    "title": "Don’t sensationalise suicides: Sneha founder", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}