{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Efforts under way to retrieve OSR lands, says Mayor\n\nMany city parks are losing space to commercial buildings that have been constructed illegally.\n\nResidents have been reporting such encroachments on parks to the Greater Chennai Corporation. Every time such a complaint is registered, the structures used to be removed immediately by the officials concerned. The situation seems to be changing now.\n\nOfficials who recently visited a park in Anna Nagar West near Tirumangalam Flyover to remove an illegal commercial structure were prevented from taking action. Senior members of political parties reportedly supported the shopkeeper and even warned the officials against removing the encroachment.\n\n“The shop was closed last year. It opened again two weeks ago. The officials visited the locality but they returned without removing the encroachment. The shop is functioning now,” said a resident of the locality.\n\nAndrews, Corporation councillor of the locality, said that at least two parks in ward 90 had been encroached upon by commercial buildings.\n\n“A shopkeepers claims that he is paying Rs. 25,000 as rent to somebody for using the space. But the shop has been constructed in a park. Yet, officials are unable to take action,” Mr. Andrews said.\n\nSimilar encroachments on parks have been reported from some other wards in Greater Chennai Corporation. The delay in handing over OSR (Open Space Reservation) land to the Corporation has also led to encroachments in the city.\n\n“Parks in most of the wards in the added areas have been encroached upon. OSR lands are not being handed over to the Corporation. The officials have also failed to erect board in such lands,” said councillor P.V. Tamil Selvan.\n\nA meeting with Chennai Metropolitan Development Authority was organised recently to hand over at least 264 pieces of OSR lands to the Corporation.\n\nThe civic body has already constructed more than 200 parks in OSR lands. Mayor Saidai Duraisamy said efforts were on to retrieve OSR lands that had been encroached upon by private players. A Corporation official said the civic body would identify all encroachments on parks and remove them immediately.", 
    "section": "national", 
    "title": "Encroachments eat into parks in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}