{
    "author": [
        "S Sundar"
    ], 
    "text": "Two flyovers which were sanctioned in March 2014 are yet to come up\n\nTwo flyovers that were badly felt at important junctions on Madurai-Tirunelveli four-way – one in front of Virudhunagar Collectorate and the other at Padanthal junction at Sattur – and sanctioned in March 2014, have not come up for the last two years.\n\nWith no trace of commencement of the work on the flyovers, sanctioned at a cost of Rs. 11 crore, the junctions continue to remain dangerous for road-users who cross the highway every day.\n\nThe flyovers did not come up when the four-way project was executed some 10 years back with stiff opposition from local people who feared that their lands would be acquired for the project or their land would lose value as vehicles would by-pass their area.\n\nOnce vehicles started zooming on the wider lanes, the junctions proved more fatal.\n\nAt both the places, Virudhunagar district police have put up barricades to slow down vehicles with a view to avoiding accidents.\n\nPeople cutting across party lines staged several protests demanding flyovers, especially at Padanthal junction, whenever there was a fatal accident.\n\nThe All India Anna Dravida Munnetra Kazhagam too organised a protest in Sattur, in which party treasurer O. Pannerselvam took part, before the AIADMK returned to power. He had then promised to take up the issue once the AIADMK was voted to power.\n\nThe then Virudhunagar MP B. Manicka Tagore (Congress) in March 2014 announced that the then Union Minister for Surface Transport Oscar Fernandez had sanctioned the flyovers. He even had scheduled a bhoomi puja for the projects.\n\nHowever, the puja could not take place since the Parliament election schedule was announced in between.\n\n“The Union Minister had announced it in the interim budget. However, the financial allocation should have been done in the subsequent budget. The Bharatiya Janata Party government had not made the allocation,” Mr. Tagore said.\n\nHe also blamed Union Minister of State for Road Transport and Highways Pon. Radhakrishnan for his failure to take up the projects. “Twenty months have passed and the Minister from Tamil Nadu has not taken a positive step in this regard,” Mr. Tagore added.\n\nPolice have put up barricades to slow down vehicles with a view to avoiding accidents", 
    "section": "national", 
    "title": "Flyovers, a distant dream on four-way", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}