{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“We will take turns to continue the agitation till our demands are fulfilled”\n\nAfter staging picketing agitations and courting arrest for the past five days, Tamil Nadu government employees and noon meal workers who were on an indefinite strike since February 10, changed the mode of the agitation and launched a ‘sit-in dharna’ inside the Collectorate complexes of Ramanathapuram and Sivaganga districts on Thursday.\n\nAbout 1,000 employees, including a large number of noon and anganwadi workers, assembled inside Ramanathapuram Collectorate complex and more than 2,500 employees inside Sivaganga Collectorate complex to launch the “relay sit-in strike”.\n\n“The employees would take turns and continue the agitation till the government conceded the demands,” S. Ganesamoorthy, district secretary, Tamil Nadu Government Employees Association (Ramanathapuram), and S. Kumaresan, district president, Tamil Nadu Rural Development Officers’ Association (Sivaganga), said.\n\nSince they have decided to organise the stir round the clock, a batch of about 500 employees, including women, would stay on Thursday night in the two Collectorate complexes each and they would be replaced by another batch of employees on Friday morning, they said.\n\nAs more and more employees started thronging the Collectorates, the office-bearers of the employee associations erected shamiana tents and made arrangement for cooking their food.\n\nAs the women employees stayed in the complexes the whole day, their family members brought their children to the venues and they spent time with them before leaving in the evening.\n\nDindigul\n\nAt Dindigul Collectorate, the government employees stayed in a tent in the night. Earlier in the morning, they staged a demonstration in front of the Collectorate.\n\nGovernment nurses staged a demonstration in front of Dindigul Government Hospital in support of the government employees.\n\nSimilar demonstration was staged in Theni too.", 
    "section": "national", 
    "title": "Govt staff stage sit-in dharna", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}