{
    "author": [
        "Special Correspondent"
    ], 
    "text": "GENERAL\n\nCodissia – SIDBI Industrial Services: Counselling and Guidance to entrepreneurs, Codissia Conference hall, 3 p.m.\n\nHindusthan Institute of Technology: National Level Technical Symposium, Seminar Hall, 9 a.m.\n\nSankara Educational Institutions: Campaign on “Pledge to Vote”, Fun Republic Mall, 11 a.m.\n\nCoimbatore Institute of Management and Technology: Campus placement pool drive – “The Royal Bank of Scotland”, Auditorium, 10 a.m.\n\nSNS College of Technology: National conference on “Innovations in Communication and Computing”, Seminar hall, 10:30 a.m.\n\nAvinashilingam University: Research convention, 9:45 a.m.; National Conference on “Internet of Things”, Seminar hall, 10 a.m.\n\nCoimbatore Productivity Council: Programme on “First Aid”, 9 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: National level Workshop on “Matlab”, 9 a.m.\n\nPSG Institute of Medical Sciences & Research: Conference on “Academic Emergency Medicine”, Auditorium, 12 p.m.\n\nSri Venkateswara Group of Institutions: National level Management Meet, 8:30 a.m.\n\nConfederation of Indian Industry: National Conference on “Pumps”, The Residency Towers, 9 a.m.\n\nShri Nehru Maha Vidyalaya: College day celebrations, 9:30 a.m.\n\nSNS College of Technology: Conference on “Advancement in Electrical Sciences”, Seminar hall, 9:45 a.m.\n\nKalaivani College of Technology: Summit on “Student Empowerment & Entrepreneurship Development”, 10 a.m.\n\nSasi College of Architecture and Business: Cultural School Fest, 9 a.m.\n\nPSG College of Arts and Science: Celebrating 30 years of Excellence of DBT, GRD Auditorium, 2 p.m.\n\nRathinam College of Arts and Science: Seminar, MBA Hall, 10 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Guest lecture on “Compiler Design”, 10 a.m.\n\nRukmani Kannan Vidyalaya Matriculation Hr. Sec. School: School day function, 5 p.m.\n\nNehru Arts and Science College: Workshop on “Business Analysis in Entrepreneurial Ventures”, Seminar Hall, 10 a.m.\n\nTIRUPUR\n\nAngel College of Engineering: Inauguration of R &D department, 10 a.m.\n\nPALLADAM\n\nProfessional Group of Institutions: Techno-Cultural event for UG students, 9 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}