{
    "author": [
        "M K"
    ], 
    "text": "Citizens can send message, picture, video or audio recording to 81900-00100\n\nPolice Commissioner A. Amalraj (left) launching the whatsApp helpline number at his office in the city on Thursday.— Photo: S. Siva Saravanan.\n\nPeople of Coimbatore City can now report anti-social activities in their locality to the police round the clock through WhatsApp by sending message, picture, video or audio recording to the helpline number ‘81900-00100’.\n\nAll you have to do is add this number to your contact list.\n\nThis opens up another channel of communication for people with the police.\n\nCity Police Commissioner A. Amalraj launched the service at his office here on Thursday. It is sponsored by telecom network service provider Idea as part of their corporate social responsibility activities. The number will be monitored at the police control room.\n\nThe anti-social activities and issues, if any, that affected the public are not taken to the notice of the police by many because of the fear that they could be exposed to mischief mongers, or could be harassed by the police by asking them to come to the station for an inquiry.\n\nThe WhatsApp helpline initiative is part of the efforts taken by the police to reach out to the public and making grievances redress and receiving information easier.\n\n“The personnel at the control room will refer the issues to the police station or officer concerned. While confidentiality will be maintained over identity of the person who shared the information, the police will also reply to the complainant on the action taken on the complaint,” the Police Commissioner said.\n\nMr. Amalraj said that right now they were trying to address issues that could be taken up by the police. “We will soon discuss with the Collector and the Corporation officials to study the possibility of receiving complaints pertaining to other departments and share it with the officials and get them redressed,” he added.\n\nA senior police official here said that a similar WhatsApp initiative was launched by the police in Kerala, Bengaluru, Hyderabad and a few other places where the effort yielded benefits to the public and the police as well.", 
    "section": "national", 
    "title": "Inform police about anti-social activities through WhatsApp", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}