{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise) Students of Aikiyam School learn dance from Bill Vanaver and Livia Drapkin Vanaver of The Vanaver Caravan, a professional dance company and pioneers in Art Education Programme from the United States, at the school in Auroville near Puducherry. Bhargavi and Ajith Kumar, students of the school, who practised South African Gumboot Dance. Students put up a chart in the classroom on why they dance.— Photos: T. Singaravelou\n\nAikiyam School students take creative lessons from co-founders of The Vanaver Caravan\n\nChildren in their school uniform shook tambourine and danced with partners as Bill Vanaver played Banjo and Livia Drapkin Vanaver choreographed the Sicilian (Italy) Tarantella Dance inside a UFO-modelled classroom at Aikiyam School.\n\nAikiyam School in New Creation Learning is a day school under the Auroville Outreach School Board of the Sri Aurobindo International Institute of Educational Research (SAIIER).The curriculum includes all of the standard academic subjects as well as art, music, dancing, physical education, computer education, carpentry and craft. Bill and Livia, co-founders of The Vanaver Caravan, a professional dance company and pioneers in Art Education Programme from United States, introduced the students to the multi-cultural music, song and dance.\n\nThey have been practising for the past two weeks to perform in Auroville on Friday. “Musical instruments like Banjo, drums and 12-string guitar will be played live as the children dance,” said Bill Vanaver.\n\nHe added: “From a welcome dance from West Africa to Chinese Festival Ribbon Dance, the children will also perform South African Gumboot Dance, Brazilian Martial Art Dance - Maculele, Sicilian Tarantella Dance (Italy), Virginia Reel, American Clog Dance and Nigerian dance that describes all the planting cycle.”\n\nVanaver Caravan has been working with students in US for the past 40 years and four years in North India. “It is the first time, we are teaching students here in Auroville,” he said.\n\nAt least 100 students from III to VIII grade in Aikiyam School were taught history of different countries and culture through dance and music.\n\n“Education is not only providing information but it is about developing curiosity, learning to be creative, expanding the horizon and building bond with society,” said Livia. She performs traditional dance and music from many cultures.\n\nShe added that the first exercise we gave the children was to question them why people dance. “It is for happiness, express joy, show talent, relax our body, to be together, to make friends, to make others happy, be united,” wrote the students on a chart that was displayed in the classroom.\n\nLivia said: “We talk about why people dance and the children give us the answers. Later, we explain the history and the origin of different dance before we start practice. This introduces them to the history and culture of countries across the world.”\n\nBill added: “Some people call it ‘out of textbook’ learning.” The dance workshop that began at 9 a.m. ended with South African Gumboot Dance performed by the eighth grade students of the school in the evening.\n\nAikiyam School principal Shankar said that students studying here hail from the economically poor families from nearby villages of Auroville like Periya Mudaliar Chavadi to Edayanchavadi. Bhargavi from Bharathi Nagar near Auroville, who is studying eighth grade, said: “This South African Gumboot Dance is a code dance.”\n\nHer classmates Ajith Kumar added that it was a code dance of miners who worked in the gold and diamond mines in South Africa. The workshop has indeed been successful in teaching them history through the prism of dance forms.\n\nThe Varaven Caravan team will also conduct a workshop with the government school teachers at Junior Technical School at Lawspet on Sunday organized by the Aikiyam School in association with Azim Premji Foundation.", 
    "section": "national", 
    "title": "Learning through dance and music", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}