{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Left parties on Thursday asked the State government to negotiate with its employees to find a solution to end their indefinite strike.\n\nDuring the discussion on the budget, CPI (M) member K. Balabharathy said the Chief Minister had earlier informed the House that her government had fulfilled all the electoral promises but two promises were yet to be fulfilled because of which lakhs of government employees were on a strike.\n\nIt was due to the efficiency of the government employees that the revenue had increased in the past five years but employees of 53 departments were protesting.\n\n“It is not clear what the government is thinking. We have been expecting an announcement from the government for the past few days,” she said.\n\nThe government should hold negotiations with its employees and bring the strike to an end as the school final exams and elections were approaching, she pointed out. CPI MLA S. Gunasekaran also raised the issue.\n\n20-point charter of demands\n\nThe government staff are pressing for implementation of a 20-point charter of demands, including scrapping of new pension scheme.\n\nPraise for volunteers\n\nBoth the MLAs were appreciative of the voluntarism during the Chennai floods when the humane face of the city was on show with thousands of youth taking up relief and rescue work.\n\nThe treasury benches intervened quite often to record the tremendous rescue work undertaken by the government machinery on the orders of Chief Minister Jayalalithaa.\n\nWhile Social Welfare Minister B. Valarmathi said normality returned in three days, Handlooms Minister Gokula Indira said that people knew well who protected them during the floods.\n\nMr. Gunasekaran, however, asked the government to learn a lesson so that the calamity was not repeated. He charged that the poor encroaching the water bodies were being removed while the rich were let off by the government.\n\nAnnouncement soon\n\nFinance Minister O. Panneerselvam told the Assembly that an announcement on Athikadavu–Avanashi water recharge scheme would be made soon.\n\nWhen the Left parties raised the issue, they were told that the project was listed in the budget, but when they persisted with the demand for a notification in the gazette as it has been promised by both the Dravidian parties for nearly five decades, the Minister said an announcement would be made soon.\n\nThey are on strike as the CM has not yet fulfilled her promises, says Balabharathy", 
    "section": "national", 
    "title": "Left asks govt to talk to striking staff", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}