{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: ‘Tiruvarutpa Agaval’ parayanam, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: Discourse on ‘Tiruvilayadalpuranam’ by N. S. Sundararaman, Old Kalyana Mandapam, 5 p.m.; Abirami Anthathi parayanam, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tirukkuralum Saiva Neriyum’ by S. Kunjithapatham, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Avvai Kural’ by A. K. S. Tirumavalavan, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nRamana Kendram: Ramana Sahasranamam and discourse by Kalarani Rengasamy, 11 Chokkappa Naicker Street, 6 p.m.\n\nRamakrishna Mutt: Yoga class, 6 a.m.; aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nEzhuthu: Discussion on Vetrimaran’s film Visaranai, Tamil Nadu Theological Seminary, Arasaradi, 5.05 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: A. Muthumanikam, Registrar, inaugurates international seminar on ‘Religious conflicts and construction of harmony in literature: a philosophical perspective;’ R. Venkatraman, former Head, Department of Art History, addresses; S. Andiappan, Chairperson, School of Religions, Philosophy and Humanist Thought, presides, 10.15 a.m.\n\nThiagarajar College: Orientation programme on ‘Higher education - quality, evaluation, sustenance and enhancement for excellence;’ M. Eyini, Principal, presides, 11 a.m.\n\nThiagarajar College of Preceptors: Citizenship training camp, C. Nallakrishnan, Administrative Officer, delivers valedictory address, Teppakulam, 10 a.m.\n\nLady Doak College: A. Muthukrishnan of Green Walk inaugurates ‘Phyxplosion’16,’ inter-collegiate physics meet, J. X. Miller Auditorium, 9.30 a.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, Kallampatti, 2.30 p.m.\n\nMangayarkarasi College of Arts and Science for Women: Entrepreneurship development programme, Lakshmi speaks, Paravai, 10 a.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: National seminar on ‘Emerging trends in computing technologies;’ M. Aramudhan of Perunthalaivar Kamarajar Institute of Engineering and Technology addresses; K. A. Chidambaram presides, Poovanthi, 10 a.m.\n\nIndian Association for the Blind: 31{+s}{+t}Annual Day; Mridula Ramesh, Joint Managing Director, Southern Roadways, and Subbaraman Balasubramanyan of HCL Technologies address; C. Ramasubramaniam presides, Sundararajanpatti, Alagarkoil Road, 4.30 p.m.\n\nConfederation of Indian Industry: Corporate engagement with Nirmala Sitharaman, Minister of State for Commerce and Industry, Fortune Pandiyan Hotel, 9.30 a.m.\n\nTamil Nadu Chamber of Commerce and Industry: S. Rethinavelu, senior president, inaugurates seminar on ‘Modern weaving and Government of India schemes for powerloom sector;’ T.L. Balakumar, Deputy Director, Regional Office of the Textile Commissioner, addresses; S. Santhakumar, General Manager, District industries Centre, presides, 178 B Kamarajar Salai, 10 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: Sellur K. Raju, Minister for Cooperation, inaugurates 30{+t}{+h}Ideal Home Exhibition; V. V. Rajan Chellappa, Mayor, and K. Veera Raghava Rao, Collector, address; L. Murari presides, Tamukkam Ground, 5 p.m.\n\nKaviarasu Kannadasan Narpani Mandram: Birth anniversary of U.V. Swaminatha Iyer; R. Chokkalingam speaks, Chandran presides, 114/2 Tirupparankundram Road, 8.50 a.m.\n\nRotary Club of Madurai West: R. Madhanagopal speaks on ‘Peace and conflict resolution,’ Fortune Pandiyan Hotel, 5.30 p.m.\n\nAlcoholics Anonymous: Meeting, RC School, Sivaganga Road, Melur, 6.30 p.m.; Parasakthi Nagar, Avaniapuram, CSI Church, Narimedu, and Maniammai Nursery School, North Masi Street, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}