{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sub-Collector orders convening of PTA meeting\n\nWith the number of dropouts from schools to which children of gypsies have been admitted rising, Cheranmahadevi Sub-Collector V. Vishnu inspected a school at Kottaiyadi near Valliyoor recently and ordered convening of Parent–Teacher Association meeting on Tuesday next.\n\nAs gypsy children were either begging on the streets of Valliyoor or selling artificial ornaments at public places, efforts were taken in 2011 to rehabilitate them by admitting them to a nearby school. While group of Rotarians sponsored uniforms, books, bags, toothbrushes, paste, etc., to the children, officials persuaded their families to send them to the school.\n\nWhen 48 children from Gypsy Colony at Park Town in Valliyoor were admitted to a government-aided middle school at Kottaiyadi village on June 4, 2011, they easily mingled with other students.\n\nHowever, the number dwindled rapidly as the gypsies refused to send their girl children to the school on attaining puberty. Though the Rotarians and the officials took a lot of steps in breaking this stigma, they could not make much headway.\n\n“The number has come down from 48 to 20,” said Sathyan, a CPI functionary.\n\nWhen Mr. Vishnu, who had conducted a comprehensive study on the life of Valliyoor gypsies when he was working as Assistant Collector (Training) in Kanyakumari, came to the colony on Tuesday to distribute freebies, he happened to see a good number of children wandering there.\n\nImmediately, he went to the school at Kottaiyadi and interacted with the children to ascertain the reasons behind many dropping out of the school.\n\nAs most of his questions to the headmaster and those who are affiliated to the NGO which has been entrusted with the task of rehabilitating the gypsy children failed to evoke proper replies, he told them that a Parent–Teacher Association meeting should be organised in the school so as to bring the gypsy children back to school.\n\nMr. Vishnu also visited the kitchen and tasted the ‘sundal’ being prepared for the children. “The ‘sundal’ should have been distributed to them by 4 p.m. Now it’s 5.30 p.m. Don’t try to violate rules,” he told the headmaster.\n\nHe went back to the Gypsy Colony and told the heads of families to be present at the school on Tuesday for an interaction with him.\n\nGives away freebies\n\nFree mixer grinders, fans and wet grinders were given to 87 families of the Park Town Gypsy Colony. Based on a petition the gypsies submitted to Collector M. Karunakaran on Monday while he was about to leave the Collectorate after the weekly grievance day meeting, the freebies were distributed the following day itself.\n\nMr. Vishnu, who handed over the freebies, asked them not to sell them. “If it is found that you sold them, I’ll recommend to the Collector to cancel your ration cards,” he told them.", 
    "section": "national", 
    "title": "Many gypsy children drop out of school", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}