{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Vadakkipalayam police arrested three men of the locality on Thursday for intimidating a 17-year-old girl and raping her during the wee hours of Monday. The incident that took place about 200 m away from the police station came to light only on Wednesday.\n\nThe police said that the girl was frightened of the consequences of the incident and failed to disclose it to anyone. However, in the late hours of Wednesday, she lodged a police complaint with the help of her husband, a daily wager.\n\nThe accused A. Karuppasamy alias Anandhan (22), M. Thirumoorthy of South Colony and R. Manikandan (26) of Puthu Colony also work as daily wagers.\n\nThe victim got married against the interest of her parents about eight months ago.\n\nAccording to the police, the couple lived in a house that did not have a bathroom. The girl went to a relative’s house nearby for bathing.\n\nOn Sunday morning, Manikandan, a neighbour of the relative, told the girl that he took a video of her bathing on a mobile phone and asked her to obey him.\n\nFailing which, he threatened to circulate the video in the social media.\n\nAround 1.30 a.m. the next day, the trio threw stones at her house and signalled her to come out of the house while her husband was still inside. They promised to give her the video, but closed her mouth and took her behind her house.\n\nKaruppasamy raped her with the help of the two others.\n\nInquiries revealed that the trio abandoned her and fled when the street light that was not lit for sometime turned on.\n\nThe police also learnt that the accused did not take any video and lied to instil fear in the girl and make her compromise.\n\nThe accused were booked under sections 3(a) and 4, read with 16 and 17 of the Protection of Children from Sexual Offences Act. They were arrested on Thursday and lodged in the Coimbatore Central Prison under judicial custody.\n\nThe police said that the girl would be subjected to tests for substantiating her complaint.", 
    "section": "national", 
    "title": "Minor girl raped; three held", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}