{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The government-owned Puducherry Tourism Development Corporation (PTDC) has signed a Memorandum of Understanding (MoU) with Parveen Holidays Private Limited to operate tour packages to Tirupati and Shirdi.\n\nChief Minister N. Rangasamy will flag off the Puducherry-Tirupati trip on February 26, Tourism Minister P. Rajavelu told reporters here on Thursday.\n\nThe packages are organised as part of the government’s efforts to promote tourism. The government will get a revenue share of 7.5 per cent for the packages as per the agreement with Praveen Holidays.\n\nInitially, the trip to Tirupati will be held on Monday, Wednesday and Friday in a 40-seat air-conditioned bus.\n\nThe package has been designed in such a manner to help the devotees return to Puducherry in a day after having a darshan at Tirupati. The trip to Shirdi will depend on flight connectivity from Chennai to Puducherry.\n\nAs many as 25 seats are available for the Shirdi tour and tourists will be taken by road till Chennai and by flight to Pune, Mr. Rajavelu said.\n\nParveen Holidays Private Limited will take care of all requirements, including accommodation and darshan.\n\nIt will be a complete package and include breakfast.\n\nThe packages will be extended to domestic tourist destinations and hill stations in the near future, Mohammed Ameen Afzal, Managing Director of Parveen Holidays, said.\n\nMr. Rajavelu said that road shows would be held by PTDC across the country and abroad to bring to focus tourism in Puducherry.\n\nA training programme would also be conducted to cover staff of travel agencies in association with Parveen Holidays to increase the arrival of tourists.\n\nOn resumption of flight connectivity from the Puducherry Airport, Mr. Rajavelu said that a private operator, Trujet, had evinced interest in operating flights from the airport here. The government was in touch with private operators and services would materialise soon, he said.", 
    "section": "national", 
    "title": "New tour packages to Tirupati, Shirdi", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}