{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "“Inability of people to deal with ego issues leads them to feeling tortured by their spouse or boss”\n\nRelieving stress in the workplace was the focus of a workshop conducted by the local chapter of Madras Management Association (MMA) in the city on Thursday.\n\nMotivational speaker and training consultant S.N.Padmaja conducted the workshop. Delegates representing local engineering and healthcare companies in Tiruchi attended the event which included lectures and personality development exercises, designed to create coping mechanisms among the participants.\n\n“Though we are more aware of physical fitness these days, and have any number of gyms coming up in every city, we are less aware of mental health problems,” Ms. Padmaja told The Hindu . “This is the reason why we are facing issues like a rising divorce rate, relationship stress and lack of productivity in the workplace,” she added.\n\nOne’s outlook about the past and future would improve vastly if one lived each moment with ‘mindfulness’, said Ms. Padmaja, who works under the banner Victory Insights. She said that very often it was the workers who chose to prioritise earning more money who were vulnerable to getting stressed. “If a couple really cares for each other’s happiness, would the partners really work double shifts? I think anybody can be happy in any situation provided they are willing to take responsibility for their decision and know what to prioritise in their life,” said Ms. Padmaja.\n\nVisual, auditory and kinaesthetic coping mechanisms were already in place in the pre-industrialised lifestyle, said the consultant. “We had worship routines, a more natural diet and ritual fasting which used to keep us detoxified earlier. Now this has been replaced by lifestyle changes and bizarre timings at the workplace. The inability of people to deal with ego issues leads them to feeling tortured by their spouse or boss,” said Ms. Padmaja.\n\nSwarnalatha Sukumaran, who works in the staff learning and development department of a leading group of hospitals, said that attending the workshop had been very useful from a trainer’s point of view. “Working in the healthcare industry can be stressful, because we are constantly dealing with intense grief, disease and death every day. Getting out of that high-stress environment is essential for healthcare workers,” she said.\n\nWorkshop on stress management has become essential because the emerging generation of workers is lagging behind in both skills and emotional maturity, said V. Prakash, manager – marketing/chapters, Madras Management Association. “Mental health problems can lead to extreme acts of violence, which is why such issues must be constantly discussed in public,” he said.", 
    "section": "national", 
    "title": "No need for stress in workplace", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}