{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Nurses attached to the Dharmapuri Medical College Hospital abstained from work and joined the ongoing statewide protest called by government employees here on Thursday.\n\nThe protesters called for regularisation of the pay roll of nurses appointed on ad-hoc basis and those have completed six years of service.\n\nPension scheme\n\nThe protesters also called for dropping of the new contributory pension scheme and reversal to the status quo in the pension scheme.\n\nAmong the demands included service recognition of contract nurses and provision of promotion based on the years of work put in.\n\nThe Tamil Nadu Nurses’ Association has also proposed to take the strike to the next level if their demands are not met at the earliest.\n\nSalem Staff Reporter adds:\n\nThe indefinite strike by government employees has affected the public at large as the police erected barricades at the entrance of the Collectorate and prevented the entry of the protestors.\n\nThis affected the public who came to the Collectorate as the police verified their identification cards and allowed them to enter the premises.\n\nThe protesting employees assembled in large numbers in Nattamai Kazhagam building premises in the morning.\n\nAbout 50 employees wanted them to be permitted to meet the Collector which was denied by the police.\n\nBarricades\n\nA team led by Deputy Commissioner of Police (Law and Order) S. Selvaraj, and Assistant Commissioner of Police Ravindran erected barricades outside the Collectorate.\n\nAs the employees assembled in front of the Collectorate, the public faced inconvenience in entering the premises.\n\nSlogans raised\n\nProtestors raised slogans demanding that the Collector invite them for talks and fulfil their 20-point demands. Many people who came to the Collectorate for getting various works done have to leave the premises due to the protest.", 
    "section": "national", 
    "title": "Nurses join strike in Dharmapuri district", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}