{
    "author": [
        "Deepa H"
    ], 
    "text": "LPG consumers in the State have begun receiving text messages from oil companies asking them to give up subsidy if their or spouse’s annual income is more than Rs. 10 lakh. Recently, the Oil Ministry had announced that the subsidy for such households will be withdrawn.\n\n“Consumers are being asked to voluntarily declare if their income is above the limit and submit a self declaration to that effect. The forms are being sent to the distributors,” said an oil industry source. There are 1.65 crore LPG consumers and about 26 lakh income tax assesses in Tamil Nadu. The oil companies already have income tax data and bank account details for a small portion of consumers. “We will wait and see if they come forward on a voluntary basis to declare. Otherwise, we will stop the subsidy,” the official said.\n\nDistributors said the SMS messages are just being sent out and consumers were asking them what they have to do now. “We have no means of cross-checking what they say. If their declaration says they don’t earn more, we have to accept it. Some consumers are as usual ignoring the messages,” said a distributor. Consumers can also go towww.mylpg.inand make the self-declaration.\n\nBesant Nagar resident S. Ramakrishnan, who has received the message, said he cannot afford to give up the subsidy. “I am not comfortable disclosing my income to an outsider. Last year the government made us provide bank details so that they can deposit subsidy and in just six months they want to withdraw it. The previous exercise of submitting bank documents and linking it with LPG IDs seems wasted,” he said.\n\nMany said that this was another exercise to force consumers to give up subsidy, which was not fair. The government should first ask elected representatives and IAS officers to give up subsidy before asking the common man, they said. Oil companies have for the past few months been asking Aadhar card details from LPG consumers.\n\nOf the 48.50 lakh consumers in Chennai, Tiruvallur, Kancheepuram, Vellore and Tiruvannamalai districts, 27.82 lakh have provided the details. Similarly, in the State 95 lakh consumers have provided Aadhar card details. “The companies are pressurising us to get the details by month end. But many consumers say they don’t have the cards as yet,” said another distributor.\n\nConsumers can also go towww.mylpg.inand make the\n\nself-declaration", 
    "section": "national", 
    "title": "Oil firms want LPG consumers to give up subsidy voluntarily", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}