{
    "author": [
        "B Kolappan"
    ], 
    "text": "Denying the allegation that the PMK would take refuge in casteism whenever its core constituency – the Vanniyar base – was threatened, the party’s Chief Ministerial candidate Anbumani Ramadoss said his party had never been against the Dalits, but only opposed Viduthalai Chiruthaikal Katchi (VCK) leader Thol. Thirumavalavan.\n\nIn a conversation with the editorial team of The Hindu , he said there was a deliberate attempt to portray his party as a caste outfit after it decided not to align either with the DMK or the AIADMK post 2011 Assembly polls.\n\n“If we are a casteist outfit why did the DMK and the AIADMK align with us in earlier occasions. They are targeting us because they are jealous of our growth. We oppose Thirumavalavan as a political entity. He cannot seek to represent all sections of Dalits,” he said.\n\nMr. Anbumani said the PMK was open to an alliance with all political parties, including the BJP, except the DMK and the AIADMK, but made it clear that PMK would be the leader of the alliance.\n\n“When we say we will lead the front, the issue of my being the Chief Minister candidate also comes with it,” he said when asked whether the issue of his Chief Ministerial candidate was negotiable.\n\nReiterating that no incumbent regime was elected to power in Tamil Nadu in the last 30 years, Mr. Anbumani said Tamil Nadu voters never voted with a view to electing a political party to power. “Instead they vote against someone and by default someone else is elected to power.\n\nThe DMK is at its lowest ebb now and cannot be the party that will benefit from people wanting to vote out the AIADMK,” he said.\n\nMr. Anbumani said for years now the AIADMK and the DMK were clever enough to prevent the formation of a viable alternative, a third front in the state. “They did not want to leave anyone from the alliance they form. One exception was Mr. Vijayakant. Even the nine per cent vote polled by his party was not actually for Mr. Vijayakant, but for a change,” he said.\n\nThough he made it clear that if elected to power the PMK would abolish freebies, alcohol and corruption, Mr. Anbumani said freebies and grants in agriculture would continue. “Freebies like mixers and grinders might have added a total of Rs 12,000 to the income of a family. But through quality healthcare and education, I could save Rs. 5 lakh for a family in five years. I have convinced people about my concept,” he said.\n\nPromising to give up all the pompousness associated with politics and expressing his desire to become a simple and accessible Chief Minister, Mr. Anbumani said he could overcome the loss expected to be caused by prohibition by better management of sand mining, granite quarrying, beach sand mining and by doing away with freebies.\n\nHe also proposed to completely eliminate corruption in the bureaucracy and ruling political class in the State, promising to step down if he is unable to fulfil his promises in two years.", 
    "section": "national", 
    "title": "PMK does not take refuge in casteism, says Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}