{
    "author": [
        "D Madhavan"
    ], 
    "text": "Residents of Tiruvallur district, who had migrated to city, return to cultivate paddy this season\n\nBehind a seven-foot-high brick compound wall with iron grill gates, 42-year-old S. Kathiresan, a marginal farmer from Vada Madurai village near Avadi on the Chennai-Periyapalayam High Road, is tilling his ten hectares of farmland. He will be cultivating paddy till March.\n\nThe compound wall and the grill gates are evidence of what he wanted to do with his farmland.\n\nDue to continuous drought in Tiruvallur district from 2010-11, he had incurred heavy debts and was going to make housing plots of his agriculture land.\n\nFour days of heavy rains that lashed Chennai, Tiruvallur and Kancheepuram in early December 2015 has stopped Kathiresan from going ahead with the plan.\n\nNow, Kathiresan has made a comeback as a farmer.\n\n“The paddy field is my ancestral property. I learnt farming from my father on the same soil that I cultivate now. Last year’s abundant rain saved my land,” Kathiresan said.\n\nKathiresan is not the only one to have taken a decision to go back to farming. Many other farmers in Tiruvallur district, especially in the tail-end areas of water bodies in the district, are now once again engaging in paddy cultivation.\n\nAt present, paddy cultivation is the main agricultural activity in the Tiruvallur district.\n\nIt accounts for more than 80 per cent of net cultivatable area in Tiruvallur district. In other words, of a total of 1.44 lakh hectares of cultivable land (where pulses, oil seeds and sugarcane are also cultivated) in the district, paddy is cultivated in around 1.15 lakh hectares.\n\nLast year, paddy cultivation accounted for only 96,000 hectares due to deficit rainfall of 32% in the district (only 890 mm were received). The average rainfall in the district every year is 1,152 mm. “As per field reports, there has been a 20 per cent increase in net sown paddy area in Tiruvallur. This is mainly due to last year’s rains that filled most of the waterbodies in the district,” an official with Department of Agriculture told The Hindu.\n\nAgriculture officials said many farmers in the district since 2010 either moved to other jobs or cultivated in small areas due to the drought. As most of crops that are grown are tank-fed and rely on lakes, farmers were badly hit.\n\nThe wells had also gone dry due to lack of outflow from upstream areas.\n\nThe rains in November-December 2015, officials said, have helped many farmers make a comeback. “Many plots in Ponneri, Minjur, Periyapalayam and Red Hills are being ‘reclaimed’ for farming,” said P. Balaji, a real estate dealer in Red Hills.", 
    "section": "national", 
    "title": "Post rains, farming makes a comeback", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}