{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "More than 25,000 terrestrial and migratory birds have flocked to this district during this season for breeding and nesting thanks to the ideal habitats and good storage of water in sanctuaries after the northeast monsoon.\n\nThe arid district, the only district in the State to have five notified bird sanctuaries, continued to be the preferred destination for migratory birds as the forest personnel spotted as many as 44 different species this season during the two-day Tamil Nadu wetland synchronised bird census conducted on February 12 and 13.\n\nInvolving school and college students, bird watchers from ‘Iragugal Naturalists Association’ and volunteers from Goodwill trust, the forest department conducted the survey in the five sanctuaries and seven waterbodies, preferred by terrestrial and migratory birds for breeding and nesting.\n\n“This year the number of birds visiting the district almost doubled,” S. Ganesalingam, Forest Range Officer, who led the census, said. Thanks to the good storage of water in the sanctuaries and select waterbodies, ducks such as Northern pintail, Garganey, Common coot and Eurasian coot arrived in large numbers, he said.\n\nTo attract the winged visitors, the forest department had released 10,000 fingerlings each in Sakkarakottai, Therthangal and Kelaselvanoor sanctuaries and this has paid rich dividends, Mr Ganesalingsm said. Besides, the department had created habitat facilities in the sanctuaries, he added.\n\nAn analysis of the census data revealed that more than 44 species of migratory birds arrived during this season, he said adding a large number of Lesser flamingos flocked the shallow waters in Kothandaramar temple, Muhuntharayar Chathiram in Danushkodi and Valinokkam areas.\n\nMelaselvanoor and Keelaselvanoor sanctuaries attracted the largest number of 7,102 birds, followed by Sakkarakottai Kanmai (5,130 birds), Therthangal (4,890 birds) and Big Tank (3,332 birds), he said. More than 6,000 flamingos were sighted in Valinokkam area and 4,352 in Danushkodi area, he added.\n\nThey adopted transect method for surveying the birds and identified fresh water, sea water and brackish water migratory birds. They included pelican, painted stark, open billed stork, white ibis and classy ibis, he said.\n\nThe district continues to be the preferred destination", 
    "section": "national", 
    "title": "Ramnad attracted more birds this year", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}