{
    "author": [
        "R Rajaram"
    ], 
    "text": "The Railway Protection Force (RPF) and the Government Railway Police (GRP) have deployed escort parties on board the special shuttle services being operated by the Southern Railway in connection with the festival.\n\nThey have been working in tandem providing security to ensure that the devotees did not face any difficulty.\n\nThe special security measures were supervised by the Inspector General-cum-Chief Security Commissioner, RPF, Southern Railway, S.C. Parhi, and the Inspector General, Railways, M. Ramasubramani on Thursday.\n\nExpressing satisfaction over the security arrangement, IG Parhi told ‘The Hindu’ on Thursday three to four companies of RPF and Railway Protection Special Force (RPSF) personnel numbering around 300 had been deployed for train escort duty. A batch of personnel from the RPSF has been drawn to augment manpower strength for security duty.\n\nRPF and RPSF personnel have been deployed at various points in Kumbakonam station and in the railway areas.\n\nThe escort teams had been deployed in the special shuttle services that were being operated in connection with the Mahamaham festival from Thanjavur to Mayiladuthurai as well as in some long distance trains, Mr. Parhi said. Surveillance had been enhanced at Kumbakonam station and its vicinity with the deployment of about 50 cameras.\n\nThe RPF has established a temporary control room at Kumbakonam, said IG Parhi who inspected the station twice a few days ago.\n\nIG Ramasubramanian said around 1,500 GRP personnel had been deployed at Kumbakonam and other nearby areas.\n\nAnti-sabotage teams of the GRP armed with necessary paraphernalia had also been pressed into service to shore up the security measure.\n\nThe GRP had set up temporary control rooms at Kumbakonam and nearby stations for faster communication and deployed its personnel for train escort duty in the specials as well, IG Ramasubramanian said.", 
    "section": "national", 
    "title": "RPF, Railway Police put in place detailed security measures", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}