{
    "author": [
        "K Lakshmi"
    ], 
    "text": "With the city continuing to receive loads from faraway districts, prices of river sand have continued to climb in the last two months.\n\nWith the ban on quarrying in Kancheepuram extended for three years and the government yet to allow resumption of mining in Tiruvallur district after last year’s floods, sand lorry operators travel to places like Arcot, Villupuram and even Tiruchi to get sand and meet the demand.\n\nAgainst its requirement of nearly 2.5 lakh cubic feet of river sand a day, the city gets a little over 1.5 lakh cft.\n\n“As there is a lull in construction activity for the past few months, the gap between demand and supply is considerable,” points out V.Rajagopal, general secretary of Tamil Nadu State Sand Lorry Owners Federation.\n\nAt present, lorries get a load comprising three units of sand for Rs.4,000 through ‘second sales’ and it is sold for Rs.12,500 in the open market. “We have been protesting against overloading as it exerts greater strain on truckers who are forced to pay an enormous amount as fine and also have their vehicles seized. Though the government directs to provide only two units per truck, the stockyard will load only a minimum of three units. We are unable to bring down the prices due to increasing transportation costs,” Mr. Rajagopal claimed. With sand deposition on Palar river having gone up after the floods, sand lorry operators are demanding that the ban on quarrying be lifted in Kancheepuram district.\n\n“The price of sand loads can be slashed by half if it can be sourced from neighbouring districts. We now have to travel a minimum distance of 110 km to source sand,” said S. Yuvaraj, the Federation’s president. Members of the Federation want the government to engage in direct sales of sand and switch to online billing to reduce sand prices. Officials of the Public Works Department said sand quarrying in Punnapakkam, Tiruvallur district would resume soon. “We are planning to open a quarry in Vidaiyur soon and are in the process of identifying more sites for sand mining in the district. Measures are being taken to reduce the sand shortage in the city,” said an official.\n\nA leading cement stockist said that after crossing Rs. 400 for a 50-kilogram bag, the price had now come down. A bag of good quality cement was available from Rs. 340 onwards. They expect the trend to continue until Assembly elections are over, but fear that it may escalate after the new government takes charge.\n\nA senior office-bearer of the Builders Association of India’s Chennai office said that with no indication of the government coming down heavily on cartelisation, more builders seemed to be drawn towards alternative material, like Aerated Autoclaved Concrete blocks and gypsum plastering.\n\n(Additional reporting by K. Manikandan)", 
    "section": "national", 
    "title": "Sand prices go up, cement stabilises", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}