{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Gaining momentum:Members of Tamil Nadu Government Employees’ Association staging a protest at Thoothukudi Collectorate; (right) government employees trying to lay a siege to Kanyakumari Collectorate in Nagercoil on Thursday.— Photo: N. Rajesh\n\nGaining momentum:Members of Tamil Nadu Government Employees’ Association staging a protest at Thoothukudi Collectorate; (right) government employees trying to lay a siege to Kanyakumari Collectorate in Nagercoil on Thursday.— Photo: N. Rajesh\n\nThe striking government employees and teachers resorted to a sit-in dharna at the Collectorates of Tirunelveli, Thoothukudi and Kanyakumari districts on Thursday as part of their ongoing strike in support of various demands.\n\nOver 2,000 government employees, primary schoolteachers, nutritious noon meal scheme organisers and workers participated in the agitation in Tirunelveli.\n\nAnticipating a huge turnout, the police closed all the entry points to the Collectorate, where the striking employees were stopped. This led to heated arguments and tension subsided after the police allowed them inside. On entering the Collectorate, the protesters gathered near the Vinayagar Temple and started raising slogans.\n\nOn behalf of the People’s Welfare Front, K.M.A. Nizam of Marumalarchi Dravida Kazhagam served lunch for them. Addressing the protesters, vice-president of Tamil Nadu Government Employees’ Association Kumaravel said the official machinery would get crippled in the days to come if the government was adamant on its stand.\n\nThoothukudi\n\nIn Thoothukudi, scores of State government employees, along with teachers, staged a sit-in protest at the Collectorate. L. Ramamoorthy, district president, TNGEA, who led the agitation, said scrapping of the contributory pension scheme and replacing it with the old scheme and filling up of over two lakh vacancies were among their demands. The agitating employees said that the strike would be withdrawn only when the government conceded their demands. The employees, who had come with utensils, cooked their food at the venue. Paul Abraham, district president, Tamil Nadu Primary School Teachers’ Federation, M. Subramanian, Tamil Nadu Non-Teaching Staff Association, and T. Sekar, district president, Tamil Nadu Post-Graduate Teachers’ Association, participated.\n\nKanyakumari\n\nAs many as 707 members of TNGEA , Tamil Nadu Primary Teachers’ Association and employees of Education department were arrested for attempting to lay a siege to Kanyakumari Collectorate in Nagercoil.\n\nC. R. Rajkumar, district secretary, TNGEA, said that 707 members, including 653 women, courted arrest. The agitation was led by Leedenstone, district president, TNGEA.\n\nOver 100 arrested government employees were continuing their sit-in dharna inside a private marriage hall.\n\nWhen contacted, Superintendent of Police G. Dharmarajan said that the employees were released by the police at 5 p.m.\n\nOver 450 employees left the marriage hall. However, more than 100 employees were continuing the dharna. It was up to the owner of the marriage hall and the employees association to decide on their stay in the hall, he added.", 
    "section": "national", 
    "title": "Sit-in protest by government employees", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}