{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As their plan to stage a sit-in at Collectorate got foiled, they stormed the RDO office\n\nGovernment employees, who are on strike, forced their way into the office of Revenue Divisional Officer (RDO) here on Thursday and started staging a ‘waiting agitation’ there.\n\nGovernment employees jumped on to striking mode on February 10 and they started staging road blockade protests since February 12. After staging four days of road rokos they decided to go in for another form of protest.\n\nOn Monday, employees associations decided to stage sit-ins at the collectorates in the name of ‘waiting agitation’. But the protesters were denied entry into the Collctorate.\n\nSecurity was tightened at Tiruvannamalai District Collectorate and barricades were placed in every entry leading into Collectorate complex. Police allowed every single person into the campus only after thorough checking.\n\nHence the protesters plan of entering the Collectorate for the purpose of a protest was foiled. But they immediately changed their plan and moved towards the RDO’s office. However police was mobilised there too immediately. They closed the gate of RDO’s office and arrested the protesters and forcibly led them into police vehicle. There was altercation between police and protesters. Soon the arrested protesters were all released.\n\nMeanwhile, the protesting employees broke the gate of RDO’s office with big stones and forced their way into the campus. They staged a sit-in agitation there and cooked their lunch within the campus.\n\nS. Parthiban, State vice president, Tamil Nadu Government Employees Association, who was among those participated in the protest told The Hindu that they would be staying in the campus through the night.\n\nAs their plan to stage a sit-in at Collectorate was foiled, they stormed the RDO office", 
    "section": "national", 
    "title": "Staff on strike enter RDO office forcefully", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}