{
    "author": [
        "Staff Reporter"
    ], 
    "text": "People wait for long hours to get petrol at an outlet in Salem on Thursday. —Photo: E. Lakshmi Narayanan\n\nWith the Tamil Nadu Petroleum Dealers Association withdrawing its ‘stop-purchase’ agitation on Thursday evening, re-filling in petrol retail outlets is expected to be completed and normalcy is expected by Friday afternoon.\n\nThere are 360 petrol bunks in the western districts that refused to purchase petrol from the terminal in Sankari for four days.\n\nThe most affected are the outlets in Salem districts that had gone dry on Wednesday and the panic-struck vehicle owners thronging the few petrol pumps in the city.\n\nThe worst affected are the villagers in remote areas as they could not refill the petrol forcing them to skip work or walk for long hours to reach the work place.\n\nIn the city, petrol was available in a few bunks where motorists and other vehicle owners thronged in large numbers.\n\nLong queues can be seen till Thursday evening. Police personnel were posted in the outlets to prevent untoward incidents.\n\nStaff Reporter\n\nadds from Krishnagiri\n\nMotorists were left high and dry hours after petrol bunks had brought out their ‘no stock’ boards much ahead of the petrol dealers strike on Wednesday night here in the town.\n\nUnaware\n\nCaught unaware, vehicle riders were left in the lurch and were seen hunting for stocked petrol bunks. In a desperate attempt to secure fuel, people were seen lining up at bunks up to midnight in the bunks where petrol was still available.\n\nRural taluks were of no exception, where vehicles thronged petrol bunks in areas like Pochampalli until past midnight.\n\nEven as vehicle riders battled to secure petrol for their vehicles, some were seen carrying cans to stock petrol.", 
    "section": "national", 
    "title": "Stir withdrawn: normality in fuel outlets expected by Friday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}