{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Come the first week of March, many students of class 10 and 12 across the city will begin to write their public examinations and many of them have already started keeping away from social media platforms.\n\nS. Janani, a class 12 student said that with less than 15 days left, she had de-activated her Facebook and Instagram accounts temporarily.\n\n“Even if I switch on the laptop to check my email or to look for reference questions, I will not be tempted to spend sometime on these platforms,” she said.\n\nMany parents said they had ensured restricted access to such platforms. Some of them have a clear-cut plan. “During the last leg of the exam preparations, we will be taking away her mobile phone and laptop,” said R. Narayanan, a resident of Mandevali whose daughter is writing the class 12 examinations this year.\n\nOffering support\n\n“While she is attending tuition classes and revising as per the examination schedule, we are letting her be and offering support whenever necessary instead of forcing her to study at a pace she isn’t comfortable with,” he added.\n\nAt Mr. Narayanan’s house as well as several others which have children writing their board exams, cable tv connections have long been terminated.\n\nSaraswathy, whose son is taking up the CBSE Class 12 Board exams, said they had terminated the cable connection at home when he was midway through his eleventh standard.\n\n“Since my son stays up to study during the nights, I too stay awake in case he needs any help.\n\nWhile most children these days prefer to study on their own, a bit of monitoring and encouragement from the parents is all they need,” said Ms Saraswathi, who is a teacher herself.\n\nSharon Rajesh, whose daughter will be taking the class 10 Matriculation Board examinations too admitted that Whatsapp was among the major distractions.", 
    "section": "national", 
    "title": "Students keep off social media ahead of exams", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}