{
    "author": [
        "Staff Reporter"
    ], 
    "text": "AP police accuse them of smuggling red sanders\n\nRelatives of arrested pilgrims, who belong to Ambalacheri village in Sathankulam, submitted petition to Collector of Thoothukudi for their release on Thursday.— Photo: N. Rajesh\n\nTen persons from Thoothukudi, who were on a pilgrimage to various shrines in Tamil Nadu and Andhra Pradesh, have been detained by forest officials in Tirupati on alleged charges of smuggling red sanders.\n\nRelatives of the pilgrims approached the Thoothukudi Collectorate on Thursday and sought the intervention of the district administration to secure their release.\n\nAccording to Kaliammal, her husband Shanmugavel alias Gopal, from Ambalacheri in Sathankulam, had left by a car to Tirupati along with other pilgrims on February 13. Later, she learnt that all the pilgrims were detained by the Forest Department of Andhra Pradesh on false charges of smuggling red sanders. One of those detained, Kalimuthu, had contacted his brother Sudalai over phone and informed him about the detention in Tirupati.\n\nThe forest officials claimed that while checking the vehicle at the check post in Tirupathi, they found red sanders in the car of the pilgrims. “But in reality the forest officials brought red sander logs and placed them atop the vehicle and forced the occupants to take a photograph alongside the car,” alleged Sudalai adding that the pilgrims were also beaten up in a bid to extract a confession from them.\n\nMeanwhile, in Chennai, a senior police officer, when contacted said, “We are enquiring with the Andhra Pradesh police into the circumstances that led to the arrest of the suspects. Preliminary investigation has revealed that they (those arrested) have no criminal antecedents.” The officer added that the family members of those arrested had claimed that they had gone on a pilgrimage to various temples before reaching Tirupati. “The arrest could be a case of mistaken identity,” he added.", 
    "section": "national", 
    "title": "Tamil Nadu pilgrims arrested in Tirupati", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}