{
    "author": [
        "M K"
    ], 
    "text": "Participants from 300 institutes across the country and abroad are taking part in three-day fiesta\n\nStudents at the radio controlled aircraft and flight simulator workshop at Anokha 2016 in Amrita University in Coimbatore on Thursday.— Photo: M. Periasamy\n\nMore than 15,000 students from more than 300 technical institutes and universities across the country and abroad are taking part in over 100 events to be organised as part of the three-day technical-fest Anokha that began at Amrita University in Coimbatore on Thursday.\n\nApart from student contestants and participants from top institutions in the country such as IITs, NITs, IIITs and BITS Pilani, the festival has attracted participants from United States of America, Indonesia, Cameroon, Morocco and Egypt.\n\nDean of Amrita School of Engineering Sasangan Ramanathan, said the sixth edition of the celebrated event will have as many as 75 technical contests, 24 workshops and about a dozen fun-filled events to test the technical and talents of the participants.\n\nThe theme of the event this year is ‘Sustainably Developed Technopolis’ in line with the United Nation’s theme of ‘Sustainable Development Goals’. Anokha 2016 is the first technical festival in the country to get United Nations Academic Impact (UNAI) accreditation. Thematic workshops events on Urban Eco-Township Planning, Solar and Wind Energy and Hybrid Electric Vehicle began on the first day. Of the 17 workshops and 16 events commenced on the day, the signature event was the Model United Nations (MUN) Young Leaders summit.\n\nAmong the other popular contests are robotic events such as Maze Runner and Fist of Fury – participants made their own Haptic glove and bots. Participants were also taught how to make radio-controlled aircraft.\n\nOther interesting events are hands-on training on taking apart and putting back together a motorbike.\n\nThe day concluded with a spectacular dance performance by Natyasudha club of Amrita.\n\nEarlier, Deputy Managing Director of Toyota Industries Engine India T.R. Parasuraman, who inaugurated the event, said India would be a global research and development destination in a decade. This could be achieved only when institutions produce quality graduates who could be employed in the market that faced dearth of skilled engineering graduates.\n\nHe said ‘Make in India’ would be successful only when the design, production, logistics, marketing and servicing were done in India.\n\n“This will provide more jobs and there is a need for skilled manpower,” he said.", 
    "section": "national", 
    "title": "Tech fest begins at Amrita University", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}