{
    "author": [], 
    "text": "RELIGION\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Kothandaramar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Venugopalan Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 75, Vinayagar Street, Amman Nagar, 6 p.m.\n\nGENERAL\n\nTiruchirapalli City Corporation : Urgent meeting, Budget presentation, A.Jaya, Mayor, presides, 11 a.m.\n\nTN Dr.Ambedkar Law University and Tiruchi Government Law College : Inauguration of debate in Tamil, M.S.Soundarapandian, Registrar (in-charge), TN Dr.Ambedkar Law University, chief guest, 9.30 a.m.\n\nBharathidasan University Centre for Remote Sensing: International Mother Language Day, lecture by Ponneelan, writer, Khajamalai campus, 11 a.m.\n\nSt.Joseph’s College : Comtech 2016 – technical symposium, Gopinath Ganapathy, Head, Department of Computer Science, Bharathidasan University, inaugurates, 10 a.m.\n\nCentre for Higher Research on Bharathidasan, Bharathidasan University : C.P.Adithanar Endowment seminar, university campus, 10.30 a.m.; valediction, 2.30 p.m.\n\nK.Ramakrishnan College of Engineering : Talentia 2016 – cultural festival, 10 a.m.\n\nSharon-JCI Tiruchi Excel: Quiz fest for Rane TRW Rolling Shield, Sri Uma Parameswari Middle School, Ramji Nagar, 3.30 p.m.\n\nM.A.M.School of Engineering : Lecture on Web Application Development by Anusha Priya, senior technical analyst, Centauruss Pvt.Ltd., 10.30 a.m.; workshop on Tanner – EDA tools, P.Sathyaraj, resource person, 10 a.m.\n\nHallmark Business School : Training programme on Banking and finance, 10 a.m.\n\nJ.J.College of Engineering and Technology : Internet of Things – technical seminar, T.Sivakumar of SF IT Systems, Singapore, resource person, 2 p.m.\n\nM.A.M. College of Engineering : Hands-on training on Innovative electronics, K.C.Tamilventhan, Director, and T.Malvino of LIFT Technologies, resource persons, 9.30 a.m.\n\nSri N.Ramaswami Ayyar Memorial Polytechnic College for Girls : Annual Day, N.Kanagasabapathi, president, TIDITSSIA, chief guest, 10.15 a.m.\n\nSharon, JCI Tiruchi Excel, Lions Club of Tiruchi Karumandapam and Joseph Eye Hospital : Free eye screening camp, Sri Sivananda Balalaya, Adavathur, 10.30 a.m.\n\nTiruchi District Handball Association and SBIOA Matric Higher Secondary School : Valediction of district handball championship for boys and girls for SBIOA Educational Trust Rolling Trophy, P.Francis Sagayaraj, Senior Tax Assistant, Customs and Central Excise, chief guest, school campus, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}