{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "The paper is published by the Royal Meteorological Society (Great Britain) in Atmospheric Science Letters\n\nSatyajit Ghosh, senior professor, School of Mechanical Engineering, VIT University, along with three students has chalked out an engineering intervention to tweak the cyclonic storm's microphysics.— Photo:C. Venkatachalapathy\n\nChennai’s worst-ever deluge during November-December 2015 still remains afresh in the minds of people. But can such unprecedented flooding be prevented in the future? A team from VIT University, Vellore seems to have the answer.\n\nIn a paper titled “A geoengineering approach towards tackling tropical cyclones over the Bay of Bengal,” Satyajit Ghosh, senior professor, School of Mechanical Engineering of the university along with three students has chalked out an engineering intervention to tweak the cyclonic storm’s microphysics.\n\nThe paper, which was published by the Royal Meteorological Society (Great Britain) in Atmospheric Science Letters on January 26, 2016, has explored the possibility of delivering sea salt droplets into the base of a developing cyclonic storm.\n\n“Our research group worked for two years to bring in an engineering solution to this problem. We have looked at a new approach of injecting sea water at the base of a developing cyclone. This way, we can tweak the cyclonic storm’s microphysics. Smaller cloud droplets will grow into bigger ones and fall as rain quickly. So, it rains out over the ocean prior to making a landfall,” Professor Ghosh said.\n\nHe noted that both Chennai region and northern England were devastated in the recent floods. He observed that with the present available system, weather forecast can predict the development of a cyclonic storm and its trajectory five days in advance.\n\nWhat follows next is a novel injection mechanism involving a modified naval artillery shell containing sea salt solution to tweak the storm’s microphysics. The storm’s wrath is spent out through copious precipitation over the Bay of Bengal prior to its landfall along coastal districts, he added.\n\nThe authors of the paper have shown the nitty-gritty of the injection mechanism in the paper. In fact, he pointed out that an unmanned rocket can also be used for this purpose.\n\nExplaining the mechanism, he said, “The cloud collision and coalescence happens quickly that the rain starts forming quickly from the cloud. This is a runaway mechanism and our model predicts that rain will start in less than 10 minutes of injection. We are diminishing the storm’s energy by making it rain.”\n\nThe paper, he said, has been internationally peer reviewed for its feasibility. This approach could apply to tropical cyclones such as Thane. Nevertheless, they are planning to develop similar approaches for every other region, he said. Next, they plan to liaise further with research colleagues at University of Cambridge and University of Leeds to develop a scaled down version of the proposal in the coming years. “We will try to come up with a prototype,” he mentioned.\n\nThis work was carried out under VIT University’s flagship programme – Project Based Learning Scheme. Akshath Sharma, a student and one of the authors, has secured a fully funded direct Ph.D in Cambridge University based on this research. Two other students – S. Arora and G. Desouza – are the other team members.\n\nAuthors of the paper have shown the nitty-gritty of sea salt injection mechanism", 
    "section": "national", 
    "title": "VIT team’s solution to take the sting out of storms", 
    "subsection": "tamilnadu", 
    "date": "2016-02-19"
}