{
    "author": [
        "R Rajaram"
    ], 
    "text": "With their natural habitat shrinking, birds are attracted to open spaces like the Tiruchi airport, say activists.\n\nAn independent study by a city college faculty member on bird activity in the international airport and in its vicinity here has recorded 23 bird species besides butterfly species and few mammals, amphibians and reptiles.\n\nThe ongoing study by Q. Ashoka Chakkaravarthy, Assistant Professor of Environment Science, Department of Foundation Courses, St. Joseph’s College, Tiruchi, with cooperation from the airport officials is to eventually suggest scientific measures to minimize bird hits suffered by aircrafts.\n\nEngaging a few students, the study, launched in December last week, at first sought to identify distribution of birds in the airport and its vicinity by carrying out field studies at different time intervals. In its preliminary report, it recorded 23 species of birds including Asian Palm Swift, Black Kite, Black-Shouldered Kite, Oriental Skylark, Spotted owl, rock pigeon, house crow, Indian robin, Common myna, Indian pond heron, Hoopoe and white throated kingfisher inside the airport. With respect to butterflies the species recorded include Blue Pansy, Small Grass yellow, crimson rose, common rose and Tawny coster.\n\nMammals such as mongoose and rabbit, amphibians such as frogs, reptiles like snakes and insects like dragonfly were recorded, said Ashoka Chakkaravarthy – also an ecologist.\n\nPoint count methodology was adopted to record distribution of bird species.\n\nNow, the study would focus on areas of bird activities, reasons for their attraction towards the airport side and how they become a hazard to aircraft while landing and take off. It would soon be done by field observations, inspection of infield areas and survey of buffer zone soon by seeking cooperation from the Airports Authority of India and Corporation authorities. The study would deploy bird scaring reflective ribbons, a device, in vantage areas inside the airport to ascertain the extent to which the device would scare the birds from flying inside the airport area thereby averting bird hits.\n\nThe study would use organic pesticides to remove insects inside the airport so that birds do not venture inside for foraging. In addition, other environmental management actions and measures would be looked into during the study before coming out with a set of recommendations to minimize such bird hits and the save the birds.\n\nThe airport had witnessed few instances of bird hits.\n\nMr. Chakkaravarthy said many forest like areas and aquatic ecosystems in Tiruchi were being converted into real estate forcing birds and reptiles to shift to open areas such as the aerodrome for foraging, nesting and resting.\n\nThe airport has more overseas flights to Colombo, Singapore, Kuala Lumpur and Dubai every day than domestic ones. On a day, over 10 international services are being operated by foreign carriers such as Sri Lankan Airlines, Tiger Airways, Malindo Air, Air Asia and the Air India Express. The preliminary report and the final set of recommendations would be submitted to the Tiruchi airport authorities for perusal.", 
    "section": "national", 
    "title": "23 bird and butterfly species recorded in airport", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}