{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Urges Union government to establish a separate ministry for fishermen welfare\n\nFamily members of fishermen detained by Iran Coast Guard submitted a petition to Kanyakumari Collector in Nagercoil on Monday demanding action for their early release. Fr. Churchill, right, general secretary, South Asian Fishermen Fraternity, is seen.\n\nThe Indian government must make efforts to facilitate the release of 54 fishermen — 44 from Tamil Nadu and five each from Gujarat and Dubai — detained by the Iran Coast Guard (ICG) along with five mechanised boats since December 1, on the charge of trespassing into its territorial waters, South Asian Fishermen Fraternity (SAFF) has said.\n\nIts general secretary Fr. Churchill, who brought the family members of the detained fishermen from Kanyakumari district, to submit a petition to Collector Sajjansingh R. Chavan here on Monday, said that the detained fishermen were hoping that their employer in Sharjah or the Indian Embassy in Dubai would come to their help but their hopes were dashed. Devadoss, one of the detained fishermen from Kanyakumari, had sought the help of SAFF to take the initiative to get their release.\n\n“It is learnt that the detained men are not provided food, their basic needs and medical facilities by the Iranian authorities. Only the Iranian fishermen were providing them food. If the State and Central governments did not take immediate efforts for their release through the diplomatic route, their situation will become even worse’’ said Fr. Churchill.\n\nThe union government must establish a separate ministry for fishermen welfare as Indian fishermen were facing trouble in many parts of the world, he said.\n\nAnother detention\n\nIn a release, Justin Antony, founder-president of International Fishermen Development Trust, said that four fishermen from Tamil Nadu, including two from Kanyakumari district, had been detained by Qatar authorities when they were engaged in fishing in mid-sea on January 7. The fishermen had ventured into the sea from Dharin in Saudi Arabia the previous day. The State and Central governments must take immediate measures for the release of the fishermen hailing from Kanyakumari, Nagapattinam and Ervadi in Tirunelveli district, he added.", 
    "section": "national", 
    "title": "54 Indian fishermen detained in Iran since December 1: forum", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}