{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "AIADMK general secretary and Chief Minister Jayalalithaa receives Rs 1.04 crore as party development fund from MP and party’s Villupuram north district secretary R. Lakshmanan on Monday.— Photo: Special Arrangement\n\nHigh on confidence, the ruling AIADMK is first off the blocks in the race to the elections by announcing the sale of application forms for partymen aspiring to contest the Assembly polls.\n\nOn Monday, party treasurer O. Panneerselvam, in a statement released with the approval of Chief Minister and AIADMK supremo Jayalalithaa, said the candidates willing to contest the elections could deposit Rs 11,000 for an Assembly ticket at the headquarters and obtain application forms.\n\nThe forms will be available at the party headquarters from January 20 to February 3 between 10.30 a.m to 5 p.m. For Puducherry, the fee would be Rs 5,000 per seat and for Kerala it would be Rs 2,000 per Assembly seat.\n\n“We do not have six or eight months for the elections. Since the applications have to be scrutinised and candidates selected as the party has a very large cadre base, Amma has chosen the right time,” says a party senior.\n\nAsked about the party’s confidence factor ahead of the elections, he said, “She approaches everything positively and confronts issues with confidence. Anyone who knows her personality knows that she stays positive even at times of trouble.”\n\nIn the run-up to the 2011 elections, Ms. Jayalalithaa had announced the list of party candidates for 160 Assembly constituencies (on March 17) without consulting her alliance partners, including the DMDK and Left parties.\n\nAs the alliance leaders expressed shock, the AIADMK seniors, in-charge of elections, held a few rounds of talks with the allies and Ms. Jayalalithaa had to put off her campaign for a while. She eventually clinched a deal ten days later.\n\nHi-tech campaign vehicle\n\nMeanwhile, on Monday morning, R. Lakshmanan, Rajya Sabha MP and party’s Villupuram north district secretary, handed over Rs 1.04 crore as party development fund to Ms. Jayalalithaa.\n\nThe same day, Ms. Jayalalithaa presented the key of a hi-tech campaign vehicle to School Education Minister and Vellore district secretary K.C. Veeramani to propagate the achievements of the government and its innumerable welfare schemes.", 
    "section": "national", 
    "title": "AIADMK gets into poll mode", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}