{
    "author": [
        "Staff Reporter"
    ], 
    "text": "India has them all:Anuradha Kapur, former director of National School of Drama, delivering a talk on 'The place of theatre in the changing Indian context' after receiving an award in Madurai .— Photo: R. Ashok\n\nThe first J. Vasanthan Lifetime Achievement Award, instituted by Nigazh Theatre Centre for excellence in the field of theatre, was awarded to Anuradha Kapur, noted theatre personality and former Director of National School of Drama (NSD), at a function organised by J. Vasanthan Art Foundation at Madurai Media and Film Studies Academy (MMFSA) here on Sunday.\n\nDelivering a speech after receiving the award on ‘The place of theatre in the changing Indian context,’ Ms. Kapur stressed the importance of preserving theatre at a time when space for liberal ideas and possibilities of dialogues appeared to be on the wane. She said that theatre was like a magic mirror that used body as its material and enabled a rare dialogue between artistes and the audience. “That is why we should be very mindful about ensuring that theatre and its dialogues continue,” she said.\n\nStating that theatre was a social medium, Ms. Kapur urged the artistes to be ethical, socially concerned, thoughtful and respectful.\n\nPointing out the diverse nature of Indian theatre, she said that there was not a single form of theatre in the world that was not already happening in some parts of India. “Be it classical, folk, traditional or popular, every form is here. Therefore, it is a lost cause to define Indian theatre as it exists in hundreds of forms,” she said.\n\nMs. Kapur was awarded the prize, which included a purse of Rs. 50,000, by G. Srinivasan, a schoolmate of the late J. Vasanthan and president of GOVEL Trust that manages Aravind Eye Hospital. In a noble gesture, Ms. Kapur donated back the cash award as a contribution for encouraging theatre art in Madurai region.\n\nEarlier, T. Chinnaraj Joseph Jaikumar, Managing Trustee of JV Art Foundation, recollected the multi-faceted talents of J. Vasanthan, who started a theatre group at The American College when he was a professor there. The paintings of JV, as he was fondly called by his friends, were exhibited at the venue.\n\nP. Gunasekaran, a painter, was awarded Vasanthan Artists in Residence Fellowship for the year 2016-2017 by Solomon Papaiya, Trustee of JV Art Foundation. Chandni Appadurai, daughter of JV and Founder Trustee of the foundation, welcomed the guests.", 
    "section": "national", 
    "title": "Anuradha Kapur awarded first JV Lifetime Achievement award", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}