{
    "author": [
        "S Sundar"
    ], 
    "text": "Madurai Rural district police have booked six cases against 65 caste Hindus\n\nOne of the two huts that were burnt in a Dalit hamlet at Kuruvithurai near Sholavandan in Madurai district on Sunday night.— Photo: G. Moorthy\n\nMadurai Rural police arrested 28 persons in connection with the attack on Dalits at Kuruvithurai near Sholavandan on Sunday.\n\nSix cases were booked against 65 caste Hindus under various Sections of the Indian Penal Code and under the provisions of the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act.\n\nThe police arrested three persons – R. Kasimayan (23) and two minors – who created ruckus at the venue where Dalits were celebrating Pongal festival. The police said that Dalits had detained these three and later let them off on the advice of local leaders.\n\nHowever, within no time, scores of caste Hindus, armed with logs and rods, rushed to the Dalit hamlet and started attacking them.\n\nWhile 16 Dalits, including women, were injured, the perpetrators attacked the tiled roof of over dozen houses and damaged vehicles.\n\nAll India Democratic Women’s Association leader S.K. Ponnuthai, who visited the village, said that more than 200 armed men had attacked Dalits.\n\n“They had not even spared a young mother feeding her infant,” she said.\n\nThe women complained, Ms. Ponnuthai said, that they were not allowed to join queue in the ration shops.\n\n“Dalits were allowed to buy goods only after 20{+t}{+h}of every month,” she charged.\n\nMadurai-based NGO, Evidence, in a statement said that violence was unleashed on Dalits only because they were celebrating Pongal. “The caste Hindus did not want the Dalits to celebrate Pongal, since ‘jallikattu’ was not allowed,” A. Kadir, its executive director said.\n\nThe perpetrators of the crime should be booked under the Tamil Nadu Prohibition of Harassment of Women Act too.\n\nHeavy security\n\nA large number of police personnel, drawn from different districts, have been deployed at Kuruvithurai.\n\nAn eerie silence has prevailed in the village where many of the shops on the main road remained closed.\n\nAdditional Superintendent of Police Karthikeyan is camping there.\n\nMost of the male members of the caste Hindu community absconding.\n\nThe police have put up four check-posts from Mannadimangalam till Kuruvithurai. Bus services were suspended to the village.", 
    "section": "national", 
    "title": "Attack on Dalits: 28 arrested at Kuruvithurai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}