{
    "author": [], 
    "text": "At Chennai Central, buses can’t enter or exit the bays quickly, leading to vehicle pile-ups\n\nIn the aftermath of the floods, government agencies have been according great importance to the improvement of bus route roads across the city, but are ignoring another key area – bus bays near rail stations.\n\nThe road surface has been severely damaged at almost all the bus bays in the city.\n\nAt Chennai Central, roads at the bus bays are in such a bad state that the vehicles travel at a snail’s pace. Buses cannot enter and exit the bays quickly and this results in pile-ups.\n\nCommuters however feel that if bus bays do have a good road surface, drivers tend to speed up and this can cause risks to pedestrians, many of whom dart across the facility. Nevertheless, roads in bus bays should be good and have speed breakers to check rash driving, say experts\n\nCommuters say that be it Egmore (northern side) or any other station where bus bays have been created for the convenience of passengers, the problem is the same.\n\nSources explain that multiple government agencies are involved in maintenance and in the absence of an efficient system enabling coordination among these agencies, roads here cannot be improved. Roads inside bus terminuses are no better as invariably, there are huge potholes at both the entry and exit points, commuters complain.\n\nStep in the right direction\n\nIn Chennai, car-pooling is still at a nascent stage. But efforts are afoot to popularise it. Recently, GreenPool, a transport start-up with a presence in Chennai, launched a mobile platform for carpooling.\n\nR.K. Ravikumar, founder and CEO of the company, said the venture, launched in October last year, covers several metros. He said the app has been attracting people due to features such as preference-based search of co-travellers, real-time cost calculation and a method of background checks.\n\nMr. Ravikumar, a former IT employee, says several IT/ITES companies have been keen on bringing employees on to the car pooling platform. The algorithm devised by the startup helps in calculating the cost based on categorisation involving the car type, number of riders and distance covered. The app has more than 500 members, he says.\n\n(Reporting by\n\nK. Manikandan and R. Srikanth)", 
    "section": "national", 
    "title": "Battered roads affect traffic near bus bays", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}