{
    "author": [
        "Special Correspondent"
    ], 
    "text": "K. Rajavenkatesh, associate professor and Head of Cardiothoracic Surgery at the Madras Medical College (MMC), passed away following a brief illness at his home in Anna Nagar on Monday. He was 57.\n\nA renowned cardiothoracic surgeon, he was an alumnus of the college and served at the Rajiv Gandhi Government General Hospital (GH) since early 2013.\n\nHis colleagues and juniors remember him as a gifted administrator, under whose leadership the GH became the first government hospital to perform minimally invasive procedures for complex surgeries such as atrial septal defect repair and mitral valve replacement.\n\nAn alumnus of the MMC, he developed the facilities and the capability of the Cardiothoracic Surgery Department in the hospital on a par with any corporate hospital, said Shivan Raj, also a surgeon.\n\nDr. Rajavenkatesh is also the author of various books and articles on holistic health and healthy living. During his younger days, he was an active member of the Chennai district chapter of Tamil Nadu Government Doctors Association, according to its office-bearers. He had also served as the students’ body president.\n\nHis colleagues recall with pride his voluntary social work during the Gujarat earthquake in 2001. He has been honoured with several awards for his work. The funeral will be held at 12.30 p.m. on Tuesday.\n\nA close friend of Dr. Rajavenkatesh described him as an extremely friendly person to whom positions of power and authority did not matter.\n\nAs someone who had worked with him for several decades, she said, he was known for his work in tribal areas in Cuddalore and Kodaikanal where he would conduct health camps.\n\nIn Kodaikanal, he would trek long distances, carrying medicines.\n\nHe was known for his work in the tribal areas of Cuddalore and Kodaikanal", 
    "section": "national", 
    "title": "Cardiothoracic surgeon K. Rajavenkatesh dead", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}