{
    "author": [
        "C Jaisankar"
    ], 
    "text": "It will enable Tangedco to increase efficiency of power supply and reduce the time taken to attend to faults\n\nThe Supervisory Control and Data Acquisition (SCADA), an automated centralised power distribution, control and monitoring system, will become operational before January 30, according to P. Sivasamy, Chief Engineer, Distribution, Tamil Nadu Generation and Distribution Corporation (Tangedco).\n\nThe automation system is being established at a cost of Rs. 23.63 crore as part of the Restructured Accelerated Power Development and Reforms Programme (R-APDRP) aimed at increasing the efficiency of power supply to consumers by reducing reaction time on attending the faults.\n\nSpeaking to The Hindu on Monday, he said that the system had been controlling part of operations in Tiruchi city. Out of 15 sub-stations, 11 had been brought under the SCADA system in the first phase. The work on setting up of 11 Remote Terminal Units (RTU) had been completed. They were all tested successfully.\n\nAs per the plan, the SCADA would have 382 Feeder Remote Terminal Units (FRTU). Of them, 202 had been installed and tested successfully. Remaining 180 FRTUs were being installed.\n\nMr. Sivasamy further said that installing sectionalizer was among the important component of SCADA system. It was a current monitoring device to isolate faulty sections of electrical systems. It would trip by sensing the current and the absence of voltage when the upstream breaker had tripped.\n\nSectionalizer could isolate the de-energised circuit. It had been planned to install 241 sectionalizers in different parts of the city. The work had almost been completed.\n\nIn the existing system, power supply had to be disconnected for a long stretch if a fault was noticed at a spot. It would affect a large number of consumers.\n\nOnce the sectionalizers became functional, power supply could be cut only at the faulty line. It would avoid unnecessary power disturbance to the consumers.\n\nMr. Sivasamy said it was expected that all works related to SCADA would be completed by January 30.\n\nFour special teams were formed to expedite the works.\n\nOnce the entire system became functional, most of the operations of 11 sub stations, high tension feeders and all electrical equipment could be remote controlled.\n\nIf power supply was disrupted, control room would pick up signals automatically so as to take remedial measures. There would be no need for wiremen to visit the areas to locate the fault.\n\nIt would enable Tangedco to increase the efficiency of power supply and reduce reaction time on attending faults.", 
    "section": "national", 
    "title": "Centralised power monitoring system to be operational soon", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}