{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Monday reserved its judgment on a batch of writ appeals filed against an order passed by a single judge of the High Court on November 26 directing devotees and other visitors to temples, maintained by Hindu Religious and Charitable Endowments (HR and CE) Department in the State, to adhere to a dress code prescribed by him.\n\nA Division Bench of Justices V. Ramasubramanian and K. Ravichandrabaabu deferred their verdict without mentioning a date after hearing arguments advanced by a group of lawyers both in favour and against the single judge’s order.\n\nOne section of the lawyers represented interveners who supported the judge-imposed dress code in temples.\n\nDisposing of a writ petition seeking permission for aadal paadal (dance and musical cultural programme) in view of a temple festival in Tiruchi district, Justice S. Vaidyanathan had directed that from January 1 men should wear “dhoti or pyjama with upper cloth or formal pants and shirts” and women “sari or half sari with blouse or churidhar with upper cloth” to temples. Children were allowed to come in “any fully-covered dress.”\n\nSupporting the order, advocates RM. Arun Swaminathan, S. Arun Kumar, S. Srimathy and others contended that such directives were the need of the hour in order to uphold moral, cultural and traditional values. However, Mr. Justice Ramasubramanian asked why the lawyers maintained silence when a section of High Court judges granted permission for “obscene” aadal paadal performances during temple festivals.\n\nWhat kind of logic\n\n“So you mean to say that outside the temple, one can remove all clothes and dance but before going inside they should cover themselves fully is it? What kind of logic is this? Do you know, a temple priest was murdered recently because he objected to playing of ‘beep’ song (which vent viral on social media and got condemned widely for its obscene lyrics) during an aadal paadal programme,” he asked.\n\nPointing out that temples were not only places of worship but also art and architecture, the judge said the sculptures there would have to be first covered with clothes before imposing a dress code on visitors.\n\n“If you are attracted by those sculptures, then you stand there and watch. But if you control your mind, you proceed forward. If you focus on God, you’ll not bother about anything else,” he said.\n\nWondering how many lawyers were able to impose a dress code for their teenage children even inside their houses, Mr. Justice Ramasubramanian said, “I request each one of you to go back home and see if you are living a life as your ancestors lived. If not, don’t impose a code on your grandchildren. Your generation has violated 1,001 prescriptions mentioned in the Shastras. The next generation is only taking it a step forward.”\n\nArguing against the dress code imposed by the single judge, advocate U. Nirmala Rani said: “Even the so called proper dresses can also be worn in an improper manner. How can that be stopped.”\n\nAdvocate A. Rajini said that arguments in support of a dress code for women would amount to supporting rape convicts who justify their act by accusing women of wearing provocative attire.\n\n'Why were lawyers silent when some HC judges granted permission for “obscene” shows?'", 
    "section": "national", 
    "title": "Court reserves verdict in appeals against temple dress code", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}