{
    "author": [], 
    "text": "The State Bank of India used to hold Customers Day at its Thiruthuraipoondi branch. It was very useful for customers to bring their grievances to the notice of higher officials from divisional or regional offices and get their problems solved. But of late, such a meeting is not held and customers are unable to take their grievances to the notice of the higher officials. The Customers Day meets should be held at least once in six months.\n\nR. Jambunathan,\n\nThiruthuraipoondi\n\nRe-introduce\n\nflight to Mumbai\n\nTiruchi airport is an old airport and is centrally located in the State. During his recent two-day visit, the Civil Aviation Minister has reviewed various issues relating to the development of the airport, including expansion of the runway and inclusion of the city under Bilateral Air Service Agreement (BASA). The airport authorities and the State government should follow it up with the Civil Aviation Ministry. Air India Express should re-introduce Tiruchi-Mumbai-Tiruchi flight whenever they plan their schedule in future.\n\nK. Muthuswamy,\n\nTiruchi\n\nPension not granted\n\nI am a senior citizen, a disabled person, and an orphan registered with the office of the Differently Abled Welfare, Thanjavur. I recently read that orphaned senior citizens are provided with monthly assistance. But my application with Thiruvidaimaruthur tahsildar has been pending for more than five years even though it has been recommended by the VAO and Revenue Inspector.\n\nV.Srinivasan,\n\nThirupanandal\n\nTNSTC buses skip\n\nChettimandapam\n\nMofussil buses of the Tamil Nadu State Transport Corporation are not stopping at the Chettimandapam bus stop even when they run empty. Only town buses stop here. Private buses regularly stop. State Transport Corporation officials should give instructions to drivers to stop buses compulsorily at the stop.\n\nK. Santhanam,\n\nKumbakonam\n\nRestore bus service\n\nThere were a number of town bus services connecting Thanjavur Old Stand and Medical College/Vallam via Railway Station serving the people who travel from far-off places. For the past two years, all the town buses have been using the bridge, skipping the Railway Station. It causes inconvenience for the people, especially for patients who have to travel by two buses now. Will the authorities restore the town bus services that existed for several years?\n\nK. Vaidyanadeswaran,\n\nThanjavur\n\nAdopt new words\n\nV. Ramasubramanian, Judge, Madras High Court in his convocation address in Tamil University has raised some thoughtful points to restore Tamil to its original status and enrich her in this 21st century. We should adopt new words and coinages. This will keep the language young. All old manuscripts and palm leaves in our possession must be published so that it reaches every Tamil. Government should help researchers and publishers to bring their work to people at affordable cost.\n\nN.V. Thiyagarajan,\n\nKumbakonam\n\nRemove flex boards\n\nFlex boards erected around temple premises should be removed. A board which was set up in connection with the opening of devotees’ hall near Swamimalai is yet to be removed. Hoardings set up near other temples should also be removed.\n\nM. Baluswamy,\n\nKumbakonam\n\nBurglaries at\n\nTippirajapuram\n\nTippirajapuram is one of the biggest villages on the main road of Kumbakonam and Mannargudi. It is nothing but the extension of Kumbakonam. Burglaries have become common in this village. The culprits have not been caught yet. It is time a separate police station was set up here.\n\nS. Krishnan,\n\nTippirajapuram\n\nWater scarcity at\n\nTiruvanaikoil temple\n\nPeople from across the country throng Tiruvanaikoil. But the drinking water supply is inadequate. Tourists are put to hardship. Will the HR and CE Department look into this matter?\n\nMurugappan S.P.,\n\nNo 1 Tollgate, Tiruchi\n\nProvide seat numbers\n\nI travelled to Chennai by Guruvayur Express on January 9. When I entered the coach, I could not find the seat number either on the back of the seat or on the window in the D2 coach. I had to take the help of ticket examiner to get the seat as some other passenger had occupied it.\n\nI request the railway authorities to provide seat numbers in reserved coaches.\n\nA. Mohamed Irfan,\n\nTiruchi\n\nJallikattu politicised\n\nSince this is an election year, all parties are politicising the jallikattu issue to get votes. We have seen many persons are injured and some have died during the events.\n\nDimple R. Mohan,\n\nMahalakshimi Nagar East Extension\n\nAlms in name of\n\ndivine characters\n\nAble-bodied people from North India begging alms by wearing the costumes of divine characters have become common on city roads. I could spot at least five in various parts of Tiruchi on the same day. A few years ago, it was few and far between. It is time such practices are discouraged.\n\nA.V. Narayanan,\n\nThillainagar\n\nPromote organic\n\nfertilizers\n\nAgriculture is the backbone of our country. Over 65 per cent of the population in the country depends only on agriculture. We were once the pioneers in the sector, but now we are importing harmful pesticides. Farmers should use only organic fertilizers.\n\nCondeepan M.,\n\nPattukottai", 
    "section": "national", 
    "title": "Customers Day discontinued at SBI", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}