{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Monday directed the Commissioner for Persons with Disabilities to hold a meeting in 10 days to ensure that all government buildings are made disabled-friendly.\n\nThe First Bench of Chief Justice S.K. Kaul and Justice Pushpa Sathyanarayana gave the direction on two PILs moved by Rajiv Rajan and M. Gnana Sambandam, seeking direction to the government to implement the Persons with Disabilities (Equal Opportunities, Protection of Rights and Full Participation) Act 1951 in its letter and spirit by providing disabled-friendly buses and a barrier-free environment in public places and to frame comprehensive rules for according recognition to schemes for the disabled.\n\nWhen the PILs came up for hearing, the Union government submitted a note containing details of the additional facilities included in the Handbook on Barrier Free and Accessibility Act, 2014. The report stated that the present requirement is to ensure that the Central PWD norms are adhered to and implemented in buildings owned by the government.\n\nRecording the submission, the Bench said efforts should be taken by the Commissioner for Disabilities in consultation with the Central and the State PWD and the amicus curiae advocate T. Mohan, so that it could have a clear plan of action as to what extent the different buildings could be made disabled-friendly.\n\nThe Bench then directed that a meeting be conducted by the Commissioner within 10 days.\n\n‘Hold meetings frequently’\n\nHolding that such meetings should be held frequently and a final picture should be placed before the court well before the next hearing, the court posted the matter for March 11. The Commissioner for Persons with Disabilities was directed to be present in the court in the next hearing.", 
    "section": "national", 
    "title": "Ensure disabled-friendly facilities in govt. buildings: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}