{
    "author": [
        "T K Rohit"
    ], 
    "text": "Fiji is reviewing its existing decades-old air services agreement with India, says Yogesh J. Karan, High Commissioner, High Commission of the Republic of Fiji. -Photo: V. Ganesan\n\nFiji is in the process of setting up its first consular office in Chennai by April that will focus mainly on promotion of health and medical tourism, trade and agriculture, Yogesh Karan, Fiji’s High Commissioner to India, said.\n\nIn an interview to The Hindu on Monday, Mr.Karan also said Fiji Airways was looking to sign a code-sharing agreement with Jet Airways and Air India, and the country is reviewing its existing decades-old air services agreement with India.\n\nFiji Airways will roll out a direct flight between Singapore and Fiji on April 5. “The airline is looking for a code-sharing agreement with Jet Airways and Air India to connect passengers from Singapore to Indian cities,” Mr. Karan added.\n\nMr.Karan said the Chennai consular office would be Fiji’s third such office in India, after Mumbai and Kolkata. “We are also looking to set up an office in Bengaluru,” he said.\n\nHauer-Diana Group chairman and managing director S.N. Srikanth will be Fiji’s first honorary consul in Chennai.\n\n“We don’t intend to have consular services in Chennai. The office will mainly focus on promotion of health and medical tourism, trade, tourism and agriculture,” he said.\n\n“Chennai is a good producer of high quality medicines, medical equipment and is a fast growing economic hub. We see potential for our people to come here for medical referrals, which will also be cheaper compared to other places.”\n\nFiji, which is part of the Global Solar Alliance mooted by Prime Minister Narendra Modi, wants to use Indian expertise to capitalise on its renewable energy potential. Currently, 60 per cent of Fiji’s energy runs on diesel and 40 per cent on renewable energy, mainly hydro energy, he said.\n\n“We want to reduce our dependence on fossil fuels. We are inviting interest from investors in India to set up solar farms to contribute to our national power grid. These are tax-free zones and companies will be entitled to 20-year tax exemptions,” the High Commissioner said, adding the country was also looking for public private partnerships with Indian companies.\n\nIt will be a boost to medical tourism, trade and agriculture", 
    "section": "national", 
    "title": "Fiji to set up consular office in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}