{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Attach excluder devices to boats to help them escape nets\n\nTree Foundation distributed 10 Turtle Excluder Devices (TED) to members of the Chennai Chengai Trawl Boat Owners and Workers Association at Kasimedu fishing harbour on Monday— Photo: B. Jothi Ramalingam\n\nTo prevent turtles from getting entangled in nets of trawlers, the Tree Foundation distributed 10 Turtle Excluder Devices (TED) to members of the Chennai Chengai Trawl Boat Owners and Workers Association on Monday.\n\nA TED fitted to a trawl net helps a trapped turtle get out safely through a flap in the device and back into the sea.\n\n“All through last year, we conducted trials of the TED, designed locally based on specifications laid down by the Central Institute of Fisheries Technology. We were contacted by the fishermen from Kasimedu who were ready to fit the devices to their boats and help protect the turtles as most of the Olive Ridleys are expected to swim towards the shores here during the breeding season now,” said Supraja Dharini of TREE Foundation.\n\nThe Olive Ridleys visit the sandy shores in the city every year from the end of January to March, which is their breeding season to lay eggs.\n\nOften, these turtles get caught in the nets of trawlers of the local fishermen who venture into the sea.\n\nShe further said that, until now, 37 dead turtles had been washed ashore, on the stretch between Neelankarai and Alamparai.\n\n“While we are going to begin ‘Turtle walks’ for the public from February 12, our volunteers have begun patrolling the shores at night anticipating the arrival of Olive Ridleys,” Ms. Supraja said.\n\nBefore the distribution of the TEDs to the fishermen at the Association office in Kasimedu, a documentary in Tamil on the role of sea turtles in maintaining the marine ecosystem, the threats they face and the possible solutions, was screened.", 
    "section": "national", 
    "title": "Fishermen step in to save the Olive Ridleys", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}