{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Members of Samathuva Kazhagam on Monday urged the State Government to close Tasmac-run liquor outlets ahead of elections. Led by lawyer M. Kargi, the members said that easy availability and high consumption of liquor led to increase in accidents.\n\nThe government justified the sale of liquor saying it needed the money to fund freebies and social welfare schemes. But recent newspaper reports suggested that around 10 lakh people had returned Pongal freebies the State Government had distributed.\n\nEven as the protests demanding prohibition intensified, a few people were protesting demanding lifting the ban on toddy. If the government yielded to their demands, it would only result in more liquor outlets in the State. At present, there were 6,500.\n\nThe government should therefore close liquor outlets ahead of elections, they reiterated.\n\nProvide more bins\n\nKongunadu Makkal Deisya Katchi members on Monday urged the district administration to direct the Coimbatore Corporation to provide more bins. In their petition, the party men said that in the absence of bins, the public were forced to throw garbage in the open leading to deterioration in hygiene. They also wanted damaged traffic signals to be replaced and encroachments to be removed to ease traffic congestion. The petitioners sought regulation of roadside vendors, closure of milk and snacks outlets that caused traffic congestion and installation of cameras in bus stands to monitor movement of anti-social elements.\n\nIncrease wages\n\nfor loom workers\n\nMember of Legislative Assembly from Sulur K. Dinakaran has asked for increase in wages of loom workers and contract price for small loom owners who do job work. In his petition, he said that the two lakh-odd loom owners and workers suffered because the government-determined wage was yet to be implemented even after a year of arriving at an understanding. Last month, the representatives of loom workers and loom owners met the State Minister concerned, who promised a solution in 10 days, but the wait continued.\n\nEvery year, the government agreed to wage revision only after the workers took to the streets. To avoid such incident, the government must come forward to settle the issue at the earliest, he said.\n\nRemove encroachment\n\nAnnai Ganga Nagar residents on Monday urged the district administration to remove encroachment on a reserved site.\n\nIn their petition, the residents said that a few persons had not only stopped the construction of a fair price shop and bus shelter on the reserved site, but had encroached upon it by constructing shopping complex.\n\nThey had complained about the encroachment to the thasildar, and village administrative officer of Muthukavundanpudur in this regard, but there was no solution. The administration should intervene to protect the reserved site. In the absence of a fair price shop in the vicinity, they were forced to walk three km to access one, the petitioners added.", 
    "section": "national", 
    "title": "Government urged to close liquor outlets", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}