{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As a mark of protest to condemn the ban on the rural sport\n\nResidents of Alanganallur with their voter identity cards at the Collectorate in Madurai on Monday.— Photo: S. James\n\nMore than 500 ‘jallikattu’ supporters, including a large number of women, from Alanganallur and three surrounding villages came to the Collectorate here on Monday in a bid to return their Electors’ Photo Identity Card as a mark of protest to condemn the ban on ‘jallikattu.’\n\nCollector L. Subramanian persuaded them not to return the cards by assuring that the State government was taking all possible measures to get the ban lifted legally.\n\nThe ‘jallikattu’ supporters from Alanganallur, Othaveedu, Valasai and Kuravankulam, who came in 30 vehicles, including trucks and vans, were stopped by the police near the Gandhi Museum.\n\nLater, the supporters marched for about 500 metres to the Collectorate raising slogans against People for Ethical Treatment of Animals, Animal Welfare Board of India and other animal rights groups that supported the ban at the Supreme Court. As they were initially not allowed to enter the Collectorate premises, the protesters sat near the gate and raised slogans.\n\nThey blamed the Central and State government for their “inability” to get the ban revoked. “Last year, we were less hopeful.\n\nHowever, this year, the Central government unnecessarily raised our hopes by issuing the notification which was later stayed by the Supreme Court,” said K. Swaminathan from Valasai.\n\nA few representatives later met the Collector and told him that they had decided to boycott the Assembly elections as there were no signs of the ban getting removed.\n\nWhile appreciating the ‘jallikattu’ supporters for the peaceful manner in which they had expressed their protest so far, Mr. Subramanian told them that the State government was with them on the issue and it was exploring all possibilities to conduct the sport again.\n\nOn insistence by the representatives, the Collector later met all the protesters and requested them not to return their voter identity cards.", 
    "section": "national", 
    "title": "‘Jallikattu’ supporters’ bid to return voter ID cards", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}