{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Two judges of the Madras High Court on Monday made a case for reservation on communal and caste lines in higher judiciary and lamented the near absence of judges belonging to Scheduled Castes, Scheduled Tribes, Denotified Communities and Most Backward Classes in the Supreme Court as well as various High Courts.\n\nAddressing members of Madurai Bench High Court Advocates Association (MBHAA), Justices P.R. Shivakumar and D. Hariparanthaman wondered why the Supreme Court and High Courts should be insulated from reservation when it was implemented even at the level of elected representatives and executive authorities.\n\n“As on today, the sanctioned strength of High Court judges in the country was over 1,200. Just around 18 of them belong to the Scheduled Castes… This is elite untouchability. It can be eradicated only if the Supreme Court and High Court collegiums, which select candidates for judgeship, also consist of judges from minority and backward communities.\n\n“It is a sad state of affairs that a sitting judge of the Gujarat High Court had recently made an observation in one of his judgments that corruption and reservations were the two ills plaguing society even after six decades since Independence, and later retracted his remark. Equating reservations with corruption itself shows his mentality,” Justice Shivakumar said.\n\nJustice Hariparanthaman said that it was absurd to oppose reservation on the ground that merit alone should be given priority. “Where is the question of merit when education has become a business in this country? How can the opponents of reservation expect the people from the oppressed classes to purchase degrees by paying money in lakh and crores?\n\n“I would say that all those who oppose reservation are scoundrels. Those people ask how long can the reservations continue and I would say as long as Hinduism does not change its principles. It is a shame that even today the body of a Dalit cannot be taken through a route dominated by caste Hindus in Vazhvur near Mayiladuthurai despite a specific order passed by the High Court against such opposition.\n\n“Sharing the dais along with me in a meeting in Chennai recently, Viduthalai Chiruthaigal Katchi leader Thol Thirumavalavan had rightly said that the order of the High Court was also buried along with the body of the Dalit in the pit,” he said.", 
    "section": "national", 
    "title": "Judges bat for reservation in higher judiciary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}