{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "It is tough for them to get permission from higher-ups to participate\n\nGovernment employees and teachers of government and aided schools face problems in undertaking the annual pilgrimage to Katchatheevu and attend the festival at St Antony’s Church there as they have to get permission from their respective heads of departments in Chennai, which is time-consuming.\n\nJaffna Diocese, which is organising the festival to be held on February 20 and 21, sent the formal invitation to Verkodu Parish in Rameswaram to organise Indian pilgrimage only last week.\n\nThe local Parish, after getting the consent of the district administration, gave just 10-15 days’ time for the pilgrims to apply, which was too short a time for the government servants to secure necessary clearances from the higher authorities, sources said.\n\nAs the pilgrims were allowed to visit Katchatheevu, a foreign islet without passport and visa, the security agencies insisted on government employees seeking permission from their HoDs, and the process would take a minimum of three months, the sources said.\n\nThe government servants said that they would be able to attend the festival this year only if the local authorities were empowered to issue the ‘no-objection certificate’ and the security agencies accepted it.\n\nA district judge created a flutter by undertaking the pilgrimage without necessary permission two years ago, but his personal guard, a police constable, was taken to task by the department for accompanying him in the pilgrimage without permission.\n\nMeeting\n\nMeanwhile, Rev. Fr. L. Sagayaraj, Verkodu Parish Priest, said that the district administration was expected to hold a meeting with the organisers and various security agencies later this week to finalise the pilgrimage.\n\nApplications for the pilgrimage would be distributed from Wednesday and the pilgrims should submit the filled-in applications by February 2, he added.\n\nSo far, 48 mechanised boat owners registered with the Parish for transporting the pilgrims. The pilgrims should directly book with the boat owners by paying Rs. 1,000, which included administration fee of Rs. 300, he said.\n\nHe also warned boat owners against collecting more than the prescribed amount.\n\nLast year, 4,003 pilgrims, including 816 women and 229 children, attended the festival, and this year too they expected more than 4,000 pilgrims, he said.", 
    "section": "national", 
    "title": "Katchatheevu festival: govt. staff, teachers face difficulty", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}