{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "The German horticulturist helped shape Bengaluru’s green cover\n\nGerman horticulturist Gustav Hermann Krumbiegel helped shape Bengaluru’s green cover, but his final resting place remained dilapidated and forgotten for more than half a century. But last week, on the occasion of Krumbiegel’s 150th birth anniversary celebrations, his gravesite was restored by officials from the Mysore Horticultural Society and the Department of Horticulture.\n\nKrumbiegel died in Bengaluru in 1956, and was buried at the Methodist Cemetery on Hosur Road at the behest of Jayachamaraja Wadiyar. But as the years passed by, his gravestone fell to disrepair and the burial site faded from public memory. “The 3 ft X 7 ft gravestone was not recognisable,” said M. Jagadeesh, Joint Director, Horticulture, Parks and Gardens, Lalbagh. The gravestone, set under the African tulip tree — one of Krumbiegel’s favourite trees, was slowly sinking into the ground. Very little was visible except for the blurred details of his name, birth and death dates, and the fading epitaph: ‘Whatever he touched, he adorned’.\n\n“It was dilapidated. So we added three steps in granite with a supporting stone that has his image, details and contribution,” said Mr. Jagadeesh. “It is such a beautiful makeover that will hold good for a few centuries,” he said.\n\nLiving memory\n\nKrumbiegel Road, which leads from Lalbagh Main Gate to the West Gate, is also in need of a facelift.\n\nRecently, visual artist Suresh Jayaram, while leading a special tour to mark the horticulturist’s 150th anniversary celebrations, had said, “The city is deeply indebted to this urban visionary, but except for a road named after him, there is no official plaque mentioning his details or contribution to the Garden City he helped create.”\n\nAcknowledging this, Mr. Jagadeesh said, civic authorities had to look into giving the road a facelift and putting up signboards with details about the horticulturist.\n\nKrumbiegel’s vision for the city saw him select flowering trees in such a manner that they blossomed sequentially. Called serial blossoming, these carefully curated trees lent seasonal colour the entire year. “The German horticulturist brought in more than 50 per cent of the nearly 9,000 trees belonging to 800 genera in Lalbagh and the then Mysore royals encouraged his green moves,” said S. Narayana Swamy, former senior official of the Department of Horticulture who has written a book on Krumbiegel.\n\nGreen thumb\n\nG.H. Krumbiegel was born in Lohmen, Germany, in 1865 and died in Bengaluru in 1956.\n\nKrumbiegel worked at Kew Gardens in London from where he travelled to India in 1893 at the invitation of the royal family of Baroda. Later, he worked with the Mysore royals.\n\nThe ornamental structures in Lalbagh such as balustrades, arches, staircases, bridges, urns, pedestals, vases and fountains were designed by Krumbiegel.\n\nApple cultivation was given a boost under him. He also introduced the cultivation of grapes, citrus fruits, figs, pomegranates, blackberry and strawberry.", 
    "section": "national", 
    "title": "Krumbiegel’s forgotten grave gets a facelift after 60 years", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}