{
    "author": [
        "Jesudasan Sangeetha Kandavel", 
        "Dennis S"
    ], 
    "text": "Call it coincidence or otherwise, even as political parties are demanding implementation of prohibition in the State, sale of beer across Tamil Nadu has dipped since 2013-14 and that of Indian-Made Foreign Spirits (IMFS) since 2014-15.\n\nThere have been attacks on liquor shops, protests by activists during the last year, demanding implementation of prohibition in the State. While the beer sales recorded the lowest in the last 10 fiscals, the IMFS sales started to dip from the following fiscal.\n\nThe decline in sale of both beer and IMFS has been sharp during the current fiscal too, evident in the month-wise data available with The Hindu , which show fall in sales during all the months compared to the corresponding months of the previous fiscal, except for November last year (see accompanying graph). These figures were compiled by the Commissionerate of Prohibition and Excise late last year.\n\nA senior official in Tasmac, who requested anonymity, said, “The sales numbers have gone up in the last two months. During the recent three-day festival holidays, Tasmac sold an additional 33,000 cases”, but he was not able to support his claim with official numbers.\n\nThe official admitted that the sales were down for a certain period last year due to several reasons, including “illicit liquor entering the market and hike in liquor prices.” Beer consumption, which is usually high during summer, failed to retain its spot in the last two years due to a spike in prices, he observed.\n\nThough after the price hike, some beer consumers have migrated to other liquor, the sales numbers were stagnant. “We wanted to do a reality check on why sales dipped suddenly and we did a SWOT analysis, which has now helped revive sales,” the official added.\n\nTasmac did a SWOT analysis in all its 6,814 outlets last year, which brought to light that there was a six per cent dent in sales. More than 1,000 bars have closed shutters in the last two years, while some were operating without permission.\n\nThough the number of retail vending shops remained almost the same - between 6,798 and 6,803 during 2012-13 and 2015-16, the number of bars declined from 4,730 to 4,271 and finally to 3,877.\n\nThe State-run Tamil Nadu State Marketing Corporation (Tasmac) has a monopoly over the wholesale and retail vending of alcoholic beverages in Tamil Nadu and the revenue it generates is considered the highest contributor to the State coffers.", 
    "section": "national", 
    "title": "Liquor sale falling in Tamil Nadu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}