{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Karthigai puja, Railway Colony, 6.30 p.m.\n\nSri Meenakshi Sundareswarar Temple: Theppa thiruvizha, seventh-day event, deity procession 9 a.m. and 7 p.m.\n\nSolaimalai Murugan Temple: Thaipusa thiruvizha, fifth-day event, deity procession, Solaimalai Mandapam, Alagarkoil 10.30 a.m. and 6.30 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Sekkilar Pillai Tamil,’ by N.S. Sundararaman, S.S. Colony, 5 p.m.\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPaneeru Thirumurai Mandram: Thanigai puranam – parayanam, Adi Street, 6 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nCULTURE\n\nMadurai Kamban Kazhagam: 139{+t}{+h}monthly meeting, A. Arumugam speaks on ‘Kambanil Iru Sudar’ Sri Meenakshi Nilayam, Vasudara campus, TPK Road, 6.45 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nMaditssia Foundation (Trust): Workshop on ‘Exemptions for NPOs’ in association with Commissioner of (Exemptions), Income Tax Department, Chennai, Maditssia auditorium, 9.30 a.m.\n\nThiagarajar College: Department of Tamil conducts lecture on ‘Thirumandiram Kaatum Sivaneri,’ by A.K.S. Thirumavalavan, Tholkappiar Hall, 10.30 a.m.\n\nMangayarkarasi College of Arts and Science for Women: Inauguration of three-day entrepreneurship awareness camp, K.K. Palanivel Murugan, General Manager, SIPPO, chief guest, 10 a.m.\n\nSLS.MAVMM. Ayira Vaisyar College: Faculty development programme on ‘Management accounting,’ S. Sulthan Riswana Banu speaks, Principal M. Arunagiri presides, Devi Muthallamman Hall, 2.30 p.m.\n\nK.L.N. College of Information Technology: Inauguration of two-day hands on training in ‘designing renewable energy and power electronics devices using MATLAB,’ PSS Lab, 10 a.m.\n\nJCI Madurai Dynamic: Brain-storming and orientation programme by S.R. Arun, Hotel Western Park, 6.30 p.m.\n\nAlcoholics Anonymous: Meeting, St. Mary’s Higher Secondary School, East Veli Street, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}