{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Work on own campus in Sholinganallur likely to start this year\n\nThe Tamil Nadu Music and Fine Arts University has proposed to have certificate and diploma courses offered at off-campus centres across the State from the 2016-17 academic year.\n\n“Certificate courses for six months and diploma courses for a year will be offered at 13 off-campus centres across the State from the coming academic year. We are looking to offer a range of courses, keeping with the present needs and trends such as tattoo and mehendi designs as well as different options in dance and music forms,” said E. Gayathri, Vice Chancellor of the university.\n\nPersons who have passed class V are eligible to apply for the certificate course and those who have passed class VIII can apply for the diploma course.\n\nWhile the university is currently functioning from the campus of the Tamil Nadu Government Music College, work on an exclusive campus for the university in Sholinganallur is expected to start this year on 32 acres of land that has already been allocated by the State government.\n\nIn a first, the university, along with the South Zone Cultural Centre, Thanjavur, is set to host a two-day national conference on ‘Naveena Sampradaya’ on January 20 and 21.\n\n“The conference will have eight performances that include fusion music, new choreography in kuchipudi and innovation in percussion. The interactive performances have been selected on the basis of the fact that students can be exposed to the latest trends in performing arts and imbibe the same,” said Ms. Gayathri.\n\nA one-day national seminar on the objectives of the gurukula and institution-based education in music and dance is also scheduled for January 22 where faculty members and research scholars are to present papers.\n\nVarsity to host national meet\n\non ‘Naveena Sampradaya’ on January 20, 21", 
    "section": "national", 
    "title": "Music and Fine Arts University to offer 13 off-campus courses", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}