{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Erode district will soon witness launch of Native Angels Network (NAN), the network of New Age Angel Investors.\n\nLike-minded industrialists in the district have joined hands to float the forum: NAN - Erode Chapter, for fostering start-ups, with guidance from NAN, the country’s first Native-Region-Focussed Angel Investment Network initiative designed for Tier II and III regions.\n\nThe investment facilitation platform is supported by its parent body Nativelead Foundation that towards strengthening new-age entrepreneurship ecosystem development in non-metro locations.\n\nStrategy\n\nWorking on a four-pronged strategy: enabling, nurturing, incubating and investing, the architecture of NAN is based on the co-creation principles, governed by respected and efficient regional Governing and Consultative councils.\n\nThe Erode Chapter of NAN will be taking shape after successful launches in Madurai, Tiruchi and Coimbatore chapters in the past one year with 92 active angel investors (as on November 2015), according to Sivarajah, Founder Director, Nativelead Foundation.\n\nGoverning council\n\nA Governing Council has already been formed with Devarajan (URC Group), Kumar(CD Group), Sivakumar (SKM Group), Rafik (KKSK Group), Dattatreyan (LVB), Paramasivan (Synaptris Technologies), and Susindran (Sabari Group, Karur) on the board to drive the operations.\n\nThe first term will be headed by Anand of MSK Group in the capacity of Chapter Chairman and Radhakrishnan of Angel Starch and Chemicals as Vice-Chairman.\n\nNAN will identify, invest in and mentor start-up enterprises that are disruptive, scalable and would add value to the local economy. Developed economies have already discovered the power of angel investments, in supporting start-up enterprises. In India, metros such as Mumbai, Chennai and Bangalore have been attracting the attention of angel investors in recent times. The Movement has seen like-minded individuals coming together to create networks for young entrepreneurs to grow, Mr. Sivarajah said, adding: “ With its emphasis on socio-economic development, NAN aims to help young entrepreneurs who have innovative ideas and ability, but lack of financial resources and mentoring to realise their entrepreneurial dreams and contribute to the economies of their native regions.”\n\nLike-minded industrialists in the district have joined hands to float the forum", 
    "section": "national", 
    "title": "Native Angels Network set for early launch in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}