{
    "author": [
        "S Prasad"
    ], 
    "text": "Flower varieties arrive from various research institutions\n\nThe century old Government Botanical Garden in the city has been decked up for the 30{+t}{+h}Flower, Vegetable and Fruit show cum Farm Fest 2016. More than 150 varieties of flowers and plants, including indigenous and exotic varieties will be on display during the four-day event which begins on January 23.\n\nPreparations for the show are in the final stages and flowers have started arriving from Bengaluru, Pune and other research institutions across the country. As many as 12 varieties of roses from Pune and Bengaluru, mocara orchids imported from Thailand, varieties of anthuriums, dahlia, marigold, petunia, zinnia, Chinese balsam and other foliage plants would be showcased on the premises.\n\nFloral arrangement, Japanese Ikebana arrangement, cut-flower collection and arrangement, fruit and vegetable carving, replicas of vegetable garden and orchards which have been created by the Department of Agriculture and other institutions will be the major attractions of the exhibition, said a senior official of the Department of Agriculture.\n\nOver 15,000 flowering plants cultivated at the Government Horticulture Nursery in Lawspet including varieties of gerbera would also be showcased at the flower show which would be inaugurated by Chief Minister N. Rangasamy. The Department has also planned replica of Aayi mandapam, official emblem of the Government and prominent heritage buildings.\n\nThe four-day event is a platform for research institutions to showcase technological developments in floriculture for the benefit of farming community and visiting public. Various competitions are being organised and prizes will be given for each event, the official said.\n\nAround 70 stalls are being put up at the premises with areas earmarked for cut flower collection and arrangements, fruit and vegetable carvings, aromatic and medicinal plant collections and glass house plants. Institutions and individuals will also be showcasing exotic varieties during the event.\n\nThe Botanical Garden (Le Jardin Botanique) established in 1826 by French botanist G.S. Perrottet encompasses 11 hectares of natural bounty that features indigenous and exotic flora ranging across evergreen, semi-evergreen, deciduous and tropical dry evergreen species.\n\nWith a history spanning 189 years, the Botanical Garden is among the oldest on the Coromandel Coast, and perhaps the only one of its kind on the East Coast.\n\nThe collection includes over 2,400 trees, 213 genus types and 296 species.", 
    "section": "national", 
    "title": "Over 150 varieties on display at flower show", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}