{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Perumattunallur panchayat president K.S. Ravi provides Rs.1.50 lakh to open accounts under Selvamagal Semipu\n\nTo inculcate thrift in residents of his village, K.S. Ravi, president of Perumattunallur panchayat in Kancheepuram district, has spent nearly Rs.1.50 lakh from his pocket to open Selvamagal Semipu postal savings accounts for girl children. The accounts were opened in the nearby Kannivakkam post office. The deposit scheme, launched exclusively for girl children last year, provides an interest rate of 9.3 per cent. It allows parents to deposit from a minimum of Rs.1,000 to a maximum of Rs.1.50 lakh every year.\n\n“When we made an announcement about the scheme, not many came forward to enrol their children as they could not afford it. And therefore, I decided to deposit an initial amount of Rs.1,000 for 150 girl children. Being part of this savings scheme will secure the future of these girl children who come from underprivileged families,” said Mr. Ravi.\n\nPerumattunallur, is located 3 km from Guduvancherry and comes under the Kattankulathur Panchayat Union.\n\n“Most of the villagers are agricultural labourers. I just wanted to contribute towards the long-term benefit of the people. I plan to sponsor an initial amount to enrol 150 more girls below 10 years of age in the scheme next month,” he added.\n\nOfficials of the Postal Department said Mr. Ravi had helped 108 girl children open accounts on the first day. Subsequently, he helped 42 more girls, they added.\n\nThe amount credited to the account will accrue every year and the depositor may withdraw cash after 21 years or during the girl’s wedding.\n\n“We have written to the State to recognise this noble initiative of Mr. Ravi. He has set an example by helping girl children from underprivileged families to have a better future,” said Mervin Alexander, Postmaster General, Chennai city region (CCR). In the last year, nearly 4,11,900 accounts have been opened with a deposit amount of Rs.142 crore in the CCR.\n\nK.S. Ravi has spent nearly Rs.1.50 lakh from his pocket to open the accounts for children", 
    "section": "national", 
    "title": "Panchayat head helps 150 girls open postal savings accounts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}