{
    "author": [
        "Special Correspondent"
    ], 
    "text": "As a precautionary measure, heavy police pickets were posted in Koolamedu and surrounding villages\n\nThe police were able to thwart villagers of Koolamedu village and surrounding areas from conducting jallikattu on Monday.\n\nKoolamedu village is famous for holding jallikattu in the western region for many decades. The people of this village planned to hold jallikattu as soon as Centre issued notification which favoured holding of this sport, on January 18.\n\nHowever, the ban imposed by the Supreme Court shocked the local people.\n\nAs a precautionary measure, heavy police pickets were posted in Koolamedu and the surrounding villages to prevent the people from staging this event. The police officials held discussion with the local people on Sunday and informed them about the Supreme Court ban.\n\nSome people brought the jallikattu bulls in lorries in the early hours of Monday. However, the police and the local organisers sent them back. The police pickets were there throughout the day.\n\nTwo booked for\n\nhunting fox\n\nMeanwhile, the forest personnel booked two persons on charge of hunting ‘vanga’ fox (vanga nari) for holding fox jallikattu in Padayachiyur village abutting the reserve forests near Vazhappadi.\n\nThe fox jallikattu was conducted every year in connection with Pongal and the Forest Department had banned the event, citing Supreme Court guidelines.\n\nDespite the warning, some people of Padayachiyur village entered the reserve forests on Saturday night and managed to catch hold of a fox.\n\nThe local people conducted the fox jallikattu in the village on Sunday without the knowledge of the forest officials.\n\nOn a tip-off, the forest personnel made enquiries in the village and booked two youths, Sasikumar and Anandbabu, both of Padayachiyur, on charge for hunting the fox.\n\nThey slapped a fine of Rs. 25,000 on each of them.\n\nThe ban imposed by the Supreme Court had\n\nshocked the\n\nlocal people", 
    "section": "national", 
    "title": "Police thwart attempts to hold jallikattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}