{
    "author": [], 
    "text": "The District Employment Office would host a private placement camp at its office in the city on January 21. Candidates would be recruited for various posts such as sheet metal turners, machinists, welders and fitters by SIMCO Engineering Pvt.Ltd. and Anand Engineering Pvt.Ltd, according to a press release from C.Tamilselvi, Deputy Director, District Employment Office. Candidates with ITI certificates, diploma and those with SSLC and Plus Two can participate in the placement fair. The candidates can appear with their original certificates and two passport size photographs at 10 a.m. at the office to participate in the camp, the release added.\n\nFarmers plan to\n\nfloat company\n\nGroundnut farmers were encouraged to float a farmers’ producers company to pool their resources and achieve better returns on their produce at a consultative meeting convened by officials of the Department of Agri Business at Manapparai. Speaking at the meeting, N.Sarfudeen, Deputy Director, Agri Business, Tiruchi, explained the opportunities for better marketing, reducing cultivation costs by pooling of resources and bulk purchase of raw materials, value addition and better marketing. He also explained to the farmers on the financial support available from the government. Farmers who participated in the meeting resolved to float a company soon, according to a press release.\n\nContests for school and college students\n\nThe Department of Tamil Development would conduct essay writing, poetry and oratorical competitions for higher secondary and college students at the Jamal Mohamed College here on January 27 and 28. The contests for college students would be held at the on January 27 and for higher secondary students on January 28. Each institution can nominate one student for each of the competition. Candidates with the bonafide letter from the heads of the institutions should register their names at the venue at 9 a.m. on both days. Top three winners of the events would be given cash prizes of Rs.15,000, Rs.10,000 and Rs.12,000 respectively. First prize winners would qualify to participate in the state level competitions held to foster the creative talents of students, a press release said.", 
    "section": "national", 
    "title": "Private placement camp on January 21", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}