{
    "author": [], 
    "text": "Tiruchi airport is an old airport and is centrally located in the State. During his recent two-day visit, the Civil Aviation Minister has reviewed various issues relating to the development of the airport, including expansion of the runway and inclusion of the city under Bilateral Air Service Agreement (BASA). The airport authorities and the State government should follow it up with the Civil Aviation Ministry. Air India Express should re-introduce Tiruchi-Mumbai-Tiruchi flight whenever they plan their schedule in future.\n\nK. Muthuswamy,\n\nTiruchi\n\nTraffic chaos\n\nin Srirangam\n\nVehicular traffic in Srirangam has increased manifold in the last few years because of a spurt in tourist arrivals. However, management of traffic leaves much to be desired. The tourist vehicles are parked haphazardly on the Ammamandapam Road. Private buses create chaos all times of the day. The narrow road at the terminus is constantly blocked because of the unhealthy competition between the buses. Traffic jams are the order of the day near the bus terminus. The usage of air-horns by private buses is another irritant causing immense stress to residents living nearby. The buses belonging to educational institutions are driven in a rash manner. Effective policing at the bus terminus is needed.\n\nJ. Anantha Padmanabhan, Srirangam\n\nStray dog menace\n\nStray cattle and dogs are abound in Tiruchi. There are many stray horses roaming the streets. Because of the poor disposal system and the inadequate bins, garbage is strewn around and the animals feed on them. If there are garbage containers, the accumulated garbage is cleaned only once in two or three days because of the dearth of manpower and vehicles. As such these garbage containers are overflowing and the garbage is strewn all over the area and the area has become an abode of stray animals.\n\nH. Ghouse Baig,\n\nEdamalaipatti Pudur\n\nThe number of stray dogs is increasing in the streets particularly at Saraswathi Nagar in ward No. 35. They bark continuously at night which causes the residents suffer. Action should be taken by the authorities to check the menace.\n\nA. Palanichamy,\n\nTiruchi\n\nStray dog menace at Crawford Colony is assuming alarming proportions. Rabid dog bite on evening walkers has been reported recently. Repeated appeals to the civic authorities in these columns to take steps to end the menace has not produced any result. While it will be inhuman to kill them, a campaign could be taken up to sterilise the dogs.\n\nM. Nagarajan,\n\nCrawford\n\nWater scarcity at\n\nTiruvanaikoil temple\n\nPeople from across the country throng Tiruvanaikoil. But the drinking water supply is inadequate. Tourists are put to hardship. Will the HR and CE Department look into this matter?\n\nMurugappan S.P.,\n\nNo 1 Tollgate, Tiruchi\n\nProvide seat numbers\n\nI travelled to Chennai by Guruvayur Express on January 9. When I entered the coach, I could not find the seat number either on the back of the seat or on the window in the D2 coach. I had to take the help of ticket examiner to get the seat as some other passenger had occupied it.\n\nI request the railway authorities to provide seat numbers in reserved coaches.\n\nA. Mohamed Irfan,\n\nTiruchi\n\nAlms in name of\n\ndivine characters\n\nAble-bodied people from North India begging alms by wearing the costumes of divine characters have become common on city roads. I could spot at least five in various parts of Tiruchi on the same day. A few years ago, it was few and far between. It is time such practices are discouraged.\n\nA.V. Narayanan,\n\nThillainagar\n\nJallikattu politicised\n\nSince this is an election year, all parties are politicising the jallikattu issue to get votes. We have seen many persons are injured and some have died during the events.\n\nDimple R. Mohan,\n\nMahalakshimi Nagar East Extension\n\nStray cattle\n\nin K.K. Nagar\n\nStray cattle roaming the roads of K.K. Nagar at night pose danger to the vehicles. Poor illumination makes it difficult for drivers to spot them. Corporation should provide helpline number so that it becomes easy for the civic body to deal with this problem.\n\nMubashir,\n\nAnbil Nagar\n\nRevive bus stand\n\nproject\n\nThe Tiruchirapalli City Corporation has stopped construction of a bus stand at K.K. Nagar terminus. It is a long-pending demand form the public, which was once a dream. Hawkers are using the unfinished bus stand. Will the corporation officials take a look at the project and finish it quickly?\n\nB. Balaji,\n\nKurinji Nagar\n\nBuild speed-breaker\n\nOn Kaanum Pongal day, two autorickshaws were racing in the curve where Mambazha Salai junction. The vehicles collided and the passengers were hurt. This highlights the need for a speed-breaker at the spot. No policeman was around there. When tourist buses are parked, policemen chat with the bus drivers. I appeal to the authorities concerned to enforce traffic rules at this spot and build a speed-breaker.\n\nT.M. Ranganathan,\n\nSrirangam\n\nHave roundtana\n\nof right size\n\nThe temporary roundtana at the MGR statue, Cantonment, Tiruchi, should be of right dimension. Only then will there be smooth flow of vehicular traffic in this area. Will the district authorities look into this matter at the right time and execute it well?\n\nC. Ramalingam,\n\nWoraiyur\n\nPost a constable,\n\nprotect pedestrians\n\nAlthough a traffic signal has been installed near Mainguard Gate, many vehicles do not adhere to it and pedestrians find it difficult to cross the road. All buses and vehicles coming from Holy Cross College side turn near the church and the people have to wait for long to cross the road. Unless a traffic constable is posted on this side to regulate the traffic, there is every possibility of pedestrians meeting with accidents.\n\nJanaki S. Raj,\n\nRockfort", 
    "section": "national", 
    "title": "Re-introduce flight to Mumbai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}