{
    "author": [], 
    "text": "Withdraw 50 paise\n\nPublic nowadays do not attach any value to 50 paise coin. Even government offices and commercial banks do not entertain any transaction with 50 paise coin. Thus, this coin has become obsolete. Therefore the Reserve Bank of India must take a decision on this coin and arrange to withdraw it from circulation early. A time of 30 days may please be given to the public to exchange the coins in banks.\n\nK. Somasundaram,\n\nDevakottai\n\nRemove electric pole\n\nIn Paramakudi, a bypass road runs by the Vaigai riverbed for convenience of vehicles. Unfortunately, a live electric post stands in the middle of the road, posing a threat to public. Hundreds of vehicles pass through this stretch and if the pole is not removed, it will cause accidents, resulting in loss of lives. I appeal to the highways authorities and Tangedco officials to take immediate action to remove the pole.\n\nAsmabagh Anvardeen,\n\nRamanathapuram\n\nFlex board menace\n\nBoards and banners made of flex sheets are very much affordable and anybody can make them with little spending. Unfortunately these boards are kept in predominant places where they can cause maximum annoyance to the public. Government authorities preach that everybody should avoid polythene carry bags. The same authorities use flex banners for every celebration. The most unfortunate thing is that nobody cares about the board once its use is over. Who is monitoring the disposal of flex boards after the event?\n\nThere is no disposal mechanism established for this. Once a flex sheet is printed it cannot be reused. The user simply throws it away.\n\nThe toxic dyes in the board and polythene are harmful. During the Chennai floods it was evident that most of the drainage blocks were caused by polythene waste, mainly flex sheet.\n\nB. Harikumar,\n\nNagercoil\n\nSmart card\n\nThe State government pensioners, who had been enrolled in the new health insurance scheme, were informed that a smart card would be issued to them in due course.\n\nNow the insurance company has dumped the cards with the treasury.\n\nMany senior citizens approaching the treasury return empty handed as they are informed that their cards had not been received.\n\nWill the government issue direction to the company to despatch the smart cards to the pensioner’s residential address directly?\n\nThe cards left with the treasury may also be sent by post to the pensioners.\n\nP. Ganesan,\n\nKartigavadali", 
    "section": "national", 
    "title": "Readers’ Mail (Dindigul)", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}