{
    "author": [], 
    "text": "Message code\n\nIn the recently printed combined money order form, codes are given for 21 messages.\n\nI request the authorities of the Department of Posts to include a message code for Wish you a Happy Christmas since it is an important festival for Christians. Similar inclusion can be made in Tamil money order form also.\n\nR. Augustine Selvaraj,\n\nSundar Nagar.\n\nUse of mobile phone\n\nOf late, it is common to see two-wheeler riders speaking on the mobile phone and even dialling while driving their vehicles.\n\nThe practice, along with speeding, poses a grave threat not only to the riders but also those who follow traffic rules.\n\nThe authorities concerned also are not taking a serious view of this traffic violation. Awareness of this menace should be created among road users to prevent accidents.\n\nS. Muthukumarasamy,\n\nTirupparankundram.\n\nTelescopic tickets\n\nRecently, I had to visit Ahmedabad on a Friday.\n\nSo I planned my journey to leave Madurai on Tuesday night to reach Ahmedabad on Thursday night by Pandiyan Express to Chennai and onward journey by Navjeevan Express as there was a direct train to Ahmedabad from Madurai only on Friday night or Sunday night.\n\nBut, to my surprise, the railway booking clerk refused to issue tickets as per my plan, saying that as per rule if there is a direct train on a particular route telescopic tickets will not be issued.\n\nBut I was asking for tickets on days when the direct train was not operated.\n\nBy this rule, one has to buy separate tickets for each leg of journey and pay extra money for the only reason that the railways cannot operate the train daily.\n\nDevi Prakash,\n\nSouth Avanimoola Street.\n\nStray dog menace\n\nAt a recent meeting of the Madurai Corporation Council, it was refreshing to find a Zone Chairman raising the issue of stray dog menace (Jan. 13). Admittedly, this is a sad reflection on the inadequacy of steps aimed at beating the menace of uncommonly increasing stray dogs in almost every locality.\n\nV. Krishnamoorthy,\n\nNarayanapuram.\n\nPaint the city\n\nThe talk of the town is Smart City.\n\nApart from making our city smarter, it should be made to look beautiful and graceful in all respects. Numerous government organisations in the city have lengthy compound walls.\n\nThese walls can be given to the so called street artistes, along with an apt theme. For example if it is the property of railways, the compound wall should reflect the history of railways with lovely paintings.\n\nThe local body can rope in sponsors for the supply of materials and painting charges.\n\nAll city buses should reflect the heritage and history of Madurai.\n\nS. Bala,\n\nTVS Nagar.\n\nAcademic ‘untouchability’\n\nIn the present academic arena, a kind of academic ‘untouchability’ is rearing its ugly head. In government-aided private educational institutions, teachers are paid reasonable salaries. But in self-financing colleges, they are paid just one fourth or even lesser salary than their counterparts with the same qualification.\n\nAs a matter of fact, the work load for them is more and service conditions are miserable. In a large number of self-financing institutions, the teachers are asked to do office work also. In some institutions, vacation salary also is not given.\n\nThe government authorities seem to wink at the human rights violation in the form of more work and miserably low pay, and no security whatsoever in a large number of self-financing educational institutions. Only a very few institutions care for their staff.\n\nM.Vathapureeswaran,\n\nAnna Nagar.", 
    "section": "national", 
    "title": "Readers’ Mail (Madurai)", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}