{
    "author": [
        "T Madhavan"
    ], 
    "text": "Traffic movement was particularly sluggish on Chennai-Tiruchi highway\n\nRestrictions were imposed on movement of vehicles from side roads leading to GST Road to clear the traffic jam—Photo: G. Krishnaswamy\n\nWith many residents returning home after spending their Pongal holidays outside Chennai, there was a surge in traffic on all National Highways and State Highways leading to the city, on Sunday night and Monday morning.\n\nNational Highway No. 45 connecting Chennai and Tiruchi was choked with vehicles on Monday morning, and vehicular movement was sluggish till noon. More than 200 policemen deployed between Chengalpattu and Tambaram were struggling to control the heavy flow of traffic.\n\nLikewise, the Bangalore-Chennai Highway and the East Coast Road were choked with traffic, and most of the buses arrived in Chennai two hours behind schedule. At some toll gates, vehicles were seen in two-km-long queues.\n\nThere was heavy traffic congestion at Perungalathur, as most of the traffic from the southern districts passes that way. The National Highway near Ambur was blocked by angry residents and commuters, following an accident, and traffic was held up for nearly three hours. According to an official, the State government alone operated 4000 buses every day during the Pongal holidays. This apart, private bus players had also increased the frequency of their services.\n\nGST Road, Sardar Patel Road and Jawaharlal Nehru Salai also witnessed an increase in traffic as early as six in the morning.\n\nJamal F., a private bus conductor, said there was heavy traffic on Sunday afternoon on NH45, NH4 and East Coast Road, as vehicles queued up for more than a km at all toll plazas, despite each of these having three or four counters.\n\nPavithra Krishnan, a resident of Tambaram, said traffic from Guduvanchery to Perungulathur was moving at a snail’s pace. It took almost one-and-a-half hours to cross a distance of two-and-a-half kilometres, she added.\n\nTraffic policemen posted on the stretch could do nothing about the traffic snarls, which were cleared after placing some restrictions on movement of vehicles from side roads leading to GST Road.\n\nTraffic was diverted via Outer Ring Road near the Vandalur overbridge, which reduced the traffic congestion at Perungalathur to some extent.\n\nA senior police officer said since it was the only entry point from southern districts and due to increase in the number of special bus services, traffic multiplied.\n\nHe added that they had placed a number of barricades at various points to regulate traffic, which had been removed by some miscreants. After these things were set right, traffic returned to normality, around noon, he said.", 
    "section": "national", 
    "title": "Roads choked as residents return home after Pongal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}