{
    "author": [
        "Deepa H", 
        "K Lakshmi"
    ], 
    "text": "However, work on the first has put motorists and pedestrians to a lot of inconvenience\n\nEven as the construction of a second flyover at the Retteri junction on Jawaharlal Nehru Salai is likely to commence soon, ongoing work on the first flyover there has affected traffic considerably. Tenders have been invited for the Rs. 29.12-crore second flyover. Work may commence in a few months.\n\nThe ongoing work on the first flyover at the same junction is expected to be completed by June, ahead of its December deadline, said officials of the State Highways Department.\n\nAlong with work on the existing flyover, work on stormwater drains, a pedestrian subway and three minor bridges is also being taken up at a combined cost of Rs. 52.72 crore.\n\n‘Harrowing experience’\n\nMeanwhile, motorists using the stretch have been complaining that getting past the junction during rush hour is a harrowing experience. With the project taking up a major portion of the carriageway, motorists say they have to struggle for space with vehicles on the narrow stretch. Vehicles pile up on Jawaharlal Nehru Salai and Red Hills Road for over half a kilometre.\n\nMotorists from Retteri do not get a clear view of the traffic from Padi especially if vehicles jump signals. They want more traffic personnel to be deployed to check violations. S. Andrew of Lakshmipuram, said: “I have to wait for over 15 minutes to cross the junction from Retteri to Kolathur or Padi. Traffic gets chaotic during rush hour. Heavy vehicles and share autorickshaws also occupy lot of space.”\n\nOn an average, about 50,000 vehicles travel past the junction that links the western and northern parts of the city. Several school students use the junction to reach institutions in Kolathur and Perambur. With bus stops shifted to make way for the flyover work, commuters are forced to wait on the carriageway. Pedestrians are the worst affected as there is hardly any space to walk.", 
    "section": "national", 
    "title": "Second Retteri flyover: tenders called", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}