{
    "author": [
        "K Manikandan"
    ], 
    "text": "Chennai Metropolitan Development Authority on Monday placed under ‘lock and seal,’ shops of several flower merchants on Badrian Street, Flower Bazaar.\n\nWhile CMDA officials said they were acting on an order from the Madras High Court, merchants alleged that the State government was selectively targeting them. Badrian Street has been an important destination within the city for individuals and small merchants seeking to buy flowers, since 1998, the merchants said.\n\nA large number of policemen were deployed on Badrian Street as staff from CMDA locked the shutters of over 50 shops, big and small. Traders were angry at the government clampdown on small traders. “We were not given advance notice. There are over 150 traders – some have shops and others are hawkers. This will rob us of our only means of income,” said V.Kumar, a trader.\n\n“We were evicted from the market in Broadway and those who could not afford to buy or rent out a shop in Koyambedu stayed back and we have been here since 1998. They have not disturbed the wholesale grain, pulses and fruit markets in Kothawalchavadi. Why are they targeting us alone?” Mr. Kumar asked.\n\nDependent on these traders on Badrian Street are several hundred people like P.Bhanumathi, who buys flowers here and sells them at the Triplicane market on Singarachari Street. “I buy flowers for around Rs. 750. If I manage to sell them all on a good day, I take home about Rs. 300, else my average daily income is only Rs. 150,” she says adding that roadside flower sellers are dependent on traders on Badrian Street alone.\n\nM. Kaveri, a woman who sells Tulsi and other herbs, said that for flower sellers in North Chennai, it was not possible to travel to Koyambedu and get back home on time. Officials said they were acting on a specific order of the HC and the traders had no other option but to shift to the wholesale market complex in Koyambedu.", 
    "section": "national", 
    "title": "Shops of flower merchants on Badrian Street sealed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}