{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Six youngsters, including an engineering student, a BPO employee and a man working at Coimbatore airport, were nabbed by officials of the Madurai Forest Division on Monday for allegedly attempting to sell a live sand boa through online advertisements.\n\nThe officials said that the snake was caught by M. Prakash (23) from Udumalaipet in Tirupur district.\n\nPrakash, along with two other accomplices, allegedly posted an advertisement in a website, often used by such offenders.\n\nMeanwhile, three men from Chennai, including an engineering student from a renowned college, touched base with Prakash to act as intermediaries for finding potential customers with the aim of selling it for Rs. 6 lakh to Rs. 8 lakh.\n\nDistrict Forest Officer Nihar Ranjan said that the department officials, with the help of informers, pretended as buyers and lured the gang to come to Madurai.\n\nWhen the men reached here from Coimbatore and Chennai on Monday morning, they were nabbed by the forest department officials.\n\nSnake confiscated\n\nThe sand boa they were carrying was also confiscated.\n\nMr. Ranjan said that the youngsters were trying to make quick money. The officials alleged that Prakash acted as the kingpin, and he had already sold at least two sand boas.\n\nCommonly found snake\n\nMr. Ranjan said that sand boas were among the most commonly found snakes. “Poachers attempt to sell them for huge money by attributing false medicinal and other superstitious qualities to them,” he said.\n\n“Although the snakes were not worth the money, some buy them for large sums with the hope that they can sell them to others for even higher amounts,” he added.\n\nOfficials said that sand boas were protected under Schedule IV of the Wildlife Protection Act.\n\nCases were booked against the six persons, who were later let off with hefty fines as the offence was compoundable.", 
    "section": "national", 
    "title": "Six held for bid to sell sand boa online", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}