{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Coimbatore Corporation’s animal birth control (ABC) centre has become the bone of contention among the civic body, Ukkadam residents and the agency that has been carrying out the programme.\n\nMany in Ukkadam allege that the People For Animals Unit-II is letting out the dogs in the area after surgery. The dogs are brought to the centre various parts of the city . They allege that these dogs jump over the centre’s compound wall at night, and chase people who take the road to reach home.\n\nA. Abdul Rahman, a resident of Arul Nagar, complains that the dogs have scared him on several occasions but he has been lucky.\n\nHis neighbours Fathima and her husband Suleiman were not as they fell off a two-wheeler and suffered injuries while trying to escape the dogs.\n\nA. Sadiq Ali, Councillor, says that the residents have for long been demanding that the Coimbatore Corporation address the problem. Venturing out is turning out to be a hassle.\n\nThe residents want the civic body to either raise the height of the centre’s compound wall so that dogs don’t jump out, or shift out the centre.\n\nPeople for Animals’ managing trustee V. Kalpana says that the residents’ allegations are false as the centre has been sending back the dogs to the places from where they were caught, according to rules.\n\nIf their allegations are true then there should be hundreds of dogs in the area.\n\nSurgery has been performed on the dozen or so dogs that are present in the area, she adds.\n\nCoimbatore Corporation officials say that there is some truth in the residents’ allegations but to say that the centre releases the dogs there after surgery is untrue. The civic body will soon increase the height of the compound wall.\n\nPeople for Animals will complete the animal birth control programme in North, East, South and Central zones.\n\nMs. Kalpana says that surgery was performed on 15,000 dogs in the last two-and-half years. Surgery should be performed on another 8,000 dogs.\n\nThere are two veterinarians and eight trained dog catchers at the centre.\n\nThe Humane Animal Society has performed surgery on 1,396 dogs during April to November 2015 in West Zone.", 
    "section": "national", 
    "title": "Stray dogs continue to create problems", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}