{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Tamil Nadu is the leader among States in the use of bio-fertilizers, an organic substitute for chemical fertilizers. Data compiled by the National Centre of Organic Farming says that the State produces over 14,000 bio-fertilizers a year.\n\nProduction of bio-fertilizers can safely be equated with usage because the State produces only as much as it consumes and therefore the State tops the country, says D. Balachandar, Professor, Department of Agricultural Microbiology of Tamil Nadu Agricultural University.\n\nMost of the State’s production is from the eight Agriculture Department-owned facilities across the State. Farmers use those bio-fertilizers or bio-inoculants as a substitute for NPK (nitrogen-phosphorous-potash) fertilizer in paddy and a number of crops to increase yield.\n\nMr. Balachandar says that a hectare paddy would require 240 kg NPK and this would cost farmers over Rs. 1,000. If the farmers were to use bio-inoculants, they would spend only a couple of hundred rupees.\n\nThis is not the only savings, though.\n\nIncrease in yield\n\nThe use of bio-inoculants will result in increase in yield by 10 per cent to 15 per cent. This will be additional income for the farmers.\n\nThe larger picture is that the State will have to spend less on fertilizers and also fertilizer subsidy, says the University Vice-Chancellor K. Ramasamy.\n\nThe University has calculated that by actively promoting bio-inoculants, the State can save over Rs. 200 crore a year. But the sad part is that farmers use the organic substitute on only 10 per cent of the 5.9 million hectare of cultivable area.\n\nFarmers use the bio-inoculants on almost all crops that are cultivated in the State. The Agriculture Department encourages the use in three ways – treating seeds before plantation, administering those on roots and using on soil.", 
    "section": "national", 
    "title": "TN tops in use of bio-fertilizers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}