{
    "author": [
        "Staff Reporter"
    ], 
    "text": "There would be traffic regulations for the Maha Kumbabhishekam of Abirami Amman Temple here on January 20, Superintendent of Police A. Saravanan said.\n\nIn a press release here on Monday, he said that adequate number of parking lots had been created for devotees at various places. All vehicles, including two-wheelers, would not be allowed between Periyar statue and Clock Tower; between PWD office, RS Road and Clock Tower; Fire office and Mochaikottai Vinayagar Temple; Kumaran Park and Clock Tower, Vanivilas Road, Mochaikottai Vinayagar Temple and Ilai Kadai junction; North Car Street and 108 Vinayagar Temple junction; Jamuna Coffee Bar and Eswari lodge; Palani Vasanthi and Co junction and Pangali market junction; and GH south gate and Pangali market junction.\n\nTraffic diversion\n\nBuses going to Palani, Vedasandur and Salem from Central bus stand will pass through Kamaraj Statue, Anna statue, St. Joseph’s hospital, Nehruji Nagar roundabout, MVM Railway Gate, Nivis Mahal, Chettinaickanpatti junction and Anjali roundabout to reach Salem Highway.\n\nBuses coming from Palani to Dindigul bus stand will pass through Palani bypass road, Batlagundu bypass road, Begampur, Yanai Theppam, Angu Vilas Irakkam, Daily Thanthi roundabout, Nagal Nagar and Scheme Road to reach central bus stand.\n\nParking bays\n\nDevotees coming from Madurai Road should park their vehicles at the ground opposite Dindigul South police station after passing through Thomayarpuram, Begampur and fire office.\n\nDevotees from Natham Road should park their vehicles on Mettupatti church campus after passing through Nagal Nagar bridge, Treasury Road and Mettupatti Kaliamman Temple junction.\n\nDevotees from Palani Road should park their vehicles at Lorrypet after passing through Palani bypass road, Vaishanavi Amman Temple and Murugabavanam.\n\nPilgrims from Vedasandur Road must park their vehicles on Achutha School ground after passing through MVM College. Pilgrims from Tiruchi Road have to park their vehicles along R.M. Colony 80 Feet Road after passing through NGO colony, railway over-bridge and Nehruji Nagar roundabout.\n\nVehicles coming from old Karur Road also can be parked on 80 feet road after passing through Nehruji Nagar roundabout, the release added.", 
    "section": "national", 
    "title": "Traffic regulations for kumbabishekam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}