{
    "author": [], 
    "text": "Programmes like PULSE which disseminate knowledge of optical science lauded\n\nPondicherry Central University has also been appreciated by the Optical Society of America.— Photo: T. Singaravelou\n\nThe Pondicherry University has been recognised for its contributions to celebrations of the UNESCO-declared International Year of Light and Light-based Technologies 2015 by the international organising body of the event.\n\nIn a letter from the IYL2015 Global Secretariat, Abdus Salam International Centre for Theoretical Physics, Italy, the organisers have commended the event ‘Reflection 2015’ held at the university, stating it was ‘in line with the spirit of the year’ and helped in highlighting the importance of light and optical technologies for the future and development of society.\n\nThe university has also been appreciated by the Optical Society of America (OSA) for its contribution in the promotion of optical science and Optics education through its Student Chapter, said a press release.\n\nThe Student Chapter which functions from the Department of Physics and is funded by the OSA, has been commended for its outreach programmes like the Pondicherry University Light Science Education (PULSE) which disseminates knowledge of optical science in the local community and emphasises the importance of optics and photonics.\n\nThese programmes have also developed leadership skills among participants, said the release.\n\n‘Develop passion\n\nfor knowledge’\n\nThe very purpose of education is to develop a passion for knowledge and be of service to the community, said S. Manian, Vice-Chancellor, Annamalai University, during his keynote address at the Graduation Day of the Periyar Government Arts College, Cuddalore, held on January 8. He asked students to be cautious about negativity and asked them to listen to their inner voice for guidance, said a press release from the college.\n\nA total of 639 undergraduate students and 262 postgraduate students belonging to various streams were awarded degree certificates by Mr. Manian.\n\nCollege Principal V.N. Viswanathan delivered the presidential address.\n\nStudents E. Sathish, J. Devika, P. Kalaimathi, J. Mohanalakshmi, S. Ilayarani, S. Indumathy, A. Adhilakshmi, and B. Janaki were awarded gold medals for securing University Rank in the Thiruvalluvar University examinations conducted in 2014.\n\nWorkshop on Android held\n\nThe Post Graduate and Research Department of Computer Science and Computer Application, Marudhar Kesari Jain College for Women organised a one-day workshop on “Android” on January 12. Experts explained the basic and technical aspects of Android and its uses to the students. D. Karunakaran, director, and G. Dhanasekaran, principal of the college were present, a press release said.\n\nVIT University celebrates Pongal\n\nStudents from different States and abroad celebrated Pongal festival in VIT University last week. Organised by Pavendar Bharathidasan Tamil Ilakkiya Mandram of the university, the celebration witnessed folk arts and rural sports of Tamil Nadu such as karagattam , silambam , oyilattam , bharathanatyam , uriyadi , procession on bullock carts, Carnatic music and performance with tharai thappattai , a press release said.\n\nVIT University Chancellor G. Viswanathan, vice presidents Sekar Viswanathan and G.V. Selvam and vice chancellor Anand A Samuel were present.\n\nReporting by\n\nAnnie Philip and\n\nSerena Josephine M.", 
    "section": "national", 
    "title": "Varsity recognised for contributions to optics", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}