{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Kasturi Munirathnam, who alleged that her hand was chopped off by her Saudi Arabia employer, appealed to the Collector to take steps to get compensation and information on her case status on Monday.— Photo: C. Venkatachalapathy\n\nAfter losing her hand while working as a maid in Saudi Arabia, 55-year-old Kasturi Munirathnam on Monday has petitioned the Collector seeking compensation from her employer and financial assistance from the Central government. She also requested for information about the status of her case through the Union Ministry of External Affairs.\n\nA resident of Moongil Eri in Vinnampalli post, Ms. Munirathnam had left Vellore to work as a domestic maid in Saudi Arabia in July-end last year. Two months later, she was hospitalised after her employer allegedly chopped off her right hand.\n\n“I went to Saudi Arabia to work as a maid due to mounting debt. We sold our house, and were unable to repay our loans. My employer did not like me from the beginning. I was ill-treated and not provided food during the two months that I worked there,” she said.\n\nIt was when she tried to flee from the house that she lost her hand, she said. “I requested help from a boy, hailing from Tamil Nadu, who worked in a neighbouring house. But he, instead of helping me, told my employer that I was planning to flee. I was locked up in my room, and I used saris to climb down from the third floor of the apartment to escape harassment,” she recounted.\n\nShe alleged that it was then her employer chopped off her right hand while she was holding on to a window. “I remember falling down and felt writhing pain on my right arm, hip and leg. At the hospital, the police did not record my statement due to a language problem. I saw reports of police saying that I was mentally disturbed and my hand was injured in a fall,” she added.\n\nWith the Central government taking up the issue with their counterpart in Saudi Arabia, Ms. Munirathnam was flown to Chennai in November. The Tamil Nadu government announced a financial assistance of Rs. 10 lakh. The amount was deposited in a bank and the monthly interest was granted to her towards medical expenses.\n\nArriving at the Collector’s office in a wheelchair along with her son and daughter, Ms. Munirathnam said, “I am getting Rs. 8,000 as monthly interest from the fund. This is not sufficient to meet all my needs. I have loans to the tune of Rs. 25 lakh. The employer and Saudi Arabia government did not pay any compensation for my loss. They sent me to India with Rs. 30,000, which is the salary for two months.”\n\nWith injuries on her hip and leg, she had gone to the Rajiv Gandhi Government General Hospital, Chennai thrice from Vellore in the last one-and-a-half months. “Each trip costs me Rs. 5,000 towards car rent,” she mentioned.\n\nShe appealed to the Collector to help her to get good treatment at Vellore. Following this, officials were directed to take steps to enable her get treatment at the Government Vellore Medical College Hospital, Adukkamparai.\n\n“I want the Central government to take up my case with the Saudia Arabia government. I want to know what action has been taken against my employer. I also appeal to the Prime Minister to provide financial assistance to help me repay my loans,” she added.\n\nShe has appealed to the Collector to help her get\n\nproper treatment\n\nin Vellore", 
    "section": "national", 
    "title": "Vellore woman wants compensation from Saudi employer", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}