{
    "author": [
        "S Sundar"
    ], 
    "text": "Dalits of Kuruvithurai near here said that they were tolerating atrocities by caste Hindus – from double-tumbler system in tea shops to harassment of girls on buses – to maintain peace and in the interest of education of their children.\n\nOn Sunday, 16 Dalits, including women, were injured in a mob attack following a quarrel during Pongal festival. “Often we go to police station with complaints of aggression against us. But, the police threaten to file case against our own youths and force us to withdraw complaints,” said G. Bhoopathi (38), a research scholar in Economics.\n\nP. Veeraiah (60), a farmhand, claimed that about a dozen tea shops, run by caste Hindus, offerred tea to Dalits only in plastic cups.\n\nV. Karuppan (44), who was one of the victims of Sunday’s assault by armed caste Hindu youths, said that school and college-going Dalit girls had been advised to put up with the harassment on buses by youths of dominant castes.\n\n“Caste Hindu youths occupy the seats reserved for women and harass the girls by playing indecent songs on their mobile phones,” he complained.\n\nV. Kasinathan, an engineer, said that the police in Kadupatti were highly influenced by the dominant community people. “Even as some of our youths, who were in the police station, wanted the police to rush to our help in the village when the attack was going on, the police took their own time to come to Kuruvithurai,” he said.\n\nS. Vignesh Kumar, who was present at the police station to lodge a complaint against three youths for creating ruckus at the Dalit’s Pongal celebration, concurred with Mr. Kasinathan.\n\nCollector L. Subramanian said that he had assured people of adequate police protection.\n\n“Regarding the complaint of Dalits of not being allowed to sit at the bus stop, we will try to stop that. Other issues have to be looked into,” he said. Superintendent of Police Vijayendra Bidari said that there was no such case of double-tumbler system with the police.\n\nFormer Kuruvithurai panchayat president Pasumpon Maran said that there was not so much caste trouble in the village, though there were certain issues.\n\n“Some are exaggerated complaints. But, we can settle this through peace talks and bring about changes over time. Some elements were creating trouble on both sides,” he said.", 
    "section": "national", 
    "title": "Where Dalits tolerate atrocities for education of children", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}