{
    "author": [
        "S Senthalir"
    ], 
    "text": "Hélène Cixous spoke on her association with theatre artist Ariane Mnouchkine and host of issues\n\n“What I am sure is that if you meet a woman in India who is not literate, she is of course as powerful in her mind as a learned scholar,” says French writer and feminist Helene Cixous.— Photo: T. Singaravelou\n\nHer frail figure, disarming smile and elegant gestures can camouflage the fiery persona within.\n\nOne of the spearheads of the feminist psychoanalytic movement of the 1970 s in France, an acclaimed playwright, a literary critic, philosopher, and feminist, Hélène Cixous is regarded to be in the league of French theorists such as Michel Foucault, Jacques Lacan and Jacques Derrida.\n\nOver a discussion with The Hindu during her brief visit to Puducherry, to give a talk on her association with theatre artist Ariane Mnouchkine and her theatre group recently, Ms. Cixous shared her views on Indian fiction, women writers and Dalit feminism to the refugee crisis in Europe.\n\nBespectacled and sporting a short-trimmed hairstyle, Hélène Cixous even in her late 70s is an astute observer of trends in Indian fiction, especially the decline in political writing in the genre of novels.\n\n“I have read the recent novelists who are gifted. But what I haven’t seen in them engage as much in is political writing, which is central to me, in the novel. They are realistic but not political,” says Hélène Cixous. An erudite scholar who has worked with the likes of Lacan and Derrida, she has over 40 books and more than 100 articles to her credit.\n\nWhen asked how she would translate her work ‘The Laugh of Medusa’ to the young aspiring women writers in India, she said: “I think it applies to everyone around the world with slight differences according to the development of the different aspects of a particular country. It is a little different in India of course. Also the level of consciousness is not exactly contemporaneous but I think the dream of Medusa is about all women in the world at one time or another.”\n\nThe feminist writer emphasises that women should write for their emancipation. Stating that expressing oneself openly is the highest freedom, she recalls the tradition of women writing in India during the Bhakti movement.\n\nShe says: “As long as you know how to read and write you are less a prisoner. It is a way to freedom and the highest freedom is when you express yourself openly.” Which is why she believes that the girl child would be stronger if she goes to school. They can become independent as well.\n\nAs a playwright, she sees art as a way of reaching beyond the limits of society.\n\n“I can imagine that it is the shortest and most economic way to reach beyond the limits of society. For instance, Therukoothu , a folk art performed in villages. It has everything to make the hearts and minds bigger. Then, there is a decision of the women doing Therukoothu . Though it is not forbidden to women, it is difficult for them to pursue within the constraints of society like in any other art form. However, expressing through any art form or writing gives not only freedom but pride and self reliance,” opines Ms. Cixous.\n\nShe underlines: “What I am sure is that if you meet a woman in India who is not literate, she is of course as powerful in her mind as a learned scholar.”\n\nShe has worked with theatre artist Ariane Mnouchkine and written many critically acclaimed plays. Some of which include l'Histoire terrible mais inachevée de Norodom Sihanouk, roi du Cambodge (The Terrible but Unfinished Story of Norodom Sihanouk, King of Cambodia) l'Indiade , La Ville parjure ou le réveil des Erinyes (The Treacherous City or the Awakening of the Furies) and many more.\n\nWhen asked about her thoughts on caste system, she says that caste system hinders the emancipation of women. The feminist, who in 1974, created the Centre d'Etudes Féminines at the University of Paris VIII which offered the first doctoral program in women’s studies in Europe, considers Dalit Feminism an inevitable moment in Indian history.\n\nTo her, post-feminism is a very abstract and theoretical concept. The moment you start using ‘post’ it belongs to a discourse which is very academic and not close to women.\n\nAs an Algerian, influenced by exile and nationality, she has her views on the refugee crisis in Europe. “Human beings are always in exile and there are so many different types of exile. Those who think that a country belongs to them are adopting a questionable attitude. I think that hospitality and solidarity are the essential political virtues for everyone,” she said.", 
    "section": "national", 
    "title": "‘Women should write for emancipation’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}