{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector says the work will go on in a phased manner\n\nFOR A FREE FLOW:Thorny bushes along the Tamirabharani near Tirunelveli Collectorate being removed on Monday.— Photo: A. SHAIKMOHIDEEN\n\nWith the help of a few organisations, the district administration has started clearing thorny bushes grown along Tamirabharani watercourse.\n\nThough the 125-km-long Tamirabharani nourishes paddy crop being cultivated on over a lakh hectares and quenches the thirst of several million people after it touches the plains at Papanasam, no government has taken due efforts to conserve the river clean and remove encroachments on it.\n\nOnly a few voluntary organisations like Tirunelveli Social Service Society have cleared the thorny bushes in a few places, and watered native tree species with the help of women’s self-help groups.\n\nFollowing appeals from various quarters, the district administration has started the exercise with the help of faculty members and students of Anna University – Tirunelveli Regional Centre and a few private organisations.\n\nAccording to the present plan, a minimum of five earthmovers would be pressed into service for a few days to clear the shrubs between the railway bridge across the Tamirabharani near Meenakshipuram and the Collectorate, and then the stretch between Sulochana Mudaliar Bridge and North Bypass Road Bridge.\n\n“Acacia plants will be uprooted during this exercise. We’ve appealed to the Collector to take stringent action against encroachers, who have even established brick kilns, labourers’ sheds and permanent houses,” said a volunteer involved in the exercise.\n\nCollector M. Karunakaran, who participated in the inauguration of the cleaning programme, said that encroachment removal along Tamirabharani watercourse would be taken up in phases so as to save the river from being encroached upon.\n\nHe also outlined the district administration’s plan to save the river from domestic and industrial effluents which are being discharged into it due to the absence of effective underground drainage system or effluent treatment plants.\n\n“We’re persuading industrial houses and business establishments to join hands with us in this venture, and people’s active participation alone can determine the success of this effort in the long run.\n\nSo, after clearing the bushes, removing the encroachments and stopping the sewage from flowing into the river through the efforts of the official machinery, the locals should ensure that the weeded out plants and practices are not cropping up again,” said a trustee of a temple here.\n\nRajya Sabha MP S. Muthukaruppan, MLA Nainar Nagenthran, Mayor E. Bhuvaneshwari, Corporation Commissioner S. Sivasubramanian and Dean of Anna University – Tirunelveli Regional Office Sakthinathan participated.", 
    "section": "national", 
    "title": "Work to clean watercourse begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}