{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Chennai Corporation races against time to finish them ahead of Assembly polls notification\n\nNearly one-third of civic development works taken up under various projects by the Chennai Corporation has been hanging fire and the long Pongal break has not helped matters.\n\nHowever, as many of these projects have to be completed to ensure normal functioning of various services for a vast number of city residents, the Corporation has decided to fast-track them.\n\nWith large numbers of workers returning to the city after the Pongal break, the civic body had already started work on some of them.\n\nIt is racing against time to complete these projects before the notification of the Assembly elections.\n\nOver 2,500 roads of the 10000-roads scheme for which work order was issued during 2013-2014 have not been re-laid so far, due to the failure of contractors to complete the work on time. Claiming a rise in material costs because of the delay, the civic body has prepared fresh estimates for most of the roads. Such delayed works are expected to be taken up now.\n\n180 bus routes were re-laid recently. Work on some of the remaining 281 roads, which include North Usman Road, Anna Nagar First Avenue, Govindan Road, Millers Road, Madhavaram High Road, NSC Bose Road, Dr. Vijagaragava Road, East Ramanathan Salai and Evening Bazar Road has been expedited.\n\nRepair of damaged bridges, including Adhithanar Bridge that has been delayed for a few months is set to begin.\n\nMore than 40 percent of the desilting work on waterways has been left incomplete, because of the floods. Such works are expected to be taken up shortly.\n\nWork on commissioning new street lights has also started. Each of the 200 wards in the city will get new streetlights; some of these wards will get more than 200 new streetlights each.\n\nThe delayed work on restoration of Ripon Buildings has gained pace with the arrival of more workers. More than 30 percent of the work is yet to be completed.\n\nAt least 30 per cent of the restoration work on more than 300 heritage pillars, each 1.2 metres tall, at various points on the western side of the beach, is yet to be completed.\n\nSuch work is expected to be taken up shortly.", 
    "section": "national", 
    "title": "Work on key civic projects fast-tracked", 
    "subsection": "tamilnadu", 
    "date": "2016-01-19"
}