{
    "author": [], 
    "text": "“Such an ownership over the inventory will render the business into inventory-based model,” it said in a press note.\n\nAs per the norms, an e-commerce firm will not be permitted to sell more than 25 per cent of total sales from one vendor or its group companies. “E-commerce entities providing marketplace will not directly or indirectly influence the sale price of goods or services and shall maintain level playing field,” it added.\n\nThis may require some of the existing players to alter their structures. “The cap of 25% on sales by a vendor on marketplace will ensure a broadbasing of vendors for a true marketplace. This may require some of the operators to go back to the drawing board to ensure compliance,” Mr. Gupt added.\n\nCommenting on the announcement, Vivek Gupta, Partner at BMR Advisors said an explicit position from the government on where it stood with reference to e-commerce has been long overdue.\n\n“However, the fact is that this position has been stated after close to 10 billion dollars have been committed to the sector, networks and businesses already existing on the ground. Moreover, ongoing legal challenges and Enforcement Directorate norms meant that the government had very little elbow room to really state a policy position. And hence, it has chosen to bless the marketplace model with some safeguards that the marketplace should not act like the retailer.”\n\nWhile welcoming the guidelines, Kumar Rajagopalan, CEO of Retailers Association of India said the definitions in the notification will prevent marketplaces from behaving like “pseudo retailers.”\n\nNasscom said the cap of 25 per cent on sales by a single vendor in a marketplace may prove to be restrictive, more so if the vendor sells high value items. “The industry might face difficulties in case of sale of electronic items, where a vendor may be offering exclusive access to certain items or discounts. Marketplaces have no control on how a product is priced and only organise ‘sales’ where vendors participate,” it added.", 
    "section": "national", 
    "title": "100% FDI in e-commerce retail", 
    "subsection": "general", 
    "date": "2016-03-30"
}