{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Hindu invites applications for The Hindu Playwright Award 2016 . The award instituted in 2008, carries a cash prize of Rs. 2 lakh, for the best new theatre script in English.\n\nIndian citizens or people who have been residents of India for the past five years and are aged over 18 are eligible to apply. Entries can be on any subject of the applicant’s choice and must be a full-length play with a performance time of 50 minutes or more.\n\nThe play must be an original, unpublished and unperformed work in English. It must not have been staged in any public space before the announcement of the award. Each applicant can make only one submission. It must not contain any quotations or copyright material without necessary permissions having been obtained. While adaptations of novels and texts are eligible, translated works will not be considered.\n\nSubmissions made for previous editions of The Hindu MetroPlus Playwright Award (as it was known till 2014) will not be considered. Entries must be printed in double space on single sides of A4 sheets and sent to The Hindu Playwright Award 2016, Strategy Department, The Hindu, Kasturi Buildings, 859-860 Anna Salai, Chennai 600 002.\n\nA copy must also be sent by email toplaywrightaward@\n\nthehindu.co.in. Clarifications can also be sought on this email id. Entries must reach on or before Saturday, April 30, 2016, and must include a short curriculum vitae of the playwright, the writer’s name, phone number, email id and postal address. Manuscripts will not be returned.\n\nThe decision of the judges is final. The shortlist will be announced on Friday, July 1, 2016. The winner will be announced during The Hindu Theatre Fest 2016. Employees of Kasturi & Sons Ltd and their close relatives are not eligible to enter the contest.", 
    "section": "national", 
    "title": "Applications invited for The Hindu Playwright Award", 
    "subsection": "general", 
    "date": "2016-03-30"
}