{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "A new type of surveillance and multi-tracking radar, PHAROS, that can be fitted on guns and ships will be partly co-developed and manufactured in Bengaluru. It will meet the needs of the Navy and the Army and can also be built for other countries. The ‘fire control’ radar is intended to identify enemy fire, its source and alert its users to thwart an attack.\n\nThe radar will be developed by BTSL — the venture between defence technology partners Bharat Electronics Ltd. and Thales — and French major Thales.\n\nThales holds the original technology and has initiated work on the design of PHAROS (which means light house or beacon).\n\nBEL on Tuesday said its subsidiary BTSL (BEL Thales Systems Ltd.) and Thales signed a partnership agreement during the ongoing Defexpo 2016.\n\nThe ninth two-yearly event for land & naval systems is being held this year at South Goa’s Naqueri Quitol, about 30 km from Panjim. BTSL will develop the mechanical design and radar processing modification in Bengaluru.\n\nBEL’s Director (R&D) Ajit T. Kalghatgi said from Goa that the state of the art radar would meet an essential security requirement of the country. It was planned to be developed in 18 to 24 months. Thales will be responsible for the overall system design of the radar besides the design and production of its antenna.\n\nPHAROS is an all-weather multi-target tracking radar that can be fitted on 30mm to 76mm guns and missiles. It provides defence against small, fast moving and highly manoeuvrable targets, in air, surface and also sea encounters.\n\n“The strategic step goes beyond the co-development partnership; it reaffirms our commitment to the country and to actively contribute to the ‘Make in India’ policy,” said Serge Adrian, Senior Vice-President of Surface Radars Activities at Thales.\n\nBEL also signed an MoU with Russia’s state-owned export arm Rosoboronexport for jointly developing various sub-systems for major defence projects falling under the defence offset clause.\n\nThe tie-up will cover the procurement requirements of all the three arms of the Indian forces and the civilian sector.", 
    "section": "national", 
    "title": "BEL, Thales to co-develop new fire control radar", 
    "subsection": "general", 
    "date": "2016-03-30"
}