{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "The opposition BJP on Tuesday created ruckus in both the Houses of Bihar legislature, demanding that the State Minority Welfare Minister Abdul Gafoor be sacked for meeting with imprisoned former RJD MP and strongman Mohd. Shahabuddin in Siwan jail recently. The State government earlier, had taken action against jail authorities for the meeting.\n\n“The government has taken action against the jail superintendent and other officials but no action was taken against the Minister…it was an act of impropriety and we demand that he too should be sacked from the cabinet immediately,” said Leader of Opposition Prem Kumar, drawing the attention of the Speaker Vijay Kumar Chaudhury.\n\nBut when the Speaker ignored the issue, all BJP MLAs trooped into the well of the House and raised slogans against the Minister and the Grand Alliance government. Later the House was adjourned till 2 p.m.\n\nSimilarly, BJP members demanded action against the Minister in the Legislative Council and protested against the government. “Action against jail officials was just an eyewash…why was the Minister not touched …we demand that the Chief Minister should sack him for his improper conduct,” demanded State BJP president and MLC Mangal Pandey.\n\nOn March 8, Mr. Gafoor of the RJD along with another party MLA Harishankar Yadav had met with imprisoned former party MP Mohd Shahabuddin in Siwan jail over lavish snacks and tea. The picture of the Minister having a feast along with others inside the jail had gone viral on social media and the Minister later said “It was a courtesy call”. On Tuesday, the Minister told journalists that he had followed the jail manual and did nothing wrong in meeting with a party leader inside the jail. “I was not the first politician to meet someone in jail...earlier too, politicians have been visiting jail to meet party leaders and workers,” said Mr Gafoor while dismissing the fact that the jail authorities were suspended because of his meeting with the imprisoned party leader. “I’ve no idea that action has been taken against jail authorities because of my meeting inside the jail…Give me any written proof of it…it might be because of some other issues,” said the Minister.\n\nSoon after the meeting, Chief Minister Nitish Kumar reportedly asked the jail IG (Inspector General) Anand Kishore for a probe and later jail authorities, including the superintendent Radheshyam Rajak, were suspended on the basis of the probe report.\n\nMeanwhile, the State Deputy Chief Minister Tejaswi Yadav has come out in support of Mr Gafoor saying he had followed the “jail manual”. He added that, “if anything wrong has been done we’ll look into it, no matter whosoever he will be.”\n\nMinority Welfare Minister Abdul Gafoor had met Shahabuddin\n\nin Siwan jail", 
    "section": "national", 
    "title": "BJP MLAs demand removal of Bihar Minister", 
    "subsection": "general", 
    "date": "2016-03-30"
}