{
    "author": [
        "Abdus Salam"
    ], 
    "text": "Chief Minister Tarun Gogoi’s son, Gaurav, is confident that peace and development will ensure victory\n\nThe first phase of the Assam Assembly elections on April 4, spanning 65 constituencies across Upper Assam and the Barak Valley, is primarily going to be a straight fight between the Congress and the Bharatiya Janata Party. As Chief Minister Tarun Gogoi leads the Congress campaign from the front, by his side is son Gaurav Gogoi . The Kaliabor MP, the party’s ‘young face’ and the rumoured heir apparent to the 79-year-old Chief Minister, has been instrumental in devising both the Congress’s digital and offline campaign strategies. Gogoi Jr. takes time off from the campaign in Jorhat to speak to Abdus Salam .\n\nExcerpts:\n\nThe general perception is that the Congress campaign has been a reactive one, with the BJP setting the agenda…\n\nOn the contrary, the Congress campaign started much earlier than during the previous Assembly elections. We started a micro-level campaign wherein 4,000-5,000 booth-level cadres per Assembly constituency have gone door-to-door at least four times since September 2014. We also learned from our setback in the 2014 general election and built digital properties to deepen the party’s social media interventions.\n\nThe BJP’s Vision Document makes illegal immigration the centrepiece of this election. Is that the core issue?\n\nThe BJP’s Vision Document reflects its ignorance of Assam’s reality. Its promises regarding 50 per cent reservation for women in Panchayati Raj institutions and 35 per cent reservation for women in State government services have already been fulfilled in large measure by the Congress government. Immigration is a serious issue and needs proper administrative procedures, including the updating of the National Register of Citizens which is ongoing. What has the BJP government at the Centre done on immigration in the two years it has been in power?\n\nThe general election saw a serious erosion in the support for Congress among the tea tribes and Bengali-speaking voters, both Hindu and Muslim. Any specific strategies to win them back?\n\nThe 2014 results only reflect the fact that elections are fought on the issue of development. There was a wave among the people that a particular person is the answer to India’s development. People in Assam believe in performance over rhetoric. They will now return to the Congress.\n\nYour chief strategist and campaigner for long, Himanta Biswa Sarma, is now helming the BJP campaign. Hasn’t his exit dealt a blow to the Congress?\n\nChief Minister Tarun Gogoi has been the undisputed leader of the Congress.\n\nThe party has only benefited from the exit of a few. If you have noticed, the BJP has become a much more divided house than before because of the inclusion of these leaders, with grass-roots level workers complaining of being sidelined.\n\nThe Congress spurned an invitation from the All India United Democratic Front to form a Bihar-like alliance to take on the BJP. Are you open to a post-poll alliance with it?\n\nWe are on a strong wicket and confident of forming a government on our own. We will explore options if and when the need arises.", 
    "section": "national", 
    "title": "BJP is ignorant of Assam’s reality", 
    "subsection": "general", 
    "date": "2016-03-30"
}