{
    "author": [
        "Santosh Paatnaik"
    ], 
    "text": "The proposals to allow foreign trawlers and the silence on carving out a separate Ministry for fisheries have angered fishermen.\n\nFollowing widespread protests from fishermen, the Central government appears to have developed cold feet over giving legal sanctity to the draft National Marine Fisheries Policy.\n\nThe possible fallout of the policy on the elections scheduled in five States next month is also attributed as a reason for the indication from the Ministry of Agriculture to go slow on the policy finalisation.\n\nThe policy has been drafted without including representatives from fishing organisations in the eight-member experts’ committee.\n\nThe Centre had earlier designated the Central Marine Fisheries Research Institute (CMFRI) as the nodal agency to finalise the draft.\n\nThe committee, after drafting the policy, launched an exercise to hold consultation with stakeholders at Visakhapatnam, Kochi, Mumbai, and Chennai last year.\n\nAlthough the members faced strong opposition at the meeting held here last month, they pointed out that the policy was mainly meant to usher in Blue Revolution and improve the livelihood conditions of fishers.\n\nCMFRI sent an 85-point questionnaire to the stakeholders seeking their opinion — in ‘yes’ and ‘no’ format — before drafting the policy. “None responded to it in Andhra Pradesh as the idea of finalising the policy without including stakeholders in the committee was totally unacceptable to us,” Y.G.K. Murti, president, Federation of Indian Fishery Industries, told The Hindu on Monday.\n\nThe proposals to allow foreign trawlers and the silence on carving out a separate Ministry for fisheries, granting ST status and agriculture status to the fishery industry, social security for small and medium fishermen, introduction of pension and ban on bottom trawling have angered fishermen across the country.\n\nIts possible fallout on elections in five States seems to have forced a rethink", 
    "section": "national", 
    "title": "Centre to go slow on marine fisheries policy", 
    "subsection": "general", 
    "date": "2016-03-30"
}