{
    "author": [
        "Special Correspondent"
    ], 
    "text": "However, the High Court order has left the rival parties more than a little puzzled\n\nFormer Uttarakhand Chief Minister Harish Rawat showing a copy of his government's budget to mediapersons in Dehradun on Tuesday.— PHOTO: PTI\n\nThe Uttarakhand High Court’s order, allowing a floor test on March 31 in the Uttarakhand Assembly that was placed under suspended animation after the proclamation of President’s Rule in the State, left both the BJP and the Congress more than a little bemused.\n\nBoth claimed victory after the High Court ruling that the Harish Rawat government would go through a floor test on Thursday, allowing even the nine rebel Congress MLAs to vote, although both parties did admit to being a little puzzled by the full import of it.\n\nA stunned BJP insisted that the order was no victory for the Congress, although it described the holding of a floor test when a State is under President’s Rule as “unprecedented.”\n\n“To order something like this during President’s Rule is unprecedented,” said BJP spokesperson Nalin Kohli.\n\nOther partymen searched for the silver lining in this cloud of legal embarrassment. “We wanted a division in any case, even on March 18 that was our main demand. This ruling has given us that, and it would be monitored by the court, with the nine Congress MLAs who are against the Rawat government being allowed to vote,” said BJP vice-president Shyam Jaju to The Hindu .\n\nThe BJP claims the support of 36 MLAs (which in a 70 member House is past the halfway mark) while the Congress has the support of 34 MLAs, according to sources.\n\nMr. Jaju said that he had no information over whether the Central government would, in fact, appeal against the ruling which allowed a floor test after President Mukherjee had signed the proclamation of Central rule in the State.\n\n“I’ve only watched on TV that the Central government may think of appealing the ruling, but cannot say with authority that this is so,” he said.\n\nThe Congress was visibly jubilant at the turn of events with the State in-charge, Ambika Soni saying that it was a victory for the Harish Rawat government, but did admit that the ruling allowing nine Congress rebel MLAs to vote “separately” was something the party would seek legal advice on.\n\n“What does it mean, they will vote separately? If they vote outside the House, that has never happened before. The court said it would monitor the proceedings through the registrar, but nobody other than members of the House are allowed on the floor. We will be looking at all these issues,” she said.\n\nShe added, however, that the ruling had reinforced the party’s faith in the judiciary of the country.\n\n“We also want to tell the BJP, if you want a Congress mukt Bharat defeat us Constitutionally through elections, not like this,” Ms. Soni said.", 
    "section": "national", 
    "title": "Congress and BJP claim victory", 
    "subsection": "general", 
    "date": "2016-03-30"
}