{
    "author": [
        "K Venkataramanan"
    ], 
    "text": "In the Uttarakhand High Court’s order directing the Assembly to hold a floor test, the Speaker has been asked to keep the results in a ‘sealed cover’ and submit it to the court before April 1. The results should be kept in such a way that it should be discernible whether the motion could be passed only with the support of the nine ‘disqualified’ legislators or without it. A Registrar of the court will be an observer.\n\nThe key precedent cited by the court is that of a directive given by the Supreme Court in 1998 for a ‘composite vote’ in the Uttar Pradesh Assembly. The Additional Solicitor-General, appearing for the Union government on Tuesday, argued against using that order as a precedent. The composite vote was taken to decide who among two claimants — newly sworn-in Chief Minister Jagdambika Pal or his dismissed predecessor Kalyan Singh — commanded majority. Contending that the order in Jagdambika Pal vs. Union of India is binding on the High Court, Justice Dhyani said he favoured passing an interim order for a floor test.\n\nIncidentally, when the composite vote was ordered by the Supreme Court, the Assembly was actually alive and there was a serving Chief Minister, whose tenure lasted two days as the vote went in favour of Mr. Kalyan Singh.\n\nAnother reason cited by the court is that its interim order is “non-invasive and non-prejudicial” (to either party). At one point, the judge said he was passing an order also on “equitable considerations.” He also cited the legal maxim, “Where there is a wrong, there must be a remedy.”\n\nAs the Union government intends to go on appeal, the question whether an interim order that allows a House under suspended animation to function can be passed may become a crucial factor.\n\nDuring arguments, one more objection was raised. Lawyers drew the court’s attention to clauses in Article 356 that said after the imposition of President’s Rule, the State legislature cannot function and all its functions can only be discharged by or under the authority of Parliament.", 
    "section": "national", 
    "title": "Court cites Jagdambika precedent", 
    "subsection": "general", 
    "date": "2016-03-30"
}