{
    "author": [], 
    "text": "Enceladus’s long-lived eruptions\n\nUnlocking the mystery behind eruptions on Enceladus, the icy moon of Saturn, scientists from the University of Chicago and Princeton University have revealed a mechanism by which cyclical tidal stresses exerted by Saturn drive moon’s long-lived eruptions.\n\nEnceladus — 500 km in diameter and 1.272 billion km away from the Earth — serves as a leading candidate for extra-terrestrial life.\n\nData from NASA’s Cassini probe has strongly indicated that the cryovolcanic plumes of Enceladus probably originate in a biomolecule-friendly oceanic environment.\n\n“On Earth, eruptions don’t tend to continue for long. When you do see eruptions that continue for a long time, they’ll be localised into a few pipe-like eruptions with wide spacing between them,” said Edwin Kite, assistant professor of geophysical sciences at Chicago University.\n\nBut Enceladus, which probably has an ocean underlying its icy surface, has somehow managed to sprout multiple fissures along its south pole.\n\nThese “tiger stripes” have been erupting vapour and tiny frost particles continuously along their entire length for decades and probably much longer.\n\nWhat’s needed is an energy source to balance the evaporative cooling.\n\n“We think the energy source is a new mechanism of tidal dissipation that had not been previously considered,” Prof. Kite added.\n\nThe Kite-Rubin model of the Enceladus plumbing system consists of a series of nearly parallel, vertical slots that reach from the surface down to the water below.\n\nThey applied Saturn’s tidal stresses to their model on a desktop computer and watched what happened.\n\nTidal pumping heats the water and the ice shell via turbulence. Kite and Rubin have proposed that new Cassini data can test this idea by revealing whether or not the ice shell in the south polar region is warm.\n\nIf the new mechanism is a major contributor to the heat coming from the fractures, then the south polar ice in between the fractures may in fact be cold.\n\nThe jury is still on out on this until the results from the final Enceladus flybys are fully analysed. — IANS\n\nScientists say\n\nthey are a result\n\nof cyclical tidal stresses exerted\n\nby the planet", 
    "section": "national", 
    "title": "Eruptions on Saturn’s icy moon decoded", 
    "subsection": "general", 
    "date": "2016-03-30"
}