{
    "author": [
        "Cinthya Anand"
    ], 
    "text": "Come April 1, cigarette packs will warn more than they advertise. Despite the parliamentary committee batting for reduction in the size of pictorial warning (PW), sources in the Union Health Ministry have confirmed that the government will honour its commitment to display pictorial warnings on 85 per cent space of cigarette packets from April 1, 2016. An affidavit stating this has been filed in the Rajasthan High Court.\n\n“Today, we have only 40 per cent warning on one side, which means 160 per cent of the space is given to advertisement and promotion. On the contrary, we should warn more than we advertise,” said Vishal Rao, oncologist and member of the Karnataka government’s high power committee on tobacco control. Warning on 85 per cent space would mean that, in effect, 170 per cent of the pack will carry warnings and only 30 per cent will have advertisements.\n\nThe decision has allayed the fears of medical experts and anti-tobacco activists that the Committee on Subordinate Legislation report — which recommended 50 per cent PWs on both sides of cigarettes packets, and on one side of beedi and smokeless tobacco packets — would dilute their efforts to reduce tobacco consumption among the public.\n\nThe report was problematic because tobacco industry heads were themselves part of the decision, said Dr. Upendra Bhojani, Assistant Director, Institute of Public Health, Bengaluru.\n\nThe 40 per cent PW on one side proved ineffective as vendors displayed the packaging on the other side, so that consumers would not see the warnings, he added.\n\nThe Health Ministry issued a notification in October 2014 specifying that health warning should cover at least 85 per cent of principle display area of tobacco packaging, but it is yet to come into force.\n\nMonika Arora, Director of Public Health Foundation of India and a leading anti-tobacco member of the Health Ministry’s Technical and Expert Committees on tobacco control said that “there should be no dilution of the commitments India has made”. India’s public health community has spoken strongly against what was contended as weak evidence linking tobacco and cancer, she added.\n\nDr. S.S. Agarwal, National President, Indian Medical Association said: “The medical fraternity strongly favours large pictorial health warnings as an effective measure. We are confident that the Health Minister will uphold his commitment to safeguarding the lives of Indians rather than allowing the tobacco companies to have their way.”\n\n(With inputs from Vidya Krishnan)\n\n70 % of the packets will carry warnings and only 30 % will have ads", 
    "section": "national", 
    "title": "From April 1, bigger warnings on cigarette packs", 
    "subsection": "general", 
    "date": "2016-03-30"
}