{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "Humanitarian aid organisation Médecins Sans Frontières (Doctors Without Borders) has questioned the Indian government’s decision to have patent officers trained by the United States Patent & Trademark Office after the recent controversy over compulsory licensing.\n\nThe government gave private, verbal assurance to U.S. industry lobby groups — the U.S. India Business Council (USIBC) and the U.S. Chamber of Commerce — that it would not use ‘compulsory licensing’ for commercial purposes, indicating that the Indian patent office won’t readily give out patents to domestic pharma companies for low cost generic versions of patented drugs.\n\nRights-based access campaigners say that the USIBC, which receives funding from multinational pharmaceutical companies, has been conducting training sessions for Indian patent examiners. It is likely to orient them to the narrative of Big Pharma, they fear.\n\nThe USIBC training module, a patent examiner in the Mumbai patent office said, was helping Indian examiners assess applications of life saving pharmaceutical products. “We have training by senior examiners from US PTO. Sometimes these training sessions are 3-6 days, sometimes they last six months. We have had officers sent from India to the U.S. for training. Our examiners usually learn as much as they can from the U.S. but try not to compromise our policy on Section 3(d). There is no doubt a clash of interest but these decisions are taken at a policy level.”\n\nDespite repeated attempts, O.P. Gupta, Controller General of Patents, Trademarks and Design was unavailable for comment.\n\n“This,” Leena Menghaney, South Asia head of the MSF’s Access Campaign, said, “allows the U.S. pharmaceutical industry, which wants a more favourable patent regime to influence India’s patent office decisions.”\n\nThe MSF maintains that this is a part of the U.S. policy to single out India — the world’s principal producer and supplier of quality generic medicines — for lax enforcement of intellectual property.\n\n“The Indian FDA has independent regulatory pathways to register low cost generic versions of new drugs, which has led to millions of people living with HIV receiving treatment supplied by Indian manufacturers. The U.S. pharmaceutical industry, backed by the USTR, wants Indian authorities to relax their patent examination system and is now even training patent examiners through business associations,” Ms. Menghaney added.", 
    "section": "national", 
    "title": "Govt. draws flak for decision to allow U.S.- trained patent examiners", 
    "subsection": "general", 
    "date": "2016-03-30"
}