{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "The investigation into the 2002 and 2003 bomb blasts in the city was an education for the law enforcement agencies. The Crime Branch team that worked on the case, learnt many valuable lessons about terror, investigating officials said, shortly after the verdict was announced. Police officials connected with the case spoke to The Hindu , requesting anonymity. They recalled that the December 2002-March 2003 period was a particularly stressful, with the seemingly random blasts causing large-scale panic in the city.\n\nThe first breakthrough came from the central intelligence agencies: they said a former SIMI member was involved in all the blasts. (Incidentally, current Mumbai Police Commissioner D.D. Padsalgikar was then with the Intelligence Bureau and posted in the city.)\n\nThe SIMI operative was quickly identified as Saquib Nachan. But when the Crime Branch went to arrest him in his village Padgha (in Thane district) locals prevented them. Nachan later filed a writ in court against the charges levelled against him. The court asked him to surrender, which he did.\n\nClaims responsibility\n\nOne official said Nachan was ‘hard’ (what the police call a particularly tough and callous criminal); another called him ‘committed, intelligent and motivated.’ Nachan told his interrogators, “ Jo kiya, sab maine kiya. Kyon kiya, kaise kiya, aur kaun tha, who sab jaane do .” (What was done was done by me. As to why, how or who else was with me, forget about it.”)\n\nThe police persisted, and eventually the information they got from him helped the Crime Branch identify and arrest several members of the module that he had put together to execute his acts of terrorism.\n\nAn officer told The Hindu , “What stumped us when we arrested the members of the module was that they were all educated, financially sound men of diverse ages, unlike the uneducated and poor young men we had arrested for the 1993 serial blasts. This showed us how far the poison of radicalisation had spread, and also gave us an idea of how effective a recruiter Nachan was.”", 
    "section": "national", 
    "title": "How blasts case was cracked", 
    "subsection": "general", 
    "date": "2016-03-30"
}