{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pakistani Lieutenant-General Asim Bajwa addresses journalists in Islamabad on Tuesday, giving details of Kulbhushan Yadav (on screen), who is suspected of being an Indian spy.— PHOTO: AFP\n\nThe Ministry of External Affairs on Tuesday said that a former Indian naval officer arrested by Pakistan for allegedly engaging in subversive activities was “possibly” kidnapped from Iran.\n\nKulbhushan Yadav, the accused, used to run a business in the Iranian port city of Chabahar.\n\n“The government categorically rejects allegations that this individual was involved in subversive activities in Pakistan at our behest. Our enquiries reveal that he apparently was being harassed while operating a legitimate business from Iran. While we probe this aspect further, his presence now in Pakistan raises questions, including the possibility of his abduction from Iran,” the ministry said\n\nEarlier on Tuesday, Mr. Yadav was seen in a video confessing that he was an official of the Research and Analysis Wing (RAW), India’s external intelligence agency. In the video, played at a press conference of the Inter Services Public Relations of Pakistan military, he said that he left Indian Navy to join RAW in 2013 and went to Chabahar to set up a business outlet there to carry out “operations” in Balochistan and Karachi. He said he used to report to an R&AW officer named Anil Kumar Gupta.\n\nRAW officials weren’t available for comment. However, the MEA said that the video has “no basis in fact.” “That the individual claims to make the statements of his own free will not only challenges credulity but clearly indicates tutoring,” the MEA said, asking Pakistan to provide consular access to Mr. Yadav. It is necessary to find out how he landed in Pakistan “under unexplained circumstances,” the ministry said.\n\nThe former Foreign Secretary, Kanwal Sibal, told The Hindu that the entire sequence of events leading up to the arrest indicated Pakistani officials wanted to push back on allegations of terror.\n\n“Pakistan wants to get some propaganda advantage as the U.S. has stepped up pressure after the Pathankot attack. Pakistan has accused the person of being a serving naval officer. This is incredible as no intelligence agency sends serving naval officers with passports.”\n\nMEA says he\n\nwas not involved\n\nin subversive activities at\n\nIndia’s behest", 
    "section": "national", 
    "title": "MEA rejects ‘confession of spy,’ asks Pak. to give consular access", 
    "subsection": "general", 
    "date": "2016-03-30"
}