{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Days after the death of a Kerala nurse and her child in western Libya, a senior Ministry of External Affairs (MEA) official told The Hindu that at least 1,800 Indians are still in the country and may need to be rescued through an emergency evacuation soon.\n\n“The total number of Indians who have been staying in Libya despite advisories to leave the country is 1,800. But we are in touch with all Indian citizens and have logistics related information about them,” said the official, adding that the information could be used in case of an evacuation.\n\nDiscussions about an emergency plan were prompted by the March 4 attack in Yemen which left one Indian nun killed and a priest missing and the March 25 mortar attack in Libya which killed the nurse and her child.\n\nDespite several rounds of negotiations with their suspected IS captors, the government has been unable to track down two professors from Sirte University kidnapped in August 2015.\n\nBut the official also pointed out that the evacuation from Libya will be challenging especially since the Indian embassy in Tripoli has been relocated and has been operating out of the Tunisian resort city of Djerba, with a skeleton staff. To add to the crisis, the airspace over Tripoli was closed on Tuesday. In 2011, India had managed to evacuate 15,000 nationals flying dozens of Air India flights and sending a naval warship to rescue them. In April 2015, India carried out “Operation Raahat” to evacuate 5,000 citizens and foreigners from Yemen. Diplomats told The Hindu that a similar plan may be used in Libya.\n\nHeaded for major battle\n\nAdding to the pressure, Libya appears to be headed for a major battle between three different contesting governments and the Islamic State fighters. “The rival governments of Tobruk and Tripoli had been fighting for months. But now the situation is more violent as a third front backed by the U.N. — National Unity government, has been formed which has threatened to break into Tripoli, creating a bigger showdown,” the officials told The Hindu over phone.\n\nAt least 1,800 Indians are still in the country... we are in touch with them, says official", 
    "section": "national", 
    "title": "MEA mulls evacuation of Indians in Libya", 
    "subsection": "general", 
    "date": "2016-03-30"
}