{
    "author": [
        "V Geetanath"
    ], 
    "text": "National Aeronautics and Space Administration (NASA) is looking at putting people on planet Mars by 2030 even as plans are afoot to put the next ‘lander’ on the red planet in 2018.\n\n“There are lot of things about Mars we do not know. We seek to know the interior of the plant, penetrate the ground for up to 10 metres or more. Do a follow-up on the next rover in 2020 and check the samples on the surface, explained Larry D. James, deputy director, Jet Propulsion Laboratory, California Institute of Technology, managing the solar system exploration system, Mars, earth science, astronomy, etc.\n\nCollaborative effort\n\n“The current experiments are to check whether there was ever any life on Mars. After putting the man on Mars, humanity has to decide what to do next. It is going to be an international collaborative effort as individually we can’t do. We have about 10 projects,” he said.\n\nIn the city en route to the Indian Space Research Organisation (ISRO) headquarters in Bangalore, Mr. James gave an exciting insight into the research at NASA and the collaborative efforts going on with India and Israel on the planetary missions to Mars.\n\nFlight tests\n\nThe heightened interest about Mars is because “it has more to offer, it is closer, more earth-like than the moon, has atmosphere to make oxygen and lots of potential,” averred Mr. James. Propulsion systems, spacecraft, radars, satellite components, payload developments, et al are being jointly taken up with the help of firms in Spain, Israel and India. NASA has already tested one of its latest spectrometers on an Indian airplane and a series of flight tests has shown good results.\n\nWhile NASA was technological leader, ISRO too has great technical expertise with its radar systems, launch vehicles of PSLV/GSLV and so on. Apart from research collaboration, there has been an exchange of scholars between both the institutions of JPL and Indian Institute of Space Technology (IIST).\n\n‘Low orbit’ travel\n\nThe US space institute has also been doing lot of research in earth sciences by having an orbiting lab from space to look into the Earth’s atmosphere, soil moisture, study the water cycles, glacial movements and so on, said Mr. James. The JPL deputy director is sure that space ‘low orbit’ travel will become a reality in 2018 as quite a few private firms have been working on the rocket systems.\n\nNext missions\n\nImagine a planetary body with water holding capacity of three times the size of Earth. NASA will be keenly studying the “Icy moons” of Jupiter and Saturn and will be the forthcoming planetary missions after the next ‘lander’ is put on Mars, said Mr. James, who was also the US Air Force deputy chief of staff for intelligence, surveillance and reconnaissance at the Pentagon, and was directly responsible to the Director of National Intelligence and the Under Secretary of Defence for Intelligence.\n\nLooking for icy water\n\nThe mission towards moons like Titan or the largest moon of Saturn and will look for the icy water as was shown by unmanned spacecraft Galileo and the Hubble telescope in search for habitable world other than earth.\n\nThe next generation James Webb space telescope as well as new propulsion systems will help reach Jupiter and Saturn within a year and also study the ‘exoplanets’ – planets orbiting around stars other than the Sun, added Lt. Gen. James.", 
    "section": "national", 
    "title": "NASA’s manned mission to Mars by 2030", 
    "subsection": "general", 
    "date": "2016-03-30"
}