{
    "author": [
        "Kanwar Yogendra"
    ], 
    "text": "Himachal Chief Minister Virbhadra Singh on Tuesday said however hard the BJP or Leader of Opposition Prem Kumar Dhumal tried, they “cannot dislodge” him from the government or malign his reputation after raising the Enforcement Directorate’s revelations in the money-laundering case. Mr. Singh squarely blamed the Opposition for “misusing” certain media persons to plant stories against him.\n\nMr. Singh said the “political manoeuvring” to topple his government would not succeed in the State unlike in “some other Congress-ruled States.”\n\nThe party enjoys a comfortable majority in Himachal Pradesh with a known unity among its members. The party has 35 MLAs in a House of 68 members, while the BJP has 27. There are also five independent MLAs. The Assembly Speaker too belongs to the Congress party.\n\n“All accusations against me of money-laundering and amassing disproportionate wealth are frivolous”, Mr. Singh said.\n\n“The false allegations against me had always helped me politically in the past and will help this time too”, he said, terming the CBI and Union Minister Arun Jaitley as “conspirators.”\n\nMr. Singh also brushed aside claims by former BJP Chief Minister Prem Kumar Dhumal that the present Congress government would be brought down, forcing Mr. Singh to step down as Chief Minister before the end of the ongoing Budget session.\n\nThe Chief Minister said the Congress had recently won the majority of local bodies’ elections, adding that people have “again rejected the BJP.”\n\nMeanwhile, fresh revelations made by the Enforcement Directorate and its subsequent coverage by the Delhi media lead to another walkout in the Himachal Assembly on Tuesday when the Opposition members, waving copies of some newspapers, were not allowed discussion by the Speaker.\n\nChief Whip of the BJP and Shimla MLA Suresh Bhardwaj made an appeal to the Speaker for raising the matter but the Speaker Brij Bihari Lal Butail refused the request and said the matter was subjudice and no discussion could be allowed inside the House.\n\nLeader of Opposition Prem Kumar Dhumal said the House should have been informed about the ED’s order to attach the properties of the Chief Minister Virbhadra Singh in the money laundering case. The matter has not been prioritised in the House, he maintained. The Speaker said the matter could not be raised as per rules, and the Opposition members should instead participate in the question hour. On this, the entire BJP group staged a walkout.", 
    "section": "national", 
    "title": "None can topple my government, says Himachal Chief Minister", 
    "subsection": "general", 
    "date": "2016-03-30"
}