{
    "author": [], 
    "text": "With this, the most powerful VR device yet has been put intothe hands of consumers.— File Photo: AP\n\nThe first consumer-ready Oculus Rift virtual-reality headset was delivered to a real person over the weekend, and reviewers got their first taste. The initial feedback – It’s a beautiful, wonderful device that immerses you, yet it still has a long way to go.\n\nOculus founder Palmer Luckey hand-delivered the first Rift to software developer Ross Martin in Anchorage, Alaska, on Saturday, kicking off a new era in virtual reality by putting the most powerful VR device yet into a consumer’s hands.\n\nMr. Martin, who had never tried VR before, spent a few hours on the Rift on Monday morning. He watched a short movie, played a game and explored a virtual environment that included an up-close encounter with a Tyrannosaurus Rex.\n\n“I couldn’t stop saying, ‘Wow,’” Mr. Martin, a 33-year-old Web developer, said in an interview.\n\nBut he said that he felt a touch of nausea at times and that the resolution could be better.\n\n“If you’re a gamer, this is right up your alley,” he said. “You’re going to be able to forgive that.” Oculus has said it’s sending the Rift to its first Kickstarter backers first, followed by those who ordered one in January for $600, or at least $1,500 with a high-end personal computer included.\n\nOculus, which began crowd-funding through Kickstarter in August 2012, was acquired by Facebook for $ 2 billion in 2014 and has shipped two developer versions so far.\n\nExpectations for a consumer version have been high. There’s a backlog of orders and if you order now, you can expect delivery in July.\n\nIt’s not clear, though, how many units Oculus made for the first round and whether there will ultimately be much demand beyond gamers and hard-core technologists.\n\nEarly reviews by journalists have been mixed.\n\nSteven Tweedie of Business Insider was glowingly positive in his review of the Rift, relishing the greater presence he felt in both games and narrative stories.\n\n“Everything feels like it means more- there’s a heightened connection to characters, both in games and short films, and the action carries weight,” he wrote.\n\nBut he noted its hefty price tag “is undoubtedly the biggest thing keeping more people from getting the chance to try virtual reality.”\n\nTime ’s Lisa Eadicicco called the Rift “expensive, complicated, and totally wonderful.” She added, “It’s brilliant. It’s fascinating. It’s not perfect, but it’s only getting started.”\n\nSeveral reviewers, including IGN’s Dan Stapleton, wrote that because the Rift doesn’t come with controllers that allow for separate actions by each hand, the Rift will suffer compared with the HTC Vive, which will have such controllers included when it comes out next month.\n\nOculus expects its “Touch” controllers to come out later this year. Wired reviewer Peter Rubin similarly bemoaned the lack of games using Touch.\n\nNathan Olivarez-Giles of The Wall Street Journal wasn’t wowed by all the 30 games that were available at launch. And he wrote that nausea, a consistent complaint among VR headset users, was real. “When I pushed myself to play Valkyrie for as long as 45 minutes non-stop, I took aspirin to fight off a headache.” — AP", 
    "section": "national", 
    "title": "Oculus Rift begins shipping, receives mixed reviews from scribes", 
    "subsection": "general", 
    "date": "2016-03-30"
}