{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Student wings affiliated to the Congress, the Nationalist Congress Party (NCP) and other political outfits on Tuesday demanded the ouster of college principal R.G. Pardeshi a week after he claimed in a letter to the police that anti-national slogans “may have been raised” on the Fergusson College campus.\n\n“We don’t think the letter was a typographical or human error. It was a pre-meditated ploy and we demand that Mr. Pardeshi be sacked by the Deccan Education Society, which runs the college,” said a representative of the students’ outfits during a press conference here, countering Mr. Pardeshi justification for the letter.\n\nMembers of the student and youth wings affiliated to the NSUI, the NCP, the Republican Party of India and the Sambhaji Brigade alleged that the college administration had issued the letter under pressure from right-wing outfits like the Patit Pawan Sanghatana.\n\nLast week, an informal event, where the ABVP’s student president in JNU Alok Singh was speaking, got mired in controversy after two groups, a left-leaning Ambedkarite one and the right-wing ABVP, verbally clashed. The college authorities then called in the police to maintain law and order situation in the campus.\n\nA group of 30-40 students had vociferously shouted down Mr. Singh during his speech, raising slogans in favour of JNU Students’ Union leader Kanhaiya Kumar, Dalit scholar Rohith Vemula, who committed suicide, and also demanded freedom from the “stranglehold of rising fascism”, the RSS and Prime Minister Narendra Modi.\n\nThings aggravated further after Mr. Pardeshi insinuated that Dalit students may have been raising anti-national slogans and accordingly shot off a letter to the Deccan Gymkhana police, urging them to investigate the matter.\n\nHowever, Mr. Pardeshi later withdrew his complaint.", 
    "section": "national", 
    "title": "Ouster of Fergusson College principal sought", 
    "subsection": "general", 
    "date": "2016-03-30"
}