{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Five-member group given limited access to facility; travels around 100 km in the district\n\nPakistan’s Joint Investigation Team (JIT) traversed nearly 100 km in the interiors of Pathankot district of Punjab on Tuesday, in a bid to collect evidence regarding the Jaish-e-Mohammad terrorists who were killed at the Pathankot Air Force base after a fierce gun battle on January 2. A senior government official claimed that the JIT was convinced with the kind of evidence presented before them regarding JeM’s involvement in the attack.\n\nHe said the field visit added further weight to India’s claims.\n\nThe five-member JIT was put in bullet-proof SUVs and were given a guided tour by the National Investigation Agency (NIA) to all the five crime scenes, where the terrorists either stopped or snatched vehicles before storming the airbase.\n\nAlong the dusty roads of Pathankot, the JIT was given a first hand account of the route taken by the terrorists to enter India from Pakistan and finally reach the airbase. Accompanied by Indian officials, the team spent four hours criss-crossing the district. In an attempt to avoid embarrassing visuals of the Pakistan team entering through the main gate, the JIT was escorted via the rear side of the base, the same place that terrorists snaked in from. The perimeter wall, which was scaled by the terrorists, was broke open at one location to erect a small gate, through which the JIT entered the location.\n\nAirbase covered\n\nBarring the scene of crime, where the encounter took place, the entire airbase had been covered with tent clothes to visually block the defence installation from the Pakistan delegation.\n\nThe Punjab police commandos tailed the SUVs and a posse of policemen and policewomen followed the cavalcade.\n\nThe JIT had to walk down a bridge to enter the airbase, because of the circuitous route taken by them to enter the forward air force base that is dedicated for operations against Pakistan.\n\nThe NIA said that the JIT was taken to all the places they desired to. “Pakistan JIT had desired to visit all these places and we complied with their request. They were here to see for themselves,” said a senior government official.\n\nThe JIT spent only an hour at the airbase and they were taken to the MES dump yard where the terrorists hid before they engaged with the security forces, the DSC mess, where they hid when challenged by the Garud commando and the airmen’s billet, where last of the two terrorists were gunned down.\n\nAfter visiting the airbase, the team first went to Koliyan village area where former Gurdaspur SP Salwinder Singh was abandoned by terrorists after they snatched his vehicle. The team then went to Kathlor Ka Pul, 40 km away where taxi driver Ikagar Singh was found murdered. They saw a bridge on Unjhh, adjoining Pakistan border, from where the terrorists allegedly crossed over.\n\nMinutes before the JIT reached Pathankot, the Aam Aadmi Party staged a protest outside the main entrance.", 
    "section": "national", 
    "title": "Pakistan probe team visits Pathankot airbase", 
    "subsection": "general", 
    "date": "2016-03-30"
}