{
    "author": [
        "Abdus Salam"
    ], 
    "text": "CAMPAIGN PUNCH:The Congress and the BJP take jibes ateach other in Guwahati.— PHOTO: Special Arrangement\n\nWith all political parties focussing their energies on the constituencies going to polls in the first phase on April 4, Rajiv Bhavan, the Congress headquarters in Guwahati, and the BJP head office in Ulubari sport a near-deserted look. Hoardings in Guwahati, however, presage the imminent political storm. And while the dour promises and exhortations are but a political necessity, humour — albeit of the black kind — has made a surprise appearance on Guwahati billboards.\n\n“Baad diya hai BJP’r leksar, eibar hobo Congressorei sorkar… Misa koley ki hobo! (Never mind the BJP’s lecture, it’ll be a Congress government this time… the BJP’s lies won’t help!),” proclaims a hoarding [see picture] joining the Maligaon flyover. Posters showing Sarbananda Sonowal, the BJP’s chief ministerial candidate, touching the feet of Union Finance Minister Arun Jaitley — with an accompanying poser about how someone who surrenders Assam’s pride at Delhi’s Rajpath can protect regional interests — were reportedly taken down after the BJP threatened to complain to the Election Commission.\n\nHowever, a wall-to-wall visage of Chief Minister Tarun Gogoi still stares at passers-by on G.S. Road, proclaiming, “Will take what is Assam’s due by fighting courageously, not by bending the knee.”\n\nThe no-holds-barred election that this is, the BJP isn’t taking it lying down. Close to the Congress headquarters, it has put up a caricature of a sleeping Tarun Gogoi with the caption: “The Bogibeel bridge [on the Brahmaputra river in Upper Assam, which will be India’s longest rail-cum-road bridge when commissioned] hasn’t been completed in 15 years. Even the Taj Mahal didn’t take so long! Mr. Gogoi, the time for you to answer is over.” There are variations on the sleeping CM theme across different parts of the city.\n\nThe rhyming, catchy — and stupendously successful — general election slogan of “Abki baar, Modi sarkar” has found currency even in the Congress camp, of course with the requisite tweak: “Axomot uthise Congressor juwar, Tarun Gogoi akou ebar (The Congress tide surges in Assam, it’s Tarun Gogoi once more).”\n\nNot to be left behind, the All India United Democratic Front, the principal Opposition party in the outgoing Assembly, has rustled up its own poetry: “BJP’r bhal dinor porinam, axohishnuta, niboniyo xomosya, boy-bostur sora dam? (BJP’s achche din — intolerance, unemployment, price rise?”)\n\nabdus.salam@\n\nthehindu.co.in\n\nNo party is\n\ntaking things\n\nlying down in the\n\nno-holds-barred\n\nelections", 
    "section": "national", 
    "title": "Rhyme and ribbing lighten up skyline of Guwahati", 
    "subsection": "general", 
    "date": "2016-03-30"
}