{
    "author": [
        "Stephen Farrell"
    ], 
    "text": "Wondering what these three words are doing together? Read about this ingenious initiative and join the dots\n\nCultural organisations have been working to create precise three-dimensional digital models of the threatened heritage monuments in Palmyra, Syria, in case the originals are damaged beyond repair.\n\nNear the marble quarries of Carrara, Italy, robots are using the models to carve a 20-foot-high scale reproduction of one of Palmyra’s most famous ancient monuments: a Roman triumphal arch that Islamic State militants razed last year.\n\nWhen finished next month, the 12-ton replica is to be temporarily installed at Trafalgar Square in London, with plans to bring it to New York later in the year.\n\nRebuilding agenda\n\nBut the recent ouster of Islamic State militants from Palmyra has raised hopes among the organisations of pursuing an even more ambitious rebuilding agenda.\n\n“This is the moment we have been waiting for,” said Roger L. Michel Jr., the founder and executive director of the Institute for Digital Archaeology, which works with Harvard, Oxford and the Museum of the Future in Dubai.\n\nMichel said it was important to send a “powerful message” to those intent on destroying world heritage sites.\n\n“Every time we resurrect from the rubble one of these monuments, it undercuts the message of fear and ignorance that these people are trying to spread,” he said.\n\n“If they knock it down, we will rebuild it. If they knock it down again, we will rebuild it again.”\n\nThe Romans built the original triumphal arch in the second century to celebrate a victory over the Persians.\n\nThe reproduction was created from a 3D computer model generated from dozens of photographs of the arch taken by archaeologists, tourists and other visitors to Palmyra before the Islamic State captured the city.\n\nAlexy Karenowska, the director of technology at the Institute for Digital Archaeology, said the photographs had been put into a database, and once experts were confident that the computer model contained all the structural information necessary, a file was sent to Italy.\n\nThere, robots are carving the reproduction from blocks of Egyptian marble. — New York Times News Service\n\nA 20-foot-high scale reproduction of the Palmyra arch\n\nis being built\n\nin Carrara, Italy", 
    "section": "national", 
    "title": "Robots used to recreate threatened monuments", 
    "subsection": "general", 
    "date": "2016-03-30"
}