{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Guinness and Asia Book of Records credit her with over 17,000 songs\n\nRenowned playback singer P. Susheela Mohan, who has won several awards and earned accolades in a career spanning five decades, has added two more to her awards cabinet.\n\nShe has now been recognised by both the Guinness World Records and Asia Book of Records for recording the most number of songs in Indian languages. The usually-reticent singer met journalists in Chennai on Tuesday to celebrate the new achievements.\n\nWhile Guinness World Records has credited her for singing 17,695 songs (solo, duet and chorus-backed songs) in 12 Indian languages, the Asia Book of Records has recognised her for singing close to 17,330 songs.\n\nSusheela told reporters that the adjudicators had only considered songs she had sung from the 1960s. “Please remember that I started singing from 1951,” she added.\n\nHer fans set up the websitepsusheela.orgto catalogue all her songs for the adjudicators to consider.\n\nSusheela said, “There is a lot of hard work that has gone behind this achievement. Today, with so many television channels and newspapers, a talented singer can shine through quickly. But when I was singing, it was very slow and I had work my way up, step by step,” she said.\n\nCrediting her husband for her success, Susheela said that he, a doctor, was a cornerstone in her life. She was candid in her response when asked why she had never considered a career in acting.\n\n“I was offered chances to act by several directors, but I refused saying that I wouldn’t want to act even if I was paid a crore,” she said, “My heart was in music.”\n\nWhen asked why she was not singing anymore, the singer said that she would love to sing in movies if someone offered her a good song. When requested to sing her favourite song, she ended the press conference with, “ Ennai pada sonnal, enna pada thondrum ( If you ask me to sing, what will I sing)” from Pudhiya Paravai .", 
    "section": "national", 
    "title": "Singer P. Susheela sets world record", 
    "subsection": "general", 
    "date": "2016-03-30"
}