{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "SENSE OF LOSS:Niyoti, wife of Chhatradhar Mahato, and her mother-in-law, Bedona Mahato, at their home at Amlia village in Lalgarh of Paschim Medinipur district in West Bengal.— Photo: By Special Arrangement\n\nAt what price peace? It’s the question in the region where Maoists no longer have a presence\n\nast week, when Trinamool Congress chief Mamata Banerjee announced that she would always “take care of the residents of Jangalmahal”, Niyoti Mahato, a homemaker in her early 40s, fumed.\n\n“We know her commitment; she has turned Jangalmahal into a military hub,” said Ms. Mahato, standing in the veranda of her house, a few hundred yards from the field at Lalgarh where Ms. Banerjee was addressing a public meeting.\n\nMs. Mahato is the wife of Chhatradhar Mahato, the key leader of a Maoist-backed people’s movement at Lalgarh, who had been a close aide of Ms. Banerjee till 2011.\n\n“In 2011, he contested from prison and got nearly 20,000 votes. What does that indicate,” Ms. Mahato asks.\n\nThat is a complex question in the forest areas of the south-western districts of West Bengal, named as Jungle Mahal by the British. Do the Maoists still cross the Ayodhya Hills on the Bengal-Jharkhand border to enter the villages of Purulia and Paschim Medinipur? The answer is ‘No’, and the Chief Minister is correct to underscore that “peace has returned to Jangalmahal.”\n\nThe writing on the wall\n\n“Graffiti is crucial in the Santhal Paragana,” says Jayanta Das, Editor of the local newspaper Seemarekha . “In tribal areas, people largely vote for the party whom they allow to paint the symbol on their wall.” Going by Mr. Das’s observation, the competition is tough for the Trinamool. At least 30-35 per cent of the walls are captured by the Left alliance, unlike in the 2014 Lok Sabha elections.\n\n“The mechanism of exploitation — put in place by the local CPI(M) leaders in the past — was only accelerated by the police. Similar police action is making a comeback,” says Ms. Mahato. Many allege that they are often picked up in the erstwhile Maoist stronghold for asking simple service-related questions.\n\n“My son was arrested as he had a minor altercation with the officer in charge of the local police station. He was charged for waging war against the state as a youth leader of Maoists,” says Bhajahari Kumar, a senior leader of the Socialist Unity Centre of India (Communist) of the Baghmundi block in Purulia. Nearly everyone acknowledges that the Maoists have left the area, while the joint forces stayed. “Wasn’t it TMC’s commitment to remove paramilitary forces after coming to power,” Mr. Kumar asks.\n\nThere is a long list of such unfulfilled promises in the erstwhile Maoist stronghold of Purulia, Paschim Medinipur and Bankura districts, where polling will be held in 40 constituencies on April 4 and 11. Ms. Banerjee has not released the political prisoners as promised. An acute shortage of water in the summer, lack of work to sustain households throughout the year — the list of grievances is long. Moreover, nepotism to consolidate the party at the grassroots level is increasing.\n\n“Look at that canal made of cement,” says Srikanto Lohar, who owns the first house in Kashmar village in Medinipur. “It remains dry throughout the year as the water flows in the opposite direction.” Such pointless construction — whether they are canals, check dams or huge administrative buildings — are plenty and so are the complaints. “These have only benefited the contractors of the TMC,” alleged Mr. Lohar’s family members.\n\nEven then, the Trinamool may not find it difficult to win a majority of seats in the region. A senior IAS officer told The Hindu that the dearness allowance paid to government employees in West Bengal was at least 40 per cent less than the amounts in other big States. “My batch mates in Bengal get Rs. 30,000 to 40,000 less than what I do,” said the officer, who hails from a small State. The money so saved by the government is spent on rural infrastructure.\n\n“It makes sense to spend the money that should have gone to middle-class government employees on rural infrastructure … the number of government employees is much smaller than that of the rural poor,” the officer said.\n\nEven Ms. Banerjee’s biggest critics would accept that the Trinamool had hugely invested in rural roads. “If I compare the rural roads of Bengal with those of other States, it is way above average,” said a senior poll observer.\n\n“Though being the biggest critic of the Trinamool, I would have to acknowledge that electricity has reached many parts of the district, and we have no power cut,” says Mr. Das, the Editor. And even Chhatradhar Mahato’s wife accepted that foodgrains are sold at Rs. 2 per kg in rural areas.\n\n“But at what cost,” she asks.\n\nThe cost indeed is huge. Many are dead or on the list of disappeared, while the rest joined the ruling party to survive. However, the region’s infrastructure has improved.\n\nMs. Mahato feels her husband initiated this “marginal improvement” by launching the people’s movement, thus ensuring the Trinamool’s victory in 2011. “But he is in jail as we go to another polls …” she stops as Ms. Banerjee starts listing achievements at a rally, almost in the backyard of her house.\n\nEven Mamata Banerjee’s biggest critics will accept\n\nthat rural roads\n\nhave improved", 
    "section": "national", 
    "title": "The wary ways of Jangalmahal", 
    "subsection": "general", 
    "date": "2016-03-30"
}