{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Bose was seen as a ‘collaborator’ of Japan and hence linked to the atrocities of occupation\n\nMinister of State for Culture Mahesh Sharma releases the second batch of 50 declassified files relating to Netaji Subhas Chandra Bose, in New Delhi on Tuesday.- Photo: PTI\n\nA legendary freedom fighter in India, Netaji Subhas Chandra Bose has had a “contested legacy” in Singapore, where many have seen him as a “collaborator” of Japan, which inflicted atrocities on people during its occupation of the island during World War II, says official correspondence of 2012, released by the Centre on Tuesday.\n\nWriting to the Ministry of External Affairs from Singapore in February 2012, the then Indian High Commissioner T.C.A. Raghavan recalled how India had to tread cautiously on domestic demands from the 1960s to 1980s that the government push for a memorial to the INA and Netaji in Singapore.\n\n“There has always been an undercurrent of strong reservation from many in Singapore with reference to the memory and legacy of Subhas Chandra Bose and the INA. A scrutiny of the old files reveals that these sentiments were strong in the 1960s, 1970s and the 1980s,” Mr. Raghavan wrote to the then Secretary (East) in MEA Sanjay Singh. “This was certainly the case when demands in our Parliament and especially in West Bengal for a memorial to Subhas Chandra Bose and the INA received less than a lukewarm response in Singapore.”\n\nHe backed the cautious policy: “This policy has worked to some extent and with the passage of time, bitter memories of the Japanese occupation and genocide appeared to have eased,” Mr. Raghavan’s letter said.\n\nThe reply of the Secretary (East) is interesting. Thanking Mr. Raghavan, in a lighter vein, “for inflicting the history tutorial”, it observed: “Our inability as a nation to accept views other than those we regard as the ultimate truth will remain a burden that Indian diplomats will have to bear.”\n\nMr. Raghavan's letter had noted that the National Heritage Board in 1995 erected a small memorial to Netaji and the INA in Singapore, thus addressing the concerns in India. The letter added that the Institute of Southeast Asian Studies proposed, in 2011, that a booklet be brought out jointly with the High Commission, commemorating Netaji's memory in Singapore. This was part-funded by the High Commission but the latter did not attach its name as the publisher. The reason: there was a tangential reference to Netaji as a “Japanese collaborator” in the foreword written by the former Foreign Minister of Singapore George Yeo, appointed in 2015 as Chancellor of Nalanda University.\n\nWhile asserting that the memories of Japanese occupation had faded by now, Mr. Raghavan pointed that there was recently an “angry exchange” of letters in the Straits Times .", 
    "section": "national", 
    "title": "When Delhi bowed to Singapore", 
    "subsection": "general", 
    "date": "2016-03-30"
}