{
    "author": [], 
    "text": "Bela Bhatia says she's been labelled a naxal for helping tribal women file FIRs against security forces\n\nThere is a good reason the Chhattisgarh government wants human rights activist and social researcher Bela Bhatia to move out of the State.\n\nMs Bhatia has been in the crosshairs of the Chhattisgarh administration ever since she helped tribal women register an FIR against security personnel for gang rape and grievous sexual assault last November. No arrests have been made so far, yet the three FIRs, registered over a period of two months, have the potential to hurt the forces and embarrass Chief Minister Raman Singh. Bela’s legal friends tell her that it is the first time security personnel have been accused of rape under the new, stringent anti-rape law or the Criminal Law Amendment Act (2013).\n\n“When I was living in the Parpa village of Jagdalpur town, my landlord who is a tailor and sews uniforms for the CRPF, asked me to vacate the place without as much as a notice. I didn’t think much of it then, but now as I see the house lying vacant, I can imagine why he wanted me out. I had paid the rent for the entire year,” says Ms Bhatia.\n\nShe has since moved out and is living in a hamlet close to Bastar. But ever since the first FIR was lodged on November 1 in the Peddagalur village of Bijapur district, following inquiry and investigations by the Women against Sexual Violence and State Repression (WSS) into a gang rape, pressure has been brought on Ms Bhatia, who was the main complainant in the FIR.\n\nRepeated assaults\n\nThe first FIR was based on the testimonies of women that was videographed and submitted to the collector. Though the activist was told that investigations were under way, news of another gang rape by security forces became public. This time, eight women of Bellamlendra village of Sukhna district came forward to testify, following the intervention of women’s groups, and an FIR was lodged on January 21, according to Ms Bhatia. A third case of sexual assault on six women in Sukhna district led to the third FIR being filed towards the end of January.\n\n“We were helping the tribals with the legal processes, along with human rights activists. Three rapes involving sexual assault and beating by security personnel and the police, with the testimonies of the women have been submitted to the collector,” says Ms Bhatia.\n\nWhile she was being accused of fabricating the cases, a series of incidents took place in Parpa. “On February 18, plainclothesmen questioned my landlord and called him to the village thana. Then, on February 23, the thanedar (Station House Officer) came to my home to take a video in my absence. On March 26, a mob of 100 people came. I wasn’t at home. They came in a jeep and a pick-up truck and questioned my landlord. They told him, I was a dalal (tout) for the naxals. “ Bhagao usko ” (turn her out), they said. My landlord explained to them that I cooked my own food and bought my own food.” The women [in the group], belonging to the Mahila Ekta Manch, were carrying leaflets identifying me as a naxalite.” They termed her companion, economist Jean Dreze as a foreigner, who was breaking the nation.\n\nThe Mahila Ekta Manch, affiliated to the Samajik Ekta Manch — part of the government’s proposed plan to take on the naxalites — has on its rolls tribals who have turned against journalists and activists critical of the State administration. Trained to identify outsiders as foreigners, the group brands those critical of the State as naxals.\n\n“Yesterday, the sarpanch of the village where I am staying now called on my landlord. I can see the pressure being brought on them and I do not know how long they will be able to hold out,” says Ms Bhatia. She has asked them to keep her informed in case they would like her to leave the place. Her landlord is a clerk in the district administration.\n\n“The group [Samajik Ekta Manch] wants a naxal-free Bastar but does not question the violence of the State,” says the activist.\n\nIn Chhattisgarh, four journalists are behind bars and a contributor to the website Scroll.in, Malini Subramaniam, was recently hounded out. In an organised, State-sponsored effort against Maoists, those critical of the Chhattisgarh administration are being branded naxalites.\n\nBela Bhatia, with a Ph.D from Cambridge University, has been on the panel of the Planning Commission with government officials to look at challenges posed by Maoists to governance and has been an academic at the Tata Institute of Social Sciences and the Centre for the Study of Developing Societies (CSDS). She says she cannot remain a mere researcher.\n\n“I have been working here since 2007, researching on counter-insurgency. I have heard of people being arbitrarily picked up. I will not move out of Bastar,” says Ms Bhatia.\n\nI have been\n\nworking here\n\nsince 2007… I will\n\nnot move out of Bastar", 
    "section": "national", 
    "title": "Why Chhattisgarh wants this researcher out", 
    "subsection": "general", 
    "date": "2016-03-30"
}