{
    "author": [], 
    "text": "A letter from a man to his mother, flown out of Paris by hot air balloon during the Prussian siege of 1870, has turned up in Australia's National Archives.— PHOTO: AFP\n\nA letter from a man to his mother flown out of Paris by hot air balloon during the Prussian siege has turned up in Australia’s National Archives, which on Tuesday said it was keen to know the family’s fate.\n\nThe Franco-Prussian War saw the Germans completely surround Paris for more than four months in 1870.\n\nBalloon mail was the only way communications from Paris could reach the rest of France, with dozens of flights made, mostly at night, and hundreds of thousands of letters delivered.\n\nOne of them has been discovered by the National Archives, penned in French on December 6, 1870 by a man named Charles Mesnier (or Mesmier) to his mother, care of Monsieur Grussin (or Grossin) at 8 Place de la Ville, Pont—Audemer, in Normandy.\n\n“It’s a intriguing human element to an important piece of history,” National Archives assistant director—general Louise Doyle told AFP.\n\n“We’re not sure how it ended up in Australia, but it would be fascinating to know more. If people see this it would be interesting to have more context in relation to this record.”\n\nThe letter was transferred to the archive’s Brisbane office from the former Queensland Post and Telegraph Museum in 2001, but there is no information about its origin.\n\nIt came to light recently as part of a joint project between the National Archives of Australia and the Archives Nationales in France.\n\nIn the letter, which is full of fervour, the man assures his mother he is in good health.\n\n“We don’t have meat every day and when we do get some it is not very much, but we can easily get by as things are and no one in our household is complaining,” he wrote.\n\nMesnier added: “The desire to repulse the Prussians is right now the solitary concern of Paris. Any suffering can be borne rather than opening the gates of the capital to them.”\n\nHe goes on to speak of “some real battles” around the city between November 29 and December 1. “We have taken their cannon and captured 1,000 prisoners — these days of good fortune have raised the morale of the fearful,” he said.\n\n“We cannot succeed in all our attacks but I have the firm conviction, my good mother, that the ultimate success will be for our just cause.”\n\nHis hopes were dashed with the city surrendering in late January 1871 after sustained bombardment. — AFP", 
    "section": "national", 
    "title": "145-year-old letter turns up in Australia", 
    "subsection": "general", 
    "date": "2016-02-17"
}