{
    "author": [
        "National Bureau"
    ], 
    "text": "This rate is meant as interim relief for workers, says Bandaru Dattatreya\n\nEven as the Finance Ministry decided to pare interest rates on several small savings schemes to foster a lower interest rate regime, the board of trustees of the Employees’ Provident Fund Organisation (EPFO) on Tuesday recommended an 8.80 per cent rate of return on Rs.10 lakh crore of retirement savings under its watch for 2015-16.\n\nLabour Minister Bandaru Dattatreya who announced the decision on Tuesday after a meeting of the EPFO board in Chennai, however, said this rate was meant as “interim relief” for workers and the board would meet again later to discuss the possibility of a further interest rate hike.\n\nTrade unions not happy\n\nAlthough the rate for this year is a notch higher than the 8.75 per cent paid out in 2014-15, trade unions were disappointed as the Finance and Investment panel of the EPFO board had earlier recommended a higher interest of 8.95 per cent on EPF savings.\n\nThe EPFO had earlier proposed 8.90 per cent as rate of interest to the Labour Ministry and suggested taking an in-principle approval from the Finance Ministry.\n\nHowever, the Finance Ministry that has decided to moderate the returns on small savings instruments from April 1, 2016, wanted the EPF rate to fall in tandem. The EPFO Board’s proposal would be vetted and ratified by the Finance Ministry, so it could still overrule the 8.80 per cent rate recommendation.\n\n“We had last time given 8.75 per cent and this time, seeing the situation, we are declaring 8.8 per cent for the workers,” he told reporters after the meeting. There are as many as 8.5 crore EPF accounts.\n\n“We have strongly protested the move to declare the rate of interest at 8.80 per cent in the board meeting today. The Board’s Financial and Investment panel had recommended 8.95 per cent interest that would have left a surplus of Rs. 91 crore,” said Prabhakar Banasure, a member of the Financial, Investment and Audit Committee (FIAC) of the EPFO who was present in the board meeting.\n\n“This is unacceptable. In the past, the Board always adopted the recommendations of the FIAC. We asked the Minister to wait for the audit of the 2015-16 balance sheet before declaring the interest rates. However, he didn’t agree,” he added.", 
    "section": "national", 
    "title": "8.8% interest proposed on EPF", 
    "subsection": "general", 
    "date": "2016-02-17"
}