{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "HImanshu Kumar says the Chhattisgarh police have recorded his name in about 100 charge sheets.\n\nAfter 18 years running a Gandhi ashram in Dantewada district of Chattisgrah, Himanshu Kumar is on the run. He fears the police will arrest him if ever sets foot in the State again.\n\nSpeaking to The Hindu , Mr. Kumar said the Chhattisgarh police had recorded his name in about “100 charge sheets,” tagging him with people who — wrongly according to him — have been dubbed “anti-national.”\n\nHis tussle with the government began a decade ago when the UPA government launched the controversial Salwa Judum in Chhattisgarh that armed civilians with guns to neutralise Naxal insurgents. Mr. Kumar went on several “fact-finding missions” to find out if the State police and the Salwa Judum vigilantes were gunning down Naxalites or civilians.\n\nIn 2011, Mr. Kumar moved Supreme Court with a list of 519 cases of “fake encounters.”\n\n“The court said that all the cases must be registered and investigated by the police and compensation given to the victims’ families,” he said. The government, he alleges, did not take kindly to his human rights activism and “bulldozed” his ashram in 2009.\n\nBefore he locked horns with the State government, Mr. Kumar worked on community education, taught tribal women how to repair hand pumps and distributed free medicine in far-off villages. “We had a staff of 250, who were rendered jobless after the government bulldozed our ashram,” he said.\n\nThe ongoing debate triggered by the JNU row about “who’s anti-national and who’s not” doesn’t matter to him and to “several thousand” tribal people of Chhattisgrah, he said. “No one talks about it when tribals are tossed into jails on fake charges.”", 
    "section": "national", 
    "title": "A rights activist on the run", 
    "subsection": "general", 
    "date": "2016-02-17"
}