{
    "author": [
        "K A"
    ], 
    "text": "The Protection of Children from Sexual Offences Act, 2012 (POSCO) is no doubt an effective deterrent to sexual exploitation and harassment of minors. But its textual implementation in the tribal belts of Kerala has given rise to a strange situation. Many tribals, who are ignorant of the stringent provisions in the Act, marry minor girls, in keeping with their traditional practice, and end up in jail on rape charges. Most cases are registered without any formal complaint from the girls or their parents.\n\n“The situation is prevalent in almost all tribal belts of Kerala, including Wayanad, Attappady and Idukki. But the worst affected are the Paniya and Kattunaika community members in Wayanad,” said Sheethal, who is initiating the Access to Justice Programme of the Tata Institute of Social Sciences among tribespeople in Wayanad.\n\nAccording to her, 32 Paniya youths of Wayanad, charged with rape, are languishing in jail. “The judgments call them rapists, some even graphically describing their acts. Around 72 cases have been registered under the POCSO Act in Wayanad district, majority of them against tribesmen.”\n\n“Child marriage is common among the Paniya and Kattunaikars tribes and this has remained a part of their custom for many years. These people are not aware of the existence of a law or even the age of majority status under the Indian law,” she said.\n\n“We are not against the law and its strict implementation. But a massive awareness drive among the tribal communities in Kerala is essential since even educated non-tribal people in the State are ignorant of the provisions under the Act,” said tribal rights expert C.R. Bijoy.\n\nRecently, 21-year-old Paniya youth, Babu, was sentenced to 40 years imprisonment (cumulatively 10 years) and a fine of Rs. 40,000 for four charges framed under the POCSO Act by a Special Court in Kalpetta.\n\n“The law needs sensible implementation. There is a blind spot in the law that says it is applicable to all people, irrespective of their customs, practices or their vulnerability,” said Ms. Sheethal.\n\nUnaware of the law, tribals in Kerala marry minors and are punished for rape", 
    "section": "national", 
    "title": "A tradition that lands tribal youth in jail", 
    "subsection": "general", 
    "date": "2016-02-17"
}