{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "Faced with an increased risk of seasonal drought and subsequent suicide by thousands of farmers every year, the Maharashtra government has roped in actor Aamir Khan to promote its flagship schemes in the sector of water and scarcity. The actor is likely to be associated with the government’s ‘Jalyukt Shivar Abhiyan’, Chief Minister Devendra Fadnavis’ flagship scheme, to make Maharashtra a drought-free State by 2019. The programme aims to make 5,000 villages free of water scarcity every year. Mr. Fadnavis is likely to make an announcement in the regard along with the actor on Wednesday.\n\nMr. Khan, who has been at the centre of a controversy over his comments on intolerance, is lately seen working closely with the Bharatiya Janta Party leadership in Maharashtra. Last Saturday, he attended a dinner hosted by Prime Minister Narendra Modi as part of the Make in India Week at the National Sports Club of India, while on Sunday he was getting ready to recite a Marathi poem composed by the 13th century saint Dnyaneshwar at the Maharashtra Night event at Girgaum Chowpatty before fire engulfed the stage and the programme had to be halted.\n\nRefusing to divulge further details on the latest initiative, the actor told The Hindu : “It is something I have been working on for a year now.” Mr. Fadnavis told The Hindu that the actor’s role will be specifically restricted to the Jal Yukt Shivar for the time being. Senior officials said the actor would be asked to promote use of micro-irrigation system for efficient use of water, thereby increasing the irrigated area in the drought-prone regions. The government has allocated Rs 1,000 crore for the scheme.\n\nThe aim, officials said, is to arrest the alarming number of farmer suicides in Vidarbha and Marathwada. In the January-October 2015 period, 2,590 farmers committed suicide in Maharashtra, the highest since 2001.", 
    "section": "national", 
    "title": "Aamir to help Maharashtra farmers combat drought", 
    "subsection": "general", 
    "date": "2016-02-17"
}