{
    "author": [], 
    "text": "A woman in an alien costume poses for a picture during the annual Alien Festival in Capilla del Monte, Cordoba, Argentina, the site of an alleged UFO sighting 30 years ago. (Below) Luz Mary Lopez, director of the local Centre of UFO Investigation, points to an area of burned grass in a picture taken near Uritorco Mountain, after the night of the sighting.— Photos: AP\n\nThousands of earthlings descended on Capilla del Monte for an annual international alien festival that has made the town a hotspot for UFO sightings.\n\nThe weekend festival in Cordoba province included a parade of neon lights with Star Wars characters, an alien costume contest and shops selling green stuffed aliens with bulging eyes next to hooded ETs from the 1982 film.\n\n‘Burnt grass’\n\nSome also attended workshops on everything extraterrestrial held near a local hill that is the site of a purported UFO sighting 30 years ago. The incident reputedly left a large burning mark on the hill’s grass.\n\nEconomic lifeline\n\nThe sighting also left a mark in the economy of the town, which has flourished with its alien tourism.\n\n“People come here for the energy, for the UFO sightings,” said Leonardo Fuentes, a visitor from Chile. “So it’s not just tourism but more about all that you can see.”\n\nThe festival, now in its fourth year, has become popular among alien enthusiasts worldwide, but some locals are concerned about its fast growth.\n\n“The festival is fun, but it can also generate a lack of seriousness toward the issue,” said Luz Mary Lopez, who heads the UFO Investigation Center in Capilla del Monte.\n\n‘Magic mountain’\n\nOne of the most visited sites during the weekend festival was the nearby Uritorco hill.\n\nKnown as Argentina’s “magic mountain,” it is sought after by star-gazers, seekers of its “special source of energy” credited for the UFO sightings, and even those who believe it is a door to other dimensions. — AP\n\nThe festival includes a parade,\n\na costume contest and workshops\n\non everything ET", 
    "section": "national", 
    "title": "Alien festival at UFO sighting hotspot", 
    "subsection": "general", 
    "date": "2016-02-17"
}