{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "JNU students demanding the release of union president Kanhaiya Kumar in New Delhi on Tuesday. (Right) Jawaharlal Nehru University Teachers Association members express solidarity outside the Vice-Chancellor’s office seeking withdrawal of all the cases.— Photos: PTI & Sandeep Saxena\n\nhere is more to the ongoing unrest at the Jawaharlal Nehru University than the reports of anti-India sloganeering that became the grounds on which the police arrested its student body president, Kanhaiya Kumar, on February 12.\n\nAccording to several student accounts, the first signs of trouble on the campus came when clashes broke out between the left-leaning and right-wing student bodies on October 9, 2014 over a cartoon published in Forward Press magazine. It depicted Goddess Durga in a manner that many religious minded students found “derogatory.”\n\nForward Press has a reputation of being a magazine that speaks for the Dalits and has a history of triggering intense debates at JNU over a demon in the Hindu mythology named “Mahishasura,” who is killed by Goddess Durga in a good versus evil fight. “A section of leftist Dalit students considers Mahishasura a noble king,” said a member of the Jawaharlal Nehru University Student Union (JNUSU). “They think it’s an upper caste Brahminical construct that Mahishasura was a demon just because he was a king from a tribal area. They [the Dalit students] feel that it smacks of upper caste prejudice against the lower castes and they have often observed Mahishasura’s death as the day of his martyrdom.”\n\nIn September 2015, the left-leaning All-India Students Federation (AISF) and the All-India Students Association (AISA) swept the polls, defeating the BJP’s student wing ABVP.\n\nTwo months later, a major controversy explodes on the campus, when a student organised a ‘havan,’ lighting a fire in the middle of his hostel room to celebrate his birthday. The hostel warden, Prof. Burton Cleetus, who’s a Christian, asked the student to put out the fire. “The birthday boy along with a group of ABVP activists filed a police complaint against Burton Cleetus. He levelled charges such as sexual harassment, committing atrocities against SC/ST students and hurting religious sentiments against him,” said another JNUSU member, pleading anonymity.\n\nThen a month later, in December 2015, another professor, Arshad Alam, was accused of sexual assault. “The victim was a Hindu and ABVP activists spread the rumour that a Muslim professor pursuing Love Jihad ended up raping a Hindu student. They accused the leftist student parties of being anti-feminist.”\n\nThe two consecutive events were soon “exploited” by the ABVP activists, consolidating a lot of support among the female students, said the JNUSU member.\n\nAs the controversial Afzal Guru event unfolded on February 9, the JNUSU member said they were surprised to see Home Minister Rajnath Singh condemning it. “Such events have been hosted several times in the past. The government didn’t respond then. Why now?”", 
    "section": "national", 
    "title": "An unrest that has been simmering at JNU for over a year", 
    "subsection": "general", 
    "date": "2016-02-17"
}