{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "The family of an alleged Maoist, killed in an encounter with the Bastar police earlier this month, has said he was a farmer with no Maoist links and he was killed in a “fake encounter.”\n\nBastar Inspector-General of Police S.R.P. Kalluri had said that Hadma Batodi Kashyap, of Sunga village under the Mardoom police limits of Bastar district, was killed in a “fierce encounter” on February 4 and a country-made gun was recovered.\n\nHowever, Hadma Kashyap’s family has said he was picked up by the police from his house early on February 3. “Around 25 policemen surrounded our house. Six of them entered it and asked my husband to show them a way out of the village. When my husband refused, they gagged him and took him along with them,” said Galo Kashyap, wife of Hadma.\n\nThen, Galo visited village head Sudhram Mandavi to inform him of her husband’s “abduction.” “I went to the Mardoom police station to find out the whereabouts of Hadma, but the constable told me that he was not there. I went to the station the next day too, but the police refused to say anything.\n\n“On February 5, some villagers told me that Hadma’s body was seen at Maharani Hospital at Jagdalpur,” Mr. Mandavi told The Hindu .\n\n‘No Maoist links’\n\n“He was a simple farmer of our village. He had no connection with the Maoists. I can show you his Aadhaar and voter identity cards. He was also allotted a house under the Indira Awas Yojana.”\n\nTribal activist and Aam Aadmi Party leader Soni Sori, who brought the family to Raipur to a media briefing, said Hadma would help villagers in times of trouble. “Since he was seen as a possible leader, the police may have perceived him to be a threat. He was declared a Maoist with a reward of Rs. 1 lakh on his head. The police gave the family Rs.10,000 for the funeral. First they kill innocents and then pay for their funerals. He was a father of seven children,” Soni Sori told The Hindu .\n\nBastar District Superintendent of Police R.N. Das said the allegations were an attempt to defame the police.\n\nThe family of the slain man says the police picked him up from his house on February 3", 
    "section": "national", 
    "title": "Bastar farmer killed in fake encounter: family", 
    "subsection": "general", 
    "date": "2016-02-17"
}