{
    "author": [
        "Y Mallikarjun"
    ], 
    "text": "The missile’s range is 100 to 125 km and will be mounted on combat aircraft Sukhoi (Su-30) and Tejas-LCA.— File Photo: AFP\n\nCaptive flight trials of an advanced, state-of-the-art Anti-Radiation Missile (ARM) are planned for April-May this year, and the maiden flight test by year-end by the missile technologists of the Defence Research and Development Organisation.\n\nThe air-to-surface tactical missile being developed by Defence Research and Development Laboratory (DRDL) will target the enemy’s air defence capabilities by attacking radars and communication facilities.\n\nThe range of the missile is 100 to 125 km and it will be mounted on combat aircraft Sukhoi (Su-30) and Tejas-Light Combat Aircraft.\n\nThe missile picks up the radiation or signals of radars and communication facilities and homes on to the targets to destroy them.\n\nAccording to DRDO sources, scientists will evaluate the performance of the seeker, navigation and control system, structural capability and aerodynamic vibrations during the captive flight trials. These will be followed by ground testing and the missile will be fired from Su-30 during the actual flight trial by year-end. Instead of thrust propulsion, the missile uses dual pulse propulsion system as in the case of LR-SAM. The dual pulse propulsion will widen the envelope as well as the engagement capability of the missile. After coasting the missile for the required duration by firing the first pulse, the second pulse will be initiated just before interception of the target or during the terminal phase, the sources added.\n\nThe entire missile is being developed indigenously, including the seeker. The missile will be inducted in about two years after conducting a number of developmental trials.\n\nOnly a few countries, including the U.S. and Germany, have ARMs at present, the sources added.\n\nThe dual pulse propulsion system could be configured with other air-to-surface and air-to-air missiles, the sources added.\n\nMeanwhile, the induction of LR-SAM (Long Range Surface-to-Air Missile), jointly developed by India and Israel, will begin September-October this year. It was successfully test-fired from INS Kolkata to intercept an aerial target last year and the missile is slated to be launched from warships, INS Kochi and INS Chennai, for similar trials later this year.", 
    "section": "national", 
    "title": "Captive flight trials of anti-radiation missile soon", 
    "subsection": "general", 
    "date": "2016-02-17"
}