{
    "author": [], 
    "text": "Eminent professors from prestigious universities, including Noam Chomsky, have signed a statement condemning the arrest of JNU student leader Kanhaiya Kumar and expressing solidarity with the students and faculty protesting against the government action on campus.\n\nThe statement reads:\n\n“We have learnt of the shameful act of the Indian government which, invoking sedition laws formulated by India’s colonial rulers, ordered the police to enter the Jawaharlal Nehru University campus and unlawfully arrest a student leader, Mr. Kanhaiya Kumar, on charges of inciting violence — without any proof whatever of such wrongdoing on his part.\n\n“From the reports of a large number of witnesses and the most highly respected journalists in the country, these are the known facts that no impartial observer denies: In a student meeting, acting well within the rights he possesses by the law of the land, Mr. Kumar spoke critically of the BJP government’s policies.\n\n“On the previous day, at some other event, which he had no part in organising and at which he did not speak, a handful of other students, not even identifiable as students of the university, were shouting slogans about the rights of Kashmiris to independence from Indian military oppression over the last many decades.\n\n“Mr. Kumar, whose speech (widely available on a video) cannot in any way be connected with the slogans uttered on the previous day, was nonetheless arrested for ‘anti-national’ behaviour and for violating the sedition laws against the incitement to violence. Since there is no evidence to establish these charges, we can only conclude that this arrest is further evidence of the present government’s deeply authoritarian nature, intolerant of any dissent, setting aside India’s longstanding commitment to toleration and plurality of opinion, replicating the dark times of an oppressive colonial period and briefly of the Emergency in the mid-1970s.\n\n“These actions of the police have brought great dishonour to the government; and the failure of the Vice-Chancellor to speak out against these actions and moreover to allow the suspension of seven other students on charges that have not been established by a fair and transparent inquiry, will bring great dishonour to the most prominent university in the country in the eyes of the academy all over the world.\n\n“We, the undersigned, take a stand of heartfelt solidarity with the students and faculty of Jawaharlal Nehru University in their efforts to resist these developments on its campus and, in the name of the liberties that India and Indian universities until recently could take for granted, we not only condemn the culture of authoritarian menace that the present government in India has generated, but urge all those genuinely concerned about the future of India and Indian universities to protest in wide mobilisation against it.”\n\nAmong the 64 signatories are Noam Chomsky, Emeritus Professor of Linguistics and Philosophy, Massachusetts Institute of Technology, U.S.; Orhan Pamuk, Nobel Laureate, Turkey; Jonathan Cole, Former Provost of Columbia University, U.S.; Judith Butler, Professor of Linguistics, University of California, Berkeley; Richard N. Zare, Professor of Chemistry, Stanford University, U.S. and Akeel Bilgrami, Professor of Philosophy, Columbia University, U.S.\n\n(The full list of signatories can be seen online at: bit.ly/1U63C08)", 
    "section": "national", 
    "title": "‘Culture of authoritarian menace’", 
    "subsection": "general", 
    "date": "2016-02-17"
}