{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The impact of the U.S.-led mega trading and political blocs on India-ASEAN ties is likely to be the highlight of the 8th round of Delhi Dialogue starting on Wednesday.\n\nThe list of distinguished guests likely to participate in this year’s Dialogue includes Sufian Jalil, Minister for National Development Planning of Indonesia, Tin Oo Lwin, Vice Minister of Foreign Affairs from Myanmar, and several other Ministers from Thailand, Lao PDR and representatives from the ASEAN Secretariat. One emerging mega bloc, the Trans Pacific Partnership (TPP), received a major boost recently with the joining of Brunei, Vietnam, Malaysia and Singapore. Diplomats are concerned that India will have to adjust to the new set of security and economic rules as increasing number of Southeast Asian countries join TPP, which began taking shape with the arrival of President Barack Obama to the White House in 2009.\n\n“The process of joining TPP by several countries in Southeast Asia has highlighted the conflicting segments in the Southeast Asian region. Delhi Dialogue will give us a chance to assess how India will have to adjust to these mega trading and political blocs emerging in this region which is vital for India’s security and economic future,” Nalin Surie, Director-General of Indian Council of World Affairs (ICWA), one of the co-hosts of the Dialogue, told The Hindu .\n\nSome moves have already begun for better coordination between Indian and ASEAN industrial value chain.\n\nOn Monday, Secretary (East), Anil Wadhwa, said, “To encourage integration of Indian producers in regional value chains of ASEAN, the Commerce and Industry Ministry is in the process of establishing a project development fund with a corpus of Rs. 500 crore which will help create manufacturing hubs in Cambodia, Lao PDR, Myanmar and also in Vietnam,” indicating at the adjustments between India and ASEAN members for a new regional economic order.\n\nDelhi Dialogue, February 17-19, is an annual event where policymakers, diplomats, and ministers from India and the ASEAN member-countries meet to discuss the economic, security, and political issues.\n\nDiscussion on security\n\nApart from economic affairs, the Dialogue is expected to feature extensive discussions on cyber security, counter-terror, and political coordination for multilateral platforms like the U.N.\n\nHowever, on its 8th year, the Delhi Dialogue is also in need of some new ideas to turn it into a more intense multilateral forum and the ministerial discussion to be led by External Affairs Minister Sushma Swaraj is expected to infuse some fresh ideas into the Dialogue, sources told The Hindu .", 
    "section": "national", 
    "title": "Delhi Dialogue to focus on trading blocs", 
    "subsection": "general", 
    "date": "2016-02-17"
}