{
    "author": [], 
    "text": "William Shakespeare may have had an illegitimate son for whom the legendary bard penned a sonnet, a new book has claimed.\n\nSonnet 126, addressed to “my lovely boy”, was written for the infant William Davenant, who grew up to be Poet Laureate.\n\nA comparison of both men’s portraits shows they suffered from the same facial deformity around the eye.\n\nThe case is made in Shakespeare’s Bastard , a rare biography of Davenant, a theatrical impresario and Royalist general in the Civil War, that will be published to mark the 400th anniversary of the Bard’s death, The Times reported.\n\nThe author, Simon Andrew Stirling, says contemporary rumours that Shakespeare was Davenant’s father were suppressed by academics who wanted to portray the playwright as a paragon of virtue. Shakespeare was the child’s godfather.\n\nHamnet, Shakespeare’s only son with his wife Anne Hathaway, had died some years earlier when only 11. The couple had two daughters who lived to marry.\n\nThe mother of his illegitimate boy was Jane Davenant, a tavern mistress whose husband John, a “grave melancholy man”, worked in the wine trade.\n\nRecords suggest that the Davenants’ first seven children died young in London. The couple then moved to Tattleton’s House, near Lincoln College, Oxford, where they raised another seven children, all reaching adulthood. The husband became mayor of the city.\n\nSonnet 126 has often been suggested to be a homoerotic love poem.\n\nIt begins, “O Thou my lovely Boy who in thy power, Doest hold times fickle glasse, his sickle, hour: Who hast by wayning grown.”\n\nThe mistaken gay theme may be explained because the poem comes at the end of a sequence known as the ‘Fair Youth’ sonnets which are understood by scholars to refer to a homosexual passion between Shakespeare and the Earl of Southampton.\n\nMr. Stirling notes that the pair appeared to have gone their separate ways in 1594. Three of the sonnets are known to have been written in 1603 and 1604, by which time Southampton was heading into his thirties.\n\n“Coming so soon after two sonnets composed in 1604,” Mr. Stirling writes, “it would be rash to presume that the ‘lovely Boy’ of Sonnet 126 was the mature Earl of Southampton.\n\nThe poem appears to have been written to a very young child whose birth caused his mother’s full-moon belly to wane.” William Davenant was born in 1606.\n\nTwo carvings and an engraving of the Bard and two pictures of Davenant indicate they shared the same inherited deformity of a droopy left eyebrow, according to Mr. Stirling.\n\n— PTI", 
    "section": "national", 
    "title": "Did Shakespeare have a secret son?", 
    "subsection": "general", 
    "date": "2016-02-17"
}