{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "A report prepared by the Delhi Police on the February 9 event in Jawaharlal Nehru University said: “DSU members felt offended and shouted slogans in support of Afzal Guru and Maqbool Bhat. The Left-supported groups were shouting ‘Bharat ki barbadi tak jang rahegi, jang rahegi, Kashmir ki aazadi tak, jang rahegi, jang rahegi’ ”.\n\nDispersed peacefully\n\nAccording to the report, 30 to 40 ABVP activists reached the spot and started shouting slogans like “Bharat mata ki jai”. Later, both the groups marched from Sabarmati Dhaba raising slogans against each other, and dispersed peacefully after some time.\n\nThe Delhi Police report, however, is contradictory to what eye-witnesses at the event said. According to the students, the ABVP members had a scuffle with the event organisers, mainly the Left activists. “When the situation worsened, some of us, including Kanhaiya, shouted the December 16 movement slogans like ‘ hum kya chahein azadi, mahilayen kya chahen azadi ’,” a member of a Left-supported organisation at the university told The Hindu .\n\n“The Left parties, which include AISA, SFI, AISF, were never involved in shouting any kind of objectionable slogans. In fact, we were the ones trying to stop the sloganeering. We have in the past too dissociated ourselves from such sloganeering. The Delhi Police report is completely false and we are not going to accept it,” said Mohit, a member of AISA.\n\nKilling celebrated\n\nThe report also mentions that the Special Branch had been keeping an eye on the activities in JNU, especially on the members of DSU. “It been has found that the group mourned Afzal Guru's death and celebrated the killing of Central Reserve Police Force personnel in anti-Naxal operations and worshipped 'Mahisasur in place of Goddess Durga' in September 2014,” says the report.", 
    "section": "national", 
    "title": "“DSU members shouted slogans in support of Afzal Guru”", 
    "subsection": "general", 
    "date": "2016-02-17"
}