{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The government has written to Twitter India, the micro-blogging site, seeking details of the account @HafeezSaeedJUD, which tweeted in support of the JNU student stir.\n\nOn Sunday, Union Home Minister Rajnath Singh said that the event organised on the 2001 Parliament attack convict Afzal Guru on the campus had the backing of Hafiz Saeed, the chief of Pakistan based Jamaat-ud-Dawah (JuD), the philanthropy arm of the terrorist outfit Lashkar-e-Taiba (LeT).\n\nThough a Home Ministry spokesperson clarified that the statement was based on inputs from different agencies, the Minister’s statement reportedly followed a message posted from a fake Twitter account of Saeed. The message, which asked users to trend the topic #PakStandWithJNU was red-flagged by the Delhi Police and it issued an alert following that. Hafiz Saeed posted a video denying that the tweet was posted by him.\n\n“The account is no longer in use but we want to get to the bottom of this. We have written to Twitter India and asked them for the relevant details,” a top government official told The Hindu .\n\nA member of the JuD cyber team said that the official account of Hafiz Saeed — @HafizSaeedLive — was very much active.\n\nThe cyber team member told The Hindu : “The Indian government has previously tried to suspend the official accounts of Hafiz Saeed…. we know our game well. Suspending accounts is a futile exercise, if one account is suspended, we create thousand more.”\n\nThe cyber team member claimed there was an obvious error in the name used in the Twitter handle — @HafeezSaeedJUD.\n\n“The Twitter handle mentions Hafeez instead of Hafiz. Hafeez is a different name, it means the one who protects, quite common in Pakistan. In India people often mistake that and pronounce it as Hafeez. The JuD chief’s name is Saeed and he is known as Hafiz Saeed, Hafiz meaning one who memorises the Koran,” said the cyber team member.\n\nHe also added that there was no need to tweet from a fake account as the official handle has been active for a year now and earlier it posted messages regarding Prime Minister Narendra Modi as well as Foreign Affairs Minister Sushma Swaraj’s visit to Pakistan.\n\nPosts in Hindi too: JuD\n\n“Each and every word on the official account is checked and tweeted by Hafiz Saeed himself and is controlled by his secretary. We have a mechanism. The tweets are in Hindi, English, Urdu and in Arabic as well depending on the audience. For the first time, we have started tweeting in Hindi also after Indian Minister blamed us for the JNU row,” the cyber team member said.", 
    "section": "national", 
    "title": "Govt. goes after fake JuD tweet", 
    "subsection": "general", 
    "date": "2016-02-17"
}