{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To seek 10 Assembly seats this time\n\nA meeting of the State office-bearers and district presidents of the Janata Dal (United) here on Tuesday decided not to sever its ties with the Congress-led United Democratic Front in the State.\n\nThe meeting chaired by State president M.P. Veerendrakumar took the decision in the wake of two opposing groups and one of them intensifying its position to join the CPI(M)-led Left Democratic Front(LDF).\n\nThe leaders also discussed in detail the suggestions and opinions of various district councils on the issue.\n\nA party functionary said that the meeting came to the conclusion that it would be a ‘political betrayal’ on the part of the JD(U) if the party were to switch coalition loyalties prior to the Assembly elections especially when the UDF was mired in a crisis. Besides, there was no solid ground for the party to join the Left coalition in this situation, he said.\n\nThe meeting also felt that the JD (U) is spearheading the anti-BJP platform in alliance with the Congress across the country. This was demonstrated in the Bihar polls and now would be replicated in many States going for the Assembly elections this year and in Uttar Pradesh next year. So it was not appropriate for the party to leave the Congress-led coalition in Kerala as well.\n\nHowever the JD (U) leadership would stake claim for more Assembly seats this time. The party was offered seven seats in the 2011 polls. But it contested only six seats following differences of opinion over the Chittur Assembly segment.\n\n“This time we will demand at least 10 seats including some of the winnable seats at Kalpetta, Vadakara and Koothuparamba. The Congress should reciprocate like we had offered the Congress party 28 seats in Bihar, ” the spokesman said.", 
    "section": "national", 
    "title": "JD(U) to stay put in Congress-led UDF", 
    "subsection": "general", 
    "date": "2016-02-17"
}