{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Memorandum signed by around 800 journalists submitted; SC to hear plea today\n\nThe brutal assault on some media persons at Patiala House Courts on Monday united the journalists’ fraternity as hundreds of them marched to the Supreme Court in protest on Tuesday.\n\nThe journalists raised slogans against the police inaction during the assault and called for the cancellation of licenses, and action against the lawyers involved in the assault.\n\nThe protest march included senior editors from several leading print and online media organisations and some well-known faces from the television industry. “Flex your intelligence, not your muscles,” and “the press is not your punching bag” were some of the messages sent through placards carried by the media.\n\nThe march, which began from the Press Club of India at Raisina Road, was halted by the police at the end of Bhagwan Das Road, a little before the Supreme Court.\n\nThereafter, a small delegation of journalists submitted a memorandum signed by around 800 journalists to the Supreme Court which agreed to hear a plea on Wednesday seeking action against those involved in the violence inside the Patiala House Courts premises.\n\nInterestingly, the journalists found support from a few lawyers who joined them mid-way of the march. Holding placards, one of which read ‘Lawyers Stand With Journalists’, the advocates condemned the violence.\n\nPolice initially denied permission for the march, but relented soon.\n\nPolice put up barricades just a little before the Supreme Court, forcing journalists to stop their march, but continue with their sloganeering which mainly called for Delhi Police Commissioner B.S. Bassi’s head for the police inaction in the entire episode. Journalists recounted the brutality of the assault by the lawyers who did not spare even women reporters who were present at the Patiala House Courts to cover the day’s proceedings.\n\nTelevision journalist Barkha Dutt said it was unacceptable that the suspects continued to roam free even though there were video clips and pictures of the incident.", 
    "section": "national", 
    "title": "Journalists take out march against attack", 
    "subsection": "general", 
    "date": "2016-02-17"
}