{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Only Pooja Kallur and her roommate Karishma Bhosale died in the accident at the hostel\n\nA day after they received the news of their youngest daughter’s death in a Russian medical college hostel , the members of Pooja Kallur’s family in Navi Mumbai await word on her body’s arrival, even as they try to navigate their way through a language barrier to understand just why their child, and her roommate from Pune, were the only two victims of the fire.\n\nPooja Kallur, 22, and her roommate Karishma Bhosale (20) from Pune, who were studying at the Smolensk Medical Academy in Russia died of suffocation after the fire broke out in their hostel. Family members said on Tuesday that all their efforts to reach the Russian embassy in India had failed. The family, despite seeking help from MLAs and MPs, could not reach External Affairs Minister Sushma Swaraj who had tweeted about the fire on Monday.\n\nThe family has demanded that the Indian government should ask officials in Russia to probe the fire.\n\nThe bookworm among her siblings, 22-year-old Pooja was the youngest of seven sisters and one brother. She was a fourth year student at the academy. “Last time we saw her was when she had come to attend her elder sister’s wedding in July. Even when she was holidaying in India, she would join a local hospital to gain more experience. My mother is shattered,” said Mayur Kallur, her 24-year-old brother.\n\nPooja’s father Siddapa — who retired as manager from Air India — is waiting to hear from the Indian Embassy in Russia.\n\n“They treated us well on phone. They provided all the information and are trying to help. But we have not been given any information from the Russian Embassy in India. Even our Minister is not saying anything on this,” he said.\n\nMayur Kallur said a probe was needed. “They evacuated 900 other students, but not my sister and her roommate. We were told by her friends in Russia that it is not a case of short-circuit. A water heater was used by in an adjacent room and it caught fire,” he said. Mr Kallur alleged that no security system or sprinklers worked. “We paid almost Rs 6 lakh per year for her education. Can’t they provide basic security measures in a hostel?” he asked.\n\nHe further said that apart from a phone call from the college administration to inform them about Pooja’s death, the family has not heard anything from Russia. “Language is becoming a great barrier and now they are not picking up the phone. It seems that the college wants to cover up the tragedy,” Mr. Kallur said.\n\nMeanwhile, friends and relatives of Pooja have joined hands and are planning to start a social media campaign to press for a probe. “We are coming together on Twitter, Facebook and WhatsApp to spread the word and demand an inquiry,” said Girish Kurane, 22, a family friend.", 
    "section": "national", 
    "title": "Mumbai family wants Central government to demand a probe into Sunday’s fire", 
    "subsection": "general", 
    "date": "2016-02-17"
}