{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "In his first public address as the Muzaffarnagar MLA on Tuesday, BJP’s Kapil Deo Agarwal said the party would not tolerate any attack on the honour of Hindu women.\n\nAddressing a crowd from the inner sanctum of a Shiva temple in the heart of the city, Mr. Agarwal sent the stern message amid loud slogans of ‘Jai Shree Ram’.\n\nUnion Minister for State for Agriculture and Member of Parliament from Muzaffarnagar Sanjeev Baliyan who was also present said the BJP victory in Muzaffarnagar would expand to the entire State. Given the fact that his entire election campaign targeted a “particular community” for attacking the “honour of Hindu women”, it was not difficult to guess who the message was addressed to.\n\nMr. Agarwal’s main campaign slogan went ‘ Bahu beti ke samman me / Kapil Deo maidan me (Kapil Deo is contesting the poll for the sake of the honour of daughters and daughters-in-law).\n\nFlanked by Union Minister for State for Agriculture and Member of Parliament from Muzaffarnagar Sanjeev Baliyan, Mr. Agarwal was speaking to a charged crowd constantly raising the slogan “jo Hindu hit ki baat karega/ wahi desh per raj karega (only those who talk about the interest of Hindus will rule the country) and “Ram Lala hum aayenge/ mandir wahin banayenge (Oh! Lord Ram, we will come and build a temple at that place only)”.\n\nDominant narrative\n\nThe symbolism of Mr. Agarwal’s first public address as the Muzaffarnagar MLA from the inner sanctum of a Shiva temple in such a surcharged atmosphere went beyond just the city. From what local party leaders told The Hindu , Muzaffarnagar will write the dominant narratives of the State Assembly elections in 2017.\n\nIronically, the party that flaunts Sabka Saath, Sabha Vikas as its national agenda had kept divisive issues like Ram Mandir, Muzaffarnagar riots and love jihad as the dominant issues to mobilise voters.\n\nMr. Baliyan announced that the BJP victory in Muzaffarnagar would expand to the entire State.\n\n“This will be our fourth victory. First was the Lok Sabha, then Zila Panchayat and local panchayat and then the Assembly seat,” he said, adding that the BJP “rules Muzaffarnagar with its representatives holding the post of MP, MLA, ‘nagar Palika’ chairman as well as local panchayat bodies.”\n\nCertain BJP leaders said the party’s victory in a sense made up for its defeat in two other seats, Deoband and Bikapur, in more ways than one.\n\nLocal BJP leaders as well as Mr. Baliyan conceded that winning Muzaffarnagar seat was “symbolically extremely crucial for the party at several levels.”", 
    "section": "national", 
    "title": "Muzaffarnagar will decide direction of Uttar Pradesh", 
    "subsection": "general", 
    "date": "2016-02-17"
}