{
    "author": [
        "Anil Kumar Sastry"
    ], 
    "text": "Indian Railways, which has been called the common man’s transport, has decided to go the roadways’ and airlines’ way to encash the demand for more trains/ accommodation by increasing fares during peak travel seasons.\n\nConsequently, zonal railways are barred from introducing special trains under normal fares to clear festival/ holiday rush. However, they may introduce unreserved special train for all distances, including Jansadharan Express, and also special trains to clear passengers due to hold up of traffic following incidents like accidents, floods, breaches, line blocks, cancellation of trains etc., said the Railway Board.\n\nApart from the two exceptions, no special trains should be introduced on normal fare structure applicable to regular train services, the Board said. Special trains under the rule should henceforth be introduced only on Suvidha fare or on special charges, the Board said.\n\nWhen running a lie-over rake of a normal train is used to run a Suvidha or a special train on special charges, the general second class coaches in such a train may be allowed to run as unreserved coaches. The charges for such coaches and fares should be the same for unreserved accommodation as in superfast mail/ express trains, the Board clarified.\n\nThree types\n\nThe Board had formulated three types of Suvidha trains — fully air-conditioned services with or without stoppages; mixed services with en-route commercial stoppages on mixed Duronto pattern and mixed services with en-route stoppages on mail/express pattern.\n\nOnly confirmed or RAC tickets under the general quota would be issued for these trains without any concession.\n\nSpecial trains on special charges too would run as fully reserved trains.\n\nSpecial trains under normal fares should not be introduced, Railway Board", 
    "section": "national", 
    "title": "No more special trains on normal fares: Railway Board", 
    "subsection": "general", 
    "date": "2016-02-17"
}