{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CBI said he and wife Indrani had planned the murder since 2009\n\nFormer media baron Peter Mukerjea was on Tuesday charged with murder, abduction, destruction of evidence and giving false information in connection with Sheena Bora murder case.\n\nThe Central Bureau of Investigation (CBI) on Tuesday filed its supplementary charge sheet which revealed that Peter and Indrani, the prime accused in the murder, started planning Sheena’s murder since 2009. The 500-page charge sheet states that Peter and Indrani were unhappy with Sheena’s relationship with Rahul, Peter’s son, and that Peter had told one of his friends, Prithul Sanghavi, that the relationship was not right. The charge sheet mentions that Peter and Indrani sold a South Delhi flat that belonged to Sheena.\n\nThe charge sheet has given details of the calls made between Peter and Indrani after Sheena’s body was disposed. While one conversation lasted 924 seconds, other calls made on April 24 2012 lasted 242 seconds and 1,329 seconds. A text message was also exchanged between the two.\n\nA month after Sheena’s death, Peter sent an e-mail to Rahul maintaining that Sheena is fine. Excerpts of emails exchanged between Sheena and her friend are also mentioned in the charge sheet. In a mail dated August 26, 2009, Sheena said: “Indrani has tried her best that I should lose my job. She had contacted higher up in Reliance but I managed to save my job.”\n\nIn another e-mail on August 28, 2009, she said Indrani was not a good mother and that she had been tortured by her .\n\nThe charge sheet filed before Additional Metropolitan Magistrate R.V. Adone discloses that Sheena was given far less money compared to Indrani’s daughter Vidhie between 2005 and 2007. Although no financial trail is known of as yet, it is made clear that Peter has a role to play in Sheena Bora murder case.\n\nThe CBI has charged him with Section 364 (kidnapping or abducting in order to murder), 302 (punishment for murder), 328 (causing hurt by means of poison etc), 201 (causing disappearance of evidence of offence), 203 (giving false information respecting an offence committed), 307 (attempt to murder), 420 (cheating and dishonestly inducing delivery of property), 468 (forgery for purpose of cheating) and 471 (using as genuine a forged document or electronic record) of the Indian Penal Code.", 
    "section": "national", 
    "title": "Peter charged with abduction, murder in Sheena Bora case", 
    "subsection": "general", 
    "date": "2016-02-17"
}