{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "As the Jawaharlal Nehru University faces the charge of encouraging anti-national elements on its campus, for the last four days Associate Professor of Urdu in Delhi University and eminent writer Ali Javed has had to submit to some intense questioning by the SHO and Additional DCP at the Parliament police station.\n\nThe police are investigating his role in organising an event at the Press Club of India on February 10, to mark the third anniversary of Afzal Guru’s hanging.\n\nHe is not alone. On February 14, former Professor of Philosophy at the Delhi University Nirmalangshu Mukherji, the author of December 13: Terror over Democracy a critically acclaimed book that examines the attack on Parliament, and co-editor of noted linguist and global dissident Noam Chomsky’s Architecture of Language , too has been asked to explain his address at the said event.\n\nThe police want to know whether the professors had prior knowledge of the event where slogans of Azadi were raised. Their participation, according to the police, was tantamount to being ‘anti-national.’ The onus is on the professors to establish their nationalist credentials. The questioning of the professors has gone on for 10 hours and more.\n\nAnother former DU professor S.A.R. Geelani was taken into custody on Monday for the same offence of organising the event.\n\nOn February 15, retired professors Vijay Singh and Tripta Wahi, parents of AAP spokesperson Atishi Marlena, were asked appear at the police station, for they too had spoken at the event.\n\nWhile Mr. Javed has been undergoing sustained questioning for his role in booking the venue for the event, the police are carefully reading the professor’s book on the attack on Parliament. It is learnt, he was asked repeatedly why he had not objected to the photographs of Maqbool Bhat (who was hanged in 1984) and Afzal Guru at the venue. In the said event pro-Azadi slogans for Kashmir were raised and while the professors sought to distance themselves from the sloganeering, they stayed on to present their position — at variance from those who had come for the event.\n\nIt is learnt, the police are surprised that educated academics could participate in an ‘anti-national’ programme. Confirming that the professors are being questioned in connection with the event, a senior Delhi police officer said: “We are following the due process of law. No coercive action has been used. They are being served notices as per rule to join the probe. After questioning, they are being allowed to leave in the evening.”\n\n“The case has been registered on the basis of a Hindi television news channel footage showing the professors on the podium, behind which was a poster captioned ‘Celebrating Martyrdom’ and carrying photographs of terrorists Afzal Guru and Maqbool Bhat,” he said.", 
    "section": "national", 
    "title": "Professors face intense questioning", 
    "subsection": "general", 
    "date": "2016-02-17"
}