{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CPI(M) workers assaulted him in front of his parents, say police\n\nPolice said the assailants stormed into the house of Sujith (inset) on Monday, and attackedhim using sticks.— PHOTOs: S.K. MOHAN\n\nA 27-year-old Rashtriya Swayamsevak Sangh (RSS) worker was beaten to death at his house at Aroli near Pappinissery, under the Valapattanam police station limits, here late on Monday.\n\nThe victim has been identified as P.V. Sujith, a painter. His parents, Janardhanan, 70, and Sulochana, 60, and brother Jayesh, 26, were also injured. They have been admitted to a private hospital here.\n\nThe police said that the assailants stormed into Sujith’s house around 11 p.m. on Monday and attacked him using sticks. Sujith’s parents suffered injuries when they tried to protect him. The police said Sujith received injuries in the back of his head. The deep injury raised the suspicion that he was stabbed.\n\nThe group of assailants included 10 to 15 local CPI (M) workers, the police said adding that many of them have been identified.\n\n“The police have taken into custody eight persons in connection with the attack and some of them are believed to have taken part in the attack,” District Police Chief Hari Sankar told The Hindu . He said the law and order situation was under control.\n\nCPI (M) denies role\n\nThe CPI (M) leadership denied that the party had any role in the attack. Party leaders said the attack was triggered by a local issue allegedly involving the harassment of a girl.\n\nBharatiya Janata Party district president P. Sathyaprakash said the CPI (M) was using its ‘old strategy’ of maligning the victims of its violence. He said the deceased was from a family of former CPI (M) workers.\n\nPolice personnel in large numbers were deployed in the tension-hit areas in Pappinissery.\n\nThe houses of two CPI (M) workers were pelted with stones in the morning by alleged BJP-RSS workers. The BJP-RSS observed a hartal in the area to protest against the murder.", 
    "section": "national", 
    "title": "RSS worker beaten to death in Kerala", 
    "subsection": "general", 
    "date": "2016-02-17"
}