{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Tuesday declined to intervene in the Arunachal Pradesh political controversy while the Centre indicated that it was in favour of withdrawing President’s Rule in the State to make way for a new government with dissident Congress leader Kalikho Pul as Chief Minister.\n\nMr.Pul has staked his claim to form a government with the support of 31 MLAs comprising 18 Congress rebels, 11 BJP and two Independent MLAs had met Governor J.P. Rajkhowa.\n\n‘No report sent’\n\nHowever, the Governor’s counsel and senior advocate Satya Pal Jain said no report had yet been sent to the President recommending withdrawal of emergency in the State.\n\nThe Centre said that a constitutional vacuum and a state of “dormancy” cannot prevail in Arunachal Pradesh because the Supreme Court is testing the legality of the emergency declared on January 26. Attorney-General Mukul Rohatgi assured the five-judge Bench led by Justice J.S. Khehar that even if a new government is formed, the Supreme Court could later on “annul everything” if it struck down the proclamation of emergency as unconstitutional.\n\n“There is no cloak of invincibility. Nothing is irreversible,” Mr. Rohatgi submitted.\n\n“But what is your interest in this?” Justice Dipak Misra asked.\n\n“I am interested ultimately to revoke the President’s rule and have a government sworn in. There cannot be a constitutional vacuum just because the Supreme Court is hearing the case. Nothing is irreversible. If we fail ultimately (to prove the constitutionality of the proclamation of emergency), conduct a floor test and get Mr. Tuki back,” Mr. Rohatgi responded.\n\nWhen asked to counter the Centre’s submissions, senior advocate Kapil Sibal submitted that when President’s Rule is withdrawn, the government earlier in power automatically revives.\n\nThe court said an interim way out of the crisis would be to conduct a floor test in the House", 
    "section": "national", 
    "title": "SC declines to intervene in Arunachal political impasse", 
    "subsection": "general", 
    "date": "2016-02-17"
}