{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "To those of us familiar with Carnatic musician T.M. Krishna’s concert presentations and packaging that comes with a whole lot of surprises, a concert planned on Sunday in Bengaluru is sure to throw up more novelties. Mr. Krishna, along with members of the Jogappa community, known for their rendering of folk melodies from north Karnataka, will present a blend of genres as they share a common platform.\n\nThe Jogappas are a small transgender subculture in north Karnataka, parts of Andhra Pradesh and Maharashtra, dedicated to goddess Yellamma (Renuka). They make a living by Joga (begging), singing and dancing.\n\n“This is expected to be rare,as the intermingle of native folk melodies from a transgender community come together to share a stage with T.M. Krishna,” says Shubha Chacko of Solidarity Foundation, which is organising the show. Call it radical or taking up a formatting that goes beyond a pattern, the coming together of Mr. Krishna and the Jogappa community is to underline the fact that it is time music too looked into equality issues, says Shubha.\n\nFor Mr. Krishna, gender equality issues are a natural extension of asking fundamental questions about ourselves and society.\n\n“I will for certain continue to seek it, for only then can we experience the beauty of people. I think most issues are not just about ‘being with’ or ‘against’ anything, they are about all that lies in between,” he says.\n\nThe Jogappa community is surprised that it would be singing for an audience as “we are used to our native and rustic singing to the accompaniment of the one-stringed ‘chudike’. “After knowing the stature of T.M. Krishna, we are surprised that we would be on stage with him,” says a dazed Siddappa.\n\nThis engagement made Mr. Krishna, who has set a record of performing even at Jaffna, ask himself difficult questions.\n\n“The truth is I am as conditioned as anyone else with pre-conceived notions on gender and sexuality. As far as the concert goes, it will be musical sharing among people,” he says.\n\nMr. Krishna adds that many elements will be present, including Carnatic. “The Jogappas singing is fresh, open, carefree and real. We don’t have that quality in our singing. Their folk has similarities with bhakti music and namasankirtan traditions. At places, we will cross over to each other’s forms,” he says.", 
    "section": "national", 
    "title": "T.M. Krishna to lead a concert for equality in Bengaluru", 
    "subsection": "general", 
    "date": "2016-02-17"
}