{
    "author": [
        "Kolkata Bureau"
    ], 
    "text": "At a time when the debate raging in the country over the arrest of Jawaharlal Nehru Student Union president Kanhaiya Kumar the Trinamool Congress ( TMC) silence has raised questions in political circles.\n\nOver the past two years the TMC has hardly spared any opportunity to target the Bharatiya Janata party ( BJP) government at Centre. In fact the party has sent a delegation to Hyderabad after the death of research scholar Rohith Vemula only a few weeks ago.\n\nHowever, the party leaders including the party chairperson neither have said anything publicly on the issue nor have made comments on the issue on their active social media platforms.\n\nWhile the senior leaders of the ruling party refused to comment on the issue on Tuesday party’s student wing chairperson Ashok Rudra remained non-committal on the issue.\n\n“While no one should be arrested without a reason the issue of national security should also be kept in mind,” this is all Mr Rudra had to say.\n\nThe leaders of the Communist Party of India (Marxist) and Congress took the silence as an opportunity to target the TMC.\n\n“Modi has learnt on how to target academic institutions and attack journalists from Didi ( Mamata Banerjee) How will she speak about it,” CPI(M) Polit Bureau member Mohd Salim said.\n\nCongress Rajya Sabha MP Pradip Bhattacharya said before the polls the ruling TMC will do nothing to displease the ruling BJP government at Centre indicating that it is reflection of tacit understanding between the BJP and TMC.\n\nPolitical analysts are also of the opinion that consideration the history of interventions by the TMC government in the academic institutions and intolerance of dissent it is difficult for the ruling party to condemn the arrest.", 
    "section": "national", 
    "title": "Trinamool Congress silence raises questions in political circles", 
    "subsection": "general", 
    "date": "2016-02-17"
}