{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "The new president of Gujarat BJP will be elected on February 19 in the presence of top leaders, including Chief Minister Anandiben Patel and party’s central observer Arjun Meghwal.\n\nParty veteran and Minister for Transport, Labour and Water Resources Vijay Rupani has emerged the front-runner.\n\nBJP sources said Mr. Rupani’s election was a foregone conclusion because he had been chosen as consensus candidate after several names were considered.\n\n“He can create a balance between factions led by national president Amit Shah and Chief Minister Patel,” said a top party leader. Secondly, he belongs to a neutral caste, bania.\n\nOthers in the fray included State Ministers Bhupendrasinh Chudasama and Pradipsinh Jadeja. Mr. Chudasama and Mr. Jadeja are kshatriya and are from Ahmedabad district while Mr. Rupani is a bania from Saurashtra, the largest region of Gujarat where the BJP suffered heavily in the local elections held in November 2015.\n\nEarlier, Mr. Rupani has been general secretary and spokesperson of the State BJP for over a decade. He was also a member of the Rajya Sabha.\n\n“He has worked with Prime Minister Narendra Modi, Mr. Shah and Ms. Patel and is also trusted by the RSS as he was active in the organisation since the Emergency when he was jailed,” a party insider said.\n\nThe new president was supposed to have been declared by January 20 but owing to differences between Mr. Shah and the Chief Minister, restructuring of the State unit was delayed. The party faced a dilemma on whether to go for a Patel leader as head or entrust the responsibility to someone from the other backward class communities in the backdrop of the agitation by the Patels to seek OBC status, while there was a counter-agitation by the OBCs to protect their quota basket.", 
    "section": "national", 
    "title": "Vijay Rupani likely to be Gujarat BJP president", 
    "subsection": "general", 
    "date": "2016-02-17"
}