{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "Hasnain Warekar slits throats of kin, sister survives to tell tale of horror\n\nThe Thane police in Maharashtra are probing if the food eaten by the 14 family members of Hasnain Warekar, the 35-year-old man who killed them before ending his life, was laced with drugs to sedate them.\n\nPTI reports, quoting the police said, Hasnain offered prayers around 3 a.m. at a mosque near his house. After returning home, he slit the throats of his family members one by one, and then hanged himself. Around 5.30 a.m., Hasnain’s 22-year-old sister, Subiya Sozab Bharmal — the lone survivor — shouted for help, alerting the neighbours.\n\nKills wife, children\n\nAccording to DCP V.B. Chandanshive: “He first killed his wife and two children with whom he stayed on the first floor of the house. When his sister Subiya woke up, she saw him killing her sister with a knife. She ran to the bedroom (on the ground floor) to save herself. That’s when he injured her.”\n\nSubiya screamed for help. Her in-laws, who were in the neighbouring house, heard her cries and tried opening the door, but it was locked from inside. They broke open the grille of a window and entered the house.\n\nNeighbours alert police\n\nThe neighbours alerted the police before rushing her to Titan Hospital where she received 25 stitches. She also needed blood transfusion. She is reported to be out of danger.\n\nPreliminary investigations have not indicated any clear motive for the murders. Police are also probing if there was any property dispute, but there is no documentary evidence to suggest that.\n\nIn her statement to the police, Subiya denied any property or family dispute.\n\nThe 14 bodies were found in different rooms and blood was seen everywhere in the house owned by the family. The family had been living there for 10 years, according to the police.\n\nHasnain’s body was found hanging from the ceiling with a knife dangling in his right hand, they said.\n\nSubiya’s statement\n\nThe surviving sister gave a statement to the police. Constable Meera Kedar told media persons: “When I asked her why she did not scream, she said, ‘bhai kisi ko chillane nahi de raha tha’ [brother was not letting anyone scream]. He had a sharp weapon and did not let anyone escape. She said she did not know why he did this. On Saturday night, the family ate and went to sleep. There was no fight at dinner and, according to her, he had no dispute with his parents or wife.” According to Subiya and Warekar’s neighbours, Hasnain had invited his three sisters to his house for a daavat . Another sister, Batul Warekar, who is not married, stayed in the same house with her parents and her brother’s family.\n\nThe incident took place between 1 a.m. and 3 a.m., the statement said. Hasnain’s neighbours, whose house is very close to the ‘Warekar Manzil,’ said they first heard Subiya scream around 3 a.m. Subiya also used a steel glass to bang on the window grille to attract her neighbours’ attention.\n\n“I gathered around 10-12 people. We had to break the window to pull her out. She said, ‘ bhai ne kiya ’ [brother did it]. We sent her to the hospital and informed the police. He is my relative, but I have no idea why he did it,” Altamas Warekar told The Hindu . The police said that when Subiya was calling for help, Hasnain could have been in the act of hanging himself.\n\n‘Used butcher’s knife’\n\nAccording to several testimonies, Hasnain’s father Anwar Warekar had bought a butcher’s knife for ‘qurbani’ (sacrificing goats). Hasnain allegedly used this knife to kill his family.\n\nThe bodies of the victims were sent to the Thane civil hospital for post-mortem. The police have collected viscera samples and sent them for forensic examination to determine any use of poison. A team from the Kalina Forensic laboratory came to the house on Sunday.\n\n“There are bloodstains on the floor, the bedding material, bathrooms and chappals,” said Tausif Patel, a neighbour who was called into the house, which was kept shut throughout for police investigation.\n\nThe police ruled out the possibility of an outside hand in the murders.\n\nPolice say there is no documentary evidence to suggest any property dispute", 
    "section": "national", 
    "title": "A macabre end to a ‘get-together’", 
    "subsection": "general", 
    "date": "2016-02-29"
}