{
    "author": [
        "Peerzada Abrar"
    ], 
    "text": "Mobile app tells you which animal can be found in which sanctuary and the best time to see them. Seen here is an Asian Paradise Flycatcher.— PHOTO: M.A.SRIRAM\n\nYou can hail a taxi with an app in the blink of an eye. But spotting a tiger or that majestic Asian paradise flycatcher in a forest using an app needs a different level of innovation.\n\nManjunath M. Gowda, an entrepreneur from Bengaluru, has developed the technology that will help travellers find animals and birds while on a safari.\n\n“You can search which animal and bird can be found in which sanctuary and what is the best time to see them,” said Mr. Gowda, 46-year-old founder of WildTrails. The startup offers an app that works on Apple’s mobile operating system and Google’s Android platform. It helps travellers get the best of what national parks and safaris will offer.\n\nThis is the third venture for Mr. Gowda, an alumnus of the University Visvesvaraya College of Engineering. After selling his earlier venture S7 Software to California-based Internet-security software-maker Blue Coat Systems for $8.25 million (Rs. 56 crore) Mr. Gowda launched i7 Networks in 2012.\n\nIt provided enterprise mobile security to multinational firms mainly in the U.S. market.\n\nLast spring, Mr. Gowda and his team huddled together in Nagarhole National Park. Surrounded by small streams, hills and waterfalls they discussed what to do next? Being a wildlife enthusiast, Mr. Gowda, who has been doing the forest rounds for the last two decades, realised that he still struggles to find and book a resort or a safari in jungles and national parks.\n\n“We decided that we need to solve this problem,” said Mr. Gowda, who later founded WildTrails. The startup also provides information about suitable resorts, lodges, homestays, transportation, and camera equipment.\n\nBut providing such information is not as easy as it sounds. Recently, a couple from California wanted to visit Nagarhole National Park. But they were confused about which safari to take and where to stay? This is because there are two parts to the Nagarhole forest. One is in Mysuru district on the banks of the Kabini and the other is in Kodagu district. Safaris are conducted at both the places. WildTrails was able to help the couple make the right choice.", 
    "section": "national", 
    "title": "An eye to spot the paradise flycatcher", 
    "subsection": "general", 
    "date": "2016-02-29"
}