{
    "author": [], 
    "text": "Frederic Jastrzebski, co-head of French custom-made bicycle company Maison Tamboite, poses in the firm’s showroom in Paris. (Right ) A bicycle handle with a leather finish and wooden carrier.— Photos: AFP\n\nOnce forced out of business by mass production, a family firm in Paris has found a new lease of life, once again hand-crafting bicycles as a luxury must-have.\n\nMaison Tamboite, founded in 1912, had an A-list clientele including the likes of Marlene Dietrich, Maurice Chevalier, Edith Piaf and Josephine Baker in its heyday.\n\n“My grandfather didn’t brag about his customers,” said Frederic Jastrzebski. “It was by flipping through his order books and his diary... that we found mentions of these people.”\n\nIt was an uncle who closed down the company in the 1980s when bicycles began being mass-produced and could be found even in supermarkets, Mr. Jastrzebski said.\n\nAfter working in finance for two decades, Mr. Jastrzebski was turning 50 in late 2014 when he persuaded his brother — and their wives — “to revive the brand with the same sincere, artisanal workmanship, the same quest for authenticity and perfection.”\n\nIn the new workshop near the Bastille in eastern Paris, Mr. Jastrzebski has kept the old wooden drawers from the original shop on the other side of town.\n\nHe also has the original tools, an old catalogue and the counter on which his great-grandfather built bicycles.\n\nProduction has begun, with the Jastrzebskis peddling their two-wheeled creations as an “urban aesthetic” for the well-heeled.\n\nSubtle gleam\n\nGleaming but not bling, the bicycles are virtual works of art, their metal frames contrasting with the honey-toned oak from Italy’s Lake Como region used in the wheel rims and the mud guards.\n\nHand-burnished leather is everywhere: used for the seat of course, but also on the handlebar, the pedals and the lock -- as well as the optional satchel.\n\nThey sell for an impressive €11,000 euros, with the electric version priced at €15,500.\n\nEach bicycle takes three months to make, custom fitted on the basis of no fewer than 15 measurements. “The time justifies the price,” Mr. Jastrzebski said.\n\n“Like a watch, a piece of jewellery, a handbag or an artwork, [the bicycle] will take its place as a luxury accessory that generates real emotion,” he added.\n\nCraftsman Hugo Canivenc, the workshop's only employee, said: “It’s work similar to making jewellery, requiring the same meticulousness.”\n\nThe frame alone can take a month to make before the glam embellishments are added, the 24-year-old noted.\n\nAsked about the wisdom of leaving a Tamboite bicycle on a public street, even with a sturdy lock, Mr. Jastrzebski said: “All of our models are numbered and traceable. And let's also remember that it's the most basic bicycle models that are stolen the most.”\n\nBesides, the bikes make excellent decoration in an entrance hall, “or even your living room,” he suggested. — AFP\n\nFrench family firm founded in 1912 promotes hand-made bikes as luxury must-have", 
    "section": "national", 
    "title": "An ‘urban aesthetic’ for the well-heeled", 
    "subsection": "general", 
    "date": "2016-02-29"
}