{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Bangladesh Minister’s coming amid crackdown on Islamists back home\n\nMarking the first high-level visit of the year from Bangladesh, Foreign Minister Abul Hassan Mahmood is expected to arrive in India for a three-day visit on Tuesday, in the backdrop of the ongoing crackdown by Prime Minister Sheikh Hasina’s government on the radical groups in the country.\n\nThe visit of Mr. Mahmood is being watched with interest as it comes during the countrywide counter-terror operation by the Bangladesh government which led to the arrest of three activists of the banned Jamaat’ul Mujahideen Bangladesh, who are suspected of murdering a prominent Hindu priest on February 21.\n\nMr. Mahmood’s visit was initially planned for the Raisina Dialogue which will be held in Delhi between March 1 and 3, but diplomatic sources told The Hindu that attempts are on to have a bilateral dialogue between Mr. Mahmood and External Affairs Minister Sushma Swaraj on the sideline of the event which is the first such flagship dialogue programme being co-organised by the MEA.\n\nIndia and Bangladesh are expected to hold bilateral talks in Kathmandu during the SAARC ministerial meeting in mid-March.\n\nMutual interest\n\nBut sources told The Hindu that a bilateral discussion now will be in mutual interest given the ongoing security-related developments in Bangladesh. Apart from the recent terror attacks, Mr. Mahmood’s visit will give India and Bangladesh an opportunity to assess the fallout of the war crimes trial which has taken a crucial turn with the scheduled hearing of an appeal on March 8 by Mir Quasem Ali, prominent Jamaat leader, who was given the death penalty in 2015 for his role in the war crimes of 1971.\n\nEfforts are on for a bilateral dialogue between the minister and Sushma Swaraj", 
    "section": "national", 
    "title": "Bangladesh Foreign Minister Mahmood arrives tomorrow", 
    "subsection": "general", 
    "date": "2016-02-29"
}