{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "For a BJP struggling to even appoint a party president to engage the complex caste arithmetic of Uttar Pradesh, Union Human Resource Development Minister Smriti Irani’s fiery turn in the Lok Sabha during a discussion on the suicide of Dalit scholar Rohith Vemula and charges of sedition against students of Jawaharlal Nehru University (JNU) has led to speculation that it could be Ms. Irani, or two other Delhi-based leaders from Uttar Pradesh, one of whom is a Union Minister.\n\nAfter sweeping the State in the general elections of 2014, the party has been on a downward slope, in the local body elections and other by-elections held in the interim. It won the Muzzaffarnagar by-poll recently, but the Jat quota agitation in nearby BJP-ruled Haryana may make it difficult going for the party in western Uttar Pradesh, where it had won most seats in 2014 with considerable Jat support.\n\n“We have to counter the mass base of both the Samajwadi Party (SP) and the Bahujan Samaj Party (BSP) with not just some arithmetic of our own, but offer a face around which the campaign can be built,” said a senior office-bearer of the party.\n\n“Both these parties have clear leadership to offer in the State, and we cannot go to the people without that,” he added. State unit leaders have been meeting with party president Amit Shah on this issue.\n\nThe BJP State unit, despite having completed all required district-level polls to elect a president is dragging its feet as the party, both at the State and the Centre cannot make up its mind on just which way to go politically.\n\n“Earlier, there was a thinking that a backward community person must be made State chief to give a signal that the BJP had moved beyond its upper caste moorings. Swatantra Dev Singh and Dharampal Lodh were the candidates that we were talking about. Now the consideration has moved to upper caste or such candidates as Minister of State for Railways Manoj Sinha, who, as a Bhumihar community man has a limited base in the State,” said the source.\n\nWith Mr. Shah set to redo his national team in by the second week of March, it will be interesting to see just who is finally Lucknow-bound.", 
    "section": "national", 
    "title": "BJP seeking a CM candidate in U.P.", 
    "subsection": "general", 
    "date": "2016-02-29"
}