{
    "author": [
        "National Bureau"
    ], 
    "text": "The body is mandated to play a critical role in reforming the troubled public sector banks\n\nPrime Minister Narendra Modi on Sunday approved the setting up of the Bank Board Bureau with former Comptroller and Auditor-General of India Vinod Rai as its first Chairman.\n\nThe Bureau is mandated to play a critical role in reforming the troubled public sector banks by recommending appointments to leadership positions and boards in those banks and advise them on ways to raise funds and how to go ahead with mergers and acquisitions.\n\n“With a view to improve the governance of public sector banks, the government had decided to set up an autonomous Bank Board Bureau. The bureau will recommend for selection the heads of public sector banks and financial institutions and help banks in developing strategies and capital raising plans,” the government said in a release.\n\nThe bureau was announced last August as part of the seven-point Indradhanush plan to revamp these banks. It will constantly engage with the boards of all 22 public sector banks to formulate appropriate strategies for their growth and development.\n\nThe bureau, led by Mr Rai, will select the heads of public sector banks (even from the private sector, if need be) and aid them in formulating strategies to raise additional capital. It will select and appoint non-executive chairmen and non-official directors.\n\nThe non-performing assets of public sector banks are estimated at almost Rs. 4 lakh crore, and they need to raise capital of Rs. 2.4 lakh crore by 2018 to conform to Basel-III capital requirement norms, according to the government.\n\nWhile some questions have been raised on Mr. Rai's appointment as a CAG cannot hold a government office post-retirement, former senior civil servants say the role is advisory in nature and a part-time position. The government release said the appointments have been made for a period of two years.\n\nThe bureau will have three ex-officio members and three expert members, in addition to the Chairman.", 
    "section": "national", 
    "title": "Centre’s nod for Bank Board Bureau", 
    "subsection": "general", 
    "date": "2016-02-29"
}