{
    "author": [], 
    "text": "Expediting steps to push indigenous manufacture and design of components for electric vehicles is in line with ‘Make In India’ initiative.\n\nProviding incentives to boost domestic manufacture of components such as Lithium-Iron batteries would in turn reduce the cost of e-vehicles and benefit consumers, the Road Transport & Highways Ministry and the Heavy Industries & Public Enterprises Ministry had argued during inter-ministerial consultations on the issue, the sources said.\n\nExpediting steps, including through the budget, to push indigenous manufacture and design of components for electric/hybrid vehicles is also in line with the government’s ‘Make In India’ initiative and the Automotive Mission Plan.\n\nConcerned over the high cost of imported Lithium-Iron batteries, these Ministries had said development of locally made and patented Lithium-Iron batteries could substantially reduce the price of the crucial component in e-vehicles.\n\nAt inter-ministerial consultations, there were arguments over the logic of providing sops for e-cycles when ordinary cycles themselves were environment-friendly and not consuming any fossil fuel at all.\n\nHowever, the worries over increase in the use of cars and SUVs worsening pollution and the need to gradually reduce the reliance on imports of e-cycles and JVs with foreign firms were the arguments in favour of providing incentives for local development and manufacture of e-cycles.\n\nAs for solar water pumps, it was brought to the government’s notice that many farmers could not afford them because they were expensive (around Rs. five lakh). Because providing subsidy worth Rs. Five lakh to every farmer would be impractical, the Centre may go in for a subsidy-sharing arrangement with the States, or eliminate some of its existing ineffective incentives to ensure a fair allocation for subsidies on solar water pumps. Also, though many States were supplying power to farmers virtually free of cost, the quality of power was poor with outages and a sudden drop in voltage damaging the farmers’ water pumpsets. Helping farmers with subsidies could ensure that they switch to solar water pumps, thus doing away with the need to provide free power, the sources said.", 
    "section": "national", 
    "title": "Electric vehicle components, e-cycles may get sops in Budget", 
    "subsection": "general", 
    "date": "2016-02-29"
}