{
    "author": [
        "Shyama Rajagopal"
    ], 
    "text": "Gritty women, all of 25, have taken on themselves the challenge to test their mettle at sea. Left to the elements of nature on the Mhadei, a Navy sail boat, the five of them led by their captain Lieutenant Commander Vartika Joshi, Naval Architect, were full of verve as they spoke about their adventures at sea.\n\nIt is their love for sea and adventure that has brought the five-woman crew together to take to sailing under the guidance of Commander Dileep Dhonde, who was the first to circumnavigate the globe on a sail boat.\n\nDocked at Kochi for a couple of days during their sailing from Visakhapatnam to Goa via Chennai and Kochi, that will gear them up for their next longer sailing sojourn to Mauritius later, the sailors looked happy to find their camaraderie in each other pepping up their daily routine on board.\n\nThe sea really is the best test of your endurance, says Lieutenant P. Swathi, ATC officer. “The sea squalls approach at high speeds of 30-35 knots and take you just by surprise. There could be cyclones too and at times there would be no wind at all”, she said. Even though the training on shore is complete with total knowledge on oceanography, meteorology, navigation tips, seamanship and other things that one needs to know about the boat, but once on board when we set sail, it is your tactical approach with all the knowledge that has to come handy.\n\nA native of Visakhapatnam, she grew up with knowing the sea in her coastal town. Had been a Sea Cadet Corp too, but it is an entirely different game to be on board a sail ship with just the winds to drive you to your destination, she says.\n\nThe crew from different parts of the country take to their routine in a manner that is not stringent but there is no let-up on the vigil. They had stocked supplies that will keep them on for extra days in case of any delay in raching their destination. And at times they entertain each other with some traditional dishes of their region too.\n\nLt. Prathibha Jamwal, ATC officer, education officers Lt. Vijaya Devi and Sub Lt. Payal Gupta make up the five-member crew of the Navy’s plan to have an all-woman’s sailing team, which had started over two years ago, when Lt. Commander Shweta Kapoor, took the ropes of sailing as the first woman in the Navy sailing the Cape of Good Hope to Rio de Janerio segment.\n\nThe Mhadei had set sail from Vishakahpatnam on Februay 9 and from Chennai on February 19. Lt. Aishwarya Bodapatti, a Naval architect will join the crew after they reach Goa and be part of their team who had volunteered to sail to Mauritius on Mhadei.", 
    "section": "national", 
    "title": "For these women, braving it out in the seas is a way of life", 
    "subsection": "general", 
    "date": "2016-02-29"
}