{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Junk the treadmill and do yoga to reduce your carbon footprint, exhorts India’s Ministry of Environment and Forests and Climate Change. A 21-page document on the Ministry’s website, ‘Low Carbon Lifestyles’, lists several commonsensical tips to save electricity: use solar inverters instead of the conventional one, compact fluorescent lamps instead of incandescent bulbs; and ensure your car’s tyres have adequate pressure. Done right, the report suggests, the nearly 50 tips could help play “a strategic role” in helping India stick to its international climate commitments such as reduction in the emissions intensity of its GDP by a third from 2005 levels, and create enough forest and tree cover to absorb 2.5 to 3 billion tonnes of carbon dioxide, by 2030.\n\nEach of these recommendations rests on some math. Switching off your car at a traffic light instead of idling, the report says, will reduce annual carbon dioxide emissions by 85-122 kg and cut annual fuel costs at least Rs. 2,532 and will also mean 8-12 trees less felled, the study adds. Leading on from here, a typical treadmill that’s active for an hour of exercise will, through the year, use up 544.215 units of power which will translate to 446.26 kg of carbon dioxide and an extra Rs. 3,238 to your power bill.\n\nYoga, by comparison, was zero emission and therefore — the study avers — saved enough fuel to prevent the chopping of 44 trees per year. Studies have, however, found that yoga, though an effective form of exercise, doesn’t burn calories as fast as say running or on a treadmill. A 2007 study in the journal BMC Complementary and Alternative Medicine found that “… Metabolic expenditure in experienced yoga practitioners during a yoga session was similar to that of walking at 3.2 km/hr on a treadmill — significantly lower than the recommendations for moderate physical activity recommended at the time of the study by the American College of Sports Medicine.”\n\n‘Use solar\n\ninverters, compact fluorescent\n\nlamps instead of incandescent bulbs’", 
    "section": "national", 
    "title": "Go green the yoga way, says Environment Ministry", 
    "subsection": "general", 
    "date": "2016-02-29"
}