{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The govt. sharpened its strategy by linking Rohith, JNU issues during the discussion\n\nThe Centre’s interference in the University of Hyderabad, which the Opposition blamed for suicide of Dalit research scholar Rohith Vemula, followed by the arrests of Jawaharlal Nehru University Students’ Union president Kanhaiya Kumar and others on charges of sedition, should have set the stage for the Congress to call the government to account in Parliament. But after the discussions in the two Houses last week, the Bharatiya Janata Party (BJP) has emerged in a better shape.\n\nThe BJP had realised that the handling of the Hyderabad controversy by its Ministers had left it looking anti-Dalit, and hence its decision to shift focus to the JNU. The ABVP’s role in bringing up alleged anti-national protests and slogans in favour of Afzal Guru on the campus came in handy.\n\nFor the Opposition — particularly the Congress, whose vice-president Rahul Gandhi had visited both campuses — it was a golden opportunity to pin the government down in Parliament on the Dalit issue when the BJP is busy canvassing support from the community.\n\nBut thanks to a lack of coordination in the Opposition, the government succeeded in clubbing the Hyderabad and JNU controversies, giving itself an advantage that became apparent through the discussion. Indeed, the momentum against the government that was on display on the campuses and on the streets was simply not carried into Parliament.\n\nFor one, the sweeping statements made by HRD Minister Smriti Irani — now the toast of the BJP for her dramatic speech — on Rohith Vemula’s death went unchallenged by the Opposition in Parliament. It was left to the doctor who had attended on him to put the record straight on television.\n\nNow belatedly, Opposition MPs have decided to file a privilege motion against Ms. Irani for misleading the House. But politically, the damage has been done, with her speech having gone viral, even earning her encomiums from Prime Minister Narendra Modi.\n\nTwo, Mr. Gandhi chose not to speak in the House, leaving it to colleague Jyotiraditya Scindia. Mr. Scindia made an excellent speech as did other Opposition MPs such as Sugata Bose (Trinamool Congress) and Tathagata Satpathy (Biju Janata Dal).\n\nPossibly, differences in the party on how to play the two issues caused confusion: some senior Congress leaders had warned against allowing the nationalism debate to be foregrounded, fearing it would go against the party. But in the event Mr. Gandhi and the party allowed both issues to be clubbed, that helped the BJP paper over its blunders on the Dalit issue.\n\nMayawati’s sole battle\n\nThree, even in the Rajya Sabha, where the government is in a minority, Opposition MPs failed to debunk Ms. Irani’s claims. It was only Bahujan Samaj Party leader Mayawati who kept Ms. Irani in her sights, demanding that a Dalit member be included in a panel investigating Rohith’s death.", 
    "section": "national", 
    "title": "Honours uneven in Parliament debate", 
    "subsection": "general", 
    "date": "2016-02-29"
}