{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Advani and Vajpayee, as Cabinet ministers, had approved the Bill on the issue\n\nAmid the ongoing debate on the minority character of the Aligarh Muslim University (AMU), those supporting it have highlighted the fact that the precursor to the BJP, the Jana Sangh, had batted for the AMU's minority character when it was part of the merged Janata Party in January 1977.\n\nThe Union Human Resource Development Ministry has contended that as the AMU was set up by an Act of Parliament and not by Muslims, it could not be considered a minority institution. The case is currently being heard in the Supreme Court where recently the Union government changed its earlier stand on the minority status of the institution.\n\nActivists and AMU alumni, who have been creating awareness about the case, reminded the BJP that as part of the Janata Party, it had piloted the Bill about the minority character of AMU and later in the 1979 mid-term polls, promised “restoration of the autonomy and original character of the Aligarh Muslim University” in its manifesto.\n\nBahar U. Barqi, the AMU advocate who is representing the AMU Old Boys Association in the Supreme Court, said the BJP should learn from the past and support the issue of AMU’s minority character.\n\n“The Janata Party government, which came to power in March 1977, piloted the AMU (Amendment) Act 1920, which proposed giving minority character to the Aligarh Muslim University. The Morarji Desai Cabinet of which Advaniji and Vajpayeeji were members, approved the Bill which was subsequently tabled in Parliament. But it could not be passed in Parliament because the Janata Party government fell in July 1979,” Mr. Barqi said.\n\nMr. Barqi said that again during the 1979 mid-term Lok Sabah elections, the Janata Party reiterated its pledge on the status of the institution.\n\n“Not only did the Janata Party include the promise of AMU’s minority character in its manifesto, it also supported the Bill when it was moved by the then Congress government and adopted by Parliament,” he added. The then BJP vice-president Ram Jethmalani and Janata Party Lok Sabha member, Subramanian Swamy, supported the Bill.", 
    "section": "national", 
    "title": "In 1977, Jana Sangh batted for AMU’s minority status", 
    "subsection": "general", 
    "date": "2016-02-29"
}