{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "MEA believes trip possible only with some political stability\n\nContinuing political turmoil in the Maldives is the reason Prime Minister Narendra Modi’s visit to Male has had to be put off repeatedly, senior officials tell The Hindu .\n\nThe visit that was cancelled at the last moment in March 2015 owing to protests over former President Nasheed’s trial has been due since early January this year, but informed sources say each time, actions by the Yameen government spark off a new crisis that makes it difficult for Mr. Modi to travel to the Islands. “After his stopovers in Kabul and Lahore on Christmas day, Maldives is the only SAARC country that Mr. Modi hasn’t visited yet,” explained an official, “It is certainly something on his agenda for this year.”\n\nAs a result, External Affairs Minister Sushma Swaraj’s trip to hold the Joint Commission last October, along with four visits by Foreign Secretary S. Jaishankar over the last few months had raised hopes in Male that Mr. Modi would visit soon. When India’s largest new aircraft carrier INS Vikramaditya, accompanied by two support ships travelled to the Maldives on February 14 for a “goodwill” visit, many in Male fully expected that Mr. Modi would also be on his way, in one of his trademark surprise neighbourly visits. “Normally, all visits by the Indian Prime Minister have been marked by a big Indian naval presence in our islands,” Maldives High Commissioner to India Ahmed Mohammad told The Hindu , “which might explain why there were expectations of a Prime Ministerial visit in February. We remain ready to welcome him at even a moment’s notice.”\n\nHowever, the MEA believes that moment will only come with some political resolution and a more controlled narrative in Male that seems to be fast spinning out of President Yameen’s grip. While the trial of the former President Mohammad Nasheed, his 13-year imprisonment sentence and subsequent release on medical grounds has been highlighted the most, President Yameen’s government has been embroiled in cases with a series of other leaders as well.\n\nIn 2015, President Yameen impeached, dismissed or jailed two Vice-Presidents Mohammad Jameel and Ahmed Adeeb, Defence Ministers Col. Nazim and Moosa Ali Jaleel, and an assortment of police, customs and judicial officials, all on a variety of anti-terror and conspiracy charges. Many of the dismissals came after a mysterious blast on the Presidential yacht in September 2015, which President Yameen blamed on his own colleagues.\n\nIn a bizarre re-run of the case that led to the dismissal of then President Nasheed in 2012, President Yameen also ordered the arrest of a magistrate who had issued an arrest warrant against President Yameen for ‘violating Sharia tenets and practising witchcraft.’ Even by the standard of dramatic developments the Maldives has seen in the past few years, this was unique. Most recently, Mr. Yameen has been criticised for the prosecution of another ally-turned-opponent Imran Abdulla (Sheikh Imran) of the Islamist Adaalath party, that led to his conviction on February 17 on terror charges with a 12-year sentence.\n\nCMAG resolution\n\nIndia has stayed away from direct criticism of the Yameen government over the past few months as it tried to rebuild ties with the Maldives. However, it is a member of the Commonwealth Ministerial Action Group (CMAG) that passed a resolution on February 24 giving the Maldives government one month’s time to resurrect a political dialogue with the Opposition and halt the use of anti-terror laws against political opponents. “We certainly hope the Maldives government will use the CMAG resolution to effect a reconciliation process. If things go well on that front, India will feel more confident about taking the next step forward,” a senior diplomat told The Hindu when asked about the possibility of Mr. Modi’s visit.\n\nMr. Yameen’s treatment of President Nasheed, who is now in the U.K. for back surgery, has also become an international litmus test of his intentions, especially given the high-profile legal campaign led by lawyer Amal Clooney for Mr. Nasheed’s release. Ms. Clooney, who will be in New Delhi next week, is expected to raise the issue of judicial lapses in the Nasheed trial during her visit, though it is unclear if she will have any official meetings.", 
    "section": "national", 
    "title": "Maldives turmoil stalls Prime Minister’s visit", 
    "subsection": "general", 
    "date": "2016-02-29"
}