{
    "author": [
        "Kanwar Yogendra"
    ], 
    "text": "Congress leader Vijai Singh Mankotia urges Modi to call off the match\n\nAfter senior BJP leader Shanta Kumar and State Chief Minister Virbhadra Singh, it is the turn of the president of Ex-servicemen League and Congress leader, Major (retd.) Vijai Singh Mankotia, to write to Prime Minister Narendra Modi urging the cancellation of the March 19 match between India and Pakistan at Dharamsala.\n\nThe former minister has cited the feelings of martyrs’ and ex-servicemen’s families and demanded the immediate cancellation of the T-20 tie. Mr. Mankotia claimed that more than a lakh of people would oppose the matchafter the recent Pathankot airbase and Pampore attacks in which soldiers from the hill State had died. Harping on the ‘repeated deception and betrayal’ of the neighbouring country, Mr Mankotia asked how can a team from such a country could be allowed in the ‘martyrs’ land’.\n\nThe State has four Param Veer Chakra awardees, more than one thousand Ashok Chakra, Maha Veer Chakra and Veer Chakra awardees. “Lakhs of in-service and ex-servicemen families are living in the State and they would feel hurt and cheated if a team from Pakistan comes here,” Mr Manokita says in his letter.\n\nBJP veteran Shanta Kumar who does not see eye-to-eye with former CM Prem Kumar Dhumal and his son Anurag Thakur, the BCCI joint secretary, had written to the Prime Minister against the match. Mr. Thakur is the Himachal Cricket Association president and has become popular amongst the youth after the construction of picturesque Dharamsala International Cricket stadium. Himachal Pradesh has become a major participant in the Ranji Trophy and other national cricket championships after the proactive role taken by the HPCA.\n\nMr. Virbhadra Singh has written to the PM and warned the BCCI and HPCA that they are organising the match at their own risk.", 
    "section": "national", 
    "title": "More threats to Indo-Pak. T-20I game at Dharamsala", 
    "subsection": "general", 
    "date": "2016-02-29"
}