{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "Nearly a week after reports of several women being raped in Murthal in Haryana during the Jat quota stir, the Haryana Police registered a case of gang rape against seven men on the complaint of a Delhi resident.\n\nIn her complaint, the victim purportedly mentioned the same location near Sukhdev Dhaba where locals have made claims about several women being harassed by the Jat protesters on the morning of February 22. Those named by the woman include two of her brothers-in-law, the police said.\n\nHowever, in the woman’s complaint, the date of crime has been mentioned as February 23, the subsequent day, said senior Haryana Police officers, adding they were probing possible connections between the two incidents. Another common thread besides the location is that the list of accused feature Jats who are suspected to have taken part in the protests, said a senior police officer. In her statement, the woman stated that she and her daughter were returning in a van from Haridwar early on February 22.\n\n“When the van reached near Murthal on GT road, it was stopped by seven or eight miscreants. They dragged her out of the van and gang raped her. They also tore the clothes of her daughter,” said a senior police officer. However, she stated that when she saw their faces, she realised that they hailed from the same Sonepat village as her husband and two were her relatives.\n\nTalking to journalists, Deputy Inspector General of Haryana Police Rajshri Singh said based on the woman’s complaint made at a women’s police station, a case of gang rape under relevant provisions of the Indian Penal Code was registered.\n\nMs. Singh heads a three-member team of women police officers constituted by the Haryana government to go into alleged incidents of rape and molestation of several women by Jat protesters.\n\nAnother senior police officer however, said a “family dispute” could be the reason for the woman’s complaint as in the past, too, she had made similar allegations against the same set of persons.", 
    "section": "national", 
    "title": "Murthal gang rapes: first case lodged, seven booked", 
    "subsection": "general", 
    "date": "2016-02-29"
}