{
    "author": [], 
    "text": "Senior Congress leader Kapil Sibal on Sunday slammed the NDA government, saying it has put development issues on the backburner and was fanning controversies which are hampering the democracy to thrive.\n\n“After many years, a non-Congress government has come to power at the Centre by getting majority. People expected that this government will usher in development as it promised.\n\n“Instead, it was fanning controversies, prompting opposition to react,” Mr. Sibal said at a talk show on ‘Constitution and Patriotism’ held here.\n\n“In such an environment, democracy can’t thrive...till such things are not stopped,” he said.\n\nIn an apparent reference to BJP leaders, the former Union minister, without taking names, said: “People with speeches and selling dreams have come to power. But it is hard to fulfil dreams.”\n\nWithout clearly referring to ongoing turmoil in JNU and Hyderabad University, he said universities were not a public place but private spaces and that the youth should be given opportunity to express.\n\n“If police will enter universities, its autonomy will end,” he said.\n\nQuoting a Supreme Court judgment, he said case of sedition is not made out on mere sloganeering.\n\n“If anybody raises slogans and conspires against the State and indulges in violence, such acts amount to sedition,” he said.\n\nThe senior Supreme court lawyer said nowadays communication was too fast and people learn what was going around the world and demand things instantly and that peoples’ expectations from government and politicians has risen manifold, which, if not met, they take to the streets.\n\nOn the issue of reservation demands recently made by communities like Patels and Jats, he said: “It is a serious matter. Reservation cannot be ended. It will escalate trouble as due to encouragement to private sector, the government jobs are becoming scare.”\n\nMr. Sibal advocated for employment generation by economic development to end the fight over reservation.\n\nHe said that he was a “patriot” and India was a unique and role model for the world.\n\n“Every country is recognised by its language and culture, whereas India doesn’t have one language and culture.Our constitution binds all cultures and protects all languages and cultures,” Mr Sibal said. PTI", 
    "section": "national", 
    "title": "NDA government fanning controversies, says Sibal", 
    "subsection": "general", 
    "date": "2016-02-29"
}