{
    "author": [], 
    "text": "Last April’s earthquake followed by an avalanche killed nearly 9,000 people\n\nIn this photograph taken on April 25, 2015, an injured climber is carried on a makeshift stretcher to a medical tent after an avalanche devastated the base camp.— Photo: AFP\n\nNepal’s experienced ‘ice doctors’ were preparing on Sunday to return to Everest to ready the mountain for the upcoming climbing season, almost a year after a huge earthquake triggered a deadly avalanche.\n\nEight of the mountaineers and their support teams were performing prayers at the bottom of Everest before leaving for base camp to fix routes, through a treacherous icefall, for climbers, a top official said. “Starting March 7, the expert team will continue opening expedition routes and fix ladders and ropes for the upcoming season,” Nishan Shrestha, CEO of the Sagarmatha Pollution Control Committee, which manages the peak, said.\n\nHigh hopes\n\nNepal is hoping the April-May season will see climbers return to the world’s highest peak, providing much-needed revenue to the impoverished country. Nepal has been hard hit by falling tourism following last April’s earthquake, which killed nearly 9,000 people.\n\nThe quake triggered the April 25 avalanche which left 18 people dead at Everest base camp. It was the second in as many years, after 16 Nepali guides lost their lives on the icefall in 2014, sparking a shutdown of the peak.\n\nIce doctors, highly-skilled mountaineers, are the first men on the peak every season, using ropes and ladders to build a route across plunging crevasses and constantly shifting ice, including the dangerous Khumbu icefall.\n\nSome returned last September to prepare for the autumn season, when just a few climbers attempt the summit. But, they are needed again for the main spring season when hundreds of climbers normally take advantage of good weather conditions on the 8,848-metre mountain.\n\nMountaineering is a huge revenue earner for Himalayan Nepal, home to eight of the world’s 14 peaks over 8,000 metres. — AFP", 
    "section": "national", 
    "title": "Nepal’s ‘ice doctors’ return to Everest", 
    "subsection": "general", 
    "date": "2016-02-29"
}