{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "Choice may be given to transfer 8.33% of salary to New Pension Scheme\n\nAbout 8.5 crore employees whose retirement savings are managed by the Employees’ Provident Fund Organisation (EPFO) could get an option to transfer over a third of their EPF contributions to the National Pension System, regulated by the Pension Fund Regulatory and Development Authority or PFRDA.\n\nIn Budget 2016-17, the government is likely to announce a proposal to amend the Employees’ Provident Fund Act of 1952 to make contributions to the employees’ pension scheme (EPS) managed by the EPFO optional.\n\nPresent contribution\n\nAt present, 24 per cent of salary of employees earning up to Rs. 15,000 a month is deducted towards their EPF savings, of which 8.33 per cent is diverted to the EPS, which offers a monthly income to retirees, recently enhanced to a minimum of Rs. 1,000 a month.\n\n“A decision has been taken to give employees the choice to transfer that 8.33% of their salary that is currently diverted to EPS, into the National Pension System [NPS] instead,” said a senior government official aware of the development.\n\nIt is not clear if the government will also pay its share of subsidy to the EPS [1.16% of salary up to Rs. 15,000 a month] into the NPS, for those who choose to exercise such an option.\n\nThis is yet another proposal to promote the NPS which was set up in 2004 by the Finance Ministry with a new pension fund regulator. Last year, the Budget had announced an additional Rs. 50,000 tax deduction for investments into NPS, after exhausting the Rs. 1.5-lakh limit under Section 80 C of the Income Tax Act.\n\nOptional\n\nBudget 2015-16 had also promised that EPF contributions for employees below a certain threshold of monthly income, would be made optional, while employers would be required to continue their share (12 per cent of salary) of contributions. But the government hasn’t yet moved on legislative amendments to bring that into effect.\n\nThe PFRDA is administered by the Finance Ministry, while the EPFO works under the control of the Labour Ministry, with the Finance Ministry having the veto power on its annual rate of return to members.\n\nConsequently, NPS accounts grew from 87 lakh in March 2015 to 1.15 crore by this month, according to PFRDA officials. However, its assets under management are Rs. 1.10 lakh crore, while the EPFO has over Rs. 10 lakh crore under its administrative control.\n\nOfficials also said that the government might allow micro, small and medium enterprises to halve the statutory EPF contributions (from 24 per cent of salary to 12 per cent) on behalf of their employees, in order to promote job creation in the formal sector.\n\nSurvey finding\n\nThe Economic Survey has pointed out that a large reason for the creation of more informal jobs even in the organised industrial sectors is the high level of statutory contributions to social security schemes like the EPF and the ESIC that reduce the take home salaries of entry-level and low-income employees and induce them to work on informal contracts instead.\n\nThe govt. is likely to announce a proposal to amend the Employees’ Provident Fund Act", 
    "section": "national", 
    "title": "NPS option for EPF members?", 
    "subsection": "general", 
    "date": "2016-02-29"
}