{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "V. Ponraj, scientific adviser to former President A.P.J. Abdul Kalam, displaying the name of the new party in front of Kalam’s samadhi near Ramesaram on Sunday. —Photo: L. Balachandar\n\nA political party was launched in the name of former President APJ Abdul Kalam here on Sunday.\n\nAfter paying tributes at Kalam's samadhi, V. Ponraj, who was scientific adviser to Kalam, announced the name of the party as ‘Abdul Kalam Vision India Party’ and hoisted its flag.\n\nAddressing a gathering, Mr. Ponraj said it was more of a mission to serve the people, empower the youth and develop the State than a political venture. Seeking to eradicate corruption in all its forms, he said the menace had spread like a deadly virus in recent years and was choking the life of the commoners.\n\n“Corruption is one of the most important reasons why we are all here today. There is corruption everywhere and people have, of late, become used to paying bribes even for basic services like community certificates, driving licence, building plan approval and so on.”\n\nDeep-rooted corruption had undermined the quality of public service. The government alone could intervene and cleanse the system. But unfortunately the rulers over the years have failed to give corruption-free governance, he said.\n\nAsked why he had not entered politics when Abdul Kalam was alive, he said there was no other plan in his mind other than working with the great leader. “Now I am left with the task of implementing his agenda for development which will be impossible without a political will,” he said. Mr. Ponraj said the party was in no hurry to contest the elections. Sincere efforts would be made to identify the suitable candidates for the election. “In case we do not find such candidates, there is no hurry...we are here to work with the people which can be done even without power.”", 
    "section": "national", 
    "title": "Party launched in Kalam’s name", 
    "subsection": "general", 
    "date": "2016-02-29"
}