{
    "author": [], 
    "text": "Kiran Kumar says a spacelaw is needed for the government to spell out howit will deal with issues, untoward incidents.— Photo: G.P. Sampath Kumar.\n\nWe want clarity on what industries can and cannot do, says Kiran Kumar\n\nThe government’s new endeavour is to inject satellite-based technology into governance and numerous common uses. In this interview given to Madhumathi D.S. in mid-February, A.S. Kiran Kumar , who has completed a year as Secretary, Department of Space and Chairman of Indian Space Research Organisation, talks about new shifts in India’s space activities in satellite and launcher areas. Excerpts:\n\nA space law has been in the offing. What is its status?\n\nWe have submitted papers to the government based on discussions we first had with academicians and legal experts in January 2015. It should be approved for circulation among a large number of departments — the Ministries of Home Affairs, External Affairs [Defence, Finance, Law,] etc. Some more insight should come in from there.\n\nSomething concrete should come out by next year. A Space Act will be finally brought out through Parliament.\n\nWhat was the need for it? What will it spell out? And what will happen to the existing Satellite Communication Policy and Remote Sensing Data Policy?\n\nToday, space-related activities are done [as per] business rules. The process to be adopted by the government for these activities has to be defined because the government is responsible for any object put up in space and for what happens to it in orbit or because of it. With a law, all activities will be done under the Space Act. As we enable more and more industries in space activities, we also want clarity on what they can do and what the limitations are.\n\nVery few countries have legislation pertaining to space. However the number of countries as buyers of satellites or solutions has increased. In space, anything can happen. And it is more about what can happen — collision, accidents, damage from or to a satellite.\n\nSo a law is necessary for the government to spell out how it will deal with issues, untoward incidents. It will help the government in how it will approach commercial use of space, international collaborations and international treaties; and state regulatory mechanisms.\n\nThe other two policies will continue to be available as independent policies. And I don’t think it is going to make any major change in our overall approach.\n\nThere has been an increased start-up activity in space related areas. How does the Department of Space view the aspirations of start-ups and engage with them?\n\nIt is fantastic. In fact, we want to develop through academia, industry and others some of our requirements which we cannot do as we are tied up with our activities.\n\nBefore this year-end, we plan to bring out two separate mechanisms for promoting original activities by anybody or any entity outside the department. This is still an early thinking that we should work out.\n\nWhat is ISRO's broad plan for industry's participation in its programmes?\n\nGlobally a thousand satellites are estimated to be put up in the next four years. There are opportunities for Indian industry to participate in these activities. Building capacity within the country to deal with a growing space market is also one of our activities.\n\nMany industries that supply to ISRO are getting shortlisted to supply elsewhere. We provide them with support infrastructure [on ISRO laboratories]; information, R&QA, [reliability and quality assurance], etc.", 
    "section": "national", 
    "title": "Space Act will be in place soon, says ISRO Chairman", 
    "subsection": "general", 
    "date": "2016-02-29"
}