{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Ten soldiers buried by an avalanche last week may have been victims of global warming\n\nA view of the glacier in Siachen where an avalanche killed 10 soliders. Glaciers across the globe are melting faster due to a rise in surface temperatures induced by global warming.— file PHOTO: BY SPECIAL ARRANGEMENT\n\nA small board at the Siachen Base Camp reads: “Snout of the glacier was here on 10 April 2005.” Today the snout, the starting point of the Siachen glacier, has moved about a kilometre ahead from that point. It is a testimony to the accelerating pace of human-induced climate change and is the likely culprit behind increased disasters on the glacier.\n\nThe ten soldiers of the Madras regiment who were buried in their tent after being hit by an avalanche last week may be the latest victims of climate change which is accelerating extreme weather events. Glaciers across the globe are melting faster due to a rise in surface temperatures induced by global warming. The biggest enemy the Indian Army is battling in Siachen today is the weather.\n\nElaborate weather monitoring and forecasting mechanisms are in place across the glacier and alerts are sent to troops positioned there on a daily basis. The Snow and Avalanche Study Establishment (SASE) based in Leh, an institute under the Defence Research and Development Organisation (DRDO), is responsible for this.\n\nCombined with better equipment and refined acclimatisation procedures, this has steeply reduced the casualty rate on the glacier.\n\nHowever, there is an increase in erratic events which are taking a toll.\n\nSiachen — which means the land of roses — also has the dubious distinction of being the world’s highest battlefield. Indian Army sits at heights of 12,000 feet at the Base Camp to 21,000 feet at Bana post on the glacier, a triangular bit of land between Pakistan occupied Kashmir and the part ceded by Pakistan to the Chinese. India occupied the glacier in April 1984, narrowly thwarting Pakistan’s plans.\n\nGiving an insight on how global warming is influencing glacial conditions, Dr. Shresh Tayal, Fellow at The Energy and Resources Institute, said Himalayan glaciers were not immune to the effects of global warming and climate change. “Over the last two decades, the rate of melting has accelerated,” he told The Hindu .\n\nDr. Tayal, who studies glaciers in Kashmir and the North-East, said glaciers were not only shrinking, but also shortening and thinning because of which they affect the local conditions. “Glaciers are typically present between mountains, and their shrinking affects the slope gradient of mountains, which in turn affects their stability,” he observed. This resulted in an increase in landslides and avalanches.\n\nThis is precisely what is unfolding on Siachen, which sits between the Karakoram ranges.\n\nWhile India cannot demilitarise the glacier for strategic reasons, there is a need to find new ways of predicting the weather as well as reducing the numbers posted on the glacier. However, technology cannot fully replace the soldiers there. For, once they are lost, it is near impossible to retake the icy peaks.", 
    "section": "national", 
    "title": "Army’s unseen enemy in Siachen", 
    "subsection": "general", 
    "date": "2016-02-08"
}