{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "Pakistan-born American national and Lashkar operative David Coleman Headley will depose as a prosecution witness before a special court here on Monday in the November 26, 2008, Mumbai terror attack case.\n\nThe special court presided by Judge G.A. Sanap will begin recording Headly’s statement from 7 a.m. via video conferencing from an undisclosed location in the U.S., where he is a convict. Last December, the Mumbai court had accepted his proposal to turn approver and granted him conditional pardon.\n\n“This is the first time in the world’s legal history that a foreign terrorist will give live evidence of his role via video link with another country,” special public prosecutor Ujjwal Nikam told The Hindu . “It is a remarkable thing that two sovereign countries are acting unanimously to tackle the problem of terrorism… This is a big milestone in the fight against terrorism. The U.S. government has provided much assistance to India.”\n\nLast Friday, the NIA had moved an application before the court to confront Headley with records of his stay in Mumbai before the attacks. They also submitted a photograph of Jamaat-ud-Dawah (JuD) chief and Mumbai attack mastermind Hafiz Saeed to the court, in an indication that the prosecution is likely to question Headley on the role of his Pakistani counterparts.\n\nWhile proposing to turn an approver, Headley accepted the court’s conditions that he would “disclose full and true facts leading to the attacks within his knowledge.”\n\nHeadley, who was arrested by the U.S. authorities, confessed in 2010 to his role in the 26/11 attacks. In 2013, a U.S. court sentenced him to 35 years’ imprisonment for a dozen federal terrorism crimes related to his role in the Mumbai attacks, including conducting reconnaissance of target locations. Posing as an American, he made five extended trips to Mumbai — in September 2006; February and September 2007; and April and July 2008 — each time making videotapes of various potential targets, including those attacked in November 2008. After these trips, he travelled to Pakistan to meet Lashkar members and hand them his surveillance material.", 
    "section": "national", 
    "title": "David Headley to depose today", 
    "subsection": "general", 
    "date": "2016-02-08"
}