{
    "author": [
        "Mohit M"
    ], 
    "text": "10-hour-long drama in school\n\nn a day when its students were enjoying their weekly holiday, a school near Whitefield, in Bengaluru, was the centre stage for a tense encounter between forest officials and a leopard on Sunday. During the nearly 10-hour-long drama, two people were injured before the leopard was tranquillised.\n\nAround 4 a.m., the security staff at Vibgyor School in Marathahalli suspected that a leopard had broken into the school premises. CCTV camera footage showing the big cat skulking through the corridors of the school and even entering the kitchen, confirmed their fear. Forest Department staff were called in, and two teams were formed to scour the school.\n\n“It was an eight-year-old full-grown male leopard. It may have strayed from the open forests near Whitefield, and once strayed, it could not go back,” said Ravi Ralf, Principal Chief Conservator of Forests (Wildlife).\n\nFor the most part of the morning, there was no sign of the leopard within the school. However, officials spotted it in a neighbouring copse — which they said was common for a leopard that has lost its way. But as they approached it, the feline fled across an empty field and leapt back into the school.\n\n“We tried to lock it in a room, but the windows close to the roof were covered by a flimsy mesh. It managed to push its way outside and leap to another room. Even there, it pushed through the mesh and leapt out… those were anxious moments,” said Mr. Ralf.\n\nThe tense drama took a violent turn when Forest officials shot the leopard with tranquilliser darts. But before the tranquilliser could kick in, the trapped feline, perhaps scared by the presence of the men surrounding it, went on an attacking spree.\n\nIn panic, it started to charge at Forest officials inside the school. One of the people attacked was wildlife conservationist Sanjay Gubbi, who had been called to the scene by Forest Department officials. He tried to escape by scaling the wall but was dragged down by the leopard, which then bit him in the arm even as he tried to fend off its attacks. In the melee, a driver was also among the injured.\n\nEventually, the drugged leopard made its way to a changing room and collapsed there. After an hour of waiting, and confirming that the leopard was in fact asleep, it was covered with a net and taken out of the school.\n\n“It is being kept for treatment and observation at the rescue centre of the Bannerghatta Biological Park,” said Santosh Kumar, Park Director. The Forest Department will take a call on its relocation on Monday.\n\nThe eight-year-old\n\nfull-grown leopard is suspected to have strayed from the open forests near Whitefield", 
    "section": "national", 
    "title": "High drama as leopard enters Bengaluru school; 2 injured", 
    "subsection": "general", 
    "date": "2016-02-08"
}