{
    "author": [
        "Nicholas St"
    ], 
    "text": "(Left) A retrofitted garbage container where Jeff Wilson, a professor at Huston-Tillotson University in Austin, Texas, lived for an entire year. (Right) Space is tight inside the 33-square-foot home.— Photos: NYT/Jeff Wilson\n\nAn experiment in living sustainably with radically less space has become a hit in Austin\n\nHow to get students thinking about their environmental footprints?\n\nJeff G. Wilson and his students at Huston-Tillotson University in Austin, Texas, retrofitted a garbage container into a cosy pad that he lived in for an entire year. It was, he says, “a radical experiment in what it would mean to live on, and in, less” — specifically, 33 square feet. He moved out last February but the experiment continues.\n\nNine educators have since taken up residency for up to a week to see what it’s like to live without running water. Cooking is on a camping stove. But there is electricity. To battle interior heat that rises to over 130 degrees Fahrenheit in Texas’ sweltering summers, the bin had to be connecting to the grid so air-conditioning could be installed. There’s now a TV and an overhead light.\n\n“There were a few who grabbed the spirit early on, like they were camping,” says Amanda M. Masino, a biology professor and co-director of the Dumpster Project. “And then there were some that brought two pieces of luggage and realised they didn’t have room to open it in here.”\n\nTeachers are welcome for sleepovers. And Ms. Masino has developed a curriculum in which students design workable tech for the space — such as using sheep wool, more environmentally friendly than fibreglass, as insulation. Elementary students might build water filters; college students design solar-powered installations. More than 1,400 have visited the container, which also travels to science and art exhibits across the State to share its sustainability message.\n\nAs for Mr. Wilson, aka Professor Dumpster, he had his dislikes (school gym as bathroom) and likes (mobility, scaled-down possessions). He has left Huston-Tillotson to funnel the lessons learned into an urban living experiment: prefab apartments of only 225 square feet (seven times the size of his previous residence) that fit onto a rack and can be transported. Each rack holds four units. Austin gets the first rack in April (rent: about $600 a month before slotting fees), with other cities to follow. “Even at the extreme end of the spectrum,” Mr. Wilson concludes, “a lot less can bring a lot more to your life.” — New York Times News Service", 
    "section": "national", 
    "title": "Learning to live small, in a dumpster on campus", 
    "subsection": "general", 
    "date": "2016-02-08"
}