{
    "author": [], 
    "text": "Nigerian woman comes up with Barbie in a hijab\n\nA Nigerian woman, who wanted to see Barbie dressed the way she did, has given the popular doll arguably its most surprising makeover yet — all covered up and wearing a ‘hijab’.\n\nThe ‘Hijarbie’, created by 24-year-old Haneefah Adam, will be initially available in the US and will be sold in the UK from mid March at major toy retailers for £ 9.99 each.\n\nAdam said a look at the hugely popular Barbie Style Instagram “got me thinking about how I’d actually like to see a doll dressed up like I would have — covered up.\n\n“I was mulling about the idea for about three months while I was still studying for my Master’s degree in the U.K. When I got back to Nigeria, I went to the mall, purchased a doll, dressed it up, documented it and here we are,” she told Style.Mic.\n\nAdam, who currently owns and runs a lifestyle brand called Hanie, posts about her ‘Hijarbies’ on an Instagram account which already has over 17,000 of followers.\n\n“My outfit is featuring Green Jumpsuit Denim long jacket with green threading details. Pearl brooch And a dazzling smile ?? #hijarbiestyle,” reads one such Instagram post that shows one complete look of Hijarbie.\n\n“I’d have loved to dress up a black doll myself too. I’ve ordered for some internationally and they’ll soon be here. I basically started with what I had.\n\n“When will purchase be possible: As soon as possible, we are in the process of building a website and working towards production and making hijarbie available for purchase soon,” Adam said in an Instagram post along with a photograph of herself that shows her wearing a ‘hijab’.\n\nComplete with a tiny hijab on her plastic head, the miniature fashionista could not be further away from the blonde doll that has brandished the bedrooms of millions of youngsters for almost 60 years, Sunday Express reported.\n\nAdam’s creation comes just days after toy maker Mattel introduced a more realistic range of Barbie dolls in the biggest shake-up in the 57 year history of the model.\n\nBesides including four body types — the original rail— thin Barbie, a taller Barbie, one with more curves and a petite version, the new line has seven skin tones, 22 eye colours and a number of hair styles. Some of the models are black, though there have been black Barbies since 1980. — PTI", 
    "section": "national", 
    "title": "Meet the ‘Hijarbie’ doll", 
    "subsection": "general", 
    "date": "2016-02-08"
}