{
    "author": [], 
    "text": "Rumours that Lt. Col. Niranjan died while clicking a selfie are baseless: NSG chief\n\nA month after the Pathankot operation, Director-General, National Security Guard, R.C. Tayal , speaks to Vijaita Singh about Lt. Col. Niranjan’s death and the synergy among varied forces on the ground. He says the NSG was best suited for the operation and there were no coordination issues among the forces. Excerpts:\n\nCould you clear the air on Lt. Col. Niranjan’s death during the Pathankot operation?\n\nBy the time we killed the four terrorists, who were hiding in the elephant grass, it was late evening. We decided not to touch the bodies as it was dark. Next day, Lt. Col. Niranjan, the head of the bomb disposal squad, was tasked with retrieving the bodies. He led from the front and successfully pulled out three bodies. When he pulled the last body with a hook and line set, nothing suspicious was found. It was when he tried to pull out a grenade, kept in a pouch in the front jacket of the terrorist that a “click” sound came. The NSG commando standing behind him shouted: sahib phenko (Sir, throw it). It was too late by then, the grenade burst in his right hand. He died instantly. Four others received injuries, one of them has lost an eye.\n\nWas it avoidable?\n\nHe was the best officer we had, 15 years he did this only — defused bombs. He followed the standard operating procedure. We have recommended his name for the Kirti Chakra (peacetime gallantry award). I heard rumours that he died while clicking a selfie, it is baseless.\n\nThere were reports of lack\n\nof coordination between Air Force, Army, NSG and Punjab Police.\n\nThere was absolute synergy on the ground. The work was clearly demarcated. The NSG was inside, the Army was asked to comb open areas, the Punjab Police were deployed at outer cordon and the Air Force was asked to do aerial surveillance.", 
    "section": "national", 
    "title": "‘NSG was best suited for taking on ultras’", 
    "subsection": "general", 
    "date": "2016-02-08"
}