{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Ahead of the 2017 polls, there is a clear race to grab Dalit votes in Uttar Pradesh, with not just the major parties increasing outreach towards the community but also new entrants trying to dismantle old caste equations.\n\nAfter Prime Minister Narendra Modi’s homage at the Ambedkar Mahasabha in Lucknow last month, the BJP plans to celebrate the jayanti days of prominent Dalit saints— Guru Sant Ravidas (February 22) and Gadge Baba (February 23) — in all districts of U.P. Mr. Modi could visit Sant Ravidas’ birthplace near Varanasi.\n\nThen on February 24, BJP chief Amit Shah will visit Bahraich to commemorate the anniversary of medieval Pasi King Suheldev, who the RSS has tried to portray as a Hindutva icon. U.P.’s second largest Dalit sub-caste (16 per cent), attracting the Pasis is a key part of the BJP’s Dalit plan.\n\nCongress strategy\n\nThe Congress is also working to regain the support of Dalits and has launched Bhim Jyoti yatras to correct its “negative image” among the community. Congress vice-president Rahul Gandhi recently spent a few hours at a Dalit man’s house during his daylong trip to Bundelkhand.\n\nOn February 18, Mr. Gandhi will preside over a Dalit conclave in Lucknow where speakers will trace the role of the Congress in Ambedkar’s growth and tear down the BJP’s appropriation of Babasaheb.\n\nMatching the Congress’ move, the BJP has launched a programme “Ambedkar sabke hai,” where small meetings would be held in all Assembly constituencies to “break the hold of those who have made Ambedkar a brand,” said BJP leader in-charge of connecting with Dalits.\n\nThe focus will be on weaning out the support of non-Jatav Dalits, the largest SC community in U.P. (56 per cent). Battling a perception that the party is anti-Dalit, the BJP, however, understands the risks as leaning too much towards Dalits could offend its core upper caste support or prospective base among non-Yadav OBCs.\n\nA key part of the AIMIM’s prospects in U.P. also revolves around Dalits. The Hyderabad-based party hopes to make entry into the State with a combination of Dalit-Muslim support (Jai Bhim, Jai Meem — the slogan) and for the upcoming by-poll in Bikapur, near Ayodhya, Assauddin Owaisi surprised many by placing a Dalit candidate Pradeep Kori.\n\nEven the Samajwadi Party, which does not rely on Dalit voters, is not behind in the one-upmanship, and its ST/SC cell has got unusually hyper-active holding sammelans for Ambedkar. Chief Minister Akhilesh Yadav recently even promised land for a grand memorial for Ambedkar.\n\nThe Republican Sena, the party of Anandraj Ambedkar, grandson of Babasaheb, has also entered the fray and announced that it will contest “at least 200” seats in next year’s polls. Mr. Ambedkar, with little influence outside Maharashtra, will hold a rally in Lucknow on April 1, when many people are expected to join the party.Though in the 2014 Lok Sabha elections, the BJP managed to wean away substantial Dalit support from the BSP and poached some prominent Dalit faces, the BSP still commands the largest Dalit support.\n\nMayawati slams Cong., BJP\n\nClearly bothered by the overtures of other parties, BSP chief Mayawati has accused them of appropriating Ambedkar for political gains with little intention of working for welfare of Dalits. She has warned Ambedkarites to be wary of the “conspiracy” and “ploys” deputed by the BJP to get their votes while calling the SP’s mindset towards Dalits “casteist.” She also said last week that when it came to Dalits, the Congress’ attitude had been no different and said Mr. Gandhi merely engaged in theatrics by visiting Dalit hutments.\n\nWhile Ms. Mayawati has raised the pitch against appropriation of Ambedkar, she has herself taken calculated steps keeping in mind a potential broad caste calculus.\n\nIn the wake of the outrage over the death of Dalit scholar Rohith Vemula, she did not visit Hyderabad but deputed Rajya Sabha member Veer Singh to go.", 
    "section": "national", 
    "title": "Parties vying to garner Dalit votes in U.P.", 
    "subsection": "general", 
    "date": "2016-02-08"
}