{
    "author": [
        "Puja Mehra"
    ], 
    "text": "A presentation made last week for a sub-group of Secretaries set up by Prime Minister Narendra Modi seeks to abolish income tax and over 30 local, State and Central taxes. The proposal from a Pune-based tax research outfit, Arthakranti, advocates replacing the present tax system with a single 2 per cent levy per receipt in bank accounts and recommends that just import duties be retained from the present system.\n\nWhile the government is pitching for quick passage of the Constitution (122nd Amendment) Bill for the rollout of the Goods and Services Tax, Arthakranti’s proposal envisages a system that does not tax consumption or income, as is the case now, but the “velocity of money”.\n\n“It was clarified by the official who made the presentation that the ‘ground-breaking’ tax reform proposal is not for the consideration of the upcoming budget,” an official source, who attended the meeting, told The Hindu . The “innovative” proposal was aimed at reducing corruption and eliminating the cost of compliance for taxpayers, the source said.\n\nEarlier when yoga guru Ramdev had called for the abolition of income tax, Arthakranti submitted this proposal in the run-up to the 2014 general election to the Highways Minister and former BJP president, Nitin Gadkari. Then, he was heading a BJP committee responsible for preparing its vision document on reforms in police, administration, judiciary, taxation and education. “Even in the U.S., a senator from Hawaii has introduced a private member Bill on a similar concept,” Arthakranti’s Anil Bokil had then told The Hindu .\n\nThe outfit has estimated that the levy it is proposing can be collected through the banking channel rather than the tax collection authorities. Without leading to a loss of revenue, it will plug tax evasion and avoidance. Arthakranti’s calculations show that the 2 per cent tax will yield Rs. 40,00,000 crore. The claim was contested by the eminent economist and former secretary-general of the FICCI, Rajiv Kumar, who said that at 2 per cent, the proposed new tax will yield Rs.14,00,000 crore. In 2014-15, the Centre’s total tax revenue (revised estimates) were Rs. 9,084,63 crore.\n\nThis is not the first time such a proposal has been received by the Centre. Several governments have earlier discussed plans to abolish income tax but rejected them.\n\n“The group of Secretaries are unlikely to recommend that Arthakranti’s proposal be forwarded to the Ministry of Finance … We did not think that the Prime Minister would favour it since there isn’t a single precedent of a developed country adopting such an idea… ,” the source said.", 
    "section": "national", 
    "title": "Plan to scrap income tax gets high-level hearing", 
    "subsection": "general", 
    "date": "2016-02-08"
}