{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Tax holidays given to neighbouring States affecting Punjab, says Minister\n\nState Finance Minister Parminder Singh Dhindsa has sought a package of Rs. 15,000 crore for Punjab in the coming Union Budget.\n\nHe has also asked for a financial aid of Rs. 100 crore to check cancer penetration in the Malwa belt of the State.\n\nMr. Dhindsa made these demands during the pre-budget consultation meeting with Union Finance Minister Arun Jaitley here on Saturday. He said Punjab was facing agrarian crisis because of over-exploitation of natural resources and its industrial economy was also in the grip of a crisis mainly due to tax holidays given by the Central government to the neighbouring States.\n\nMr. Dhindsa said tax concessions given to neighbouring States had resulted in closure and shifting of 274 industrial units from Punjab — involving investment of Rs. 3,675 crore — to the tax-favoured States. He said Punjab’s natural resources had not only been over-exploited, but also polluted beyond permissible limits.\n\n“It is not that pollution and over-utilisation of environmental resources have adversely affected only human life, the degraded environmental resources, particularly quality of soil and water, have also adversely affected land productivity and hence, the farming community and landless workers have been facing high degree of economic distress resulting in suicides by farmers,” said Mr. Dhindsa.\n\nThe combined slow growth of both productive sectors of the economy posed another serious problem of stagnation of jobs for the youth, he said.\n\nMr. Dhindsa said Punjab was earlier declared a fit case along with Kerala and West Bengal for debt relief and it was decided that the matter of debt relief would be taken care of by the 14th Finance Commission, but the Commission overlooked it. He also sought a waiver of the reimbursement of Rs. 298 crore for deployment of paramilitary forces in the State.\n\nIndustry in crisis owing to tax holidays given\n\nto neighbouring States: Minister", 
    "section": "national", 
    "title": "Punjab seeks package of Rs. 15,000 cr. in Budget", 
    "subsection": "general", 
    "date": "2016-02-08"
}