{
    "author": [], 
    "text": "Revelers of the Mocidade Alegre samba school perform at the Sambadrome in Sao Paulo, Brazil.— Photo: AFP\n\nSwatting aside fears over the Zika virus, the glittering dancers of the Rio Carnival samba championship and their adoring fans were primed on Sunday for their first all-night parade.\n\nAfter a fortnight of street parties, thousands of gallons of beer, and the day and night sound of drumming and singing throughout Brazil’s most iconic city, the really serious Carnival fun was set to begin at 23:30 GMT.\n\nKicking off after sunset and going all through the night to dawn on Monday, the 12 best samba ensembles, known as schools, were to strut their stuff in front of some 70,000 people in Rio’s specially built stadium, the Sambadrome.\n\nThe contest, which goes through a second and final night on Monday, is the climax of the annual Rio Carnival, possibly the world’s biggest party, with some five million people, including one million tourists, estimated to take part.\n\nThis year, Rio’s fiesta is overshadowed by the Zika virus, painful recession, battles over the impeachment of President Dilma Rousseff and a corruption scandal reaching into the heart of the political and business elite.\n\nThe gloomy backdrop extends to a fall in funding for the hugely expensive samba school extravaganzas, whose floats and costumes for thousands of dancers and musicians take a year to prepare.\n\nThe productions in Rio are expected to be less over-the-top this year, while in 48 Brazilian cities, the Carnival was cancelled altogether.\n\nBrazilians might be better known as passionate football supporters, but there’s no less excitement at the Sambadrome where fans are vehement in their allegiance to a particular school.\n\nFor all their perfect choreography and literally dazzling costumes, the samba schools rely on the enthusiasm of amateur performers. — AFP", 
    "section": "national", 
    "title": "Rio Carnival dances toward wild finale, swatting Zika aside", 
    "subsection": "general", 
    "date": "2016-02-08"
}