{
    "author": [], 
    "text": "The tourism sector in Kashmir, badly hit by the floods of September 2014, is coming back to life with more than 75,000 tourists visiting the Valley in January this year.\n\nAbout 75,367 tourists, including 1,440 foreigners, visited Kashmir last month, according to Tourism Department data. Only 17,424 tourists, including 1,221 foreigners, visited the Valley in January last year.\n\nAfter Mufti Mohammad Sayeed, who died last month, took oath as Chief Minister in March last year, he went into an overdrive to promote tourism. He kept the tourism portfolio with himself and worked to ensure that tourists’ footfall grew in the State. He also met some Bollywood celebrities to seek their help in promoting tourism in the State.\n\nOwing to the promotional activities of the Tourism Department, 92,7815 tourists, including 28,954 foreigners, visited Kashmir in 2015, official data says.\n\nThough the numbers are smaller when compared to some previous years, the officials said 2015 was a relatively ‘good year’ keeping in view the September floods.\n\n“2015 has thankfully been a good year because you have to see we were hit by the floods in 2014. But we have recovered quickly. That shows the strength of the sector as also the commitment of the people. We have bounced back and the figures are encouraging,” Director, Tourism, Kashmir, Mehmood Shah told PTI.\n\n“The winter tourism in 2015 was dead because Kashmir was still battling the after-effects of the floods. If you compare the two winters [2015 and 2016], there is a sea of difference,” he said.\n\n“Usually, our prime skiing season is February and foreigners also come... It is the peak period. The weather forecast looks promising,” Mr. Shah said.\n\nMore golf courses\n\n“We are developing the State as a golfing circuit. This is a very high-end segment of the tourism industry. We now have golf courses in Srinagar, Gulmarg, Pahalgam and in Jammu as well. People are coming to play golf,” he said.\n\nMr. Shah said Meetings, Incentives, Conferences, and Exhibitions (MICE) tourism is another venture the department is studying.\n\n“We have conference centres in Srinagar and Pahalgam. So, MICE tourism is also picking up. People are interested in this high-end segment,” he said.\n\nThe director said that heli-skiing is also popular. “There is complete booking till March. The clients are mostly from Europe,” he said. — PTI", 
    "section": "national", 
    "title": "Tourism back on track in Kashmir", 
    "subsection": "general", 
    "date": "2016-02-08"
}