{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Even as panic spreads worldwide over the Zika virus, harboured by the mosquito species that spreads dengue and chikungunya, a Maharashtra company is getting ready to scale up trials to find out whether genetically engineered mosquitoes can be a useful tool to check the growth of the insect.\n\nGangabishan Bhikulal Investment and Trading Ltd. (GBIT), a sister company of the Maharashtra Hybrid Company (Mahyco) that first brought Bt cotton to India, has been breeding male mosquitoes. These mosquitoes contain genes which when passed on to its progeny render them unable to mature unless they have access to tetracycline, a compound that is not naturally available in the environment. The idea is that once enough of these laboratory-bred mosquitoes mate with the disease-carrying females in an open environment, they would reduce the region’s mosquito population.\n\nThe technology — licensed from Oxitec, a University of Oxford company — is being tested in Malaysia and Brazil, which has seen the highest number of Zika cases. The strain of mosquito, called OX513A, is sourced from Oxitec and introduced into local sites. According to GBIT scientists, international evidence so far shows the strain can reduce the number of mosquitoes in a place by 90 per cent in three or six months.\n\n“About two weeks ago, we got permission to conduct larger trials but still within the laboratory,” said Usha Barwale Zehr, Chief Technology Officer, Mahyco. “Depending on our findings, we will conduct experiments in villages of at least three States.” The key element being investigated is whether female mosquitoes do indeed choose to mate with the genetically altered males over normal ones.\n\nMs. Barwale said such tests would progress quickly as the life span of the Aedes aegypti mosquito was 15 days and the company expected the government’s permission to start larger trials later this year.\n\nLast week, Bharat Biotech, a Hyderabad-based vaccine maker, said it had two promising vaccine candidates to contain Zika, but would require a vigorous push by the Indian government.\n\nGBIT’s S.K. Dasgupta, who is leading the trials, told The Hindu that the company was following guidelines specified by the Bio-safety Unit of the Department of Biotechnology. “This is a first of its kind experiment, and there are WHO [World Health Organisation] guidelines that have been adapted by India. There will be some similarities to how GM crops are evaluated,” he said.", 
    "section": "national", 
    "title": "With Zika, Indian firm scales up trials for ‘GM mosquitoes’", 
    "subsection": "general", 
    "date": "2016-02-08"
}