{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "Distraught family members of the victim (inset) at their residence in New Delhi .— Photo: Shanker Chakravarty\n\nA 21-year-old Delhi University student was strangled to death on February 2 allegedly by her boyfriend, who then hid the body in his residence in North West Delhi’s Model Town for four days.\n\nIt was during this period that the accused, Naveen Khatri, got married to another girl and spent time with her in his room, right next to a shaft grill where the body of the victim, Arzoo Singh Chauhan, was kept.\n\nArzoo’s decomposed body was found on Sunday in the shaft on the first floor of the house where Naveen lived with his family.\n\nDeputy Commissioner of Police (North West) Vijay Singh said Naveen was detained for questioning on Saturday after the girl’s family members alleged the possibility of his having abducted the girl. Naveen confessed to committing the crime.\n\nThe DCP said: “On February 2, Naveen went to Arzoo’s college to pick her up and the two left in his car. They went to a mall in Saket and a few other places after which Naveen disclosed to her his plans of distributing cards for his upcoming wedding with another girl. Though she was aware that he was going to marry someone else, Arzoo got infuriated after Naveen sought her help to distribute cards and an argument broke out.”\n\nLate last year, both the families mutually agreed that since they hailed from the same village, Arzoo and Naveen were “like brother and sister” and could not marry each other.\n\nThey, however, kept their relationship a secret. Investigators said the secrecy often caused arguments between the two.\n\nOn the day of the suspected murder, Naveen felt intimidated as the victim threatened to make their relationship public and also inform Naveen’s fiancée about it. Sources claimed that the victim was pregnant, another secret she threatened to reveal. However, Mr. Singh said the fact could be ascertained only after an autopsy.\n\n“After his efforts to convince Arzoo failed, Naveen drove the car to an isolated stretch in Nangal Dawat village close to the airport in South-West Delhi. There, he strangled her with a ‘dupatta’ before stuffing the body in the boot of the car,” the DCP said.\n\nHowever, after murdering the girl, Naveen could not find a suitable place to dump the body and brought it home around 7 p.m., said the police.\n\n“He woke up around 3 a.m. the next day when other family members were asleep. He then placed the body on the grill of the ventilation shaft,” the DCP said.\n\nWhile Arzoo’s family alleged that Naveen’s family too was involved in the murder, police said so far there was no evidence linking them to the case.\n\nNaveen felt intimidated as the victim threatened to make their relationship public", 
    "section": "national", 
    "title": "Youth kills lover, keeps body in room, marries another", 
    "subsection": "general", 
    "date": "2016-02-08"
}