{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "A day after the media raised a hue and cry over the Bihar government’s act of showering expensive gifts on legislators during the budget session, three Bharatiya Janata Party leaders on Saturday said they had decided to return the gifts to the government.\n\n“Lakhs of school teachers (are) without salary for the last four months. Prem Kumar, Mangal Pandey and myself will return the gifts like micro oven to the govt.,” tweeted senior BJP leader and member of the State Council, Sushil Kumar Modi.\n\n“GOB has given the ridiculous justification that Bihar MLAs are poor and will use micro oven to taste Mid Day Meal. MLAs (are) paid Rs 1.5 lakh per month,” Mr. Modi tweeted.\n\nOn Friday, Bihar legislators were seen moving microwave ovens and trolley bags into their luxury vehicles on the Bihar legislature premises. They have also been provided with smartphones and watches by various departments on other days “for their help and contribution in preparing the State budget.”\n\n‘Tradition’\n\nOne of the legislators, however, told media persons that “it has been a tradition for over two decades … so there is nothing to make any fuss about”.\n\nJustifying the largesse, State Deputy Chief Minister Tejaswi Yadav said: “Bihar is a poor State and the MLAs who get elected here do not come from economically well-off backgrounds … so what’s wrong if they get some gifts like this … Kindly do not make an issue of it.”\n\nThe Bihar Assembly has 243 members. According to their election affidavits, about 67 per cent of them are millionaires.\n\nThere are 51 millionaires among the 80 ruling RJD MLAs. The showering of such gifts has received much condemnation from across the State.\n\nThe showering of gifts on legislators has received condemnation from across the State", 
    "section": "national", 
    "title": "3 Bihar BJP MLAs to return govt. gifts", 
    "subsection": "general", 
    "date": "2016-03-20"
}