{
    "author": [
        "Gautam S"
    ], 
    "text": "Ten years ago, Anita (name changed) was a five-year-old without many worries. Today, at 15, she lives in a Children’s Home in Govandi with no one to call her own, after her mother made her register a complaint of sexual assault against her father to settle a personal score.\n\nAnita’s parents were divorced in 2007, and the court granted her custody to her mother. She would visit her father occasionally, and her association with her father angered her mother a lot.\n\nAnita’s plight came to light earlier this month when the Parksite police were investigating the complaint of rape and learnt that it was fake. Police officials said Anita went missing from her aunt’s house in Vikhroli in Mumbai’s eastern suburbs on January 14 this year. Her aunt and her mother approached the police, and a case of kidnapping was registered against unknown persons, as is the rule for missing minors.\n\nFour days later, on January 19, her father brought her home safe and sound. He told the police that she had come to stay with him as she was missing him. The father and daughter stayed at his house in Ahmednagar. The police recorded his statement as well as Anita’s and, for all purposes, the case was closed.\n\nHowever, on January 28, Anita’s mother brought her back to the police station and Anita told the police that her father, as well as another man, who she did not know, had sexually abused her during the four days that she had spent at his residence. The police registered a complaint of molestation under the Indian Penal Code as well as sexual assault under the Protection of Children from Sexual Offences Act (Pocso), and sent a team to her father’s residence in Ahmednagar near Pune.\n\n“We found her jewellery at her father’s house, as well as some of her clothes in the farm, which was in keeping with the victim’s narration of the offence. However, we found her overall demeanour suspicious,” said an officer with the Parksite police station.\n\nGives in to pressure\n\nFinally, after repeated and gentle cajoling, Anita broke down and told them the truth. She said that after she ran away to stay with her father, her mother had decided to end her association with him once and for all. She was allegedly beaten and tortured till she agreed to file a false complaint against her father.\n\nFollowing the revelation, the CWC directed the Mumbai police to register an FIR against Anita’s mother, her friend and her aunt.\n\nGirl’s mother made her file complaint of sexual assault against her father to settle scores", 
    "section": "national", 
    "title": "A horrifying tale of child abuse in Mumbai", 
    "subsection": "general", 
    "date": "2016-03-20"
}