{
    "author": [
        "Bhavya Dore"
    ], 
    "text": "Dogs belonging to the National Security Guard with their handlers at the ‘Bravehearts’ medal ceremony at Bombay Veterinary college on Saturday.— Photo: Vivek Bendre\n\nFawn-coloured labrador Tyson took the stage, alongside his colleagues Max, Snowy, Milo and Browny, as cameras in the front row flashed. It was a muggy Saturday morning, and Tyson waddled forward, his tongue lolling, before he obligingly sat down as a medal was laced around his neck. “He is an extremely hardworking and intelligent canine,” the ceremony’s host informed the audience.\n\nThe five, part of the protection branch of the city police, were among the 22 dogs and their handlers honoured at the ‘Bravehearts’ programme at the Bombay Veterinary College festival — Spandan — on Saturday.\n\nThe distinguished canines came from the railways, customs, the central forces, and an animal-focused non-profit organisation. . One had played a role in 26/11, another during the 2011 blasts; all had provided some exemplary service.\n\nA three-year veteran with the CISF, German Shepherd Vexa trotted up on stage as the presenter called out her achievements which included apprehending criminals and helping recover lakhs of rupees. After receiving her medal, Vexa stayed on and graciously offered a paw for a handshake when the guests on stage sought one.\n\nTwo black Labradors of the National Security Guard were next, hailed as ‘exceptionally talented’ and the ones who were ‘on the vigil day and night to keep Mumbai safe’. Along with a medal, each of the handlers was presented a hamper, as the dogs inquisitively sniffed it out. Each one contained dog food, chew sticks, shampoo, and vouchers to a dog spa.\n\nIntermittent barks punctuated the presentation ceremony, but for most part the dogs lolled on the strip of red carpet laid out for them in the special guests section.\n\n‘Jimmy’, said the presenter when her turn came, ‘along with her handler ST Salvi, works hard 12 hours a day, in her quest to prevent drug smuggling across international borders’.\n\nGoldie, Pepe, Sunshine — all golden retrievers — along with their labrador colleague Coco came from Animal Angels Foundation, where they have worked as therapy dogs with special children and juvenile offenders. Two of the Railway dogs came in deep purple vests emblazoned with their unit name.", 
    "section": "national", 
    "title": "A pat on the back for 22 canine heroes", 
    "subsection": "general", 
    "date": "2016-03-20"
}