{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Not just students but also professors who have taught at Jawaharlal Nehru University (JNU) are discovering a worrying trend, especially in Central universities: they are being prevented from speaking at seminars and public gatherings.\n\nM.N. Panini, who has taught at the Centre for the Study of Social Systems in the School of Social Sciences, JNU, was on his way to deliver an address on the “Challenges of nation-building in a global age” at the Central University of Jharkhand in the context of the 140th birth anniversary of Sardar Vallabhbhai Patel.\n\nThe university had made arrangements for Professor Panini to fly from Mysore to Ranchi, via Delhi, for the lecture on Saturday. On Friday evening , however, the Vice-Chancellor of the Jharkhand university, Nand Kumar Yadav, called him to say that the trip was cancelled.\n\nAccording to sources, the lecture was cancelled under pressure exerted on the university administration by a clutch of students. The campus does not have a union.\n\nIt is learnt that though the organisers tried to reason with these students, the lecture was called off at the last minute. Professor Panini finds it ironical that the university did not want to hear Patel’s vision in nation-building and that perhaps, the sudden problem cropped up because of the JNU badge that he wears with pride.\n\nProfessor Yadav, who was appointed last year, said he erred on the side of caution as he was told that certain students were planning to disrupt the lecture.\n\n“There were also rumours that Professor Panini was Kanhaiya’s supervisor,” he said, adding that he took the decision to save his guest from being dishonoured. “Students would have disrupted the proceedings according to my information,” he said.\n\nIn a similar incident at Delhi University on Friday, Professor Chaman Lal, a retired Professor from JNU, was heckled and booed by ABVP students when he got up to speak on “The life and writings of Bhagat Singh”. The Professor stood his ground and continued with his speech. “The ABVP did at the Delhi University what even the British colonial regime could not do — disturb Bhagat Singh’s meetings,” Professor Lal said. An authority on Bhagat Singh, Professor Lal said he was told he should not speak at a meeting held to mark the revolutionary’s martyrdom day. As Professor Lal got up to speak, the ABVP students tried to disrupt the proceedings by shouting Bharat Mata Ki Jai . The Professor not only spoke but also took questions from his guests.\n\nLast month, the ABVP activists attacked Professor Vivek Kumar in Gwalior at a symposium on Baba Saheb Ke Sapno Ka Bhartiya Samaj .\n\nFrom Patel to Ambedkar, no matter what the subject, it would appear that academics from JNU will not be allowed to speak.", 
    "section": "national", 
    "title": "Academics with JNU pedigree find their speeches cancelled", 
    "subsection": "general", 
    "date": "2016-03-20"
}