{
    "author": [], 
    "text": "Top priority has been given to this directive, with the Prime Minister expected to review it from this month’s Pro-Active Governance and Timely Implementation (PRAGATI) meeting, where he interacts with Central government Secretaries and the Chief Secretaries of the States and assesses the progress based on inputs from e-Samiksha and other sources, including the Ministry of Statistics and Programme Implementation.\n\nCitizens’ complaints about government agencies are handled by the Department of Administrative Reforms and Public Grievances in the Ministry of Personnel and the Directorate of Public Grievances at the Cabinet Secretariat. A web-based Centralized Public Grievance Redress and Monitoring System (CPGRAMS) forwards complaints to the departments concerned for remedial action, tracking them till their resolution.\n\n“At January’s PRAGATI meeting, the Prime Minister recommended strict action against officials responsible for complaints and grievances, taking exception to the high complaints arising from the Customs and Excise Departments. He had asked all Secretaries whose departments have extensive public dealings to set up a system immediately for top-level monitoring of grievances,” said an official aware of the development.\n\n“We hope senior officials’ direct attempts at redressing grievances would help them identify more systemic flaws that can be addressed by changes in administrative processes and cumbersome rules, so that… grievances of such type can be prevented rather than be resolved post-facto,” he said of the decision to make officers above the rank of Joint Secretary responsible for grievances.\n\nAt the PRAGATI review meetings, usually held on last Wednesday each month, the Prime Minister monitors the pendency of CPGRAMS grievances. A new module has been added to include the details of grievances addressed by top officials in each department. As per the new norms, Joint Secretaries would have to report the status of 120 public grievances a month, while the number would be 80 for Additional Secretaries and 40 for Secretaries.\n\nAn analysis of grievances received on CPGRAMs highlights that a key reason for complaints is the archaic rules, regulations and instructions aimed at shifting the work towards citizens. “Slackness in administration, low morale of the services, inherent inertia, absence of incentives, lack of proper authority and accountability are the delay-breeders, and the delay is the major factor for grievances. Many times, the departments avoid taking decisions by resorting to rejection without application of mind, and lay stress on disposal, and not on the quality disposal. There is inertia to review decisions taken by down-the-line functionaries,” the Department of Administrative Reforms and Public Grievances has noted as key factors for the persistent red tape-related woes in government offices.", 
    "section": "national", 
    "title": "After PM’s rap, officials get target to clear grievances", 
    "subsection": "general", 
    "date": "2016-03-20"
}