{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Union Minister of State Ramshanker Katheria on Friday threatened the Uttar Pradesh government that Agra would witness a “different Holi” if the demands of the Bharatiya Janata Party and other Hindutva groups on the withdrawal of hate speech cases are not met in the next 15 days.\n\nDuring the condolence meeting of the slain VHP leader, Arun Mahaur, on February 25, Mr. Katheria, along with other sangh parivar leaders, is alleged to have made objectionable statements against Muslims, after which cases were filed against one BJP and two VHP leaders.\n\nJustifies remark\n\nWhile addressing the protest rally of the BJP and other parivar groups in Agra, Mr. Katheria justified his controversial remarks, saying “what else should one say, if someone of your own is killed mercilessly?”\n\nHe said the local administration had assured him that the cases filed against the BJP and VHP leaders would be withdrawn in the next 15 days and a higher compensation given to Mahaur's family.\n\n“If the cases are not withdrawn within the assured time, Agra will witness a different kind of Holi”, threatened Mr. Katheria, in the presence of senior administration officials, including the ADM and Superintendent of Police, city.\n\nDuring Mahaur’s condolence meet, some speakers compared the minority community with “rakshasas [demons]” and asked the crowd to “corner them and destroy them.”\n\nThe police did not file any case against Mr. Katheria. An FIR was filed against Kundanika Sharma of the BJP and Ashok Lavania and Shashank Chaudhary of the VHP under Section 153 (wantonly giving provocation with intent to cause riot) and 295A (deliberate and malicious acts intended to outrage religious feelings of any class by insulting its religion or religious beliefs) of the Indian Penal Code.\n\nHowever, the local administration is widely seen as not taking action on the hate speech case. The police declared that the leaders were “absconding,” whereas they were reportedly present on the same stage from where the ADM, Agra, Rajesh Shrivastav, addressed the protesters.\n\nMr. Shrivastav assured the protesters that besides higher compensation, Mahaur's family would get a government house and government pension — an arrangement which is close to the demand made by the BJP and the sangh parivar that Mahaur should get a compensation package similar to Mohammad Akhlaq who was lynched over rumours about beef in October last year in Dadri.\n\nThe fact that the State government fulfilled one of the main demands of the sangh parivar and slapped the stringent National Security Act on Shahrukh, accused in Mahaur's murder, is believed to have made the Hindutva groups soften their threats of a huge protest in Agra this week.\n\nRamshanker Katheria gives the U.P. government\n\n15 days to meet the demand", 
    "section": "national", 
    "title": "‘Agra will see different Holi if hate speech cases are not withdrawn’", 
    "subsection": "general", 
    "date": "2016-03-20"
}