{
    "author": [], 
    "text": "A team of researchers has spotted an extrasolar planet about 117 light-years from Earth that boasts the most “eccentric” orbit yet seen.\n\nWhile the planets in the solar system have nearly circular orbits, astronomers have discovered several extrasolar planets with highly elliptical, or eccentric, orbits.\n\nThe extrasolar planet HD 20782 has the most eccentric orbit known, say researchers.\n\nThis means that the planet moves in a nearly flattened ellipse, travelling a long path far from its star and then making a fast and furious slingshot around the star at its closest approach.\n\nAt the furthest point in its orbit, the planet is separated from its star by 2.5 times the distance between the Sun and Earth.\n\nAt its closest approach, it ventures as close as 0.06 of that same Earth-Sun distance — much closer than Mercury orbits the Sun, said Stephen Kane, Assistant Professor of Physics and Astronomy at San Francisco State University in the U.S.\n\nLike a comet\n\n“It’s around the mass of Jupiter, but it’s swinging around its star like it’s a comet,” Mr. Kane said.\n\nThe findings appeared online in The Astrophysical Journal .\n\nThe researchers were able to detect a signal of reflected light from the planet known — a “flash” of starlight bouncing off the planet’s atmosphere as it made its closest orbital approach to its star.\n\nBy studying the reflected light, astronomers may learn more about the structure and composition of a planetary atmosphere that can withstand a brief but blistering exposure to its star.\n\nThe reflected light could tell researchers more about how the atmosphere of a planet like HD 20782 responds when it spends most of its time far away from its star, “but then has a very close approach where it’s flash-heated by the star,” Mr. Kane said. — IANS", 
    "section": "national", 
    "title": "An exoplanet in a freewheeling orbit around its star", 
    "subsection": "general", 
    "date": "2016-03-20"
}