{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Amit Shah questions Rahul Gandhi’s JNU visit, says will not accept criticism of the nation\n\nBJP president Amit Shah, Prime Minister Narendra Modi and Finance Minister Arun Jaitley at the party's national executive meet in New Delhi on Saturday.— Photo: Shanker Chakravarty\n\nUpping the ante on the debate over nationalism and “anti-nationals”, BJP president Amit Shah on Saturday questioned Congress leader Rahul Gandhi over his visit to Jawaharlal Nehru University after action was taken against some students following an event to mark the hanging of Afzal Guru, convicted in the Parliament attack case.\n\nHe was addressing delegates at a meeting of the BJP’s national executive here.\n\n“The party president said that anti-national slogans calling for India to be broken to pieces were raised in the JNU. Rahul Gandhi went there and said nothing against the slogans, but talked about freedom of expression,” BJP leader and Union Minister Ravi Shankar Prasad told presspersons, adding that this tacitly ended up justifying the sloganeering. “The BJP welcomes criticism of a person, party or government, but we won't accept criticism of the nation. Patent anti-national activity cannot be justified on grounds of the freedom of expression.”\n\nSummarising Mr. Shah’s inaugural address at the BJP national executive, Mr. Prasad took a dig at the Left, saying “supporters of Maoism and Stalin are asking about the freedom of expression”.\n\nHe said Mr. Shah also questioned the Congress’s own credentials on the freedom of expression, recalling the excesses of the Emergency.\n\nMr. Shah underlined in his speech that there could be no difference of opinion on Bharat Mata Ki Jai , a slogan that had been an inspiration for nationalists for a long time.\n\nHe praised the Union Budget of this year, mentioning the government's “pro-poor” schemes, from provision of medicines to gas connections, MGNREGA allocations and the new crop insurance scheme.\n\nHe announced that the BJP would celebrate the 350th anniversary year of Guru Gobind Singh, whose life was a “milestone” in the spirit of sacrifice. With Punjab headed for polls next year, this is also being seen as the BJP's outreach to Sikhs in the state.\n\nMr. Shah took a serious view of attacks on BJP activists in Kerala and West Bengal, saying the BJP would rise despite the attacks and emerge as a serious player in these States this year.\n\nOn Sunday, the party is expected to discuss and pass its political resolution, followed by an address by Prime Minister Narendra Modi.", 
    "section": "national", 
    "title": "BJP raises pitch on ‘nationalism’", 
    "subsection": "general", 
    "date": "2016-03-20"
}