{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The Congress has found unexpected support from the former Union Minister, Arif Mohammad Khan, on its stand on the JNU sedition case and its censure motion in the Madhya Pradesh Assembly against All India Majlis-e-Ittehadul Muslimeen (AIMIM) leader Asaduddin Owaisi for his refusal to chant Bharat Mata ki Jai .\n\nMr. Khan had left the Rajiv Gandhi government in 1986 over its decision to bring in the Muslim Women (Protection of Rights on Divorce) Act to overturn a Supreme Court judgement awarding monthly maintenance to Shah Bano, a 62-year-old divorcee.\n\nHe says he finds “no confusion or contradiction” in the Congress’s defence of JNU students accused of sedition and the party’s criticism of Mr. Owaisi for not chanting Bharat Mata ki Jai . “In fact, I welcome the stand of the Congress. The JNU episode and the provocative outbursts of Mr. Owaisi are not the same,” he told The Hindu .\n\nHe said: “Patriotism, like religion, is a matter that pertains to conscience, and it brooks no compulsion. Bharat Mata ki Jai is not prescribed in the Constitution, but this is the slogan chanted by our freedom fighters who laid down their lives to win independence that we enjoy today.”\n\nMr. Khan said Mr. Owaisi’s expressions stemmed from the fact that “he is the inheritor of the politics of Qasim Rizvi,” the leader of Majlis, who had opposed Hyderabad’s accession to India, and delayed its freedom by 13 months. “Mr. Rizvi was the one who had declared that ‘India is a geographic notion, Hyderabad is a political reality. Are we prepared to sacrifice the reality of Hyderabad for the idea of India?’ Mr. Owaisi by declaring that he will not say Bharat Mata ki Jai is only reaffirming his loyalty to Qasim Rizvi and his ideology which refused to recognise India as a nation.”\n\n“India is a deeply liberal society but we need not forget that the partition of India in 1947 has deeply impacted our psyche and when somebody with Mr. Owaisi’s background throws challenges, then as a nation we feel anxious. I see no harm if such people are named and even if they do not feel any shame, at least that would help people to know about their motives,” he said.\n\n“I feel that the Congress, as a party committed to secularism and nationalism, is acting right in this matter, and if this line is consistently pursued, it will greatly help in dispelling some misgivings which had arisen in public mind after the Shah Bano [case] and the Ayodhya [issue],” he said.", 
    "section": "national", 
    "title": "Cong. right in criticising Owaisi: Arif", 
    "subsection": "general", 
    "date": "2016-03-20"
}