{
    "author": [
        "V S"
    ], 
    "text": "Two personnel critically injured during the operation\n\nThe big cat that was shot dead at Devarshola near gudalur on Friday.Photo: M. Sathyamoorthy\n\nThe elusive tiger of Devarshola resurfaced on the eighth day only to be shot dead by personnel of the Special Task Force (STF) and Armed Reserve police. But in the firing, two personnel - Santhosh of the STF and Ravi of the Armed Reserve police- were critically injured.\n\nThe tiger was gunned down at 9{+t}{+h}field of Wood Briar Estate in Devarshola near Gudalur in the Nilgiris at around 3 p.m.\n\nOn March 11, an estate worker went missing and rescue teams tracking bloodstains recovered his head and legs, while the torso remained untraced.\n\nThe initial suspicion was that it was a carnivore. Camera trap images and pug marks established that it was a tiger. Closer examination of the images confirmed that the tiger with wounds on its fore and hind legs and stomach was not able to hunt its prey in the wild and was looking for soft targets.\n\nOn March 15, the exact location of the tiger was ascertained when it lifted cattle. Immediately, thermal imaging cameras for monitoring at night were installed, in addition to camera traps and tree top machans for veterinarians to position themselves to tranquillise the animal.\n\nThe big cat’s movement was restricted to just one sq km. Sniffer Rana from the Tiger Task Force in Bandipur was brought in, recording of a tigress’ voice was played and urine of a zoo tigress was used as bait.\n\nOn Staurday (March 19) morning, officials seemed under pressure to bring the operation to an end by tranquillising the animal as it happened to be the day for second feeding cycle and the tiger was expected to come out any time. Around 5.30 a.m., a team of experts, D. Boominathan – Landscape Co-ordinator for WWF-India, Mudumalai Forest Veterinarian E. Vijayaraghavan and Prayag, who were atop the fifth machan, spotted the animal. Darkness and mist prevented tranquillising it.\n\nSTF and additional strength was brought in and the area was cordoned off to prevent the animal from going further. Field Director of MTR, Srinivas R. Reddy, Conservator of Forests I. Anwardeen, Gudalur DFO S.N. Tejaswi, Superintendent of Police – Murali Ramba and others led the teams assisted by two tiger trackers/guides, Kalan and Bomman.\n\nWhen two teams with dart guns were ready, the growling tiger emerged out of a tall lantana bush and reportedly pounced on the STF team. The STF men opened fire to save one of its personnel. Within seconds, the tiger fell dead. Two personnel - Santhosh o\n\nf the STF and Ravi of the Armed Reserve police- were critically injured in the firing.\n\nForest Veterinarians N.S. Manoharan and E. Vijayaraghavan conducted the post-mortem and the carcass was consigned to flames after lifting crucial samples.", 
    "section": "national", 
    "title": "Elusive tiger shot dead in the Nilgiris", 
    "subsection": "general", 
    "date": "2016-03-20"
}