{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "The Opposition Congress on Saturday slammed the BJP government in Goa, saying it was “not serious” about investigating “the politician-police-drug peddler nexus” as exposed by a State Assembly House Committee report in 2013.\n\nTalking to presspersons here, Congress secretary and spokesperson Durgadas Kamat said as per the information received through a Right to Information (RTI) query, the House Committee report, which had indicted police officers, including a former Director-General of Police, had been handed over to the Anti-Corruption Bureau of the State Vigilance.\n\nMr. Kamat said the ACB had communicated to him that the State government has not taken any steps to initiate a probe, claiming an investigation was beyond its scope.\n\nCharging that former Chief Minister and current Union Defence Minister Manohar Parrikar gained political capital out of the alleged nexus ahead of the 2012 Assembly polls, Mr. Kamat asked why Mr. Parrikar or his successor Laxmikant Parsekar had not tried to investigate the nexus based on the findings of the committee report and punish the guilty.\n\nMr. Kamat demanded that the report be handed over to the Anti-Narcotics Cell of the State police for investigation.\n\nWhen pointed out that certain kith and kin of the former Congress Minister too had been indicted in the report, Mr. Kamat said all those proved guilty of supporting drug trade should be punished “irrespective of their party affiliations.”\n\nMr. Kamat said it was Mr. Parrikar who set up the House committee as Chief Minister in August 2012 soon after coming to power.\n\nThe panel was headed by former minister Mickky Pacheco of Goa Vikas Party, an ally of the BJP. The committee submitted the report to the government in October 2013.\n\nAn Assembly House Committee report in 2013 exposed a politician-police-drug peddler nexus", 
    "section": "national", 
    "title": "Goa BJP govt. not serious in probing drug nexus: Congress", 
    "subsection": "general", 
    "date": "2016-03-20"
}