{
    "author": [], 
    "text": "Snapping shrimps, the loudest invertebrate in the ocean, may be silenced because of seawater acidification, a new study has warned.\n\nResearchers from the University of Adelaide in Australia found that under the levels of carbon dioxide predicted to be found in oceans by the end of the century, the sound of snapping shrimps would be reduced substantially.\n\nThis is expected to have profound consequences for many species that rely on sound cues for information about the location and quality of resources (food, shelter, partners and potential predators).\n\n“Coastal reefs are far from being quiet environments — they are filled with loud crackling sounds,” said Tullio Rossi, a Ph.D. candidate at the university.\n\n“Shrimp ‘choruses’ can be heard kilometres offshore and are important because they can aid the navigation of baby fish to their homes. But ocean acidification is jeopardising this process,” Mr. Rossi said.\n\nThe snapping shrimp is the most common and noisiest of the sound-producing marine animals in coastal ecosystems.\n\nThey can produce sounds of up to 210 decibels (dB) through the formation of bubbles by the rapid closing action of their snapping claw, used as a warning sign to scare off predators and in their own hunting.\n\nResearchers measured the sound produced by shrimp in field recordings at natural CO2 volcanic vents at three different ocean locations and under laboratory conditions.\n\nThey found substantial reductions in both the levels of sound produced and in the frequency of snaps.\n\n“Our results suggest that this is caused by a change of behaviour rather than any physical impairment of the claw,” said Associate Professor Ivan Nagelkerken.\n\n“Sound is one of the most reliable directional cues in the ocean because it can carry up to thousands of kilometres with little change, whereas visual cues and scents are affected by light, water clarity and turbulence,” Mr. Nagelkerken said.\n\n“If human carbon emissions continue unabated, the resulting ocean acidification will turn our currently lively, noisy reefs into relatively silent habitats,” he said.\n\n“And given the important role of natural sounds for animals in marine ecosystems, that’s not good news for the health of our oceans,” he added. The study was published in the journal Proceedings of the Royal Society B . — PTI", 
    "section": "national", 
    "title": "In polluted seas, these shrimps will lose ‘voice’", 
    "subsection": "general", 
    "date": "2016-03-20"
}