{
    "author": [
        "K C"
    ], 
    "text": "‘Challenge is to ensure a genuine minority institution is exempted from RTE’\n\nKarnataka’s Education Department and the National Commission for Minority Educational Institutions (NCMEI) do not appear to be on the same page as far as the number of students an institution is required to admit to qualify as a minority institution. In Karnataka, 25 per cent of the seats in primary and secondary institutions need to be filled with students from that particular community to be a minority institution.\n\nThis was even as Zafar Agha, member, NCMEI, said that according to the commission, there is no “quota” in minority education institutions. Citing the examples of the Jain, Sikh and Parsi communities, he said it would be difficult for them to fulfil that criterion. He also reiterated that a Supreme Court Constitutional Bench had ruled that the Right to Education (RTE) Act does not apply to minority educational institutions.\n\nAddressing the media after the second regional conference organised by the commission here on Saturday, Ajay Seth, Principal Secretary, Primary and Secondary Education, said there is also a “vacuum in the law” concerning linguistic minority institutions.\n\n“Linguistic minority has not been notified by the Government of India. State governments, including Karnataka, have come up with policies that require these institutions to admit 25 per cent of students from those communities,” he said, adding: “The challenge at this point is to ensure that genuine minority institutions get exemption from RTE, and not the ones that want to escape it.\n\nRuling out a review of the existing provisions in the State for minority institutions, Mr. Seth said Karnataka had put them in place after a lot of deliberations. “But, we will put forth the commission’s view before the government,” he added. Admitting that delay in getting the minority status was an issue raised by institutions during the consultations, Mr. Agha said the commission does not grant minority status directly. “If the State government does not grant it in 90 days, they can appeal to us with proof. The maximum number of appeals comes from Kerala,” he said.\n\nTerming Karnataka as one of the States that fares well on this count, he also mentioned that Chief Minister Siddaramaiah too had, in his budget speech on Friday, promised to include issuance of minority status under Sakala, which would solve the problem.\n\nState governments, including Karnataka, have come up with policies that require these institutions to admit 25 per cent of students from those communities.\n\nAjay Seth,\n\nPrincipal Secretary, Primary and Secondary Education\n\nAccording\n\nto the commission, there is no quota in minority education institutions.\n\nZafar Agha,\n\nMember, NCMEI", 
    "section": "national", 
    "title": "NCMEI, govt. differ over quota criteria for minority status in institutions", 
    "subsection": "general", 
    "date": "2016-03-20"
}