{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Oli will beginhis first visit to Beijing today\n\nStrongly defending ties with China, Nepal’s Prime Minister K. P. Sharma Oli, on Saturday said the Himalayan country wanted good relations with both China and India to draw “developmental benefits” for the Nepali economy.\n\n“Nepal is smaller in size and has limited resources. We have to benefit also from the developmental activities in the neighbouring countries. We don’t want to fight with any country nor do we want to distance ourselves from any of our neighbours. We are a small country seeking development of our people,” Mr. Oli said in a TV interview which was telecast a on an Indian channel, a day before he is scheduled to embark upon his first visit to China.\n\nMr. Oli defended his policy with India indicating that New Delhi’s lack of support to the Nepali Constitution was due to “lack of mutual understanding” which was addressed during his February visit to India.\n\n“Some Indian leaders and ministers were misinformed and misled about the new Nepali Constitution,” Mr. Oli said, defending the statute which has been termed discriminatory by Nepal’s Madhesi population.\n\nHydel projects\n\nPrime Minister Oli also strongly defended Nepal’s rights over water resources and said Nepal will allow hydroelectricity generation if the projects are in “mutual benefit.”\n\n“We are not against exploiting our water resources for electricity generation. India, or any other country and companies can exploit rivers for energy generation provided the projects benefit us both,” Mr. Oli said.\n\nMr Oli’s visit to China has been a subject of speculation since he came to power in October 2015. Reports suggest that the visit to China, beginning on March 20, may include landmark agreements on border trade and extradition of wanted criminals.\n\nChina to build fuel depots\n\nOn Saturday, Nepali Minister for Supplies, Ganesh Man Pun declared that Mr Oli’s visit would lead to the conclusion of a bilateral agreement on fuel supply from China.\n\nMr. Pun also announced that the Chinese government would build fuel storage depots in three locations in Nepal for which plans have begun.", 
    "section": "national", 
    "title": "Nepal PM seeks good ties with China, India", 
    "subsection": "general", 
    "date": "2016-03-20"
}