{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Nandan Nilekani, former chief of the Unique Identification Authority of India (UIDAI) heading the Aadhaar project for the then UPA government, said it was time to acknowledge that a good policy idea could be truly bipartisan and that fears of the new Aadhaar Bill (cleared by Parliament this week) would violate privacy were unfounded.\n\n“The previous attempt to enter Aadhaar into the statute books was 4-5 years ago. Much has happened since then in the field of privacy laws and the government’s own experience with the working of Aadhaar. The new Bill reflects all that,” Mr. Nilekani said in an interview to The Hindu .\n\nHe pointed out that the new Bill had incorporated several safeguards with regard to privacy as highlighted by the A.P. Shah Committee report.\n\n“The A.P. Shah Committee report was on a privacy law. It put together some of the best practices, so to speak, with regard to protection of privacy. The new Aadhaar Bill has incorporated some of those suggestions. I would say it has robust provisions for protection of privacy,” he said.\n\nMr. Nilekani, now a Congressman who fought and lost the Lok Sabha polls in 2014 on that party’s ticket, said that his support for the new Aadhaar Bill had not attracted any censure from his party, despite its opposition to it in Parliament.\n\n“I do not want to go into the politics of it, but I do what I think is right. Aadhaar is required to target subsidies, and on balance it reflects most concerns. It is a bipartisan Bill, it was a UPA idea, for which they were kind enough to hire me, and extend full support and autonomy. The new government’s adoption of it shows that if an idea is good, it doesn’t matter which ideology backed it in the beginning,” he added.\n\nThe Aadhaar Bill under the UPA had been rejected by the parliamentary standing committee on finance headed by former Finance Minister and senior BJP leader Yashwant Sinha.\n\nMr. Nilekani had met Prime Minister Narendra Modi in 2014, just after the latter came to power. It was that meeting that changed the NDA from being a naysayer to pushing it into the statute books.\n\nThe Bill, under the NDA, was introduced as a Money Bill in Parliament in the first part of the budget session that concluded on Wednesday. The Congress managed to get an amendment moved in the Rajya Sabha, but it was rejected by the Lok Sabha thereafter. It now awaits the signature of President Pranab Mukherjee.", 
    "section": "national", 
    "title": "No privacy fear about Aadhaar law: Nilekani", 
    "subsection": "general", 
    "date": "2016-03-20"
}