{
    "author": [
        "K A"
    ], 
    "text": "Autorickshaw driver Shyam Kumar of Thenkurissi in Kerala is a green crusader in his neighbourhood\n\nThe quick disappearance of house sparrows from the locality he lives in made autorickshaw driver M. Shyam Kumar of Thenkurissi find out why it was happening.\n\nMr. Kumar, has already made a name for himself in his neighbourhood by planting trees, besides making efforts to ensure that the sparrows return.\n\n“Thanks to the mushrooming growth of concrete structures, sparrows have taken a flight, never to return. I felt it was my duty to ensure their return. Making the house sparrow come back is my latest campaign,” he says, on the eve of World Sparrow Day (March 20).\n\nHe carries around at least 10 litres of water at a time in his auto rickshaw and fills bowls in the area.\n\n“Water bowls are a big relief to sparrows, which are facing the impact of the scorching summer. It was after I began noticing the plight of sparrows four years ago, I started placing water bowls in my house compound. Now, it attracts around 22 varieties of birds, including black drongo and Indian pitta.” In some places, he also feeds sparrows fruits and cereals.\n\nAn avid tree planter, he makes his passengers aware of the need to plant trees. Often, they are bowled over by his rare social commitment and by the time his autorickshaw reaches its destination they, more often than not, promise him to do their bit for the environment.\n\n“I have been on conservation mission for the last 19 years, and my wife and son are also part of it. Inspired by us, people in our locality have planted more than 23,000 saplings, and 90 per cent of them have become big shade-giving and fruit-bearing trees,” Mr. Kumar told The Hindu . Three years ago, he won the Haritha Vyakthi Award of the Kerala State Bio-Diversity Board.\n\nM. Shyam Kumar of Thenkurissi has made a name for himself in environmental protection and is making efforts to ensure the return of sparrows to his locality", 
    "section": "national", 
    "title": "On a mission to bring back sparrows", 
    "subsection": "general", 
    "date": "2016-03-20"
}