{
    "author": [
        "S Rajendran"
    ], 
    "text": "The much-touted ban on plastics has come about in Karnataka with the State government taking the bold initiative of issuing a gazette notification on March 11. This in turn is expected to bring about a whole lot of change in the life of the common people, whether it be in the disposal of garbage or the purchase of essential commodities, including vegetables leave alone saving the environment from degradation.\n\nEssentially, all people have to carry bags to the market, unlike the traders providing them with plastic bags to carry their purchase. The situation, however, may be different in the high-end malls where the shops provide paper bags for a price.\n\nKarnataka is thus in the forefront in ensuring a total ban on plastics although it took nearly a decade for successive governments to evolve a fool-proof blueprint and beat the pressure exerted by the plastic lobby. That a ban on plastics across the State was on the anvil was well known, but it is the timing which is of significance.\n\nAs per an estimate, there are over one lakh people involved in the manufacturer of plastic carry bags, flex used in advertising, plastic cups and buntings, and a whole lot of plastic-based products, which are undoubtedly an environmental hazard and major source of pollution. They are all obviously up in arms against the move and some of them have even ventured to move the courts of law.\n\nAdded to all this are the large number of cottage industries engaged in plastic manufacturing and the total trade has been estimated at over Rs. 1,000 crore. It is another matter that the authorities are unaware of the total business in plastics given the fact that most of them are very small manufacturers and their business is beyond the purview of audit.\n\nThe government notification makes specific mention that plastic, no matter its thickness, is banned across the State. “No shopkeeper, vendor, wholesale dealer, retailer, trader, hawker or salesman shall use plastic carry bags, plastic banners, plastic buntings, flex, plastic flags, plastic plates, plastic cups, plastic spoons, cling film and plastic sheets for spreading on dinning table, irrespective of thickness including the above items made of thermacol and plastic, which use plastic micro beeds”. The only exemption granted is for the export units, apart from the plastic used for milk and milk products and plant nurseries.\n\nIt should be noted that a sizeable part of the garbage generated in Bengaluru is that of used plastic, particularly the carry bags, and the blame squarely rests on the Bruhat Bengaluru Mahanagara Palike which has removed all wayside garbage bins. People are compelled to dump garbage in plastic bags on the roadside since in most residential areas the municipal sweepers refuse to pick up garbage. This has been identified as one of the major reasons for the roads of Bengaluru being littered with garbage.\n\nThe plastic ban in Karnataka is a step forward in the Swachh Bharat Abhiyan initiative, and it calls for a people’s movement to ensure a plastic-free environment. The State government has empowered a range of officials — that of the municipalities and several other departments — to enforce the ban, and it is imperative on them to exhibit their commitment.\n\n( The writer is Resident Representative, The Hindu Centre for Politics and Public Policy, Bengaluru )", 
    "section": "national", 
    "title": "Plastic ban, a bold initiative of Karnataka govt.", 
    "subsection": "general", 
    "date": "2016-03-20"
}