{
    "author": [], 
    "text": "Fresh snowfall in north Kashmir on Saturday hampered movement of people and vehicles.— PHOTO: NISSAR AHMAD\n\nHigher reaches of Kashmir including Gulmarg received snowfall for the third consecutive day on Saturday, while the plains remained largely dry after intermittent rains during the night, the MeT department said.\n\nFamous ski-resort of Gulmarg, in north Kashmir, were among the other areas which received fresh snowfall during the night. Three feet of snow was recorded since Friday, a Met department official said.\n\nSrinagar, summer capital of Jammu and Kashmir recorded a minimum temperature of 0.4 degrees Celsius. Pahalgam in south Kashmir received 39.8 mm of rains, while Kokernag town recorded 53.2 mm of rainfall.\n\nThe Jammu-Srinagar National Highway remained closed for traffic for the third consecutive day even as operations have started to clear the debris from landslides.\n\nMassive landslides\n\n“The Jammu-Srinagar NH, which was closed on Thursday due to massive landslides triggered by heavy rains at several places along the highway, continues to remain closed for the third consecutive day on Saturday,” SSP Traffic, National Highway, Sanjay Kotwal said.\n\nHe said around 600 vehicles, including 550 trucks, were stranded at different places on the 300-km long highway. “Some stranded passenger vehicles were cleared on Friday but around 550 Jammu-bound trucks and 50 passenger vehicles were still stranded at different places on the highway,” M.r Kotwal said.\n\nHe said with the improvement in the weather condition, the operation to clear the debris from the highway has started. But no movement of fresh vehicles would be allowed.\n\nMr. Kotwal said the Batote-Doda NH was also closed for traffic due to landslides at two places. — PTI\n\n600 vehicles, including 550 trucks, are\n\nstranded on the Jammu-Srinagar NH", 
    "section": "national", 
    "title": "Snowfall continues in Kashmir", 
    "subsection": "general", 
    "date": "2016-03-20"
}