{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Peoples Democratic Party (PDP) leader Muzaffar Hussain Baig, MP, on Saturday said the PDP-BJP alliance was still not “beyond repair” and “Mehbooba Mufti should trust the Centre if there are public assurances from top government functionary”.\n\nSpeaking exclusively to The Hindu from New Delhi, Mr. Baig said, “There seems some miscommunication or misplaced perceptions, which has made the deadlock absolute right now.”\n\n“I spoke to Ms. Mufti day before yesterday. The impression I got from Ms. Mehbooba was that she wants assurance from the competent governmental authority on certain items of the ‘Agenda of the Alliance’ be put on the fast track. She does not insist all should be done ahead of the government formation. If this position is conveyed to the BJP then the deadlock could be temporary,” said Mr. Baig.\n\nOn meeting being called off between Prime Minister Narendra Modi and Ms. Mufti, Mr. Baig feigned ignorance. “If one goes by [BJP national general secretary] Ram Madhav’s statement, there is an opening. What he has implied is that Mehbooba ji is posing some new conditions. In other words she is demanding something outside the Agenda of the Alliance. I think that is the impression Mr. Madhav got after meeting Ms. Mehbooba but it is misplaced,” Mr. Baig said.\n\nAmong the founding members of the PDP, Mr. Baig sees plausible the Centre’s preposition that the ‘Agenda of the alliance’ is for the government to implement. “The logical step would be to form the government and raise the issues with the Central government and request expediting the same,” he said.\n\nHe sees the real issue between the PDP and the BJP “just trust”. “Relations are all about trust. Trust ho tou nikah namay ki zaroorat nahi padti, trust na ho tou nikah nama bhi kisis kaam nahi ata ’ [If there is trust there is no need to have a Nikah paper, but if there is no trust no Nikah paper can help]. There seems mistrust and both the parties should sit down and settle that. They should not get entangled in trivial issues. The alliance will continue if there is trust on both sides, for that both the sides are equally responsible,” Mr. Baig told The Hindu .\n\nMr. Baigh sees positive signals from the BJP as “Union Finance Minister Arun Jaitely has categorically told to the PDP interlocutor that action will be taken on troop relocation. “Late Mufti Muhammad Sayeed never asked for troop relocation from strategic areas.”", 
    "section": "national", 
    "title": "The real issue between PDP and BJP is just trust: Baig", 
    "subsection": "general", 
    "date": "2016-03-20"
}