{
    "author": [
        "Staff Reporter"
    ], 
    "text": ": Some semblance of normalcy seems to be returning to JNU that has been caught up in a row since February over the organising of an event on Afzal Guru. On Saturday, a two-day annual Young Scholars’ Conference, which was being postponed due to the turmoil, was organised and Umar Khalid presented a paper.\n\nThe Centre for Historical Studies (CHS) had planned to organise the YSC between February 18 and 20, but the meet was postponed following the sequence of events that unfolded in JNU after the controversial February 9 event. “The conference was initially postponed till an indefinite time, but it was finally decided that it should be held on March 18. The theme for the conference this year was “constructing the past”, one of the organisers said.\n\nMr. Khalid, who is pursuing his PhD at the same department, presented a paper at the conference, titled “Changing Village Authority in the Adivasi Hinterland: State, Community and Contingencies of Rule in Singhbhum (1830-1893)”.\n\n“Mr, Khalid presented a paper and Anirban will have to start writing the last bit of his PhD. Because this is what we do in JNU. We study and we struggle. We fight in the streets, brave your water canons, and come back to debate mode of production (just as fiercely),” a student said.\n\nIn wake of the current row, there has been criticism of the varsity from various quarters who alleged that taxpayers’ money is being wasted at JNU and the students should focus on studies rather than politics.\n\n“People who keep criticising the students for wasting taxpayers’ money should attend these conferences and go through the kind of papers the students present. Immense amount of research is involved in the work that we do. It’s no joke,” a student added.", 
    "section": "national", 
    "title": "Umar presents paper at scholars’ meet at JNU", 
    "subsection": "general", 
    "date": "2016-03-20"
}