{
    "author": [
        "Petlee Peter"
    ], 
    "text": "In the video grab, Abdul Sattar Makandar from Karnataka is seen pleading tearfully for help to return to India from Saudi Arabia, where he is working as a driver.\n\nA video of a man weeping and narrating his plight as a driver in Saudi Arabia has gone viral on the internet with over one million views, after it was posted on March 12. The man has been identified as a native of Dandeli, Uttara Kannada district in Karnataka. He has been jailed by the Saudi police for allegedly posting the video.\n\nThe man in the video, Abdul Sattar Makandar (35), a native of Hasan Maad area in Dandeli, is seen pleading for help to return to India from the kingdom where he has worked since 2014 as a truck driver at a construction engineering firm in Al Khobar.\n\nAbdul says his employer of 23 months has not granted him leave, has not paid him regularly and is preventing him from leaving the country as his Iqama (work permit) and passport were in his possession. He claims he was forced to sign unknown documents. “Abdul sought help and sent me the video on March 12 and I posted it on Facebook in a bid to attract the attention of the Indian government to help bring him back,” Delhi-based social activist Kundan Srivastava told The Hindu .\n\nThe video of the weeping driver went viral on the internet last week and is being shared rapidly. Abdul’s plight made it to the headlines of The Huffington Post and the BBC World Service.\n\nAbdul was arrested by the Saudi police on Monday, apparently under a Saudi law prohibiting “spread of misinformation” on the internet, following a complaint by his employer. “On the same day, I received an email from Abdul’s employer demanding the online video be removed, and a fresh video be posted featuring the driver stating that his firm was his saviour. We complied with all the demands hoping that Abdul will be released and will return to India soon,” added Mr. Srivastava who also posted the damage control video on Thursday.\n\nBut in a dramatic twist of events, the driver was released from prison on Thursday afternoon only to be arrested again in the early hours of Friday. “From friends in Khobar city, I found out that Abdul is lodged in prison again and the charges against him remain uncertain,” said Akif Sheik, the driver’s friend.\n\nEmails and phone calls to Abdul’s office in Saudi Arabia didn’t receive any response.\n\nNoor Jahan, Abdul’s mother, was inconsolable when The Hindu contacted her on Saturday. “The last I spoke to him was five days ago, his friends informed me he is in prison,” said the elderly woman who stays with Abdul’s wife and four children.\n\nAttempts by The Hindu to contact the Ministry of External Affairs in Delhi failed.\n\nMakandar was released from prison on Thursday and arrested again on Friday", 
    "section": "national", 
    "title": "Video of weeping Indian goes viral, Saudi government jails him", 
    "subsection": "general", 
    "date": "2016-03-20"
}