{
    "author": [
        "Ennis S"
    ], 
    "text": "Workers from Odisha, Chhattisgarh made to work long hours in brick kiln\n\nIt was exploitation in every sense of the word at Sri Lakshmi Ganapathi brick kiln at Ponthavakkam village near here. Of the 564 labourers rescued on Wednesday and Thursday from the kiln, 173 of them are below 17 years of age and not even half of them were going to schools.\n\nThere is not a single rest room for these migrant labourers working at the kiln. The workers are forced to defecate in the open fields behind the kiln.\n\n“We were waiting to leave the place. But thankfully you arrived. He [the owner] was not even offering food as promised by the agent. We were forced to work for several hours and were not allowed to go home,” says K. Rana in his 30s.\n\nHis wife Roopa (name changed) animatedly explains the ordeal her family had to go through at the hands of the owner of the kiln. Speaking through a translator, she alleged that the owner did not give sufficient time to eat in between work.\n\nThe Hindu accompanied the team of government officials, led by Revenue Divisional Officer for Ponneri M. Narayanan, during the raid. “We have made arrangements for their stay in a mandapam. Once the victims are issued release certificates, they would be sent to their native places in Odisha and Chhattisgarh,” says the officer, who has personally led four such raids in his career so far.\n\nAccording to an accountant, who worked for the owner, the brick production season commences in January and lasts till June every year just before the rains in northern districts of Tamil Nadu.\n\n“There are two units in the kiln and we produce about 35 lakh to 40 lakh bricks every season. A brick is sold at Rs. 4 in the market,” explains ‘accountant’ Rajesh.\n\nThe wage rolls maintained in the kiln is a joke. While one of the supervisor claims the records were being maintained properly, the signatures and fingerprint entries seem to have taken from workers for various purposes.\n\n“For giving us painkilling injections, they used to take our fingerprint,” said Gayatri (name changed) pointing at the records. The explanation given by the supervisor managing the records to the RDO was not coherent when he was confronted with the versions of the workers. Some of the workers claimed they were asked to sign in the records for getting ‘insurance’.\n\nThe rescued labourers are expected to leave for their native place by Friday.\n\nAll from Odisha, Chhatisgarh were employed in a brick kiln", 
    "section": "national", 
    "title": "173 children among 564 labourers rescued", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}