{
    "author": [
        "R Srikanth"
    ], 
    "text": "Pallavan Transport Consultancy Services calls for tender for a Detailed Project Report\n\nThe Bus Rapid Transit System (BRTS) has begun to take shape, with the Pallavan Transport Consultancy Services (PTCS) calling for a tender for preparation of a Detailed Project Report (DPR). An official of the PTCS said a tender had been called for preparing a DPR to introducing BRTS in Chennai for which a feasibility study has already been carried out by the Institute for Transportation and Development Policy (ITDP). The Transport Department had commissioned the ITDP to carry out a BRTS feasibility study in 2011, the official added.\n\n“BRTS will connect unserved areas and will complement existing public transport modes, including Metro Rail, proposed monorail, MTC and suburban train network,” said an ITDP official.\n\nThe official said that there was a great need to improve public transport and at the same time reduce the use of private vehicles.\n\n“For this, BRTS is the most viable option as it is a dedicated bus lane separated from the general traffic. Facilities found at Metro Rail stations can be expected at BRTS stations,” said the official.\n\nThe tender proposal for DPR for implementing a BRT system in Chennai asks those participating in the tender to specify the requirements (Minimum Indicative) on road geometries, station infrastructure, bus bays, bus terminals, feeder routes, lane intersections, intersection redesign, pedestrian crossways, skywalks, passenger amenities, lightings and bus body building design requirements along with requisites for efficient BRT network services and facilities and suitable information technology and system applications required for operating it.\n\nThe tender also seeks integration with non-motorised transport (NMT) infrastructure, and other public transport modes, operation and maintenance systems, project management unit, institutional structure and suitable implementation strategy.\n\nAs per the ITDP recommendation of corridors covering Rajiv Gandhi Salai, Sardar Patel Road, GST Road, Koyambedu, Ambattur, Poonamalee and Madhavaram, a total of seven corridors have been proposed.\n\nThe seven corridors covers 96.70 kilometres and 121 stations have been identified.\n\nThe corridors are: Koyambedu to Poonamallee (14 km), Koyambedu to Ambattur (7.7 km), Koyambedu to Madhavaram (12.40 km), Saidapet to Siruseri (24.80 km), Saidapet to Tambaram (18.20 km), Thoraipakkam to Chromepet (10.60 km) and Koyambedu to Saidapet (9 km).\n\n(Additional reporting by Vivek Narayanan)", 
    "section": "national", 
    "title": "A head start for bus transit system project", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}