{
    "author": [
        "S Sundar"
    ], 
    "text": "They used ‘Whatsapp’ to organise the event without police knowledge\n\nMaking the best use of the social media, a group of youngsters from Madurai, Dindigul and Sivaganga districts pulled the wool over the eyes of police and organised ‘manju virattu’ on Madurai-Dindigul district border on Wednesday.\n\nA police constable sustained injuries when the irked group started pelting stones at the police personnel attached to Kottampatti police station limits.\n\nThe team of personnel from Kottampatti police station rushed to Vellinipatti village, bordering Dindigul district, on receiving information that some people were organising ‘manju virattu’ (chasing bulls to tame them in open field).\n\nEven as the police were enquiring about the conduct of the event with people of Vellinipatti, a few bulls entered the village from the foothills of Sathuragiri hills sharing borders with Dindigul and Madurai districts. Scores of people were seen chasing the bulls in their attempts to catch them.\n\nOn seeing the police personnel, the bull chasers reportedly turned violent and started pelting stones on them. A police constable, Palani (29), sustained bleeding injuries on his head. However, the mob did not allow other police personnel to rescue the injured colleague.\n\nLater, additional strength from Kottampatti police station, led by Inspector of Police Vijayakumar, reached the spot. The team arrested eight persons, including R. Nehru (23) of Natham, A. Sathyaraj of Velayuthampatti, S. Muthupandi (23 of Alagichipatti.\n\nThe police enquiry revealed that the youths had clandestinely organised the bull-taming event, already banned by the Supreme Court, by forming a closed user group in Whatsapp.\n\nWhile manju virattu was organised in the forest area near Ammapatti under Natham police station limits in Dindigul district, the bulls that were being chased ended up running into Vellinipatti village under Kottampatti police station limits.\n\nThe police have booked the accused under various Sections of the Indian Penal Code for rioting, hurting public servant with an intention to deter him from discharging his duties and attempt to murder, and also under the provisions of the Prevention of Cruelty to Animals Act, 1960.\n\nOn seeing police personnel, the bull chasers turned violent and pelted stones at them", 
    "section": "national", 
    "title": "Bull tamers defy ban, organise ‘manju virattu’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}