{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Krishnan, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.; Nagai Mukundan, Gangaikondam Mandapam, Triplicane, 7 p.m.\n\nRukmini Kalyanam: Navalpakkam Narasimhan, Mahalakshmi Welfare Association, 11, Park View St., R.A. Puram, 6.30 p.m.\n\nVivarana Prameya Sangraham: R. Manidravid, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nJadabharata Upakhyanam: N. Veezhinathan, Sri Anantha Padmanabhaswamy Temple, Adyar, 6.30 p.m.\n\nVivekanandarin Bhakti Yogam: Buddhidananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nVedanta Treatise: R. Aravindan, Narada Gana Sabha, T.T.K. Rd., Alwarpet, 6.45 p.m.\n\nCULTURE\n\nMadura Welcome: Presentation of Tamil Nadu Tourism Award 2015, Ambassador Pallava Hotel, 3 p.m.\n\nTamil Hindu.Com: Launch of publications, Saraswathi Association (Tinker Hall), Arms Rd., Kilpauk, 6 p.m.\n\nArtisan Nature Bazar: Inauguration of handicraft exhibition, Kalakshetra Foundation, Thiruvamiyur, 12.15 p.m.\n\nGENERAL\n\nSt. John’s Public School:\n\nLaunch and inauguration of SJPS- Astronomy Club, Jalladianpet, 5.30 p.m.\n\nTamil Nadu Teachers Education University: Convocation, Governor K. Rosaiah and Minister P. Palaniappan participate, Madras University Centenary Auditorium, Chepauk, Noon\n\nTamil Nadu Dr. Ambedkar Law University and School of Excellence in Law: Inauguration of 6{+t}{+h}K.R. Ramamani memorial taxation moot court competition, Greenways Rd., 6 p.m.\n\nPopulation First, UNFPA and Krishnaswamy Associates: Presentation of The Laadli Media and Advertising awards for Gender Sensitivity, Dr. MGR Janaki College of Arts and Science for Women, Durgabai Deshmukh Rd., R.A. Puram, 6.30 p.m.\n\nDepartment of Commerce – University of Madras: Inauguration of conference on ‘Innovative trends in Business Practices for Sustainable Development’, Hotel Savera, 10 a.m.\n\nValliammai Engineering College: Lectures on ‘Failure mode effect analysis’, 9 a.m. and ‘Security in computing’, Kattakulathur, 2.30 p.m.\n\nSaveetha Engineering College: College day 11 a.m. and cultural festival, Thandalam, 2.30 p.m.\n\nVelammal Engineering College: Foundation day, Surapet, 9.30 a.m.\n\nSMK Fomra Institute of Technology: Conference, Kelambakkam, 9 a.m.\n\nQueen Mary’s College: Lecture on ‘Mrs. Malathi Chandur’. Kamarajar Salai, Marina, 10.30 a.m.\n\nAsan Memorial College of Arts and Science: Distribution of ‘Asan Video awards’, Jaladampet, 9 a.m.\n\nRotary Club of Madras Mount and Senior Citizens Group of Besant Nagar: Free legal aid camp for elders, Haddows Club, Nungambakkam, 3 p.m.\n\nSivanthi Group of Educational Institutions: Silver jubilee celebrations, Ramapuram, 5.30 p.m.\n\nSacred Heart’s Nursery and Primary School: Annual day, Thuraiyur Nadar Hall, SRP Koil St., Agaram, 5 p.m.\n\nNarcotics Anonymous: Meeting, Sangarsh Group, Fatima Church, United India Colony, Kodambakkam, 7 p.m.\n\nAl-Anon: Meetings, Sinagaram Pillai Boys HSS., Villivakkam; A.G. Church, Sivagamipuram, Thiruvanmiyur; Madurai Siddha Ayurvedha Maruthuva Nilayam, Avadi; and CSI Emmanuel Church, Vadapalani; and Kevin School, Royapuram, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Kevin School, Royapuram; Singaram Pillai Boys HSS., Villivakkam, Kesari HSS., T. Nagar; C.S.I. Zion Church School, Chintadripet; Assembly of God’s Church, 100 ft. Rd., Arumbakkam; St. Fathima Church, Velachery Rd., East Tambaram; Magadalona Mariyal Church, Ezhil Nagar, Poonamallee; C.S.I. Peters Church, Vyasarpadi; A.G. Church, Sivagamipuram, Thiruvanmiyur; St. Soosai Church, Ennore; Madurai Siddha Ayurvedha Maruthuva Nilayam, Avadi; and Chennai Corporation Public Health Centre, Adambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}