{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As many as 8.4 lakh students across Tamil Nadu and Puducherry will begin their Class XII State Board Public Examinations from Friday. The students will be taking up their examinations in Part 1 language at over 2,400 centres across the State.\n\nIn Chennai, 51,091 students will be taking up the examinations comprising 27,607 girls and 23,484 boys.\n\nThe School Education Department has made arrangements for flying squads to visit examination centres as well as teams of officials from the Education Department to be deputed and supervise the conduct of the exams across the centres. As many as 368 officials have been put on duty for the same.\n\nWhile the duration of the exams are for 3 hours beginning from 10.15 a.m., students will be given their question papers at 10 a.m. and 10 minutes will be given for reading the question paper following which answer sheets will be distributed at 10.10 a.m.\n\nCandidates have been instructed by officials from the Education Department to verify their details which have been printed on the top sheet of the main answer book which will be given to them.\n\nIn a statement from Collector K. Govindaraj, students as well as private candidates have been prohibited from bringing mobile phones or any other communication devices to the examination halls. “No requests must be entertained by the invigilators or school authorities from the students if they hand over their mobile phones or other devices and ask for them to be safeguarded,” the statement read.\n\nPolitical leaders extended their wishes to students writing the Class XII examinations which begin on Friday as well as the SSLC Class X exams which begin on March 15.\n\nMDMK leader Vaiko wished the students to perform their best and cautioned political parties and other groups to avoid loud meetings and disturbances near the examination centres. DMK treasurer M.K. Stalin too encouraged the students to perform well and contribute to the progress of the country.", 
    "section": "national", 
    "title": "Class XII exams begin today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}