{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The recent crackdown on the Jawaharlal Nehru University (JNU), including the arrest of student union leader Kanhaiya Kumar by the BJP government, were only attempts to muzzle the voices of those who were against the idea of Hindu nation and Hindutva ideology, a cross-section of writers, artistes and journalists opined at a meeting here.\n\nSpeaking at a meeting, which discussed the ‘Attack on JNU and the question of Nationalism and Sedition’, organised by the Indian School of Social Sciences (ISSS) and the Tamil Nadu Progressive Writers and Artistes Association (TPWAA), N. Ram, Chairman of Kasturi & Sons Limited, said to reject Hinduism was not to reject nationalism.\n\n‘Not seditious’\n\nMr. Ram said Kanhaiya Kumar’s speech was only against the RSS and was not seditious. Referring to the speech of RSS leader Mohan Bhagwat, who said India was a Hindu nation, Mr. Ram asked, “What else is more anti-national than calling India a Hindu nation, while the country is a pluralistic society with people following different religions?”\n\nThe BJP government, headed by Prime Minister Narendra Modi at the Centre, was fast losing the confidence of the people and issues like JNU were only attempts by the party to divert attention of the public.\n\nThe RSS continued to control the course of the government, as Mr. Modi was himself a pracharak in the organisation at some point in his life, Mr. Ram observed.\n\nCiting a recent editorial in the noted journal Economic and Political Weekly and an article by jurist Fali Nariman in an English daily, Mr. Ram said Section 124 A of the Indian Penal Code (IPC) or known as sedition charge was originally crafted by the colonial government.\n\nTPWAA Honorary President Arunan wondered whether there was a need to retain Section 124 A. “We have to think whether do we really need to use the section which was originally framed during the colonial times? It is not suitable for a country which has become a Republic.” While JNU was one of the best 100 universities in the country, the actions of the BJP government against such an institution should be seen as an attack on the democratic voices in the country, said Gnanaguru, ISSS convenor.\n\nReferring to the incidents at Film Institute in Pune, IIT Madras, Central University in Hyderabad and the JNU, K. Kamalakannan of TPWAA said the BJP government was targeting all educational institutions that opposed its actions. TPWAA deputy general secretary R.T. Muthu said the actions of the BJP government were like the actions of the fascist governments and the Nazis of Germany.", 
    "section": "national", 
    "title": "‘Crackdown on JNU, a bid to muzzle dissent’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}