{
    "author": [
        "Staff Reporter"
    ], 
    "text": "From day one, this case has been politicised, says her brother Bhagyanathan\n\nS. Bhagyanathan, brother of Nalini Sriharan, met her in the Special Prison for Women, Vellore, on Thursday.— Photo: C. Venkatachalapathy\n\nNalini Sriharan, one of the life convicts in the Rajiv Gandhi assassination case, has appealed to the Congress and all parties opposing her release to look at her case from a humanitarian point of view and not politicise it, according to her brother S. Bhagyanathan.\n\nA day after the Tamil Nadu government wrote to the Centre seeking its views on releasing the seven life convicts, the Congress registered its opposition.\n\nAppealing to the Congress and all parties, Mr. Bhagyanathan, shortly after meeting Nalini in the Special Prison for Women in Vellore on Thursday said, “Do not see this case and the release of the seven persons as a political issue. A woman is living away from her daughter and has spent the last 25 years in prison. The Congress and all political parties should look at this case from a humanitarian point of view to reunite the woman with her child, and this is my sister’s request.”\n\nHe said they considered the State government’s letter to the Centre a continuation of its decision to release the seven persons. “We are expecting that the Centre would accept the State government’s recommendation. Last time, we were disappointed that the seven persons were not released,” Mr. Bhagyanathan said.\n\nNalini, he said, has appealed to the Centre to release her on humanitarian grounds, and also thanked the State government for sending the letter recommending their release.\n\nOn the timing of the letter with elections round the corner, Mr. Bhagyanathan said, “We do not see it like that. From day one, this case has been politicised. We do not want to become victims of a political game.”\n\nWhile he thanked political leaders who had voiced support for the release of the seven convicts, he urged those who opposed the release to take into consideration the fact that the seven had already spent 25 years in prison.\n\nLife imprisonment is for 14 years, but these persons have undergone double punishment, Mr. Bhagyanathan observed.\n\n“Not only my sister but also the others named in the case had no intention, motive and knowledge. But they have been punished on charges of harbouring and abetting the crime. They have undergone punishment for more than what they have been charged with,” Mr. Bhagyanathan said.\n\nOn why the State government was not considering release of the seven persons under Article 161 of the Constitution, he said it might be to avoid legal tangles.\n\n‘Life imprisonment is for 14 years, but these persons have undergone double punishment’", 
    "section": "national", 
    "title": "Don’t politicise release, appeals Nalini", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}