{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Bring traffic to a halt near the Assembly complex\n\nIn anticipation of the code of conduct for elections coming into effect any time, several people have been thronging the offices of Chief Minister and other Ministers at the Legislative Assembly complex these days with requests ranging from redressal of grievances to plea for temporary jobs.\n\nOn Thursday, traffic movement came to a halt on Victor Simone Street where the Assembly complex is located due to the huge crowd and vehicles parked on either of the road.\n\nThere is chaos on the corridor of power as there is no system or specially assigned personnel to streamline the crowds. Every time, the door of Chief Minister’s office opens, there is an attempt to surge into the room.\n\nA few women from a spinning unit at Mettupalayam have been waiting at the corridors since morning with a plea over non-payment of their salary.\n\nA group of engineering college students were in the earnest hope of getting financial assistance for their studies under the government scheme returned from the place with disappointment.\n\nA large number of people from rural areas have been waiting endlessly for getting free pattas and other assistance. Some of them were camping in Bharathi Park.\n\nPolitical functionaries were found roaming in an unusual manner around the government offices including the Legislative Complex, Public Works Department and Local Administration Department with bunch of papers .\n\nFor the last few days, Chief Minister N. Rangasamy’s office resembled an employment exchange with scores of youth flocking the premises apparently after word spread that temporary jobs are being provided.\n\nS. Vijay Babu, an engineering graduate came with his aunt and mother from Moolakulam and was waiting anxiously to meet the Chief Minister but had to return disappointed. He said, “We heard that vacancies were available in the Public Works Department but didn’t know the eligibility criteria. Our visit has been in vain.”\n\nHowever, things were different for several others as they managed to go inside the chamber of the Chief Minister and got a scribbling on piece of paper. Then they came out from the rear door of the chamber and proceeded to an adjacent room. There they got some tokens and were advised to go to the departments where they can get temporary employment.\n\nAn office-bearer of government employees’ association said taking a cue from previous government which appointed over 5,000 persons at the fag end of tenure, this government was also trying to sign out in a similar way. Under the previous regime, candidates were appointed as voucher staff and later they were made daily rated staff following protests or after joining AINRC. Even as they would get only 15 days of employment and a salary of Rs. 3,500 per month, many of the job seekers here have come with the hope of that their jobs would be regularised at a later stage, he added.\n\nR. Saravanan, president of Democratic Youth Federation of India said, “This office has been issuing backdoor appointments with an eye on polls. Several persons were appointed in this manner in the last one week at Amuthasurabi, Puducherry Distilleries, PONLAIT, Co-Operative Societies, KVK and Mother Theresa Research Institute.”", 
    "section": "national", 
    "title": "Employment seekers throng Chief Minister’s office", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}