{
    "author": [], 
    "text": "SALEM\n\nSri Ayyappan Bajanai Mandali Annadhana Trust: Mahasivarathri, natyanjali and upanyasam, bharathanatyam by Sridevi troupe of Sri Salangai School of Fine Arts, Sri Dharmasastha Ashramam, Town Railway Station Road, 5.30 p.m.; upanyasam on ‘Tiruneelakandar’ by Tiruchi Kalyanaraman, 7 p.m.\n\nPeriyar University: Village Adoption Scheme, Department of Sociology and Department of Textile and Apparel Designing, short term embroidery training programme for the SHG members, 10 a.m.; Department of Computer Science: workshop on ‘bio-data analytics’10 a.m. Department of Education of Periyar University and Padmavani Educational and Charitable Trust: National conference on ‘quality perspectives in teacher education’,\n\n10.15 a.m.\n\nJunior Jaycees Wing of the Periyar Institute of Management Studies: International Women’s Day, special training programme on ‘work-life balancing strategies’, 2 p.m.\n\nThiagarajar Polytechnic College and Sona College of Technology: Sona-Thiag Fiesta 2015-26, Tamil Manram, 3 p.m.\n\nSalem College of Engineering and Technology: NSS unit, road safety awareness rally, 10.30 a.m.\n\nSona School of Management: ‘Dhriti-16’ national level inter-collegiate management meet, 4.30 p.m.\n\nKnowledge Institute of Technology: Career Guidance Cell, signing of MoU and inauguration Competitive Exam Study Circle, 10 a.m.\n\nNAMAKKAL\n\nMahendra Engineering College: IEEE conference on ‘emerging devices and smart systems-2016’ sponsored by IEEE and EDS chapter,\n\n10 a.m.\n\nPaavai Engineering College: Department of Management Studies, ‘Assiduous-16’ national level management meet, 10 a.m.\n\nPaavai Arts and Science College for Women: NSS special camp, Government School, Kozhingipatti,\n\n11 a.m.\n\nTIRUCHENGODE\n\nPeriyar University: The Career Counselling and Placement Cell, “combined campus recruitment drive’’ in collaboration with Tata Consultancy Services–BPS, Chennai, Vivekanandha Arts and Science College for Women, 8.30 a.m.\n\nKSR Institute for Engineering and Technology: Department of Mechanical Engineering, Indian Council of Medical Research sponsored seminar on ‘recent development in prosthesis materials and its challenges in medical applications, sessions, 9.30 a.m. and 1.30 p.m.; valediction,\n\n2.30 p.m.\n\nKOMARAPALAYAM\n\nExcel College of Architecture and Planning: ‘Revive’ national level technical symposium, events and workshop, A. K. Natesan,\n\nChairman, presides, 9 a.m.; panel discussion, 5 p.m.\n\nExcel\n\nBusiness School: Department of Computer Application, ‘Vaganza 2k16’ national level technical symposium, paper presentation, poster design, debugging, quiz corner, connexion and zap, Velappar hall,\n\n9.30 a.m.\n\nRASIPURAM\n\nPeriyar University: The Career Counselling and Placement Cell, “combined campus recruitment drive’’ in collaboration with Tata Consultancy Services–BPS, Chennai, Muthayammal College of Arts and Science, 8.30 a.m.\n\nERODE\n\nErode Sengunthar Engineering College: NSS - Training on Communication and Soft Skills by District Revenue Officer R. Sathish, 9.30 a.m.; Blood Donation Camp by Lions Club of Erode Midtown, Erode, 9.30 a.m.; Students’ Knowledge Sharing Session on ‘Food Standards’, ‘Go Green Campaign’ and ‘Psychological Facts’, 4 p.m.\n\nNandha College of Technology: Inauguration of International Conference on Emerging Trends in Science, Engineering and Technology by Dato Dr. Sivalingam Nalliah, Professor, International Medical University, Malaysia, 9.30 a.m.\n\nCII - Yi Erode Chapter: Annual summit and session on ‘Role of Young Indians in Transforming the Nation’, Kongu Engineering College Convention Centre, 11 a.m.\n\nKongu Engineering College: Inauguration of ‘Training-cum-Workshop on Research in ELT and Applied Linguistics’, 9 a.m.; Nexus ‘16 - National-level Technical Symposium Mechatronics Engineering Association, 9.30 a.m.; Acumen 2K16 by ECE Department, 9 a.m.; INSTRROL 2K16 - Intra-Departmental Function by ISOI Students’ Chapter, 9 a.m.; DBT-sponsored National Seminar on 'Recent Trends and Challenges in Photochemistry and Biosorption,\n\n10 a.m.\n\nKongu Arts and Science College: College Day, 3.30 p.m.; Women's Day celebration, 10.30 a.m.\n\nBannari Amman Institute of Technology: National conference on ‘Recent Trends in Ubiquitous Computing and Communication’, 9 a.m.; National Safety Day, 9.30 a.m.; National Workshop on Modelling and Simulation Electro-Mechanical Device using Intellisuite 8.7, 9 a.m.\n\nEBET Group of Institutions: Sparks 2016 - Intra-Department Technical Treat, 11 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}