{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "On February 22, 1991, three golden and two panchaloha idols went missing from the Draupadi Amman temple in what is known as old Ennore Kuppam, located on the banks of Ennore Creek.\n\nWith the thieves covering their tracks adeptly, the villagers despaired of ever finding the idols again.\n\nHowever, 25 years later, on the same month and date, the villagers got a vital clue about who could have stolen these idols. These idols were — and still are — special to every family in Ennore Kuppam.\n\n“The three gold idols of Krishna, Radha and Rukmini were gifted by the Britishers to our ancestors who lived close to the temple,” says T. Rajendran, one of the village heads.\n\nThe Draupadi Amman temple is now located on the premises of the Ennore Thermal Power Station.\n\n“Until 1991, Ennore Kuppam was located where the thermal plant came up. However, we were given an alternative place and jobs as the power plant had to be constructed. We call this new place, which is a few kilometres from the thermal plant, Ennore Kuppam too,” says C. Deepan, another resident of the village. Every family at Ennore Kuppam is aware of the history of the three golden idols, as narrated to them by their ancestors.\n\n“During the British era, a ship carrying merchandise was passing by our hamlet and it stalled suddenly. Despite their best efforts, the crew could not get the ship moving,” says K. Nataraj, another village head.\n\nSeeing the temple, the Britishers realised there was a village and approached the fishermen for help.\n\n“As adept fishermen, who had worked with many boats, our ancestors tried to fix the ship, but were unsuccessful. They urged the Britishers to offer a prayer at the temple, which they did. The crew promised to give something to the temple if the ship moved, and in an hour, the fault was fixed. The Britishers rewarded our ancestors with three golden idols of Krishna, Radha and Rukmini. Nobody knows how they had those idols in their possession. From that day, over 300 families living in the hamlet started worshiping the idols. In February 1991, the idols were stolen,” says Srinivasan.\n\nOn Februrary 22, there was a clash between members of two families in which one person was stabbed.\n\n“We found out that the idols had been stolen by some members of those two families. We have now requested the police to take action against those who stole the idols,” adds Deepan.\n\nThe police are investigating.\n\nLast week, a breakthrough was achieved in the 25-year-old mystery of the missing idols of the Draupadi Amman temple in Ennore Kuppam.", 
    "section": "national", 
    "title": "Ennore Kuppam’s legend revisited", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}