{
    "author": [
        "K Lakshmi"
    ], 
    "text": "The postal department is gaining ground as a popular e-commerce delivery platform with more online retailers tying up with it to deliver parcels. From March, post offices will start delivering orders of major players like Flipkart and Naaptol too.\n\nAt present, the department has tied up with 143 e-commerce players, the major one being Amazon, for delivery of articles in Tamil Nadu. Of these, nearly 100 are from Chennai. Nearly 5,500 products ordered online either through prepaid or cash-on-delivery modes are being delivered daily.\n\n“We are now concentrating on faster delivery of articles on the same day and monitoring complaints for better delivery service,” said J.T. Venkateswarulu, Postmaster general (mails and business development) said.\n\nThe articles received at Ekkaduthangal warehouse and St.Thomas Mount Speed Post centre are despatched in three days. “Nearly 98 per cent of the products are now delivered directly on the same day to customers in the city. Instead of sending them through 65 delivery post offices in the city, these products are directly despatched from St. Thomas Mount. Flipkart is already delivering a few articles through post offices on a trial basis. It will start full-fledged operations in Chennai from March,” Mr.Venkateswarulu said.\n\nBesides small and medium retailers, institutions like Tamil Nadu Open University also use the service. The department earned Rs.8.7 crore through e-commerce initiatives last year. Chennai contributes to nearly 50 per cent of the revenue. Of the Rs.370 crore revenue targeted this year (January to December), post offices plan to earn Rs.15 crore through e-commerce in the State, officials said. “We are expecting business to increase by nearly Rs.2.5 crore a year once Flipkart and Naaptol start providing products for delivery,” he added.\n\nAt present, the department has tied up with 143 e-commerce players", 
    "section": "national", 
    "title": "Flipkart, Naaptol tie up with Postal Dept.", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}