{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "This structure, which is to be built at St. Thomas Mount, is aimed at integrating various rail lines; construction work to begin soon\n\nIn an attempt to integrate all forms of city-specific rail transport in the St. Thomas Mount region, Chennai Metro Rail has planned to build a foot-over-bridge linking St. Thomas Mount Metro Rail station to the suburban station located nearby. According to the plan for this Metro Rail station, MRTS facility (when it comes here) will be on one level and Metro Rail on the other.\n\nAccording to officials of Chennai Metro Rail Limited (CMRL), they will soon start work on the construction of this foot-over-bridge and complete it before commissioning of the station.\n\n“People from the suburbs who arrive at the St. Thomas Mount suburban station and want to go to Koyambedu can easily get to our station using the bridge there,” an official said.\n\nAfter the first service of Chennai Metro Rail — between Koyambedu and Alandur — was opened to the public in June last year, officials have planned to launch the extension of the service up to St. Thomas Mount in six months.\n\nAlso, they plan to launch the service between Little Mount and Chennai airport. Officials say that once these additional lines are commissioned, ridership may improve for Chennai Metro Rail.\n\nAt present, commuters say they struggle to walk up to the St. Thomas Mount suburban station from the Alandur Metro Rail station.\n\nVasuki Ravichandran, a 40-year-old commuter living in Meenambakkam near Chennai airport, struggles to walk all the way up to Alandur Metro Rail station from the St. Thomas Mount station. “It’s an exhausting 15-minute walk in the heat; at least, if there are good footpaths we can walk. But there is so much traffic that I’m quite scared to walk. If they connect the suburban station with the upcoming Metro Rail station at St. Thomas Mount, it will be convenient for people like me,” she added.", 
    "section": "national", 
    "title": "FOB to link Metro and suburban train networks", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}