{
    "author": [
        "Staff Reporter", 
        "M K"
    ], 
    "text": "Celebrate women power\n\nTalent shows such as cookery contest by Chef Damu, MOMO ramp walk season 2, magic show, Zumba Fitness, fun photo shoot, glass walk and rewards and recognition for women achievers will be part of the fun filled “Celebrate Women Power” International Women’s Day celebration organised at Hindustan College near Nava India on Avinashi Road on March 8.\n\nOrganised by Fusion Media and Entertainment, the day is packed with events for young women, homemakers, entrepreneurs, working women, students, celebrities and bureaucrats. Celebrity interface with Actor Srikanth and Vijay TV fame Kavin, Amith and Gopi Nair, business opportunity corner, shopping stalls, food court, refreshment corner and more events will be part of the event. For details, call 78110-44404 or 90920-71000.\n\nFree consultation camp\n\nA free consultation camp for women is organised at R.S. Puram Ladies Club at 36, Arokiaswamy Road West, from 9 a.m. to 1 p.m. on March 6. It is jointly organised by Sree Abirami Hospital and Rotary Coimbatore Heritage as part of the International Women’s Day celebrations.\n\nPatients suffering from hypertension, diabetes, anaemia, thyroid disease, arthritis, urinary track infections, menstrual disorders, polycystic ovary syndrome, abnormal uterine bleeding, fibroids, menopause, uterine prolapse, irregular periods, vaginal discharge and breast cancer can get free medical consultation and counselling. Consultations for IUI, IVF and ICSI will also be offered at the camp.\n\nIn addition to consultations and counselling by gynaecologists and fertility specialist, basic investigations and tests will be offered free of cost. For details or registration, call 73737-31059 or 98428-72972.\n\nFund raising\n\n“Say Cheese”, a fund raising event was organised by the School of Communication of G.R. Damodaran College of Science and Coimbatore Cancer Foundation (CCF) at the college on Tuesday. The concept of photo booth was to attract audience with fun and colourful accessories to get photographed. Funds collected from the initiative will be utilised for the children in palliative care at CCF.", 
    "section": "national", 
    "title": "For Page-2", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}