{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It was argued that they do not get personal income for their services\n\nThe Madras High Court Bench here on Thursday allowed a batch of writ petitions filed by various government-aided Christian educational institutions to exempt from payment of income tax the salaries paid towards services offered by nuns and priests appointed in teaching as well as non-teaching posts in colleges and schools run by dioceses and congregations.\n\nJustice B. Rajendran passed the order after accepting the submissions of advocate Isaac Mohanlal, representing the educational institutions, that it was unfair to deduct tax at source with respect to salaries handed over to dioceses and congregations, exempted from payment of tax, since nuns and priests do not receive any personal income for their services.\n\nThe judge held that tax could not be deducted at source from the amount paid by the government towards salaries if the nuns and priests were agreeable to given an undertaking individually that their monthly salary and all other monetary benefits arising out of their employment could be paid directly to the diocese or congregation with which they were associated.\n\nIn her affidavit, Sister Lilly Varghese, one of the writ petitioners before the court and secretary of Holy Cross College, Tiruchi, stated that her institution was one of the many educational institutions owned and administered by Congregation of the Sisters of the Cross of Chavanad, a society registered under the Tamil Nadu Societies Registration Act, 1964.\n\nClaiming that funds disbursed by the State government towards salaries of nuns serving in her college had been exempted from income tax for long, the secretary claimed that the Joint Director of Collegiate Education had begun insisting on deducting tax since November last on the basis of a communication received from Income Tax department on October 7.\n\n“Funds disbursed by government towards salaries had been exempted from income tax for long”", 
    "section": "national", 
    "title": "HC ruling on TDS for nuns and priests", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}