{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Researchers explore how music therapy can help people suffering from mental illness\n\nModern research into the therapeutic role of music is not only developing a whole new metrics for sensorial experience, but scientists are, in the process, also unwrapping deeper mysteries about the human brain.\n\nFrom the use of biomarkers and neurometrics to track changes in the brain induced by music to tapering down anti-depressants by complementing therapy with music, national and international experts weighed in on emerging perspectives in the use of music as medicine at the recent international conference on music therapy themed ‘Best Practised Model and Research in Music Therapy: Global Perspectives’ hosted by the Director, Centre for Music Therapy Education and Research (CYTER) Mahatma Gandhi Medical College and Research Institute, Sri Balaji Vidyapeeth.\n\nHow can we document change as a function of doing music in a therapeutic setting and how does it work?\n\nDealing with this theme, Jorg Fachner, Professor of Music, Health and the Brain at Anglia Ruskin University in Cambridge, UK, pointed out that biomarkers representing the effectiveness of the music therapy process are related to an accumulation of and a focus on important moments in therapy time. Analysing resting state EEG may inform about group effects, while moments of interest in the improvisational process may reveal synchronisation of brain processes. “In music therapy it may be an important key to understand where and why change in therapy occurs,” Prof. Fachner said.\n\nOn the role of music therapy in treatment of depression, he pointed out that activating brain circuits inducing pleasure raises expectations that the right music therapy intervention stirring up the emotions of the individual client at the right time, may reduce medication prescribed for mental health issues, as music can replace the drug's desired effects.\n\nCiting studies, where depressed clients were exposed to relaxation music, he said there were a number of examples that indicate hope that music could indeed be used as a decrement of medication. For example, research into treating chronic pain with music therapy indicates that music therapy is an effective adjuvant intervention for patients suffering from chronic non-malignant pain, doubling the effects of pharmacological treatment, he pointed out.\n\n“Our own research into the treatment of depression with music therapy indicates that a complementary interaction between improvisational music therapy and antidepressant medication may facilitate standard care,” Prof. Fachner said.\n\nGene Ann Behrens, Professor of Music and Director of the Music Therapy Program at Elizabethtown College, in Pennsylvania in the United States, was of the view that while safety and predictability were important to all therapeutic approaches, they are all the more crucial in trauma work and also lead to a third principle of cognitive behavioural therapy---the development of a strong therapeutic relationship. “In music therapy, the trust and a relationship must develop with both the music and therapist,” Dr. Behrens said.\n\nWhile the use of rituals, boundaries, and sequences are effective strategies that allow for greater exploration and creativity, the inherent qualities of music provide for time-ordered and reality-ordered experiences.\n\nDr. Sumathy Sundar, head of CYTER, said the ongoing projects include observing and recording the effect of music therapy on the foetus in vitro, patients in the operation theatres undergoing surgery under regional anaesthesia, colic babies and pre-operative anxiety levels of patients undergoing dermato-surgery procedures. There is also an MD thesis on the effect of music therapy on patients diagnosed of tinnitus, she added.\n\nProf. Suzanne Hanser, Chair, Berklee College of Music, Massachusetts, Boston, US, inaugurated the event online and hoped that it would help improve understanding of how western science and eastern traditions, ragas and mantras can come together to provide more effective music therapy services.\n\nSBV Vice Chancellor Prof. KR Sethuraman released the conference proceedings and Prof. N Ananthakrishnan, Dean, Research and PG Studies and Allied Health Sciences, launched the official bulletin \"The Harmony\".", 
    "section": "national", 
    "title": "Healing with the sound of music", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}