{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "CULTURE\n\nIsha: Yaksha – A celestial event of music, dance and spirit, Yoga Centre, Vellingiri Foothills, 6.30 p.m.\n\nGENERAL\n\nPark Institution: Launch of Free Tennis Coaching Academy for Women, Sania Mirza takes part, 10 a.m.\n\nSri Shakthi Institute of Engineering and Technology: Sania Mirza inaugurates synthetic tennis courts,\n\n10 a.m.\n\nAvinashilingam University: National Science Day Celebration, Thiruchitrambalam auditorium, 10.30 a.m.; Recent Trends in Spectroscopy Research in association SACSE of IGCAR, Administrative Block, 9.45 a.m.\n\nSri Ramakrishna Engineering College: Workshop on “Manufacturing excellence through 3D printing technology”, 9.30 a.m.; CSI Regional level student convention, 9.30 a.m.\n\nPSG College of Arts and Science: One-day National Seminar on Fashion and Apparel, 9.30 a.m.\n\nNew Century Book House: Release of books by D. Pandian, PSG Tech Assembly hall, 5 p.m.\n\nWorld Vision India: Awareness programme on Drug Addiction, Government Arts College, 3 p.m.\n\nKalaingar Karunanidhi Institute of Technology: National Workshop, 9.30 a.m.\n\nKarpagam College of Engineering: Design contest, JN Hall, 9.30 a.m.\n\nCoimbatore City Police and Friends of Police: Training programme on community policing, police quarters community hall, Uppilipalayam, 10 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Guest lecture on Management Guru, 9.30 a.m.\n\nSri Guru Institute of Technology: Guest lecture on Thermal Power Generation, Seminar Hall, 10 a.m.\n\nVLB Janaki Ammal College of Arts and Science: Seminar, 10 a.m.\n\nIndian Chamber of Commerce and Industry: Stakeholders consultation on IESS 2047,V-2.0, Corporation Commissioner K. Vijayakarthikeyan takes part, chamber towers, Avanashi Road, 5 p.m.\n\nSNS College of Technology: Project Contest and Talent Show,\n\n9.30 a.m.\n\nVivekananda Institute of Management Studies: Quiz Club and ED Cell Contest 2016, 9.45 a.m.\n\nPSG College of Arts and Science: National Seminar on Fashion and Apparel NSFA 2016, Library Hall, 9 a.m.\n\nSankara College of Science and Commerce: Guest lecture, 10 a.m.\n\nCoimbatore Institute of Management and Technology: Mega Marketing Mela “Sandhai – 2016”,\n\n9.30 a.m.\n\nNehru Arts and Science College: Thanks Giving Day, 10.30 a.m.\n\nPioneer College of Arts and Science: Gliterz National Conclave on Indian Financial Markets, 10 a.m.\n\nCODISSIA – SIDBI Industrial Services: Counselling and Guidance to entrepreneurs, CODISSIA Conference Hall, Huzur Road, 3 p.m.\n\nPOLLACHI\n\nSree Saraswathi Thiyagaraja College: HR Meet, 10 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}