{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Kandapuranam,’ Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: Discourse on ‘Tiruvilayadalpuranam,’ Tirukkalyana Mandapam, 5 p.m.; Abirami Anthathi parayanam, Meenakshi Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tirukkural,’ Meenakshi Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Avvai Kural,’ Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Yoga class, 6 a.m.; aarathi, New Natham Road, 6.30 p.m.\n\nPrajapitha Brahmakumaris Ishwariya Viswa Vidyalayam: Kedarnath Sivalinga darshan, 408 North Masi Street, 7 a.m. and 4 p.m.; Amarnath Linga darshan, Victoria Edward Hall, West Veli Street, 7 a.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m., 5.30 p.m.\n\nTamil Isai Sangam: 41{+s}{+t}annual Tamil music festival; vocal concert by Subashini Parthasarathy, 5.15 p.m.; Stage Creations’ play, ‘Whatsapp Vasu,’ Raja Muthiah Mandram, 6.45 p.m.\n\nGENERAL\n\nThe American College: Sudha Rani of St. Mary’s College, Thoothukudi, inaugurates Pegasus 2016, State-level inter-collegiate literary festival; M. Davamani Christober, Principal, presides, 9.30 a.m.; S. Michael Jerald, Deputy Commissioner of Income Tax, distributes prizes, Auditorium, 5.30 p.m.\n\nThiagarajar College: State-level seminar on ‘Diasporic dilemma in diatribe narration;’ T. Karunaharan, former Head, Department of English, St. John’s College, speaks, Tholkappiar Arangu, 9 a.m.; inauguration of NSS special camp; M. Eyini, Principal, presides, Government Higher Secondary School, P. Silaiman, 3 p.m.\n\nLady Doak College: Lecture-workshop on ‘Advances in biosciences;’ Durga Rao, Professor, Indian Institute of Science, and K. Dharmalingam, Research Director, Aravind Medical Research Foundation, address, 10 a.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, M. Arunagiri, Principal, presides, Kallampatti, 2.30 p.m.\n\nCSI College of Arts and Science for Women: NSS camp, Chettikulam, 10 a.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: 17{+t}{+h}College Day celebration; S. Malarvizhi, Sivaganga Collector, addresses, Poovanthi, 5.30 p.m.\n\nVickram College of Engineering: N. Sivasubramanian, former CGM, ISRO, inaugurates national seminar on ‘Recent trends in wireless and mobile technologies;’ M. K. S. Sreenivasan, chairman, Vickram group of institutions, presides, Enathi, 10 a.m.\n\nOAA MAVMM School of Management: S. Sridevi of CBI Training Academy speaks on “Campus to corporate,” 3.25 p.m.\n\nThangam Nursery and Primary School: 42{+n}{+d}Annual Day; T. K. Subramanian addresses, G. Revathi Subbulakshmi distributes prizes, K. S. Punnaivana Nadar Arangam, 4 A Mariamman Teppakulam West, 3 p.m.\n\nInstitute of Chartered Accountants of India: Installation of managing committee by H. Raja, chairman, Indian Railway Passengers’ Amenities Committee, Old Natham Road, 6 p.m.\n\nVoluntary Association for People Service: Training in agri-clinics and agri business centres; R. Muruga Prabhu, Lead District Manager, delivers valedictory address; V. Arul Arasu, Deputy Director of Agriculture, and P. Somesh Babu address; G. Pushpa, Dean, Home Science College and Research Institute, presides, 39 Besant Road, Chokkikulam, 11 a.m.\n\nMuzhakkam: Federation meeting, Pasupathi presides, Seelakkari Amman Marriage Hall, Chellampatti, 11 a.m.\n\nRotary Club of Madurai West: Discussion on ‘Union Budget,’ Fortune Pandiyan Hotel, 5.30 p.m.\n\nGiants Group of Madurai: M. Lakshmanan, deputy world chairman, speaks on ‘Union Budget;’ R. Lakshmi Narayanan on ‘Road safety,’ Hotel Rajadhane, Lake View Road, K.K. Nagar, 6.30 p.m.\n\nAlcoholics Anonymous: Meeting, RC School, Sivaganga Road, Melur, 6.30 p.m.; Parasakthi Nagar, Avaniapuram; CSI Church, Narimedu, and Maniammai Nursery School, North Masi Street, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}