{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The success formula of a farmers’ producer company explained to a team\n\nThe Agriculture Department in Punjab has planned to emulate the success of minor millet cultivation being adopted by Pudukottai Organic Farmers’ Producer Company. A group of officials from the Agriculture Department and Marketing wing of Punjab visited the producers’ company here and interacted with farmers and company’s executives on Wednesday.\n\nLed by P.S. Siddhu, Commissioner for Agriculture, Government of Punjab, the team ascertained the quality of various minor millets being raised by the company.\n\nExplaining the company’s achievements, A. Adhappan, managing director of the company, told the team that the conventional varieties of minor millets included ‘samai,’ ‘thinai,’ ‘kuthiraivali,’ ‘varagu’ and ‘cumbu’ – all with a duration of 90 to 100 days. About 4,000 acres had been brought under cultivation in four blocks. He said that the company comprised 52 groups of farmers with a strength of 1,023 farmers, including women, in Kundrandarkovil, Pudukottai, Annavasal and Arimalam blocks. The company netted a profit of Rs. 2 lakh since its inception a year ago.\n\nWhen Mr. Siddhu specifically wanted to know the formation of the company and its style of functioning, G. Akila, its chief executive officer, explained the norms for floating the company and support being extended by the State government.\n\nShe explained the profitability for these crops. The company had embarked on reviving conventional paddy varieties, she added.\n\nG.S. Dhanapathy, a progressive farmer and director of the company, said that the millets raised could withstand drought conditions. With Pudukottai district realising poor rainfall, the millets were suitable for the district.\n\nHe also explained the bio-manure being applied for raising these millets.\n\nThe team also inspected the machinery and other infrastructure set up by the company for crushing the millets.\n\nG.P.S. Randhawa, General Manager (Projects), Punjab State Agricultural Board, was among those who visited the company.", 
    "section": "national", 
    "title": "Millet cultivation: Punjab to follow Pudukottai model", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}