{
    "author": [
        "T Madhavan"
    ], 
    "text": "Actor John Abraham at the launch of Milan ‘16 at SRM University in Kattankulathur. -Photo: G.Krishnaswamy.\n\nMilan ’16, the annual national-level cultural and sports fest, where talents from colleges across India converge and compete, got off to a bright start with a couple of events and a grand gala inauguration on Thursday.\n\nThe 9th edition of ‘Milan '16 - Live The Change’ was inaugurated by actor-producer and former model John Abraham, who inspired the students with his words of advice in an inimitable style.\n\nHe began with a greeting - ‘Ellorukkkum Vanakkam’ - in Tamil, who wanted the students to concentrate on their studies and decide on the career thereafter. He reiterated that education was the strongest weapon everyone should aspire for, disclosing that being an MBA in Marketing helped him succeed in the film industry.\n\nThe 43-year old actor parried questions, which included ‘Do you have a girl friend,’ for which, he said, one should be beware of the level of friendship and urged them to treat the partner as the best friends.\n\nThe actor said that he was looking forward to the film ‘Rocky Handsome’ produced by him in which he is being co-starred by none other than Shruti Haasan. The film is expected to hit the screens this month end, the actor said.\n\nSRM University Chancellor T.R. Paarivendhar said the four-day fest served as a platform for student participants to exhibit their talent.\n\nDirector-Student Affairs P.K.A. Muniswaran said that Milan ’16 has a number of events with participants from across the country.\n\nSRM University Vice-Chancellor Prabir K Bagchi and Registrar N. Sethuraman were among others who participated in the inaugural session.\n\nStarted in 2008, Milan has graduated to its 9th edition with innovative and creative events. About 10,000 college students from all over India are expected to turn up for the festival. Wednesday’s events included an air show by students and a musical performance by ‘Thaikkudam Bridge’ from Kerala.", 
    "section": "national", 
    "title": "National talent hunt show off to rocking start", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}