{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "A fortnight ago nothing much was said about the 40th National Masters badminton championship, which began at the PSGCAS indoor courts here on Wednesday. The organisers preferred not to blow their trumpets. But today, the players, match officials and many others rate it as among the best in the country.\n\n“The organisers (State Association and Officers Club of Coimbatore) have set a standard and it is only going to go up from here,” said Punnaiah Choudhary, the Badminton Association of India (BAI) Secretary (tournaments).\n\n“I am very pleased. Everything is in place – from match schedules to safety aspects. It's a good sign for the sport,” he added.\n\nHe said the Masters event has grown several folds over the last six years. “India is the second largest country when it comes to player participation in World Masters. Also, the 2017 World Masters is scheduled at Kochi. So, the game is getting only bigger.”\n\nThe ongoing championship has attracted a record 1430 entries. “Conducting an event of this magnitude is a Herculean task but the organisers have managed it all with ease. The facilities here are very good and of great standards,” said Shishir Khare, the Match Controller of the championship.\n\nThe championship has attracted both India and international stars. And, they were glad that Coimbatore played the host.\n\n“One of the best thing to have happened is the venue. I don't think an eight-court venue is available in many places. I had been to Mumbai a couple of years ago for a similar event. It was well organised but was held in two venues,” said Ajith Haridas, former junior national champion from Tamil Nadu.\n\nHe said the players are taken care of. “Even nitty gritties are taken care of. That's because they were able to give ear to the suggestions given by the players,” quickly added P. Chandrasekar, former State champion.\n\nIf there is a record turn out it is because the event is organised by the players themselves. “It is just a precursor for more tournaments to come,” said Roy Mathew, former national champion.\n\n“I am playing this championship after a long gap but I am happy with the arrangement for the women players,” said Srividya Murali, former national player.\n\n“I have been playing nationals for the last six years but this is the best. I must give credit to the entire team. As the organisers are all players they were able to understand our requirements easily,” said Maran, vice-president, State Association. “We are happy that we have made it comfortable for all players. Our hard work has really paid. I must give the credit to the entire team,” said Swetha Krishnamurthy of Officers’ Club.", 
    "section": "national", 
    "title": "National Masters a big hit", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}