{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Three-day course under way at APCA for better understanding of the subject\n\nPrison officers take part in the 17th batch basic course at the Academy of Prisons and Correctional Administration in Vellore on Thursday.— Photo: C. Venkatachalapathy\n\nFor a better understanding of the healthcare needs of prisoners, prison medical officers from the five southern States are taking part in a three-day orientation course at the Academy of Prisons and Correctional Administration (APCA).\n\nThe course, which commenced on Thursday, aims to inform the officers about the significance of healthcare in prison settings and to impart information required to deal with prison-specific medical and health care challenges.\n\nBeulah Emmanuel, senior faculty and course coordinator, APCA said, 20 prison medical officers from Andhra Pradesh, Telangana, Karnataka, Kerala and Tamil Nadu were attending the course.\n\n“The first orientation course for prison medical officers was held in 2014, and this is the second one. They know the medical part, while the course will impart information on Indian prisons and prisoners’ behaviour,” she said.\n\nDoctors from medical institutions were handling a few sessions.\n\nSessions on Prisons in India –an over view of Supreme Court judgment and National Human Rights Commission guidelines on prisoners’ rights, role of medical officer in prisons, medical case studies and dealing with misuse of drugs by prisoners, dealing with problematic prisoners, dealing with communicable diseases in prisons, mental healthcare of prisoners, role of counselling in prisons and confronting medical emergencies are part of the course, a press release said.\n\nTwo more courses\n\nTwo more courses were inaugurated on Thursday – 17th batch basic course and three-day course on human rights in prison management. Eleven newly recruited assistant superintendents (grade I) from Kerala are attending the 17th batch of basic course that is for nine months.\n\nThirty-five prison officers in the ranks of assistant jailors to superintendent of Central jail are attending the human rights in prison management course. This was aimed at imparting knowledge on human rights instruments and their importance to institutions dealing with prisoners. Topics such as importance of human rights in prisons, human dignity, health rights of prisoners, prisoners’ contact with outside world and complaints and inspection procedures will be covered.\n\nB.J. Prashantham, director of Christian Counselling Centre, Vellore, inaugurated the courses. M.R. Ahmed, director of APCA was present.\n\nThe course will impart information on Indian prisons and prisoners’ behaviour", 
    "section": "national", 
    "title": "Officials get orientation on prisoners’ healthcare", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}