{
    "author": [
        "Staff Reporter"
    ], 
    "text": "City Union Bank roped in to launch the service\n\nThe urgent council meeting of the Vellore Corporation witnessed a number of empty seats as councillors belonging to the DMK stayed away from the proceedings on Thursday.— Photo: C. Venkatachalapathy\n\nResidents of Vellore Corporation can soon pay their taxes and other service charges through an e-payment system.\n\nSoftware has been developed for an integrated e-governance system for the 11 Corporations and 124 municipalities coming under the Commissionerate of Municipal Administration (CMA). This system was being implemented in a phased manner from September 2015.\n\nA payment gateway has been introduced to enable residents to pay their taxes, non-taxes and other charges to the Corporations/municipalities using credit card/debit card/Internet banking from any place.\n\nThis online facility for payment of taxes is now being extended to Vellore Corporation, and the City Union Bank has been selected for the purpose. As per the orders of the CMA, an agreement to this effect was entered into on February 22, 2016.\n\nThis was brought to the notice of the council through a resolution during an urgent meeting on Thursday. Officials said the online facility will be introduced shortly to enable residents to pay the taxes and other charges easily.\n\nMayor P. Karthiyayini informed the councillors that 21 water tanks will be constructed under the Atal Mission for Rejuvenation and Urban Transformation scheme.\n\nDMK protests\n\nThere were several empty seats on the opposition side of the council hall during the urgent council meeting. Nineteen councillors belonging to the DMK stayed away protesting short notice of the meeting.\n\nThe meeting was wrapped up in about 30 minutes after 70 resolutions were passed.\n\nAyub Khan, a DMK councillor, said they gheraoed the Corporation’s Commissioner demanding an explanation on how so many subjects could be taken up in an urgent meeting.\n\n“Usually, an urgent meeting would deal with only two or three subjects. This meeting had 69 subjects. Some of the councillors received the copy of the agenda close to 11 p.m. on Wednesday, some received it this morning, and a few did not get the copy at all,” he said. The councillors demanded that all the resolutions should be cancelled.", 
    "section": "national", 
    "title": "Online tax payment facility soon at Vellore Corporation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}