{
    "author": [
        "S Ganesan"
    ], 
    "text": "City police yet to announce traffic diversion to facilitate the work\n\nT.P. Poonachi, Minister for Khadi and Rural Industries, and R. Manoharan, Chief Whip in the State Assembly, inspecting the bridge work construction in Tiruvanaikoil in Tiruchi.— PHOTO: M. SRINATH\n\nConstruction of the new bridge across the railway track at Periyar Nagar on the Trunk Road in Tiruvanaikovil in the city is likely to be delayed as the district authorities are yet to arrive at a decision on diverting traffic to facilitate the construction of the bridge.\n\nThe Highways Department had approached the district administration seeking permission for traffic diversion to facilitate the construction of the bridge. The city police, who had announced traffic diversions from March 3 based on the request, subsequently deferred the move.\n\nThe new four-lane bridge will replace the existing narrow two-lane bridge that has turned a traffic bottleneck in Srirangam in recent years. The State government has sanctioned the project at an estimated cost of about Rs. 47 crore. The bridge was sanctioned a few years ago by the State government and in March 2014, the State Highways Department had commenced work on the construction of a subway and other minor bridges as part of the project.\n\nA limited use subway across the railway line and a few other components, including minor bridges across the Thirumanjana Cauvery and Kar Vaical, were to be built.\n\nThe Rail Vikas Nigam Limited, which was executing the track doubling work on the Villupuram-Dindigul section, is said to be ready to take up construction of the bridge portion above the railway tracks, the sources said.\n\nThe Highways Department took up construction of the subway first to ensure that vehicles passing through the busy road could be diverted through it. Ultimately, the subway will serve as the route for vehicles going towards Kumbakonathan Salai from Periyar Nagar. But the department had to suspend the construction of the subway during the monsoon because of the high water table and mud slides. Construction of the bridge was expected to be taken up on a full scale after the opening of the Odathurai bridge which allows traffic diversions. But the district authorities are dithering over enforcing traffic diversions because of the impending notification of the Assembly election.\n\nOn Thursday, Minister for Khadi and Village Industries T.P. Poonachi, R. Manoharan, Chief Whip in the State Assembly, and S. Valarmathi, Srirangam MLA, inspected the work. However, no decision on the traffic diversions was taken during the inspection.\n\nAn official release issued after the inspection merely said that currently preliminary work on the project was under way and the construction of the bridge would be completed within two years. There was no mention of when the traffic diversion would be enforced.\n\nSources said the work would go on a slow pace until the traffic diversions were enforced. Unless the traffic was diverted, the construction of the subway and major work on the bridge structure could not be taken up. Until then, work such as erecting test piles and other allied work would be taken up. The subway could be completed within a month if the traffic was diverted, sources said.\n\nThe existing narrow bridge at the site, which was to be dismantled to make way for a new bridge, had turned a traffic bottleneck in Srirangam in recent years.", 
    "section": "national", 
    "title": "Periyar Nagar bridge work to be on go-slow mode", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}