{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sanitary workers on contract petitioned the Vellore Corporation seeking prompt disbursement of salary every month, on Thursday.— Photo: C. Venkatachalapathy\n\nSanitary workers on contract have submitted a petition to officials of the Vellore Corporation seeking timely disbursal of salary every month. There are close to 1,000 sanitary workers engaged on contract basis in the Corporation.\n\nSubmitting a petition on behalf of the workers, J. Thulasiraman, Vellore city president of All India Scheduled Caste, Yuvajan Samaj, said as per labour laws, salary should be disbursed to workers on the 5th of every month.\n\n“Instead, the workers are being paid on the 27th of every month for nearly three years. We have submitted many petitions urging the Corporation for early disbursal of salary but nothing has been done till now,” he added.\n\nHe added that a wage of Rs. 271 per day has been fixed for the unskilled labourers.\n\nThere were four contractors for the four zones of the Corporation, and an additional contractor for engaging labourers in mosquito control measures. Nearly 75 per cent of the sanitary workers were women. The contract labourers have been working for the last three to eight years, he added.\n\nWhile an amount was deducted from their salaries as contribution towards Employees’ Provident Fund, the workers were not given the remittance slips. “The PF contribution slips should be given to the workers once in six months but they have not received details of the remittances so far,” he added.\n\nThe workers have been complaining that the contractors were not providing details of their PF accounts, including the numbers.\n\nSimilarly, photographs of workers and their family members were yet to be captured for coverage under the Employees’ State Insurance scheme, he said.", 
    "section": "national", 
    "title": "Sanitary workers seek salary on time", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}