{
    "author": [
        "K Manikandan"
    ], 
    "text": "With two new dedicated suburban rail lines by April, delays will be a thing of the past\n\nThe Rs. 30 crore project for the establishment of two dedicated suburban lines between Chennai Central (Moore Market Complex) and Basin Bridge stations will be completed next month, Southern Railway officials said.\n\nCompletion of this project will spell the end of agony for many commuters who get stranded near Basin Bridge during the morning rush hour, due to delays caused by the necessity of letting long-distance trains pass through first.\n\nWorkers are engaged in altering platform no. 12 at Moore Market Complex — the suburban rail head for the North East line, going to Arakkonam and Tiruttani and the North West line, to Gummidipoondi.\n\nA new platform next to platform no. 14 is also getting ready, while work is on to complete the two new lines.\n\nOf the sanctioned amount of Rs. 30.5 crore, only Rs. 2 crore was spent on the project till March last year. However, a chunk of the project amount — Rs. 19 crore — was released during the Railway Budget 2015-16, Southern Railway officials told The Hindu.\n\nWith the balance amount— Rs. 8.4 crore — released as this year’s outlay, work resumed at a brisk pace and will be completed by the end of April, they said.\n\nNo more delays\n\nThey said the one of the key benefits of the project is that trains will not be detained at Basin Bridge station to allow long-distance trains to pass through to Chennai Central station.\n\nOnce completed, the 2.2- kilometre-long line will ensure that the suburban trains enter MMC complex straight from Basin Bridge junction in a matter of minutes.\n\n“We get delayed every single day. We do not understand why no action was taken all these years,” said P. Sathyamurthy, a central government employee and a resident of Pattabhiram.\n\nLosing attendance\n\nAccording to him, many people travelling from northern and western areas of the city and suburbs even ended up losing a day’s attendance for turning up late for work regularly. “My superiors do not understand,” Mr. Sathyamurthy added.\n\nOfficials said that with electric multiple unit trains waiting at Basin Bridge for express trains to pass through from both directions, it resulted in services lining up one behind the other till Perambur.\n\nOver 4.5 lakh passengers travel in close to 180 services every day on the Chennai Central–Tiruvallur–Arakkonam suburan sector, officials added.", 
    "section": "national", 
    "title": "The wait may end at Basin Bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}