{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur : Theppam, Thayar purappadu from sanctum sanctorum, 5.30 p.m.; reaching theppam mandapam, 5.45 p.m.; theppam, 7 p.m.; purappadu from the theppam mandapam in pallakku, 9 p.m.; reaching sanctum sanctorum, 10.15 p.m.\n\nSri Srinivasa Perumal Temple, BHEL Township : Brahmotsavam, Surya prabhai, 6 a.m.; Chandra prabhai, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, Cauvery Thayar Sannidhi, Amma Mandapam, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, Valmiki Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology : Distinguished alumni award and young alumni achiever award, E.S.L. Narasimhan, Governor of Andhra Pradesh, chief guest, 9.45 a.m.; Department of Civil Engineering: Moments – symposium, 9 a.m.\n\nThe Booksellers and Publishers Association of South India: Book fair, Senthamarai Kannan, Inspector General of Police, inaugurates, Corporation grounds, Anna Nagar, Thennur, 6 p.m.\n\nSeethalakshmi Ramaswami College Department of Chemistry : Lecture workshop on recent trends in chemistry, M.Jayanthi, principal, delivers key note address, 9.45 a.m.\n\nCauvery College of Engineering and Technology: Women’s Day celebration, Dr.Lakshmiprabha speaks on Polycystic ovarian disease and endometriosis, 2.30 p.m.\n\nRajiv Gandhi National Institute of Youth Development and Shrimathi Indira Gandhi College : Valediction of training programme on health and healthy life style, K.Meena, former vice chancellor, Bharathidasan University, distributes certificates, 3.15 p.m.\n\nBishop Heber College English Literary Association : Lit Hit 2016 – literary festival, Cartherin Edward, vice principal, Holy Cross College, inaugurates, 8 a.m.\n\nPeriyar E.V.R.College Department of Visual Communication: First step – seminar on ‘Film makers – the change makers,’ S.Nagarathinam, Head, Department of Communication, Madurai Kamaraj University, delivers key note address, 10.15 a.m.; Department of Economics: Lecture on Application of econometrics tools in social science research by A.Saravana Durai, assistant professor, Periyar University, 10.30 a.m.\n\nSri Sivananda Balalaya: Bala Vigyan Utsav, intra-school quiz on Indian bio diversity by A.Daisy Caroline Mary, assistant professor, Bishop Heber College, Adavathur campus, 10.30 a.m.\n\nNehru Memorial College, Puthanampatti : Inauguration of Science Academies lecture workshop on New frontiers in plant sciences and bio technology, 10 a.m.\n\nM.A.M.B. School : Rakesh Raman of National Stock Exchange speaks on Recent developments in capital market, 2 p.m.\n\nEntrepreneurship Development Institute of India, Periyar E.V.R.College and Tiruchi District Tiny and Small Scale Industries Association : Entrepreneurship awareness camp, Ramasami Desai,project director, CR Business Solutions, speaks, college campus, 9.30 a.m.\n\nM.A.M.College of Engineering and Technology Department of Electrical and Electronics Engineering: Trigger 2016 – intra-college mini project contest, M.A.Maluk Mohamed, director, presides, 9.30 a.m.\n\nKongunadu College of Engineering and Technology : Seminar on SCALA, 5.30 p.m.\n\nNational College : Annual sports meet, Sanjay Mathur, City Police Commissioner, chief guest, 4 p.m.\n\nBharathidasan University Student Computer Association: Kashatriya 2016 – technical symposium, N.K.Senthamarai Kannan, Inspector General of Police, Central Region, inaugurates, Khajamalai campus, 10 a.m.\n\nHallmark Business School : Investor awareness programme, Rakesh of NSE speaks on Recent developments in capital market, 11.30 a.m.\n\nM.A.M.College of Engineering and Technology : Adolescent health awareness programme for women, Dr.Poongkothai Senthilvel speaks, 11 a.m.\n\nBishop Heber College Department of Social Work : Awareness programme on ‘good touch and bad touch,’ Roja Tuition Centre, Rettai Vaical, 5 p.m.\n\nMohamed Abdul Kader Educational and Development Trust : S.M.Suriya Kumar speaks on Union Budget, St.Paul’s Complex, 5 p.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram : Inauguration of English club, Sivanandhan, soft skills trainer, chief guest, 9.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}