{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "BJP leaders feel they should focus on campaign\n\nA day after unconfirmed reports emerged about a possible electoral deal between the DMK and the DMDK, senior BJP leader and Union Environment Minister Prakash Javadekar made an impromptu visit to Chennai, ostensibly to meet DMDK leader Vijayakant and convince him to remain in the NDA. However, Mr. Javadekar had to leave the city in the evening as Vijayakant had quietly left for his constituency in Villupuram district.\n\nVijayakant further kept everyone guessing on his next electoral move by telling his cadres at a party function in Thirukovilur that reports of him sealing an alliance for the Assembly polls were mere speculation. Insisting that he has not taken any decision on forging an alliance, the actor-turned-politician said he would inform them and the media when things materialise. He said accusations that he was bargaining with political parties were baseless.\n\nMeanwhile, sources said while the Tamil Nadu BJP seemingly suggested that talks be suspended for a while till the DMDK opened channels again, Mr. Javadekar landed in Chennai around 11 am without intimation. Almost none in the State BJP seemed to be aware of the visit; while the party’s state unit president Tamilisai Soundararajan was in Tirupathi, other frontline leaders including Union Minister Pon. Radhakrishnan were attending a meeting at Kamalalayam, the party’s state headquarters.\n\nWhile news spread that Mr. Javadekar might head to Mr. Vijayakant’s residence in the afternoon, the DMDK leader chose to leave for his constituency in Villupuram. His wife Premalatha then told a television channel that no alliance talks took place, though some in the BJP claimed Mr. Javadekar had indeed met Ms. Premalatha.\n\nLater, Mr. Javadekar proceeded to attend an event at the Anna University’s National Centre for Sustainable Coastal Management, funded by the Union Environment Ministry, before leaving for New Delhi on a 5.30 p.m. flight. A top official of the University confirmed that the visit was unscheduled. “He asked us to make a presentation on what the Centre has done so far. Both the Vice Chancellor and the Registrar were away when he arrived in the afternoon at 2.30 pm,” said the official.\n\nA BJP state unit vice-president opined that the DMDK certainly looked like it was drifting away from the NDA. “If they had any intention of being part of the alliance, they would have surely made efforts to meet Mr. Javadekar openly. Many of us now feel it is time to start focussing on our election campaign than spending energy on these talks,” the leader added. However, there was still hope in the alliance working out since the DMDK had not struck a deal either with the DMK or the People’s Welfare Front.\n\nIn fact, speaking to reporters on Wednesday night on a possible deal with Mr. Vijayakant, DMK treasurer M.K. Stalin quipped that the media should tell him where the information came from so that he would also know. “I have already said if the DMDK chooses the DMK front, we would be happy,” he added.\n\n(Additional reporting by R. Sujatha in Chennai and S Prasad in Villupuram)", 
    "section": "national", 
    "title": "Vijayakant avoids Javadekar, says no decision on deal yet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}