{
    "author": [
        "Special Correspondent"
    ], 
    "text": "ECI has proposed to introduce this system in the district on a pilot basis\n\nFOR FOOLPROOF POLLS:Voter Verifiable Paper Audit Trail units being unloaded from a truck at Tamil Nadu Civil Supplies Corporation’s godown at Sripuram in Tirunelveli on Thursday.— Photo: A. Shaikmohideen\n\nThe district received 386 Voter Verifiable Paper Auditor Trail (VVPAT) units on Thursday as Election Commission of India has proposed to introduce this system in Tirunelveli Assembly constituency on a ‘pilot basis’ during the forthcoming Assembly elections.\n\nCollector M. Karunakaran received the VVPAT units, brought from Bihar, which will be introduced in Tirunelveli Assembly segment to serve as an independent verification system for voting machines.\n\nTechnicians now calibrating the EVMs explained in detail the functioning of VVPAT units to the Collector.\n\nThe VVPAT units, along with the EVMs received so far, have been kept at Tamil Nadu Civil Supplies Corporation’s godown at Sripuram.\n\nThe VVPAT units will be attached to the EVMs and will generate slips like the receipts being generated at the ATMs. Once the voter presses the button of his or her choice, a slip will be generated to indicate the vote that has been actually cast by the EVM.\n\nThe slip will be displayed behind a glass case for seven seconds, and the voter will be able to confirm if the vote has been cast in support of the candidate of his or her choice. After seven seconds, the slip will automatically fall into a sealed chamber.\n\nIf the voter alleges that the vote has not been cast in favour of his candidate, he can register a complaint to the presiding officer, who in the presence of others in the particular booth, will cast three trial votes of a particular choice to verify the allegation.\n\nIf the complaint is genuine, the EVM concerned will be sealed and seized immediately. If the complaint is found to be false, criminal complaint will be registered immediately against the complainant.", 
    "section": "national", 
    "title": "Voter Verifiable Paper Auditor Trail units brought to Nellai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-04"
}