{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "At a time when the Marutis, Hyundais Toyotas, Volvos and the Audis rule the road, a fleet of Ambassador cars, all decked up in carnival finery, took the people of Coimbatore by surprise even as they screeched to a halt at The Residency Towers here on Wednesday night.\n\nThere were 36 cars and each one of them looked as if they were in a fancy dress competition.\n\nSome were painted colourfully, others had leaves and flowers strung on them and yet some others had lipstick marks and hearts all over. The cars had names such as Road Ninja, The Baggy Greens, Pappa Don, Raging Horn, Indian Drifter, Bollyhood to name a few. Interestingly, they were all driven by foreigners who are on a mission to spread awareness on cancer.\n\nCharity\n\n“It’s a charity drive by the Teenage Cancer Trust (TCT), which is based in United Kingdom. The Trust aims to look after young people (13-24 age group) with cancer,” said David Shaw, TCT’s Deputy Director of Services.\n\nHe said there are about 2500 people diagnosed with cancer every year.\n\n\"We want to tell them we care for them and will also be with them.”\n\n“It’s not a holiday tour but a drive for cancer’s sake. We aim to collect about 60,000 pounds towards this through our adventure drive,” said Peter Lowes, Facilities Manager of the TCT.\n\nThe Rally titled ‘Dumball It’s a Goa!' started from Chennai on January 10 and will travel through Southern parts of the country before culminating at Goa for an actual holiday bash.\n\n“It's an eight-day tour with different stopovers. We travel at an average of 10 hours a day and we are really enjoying it. The Indians are so friendly but the traffic volume and the sound of horns is something that cannot be explained. They honk all the time,” said Jared Carr and Mick McCaine another member of the group agreed.\n\nThe Residency Towers was happy to associate with Dumball 2016.\n\n“We have extended our best services so that more tour companies are able to engage in similar tours with a cause,” said Erine Louis, its General Manager.", 
    "section": "national", 
    "title": "A Goan trip with a goal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}