{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "A musical drama, “Shri Thyagarajar,” a tribute to Tyagabrahmam presented by T.V. Varadarajan, turned out to be a unique offering at the anniversary celebration of Sri Sathguru Sangeetha Samajam in Madurai. Varadarajan used the most appropriate kritis under the music direction of ‘Bombay’ Jayashree, identified authentic costumes and discussed some concepts from the ‘namasankeertanam’ expert Sri Udayalur Swami and went on to record the voices of many singers, including Jayashree, ‘Cherthalai’ Ranganatha Sharma and O.S.Arun. Shobana Ravi’s voiceover introduced the play.\n\nTyagaraja’s character is discussed by Narada and Rama who wants the composer to lighten the burdensome lives of people in Kaliyuga through ‘namasankeertanam.’ The choice of Tyagaraja to live on alms rather than monetise his knowledge creates tension in his family. The play highlights the various highs and lows in the lives of the composer, leading to musical outbursts.\n\nApart from the title song written by Piraisoodan, many kritis such as ‘Jagadanandakaraka,’ ‘Shantamu lekha,’ ‘Manasuloni,’ ‘Ma Janaki,’ ‘Sabhapathikku,’ ‘Ramanee Samanamevaro,’ ‘Nithi Chaala,’ ‘Ramabhakthi’ were some of the songs that were played in the background of key scenes from the life of Tyagaraja.Actor Varadarajan played the role with maturity and attempted to recreate the genius of Tyagaraja as a singer, composer and a saintly human being. The other main characters — Tyagaraja’s devoted wife, feisty daughter, his worldly brother and his wife — all played their parts well. The coordinated effort of stalwarts from different fields made the play a unique combination of Iyal, Isai and Nadakam.\n\nRAJALAKSHMI PADMANABHAN", 
    "section": "national", 
    "title": "A tribute to Tyagaraja", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}