{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Descendants of Parasara Bhattar have justified the practice of carrying them in palanquins on special occasions as an honour for reciting hymns in praise of Lord Ranganathar in Srirangam temple and claimed that it was absurd to term the practice one against human rights.\n\nIn a counter affidavit filed before a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran in the Madras High Court Bench here, Parasara Azhagiasinga Bhattar and Parasara Renganatha Bhattar opposed two public interest litigation petitions filed against the practice.\n\nAccording to them, the annual 21-day Adhyayanothsava festival of Paghalpathu, Irappathu and Iyarpa was being celebrated during the Tamil months of Karthigai and Margazhi in Sri Ranganathaswamy Temple since time immemorial.\n\nThe festival connoted the recognition of ‘Divya Prabhandam’, also known as ‘Dravida Vedam’, as equivalent to the Sanskrit Vedas.\n\n‘Naalayira Divya Prabhandam’ was sung with Thalam during the festival by the Arayar family as ordained by Acharyar Nathamuni who was historically accepted to have codified the Prabhandam. Similarly, select verses of Vedas were recited by the Bhattar family. “In recognition of their laudable services, emoluments and honours attached to the said service are in vogue… The prized and valued honour, cap of all, is the Brahmaratha Mariyadhai (palanquin travel) conferred on the concluding day of the festival,” the Bhattars said.\n\nClaiming that Parasara Bhattar had been recognised by Ramanujar as his successor to the Vaishnavite sect, the signatories of the counter affidavit said that according to a legend Parasara Bhattar authored Kaisika Puranam and recited it before Lord Vishnu.\n\n“It is a belief… that… as a honour of such a wonderful recitation, the Lord had ordered the temple maniyakara (supervisor) to take Sri Parasara Bhattar to his house with full respects,” the Bhattars said.\n\nDenying the PIL petitioners’ claim that the Bhattars were being carried in a palanquin even inside the temple, the latter said that such a claim was being made due to ignorance of Agamas which stated that a temple began only after the flag mast.\n\nHowever, conceding that there were many sub-temples on the way to their houses from the temple, the Bhattars said that due respect and devotion were exhibited by the Bhattars by lowering the palanquin to ground level while crossing those sub-temples.\n\n“It is only the willing and devoted disciples of the Bhattar family who carry the palanquin. They consider it their duty and a pride to get the benediction of their guru and not as an act of servility,” they added.\n\nAfter taking the counter affidavit on file, the judges posted the case for hearing to Monday.", 
    "section": "national", 
    "title": "Bhattars defend practice of carrying them in palanquins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}