{
    "author": [
        "S Prasad"
    ], 
    "text": "Sustained awareness campaigns during Bhogi celebrations over the last few years have registered a significant reduction in pollution levels in the city in the current year.\n\nThe concentration of particulate matter was much lower when compared with the previous years due to lesser number of bonfires lit by residents in the city on Thursday as per initial analysis.\n\nThe PPCC has been regularly monitoring air pollution during Bhogi and the awareness levels have increased leading to less pollution.\n\nThe PPCC along with non-governmental organisations propagated the message of controlling air pollution during Bhogi by asking people not to burn tyres, plastics and rubber.\n\nThe burning of tyres, plastics and unwanted household articles, let out noxious gases including carbon monoxide, dioxins and particulate matter.\n\nThe exposure to such materials caused irritation of eyes, nose, throat, skin, respiratory diseases such as asthma, bronchitis and other health disorders.\n\n“The air pollution levels and concentration of particulate matter was monitored at three locations in the city on a normal day (day before Bhogi) and during the celebrations. The samples will be collected over a period of 24 hours at Anna Nagar, Mettupalayam and Ambour Salai and will be sent for analysis. The air pollution readings will be compared with the readings on a normal day,” Dr. N. Ramesh, Environmental Engineer, Department of Science, Technology and Environment told The Hindu .\n\nLast year reading\n\nLast year, the concentration of particulate matter was found to be higher on Bhogi. As per the report the concentration of Particulate matter (105g/m3) was higher than the prescribed standard limit (100g/m3).\n\nHowever, the concentration of particulate matter had decreased by 6.3 per cent when compared with the results of 2014. The concentration of gases such as sulphur dioxide and nitrogen oxide was found to be within the prescribed standard limit, Mr. Ramesh said.\n\nConcentration of particulate matter has decreased by 6.3 per cent", 
    "section": "national", 
    "title": "Campaigns reduce Bhogi pollution", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}