{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Vegetable prices shoot up by 20 to 30 per cent\n\nThe customers were in for a shock when they ventured out to buy sugarcane at Gandhi Market in Tiruchi on Thursday as the prices had shot up by up to 30 per cent. — PHOTO: A. MURALITHARAN\n\nCelebrating “Pongal” festival this year has proved to be dearer, with prices of sugarcane, vegetables, and turmeric bunches shooting up.\n\nThe edible variety of sugarcane is an essential part of the festival and the demand has peaked. Apart from whole sale traders in the Gandhi Market, a large number of vendors had set up at every lane and by-lane in various parts of the city.\n\nThe produce cultivated in Tirukattupalli was much sought-after among members of the public, though it is a bit dearer.\n\nR. Murugan, a vendor at Khajapet in Sangiliyandapuram, said he had invested Rs. 24,000-Rs. 21,000 towards the cane and Rs. 3,000 for expenditure for transit by carriage van from Tirukattupalli to the city to purchase 1,000 canes. “Thus my investment on a single cane is Rs. 24 and I sell it for Rs. 30,” he says.\n\nAs compared to last year’s rates, the price had shot up by Rs. 10 a cane. Mr. Murugan says the rise in price was because of inclusion of sugarcane as one of the ‘Pongal’ gift in the State government’s package.\n\nAnother dealer from Iluppur C. Vendan says he had to invest Rs. 16,000 this year against Rs. 10,000 last year to buy the sugarcane. He had brought the cane from Andakulam in Pudukottai district and has set up his sales units in four centres in the city.\n\n“The sudden spurt in the price has come as a shock for the customers who make a hard bargain,” he said.\n\nStiff competition\n\nBoth Mr. Murugan and Mr. Vendan say they face stiff competition from the new entrants. “I have utilised my experience in selling eateries near a school, for marketing the sugarcane,” he says.\n\nTraders say although the sale would continue for three more days, it was during the “Bhogi” and “Pongal” festival they can realise maximum sales.\n\nThe prices of vegetables shot up by 20 to 30 per cent over the usual rates. Traders said that bulk and simultaneous demand for horticultural crops particularly vegetables and flowers would register an increase with the dawn of ‘Thai’ month. The price per kg of carrot, tomato, potato, and beans had shot by at least Rs. 10.\n\nThere was a scramble for turmeric bunches. The price which stood at Rs. 10 a bunch in the morning shot up to Rs. 20 a couple of hours later.", 
    "section": "national", 
    "title": "Cane prices flare up for Pongal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}