{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Addressing the needs of small vendors and the Micro, Small and Medium Enterprises (MSME) sector, which suffered losses during the recent floods, Chief Minister Jayalalithaa on Thursday announced a slew of financial measures for them.\n\nWhile the vendors and small-time shop owners would receive an interest-free loan of up to Rs. 5,000 each, entrepreneurs in the MSME sector would get special concessions in repaying loans.\n\nThe State government ordered to grant a loan of up to Rs. five lakh to unemployed youth in flood-affected districts with a subsidy component of 25 per cent in the capital, even if they had not received the mandatory training.\n\nFollowing representations from various quarters, the Chief Minister also waived the cost of replacing damaged electricity metres for industries in MSME sector.\n\n“The government would incur the expense to replace the damaged metres,” Ms. Jayalalithaa said in a statement.\n\nAs for industries that received funds from the Tamil Nadu Industries Investment Corporation (TIIC), which were affected by recent floods, the State government has announced a moratorium between one and two years for repaying the capital.\n\nThe industries would be granted temporary loans to help them repay the loans for six months and would be sanctioned additional loans restore machinery and infrastructure.\n\n“I have also ordered to restore the infrastructure in industrial estates under SIDCO at a cost of Rs. 25 crore,” Ms. Jayalalithaa added.\n\nSince those running small shops selling flowers, fruits, vegetables who suffered loss during the floods “had to seek loans for higher interest from private parties,” she ordered to implement a scheme to protect their livelihood.\n\n“No interest would be collected for these loans up to Rs. 5,000. The State government would pay the 11 per cent interest to these cooperative banks. Those affected in the floods, have to repay the loans within 25 weeks with Rs. 200 every week,” she said.\n\nBeneficiaries of the scheme would be identified during 10-day camps to be conducted by the cooperative banks and those repaying the loan on time would be granted another loan of the same amount at an interest rate of four per cent.\n\nThe Chief Minister had on Wednesday chaired a meeting in which she held discussions with ministers and senior officials on granting interest-free loans to small shops, affected in the recent floods.\n\nEntrepreneurs in the MSME sector will get special concessions in repaying loans", 
    "section": "national", 
    "title": "CM announces relief for flood-hit MSMEs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}