{
    "author": [
        "R Rajaram"
    ], 
    "text": "140 convicts were granted emergency leave to be with their families\n\nInmates of Tiruchi Central Prison leaving for their respective homes on Thursday to celebrate Pongal after being granted emergency leave.\n\nFor a select group of 140 convicts lodged in the Tiruchi Central Prison, the Pongal festivities will truly be a memorable one.\n\nIt will be happy reunion with their family members, albeit for a limited number of days to celebrate the festival.\n\nA festive atmosphere permeated the sprawling jail complex on Thursday morning as delighted prisoners stepped out to celebrate Pongal with their kin at their homes. They were granted emergency leave by the prison authorities.\n\nThe emergency leave was granted to 140 convicts with a majority of them being lifers, Superintendent of Prison, Tiruchi, A. Murugesan told The Hindu . The emergency leave was granted to them upon obtaining report from the Probation Officers concerned after the convicts applied for it sometime ago. The convicts were serving life sentence for having committed murder. Most of the convicts granted emergency leave belong to different districts in the central zone.\n\nFour among them are senior citizens. A majority of the convicts who were granted leave had spent over 10 years in the jail. The convicts had been given six days to return to the Central Prison, Mr. Murugesan said.\n\nThe prisoners were not sent empty handed. Each one of them was given gifts in the form of a dhoti, sari, towel, a kg of rice and sugar, ghee, cardamom, cashewnut, dry grapes and a sugar cane.\n\nThe gifts were given by roping in sponsors — Punjab National Bank and the Chinthamani super market, said Mr. Murugesan. They carried with them cash given to them from the prisoners’ cash property.\n\nAhead of leaving the prison, the convicts were sensitised to maintaining good behaviour at their respective places. The Prisons Department grants emergency leave for limited days to convicts, Mr. Murugesan added.", 
    "section": "national", 
    "title": "Convicts granted emergency leave for Pongal festival", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}