{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Preliminary works for desilting Srivaikundam dam, which remained suspended in the last reservoir of the Tamirabharani irrigation system after the onset of northeast monsoon in October last, has resumed.\n\nSince water could not be stored beyond two feet in the reservoir as silt was not removed for several decades, thousands of cusecs of water was being wasted whenever the Tamirabharani experienced floods.\n\nMoreover, the floodwaters could not be diverted to the dry areas situated along the watercourse as the channels carrying water from the perennial river have either been encroached upon by people with strong political and communal backgrounds or almost filled up with silt over the years.\n\nWhen National Green Tribunal’s Southern Bench ordered desilting of the dam, the exercise commenced on June 30 last. However, the much-awaited work triggered only a series of protests when the contractor identified for this project started desilting deposited river sand in a place away from the dam instead of commencing it from the spots close to the shutters.\n\nThe protesting farmers then alleged that the exercise was being carried out only with the objective of taking the river sand which was in high demand in construction industry. Only after the NGT was approached again, silt deposited close to the dam was removed. However, the exercise was stopped following the onset of northeast monsoon.\n\n“As the temporary roads we’d laid across the river to enable desilting have been washed away by the recent floods, we’re in the process of completing road-laying exercise now. After completing this work, desilting will resume within the next couple of days,” said a Public Works Department official.\n\nHe also said that 47,869 units of sand, including 25,068 units of river sand and 22,081 units of silt, had been removed since the work was started in June last. “We’ve floated the tender for removing 10.19 lakh cubic metres of sand, including 3.05 lakh cubic metres of river sand and 7.13 cubic metres of silt from the dam,” the official added.", 
    "section": "national", 
    "title": "Desilting resumes after three months at Srivaikundam dam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}