{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Gulf of Mannar Marine National Park establishes artificial hatcheries\n\nGulf of Mannar Marine National Park has started establishing artificial hatcheries along the coastline as part of the conservation programme under the Tamil Nadu Biodiversity Conservation and Greening Project, Wildlife Warden Deepak S. Bilgi has said.\n\nAs the nesting season for turtles commenced in December, the National Park had intensified conservation efforts by deploying watchers to identify and protect turtle nests along the 276-km-long coastline in the district, he said.\n\nThe National Park had identified 14 sites in the Palk Bay and Gulf of Mannar coast such as Azhagankulam, Aartangarai, Danushkodi, Kundukal, Pudumadam, Sethukarai and Mariyur as preferred sea shores for turtles to lay eggs, he said.\n\nThe conservation programme was launched last year mainly to protect turtle nests from predators such as stray dogs and crabs, which dug up the nests and destroyed the eggs. After identifying the nests, the watchers would collect the eggs for hatching in the hatcheries, he said, adding the hatching would go on till April-May.\n\nLast year, they collected about 950 eggs and achieved a hatching rate of 50 to 60 per cent, Mr. Bilgi said. They could not achieve a higher hatching rate because of rains during the hatching season. “This year our effort will be to achieve more than 90 per cent hatching rate,” he told The Hindu here on Thursday.\n\nThough the turtles concealed the nests after laying eggs, they still faced the danger from predators, especially stray dogs which located the nests by smell. The watchers would identify the nests by tracing the two-way turtle tracks on the shores by taking an early morning walk, he said.\n\nAs part of the action plan for conservation of sea turtles, the National Park would distribute Turtle Excluder Devices (TED) to fishermen as turtles were caught in the fishing nets and killed when they came to the surface for breathing, he noted.\n\nTEDs for free\n\nAfter demonstrating the efficacy of TED to fishermen with Chennai-based Tree Foundation later this month, the TEDs, the specialised devices that allowed sea turtles to escape when caught in fishing nets, would be distributed to the fishermen free of cost, he added.", 
    "section": "national", 
    "title": "Efforts intensified for conserving turtles", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}