{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers in the district are not convinced about the seriousness of the Government in fixing Rs. 2,850 a tonne as State Advisory Price for sugarcane.\n\nThe pricing has been announced at a time when there have been complaints against mills for not complying with even the Fair and Remunerative Price of Rs. 2,300 per tonne fixed by the Central Government. The district administration, sources said, has made it clear to the mills that 85 per cent of the turnover they make must be utilised for paying farmers for their produce, and utilise only the remaining for administrative expenses.\n\n“The SAP inclusive of transport charge has been fixed out of political compulsion ahead of Assembly elections. The announcement in the backdrop of the Government's failure to secure the arrears of SAP announced last year from the mills has accentuated anger of the farming community,” K.V. Ponnaiyan, president of Tamil Nadu Swadeshi Farmers’ Association said.\n\nThe SAP arrears runs into several hundreds of crores of rupees, Mr. Ponnaiyan said.\n\nAccording to officials, even State-owned cooperatives have not been able to pay the SAP in entirety as stagnancy in price of sugar has been caused by oversupply.\n\nMeanwhile, the Sathyamangalam-based sugar mill that was issued notice based on complaint from farmers that it had refused to pay even the FRP, has cleared the balance dues as on December 31, 2015.\n\nThe mill was said to have procured cane for Rs. 2,000 per tonne, out of which Rs. 92.80 was deducted as transport charge, resulting in payment of around Rs. 1,900, which was nearly Rs. 400 lesser than the FRP specification.\n\nPayment of FRP being a must under the Sugar Control Act, the district administration has been under pressure to exercise the Revenue Recovery Act to ensure prompt payment to farmers by the mills.", 
    "section": "national", 
    "title": "Farmers question seriousness in fixing SAP", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}