{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Applications have been invited from eligible Christians by the State government for financial assistance for undertaking pilgrimage to Jerusalem.\n\nThe government will extend Rs. 20,000 each to individuals for undertaking the pilgrimage, which would cover Bethlehem, Nazareth, River Jordan, Sea of Galilee, and other sacred places. The pilgrimage would be organised between March and June 2016.\n\nApplications may be obtained free of cost from the office of the District Backward Classes and Minorities Welfare Officer at the Collectorate or downloaded fromwww.bcmbcmw.tn.gov.in\n\nChristian individuals or families with Tamil Nadu as their domicile with a minimum of one year validity on passport as of January 1, 2016 and free of encumbrances to overseas travel are eligible to apply.\n\nThey should have medical and fitness certificates to make the overseas travel and should agree to pay the rest of the travel cost over and above the government subsidy.\n\nFour persons, including two children above the age of two, from a family are eligible to take up the pilgrimage. Preference would be given to candidates over 70 years of age.\n\nA person of the senior citizen’s choice would be allowed to accompany such an applicant.\n\nBeneficiaries would be selected based on the Christian population of the concerned district, through draw of lots by a screening committee. Selected persons would be allowed to make the journey only through government authorised travel agents. The pilgrimage committee would decide on the period of travel, and selected candidates would be duly communicated, Collector K.S. Palanisamy said in a release.\n\nFilled-in applications should be sent to Director, Tamil Nadu Minorities Economic Development Corporation, 807, V Floor, Anna Salai, Chennai – 600 002 before January 25.", 
    "section": "national", 
    "title": "Financial aid for pilgrimage to Jerusalem", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}