{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Survey finds Rs. 5,000 extended by State insufficient as 85% of households lost 40 working days\n\nMany felt the government did not take enough preparatory measures —Photo: G. Krishnaswamy\n\nMost households in flood-affected areas are still struggling to return to get back on their feet.\n\nAn elaborate survey among families that were worst hit, after water from Adyar river and other water bodies engulfed many parts of Chennai, revealed that nearly 85 per cent of the households lost about 40 working days.\n\nThe survey was made by a group of voluntary organisations. Many respondents said they suffered losses ranging from Rs. 75,000 to Rs. 5 lakh, both in terms of wages lost and cost of damages to homes. The financial assistance of Rs. 5,000 extended by the State government will only be an interim relief, families said.\n\nThe State government must make a detailed enumeration of the losses and provide compensation to the households and help them rebuild lives, said V.Geetha, writer and publisher, a survey co-ordinator.\n\n“Many residents said the government did not take any preparatory measures to deal with the flood. Nearly 95 per cent of the people surveyed said they did not receive any warning at all,” said Ms. Geetha, who released the survey here, on Wednesday.\n\nThere are many who are still unable to get back to work as they have lost most of their tools used by them in their trades. The State government provide them due compensation, she added.\n\nMigrant workers were among the worst affected as they could not access government shelters and did not got compensation earmarked for flood affected people as they do not have ration cards, pointed out Prema Revathi, writer and social activist.\n\nThe survey was conducted between December 15 and December 30 among over 600 families in the worst affected areas. Activists demand that the compensation must be provided based on the specific needs and extent of damage and the government must ensure that funds reach the beneficiaries and are not misused by anyone.\n\nMs.Revathi said: “Poor families find it difficult to open bank accounts to receive the compensation. The government must instead use old age pension accounts to reach out to senior citizens.”\n\nPointing out that the city was not prepared to mitigate flood-related damages, activists said the government must be more transparent about disaster-preparedness measures taken. Organisations, including Arunodhaya: Centre for Street and Working Children, Citizens Consumer and Civic Action Group, along with researchers and students of Madras Christian College undertook a survey among 610 households in severely flood affected localities such as Ekkatuthangal, Saidapet, Jaffarkhanpet, Kodungaiyur, Kotturpuram, Mudichur, Perumbakkam and Ponneri.", 
    "section": "national", 
    "title": "‘Flood-hit people need more relief’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}