{
    "author": [], 
    "text": "For that, ensure you have a HEALTHY DIET,REGULAR EXERCISE\n\nNothing can ruin a day than a disturbed sleep the previous night.\n\nAnd the consequences are somehow worse when sleeplessness affects the elderly, says L. Gayathri, MD, consultant at Grandworld Eldercare. She says it is a normal part of ageing when a disturbed biological clock plays havoc with sleep patterns.\n\nIllness, medication, depression, and environment and lifestyle changes often cause sleeplessness and consequently health problems such as cardiovascular problems, obesity, and mood swings.\n\nShe says: “Good sleep is invaluable as it improves cognitive skills, mood, immune system, regulates hormones and metabolism. Growth and repair of our body occurs during sleep.”\n\nIn order to get a good night’s sleep, Dr. Gayathri advises a healthy diet, regular exercise, limiting the intake of liquids and frugal meals before bedtime and a regular go-to-bed time.\n\nShe advises that an afternoon nap should not exceed more than half an hour.\n\nKeeping mobile phones away and switching off the TV also go a long way in addressing the problem, she says. And, alcohol or caffeine just before bed are a strict no-no.\n\nR.T. Mohankumar, senior consultant pulmonologist of Ramakrishna Hospitals says there are more than 80 kinds of sleep disorders. Some of the most common are Obstructive Sleep Apnoea (OSA), central apnoea, bed wetting, chronic insomnia, grinding of teeth, sleep walking and chronic fatigue syndrome.\n\nOSA is common in obese patients and can lead to day time drowsiness and lethargy. The person suffering from OSA could stop breathing for more than 10 seconds or so several times a night. This can block the airway and lead to heart attacks and cerebro vascular accidents besides less oxygen to the system.\n\nOSA is treatable, says Dr. Mohankumar with a regulated lifestyle and with CPAP (Continuous Positive Air Way Pressure) machines that have helped many get over their sleeplessness. Sometimes the patient may require surgery. Sleep orders must be taken seriously and treated, say both the doctors, as they could lead to other health problems or intensify already existing illness.\n\n(Reporting by\n\nPankaja Srinivasan)", 
    "section": "national", 
    "title": "Get a good night’s sleep", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}