{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says a sentence was missing in Tamil translation of a document\n\nThe Madras High Court Bench here has set aside detention of V.P. Pandi alias ‘Attack’ Pandi, the prime accused in the murder of DMK functionary ‘Pottu’ Suresh, on the ground that a sentence was missing in Tamil translation of an English document. Recently The Hindu had published a report, ‘Freedom from errors’, highlighting how a majority of preventive detention orders do not stand scrutiny of law due to innocuous errors committed by detaining authorities.\n\nA Division Bench of Justices P.R. Shivakumar and V.S. Ravi quashed the detention order passed by Madurai Commissioner of Police, within two months since it was passed on November 17 on the ground that omission of the sentence in the translated copy “will show non-application of mind and mechanical clamping of the order of detention by the detaining authority.”\n\nThe judges said that the police furnished a heavy booklet containing copies of documents relied upon by them for passing the detention order. Page numbers 437 to 439 of the booklet contained a copy of an order passed by a lower court in English for issuing a non-bailable arrest warrant against the accused due to his failure to appear before it in connection with a murder case.\n\nThough pages 440 and 441 contained a Tamil translation of the lower court order, it did not contain the sentence: “In the present case, the accused is charged for the offences under Sections 147 (rioting), 148 (rioting with deadly weapons), 341 (wrongful restraint), 427 (mischief), 302 (murder), 120b (criminal conspiracy) and109 (abetment) read with 34 (common intention) of the Indian Penal Code.”\n\nThe Division Bench also said that the detaining authority failed to furnish to the accused a copy of a Government Order authorising him to pass preventive detention orders despite a request made by the detainee. Observing that there was nothing wrong in not giving the G.O. along with the detention order, the judges said, “When a representation is made seeking a copy of the Government Order to make an effective challenge to the detention order, such request ought to have been considered properly and the failure to do so and the mechanical rejection of such request amounts to denial of reasonable opportunity to make an effective challenge to the order of detention.”\n\n“When a representation is made seeking a copy of the G.O., it ought to have been considered properly”", 
    "section": "national", 
    "title": "HC quashes ‘Attack’ Pandi’s detention order", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}