{
    "author": [], 
    "text": "Noting that both the Central and State governments should endeavour to ameliorate the problem of senior citizens, the Madras High Court has directed the Joint Secretary of the State Social Welfare and Nutritious Meal Programme Department to appear before the court to answer a query on framing guidelines to regulate old-age homes.\n\nThe First Bench of Chief Justice S.K. Kaul and Justice M. Sathyanarayanan gave the direction on a public interest litigation petition moved by S. Krishnamoorthy, a former employee of the Indian Air Force.\n\nIt alleges that despite the fact that old-age homes in the State have been mushrooming over the years, the government does not have adequate laws to regulate them.\n\nPackages\n\nThe petitioner submitted that such homes lure senior citizens with attractive packages and later the cost of amenities offered to them escalated several times leaving senior citizens with no choice but to pay it.\n\nAccording to Mr. Krishnamoorthy in response to a query raised under the Right to Information Act the government had said that there is no record of regulations regarding old-age homes.\n\nThis prompted him to approach the court seeking direction to secretaries of the Central and State social welfare departments to frame regulations for senior citizens homes as had been done in the matter of play schools, call taxis, private and international schools.\n\nCourt refuses to accept counter affidavit\n\nIn a recent hearing, the court refused to accept a counter affidavit filed by the State government stating that it did not address the concern of the petitioner nor what the court had in mind.\n\nAs the government failed to file a proper counter affidavit as directed by the court, the First Bench on November 24 last imposed a cost of Rs. 10,000 on the government with a direction to file a reply within six weeks.\n\nWhen the petition came up for hearing on Monday, as the government did not file any affidavit, the Bench directed the appearance of the Joint Secretary and said, “… if the State government is concerned about these senior citizens, we would expect something to be stated before us by the next hearing.”\n\nHearing\n\nThe Bench then posted the PIL to February 15 for further hearing.\n\nAccording to the petitioner, homes lure senior citizens with attractive packages", 
    "section": "national", 
    "title": "HC summons official to frame guidelines for old age homes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}