{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The ailing commentator made his first public appearance in several months\n\nMaking his first public appearance in several months following his hospitalisation in the recent past, Thuglak editor and political commentator Cho S. Ramaswamy on Thursday said the State government’s image as a strong handler of law and order has taken a beating.\n\n“There are complaints that the law and order situation in the State is not good. Corruption being rampant is another complaint that one is hearing,” Mr. Cho said at the 46th anniversary of Thuglak here.\n\nThe ailing commentator sat through the three-hour-long meeting.\n\n“The opinion that used to be prevalent among people that State government is generally strong against goondas is now at a low level,” Mr. Cho charged.\n\nHe called upon the people of Tamil Nadu to shun the practice of taking cash for votes.\n\n“The Jayalalithaa government has, however, got many things right, especially on issues such as the Mullaperiyar dam and rooting out family politics in the State,” he said taking a dig at the DMK.\n\n“(DMDK leader) Vijayakant is in a position to split the votes during the elections. He has managed to maintain his party’s vote share of 8-9 per cent, which is a tremendous achievement,” Mr. Cho said.\n\nPMK MP Anbumani Ramadoss used the platform to promote his party’s cause for a shot at governance and called for prohibition and free and quality education. “We will come up with a separate budget for farmers and agriculture if we come to power,” he said.\n\nTNCC president EVKS Elangovan said politics has become a platform exploited by people to make money by all means.\n\nUnion Minister of State and BJP leader Pon. Radhakrishnan said, “We hope a government like the one in Gujarat is formed in Tamil Nadu too so that the success can be replicated here.”\n\nTMC leader S.R. Balasubramanian felt the State government should have publicised the relief work undertaken during the floods. “The government didn’t do what it said, but it didn’t say what it did. It should have publicised its work properly so that it did not receive so much flak for the good work done.”\n\nAll India Samthuva Makkal Katchi president Sarath Kumar and AIADMK MLA Pazha Karuppiah participated.", 
    "section": "national", 
    "title": "Image of State government hit, says Cho", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}