{
    "author": [
        "S Senthalir"
    ], 
    "text": "Aggressive campaigning for elections has begun in Puducherry with Pongal celebrations. Members of the ruling party, opposition, even independent and rival groups are competing against each other to dole out freebies in their constituencies.\n\nEach party member is spending between Rs. 7 to Rs. 10 lakh in distributing sugarcane, jaggery, sugar and rice. Of the 23 constituencies in Puducherry district, party members in at least 15 constituencies are pushing their chances hard to enter and win the upcoming elections. There is not much activity in the five constituencies of Karaikal, one in Yanam and Mahe.\n\nApproximately, a minimum of Rs. 7.5 to 8 crore is spent in view of providing freebies for Pongal celebrations alone in Puducherry.\n\nSome of these constituencies include Lawspet, Thattanchavady, Muthialpet, Orleanpet, Nellithope, Ariyankuppam, Kalapet, Villianur and Ozhukarai.\n\nIn these fifteen constituencies there are at least 90 potential candidates to contest the upcoming elections, who are splurging away money to woo voters. Many of these constituencies fall within the town limit. This includes at least three rival candidates within All India NR Congress (AINRC) in each constituency, one from Congress, AIADMK and DMK.\n\nWith a population ranging from 23,000 to 30,000 each constituency has at least 15,000 households. Black-stemmed sugarcane costing Rs. 10 each is bought and distributed free of cost. For this, a potential candidate is spending at least Rs. 3 lakh. These sugarcane are bought from Kallakurichi, Tiruvannamalai, Shankarapuram, Salem and Erode.\n\nThough the candidates acknowledge they are distributing sugarcane and other freebies, no one wants to reveal how much they are spending.\n\nCongress party member John Kumar in Nellithope constituency is advertising in a local television channel that he is distributing free organic sugarcane from his farm to every household, area and ward in this constituency. Congress State secretary P.M. Saravanan said he purchased 25,000 sugarcane from his father-in-law’s farm to distribute in Muthialpet.\n\nNot just this, people in these constituencies is being flooded with calendars which cost Rs. 65 to Rs. 70. In addition to this, a kilogram of sugar at Rs. 35 is distributed to the households free of cost.\n\nParty members are also distributing induction cooker, vessels, rice and toor dal.\n\nThe questions as to where do they get the money and who is accounting for these freebies still remains unanswered.", 
    "section": "national", 
    "title": "It’s raining freebies for Pongal in election year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}