{
    "author": [
        "M K"
    ], 
    "text": "More than 200 jallikattu bulls that once majestically ran through the jallikattu arenas in Alanganallur and other places of the State will be on display the first time this Pongal at Velliangiri Goshala at Narasipuram.\n\nSince the rural sport is banned, jallikattu lovers can have a look at the fierce bulls from 8 a.m. to 6 p.m. from Friday to Sunday. Entry is free.\n\nThese 207 bulls escaped the axe when the goshala purchased them from shandies in and around Madurai in February 2015. Their owners had brought the animals for sale for butchering as they were upset over the ban on jallikattu from May 2014. They could not and had no reason to maintain the animals that were expensive to maintain, they said.\n\nPrice has fallen\n\nSindhu, Kangayam, Vadakathi, Kedaimaadu, Malaimaadu and country breed bulls were bought from Alanganallur, Palamedu, Melur, Usilampatti, Vadipatti, Bodi and Ayanavaram. “Due to the ban price of bulls came down drastically,” says P. Siva, managing trustee of Velliangiri Goshala.\n\nMost of them were bought for Rs. 30,000 to Rs. 40,000. The most costly bull to be bought by them was ‘Virumandi Bull’ for Rs. 1.5 lakh.\n\nIt is learnt that the bull got the pet name as it acted with actor Kamal Haasan in the movie Virumandi . Over the last 11 months the animals were not displayed to the public as the bulls grew agitated when strangers entered their space.\n\nNurtured with quality feed , the animals were also trained by jallikattu experts who stayed at the goshala. Mr. Siva said that the bulls were fierce and that safety measures were also in place to ensure that the animals did not harm the visitors.\n\nVolunteers will be there to guide the visitors and explain about the bulls to them. Hundreds of other bulls that are nurtured at the goshala can also be seen during the expo. It is learnt that the expo is also aimed at putting an end to rumours that bulls brought to the goshala were sold in the grey market.", 
    "section": "national", 
    "title": "Jallikattu bulls to be displayed at expo during Pongal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}