{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Former Kashmir CM Omar Abdullah to deliver keynote address\n\nThis year’s edition of what has now become one of India’s biggest annual literary festivals, The Hindu Lit for Life will be inaugurated at Sir Mutha Venkata Subba Rao Concert Hall on Harrington Road, Chetpet, on Friday. The event ends on January 17.\n\nN. Ram, Chairman of Kasturi & Sons Limited will deliver the inaugural speech and Nirmala Lakshman, Director of Kasturi & Sons Limited and Curator of Lit for Life, the welcome address. Rajiv Lochan, CEO of Kasturi & Sons Limited, will speak about the event. Former Kashmir Chief Minister Omar Abdullah, who will be introduced by Ms. Lakshman, will deliver the keynote address on ‘My Kashmir’ at 10 a.m.\n\nJanuary 15\n\nProgrammes scheduled for Friday include ‘Cities Under Water: Lessons from Srinagar to Chennai’ – M. Saleem Beg, Professor S. Janakarajan and Nityanand Jayaraman will be in conversation with Gopalkrishna Gandhi, 11 a.m.; ‘Sing my Song: Duality of performance and creativity, of tradition and individuality’ – Sanjay Subrahmanyan in conversation with Nirmala Lakshman, 12 noon; ‘Picturing Time: Raghu Rai’s most famous photographs and the stories behind them’ – Raghu Rai in conversation with Sadanand Menon, 12.50 p.m.; ‘The Uses and Abuses of Religion’ – Devdutt Pattanaik and Laila Tyabji in conversation with N. Ram, 6.15 p.m.\n\nSessions at The Hindu Pavilion include: ‘Anatomy of a Murder: The Aarushi story’ – Avirook Sen and Tanveer Ahmed Mir in conversation with Geeta Ramaseshan, 11 a.m.; The Hindu Young World Goodbooks Prize, 3.20 p.m.\n\nJanuary 16\n\nThe first session will be on ‘The Kural’ featuring Gopalkrishna Gandhi in conversation with A. R. Venkatachalapathy; Verses set to tune by Chitravina N Ravikiran; Vocals: Tiruvarur Girish will begin at 9.50 a.m.; ‘True Detectives: Of sleuths in Gaborone and Edinburgh’ – Alexander McCall Smith in conversation with Nandini Krishnan, 10.55 a.m.; ‘The World of The Story’ – Colm Toibin, Nilanjana Roy, Philip Hensher and Amitava Kumar in conversation with Mukund Padmanabhan, 12.50 p.m.; The Hindu Prize 2015, 3.20 p.m.; ‘India and The Networked World’ – A talk by Shashi Tharoor, introduced by Sushila Ravindranath, 5.10 p.m.\n\nSome programmes at The Hindu Pavilion:\n\n‘Changing Face of Temples: Status & Structure’ – Sharan Apparao in conversation with Chithra Madhavan, 10 a.m.; ‘The Addict’ – Diya Sethi, Vidya Singh in conversation with Vijay Nagaswami, 12 noon; ‘Nothing Official About It’ – Anuja Chauhan in conversation with Vaishna Roy, 3.30 p.m.; December Deluge & the Spirit of Chennai – Listen to stories of valour, courage & hope from the heroes & heroines of Chennai: Chinmayi Sripada, Prema Revathi, Sam Paul, Chari Vijayaraghavan and Zara in conversation with Rajiv C. Lochan, 5.45 p.m.\n\nPartners\n\nThe event has Ford as associate sponsor, Taj Coromandel as hospitality partner, ACT Fibernet as wifi partner, Starmark as book partner, Aachi as water partner and Aura as event manager.\n\nRegistration\n\nTo register, SMS LFL Your Name, Age to 53030 or log on to www.thehindulfl.com", 
    "section": "national", 
    "title": "Lit for Life from today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}