{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "The Union Ministry of Environment and Forests (MoEF) has recommended the revocation of the suspension of Indian Forest Service (IFS) officer Sampath Lal Gupta who was suspended by the Tamil Nadu government two years ago.\n\nIn a letter to the Principal Secretary, Environment and Forests Department, Tamil Nadu, dated December 29, 2015, the MoEF said the Central Review Committee (CRC) has “recommended revocation of his suspension.”\n\nThe decision was taken at a meeting of the CRC to look into the State government’s request for extension of the suspension and Mr. Gupta’s representations.\n\nThe government has been “requested to revoke the suspension with immediate effect and adhere to the extant rules/guidelines and complete all the disciplinary proceedings initiated/pending against him within prescribed time limit”, the MoEF letter said. The government placed Mr. Gupta on suspension on December 31, 2013 on charges, including that of not being cordial with his seniors and subordinates.\n\nThe suspension came after he cracked down on smuggling of red sanders and sandalwood in Vellore and while probing the alleged nexus between officials and smuggling mafia in illegal felling of red sanders trees and encroachment of government land. He had also informed the Conservator of Forests, Vellore circle, about the felling of trees in Thagarakuppam, Walajah taluk. The MoEF had sent the letter to the government via fax and post the same day. Following this, Mr. Gupta submitted his representation to the government on January 7 requesting revocation of suspension.\n\nHowever, sources close to Mr. Gupta said he is yet to receive any reply . “Following the suspension, he shifted his family from Vellore due to threats . An impartial inquiry should be conducted into red sander smuggling by an agency from outside the State,” the source said.\n\nState Forests Department officials said the government has received the MoEF’s communication and due process would follow.", 
    "section": "national", 
    "title": "MoEF revokes suspension of IFS officer", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}