{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Intensified Pulse Polio immunisation drive will be held on January 17 and February 21\n\nThe Department of Health and Family Welfare, Puducherry expects to administer polio drops to around 93,000 children in the age group of 0-5 years including newborns during the Intensified Pulse Polio immunisation drive to be held on January 17 and February 21, as part of the National Immunisation Day.\n\nThe department said the Polio drops will be administered on January 17 (first round) and February 21 (second round) at 441 booths from 7 a.m. to 3 p.m. across the Union Territory of Puducherry. Nearly 2000 health staff will be roped in for the campaign.\n\nThere will also be 17 transit and border booths functioning from 6 a.m. to 6 p.m. in all four regions.\n\nSome of these transit booths will be located at bus stand, railway station, Manakula Vinayagar temple, Beach Road, J.N. Street, M.G. Road, Bharathi Park, Botanical Garden, Pothys mall, Chunnambar Boat House, Ossudu Lake and Pogo Land.\n\nThe border booths will be set up at Kurumbapet, Kalapet, Madagadipet, Gorimedu, Kannikoil and Thirukkanur.\n\nHigh risk population\n\nWith the focus on migrant and high risk population, 35 high risk sites have been identified where around 361 children will be administered the drops.\n\nHealth staff will conduct house visits and also school visits. This is to administer drops to children who have not been covered in the first round on January 18 and 19.\n\nControl rooms in Jipmer\n\nThe press release further stated that control rooms have been set up at Jipmer, Indira Gandhi Medical College and Research Institute, Rajiv Gandhi Government Women and Children Hospital, and Immunization Office, Health Directorate, Puducherry, which will function on January 17 from 8 a.m. to 5 p.m.\n\nWhile India has been certified polio-free by the World Health Organisation in 2014, and the last reported case in Puducherry was in 1998, chances of transmission of wild polio virus still persists in some neighbouring countries, said the release.\n\n17 transit and border booths will function from 6 a.m. to 6 p.m. in all\n\nthe regions", 
    "section": "national", 
    "title": "Over 90, 000 children to be given polio drops", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}