{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The People’s Welfare Front (PWF) has charged the Puducherry Government with failing to make any representation to the Centre seeking adequate funds.\n\nTalking to reporters here on Thursday, R. Viswanathan, convenor of PWF and secretary of CPI said the Government is facing a severe financial crisis and has started diverting the savings of government employees in Employees Provident Fund (EPF) and other sources of Revenue such as Special Component Plan (SCP) and welfare boards to meet its liabilities. This is an unethical practice, he said.\n\nThe PWF has also accused Chief Minister N. Rangasamy with failing to make any representation to the Centre to declare Puducherry as natural calamity hit area. He said that Puducherry too had suffered severe damage in the recent incessant rains and subsequent floods.\n\nWhile a part of Tamil Nadu had been declared calamity hit the Centre had neglected Puducherry as there was no representation from the Puducherry Government. Stating that the distribution of rain relief did not cover all families, he said that a number of families in rural areas did not have bank accounts.\n\nThe banks should conduct special camps to cover all families.\n\nWhile the Puducherry Government had failed to create new jobs in the last four-and-a-half years it was abetting back door appointments in Public Sector Undertakings (PSU) in gross violation of rules.\n\nThe PWF also wanted the Government to transfer the case involving ruling AINRC functionary K.S.P. Ramesh to the Central Bureau of Investigation (CBI). He alleged the police were trying to hush up the incident.\n\nThe PWF has demanded Chief Minister N. Rangasamy to seek a vote of confidence in the Assembly to prove that the government enjoyed the support of Independent MLA V.M.C. Sivakumar.\n\nCPI (M) secretary R. Rajangam was also present.", 
    "section": "national", 
    "title": "People’s Welfare Front flays government for not seeking adequate funds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}