{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court has ordered notice on a Public Interest Litigation (PIL) seeking direction to the State government to ensure that all the unrecognised schools in the State are shut down by the end of this academic year.\n\nThe PIL wanted the government to transfer the students of such schools to other government, government aided or unaided recognised schools in the neighbourhood.\n\nThe petitioner activist A. Narayanan also sought the court to quash two Government Orders (GO) and to restrain the government from granting recognition to the schools, which have not fulfilled the norms specified in GO dated July 21, 2004.\n\nMr. Narayanan submitted that based on the report of Justice Sampath Commission, which was appointed to probe the Kumbakonam school fire accident, and the recommendations made by Prof. Chittibabu Committee relating to infrastructural facilities for matriculation schools, the government issued an order on July 21, 2004.\n\nThe order stated that as a condition for recognition, all the matriculation schools should fulfil the minimum land area and other infrastructural facilities prescribed in the GO. Subsequently, two more GOs were passed granting seven years time to fulfil the norms, which ended in 2011.\n\nThereafter, the School Education Department constituted a seven member committee in 2013 to prescribe the minimum land area for giving recognition to those schools not fulfilling the norms.\n\nTemporary recognition\n\n“However, the said report has not seen the light of the day. While so, the school education department has now proceeded to give temporary continual recognition till May 31, 2016 to as many as 746 matriculation schools, which have not fulfilled the conditions,” the petitioner said.\n\nAdmitting the PIL, the First Bench of Chief Justice S.K Kaul and Justice Pushpa Sathyanarayana ordered notice to the State government returnable in two weeks and posted the matter March 7 for further hearing.", 
    "section": "national", 
    "title": "PIL plea seeks closure of unrecognised schools", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}