{
    "author": [
        "S Senthalir"
    ], 
    "text": "People throng J.N. Street to do the eleventh hour purchase for Pongal and (below) those proceeding to their hometowns to celebrate the festival wait at new bus stand in Puducherry on Thursday.— Photo: S.S. Kumar\n\nMarkets, bus stands teem with people, provision stores see fewer footfalls\n\nThe four-day harvest festival began on Thursday as people burnt old things in the morning symbolising the beginning of a new phase. Colourful kolams adorned every narrow streets of Puducherry giving a festive look to welcome Thai Pongal.\n\nThai Pongal celebrated on Friday is considered to be one of the important days of the festival. Traditionally, rice is boiled with milk in earthenware with sugarcane tied on both sides, dedicating it to the Sun God.\n\nWith Puducherry Government declaring a holiday on Thursday, children were seen accompanying their parents to shops to buy new clothes, vegetables and fruits for the festival. By evening, the shops at Goubert Market were crowded. There was brisk business at places selling turmeric, flowers, bananas and different varieties of vegetables.\n\n“We get turmeric especially for the Thai Pongal. Turmeric plant is tied around the pots when rice is boiled with milk,” said Kamala, a vegetable vendor at Goubert Market. She was selling turmeric at cost varying from Rs. 5 to Rs. 20, depending on its size. Fancy stores selling junk jewellery were also crowded as women and children bought jewels for the festival.\n\nBusiness at provision stores and sugarcane fell sharply when compared to last year.\n\n“All the political parties are giving rice, jaggery, sugar and sugarcane. There are not many people coming to our shops,” said Muthu, who has been running a provision store for the past 30 years.\n\nThe street shops selling clothes, watches and other utensils that usually mushroom on Sundays in Puducherry, were already there by Thursday evening on Mahatma Gandhi (MG) Street and Jawaharlal Nehru Street catering to the demands of the people. Traffic movement slowed down as commuters had to negotiate through the crowd to reach their destination.\n\nSpecial Buses\n\nPeople began travelling to their villages to celebrate the festival early on Thursday. Puducherry Road Transport Corporation (PRTC) started plying special buses to Chennai and Karaikal.\n\nTo facilitate the commuters, PRTC managing director K. Kumarakrishnan said that five special buses have been deployed to Chennai and Karaikal from January 14 till 19.", 
    "section": "national", 
    "title": "Pongal exuberance pervades Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}