{
    "author": [
        "M K"
    ], 
    "text": "The bulls from the Coimbatore Corporation’s cattle yard were sent to a Goshala, about 30 km from city.— Photo: M. Periasamy\n\nBulls that once pulled carts that collected garbage in the city and stayed at the Corporation’s cattle shed on Brookebond Road set off to Velliangiri Goshala, at Narasipuram, on Wednesday night.\n\nThe Goshala will be their new retirement home. The old cattle-shed will be converted into a parking lot.\n\nWhen the Government Order about not using cattle to collect garbage came into effect, the bulls were kept at a handful of sheds in the city. The one on Brookebond Road had 42 bulls. The Corporation was taking steps to auction them (for slaughtering) when Mayor P. Rajkumar who was the then South Zone Chairman of the Corporation intervened.\n\n“The bulls slogged for us and helped maintain the city clean. We wanted to show our gratitude to them and passed a resolution in the Corporation council to save them from slaughter. The local body could not take care of those bulls,” Mr. Rajkumar said. It was then Velliangiri Goshala volunteered to take care of them from January 2014.\n\nThirty seven cattle including a very old bull remain of the original 42. Around 10 p.m. on Wednesday, the first set of 10 bulls walked to the Goshala, located about 30 km away, and they reached there around 10 a.m. on Thursday.\n\nThe remaining 17 bulls will reach the Goshala before Maattu Pongal.\n\n“They were taken on foot as the new Union Government rules that came into effect from January 2016 makes it clear that cattle should be transported only in trucks with permanent partition to avoid overloading. But such vehicles are not readily available. Hence, the animals were walked to their destination,” managing trustee of the Goshala P. Siva said. According to the Mayor, the Corporation will also monitor the bulls by visiting them at the Goshala at regular intervals.\n\nThe Mayor said that the cattle shed on Brookebond Road is located on one acre of land. “Lack of adequate parking space sees frequent traffic snarls in the area,” he said and added that the Corporation decided to convert the cattle shed into a parking lot after discussions with the city police.\n\nMr. Rajkumar said that a temporary parking lot will come up in a month’s time. The Corporation may consider converting it into a permanent multi-level parking lot.", 
    "section": "national", 
    "title": "Retired bulls leave cattle shed to give way for parking lot", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}