{
    "author": [
        "S Sundar"
    ], 
    "text": "Protest continued on eve of Pongal\n\nHOPES DASHED :Children play at a gallery meant to view Jallikattu that lies in disuse at Palamedu in Madurai as the preparatory work stopped midway on Wednesay . -Photo: S. James\n\nProtest against the ban on jallikattu continued on the eve of Pongal on Thursday with a section of villagers observing a fast at Anaiyur, Palamedu and Alanganallur in Madurai district. At Palamedu, all the shops remained closed and some residents threw their ration cards on the road as a mark of protest.\n\nWith no jallikattu this year, Pongal celebrations will be a low-key affair for a large section of people in Avaniapuram, Alanganallur and Palamedu where the bull taming sport used to be conducted until last year. Residents of Alanganallur and Palamedu have decided to observe ‘black Pongal’ by hoisting black flags atop their houses.\n\nHundreds of police personnel, from other districts including Chennai, have been deployed in these villages. In addition to that 22 check-posts have been installed in Avaniapuram too.\n\nWith bull owners threatening to violate the Supreme Court order, the police have left no stone unturned to provide security. Bull owners have been warned and police personnel deployed at vantage points to prevent any attempt by the owners to bring their bulls out.\n\nMeanwhile, yesteryear Tamil film actor and founder of All India Naadalum Makkal Katchi, M. Karthik, visited Alanganallur and Palamedu to express solidarity with the agitating people.\n\nFlaying animal rights activists, Karthik said that India was one of the largest exporters of beef. “Can there be any worse torture of animals than their slaughter,” he asked. He said that even the British did not impose any restriction on the bull taming event.\n\nPWF fast on Jan. 17\n\nCondemning the Central and State governments for the “poor handling” of the jallikattu issue, MDMK general secretary Vaiko said that the People’s Welfare Front (PWF) would organise a fast in Madurai on January 17.\n\nHe told reporters here that organisations like the PeTA had very little understanding of the sport, which he said was a symbol, tradition and custom of Tamils from time immemorial. He accused the BJP and AIADMK of attempting to get political mileage out of the issue.. .\n\n“The electorate should not forget to teach these parties a lesson in the elections,” he said.", 
    "section": "national", 
    "title": "Security blanket in Alanganallur, Avaniapuram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}