{
    "author": [
        "B Kolappan"
    ], 
    "text": "In 2006, Tamizhini released N. Raghunathan’s Rasikan Kathaikal which included his four plays and one of Sotto Voce articles in English by him.\n\nThe world of journalism knew him as the ‘edit writer of The Hindu’ f or 31 years. N. Raghunathan, who died in 1982, was also a brilliant writer of short stories and plays, capturing in authentic Thanjavur Tamil the disintegration of feudalism and social structure constructed on it in the face of modernism in the beginning of the 20{+t}{+h}century.\n\nThe natural story teller in Raghunathan transcends the life in agraharam and he could describe the entire society with a unique style, punctuated with rich imagery, possible only for a keen observer of his surroundings.\n\nHe uses the phrase “cactus milk” to describe the density of the Thanjavur degree coffee, likens the face of an embarrassed character to “ pontha kalayam ” (mud pot with holes) and colour of a river in spate as “ kaaka’ colour, the colour of a crow. But his description of the patterns inside the Thespesia flower ( Poovarasu ) to the emergence of the lotus from the navel of Lord Vishnu will elevate the status of the odourless flower to a new level.\n\nHis in-depth knowledge of both ancient Tamil literature and western classics, including his favourite writer Dostoevsky, finds expression in all the 18 stories he wrote under the pen name “ Raskian ” in Bharatha Mani , a magazine run by his friend K.C. Venkatramani between 1938 and 1948.\n\nHe published his short story collection in 1962, and in 2006 Tamizhini released Rasikan Kathaikal which included his four plays and one of Sotto Voce articles in English by him under the name Vigneswara.\n\n“I used to write articles for Bharatha Mani . I wrote short stories on his insistence,” Raghuanthan, had said in the preface to the short story collection. He also worked for the Daily Express , and in 1926, joined The Hindu.\n\n“He was the most brilliant edit writer of Indian journalism and not just of The Hindu ,” said N. Ram, Chairman of the Kasturi and Sons Ltd.\n\nA. Sathish, a Tamil professor and editor of Rasikan Kathikal, had said Ragunathan stood out among his contemporaries with his technique of comprising literary and oral tradition.\n\n“He probably is the first Brahmin to write about envy, perversion, violence and glee lurking in the subconscious human mind. That could be the reason for him not getting his place in Tamil literature while he was celebrated as a great writer in English,” he said.\n\nRaghunathan had a clear idea about fiction. “A fiction writer will succeed only if he empathises with his character. But he cannot affect the individuality of his characters,” he had remarked.\n\n“You feel like entering into a world destroyed long ago. Even though he used manipravalam (a mix of Tamil and Sanskrit) it never hindered the flow of his language,” said writer Yuvan Chandrasekar, in his foreword to the republished short story collection.", 
    "section": "national", 
    "title": "The little known story teller of The Hindu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}