{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The New Bus Stand in Salem witnessed a heavy rush on Thursday evening.\n\neople thronged markets in various parts of the district to make Pongal festival purchase on Thursday.\n\nThough the prices of commodities, including jaggery and sugarcane, have gone up this season, the festival spirit was evident in the markets. All the markets were flooded with sugarcane, turmeric and ginger bunches, and mud pots.\n\nAll the 11 Uzhavar Santhai in the district, including four in the city limits, proved a major attraction for both the farmers and consumers alike.\n\nAs many as 1,239 farmers had brought 241 tonnes of vegetables to these markets.\n\nMore than 55,500 men and women thronged these markets from the early hours of the day till noon and procured vegetables worth Rs. 83.40 lakh.\n\nAs usual, the Uzhavar Santhai in Suramangalam in the heart of the city, recorded the maximum sale of 68 tonnes of vegetables worth Rs. 22.18 lakh, followed by the santhai in Thadagapatti which recorded a sales turnover of Rs. 10.18 lakh.\n\nThe price of sugarcane and turmeric bunches, which were much sought after for the festival, registered an upward trend this season. The price of cane was Rs. 35, while the price of a couple of bunches of turmeric ranged between Rs. 40 and Rs. 60 in uzhavar santhai.\n\nThe price of both were on a little higher side in the open markets.\n\nA bundle of about 20 canes of the edible varies was being sold at around Rs. 700 to Rs. 800 depending on the quality.\n\nThough abundant arrivals had caused a slump in the price of turmeric over the past few days, the price had been jacked up on Pongal eve. The colourful pots were priced between Rs. 75 and Rs. 300.\n\nThe festival demand also saw a slight spurt in the price of vegetables in the city markets.\n\nThere was heavy demand for ‘siru kizhangu’, ‘sarkaraivalli kizhangu’, ‘green peas’, ‘beans’, coconuts, plantains etc in the markets, along with puja articles.\n\nA large number road side shops selling mud pots, cane, turmeric bunches had sprang up in Shevvapet, Meyyanur, and other parts of the city. The weekly market at Koranguchavadi in the city too saw a heavy turnout of traders and consumers from dawn till late evening hours.\n\nFlowers\n\nThe Poosaripatti flower market near Omalur, a major flower market of the western region, registered a heavy sale of flowers for the past two days. Different varieties of flowers such as ‘samangi’, ‘Chandni’, ‘white poornima’, ‘yellow poornima’, ‘Rajamalar’ brought by farmers from Kaadaiyampatti; Theevattipatti; Danishpetttai; Kanavaipudur; Kanjanayakkanpatti; Poosaripatti; Nadupatti; Umbiligampatti; Bommiyam patti; Pannapatti, Kaaruvalli and surrounding areas.\n\nThe farmers, traders vied with each other and occupied every inch of the space available in the market on Wednesday and Thursday. The farmers had to park the vehicles which brought the flower loads to the market at a far place and shift the stock on head loads.\n\nThe heavy demand for the flowers could be gauged from the fact that 30 tonnes of flowers were sold out on a single day on Wednesday. While ‘Chandni’ was priced at Rs. 70-Rs. 120 a kg; the price of ‘white poornima’ ranged between Rs. 70-150; ‘yellow poornima’ between Rs. 100-Rs. 150; ‘samangi’ between Rs. 100-Rs. 110 a kg.\n\nThe traders from far away places like Chennai, Bengaluru, Thanjavur, Tiruchi, Pattukottai, Kumbakonam, Cuddalore made a beeline to Poosaripatti market.\n\nThe rise in the price of flowers this season has brought much cheer to the farmers. The price is expected to remain the same for the next few days.\n\nPhotos: E. Lakshmi Narayanan in Salem, and M. Govarthan in Erode", 
    "section": "national", 
    "title": "The celebrations begin", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}