{
    "author": [
        "P V"
    ], 
    "text": "Demand release of men languishing in AP prisons since 2013\n\nIt will be a “black Pongal’ for the families of tribals incarcerated in the jails of Andhra Pradesh for red sanders smuggling since 2013, across five districts of the State.\n\nLed by the All India People’s Forum, the families of over 376 Tamils lodged in Andhra Pradesh jail will hoist black flags in their homes to call the attention of the State government.\n\n“These families will mark Pongal for the third consecutive year without their breadwinners, and there is no solution in sight,” says A.Chandramohan of All India People’s Forum.\n\nOf the approximate 434 undertrials in AP jails, an estimated 376 are Tamils, and of these, over 95 per cent are tribals.\n\nThis is largely a tribal question, and their continued undertrial status is linked to their tribal status, he said.\n\nThe families of tribals from Chitteri Hills in Dharmapuri, Jawadhu Hills in Tiruvannamalai, Kalrayan Hills in Salem and Velli Hills in Villupuram will mark Pongal by hoisting ‘black flags’.\n\nAccording to Mr.Chandramohan, the trial was expected to conclude last week.\n\nHowever, yet another hearing was scheduled for January 18. “Of the 300 tribals jailed since the killing of the two forest personnel in 2013, a majority of the men will eventually be released.\n\nHowever, the inordinate delay in the trial has forced them to languish as undertrials,” says Mr.Chandramohan.\n\nThe Chief Minister had assured the families of early legal intervention to secure the release of those languishing in AP jails, in the wake of encounter killings of last summer, when 20 tribals from the State were shot dead in Andhra Pradesh.\n\n“At best, the Opposition and the Left parties can only highlight their plight.\n\nIt is the government that should intervene,” says Mr. Chandramohan.\n\nThe crackdown on tribals intensified after the killing of two forest personnel in late 2013, leading up to the rounding up of hundreds of tribals trespassing into the forests of Andhra Pradesh.\n\nThe All India People’s Forum had been demanding quick trial and early release through due process.", 
    "section": "national", 
    "title": "Tribal families to hoist black flags", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}