{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Kin of a Dalit who died in Vazhvur were not allowed to take out funeral procession\n\nThe loud clamour the State witnessed for lifting the ban on jallikattu over the last two weeks virtually eclipsed an atrocious case of discrimination against Dalits. The kith and kin of an elderly Dalit man who died in Vazhvur near Mayiladuthurai were denied the dignity to take out the funeral procession through a route dominated by the Caste Hindus despite the Madras High Court directing the police to ensure that the funeral route was not disturbed. Finally, he had to be buried after being carried on an alternative path as instructed by the police.\n\nMultiple fact-finding reports by activists claim those who protested the police action were roughed up. Despite condemnation from outfits sympathetic to the Scheduled Castes, no disciplinary action has been taken against officials who ostensibly flouted the court order.\n\nDalit activists, writers and politicians say this incident reflected the growing apathy to the plight of the community from major political parties and the administration. The two leading Dravidian parties — AIADMK and DMK — have consistently avoided any strong action against such incidents in recent years. Whether it be the riots in Seshasamudram in Villupuram district last year or the murder of Dalit youth Gokulraj in Namakkal, condemnation has either been muted or weak at best and does not come anywhere close to the response the jallikattu issue has elicited.\n\nWriter Imayam, who has chronicled the lives of the subaltern communities extensively, says many villages across Tamil Nadu have the system of separate burial grounds for Caste Hindus and the Dalits. Clashes take place when the location of a burial ground or a crematorium is such that the Dalits have to take the body through the upper caste settlement or the public road.\n\n“In places like Salem and Coimbatore, you would actually see such places managed by trusts explicitly named after specific caste groups. Dalits will not be allowed to bury or cremate their dead in these places though the undertaker always hails from the SC community,” he says.\n\nThus, while the two-tumbler system was rightly deemed casteist and efforts were initiated to address the problem, the aspect of separate burial grounds remain largely untouched.\n\nD. Ravikumar, writer and general secretary of the VCK, says even horrific crimes against Dalits, such as honour killings, go without condemnation in a State that claims to be progressive in its politics. “Neither the DMK nor the AIADMK has come out strongly to condemn the recent incidents. There is a fear among these parties that taking such actions will polarise the Caste Hindu vote bank against them and so they tend to remain silent,” he charges.\n\nAccording to the National Crime Records Bureau data, 2014 saw a steep rise in the number of Dalits murdered to 72 from 28 in the previous year. Thirty-three Dalit women were raped in Tamil Nadu in 2014 compared to 28 in 2013.\n\nWhile the Prevention of Atrocities Act has been strengthened in the books, he says there was no effect on the ground since implementation was weak.\n\nIn fact, the Chairman of the National Scheduled Caste Commission, P.L. Puniya, stated last year that hardly 10 percent of the cases registered under the Prevention of Atrocities Act end in conviction.\n\nMr. Ravikumar feels in the case of Vazhvur, the High Court should initiate suo motu contempt proceedings against those who ordered the police officers to carry the body through an alternate route. “But the bigger problem is the mentality. While political parties fight hard for jallikattu, a tradition in a few districts in south Tamil Nadu, more important issues like these do not attract their attention,” he rues.\n\nMultiple fact-finding reports by activists claim those who protested the police action were roughed up", 
    "section": "national", 
    "title": "When jallikattu conundrum overshadowed caste atrocity", 
    "subsection": "tamilnadu", 
    "date": "2016-01-15"
}