{
    "author": [
        "National Bureau"
    ], 
    "text": "India and Pakistan decided to take the investigation into the Pathankot terror attack forward when External Affairs Minister Sushma Swaraj met her Pakistani counterpart, Sartaj Aziz, during the SAARC ministerial in Kathmandu on March 17.\n\nGovernment sources said the National Investigation Agency (NIA) would be coordinating the visit of the Pakistan team. They said the joint investigation team was expected at the Pathankot airbase on March 29 and would be flown there in a helicopter belonging to the Border Security Force (BSF).\n\nOfficials said the government has decided to be transparent about the Pakistan’s team visit and asked the NIA to share as many details as possible with the media. “This is a rare occasion when the two countries will work together on a terror case. The message that is being sent out is about India-Pakistan cooperation,” said a government official.\n\nHe said that until now, Pakistan had not sent the list of evidence that it would require to assist its investigation. “We have not received anything from Pakistan. We are waiting for them to tell us about their requirements so that we can make the necessary arrangements,” he added.\n\nPMs’ meeting\n\nExternal Affairs Ministry spokesperson Vikas Swarup on Tuesday declined to provide further details about the possible meeting between Prime Ministers Narendra Modi and Nawaz Sharif in Washington, while citing that “slots” have been left out for a possible bilateral meeting between them.\n\nAs part of the atmospherics being built up for the meeting between the two PMs, India is also extending a special gesture for the National Day celebration at the Pakistan High Commission in New Delhi on March 23, with the government deciding to send a “senior Minister” to the event.\n\nThe National Day celebration is usually not attended by senior Ministers as it is used by the Pakistani authorities to showcase warm ties between Pakistan and the Kashmiri separatists. Last year, General V.K. Singh, the former Army Chief who is a Minister of State, was deputed by the government, but he left a trail of controversy later with a series of tweets that conveyed his disgust about attending the event. This year, however, the government will take the political risk.", 
    "section": "national", 
    "title": "Centre plans transparency in Pak. team’s Pathankot visit", 
    "subsection": "general", 
    "date": "2016-03-23"
}