{
    "author": [
        "Staff Correspondent"
    ], 
    "text": "Wants the case of lynching of Muslim cattle traders to be referred to a Central agency\n\nA CPI(M) delegation, led by Polit Bureau member Brinda Karat, met Jharkhand Chief Minister Raghubar Das in Ranchi on Wednesday and sought his intervention in the probe into the lynching of two Muslim cattle traders by suspected cow protection vigilante groups in the State’s Latehar district.\n\n“The Jharkhand Chief Minister admitted to us that the killing was not due to any personal feud,” Ms. Karat said. The CPI(M) leaders submitted a memorandum to Mr. Das, which called for the case to be referred to a Central agency as “there can be no confidence in the present investigation.” The State police and the administration have so far denied the involvement of cow protection vigilantes in the murders. The victims, Mazlum Ansari (32) and Imteyaz Khan (13), were residents of Balumath.According to the CPI(M) leaders, Mazlum had been threatened by cow protection vigilantes who wanted him to give up cattle trading, and the story that his killing was due to a personal dispute was a falsehood propagated by the administration. The CPI(M)’s memo to the Chief Minister also demanded strict action against police officials indulging in communally divisive hate speech, government employment for the wife of Ansari and parent of Khan, and a crackdown on “the communal activities of the so-called cow protection committees.”\n\n‘No’ to compensation\n\nSpecial Correspondent from Patna reports:\n\nThe families of the two cattle-traders, whose bodies were found hanging from a tree trunk on March 18 in the Latehar district of Jharkhand, have refused to take the financial assistance of Rs. 1 lakh from Chief Minister Raghubar Das.\n\nThe Collector and the Superintendent of Police went to the victim’s village on Tuesday to hand over the assistance. Mr. Das had invited them to Ranchi on March 25 to meet him, but the villagers said the Chief Minister should visit them.", 
    "section": "national", 
    "title": "CPI(M) takes up Latehar lynching with Jharkhand CM", 
    "subsection": "general", 
    "date": "2016-03-23"
}