{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a bid to make the draw the attention of the Brihanmumbai Municipal Corporation, residents of Deonar and surrounding areas staged a black protest at the Azad Maidan on Tuesday against the continued menace of dumping ground fires.\n\nA hundred residents wearing black and carrying heaps of petitions protested at the Maidan for an hour. “We have 15,000 petition letters signed by local residents. Everyone has some disease or the other. This fire is bigger than the one in January. We can’t live next to a fire. It is like the Bhopal gas tragedy,” Richa Sethi from Deonar told The Hindu .\n\nResidents reminded Chief Minister Devendra Fadnavis of his assurance last month of installing fire fighting equipment on the ground to prevent further incidents of fire. “The CM even tweeted about it, but nothing has materialised. All the agencies of the government are passing the buck. No one is taking ownership. A political blame game is also being played out. We have to intensify our protests,” Ms. Sethi said.\n\nOn Tuesday morning, there were reports of the death of a six-month old infant from the Shivaji Nagar slums.\n\nHowever, there was no confirmation of any link to the Deonar fire and the resultant smoke. “The baby has been suffering from breathing problems previously too. No case has been registered,” Balasaheb Jadhav, senior police inspector at the Shivaji Nagar Police station told The Hindu .\n\nThe BMC-run Shatabdi Hospital said no deceased infant was brought to the hospital.\n\nAt the time of going to press, however, Rais Shaikh, Samajwadi Party local corporator, said the family was trying to register a police complaint. Mr. Shaikh also called for a Govandi bandh on Wednesday.\n\nDevendra Fadnavis reminded of his assurance of installing fire fighting equipment", 
    "section": "national", 
    "title": "Deonar protests reach Azad Maidan", 
    "subsection": "general", 
    "date": "2016-03-23"
}