{
    "author": [], 
    "text": "A map of Martian gravity looking down on the North Pole (left) and South Pole. White and red are areas of higher gravity while blue indicates areas of lower gravity.— PhotoS: MIT/UMBC-CRESST/GSFC\n\nThe improved resolution suggests a new explanation for how some features formed across the boundary that divides the north and south\n\nScientists have created the most detailed map of Mars’ gravity to date using data from three NASA spacecraft, thus providing a glimpse into the hidden interior of the red planet.\n\n“Gravity maps allow us to see inside a planet, just as a doctor uses an X-ray to see inside a patient,” said Antonio Genova from Massachusetts Institute of Technology (MIT).\n\nThe new gravity map will be helpful for future Mars exploration because better knowledge of the planet’s gravity anomalies helps mission controllers insert spacecraft more precisely into orbit.\n\nThe improved resolution of the gravity map suggests a new explanation for how some features formed across the boundary that divides the relatively smooth northern lowlands from heavily cratered southern highlands.\n\nThe team confirmed that Mars has a liquid outer core of molten rock by analysing tides in the Martian crust and mantle caused by the gravitational pull of the sun and Mar’s two moons.\n\nBy observing how Mars’ gravity changed over 11 years — the period of an entire cycle of solar activity — the team inferred the massive amount of carbon dioxide that freezes out of the atmosphere onto a Martian polar ice cap when the planet experiences winter.\n\nThe team also studied how mass moves between the south pole and the north pole with the change of season in each hemisphere.\n\nThe map was derived using data collected by NASA’s Deep Space Network from three spacecraft in orbit around Mars: Mars Global Surveyor (MGS), Mars Odyssey (ODY), and the Mars Reconnaissance Orbiter (MRO).\n\nLike all planets, Mars is lumpy, which causes the gravitational pull felt by spacecraft in orbit around it to change.\n\nFor example, the pull is likely to be a bit stronger over a mountain, and slightly weaker over a canyon. The gravity field was recovered using about 16 years of data that were continuously collected in orbit around Mars.\n\n“With this new map, we’ve been able to see gravity anomalies as small as about 100 km across and we’ve determined the crustal thickness of Mars with a resolution of around 120 kms,” said Mr. Genova in a paper published in the journal Icarus .\n\nThe better resolution of the new map helps interpret how the crust of the planet changed over Mars’ history. — IANS", 
    "section": "national", 
    "title": "Detailed gravity map gives best view yet of Mars", 
    "subsection": "general", 
    "date": "2016-03-23"
}