{
    "author": [
        "Special Correspondent"
    ], 
    "text": "REACH Lilly MDR-TB Partnership Media Awards 2016 presented to four scribes\n\nThe biggest challenge facing India is drug-resistant tuberculosis (DR-TB), said Anshu Prakash, joint secretary, Health Ministry ahead of the World Tuberculosis Day on March 24.\n\n“The DR-TB challenge is much bigger than HIV— which somehow positioned itself in the media to get enough attention. TB has not been able to do that. Over the past decade, there has been a drastic reduction in deaths and incidence, but we still need aggressive strategies and help from all stakeholders if we are to meet our health targets. The government cannot do this alone,” he added.\n\nMr. Prakash was speaking at the REACH Lilly MDR-TB Partnership Media Awards 2016 in New Delhi on Tuesday, instituted to recognize outstanding and responsible reporting on tuberculosis (TB).\n\nThe awards, were presented by Dr Lucica Ditiu. Executive Secretary of the STOP TB Partnership, Ambassador Jonathan Addleton, Mission Director, USAID India and Dr Nalini Krishnan, Director REACH were also present. Speaking on the occasion, Dr. Krishnan said, “There is an opportunity before us to collectively help in changing lives of those living with TB. We should work towards amplifying the voice of the patient community and help them access care with dignity.”\n\nAward for The Hindu reporter\n\nIn the English category, the winners were R. Prasad of The Hindu for his report on child-friendly, fixed dose combination drugs for TB, and Sonal Matharu from Governance Now for her report from Dhanbad on lack of proper public health records.\n\nIn the local language category, the awards were presented to Reji Joseph from a Malayalam publication, Rashtra Deepika and Prashant Dubey from Subah Sawere for a report on tuberculosis and malnutrition.\n\nTalking about the role of media, Blessina Kumar, chair, Global Coalition of TB Activists said, “Disseminating correct information about TB is critical. Just as important as it is to remain sensitive and responsible while reporting on the subject.”", 
    "section": "national", 
    "title": "‘DR-TB greater threat to India than HIV’", 
    "subsection": "general", 
    "date": "2016-03-23"
}