{
    "author": [
        "Tim Radford"
    ], 
    "text": "An interactive model gives an archaeologist’s-eye view of his skeleton\n\nMen dressed as medieval knights pose for pictures in Leicester in central England, at a site where the skeleton of British medieval king Richard III was found. The digital exhumation coincides with the first anniversary of Richard’s reinterment last year in Leicester Cathedral. —File Photo: AFP\n\nAt last, an archaeological dig you can explore from your sofa: Leicester University has launched an interactive digital reconstruction of the hasty grave and the distorted skeleton of one of England’s most vilified monarchs.\n\nKing Richard III claimed the throne of England in June 1483. By 22 August 1485, at just 32 years of age, he lay dead on a battlefield at Bosworth, victim of multiple injuries, living on only as the notorious Richard Crookback in Shakespeare’s take on the Wars of the Roses. And then in 2012, archaeologists found his body under a Leicester city council car park, known to be built over a site once occupied by Greyfriars Priory.\n\nLeicester University Archaeological Services has now released a computer model of the royal remains at rest in the hastily-dug pit in which the body was buried.\n\nThe model offers the opportunity, at the click of a finger, to exhume a monarch, observe the distorted spine, and note the awkward position of the head, enforced by the uneven base and sloping sides of the untidy grave.\n\nThe digital exhumation coincides with the first anniversary of Richard’s re-interment last year in Leicester Cathedral, and is based on photogrammetry software used to turn two-dimensional photographs into a three-dimensional exploration.\n\n“During the excavation in 2012, we took photographs of the skeleton from multiple angles to create a lasting record of how the king’s bones were positioned in the grave before we exhumed them,” said Matthew Morris, site supervisor of the team that found the missing king.\n\n“These photos were not taken with photogrammetry in mind, but the software is incredibly versatile and can be applied retrospectively to create this superb model.” The do-it-yourself exhumation is just one of a series of events centred around the anniversary.\n\nRichard III: Discovered is an exhibition at Highcross that will run until Wednesday. And the university has launched a free online course on the life and times of Richard III, a exploration of an episode described as a time “huge upheavals, including savage dynastic warfare, shifting allegiances among a powerful aristocracy, and significant depopulation.” — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Explore Richard III’s grave online", 
    "subsection": "general", 
    "date": "2016-03-23"
}