{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "In what may be a first in Tamil Nadu, over 100 homeless women living with mental illnesses have applied to be included on the voters’ list for the Assembly elections.\n\nThe women, residents of a home run by the non-governmental organisation The Banyan in Mogappair, queued up at an auditorium on Tuesday morning, giving their details to an official from the taluk office.\n\nSharadha*, who seems to be in her mid-forties, knows which parties are in the fray and their election symbols, and has almost made up her mind.\n\nAnother resident Rekha* had voted once, before she was diagnosed with mental illness.\n\nVisible indications of civic improvement — such as bus stops and roads are important to her — and she will consider these when she votes, she said.\n\nAttempt at inclusion\n\n“This is the first time residents of The Banyan are applying to register to vote. The United Nations Convention on the Rights of Persons with Disabilities, to which India is a signatory, mandates participation as a key goal among persons with disabilities,” said Vandana Gopikumar, co-founder of The Banyan. “This is particularly relevant in this context, considering persons with mental health issues, more so when the homeless are marginalised systematically. What better way to participate and experience agency and a sense of power than to engage proactively in the electoral processes. Such processes will help promote social inclusion,” she added.\n\nChief Electoral Officer Rajesh Lakhoni said that as per law, anyone not declared by a court to be of ‘unsound mind’ was eligible to vote. “Mental illness is not a permanent feature and people can decide who they want to vote for. But this should not be misused — people with mental illnesses must not be forced to vote in a particular way. The applications will be processed in due course,” he said.\n\n(*Names changed)\n\nOver 100 mentally ill women file applications for inclusion on electoral rolls", 
    "section": "national", 
    "title": "For an all-inclusive franchise", 
    "subsection": "general", 
    "date": "2016-03-23"
}