{
    "author": [
        "Somesh Jha"
    ], 
    "text": "It has drafted a detailed plan for 2016-17 with different themes\n\nThe National Democratic Alliance (NDA) government will mark its second anniversary with all the Ministries taking mass pledges on the Swachh Bharat portal on May 26 this year.\n\nIn a bid to make Prime Minister Narendra Modi’s pet project Swachh Bharat Mission a mass movement, the government has drafted a detailed plan for every day of 2016-17 with different themes every fortnight.\n\nCabinet Secretary P.K. Sinha has sent a calendar of ‘Swachhta Pakhwadas’ to all the Union Ministries early this month. The government’s first cleanliness drive, beginning on April 1, will target the slum areas and discourage them from manual scavenging, in a bid to mark the Ambedkar Jayanti on April 14.\n\nWhile teachers will be asked to hold sensitisation meetings with parents on Teacher’s Day, school children will be asked to clean the nearby monuments on World Heritage Day later next month, apart from asking all children to take mass pledges on Children’s Day.\n\nThe note sent by Mr. Sinha also mentions that citizens will be asked to “voluntarily” put ‘friendship bands’ on municipal workers serving in their area, as a part of the plan.\n\nWhile cleanliness drive will take place in all the religious places during Christmas eve, similar cleaning drives will be held in and around factories during the International Labour Day in May and around all water bodies and beaches and river banks on the World Water Day in March next year.\n\nEven soldiers will be asked to take 'Swacchata marches' in December and the cantonment board residents will be encouraged to take up cleanliness drives.\n\nFactories will be inspected to check the sanitary facilities for workers. Apart from the government officials, employee volunteers, residents welfare association residents and youth groups will take pledges as a part of the campaign in different months of the year. Sports personalities, who are Swachh Bharat ambassadors, will hold special drives on National Sports Day on August 29.\n\nTo mark the World Environment Day on June 5, awareness campaigns will be held in parks on safe disposal of animal excreta, apart from drives against littering in sanctuaries and forest areas.\n\nOrganisations and individuals will be felicitated on the second anniversary of the ‘Swachh Bharat Mission’ on October 2. During the Durga Puja later in October, pandals will be cleaned every day after ‘prasad’ distribution.", 
    "section": "national", 
    "title": "Govt. to focus on Swachh Bharat on second anniversary", 
    "subsection": "general", 
    "date": "2016-03-23"
}