{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The footage was manufactured, says Trinamool\n\nThe Calcutta High Court on Tuesday directed Narada news — the portal which had released the video footage of ruling Trinamool Congress leaders allegedly accepting wads of notes — to file an affidavit placing on record the details of the footage and the company behind it.\n\nHearing a public interest litigation petition on the sting operation which has created a furore in the State, a Division Bench comprising Chief Justice Manjula Chellur and Justice Arjit Banerjee said the affidavit needed to be submitted by April 5 .The hearing would be held on April 8.\n\nThe Bench also asked the company to make it clear whether the videos or recordings were doctored and whether there was any third party application.\n\nAppearing for Narada news, advocate Bimal Chaterjee claimed that the videos put out by the news portal were genuine and that the company would extend full cooperation to the court.\n\nTrinamool MP and advocate Kalyan Banerjee, appearing on behalf of his party, submitted before the court that the footage was manufactured. Pointing out that the videos were recorded in 2014, he raised question as to why the company remained silent for two years and released it ahead of polls in 2016.\n\nMr. Banerjee said the footage was not in public interest but in political interest and urged the court not to take up the matter before the Assembly polls.\n\nMeanwhile, with a fresh revelation made by Narada news coming to fore, the Opposition targeted the ruling Trinamool Congress. While the BJP submitted video footage to the Election Commission, State Congress president Adhir Ranjan Chowdhury said the revelation had led Trinamool chairperson Mamata Banerjee to change her strategy and instead of addressing public rallies she was organising walkathons.", 
    "section": "national", 
    "title": "HC asks Narada news to file affidavit on sting video", 
    "subsection": "general", 
    "date": "2016-03-23"
}