{
    "author": [
        "Girish Menon"
    ], 
    "text": "For Kerala Chief Minister Oommen Chandy, the five years in office from 2011 to 2016 has been a rollercoaster ride of sorts. He began his second term in office with a slender majority of just two legislators in the 140-member Assembly, with doubts about the longevity of the government formed by the United Democratic Front. The Congress, the major constituent in the UDF, was in a vulnerable situation winning just 39 seats out of the 80 it contested in alliance.\n\nSome deft and astute political moves ensured that the government’s survivability was never in question. Mr. Chandy, amid much opposition within his party, conceded an additional fifth berth in his Cabinet to the Indian Union Muslim League. A comfortable ruling majority was ensured by getting a rebel Communist Party of India (Marxist) legislator to quit and forcing a by-election to capture the seat. Later, the Revolutionary Socialist Party, hitherto a Left Democratic Front constituent, was accommodated within the ruling coalition when the party fell out with the CPI(M) leadership shortly before the 2014 Lok Sabha elections.\n\nMr. Chandy’s second term began amid optimism that he would be able to give a new direction to the State’s development process. He played up three key words —transparency, development and welfare — to capture the imagination of the development-starved State. His mass-contact programmes in all 14 districts became a hit. There was hardly any challenge during the first two years of his rule, with the Chief Minister emerging with a larger-than-life image in a coalition with leaders of varying ambitions.\n\nThe third year in office began on a bad note for Mr. Chandy. The infamous solar scam hit the headlines with the alleged involvement of some of his personal staff members. He would rather forget the entire year leading up to the Lok Sabha elections because he had to face one of the strongest agitations seeking his resignation for the solar scam. In the meantime, Mr. Chandy was forced to give up the prestigious Home and Vigilance portfolio. He found his position in the party eroding even as he conceded ground by agreeing to the induction of Ramesh Chennithala in the Cabinet with these portfolios.\n\nMr. Chandy’s regime got caught in the bar-bribery case that led to the resignation of a senior coalition leader, K.M. Mani, of the Kerala Congress (M), the third largest party in the UDF. Another Minister, K. Babu, nearly lost his job. A series of adverse court observations and verdicts related to the solar scam and the bar-bribery cases put Mr. Chandy and his government on the mat. Another Minister, K.B. Ganesh Kumar, had to be shown the door when his personal problems hit the headlines.\n\nMr. Chandy was able to survive crises banking on his political acumen. He did not allow the problems to cramp his style of functioning, promising prompt decisions and delivery on development projects. The Kochi Metro, Smart City, Vizhinjam port and Kannur airport projects were much talked about. Several welfare schemes were announced and the quantum of welfare for beneficiaries of existing schemes was enhanced.\n\nThe shadows of controversies, however, continued to stalk Mr. Chandy. His government had to face strong agitations by the LDF both inside and outside the Assembly in connection with the solar scam and later the bar-bribery case.\n\nMr. Chandy continues to maintain that the LDF had failed to come up with concrete charges to nail him. Instead, it had depended on the allegations of people with a dubious record.\n\nIt has indeed been a five-year dizzy rollercoaster ride for Mr. Chandy. Yet, he is optimistic about returning to power. His supremacy in the party is shaken, but he continues to enjoy the confidence of coalition partners, particularly the Indian Union Muslim League.\n\nKerala Chief Minister Oommen Chandy’s development plank has been torn by infamous scandals", 
    "section": "national", 
    "title": "In the harsh glare of solar and bar-bribery scams", 
    "subsection": "general", 
    "date": "2016-03-23"
}