{
    "author": [], 
    "text": "The walls of the almost 800-year-old Giotto’s bell tower in Florence have been defiled down the ages by millions of messages left by people.— Photo: The New York Times\n\nThe days of scribbling “I woz here” on Florence’s historic monuments are gone: from now on would-be vandals will be able to graffiti via app instead, with their messages kept for posterity.\n\n“Welcome to Giotto’s Campanile!” reads a message on a digital tablet for visitors scaling the Gothic white, green and pink marble tower by the famed Italian architect, which stands at one corner of the Cathedral in the Tuscan city.\n\n“We have been protecting masterpieces for centuries: starting from today we are going to remove graffiti from the Campanile’s walls. But if you — virtually — leave us a message, we will preserve it: just like a masterpiece,” it says.\n\nThe walls of the 14th-century bell tower, which is part of a UNESCO World Heritage Site, have been defiled down the ages by millions of messages left by people climbing the 400 steps to enjoy spectacular views of red-tiled rooftops.\n\n“Three months ago, when we began cleaning the walls, which had never been done before, we asked ourselves how we could avoid all the work going to waste in a short time,” said Alice Filipponi, social media manager for Opera di Santa Maria del Fiore, a not-for-profit organisation tasked with preserving many of Florence’s monuments.\n\nArchitect Beatrice Agostini, who heads up the organisation’s restoration arm, said the bell tower “was in an incredibly degraded and dirty condition”, with all elements — marble, stone, wood and brick — damaged by graffiti.\n\nMs. Filipponi said she had “an idea for an app which would allow the visitor to choose the surface [marble or wood for example], the colour and the instrument they want to use [felt pen, paintbrush, aerosol] to leave a virtual message or drawing.”\n\n‘Pietro was here’\n\nThe application, which is named ‘Autography’ and launched last week, is “a first,” Ms. Filipponi said, adding that she hoped to sell it to other sites plagued by heritage hoodlums.\n\nThree digital tablets have been installed on the 1st, 3rd and 4th floors of the tower and the messages are stored online ( http://autography.operaduomo.firenze.it/ ). Over 700 personalised scrawls were collected in the first week.\n\nJust like on the tower’s walls, where statues of kings and sibyls once stood, the messages range from declarations of adoration, despair over unrequited love and appeals for peace, to the simple “Pietro was here.”\n\nThey will be printed out each year and filed away in the Cathedral’s archives, alongside historic documents such as the deed appointing Renaissance designer Brunelleschi to build the Duomo’s dome, and the birth certificate of Lisa Gherardini, widely considered to have been the model for Leonardo da Vinci’s Mona Lisa .\n\n“The idea was to raise awareness among visitors about vandalism, but also give them the chance to leave behind a record, an everlasting sign of their passing through, without damaging the monument,” the Opera said in a statement.\n\nFrom smiley faces to hearts and doodled names, graffiti is the bane of restorers’ lives and is laborious to remove.\n\nWhile the cleaning job on the tower’s walls has managed to wipe off most of the pen or paint scribbles, words etched into the stone are still visible despite all efforts.\n\nUndeterred, conservators will turn their scrubbing brushes next year to the Cathedral’s dome — the largest such structure in brick ever constructed — and install tablets with the Autography app there as well. — AFP", 
    "section": "national", 
    "title": "Itching to graffiti? Do it digitally on Florence treasures", 
    "subsection": "general", 
    "date": "2016-03-23"
}