{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "With right-wing groups citing Sections of the Karnataka Hindu Religious Institutions and Charitable Endowments Act, 1997 to demand the removal of a Muslim Deputy Commissioner’s name from the invitation for a State-administered temple function, the government on Tuesday promised to amend the law.\n\nThe controversy over printing the name of Dakshina Kannada Deputy Commissioner A.B. Ibrahim on the invitation for the Sri Mahalingeshwara temple festival in Puttur triggered heated arguments in the Legislative Assembly on Tuesday, forcing Speaker Kagodu Thimmappa and members of the ruling and Opposition parties to take the government to task.\n\nNegating a fierce verbal exchange between members, Law and Parliamentary Affairs Minister T.B. Jayachandra promised to avoid such controversies in future by bringing an amendment to the Act.\n\nRaising the issue during zero hour, Sunil Kumar (BJP) demanded that the government withdraw the invitation in the name of Mr. Ibrahim, as demanded by the Vishwa Hindu Parishad, and reprint it .\n\nHe argued that the Act (Section 7) stated that “the Commissioner and every Deputy Commissioner or Assistant Commissioner and every other officer or servant, appointed to carry out the purpose of this Act by whomsoever appointed, shall be a person professing Hindu religion, and shall cease to hold office as such when he ceases to profess that religion”.\n\nIn response, K.R. Ramesh Kumar (Congress) demanded that the government repeal the law. “We are bound by the Constitution and the government has to repeal the law,” he said.\n\nD.N. Jeevaraj, C.T. Ravi and C.N. Ashwath Narayan (all BJP) criticised the government for allegedly violating the law and demanded changes in the Act. Mr. Jeevaraj even demanded appointment of Hindus in the Wakf board.\n\nSpeaker for new law\n\nThe issue rocked the House for some time and even Mr. Thimmappa expressed his displeasure by saying, “The present law is against the spirit of the Constitution and fraught with dangerous consequences.” He also vented his ire at the government by questioning, “Is it not possible to amend such a bad law in a day? Bring an amendment to the Act within 24 hours.”\n\nThe arguments ended only after Mr. Jayachandra assured that the Act would be amended to remove barriers of religion in conducting annual festivals of temples.\n\nFollowing protests by the VHP, a devotee of the Puttur Mahalingeshwara temple had filed a petition in the High Court of Karnataka seeking the removal of Mr. Ibrahim’s name from the invitation card, citing the law.\n\nMuzrai Minister Manohar H. Tahsildar said the government had submitted to the court that Mr. Ibrahim’s name was printed on the invitation in his capacity as the Deputy Commissioner of the district. On March 21, High Court judge A.S. Bopanna asked the petitioner’s counsel to submit relevant documents to establish the allegation and adjourned further hearing till March 24.\n\nFurore in Assembly over inclusion\n\nof Muslim officer’s name in temple festival invitation", 
    "section": "national", 
    "title": "Karnataka to amend HR&CE Act", 
    "subsection": "general", 
    "date": "2016-03-23"
}