{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The inquiry will unearth the conspiracy behind the incidents: Haryana CM\n\nThe Jat agitation last month left Haryana paralysed for over 10 days, and 30 people were killed in the violence.- FIle Photo: PTI\n\nHaryana Chief Minister Manohar Lal Khattar on Tuesday ordered a judicial inquiry to investigate the conspiracy behind a series of violent incidents during last month’s Jat agitation in the State.\n\n“A judicial inquiry would be conducted to completely unearth the entire conspiracy behind the series of sad and unfortunate incidents, which continued for almost 80 hours in the month of February this year,” said Mr. Khattar, replying to the adjournment motion demanded by Leader of Opposition Abhay Singh Chautala during the ongoing Assembly session.\n\nA press communication by the Haryana government stated Mr. Khattar said stern action had been initiated against erring officers and officials.\n\n“I would like to assure this august House that our government is capable of successfully handling any unpleasant incident. Strict and sufficient action will be taken against persons of criminal nature; innocent persons will not be unnecessarily harassed and all decisions will be taken on merit,” Mr. Khattar said, adding that any police or administrative official found negligent in discharge of duties will not be spared.\n\nMr. Khattar said: “In February this year, after the demand for reservation, the incidents were undoubtedly unfortunate. But to say the incidents occurred due to wilful negligence on the part of the Haryana government is completely untrue and baseless.”\n\nLast month’s Jat agitation had left the State paralysed for over 10 days during which at least 30 people were killed, over 200 injured and property worth hundreds of crores destroyed. Following this, the BJP government in the State had promised reservation for the Jat community and others by bringing a Bill during the Assembly Budget session.", 
    "section": "national", 
    "title": "Khattar orders judicial probe", 
    "subsection": "general", 
    "date": "2016-03-23"
}