{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "During the short three-nation visit next week, Prime Minister Narendra Modi will cover two of India’s foreign policy priorities by attending the Nuclear Security Summit in Washington DC, India-EU summit in Brussels and then by flying to Saudi Arabia in his first official visit, the Ministry of External Affairs (MEA) announced on Tuesday.\n\nThe 4th Nuclear Security Summit to be held from March 31to April 1, is significant as this is the last summit under President Barack Obama’s Presidency when countries, including India, will come out with a communiqué for the future of the nuclear security regime which will become a significant diplomatic achievement for President Obama and the world leaders. That apart, as per past summits, on April 1, member countries will also submit latest “progress reports” on steps taken to prevent non-state actors from gaining access to nuclear material. “Prime Minister Modi will also make some specific announcements during his intervention on nuclear security, which will be made public in due course,” MEA spokesperson Vikas Swarup said.\n\nThe summit which comes in the backdrop of the terror attacks in Brussels will highlight India’s official concerns on nuclear terrorism and the threat posed by terrorists gaining access to nuclear material.\n\nThe summit will also be unique for the big exhibition of the major nuclear energy producing firms at the venue, targeting the growing civilian nuclear energy market in developing countries.\n\nFollowing the visit to Washington DC, Mr. Modi will undertake the first official visit to Saudi Arabia between April 2 to 3. The visit to Saudi Arabia comes within a year of his visit to Dubai in August 2015. Landing in Riyadh on April 2, Mr. Modi will hold talks on bilateral, regional and global issues of mutual interest with the Saudi King Salman bin Abdulaziz bin Saud. Experts have pointed out that Iran, the rival of Saudi Arabia in the Gulf region, will be alienated by the visit.\n\nPM will undertake the first official visit to the Saudi Arabia between April 2-3", 
    "section": "national", 
    "title": "Modi to announce n-security plans in U.S.", 
    "subsection": "general", 
    "date": "2016-03-23"
}