{
    "author": [
        "Omar Rashid"
    ], 
    "text": "With his trusted aide Amar Singh by his side, Samajwadi Party chief Mulayam Singh on Tuesday visited Azamgarh after a gap of one year, and sounded the bugle for the 2017 Assembly elections from his parliamentary constituency.\n\nWhile Mr. Singh used the stage in east Uttar Pradesh to praise the development work done by Chief Minister Akhilesh Yadav, he also had a word of caution for his son, referring to a recent survey by a news channel, which predicted that the SP would slump to the third spot in 2017. The survey showed the SP lagging behind the Bahujan Samaj Party and the Bharatiya Janata Party.\n\nWhile Mr. Yadav, speaking a few days ago, downplayed the significance of the survey, the Opposition parties have used it to target the ruling party. BSP chief Mayawati said the opinion poll reflected people’s sentiment.\n\nIn his address at Azamgarh, Mr. Singh praised the SP government for fulfilling the promises made to voters and assured the people that the remaining work would also be completed soon. Terming Azamgarh “auspicious” for his party, Mr. Singh said whenever he had started the election campaign from the district, his party had emerged victorious.\n\nAfter winning the seat in the 2014 Lok Sabha elections, the SP chief made his first visit to Azamgarh in February last year, when he inaugurated development projects worth Rs. 1,987 crore. Carrying on from that, on Tuesday, the Chief Minister, in the presence of his father, inaugurated 38 projects and laid the foundation stone of 35 projects worth Rs. 665 crore. Important among them was the inauguration of the multi-facility Sathiaon sugar mill and co-generational plant worth Rs. 333 crore.\n\nThe talking point of the Azamgarh trip was the display of bonhomie between Amar Singh and the SP chief. While the party has remained mum, speculation is rife that Mr. Amar Singh could play a key role in the SP’s campaign in 2017. The two leaders flew together to Azamgarh from Lucknow.\n\nAmar Singh’s presence has given rise to speculation he may play a key role in 2017 polls", 
    "section": "national", 
    "title": "Mulayam visits Azamgarh after 1 year, sounds poll bugle", 
    "subsection": "general", 
    "date": "2016-03-23"
}