{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Modi to attend EU-India summit, to meet Belgian Prime Minister\n\nExpressing solidarity with Belgium over the multiple terror attacks on Tuesday, the Union government announced that Prime Minister Narendra Modi would travel as planned to Brussels on March 30.\n\n“The terror strike on Brussels was terrible and we stand in solidarity with the people and government of Belgium. The attack on Belgium once again underscores the need to counter terror unitedly,” said Vikas Swarup, External Affairs Ministry spokesperson at a briefing, as he announced Mr. Modi’s visit.\n\nSeparately, the Prime Minister tweeted about the attacks, calling the news from Brussels “disturbing”. “The attacks are condemnable. Condolences to families of the deceased. May those injured recover quickly,” he said in the message.\n\nMr. Modi is scheduled to travel to Brussels next Wednesday on his way to the U.S., and will attend the European Union-India Summit and hold bilateral talks with Belgian Prime Minister Charles Michel.\n\nOfficials told The Hindu that the summit, resuming after a break of four years, will see the resumption of talks on Bilateral Trade and Investment Agreement (BTIA), as the Free Trade Agreement is known.\n\nClimate cooperation\n\nApart from the trade issues, talks with EU Council President Donald Tusk and President of the European Commission Jean-Claude Juncker will focus on EU support to India on climate change cooperation, clean water projects and in particular, the Namami Ganga project.\n\nOfficials are already in Brussels to discuss the meetings, including EU Ambassador to India Tomasz Kozlowski, who was reportedly among hundreds of EU officials caught in the aftermath of the explosions in Brussels and the lockdown across the city.\n\nShortly after the attack, External Affairs Minister Sushma Swaraj tweeted that she had been in touch with India’s Ambassador to the EU Manjeev Puri, saying there had been no report of any Indians being killed in Tuesday’s blasts.\n\nHowever, official sources confirmed that two Indian citizens working with the Jet Airways were injured in the airport attack, including a woman crew member who had been taken to hospital. The Indian Embassy has set up a helpline number, +32-26409140, for citizens stranded in Belgium as all flights have been cancelled until Wednesday.\n\nMr. Modi’s visit will now be accompanied by heightened security concerns, said officials. Cooperation on fighting terror as well as deradicalisation and IS-related security issues are also likely to be highlighted during the bilateral meeting with Belgian Prime Minister Charles Michel, according to sources.\n\nApart from the bilateral meeting and the EU-India summit, Mr. Modi will attend an event organised for the Indian diaspora.", 
    "section": "national", 
    "title": "PM’s Brussels trip as scheduled", 
    "subsection": "general", 
    "date": "2016-03-23"
}