{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Ministry task force had given a set of criteria for selecting strategic partners\n\nWhen the much awaited Defence Procurement Procedure (DPP) is unveiled later this month, a critical reform, meant to induct the private sector in a major way into defence manufacturing, will be missing.\n\nSenior officials said there was still no clarity on how to select private companies to become strategic partners in defence procurement programmes despite recommendations of committees on ways to reduce India’s embarrassing dependence on imports. The DPP will be made public on March 28, coinciding with the DefExpo in Goa, and will come into effect from April 2.\n\nDefence Minister Manohar Parrrikar was quoted as saying that the chapter on identifying strategic private sector partners was going “through an extensive exercise that will take another month or two” and it requires approval from the Cabinet Committee on Security. The chapter which would have listed major Indian private sector companies identified for preferential treatment, would now be on hold.\n\nSenior officials, however, are not surprised. Nor is it the first time that a major recommendation to give private sector companies preferential treatment has run into obstacles.\n\nIn 2006, the UPA government had recommended Raksha Udyog Ratnas status to a dozen major private industry players giving them preference at par with defence PSUs in contracts. The government had to shelve the plan in the final moment because of opposition, from both the trade unions of DPSUs and from Indian private players who were left out of the list.\n\nThe present effort to grant the status of “strategic partners” flows from the recommendations of the Dhirendra Singh Committee, formed by the Modi government in May 2015, to evolve a robust policy to facilitate ‘Make in India’ in the defence sector. The report recommended identification of private sector companies that could play a key role in developing and manufacturing of complex and strategic systems or receive significant technology transfers from abroad for manufacture in India. The Ministry’s task force to work out the modalities for implementing the recommendation, suggested creation of two groups — group 1 for aircraft, aero-engines, helicopters, submarines, naval ships, guns and armoured vehicles and group 2 various materials and alloys, composites and polymers, and ammunition. It gave a set of criteria for selecting strategic partners.\n\n“How do we draw up a set of criteria without subverting merit?” a senior official wondered. The official said it was a highly contentious exercise and one where the government may not find an easy solution. There have been several rounds of discussions but a consensus is nowhere in sight, he admitted.", 
    "section": "national", 
    "title": "Private participation in defence production to wait", 
    "subsection": "general", 
    "date": "2016-03-23"
}