{
    "author": [
        "Devesh K"
    ], 
    "text": "The Enforcement Directorate on Tuesday filed a charge sheet against Goutam Kundu, chairman of Rose Valley Group, and others for allegedly cheating small-time investors from Odisha on the pretext of phenomenal returns.\n\nThe Central Bureau of Investigation, which in January filed the first charge sheet in its own case of cheating, conspiracy and breach of trust against the group, suspects that investors from Odisha, West Bengal, Assam, Jharkhand, Delhi, Rajasthan, Punjab, Madhya Pradesh, Andhra Pradesh and Tripura were cheated of about Rs.17,000 crore.\n\nFor its part, pertaining to Odisha-based investors, the Directorate studied over 3,000 bank accounts to establish the chain of transactions involving Rs.332 crore that were found in different accounts of Rose Valley Group of companies. “This is the biggest ever attachment of liquid cash by any government agency in the country,” said an official.\n\n“The charge sheet has been filed in a Bhubaneswar court under the Prevention of Money Laundering Act for Mr. Kundu’s prosecution and confiscation of properties worth Rs.332 crore. Mr. Kundu and his accomplices were allegedly involved in illegal collection of deposits of Rs.475 crore from hundreds of investors in Odisha,” said the official.\n\nThe accused laundered the funds by transferring the same to other shell companies allegedly set up by Mr. Kundu. The ED had earlier arrested him in the case and he is currently in judicial custody.\n\nIn its charge sheet, the CBI has named Mr. Kundu, his companies Rose Valley Hotel & Entertainment Ltd, Rose Valley Real Estate & Construction Ltd and Rose Valley Real Estate & Land Bank India Ltd in its charge sheet, along with managing director Sibamoy Dutta and directors Ramlal Goswami and Ashok Kumar Saha as accused.\n\nThe group had allegedly opened over 20 regional and 880 branch offices in different States. It had hired a large number of agents for fund collection.", 
    "section": "national", 
    "title": "Rose Valley head charged in Ponzi scam case", 
    "subsection": "general", 
    "date": "2016-03-23"
}