{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Date indicate why the metro is considered to be the epicentre of the tuberculosis epidemic\n\nOf the 5,000 cases of multi-drug resistant (MDR) tuberculosis recorded in Maharashtra in 2015, over 3,300 were from Mumbai – more than 60 per cent of the total cases in the State. These figures indicate why the metropolis is considered to be the epicentre of the tuberculosis epidemic.\n\nThe rising number of MDR cases has led the Sewri Tuberculosis Hospital, one of Asia’s largest TB treatment facilities, to suggest that more centres with in-patient facility be opened in Mumbai, particularly in the distant suburbs, to both help patients get treatment close to their place of residence and also contain the spread of the disease, which is possible when patients travel long distances. For example, a patient from Borivali in the western suburbs has to travel more than 40 km to reach the Sewri medical facility. A patient from Vashi, Navi Mumbai, has to travel over 80 km.\n\n“Of the 25,000 estimated cases of MDR-TB in India, 5,000 were in Maharashtra of which over 3,000 were in Mumbai alone,” said Dr Rajendra T Nanavare, medical superintendent of the Group of TB Hospitals, Sewri. He said that while TB numbers had remained more or less steady, the number of MDR-TB cases were piling up, leading to a logistical concern. “We have only 200 beds for drug-resistant cases and they are packed at all times. For drug-sensitive cases, we have about 1,000 beds and their occupancy is 80-85 per cent at any point,” he said.\n\nFor this reason, he said, there is a need to upgrade capacity and set up more centres. “Thane and Navi Mumbai, for instance, should have their own centres,” Dr Nanavare said. “There is a possibility of spread of infection when patients travel this distance to the hospital.”\n\nHe attributed general living conditions, slums, and significant migration for Mumbai’s TB burden. Besides, he said, there are certain parts tuberculosis hotspots in Mumbai. “There is a need to decentralise (the TB facility),” he said. While on the diagnostic front, Mumbai is almost well-equipped – there are 20 gene experts in the city for diagnosis – it falls short of doctors and health workers, and also adequate facilities to shoulder the load.\n\nGeneral living conditions, slums, and significant migration add to Mumbai’s TB burden", 
    "section": "national", 
    "title": "Sixty pc of TB patients in Maharashtra are from Mumbai", 
    "subsection": "general", 
    "date": "2016-03-23"
}