{
    "author": [
        "Bishwanath Ghosh"
    ], 
    "text": "Tucked away on a main street:The West Bengal headquarters of the CPI(M) on Alimuddin Street in Kolkata. Even the elections have not made the office attract attention to itself.— PHOTO: Ashoke Chakrabarty\n\nHeadquarters of large political parties are often visible from a mile, especially during election time: streams of visitors walking in and out, hangers-on seeking a few minutes with leaders, and the permanent bustle at their gates attracting policemen and tea-sellers alike.\n\nBut as the taxi drove through Alimuddin Street, off A.J.C. Bose Road, neither me nor the driver spotted a building that could look like the office of a prominent political party. Finally, a rickshaw-puller told us that we had already crossed Muzaffar Ahmad Bhavan and needed to reverse about 50 metres.\n\nMuzaffar Ahmad Bhavan happens to be the West Bengal headquarters of the Communist Party of India (Marxist), or CPI(M), which ruled the State for 34 years until 2011, when the Mamata Banerjee-led Trinamool Congress stormed to power on the wave of paribartan , or change.\n\nThis is 2016 — time to avenge the defeat — but the building sits inconspicuously on the very street that is synonymous with the CPI(M), leave alone resembling a war room.\n\nNew roles\n\nThirty-four years is a long time — so long that when the CPI(M)-led Left Front was voted out of power, it had forgotten what it was like to be in Opposition. On the other hand, Mamata Banerjee, who fought the Left on the streets of Kolkata for decades, continued to behave like an Opposition leader even after becoming Chief Minister.\n\nWhile Ms. Banerjee stood nothing to lose by being combative even as a ruler, the Left Front’s failure to sharpen its claws against her government early enough has resulted in its decline as a strong political force in West Bengal, so much so that it is now tying up with a one-time foe, the Congress, to take her on.\n\n“We decided to remain quiet for the first two years because we wanted to give her time to perform,” a senior CPI(M) leader and long-time Minister in the Left Front government said, when asked why the party appeared to be passive for much of the time it was out of power.\n\nHe did not say whether according that luxury to the Trinamool Congress was a mistake, but he did admit to other mistakes the Left Front had made during its rule, which included the “arrogant behaviour” of the government in dealing with farmers while acquiring land for a chemical plant in Nandigram and a car factory in Singur.\n\n“Another mistake was to withdraw support to the UPA government [at the Centre in 2008] over the nuclear deal with the U.S. It allowed the Congress to become friends with the Trinamool Congress,” the CPI(M) leader said.\n\nAdmitting to these well-known mistakes apart, the Left Front appears to have done little to reinvent itself in the past five years even as Ms. Banerjee went about earning goodwill with people-friendly schemes such as Kanyashree (monetary incentive for education of the girl child) and beautification of Kolkata. Her drive to turn the city into another London had initially earned ridicule — a replica of Big Ben now stands on the road leading to the city from the airport — but today even her detractors admit that the city’s roads have never been better and cleaner.\n\nThe Left Front, at the moment, is seeing victory in the fact that the Congress, which fought alongside Ms. Banerjee in the 2011 elections, is now on its side. “For the past eight months or so, we have been constantly holding protest meetings and going to the people. Why else do you think the Congress has agreed to fight the elections with us? They can see the political situation changing,” a CPI(M) member assigned to work at Muzaffar Ahmad Bhavan said.\n\nBut at the same time, the party is careful not to call the Congress an ally — because it is fighting the Congress in Kerala — and is terming the pact with its former foe an “electoral adjustment”. A mere adjustment, and not an alliance, that too without a popular face leading the campaign, does not pose a formidable challenge to Ms. Banerjee who, through repeated radio jingles, is promising not only bhalo din (achche din, or happy days) but aaro aaro bhalo din (more and more happy days). The question before the undecided voter is: “If I do not want to vote for Mamata, whom should I vote for?” The Left Front would want such voters to press the button for a “Left democratic secular government,” as it has appealed in its manifesto, in a sharp departure from the past when it asked voters to elect the Left Front.\n\n“The Left’s priority is not to come to power, but to remove the Trinamool Congress from power,” the CPI(M) member said. “And don’t go by the absence of our flags and posters on the street. We were invisible even in 1977 — you couldn’t spot a single Communist on the streets, but people voted for us. I am not saying that we will see a repeat of 1977, but we will see something similar.” “So you are confident of winning?” I asked him. “I am not saying that,” he replied, “only the results can say who will win. All I can say is that until eight or nine months ago, the Trinamool had an edge. Today it is going to be a tough fight for both.”\n\nThe Left Front appears to have done little to reinvent itself in the past five years", 
    "section": "national", 
    "title": "The silence of being out of power", 
    "subsection": "general", 
    "date": "2016-03-23"
}