{
    "author": [
        "Marri Ramu"
    ], 
    "text": "protests resume:Students of the University of Hyderabad attacked Vice-Chancellor P. Appa Rao’s office on Tuesday after learning that he was resuming duty.— Photo: Nagara Gopal\n\nViolent protests struck the University of Hyderabad campus on Tuesday as Professor P. Appa Rao resumed duty as Vice-Chancellor. Students ransacked the Vice-Chancellor’s Lodge in the morning after learning about the return of Prof. Appa Rao who had gone on leave following research scholar Rohith Vemula’s suicide. Parts of the university at Gachibowli resembled a war zone with broken windowpanes, office furniture, computers and scattered papers.\n\nThree policemen were injured in stone-throwing by students. Five students were detained as student groups hurled stones at the police when they were being moved out of the protest spot.\n\nTrouble began at 10.30 a.m. when students started assembling near the V-C’s Lodge. Prof. Rao was holding a meeting with deans and staff. Even as university security officials closed the gate, the students entered the site by scaling the wall. They demanded that the V-C leave the premises.\n\nWith no one responding to their slogans and demands, some students started damaging flower pots in the corridor. A couple of journalists trying to click pictures with their phones were threatened. “No photos please,” the agitators warned. Within a few minutes, the students broke open the main door and barged inside. They shattered glass panes and ransacked the rooms on the first floor.\n\nThe local police arrived and additional forces in riot gear were brought in as the number of students swelled.\n\nStudents continued their protest till 5 p.m. and didn’t pay heed when the police asked them to leave the premises. The police used force to evacuate them. Students were chased, dragged and manually lifted and bundled into waiting police vans.", 
    "section": "national", 
    "title": "Violence again on Hyderabad campus", 
    "subsection": "general", 
    "date": "2016-03-23"
}