{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Bribing voters is so prevalent in T.N. that the poll panel has to intensify efforts to check it\n\nWith the Election Commission of India already seizing crores of rupees in Tamil Nadu since the model code of conduct came into effect for the Assembly elections, the State’s dubious reputation as an epicentre of the “cash-for-votes” menace gets further substantiation.\n\nOn March 16, the commission said that of the Rs. 11 crore of “illegal cash” confiscated, Tamil Nadu accounted for Rs. 7.44 crore — Kerala came a distant second with Rs. 2.97 crore. The commission prefers to hold a single-phase poll in Tamil Nadu to check the mounting corruption.\n\nFollowing the infamous Tirumangalam by-election in 2009, when the then ruling Dravida Munnetra Kazhagam was accused of deploying ingenious methods to put cash in the hands of voters, the State has been the focus of the commission’s efforts to curb the flow of money during elections. However, top officials say it is close to impossible to stop this blatant bribing, given how parties have institutionalised the strategy.\n\nThe former Chief Election Commissioner N. Gopalaswami says the seizures are only the tip of the iceberg. “Nowhere else in India is cash such a colossal problem as in Tamil Nadu,” he says.\n\nWhile cash and non-cash seizures amounted to Rs. 58.16 crore during the Assembly elections in 2011, the sum went up to Rs. 76.89 crore during the Lok Sabha elections in 2014.\n\nMr. Gopalaswami says the political parties in Tamil Nadu show no hesitation in doling out cash, to such an extent that a point man is appointed for a block of houses to ensure the distribution of favours in cash and in kind.\n\nFrom placing currency notes in newspapers to hiding cash beneath plantain leaves at community feasts in temples, the parties have devised hundreds of strategies to evade detection. Mr. Gopalaswami says parties even used to distribute coupons which could be encashed or exchanged for freebies at a later date.\n\nHowever, hardly anybody has been convicted of the crime of distributing cash during elections. “In fact, even arrests are rare. It is very difficult to prove that the cash seized was for distribution to voters. Those caught will deny it and clinching evidence is rarely found,” he says. So efficient are the parties that a pilot vehicle goes out to look for checking squads before the cash vans arrive.\n\nEven the flying squads are accused of collusion with the offenders by deliberately delaying action. Sources say this is one of the reasons for the commission to install GPS-enabled tracking systems in the vehicles of the squads.\n\nThe State’s Chief Electoral Officer, Rajesh Lakhoni, says the commission has come up with a number of measures to curb bribing of voters.\n\nThey include deploying of static surveillance teams and flying squads and surveillance teams set up by the Income Tax Department in all 32 districts of the State. A dedicated toll-free number (1950) has also been set up to receive complaints. In 2014, the commission came out with mobile applications to help voters report cash distribution.\n\nWhile there is a consensus that cash undermines the very working of a democracy, observers are not too certain about the potency of cash to change outcomes in a big way.\n\nImpact\n\nPolitical commentator R. Mani says that in Tamil Nadu, the ruling party has continuously lost elections since 1989.\n\n“It is a big question if cash could be used as the main strategy to sway voters. It becomes a potent force in a by-election because of the small geographic area and a culture of the people expecting cash,” he says.\n\nHowever, Mr. Mani says cash and freebies may play a crucial role in a multi-cornered contest when the margins become narrower.\n\n“This is why 2016 is important because we are looking at a six-cornered contest. In many seats, the margins could be just a few hundred votes and cash may make an impact,” he says.\n\nPlacing notes in newspapers; hiding cash beneath plantain leaves at feasts — parties have devised many strategies", 
    "section": "national", 
    "title": "When cash turns up like a bad penny", 
    "subsection": "general", 
    "date": "2016-03-23"
}