{
    "author": [], 
    "text": "65 contestants are vying for €50,000 prize money during the week-long competition being held in the Red Sea resort of el-Gouna\n\nA man makes his way before the first stage of the world kite boarding championship in Egypt’s Red Sea resort of el-Gouna.— Photo: AP\n\nCompetition for the world kiteboarding championship has kicked off in Egypt’s Red Sea resort of el-Gouna, with 65 people from 26 countries shooting across the water and twirling through the air in hopes of winning €50,000 (Rs. 37,42,169) in prizes.\n\nThe week-long rally that began on Monday is the opening round of the extreme sport’s 2016 title, with prizes awarded for freestyle, trick-based manoeuvres and another in the “big air” category for whoever can fly off the surf the highest.\n\n“[I’ve] been to most of the places already, hopefully this year I am aiming for the world title again and definitely I’ll do my best,” said Youri Zoon from the Netherlands, a 26 year-old former champion, currently ranked in second place. Kiteboarding, also known as kitesurfing, is a fast-emerging sailing sport in which riders strap themselves to a parachute-like kite and use the wind to pull them along while standing on a board attached to their feet, with speed records of over 50 knots.\n\nIt is a popular draw for foreigners to Egypt, where the tourism industry has been hit hard by years of instability since the country’s 2011 uprising and the Army’s subsequent 2013 ouster of Islamists that fanned a militant insurgency.\n\nThe Islamic State group claimed the bombing last October of a Russian airliner flying from the Sharm el-Sheikh resort in the Sinai Peninsula across the Red Sea from el-Gouna that killed all 224 people onboard.\n\nFrance’s current national champion, 21-year-old Antoine Fermon, who picked up the sport while growing up in Tahiti, said that the 10-strong French team received a warm welcome in El-Gouna and was not worried about security.\n\n“We arrived at the airport, the taxi came to pick us up, frankly without a single worry, and nobody talks of problems that are here,” Fermon said. From Cairo, 28-year-old Ingie El Mor was the only Egyptian woman taking part in the tournament, competing in the “big air” category.\n\n“Here in Egypt we have the best conditions for kiteboarding, Egypt is already ranked one of the best kitesurfing spots in the world. The wind is constant, the water is flat so we have to use that,” El Mor said. — AP", 
    "section": "national", 
    "title": "World kiteboarding championship kicks off in Egypt", 
    "subsection": "general", 
    "date": "2016-03-23"
}