{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Euphemistically known as the “wild west of the east,” Bihar, under Chief Minister Nitish Kumar, has been struggling to shed its unflattering nomenclature by reining in criminals and their gangs. Mr. Kumar’s two-day meeting with senior police officials ended on Friday with many decisions to nab criminals and control crime in the State.\n\nA few gangs busted by the Bihar police in the past few days have interesting names. The “Bournvita Gang” of young criminals who robbed two-wheelers and snatched gold chains in Patna, for instance, gave them sleepless nights.\n\nMost of the gang members, the police said, are school students who took to criminal activities to buy expensive gifts for their girlfriends.\n\nIn April 2014, members of the “Mines Gang” were arrested for using “advertising campaigns” on social network sites to cajole people to join them, and terrorise those who refused.\n\nAsked by the Patna police why the gang, led by one Bittu Kumar, called itself the “Mines Gang,” Kumar said he did not know – he just fancied the name.\n\nIn 2013, members of the “Rockezers Gang”, the “Blade Gang” and the “Talwar (sword) Gang” too were arrested by the Patna police for their involvement in petty crimes. The members of the “Talwar Gang” were from the upper caste and had number plates resembling two crossed swords on their two-wheelers.\n\nSome of the criminals either arrested by the police or evading arrest too have amusing names. Horlicks Yadav, Dahi (curd) Gope, Lotha Gope, Bindu (dot) Singh, Chawannia (25-paisa coin) and Pakauria (snacks) have been troubling the police for quite some time now. Some criminals like Rinku Halwai, Vicky Paswan and Kallu Dom carry their caste names to identify themselves.\n\nThe modus operandi adopted by criminals is equally bizarre. On Thursday, a woman was caught while passing marijuana-stuffed litti (a popular snack) to her husband in Patna’s Beur central jail. Litti (usually stuffed with gram flour) and Chokha (mashed potato) are among Bihar’s favourite food. Meena Devi had come to hand over marijuana-stuffed littis to Ramchandra Paswan. She has been arrested and sent to the same jail.\n\nOn February 5, the Katihar jail authorities recovered two mobile phone SIM cards from the rectum of an inmate, Arnab Das.\n\nOn an average, eight murders and three rapes take place every day in Bihar. According to police records, 19,6407 criminals and accused persons were arrested and 22,461 theft cases reported in 2015.\n\nHorlicks Yadav, Bournvita Gang and Dahi Gope have\n\nbeen giving police sleepless nights", 
    "section": "national", 
    "title": "Bihar’s criminal gangs have palatable prefix", 
    "subsection": "general", 
    "date": "2016-02-13"
}