{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Suresh Rana is not the first BJP leader to raise allegations about terrorists being trained in madrassas.\n\nIn an indication of the polarised discourse of UP by-polls, Suresh Rana, the BJP MLA from Thana Bhawan in Uttar Prdesh equated Muslims living in Deoband as \"those who plan Pathankot like attacks\" while addressing one of the last campaign public meetings in Deoband for the by-polls scheduled on February 13. Though campaigning ended on Thursday, video and audio clips of Rana's provocative speeches were being shared on social media platforms like Watsapp and facebook groups.\n\nThe election speeches of BJP leaders during the campaigning remained polarising and controversial. The speech video of Rana comes day after the BJP candidate from Deoband Rampal Pundir had during an election public meeting allegedly said that if he wins the poll, “Muslims will feel scared. They and their goons will feel our terror”.\n\nIn the clips being frequently shared on social media platforms, another BJP leader Manoj Chaudhary is seen in another clip, saying that he will cut any finger which will be raised on Hindus, reminding the speech of BJP leader Varun Gandhi about cutting hands of Muslims.\n\nRana also made several reference to “people who do not believe in saying 'Bharat Ma ki jai”. There were several controversial references to Darul-Uloom Deoband which the town is famous for, without naming the seminary.\n\n“You should raise the slogan of Bharat Mata so loud that least those living in Deoband who plan terror attacks like Pathankot should hear Bharat Mata ki jai. So that the slogan goes to all the lanes of Deoband and comes back to this Ram chowk and those who plan Pathankot attack disappear from Deoband,” added Rana amid passionate slogans of “Har Har Mahadev” and “Jai Shriram”.\n\nRana is not the first BJP leader who raised allegations about terrorists being trained in madrasa. Several leaders of the BJP like Sakshi Maharaj and others in the past gave controversial statements about religious seminaries.\n\nRana, an accused in the 2013 Muzaffarnagar riots cases, also invoked Muzaffarnagar riots, rape of Hindu women and “gundagardi of a particular community” while asking for votes in Deoband.\n\n“Everybody who talks about the honour of our sisters and mothers is slapped with the National Security Act...I want to tell Mulayam Singh and Akhilesh Yadav that nobody has the guts to stop me from talking about saving the honour of our sisters and daughter,” he added while sharing the stage with Rampal Pundir the BJP candidate from Deoband.\n\nRana was jailed and is out on bail, for his alleged role in inciting the riots. The Samajwadi Party government had slapped NSA on him which was later withdrawn by Allahabad High Court.\n\n“The government registered false cases on us during the riots. I have a dream that the actual culprits of Muzaffarnagar riots will be made to suffer,” Rana said.\n\nReferring to protest by Muslim community over “objectionable” statement of a Hindu mahasabha leader Kamlesh Tiwari against the prophet, Rana said, “Do not try to scare people by gathering a crowd of few thousands. If you can gather four thousand, we have the power to call a crowd of fifty thousand.”\n\n“Can our sisters go to tution-centers alone early morning or at odd hours,” he said while invoking the narrative of “Hindu women under attack from Muslim men”, BJP has been talking about in the by-poll. “Saving the honour of Hindu women” is the prominent campaigning slogan of the BJP in the UP by-poll.\n\nManoj Chaudhary, a former BSP MLA who last week joined BJP “I along with the BJP candidate Rampal Pundir will work to finish the gunda raj of one particular community. And I want to emphasise from this stage that after that you will be able to walk proudly and fearlessly in the market with head held high and puffed chest. And if anybody would raise their finger over you, we will work to cut the finger,” Manoj Chaudhary told the crowd amid chants of 'Jai Shri Ram”.", 
    "section": "national", 
    "title": "BJP MLA throws taunts at Deoband Muslims", 
    "subsection": "general", 
    "date": "2016-02-13"
}