{
    "author": [
        "S Prasad"
    ], 
    "text": "Leader of Opposition in Rajya Sabha Ghulam Nabi Azad on Friday said that people of the country were fed up with the Bharatiya Janata Party and if elections were held now the BJP would not come to power.\n\nSpeaking at a function to felicitate E. Valsaraj on his completing 25 years as a legislator from Mahe, Mr. Azad said that people across the country were fed up with the performance of the Prime Minister Narendra Modi and the BJP. He said the BJP’s performance in the last two years was zero.\n\nTaking a dig at the AINRC-BJP alliance, he said the BJP-led NDA has not taken the Chief Minister of Puducherry seriously. Puducherry is not at all in the agenda of the BJP. It is only the Congress that catered to the needs of the Union Territory. When the ruling AINRC assumed office lot of promises were made by the Chief Minister to get special funds and statehood for the Union Territory. But nothing had been done by the Government, he said.\n\nMr. Azad said the party should not look for alliances all the time and be dependent on political parties. Sometimes it becomes a habit to be dependent on political parties. What we need in the southern part of the country, particularly Puducherry, is determination and self-confidence.\n\nThough the Congress struck an alliance with the AIADMK in Tamil Nadu in 2001 the party (AIADMK) refused to have an alliance in Puducherry.\n\nThe Congress decided to contest the election in Puducherry without an alliance and yet we formed a government. Should there not be any alliance we are not going to sit. We should be confident like we were in 2001 and victory will be ours, he said.\n\nAICC general secretary Mukul Wasnik said that the ruling AINRC had miserably failed in performing its duties and there had been no perceptible development in the last five years.\n\nWith elections nearing the government will come up with many claims. The Congress will come up with a chart of the failure of the State and Congressmen will widely campaign against the failure of the government.\n\nFormer Union Minister for State V. Narayanasamy said that partymen should accept the decision the high command would take on alliance and must put in hard work to restore congress rule in the Union Territory.", 
    "section": "national", 
    "title": "BJP will not come to power, says Ghulam Nabi Azad", 
    "subsection": "general", 
    "date": "2016-02-13"
}