{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Despite a huge deficit, Kerala Chief Minister announces many populist measures\n\nLDF leaders staging a sit-in before the Kerala Assembly after boycotting the presentation of the budget in Thiruvananthapuram on Friday.— Photo: S. Gopakumar\n\nDespite anticipating a massive deficit of Rs. 2,041.22 crore at the end of 2016-17, Kerala Chief Minister Oommen Chandy has come out with several popular measures.\n\nThese include free ration for BPL and AAY families, insurance cover for 30 lakh social security pensioners, power subsidy for cash crops, interest subvention scheme for ITI and polytechnic students, and a slew of concessions and assistance for the indigent sections of society.\n\nThe election-focussed budget, presented in the absence of the Opposition, which boycotted the House after a brief demonstration as part of its protest against the government over corruption issues, had all the trappings of a transition exercise, particularly in its focus on social sector initiatives and infrastructure development.\n\nThe Chief Minister generally confined himself to the annual Plan allocations, but took care to announce several infrastructure development initiatives and social sector interventions, leaving it to the next government to find the resources for all these, besides the already committed expenditure of Rs. 7,200 crore for revision of wages of State employees and teachers.\n\nThe key initiatives mooted in the area of infrastructure development include an elevated corridor from Kovalam to Kasaragod on the western side of National Highway 3, creation of a common fund to finance 17 select projects, including several ongoing projects such as Kochi Metro, Light Metro projects in the State capital and Kozhikode, suburban rail corridor, the airstrip at Bakel, the multi-modal transport system and an electronic hardware park in Kochi, and the Kollam and Alappuzha bypasses.\n\nAlso envisaged are 20 mega projects under the District Flagship Infrastructure Project (DFIP), to be implemented in two phases with a total outlay of Rs. 2,669.5 crore, and creation of industrial parks with private participation on the PPP model.\n\nSocial sector schemes\n\nIn the social sector, the Chief Minister announced several schemes and support programmes, including a Rs. 100-crore scheme titled ‘Kanivu’ to cover the bedridden, the lonely and the mentally ill; separate schemes to support those with juvenile diabetes, kidney ailments, and cerebral palsy, and other related illnesses.\n\nThe Chief Minister estimates that the government would end 2016-17 with a deficit of Rs. 2,041.22 crore after factoring in budget-triggered new expenditure of Rs. 1,575 crore, concessions totalling Rs. 330.45 crore and additional resource mobilisation of a meagre Rs.112 crore.", 
    "section": "national", 
    "title": "Chandy rolls out a poll-centric budget", 
    "subsection": "general", 
    "date": "2016-02-13"
}