{
    "author": [], 
    "text": "A day after Facebook closed its controversy-ridden Free Basics programme, India Head of the social media giant Kirthiga Reddy said she is moving back to the US. Ms Reddy said she along with William Easton, Managing Director of Emerging Markets (APAC) and Dan Neary, VP Asia Pacific, have started looking for her successor in India.\n\nFacebook yesterday shut down ‘Free Basics’ in India, days after telecom regulator TRAI barred operators from charging discriminatory rates. for Internet access based on content.\n\n“When my family relocated to India, we knew that we would move back to the US some day. It’s a bittersweet moment to share that the return timeframe is coming up in the next 6-12 months,” Ms Reddy, who is Facebook India Managing Director said in a post on the social networking site on Friday.\n\n“It will be business as usual over the next 6-12 months. I am working closely with William Easton and Dan Neary as we search for my successor in India. I have also begun to explore new opportunities at Facebook back at Menlo Park,” she added.\n\nFree Basics was offered in India in partnership with Reliance Communications and was earlier known as Internet.org. Telecom Minister Ravi Shankar Prasad has also slammed Free Basics saying such differential pricing modes are “plainly not acceptable” and Internet should not become a monopoly of few.\n\nAfter months long consultation process, triggered by the net neutrality debate, Telecom Regulatory Authority of India (Trai) earlier this week barred operators from charging different rates for data access, dealing a blow to Free Basics and other such plans like Airtel Zero.\n\nWhile Facebook had promoted Free Basics as a programme aimed at providing basic Internet access to people in partnership with telecom operators, critics slammed the service saying it violated the principle of net neutrality. — PTI", 
    "section": "national", 
    "title": "Facebook India head to return to the US", 
    "subsection": "general", 
    "date": "2016-02-13"
}