{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "A committee of Goa government officials is considering whether peacock, the national bird and bison, Goa’s State animal, could be termed vermin (‘nuisance animal’). Environmentalists fear this could expose these species to mindless killing.\n\nGoa’s Agriculture Minister Ramesh Tawadkar said on Friday that peacocks, like monkeys and wild boars, cause enormous damage to agricultural crops and “should be declared vermin” and culled periodically. Goa Pradesh Congress Committee president Luizinho Faleiro described the thinking ridiculous and called the move “suicidal” as it would lead to environmental damage.\n\nThe Minister, however, said that no species of animals or birds, including the peacock, have yet been declared vermin. He clarified that farmers from hilly areas have been complaining of peacocks damaging their crops. Mr. Tawadkar said the committee was considering the issue.\n\nHe recalled that in the winter session of the Assembly, the government had said a committee would be formed to study the problems monkeys and wild boars caused farmers and to possibly declare them as vermin.\n\nChief Minister Laxmikant Parsekar had said the issue of monkeys was under consideration when members were discussing the growing menace of Kyasanur Forest Disease (KFD) or what is locally called “monkey fever” in Sattari taluk of north Goa.\n\nAlready two have died of ‘monkey fever’ this year.\n\n“The time has come to classify monkeys and wild boars who regularly destroy fields as vermin,” Mr. Parsekar had said in the Assembly responding to the discussion on KFD. Peacock as the national bird is a protected species under Schedule 1 of the Wildlife Protection Act, 1972.\n\nMr. Tawadkar, during a media interaction in south Goa on Thursday, suggested that the State animal the Great Indian bison, also a protected species, could also be classified as vermin or a ‘nuisance animal.’", 
    "section": "national", 
    "title": "Goa mulls over declaring peacock, bison vermin", 
    "subsection": "general", 
    "date": "2016-02-13"
}