{
    "author": [
        "Girish Pattanashetti"
    ], 
    "text": "Thousands of people gathered at the funeral of Lance Naik Hanamanthappa Koppad at Betadur village in Dharwad district of Karnataka on Friday.— photo: Kiran BAkale\n\nAll roads led to Betadur in Karnataka on Friday, as Lance Naik Hanamanthappa Koppad was laid to rest in his native village with full state and military honours.\n\nThousands of villagers from all around Betadur — from schoolchildren to infirm elders — started gathering from early morning to pay their respects to the soldier who miraculously survived an avalanche at Siachen on February 3, but died on Thursday at the Army hospital in Delhi.\n\nRanging from small village paths to arterial roads, there were portraits of Hanamanthappa all along the route to Betadur from Hubballi (about 18 km).\n\nSlogans such as ‘Hanamanthappa Amar Rahe’, ‘Jai Jawan, Jai Kisan’ and ‘Bharat Mata Ki Jai’ reverberated in the air even after the funeral got over late in the afternoon. Music bands further charged the atmosphere by playing patriotic songs.\n\nAfter a stop at Hubballi’s Nehru Stadium, where around 40,000 people paid their respects, the mortal remains of the soldier were brought in an embellished military truck to Betadur, with scores of vehicles carrying Hanamanthappa’s portrait and tricolour following it. After pre-funeral rituals at the soldier’s house in the village, the body was kept at the government school to allow people to pay their last respects.\n\nChief Minister Siddaramaiah, who had received the body at Hubballi Airport on Thursday night, paid his last respects at the Nehru Stadium on Friday and visited the soldier’s family in Betadur before proceeding to attend his other engagements.\n\nHis Cabinet colleagues H.K. Patil and Vinay Kulkarni, Union Minister Ananth Kumar, former Chief Minister Jagadish Shettar, and senior officers of the Madras Regiment and the Maratha Light Infantry were among those who attended the funeral.\n\nSiddaramaiah, his Cabinet collegues and senior Army officers paid their last respects", 
    "section": "national", 
    "title": "Hanamanthappa laid to rest with full military honours", 
    "subsection": "general", 
    "date": "2016-02-13"
}