{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "The LeT commander Sajid Mir purchased 15-20 yellow and red bands at the the Siddhivinayak temple as part of the plan.- File photo: Paul Noronha\n\n“I thought the Lashkar-e-Taiba [LeT] would be interested in attacking the Shiv Sena Bhavan or even assassinating its head [Bal Thackeray]”, said American-Pakistani terrorist David Coleman Headley before a special court on Friday.\n\nContinuing his deposition via video conferencing, Headley told judge G.A. Sanap that LeT commander Sajid Mir had told him to maintain good relations with the chief of public relations of the Sena leader Uddhav Thackeray for getting easy access to the building. He visited the building two-three times and made videos of it from the inside and outside and handed them over to either Mir or Major Iqbal, he couldn’t recollect.\n\nHeadley said: “I discouraged the LeT not to attack the Siddhivinayak temple and the Naval Air Station because they were both heavily guarded. He said he purchased 15-20 yellow and red bands at the temple for the terrorists who would attack on November 26, 2008, and handed over the same to LeT commander Sajid Mir, who thought it was a good idea as it would be a sign that the attackers were Indians.”\n\nThe 26/11 mastermind and chief operational commander of LeT, Zakir-ur-Rehman Lakhvi, thought that the Gateway of India and the Naval Air Station would be good and safe landing points for the attackers but Headley opined otherwise. He said the attackers would have to navigate around sensitive naval installations and they could be intercepted, and that all of them would have to be deployed in one place. Headley also surveyed Badhwar Park at Cuffe Parade as the safest landing site as it would give the practical advantage of small hutments, slums, and cottages to get to the main road.\n\nAfter all the landing sites were decided, Headley handed over the GPS readings of the locations to LeT handler Abu Khaffa. Lakhvi told him that the attacks need to be successful as it would be a revenge for “all the bomb blasts India did in Pakistan.”\n\nHeadley told the court that after videos of all sites were given to Major Iqbal, serving in the Pakistani Army, he [Iqbal] was “upset and unhappy” about the fact that the Mumbai Airport was not selected as one of the locations for attack in November 2008.\n\nIn July 2008, four months before the attack, Headley visited Nalanda Book Shop situated at Taj Hotel and purchased the book “Indian Army 2020” as he was interested in knowing what the Army would be like in 2020.", 
    "section": "national", 
    "title": "‘I discouraged attack on Siddhivinayak temple, Naval station’", 
    "subsection": "general", 
    "date": "2016-02-13"
}