{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "In a first indicator that India is reconsidering its reluctance to joint military policing with other countries, a senior U.S. naval officer says Indian and U.S. officials have discussed joint naval patrols, though concrete steps are yet to be finalised.\n\nSpeaking to The Hindu , he refused to elaborate if the discussions covered joint patrol of the South China Sea.\n\nThe disclosure comes a year after the two countries signed a joint vision statement which called for “safeguarding maritime security and ensuring freedom of navigation and over-flight” throughout the Asia-Pacific region.\n\nThe U.S. officer’s statement comes in the light of a Reuters report two days ago claiming that the two sides have held talks on conducting joint naval patrols, including in the disputed South China Sea. The report was denied by the U.S. State Department later.\n\nIndia and the U.S. continue to explore ways to deepen their bilateral defence cooperation, the officer said, including in the area of maritime security within the “Framework for the U.S.-India Defence Relationship”, signed by Defence Minister Manohar Parrikar and U.S. Defence Secretary Ashton Carter during the former’s visit to the U.S. last June.\n\n“We continue to work with our Indian counterparts on how and where to expand engagement in this area. On the matter of joint patrols, I can confirm that some informal discussions have occurred, but no decisions have been made,” the officer told The Hindu in an e-mail response.\n\nHowever, he refused to provide more specifics at this time due to the “sensitivities” involved with the subject.\n\nResponding to questions on the Reuters report, the U.S. State Department said denied plans for joint patrols at present, but did not rule out holding discussions. “The United States and India do have a shared vision of peace, stability and prosperity in Asia,” State Department spokesman Mark Toner said in Washington on Thursday. “At this time, there are no plans for any joint naval patrols.”\n\n‘Only under UN mandate’\n\nDefence Ministry officials declined to comment. Naval officers responded on similar lines, saying it was not for their service to take a decision. An External Affairs Ministry official said there was “no such proposal”, without getting into details.\n\nIndia has consistently maintained that it would not join any military coalition except under the mandate of the United Nations.", 
    "section": "national", 
    "title": "India, U.S. deny plans for joint naval patrols", 
    "subsection": "general", 
    "date": "2016-02-13"
}