{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Minds of devotees conditioned over centuries, argues Kerala government\n\nAn association of law students has challenged the ban on entry of women into the Sabarimala temple.\n\nReacting to submissions on physical hardship, austerity and days of celibacy male devotees endure to reach the Ayyappa temple at Sabarimala in Kerala, the Supreme Court asked the temple authorities whether, according to them, spirituality is the exclusive domain of men, and if women are incapable of attaining the spiritual self.\n\nA Bench of Justices Dipak Misra P.C. Ghose and N.V. Ramana took on the State of Kerala and the Travancore Devaswom Board, asking whether the Vedas, Upanishads and scriptures discriminate between men and women.\n\n“Is spirituality solely within the domain of men? Are you saying that women are incapable of attaining spirituality within the domain of religion,” Justice Misra asked.\n\n“Can you deprive a mother?” Justice Misra asked at one point during the hearing on the tradition that bars the entry of women of a certain age into the temple.\n\nSenior advocate Indira Jaising, intervening on behalf of an association of law students in a batch of petitions challenging the ban, said there are “women brahmacharis too in this world.”\n\n“Celibacy is not the exclusive privilege of men. The Constitution says ‘throw open’ the doors of public religious spaces to the entire human race. Are women not part of the human race?” Ms. Jaising asked in court.\n\nJustice Misra said religion is distinct from cult culture. “Cult culture has a core group. Entry is restricted to others considered as outsiders. Religion is holistic — Sanatan Dharma — and includes one and all without discrimination of sex, caste and gender,” Justice Misra observed.\n\nAppearing for the State government, senior advocate V. Giri submitted that “over centuries, this prohibition has been ingrained in the minds of the devotees.”\n\nEarlier, the Bench asked Mr. Giri why his client had now turned a “somersault” from its earlier position in favour of allowing women entry into the temple.\n\n“The God is a celibate. The men who go there to worship are called ‘swamy’,” senior advocate K.K. Venugopal added.\n\n‘Why this discrimination?’\n\n“So is this tradition of prohibition bound to stay on despite the fundamental right of equality envisaged in the Constitution? If discrimination is not there in the Vedas, the Upanishads, tell us when this kind of distinction started in history?” Justice Misra asked.\n\n“A temple is a public religious phenomenon and its functions should come within the constitutional parameters,” Justice Misra observed.\n\nThe court granted Mr. Venugopal six weeks to file an affidavit which he said would contain information on the traditions of the temple dating a thousand years, in support of the prohibition.\n\nIt said the case would require in-depth research on legal, constitutional and even spiritual questions and appointed senior advocate Raju Ramachandran as an amicus curiae .", 
    "section": "national", 
    "title": "Is spirituality the exclusive domain of men, asks SC", 
    "subsection": "general", 
    "date": "2016-02-13"
}