{
    "author": [
        "Special Correspondent"
    ], 
    "text": "She was invited by the Good Samaritan Mission\n\nJashodaben Modi, wife of Prime Minister Narendra Modi, on Friday emerged as an unusual mascot of a local charity to demand that slums shouldn’t be demolished during the monsoon period as it renders the poor homeless and exposes them to disease and danger.\n\nMs Modi sat on a day-long hunger strike along with her younger brother Ashok Modi and the local charity’s members, but appeared unclear on the cause she was representing while speaking to mediapersons.\n\nThe Good Samaritan Mission (GSM), the charity that invited Ms Modi, runs a children’s home at Vikhroli. Brother S. Peter Paul Raj, who set up the mission in 1994, said slum protection had been its long-pending demand with the government and the civic body.\n\nMs Modi, who reached Mumbai on Friday morning, sat on the dharna at Azad Maidan.\n\n“ Main yahan ghoomne aayi thi (I had come here to see the city). Then they (GSM) contacted me and I saw the seva (care) they were giving children,” she said, speaking in broken Hindi interspersed with Gujarati.\n\nShe again visited Mumbai in August 2015 and visited the GSM’s ashram at Vikhroli. The mission’s members too visited her at her residence in Brahmanwada village of Unjha town in Mehsana district, Gujarat.\n\n“She readily agreed to our invitation,” Brother Raj said. He alleged that the State agencies had put pressure on him to ensure Ms. Modi did not come to Mumbai. “ Padri (priest) sahab invited me so I told him I will come,” she said. Asked if she knew the cause she was representing, she said: “They (GSM) work with small children so I came to see that.”\n\n‘Mother Teresa’\n\nBrother Raj admitted Ms Modi’s presence would get them and their cause much attention — “her presence is equivalent to that of one crore people”. A little later, he added: “We see Mother Teresa in Jashodaben.”", 
    "section": "national", 
    "title": "Jashodaben fasts for the slum dwellers of Mumbai", 
    "subsection": "general", 
    "date": "2016-02-13"
}