{
    "author": [
        "T V"
    ], 
    "text": "A tank at Honnakiranagi village in Kalaburagi district being dredged. A total of 203 small tanks and big lakes are being dredged to improve the groundwater levels.— Photo: Arun Kulkarni\n\nThe perennially drought-prone Kalaburagi district is bracing itself for the worst-ever drinking water crisis this summer with more villages being added to the list of those which are being provided drinking water through tankers. Unlike previous years, providing drinking water through tankers was not discontinued after summer last year. The transportation of water to more than 50 villages, particularly in Aland taluk, continued even during the monsoon. It is continuing even now.\n\n“We are now providing drinking water to 78 villages through tankers and this number is all set to grow in the coming days with residents of more villages complaining about shortage of water every passing day. We are bracing ourselves for a challenging task of meeting a severe drinking water shortage till the onset of monsoon,” Anirudh Sravan, CEO of the Kalaburagi ZP, said.\n\nThe situation is turning out to be serious in Aland taluk and nearly 70 of the 78 villages which are now being provided water through tankers are there. The drinking water shortage in Chincholi and Kalaburagi taluks too is taking a turn for the worse.\n\nMr. Sravan told The Hindu on Tuesday that tahsildars had been empowered to take a decision on supplying water through tankers. They had been asked to visit villages from where the shortage of drinking water was being reported and submit a report to the Deputy Commissioner. “There is no shortage of funds for meeting the crisis and the government in January released Rs. 2 crore for the purpose,” he said.\n\nThe surface sources of drinking water had not been augmented this year due to the failure of the monsoon in the kharif and rabi seasons. The district also did not receive the usual quota of rain due to the effect of a cyclone in the Andhra Pradesh coast in September and October and the tanks, ponds, reservoirs and barrages constructed across the rivers in the district could not be filled up.\n\nThe storage levels in reservoirs and dams across major rivers are fast depleting posing hurdles to many multi-village drinking water supply schemes. The scheme in Kamalapur in Kalaburagi district could not be inaugurated due to a steep fall in the storage levels in Gandorinala.\n\nMr. Sravan said that more stress was now being given on water conservation. Already 1,000 farm ponds had been constructed and it was aimed to construct at least 30 farm ponds in each of 264 gram panchayats in the district. Besides, dredging of 203 small tanks and big lakes had been taken up to improve the groundwater levels, he added.", 
    "section": "national", 
    "title": "Kalaburagi staring at a worst-ever water crisis", 
    "subsection": "general", 
    "date": "2016-02-13"
}