{
    "author": [], 
    "text": "A 24-year-old Snapdeal employee, who was missing since Wednesday evening, returned home on Friday soon after she had called up her family to tell them that she was on a train from Panipat in Haryana.\n\nSuspense remained on the circumstances of Deepti Sarna’s disappearance, with Superintendent of Police (City) Salman Taj Patil saying that they are investigating the case and will quiz her later in the day as she needs rest. He said Deepti Sarna has not been “physically harmed”.\n\n“We will probe as to how she had gone to Panipat. We are very sure that she has not been physically harmed and she is fine,” the SP told reporters here.\n\nOn Wednesday, around 8.30 p.m., Deepti went missing after she was travelling in an auto she had hired from outside Vaishali Metro Station. According to the police, Deepti was on her way from Vaishali metro station to the old bus stand of Ghaziabad where her father, Narendra Sarna, a resident of Kavi Nagar, was waiting to pick her up.\n\nDeepti’s father said that she called him up in the morning and told him that she was in train in Panipat and coming to Vaishali.\n\n“She told me that she will come to Vaishali, but I asked her not to come to Vaishali and said I will come to New Delhi Railway Station to pick her. I don’t know how she came [managed to escape]. She was calling me up from the phone of her co-passenger in the train,” he told reporters here.\n\nAfter she went missing, her father had told the police that when the auto crossed the Hindon river bridge on Wednesday’s evening, Deepti called him and gave him the location.\n\nShe was also heard shouting at the auto driver for taking a wrong route, he had said, adding thereafter her phone was switched off.\n\nPolice had soon swung into action and launched a manhunt to search the girl. — PTI", 
    "section": "national", 
    "title": "Missing Snapdeal employee returns home, family relieved", 
    "subsection": "general", 
    "date": "2016-02-13"
}