{
    "author": [], 
    "text": "Devotees wait to perform Saraswati Puja at Bhojshala on Basant Panchmi in Dhar on Friday.– Photo: Special Arrangement\n\nAmid tension over performing worship at the disputed site Bhojshala in Dhar town of Madhya Pradesh, the puja by Hindus and namaz by Muslims went off peacefully on a day when Basant Panchmi fell on a Friday.\n\nDue to the claim on the disputed 11th century structure here by both Hindus and Muslims, it has come to be known as ‘mini-Ayodhya’\n\n“A group of 25-30 Muslims offered namaz on the terrace of the site peacefully after 12 noon,” Indore division commissioner Sanjay Dube said. Hindus offered puja in the morning and in the evening, he said.\n\nHowever, stone-pelting took place in Ganjikhane area of the town and police lobbed two teargas shells, eyewitnesses said, but the police did not confirm the incident.\n\nOpposing the decision of the Archaeological Survey Of India to allow both puja and namaz on Basant Panchmi today, Shankaracharya of Kashi Sumeru Peeth Swami Narendranand Saraswati and some Hindu Mahasabha leaders staged a protest for nearly three hours outside the Bhojshala.\n\n“The ASI has no right to decide whether puja and namaz should be conducted or not. Its job is to conserve the site,” the Shankaracharya said.\n\nAll India Muslim Personal Law Board member Arif Masood said in a release that the court had directed the government to allow namaz in Kamaal Moula mosque (as Muslims call it) and not on the terrace, which amounted to a contempt of court. He would file a contempt petition after consulting other members of the board, he said.\n\nEarlier in the day a Hindu organisation performed puja outside the monument after its members allegedly found some securitymen wearing shoes at the site. Later the organisation performed puja inside too, the commissioner said, adding no untoward incident was reported.\n\nA large number of devotees performed puja on the occasion of Basant Panchmi during the day and the monument had virtually turned into a fortress with a huge police presence, Dhar district collector Shriman Shukla said.\n\nBut Bhoj Utsav Samiti leader Ashok Jain claimed the authorities had some government officials offer puja inside the Bhojshala to show that all was normal while the real devotees were offering puja outside in huge numbers.\n\nThere was tension in the town for the past few days ahead of Basant Panchmi as BUS leader Vijay Singh Rathore demanded that Hindus be allowed ‘dawn-to-dusk’ access to Bhojshala for puja, despite the ASI’s order that Hindus will perform puja from sunrise to 12 noon and from 3-30 p.m. to sunset while Muslims will offer namaz between 1 p.m.and 3 p.m. - PTI", 
    "section": "national", 
    "title": "Puja, namaz happen peacefully at disputed Bhojshala monument", 
    "subsection": "general", 
    "date": "2016-02-13"
}