{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "The 23-year-old Snapdeal employee, who went missing while on her way home from Vaishali metro station on Wednesday evening, returned home after remaining untraceable for over 30 hours.\n\nDespite Dipti returning home unscathed, the complete sequence of events and the motive behind the abduction remains unclear, as no demand was made and she remained blindfolded for the better part of her “ordeal”.\n\nIt was early on Friday morning that the worried family finally received a call from Dipti, who informed them that she was on a train to Delhi and would reach Vaishali on her own after getting down at New Delhi railway station, said her brother Jatin.\n\nOnce home, she shared the details of her disappearance-to-release sequence with her family and the police.\n\nAccording to her father Narendra Sarna, like most other days she had taken a shared autorickshaw on Wednesday to get to a spot close to Hindon, from where her father would pick her up. But before he could set out on that fateful day, Mr. Sarna was alarmed following a call by one of Dipti’s friend, who heard her screaming during a phone conversation — the last phone call made to her phone that day.\n\n“On the way, the vehicle broke down on Mohan Nagar flyover, forcing the passengers to board another auto which arrived in the next few minutes. That vehicle had three men, including the driver, sitting on the front, while Dipti and two of her co-passengers from the first auto, a man and a woman, also boarded it,” said Mr. Sarna.\n\nA little ahead, the only other woman passenger in the auto was forced to get off at knifepoint by the four men in the vehicle. The men then drove the auto to a secluded area in Raj Nagar extension.According to the police, it was near Morti that they switched their mode of transport and boarded an i10. The four men then drove for several hours while Dipti remained blindfolded, she later told her parents. A few hours later, they got down from the vehicle.\n\n“She said it was a long walk. Despite not having any sense of direction or time, she estimates that they walked for nearly 10 km before stopping at an unfamiliar location,” said Mr. Sarna.\n\nHe added that it was there that the blindfold was removed and in the victim’s sight were sugarcane plants in a field. This was early on Thursday morning. It was in the field that she spent several hours with the four men, who told her that they had plans to take her to someone “known to her”, though they themselves weren’t.\n\nSenior Superintendent of Police (Ghaziabad) Dharmendra Singh added that the men also gave her wafers to eat in the field. Under what the police believe was pressure mounted by them and the massive social media campaign, the alleged abductors decided to set her free.\n\n“They blindfolded her again and walked with her to a nearby railway station. She was given Rs.100 and told to board the next train going to Delhi,” he added.\n\nDipti told the police that she learnt from the co-passengers that it was coming from Haryana’s Panipat and was headed towards New Delhi railway station.", 
    "section": "national", 
    "title": "Snapdeal staff returns, kidnapping sequence unclear", 
    "subsection": "general", 
    "date": "2016-02-13"
}