{
    "author": [], 
    "text": "The new ship, built at a cost of £300 million, will have digital navigation\n\nMore than a century after the original Titanic ship infamously sank on its maiden voyage in the North Atlantic Ocean, a fully-functioning replica of the gigantic vessel will set sail in 2018.\n\nBuilt at a cost of £300 million (Rs. 2,960 crore) by an Australian billionaire Clive Palmer and his company Blue Star Line, Titanic II will be 270 metres long, 53 metres high and weigh 40,000 tonnes.\n\nUnlike the original, the new ship will be four metres wider to meet 21st century safety regulations and have enough lifeboats, along with marine evacuation systems — besides a boat deck housing replicas of the original lifeboats.\n\nTitanic II’s maiden voyage will not be from Southampton to New York, like the original ship, but from Jiangsu in eastern China to Dubai.\n\n“The new Titanic will of course have modern evacuation procedures, satellite controls, digital navigation and radar systems and all those things you’d expect on a 21st century ship,” said James McDonald, marketing director of Blue Star Line.\n\n“It is people looking to use the opportunity of the trademark and licensing potential of the project... We own the Titanic II name and trademark and people are lining up to be part of it,” Mr. McDonald was quoted as saying by Independent . The updated version, physically identical to its predecessor except for small changes made to satisfy modern safety requirements, will offer first, second and third class tickets.\n\nIt will have nine floors to accommodate 2,400 passengers and 900 crew members, besides a swimming pool, Turkish baths and gyms.\n\nThe original Titanic sank on its maiden voyage in 1912 after colliding with an iceberg in the North Atlantic — killing more than 1,500 passengers and crew. — PTI", 
    "section": "national", 
    "title": "Titanic’s replica to set sail in 2018", 
    "subsection": "general", 
    "date": "2016-02-13"
}