{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Amid protests by students and activist organisations over the week, Rajendra Kumar Pachauri, executive vice-chairman and former Director-General of The Energy and Resources Institute (TERI), was asked to go on “leave” from all posts at the organisation.\n\nFull executive powers have been transferred to the new Director-General, Ajay Mathur, who has also been inducted as the member of the governing council. Ashok Chawla, former Chairman of the Competition Commission of India, has been appointed as chairman of the council. He replaces Sreekantan Nair, of the National Institute of Advanced Sciences, who has been on the council for over 40 years, said a TERI statement.\n\nAll this was in the aftermath of an emergency meeting of the governing council which, among others, consists of Deepak Parekh, former Chairman, HDFC; Naina Lal Kidwai, former Chairperson, HSBC India; and Shailesh Nayak, former Secretary of the Ministry of Earth Sciences. Mr. Chawla told The Hindu that he was requested by TERI to take over the mantle “two days ago.” On February 9, Rajendra Kumar Pachauri Pachauri was appointed as executive vice-chairman of The Energy and Resources Institute (TERI) — a specially created designation — and, according to a previous report in The Hindu , was set to play an active role in the expansion of TERI in India and abroad.\n\nAshok Chawla, former Chairman of the Competition Commission of India, who has been appointed as chairman of the governing council, confirmed that he was present at Friday’s meeting of the governing council, which lasted four hours, but he could not comment on the nature of the discussions and whether the student protests and fresh sexual harassment charges against Mr. Pachauri triggered the reshuffle.\n\n“In the next 10 days, the Director-General [Ajay Mathur] and I will come up with more details about reforms within the organisation,” he said.\n\n“The governing council of TERI supports the rights of women and has consistently ensured the provision of a secure environment and a safe workplace for its employees,” a TERI statement said. It added that a third of the organisation, and 10 of its 14 directors, were women.", 
    "section": "national", 
    "title": "Two days after promotion, TERI asks Pachauri to go on leave", 
    "subsection": "general", 
    "date": "2016-02-13"
}