{
    "author": [], 
    "text": "Scientists have developed an innovative energy-harvesting technology that can capture the power of human motion to charge mobile electronic devices such as smartphones and laptops.\n\nThe energy harvesting and storage technology developed by researchers at the University of Wisconsin-Madison (U-W Madison) in U.S. could reduce our reliance on the batteries in our mobile devices, ensuring we have power for our devices no matter where we are.\n\nThe technology could enable a footwear-embedded energy harvester that captures energy produced by humans during walking and stores it for later use, researchers said.\n\nPower-generating shoes could be especially useful for the military, as soldiers currently carry heavy batteries to power their radios, Global Positioning System (GPS) units and night-vision goggles in the field.\n\nThe advance could provide a source of power to people in remote areas and developing countries that lack adequate electrical power grids.\n\n“Human walking carries a lot of energy. Theoretical estimates show that it can produce up to 10 watts per shoe, and that energy is just wasted as heat. A total of 20 watts from walking is not a small thing, especially compared to the power requirements of the majority of modern mobile devices,” said Tom Krupenkin from U-W Madison.\n\nTapping into just a small amount of that energy is enough to power a wide range of mobile devices, including smartphones, tablets, laptop computers and flashlights. For example, a typical smartphone requires less than two watts, researchers said.\n\nThe new technology takes advantage of ‘reverse electrowetting’, a phenomenon that researchers pioneered in 2011. With this approach, as a conductive liquid interacts with a nanofilm-coated surface, the mechanical energy is directly converted into electrical energy.\n\nThe reverse electrowetting method can generate usable power, but it requires an energy source with a reasonably high frequency — such as a mechanical source that is vibrating or rotating quickly.\n\nResearchers developed a ‘bubbler’ method, which combines reverse electrowetting with bubble growth and collapse.\n\nThe bubbler device — which contains no moving mechanical parts — consists of two flat plates separated by a small gap filled with a conductive liquid. The bottom plate is covered with tiny holes through which pressurised gas forms bubbles.\n\nThe bubbles grow until they are large enough to touch the top plate, which causes the bubble to collapse.\n\nThe speedy, repetitive growth and collapse of bubbles pushes the conductive fluid back and forth, generating electrical charge.\n\nThe findings were published in the journal Scientific Reports . — PTI\n\nLatest technology can capture the power of human motion to charge electronic devices", 
    "section": "national", 
    "title": "Walk to store energy in shoes, use it to recharge your phone", 
    "subsection": "general", 
    "date": "2016-02-13"
}