{
    "author": [
        "Devesh K"
    ], 
    "text": "However, it has to be proved that funds have been diverted to acquire them\n\nThe Enforcement Directorate (ED), which is investigating money laundering charges against businessman Vijay Mallya in the Rs. 900-crore IDBI Bank loan case, is empowered to attach overseas assets under the Prevention of Money Laundering Act (PMLA) if the probe establishes that the funds in question have been diverted to acquire them.\n\nAttorney-General Mukul Rohatgi on Wednesday told the Supreme Court that some information about the industrialist’s assets was gathered from social media sites, and this showed his properties were mostly abroad. “Only a fraction is in India ... maybe one-fifth,” he said.\n\nThe ED, which recently registered a money laundering case against Mr. Mallya, Kingfisher Airlines and others on the basis of CBI probe into alleged wilful default of IDBI Bank loan, is well within its powers to attach proceeds of the alleged crime in any form, in India or abroad.\n\nSection 2 (u) of the PMLA defines proceeds of crime as any property derived or obtained as a result of criminal activity or the value of any such property. “The property can be located anywhere. However, to attach overseas assets, a judicial request has to be forwarded to the foreign jurisdiction seeking necessary action,” said a government official.\n\nSection 2 1 (ra) (2) of the Act, which deals with offences of cross-border implications, covers offences committed in India and proceeds of the crime, or part thereof, having been transferred abroad.\n\nTwo cases\n\nAssets involved in money laundering are attached under Section 5 of the PMLA. There are two recent cases in which the ED attached properties located abroad.\n\nLast July, the Directorate attached 1,280 acres of land worth over Rs.1,000 crore in the United States’ California in connection with the ongoing money laundering investigations against Zoom Developers Pvt. Ltd and its promoter Vijay Chaudhary for alleged bank loan fraud. For the first time such an action was taken.\n\nIt is alleged that the promoter, who is purportedly absconding, had taken loans to the tune of Rs. 2,200 crore from different banks for realty projects in Europe. However, no such projects were undertaken and the funds were allegedly siphoned off.\n\nIn another case reported in July last year, the ED attached around Rs.166 crore, parked in a Singapore bank as part of investigations into an alleged City Limousine Ponzi scam case. The attachment was carried out with the assistance of Singaporean authorities.\n\nThe recent amendment to the Foreign Exchange Management Act also authorises the agencies to attach domestic assets of a value equivalent to foreign exchange/security or immovable property located abroad, held in violation of the Act. Such violations can also attract up to five years’ imprisonment and penalty.", 
    "section": "national", 
    "title": "ED can attach Mallya’s overseas assets", 
    "subsection": "general", 
    "date": "2016-03-11"
}