{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Thousands of farmers from across the country under the Bhartiya Kisan Manch (BKM) — a platform of 13 farm organisations — staged a protest on Thursday, accusing the NDA government of adopting an anti-farmer policy.\n\n“Farmers are committing suicides across the country but government is trying to comfort us with a promise of doubling our income in the next five years,” said BKM president Satnam Singh Behru, adding that “farmers need an immediate relief... they can’t wait for five years.”\n\nHe said during the 2014 elections, the BJP made big promises for farmers’ welfare but nothing concrete had been done yet. “Farmers are fighting for survival and if the government doesn’t address our issues soon we will be compelled to start a nation-wide agitation,” he added.\n\nSeeks bailout package\n\n“In 2015, we have seen an unprecedented spurt in farmers’ suicides, most of them due to farm debts. Government should immediately give a financial bailout package as relief measure to save farmers’ lives,” Mr. Behru said.\n\nAddressing the farmers, Bhartiya Kisan Union (A) president Rishipal Ambawata said the government had neither given an assurance on increasing the minimum support price (MSP) nor on reducing input costs.\n\nThe farmers are reeling under acute agrarian crisis mainly due to poor prices of agro produce. “Farmers have been hoping that the government would announce a higher MSP as promised by the BJP in its poll manifesto, but farmers are still waiting,” Mr. Ambawata said.\n\nHe said that if their demands were not met within a month, a nationwide agitation would be launched.\n\n‘Farmers are committing suicide but government is trying to comfort us with promises’", 
    "section": "national", 
    "title": "Farmers let down by NDA govt., charges Kisan Manch", 
    "subsection": "general", 
    "date": "2016-03-11"
}