{
    "author": [
        "Rishikesh Bahadur Desai"
    ], 
    "text": "Basavaraj Ankalkote and wife Sangeeta of Hulsoor villagein Basava Kalyan taluk believed that keeping their child in a compost pit during the solar eclipse will help cure deformityin the child’s legs.— PHOTO: SPECIAL ARRANGEMENT\n\nA couple, on Wednesday, kept their nine-month-old son chest deep in a compost pit during the solar eclipse purportedly to cure him of his disability in Hulsoor village of Basava Kalyan taluk in Bidar district.\n\nBasavaraj Ankalkote, a gold craftsman and his wife, Sangeetha, kept their child, Eshwar, in a pit of sheep and goat droppings for two-and-a-half hours during the eclipse. The couple waited for the solar eclipse to end, even as the child cried.\n\n“Someone told us that it would cure him of his deformity,” Basavaraj told The Hindu . Now that the two-hour ordeal has not healed the boy, does he still believe in the advice? He is not sure. “I don’t know. My well-wishers are telling me that we made a mistake. They say it is blind belief. They have asked me not to repeat it,” he said.\n\nMallikarjun, Basavaraj’s brother-in-law, said that they would not do such a thing in the future.\n\nSangeeta, however, believes the compost pit-treatment during the eclipse has helped the boy. “We took him to doctors in Umarga in Maharashtra and Basava Kalyan. His condition did not improve. But now, he seems to have improved,” she said.\n\nA government doctor in Basava Kalyan confirmed that the child did not suffer from polio. He said that it was some congenital deformity and that corrective surgery could help the boy. Sangeetha said that she was willing to consult a surgeon if she got a chance to do so.\n\nAs the news spread on Thursday, Sri Channaveera Shivacharya Swami of Harkud Math and Sri Shivanand Swamy of Hulsoor Math went to the house of the couple in Basava Kalyan and urged them to shun harbouring blind belief regarding eclipses. A team of rationalists would visit Basava Kalyan to create awareness against blind belief associated with eclipses, Shashidhar Kosambe, member, Child Welfare Committee, said.", 
    "section": "national", 
    "title": "In pursuit of cure, couple keeps child in pit during solar eclipse", 
    "subsection": "general", 
    "date": "2016-03-11"
}