{
    "author": [
        "K A"
    ], 
    "text": "The Moolathara regulator that allows the flow of water from Palar to Chittur Puzha, a tributary of Bharathapuzha.\n\nYet another inter-State river water sharing dispute is in the offing with the Kerala Irrigation Department objecting to Tamil Nadu’s move to construct a check-dam across the Palar located in the Parambikulam-Aliyar Project (PAP) basin.\n\nDepartment officials have written a letter to the State government seeking its intervention to stop the construction, as that would obstruct the flow of water to the Chitturpuzha, one of the major feeders of the Bharathapuzha.\n\nThe proposed check-dam, with an initial outlay of Rs. 1.83 crore, would violate the inter-State water sharing accord between the two States on the PAP basin. It would adversely affect agriculture in the water-scarce Chittur taluk, the officials pointed out.\n\nLast month, the Tamil Nadu government invited tenders for constructing the check-dam at Vallakondapuram, near Pollachi. When the project was discussed at the last meeting of the Joint Water Regulatory Board, officials from Kerala strongly opposed it, saying move was a clear violation of the PAP accord to share Parambikulam waters with the arid regions of Coimbatore and Tirupur districts of Tamil Nadu.\n\nAccording to sources in the Irrigation Department, the Chitturpuzha is receiving water through the Aliyar river from both the Palar and Aliyar dams.\n\nAs per the PAP accord, consent of both States is mandatory for any construction activity in the basin. The check-dam project has been in cold storage for long because of stringent opposition from Kerala.\n\nTamil Nadu is planning to irrigate vast stretches of agricultural land in Coimbatore and Tirupur districts by constructing the check-dam. The Kerala Irrigation Department is seeking government-to-government discussions to settle the issue amicably without allowing it to become yet another inter-State dispute.\n\nIrrigation Department says it is violation of PAP accord", 
    "section": "national", 
    "title": "Kerala opposes T.N. move to build check-dam across Palar", 
    "subsection": "general", 
    "date": "2016-03-11"
}