{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Lucknow’s booklovers, old-timers and connoisseurs of culture mourned Ram Advani, an iconic bookseller of the city who died on Wednesday.\n\nHe was 95 and is survived by a son and daughter and a younger sister.\n\nAdvani’s parents migrated from Karachi in the 1920s. His family owned a chain of bookstores. In 1951, he set up his store, ‘Ram Advani Booksellers,’ in the present location, nestled among the palatial buildings of Hazratganj, a market area.\n\nThe shop has been a haunt for booklovers, researchers, investigating authors and anyone interested in knowing about the past of the city or Uttar Pradesh.\n\nIts customers included some of India’s tallest politicians, including the first Prime Minister, Jawaharlal Nehru, and the former Chief Minister, G.B. Pant. But it was the man whom customers and friends remember for his wide-ranging knowledge and ability to keep a conversation going. The old-timers of the city recall him as a resourceful person always willing to help those who came to him.\n\nSenior journalist Pradeep Kapoor said Advani was a “walking encyclopaedia,” whose “first-hand information” of historical events was a treat for journalists and researchers.\n\n“Even at 95, when I met him on his birthday, he talked about taking retirement only at 99. Lucknow University wanted to felicitate him with a lifetime achievement award. ‘Why me? I am an ordinary bookseller,’ he replied. Such was his humility,” Mr. Kapoor said.\n\nEven in his last days, when he was down with illness, Advani was “extremely positive and enthusiastic,” said historian and author Saleem Kidwai, who was close to him.\n\n“He mentored three generations of scholars. Scholars would come to him looking for guidance not only on subjects concerning Lucknow but also Uttar Pradesh and India. He was an endless repository on any subject,” Mr. Kidwai said. “Lucknow has lost its biggest mentor,” he said.\n\nChief Minister Akhilesh Yadav said the bookseller would be remembered for creating a love for reading among many.\n\nAuthors and scholars also took to social media to express their grief.\n\nAuthor William Darylmple tweeted: “Sad news this morning-the death of the great Ram Advani of Hazratgunj. He goes to join M Bafna & old Mr Bahri in the heavenly bookstore.”\n\nNepali writer Kanak Mani Dixit called Advani’s bookshop a “Southasian institution.”\n\nWriter Akshay Mukul, who authored a recent book on the Gita Press, recalled Advani’s help in sourcing materials for his publication. “End of an era,” Mukul tweeted.\n\nRam Advani’s shop was a haunt for those interested\n\nin knowing about\n\nthe city’s past", 
    "section": "national", 
    "title": "Lucknow’s iconic bookseller no more", 
    "subsection": "general", 
    "date": "2016-03-11"
}