{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Mankhurd police on Thursday arrested a drug addict and history-sheeter for the rape and murder of a four-year-old girl, who was found dead in Mankhurd on Monday morning.\n\nThe accused has been identified as Sachin Panchore (24), a resident of the same area as the victim.\n\nThe victim, who used to stay with her parents in Mankhurd, went missing on Sunday night, and was found dead at a construction site in Mankhurd on Monday morning. Medical examination had confirmed that she had been raped and then smothered to death.\n\nThe police said that the first clue to the identity of the accused came when a detailed statement was recorded from the victim’s mother. “When we recorded a detailed statement from her, she recalled a young man who had approached her while she was on her way home with her daughter after shopping for some groceries on Sunday evening,” said an officer with the Mankhurd police.\n\nThe victim’s mother said this young man had stopped them while they were walking and said that he wanted to buy sweets for her daughter as she was a lovely looking child.\n\nThe police then fanned out in the locality to look for any clues to the man’s identity, as well as eyewitnesses.On Tuesday, the police found a CCTV camera mounted over the entrance to a commercial establishment in the area, which had captured the victim being carried away by a young man. The victim’s mother identified him as the same man who had approached her on Sunday evening.\n\nAfter making inquiries with several residents of the area and showing them the picture of the suspect from the CCTV footage, the police traced and arrested Panchore on Thursday morning.\n\nAccused, a drug addict, nabbed\n\nafter CCTV footage showed him carrying the victim", 
    "section": "national", 
    "title": "Man held for 4-year-old’s rape, murder in Mumbai", 
    "subsection": "general", 
    "date": "2016-03-11"
}