{
    "author": [
        "R Avadhani"
    ], 
    "text": "Youth come forward to marry girls from SPEARDS orphanage\n\nVakula (name changed to protect the identity) is a 19-year old girl.\n\nShe was interested in video editing and became an expert while working with a news channel.\n\nHer marriage was fixed with businessman Srinivas of Nizamabad, and she would get married in the next few weeks.\n\nThe match was fixed after arranging a meeting between the bride and groom, along with his relatives, at the residence of Majeti Sujatha, president, Sri Padmavathi Educational Rural Development Society (SPEARDS), a short-stay home for girls.\n\nOnce both of them came to an understanding and were ready to get married, Ms. Sujatha went all the way to the village of the groom and inquired about him, his financial status and family background. Once she was satisfied, she requested the groom to undergo an HIV test.\n\nThe match got finalised once the boy was tested negative for HIV, a mandatory test for those who want to marry girls under the custody of Ms. Sujatha.\n\nBeing a mother of two sons – Sridhar, who is pursuing his graduation at IIT Mumbai, and Sashidhar, who is pursuing an MBBS at Karimnagar – she has performed marriage for four of her ‘daughters’ in the last 13 months.\n\nMarriage of one more girl was scheduled in the next few weeks.\n\nShe has the full support of her husband, Srinivas Murthy. Each marriage would cost about Rs. 40,000 for Ms. Sujatha, who meets the expenditure with the support of donors.\n\nLocal legislator G. Mahipal Reddy also contributed the required amount for one of the marriages.\n\nMs. Sujatha has been running SPEARDS for the past seven years, and to date, there have been 26 girls who reached her seeking a helping hand.\n\nChanged perspective\n\nSurprisingly, there is a clear changed perspective in the society, as well-settled youngsters are coming forward to marry girls from this orphanage.\n\n“A youth from a higher caste came forward and married a girl who stayed in our home for more than five years.\n\n“The father of that youth called and thanked me for gifting a good daughter- in-law, though he was averse to this marriage,” Ms. Sujatha told The Hindu .\n\nShe was also registering marriages as per norms.", 
    "section": "national", 
    "title": "Men choose orphan girls for marriage", 
    "subsection": "general", 
    "date": "2016-03-11"
}