{
    "author": [
        "T K"
    ], 
    "text": "Pranab, Modi congratulate scientists; India closer to having own GPS system\n\nISRO on Thursday successfully put into orbit India’s sixth dedicated navigation satellite, the IRNSS-1F, from here. The satellite was launched on-board India’s workhorse launch vehicle, the Polar Satellite Launch Vehicle (PSLV).\n\nThe Independent Regional Navigation Satellite System (IRNSS) is designed to provide accurate position information service to users in India and the region extending up to 1,500 km from the border.\n\nThe Polar Satellite Launch Vehicle (PSLV C-32) lifted off at 4.01 p.m. with the payload. The launch was revised by one minute to 4.01 p.m. “for collision avoidance as per the space debris studies,” according to ISRO.\n\nThe IRNSS-1F carrying two payloads — the navigation payload and ranging payload — was put into orbit 20 minutes after take-off from the second launch pad at the Satish Dhawan Space Centre, Sriharikota.\n\n“It was a precise launch,” A.S. Kiran Kumar, Chairman, ISRO said.\n\n“It [PSLV] has taken the satellite into the right orbit. We have only one more satellite in this constellation to complete our sequence of seven satellites for the regional navigation system which we expect to do sometime next month. The signals will be available in one month,” he said.\n\nThe satellite had a lift-off mass of 1,425 kg and was powered by two solar panels generating 1660 W and one Lithium-ion battery of 90 Ampere-hour capacity.\n\nWith this launch, India inches closer to having its own navigation system (like a GPS).\n\nThe navigation payload of IRNSS-1F will transmit navigation service signals and will operate in the L5 band and S band. The ranging payload consists of a C-band transponder that facilitates accurate determination of the range of the satellites.\n\n“Successful launch of IRNSS-1F is an accomplishment we all take immense pride in. I salute the hard work of our scientists and ISRO,” Prime Minister Narendra Modi said in a tweet. President Pranab Mukherjee also congratulated the scientists.\n\nISRO is now preparing to launch the last satellite in the IRNSS series, the IRNSS-1G, and work has already begun on it.\n\n“We are going to start the next mission with the last of our IRNSS series and are going to end this year with a spectacular mission of launching the heaviest Indian satellite on the GSLV Mark III D1,” K. Sivan, Director, Vikram Sarabhai Space Centre, said after the launch.", 
    "section": "national", 
    "title": "Navigation satellite placed in orbit", 
    "subsection": "general", 
    "date": "2016-03-11"
}