{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "After getting the nomination to contest the Assembly polls in West Bengal on a Bharatiya Janata Party ( BJP) ticket, Netaji Subhas Chandra Bose’ descendant Chandra Kumar Bose began his election campaign from the house of Netaji on Elgin Road.\n\nMr Bose offered floral tributes to the statue of Netaji in front of the house located in 38/2 Elgin Road, from where on January 16, 1941 Subhas Chandra Bose had escaped from the house arrest imposed by the British.\n\nWith a handful of BJP supporters, Netaji's grandnephew raised slogans of ‘Netaji Jindabad’ and emphasised that it was only the BJP that was close to the vision of Netaji.\n\nHowever, Mr Bose found it difficult to gauge his chances against the most popular leader of the State, Chief Minister Mamata Banerjee.\n\n“Victory or defeat, none is important to me. For me what it important that I have got a chance to serve the people,” Mr Bose said.\n\nWhile he started his campaign from the footpath outside the historical building, the gates of the house, which also houses the Netaji Research Bureau, remained closed.\n\nAnother grandnephew of Netaji, MP Sugata Bose and his mother Krishna Bose, who run the Netaji Research Bureau, are associated with the ruling Trinamool Congress. However the BJP candidate from Bhawanipore says that politics will not come in the family and he will also reach out to Sugata Bose and Krishna Bose to vote for him in the polls.\n\nBefore Mr Bose was quickly ushered into a vehicle by the local BJP supporters, he also said that the ruling Trinamool Congress government had failed on all fronts including industrialisation. However, as the convener Open Platform for Netaji he had hailed Ms Banerjee effort to declassify files on Netaji in the State. It was the campaign for declassification which brought him into the limelight and was instrumental in him joining the BJP.\n\nThe BJP leadership on Wednesday announced candidates for 52 assembly seats. The only seat announced in Kolkata was given to Netaji's descendent.\n\nBJP State president Dilip Ghosh will contest from Kharagpur Assembly segment in Paschim Medinipur district. The other names in the BJP list include actress Locket Chatterjee and actor Joy Banerjee. Subhas Sarkar, another prominent BJP leader, is contest from Bankura.\n\nChandra Kumar Bose began\n\nhis campaign\n\nfrom Netaji’s\n\nhouse", 
    "section": "national", 
    "title": "Only BJP close to Netaji’s vision, says grandnephew", 
    "subsection": "general", 
    "date": "2016-03-11"
}