{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Says the rest were innocent villagers\n\nQuestioning Bastar IG SRP Kalluri’s claims of “eliminating” more than 40 Maoists in the first two months of 2016, Naxal leader Ganesh Uike said only eight of those killed belonged to his outfit.\n\nIn a press statement, Uike, who is the secretary of the South Regional Committee of CPI (Maoist), claimed the Bastar police killed 40 people including seven women, in the name of anti-Maoist operations.\n\nHe said, “Seventeen people were killed in Bijapur district, 12 in Sukma district, three in Dantewada, five in Kondagadon, and three in Bastar. Out of these 40, only eight were members of our People’s Liberation Guerrilla Army. Rest of them were innocent villagers.”\n\nThe dreaded Maoist leader also named the “innocent farmers and villagers” allegedly killed in “fake encounters”.\n\n“They (Bastar police) killed Gota Vinod, a farmer of Sendra village in Bijapur in front of the common public. Balsingh, Kosa and Masa were killed in the same fashion in Lakhpal village of Dantewada. Kursam Dharmmanna and Vatti Rajal, both villagers of Vanjalvaya village in Sukma, were picked up by the police from their homes and shot dead. Majji Budhram, Oyam Tulasi, Oyam Moti, Oyam Munna and Madkam Pandu, met the same fate near Peddajejjur village of Bijapur. All of them were innocent villagers,” he said.\n\nUike also accused the security forces of indulging in “molestation and gang rapes” of tribal women, and called for south Bastar Bandh on March 12.\n\n“But Kalluri and Raman Singh government claim to have killed Maoists. Any social organization, legal groups or journalists, who are trying to expose the reality of these killings, are being targeted by the police and the administration,” said Uike.", 
    "section": "national", 
    "title": "Only 8 out of 40 killed by Bastar police were Maoists: Naxal leader", 
    "subsection": "general", 
    "date": "2016-03-11"
}