{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "Mumbai Samajwadi Party leader Abu Azmi warns that his workers will ‘retaliate’ if north Indian migrants are targeted again\n\nRaj Thackeray claimed that70 to 72 per cent of the new permits had gone to people from other States.\n\nA day after Maharashtra Navnirman Sena chief Raj Thackeray’s provocative speech asking party workers to torch autos with new permits, a united Opposition demanded his arrest for inciting violence against migrants from north Indian States, even as the Mumbai police said the department was scrutinising his speech closely before taking any action.\n\nIn a move reminiscent of the MNS’ violent campaign against north Indian migrants before the 2009 elections, Mr. Thackeray targeted the BJP-Sena government’s decision to issue fresh permits to autorickshaw drivers in six cities, including a big chunk in Mumbai and its suburbs.\n\nAlleging that the fresh permits were aimed at benefiting Rahul Bajaj-owned Bajaj Auto, Mr. Thackeray also targeted rival Shiv Sena, which handles the Transport portfolio, claiming that 70 to 72 per cent of the new permits had gone to migrants from the other States instead of the local Marathi people. He then told party workers that if they came across autos with new permits, they should torch them after disembarking the passengers.\n\nThe Congress and the NCP slammed Mr. Thackeray for attempting to incite violence, and slammed Chief Minister Devendra Fadnavis on his government’s silence on the issue.\n\n“He should be arrested for this utter nonsense,” Mumbai Congress chief Sanjay Nirupam said. NCP spokesperson Nawab Malik said: “It is shocking that somebody makes a hate speech and he is allowed to go scot-free. The government should take prompt action.”\n\nSamajwadi Party Mumbai chief Abu Asim Azmi, who was beaten up by MNS legislators on the opening day of the new Assembly in 2009 for refusing to take oath in Marathi, condemned Mr. Thackeray’s speech, and warned that SP workers will “retaliate” if the MNS targets north Indian migrants again.\n\n“Marathi voters had rejected Raj Thackeray in the 2014 Lok Sabha elections followed by Assembly polls. Even in Nashik, his party is breaking up. That’s why, as in 2008-2009, he is trying drive a wedge between peace loving Marathi-speaking people and Hindi-speaking people, and threatening the law and order situation,” said Mr. Azmi, who will meet Chief Minister Devendra Fadnavis demanding action against the MNS leader.\n\nSenior Mumbai police officials said the department was closely scrutinising Mr. Thackeray’s speech delivered at the 10th foundation day of his party at the Shanmukhananda Hall on Wednesday night. “We will not allow anyone to take the law and order in his or her own hands,” Minister of State for Home Ram Shinde told reporters. Though Home Minister Fadnavis maintained silence, Mumbai BJP chief Ashish Shelar condemned Mr. Thackeray’s speech on Thursday.\n\nRaj Thackeray-led MNS had damaged the prospects of Shiv Sena-BJP in the 2009 Lok Sabha polls by making inroads into the Marathi vote bank, and won 13 seats in the Assembly elections that followed. However, the MNS received its worst drubbing during the 2014 polls, reducing its strength from 13 to just one MLA in the 288-member Maharashtra Assembly", 
    "section": "national", 
    "title": "Opposition flays Raj Thackeray, slams Fadnavis’ silence", 
    "subsection": "general", 
    "date": "2016-03-11"
}