{
    "author": [
        "Omar Rashid"
    ], 
    "text": "After being roped in by the Congress, pollster Prashant Kishor on Thursday made his first visit to the party’s Lucknow headquarters, where he attended a meeting of office-bearers, but he continued to remain evasive. The Congress also did not disclose the exact role he would play to revive the party’s fortunes in the 2017 elections.\n\nWhile he evaded media glare, Mr. Kishor attended a meeting of Congress vice-presidents, general secretaries, city and district heads, presided over by Madhusudhan Mistry, party general secretary in-charge of U.P..\n\nIn his address, Mr. Kishor instructed the Congressmen to view the “BJP as its main opponent,” a source said. “He asked us to get into the voters’ mind the impression that the BJP’s biggest opponent and the only alternative to it was the Congress,” a senior leader said.\n\nMr. Kishor asked each district chief to form a team of 20 “motivated” people, who were ready to devote their “day and night” to the party, a Congress office-bearer said.\n\nHe also distributed a 12-page proforma among the district heads of the party for their feedback on factors key to the party’s revival or survival in each district. The proforma contained questions on the party’s strengths, its weaknesses, requirements, key local and national issues to be highlighted, dominant caste equations, weak links of political opponents, among others, a Congress leader said.\n\n“From the outset he made it clear that we should not expect anything new. Ultimately it’s us who will have to fight the elections. He said his job was to instil confidence among the party leader and cadre,” the leader, who attended the meeting, said.\n\nMr. Kishor also inspected the party’s social-media room and inquired about the number of full-time volunteers at his disposal, Shiv Pandey, Congress UP social media in-charge, said.\n\nPressed to answer why the grand old party required a poll manager to run its election strategy, Mr. Mistry too remained evasive and said it was the party’s “internal organisational matter”\n\nParty does not disclose his role in reviving its fortunes in the 2017 elections", 
    "section": "national", 
    "title": "Prashant Kishor meets Congress leaders in U.P.", 
    "subsection": "general", 
    "date": "2016-03-11"
}