{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says probe on to trace draft of affidavit on which changes were made during the UPA regime\n\nUnion Home Minister Rajnath Singh, on Thursday, accused the United Progressive Alliance (UPA) government of hatching a “deep conspiracy” to frame Prime Minister Narendra Modi when he was Chief Minister of Gujarat in the 2004 Ishrat Jahan case.\n\nHe said the UPA’s “flip flop” on Ishrat’s alleged links with the Lashkar-e-Taiba were proof of this. He was responding to a calling-attention motion moved by the BJP members Nishikant Dubey, Anurag Thakur, Kirit Somaiya and Satyapal Singh and Biju Janata Dal MP Kalikesh Singh Deo.\n\nMr. Singh, in a departure from his written reply tabled on the floor of the House, said a few key documents, including two letters written by the then Home Secretary G.K. Pillai, to the then Attorney-General, the late G.E. Vahanvati, and the copy of the draft affidavit had been untraceable.\n\nHe said the missing documents included the copy of the affidavit vetted by the Attorney-General and the draft of the second affidavit vetted by him on which changes were made. “We have ordered an internal inquiry in the Home Ministry and necessary action will be taken accordingly,” he said.\n\nIn his written response to the motion, Mr. Singh said the notings on the concerned file did not provide any reason for the filing of the second affidavit.\n\n“It has been mentioned in the affidavit that the further affidavit was being made in view of subsequent developments in relation to the issues connected with the petition and to clarify apprehensions expressed in regard to the [first] affidavit filed by the Union of India as well as to refute attempts to misinterpret portions of the affidavit,” he said.\n\nCongress members had trooped into the Well of the House, while Mr. Singh charged the former Home Minister P. Chidambaram with coining the term “saffron terror” and “Hindu terror.”\n\nHe said a recent statement by the Pakistani-American terrorist David Headley before a Mumbai court only reaffirmed the first affidavit filed by the UPA government on August 6, 2009 before the Gujarat High Court that Ishrat had links with LeT. “It [Headley’s statement] was the second clear indication that she was a terrorist,” he said.\n\nThe Minister said the second affidavit filed by the government before the High Court on September 29, 2009 “weakened” the fact that she was an LeT operative. He said the effort seemed to be to “defame the then Gujarat Chief Minister [Narendra Modi], the State government, some leaders and those associated with the case. There was a deep conspiracy to frame them,” he said.\n\nMr. Deo, however, struck a note of caution. “All inquiries have said that this is an extra-judicial killing. This was first said by the Additional Judicial Magistrate of Ahmedabad, secondly by the SIT and thirdly by the CBI. All three inquiries have said that the encounter was fake, the encounter was staged,” he said.", 
    "section": "national", 
    "title": "Rajnath sees plot to defame Modi", 
    "subsection": "general", 
    "date": "2016-03-11"
}