{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "Great-grand daughters of the musician will re-enact her 1966 U.N. performance at the Cleveland Tyagaraja Festival on March 26\n\nS. Aishwarya and S. Saundarya, great granddaughters of M.S. Subbulakshmi (left); and a file photo of M.S. Subbulakshmi and Radha Vishwanathan at the United Nations General Assembly Hall in 1966. C.V. Narasimhan , Under Secretary General, is also seen.\n\nIt is 50 years since Carnatic music legend M.S. Subbulakshmi and her daughter, Radha Vishwanathan, graced the General Assembly Hall of the United Nations. This significant moment, when M.S. played a cultural ambassador, is all set to be recreated in her centenary year celebrations.\n\nOn October 23, 1966, M.S. and Radha presented a Carnatic music concert — the first time any Indian musician sang in the hallowed precincts as part of U.N. Day celebrations.\n\nTo mark the Golden Jubilee of the historic concert, the performance will be re-enacted song-by-song by M.S.’s great grand daughters S. Aishwarya and S. Saundarya on March 26 as part of this year’s Cleveland Tyagaraja Festival.\n\n“Although the historic day is etched in my memory, re-enacting the U.N. concert of M.S. and Radha is a wonderful way of re-living the moment,” says V.K. Vishwanathan, NASA scientist and a music lover, who was witness to the duo receiving a standing ovation from the 1,500 delegates at the U.N. in 1966.\n\nAishwarya and Saundarya’s practice sessions over the last eight months are being overseen by Radha Vishwanathan at her Gottigere residence on Bannerghatta Road.\n\n“M.S.’s style is never easy. Her breath control with complete adherence to shruti can be experienced only while attempting it,” says Aishwarya. Her open-throated stay on the gandhara of Shankarabharana raga is an example, she explains.\n\n“We will sing the same nine kritis that our grandmothers presented, but improvisations in raga, neraval and swara would be our own.”\n\nEvery number of the U.N. concert was a smashing hit and was set into an LP record. Radha Vishwanathan says: “I cannot forget certain aspects of the concert. ‘Maithreem Bhajatha’ was specially written for the U.N. concert by Sankaracharya Sri Chandrasekarendra Saraswati of Kanchi Mutt and tuned by Vasanth Desai in Mumbai. When my father [T. Sadasivam] presented Mr. Desai a cheque of Rs. 500 for his outstanding composition, he preferred to frame it on the wall as it was signed by MS-amma!”\n\n“The concert list for the U.N., prepared by my grandfather T. Sadasivam, came in for huge appreciation, as it had a good representation of vaggeyakaras and composers from across India in several languages,” says V. Shrinivasan, son of Radha Vishwanathan.", 
    "section": "national", 
    "title": "Recreating the legend of M.S. Subbulakshmi", 
    "subsection": "general", 
    "date": "2016-03-11"
}