{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Over a month after being accused of raping a minor girl, absconding Rashtriya Janata Dal MLA Rajballabh Yadav surrendered in a local court on Thursday. Mr. Yadav has been remanded in judicial custody for two weeks.\n\nThe MLA went absconding after the police and a local court issued an arrest warrant against him in connection with the alleged incident on February 6.\n\nOn Tuesday, the victim’s family members had threatened to immolate themselves if the MLA was not arrested as they claimed they were living under “constant threat” from the legislator.\n\nThe victim has to appear for board examinations in days. Her father told journalists that he feared that his daughter might face threats and ridicule if she went to the exam centre. However, the Nalanda district administration said arrangements had been made to provide adequate security to the family and the girl.\n\nVictim lured by neighbour\n\nThe incident happened when the girl, who was living in a one-room accommodation with her sisters and brother, was lured by her neighbour Sulekha Devi to the MLA’s residence where he allegedly raped her. The victim filed an FIR on February 9.\n\nSubsequently, Patna Central range DIG Shalin issued the arrest warrant against Mr. Yadav on February 13. Sulekha Devi, her daughter as well as her mother were arrested and sent to jail.\n\nThe local court too issued an arrest warrant against the MLA.\n\nThe police then attached the MLA’s immovable properties, detained his son for a day and raided his residence in an attempt to track him down.\n\nEarlier, Bihar Chief Minister Nitish Kumar had assured the Opposition that the MLA evading arrest would be arrested to stand trial.\n\n“Where would he [Mr. Yadav] go? He will have to face the rule of law ,” Mr. Kumar had said.", 
    "section": "national", 
    "title": "RJD MLA accused of rape surrenders", 
    "subsection": "general", 
    "date": "2016-03-11"
}