{
    "author": [], 
    "text": "Sanjay Dutt, Managing Director, India, at the real estate services firm Cushman & Wakefield, said one of the significant aspects of the Bill was the definition of “carpet area”. “Buyers will now be paying only for the carpet area and not the super built-up area which was fraught with confusion earlier,” he said. “Also, the developers will now have to take consent of 66 per cent of the homebuyers in case they have to increase the number of floors or change the building plans. This will protect the buyers from any ad-hoc changes that are a norm presently.”\n\nHighlighting the role of the RERA, the accountability agency, Mr. Naidu said: “It brings in only regulation and not strangulation. This Bill is not against anyone… The Real Estate Bill will renew investors’ confidence and ensure timely completion of projects and create more opportunities. In this way, it will help in achieving the target of ‘Housing For All’,” he said.\n\nIf builders still cause delays in transferring properties to buyers, the appellate tribunal would intervene and slap fines on them within 60 days. In a worst case scenario, the tribunals can send a developer found guilty of fraud to jail for three years.\n\nThe builders would also be responsible for fixing structural defects for five years after transferring the property to a buyer. In case consumers fail to make payments to developers, the appellate tribunal can fine them, too.\n\nRajeev Chandrasekhar, an independent MP, who played a key role in drafting The Real Estate (Regulation and Development) Bill, 2015 said: “By creating a much-needed regulator for the sector at the State and Central levels, this government has initiated the crucial first step to protect consumers from the prevalent opaque and fraudulent practices that have so far characterised this sector in India.”", 
    "section": "national", 
    "title": "RS passes Real Estate Bill", 
    "subsection": "general", 
    "date": "2016-03-11"
}