{
    "author": [], 
    "text": "Rescuing the fastest animal on earth is the aim and dream of 62-year-old American Laurie Marker\n\nTwo captive cheetahs in an enclosure at the Cheetah Conservation Fund (CFF) in Otjiwarongo, Namibia. The organisation, dedicated to saving the cheetah in the wild, was founded by Laurie Marker (top right) in 1990. (Bottom) A cheetah inside an enclosure.— Photos: AFP\n\nLaurie Marker has no doubts about the future of the big cat with the black spots. “Cheetahs are vulnerable, and their survival is in our hands.”\n\nThe 62-year-old American living in Namibia since 1991 has devoted her life to saving the fastest land animal on earth, with a top speed of 110 kph.\n\nMs. Marker has been compared to Jane Goodall and the late Dian Fossey — defenders of chimpanzees and gorillas — who were the first generation of iconic female pioneers of wildlife conservation in Africa.\n\nWhen Ms. Marker first visited Namibia on the southwest coast of Africa nearly 40 years ago, she was shocked to discover farmers were mercilessly killing the graceful sprinter of the plains.\n\nA century ago, there were 100,000 cheetahs across Africa, the Middle East and into India. Now, less then 12,000 remain in the wild, all in Africa, except for a tiny population of less than 100 in Iran. The rapid decline of the cheetahs could have been sharper without Ms. Marker’s high-profile tireless efforts.\n\nA formidable campaigner and acknowledged world expert, she founded the Cheetah Conservation Fund (CCF) in 1990. She saw her first when she was 20 and went to work at a wildlife park in the US state of Oregon.\n\n“It was one of the few places in the world that had cheetahs. They had come from Namibia and they fascinated me,” she recalled.\n\n“I wanted to know everything about them, but the more questions I asked people would say ‘Hmm, we don't know much about them, if you find out something, let us know.’”Ms. Marker raised an orphaned female cheetah cub named Khayam in Oregon and, in 1977, took Khayam to Namibia, then known as South-West Africa. She planned to see if the young cheetah could be taught to hunt for prey as part of research into whether captive cheetahs could be re-introduced into the wild.\n\nBut soon after her arrival, she learnt about a more immediate emergency — farmers were poisoning, trapping and shooting huge numbers of cheetahs. Namibian farmers continue to kill cheetahs because they threaten valuable livestock, while poachers steal cubs to sell as pets to wealthy clients.The threat has driven Ms. Marker on a decades-long effort to halt poaching and persuade farmers that a balance can be struck between raising livestock and protecting wildlife.\n\n“Now young farmers want training about how to live with cheetahs. Most of our wildlife is outside protected areas, so it is the farmers who are the stewards.” — AFP", 
    "section": "national", 
    "title": "Saving Namibia’s cheetahs", 
    "subsection": "general", 
    "date": "2016-03-11"
}