{
    "author": [
        "Mohit M"
    ], 
    "text": "A year-long series of surveys by a student of Manipal Institute of Technology pointed to an incredible diversity in fauna\n\nWith no trees in sight, and an acidic nature that makes cultivation difficult, the laterite soils spread across the West Coast have been classified as a wasteland. It is, perhaps, this lack of environmental regulation that sees the habitat levelled or mined for red brick blocks that mark most homes in coastal Karnataka.\n\nHowever, it is this porous habitat that sees multiple species thrive. While studying engineering at Manipal Institute of Technology, Ramit Singal started to a keep interest in the barren hillocks nearby. Eventually, for a year, he ran the “My laterite, My habitat” campaign, that involved citizen research as well as creating awareness on the importance of the landscape among students.\n\nThe year-long series of surveys pointed to an incredible diversity in fauna of the area. As many as 184 bird species were spotted, of which more than 100 reside in the area. Small frog species hide from predators in the crevices of the porous rocks; while multitude varieties of snakes roam around the area. However, considered wasteland, mining continues to flourish. To give a perspective of the kind of habitat destruction, Mr. Singal says: “Out of the 10 sites surveyed, four no longer exist. They have been flattened for construction or mining.” He believes there is a need to declare parts of the area as a conservation reserve.\n\nK.S. Seshadri, a researcher with the National University of Singapore, concurs, saying a conservation reserve in the region will ensure participation of local residents. “Unlike traditional reserves that exclude dwellers, conservation reserves are inclusive. And, they do not allow any form of development activity,” he said. Another option could be to declare them as Biological Heritage areas as species such as the Microhyla laterite were endemic and showed the rich biological heritage of the area.\n\n“The frog, after all, can become a symbol of pride for the region,” said Mr. Seshadri.\n\nAs many as 184 bird species were spotted, of which more than 100 reside in the area", 
    "section": "national", 
    "title": "Saving the laterite habitat", 
    "subsection": "general", 
    "date": "2016-03-11"
}