{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Those who cancelled their visit include Sirisena, Nepal President, Hamid Karzai\n\nIn the wake of controversies surrounding the World Culture Festival being organised by Art of Living (AOL) founder Sri Sri Ravishankar, several world leaders expected to attend the festival and the AOL Global Leaders Forum at the same time on March 12-13, have cancelled their participation, The Hindu has learnt.\n\nThey include the ‘guest of honour’ Zimbabwe President Robert Mugabe, Sri Lankan President Maithripala Sirisena, Nepal President Bidhiya Devi Bhandari, and former Afghan President Hamid Karzai, while former Pakistan Prime Minister Yousaf Raza Gillani and former French Prime Minister Villepin had intended to travel, but had not confirmed their arrival to their embassies as of late Thursday night, officials told The Hindu .\n\nPrime Minister Narendra Modi confirmed his participation on Thursday. While the Leaders forum is due to be held at a hotel, not at the contested site on the banks of the Yamuna river which has run into trouble with environmental and police clearances, the leaders were expected to attend the cultural festival as well.\n\nThe most public pull-out was that of 92-year-old Zimbabwean ruler Robert Mugabe, who cancelled his visit at the very last minute, even after his departure from Harare had been announced. According to a statement issued in Delhi by Mr. Mugabe’s spokesperson George Charamba, the cancellation followed a “communication from organisers of the festival acknowledging substantial inadequacies in protocol and security arrangements around the event.” The statement went on to say that, “A number of leaders slotted for participation, including those from the host country have also withdrawn their participation.” The pointed reference to the “host country” alluded to President Pranab Mukherjee, who was due to give valedictory address at the festival, but conveyed his regrets as he has to attend another function.\n\nWhile AOL officials contacted by The Hindu did not return calls and messages on the Zimbabwean statement, a senior MEA official denied that there was any issue regarding official protocol. “As head of state on a private visit, Mr. Mugabe and other leaders would all be extended the basic courtesies of protocol,” the official said.\n\nMEA spokesperson Vikas Swarup said the “MEA did not invite the President. The invitation was extended entirely by the Sri Sri Ravishankar Foundation.” Perhaps the fact that there was no presidential participation was the reason for the cancellation, he added.\n\nDiplomatic officials said Sri Lankan President Sirisena had to pullout due to “health issues,” Nepal President Bidhiya Devi had “technical issues,” and former President Karzai had to return urgently to Kabul due to a “sudden engagement.” The Hindu was able to find out that Nepal’s Foreign Minister Kamal Thapa, former Bhutan Prime Minister Jigme Thinley, Sri Lankan Parliamentary Speaker Jayasuriya, Pakistani leader Sherry Rehman and several members of the European Parliament and a “crown prince from the UAE” would attend, but The Hindu could not confirm their participation from their missions.", 
    "section": "national", 
    "title": "Several world leaders skip Art of Living event", 
    "subsection": "general", 
    "date": "2016-03-11"
}