{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Punjab says it does not have water to spare from its rivers.\n\nWith the governments of Punjab and Haryana not willing to relent from their stance on the Sutlej-Yamuna Link (SYL) canal issue, the State units of the BJP face disquiet. The party is in power in Haryana and the Centre and is an alliance partner of the Shiromani Akali Dal (SAD) in the Punjab government.\n\nHaryana Chief Minister Manohar Lal Khattar on Wednesday reiterated that Haryana is demanding passage for its own share of water through the canal and not Punjab’s share. “The water belongs to Haryana and the State would get it,” he said.\n\nRecently, the Supreme Court had accepted Haryana’s request for an early hearing on the presidential reference in the SYL case, which has been pending for 10-12 years.\n\nPunjab’s Chief Minister Parkash Singh Badal categorically said last week that Punjab did not have a single drop of water to spare from its rivers and his party would not compromise on the absolute rights of the State under the riparian principle.\n\nThe SYL issue has caught attention across Punjab as the Assembly elections are due in early 2017. Following this, the BJP’s respective State units are seen pitching against each other.\n\nThe Punjab BJP has conveyed it to its central leadership that the State does not have any water to share. “Punjab does not have ‘surplus water’ to share and the same has been conveyed to our party leadership. Interest of the people of Punjab is paramount to us,” Kamal Sharma, BJP’s Punjab unit chief, told The Hindu .\n\nSources said the Haryana BJP unit is planning to meet the party’s central leaders to press for supplying more water to Haryana. The attempt is to strengthen the position of Mr. Khattar.\n\nThe Congress accuses the BJP of double-speak. Punjab Congress chief Capt. Amarinder Singh said in a statement that the SAD-BJP were saying something in Punjab and doing something else at the Centre.\n\n“The NDA government at the Centre, of which the BJP and Akali Dal are part, has taken a stand in the Supreme court on the SYL; that is against the interest of Punjab. On the other hand, the SAD-BJP here [in Punjab] claim that they will not let a drop of water out,” he said.", 
    "section": "national", 
    "title": "Sutlej-Yamuna Link canal issue puts BJP in a fix", 
    "subsection": "general", 
    "date": "2016-03-11"
}