{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Telecom service providers have argued that the common man’s propensity to buy mobile phones for bargain prices in the grey market is largely responsible for call drops.\n\nListing this as one of the several “imponderables” over which service providers had no control, the firms said they should not, therefore, be made liable for call drops. In the maiden hearing in the “call drops” case before a Supreme Court Bench of Justices Kurian Joseph and Rohinton Nariman on Thursday, counsel Kapil Sibal appeared for the Cellular Operators Association of India against the controversial Telecom Consumers Protection (9th Amendment) Regulations, 2015, of the TRAI .\n\nMr. Sibal said a TRAI study itself showed that 36 per cent of call drops were consumer-related.\n\n“Mobiles are purchased from the grey market ... then calls will drop. It [call drops] is not my fault. I am not in control. It [the regulation] is just populism.”\n\nThe regulation which makes a presumption that a 100 per cent drop-free network was possible, he said, was sheer “populism” on the government’s part.\n\nHe said their licences still allowed a two per cent margin of error, including call drops. “This shows TRAI accepts call drops to the extent of two per cent. It means they accept the inevitability of call drops ... so now how can they push us with these regulations?”\n\nJustice Kurian asked him whether the service providers were willing to be penalised Re. 1 a call drop if their errors exceeded the Lakshman Rekha of two per cent.\n\nBut Mr. Sibal side-stepped the question, saying there was no mechanism to show that call drops were due to the service provider’s fault.\n\nKapil Sibal says a TRAI study showed that 36 per cent of call drops were consumer-related", 
    "section": "national", 
    "title": "Telcos blame cheap phones for call drops", 
    "subsection": "general", 
    "date": "2016-03-11"
}