{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The question of whether or not the Aadhaar Bill is a Money Bill continues to vex Parliament, with the Rajya Sabha’s Business Advisory Committee (BAC) meeting ending inconclusively after the Opposition demanded specific clauses of Article 110(1) of the Constitution that defines a Money Bill to be part of Speaker Sumitra Mahajan’s certification of it as such. Government sources, however, said they were determined to place the Bill as a Money Bill and that it could happen as early as Friday morning.\n\nAt the meeting on Thursday, members of the Opposition, led by Communist Party of India (Marxist) MP Sitaram Yechury said the Speaker “cannot have an absolute right to certify a Money Bill; it has to be according to the conditions laid down by the Constitution.”\n\nThe Aadhaar Bill seeks to give legal backing to the unique identification number programme as the means to identify and disburse subsidies to eligible sections of the population.\n\nSources present at the meeting said Opposition MPs feared that the government, in order to get the Bill cleared without answering questions on whether it can, in fact, be termed a Money Bill, may introduce it on the last day of this session, March 16.\n\nWhat Constitution says\n\n“According to the Constitution, a Money Bill has to be returned to the Lok Sabha after clearing the Rajya Sabha within 14 days of it being introduced in the Upper House. If it is not, it will be deemed as passed,” said a senior Opposition MP.\n\nGovernment managers present at the meeting, quoted clause (4) of the Article that states the Speaker’s exclusive powers to certify a Money Bill.\n\nSources said the ball was now in the court of the Chairperson and Vice-Chairperson of the Rajya Sabha to seek the certification from the Speaker.\n\nDiscussion on Budget\n\nOpposition parties also said that the government should now concentrate on bringing in the Railway Budget and the Union Budget for discussion and passing.\n\n“We have managed to clear six Bills till now, and with only three-and-a-half days of sittings left, we should clear essential business of the House,” said an Opposition MP at the meeting.", 
    "section": "national", 
    "title": "Tussle continues over Aadhaar Bill", 
    "subsection": "general", 
    "date": "2016-03-11"
}