{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Pakistan’s latest acquisition of F-16s makes life more difficult:IAF Vice-Chief\n\nAt a time when South Asia is seeing induction of advanced fighter aircraft in large numbers, a senior Air Force officer said that the current fighter strength of the country is inadequate to handle a two-front war.\n\n“Our aircraft numbers are not adequate to execute an air campaign in a two-front scenario,” Air Force Vice-Chief Air Marshal B.S. Dhanoa said on Thursday. He was speaking at a media briefing on the upcoming Iron Fist Air Force exercises later this month at Pokhran test range.\n\nHe said steps are being taken to address the issue and the government-to-government agreement for 36 Rafale aircraft was agreed to in this regard.\n\nThe Air Force has a sanctioned strength of 42 squadrons but the numbers are steadily dropping with the MiG series being phased out and the squadron strength is at its lowest at 33. Another concern is the low serviceability of various aircraft, especially the Su-30s, 272 of which will eventually be fielded by the IAF.\n\nThis, at a time when Pakistan is inducting JF-17 fighters in large numbers and set to receive eight more F-16 fighters from the U.S. China, meanwhile, is likely to receive the first of the 24 Su-35 jets from Russia by year-end even as its fifth generation aircraft programmes make progress.\n\nHowever, the Air Force has something to cheer as the indigenously developed Light Combat Aircraft (LCA) is expected to get Final Operational Clearance in the next six months.\n\nThe IAF has 120 LCAs on order, of which 100 will be an improved variant. Hindustan Aeronautics Limited (HAL), which is manufacturing them is ramping up production to 18 aircraft per year and the first aircraft with improvements is scheduled to be ready by 2018.\n\nAsked if Pakistan inducting more F-16s would alter the military balance in the region, Air Marshal Dhanoa replied “no” but said “it makes life more difficult.” “I have to put more hi-tech platforms against it…,” he added.\n\nIron Fist 2016\n\nThis year’s Iron Fist exercises with the motto “demonstrating the capability to punish” will feature a series of firsts with indigenously developed weapon systems getting ready to show their prowess.\n\nThe Advanced Light Helicopter will fire rockets and the LCA will demonstrate “swing role capability” by simultaneously firing a Beyond Visual Range (BVR) missile and precision guided bombs. The indigenously developed BVR missile Astra will be fired from a Su-30 jet while Akash Surface to Air Missile (SAM) will perform live firing for the first time.\n\nIn all, 181 aircraft, including 103 fighter jets, will take part from multiple air bases across the country.", 
    "section": "national", 
    "title": "We are short of aircraft to face wars: IAF", 
    "subsection": "general", 
    "date": "2016-03-11"
}