{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Members of the Coimbatore Railway Struggle Committee staging a demonstration in front of Coimbatore Railway Junction on Thursday. —Photo: S. Siva Saravanan\n\nThe Union Railway Budget presented by Minister Suresh Prabhu came in as a bundle of disappointments for the entire region, with just two announcements bringing some solace.\n\nThe two announcements are allocation of Rs. 80 crore (as mentioned in the pink book for budgetary allocation) for the completion of the Podanur – Pollachi section gauge conversion. With this allocation, the Railways could gear up for Commissioner Rail Safety inspection by 2017 beginning, say officials.\n\nAlready, decks relating to land acquisition had been cleared and fund constraints were holding it back in the last 14 months.\n\nThe other announcement is allocation of Rs. 134 crore for a new line between Dharmapuri and Morappur for a distance of 36 km. This will reduce the distance for those living in Dharmapuri and travelling to Chennai. At present, they alight at Morappur to take bus to reach Dharmapuri.\n\nThe other meagre allocation is Rs. 1 lakh for Erode - Dharapuram - Palani new line.\n\nThe allocation clearly indicates that the project would drag on further. The other allocation that brings cheer is the allocation of Rs. 152.83 crore for electrification of the section between Bengaluru and Omalur via Hosur.\n\nKongu Jananayaka Katchi leader G.K. Nagaraj said that the budget had a foresight and vision and announcements reflected the same.\n\nBut, it had continued to ignore and neglect Tamil Nadu and Western part of the State.\n\nIt was disappointing that long-pending demand for an overnight train to Bengaluru from Coimbatore has not found a mention.\n\nThis disappointment immediately spilled onto the road as announced earlier with members of the Coimbatore Railway Struggle Committee activists led by former MP P.R. Natarajan, G.K. Nagaraj and Jameel Ahmed staging a demonstration in front of Coimbatore Junction.", 
    "section": "national", 
    "title": "A bundle of disappointments", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}