{
    "author": [
        "D Madhavan"
    ], 
    "text": "New houses being constructed at Thirukandalam village for Irula families who lost their homes in the flood last year.— Photo: B.Jothi Ramalingam\n\nFor a month now, 95-year-old S. Muniyan has been spending most of his time near a house under construction in Thirukandalam village in Tiruvallur district along the Kosasthalaiyar river.\n\nHe hardly moves from the spot as he watches his ‘pucca’ house taking shape, brick by brick.\n\nMr. Muniyan’s home is one of the 120 houses that are being constructed in Thirukandalam for families of the Irula community who lost their huts in the floods of November and December that severely affected large parts of Chennai, Kancheepuram and Tiruvallur districts.\n\nThe city-based Networking and Development Center for Service Organisation (NDSO) is coordinating the efforts for which funds are being mobilised by various welfare agencies including Rotary Club of Madras Central, Harihara Sudha Seva Samithi, Nilacharal and Prayas Trust from Chennai.\n\nThe flood ended five years of drought in Tiruvallur district, but caused immense damage to civic infrastructure. Villages, especially those on the downstream of the two major rivers —the Kosasthalaiyar and Arani in Tiruvallur district — were especially hit. At Thirukandalam village, the bund of the Kosasthalaiyar was breached.\n\nFor more than a month, the government school in the neighbourhood was home to the families.\n\n“The members of the community have very little financial resources or support. So, we decided to help them,” said J. Prabhakar, founder and managing trustree, NDSO. Each house, which is built on 230 square feet of patta land, costs around Rs 60,000 of which Rs 4,000 is given by the beneficiary while rest is mobilised by NDSO through public contributions. Houses are also being built in Uppunelvoyal, Senjimanagar and Rangapuram village. “All houses in the first phase of the project will be ready for inauguration on April 14. As funds are generated slowly, we decided to go ahead with the project in phases,” P. Nirmala of NDSO said.\n\nFor more than a month, the government school was home to the families", 
    "section": "national", 
    "title": "A new dawn for over 100 Irula families in Tiruvallur", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}