{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Netizens have been asked to send their memes for use in awareness campaigns on voting\n\nThe official Twitter and Facebook pages of the Tamil Nadu Chief Electoral Officer (TN Elections CEO) are filled with colourful posters with catchy phrases that ask ‘k anna, vote poda aasaiya’ and ‘v ote illa pattadhari ?’\n\nIn the run up to the elections, the office of the TN CEO has taken to the social media to address a number of topics concerning voting. Their vibrant posters and memes that have been put out from mid-January have caught the attention of many online users. Their latest poster has gone one step further and has invited voters to send in their own memes, to be featured on awareness posters to be used by the TN CEO on social media.\n\nThe team behind the campaign — Chennai-based OPN Advertising — said that they based their campaign on an informal approach to catch the attention of a young demographic. A team of 13 persons has been working on the campaign, which is expected to go on till voting begins.\n\nWhile the first part of their campaign focussed on voter enrolment and verification, there will be a shift to themes such as ethical voting practices after the deadline for enrolment.\n\nAt their office on Wednesday, the team is busy at work, reading responses to the tweets and Facebook posts, and coming up with ideas for the campaign. Previously, the team was behind the 'Whistle Podu’ campaign for the Chennai Super Kings.\n\n“The Election Commission told us that the lowest number of registrations to the electoral rolls are in the age group between 18 and 25. “From cashing in on the popularity of the ‘Be like Bill’ memes to using Tamil movie references that feature in our latest poster series, we wanted to use pop-culture to speak the language of the youth rather than sound preachy,” explained Bala Manian, strategist, OPN.\n\nSimple and catchy\n\nS. Goutham, a social media user, said that keeping the campaign simple and catchy had worked. “The poster series drawing references from Shaktimaan and other popular culture that the children of the 1990s can relate to was appreciable given that many of them are now eligible to vote,” he said.\n\nShort videos featuring celebrities will be released within the next few days as part of the awareness campaign, said S. Chokkalingam, Creative Director at OPN. “We are hoping to look at the sustained campaign from a peer-to-peer perspective and not make it preachy. At the same time, we are focussing on bringing in references to movies and other facets of popular culture which can go beyond the metro demographic alone,” he said.", 
    "section": "national", 
    "title": "Attracting voters, social media way", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}