{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Workers go for lunch, escape from the disaster\n\nA major fire broke out in a fireworks unit at Poochapatti, Naranapuram, near here on Thursday. There were, however, no casualties, officials said.\n\nWhen the fire broke out, which was initially reported around 1.15 p.m., a majority of the 60 workers had gone out for lunch.\n\nThere were about 40 sheds in the fireworks unit and the cause for the fire was not known immediately.\n\nPreliminary probe suggested that the licence was in the names of Sivakumar and Kadiresan of Sivakasi. However, they had allegedly leased it to three persons – Pechimuthu of Sivakasi, Ganesan of Naranapuram and Muthukrishnan of Jameen Salvarpatti.\n\nIt is said that the three lessees had hired a number of workers, including women, and manufactured high decibel crackers.\n\nA loud sound followed by a spark was observed, and it turned out to be uncontrollable in the next 10 minutes, fire officers at the spot said.\n\nVirudhunagar Collector V. Rajaraman, Superintendent of Police P. Aravindan, DRO C. Muthukumaran, Sivakasi Sub-Collector Amar Kushwaha and other officials visited the site.\n\nSivakasi East police have registered a case and are investigating, Deputy Superintendent of Police Kumar said.\n\nEye witness account\n\nSome of the workers who saw the fire raging said that the crackers kept in the adjacent sheds for packing caught fire.\n\nThe workers who were having lunch ran to safety. As the premises had no compound wall, they ran helter-skelter, they said later.\n\nFour fire tenders from Virudhunagar, Sivakasi and Sattur were rushed to the spot.\n\nThe fire was put out after about an hour. A fire service official, Subramanian, told reporters that the incident could have happened due to excess heat in the area or due to mishandling of chemicals by workers while carrying them from one shed to another.\n\nRevenue officials said that they would examine the reasons for the fire.\n\nIn 2013, the High Court had directed the Virudhunagar Collector to form a committee comprising officials from Fire, Explosives, Labour and other departments and close down all illegal or unauthorised fireworks units which functioned without adhering to the norms after a major fire accident then.", 
    "section": "national", 
    "title": "Blaze in fireworks unit", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}