{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tiruchi Commissionerate nets Rs. 651.68 cr. Central Excise till January\n\nThe Tiruchi Central Excise and Service Commissionerate has recorded an increase in the collection of Central Excise Duty and Service Tax till now this fiscal.\n\nThe Commissionerate collected Rs. 651.68 crore as Central Excise Duty up to January this financial year, which is Rs. 37.97 crore more than the revenue collected during the same period in 2014-15.\n\nIn respect of Service Tax, the Commissionerate collected Rs. 360.04 crore as against Rs. 288.91 crore collected during the same period in 2014-15.\n\nThe Commissionerate has recovered Rs. 70.15 crore as Central Excise duty default till now in 2015-16 while in respect of Service Tax default the Commissionerate has recovered Rs. 1.8 crore till now in the current fiscal.\n\nExplaining the performance of the Commissionerate at the Central Excise Day celebrations held here on Wednesday, the Commissioner of Central Excise and Service Tax, Tiruchi Sansar Chand requested the trade and industry to lend a helping hand to the department and cooperate in tax payments promptly.\n\nThe Central Board of Excise and Customs had been implementing the “SEVOTTAM” project to improve the system for tax-payer services and at achieving excellence in service delivery.\n\nThe Tiruchi Commissionerate had rolled out the ‘SEVOTTAM’ in December 2014 and was on the verge of being awarded the certification by the Bureau of Indian Standards, he said.\n\nMr. Sansar Chand said an online grievance redress mechanism was to provide single window facility to address any grievance of the assessees and general public.\n\nThe top revenue paying assessees during the 2014-15 financial year were honoured on the occasion.\n\nThe Ramco Cements Govindapuram unit in Ariyalur Range, Thanjavur division, was on top in Central Excise assessees, while Karur Vysya Bank, Service Tax Range, Karur Division was on top in respect of Service Tax assessees.\n\nAppreciation certificates were given to 26 officers for their exceptional work.\n\nCommissioner of Customs, Tiruchi K.C. Johny, and Colonel K.B. Jairaj, Commander, NCC Group Headquarters Tiruchi, commended the tax administration of Tiruchi Central Excise and Service Tax Commissionerate.", 
    "section": "national", 
    "title": "Buoyancy in Central Excise collection", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}