{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Experts emphasise the need for protection of water bodies\n\nV. M. Muthukumar, Vice-Chancellor, Bharathidasan University, releasing the abstracts of the seminar on 'International Conference on Biodiversity and Biotechnology' in Tiruchi on Thursday to K. Murugan, Vice-Chancellor, Tiruvalluvar University.— PHOTO: A. MURALITHARAN\n\nSpeakers at the inaugural of the three-day international conference on “Biodiversity and Biotechnology – ICBB 2016” organised jointly by the Department of Biotechnology of Bharathidasan University and the Periyar Maniammai University here on Thursday, underlined the importance of application of biotechnology in conserving the natural resources. They emphasised the need for protection of water bodies, tanks, and surface channels for checking hazards caused by various vectors, particularly mosquitoes.\n\nK. Murugan, Vice-Chancellor of Thiruvalluvar University, spoke on the role of butterflies in conserving biodiversity.\n\nHe said the butterfly-friendly plants were on the wane, disrupting the lifecycle of butterflies. He suggested the conference to discuss these issues and a evolve strategy for the conservation of natural resources.\n\nV.M. Muthukumar, Vice-Chancellor of Bharathidasan University, in his inaugural address, explained the steps taken by the university in setting up a comprehensive eco-farm. The university had adopted green energy plan. Only through the intervention of biotechnology, biodiversity could be protected.\n\nS. Sivaramakrishnan, Head of Department of Biotechnology, Bharathidasan University, said the objective of the conference was to highlight the applications of biotechnology in numerous fields with an eye on conservation of natural resources. Biotechnology found its applications in agriculture, medicine, environment, and social welfare and played a key role in preventing chronic diseases and for addressing the adverse impact on global warming and climatic changes.\n\nDivided into seven sessions, the seminar would throw light on houseflies, pregnancy-induced hypertension, study on Samudram lake, conservation of mangrove, and sand dunes. The third-day of the conference would be held at the Periyar Maniammai University. A field visit would be organised when the delegates would be taken to bio-diversity-specific places in the central region.\n\nS. Sridharan, Registrar of Periyar Maniammai University, spoke on the objective of the conference.\n\nR. Babu, scientist from Zoological Survey of India, said that Western Ghats in Tamil Nadu was rich in biodiversity species. A national-level study on dragon flies and damsel flies across the country testified to the rich strength of various species. While 129 species of dragon flies were identified in Maharashtra, 135 species were found in Tamil Nadu. These flies played a key role in eradicating mosquitoes. “The tanks should be conserved, for breeding the dragon flies,” he said.\n\nT. Parimelazhagan, faculty from the Bharathiar University, explained the efficacy of certain weeds found on paddy fields, which is used as a dish in Kerala. He explained the healing property of the organic species.\n\nEarlier, Dr. Muthukumar released a book on the “extracts of papers” and the first copy was received by Dr. Murugan.", 
    "section": "national", 
    "title": "‘Butterfly-friendly plants are on the wane’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}