{
    "author": [
        "Staff Reporter"
    ], 
    "text": "175 dogs participate in Madras Canine Club 110 and 111{+t}{+h}All Breeds Championship Dog Show\n\nA handler runs with her pet dog during the 2nd Open Show of Puducherry Canine Club and 110th and 111th Championship Shows of Madras Canine Clubs held in Puducherry. (Below) A young visitor at the show.— Photos: S.S. Kumar\n\nIt was a beauty contest for canines on Sunday in Puducherry.\n\nFrom rare breeds to indigenous ones, the canines lined up on the grounds of Fatima Higher Secondary School with the trained handlers as they were judged for the breed characteristics.\n\nNearly 175 dogs participated in the Madras Canine Club 110 and 111{+t}{+h}All Breeds Championship Dog Show and Puducherry 2{+n}{+d}Open Show on Sunday.\n\nOf these, 16 were indigenous breeds including Rajapalayam, Chippiparai, Combai, Caravan Hound and Mudhol Hound.\n\n“This is the second show in Puducherry. Besides, there were also rare breeds like Springer Spaniel, American Cocker Spaniel, Afghan Hounds and American Akita.\n\nThe dog shows are held once in six months.\n\n“The dogs are made to walk and checked if the breed’s characteristics fit the international standards,” said C.V. Sudarshan, president, The Madras Canine Club.\n\nThe canines won prizes in various categories including best on show, second, third, fourth, fifth, sixth, seventh and eight best on shows, best on show bred in India and best puppy on show.\n\nDMDK leader Vijayakant’s son Vijay Prabhakar was present at the dog show with his 10 canines which included rare breeds like Springer Spaniel. The show which began in the morning went on till 5 p.m. amidst dramatic incidents of dog fights, where one of puppies was injured and bleeding.\n\nDog lovers were present to witness the contest and took pictures with the canines after the show. Many proud dog owners were seen walking away with prize cups with their puppies.\n\nDMDK leader Vijayakant’s son Vijay Prabhakar was present with his 10 canines", 
    "section": "national", 
    "title": "Canines delight their connoisseurs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}