{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Global survey covers nearly 230 places across the world; Chennai ranks 113 among the safest ones\n\nhennai has been rated the safest city in the country, going by the low crime rate and better law enforcement, according to a survey on Quality of Living rankings made by Mercer, a global consultancy firm.\n\nThe Quality of Living survey — conducted between September and November last — had covered nearly 230 cities across the world. While Chennai ranks 113 among the world’s safest cities, it has been rated the safest Indian city compared to seven other places, including Hyderabad, Bengaluru, Mumbai and Delhi.\n\nHowever, it stands fourth among the seven Indian cities in providing quality living to its residents. Chennai has been ranked the 150{+t}{+h}city globally in quality of living. It is emerging to be one of the cities of choice because of its relatively lower crime rate, less pollution and better education standards.\n\nRuchika Pal, Principal and India practice leader, Global Mobility, Mercer, said: “We rated Chennai the best city for personal safety based on four parameters — internal stability, crime rate, law enforcement and relationship with other countries. Unlike other cities, violent processions or terrorism threat is less in Chennai. Police corruption is also seen less compared to other metros, and residents are more law abiding.”\n\nChennai has climbed one step further in providing quality life to its people, compared to last year. Better public transportation with the recent addition of Metro Rail, more international and reputed schools and less traffic congestion, compared to other cities, has raised the quality of living in Chennai.\n\nThe survey is conducted annually to enable government agencies, multinational companies and municipalities to assess factors that can improve quality of living. While the survey provides an understanding for companies on factors that affect employees who are on international assignments, it also helps local bodies to improve and attract investments, Ms. Pal said.", 
    "section": "national", 
    "title": "Chennai rated the safest city in India", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}