{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Buildings for 23 police stations constructed at a cost of Rs. 13.47 crore were inaugurated in 15 districts\n\nThe new District Police Office in Thanjavur inaugurated by Chief Minister Jayalalithaa through video-conferencing in Chennai on Thursday.– Photo: R.M. Rajarathinam\n\nChief Minister Jayalalithaa on Thursday inaugurated buildings, including homes under the Own Your House Scheme, Fire and Rescue Services directorate, Directorate of Vigilance and Anti-Corruption, police stations and police quarters constructed across the State at a total cost of Rs. 753.82 crore. She inaugurated the buildings through video conferencing at a function at the Secretariat.\n\nHanding over the keys to families of 14 uniformed services personnel under Own Your House Scheme, constructed in Melkottaiyur in Kancheepuram district, she wished them happiness and prosperity in their new homes. A total of 2,673 houses were constructed on 47.60 acres at a cost of Rs. 459.97 crore. Ms. Jayalalithaa had laid the foundation stone for the complex in October 2012, which will have elevators, rainwater harvesting, fire extinguishers, parking space, solar-powered street lights, cement concrete roads, park and play ground. The Chief Minister also inaugurated buildings for 23 police stations in 15 districts at a cost of Rs. 13.47 crore. The stations including the ones in Chidambaram in Cuddalore district, Pattalam, Manampathy, Walajahbad and Somangalam in Kancheepuram district and Nachiapuram, Chettinad and Thirukoshtiyur in Sivaganga district were functioning from rented premises.\n\nA total of 1,794 quarters for policemen in 16 districts constructed at a cost of Rs. 202 crore; police hospitals, coastal police stations, repeater stations, police training school and prohibition check posts constructed at a cost of Rs. 43.45 crore; prison buildings worth Rs. 14.03 crore were also opened by Ms. Jayalalithaa.\n\nMinister for Law and Courts S. P. Velumani, Chief Secretary K. Gnanadesikan, Secretary, Home Department, Apurva Varma, Director General of Police Ashok Kumar and Chennai Police Commissioner T. K. Rajendran were among those present at the event.\n\nKeys were given to families of 14 uniformed services personnel under Own Your House Scheme", 
    "section": "national", 
    "title": "CM opens buildings for uniformed services", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}