{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Meagre fund allocation is a major constraint for procurement centres, say farmers\n\nCoconut growers in Tiruvarur district have called upon the State Government to procure the produce as the plummeting prices had adversely impacted on their economy.\n\nRaising the issue at the farmers grievances day meet here on Thursday, coconut growers led by Thambusamy of Kudavasal pointed out that the purchase price of coconut had registered a steady fall over the past few months and growers were not getting remunerative price. The State government must intervene and procure all the coconut from the growers to ensure that farmers did not suffer due to market conditions.\n\nMr. Thambusamy wanted the district administration to intervene and get the arrears pending to cane growers who had supplied the produce to the Thiru Aarooran Sugar Mills in the district. Another farmer Sundaramoorthy alleged that with the Tamil Nadu Civil Supplies Corporation allotting meagre funds to the direct procurement centres in several areas of the district, the centres were not in a position to procure all paddy brought by farmers because of which farmers were suffering. District Farmers’ Welfare Sangam president Sethuraman wanted the State government to waive all agriculture loans availed by farmers since 2012-13 and demanded that the irrigation and drainage channels be cleared to ensure free flow of water till the tail end areas of the district.\n\nBalakumaran, a farmer from Peralam wanted the district administration to ensure that all those who had applied for getting mechanised agricultural equipment at subsidised prices got the required machineries. District Collector M. Mathivanan assured farmers that their requirements would be conveyed to the higher authorities.", 
    "section": "national", 
    "title": "Coconut growers want government intervention in market as prices sink", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}