{
    "author": [
        "Staff Reporter", 
        "Karthik Madhavan"
    ], 
    "text": "RELIGION\n\nBharatiya Vidya Bhavan: Talk on ‘Devarathil samudaya seerthiruthangal,’ 6 p.m.\n\nCSI Christ Church: Lent prayer, 6.30 p.m.\n\nArulmigu Rathina Vinayagar Thirukoil, R.S. Puram: Sankatahara Chathurthi, 6.30 p.m.\n\nCULTURE\n\nKasthuri Sreenivasan Trust: Artists’ meeting, 10 a.m.\n\nGENERAL\n\nThe Coimbatore Productivity Council: Training programme, 9.30 a.m.\n\nGovernment Arts College: Sports events, 10 a.m.\n\nNairs Educational Institutions: Mupperum Vizha, 3 p.m.\n\nSapna Book House: Face-to-face with writer Indira Parthasarathy, noon.\n\nClass of 86, PSG College of Technology: Book release, 4 p.m.\n\nGRG School of Management Studies: Entrepreneurship event, 9 a.m.\n\nNehru Arts and Science College: Film festival, 10 a.m.\n\nMaharaja Arts and Science College: Technowizard 2k16, 10 a.m.; Child labour awareness programme, 2 p.m.\n\nNehru Institute of Information Technology and Management: Confluence-2016, 10 a.m.\n\nSri Ramakrishna Engineering College: Entrepreneurship week, 11 a.m.; SREC Bazaar, 9 a.m.\n\nAJK Group of Educational Institutions: Inter-collegiate management meeting, 9.30 a.m.\n\nCoimbatore Institute of Management and Technology: Workshop, 9.30 a.m.\n\nDr. R.V. Arts and Science College: National Science Day, 2.30 p.m.\n\nFICCI flo: Sadhana 2016, Zone by the Park, 6 p.m.\n\nKarpagam College of Engineering: Executive interaction programme, 2 p.m.\n\nKarunya University Business School: Management development programme, 10 a.m.\n\nDr. G.R. Damodaran College of Science: CEO’s words series, 9.30 a.m.\n\nSri G.V.G. Visalakshi College for Women: Annual sports day, 11 a.m.\n\nUDHAGAMANDALAM\n\nIndian Institute of Soil and Water Conservation Research Centre: Farm innovators day, Kadasolai village, Kil Kothagiri, 10.30 a.m.\n\nVote for Ooty: Meeting, YMCA, 11 a.m.\n\nTIRUPUR\n\nAngel College of Engineering: Workshops on ‘Research paper writing skills,’ and ‘PCB designing,’ 9.30 a.m.\n\nProfessional Group of Institutions, Palladam: Job fair, 9 a.m.\n\nJay Shriram Group of Institutions: Workshop on personality skill, 9.30 a.m.", 
    "section": "national", 
    "title": "COIMBATORE TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}