{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Most of the major infrastructure projects are still waiting for funds from multilateral agencies\n\nEven as the Greater Chennai Corporation is all set to table the budget for 2016-17 on Friday, many of the infrastructure development projects announced in the previous budgets have failed to take off.\n\nHowever, the Corporation’s track record pertaining to welfare projects in the last four years is impressive.\n\n“The Corporation has not been able to implement most of the major infrastructure projects in the past few years. They should find the reasons for the delay and set things right,” said Congress councillor P.V. Tamil Selvan.\n\nThe civic body has carried out work on 20,000 roads, installed 70,000 streetlights and established 250 parks and footpaths.\n\nHowever, it is yet to make good many of its promises pertaining to bridges, skywalks, multilevel car parking, pedestrian plazas, cycle tracks, cycle sharing and parking management systems.\n\nThe Corporation passed the budget for 2015-2016 without making any new announcements about civic development and welfare projects.\n\nThe civic body started focussing on the implementation of 165 welfare and infrastructure development schemes that were not executed.\n\nBut most of the major infrastructure projects are yet to get funding from various multilateral agencies.\n\nAs the property tax revenue was limited, the civic body has not been able to implement projects with its own funds.\n\nIn its efforts to finance projects, the Corporation has started incurring huge debts.\n\nThis is also leading to a reduction in capital expenditure, which includes spending on bridges, stormwater drains and skywalks.\n\nAccording to estimates for 2015-16, the Corporation was set to receive a loan of more than Rs. 1,000 crore from various funding agencies.\n\nBut some funding has been delayed.", 
    "section": "national", 
    "title": "Corpn. accused of not keeping its promises", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}