{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "Those who erect hoardings are not being penalised before removal\n\nLast year, the BBMP advertising department had issued circulars stating that those who erect illegal hoardings have to be fined.— File Photo\n\nThe Bruhat Bengaluru Mahanagara Palike (BBMP) is waging a battle on illegal hoardings and pulling them down, but this special drive could well be causing a huge loss of potential ad revenue for the civic body.\n\nAccording to senior BBMP officials, those who put up hoardings without paying the required tax, are not being penalised before removal of the hoardings.\n\nLast year, the BBMP advertising department had issued circulars stating that those who erect illegal hoardings have to be fined as much as the fee prescribed for a legal billboard and the hoarding should also be pulled down.\n\nBut this is not happening, said officials in the advertisement department.\n\n‘Not served notices’\n\nThey allege that people responsible for installing the illegal hoardings are not served notices demanding that the fine be paid.\n\nThis is a huge revenue loss for the civic body.\n\n“Under section 436A of Karnataka Municipal Corporations Act, 1976, the advertiser is liable to pay for earning revenue using the space owned by BBMP. But no such notices are being served,” a senior councillor said.\n\nBBMP Commissioner G. Kumar Naik denied the allegations and said that there was panchanama conducted, and penalties will be levied. “This is an ongoing process. There are vested interests involved trying to scuttle the move,” he said.\n\nBut officials in the BBMP ad department say that often the offenders are given a warning before the survey is conducted the next day, and only a fraction of the illegal hoardings are being recorded.\n\n“In many cases advertisers are taking them down themselves, taking these ads below the radar,” the advertising department official said.\n\nRashmi Mahesh, Special Commissioner, BBMP, said that even if somebody had taken down a hoarding or an advertisement, they are working to collate data from secondary corroborative data to bring them under the tax net. “Most of the hoardings are illuminated and we are checking the Bescom connection data, which is a confirmation enough to penalise the advertisers.\n\nThere are non-illuminated hoardings which we are trying to identify through property tax records, court cases and other sources,” Ms. Mahesh said adding that it was an ongoing process and expected to lead to results in the coming weeks.\n\nRs 3.96 crore in\n\nad revenue\n\nRecently, Shantala Nagar ward was taken up as a pilot and Rs. 3.96 crore was collected in ad revenue through taxes and fines. This model has yet to be replicated across the city\n\nPast surveys\n\nAt least four surveys were conducted in 2015\n\nSurvey report to Upa Lokayukta: Around 4,000 illegal hoardings\n\nLegal hoardings: 1,902\n\nThe Bangalore Metropolitan Task Force booked 15 cases against illegal advertisers in January 2016", 
    "section": "national", 
    "title": "‘Drive against illegal hoardings causing revenue loss to BBMP’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}