{
    "author": [], 
    "text": "SALEM\n\nTamil Nadu Iyal Isai Nataka Manram and Department of Art and Culture: Ramayanam festival titled ‘Varna Kalanjiyam’ , Vijaragavachariar Hall, Cherry Road, 6.30 p.m.\n\nDistrict administration: Farmers’ grievances day meeting, collectorate hall, 10.45 a.m.\n\nPeriyar University: Department of Physics: national conference on ‘advanced materials’, 10 a.m.; Department of Sociology: IQAC sponsored national seminar on ‘sustaining Indian culture and tradition through historical studies’, 3 p.m.; Department of Textiles and Apparel Design: national level seminar on ‘technical textiles and their future prospects’, 10 a.m.\n\nGovernment Arts College: Department of Statistics, UGC sponsored seminar on ‘soft skills development and career guidance programme, 9.30 a.m.; valediction, 12.45 p.m.\n\nKnowledge Institute of Technology: Higher education cell, awareness programme on ‘higher education opportunities in United States’, Walid Zaraf, Vice Consul, Consular Information Unit, US Consulate General, Chennai, chief guest, 9.30 a.m.\n\nNarasus Sarathy Institute of Technology and Young Indians: Entrepreneur Development Cell, finale of Ozhi Mayam programme of CII, 10 a.m.\n\nAVS Engineering College, Ammapet: Department of Management Studies, ‘Gurukshetra-16’ national symposium, 9.30 a.m.\n\nDhirajlal Gandhi College of Technology: Department of Science and Humanities, Science Day, paper presentation and model competitions on the theme ‘technologies for smart cities’, Archana Manojkumar, secretary, DGCT, presides, 9.30 a.m.\n\nSKS Blood Bank: Inauguration of the blood bank by Collector V. Sampath, Alagapuram, 10 a.m.\n\nThe Kavery Polytechnic College and The Kavery Institute of Technology, Mecheri: Annual Day, J. Meghnath Reddy, Sub-Collector, Mettur and Tirukuram Rama Kanagasubburathinam, chief guest, 9.30 a.m.\n\nSri Vidya Mandir Higher Secondary School, Kondalampatti: Visit of Swami Yatatmanandaji Maharaj, Sri Ramakrishna Mission Ashram, 10 a.m.\n\nNAMAKKAL\n\nDistrict administration: Farmers’ grievances day meeting, collectorate hall, 10.30 a.m.\n\nPaavai College of Engineering: Sahana Kumaraswamy, senior member-Education, training and assessment, Infosys, Bengaluru, speaks on ‘big data landscape and hadoop eco-system’,\n\n10 a.m.\n\nMahendra Engineering College: Department of Civil Engineering: Workshop on bridge designing, 10 a.m.; Department of Chemistry and Physics: National Science Day, 10 a.m.\n\nInstitution of Engineering (India) and Department of Aeronautical Engineering, Mahendra Engineering College: CFD modulation and simulation, S. R. Piramananthan, Deputy Manager-R and D, ESAB India Limited, resource person, 10 a.m.\n\nTIRUCHENGODE\n\nKSR Institute for Engineering and Technology: Department of Computer Science and Engineering, CSI Student Chapter, regional level convention,\n\n9.30 a.m.; Inauguration of ICTACT Youth Circle, 9.30 a.m.\n\nVivekanandha College of Engineering for Women: Department of Electrical and Electronics Engineering, entrepreneurship awareness camp, 10 a.m.\n\nKSR College of Engineering: Department of Computer Applications, national level conference on emerging issues in computer applications, 10 a.m.\n\nKOMARAPALAYAM\n\nExcel Business School: International conference on ‘contemporary challenges in service sector and manufacturing sector’, 10 a.m.; valediction, 2 p.m.\n\nSSM College of Engineering: Annual Day, 10 a.m.\n\nRASIPURAM\n\nMuthayammal Engineering College: Entrepreneurship Development Cell, orientation programme on ‘incubation and entrepreneurship’, 10 a.m.\n\nERODE\n\nThe Erode College of Pharmacy and Research Institute: State-level seminar on ‘Biopharmaceutical Approach on Drug Development and its Applications in Clinical Practice’\n\n9.30 a.m.\n\nSri Venkateshwara Hi-tech Engineering College: ASVAMEDHA ’16, 10 a.m.\n\nVelalar College of Engineering and Technology: Mathematics colloquium, 3 p.m.\n\nKongu Polytechnic College: Sports day, 4.30 p.m.\n\nSakthi Polytechnic College: Career guidance programme, 9 a.m.\n\nGobi Arts and Science College: 48th Sports Day2.15 p.m.\n\nKongu Arts and\n\nScience College:\n\nValediction of Students’ Association, 10.30 a.m.\n\nEBET Group of Institutions: Budhimaan 2016 , 9 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}