{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Country boat fishermen from 22 villages across the district thronged the Fisheries Department office here on Wednesday night and registered their protest against ‘stay fishing’ planned by mechanised boat fishermen.\n\nIt would be a gross violation of the Tamil Nadu Marine Fishing Regulation Act, 1983, which clearly prescribed fishing duration of 16 hours in sea from 5 a.m. to 9 p.m. every day, Sesu, president, Threspuram Country Boat Fishermen Association, told The Hindu .\n\nIf the mechanised boat fishermen violated the rule, it would lead to law and order problem in Thoothukudi, Mr. Sesu said.\n\nA majority of the fishermen were fishing in country boats, and the Act recognised traditional fishing by country boats.\n\nBut, there were no regulations stressing the use of approved capacity motor engines in mechanised boats.\n\nMoreover, the norm governing mesh size in fishing nets used by the mechanised boat fishermen was not followed. All these violations would lead to depletion of marine resources.\n\nAlready, fish stock had been depleting with the use of bottom trawl nets by mechanised boat operators, Santhya Pacheik, a fisherman of Threspuram, said.\n\nJoint Director of Fisheries R. Amal Xavier said that the country craft fishermen lodged their protest against ‘stay fishing’ allegedly planned by the mechanised boat fishermen, and police were alerted to take action against those violating the regulations.\n\nThe associations of fishermen and owners of mechanised boats were asked to call back their boats. Fifty eight mechanised boats, which ventured into sea during the day, returned to the shore around 10 p.m. on Wednesday.\n\nOn Thursday, 42 mechanised boats set sail. The mechanised boat operators had been warned of action if anybody was found guilty of violating regulations, he added.", 
    "section": "national", 
    "title": "Fishermen object to ‘stay fishing’ by mechanised boats", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}