{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Different segments of the society reacted sharply to the Railway Budget stating that the document should have focussed on allocation of expenditure for need-based projects and improve the comfort of travelling both on board and while at station.\n\n“What is the point in making promises to bring all stations under CCTV surveillance and providing wi-fi at stations when the condition of bogies of the passenger trains used by daily commuters are pathetic”, C. Harinarayanan, a shipping consultant based at Tirupur who is a frequent traveller to Shoranur in Kerala.\n\nHe further added that many of the passenger trains (not express trains) that pass through the region have bare minimum bogies.\n\nM. Veluswamy, an apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council), too sounded on similar lines reiterating the need to make development works on a need-basis rather than making generic announcements in the budget.\n\n“For example, a station like Tirupur which contributes one of the highest revenues to the Railways by means of passenger and freight charges deserve better facilities.\n\nUnless there is a specific allotment of funds, things will not improve as the station is not having adequate waiting facilities for people travelling in higher classes and cargo could be seen lying on the platform all the time due to lack of sufficient storage space”, he said.\n\nAnnouncements on laying new tracks, too, did not impress the different stakeholders who use Railways as many of the projects did not take off beyond the initial allocation.\n\n“First allotment of Rs. 2 crore was made for ‘Erode- Dharapuram- Kangayam- Palani’ railway line during 2005. Eleven years down the line, not a single metre of track has been laid”, pointed out the industrialists in Kangayam and Vellakoil areas.\n\nEven the decision not to raise the passenger fares been looked with a sceptical view.\n\n“Fares can be raised anytime and need not have to be in budget as happened before. Once the Assembly elections are over, they may raise it,” said Mr. Harinarayanan.", 
    "section": "national", 
    "title": "Focus should be on need-based projects", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}