{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Farmers have been asked to form marketing societies to reap benefits from sale of farm produce at the grievance redressal meeting presided over by Collector M. Ravikumar here on Thursday. He said formation of such societies would not only integrate farmers, but would also avoid middlemen in marketing. Such a society was functioning successfully in Kovilpatti and more such societies were expected to come up in Pudur and Vilathikulam.\n\nRecalling the flood situation, the Collector said compensation of Rs.9,524 for damage caused to agriculture crops and Rs. 6,911 for horticulture crops had been provided to 60,981 farmers in the district. In the second phase, the government had sanctioned relief assistance of Rs. 4.18 crore to benefit 21,410 affected farmers. Agriculture crops on 3,316 hectares and horticulture crop on 2,786 ha were damaged in various parts of the district.\n\nBesides, the families of four persons, who lost their lives in the floods in November, were given Rs.4 lakh each. Besides, Rs.4.14 lakh was given for loss of 131 cattle, Rs.1.18 crore for 2,682 damaged huts, Rs.11.26 crore to 22,520 households affected by the floods. On the whole, flood relief to the tune of Rs. 31.61 crore had been given to the victims, he said.\n\nMeanwhile, S. Nallaiah, a farmer from Ettayapuram, said most of the authorities in cooperative credit societies had been making farmers seeking loans to run from pillar to post. Out of 152 primary agriculture cooperative credit societies, crop loans were given only through 78 based on farm lands and the rest provided jewel loans to the farmers. The Collector said necessary action would be taken against any official from cooperative societies hesitating to offer crop loans.\n\nRajendran, a farmer from Nazareth, sought the government to form a new Aavin unit in Thoothukudi district since dairy farmers in the district had been contributing much to milk production. K.P. Perumal of Thoothukudi wondered whether the visit of central team to assess damages caused by the floods in Thoothukudi was beneficial to the farmers. The central team visited a spot in Ettayapuram and left. Many affected farmers were left out in the enumeration to provide compensation.\n\nThe Collector replied that the team inspected four locations. Moreover, photographs of damaged crops were displayed on the Collectorate premises. District Revenue Officer S.Murugaiah, Joint Director of Agriculture P. Vanniarajan, Joint Registrar of Cooperatives Arockia Sukumar attended.", 
    "section": "national", 
    "title": "Form marketing societies, farmers told", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}