{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Three-time MLA and former district secretary of the Dravida Munnetra Kazhagam V. Karuppasamy Pandian, who was expelled from the party 14 months ago, has vowed to work for the resounding victory of the All India Anna Dravida Munnetra Kazhagam in the forthcoming Assembly elections.\n\nSpeaking to reporters here on Thursday, Mr. Pandian, an ardent fan of AIADMK founder and former Chief Minister M.G. Ramachandran, said he, who was given various positions in the AIADMK by MGR, and later by party general secretary Jayalalithaa right from Thiruthu area secretary in 1972 to State deputy general secretary in 1996, had paid a hefty price for having left the party to join the DMK 15 years ago.\n\nAs he had vociferously expressed his views in support of making DMK treasurer M.K. Stalin as next Chief Minister in the party meetings and government functions when he was the Deputy Chief Minister, he was purposely sidelined by DMK president M. Karunanidhi and his children M.K. Alagiri and Kanimozhi, Mr. Pandian charged.\n\nHe lamented that he had wasted his energy and resources over the past 15 years by working for strengthening the DMK in Tirunelveli district.\n\n“I, after making an appeal 60 days ago to Chief Minister Jayalalithaa for allowing me to join the party again, am waiting for her nod. I firmly believe that ‘Amma’ will certainly readmit me in the party,” he said.\n\nMr. Pandian predicted that the AIADMK would register a thumping victory in the Assembly polls and the DMK, “a divided house owing to betrayals and backstabbing,” would bite dust.\n\n“I was betrayed, ill-treated and forced to leave the DMK in a disgraced manner. Now, I dedicate everything and ready to even sacrifice myself for ‘Amma’ and the victory of the AIADMK in the ensuing Assembly polls. I’ll campaign in support of the AIADMK if ‘Amma’ permits me to do so… All praise to ‘Amma’,” Mr. Pandian said.", 
    "section": "national", 
    "title": "Former DMK MLA vows to work for AIADMK’s victory", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}