{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Rs. 120 crore for double line and new line to Thoothukudi\n\nSeed money of Rs. 100 crore for the doubling of Madurai-Thoothukudi section (via Vanchi Maniyachi) and Rs. 20 crore for the new line on Madurai-Thoothukudi (via Aruppukottai) has raised hopes of keeping alive the two important projects that would provide increased and better rail link on Thoothukudi-Chennai section.\n\nDivisional Railway Manager Sunil Kumar Garg said that the doubling project of nearly 150 km would get Rs. 30 crore from railway budgetary allocation and another Rs. 70 crore from extra budgetary resources (internal funding). The new lines were expected to decongest rail traffic and improve freight movement from Thoothukudi port to Chennai and the hinterland of the State. The budget had sanctioned Rs. 80 crore for the gauge conversion of Pollachi-Coimbatore section as part of the Dindigul-Pollachi-Palakkad/Coimbatore gauge conversion project.\n\nAmong the long-felt demands addressed by the budget were the construction of a second foot overbridge at Madurai junction. For the Rs. 5-crore project, Rs. 3 crore had been allotted. The old girder bridge was dismantled a few years back. The new bridge would connect five platforms of the junction.\n\nRs. 1 crore had been allotted for development of Madurai and Rameswaram railway stations in association with the Ministry of Tourism.\n\nThough Railway Minister Suresh Prabhu had not made any announcement on new trains, extension of trains and increasing frequencies of trains, Mr. Garg said that Silambu Express, running between Chennai Egmore and Manamadurai, would be extended to Shencottah very soon.\n\nThe construction of fourth line in Shencottah railway station would be taken up in March to accommodate the second train on the Shencottah-Chennai section. “This is a long-pending demand of the people of Virudhunagar-Shencottah section. The train would run from Manamadurai via Aruppukottai and Virudhunagar,” he said. Besides, its frequency would be increased from bi-weekly to thrice-a-week service.", 
    "section": "national", 
    "title": "Fund allocation keeps alive vital projects", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}