{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Industries in Coimbatore have welcomed the Railway Budget announcements related to public private partnerships and opportunities for the private sector to invest in different areas in the railway sector.\n\nPresident of the Indian Chamber of Commerce and Industry, Coimbatore, D. Nandakumar has said in a press release that the budget focuses on consolidation rather than expansion. It is looking at handling key issues innovatively and also highlights the investment opportunities and new financial methods.\n\nE.K. Ponnuswamy, president of Coimbatore District Small Industries’ Association, has said in a press release that creation of dedicated freight corridors will facilitate movement of materials across the country at a lower cost. It will support industries in States such as Tamil Nadu where raw materials are sourced from different parts of the country and goods are also sold across the country. The proposals to create wi-fi facility at select stations and provide handheld machines for sale of tickets are also welcome measures, he said.\n\nAccording to the Indian Texpreneurs Federation secretary, Prabhu Dhamodharan, it is a good start to encourage public private partnerships in areas such as building new stations, logistics and warehouses. Coimbatore, Tirupur District Micro and Cottage Entrepreneurs’ Association president S. Ravikumar has said that increasing the speed of freight trains and, improving the efficiency of railways are welcome measures.\n\nAccording to K. Maniraj, president of Kovai Power Driven Pumps and Spares Manufacturers’ Association, involving private players in freight movement will push up costs and this will affect micro and small-scale industries.\n\nThe industries, however, expressed disappointment that the long-pending demand of Coimbatore – an express train between Coimbatore and Bengaluru – has not been met and there is no announcement to expedite the infrastructure projects here.", 
    "section": "national", 
    "title": "Industries in Coimbatore welcome proposals", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}