{
    "author": [
        "Special Correspondent"
    ], 
    "text": "About 79.91 acres of land has been chosen and the initial intake is 50\n\nThe Union Territory of Puducherry has identified a site for the construction of the Karaikal branch of the Jawaharlal Institute of Post-Graduate Medical Education and Research (JIPMER) here.\n\nThe area of the piece of land is about 79.91 acres and it can be used for accommodating administrative block, office of the Dean, and other medical officials and laboratories. To start with, the intake of the branch college will be 50 and will function in various buildings to start with. The intake would be increased to 100 in course of time, after completing the work on provision of comprehensive infrastructure for the institute. An official source said the site was located close to the depot of the Tamil Nadu State Transport Corporation in the town.\n\nNew buildings, including an exclusive research-based hospital on the lines of the one in Puducherry, would be built constructed next year. To start with, the Government Hospital in the town would be provided with additional facilities and infrastructure so that the students could utilise it for their immediate institute for academic study.\n\nApart from the Government Hospital, all the primary health centres would be utilised for the students of the branch of the JIPMER.\n\nThe sources said the branch hospital would cater to the health care needs of not only the residents of Karaikal but the adjoining districts. For ensuring the work on the construction of the college and the hospital, the site had been handed over to the JIPMER authorities. The work would be executed through the Central Public Works Department, in accordance with the designs and architecture of the JIPMER.\n\nThe GH would be provided with additional facilities and infrastructure so that the students could utilise it", 
    "section": "national", 
    "title": "Land identified for JIPMER college in Karaikal", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}