{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Sankatahara Chaturti puja, Railway Colony, 6.30 p.m.\n\nPanniru Thirumurai Mandram: Discourse on ‘Tiruvilayadalpuranam’ by N.S. Sundararaman, Old Kalyana Mandapam, 5 p.m.; Abirami Anthathi parayanam, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Thirukural’ by N. Manickam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Avvai Kural’ by A.K.S. Thirumavalavan, Sakti Velammal Nagar, S.S. Colony, 5 p.m.\n\nBharati Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Sethupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nRamana Kendram: Ramana Sahasranamam and discourse by Kalarani Rengasamy, 11 Chokkappa Naicker Street, 6 p.m.\n\nRamakrishna Mutt: Yoga class, 6 a.m.; aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nTamil Isai Sangam: 41{+s}{+t}annual music festival, bharatanatyam by Archana Narayanamurthi, 5.15 p.m.; flute by P. Vijay Gopal, Rajah Muthiah Mandram, 6.45 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator conducts yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nThiagarajar School of Management: Yukti 2016, annual business school meet, Tirupparankundram, 9 a.m.\n\nK.L.N. College of Information Technology: One-day faculty development programme on ‘CADD for civil engineers,’ 10 a.m.; two-day workshop on ‘Android development,’ J.S. Gnanasekaran, Principal, presides, V. Subburaj, MD, Sree Trainz Division-Research and Development, resource person, Conference Hall, 10 a.m.\n\nSermathai Vasan College for Women: D. Sivasakti, Sub-Inspector of Police, Melur, speaks on ‘Self-defence,’ Conference Hall, 9.55 a.m.; Department of Fashion Technology conducts expo-cum-sale, Principal D. Karthigairani inaugurates, DFT Lab, 10 a.m.; Physics Association conducts S.V. Raman’s birth anniversary, Physics Lab, 10.30 a.m.\n\nSaraswathi Narayanan College: Inter-collegiate competition for Mathematics students, K. Shanthi of Meenakshi College for Women, chief guest, Principal M. Kannan presides, 10 a.m.\n\nSri Meenakshi Government College for Women: International seminar on ‘Madurai in literature,’ Valedictory function, Prof. K. Gnanasambandan, chief guest, Principal C. Mangayarkarasi presides, Kayal Arangam, 2.30 p.m.\n\nThiagarajar College: E-business concept and scope, M. Vijay Gupta, zonal head, BNCS currency management solutions division, Haryana, delivers keynote address, Principal M. Eyini presides, Main Hall, 9 a.m.\n\nLady Doak College: Department of Tamil conducts ‘Tamil Vanam,’ poet Tamilatchi Thangapandian speaks on ‘Nan-Nilam-Kavithai,’ Director (Thanga Meengal) Ram will deliver the special address and speak on ‘Matram Seyyum Katralai,’ J.X. Miller Auditorium, 9.30 a.m.\n\nVickram College of Engineering: Two-day 11{+t}{+h}State-level football tournament for schools 2016, children of Madurai, Ramanathapuram and Sivaganga schools participate, M.S. Vickram, Director, inaugurates, 9 a.m.\n\nSLS.MAVMM Ayira Vaisyar College: Kavin Kalai Kazhagam conducts, quiz competition, P. Balamurugan conducts, M. Arunagiri presides, Kallampatti, 2.30 p.m.\n\nKayalvizhi Nursery and Primary School: 28{+t}{+h}Annual Day celebration, K. Rajamani, District Primary Education Officer and R. Chokkalingam, president, Kavignar Kannadasan Narpani Mandram, chief guests, Uranganpatti, 4.30 p.m.\n\nTamil Nadu PWD Senior Engineers’ Association: Meeting, A.C. Kamaraj speaks on ‘Modern waterways and rivers,’ Poriyalar Illam, PWD campus, 6.30 p.m.\n\nGandhi Memorial Museum: Training programme on village industries, R. Natarajan, resource person, 11.30 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: 30{+t}{+h}All India Ideal Home Exhibition, 4 p.m., Siddhu Matriculation School students present cultural programme, Tamukkum Grounds, 6 p.m.\n\nRotary Club of Madurai West: Dr. Anand shares his experience on raid De Himalayas,’ Himalayan car rally, Hotel Fortune Pandian, 5.30 p.m.\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, Melur, 6.30 p.m.; Grace Kennett Hospital, Ellis Nagar, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}