{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu Medical Council (TNMC) has suspended three doctors, two of them from Chennai, for violating laws.\n\nOne of the doctors has been suspended for five years, the second for a year and the third for six months.\n\nIn the first instance, the licence of Ramachandran (55) of Mahalakshmi Nursing Home in Neyveli was suspended as investigations by the district authorities had revealed that he was a habitual offender who routinely revealed the gender of foetus after an ultrasound scan. He was suspended for five years as it was considered a deliberate violation of the Preconception and Prenatal Diagnostic Techniques Act.\n\nThe report of an inspection conducted by the Joint Director and the Collector in 2014 was sent to the Director of Medical Services who sent the report to the TNMC.\n\n“It has been pursued since 2014 but we had to check the evidence. We placed it before the ethical committee which took the decision,” an official said.\n\nThe Council also suspended laparoscopic surgeon M. Maran who was attached to Bharathiraaja Hospital in T. Nagar, Chennai, for a year on charges of misconduct and negligence.\n\nDr. Maran had performed a bariatric surgery following which the woman developed complications and she was admitted to another private hospital. The patient died nine months later.\n\nBlank cheque\n\n“The complications following the surgery were not considered a serious negligence but giving the patient’s family a blank cheque was considered an offence,” said a member of the Council.\n\nA patient of the Women and Child Foundation in T. Nagar, Chennai, had complained that a wad of cotton was left inside her abdomen after a surgery. The doctor, Rajasekar, was punished for negligence with a six-month suspension.\n\nAccording to the Council members, the doctor had left the mop pad in her abdomen which was later removed. The patient is also expected to be financially compensated by the consumer court.", 
    "section": "national", 
    "title": "Medical council suspends three doctors", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}