{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The government on Thursday said all medical institutions/ colleges should strictly comply with the provisions of the Environment Impact Assessment Notification 2006 and should not carry out any construction activity related to hospital components exceeding 20,000 square metres of total built up area on all floors without prior environmental clearance.\n\nIn a press release, the Department of Science, Technology and Environment, Puducherry, said an office memorandum was issued by the Union Ministry of Environment, Forests and Climate Change (MoEF&CC) on June 9, 2015 clarifying that for all medical universities/ institutes, the component of hospitals should obtain prior environmental clearance for construction of projects exceeding 20,000 square metres of total built-up area on all floors, under the Environment Impact Assessment Notification 2006.\n\nAccordingly, the State Environment Impact Assessment Authority (SEIAA), Puducherry, had issued a direction to all the medical institutes which are having hospitals to ensure compliance in letter and sprit. The SEIAA had directed Puducherry Planning Authority to ensure compliance with the said notification. The press release added that the Pondicherry Institute of Medical Sciences, Puducherry filed an application before the National Green Tribunal (NGT) to quash the office memorandum of the Union Ministry. The SEIAA has filed its response before the NGT and argued the case on merits.\n\nThe Department also said after hearing both the parties, the NGT dismissed the plea filed by the private medical college on Thursday and restrained them from any construction activity related to hospital components without obtaining prior environmental clearance.\n\nPuducherry Planning Authority to ensure compliance with the said notification", 
    "section": "national", 
    "title": "Medical institutions told to comply with EIA provisions strictly", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}