{
    "author": [
        "M K"
    ], 
    "text": "A meeting held at the Collectorate here on Thursday to negotiate rates for land acquired for the expansion of Coimbatore Airport failed to reach an accord.\n\nLand owners who attended the meeting refused to agree to the rate prescribed by the government.\n\nR. Kumar who lead a section of the land owners said that they will organise a massive agitation demanding that a higher compensation be paid.\n\nThe special District Revenue Officer for land acquisition, S. Gunasekaran, chaired the meeting to negotiate rates for land in blocks 16 to 19, which cover residential and industrial areas in Chinniyampalayam, Teacher’s Colony, and the agriculture land in Irugur village and a part of Neelambur village.\n\nThe rate was fixed for an acre ranged between Rs. 22.5 lakh and 98 lakh.\n\nLand owners claimed that in 2011, the then District Collector had promised a rate which was 50 per cent more than the market value of the land.\n\nBut now officials were saying acquisition will be done according to guideline value, which was far below the market value, the land owners said.\n\nThey claimed that the base value of an acre was more than Rs. 5 crore.\n\n“The government is trying to force us leave our houses and land for a throwaway price. The government want to portray land owners in a bad light as it they are opposing the expansion of the airport and hindering the growth of the city. This is not true,” Mr. Kumar said.\n\nVijay Vickraman, a land owner, said that there was lack of clarity on the Act based on which land were being acquired.\n\nLaws that ensured a higher compensation were not considered for the negotiation.\n\nC. Ramesh of Vice Garden on Irugur Road said that a third of the 46 cents that he owned will be acquired for the expansion.\n\n“I will not be able to use the remaining 30 cents as there is no road to the land,” he said.\n\nHe is among a few other land owners facing the same plight. He wanted authorities concerned to take over the remaining land as well as it was of no use to him.\n\nMr. Gunasekaran asked land owners to express their views in writing within a week.\n\nHe told The Hindu that the representations of people seeking a higher compensation will be forwarded to the State Government.", 
    "section": "national", 
    "title": "Meeting fails to reach accord", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}