{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Proposal to beautify Nagapattinam and Velankanni stations welcomed\n\nThe Railway Budget presented on Thursday has evoked mixed reactions from the people of Karaikal and Nagapattinam regions.\n\n“The proposed increase in the number of unreserved coaches in crowded long-distance express trains is a welcome move. So is the move to allow cancellation of ticket reservation through SMS text messages,” says president of the Karaikal District Rail Users Welfare Association and Divisional Rail Users Consultative Committee Member V.R. Dhanaseelane.\n\n“We welcome wholeheartedly the plan to beautify the Nagapattinam Railway Station constructed in 1861 and the Velankanni railway station and the introduction of time table for goods trains,” he added. However, the people and industry of the region were disappointed that long-pending demands, including track doubling between Karaikal and Thanjavur, had not been meet and new trains had not been announced for Karaikal, Mr. Dhanaseelane said in his reaction to the Rail Budget.\n\nIt is disappointing that the Railway Minister has not included any plan to revive the historic Mayiladuthurai-Tranquebar rail line or a circular route covering the entire Cauvery delta to provide rail connectivity for a pilgrimage circuit in the region, rues organiser of the Mayiladuthurai-Tarangambadi Train Restoration Committee Arupathy P. Kalyanam.\n\nMr. Kalyananam told The Hindu that the 30-km Tranquebar-Mayiladuthurai section that served for 60 years from 1926 to 1986 needs to be revived.\n\nDaily around 10,000 students and public were travelling between the two crowded destinations with much difficulty.\n\nMr. Kalyanam said the revival plan had found mention in some earlier budgets but since funds were not allotted the project had been languishing in neglect for long and hopes that at least during this railway budget the revival plan would receive a boost has been belied.\n\nKumbakonam All Traders’ Association secretary V. Sathyanarayanan termed the budget proposals disappointing in that new trains had not been announced for the region. Neither extension of services have been announced.", 
    "section": "national", 
    "title": "Mixed reaction to railway budget", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}