{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They say their complaint to various authorities has not evoked positive response\n\nAs their petition to State Commission for Women apparently failed to evoke any response, 19 girl students of Manonmaniam Sundaranar University, who were allegedly sexually harassed by a faculty member, have approached National Commission for Women for its intervention.\n\nIn their petition, the victims said that they, doing their post-graduation in history at the MSU, lodged a complaint with Registrar A. John De Britto on July 21, 2015, and again on July 23, after Assistant Professor Vinod Vincent Rajesh “sexually harassed” them. Copies of the complaint were forwarded to the Governor of Tamil Nadu, Chief Minister’s Special Cell, Minister for Higher Education, Secretary, Department of Higher Education, and State Commission for Women.\n\nSince Mr. Rajesh “threatened” three of the victims for having filed the complaint, the victims submitted a petition to B. Maria John, Head, Department of History, MSU, who warned the Assistant Professor and informed the same to the Registrar.\n\nWhen the MSU administration continued to maintain a stoic silence even after the filing of the complaint, the victims staged a dharna on MSU premises despite the threats issued by a group of faculty members to the protesting students.\n\nThreatened\n\nThough Mr. Rajesh was suspended on August 26, 2015 following an enquiry conducted by the MSU committee, students, who supported the agitation on humanitarian grounds, were threatened.\n\nOne of them, a research scholar, was arrested based on a false police complaint preferred by a faculty member and imprisoned for six days.\n\nExplaining in detail the unsavoury developments taking place on the MSU premises, 16 victims went to Chennai to meet Higher Education Secretary Apoorva. As she was not available there, the girl students met Deputy Secretary Suguna and submitted a petition to her.\n\nAgainst this backdrop, Mr. Rajesh, with the backing of the MSU administration is all set to be reinstated as per the decision taken by the Syndicate Committee even as no justice is rendered to the victims.\n\n“Hence, we appeal to National Commission for Women to look into this issue and conduct a fair enquiry to render justice to the affected girl students,” the petitioners said.", 
    "section": "national", 
    "title": "MSU students seek NCW’s help", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}