{
    "author": [
        "Staff Reporter"
    ], 
    "text": "National Democratic Alliance (NDA) government at the Centre neglected the people of Kanyakumari district in the railway budget, said P. Edward Jeni, secretary, Kanyakumari District Rail Users Association (KDRUA), here on Thursday. Mr. Jeni said that though Kanyakumari Parliament constituency was represented by the lone BJP MP and Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan, the people were completely neglected.\n\nRailway Minister Suresh Prabhu had shown scant respect for the constituency by neglecting the reasonable demands of the people such as introduction of new trains, he said. The announcements on introducing new trains made in the last budget were completely forgotten. A paltry amount of Rs. 1,000 was allocated for extension of one single platform, one stabling line and a simultaneous dispatch and reception facilities from Thiruvananthapuram side in Nagercoil junction. Originally the project, estimated to cost Rs. 7.06 crore, was sanctioned during 2006-07. The Centre had already allocated Rs. 5.97 crore and Rs. 3.53 lakh during the last two budgets respectively and allocated only Rs. 1000 this time.\n\nSimilarly, the Railway Minister had allocated Rs. 1,000 for transforming Melapalayam railway station into a crossing station. Ever since the NDA came to power, there had been no development in the railway sector in Kanyakumari district, he said. The Minister had allocated Rs. 290 crore for track doubling for 85 km between Thiruvananthapuram and Kanyakumari. A total of Rs. 110 crore had been allocated for track doubling between Nagercoil and Vanchi Maniyachi via Tirunelveli, and Rs. 70 crore for 80 km in Madurai-Maniyachi-Thoothukudi section in the budget. The Minister failed to allocate funds for transforming Nagercoil Town station as a crossing station. The KDRUA demanded that the Centre should establish a rail engine factory in a southern district, introduce an Antyodhaya Express to northern destinations from Kanyakumari via Madurai and Chennai.", 
    "section": "national", 
    "title": "‘NDA govt. has neglected Kanyakumari district’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}