{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Objections, suggestions invited from the public within 30 days\n\nNew draft rules stipulate that there should be social impact assessment study before acquisition of the land. A file picture of the land acquired for an oceanarium at Manapet in Puducherry.\n\nThe government has notified new draft rules to ensure the right to fair compensation and transparency in land acquisition in the Union Territory.\n\nThe draft of Puducherry Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Rules, 2015’ has been published, as required by a section of the Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013 for the information of all persons likely to be affected thereby.\n\nIn a notification, S. Sundaravadivelu, Special Secretary, Revenue said, “Objection or suggestion which may be received from any person with respect to the said draft rules within the period of 30 days so specified shall be considered by the government.”\n\nThe draft rules said if the requisition includes irrigated multi-cropped and/or agricultural land, the Collector should constitute a team of officers consisting of officers from Revenue, Agriculture, Forest, Ground Water Authority, Town and Country Planning departments or any other department as the Collector deems necessary to visit the spot along with the representatives of requiring body to make a preliminary enquiry.\n\nIf the Collector, based on the report of the team, other information available with him and instructions issued by the government in this regard, is satisfied that the requisition is consistent with the provisions. He should pass a speaking order to this effect. If he is not satisfied that the requisition is consistent with the provisions, he should record the reasons in writing and return the requisition to the requiring body.\n\nThe new draft rules also stipulate that there should be social impact assessment study before the acquisition of the land.\n\n“Public hearing shall be held in the affected areas to bring out the main findings of the Social Impact Assessment, seeking feedback on the findings and to seek additional information and views for incorporating the same in the final documents,” the draft rules said.\n\nWhere the land proposed to be acquired is equal to or more than one hundred acres, the government should constitute a Rehabilitation and Resettlement Committee under the chairmanship of Collector at project level to monitor and review the progress and implementation of the rehabilitation and resettlement scheme and to carry out post-implementation social audit in consultation with the village panchayat in the rural areas and municipality in the urban areas.\n\n“Where any land acquired under the Act remains unutilised for a period of five years from the date of taking over possession, the same shall be returned to the original owners or their legal heirs as the case may be, or to the Land Bank of the government in accordance with the provisions,” said the draft rules.", 
    "section": "national", 
    "title": "New land acquisition draft rules notified in UT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}