{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Volunteers to tackle the deep-seated habit head-on at 30 villages in Madurai district\n\nIn a novel strategy towards eradication of open defecation, the District Rural Development Agency (DRDA) has launched a three-day residential training for 30 men and women who will act as motivators to make at least 30 villages Open Defecation Free (ODF) in a few weeks time.\n\n‘Social motivators skill development training,’ which began at Pillar Centre near Nagamalai Pudukottai on Thursday, is a first of its kind district-level programme in the State. It is modelled on a State-level programme organised recently for master-trainers, who are training the Madurai volunteers now.\n\nChanging the attitude\n\nExplaining the objective, B. Rohini Ramdas, Additional Collector and Project Officer, DRDA, said, “Non-existence of toilets is only part of the problem. It is being addressed by encouraging people to build individual toilets by giving subsidies. But the primary problem is the very habit of defecating in the open and people not realising its harmful effects.” Hence, the motivators would be trained to focus on changing the attitude of people towards open defecation and not on the absence of toilets, she added.\n\nWhile some of the districts opted to provide two-hour training for elected representatives of panchayats, Madurai chose to train the volunteers for three days. “We want it to be outcome oriented. These 30 people will be assigned as many villages (not their own). They will, in turn, identify potential leaders from these villages and work closely with them to make the village Open Defecation Free,” Ms. Rohini said.\n\nShe expressed hope that three days of intense training and discussions would have a lasting impact instead of two-hour sessions. Assigning volunteers to their own village would not be effective as caste, family and other social equations in the village could hinder their work.\n\n“It’s not awkward”\n\nA primary focus of the training would be enabling the volunteers to discuss open defecation among villagers without inhibitions. Ms. Rohini said that the selection process of volunteers involved asking them to list Tamil words for excreta. “Those who said pure Tamil equivalents such as malam were not preferred. Instead, we chose those who could say colloquial Tamil words for excreta without any embarrassment,” she said.\n\nThe training, which has been designed on the principle of Community-Led Total Sanitation in an interactive manner with group-based activities, will involve early morning visits to nearby kanmois (tanks) and other places to confront and educate those who come to defecate in the open.\n\nMs. Rohini said that the training would even involve bringing human excreta to the training room to ensure that the volunteers were comfortable about discussing open defecation amid the stench.", 
    "section": "national", 
    "title": "Novel initiative against open defecation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}