{
    "author": [
        "K Manikandan"
    ], 
    "text": "Commuters welcome initiative, but wonder how much of it will work and how soon\n\nSouthern Railway officials said bandwidth is still a problem and people are unable to do high-speed browsing.—File Photo\n\nThe Railway Budget lays a lot of stress on greater role of information and communication technology to deliver services to passengers. Be it use of FM radio or increasing access to free WiFi and even making use of the helpline for additional services instead of just train information, the budget speech by the Minister has plenty of announcements, Chennai commuters pointed out and wondered how much of it will be implemented and how soon.\n\nOfficials said that so far 139 was being used only for getting train information, but it will now be upgraded to enable passengers even to cancel their tickets.\n\nThe budget lays a lot of stress on buying tickets from card and coin-operated machines and extension of free WiFi, now restricted to stations like Central and Egmore, to smaller terminals like Tambaram and Chengalpattu.\n\n“The stress on ticket machines operated by cards and coins has been made since the days of R.Velu as Railway Minister. It has not been a complete success even in metros. In suburban stations, it has not succeeded,” said R.A.Mukunthan of Paranur – Perungalathur Train Passengers Association.\n\nWhile they welcomed easy-to-use technology, the railway administration should ensure that it worked properly, adding that the free WiFi hardly worked even in the terminals.\n\nSouthern Railway officials said bandwidth was still a problem and hence people were unable to do high-speed browsing.\n\nHand-held terminal machines were currently in use in only a couple of zones of Indian Railways and even travelling ticket examiners used them to collect additional fare from passengers.", 
    "section": "national", 
    "title": "Plenty of easy-to-use technology coming", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}