{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chief Minister Jayalalithaa inaugurated, through video conferencing from Chennai, the new building constructed for the Madurai City Police Commissionerate on Alagarkoil Road.\n\nThe four-storey building with 40,188 square feet plinth area has come up at a cost of Rs. 7.01 crore.\n\nCommissioner of Police Shailesh Kumar Yadav said that the Madurai Commissionerate had grown over the years with opening of newer wings such as serious crime squad, cyber crime wing and expansion of Bomb Detection and Disposal Squad.\n\nThe new office complex would provide spacious accommodation for the officers and staff of the Commissionerate.\n\nPointing to the advantageous location of the new office, he said that it would provide easy access for people using public transport. The old office near Meenakshi Sundareswarar Temple was functioning in a cramped building with no easy access for the common man, he said. Spacious parking space, two lifts for the benefit of the aged and better ventilation were other advantages at the new office, he said.\n\nThough the shifting exercise would start soon, the old building would not be vacated but used for the office of the Traffic Police, he said. The old office of Deputy Commissioner of Police (Law and Order) would be used as court building for executive magistrate. The BDDS team would also be retained in the old building.\n\n“If the entire movement of police in the heart of the city is stopped, the road will be encroached upon and lead to traffic congestion around Meenakshi temple,” he said.\n\nSix police stations in the city were functioning in rented buildings. Land for four stations had been identified, he added.\n\nDeputy Commissioners of Police A.G. Babu (Traffic) and M. Rajarajan (Headquarters) were among the senior police officers and ministerial staff members present at the inaugural ceremony.", 
    "section": "national", 
    "title": "Police Commissionerate building inaugurated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}