{
    "author": [
        "R Srikanth"
    ], 
    "text": "Relaxation of restriction and control measures for high tension consumers has spiked the demand\n\nConstruction work on a 33-KV power sub-station by Tangedco on the Hiranandani Campus at Egattur, OMR, in Chennai. —Photo: M. Karunakaran\n\nEven as residents are experiencing an unusually warm spell of weather, the demand for electricity crossed the 3,000 Megawatt mark this month. Normally, the average demand during the month of February is in the range of 2,500 MW, but the relaxation of restriction and control measures for high tension consumers has spiked the electricity demand, officials said.\n\nThe demand for power in the city and its suburbs is likely to soar beyond 3,200 MW when summer peaks a few weeks from now.\n\nWith the Tamil Nadu Generation and Distribution Corporation (Tangedco) generating more than 13,500 MW of electricity, the government is concentrating on improving the distribution network. As part of this, work on 27 sub-stations of 33/11 kilo volt (KV) capacity has already been launched by the Tamilnadu Transmission Corporation (Tantransco). To complement these 33/11 KV substations, Tantransco is executing four 110 kilo volt substations in north and south Chennai.\n\nA senior official of Tantransco said the old sub-station at Velachery had already reached its maximum capacity owing to the huge area it covers and as it is the transmission source for other sub-stations in Adambakkam and Madipakkam.\n\nSimilarly, areas around Madipakkam, Narayanapuram and Pallikaranai are fast-developing residential areas. Residents of Madipakkam covering Aalayamman Nagar, Kuberan Nagar and Ram Nagar South, have been complaining of voltage fluctuations during the summer months. S. Vinod, of Alayamman Nagar in Madipakkam, complained how they were facing severe voltage fluctuations during the summer months.\n\nIn north Chennai, a 110-KV sub-station at R.K. Nagar inside the Communicable Diseases Hospital has been proposed. The official said a global tender has been called for the 110/33/11 KV sub-stations in Velachery, R.K. Nagar and Munusamy Salai, K.K. Nagar. While the sub-station in Velachery would be constructed adjacent to a mall on Velachery Main Road, the sub-station for R.K. Nagar and nearby areas would come up inside the Communicable Diseases Hospital on Tiruvottiyur High Road.\n\nThe official further pointed out that the three sub-stations to come up inside the city would be gas-insulated, whereas the sub-station at Pallikaranai would be air-insulated.\n\n“The difference between a gas-insulated sub-station and an air-insulated sub-station is that the gas type requires lesser space but costs more,” he added.", 
    "section": "national", 
    "title": "Power demand soars as city sweats", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}