{
    "author": [
        "Special Correspondent"
    ], 
    "text": "seamless passing:Southern Railway Principal Chief Engineer S.S. Gupta inspecting the opening of Scherzers span in Pamban rail bridge from the road bridge on Thursday.— Photo: L. Balachandar\n\nSouthern Railway Principal Chief Engineer S.S. Gupta inspected the operation of Scherzer’s span in the century-old Pamban rail bridge here on Thursday.\n\nAfter inspecting the stability of the track laid on the bridge by travelling in a special coach, attached to Madurai-Rameswaram Passenger train on Wednesday evening, Mr. Gupta inspected the operation of the span from the road bridge.\n\nHe witnessed vessels passing through the bridge after the manually operated span was opened during the scheduled time on Thursday afternoon. Mr. Gupta, however, declined to give details of the inspection, stating that he was not authorised to talk to the media.\n\nThe inspection assumes significance against the backdrop of railways’ decision to replace the ageing span with a new span at a cost of Rs. 25 crore. The Ministry of Railways has already sanctioned the funds and entrusted the work to Rail Vikas Nigam Limited (RVNL).\n\nThe existing 65.23-metre-long rolling type span, which opened like a pair of scissors to allow vessels to pass through the bridge, was being replaced with 66-metre-long single truss span. The new motorised span could be opened by the press of a button, sources said.\n\nRecently, Chief Engineer (Bridges) M. Suyambulingam had inspected the bridge to assess the strength of the foundations of the old span and asserted that the foundations were strong and the new span could be erected on them.\n\nMr. Gupta was accompanied by Senior Divisional Engineer (Madurai) Kannan, Divisional Engineer (North) Panneerselvam and Assistant Divisional Engineer (Karaikudi) Manikandan.", 
    "section": "national", 
    "title": "Principal Chief Engineer inspects Pamban rail bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}