{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Expressing concern over the continuing stalemate in the dispute between them and the Srirangam Sri Ranganthaswamy Temple with respect to the ownership of properties around the temple, a committee of residents of Srirangam have decided to form a human chain in Srirangam on February 28 urging the government to find a solution to the vexed issue.\n\nThe Arangma Nagar Nala Sangam – Srirangam Adimanai Urimai Meetpukuzhu, a committee of residents of Srirangam, pointed out that Chief Minister Jayalalithaa during the election campaign in 2011 had promised to find a solution to the problem. However, a solution has not been found yet, B. Hemanathan, president of the committee, said. The issue had been simmering for the past few years as a large number of property owners with pattas were not able to sell or pledge their properties after the temple authorities claimed ownership rights.\n\nProperty transactions, especially around the Srirangam temple, are not taking place in view of the dispute. The property owners claim that they had purchased the lands and pattas had been issued through settlements reached at different point of time in the past. The matter became a campaign issue during the Assembly election with Chief Minister Jayalalithaa promising steps to sort out the problem.\n\nThe committee pointed out that a large number of property owners with title deeds were not able to sell or pledge their properties after the temple authorities claimed ownership rights as per a title deed (number 1027) issued in 1866 under which temple authorities claim that 329 acres belong to the temple.\n\nDisputing the claim of the temple, Mr. Hemanathan maintained as per of Inam Fair Register of 1864 only land within the first four prakaras around the temple were treated as temple poramboke and the land between the fourth and seventh prakaras were classified as village site poramboke.\n\nIf the government failed to find a solution even after the human chain agitation, the committee was planning to field 108 candidates in Srirangam constituency for the Assembly election to highlight their demand, Mr. Hemanathan said.", 
    "section": "national", 
    "title": "Property owners in Srirangam demand resolution of dispute", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}