{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Allocation for Chennai-Cuddalore line meagre, says former MP\n\nThe budget has no announcement on the introduction of new daily express trains between Chennai and Puducherry or extension of existing train services.— File photo\n\nPolitical parties in Puducherry termed the railway budget proposal as a disappointment to the people of the Union Territory of Puducherry.\n\nSenior Congress leader and former Union Minister of State V. Narayanasamy said it seems that neither ruling AINRC nor sitting MPs from Puducherry have pressurised Union Railway Ministry to introduce any new train. When the United Progressive Alliance was in power, one or two trains were introduced to UT every year. But there was no new train in last two years of railway budget during the present BJP-led NDA Government in spite of the ruling AINRC being in alliance.\n\nM. Ramadass, former Member of Parliament, said the railway budget is great disappointment to the people of Puducherry and has not met the aspirations of travelling passengers of Puducherry.\n\nHe pointed out that there was no announcement on the introduction of new daily express trains between Chennai and Puducherry or extension of existing train services.\n\nAllocation of fund for new line between Chennai and Cuddalore via Mamallapuram and Puducherry is a solace to the people in this region. Mr. Ramadass said the sanctioned amount for the new line between Chennai and Cuddalore was Rs.119.5 crore during 2008. The work has been proceeding at snail pace and the expenditure at the end of March 2016 was just only Rs.2.18 crore. This budget made token provision of Rs.5 crore only.\n\nHe also said, “This is unjust and the railway ministry should show speed to complete the project. Perhaps the MPs and Chief Minister should pursue the matter relentlessly.”\n\nSome of the political parties pointed out that the Union Railway Ministry has allocated Rs. 40 crore for gauge conversion of Tiruchi, Nagore and Karaikal and restoration of the rail link between Karaikal and Peralam.\n\nThe original rail link between Karaikal and Peralam – a 23-km long metre gauge segment which was commissioned way back in 1898, was wound up in 1987.", 
    "section": "national", 
    "title": "Railway Budget disappointing, say political parties", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}