{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here on Thursday imposed costs of Rs. 2.25 lakh on nine individuals, including two Dravida Munnetra Kazhagam councillors, R. Arumugam and D. Andavar of Virudhunagar Municipality, for the inordinate delay of eight years in commencing construction of a road overbridge (ROB) across a railway level crossing on Ramamurthy Road in Virudhunagar.\n\nDisposing of a batch of cases related to the construction of the bridge, Justice R. Mahadevan directed each of the nine petitioners to pay Rs. 25,000 to the Chief Justice’s Relief Fund since they “seemed to be motivated personally against the project which was evident from the challenge made by them in the present cases without placing the actual facts and without verification.”\n\nBeginning his 95-page judgement with the sigh: “Here is yet another round of litigation by the respective petitioners regarding the issue of construction of an ROB in lieu of existing level crossing,” the judge went on to state: “The initial notification (for construction of the ROB) was published in 2008. Eight years have passed since then but not even a stone has been moved.”\n\nHe also recorded the submission of Additional Advocate General K. Chellapandian that the delay in constructing the bridge caused great hardship to students, office-goers, patients being rushed to hospitals in ambulances and others since the railway level crossing was being closed 88 times (roughly working out to 12 hours) every day to ensure safe passage of trains.\n\n“As the legal maxims Necessitas publica est major quam private and Jura publica anteferenda privatis juribus lay down, public necessity is greater than private necessity and public rights are to be preferred to private rights. Just because a few individuals are aggrieved, a project benefitting thousands cannot be permitted to be stalled for technical reasons which also have been found to be false,” the judge said.\n\nHolding that the State government had scrupulously followed all legal procedures with respect to construction of the ROB, the judge directed it to continue the process and complete the construction as expeditiously as possible while making sure that service roads were also provided simultaneously on the sides of the bridge for the ingress and egress of people living there.", 
    "section": "national", 
    "title": "ROB case: HC imposes costs of Rs. 2.25 lakh on nine", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}