{
    "author": [
        "S Senthalir"
    ], 
    "text": "Aurovillians celebrate 60{+t}{+h}anniversary of the descent of supramental consciousness on the Mother\n\nFlowers with their spiritual significance decorated the Asian Peace Table, a large low-flung table, at the Unity Pavilion complex in Auroville on Thursday. Aurovillians from across the world gathered and sat on the cushions arranged around the Peace Table.\n\nThey had come down to the Hall of Peace, which Auroville architect Piero Cicionesi designed especially for the sacred Peace Table, in the Unity Pavilion complex in Auroville, to celebrate the 60{+t}{+h}anniversary of the descent of supramental consciousness on the Mother at the Sri Aurobindo Ashram.\n\n“On February 29, the Mother had an exclusive experience in the playground in Ashram. She heard – ‘It’s time’. She knocked down a wall into two to allow the golden force to descend on her,” said Miriam Belov, a board member of the Nakashima Foundation for Peace.\n\nOn Thursday at 5 p.m, two board members were present in Auroville while their counterparts in Moscow and New York gathered at 2.30 p.m. and 6.30 a.m. respectively. ‘In the Light of the Supramental’, was the name given to the next stage of higher consciousness, which Sri Aurobindo saw as humanity’s spiritual destiny.\n\n“The day is to celebrate Mother’s Supramental Consciousness. This is the Supramental Year and the flowers for this day have been chosen based on its psychic meaning,” she added.\n\nThe bunch of flowers placed on the table included hibiscus and white rose.\n\nIt is said that renowned master craftsman George Nakashima, a devotee of Sri Aurobindo, at the end of his life came across a magnificent walnut tree and had the vision of creating Altars to Peace on each continent. The first was dedicated at the Cathedral of Saint John the Divine in New York City, the second went to the Academy of Art in Moscow and the third was dedicated twenty years ago in Auroville.\n\nThe board members Julian Lines and Miriam Belov, who were present in Auroville, contacted their counterparts in New York and listened to Mira Nakashima, daughter of George Nakashima.\n\nLater, the Aurovillians gathered around the Peace Table and read out the significance of flowers and immersed in meditation to the music of flute and Russian Flat Bells.", 
    "section": "national", 
    "title": "Seeking the supramental light", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}