{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The former swashbuckling opener plays with a straight bat\n\nKrishnamachari Srikkanth(left), former captain of the Indian cricket team and former chairman of the selection committee, S. Sundarrajan, Director, NIT Tiruchi, Commander K.S. Nathan,Vice President, Defence Shipbuilding, Larsen and Toubro,sharing some thoughts at the inauguration of Pragyan 2016, an International Techno - Management festival at NIT Tiruchi on Thursday.—PHOTO: B. VELANKANNI RAJ\n\nPragyan 2016, one of the major techno-management events of the National Institute of Technology-Tiruchi, got off to a colourful start with an energetic and blistering interaction with Krishnamachari Srikkanth.\n\nThe former India cricket captain stole the show by connecting well with the audience like he did on several occasions when he played for the country.\n\nHis session started after the formal inauguration, which was presided over by S. Sundarrajan, Director, NIT-T.\n\nCommander K.S. Nathan, Vice-President, Defence Shipbuilding, Larsen & Tubro, who was the chief guest of the event, highlighted the recent developments in defence sector.\n\nHe said the Make In India concept, which is spearheaded by the Centre, was an attempt to bring technology to the country to take forward the development agenda. Young engineers and technocrats should make use of the opportunity.\n\nSolaikutty Dhanabal, who was the guest of honour, spoke on the role of engineers on the overall development of the country.\n\nMr. Srikkanth then took the centre stage illuminating the minds of not only young students but also professors. Forthright and taking them on the chin, Mr. Srikkanth did not duck when questions were thrown at him. His flamboyant answers made the evening memorable one.\n\nWhen a student asked about the failure of giving a grand farewell to Virendra Sehwag, Mr. Srikkanth said he was undoubtedly one of the greatest batsmen that India had ever produced. He was the only Indian batsman who scored triple century twice in Test cricket. He should have been given a grand and deserving farewell.\n\nOn M.S. Dhoni’s leadership as captain of Indian cricket team, he said he had been the best stress manager of Indian team.\n\nHe never showed his emotion on the field.\n\nThe country had won all ICC trophies under his captaincy. No one could underestimate his contribution as a leader.\n\nQuestions from the audience revolved on bonding between cricketers and film stars, sledging, dressing room deliberations, cheer girls, women fan following and so on.\n\nHe finished the show by asking the students to take risk to achieve what they wanted to achieve and called upon them to enjoy life as it was so short. He wrapped up by predicting that Indian would once again win the T-20 World Cup.\n\nKeerthi Vasan, chairperson, Pragyan 2016 and Srinimalan, overall coordinator, Pragyan 2016 spoke.", 
    "section": "national", 
    "title": "Srikkanth gives some ‘gyan’ at Pragyan", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}