{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Two students of Government Arts College here who were placed under suspension by the college authorities, reportedly consumed poison and were admitted to the Government Mohan Kumaramangalam Medical College Hospital on Thursday evening.\n\nBoth of them were said to have taken this extreme step, as the college authorities reportedly refused to withdraw the suspension order.\n\nPolice sources said that M. Tamilselvan (20) of Pethanayakkanpalayam, P. Kannadasan (20) of Suramangalam in the city, Parthiban and Premkumar, all second year BA students, under the influence of liquor picked a quarrel with Khaja Hussain, their classmate on the college campus a few months ago and assaulted him.\n\nOn the complaint preferred by Khaja Hussain, the Principal placed all the four under suspension.\n\nTamilselvan and Kannadasam met the college authorities a few times with a plea to lift the suspension order. The Principal informed that the college disciplinary committee will meet and take a decision on this issue.\n\nSince, no step was taken to withdraw the suspension, both of them got dejected and consumed poison outside the college this afternoon, police said. Later, they themselves got admitted in the Government Mohan Kumaramangalam Medical College Hospital, where they are undergoing treatment. Their condition is stable, hospital sources said.\n\nHasthampatti police have registered a case and are investigating.\n\nMeanwhile, condemning the indifferent attitude of the college authorities, a group of members of the Makkal Desam Katchi, led by Sulaiman, its district youth wing leader, attempted road blockade agitation in front of the GH in the evening.\n\nOn receiving information, police rushed to the spot and pacified them. They later submitted a petition to the Collector and dispersed.\n\nThe students took the extreme step as the college authorities refused to withdraw the suspension order", 
    "section": "national", 
    "title": "Suspended college students attempt suicide", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}