{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Newly elected MMK office bearers say his term has expired\n\nThe Madras High Court on Thursday dismissed a plea moved by former general secretary of Manithaneya Makkal Katchi (MMK) M. Tameemum Ansari challenging the election of new office bearers. Mr. Ansari sought the court to declare the meeting held on October 6, 2015 as illegal and the resolutions passed electing party MLA M.H. Jawahirullah, P. Abdul Samad, and O.U. Rahamatulla as president, general secretary, and treasurer of the MMK as invalid.\n\nHe contended that the general secretary is the principal officer of the party and only he is entitled to represent MMK as per the party constitution. “While the fact being so the new office bearers convened a meeting on October 6, 2015 without my knowledge or association and took certain policy decisions which include dissolution of the then central administrative committee,” Mr. Ansari said.\n\nThe newly elected office bearers contended that the term of office of Mr. Ansari expired on September 21, 2015. The administrative committee convened a meeting on October 6, 2015 which was attended by 403 general council members as against the total number of 474. They alleged that the applicant thereafter conducted a meeting on October 11, 2015 and condemned the resolutions passed by the general council. In fact, the resolutions passed by the committee were communicated to the Election Commission of India, they added.\n\n“The present suit, filed with a clear understanding about the developments that took place after the expiry of the term of the applicant, is not maintainable,” the office bearers said.\n\nJustice K.K. Sasidharan noted that the applicant has moved the suit on behalf of MMK instead of filing it in his individual capacity though his term as general secretary has already expired and rejected his plea.\n\nNewly elected\n\nMMK office-bearers say his term as general secretary has expired", 
    "section": "national", 
    "title": "Tameemum Ansari’s plea dismissed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}