{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Commuters disappointed about lack of announcement on new projects\n\nThe Railway Budget for 2016-17 has evoked mixed response from the travellers and consumer activists of the central region.\n\nThe decision of the Railway Minister not to increase passenger fares and the announcement of Antyodaya Express and Deen Dayal coaches for the unreserved passengers were welcome, said M. Sekaran, president, Federation of Consumer and Service Organisations, Tiruchi.\n\nThe federation was hoping that the Minister would announce a new train between Tiruchi and Bengaluru and termination of the Pallavan Express in Tiruchi.\n\nHowever, these were not announced much to the disappointment of the travellers, Mr. Sekaran said.\n\nThe budget presented by the Railway Minister was more commercial and tech-savvy than passenger oriented, said A. Giri, member, Divisional Railway Users’ Consultative Committee.\n\nWhile Nagapattinam and Velankanni stations were identified as pilgrim centres for station development, it was disappointing that other well-known pilgrim centres such as Kumbakonam, Nagore, and Srirangam had been left out, said Mr. Giri, vice-president of Thanjavur District Rail Users’ Association.\n\nGPS-based station indicators inside the coaches and booking of retiring rooms on an hourly basis were some of the passenger-friendly initiatives.\n\nMaking all operational halts as commercial halts would highly benefit passengers at intermediate stations, Mr. Giri said.\n\nThe Railway Budget was not a reformist one and does not seem to have a clear thrust in any direction, said S. Pushpavanam, secretary, Consumer Protection Council, Tamil Nadu, Tiruchi.\n\nAlthough there was a mention of restructure, the board was bloated by more directorates and a new Planning Development Organisation. The expected reduction in steep cancellation charges had not come, he said.\n\nTime table\n\nThe time-table for freight trains, 95 per cent punctuality, seats on demand, 80 km speed of express trains, and zero direct discharge from trains were all welcome, he said and added that one had to wait till 2020 for these. The move to install information display screens on rail network on platforms was welcome.\n\nThe idea of a railway university should be dropped as it was a non-core activity. A long-distance train having only unreserved coaches was welcome, Mr. Pushpavanam said.\n\nTerming the railway budget as a “great disappointment”, N. Ramakrishnan, founder-secretary, MGR Nalpani Mandram, Tiruchi, said rural India had been pushed out by the Railway Ministry.\n\nThere was big support only for metro cities which was a serious concern towards the country’s growth, he said.\n\nThe Communist Party of India (CPI) Tiruchi urban district secretary K. Suresh said it was disappointing that the railway budget did not have any new projects.\n\nThe budget aims at making railway lands commercial thereby paving the way for big corporates to make profits, Mr. Suresh added.\n\nWelcoming the announcements in the railway budget, the BJP’s national council member La. Kannan said it did not impose burden on the people.\n\nDISAPPOINTMENT\n\nThere has been a strong demand for more train between Tiruchi and Bengaluru\n\nRailways seen to be tilting more towards metro cities rather than rural India", 
    "section": "national", 
    "title": "Tiruchi’s demands still on waiting list", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}