{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram: Car festival, abishekam, 6 p.m.; Ambal purappadu in Anna vaganam, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Sathya Sai Vidyalayam, Aruna Nagar, Srirangam, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 94, Balamurugan Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nOrganising Committee: Sri Thyagabrahma aradhana mahotsavam, vocal concert by Ramakrishnamurthy and party, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; vocal concert by Swarna Rethas and party, 8 p.m.\n\nRasika Ranjana Sabha: Centenary programmes, vocal concert by Arathi Ananda Krishnan and party, FGN Hall, W.B. Road, 6.30 p.m.\n\nKalai Kaviri College of Fine Arts: Graduation day of bharathanatyam and music certificate programmes, G. Baskaran, Vice-Chancellor, Tamil University, presides, 5.30 p.m.\n\nHoly Cross College Department of Visual Communication: Media.com – inter-collegiate cultural fest, 9 a.m.\n\nGENERAL\n\nNational Institute of Technology: Pragyan – techno management meet, Ravi Nawal, author of India Can, speaks, 11.30 a.m.; Ralph Leighton, biographer of Richard Feynman, speaks, 2.30 p.m.; Peter C. Schultz, co-inventor of optical fibers, speaks, 8 p.m.; illusion hour by J.C.Sum, 7 p.m.\n\nBharathidasan University Department of Environmental Management: Lecture on “EMS audit: procedure and purpose” by S. Nagarajan, leader auditor, TVE Certification Services Pvt. Ltd., 2.30 p.m.\n\nDiabetes Club of Tiruchi: Annual professional conference, Dr. A.K. Singh and Dr. K. Manokar, speak, Hotel Sangam, 7.30 p.m.\n\nDistrict Administration: Farmers grievances meeting, K.S. Palanisamy, Collector, presides, Collector’s Office, 10.30 a.m.\n\nJamal Institute of Management: International conference on “Advanced management challenges in knowledge era”, A.R. Kaamil Fareed, general manager (trading), East India Energy Company PTE Ltd., Singapore, inaugurates, 9.30 a.m.\n\nBishop Heber College: International conference on “Chemistry for renewable energy”, 10.30 a.m.; valediction, D. Paul Dhayabaran, principal, presides, 3.15 p.m.\n\nJ.J. College of Engineering and Technology: National Science Day, lecture on “Atoms in the service of mankind” by J. Daniel Chellappa, Senior Scientist, Bhabha Atomic Research Centre, 9.30 a.m.\n\nRajiv Gandhi National Institute of Youth Development and Periyar E.V.R. College: Youth-led sustainable development programme in higher educational institutions – youth connect Make In India through employability skills, 10 a.m.\n\nDepressed People’s Welfare Association: Inauguration of deep borewells and hand pumps and water tanks by Michael Viser, founder and CEO, Wells for Life, Government Higher Secondary School, Pullampadi, 2.15 p.m.; R.C. Elementary School, Kumulur, 3.15 p.m.; R.C. Elementary School, Thachankurichi, 4 p.m.; Pudur Uthamanur, 5 p.m.\n\nShenbaga Tamil Arangu: The former MLA S. Arockiasamy Memorial Meet, S. Samimuthu, presides, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nMIET Engineering College: Entrepreneurship camp, 10 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Seminar on “Analysis of mechanical and metallurgical behaviour of friction stir welded dissimilar aluminium joint”, 5.15 p.m.\n\nVetri Vinayaha College of Engineering and Technology: Mupperum vizha, sports day and opening of basketball court, A.Kaliyamurthy, former Superintendent of Police, chief guest, 10 a.m.; annual day, Stanley George, Vice President (HR), Hexaware Technologies Ltd., M. Sathish, actor, chief guests, 4 p.m.\n\nOrganising Committee: R. Vishnudas birth day and ‘Vallagal Dina vizha,’ T.Purushothaman, presides, Vinobha Educational Complex, Lalgudi, 10 a.m.\n\nRukmani Nursery and Primary School, Lalgudi: Annual day, K. Indirajithu, manager, Canara Bank, Lalgudi, presides, LNP Girls Higher Secondary School campus, 4.30 p.m.\n\nSt. George’s Montessori Matriculation School, Anbil Nagar: School day celebration, Rev. Fr. Gerald Raja Fernando, Dean, Capuchin Theological and College Francesco, chief guest, 6.15 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}