{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Workers’ rights were under attack and it was time for all trade unions to fight together on a common platform, said Gurudas Dasgupta, general secretary, All India Trade Union Congress, at the organisation’s 41{+s}{+t}session that is under way here from February 25 to 28.\n\nAddressing the inaugural session, Mr. Dasgupta said that the country was in a “critical situation” where workers’ rights were under attack by the Central Government that was trying to change labour laws to suit corporate companies and multi-national companies.\n\nIt was time that all trade unions joined hands to oppose the move to snatch away labour rights.\n\nIt was with this intention that the AITUC had made ‘unity is strength’ as its slogan for the 41{+s}{+t}session.\n\nHe gave a call to the AITUC members and leaders of other trade unions to fight the anti-labour, anti-people and pro-corporate policies of the Government and defend democracy as well. The AITUC was with the Democratic Students’ Union leader Kanhaiah Kumar and also with the students of the Jawaharlal Nehru University and Jadhavpur University.\n\nGeorge Mavrikos, General Secretary, World Federation of Trade Unions, said that the organisation was with the AITUC in protecting workers’ rights.\n\n“We express our solidarity to the struggle of the Indian working class and we fully back the charter of demands for the betterment of the workers lives in India.”\n\nCongratulating the AITUC for its 95 years of struggle for the working class, he said that the trade union had been playing a leading role in forging united struggles and continued to do so against neo-liberal policies. The trade union also correctly analysed the world and the workers’ conditions therein.\n\nThere was an international capitalist crisis that mooted competition among monopolies and forced the implementation of the anti-labour policies. This way the capitalists wanted the workers to pay for the crisis they did not create.\n\nAITUC president Ramendra Kumar criticised the Central Government’s handling of the students issue in JNU. The Government’s handling of the economy had been equally bad. He also accused the Government of curbing workers’ rights.\n\nD. Pandian, Chairman, Reception Committee, said that nationalist and progressive forces had been reduced to a fraction under the communal BJP government. With the Government’s backing, the communal party drew full support and there was free flow of foreign capital.\n\nThe Government in the name of economic reform was attempting to snatch away and nullify the hard won rights of the working class, he added.\n\nLeaders of other trade unions also spoke at the inaugural session.", 
    "section": "national", 
    "title": "Workers’ rights under attack: Gurudas Dasgupta", 
    "subsection": "tamilnadu", 
    "date": "2016-02-26"
}