{
    "author": [
        "Bhavya Dore"
    ], 
    "text": "Nearly 200 children below the age of six years are growing up behind bars alongside their jailed mothers, according to Maharashtra government figures.\n\nOn Thursday, the State told a division bench of Justice V.M. Kanade and Justice R.P. Mohite Dere that there were 193 children aged six or below who were in prisons across the State along with their mothers who had been jailed for various crimes.\n\nThe High Court was hearing a suo motu public interest litigation (PIL) on the basis of a report from the non-profit group Prayas on the condition of young children who were in prison because their mothers were serving terms.\n\nThe High Court took the matter up as a PIL to “give appropriate directions” for the education of the children and their mothers and “formulate a scheme and guidelines for the benefit of such children”.\n\nHiten Venegavkar, appearing for the State, informed the court that there were 846 children of women prisoners not in prison, but living outside. The High Court asked the State to file an affidavit with further details.\n\n“We have asked the State government to give particulars of their age and also to respond to whether they are being looked after by guardians or are in a children’s home,” said the order. “The affidavit should also state whether the recommendations made by Prayas will be followed by the authority concerned.”\n\nPrayas had submitted a slew of recommendations. These included setting up an anganwadi in prisons with more than five children, financial assistance to help in rehabilitation of the women and children, budgetary increases for released prisoners, probation officers to assist in school admissions, and other things.\n\nVenegavkar said some of the government departments concerned had replied to the suggestions but the home and jails authorities were yet to do so.\n\nIn an order in June last year, the court had sympathised with the condition of such children.\n\n“It is an accepted position that after women are arrested by the police, very often their children become orphans and with the result that they are either sent to remand home or centre homes,” it said.\n\n“Very often these children are shifted to other places and their whereabouts thereafter are not traceable. We hope that the State of Maharashtra would take into consideration the suggestions which have been made by Prayas and submit a detailed response to the said suggestions and also a time frame within which these suggestions can be implemented.”\n\nThe State has to file its reply in two weeks. The matter will next be heard on February 25.\n\nThe writer is a freelance journalist\n\n846 children of women prisoners\n\nin Maharashtra\n\nare living\n\noutside prison", 
    "section": "national", 
    "title": "193 children growing up behind bars in Maharashtra", 
    "subsection": "general", 
    "date": "2016-02-12"
}