{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "He had allegedly announced that Akhlaq had slaughtered a cow which led to lynching\n\nThere are fresh troubles ahead for the priest of the temple in Dadri village who allegedly made the announcement about Akhlaq having slaughtered a cow which led to his lynching.\n\nYusuf Saifi, counsel of Mohammad Akhlaq, will on Monday file an application in the Greater Noida court — where the lynching case is under trial — requesting the Chief Judicial Magistrate to call Sukhdas Mahatma, the priest, as an accused in the case.\n\nKey witness\n\nThe priest, a key witness, had told the media that he was forced by the culprits to announce from the loudspeaker of the village temple that Akhlaq had slaughtered the cow, asking the villagers to gather outside Akhlaq’s house on September 28, 2015. According to Akhlaq’s daughter Shaista’s testimony, soon after the announcement, a mob dragged Akhlaq outside the house and lynched him.\n\n“Minutes after the announcement was made from the temple loudspeaker, we found that a crowd was outside our house, pushing the main door while hurling abuses at my father. Soon, they broke the door and dragged him out and lynched him,” she told The Hindu .\n\nMr. Saifi told The Hindu that Mr. Sukhdas’ claims about making the announcement were on record. “It was the announcement which led to Akhlaq’s lynching. So he has to be made accountable to the law and be examined about his role in the entire episode,” added Mr. Saifi.\n\n“We want to examine if he actually made the announcement. The other question we want to ask him is that why did he run away from the village if he did not do any thing wrong,” Mr. Saifi told this correspondent on phone from Greater Noida.\n\nHe had allegedly announced that Akhlaq had slaughtered a cow which led to lynching", 
    "section": "national", 
    "title": "Akhlaq’s family wants priest examined in court", 
    "subsection": "general", 
    "date": "2016-02-12"
}