{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "rigadier H.P.S. Bedi (retd) was commanding the 102 Brigade in 2003 when a company commander and a doctor serving in a post at 19,000 feet on the central Siachen glacier went on snow scooters to a post where someone was sick. But in between, the doctor went missing as he fell into a crevice. Till now, his body has not been found.\n\nThe incident of Lance Naik Hanamanthappa and nine others of 19 Madras Regiment reminded me of that incident recalled Brig. Bedi.\n\nIn another instance, Air Vice-Marshal Manmohan Bahadur, a helicopter pilot, evacuated many casualties but recalled one incident where he had to evacuate a Naga boy of 20 years suffering from cerebral oedema. “We picked him up and by the time we landed in minutes, he was dead. I cannot forget this to this day after over 20 years,” he said.\n\nThe miraculous survival of Lance Naik Hanamanthappa under 35 feet of snow for six days in Siachen glacier has brought to light the extreme difficulties our soldiers endure in patrolling the peaks of Soltoro ridge.\n\nBehind the endurance there is a rigorous training regimen to prepare the men, both mentally and physically, for posting there.\n\nEvery Army unit has soldiers specialised in high altitude warfare trained at the High Altitude Warfare School (HAWS) at Gulmarg. These trainers impart initial training to their unit members if they were to do a posting in Siachen, said Brig. Narender Kumar (retd), Senior Fellow at the Centre for Land Warfare Studies.\n\nThere are five parameters soldiers are trained for. Physical and medical fitness, skill in negotiating terrain, ability to withstand prolonged isolation, ability to be combat worthy over long time and survival and rescue in snow and the glacier.\n\nTo prepare for these, there are separate courses in mountaineering and winter warfare, Brig. Kumar, who served as instructor at HAWS, explained.\n\nDespite the tough conditions, one would be surprised to know that despite the tough conditions, soldiers and officers volunteer to serve there.\n\n“I volunteered many times to serve in Siachen but did not get the chance. I have done all other postings but I still regret not having done those three months on the glacier,” Brig. Kumar said, not hiding his disappointment.\n\nIt is considered by a soldier that soldiering is not complete until one wears the piece of metal written Operation Meghdoot on the chest, according to a senior officer.", 
    "section": "national", 
    "title": "At Siachen, every day is a battle of body, mind for troops", 
    "subsection": "general", 
    "date": "2016-02-12"
}