{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The power of the Indian diaspora came back in focus with the announcement of Australia’s new High Commissioner to India.\n\nHarinder Sidhu, an Australian born in Singapore and of Indian origin, is expected to arrive in Delhi next week. Announcing Ms. Sidhu’s appointment, the Australian High Commission said it “continues a tradition of Australian representatives with strong connections to India”.\n\nA previous envoy, Peter Varghese was also of Indian origin, and is currently the Foreign Secretary of Australia (Secretary, Department of Foreign Affairs and Trade).\n\nMs. Sidhu comes after Richard Varma, who became the US’s first Indian-Origin Ambassador, and Nadir Patel, Canada’s High Commissioner to India, were both posted to New Delhi. There is even speculation about the soon-to-be announced British High Commissioner.\n\nFormer diplomats say the trend was something India frowned upon in the past, but is more welcome now.\n\n“As Indians climb up to senior government positions in these countries, it would be natural that more will be sent to India,” said former Ambassador Neelam Deo, Author at Mumbai-based think-tank Gateway House. “If they are only being sent because they are of Indian-origin, that would not be so welcome, as they would be seen as lightweight,” Ms. Deo said.\n\nFormer deputy NSA Latha Reddy said the growing practice of Indian-origin diplomats being posted to India has been successful so far. “The special connect with India gives them an advantage in dealing with their Indian counterparts,” she said.\n\nAs a result, ambassadors are expressing that “special connect” quite openly. When U.S. Ambassador Mr. Varma went on a visit to his ancestral village near Jalandhar last summer, he was accompanied by crowds and wide media coverage. Mr. Patel spoke publicly about his conversations with Prime Minister Narendra Modi being conducted in Gujarati.\n\nMs. Sidhu too said she has always been “fascinated by the country of my heritage and am keen to learn more about India — its language, culture and history — while I am there.”", 
    "section": "national", 
    "title": "Australia adds to list of desi diplomats", 
    "subsection": "general", 
    "date": "2016-02-12"
}