{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "The BJP on Thursday demanded that Bihar Chief Minister Nitish Kumar apologise for calling Ishrat Jahan ‘Bihar ki Beti’ (daughter of Bihar), soon after David Coleman Headley told a Mumbai special court that she was a Lashkar-e-Taiba operative.\n\n“Now, Mr. Nitish Kumar should apologise to the country. To garner votes, he had called a terrorist ‘Bihar ki Beti.’ The Congress, [RJD chief] Lalu Prasad and Mr. Nitish Kumar eye votes. The BJP does not take the help of terrorists to garner vote,” BJP MP from Nawada and Union Minister Giriraj Singh said.\n\nIn July 2013, severing ties with the BJP, Mr. Nitish Kumar called Ishrat Jahan ‘Bihar ki Beti’ because she had spent her childhood in the State. He was criticising Narendra Modi, then Gujarat Chief Minister, for the alleged fake encounter, in which Ishrat Jahan was killed near Ahmedabad.\n\nLater, Ali Anwar, another leader of the ruling Janata Dal (United) pledged to get her justice.\n\nBJP national spokesperson Syed Shahnawaz Hussain said those who had called Ishrat ‘Bihar ki Beti’ should make their stand clear in the light of Headley’s deposition.\n\n“After the encounter, many leaders called her innocent and some were calling her the daughter of Bihar. Today, it has become clear that it was not a fake encounter, and they should take back their statements,” he said.\n\nAnother BJP leader and Union Minister Ravi Shankar Prasad said Mr. Nitish Kumar and his party should not politicise everything.\n\nAccording to information accessed by The Hindu , Ishrat had spent her childhood at Jamalpur in Munger district in Bihar where she studied up to Std. II in St. Roberts School. At that time, her maternal grandfather, Abdul Majid, was working at the Jamalpur railway factory. Later, he went to Alamganj in Patna. Ishrat’s grandparents were living at Khagaul, near Patna, and her father Shamim Raza started a business in Patna but shifted his base to Mumbai.\n\nJD(U) leader Ali Anwar said: “David Headley is not Yudhistra… Give him Padma Bhushan or any other award for whatever he has said.”", 
    "section": "national", 
    "title": "BJP wants Nitish to apologise for lauding Ishrat Jahan", 
    "subsection": "general", 
    "date": "2016-02-12"
}