{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The Centre aims at generating 700 mw of power from solid waste-run plants in the next 5 years.- File Photo: Ch. Vijaya Bhaskar\n\nThe Central government has issued a circular to all power distribution companies stating it was mandatory for them to buy electricity from power plants fuelled by solid waste. In case the companies brush aside the instructions, the government would impose severe penalties on them, an entitlement that comes from the recent amendment of the Electricity Regulatory Act (2013), the notice said.\n\n“It’s a big decision taken by the government,” said Praveen Prakash, Joint Secretary at the Ministry of Urban Development.\n\nMr. Prakash said about four solid waste-run power projects across the country had to be shut down because power distribution companies would not buy electricity from them. “No private power company was interested in investing in such power plants,” he said.\n\nTo turn Prime Minister Narendara Modi’s Swachh Bharat Mission a success, Venkaiah Naidu-led urban development ministry convinced the power ministry in early January to amend the Electricity Regulatory Act 2013 and include the “penalty” clause for companies that violate the new instructions.\n\nThe Centre now aims at generating 700 megawatts of electricity from solid waste-run plants in the next five years.\n\n“Every day, about 1.68 lakh tonnes of solid waste is collected across the country,” said Aishwar Rao, the spokesperson at Urban Development Ministry. “So we want to use it as much as we can.”\n\nAs State governments will have to build plants that can produce energy from solid waste, the ministry offered to cover “20 per cent” of the cost of each plant. This money would come from the Swachh Bharat Mission.\n\nOf its budget allocation of Rs. 62,000 crore, Rs. 38,000 crore would be spent on building solid waste management infrastructure across the country. The road to arriving at energy generation is still long but the ministry has made a significant progress in setting up an effective door-to-door collection and transportation of solid waste, the official said.", 
    "section": "national", 
    "title": "Centre makes it mandatory for power firms to buy from solid waste plants", 
    "subsection": "general", 
    "date": "2016-02-12"
}