{
    "author": [
        "Arun S"
    ], 
    "text": "Commerce and Industry Minister Nirmala Sitharaman has said the ‘hate in India’ campaign on alleged incidents of intolerance was artificially built up by the Congress at a time when the Centre was promoting the ‘Make in India’ (MII) initiative.\n\nWith most investors saying the passage of Goods and Services Tax (GST) Bill by Parliament in the coming Budget session is crucial for MII and Start-up India’ initiatives to be successful, Ms. Sitharaman told The Hindu that the investors’ concern on the delay in implementation of the GST “must be taken to the people who do not want the GST, including the Congress party.”\n\nHer comments come in the backdrop of Congress leaders claiming that India will not be able to attract investment through the MII initiative because of “increasing” instances of intolerance and attacks on minorities. The Congress also alleged that the BJP was unwilling to engage in discussions on the GST.\n\n“There is no ‘hate campaign’ in this country. If they (Congress) want to artificially build up a campaign that does not exist, it is they who have to answer,” she said.\n\nOn the problem of inverted duty structure (where the duty on inputs/raw materials/components is higher than that on the finished product) affecting local manufacturers, the minister said she was hopeful that the coming Budget would address this issue.\n\nShe said the recent government decision to do away with customs duty exemption on life-saving medicines could boost the MII programme, adding that the government would ensure that its initiatives under the MII comply with the World Trade Organisation’s norms.\n\nRejecting reports that the government could allow 100 per cent FDI in the ‘market-place model’ of e-commerce, Ms. Sitharaman said these were “mere speculations.”\n\nWithdrawal of customs duty exemption on life-saving medicines will boost the MII programme", 
    "section": "national", 
    "title": "Cong. whipped up hate campaign, says Minister", 
    "subsection": "general", 
    "date": "2016-02-12"
}