{
    "author": [], 
    "text": "Scientists have found a direct correlation between poor fitness and acceleration in brain ageing.— File Photo\n\nDo you love to spend more time watching TV or movies and hate to exercise? Go hit the ground running as poor physical fitness in middle age may accelerate brain ageing in just two decades, warn researchers.\n\n“We found a direct correlation in our study between poor fitness and brain volume two decades later which indicates accelerated brain ageing,” said study author Nicole Spartano from Boston University School of Medicine in the US.\n\nPeople with poor physical fitness often have higher blood pressure and heart rate responses to low levels of exercise compared to people with better fitness.\n\nFor the study, published in the journal Neurology , 1,583 people were enrolled with an average age of 40 without dementia or heart disease and took a treadmill test.\n\nThey went through another test two decades later along with MRI brain scans.\n\nThe researchers also analysed the results when they excluded participants who developed heart disease or started taking beta blockers to control blood pressure or heart problems.\n\nThe results showed that those who performed poorly on the treadmill test had brain volume smaller two decades later —— equivalent to two years of accelerated brain ageing.\n\nWhen the people with heart disease or those taking beta blockers were excluded, lower physical performance was associated with reductions of brain volume equal to one year of accelerated brain ageing, the researchers noted.\n\nThe vulnerable ones\n\nThe study also showed that people whose blood pressure and heart rate went up at a higher rate during exercise were more likely to have smaller brain volumes two decades later.\n\n“This showed that poor physical fitness causes a loss of brain volume,” Spartano added. — IANS", 
    "section": "national", 
    "title": "Couch potato? Your brain may shrink as you age", 
    "subsection": "general", 
    "date": "2016-02-12"
}