{
    "author": [
        "Amit Baruah"
    ], 
    "text": "Clearly gearing up for the coming Assembly elections in Punjab, Delhi Chief Minister and Aam Aadmi Party (AAP) leader Arvind Kejriwal said his party would repeat Delhi in Punjab.\n\n“Congress will be next in line [runner-up] in the Punjab polls,” Mr. Kejriwal told a select group of editors from the print media at his official Flagstaff Road residence in the Civil Lines area of the city.\n\nSitting smack in the middle of his Ministers, a relaxed Mr. Kejriwal said that people voted for the AAP with a lot of hope and expectation.\n\nWhen people voted out the Congress and elected the BJP, or vice versa, they didn’t do so with hope.\n\nMr. Kejriwal claimed that the AAP already had workers at every electoral booth in Punjab, a far cry from the state of the Congress.\n\n“The Congress party talks in the air,” the Delhi Chief Minister said. “By the time the others [Congress, Akali Dal-BJP] wake up, their game will be over,” he claimed.\n\nPlans for U.P.\n\nOn the party’s plans for the elections in Uttar Pradesh, Mr. Kejriwal replied, “We will go step by step. We don’t have the bandwidth in U.P.”\n\nAsked about the AAP’s plans for the 2019 general elections, Mr. Kejriwal said he would respond in 2018.\n\nAsked why he practised the politics of confrontation, the Chief Minister said he and his party were at the receiving end as displayed by the actions of the CBI.\n\n“I am willing to do anything to avoid confrontation,” the Chief Minister said. “When I speak up [against the Centre], people say I am fighting with the Centre.”\n\nThe Chief Minister said his decision last year not to keep any portfolio with him had worked well for the government’s functioning.\n\n‘We are at the receiving end of Centre’s actions’", 
    "section": "national", 
    "title": "Delhi will be repeated in Punjab: AAP leader", 
    "subsection": "general", 
    "date": "2016-02-12"
}