{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "President Pranab Mukherjee has condoled the death of Lance Naik Hanamanthappa Koppad.\n\nHe wrote to his mother Basamma Koppad: “I am deeply sad to learn about the passing away of your son, Lance Naik Hanamanthappa Koppad. Lance Naik Koppad was a hero who demonstrated exemplary will power and courage in the face of adversity. He made the supreme sacrifice in line of duty. In this moment of grief, the sympathies and condolences of the entire nation are your family and you. The nation shall always remember Lance Naik Hanamanthappa for his bravery and indomitable spirit.”\n\nHanamanthappa’s medical condition looked hopeful on Tuesday as he did not have any cold-related injuries, but was in a coma with multiple-organ failure. A team of doctors worked all night but his condition deteriorated on Wednesday.\n\nOn Thursday morning, the Army’s medical bulletin said: “His circulatory shock is now refractory to all drugs in maximum permissible doses and his kidneys remain non-functional.”\n\nThe bulletin sounded ominous: “He was on maximal life support with aggressive ventilation and dialysis. He has slipped into a deeper state of coma.”\n\nWithin hours of Hanamanthappa’s death, Pakistan said it was keen on early demilitarisation of the glacier, where hundreds of soldiers have died mostly because of harsh weather conditions. “We hope the Siachen issue is treated in an urgent manner between our two countries, so more lives aren’t lost,” Pakistan High Commissioner Abdul Basit said in New Delhi. “We strongly feel that the time has come to ensure more lives are not lost under harsh conditions in Siachen,” he said. Since it lost more than 120 soldiers in an avalanche in 2012, Pakistan has been advocating withdrawal of troops from the glacier.\n\nThe 76-km-long glacier in the Saltoro ridge beyond Point NJ 9842, where the Line of Control ends, was left un-demarcated all these years. Pakistan began allowing tourists in the 1970s, and there were occasional reports of its attempt to occupy the glacier. In a pre-emptive move, the Indian Army occupied the highest peaks, at 21,000 feet, in April 1984 under Operation Meghdoot. For 30 years, it remains the longest continuing military operation anywhere in the world.\n\n2,000 soldiers dead\n\nIndia and Pakistan have been battling weather more than each other on the glacier and have lost over 2,000 soldiers. The Army has maintained that demilitarisation is not possible without Pakistan demarcating current positions and without a foolproof mechanism for monitoring violations.\n\nAfter Mr. Modi’s surprise visit to Lahore, many Army officers, who oppose India vacating vantage positions, have expressed apprehensions that Siachen might be a victim of political goodwill measures.\n\nPakistan says it\n\nis keen on early demilitarisation of the glacier so that lives can be saved", 
    "section": "national", 
    "title": "He made the supreme sacrifice, says Pranab", 
    "subsection": "general", 
    "date": "2016-02-12"
}