{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "Later chooses her name against 3 suggested by prosecutor; says LeT women’s wing was led by Abu Aiman’s mother\n\nontinuing his deposition on Thursday in a special court hearing the 2008 Mumbai attacks case, American-Pakistani terrorist David Headley told the Judge G.A. Sanap that LeT members Sajjid Mir and Abu Kahaffa and a former Pakistani navy officer decided in March 2008 that Headley should go to Mumbai to select safe landing sites. Kahaffa’s nephew was one of the 10 young boys who attacked the city.\n\nHeadley said he took one boat ride to the Gateway of India and two more from Cuffe Parade, which eventually became the landing point, and a fourth from Worli. He used GPS to mark locations and saved the readings for safe entry and exit.\n\nHeadley told the special court that Ishrat Jahan was a Lashkar-e-Taiba operative although earlier he said he knew nothing about suicide bombers in the LeT. As Special Public Prosecutor Ujjwal Nikam gave him three names, Headley chose Ishrat Jahan.\n\n“I think Ishrat Jahan was an Indian national, not a Pakistani, and was an LeT operative,” he said.\n\nIshrat Jahan (19) was killed by the Gujarat police in an alleged fake encounter near Ahmedabad in June 2004. Javed Ghulam Sheikh, Zeeshan Johar and Ajmad Ali Akbar Ali Rana were also shot dead along with her. Zeeshan and Amjad were Pakistani nationals. Headley knew that the women’s wing of the LeT was led by Lashkar operative Abu Aiman’s mother. Muzzamil Butt told him that after Indians demolished the Babri Masjid, it was “allowed” for them to attack Indian temples.\n\nHe said fellow convict Tahawwur Rana who had come to receive him in Mumbai gave him $ 500 in September 2006, Rs. 67,605 in October, Rs. 17,636 in November and $1000 in December.\n\nC", 
    "section": "national", 
    "title": "Headley initially did not name Ishrat Jahan", 
    "subsection": "general", 
    "date": "2016-02-12"
}