{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The much anticipated agreement on accessing UAE’s Sovereign Fund was not declared on Thursday\n\nPresident Pranab Mukherjee with UAE Crown Prince Sheikh Mohammed bin Zayed al Nahyan during a meeting at Rashtrapati Bhavan in New Delhi on Thursday.— PHOTO: PTI\n\nFollowing discussions held at the Hyderabad House between Prime Minister Narendra Modi and the visiting Crown Prince of Abu Dhabi, Sheikh Mohammed bin Zayed Al Nahyan, India and the United Arab Emirates (UAE) on Thursday signed nine agreements covering cooperation in the fields of currency swap, culture, investments in the infrastructure sector, renewable energy, space research, insurance supervision, cyber security, skill development and commercial information sharing.\n\nEarlier in the day, Sheikh Bin Zayed was given a ceremonial welcome at the forecourt of the Rashtrapati Bhavan. Sheikh bin Zayed also had a restricted meeting at 7, Race Course Road, with Mr.Modi. The Ministry of External Affairs initially announced four agreements but revised the list later adding five more agreements.\n\nAnwar Gargash, UAE’s Minister of State for Foreign Affairs, told The Hindu that both sides had reached an understanding on a wide range of issues and the agreements signed on Thursday were the beginning of a new era of bilateral cooperation.\n\n“We have common interest in fighting terrorism and, therefore, we have an agreement to counter terror in the cyber field. Defence collaboration is also progressing well,” said Dr.Gargash, highlighting that a great deal of bilateral cooperation had taken off since Mr.Modi visited UAE in 2015.\n\nHowever, the much anticipated agreement on India accessing UAE’s Sovereign Fund was not declared on Thursday. “India should carry out some structural changes in its economy to facilitate such an agreement,” Dr.Gargash said.\n\nDr.Gargash said India and the UAE had begun a dialogue that would firm up a Free Trade Agreement between India and the Gulf Cooperation Council.", 
    "section": "national", 
    "title": "India, UAE sign nine agreements", 
    "subsection": "general", 
    "date": "2016-02-12"
}