{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A Division Bench of the Kerala High Court on Thursday turned down the anticipatory bail plea of CPI(M) leader P. Jayarajan, whom the CBI probing the murder of RSS worker Kathiroor Manoj has listed as an accused.\n\nThe Bench comprising Justice K.T. Sankaran and Justice K.P. Jyothindranath passed the verdict while dismissing an appeal filed against an earlier order of the Sessions Court in Thalassery refusing him anticipatory bail.\n\nManoj, an RSS activist was hacked to death at Kathiroor in Kannur district on September 1, 2014 allegedly by a group of CPI(M) workers. Mr. Jayarajan, arraigned as the 25th accused, has been charged with offences under the provisions of the Unlawful Activities (Prevention) Act (UAPA).\n\nThe court observed that under the proviso to sub-section (5) of Section 43(D) of UAPA, the accused shall not be released on bail if the court came to the conclusion on perusal of the case diary or a report under Section 173 of the Criminal Procedure Code that there were reasonable grounds for believing that accusation against the accused was prima facie true.\n\nThe court observed that it was satisfied that prima facie, there was material against the accused. A stage had not been reached to arrive at a conclusion as to whether the allegations levelled against him were true or not. The court, while refraining from expressing any opinion on the merits of the case or regarding the allegation made against Mr. Jayarajan, said that any opinion expressed either way would cause prejudice either to the prosecution or the defence.\n\nIn his appeal, Mr. Jayarajan had contended that his political opponents were trying to tarnish his image. He pointed out that he was a member of the CPI(M) State committee and that he was elected twice as MLA from Kuthuparamba Assembly constituency. Besides, he was a physically handicapped person and was suffering from acute cardiac problems. He had recently undergone an angioplasty.\n\nReferring to these averments, the Bench pointed out that the credentials of Mr. Jayarajan were not in dispute. The law applied to all equally, whether they were poor or rich, or literate or illiterate. The averments would not help him to get any “extraordinary treatment” in the case of bail, the court said.", 
    "section": "national", 
    "title": "Kerala HC denies bail to Jayarajan", 
    "subsection": "general", 
    "date": "2016-02-12"
}