{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At 7.4 per cent, Kerala has the highest rate of unemployment among the major States in the country, says the Economic Review. It puts Kerala’s unemployment rate at three times the national level (2.3 per cent). Among all States, only tiny Nagaland and Tripura have a higher unemployment rate.\n\nUnemployment rate is higher in rural areas as compared to urban areas, and feminisation of joblessness is evident with females accounting for a much higher rate of joblessness as compared to males. The rate of unemployment among those aged between 15 and 29 is 21.7 per cent in rural areas and 18 per cent in urban areas. The situation is worse in the case of Kerala women, who log an unemployment rate of 47.4 per cent, as compared to 9.7 per cent of men.\n\nJobs in the organised sector are getting scarcer in Kerala. The number of those employed in the organised sector fell from 12.26 lakh in 2000 to 11.4 lakh in 2005 and then to 10.88 lakh in 2013, a reduction of 11.3 per cent over 13 years. This, the Review says, was mainly due to the fall in the number of jobs in the public sector. There was some respite in the downward trend over the past two years with the number of those employed in the organised sector rising to 11.29 per cent in 2014 and further to 11.36 lakh in 2015. Private sector employment has been rising steadily in the State since 2011.\n\nErnakulam and Wayanad accounted for highest and lowest employment levels respectively. The employment data also suggests that the dependence on agriculture is falling whereas dependence on the service sector is going up. Employment in agriculture fell from 7.5 per cent in 2004-05 to 5.9 per cent in 2014-15, while the relative share of employment in community, social and personal services increased from 44.7 per cent in 2004-05 and 50.43 per cent in 2014-15.\n\nThe manufacturing sector in the state accounted for only 20.4 per cent of the total employment.", 
    "section": "national", 
    "title": "Kerala jobless rate 3 times the national average", 
    "subsection": "general", 
    "date": "2016-02-12"
}