{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Kashmir Valley on Thursday witnessed the season’s first significant snowfall both in the plains as well as the upper reaches, forcing a closure of the only surface link Srinagar-Jammu National Highway.\n\nThe snowfall, which started in the morning in parts of the Valley and in the afternoon in Srinagar, came as a relief to the State as an unusually dry spell hit winter tourism and depleted glaciers that serve as a source of drinking water.\n\nJubilant residents were seen posting selfies and messages on social networking sites celebrating the arrival of snowfall.\n\n'Totally romantic'\n\n“Snow brings joy to all, young, old, rich and poor in Kashmir. The first snowfall has its own charm. Above all, it is totally romantic,” wrote ex-police officer Reyaz Bedar on Facebook.\n\nIn a shot in the arm for the tourism sector, popular winter destination Gulmarg received more than 1.6 feet of snowfall, raising hopes of organising skiing and winter camps.\n\n“The snow was much-awaited and is bound to attract tourists across the globe for skiing experience,” said Tourism Department Deputy Director Peerzada Zahoor.\n\nThe destination saw a major slump in foreign tourist footfall due to scant snowfall this year. However, the fresh snowfall has kept hopes alive for a national-level winter sports event. Due to slippery roads, vehicular movement on the Srinagar-Jammu highway was stopped. Around one-feet snow was recorded near the Jawahar Tunnel in south Kashmir.\n\nAvalanche warnings\n\nAuthorities have issued avalanche warnings for south Kashmir’s Shopian and Kulgam districts that received heavy snowfall all day.\n\nDirector General of Police, K. Rajendra, asked senior police officials “to assist the civil administration and the people in snowbound areas to ease the problems faced by the masses.”\n\nMeanwhile, the meteorological department forecast more snow and rain in the next 24 hours in the Valley.\n\nIt comes as relief to the State as an unusually dry spell hit winter tourism & depleted glaciers", 
    "section": "national", 
    "title": "Much-awaited snowfall brings cheer to Kashmir", 
    "subsection": "general", 
    "date": "2016-02-12"
}