{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Five days after a mysterious object reportedly fell on the campus of Bharathidasan Engineering College, Natrampalli, a new object weighing 61 gm was found on the terrace of the building on Thursday.\n\nS. Raju, Deputy Director General, Geological Survey of India (GSI), Chennai, said the object has “magnetic property” which raises the suspicion that it could be a meteorite.\n\n“But nothing can be confirmed until we analyse it for chemical properties, and put it under an electron micro probe analyser that scans the object for elemental distribution. We have to analyse it for the presence of rare earth elements, and check whether it contains nickel, chromium, manganese and iron,” Mr. Raju said.\n\nThe GSI official was here on a visit to the college following a request from the Superintendent of Police, Vellore. On February 6, an object reportedly fell on the campus killing the college bus driver and injuring four others.\n\nMr. Raju arrived in Vellore at 10.30 a.m., but did not find any kind of meteorite-like material on the campus. It was after an hour that the college principal and staff, along with the Deputy Superintendent of Police, Vaniyambadi, took him and showed the object that was lying on the terrace.\n\n“It did not look like a stone but more like it was made of iron and carbon. However, we cannot tell for sure without doing a chemical analysis,” Mr. Raju said.\n\nPolice have promised to hand over the object on Friday in Chennai, Mr. Raju said. He also told the officials that he had not seen the first object that was recovered from the spot and later handed over to the Indian Institute of Astrophysics, Bengaluru.\n\n“Once we receive the object, we will need five days to analyse it and confirm its nature. If we get the first object, we will have to analyse its physical properties. We cannot comment on anything without seeing the object,” Mr. Raju said.\n\nMany scientists have brought samples from moon and planets such as Jupiter, and this analysis can be compared with them, he said.\n\nNothing can be confirmed before we complete the analysis,\n\nsays GSI official", 
    "section": "national", 
    "title": "New object found on terrace of Vellore college", 
    "subsection": "general", 
    "date": "2016-02-12"
}