{
    "author": [
        "Jatin Anand"
    ], 
    "text": "Women, VIPs and two-wheelers will continue to remain exempted from the restrictions\n\nThe second instalment of the odd-even vehicle rationing scheme will be back in April, Delhi Chief Minister Arvind Kejriwal announced in the run-up to the completion of his maiden year in office here on Thursday.\n\nScheduled to be rolled out between April 15 and April 30, woman drivers, two-wheeler riders and VIPs will continue to be exempted from its provisions even as the Aam Aadmi Party (AAP) government was “seriously considering” the “permanent enforcement” of the scheme for 15 days every month in the future, Mr. Kejriwal said.\n\n“The scheme will be implemented from April 15 to 30, as the opinion of around 81 per cent Delhiites surveyed was in favour of its repeat,” the Chief Minister announced before referring to the feedback generated from over 1.13 lakh missed calls, two lakh Interactive Voice Responses (IVR) and 9,000 e-mails between January 28 and February 8.\n\nAn analysis of the response generated, he claimed, showed that 53 per cent of the people wanted the scheme back as early as February 14 which, however, was unfeasible given the preparations required.\n\n“The Board exams are getting over on April 12 and we will enforce the scheme after they are over. VIPs, women and two-wheelers will continue to be kept out of the ambit of the scheme,” he said, while admitting that the Capital’s transport infrastructure was ill-equipped to handle the extra footfall of an estimated 20 lakh two-wheeler riders, that dropping them from the list of exempted categories was bound to entail.\n\nTaking a jibe, most ostensibly at Robert Vadra, who recently criticised the scheme, the Chief Minister said while VIPs’ vehicles would remain exempt, he hoped they would take a leaf out of the book of the Chief Justice of India, who willingly chose to comply with its provisions and took to car-pooling with his colleagues during the implementation of the first phase of the scheme between January 1 and 15.", 
    "section": "national", 
    "title": "Odd-even scheme phase 2 in April: Kejriwal", 
    "subsection": "general", 
    "date": "2016-02-12"
}