{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "The Union Health Ministry on Thursday announced the much-awaited plan to eliminate malaria from the country by 2030. This will be the first time that the government’s policy intervention will have deliverables and time-bound targets.\n\nUnder the new framework, India will be divided into three categories as per malaria prevalence — low, moderate and endemic States. “By 2016 end, all States are expected to include malaria elimination in their broader health policies; by the end of 2017, all States are expected to bring down Annual Parasite Incidence [API] to less than 1 per thousand population; and by the end of 2020, 15 States/UTs under category 1 [elimination phase] are expected to interrupt transmission of malaria and achieve zero indigenous cases and deaths due to malaria. It is also envisaged that in States with relatively good capacity and health infrastructure, namely, Gujarat, Karnataka and Maharashtra, accelerated efforts may usher malaria elimination sooner — within two to three years,” said the Ministry in a written statement.\n\nAccording to Ministry statistics, 1.13 million cases and 287 deaths were reported in the provisional data. However, British medical journal The Lancet estimates that India reports at least 50,000 malaria-related deaths annually, making discrepancy in data the biggest challenge in elimination strategy. The gross underestimation of data is something officials of the National Vector Borne Disease Control Programme have acknowledged. At a recent press conference held by the ICMR , Dr. Neena Valecha had said, “The policy we have drafted have to be based on the data available with the government. We are aware that there is underestimation — especially since the cases that are treated in the private sector do not always get counted.” Under the new framework, the Ministry will depend on civil society organisations to improve surveillance. “We have clearly defined goals, strategies, and timelines to work with this time. Malaria elimination is not that difficult if we have the medicines and manpower we need at the grass roots level,” said Dr. Valecha,", 
    "section": "national", 
    "title": "Plan to eliminate malaria by 2030", 
    "subsection": "general", 
    "date": "2016-02-12"
}