{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "The Delhi Police will file a charge sheet within two weeks in the sexual harassment case involving The Energy and Resources Institute’s (TERI) newly appointed executive vice-chairman R.K. Pachauri. A trial court on March 21 last year had granted anticipatory bail to Mr. Pachauri.\n\nThe Delhi Police, which filed a status report on the investigation in the case before the Delhi High Court on Thursday, said its probe had revealed that an out-of-court settlement was offered to the complainant, and a former Research Associate, through whom the offer was allegedly made, had complained to the police about it last month.\n\nThe Bench led by Justice S.P. Garg hearing the complainant’s petition seeking cancellation of Mr. Pachauri’s anticipatory bail has directed the police to submit the case records by Monday and reserved its order on the plea filed by the 29-year-old research analyst, who has now quit the TERI.\n\nThe status report said TERI Director Sanjay Joshi told the police that he had spoken to the Research Associate for a settlement, but it was only for “saving the image” of the organisation. “Mr. Joshi stated that it was a very casual conversation and he had never been asked by Mr. Pachauri to talk for settling the matter,” it said.\n\nThe status report also said TERI's Area Convenor Reena Singh was interrogated in her office and she stated that she had never spoken about any settlement. Another TERI official was out of the country and would be examined after he returns.\n\nThe Delhi Police counsel told the court during the brief hearing that the draft report had been sent to the prosecution branch and the charge-sheet in the case would be filed within two weeks.\n\nMr. Pachauri's counsel Ramesh Gupta said the complainant was trying to sensationalise the case and even the status report had not mentioned about the TERI Executive Vice-Chairman pressuring anyone.\n\nThe complainant's counsel Prashant Mendiratta contended that Dr. Pachauri, who was at the helm of affairs in TERI, was in a position to directly or indirectly influence the witnesses.", 
    "section": "national", 
    "title": "Police to file charge sheet against Pachauri within two weeks", 
    "subsection": "general", 
    "date": "2016-02-12"
}