{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Punjab Congress on Thursday accused Delhi Chief Minister and Aam Aadmi Party (AAP) leader Arvind Kejriwal of following an “anti-national agenda” by attempting to evoke extremist sentiments in Punjab and cautioned that the party would not let Mr. Kejriwal visit the State unless the AAP dropped its “politics of supporting extremism.”\n\nCongress’ Ludhiana MP Ravneet Singh Bittu told The Hindu : “We will not allow Arvind Kejriwal to visit Punjab if the AAP does not change its agenda for the upcoming Assembly elections in Punjab. They (AAP) are following an anti-national agenda by backing extremists for political gains.”\n\nMr. Kejriwal, however, denied the allegations that his party had any nexus with Khalistanis, saying the Congress was doing “photo-shopping.”\n\n“The Congress is setting up our photos with (Jarnail Singh) Bhindrawale and putting them on posters,” Mr. Kejriwal said in New Delhi.\n\nIt may be recalled that circulation of unattributed pamphlets and social media messages pairing the Delhi Chief Minister alongside Bhindranwale, the spearhead of the Khalistan movement, with a message of celebrating Bhindranwale’s birth anniversary and ‘fulfilling his dream’ had created disquiet in Punjab’s political sphere.\n\nFollowing this, the Congress and the BJP accused the AAP of adopting a “fanatic agenda” by supporting a Khalistani ideologue.\n\nMr. Bittu said the Congress would protest against Mr. Kejriwal, adding that he would personally lead the demonstration to stop the latter along with the 35,000 families affected by terrorism. “His (Mr. Kejriwal’s) cavalcade won’t be allowed to enter either from Rajpura or Shambhu areas,” Mr. Bittu said.\n\nMr. Kejriwal is likely to visit Punjab from February 22 for 4-5 days and is expected to meet families of farmers who committed suicide due to debt and also those families that have become victims of drug menace.\n\n“Mr. Kejriwal will tour villages across the State and meet the families of debt-ridden farmers to understand the issues affecting them,” said AAP State convener Suchha Singh.", 
    "section": "national", 
    "title": "Punjab Congress accuses AAP of adopting anti-national agenda; Kejriwal denies", 
    "subsection": "general", 
    "date": "2016-02-12"
}