{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "No amount of money can erase the trauma and grief the victims suffer: Bench\n\nHighlighting the plight of differently abled victims of rape and sexual exploitation, the Supreme Court on Thursday ordered all States and Union Territories to formulate a uniform scheme for providing them compensation.\n\nIt stressed that no amount of money can wipe away the tears of these women who have to battle both the social disadvantage of their disability and stigma of the crime committed against them.\n\nA Bench comprising Justice M.Y. Eqbal said the compensation given to rape victims was negligible compared to the trauma they had to undergo all their lives. Compensation and rehabilitation expenses range from Rs. 20,000 to Rs. 1 lakh at the most, except in the State of Goa where victims were paid Rs. 10 lakh.\n\nIn Jammu and Kashmir, a minor rape victim or a victim of custodial rape is paid a compensation of Rs. 1 lakh by the State. In Karnataka, a minor rape victim is paid Rs. 3 lakh while victims other than minors are eligible to a maximum of Rs. 1.5 lakh. In Kerala, minor rape victims are paid “50 per cent extra” of Rs. 3 lakh maximum compensation awarded to rape victims and Rs. 1 lakh for rehabilitation costs. In the Union Territory of Puducherry, a rape victim is eligible for a maximum compensation of Rs. 3 lakh and Rs. 20,000 for rehabilitation.\n\nThe court noted that in Maharashtra, no amount is given as victim compensation for the offence of rape.\n\n“All the States and Union Territories shall make all endeavour to formulate a uniform scheme for providing victim compensation in respect of rape/sexual exploitation with differently abled women as required under the law taking into consideration the scheme framed by the State of Goa for rape victim compensation,” Justice Eqbal, who authored the judgment, observed.\n\nNo amount of money can erase the trauma and grief the victims suffer, says Bench", 
    "section": "national", 
    "title": "SC for uniform compensation scheme for differently abled rape victims", 
    "subsection": "general", 
    "date": "2016-02-12"
}