{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "SC dismisses appeal against HC order backing clampdown\n\nThe Supreme Court agreed with a lower court decision that the State can use its curfew powers to block Internet access on personal mobile phones if there is apprehension that a public agitation can turn aggressive and disturb public tranquillity.\n\nA Bench led by Chief Justice of India T.S. Thakur on Thursday dismissed an appeal filed by law student Gaurav Sureshbhai Vyas against a September 2015 Gujarat High Court order upholding a clampdown on mobile Internet access under Section 144 of the Criminal Procedure Code (CrPC) during the Patidar agitation as only “minimal restriction” and not a violation of free speech which extends to Internet access.\n\n“It becomes very necessary sometimes for law and order,” Chief Justice Thakur remarked while rejecting the appeal.\n\nThe dismissal of this appeal gives full credence to the Gujarat High Court’s view that blocking of Internet mobile facility is an “appropriate action” in situations “prone to aggression.” The High Court had opined that the State should be left to figure out an “effective approach” like blocking Internet on mobiles in order to maintain law and order.\n\nThe Division Bench had reasoned that rioting had taken place in several parts of the State and it was only natural that the government would be “zealous” to control a violent situation. Further, the High Court had reasoned that only mobile Internet service was blocked and not Wi-Fi and broadband facilities.\n\n“Had there been a complete ban on Internet access, may be through mobiles or may be through Wi-Fi, the matter might stand on a different footing and different considerations,” the High Court order said.\n\nUpholds Gujarat HC\n\norder backing a clampdown on mobile Net access during Patidar stir", 
    "section": "national", 
    "title": "States can use curfew powers to block mobile Internet access: Supreme Court", 
    "subsection": "general", 
    "date": "2016-02-12"
}