{
    "author": [], 
    "text": "Hollywood star Robert Downey Jr tweets support to the nine-year-old seriously ill Australian who wished to become a superhero\n\nDomenic Pace, 9, acting out a scene as he is granted his wish to play superhero Iron Man. The police staged the elaborate event on the Sydney Opera House steps.— PHOTO: AFP\n\nA seriously ill Australian boy was on Thursday granted his wish to become a superhero like Iron Man, with police staging an elaborate event on the Sydney Opera House steps as Hollywood star Robert Downey Jr tweeted his support.\n\nNine-year-old Domenic Pace, who has battled cystic fibrosis throughout his life, has long idolised Marvel superhero Iron Man and expressed his wish to be ‘Iron Boy’, with the Make-A-Wish Foundation granting his dream to fight crime in Australia’s biggest city.\n\nIn scenes reminiscent of Batkid — a five-year-old boy recovering from cancer who in 2013 became the diminutive version of the crime-fighter Batman in San Francisco — Sydneysiders turned out to watch Pace save the day on the harbour in a spectacle that took almost a year to organise. “Sent a very special boy on a top secret mission today. Go get ‘em, Domenic! #IronBoyAU @MakeAWishAust,” American actor Robert Downey Jr, who plays Iron Man in the Marvel films, tweeted on Thursday.\n\nNew South Wales Police Commissioner Andrew Scipione told Pace, who was playing in a Sydney park when he was flown by helicopter to police headquarters for the surprise mission, that authorities needed his help.\n\n“Make-A-Wish reporter Hope Joy has been kidnapped. Officers have confirmed that Clark Island has been overtaken by Ultron’s henchmen and Hope Joy is being held captive,” Mr. Scipione said in a video recording.\n\n“If I could make one wish, it would be for you to help us, Iron Boy,” he said.\n\nPace was fitted with a specially made Iron Boy suit and his 12-year-old brother Joseph played the role of Iron Man sidekick Colonel James Rhodes as he told reporters he was “ready to get down to business.” — AFP", 
    "section": "national", 
    "title": "Superhero ‘Iron Boy’ saves Sydney", 
    "subsection": "general", 
    "date": "2016-02-12"
}