{
    "author": [], 
    "text": "More and more millennials (those born after 1980) are in no hurry to own a place to call it home and will buy smartphones and cars first when gainfully employed, a study has revealed.\n\nThe perception is that millennials are the generation that would rather have the latest smartphone than a new car so it stands to reason: why would they want to own a home?\n\nLack of data\n\n“We don’t have real good data on millennials, but the trend is that millennials are getting married and having children later in life and, therefore, there’s no real urgency for them to own a home,” said Yilan Xu, professor of agricultural and consumer economics at University of Illinois at Urbana-Champaign?\n\nFactors responsible\n\nIn the paper, Xu and her co-authors examined the factors that affect housing demand of the millennial generation.\n\nThey found that mortgage accessibility is a key constraint to homeownership for millennials and the burden of student debt among millennials impedes their transition from renters to homeowners.\n\n“Millennials are taking a longer time to settle down so family events related to home purchases — such as marriage and having children — are being pushed back,” Xu added.\n\nAs a result of the Great Recession, millennials who were underemployed may not have enough money for the initial down payment necessary for a mortgage.\n\nOr they may have a low credit rating, which often translates into a higher interest rate on a home loan or completely disqualifies them as a borrower.\n\nNo incentive\n\nWith millennials getting married and having children later in life, there’s also no incentive for them to move from a bachelor pad to the suburbs.\n\nThe key factor impeding their transition to homeownership is student loan debt.\n\n“Student loans are the biggest problem for this generation, potentially disqualifying millennials for mortgage loans due to low credit scores and high debt ratios,” Xu noted. It is a finding that should give policymakers some fodder to rethink since homeownership is associated with a number of good outcomes, Xu said in a paper published in the Family and Consumer Sciences Research Journal. — IANS\n\nMortgage accessibility and student debt are key constraints to homeownership", 
    "section": "national", 
    "title": "Why millennials are not buying homes early", 
    "subsection": "general", 
    "date": "2016-02-12"
}