{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Since the deity is in the form of a ‘Naisthik Brahmachari’, it is believed that young women should not offer worship in the temple, the affidavit said.\n\nYoung women are not allowed entry into the famed Sabarimala temple to protect the deity, a brahmachari (celibate) , from even the “slightest deviation” from celibacy and austerity, the Kerala government has told the Supreme Court.\n\nThis is part of the State’s latest response after the Supreme Court recently decided to probe the constitutionality of barring entry to women aged between 10 and 50 at the temple situated in Kerala.\n\nA three-judge Special Bench of the Supreme Court led by Justice Dipak Misra questioned the “logic” behind the restriction on women devotees, even asking whether there was any proof that women did not enter the sanctum sanctorum 1,500 years ago. It had asked the Kerala government to file its response.\n\n“Since the deity is in the form of a Naisthik Brahmachari, it is, therefore, believed that young women should not offer worship in the temple so that not even the slightest deviation from celibacy and austerity observed by the deity is caused by the presence of such women,” the affidavit, dated February 4, 2016, said.\n\nThe affidavit quotes from the testimony of the hereditary Thanthri (arch priest) recorded in the 1990 judgment of the Kerala High Court in the S. Mahendran versus Secretary, Travancore Devaswom Board.\n\nBased on the priest’s evidence, the High Court had concluded that the ban on women’s entry was an “essential religious practice” and qualified as a custom and usage followed at the temple from time immemorial.\n\nThe State government mirrored the sentiments of the priest expressed over 25 years ago in the High Court, even using the exact phraseology such as “time immemorial” to explain the ban on women of a certain age group.\n\n“This (restriction) is in keeping with the unique pratishta sangalp or idol concept of the temple. The same is an essential and integral part of the right of practice of religion of a devotee and comes under the protective guarantee of the Constitution,” the State government justified.\n\nIt said essential rituals and practices of a religion were immune from the fundamental right to equality enshrined under Article 14 of the Constitution.\n\n“The present writ petition which seeks to change the beliefs and customs of crorers of devotees by judicial process is wholly misplaced and liable to be dismissed,” the State argued. It said the plea for equal right to enter and worship at Sabarimala for women is bound to fail.\n\nOn the other hand, the State portrayed how there was no restriction on persons who are not Hindus at the temple. The Supreme Court hearing of the case is on February 8.", 
    "section": "national", 
    "title": "Ban on women to protect deity’s celibacy vow: Kerala govt.", 
    "subsection": "general", 
    "date": "2016-02-06"
}