{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Maharashtra government on Friday told the Supreme Court that there was nothing “more perverse” than the Bombay High Court judgment acquitting actor Salman Khan in the 2002 hit-and-run case despite overwhelming evidence that he was drunk and driving the heavy-duty SUV that rammed into five sleeping pavement dwellers, killing one of them.\n\nCalling the High Court’s judgment a “complete travesty of justice”, the State government submitted before a Bench of Justices J.S. Khehar and C. Nagappan that the actor’s defence that it was not him but the family driver, Ashok Singh, who drove the Toyota Landcruiser at the time of the incident on the fateful night of September 28, 2002 was “completely unbelievable”.\n\nAttorney-General Mukul Rohatgi, arguing for the State, submitted that the High Court chose to discard the versions of the police and injured persons pointing to Mr. Khan as the person behind the wheel of the vehicle. “Instead, the court chose to believe the version of a driver who surfaced after 13 years, saying he was sorry that his master was being prosecuted for a crime he committed,” Mr. Rohatgi submitted.\n\n“If he had been the driver at the time of the incident, he should have been handed over to the police then and there. Not a word was said about him [Mr. Singh] between 2002 and 2015... He was their driver for 25 years... He knows everything... Shielding the accused is also a crime,” Mr. Rohatgi argued.\n\nMr. Rohatgi said alcohol content in blood samples taken from Mr. Khan even after 12 hours from the incident registered double the permissible limits.\n\nMr. Rohatgi said besides Mr. Khan, his singer-friend Kamaal Khan and a constable were inside the vehicle and there are statements that amply suggest that it was the actor who was driving.\n\nHe referred to Mr. Khan’s “childhood friend” called ‘Commander’ who lived close to the place of the accident and came down after hearing the noise of the vehicle crashing to see Mr. Khan plead “save me, Commander, save me.”\n\nThe Attorney General said Mr. Khan knew the topography of the area where the incident took place in Bandra and was also aware that there would be people sleeping on the pavements.\n\nThe Bench said it would hear the government in detail on the evidence before admitting the case as it was an appeal against acquittal. The Bench did not issue notice to the actor, and posted the case for hearing on February 12.", 
    "section": "national", 
    "title": "HC verdict on Salman Khan ‘perverse’, Maharashtra tells SC", 
    "subsection": "general", 
    "date": "2016-02-06"
}