{
    "author": [
        "T K"
    ], 
    "text": "Petition of Lahore-based Basmati Growers Association challenging India’s claim dismissed\n\nSeven years after an application was made to get the ‘Geographical Indication’ tag for Indian basmati rice grown in some States, the Intellectual Property Appellate Board (IPAB) on Friday cleared the decks for issuing the tag.\n\nThe application has been mired in litigation after farmers and exporters and Madhya Pradesh wanted to be included in the list of States approved by the Agricultural and Processed Food Products Export Development Authority (APEDA), the statutory body responsible for export promotion and development of certain scheduled products.\n\nFollowing the orders issued on Friday by Justice K.N. Basha, Chairman, IPAB, and Sanjeev Kumar Chaswal, technical member, Trademark, IPAB, basmati rice cultivated in the Indo-Gangetic Plains on the foothills of the Himalayas, covering areas of the rice grown in Punjab, Haryana, Himachal Pradesh, Delhi, Uttarakhand, Western U.P. and two districts of Jammu and Kathua, will now be issued the GI tag.\n\nPassing the orders, Justice Basha ordered the assistant registrar of GI Registry, Chennai, to proceed with the registration and issue the GI certification within four weeks of getting a copy of the order.\n\nJustice Basha also ordered the assistant registrar to reconsider the issue of addition of areas of basmati cultivation in States such as Madhya Pradesh, Odisha and Rajasthan.\n\nThe assistant registrar has now been asked to ’reconsider the matter afresh' and listen to arguments of both parties — APEDA and the respondents — and pass an order within the next six months.\n\nIn 2014-15, India exported 37 lakh MT of Basmati Rice to the world worth Rs. 27,597.87 crore and is the world’s leading exporter of the rice, according to APEDA. India exports a major quantity of basmati rice to Saudi Arabia, Iran, United Arab Emirates, Iraq and Kuwait.\n\nJustice Basha also dismissed a petition filed by Lahore-based Basmati Growers Association that challenged the issuance of GI tag to Indian Basmati rice.\n\n“The appellant miserably failed to comply with the mandatory requirements of filing the evidence in support of opposition within the time frame stipulated under Rule 44 (1) of G.I. Rules, 2002. The opposition shall be deemed to have been abandoned by the appellant,” he said.", 
    "section": "national", 
    "title": "Indian basmati rice all set to get GI tag", 
    "subsection": "general", 
    "date": "2016-02-06"
}