{
    "author": [], 
    "text": "One of the proposed new map symbols for foreign visitors.— Photo: AP\n\nAs Japan gears up to host the 2020 Tokyo Olympics and caters to a surging influx of foreign visitors, the country faces a cultural dilemma: should it stop identifying Buddhist temples on maps with the traditional “manji” symbol that is often confused with a Nazi swastika?\n\nThe symbol, from ancient Sanskrit, means happiness and prosperity. It has been used for centuries by Hindus and Buddhists, and has turned up in archaeological digs in Europe.\n\nBut many Western tourists associate it with anti-Semitism and the Holocaust because the emblem was adopted by Nazi Germany to try to enhance a sense of ancient lineage.\n\nThe swastika in Japan — which usually points counter-clockwise, reverse of the Nazi symbol — has been used for centuries in Buddhist decorations and to denote Buddhist temples on maps.\n\nAt Sensoji Temple, a top tourist destination in Tokyo, a big gold “manji” emblem appears on a pair of lotus-shaped bronze ornaments, while smaller, more subtle ones decorate roof tiles. It’s even an official emblem for Hirosaki, a city in northern Japan.\n\nIn a report released last month, a government panel at the Geospatial Information Authority proposed a three-tiered pagoda symbol to replace the swastika.\n\nIt is one of 18 suggested icons for landmarks such as hospitals and convenience stores for foreign language maps, part of a broader push to create user-friendly maps for the growing number of foreign tourists, which jumped more than 40 per cent last year to a record 19.7 million.\n\nA final decision is expected in late March following a period of seeking public comment.\n\nJapan’s main Buddhist group is nonchalant because the change doesn’t affect domestic maps and therefore likely won’t alter perceptions at home.\n\nPublic opinion seems divided on Twitter and other social networks.\n\nSupporters for the change say it would help avoid confusion among tourists, while opponents say there is no need to change the ancient sign just to cater to foreigners. — AP", 
    "section": "national", 
    "title": "Japan may drop temple symbol to avoid Nazi comparison", 
    "subsection": "general", 
    "date": "2016-02-06"
}