{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "A decision will soon be taken by the Juvenile Justice Board (JJB) on whether a 17-year-old boy, who is accused of committing two murders in Delhi in five months to raise money for a reality show, will be tried as a juvenile or as an adult.\n\nAs per the Juvenile Justice Act 2015, which came into effect in mid-January, the boy could be tried as an adult if the board assesses him mentally and physically capable of committing the heinous offences and as having the ability to understand their consequences.\n\nThe boy, who will turn 18 next month, was first apprehended last September on charges of kidnapping a 13-year-old boy for ransom and killing him later.\n\nHe was allegedly assisted in the crime by his juvenile girlfriend, who too aspired to make it big in a reality show. They needed the money to fund their aspirations.\n\nHe was released on bail in November, but the same boy allegedly robbed and killed a 65-year-old woman in Delhi’s Lodhi Colony last Saturday.\n\nIf he ends up being tried as an adult, his will be among the first such major case in Delhi after the much-debated law was passed in December and approved by the President on the last day of 2015.\n\nA senior police officer probing the Lodhi Colony murder told The Hindu that they had registered a murder case as they would in any other crime involving a juvenile.\n\n“It is now for the JJB to take a call whether he is to be treated as a juvenile or as an adult,” said a senior officer of south district’s special cell, which apprehended the suspect.\n\nThe new rules state that if a heinous crime is committed by a person above the age of 16, the JJB “shall conduct a preliminary assessment with regard to his mental and physical capacity to commit such offence, ability to understand the consequences of the offence and the circumstances in which he allegedly committed the offence”.\n\nFor such an assessment, the board may take the assistance of “experienced psychologists or psycho-social workers or other experts”. The preliminary assessment, though, is not to be mistaken for a trial. Lawyers say the change in rule is unlikely to make a major impact on the crime scenario.\n\n“The law has been changed under public pressure, which is not a healthy exercise,” said Ashok Agarwal, a High Court lawyer and founder of “Social Jurist”.\n\nHe was arrested\n\non the charge\n\nof killing a boy\n\nand an elderly\n\nwoman", 
    "section": "national", 
    "title": "Juvenile board to decide if suspect in two murders should be tried as adult", 
    "subsection": "general", 
    "date": "2016-02-06"
}