{
    "author": [
        "Josy Joseph"
    ], 
    "text": "The IAF entered into four different contracts with HAL for supply of the 140 aircraft, and later two contracts for 40 and 42 additional fighters.- File Photo: Akhilesh Kumar\n\nWhat was supposed to be cheaper when made in India is much costlier. What was supposed to be a joint development programme has been reduced to a purchase from abroad. That is among the key findings of internal government audits of major aerospace projects in recent years.\n\nAll the aerospace reports accessed by The Hindu are scathing in their indictment of agencies such as the Defence Research and Development Organisation (DRDO) and Hindustan Aeronautics Ltd. over the way they have handled joint development programmes involving foreign partners, or produced aircraft in India under transfer of technology.\n\nSukhoi-30 MKI fighters\n\nHAL was originally tasked by the Cabinet Committee on Security (CCS) with undertaking licence production of 140 Sukhoi-30 fighters under transfer of technology from Russia, with conditions including: indigenous manufacture of the aircraft at a cost lower than that of the imported aircraft.\n\nThe IAF entered into four different contracts with HAL for supply of the 140 aircraft, and later two contracts for 40 and 42 additional fighters. Thus a total of 222 S-30 MKI were to be assembled by HAL. When HAL began to assemble, however, the story was different. “Contrary to projection in the CCS note, where it was estimated that the indigenous aircraft production cost would be lower than that of the imported aircraft cost… the actual cost of phase IV aircraft has always been higher than that of the imported aircraft,” the report says.\n\nIn the production year 2014-15 in phase I, when aircraft was directly imported from Russia, the average cost per fighter was Rs. 270.28 crore. In phase IV, when aircraft is manufactured by HAL from raw material, the cost is Rs. 417.85 crore.\n\nThe report also indicts HAL for taking 2-3 times more man-hours than those taken by Russians.\n\nAn audit of the Advanced Light Helicopter (ALH) project of HAL from 2001 to 2009 carried out by the Controller-General of Defence Accounts (CGDA) pointed out: “As against the envisaged indigenisation level of 50 per cent, about 90 per cent of the value of material used in each helicopter is procured from foreign suppliers.”\n\nThe audit said that during the production of the helicopter, despite gaining experience of making 90 of them, the labour hours remained almost double of what was prescribed by the consultant. The consultant said it should take 38,500 man-hours for the first ALH, but the defence PSU ended up taking 88,768 man-hours. By the time the 50th ALH was made against prescribed 30,000 hours, the public sector unit ended up using 58,367 man-hours.\n\nThe Air Marshal Matheswaran report on the aeronautical sector points out that the Shakti engine used in the helicopter “only has an indigenous name with hardly any self-reliance or technology control.”\n\nThe Matheswaran report points out that in 2003, a decision was taken to allow the services to meet their operational requirements of surface-to-air missiles (SAMs), till 2010, by acquiring through the “buy global” route because the development of the indigenous Akash and Trishul missile systems was delayed.\n\nScathing indictment\n\nThe DRDO stepped in and proposed joint development with Israel. So the DRDO and Israel Aerospace Industries (IAI) started development of a long-range SAM (LRSAM) for the Navy in 2005. In 2007, they started work on developing a medium-range SAM (MRSAM) for the IAF under a separate contract. “Incidentally, LRSAM & MRSAM is the same missile,” the report says. In a scathing indictment of the entire project, the report says IAI remains the design authority for the complete system. “IAI is doing the role of supplier and the DRDO is the buyer, which is contrary to the DRDO role of design agency.” “No transfer of technology (ToT) has been taken as part of the contract. We will remain dependent on IAI for its share,” the report points out, adding that the intellectual property rights (IPRs) remains with the design authority. The report also tears into the Department of Defence Production.\n\n“The DDP, which on behalf of the Services and the MoD would have been the instrument of indigenisation, became primarily a custodian of a large collection of ordnance factories and de-facto owner of shipyards, aircraft factories etc.” This resulted in a conflict of interest, the report says.", 
    "section": "national", 
    "title": "Made in India is costlier; joint development is mere purchase", 
    "subsection": "general", 
    "date": "2016-02-06"
}