{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Amid growing outrage by farmer groups and green activists against commercialisation of the country’s first genetically modified (GM) food crop, mustard, the Genetic Engineering Appraisal Committee (GEAC) on Friday decided to put on hold any decision on it for now.\n\nThe GEAC, the apex body to accord approval for large-scale use and commercial release of genetically modified organisms in India, discussed safety issues of GM mustard’s application, but refrained from taking a final decision.\n\n“Application for GM mustard’s commercial cultivation was there for consideration in today’s (Friday’s) meeting. Following this, it was rumoured that the Ministry will give permission today itself, but we are not in a rush to take such a decision,” Environment Minister Prakash Javadekar told presspersons.\n\nMr. Javadekar, however, said research could not be stopped as it might have long-term implications on food security issues.\n\nDeepak Pental, who developed the transgenic variety, said he was not disappointed. “It’s not my loss … the country needs to take a call on whether it’s serious about transgenic technology,” he said. Mr. Pental, who will retire later this year from the Genetics Department at Delhi University, developed the variety with funds from the government and the National Dairy Development Board.\n\nQuestions on results\n\nAn official privy to the proceedings of the GEAC said on condition of anonymity that the committee had “100-200 more questions for Pental” on the results of the bio-safety studies and the tests conducted so far. It would at least be a couple of months before the trial and safety data, which ran into nearly 4,000 pages, could become ready to be publicly available, he added.\n\nEarlier in the day, protesters, under the banner ‘Sanson Satyagraha’ held a symbolic protest outside the Environment Ministry and demanded the government not to proceed with the process of the environmental release application of GM mustard. Representatives of activist groups who met the Environment Minister submitted a petition with 42,000 signatures collected through the platform of Change.org , urging the government not to go ahead with plans to commercialise GM mustard.\n\n“The Environment Minister has assured us that in today’s meeting, permission for GM mustard’s commercialisation will not be given,” Rajinder Chaudhari of Kudrati Kheti Abhiyan told reporters. They were also assured that before taking any decision on this matter, the Ministry will hold a consultative meeting with all the stakeholders, he added.", 
    "section": "national", 
    "title": "No nod for GM mustard now", 
    "subsection": "general", 
    "date": "2016-02-06"
}