{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Congress calls the move a policy U-turn, CPI to raise ‘lack of transparency’ in Parliament\n\nThe old debate over whether foreign nuclear suppliers will evade liability in case of a nuclear accident has been reopened by the Union government’s decision to ratify the Convention on Supplier Compensation (CSC) at the International Atomic Energy Agency (IAEA) in Vienna on Thursday.\n\nThe External Affairs Ministry called the move “a conclusive step in the addressing of issues related to civil nuclear liability in India”, adding that its explanations handed over to the U.S. government as well as the launch of a Rs.1,500-crore “insurance pool” that could be used by suppliers in the event of any incident would take care of all their concerns.\n\nThe move has been among steps that the U.S. government and private nuclear suppliers GE and Westinghouse have been demanding before they conclude any talks on setting up nuclear reactors in India after they raised concerns over two sections of the Indian law.\n\nMinistry officials insist that the decision to ratify the CSC does not violate the domestic Civil Liability for Nuclear Damage Act (CLNDA), 2010, Clauses 17(1)(B) and 46. “The government of India has maintained from the beginning that the liability solution is within the four corners of our law,” a senior official told The Hindu .\n\nAccording to the understanding, the MEA has conveyed to the U.S. government, the CLNDA “permits but does not require an operator to include in the contract or exercise a right of recourse” with the supplier. In other words, India’s Nuclear Power Company (NPCIL) could, in its contract with the foreign supplier, provide an exemption to the supplier from being sued.\n\nHowever, that reading of the Act is at variance with some experts and Opposition Left party members who have consistently opposed the U.S. civil nuclear deal. CPI(M) general secretary Sitaram Yechury said the Opposition would not allow “any attempt to absolve suppliers of liability.” “The government has taken its decision unilaterally, without waiting for Parliament or taking us into confidence over the move to ratify the CSC. We will not allow them to make any amendments now in order to bring the domestic law in line with its international commitments,” Mr. Yechury told The Hindu .\n\nLegal expert Arghya Sengupta, who was part of consultations by the government on the nuclear law before U.S. President Barack Obama’s visit to India in 2015, says the CSC ratification may still not convince U.S. suppliers to commit. “My sense is this will still need a legal determination or adjudication by an Indian court. The ratification of the CSC by the government has only made this need more immediate.”\n\n“They have done this under pressure from the U.S.,” alleged former Atomic Energy Regulatory Board Chairman A.Gopalakrishnan, adding that unless a foreign supplier was held responsible and liable, “another Bhopal tragedy-like situation may happen where Union Carbide walked away by paying very little.”\n\nCPI leader and MP D. Raja too said they would raise the issue in the upcoming budget session, adding, “This lack of transparency over an issue of nuclear safety and compensation is troubling.”\n\nThe Congress also took objection to the government move to ratify the CSC. Calling it a “U-turn” by the NDA/BJP, Congress party spokesperson Manish Tewari said, “In 2008, the NDA had brought a no confidence motion in Parliament over just this law, wanting all kinds of clauses to be inserted into the nuclear liability Bill, now goes and ratifies it in 2016 without even explaining its U-turn.”", 
    "section": "national", 
    "title": "Nuclear suppliers let off hook: Left", 
    "subsection": "general", 
    "date": "2016-02-06"
}