{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Highest increase could take space fund beyond Rs. 10,000 crore\n\nThe Chairman of the visiting Parliamentary Committee on Science & Technology on Friday said the panel would recommend a 50 per cent higher budgetary outlay for the Department of Space (DoS) for the upcoming financial year.\n\nIf it materialises, it could be the highest ever increase for the department and the total budget may surpass Rs. 10,000 crore. It got a 43 per cent hike two years ago, i.e. in 2013-14.\n\nIn the budget presented in February 2015, the DoS received Rs. 7,388 crore, including about Rs. 1,400 crore for non-plan expenditure. The amount was a little more than what it was allocated the previous year (Rs. 7,238 crore for 2014-15), but this was later revised and became about 20 per cent lesser.\n\nCongress leader Ashwani Kumar chairs a 31-member MPs' team on S&T and Environment & Forests and was also in charge of the DoS in the erstwhile UPA government.\n\nAt the end of two days of meetings related to space, forest and environment in Bengaluru, he told a news conference that the Indian Space Research Organisation (ISRO) has contributed a lot to the social and defence needs of the country. It undoubtedly needs a bigger budget for new projects and a matching technical pool to complete them.\n\nHe said that so far, ISRO recruited mostly to replace its retiring employees. \"The committee will recommend that [ISRO's overall budget of about Rs. 7,300 crore] be enhanced by 50 per cent. We have been informed about a requirement for increasing the scientific manpower, a lack of which is disabling ISRO [from optimising] its potential.\" ISRO Chairman A.S. Kiran Kumar said he cannot mention how many would be recruited until the proposals are approved.\n\nISRO has contributed a lot to the social and defence needs of the country. It undoubtedly needs a bigger budget\n\nAshwani Kumar,\n\nCongress leader", 
    "section": "national", 
    "title": "Panel to seek increasing ISRO outlay by 50 p.c.", 
    "subsection": "general", 
    "date": "2016-02-06"
}