{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Friday directed the Ministry of Women and Child Development to prepare a manual exclusively for juvenile offenders in custody under the new juvenile law.\n\nIn a detailed written order dealing with dignity to those behind bars, a Bench, headed by Justice Madan B. Lokur, said the new manual should be fashioned after the Model Prison Manual being prepared by the Union Home Ministry for adult prisoners.\n\n“Taking a cue from the efforts of the Ministry of Home Affairs in preparing the Model Prison Manual, it appears advisable and necessary to ensure that a similar manual is prepared in respect of juveniles who are in custody either in Observation Homes or Special Homes or Places of Safety in terms of the Juvenile Justice (Care and Protection of Children) Act, 2015,” Justice Lokur observed in the order.\n\nIssuing notice to the Secretary, Ministry of Women and Child Development, Government of India, the apex court said it wants a response by March 14, 2016, the next date of hearing.\n\n“The purpose of issuance of notice to the Ministry is to require a manual to be prepared by this Ministry taking into consideration the living conditions and other issues pertaining to juveniles who are in Observation Homes or Special Homes or Places of Safety in terms of the Juvenile Justice (Care and Protection of Children) Act, 2015,” the court said.\n\nThe court explained why the Model Prison Manual was necessary.\n\nJustice Lokur called it a “composite document” on custodial management, medical care, education of prisoners, vocational training and skill development programmes, legal aid, welfare of prisoners, aftercare and rehabilitation, Board of Visitors, prison computerisation, etc.\n\nThe apex court has stepped in after a new juvenile justice law has been passed to rein in rising number of heinous crimes involving juveniles.\n\n“The sum and substance ... is that prisoners, like all human beings, deserve to be treated with dignity,” the court said.", 
    "section": "national", 
    "title": "Prepare manual on juvenile offenders: SC", 
    "subsection": "general", 
    "date": "2016-02-06"
}