{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "The unrelenting controversy over land allocation to actor and BJP MP Hema Malini for a dance school in a prime area for a measly Rs. 70,000, led Maharashtra Chief Minister Devendra Fadnavis on Friday to cancel the government resolution (GR) that allows the State to sanction plots for charitable purposes at throwaway prices.\n\nMr. Fadnavis confirmed the development to The Hindu . “Yes. I have given orders to cancel 1983 GR and come out with a new policy based on current rates,” he said. When asked whether the actor will now have to pay for the plot as per the current market rate, the Chief Minister said the State cabinet will decide the date of applicability.\n\nLast week, activist Anil Galgali released details that information he had obtained under the RTI Act stated that a plot measuring 2,000 sq m at Ambivli in Andheri was given for the actor’s dance school at Rs 70,000. The market value of the same plot is estimated to be around Rs 50 crore.\n\nOfficials said the State has not entered into any agreement with Ms. Malini’s trust till now. Following the Cabinet decision, there is a possibility that she may have to pay for the land as per the market rate, they said.\n\nThe government has so far maintained that the said plot has been allotted to the actor according to the decisions and existing norms decided on February 8, 1983 and May 11, 1984. A senior official from the Revenue Department said the move was being planned for the past few months. “The original order is 30 years old and it is always required to review old government decisions as time passes. The government believes that such cultural centres and educational institutes, which will offer certain facilities at economical rates, are required,” he said.\n\nDate of applicability of new policy will be decided by the Maharashtra Cabinet", 
    "section": "national", 
    "title": "Row over Hema Malini plot forces Fadnavis to cancel 1983 order", 
    "subsection": "general", 
    "date": "2016-02-06"
}