{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Novelist and scion of the royal family of erstwhile Travancore, Shreekumar Varma, who was freed from a gang of abductors in Senegal, Africa, while on a private visit there, reached his home in Chennai safe on Thursday, his family said on Friday.\n\nMr. Varma left for Dakar on January 18 to negotiate the sale of a work by the legendary 19th century painter Raja Ravi Varma, in the family’s art collection, when he was abducted on January 23 and held hostage by a gang.\n\nHis release on January 29 came about after a tightly-guarded and delicate operation that involved diplomats at the Indian Ministry of External Affairs, the Indian Embassy in Dakar, the Senegalese Interior Ministry, the armed forces and the local police.\n\n“It was an emotionally intense time for our family, while we were out of contact with our father and put in the bizarre and terrifying position of having to stall and negotiate with a set of hardened international criminals,” the writer’s sons, Vinayak Varma and Karthik Varma, stated in a Facebook post on Friday.\n\nWhile expressing inability to reliably comment on the details of the kidnapping as investigations were under way in Senegal, they confirmed that a huge ransom was demanded that “we could not possibly have paid and, indeed, ultimately did not have to, thanks to the exemplary actions of the MEA and the Senegalese police”. Seeking to address “some of the excitable speculators” about the purpose of the trip, the post clarifies that neither did Mr. Varma carry any rare paintings to Senegal nor did he harbour any intention of “flouting any Indian laws or carrying out any illegal transaction”.\n\n“It just so happened that our father, like many others of a similarly trusting nature, was conned by some very clever miscreants into entering a situation that he had not adequately researched”, they stated. While acknowledging that there were questions that remain unanswered about their father’s ordeal, they felt that the answers would have to wait until further details emerge from the Dakar police.\n\nThe writer's sons conclude their post with a plea against referencing the abduction to generalise and portray Senegal as a dangerous country where bad things happen all the time when in actuality it remained one of the more stable and tourist-friendly parts of West Africa.", 
    "section": "national", 
    "title": "Shreekumar Varma back home, say his sons in Facebook post", 
    "subsection": "general", 
    "date": "2016-02-06"
}