{
    "author": [], 
    "text": "The new recipe — a limited selection of dishes — is tailored to reducing waste and encouraging chefs\n\nIn the name of reducing waste and freeing up chefs’ creativity, top British restaurants are doing away with long menus to give diners a limited selection of dishes or no choice at all.\n\n“It is we who decide,” said Mikael Jonsson, head chef at Hedone in the district of Chiswick in west London.\n\nLast summer, the 49-year-old Swede decided to scrap the menu, after four years of observing customers’ tastes.\n\n“More and more regular customers do not want to see the menu, and want a personalised menu drawn up by me,” Mr. Jonsson said in his restaurant dining room.\n\nHedone has had a Michelin star since 2012, a year after it opened, and has been included in the world rankings of the ‘50 Best Restaurants’ since 2013.\n\n“Some wanted the surprise, others did not know what to order,” he added.\n\nNow, Mr. Jonsson decides what diners will eat, though customers are asked about their preferences when they make a booking.\n\nFrom a personal point of view, “it’s super interesting to work this way”, Mr. Jonsson said. “No two days are the same.”\n\nMr. Jonsson uses ingredients available on the day to create a menu of seven to 10 dishes each evening, something which allows the use of higher quality and rarer ingredients.\n\n“If we offer bass on a menu which is changed every two months, it is impossible to offer exceptional bass every day. Now, if I can’t find a bass I’m happy with I will offer turbot or another fish,” Mr. Jonsson said. “It allows me to serve woodcock at one table and hare at another because I don’t have enough for everyone.”\n\nAnother advantage in ditching the menu is that it reduces waste, as fewer ingredients are needed to be kept in stock.\n\n“We notice the difference, especially with seafood and pastry which you can now prepare at the last minute.”\n\nHedone reflects a wider trend, according to “50 Best” director William Drew.\n\nThis is driven by customers’ interest in being surprised by dishes, in an era when they will often be familiar with the restaurant’s fare from Instagram.\n\n“I think the idea of not having a menu is growing,” Mr. Drew said.\n\n“It plays to the idea of diners having a “bespoke experience” which is tailored to their wants and needs, but in practice it also allows the chefs to have more freedom based on availability of ingredients and so forth.”\n\nFrance and N.Y. too\n\nThe shift has also been noted in France and New York, but is likely to remain confined to gastronomic centres. “I’m not sure it really works in restaurants that are not destinations for foodies already,” Mr. Drew said.\n\n“You have to earn the right to work on this basis, to have built a formidable reputation so that the diners trust the judgement of the staff and the chef.”\n\nRestaurants following the trend in London include sushi restaurant Araki, which has two Michelin stars and offers a unique set menu, and the two-Michelin-starred Hibiscus which offers a surprise tasting menu in the evening.\n\nBut others are following outside the capital. The Checkers, in Montgomery in Wales offers between five and nine dishes a day in a tasting menu.\n\n“With an a la carte menu there will always be a degree of wastage,” said Kathryn Francis, who manages the Michelin-starred restaurant.\n\n“This new format gives our kitchen team greater control over what they need to prepare.” It also makes sense financially in a sector where margins are tight, Ms. Francis added.\n\n“Many fine dining restaurants now offer tasting menus only — it is a reflection of the need to be minimising wastage — offering your guests the very best you can and maintaining a profitable and healthy business.” — AFP", 
    "section": "national", 
    "title": "U.K.’s top restaurants decide what diners eat", 
    "subsection": "general", 
    "date": "2016-02-06"
}