{
    "author": [
        "Arun S"
    ], 
    "text": "Obama gives assurance to Modi during telephonic conversation recently\n\nU.S. President Barack Obama has assured Prime Minister Narendra Modi that his administration would soon look into India’s concerns over the recent move to increase visa fees, highly placed sources in the government told The Hindu .\n\nMr. Modi had a telephonic conversation with Mr. Obama after the President signed into law, on December 18 last, the Consolidated Appropriations Act, 2016, the sources said.\n\nThe Act, among other things, increased the fees for certain H1B and L1 applicants.\n\nBoth leaders discussed issues, including the bilateral ones like the visa fee increase, and the President assured that his government would soon “see what best can be done under the circumstances to limit the impact on the Indian tech industry.”\n\nAfter the increase, the fees for certain categories of H1B and L1 visas have more than doubled, and according to Nasscom, the IT/ITeS industry body, the decision’s financial impact on the Indian technology sector would be around $400 million a year.\n\nIndia (Indian tech firms) will be the most affected by the decision as it is the largest user of H1B visas (67.4 per cent of the total 161,369 visas issued in FY14 went to Indians), and is also among the largest users of L1 visas (Indians received 28.2 per cent of the 71,513 L1 visas issued in FY14). The CII, an industry body, had said the visa fee increase was discriminatory and punitive and was aimed at India and Indian-centric technology companies.\n\nMr. Obama and Mr. Modi decided last year to take initiatives — including efforts to resolve bilateral trade and investment issues — to increase the India-U.S. trade from the current $100 billion to $500 billion.\n\nIssues related to tightening of the visa and immigration regime and the fear-mongering about American jobs going to foreigners have been part of the political rhetoric before presidential elections (including the coming one) in the U.S.\n\nIndustry sources say that since these visas are for short-term work, Nasscom has asked American lawmakers not to confuse it with immigration or spread the “myth that hiring of foreign tech workers is hindering employment of local professionals.”\n\nNasscom has said that due to skill shortages, unemployment in the U.S. tech sector is historically lower than the national average.\n\nIt is a myth that foreign talent is being hired at lower salaries in the U.S., it has said, adding that the Indian tech industry pays equivalent wages to U.S. nationals and foreign workers.", 
    "section": "national", 
    "title": "U.S. to address India’s concerns", 
    "subsection": "general", 
    "date": "2016-02-06"
}