{
    "author": [], 
    "text": "Country music legend Johnny Cash who often wore black inspired the name of the spider Aphonopelma johnnycash.— Photo: AP/AFP\n\nCountry music legend Johnny Cash who often wore black inspired the name of the spider Aphonopelma johnnycash.— Photo: AP/AFP\n\nThe black spider found in California is called Aphonopelma johnnycash\n\nScientists scouring the fields of Folsom, California found a new kind of black tarantula which they have named after Johnny Cash, the American music legend who sang of the jailhouse blues.\n\nThe eight-legged creature named Aphonopelma johnnycashi is all black, the way Cash often dressed when he strummed his guitar and sang songs like The Man in Black and Folsom Prison Blues in his bass-baritone voice.\n\n“I’m a huge Johnny Cash fan,” said Chris Hamilton, lead author of the study, which identified the tarantula as one of 14 new spider species discovered in the south-western United States.\n\n“But I didn’t go into this searching for something I could name after him,” he said.\n\nInstead, Mr. Hamilton along with researchers at Auburn University and Millsaps College sought to closely examine tarantulas found throughout the southern United States, west of the Mississippi River.\n\nDuring a decade-long hunt, they collected nearly 3,000 specimens in multiple States.\n\nThey found that the Johnny Cash spider was widespread, but had long been considered as another species, known as A. iodius .“It is quite similar looking,” said Mr. Hamilton.\n\nUnique specimen\n\n“When we really started collecting lots of specimens from across the distribution and looking closely at their morphology, DNA, and ecological variables, we saw that these specimens were unique and certainly warranted being separated as a separate species,” he said.\n\nGiven the deep black colour of the males, combined with the location of the spider in Folsom, California — home to a State penitentiary where Cash performed for inmates in 1968 — “the name popped into my head. It just fit perfectly,” Mr. Hamilton said.\n\nWhile researchers did not pick up the tarantula directly at or outside the prison, Mr. Hamilton said he “wouldn’t be surprised” if the tarantulas roamed free in the area. “They are found all over that area of Folsom, California and western foothills of Sierra Nevadas.”\n\nPrior to this study, more than 50 different species of tarantulas were known in the United States, but they were poorly organised and some were misidentified as being different species when they were actually the same. Now, Hamilton and co-authors say there are 29 US tarantulas in the Aphonopelma genus, 14 of which are new to science.\n\n“I’m not surprised that so many previously described species were found to be invalid,” said Marshal Hedin, a professor of biology at San Diego State University who was not involved with the work but described it as \"rigorous and much-needed.” — AFP", 
    "section": "national", 
    "title": "Will this Johnny Cash namesake croon ‘The beast in me’?", 
    "subsection": "general", 
    "date": "2016-02-06"
}