{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "At a time when the Congress has registered a strong protest against Dalit research scholar Rohit Vemula’s suicide, the chairman of its Schedule Caste (SC) cell in Ghaziabad has alleged that he was recently thrown out of a crucial party meeting just because of his lower caste background.\n\nJatinder Gaur has written a letter to Congress president Sonia Gandhi relating the incident and to demand action against the culprits.\n\nAccording to his letter, on February 3, the Congress unit in Ghaziabad called for a meeting to plan a strategy for the upcoming mayoral election. As the chairman of the party’s SC cell in Ghaziabad, Mr. Gaur was to attend the meeting, which was being held at the residence of Congress secretary for Uttar Pradesh, Lokesh Chaudhary.\n\nIn his letter to Ms. Gandhi, Mr. Gaur says that the moment he took his seat the party’s district president Om Prakash Sharma berated him with hateful remarks.\n\nThe letter quotes Mr. Sharma as saying: “How come you are in this meeting? Your meeting is at 3 pm. This meeting is for big people. Small people like you have no role in this meeting.”\n\nAccording to Mr. Gaur, Mr. Sharma went on demeaning him: “If people from a Dhobi caste will sit with us, what would be left of our status? We don’t need you here. Your place is under our feet.”\n\nSpeaking to The Hindu , K. Raju, chairman of the SC department at the All India Congress Committee (AICC), said that he has asked the State unit to probe the matter and brief him by Saturday noon.\n\n“This is the first time such a complaint has come from a main party leader,” said Mr. Raju. “I’m meeting him tomorrow just to ensure that we have taken his complaint seriously.”\n\nIn his letter to Ms. Gandhi, Mr. Gaur has warned that he would commit suicide if the party doesn’t take action against Mr. Sharma.\n\n“This incident has left a serious impact on my psychology,” Mr. Gaur wrote in the letter. “I want justice.”\n\nSpeaking to The Hindu, Mr. Sharma rejected Mr. Gaur’s accusation saying caste had nothing to do with the incident.\n\n“My seniors had told me to invite former MPs, MLAs and other district leaders, so there was a criteria for the participants in which he (Gaur) did not fit,” said Mr. Sharma.\n\nHowever, Bijender Yadav, general secretary, Uttar Pradesh Congress, confirmed to The Hindu that Mr. Sharma insulted Mr. Gaur by invoking caste. “He told Gaur that this meeting is for the people who come from a superior caste,” said Mr. Yadav.", 
    "section": "national", 
    "title": "Your place is under our feet, U.P. Congress leader tells SC cell chief", 
    "subsection": "general", 
    "date": "2016-02-06"
}