{
    "author": [
        "Ben Sisario"
    ], 
    "text": "The buyers of Adele’s album ‘25’ come from “a demographic not normally closely examined in the millennial-fixated entertainment industry”, sales tracking service Nielsen Music said.— File photo: AP\n\nFor the past few years, the prevailing theme in the recorded music business has been that CD and download sales were plunging while streaming has shot up quickly, as listening habits shift online.\n\nThat theme largely continued in 2015, with one big exception: Adele.\n\nLast year, 241.4 million albums were sold in the United States, down 6 percent from 2014, according to data released Tuesday by Nielsen. CDs, once the music industry’s most powerful profit engine, fell to 125.6 million units last year, a decline of 11 percent from 2014 and 82 percent from their peak in 2001. Nielsen tracks the number of units sold, but not their sales revenue.\n\nDownloads of complete albums last year dropped 3 percent to 103.3 million, and downloads of individual songs fell 12.5 percent to 964.8 million, dipping below 1 billion for the first time since 2007.\n\nAt the same time, streaming activity nearly doubled in 2015. On-demand audio and video streams on outlets like Spotify, YouTube and Apple Music — which, unlike radio services, allow users to pick exactly what songs to listen to — were up 93 percent, to 317.2 million songs played. Of those, 144.9 million were audio-only streams. These services, which also include Tidal, Rhapsody and Google Play, let people listen online to millions of songs for subscriptions of $10 or less, or free with advertising.\n\nYet in a move that has led to wide debate in the industry, the most popular album of the year by far was one that was not made available for streaming.\n\nAdele’s 25 , which was on sale for only the last six weeks of the year, sold 7.44 million copies, more than any album has sold in a calendar year since 2004. About one out of every 32 albums sold last year was 25 ; Amazon reported that on the Monday after Thanksgiving, it sold a copy of the CD every three seconds.\n\nThe album was Adele’s first in nearly five years and was promoted through television appearances, but — in another break with what has become standard practice in pop — the singer herself was relatively quiet on social media. According to Nielsen, 62 percent of Adele’s fans are female, and 67 percent are age 35 or older.\n\nNo other album came close to Adele’s sales. The second-biggest, Taylor Swift’s 1989 , which was released in late 2014, sold 1.99 million copies last year. Justin Bieber’s Purpose was in third place with 1.27 million, followed by Ed Sheeran’s X , another holdover from 2014, which sold 1.16 million.\n\nA bright spot for the industry continues to be the growing sales of vinyl records. They increased 30 percent last year to 11.9 million. Many industry observers say they believe that millions more vinyl albums are sold directly by artists or through small shops and are not recorded by Nielsen. The most popular vinyl release, with 116,000 sales, according to Nielsen, was Adele’s 25 . — New York Times News Service", 
    "section": "national", 
    "title": "Adele album resists the trends in music sales", 
    "subsection": "general", 
    "date": "2016-01-07"
}