{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The social activist was accused of being a “Naxalite”\n\nSocial activist and Magsaysay awardee Sandeep Pandey has been sacked by the Banaras Hindu University on charges of being a “Naxalite”, engaging in “anti-national” activities and screening a banned documentary on the campus.\n\nMr. Pandey has taught at the prestigious central varsity for the past two-and-a-half years. He was a Visiting Faculty in the Department of Chemical Engineering of the IIT-BHU and his contract was to end in July.\n\nThough the termination order does not state any reason, Mr. Pandey says it was preceded by a discussion with the top administration. He alleges that the decision to remove him was forced upon IIT-BHU Director Rajeev Sangal by Vice-Chancellor G.C. Tripathi and Dean of Faculty Affairs, IIT-BHU, Dhananjay Pandey, who he claimed were “associated with the RSS.”\n\n“All these charges are baseless,” Mr. Pandey told The Hindu . “If I am guilty of anti-national activities, why don’t you lodge an FIR and send me to jail?” he asked. “I wish to clarify that I’m not a naxalite. The ideology that I would consider myself closest to is Gandhian.”\n\nMr. Pandey had earlier led an agitation on the campus demanding that 40 employees whose contracts were terminated be made permanent.\n\n“Is it illegal to support people who have lost their jobs? All I did was fight against human rights violation,” he said. The employees were reinstated after Mr. Pandey’s protest.\n\nMr. Pandey said the banned BBC documentary on Nirbhaya was to be screened in the development studies class, but the VC had intervened to stop it. “A discussion on the issue of violence against women was conducted after screening another documentary,” he said.\n\nBHU spokesperson Rajesh Singh said Mr. Pandey’s contract was terminated taking into view “several representations received by the administration.”\n\n“He was involved in anti-administration activities and spoiled the academic atmosphere of the university,” Mr. Singh said.\n\nMr. Pandey, however, found it odd that the institution “did not authenticate the veracity” of the complaint, which was based on a solitary news report in a local daily.\n\nMr. Pandey had led an agitation for 40 employees whose contracts were terminated", 
    "section": "national", 
    "title": "BHU sacks Magsaysay awardee Sandeep Pandey", 
    "subsection": "general", 
    "date": "2016-01-07"
}