{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Tamil Nadu Governor K. Rosaiah unveiled the portrait of Dr. M.A.M. Ramaswamy during the condolence function held in Chennai on Wednesday. (From left) S.V. Chitti Babu, former Vice-Chancellor, Annamalai University, P.R. Gokulakrishnan, former Gujarat High Court Chief Justice,N. Ram, Chairman, Kasturi and Sons Ltd., Nawab Mohammed Abdul Ali, Prince of Arcot, P. S. Ramamohan Rao, former Tamil Nadu Governor, Meena Muthiah, Kumara Rani of Chettinad, Zavary Poonawalla, Chairman, Royal Western India Turf Club, Mumbai, A.C. Muthiah, SPIC promoter, A.R. Lakshmanan, former judge of the Supreme Court, and Kundrakudi Ponnambala Adigalar.— Photo: M. Vedhan.\n\nWarm hearted, educationist, sportsman, philanthropist and king of horses— these were the expressions used by friends and family members about M.A.M. Ramaswamy at a condolence meeting organised by the trustees of Dr M.A.M. Ramaswamy Chettiar of Chettinad Charitable Trust here on Wednesday.\n\nTamil Nadu Governor K. Rosaiah, who unveiled the portrait of Ramaswamy, said: “It is a pleasure to unveil the portrait of one of the remarkable persons of our time.”\n\nHe added, “Dr. Ramaswamy was twice the Sheriff of Madras, first in 1971 and then in 1974. The government of Tamil Nadu honoured him as Sheriff of Madras in recognition of his distinguished services to the promotion of civic life in Madras.”\n\nN. Ram, Chairman, Kasturi and Sons Ltd., called him a charismatic person and said that he remembered him as a modern person with a secular outlook. Mr. Ram also recalled an incident in which he felt Dr. Ramaswamy’s sincerity came to the fore.\n\n“He always contributed to the Music Academy and gave the first cheque. One year there was a delay and he immediately called and sent another cheque. He lived up to his promise,” Mr. Ram said.\n\nKumara Rani of Chettinad Meena Muthiah recalled his fondness for horses while SPIC promoter A.C.Muthiah called him his childhood friend. “I have lost a dear and affectionate cousin,” he said.\n\n“He respected all religions, tradition and culture,” said Prince of Arcot, Nawab Mohammed Abdul Ali.\n\nHe also lauded Ramaswamy’s contribution to sports. Ramaswamy established his reputation as a patron of sports, while being a sportsman himself. He was the president of the Indian Hockey Federation and it was during his stewardship in 1975, India won its first and last World Cup hockey championship.\n\nRamaswamy died on December 2 last year after a brief illness.\n\nM.A.M. Ramaswamy, a patron of sports, had also established a reputation as a sportsman", 
    "section": "national", 
    "title": "Friends and relatives recall M.A.M. Ramaswamy’s greatness", 
    "subsection": "general", 
    "date": "2016-01-07"
}