{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Rural Development Minister asks Jaitley to release Rs. 5,000 crore more\n\nDue to shortage of funds, people do not get work as per demand and also face inordinate delays in the payment oftheir wages, says activist.\n\nWith the demand by States for the release of money under the Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS) to clear pending liabilities and dues getting more persistent, Rural Development Minister Birender Singh has written to Finance Minister Arun Jaitley, urging him to immediately release the additional Rs.5,000 crore as promised.\n\n“Since MGNREGS is a demand-driven wage employment programme and funds are required to be released to the States on demand being raised at the field level, I request you to provide Rs.5,000 crore over and above the budget provision of Rs.34,699 crore,” reads the letter, accessed by Mazdoor Kisan Shakti Sangathan (MKSS) through an RTI petition.\n\nThe letter says, “My Ministry (Rural Development) has released Rs.33,448 crore to the States and Union Territories till date (December 30, 2015). Out of this amount, Rs 31,830 crore has been spent, i.e. 95 per cent of the amount released, which includes the States’ share of Rs.1,771 crores. We are receiving a number of requests from the States for release of funds to liquidate the pending liabilities and for smooth implementation of MGNREGS during the fourth quarter of the current financial year.”\n\nSocial activist Aruna Roy, associated with MKSS, told a press conference here on Wednesday that over the past few years, MGNREGS had been facing acute shortage of funds. Fund shortage had begun in the last years of the UPA II rule, and had peaked during the current NDA government when mid-year budget cuts were imposed.\n\n“It has resulted in distress for MGNREGS workers, as people did not get work as per demand and faced inordinate delays in the payment of their wages,” she said, pointing out that the 12 States - Andhra Pradesh, Assam, Chhattisgarh, Haryana, Himachal Pradesh, Kerala, Meghalaya, Nagaland, Odisha, Punjab, Sikkim and Uttar Pradesh - had exhausted their funds and were showing a negative balance, signalling a shutting down of the programme in these States.\n\nJointly addressing the press, Jayati Ghosh and Nikhil Dey said the Central government should immediately release the additional Rs.5,000 crore promised for the programme.\n\n“We feel allocations for this year should be increased even beyond that (Rs.5,000 crore) amount, to enable workers across the country, particularly in the drought-hit States, to get the much needed respite,” they said.", 
    "section": "national", 
    "title": "Job scheme facing fund crunch", 
    "subsection": "general", 
    "date": "2016-01-07"
}