{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "He has hardly been out of Patna, apparently preoccupied with governance in Bihar.— Photo: PTI\n\nOut of power for over a decade, Rashtriya Janata Dal (RJD) chief Lalu Prasad Yadav almost shifted his base to Delhi once.\n\nHowever, ever since his party’s big comeback in the Assembly elections late last year, he has hardly been out of Patna, apparently preoccupied governance in Bihar, particularly the departments held by his two sons.The BJP has already accused him of acting like a “super CM”.\n\nComeback\n\nWith 80 seats out of the 101 contested, the Lalu-led RJD staged a comeback in Bihar, stealing a march on alliance partners JD(U) and the Congress which won 71 and 27 seats respectively.\n\nIn portfolio allocation, the RJD received 12 ministerial berths, including the post of the Deputy CM that went to Mr. Prasad’s younger son Tejaswi Pratap Yadav.\n\nSoon after the oath-taking ceremony, secretaries of the departments held by his sons were replaced with two trusted bureaucrats of Mr. Prasad from the days when he was the Union Railway Minister. Senior IAS officers Sudhir Kumar and R. K. Mahajan were appointed secretaries of the State Road Construction and Health departments now held by Mr. Tejaswi Yadav and his brother Mr. Tej Pratap Yadav respectively.\n\nSurprise inspection\n\nRecently, the RJD chief hit the headlines when he made a surprise inspection at a government-run hospital and issued directives to officials and his minister-son.\n\n“Yes, he is my father and we’ll implement his directives”, Mr. Tej Pratap later told journalists.\n\nEarlier, following the murder of three engineers for extortion, Mr. Prasad advised the Nitish Kumar government to act tough on the rising crimes and also against the lunj-punj (lax and slack) policemen.\n\nHe even appealed to the people to call him directly if they received any extortion or threat call.\n\nIf government sources are to believed, of late, several senior officials of the Nitish Kumar government were seen meeting the RJD chief at the 10, Circular Road residence “for necessary instructions and advice”.\n\n“Everyday in the morning or late evening, these officials could be seen making entry into or exit from Mr. Prasad’s residence where he currently lives with his two minister-sons”, an official said.\n\nReacting to Mr. Prasad’s “extra-constitutional” moves, the BJP has accused him of acting like a “super CM”.\n\n“Nitish Kumar may be the CM but its Lalu Prasad who is running the government from behind”, alleged senior state BJP leader Sushil Kumar Modi.\n\nSecretaries of the departments held by his sons were replaced with Lalu's trusted bureaucrats", 
    "section": "national", 
    "title": "Lalu Prasad meets officials, BJP dubs him ‘Super CM’", 
    "subsection": "general", 
    "date": "2016-01-07"
}