{
    "author": [
        "Zara Khan"
    ], 
    "text": "The festival seeks to explore collaborative ways of shaping the future\n\nA little over half a decade ago, The Hindu instituted the first-ever edition of Lit for Life. Thus was born South India’s biggest annual literary festival. From a one-day programme to a three-day event spread across a sprawling campus, Lit for Life has been through a growth spurt.\n\nThis sixth edition of Lit for Life is very special. Post the devastating floods that ravaged Chennai in December, a decision was taken to dedicate the festival to the city. There are two sessions that will discuss the floods.\n\nLearning and documenting\n\n“We have just come through some very, very difficult times,” says Nirmala Lakshman, festival director. “I feel that it’s important that we remind ourselves through a festival like this of the larger community and the suffering that the city went through. We took a conscious decision to keep the festival going — so that we can discuss shaping the future. The festival is also intended to look at ways of thinking, of how to develop as a society and as a nation. We feel that we have to consciously take cognisance of the remarkable way in which everyone came together and use this platform to document the whole phenomenon.”\n\nAccording to Prasanna Ramaswamy, programme consultant, “As we believe art can only heal and energise people, we decided to go ahead with the sessions but cancelled all performances, pre-festival events, workshops and master classes, which were more celebratory in nature.”\n\nRachna Davidar, programme director, says, “We have some of the world’s best writers and speakers at Lit for Life. When I joined Lit for Life, we had a simple objective: we wanted to give Chennai a truly world-class literary festival. One measure that our festival is succeeding is that audiences are growing in huge numbers. Even more interesting to me is the fact we are attracting visitors from all over the country now.”\n\nImpressive line-up\n\nThe speakers and panellists are from all over the world. Lit for Life enthusiasts this year can look forward to an impressive line-up that includes Omar Abdullah, Alexander McCall Smith, Lionel Shriver, Shashi Tharoor, Colm Toibin, Barkha Dutt, Raghu Karnad, Manil Suri, Anuja Chauhan, Susan Abulhawa, Devdutt Pattanaik, Vivan Sundaram, Gulammohammed Sheikh and Philip Hensher among many others.\n\nMs. Ramaswamy says, “We will have four of the finest Tamil writers — Sa. Kandasamy, Prapanchan, S. Ramakrishnan and D.I. Aravindhan — discuss how modern Tamil literature has reflected upon industrialisation and urbanisation.\n\nWriter Ravi Kumar, theatre practitioner K.A. Gunasekharan and politician Thol Thirumavalavan will reveal the process of reclaiming their rightful identity and space through literature, arts and politics in a conversation with Justice Chandru, former judge of the Madras High Court.\n\nConversations on trends\n\nA line-up of some of India’s leading artists — V. Viswanadhan, S.G. Vasudev, R.B. Bhaskaran — will speak about the aesthetics and politics of their art, trends and inspirations.\n\nDocumentary film-makers, Deepa Dhanraj and R.V. Ramani, will be in conversation with academician and teacher Venkatesh Chakravarthy. The works of two extraordinary women poets, Akka and Kothai, who were once considered ‘crazy’, will be celebrated by Madhu Natraj and Anita Ratnam who are known for their innovative dance works and Arundhathi Subramaniam, poet.\n\nHow the ecological balance is a part of everyday life will be discussed by Lawrence Surendra, Navroz Mody and Neha Sumitran. From Spain, comes Maria Reimondez, who will be in conversation with poets Thamizachi Thangapandian and K. Satchidanandan. They will speak on the shifting notions of the nation state from a feminist perspective.\n\nA discussion on the challenges of publishing will bring together Kannan Sundaram, Rubin D’ Cruz, Prema Revathi and Vinutha Mallya. Lit for Life 2016 will also have Sangita Kalanidhi Sanjay Subrahmanyan in conversation with Nirmala Lakshman.\n\nAnother important part of the Lit for Life is the annual The Hindu Prize awarded for best fiction in the country.\n\nThis year, the award is in its fifth edition and there is a very exciting shortlist comprising Amit Chaudhuri’s Odysseus Abroad , Amitav Ghosh’s Flood of Fire , Anuradha Roy’s Sleeping on Jupiter , Easterine Kire’s When the River Sleeps , Janice Pariat’s Seahorse and Siddhartha Chowdhury’s The Patna Manual of Style .\n\nThe prize will be awarded on January 16 and the judging panel — K. Satchidanandan, Arshia Sattar, Antara Dev Sen, Susie Tharu and Pradeep Sebastian — has its work cut out.\n\nThe Hindu Prize for best fiction will be awarded at the event, which has a growing audience every year", 
    "section": "national", 
    "title": "Lit for Life to be dedicated to Chennai in its 6th edition", 
    "subsection": "general", 
    "date": "2016-01-07"
}