{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "The iconic watchmaker, who took pride as the country’s timekeeper, will finally stop ticking. While many employees lamented the decline of HMT watches — once the unchallenged pioneer in the watch market of the country — they also welcomed the move accepting it as a reality.\n\nMost of the 923 employees of HMT Watches Ltd., spread over its three units in Bengaluru, Tumakuru and Ranibagh, are ready to accept the Voluntary Retirement Scheme (VRS) package offered and end their service to the watchmaker. HMT Chinar Watches Ltd., the unit in Srinagar earlier part of HMT Watches Ltd., has only around 40 employees. They were also ready to accept the VRS package, trade union sources said.\n\nP.R. Chandrashekhar, of the HMT employees Union, said that an year ago when closure was contemplated the government offered a VRS package as per the 1992 scale. This was rejected by the employees.\n\n“Other units of HMT have seen a pay revision in 1997 and 2007 since then, denied to us. We had demanded that the VRS package be based on the 2007 pay scale, to which the government has now agreed. All of us are ready to accept it as it ensures a good package,” he said.\n\nOf the four units, only the Tumakuru unit is still functional producing watches for institutional orders. Workers there said that they were not paid salaries for the past nine months and there was no hope of revival, forcing them to accept the VRS, for lack of an alternative. More crucially, none of the 923 employees has more than eight years of service left. Most of them are on the verge of retirement as the last person recruited by HMT Watches Ltd. was in 1987, almost three decades ago.\n\nThough the Union government has announced the closure of HMT Watches Ltd., it is likely to take another three to four months for the procedure to be completed and the units formally closed.\n\nHMT Watches Ltd’s last recruitment was in 1987,\n\nalmost three decades ago", 
    "section": "national", 
    "title": "Mixed reaction among employees", 
    "subsection": "general", 
    "date": "2016-01-07"
}