{
    "author": [], 
    "text": "A Pakistani court, which is hearing the 2008 Mumbai attacks case, on Wednesday reserved its verdict on the prosecution’s plea for a commission to examine the boat used by the 10 Lashkar-e-Taiba terrorists to reach the Indian coast.\n\nAt the last hearing on December 23, the prosecution filed an application in the Anti-Terrorism Court (ATC) here, seeking the formation of a commission to examine the boat ‘Al-Fauz’, so that it could be made a “case property.”\n\n“Today [on Wednesday], the ATC held the hearing at the Adiala Jail, Rawalpindi. Both prosecution and defence presented arguments and the court reserved its verdict,” a court official told PTI.\n\nThe court adjourned the hearing till January 13.\n\n‘Al-Fauz’ is in the custody of the Pakistani authorities in Karachi, from where the 10 militants, armed with AK-47 rifles and hand-grenades, had left for India to carry out the attacks. According to the Federal Investigation Agency, the attackers used three boats, including ‘Al Fauz’, to reach Mumbai. It said the security agencies had traced the shop and its owner from where they had bought the engine and the boat and a bank and a money exchange company which they used for money transactions.\n\nAfter leaving Karachi on November 23, 2008, the militants hijacked another boat and killed four of its crew members. They allegedly forced its captain to take them close to the Indian shores. The captain was killed as the vessel reached the Mumbai coast. On November 26, the gunmen left their vessel, moored off the coast of Mumbai in inflatable boats and docked in an area of fishing shanties. They fanned out in groups to carry out the attacks that killed 166 people.\n\nNine of the gunmen were killed by Indian security officials as the attacks unfolded. The lone surviving terrorist, Ajmal Kasab, was executed in November 2012. Pakistani authorities have arrested seven LeT members involved in the planning of the attacks, including the group’s operations commander, Zakiur Rehman Lakhvi. — PTI\n\nThe boat ‘Al-Fauz’ is in the custody\n\nof the Pakistani authorities\n\nin Karachi", 
    "section": "national", 
    "title": "Pak. court reserves order on plea to examine boat used by 26/11 attackers", 
    "subsection": "general", 
    "date": "2016-01-07"
}