{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The BJP’s campaign for the upcoming Assembly polls in Assam will see a high-profile inaugural with Prime Minister Narendra Modi set to address a rally in the State on January 19.\n\nAlongside him at the rally in Kokrajhar, will be leaders of the Bodo People’s Front (BPF) with whom the party has more or less firmed up a pre-poll alliance. The BPF has 12 MLAs in the 126-member Assam Assembly and was earlier supporting the Tarun Gogoi government.\n\nAfter addressing the rally, Mr. Modi will attend a BJP youth wing function in Guwahati. Top sources in the party told The Hindu that BPF leader Hagrama Mohillary, who shares a very close relationship with rebel Congressman and now chairman of the BJP’s campaign committee in the State Himanta Biswa Sarma, met the Prime Minister in Delhi in December where the pact was sealed.\n\nPackage and\n\n“The Prime Minister will, in all likelihood, announce a package of Rs. 2,000 crore for the Bodo Territorial Council, and also give some directions on how funds should be devolved to the 16 tribal development councils in the State,” said a senior BJP leader.\n\nThe party is depending on the anti-incumbency sentiment against the Tarun Gogoi government, along with a coalition with the BPF and the United People’s Front (UPF) made up of various tribal groups. The RSS too has been deeply involved in the campaign strategy for the Assam polls.\n\nEntry of Bangladeshis\n\n“Illegal immigration of Bangladeshi Muslims and cattle smuggling across the porous border between Assam and Bangladesh are important issues for the RSS and were flagged when Home Minister Rajnath Singh was in Assam last weekend. He promised that Assam would have a completely fenced border by December 2016, and made it a point to visit Dubhri, the bastion of All India United Democratic Front leader Badruddin Ajmal, and where the border is particularly complicated, to drive home that point,” said a senior source in the party.\n\nAssam Nirman meetings\n\nThe Prime Minister’s visit will also kick off a series of meetings called Assam Nirman among groups of intellectuals, numbering around 5000 in six cities on the development of the State. At each meeting, a Union Minister will be present, the first one to be addressed by Finance Minister Arun Jaitley.\n\nOn January 19, Modi is set to announce a tie-up with Bodo People’s Front", 
    "section": "national", 
    "title": "PM to kick off BJP’s Assam campaign", 
    "subsection": "general", 
    "date": "2016-01-07"
}