{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Before leaving for Europe, Congress vice-president Rahul Gandhi gave his go ahead to exploring the possibility of a tie-up with the Trinamool Congress in West Bengal. This, after the Kerala unit of the party nixed plans for an electoral pact with the Left Front in West Bengal that was being pushed by a certain section of the party. The Kerala unit’s logic was that the party could not be rivals in one State and allies in another.\n\nThe suggestion from the Congress high command, which apparently has party president Sonia Gandhi’s approval, has triggered unrest within the party’s West Bengal unit. Speaking to The Hindu, senior Congress leader and Member of Parliament Adhir Ranjan Choudhary said the grassroots workers were keen on “getting rid” of the Trinamool Congress (TMC), whose attitude towards the party had been “atrocious.” “Insofar as the TMC is concerned, we have vehemently opposed any kind of alliance with them,” said Mr. Choudhary.\n\nMr. Gandhi’s thinking of a possible alliance with the TMC is rooted in the TMC chief Mamata Banerjee’s new approach toward the Congress. In the winter session of Parliament, Ms. Banerjee stood by the Gandhi family in the National Herald row and echoed the party’s rhetoric on the “intolerance” debate.\n\nA senior Congress leader told The Hindu that the party was in a quandary in West Bengal since it has had a troubled history with the Left and the TMC. “We know that the Communists can’t form a government without the Congress’s support. Neither can the TMC. So we don’t want to lose this edge until we figure out which side will give us a bigger share in the elections and in the government,” the leader said.\n\nThe suggestion apparently has Congress chief Sonia Gandhi’s approval", 
    "section": "national", 
    "title": "Rahul for exploring tie-up with Trinamool for Assembly polls", 
    "subsection": "general", 
    "date": "2016-01-07"
}