{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Union Home Minister Rajnath Singh has been missing from all the key meetings pertaining to the Pathankot terror attack held over the past five days, including the National Security Council (NSC) meeting, which was chaired by Prime Minister Narendra Modi on Monday.\n\nOn Wednesday, though the Home Minister was in Delhi, he skipped the Cabinet meeting in which Defence Minister Manohar Parrikar briefed his colleagues and the Prime Minister about the Pathankot operations, which lasted 80 hours.\n\nWhen contacted by The Hindu , an official close to Mr. Singh denied that the Minister was deliberately keeping away from the meetings, adding he had prior commitments.\n\nOn January 2, when the Pathankot attacks unfolded through the day, a high-level meeting was held at South Block, chaired by Mr. Parrikar, where National Security Adviser Ajit Doval and the three service chiefs were present. Mr. Singh was not called for this meeting.\n\nThe next day, Mr. Singh left on a two-day scheduled visit to Assam. That evening, Mr. Modi, on his return to New Delhi from Karnataka, chaired a meeting of top officials.\n\nBefore leaving for Assam, Mr. Singh tweeted that the operation was over and that five terrorists had been killed. He later retracted the tweet but no correction was posted in its place. The operation went on for almost 66 hours after he posted the message. It is reliably learnt that the tweet was sent out after he was briefed by a top government official that the operation was over and that all the terrorists had been killed.\n\nThe Home Minister is one of the four Cabinet Ministers, besides the Ministers of Finance, External Affairs and Defence, who is part of the NSC, which also has the NSA and the deputy NSA as members.\n\n“As far as Wednesday’s Cabinet meeting is concerned, the Home Ministry had no agenda item to be discussed and the Home Minister had already committed his presence for the inauguration of the 7th National Conference on Women in Police at the CRPF Academy in Kadarpur, Gurgaon. It was an important event regarding women’s empowerment,” the official said. He said the Assam visit was also unavoidable.\n\nA senior government official said, “By Saturday night, it was clear that the operation was not going the way it should have been, and there were glaring gaps, which the government was answerable to. Since NSA Ajit Doval had taken all the key decisions, there is a possibility that Mr. Singh wanted to distance himself from the botch-up,” said the official.\n\nMinister’s office\n\ndenies deliberate action, says he\n\nhad to meet prior commitments", 
    "section": "national", 
    "title": "Rajnath absent from key meetings on terror operations", 
    "subsection": "general", 
    "date": "2016-01-07"
}