{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "“Show me the man and I will show you the rule,” BJP leader Shatrughan Sinha is quoted as saying in the context of politics within the party in his biography “Anything But Khamosh,” released here on Wednesday.\n\nThe book release, with senior BJP leaders L.K. Advani and Yashwant Sinha sharing the stage with the film star, saw candid discussions on politics within the BJP. Suspended BJP leader Kirti Azad and Union Ministers General (Retd.) V.K. Singh and Harsh Vardhan attended the launch. Former SP leader Amar Singh was also present.\n\nThere was an open discussion at the function on the rare disagreements Mr.Advani had with the film star in 2008. But, this was in the nature of friendly disagreement, with the book launch acquiring the shape as a subtle platform to question the present leadership of the party under Amit Shah.\n\nMr. Yashwant Sinha said the film star was not even given the status of a campaigner, let alone a star campaigner, by the party in 2014.\n\n‘A club that never meets’\n\nHe said that while he was a margdarshak (mentor) of the party, he was not in the Margdarshak Mandal (mentors’ club). The former Finance Minister then added, tongue in cheek, “It is a select club that never meets.”\n\nThe jibe was seen to be aimed at the widespread perception that veterans like Mr.Advani and Murli Manohar Joshi have been sidelined by making them part of the mentors’ club.\n\nThe film star-politician, the book reveals, was once disappointed with Mr.Advani, whom he sees as the tallest leader of his party, when the latter had denied him a third Rajya Sabha term in 2008. The logic: the party apparently believed that a person should not be sent to the upper House a third time.\n\nMr. Sinha had pointed out to the party patriarch the “exceptions” to the norm: “Many party leaders like Arun Jaitley, and my friends Ravi Shankar Prasad and Venkaiah Naidu, were given a third term in the Rajya Sabha.” Mr. Yashwant Sinha agreed and said, without taking names, that there were those who were repeatedly sent to the Rajya Sabha, suggesting a simmering divide within the party.", 
    "section": "national", 
    "title": "Shatrughan’s book aims barbs at BJP leaders", 
    "subsection": "general", 
    "date": "2016-01-07"
}