{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Congress on Wednesday fielded former Home Minister Sushil Kumar Shinde to attack the BJP’s record in handling terror attacks. Mr. Shinde furnished data to show that incidence of terror attacks was higher whenever a BJP government was in power.\n\n“In 1999, when the Indian Airline plane was hijacked, we released three terrorists and handed them to Pakistanis. Masood Azhar was one of them. What happened after that was that terrorist groups such as Jaish-e-Mohammad felt encouraged and they thought India is a weak nation.” Mr Shinde said the release of the three terrorists later proved to be fatal for the country.\n\n“Many more attacks were carried out in the country after that — the Red Fort attack, attack on the J&K Assembly, the attack on Parliament,” he said.\n\nAccompanied by several Congress leaders, including the party’s chief spokesperson Randeep Singh Surjewala, Mr. Shinde played a video footage of the 26/11 Mumbai attacks in which Prime Minister Narendra Modi, who back then was the Chief Minister of Gujarat, mocks the UPA-I government for not giving a fitting response to Pakistan. In that context, Mr. Shinde said Mr. Modi’s rhetoric contradicted his actions. He questioned why the BJP government was not taking any “decisive action” against the perpetrators of the Pathankot terror attack. “Why has the Modi government not lodged a formal protest till date with the Pakistan government, summoned their High Commissioner and taken a decision to place the matter before ‘international fora’, so as to expose and isolate Pakistan as a State that is abetting and permitting its soil to be used for anti-India terror activities,” Mr. Shinde asked.\n\nAsked if he as Home Minister received any inputs suggesting a nexus between Punjab’s drug cartels and Pakistani terror outfits, Mr. Shinde said there was “no question” of overlapping. “But wherever there was smuggling of drugs… we would constantly be telling the Punjab government that you should take immediate action on this.”", 
    "section": "national", 
    "title": "Terror strikes see a spike under BJP rule: Congress", 
    "subsection": "general", 
    "date": "2016-01-07"
}