{
    "author": [], 
    "text": "If you are engaged in taking care of a baby, it would be wise to refrain from attending to e-mail and text messages on your smartphone as researchers have found that fragmented and chaotic care can disrupt proper brain development of the infants. The study was published in the journal of Translational Psychiatry .\n\n“It is known that vulnerability to emotional disorders, such as depression, derives from interactions between our genes and the environment, especially during sensitive developmental periods,” said Tallie Baram, University of California, Irvine.\n\n“Our work builds on many studies showing that maternal care is important for future emotional health. Importantly, it shows that it is not how much maternal care that influences adolescent behaviour but the avoidance of fragmented and unpredictable care that is crucial,” Ms. Baram noted.\n\n“We might wish to turn off the mobile phone when caring for baby and be predictable and consistent,” Ms. Baram said.\n\nThe researchers studied the emotional outcomes of adolescent rats reared in either calm or chaotic environments and used mathematical approaches to analyse the mothers’ nurturing behaviours.\n\nWhile the study was conducted with rodents, its findings implied that when mothers are nurturing their infants, numerous everyday interruptions — even those as seemingly harmless as phone calls and text messages — can have a long-lasting impact.\n\nThe researchers showed that consistent rhythms and patterns of maternal care seem to be crucially important for the developing brain, which needs predictable and continuous stimuli to ensure the growth of robust neuron networks.\n\nThe brain’s dopamine-receptor pleasure circuits are not mature in newborns and infants and these circuits are stimulated by predictable sequences of events, which seem to be critical for their maturation, Ms. Baram stated. — IANS\n\nConsistent rhythms and patterns of care are important for growth, says a study by the University of Exeter", 
    "section": "national", 
    "title": "Texting during baby care affects infants’ brain development", 
    "subsection": "general", 
    "date": "2016-01-07"
}