{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Western Army Command chief says total operational synergy was achieved on the ground\n\nNATION’S HOMAGE:Defence Minister Manohar Parrikar, along with Air Force Chief Air Chief Marshal Arup Raha and Army Chief General Dalbir Singh, visits the house of Lance Naik Kulwant Singh at Chak Sarif village of Gurdaspur on Tuesday. Kulwant Singh was killed in the attack on the Pathankot airbase.— PHOTO: PTI\n\nhe Army, which allegedly was not called in for the Pathankot anti-terror operations, has now been fielded by the government to defend the handling of the attack on the airbase.\n\nOn Wednesday evening, Lt.Gen. K.J. Singh, General Officer Commanding-in-Chief, Western Army Command, addressed the media in New Delhi, backing the government’s handling of the incident, while claiming that the Army played a key role in the operations. In the past four days, it was the Air Force and the National Security Guard (NSG) which briefed the media on the progress of the operation.\n\nRefuting criticism that the Army, which has a large presence in and around Pathankot, was not employed in the operations, Lt. Gen. Singh said Army columns were fully integrated with other agencies that were part of the operations against the terrorists.\n\n“There were some media reports that the Army’s role was limited. That is not correct. While the first contact was by DSC and Garuds, the second contact was made by Army column after a search…,” he said.\n\nLt. Gen. Singh said that once contact was established with the terrorists, they were localised and an integrated fire base set up with Special Forces and Army columns after which the NSG neutralised the terrorists. “We also used infantry combat vehicles,” he said.\n\n“On the ground, there is total operational synergy which was achieved,” Lt.Gen. Singh told the media at Chandimandir, the headquarters of the Western Army Command.\n\nThe exclusion of infantry soldiers and para-commandos of the Army, who are trained in counter-insurgency operations, has remained a major question following the Pathankot operation.\n\nOn the delay in concluding the operation which lasted four days, Lt. Gen. Singh said in such operations, “terrorists tend to go quiet and lie low”. Based on that, he said, the actual time of engagement was only 10-11 hours and not over 90 hours as reported. “You should use the stopwatch method. You should stop when there was no contact… In my perception the total contact period was 10-11 hours,” he said.\n\nOfficers not convinced\n\nHowever, several serving officers remained unconvinced. “It is merely an attempt to get over the criticism the government is facing. The fact remains that not involving the Army has proven to be costly,” said a senior serving officer.\n\n‘Army columns were fully integrated with other agencies in the operations against terrorists’", 
    "section": "national", 
    "title": "We played our part in Pathankot operations, says Army", 
    "subsection": "general", 
    "date": "2016-01-07"
}