{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "The addition of more instruments is seen as part of a larger attempt to reinvent the Sangh.\n\nThe Ghosh (or the marshal band) of the nine-decade-old Rashtriya Swayamsevak Sangh (RSS) is all set to get louder, with an addition of six instruments to the ensemble. Training the Swayamsevaks with the new set of instruments will begin in Bengaluru on Thursday.\n\nThe Ghosh has been played along with Patha Sanchalan (route marches) since 1974 with six instruments. The addition of more instruments now, insiders say, is part of a larger attempt to “re-invent” the Sangh in keeping with the changing times. The band will get louder in keeping with the “increase in the number of Ganaveshadhari (uniformed) Swayamsevaks participating in events,” claimed Chandrashekara Jagirdar, the head of Ghosh from Karnataka.\n\nThe ensemble hitherto included small drums (Anaka), big drums (Panava), bugle (Shankha), flute (Vamshi), triangle (Tribhuja) and cymbals (Jhallari). It will now add on brass band musical instruments including saxaphone (Naganga), clarionate (Swarad), ephonimum (Gomukha), trumpet (Turya) and other instruments, which amplifies the sound. “Ghosh swamyamsevaks are being trained in these new instruments,” he said.\n\nThe purpose of the Shibir (workshop) in Bengaluru starting Thursday, according to Rajesh Padmar, senior sangh functionary, is to enhance the quality of the Marshal Band. Ghosh national expert Anil Oak will participate in the four-day Swaranjali Akhila Bharatiya Shrung Ghosh (brass band). Those getting trained here will, in turn, train others all over the country.\n\nIt will then be standardised.\n\nAccording to Mr. Rajesh, though RSS was founded in 1925, Ghosh was introduced in 1927. The band was reinvented with the help of Carnatic and Hindustani ragas in 1974.", 
    "section": "national", 
    "title": "With 6 more instruments, RSS band to get louder", 
    "subsection": "general", 
    "date": "2016-01-07"
}