{
    "author": [
        "Hyderabad Bureau"
    ], 
    "text": "A police complaint was lodged on Monday against film actor and Telugu Desam Party MLA Nandamuri Balakrishna for objectionable comments against women at the audio release function of Telugu film Savitri .\n\nA video clip of the actor, son of former Andhra Pradesh Chief Minister N.T. Rama Rao and brother-in-law of Andhra Pradesh Chief Minister N. Chandrababu Naidu, making the alleged comments went viral on social media and got largely circulated in different WhatsApp groups.\n\nWhile several persons posted comments condemning the legislator’s ‘objectionable’ comment, a group of lawyers filed a complaint with the Saroornagar police station.\n\n“We didn’t specify any section of the law but the actor’s remarks attract action under section 354-D introduced under the Criminal Law Amendment Act,” one of the complainants told a TV news channel. However, no case was registered immediately. “We entered details of the complaint in the police station’s General Diary,” ACP P. Venugopala Rao said. Legal opinion was being sought, he added.\n\nThe actor’s remarks resulted in a war of words between the ruling and Opposition parties.\n\nThe YSR Congress has demanded that Mr. Chandrababu Naidu and Mr. Balakrishna tender an unconditional apology. Referring to the recent incident of alleged harassment of a woman by the son of a TDP Minister, YSRC MLA R.K. Roja demanded that such Ministers be dropped from the Cabinet.\n\nActor apologises\n\nMeanwhile, Mr. Balakrishna expressed regret that his remarks ‘made in a lighter vein’ were misconstrued.\n\n“I have enormous respect for women and it is our family tradition to regard any woman as a member of our family. It is a trait we inherited from our father to treat women like our sisters,” he said. “I tender my apology if my remarks hurt any one,” he said.\n\nThe video clip of the actor making the comments went viral on\n\nsocial media", 
    "section": "national", 
    "title": "Complaint against Balakrishna over remarks against women", 
    "subsection": "general", 
    "date": "2016-03-08"
}