{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Chief strategist selects local residents as volunteers\n\nAmong the people behind the Congress campaign strategy for the Assam election are a group of graduates from the Indian Institutes of Technology (IIT) who have deployed a “booth micromanagement” strategy to cultivate voters.\n\nA team of 15 IIT alumni, handpicked by Congress vice-president Rahul Gandhi and led by a 27-year-old Rahul Parmar, have been in Guwahati for nearly a year. They have been asked to report directly to the party general secretary for Assam, C.P. Joshi.\n\nIn the summer of 2015, Mr. Parmar and his associates had come up with the idea of “booth micromanagement programme”, which is to recruit three volunteers — one young, one old and one female — for every 100 voters.\n\nMr. Parmar told The Hindu that since May 2015, when he came to Guwahati, he had recruited 4.5 lakh volunteers across the State. They are trained to think and speak along the lines that can help the Congress win the election in the State that the party has been ruling for over a decade.\n\n“We guide them and give them leaflets — it’s not related to publicity. Our task is to convey simple messages to the people”. Mr. Parmar said his strategy was distinct from the Rashtriya Swayamsevak Sangh’s, which took its campaign to almost every door to canvass support for the BJP in the Lok Sabha polls. He picks his volunteers from the constituencies they belong to, while the RSS cadres can be from anywhere.\n\nTraining volunteers\n\nKey to Mr. Parmar’s strategy is that he trains his volunteers to be critical of the Congress too. “Schemes like Indira Vikas Yojna or free blanket distribution were not reaching the people. So we told them (volunteers) that we need permission to distribute things [under government’s schemes] through democratic means”.\n\nIt all began on November 14, 2014, when the party was celebrating 124th birth anniversary of Jawaharlal Nehru. At the time, Mr. Parmar was pursuing his Masters in Industrial Economics at the Jawaharlal Nehru University, the course he opted for after graduating from the IIT in 2012.\n\nUnder the tutelage of Prabhat Patnaik, the well-known Marxist economist, Mr. Parmar’s political outlook drifted from rightwing corporate-friendly capitalism to Left-leaning socialism. And at Nehru’s anniversary, he found himself debating Indian economy with Mr. Gandhi. “I was critical of everything… I told him (Gandhi) that the Congress had no idea about managing economy. I told him people have no idea how good Congress policies are, how good scheme like NREGA is,” he said. “Later, he asked me to meet him the next week.”\n\nThe following week, Mr. Parmar met Mr. Gandhi again and, thereafter, he met C.P. Joshi, who dispatched him to Guwahati as the party’s poll strategist. His access to Mr. Gandhi and Mr.Joshi allows him to exert influence over the party leadership in Assam. Though the Congress has been wary of outsiders, it’s to be seen whether Mr. Parmar’s presence can win them dividends.", 
    "section": "national", 
    "title": "Cong. ropes in IIT graduates", 
    "subsection": "general", 
    "date": "2016-03-08"
}