{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Sri Sri Ravi Shankar, the virtual programming head of Anandam TV , broadcast partner of the World Culture Festival to be held on the fragile floodplains of the Yamuna, will be looking forward to reposition the channel as a holistic 24/7 alternative to television viewing, even as the cultural event, billed as the biggest and the greatest, staves off controversies and a fine imposed by the National Green Tribunal (NGT).\n\nThe channel got its permission to uplink last year and though it made a quiet debut, is looking forward to the high-profile event to make a splash on the digital platform of Dish TV (Zee) and other platforms. With more than 20,000 guests from the world over expected to converge on the Yamuna floodplains, the organisers are looking forward to the re-launch of the channel, with an advertisement push in major dailies featuring the spiritual guru with photographs of Prime Minister Narendra Modi and President Pranab Mukherjee.\n\nOfficials in the channel said the guru provided the road map for the channel’s programming. The three-day festival to be held from March 11 will be the channel’s way of making its presence felt on the digital platform, and as it readies itself, one of the chief invitees, President Pranab Mukherjee, will not be attending.\n\nAs reported in some sections of the media, the Art of Living is expecting former Pakistan Prime Minister Yousaf Raza Gilani and Sri Lanka President Maithripala Sirisena to join the cultural extravaganza, in addition to senior Cabinet Ministers. Though the NGT has pulled up the Foundation for organising the festival on the Yamuna river bank, considered fragile and sensitive, from all appearances, including advertisements in newspapers, the event is going to be held as per schedule.\n\nA four-member committee of the NGT had found that most of the small water bodies had been filled up for the festival and natural vegetation removed. Even trees had been cut down. The floodplains of the Yamuna will also see an enormous 1,200-foot-long stage being erected. All of this, says Professor A.K. Gosain of the Department of Civil Engineering, IIT Delhi, will not only destroy the floodplains but also pose a severe threat of floods on the scale witnessed in Chennai and Uttarakhand. “It raises questions about a city’s attitude to the ecosystem. The DDA was party to the directive from the NGT, which tasked them with disallowing any kind of activity detrimental to the floodplains.” “How did the DDA give permission to this?” Mr. Gosain asked.", 
    "section": "national", 
    "title": "Cultural fete to give a push to television channel", 
    "subsection": "general", 
    "date": "2016-03-08"
}