{
    "author": [
        "Biju Govind"
    ], 
    "text": "Belying 19th century British geo-archaeologist Robert Bruce Foote’s argument on prehistoric habitation in the State, north Kerala is fast emerging as the site of fresh discoveries of remnants of Stone Age cultures.\n\nSeveral reasons have been cited to make this possible, particularly the enthusiasm shown by a young archaeological-anthropologist, N.K. Ramesh, who is a senior assistant, Museum Project, Cultural Heritage Department of Thunchath Ezhuthachan Malayalam University at Tirur.\n\nRamesh has been credited with the discoveries of many Palaeolithic, Mesolithic, Megalithic, and Neolithic tools and several Megalithic sites in north Kerala. Find include the typical Palaeolithic hand-axe from Vanimel river basin (Kozhikode) and pointed choppers and side scrapers from Anakkayam and Cheerkkayam river basin of Chandragiri (Kasaragod) are some of the first-time evidence of Palaeolithic implements in these districts.\n\nThis revealed that hand-axe fabrication technique in quartz was also familiar among the prehistoric settlements in the area. “In fact, archaeologist Killingworth Richard Utten Todd had discovered Mesolithic tools from Chevayur (Kozhikode), perhaps the first Stone Age evidence in Kerala during 1930-35. But detailed studies then failed to take off,” says P. Rajendran, archaeologist, whose works since 1974 brought to light rich Palaeolithic evidence of myriad cultures in Kerala.\n\nDr. Rajendran said that Foote had argued that Kerala was unsuitable for prehistoric habitation citing the absence of quartzite, thick forests and heavy rainfall in the State. “Today the situation is different with more people coming to the forefront in archaeology. But only a few succeed in identifying the implements of the prehistoric era,” he says.\n\nMr. Ramesh, who does research under Dr. Rajendran’s guidance, has discovered Mesolithic tools from the Panom forest region, which lies 1,500 feet, above sea level, bordering Kozhikode-Wayanad districts. “It is a Mesolithic factory site as waste material and hammer stones were discovered near a stream inside the forest,” he said.\n\nHe has been certified for the discoveries of Megalithic sites at Valayam, Varikkoli, Chekkad, Kuitheri, Ummathur, Perumundacheri, Mullankunnu, Pannimukku, and Muippra. The evidence includes black and red ware pottery, eagle head-like figures made of clay, iron chopper and dagger, black ware, smoke pipe, iron knife, iron sickle and several iron ingots.\n\nThe well-polished symmetrical shaped Stone Adzes made of quartz showed the high expertise in quartz fabrication of Neolithic people in Kozhikode, Mr. Ramesh said.\n\nFinds include the typical Palaeolithic hand-axe and pointed choppers and side scrapers", 
    "section": "national", 
    "title": "Fresh evidence of Stone Age cultures in Kerala", 
    "subsection": "general", 
    "date": "2016-03-08"
}