{
    "author": [
        "Mini Muringatheri"
    ], 
    "text": "The huge crowd that thronged the Kerala Sangeeta Nataka Academy’s Regional Theatre in Thrissur to pay tributes to actor Kalabhavan Mani on Monday.— Photo: K.K.Najeeb\n\nChalakudy was a silent witness to Kalabhavan Mani’s popularity on Monday. Thousands jostled for a final glimpse of the actor before he was cremated at the compound of his house with State honours.\n\nMani, who was admitted to a private hospital at Kochi after vomiting blood, died on Sunday evening.\n\nMany just broke down. Their expressions clearly showed their struggle to cope with the untimely loss of their hero. They waited for hours at the Thrissur Medical College Hospital, Regional Theatre, and his house. Some were seen weeping, listening to his songs in their mobile phones.\n\nMani was a typical people’s hero. He was an autorickshaw driver and never forgot his humble background, forever doling out help to the needy. Even at the prime of stardom, for the people of Chalakudy, Mani remained the same. “He would drive an autorickshaw in Chalakudy even after acting with the likes of Rajnikanth and Aishwarya Rai,” an autorickshaw driver said.\n\nIronically, even the two ambulances that waited outside the Thrissur Medical College for the post-mortem examination on Mani’s body to get over were donated by Mani to the Kalabhavan Sevana Samithy and Charitable Society.\n\nThe police had a tough time controlling the huge crowd at the Kerala Sangeeta Nataka Academy’s Regional Theatre where the actor’s body was brought around 12.25 p.m. The body was taken to Mani’s home town Chalakudy after 45 minutes.\n\nAmong those who paid tributes were actors Jayaram, and KPAC Lalitha and political leaders Minister C.N. Balakrishnan and CPI(M) Polit Bureau member Pinarayi Vijayan", 
    "section": "national", 
    "title": "Homage to the common man’s hero", 
    "subsection": "general", 
    "date": "2016-03-08"
}