{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Home Minister Rajnath Singh reviewed the security situation on Monday even as several States remained on high alert.\n\nOfficials in the security establishment have been spending sleepless nights after Pakistan’s National Security Adviser Naseer Khan Janjua informed that 10 Pakistan-based terrorists could have infiltrated into India.\n\nThe security establishment has been hunting without success for the terror group that reportedly infiltrated into India through the Gujarat coast. With no specific input about the possible route and any evidence at hand to establish that the terrorists had indeed entered the country, it has been virtually a wild goose chase for the last couple of days.\n\nThat the men who infiltrated were part of a fidayeen squad or members of terrorist organisations like Lashkar-e-Taiba (LeT) or Jaish-e-Mohammad (JeM) is not established yet. It is possible that those who entered India could have been spies or smugglers. In the past one year, 18 Pakistani spies or over ground workers have been arrested.\n\n“Generally a fidayeen [suicide] squad would not wait for three-four days to strike. Their intention is to enter and strike immediately. Pathankot [where terrorists spent more than 15 hours at the airbase] was an aberration. It could be possible that the men who infiltrated were no terrorists but spies who have been sent here to collect information. The only question is why will so many spies move together?” said a government official.\n\n“Since the information came from a credible source, we have put all our energy and resources into this hunt. We have not found anything so far,” said the official.\n\nLearning from the Pathankot operation, the authorities rushed four NSG teams to Somnath temple, a high-profile target on the Gujarat coast.", 
    "section": "national", 
    "title": "Home Minister reviews security", 
    "subsection": "general", 
    "date": "2016-03-08"
}