{
    "author": [], 
    "text": "All-women’s group to stage play on the occasion of Women’s Day\n\nAll-women Indian theatre group Creative Arts, has been invited to stage its award winning production, Baawre Mann Ke Sapne , in Colombo on the International Woman’s Day tomorrow.\n\nInvited by the SAARC Cultural Centre, Colombo, the Ramanjit Kaur—directed play will reflect the battle of every woman, working or otherwise.\n\n“The SAARC Cultural Centre invited us for staging Baawre Mann ke Sapne at the prestigious Lionel Wendt Theatre on the occasion of International Woman’s Day tomorrow,” Kaur told PTI from Colombo.\n\n“After the positive response we got from the audience of Kolkata, New Delhi and Mumbai, we hope to connect with the Lankan audience too,” she said.\n\nCertain issues pertaining to women are universal, crossing boundaries, language and customs, said Kaur.\n\nCritically acclaimed\n\nBaawre Mann Ke Sapne has been woven together through improvisations, incidents and real life experiences, the SAARC Cultural Centre, Colombo, said in its website announcing that it will be celebrating the International Woman’s Day with this production.\n\nThe script of Baawre Mann Ke Sapne is derived from a dozen short stories by women writers ranging from Jhumpa Lahiri of the new generation to veterans like late Lalithambika Antharjanam.\n\nThe production had bagged the best theatre award at the National Laadli Media and Advertising Awards for Gender Sensitivity in Mumbai and also critically acclaimed at the International Theatre festival by Bratyajan of Kolkata.\n\n“During our workshops we slog from 7.30 AM to 7.30 PM but when we return home, we switch to the homemaker mode, as all women are practised to do in their lives,” Kaur said.\n\n“We consider homemaking a profession too. That means women balance both professions — career and home — with aplomb. This production aims to portray that,” she said. — PTI", 
    "section": "national", 
    "title": "Indian theatre group to perform in Colombo", 
    "subsection": "general", 
    "date": "2016-03-08"
}