{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "High levels of insulin directly damage the lung structure, says global study\n\nDiabetes may be impeding the normal functioning of lungs and common medicines that are used to treat insulin resistance may actually be exacerbating conditions such as asthma, report a team of Indian, European and American scientists in a forthcoming edition of the American Physiological Society Select journal.\n\nAnurag Agrawal, at the CSIR Institute of Genomics and Integrative Biology and lead author of the study, suspects a link between diabetes — a condition characterised by the hormone insulin failing to regulate blood sugar in the body — and impaired lung function that makes Indians particularly vulnerable to respiratory diseases. “Notably, Indians have the lowest lung function in the world even after adjusting for our smaller body size. The importance of this paper is that it shows for the first time that high levels of insulin are directly damaging the lung structure and function,” Dr. Agrawal told The Hindu .\n\nRecently, there have been a number of studies showing that when adjusted for body size, Indians have among the smallest lungs in the world or nearly a third smaller than a white European of similar size. This means a reduced efficiency to filter oxygen from ingested air, an accelerated decline in lung function with age as well as an increased propensity to contract respiratory diseases.\n\nDiabetes has emerged as a serious disease burden for India over the past two decades. The Institute for Health Metrics and Evaluation at the University of Washington reports that while diabetes rate has increased by around 45 per cent globally, it jumped 123 per cent in India between 1990 and 2013. The International Diabetes Federation showed that nearly 6.9 crore people in India were suffering from diabetes in 2015 and their ranks are expected to swell to 12.5 crore by 2040.\n\nDr. Agrawal and his colleagues arrived at their conclusion through tests on mice, which were fed with insulin to levels proportionate with what human diabetics on insulin medication would have. The scientists then found changes in the mice lungs that are known to be associated with the onset of diseases such as asthma and chronic obstructive pulmonary disease.\n\nThe researchers then reinforced their findings by examining samples of human lung tissue that were treated with excessive insulin and saw an abundance of two kinds of tissue — primary human airway smooth muscle (ASM) cells and induced collagen — that are known to indicate deteriorating lung quality.\n\nWhat’s disconcerting, according to Dr. Agrawal, is that “most medicines to treat diabetes attempt to control the excess blood sugar by pumping in ever-increasing quantities of insulin into the body. That only makes matters worse. There’s no solution to this other than exercise and a diet that strikes a balance between protein and carbohydrates,” he said.", 
    "section": "national", 
    "title": "Indians could face a higher risk of diabetes-induced lung ailments", 
    "subsection": "general", 
    "date": "2016-03-08"
}