{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Peoples Democratic Party (PDP) president Mehbooba Mufti on Monday promised to continue the alliance with the BJP but the latter asked Ms. Mufti to approach Governor N.N. Vohra with a formal support first, while describing the implementation of ‘Agenda of the Alliance’ as a “continuous process.”\n\n“Mufti [Muhammad Sayeed] saheb’s decision [on the government formation] is final. His decision, which was well-thought, remains my decision too … Will not do anything that can prove his decision wrong,” said Ms. Mufti in her public address in north Kashmir’s Kupwara district on Monday.\n\nMs. Mufti’s tone, for the first time, sounded reconciliatory towards the BJP, but also reflected pressure within the PDP to form the government without any further delay. However, she reiterated the need to implement the measures agreed upon in the ‘Agenda of the Alliance’.\n\nEqually ready: BJP\n\nIn response to Ms. Mufti’s remarks, BJP national vice-president and MP Avinash Rai Khanna told The Hindu that his party “was equally ready” for the government formation.\n\n“The alliance [between the PDP and the BJP] remains intact. We have not called it off. We never had a problem. Let Ms. Mufti first approach the Governor to formally support the alliance and her party should first elect leader of the Legislature Party.”\n\nOn the PDP’s demand to have confidence building measures in place before the government formation, Mr. Khanna said, “This alliance was stitched for development of J&K. So many measures, including [allocation of ] money for railway and road projects, are already taken. Prime Minister Narendra Modi visited Kashmir and announced a Rs. 80,000-crore package. It was all part of the confidence building measures.”\n\nReiterating the BJP’s commitment to the implementation of ‘Agenda of the Alliance’, Mr. Khanna said, “All measures within the Agenda are doable and its implementation is a continuous process. The governments function in continuity.”", 
    "section": "national", 
    "title": "Mehbooba ready for govt. formation", 
    "subsection": "general", 
    "date": "2016-03-08"
}