{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Bahujan Samaj Party chief lashes out at Sahai panel’s clean chit to Akhilesh government on Muzaffarnagar riots\n\nThe Justice Vishnu Sahai Commission’s “clean chit” to the ruling Samajwadi Party in the 2013 Muzaffarnagar riots was an attempt to “whitewash” the Akhilesh Yadav government’s culpability in the communal violence, Bahujan Samaj Party chief Mayawati claimed on Monday. The BJP has also questioned the “internal contradictions” in the report and demanded a CBI inquiry into the riots.\n\nMs. Mayawati told Muslims in Uttar Pradesh that “it is time to think and understand what value their life, property and religion hold under the SP government. It has become almost impossible for Muslims to get security — of life, property and religion — and justice under the BJP-led Centre and SP government in the State,” she said, urging the minority community to accept the “bitter truth” and take political steps keeping them in mind.\n\nThe commission report absolved the SP government of direct responsibility for the riots that left more than 60 dead and 60,000 homeless in Muzaffarnagar and adjoining districts. It blamed the “negligence” of the local administration, the “failure” of the intelligence agencies and exaggerated reporting in the social and print media for the deadly violence.\n\nMs Mayawati said the report gave credence to the perception that a “probe panel’s aim is not to punish the guilty and secure justice to victims but to give clean chit to governments.” She condemned the report for failing to act against BJP leaders who were found “prima facie guilty,” and for not providing justice to victims, even as those accused of instigating the riots “roam free as heroes.”\n\nBJP queries\n\nU.P. BJP chief and Meerut MLA, Laxmikant Bajpai, criticised the government for merely releasing a “gist” of the report, and said it had “internal contradictions,” which needed to be clarified.\n\n“The government is patting its own back but it would not be apt to say that it has got a clean chit. The government forgets that the report has held it responsible on many counts. We demand that the full report be made available to political parties and the media,” Mr. Bajpai told The Hindu .\n\n‘Intelligence failure’\n\n“The report holds responsible the failure of the intelligence agencies and the transfers of the then DM and the SSP. It mentions that these transfers created an impression among the Hindus, especially Jats, that the government was favouring Muslims. How could have these transfers taken place without the approval of the Home department, which is under the CM?” Mr. Bajpai asked.\n\nThe Sahai Commission was constituted to probe the reasons for the riots and the administrative lapses in controlling the violence. Though the report indentified 14 causes for the deadly violence, it did not indict any SP leader or senior government official or police officer.", 
    "section": "national", 
    "title": "Muslims have no security under SP rule: Mayawati", 
    "subsection": "general", 
    "date": "2016-03-08"
}