{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "“We have not received any intimation from the President cancelling his attendance,” said a spokesperson for the Art of Living Foundation, which is organising the World Culture Festival, on the Yamuna floodplains here from March 11 to 13, to mark its 35th anniversary.\n\nIn posters, hoardings and pamphlets, the programme includes its inauguration by Prime Minister Narendra Modi and the valedictory address by President Pranab Mukherjee, apart from an address by Art of Living founder Sri Sri Ravi Shankar.\n\nThe National Green Tribunal is hearing a case for shifting the venue as construction is banned on the floodplains.\n\nThe Art of Living insists that it is only putting up temporary structures on the 1,000-acre site.\n\nMamta Kail, an Art of Living volunteer at the site, said: “We have not dug one inch of ground. The stage is 7 acres in size, and is completely eco-friendly. No cement has been used.”\n\nThe event is expected to draw 35 lakh people.\n\nAdding further controversy to the event, pictures of soldiers in combat fatigues and Army trucks at the site went viral on the social media on Monday, drawing sharp criticism from various quarters on the employment of the Army for such an event.\n\nOfficials of the Ministry of Defence defended the decision saying it was done in “public interest” as several lakh people were expected to attend the event.\n\nAsked whether the Army had put forward its reservations, Army officers said the order came from the government and the Army did as directed. “The Army raised its concerns but were told that it had to be done in the overall public interest,” one officer said.\n\n“The government will take responsibility for the safety of people attending the event. So this was done in public interest and the Army is best tasked for such things,” a senior government official said.\n\nAnother senior officer said the Army barely got a chance to practise bridge-laying on the Yamuna, and this was a good opportunity as “they were called in with all permissions.”\n\nAn Army company of about 120 soldiers from the Corps of Engineers has been tasked with constructing the bridge.\n\nWhile the Army was requested to construct at least four bridges, the Army built one and may build one more, officials said.", 
    "section": "national", 
    "title": "No intimation from President, says Art of Living Foundation", 
    "subsection": "general", 
    "date": "2016-03-08"
}