{
    "author": [
        "George Gene Gustines"
    ], 
    "text": "He has written foreword of the 25th volume of The Complete Peanuts\n\n“Like millions of Americans, I grew up with ‘Peanuts.’ But I never outgrew it.” So begins U.S. President Barack Obama’s foreword for the penultimate volume of The Complete Peanuts , the latest book to reprint every daily and Sunday strip of the iconic series.— Photo: The New York Times\n\nLike millions of Americans, I grew up with ‘Peanuts.’ But I never outgrew it.”\n\nSo begins the foreword written by U.S. President Barack Obama for the 25th volume of The Complete Peanuts , the latest in a series of hardcover books reprinting every daily and Sunday strip of the iconic series that appeared from 1950 to 2000. The volume, which is scheduled for release in May, covers January3, 2000, when the final ‘Peanuts’ strip was published the day after the death of its creator, Charles M. Schulz.\n\n“For decades, ‘Peanuts’ was our own daily security blanket,” President Obama writes in his introduction. “That’s what makes ‘Peanuts’ an American treasure.”\n\nNo one would agree with that assessment more than Gary Groth, the president and co-founder of Fantagraphics Books, which has been publishing The Complete Peanuts since 2004. Mr. Groth wanted to make sure this volume was special, beginning with the introduction — and who was going to write it.\n\n“Obama was inevitably at the top of the list,” he said. “Let’s just reach for the stars. All he can do is say no.”\n\nThe idea for the collected editions came to Mr. Groth in 1997, when he interviewed Schulz for The Comics Journal, a trade magazine.\n\n“Previously ‘Peanuts’ had been collected only in sporadic volumes: thematically or randomly,” Mr. Groth said. “Maybe someone should publish a uniform series,” he recalled suggesting to Mr. Schulz. “And that someone could be me,” he added.\n\nMr. Schulz resisted at first, but eventually gave his consent. Still, the project did not really take shape until after his death from colon cancer. Mr. Groth credits the cartoonist’s widow, Jeannie Schulz, for cutting through the red tape involved with securing the publication rights to make the series possible.\n\nStill, a series of hardcover reprints was not a safe bet. Previous collected editions of Prince Valiant, Pogo, Popeye and others “were almost always a hard sell,” Mr. Groth said. — New York Times News Service", 
    "section": "national", 
    "title": "Obama pays tribute to the ‘Peanuts’ gang", 
    "subsection": "general", 
    "date": "2016-03-08"
}