{
    "author": [
        "Satyasundar Barik"
    ], 
    "text": "It now has 19,774 manuscripts, down from 40,000 in 2014, govt. admits in reply to RTI query\n\nThe government had been maintaining that the Odisha State Museum was in the possession of over 40,000 manuscripts, the largest collection of manuscripts in the world.\n\nThousands of priceless and ageless palm leaf manuscripts have apparently gone missing from the galleries of the Odisha State Museum (OSM) if the government’s own admission is anything to go by.\n\nThe State government, in response to an RTI query, has revealed that the premier museum is now in possession of only 19,774 palm leaf manuscripts.\n\nThe reply has come as surprise to many as the Odisha government had been maintaining that the museum was in rich possession of over 40,000 such manuscripts — the largest collection of manuscripts in the world.\n\n“The exact number of palm leaf manuscripts in the collection of the OSM, which include store stock of the palm leaf manuscripts and those displayed in the gallery, is 19,774,” says the RTI reply signed by OSM curator Bhagylipi Malla.\n\nMs. Malla says, “The number has been decided by departmental editors and auditors this year [2015].” She said this was the view of the former authorities of the museum and this was anticipated.\n\nContrary to RTI reply, the government in 2014 had said that around 40,000 palm leaf manuscripts had been preserved in the museum.\n\nThe collections of manuscripts in the museum were categorised into 27 sections comprising the Vedas, tantra, religious, scriptures, philosophy, astrology, Ayurveda, grammar, lexicon, music, puranas, kavyas and Mathematics.\n\nTourism and Culture Minister Ashok Chandra Panda had then said the palm leaf manuscripts of Odisha not only had received national heritage status, but also the UNESCO was thinking of according world heritage tag to it.\n\nResearchers have expressed disbelief over sudden disappearance of manuscripts. In 1984, on the occasion of the OSM’s golden jubilee celebration, it was said the palm leaf manuscripts gallery had preserved more than 50,000 manuscripts covering 28 subjects.\n\nDuring the same time, the then Chief Minister J.B Patnaik, while writing foreword to Illustrated Palmleaf Manuscripts of Orissa mentioned about 50,000 manuscripts, which was corroborated by the former Chief Secretary, Subas Pani.\n\nIn 1994, K. K. Bisoi, who was then handling manuscript section, had even revealed about the presence of 60,000 manuscripts in the museum. The OSM’s recent brochure says there are more than 37,000 manuscripts in the museum.\n\nThe RTI applicant, who refuses to be named, said the government had ignored several of his questions. “I tried to know if the loss was due to damage or theft or just missing with or without knowledge of museum authorities. I have not been given any satisfactory answer,” he said, adding the question on actual position of the unaccounted 13,000 manuscripts also went unanswered.", 
    "section": "national", 
    "title": "Priceless palm leaf manuscripts go missing at Odisha State Museum", 
    "subsection": "general", 
    "date": "2016-03-08"
}