{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "It is suspected that the ageing vessels are used for drug-trafficking or illegal fishing\n\nSeveral ageing Pakistani fishing boats have been washing ashore in the Sir Creek area in Gujarat in the last few months, leading to much speculation in the security establishment.\n\nAt least eight rickety wooden boats have been recovered in the past four months, officials said. Until November 2015, no such boats were recovered by the Border Security Force (BSF), which mans the swampy terrain.\n\nAmong the recoveries made from these boats were fish, crabs, utensils, flour, blankets, jackets, pillows, quilts, mobile phones, petrol jerry cans, Pakistani SIM cards, iceboxes, and a slip of paper mentioning a custom checkpoint in Pakistan. Most of the recoveries were made along the 32-km long G-Line, the nearest habitation being 30 km away in Lakhpat, to the south. “Following the alert by the Intelligence Bureau (IB) and the Gujarat Police, the security along the area has been enhanced. We did some fact-checking and found that the terrorists could not have entered through this route. There is no population here and the swampy terrain makes it difficult to traverse without being detected,” a senior government official said.\n\n“They started washing ashore from November. There are no clear explanations for the phenomenon,” a senior official said.\n\nThe last boat was seized by a BSF patrolling team on Friday. The team reported seeing 10 men running into the Pakistani side, one source said.\n\nThe recovery of so many fishing boats has led to several theories. Some officials argued that these were old boats used by drug syndicates for moving drugs from the Pakistani shore to the mid-sea where the cargo was transferred to other boats that take them to various destinations across the globe. These boats were possibly abandoned and pushed towards the Indian side because of tidal movement.\n\nAnother group believed these were boats used for illegal fishing, and when those who manned them suspected that the Indian side had detected them, they abandoned the boats. However, what was certain was that the recovery of these boats was linked to the increasing incidents involving fishing boats along the Gujarat coast and mid-sea from there.\n\nThe Coast Guard had claimed that on the intervening night of December 31, 2014, and January 1, 2015, it had blasted a Pakistani terror boat. The Defence Ministry had said that the occupants refused to cooperate with the Coast Guard when they were intercepted and blew up the boat. Government officials later identified the fishing boat as Qalandar and said they had intelligence to suggest it was due for an “illicit transaction at sea.”\n\nThe incident kicked up a controversy and the government sacked Coast Guard DIG B.K. Loshali for contradicting the official line.\n\nCredible evidence has emerged that a major global drug smuggling racket is active in the waters off Gujarat. In April 2015, a boat carrying drugs worth over Rs. 600 crore was seized off Gujarat. A few weeks later, an Iranian fishing boat was found floating in the waters off Kerala.", 
    "section": "national", 
    "title": "Security officials on tenterhooks", 
    "subsection": "general", 
    "date": "2016-03-08"
}