{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The February 29 self-immolation by a Tibetan youth in Dehradun is a “cry for help” from Tibetans across the world, Prime Minister of the exiled government of Tibet, Lobsang Sangay, told The Hindu on Monday.\n\n“The world is occupied with violent developments of Iraq and Syria and the headlines are focussed on developments in West Asia and the Chinese control and repression in Tibet is not covered in the public discourse,” Dr. Sangay said. Dr. Sangay’s comments came after Dorjee Tsering, a 16-year-old, set himself afire last week in protest against Chinese control of Tibet.\n\nTsering was cremated in Dharamshala on March 6, even as the exiled Tibetan community in India is preparing for the March 20 election for the exiled Tibetan legislature.\n\n“This was the first time that a teenager who has never even been to Tibet, committed self-immolation in protest. This shows that commitment to the Tibetan cause remains undiminished,” Dr. Sangay said.\n\nThe self-immolation in Dehradun took place at the same time when a similar immolation took place in Tibet which, Tibetan activists say, reflect the growing disenchantment within the movement which has been nonviolent so far.\n\nOver the years, the Tibetan movement has been growing younger as the leadership issue has been left open with the Dalai Lama championing separation of the spiritual and political streams of the movement.\n\nActivists say that the self-immolation has once again underlined Tibet’s right to self-determination which has been sidelined by the great power politics and the global market which need Tibet’s resources for keeping the Chinese market buzzing.\n\n“The issue of Tibet is politically inconvenient for the big global powers which do not want to antagonise China. But the younger generation is restless and they are determined to take the struggle forward,” said Tibetan poet and activist Tenzin Tsundue.", 
    "section": "national", 
    "title": "Self-immolation is cry for help: Tibetan PM-in-exile", 
    "subsection": "general", 
    "date": "2016-03-08"
}