{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "In a disturbing development, the number of cases of sexual harassment has gone up in educational institutions under 32 universities spread across 23 districts in Andhra Pradesh and Telangana.\n\nAccording to the State women’s commission, 376 cases were filed by students of various universities in both the States during twin academic years 2014 to 2016.\n\nCases were filed against fellow students in some cases and staff in others.\n\nAmong the universities where sexual harassment cases were filed include reputed ones like Nalsar University of Law, Sri Venkateswara University, Osmania University and Kakatiya University.\n\nCases range from verbal abuse that “outrages the modesty of a woman” to physical assault. Among the cases, three were filed against research supervisors of female students for making sexual advances.\n\n“In one case, a research supervisor had called a girl student to his home for sexual favours. While the case is under investigation university authorities did not take action against the accused,” said Advocate Ruksana Parveen who deals exclusively with cases related to educational institutions. Sometimes the accused are allowed to remain in office even after students lodge a police case, she pointed out.\n\n“As per guidelines of Gender Sensitive Committee to Prevent Sexual Harassment, once an inquiry commences the accused should not allowed to get in touch with the victim. In about 60 per cent of the cases that rule is not followed by universities,” said Advocate Mohsina Ashraf who had represented young female victims of harassment.\n\nFifteen cases registered were violent crimes committed by “outsiders” . “In such cases, investigation usually leads nowhere and culprits walk scot-free,” Ms. Ashraf said. According to officials, 2014-16 registered the highest number of such cases in a decade.\n\n“We need to strengthen internal mechanisms to fight such cases. At the same time gender sensitisation of police department too is required,” Ms. Ashraf opined. The number of cases in 2012-14 was less than a 100, she pointed out.\n\nThough cases registered with GS-CASH are not referred to police, about 30 per cent of the cases that were registered in universities were referred to police stations concerned due to severity of accusations.\n\nCases were filed\n\nin Osmania University, Kakatiya University\n\namong others", 
    "section": "national", 
    "title": "Sexual harassment cases on the rise in A.P., Telangana", 
    "subsection": "general", 
    "date": "2016-03-08"
}