{
    "author": [
        "N Rahul"
    ], 
    "text": "Many ITIs in the government and private sector have failed to fulfil theNCVT norms\n\nThe Telangana government has been spending a meagre Rs. 16 a month on each student of the Industrial Training Institutes in the State while the norms of the National Council for Vocational Training (NCVT), the advisory body of the Centre on craftsmen training, stipulates an expenditure of Rs. 400 per head a month.\n\nThe government was also supposed to fill all the existing vacancies of the teaching staff and create and fill an additional 624 posts to fulfil the norms. Leave alone creating the posts, the government was nowhere near filling the existing vacancies of 568 posts in ITIs.\n\nThe Department of Employment and Training of the State government, which is the nodal agency for ITIs, had proposed a budget of Rs. 300 crore last year, but got only Rs. 7 crore. Six ITIs in Telangana, including one at Sircilla in Karimnagar which is represented by IT Minister K.T. Rama Rao, did not have NCVT affiliation as they did not conform to standards.\n\nThe proposal for setting up another ITI at Kamalapur, part of Huzurabad constituency represented by Finance Minister Etala Rajender, was dropped at the instance of the Minister, though it was he who asked the officials to initiate the same. He apparently realised that the proposal might not succeed due to strict rules laid down for ITIs, senior officials said.\n\nThis, in a nutshell, is the state of affairs of 61 government and 211 private ITIs in Telangana from where nearly 35,000 students of poor and lower middle-class families pass out every year. The demand for admissions to ITIs is almost 1:10 on the basis of merit-cum-reservation after SSC, but many of the students are left in the lurch due to strict rules as vocational training is a concurrent subject where the Central government was entrusted with the responsibility of framing overall policies, norms, standards and pattern of examination, but the day-to-day administration rested with the State governments.\n\nThe Quality Council of India, set up jointly by the Central government and Indian industry represented by ASSOCHAM, CII and FICCI, inspects the infrastructure at the ITIs and proposes to NCVT by online procedures to grant affiliation after finding that the buildings, tools, machinery, equipment, power availability and faculty are satisfactory.", 
    "section": "national", 
    "title": "Telangana govt. spending a pittance on ITI students", 
    "subsection": "general", 
    "date": "2016-03-08"
}