{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "In letters to the HRD Minister and PMO, Harish alleges institutionally sustained discrimination\n\nWhile Rohith Vemula’s suicide at the University of Hyderabad turned the national spotlight on the issue of discrimination against Dalits in higher education, a Dalit student from Chaudhary Charan Singh University (CCSU) in Meerut has approached Human Resource Development Minister Smriti Irani with a wish to commit suicide, alleging “institutionally sustained” discrimination.\n\nUnderlining that he was scared and depressed, the student threatened to take his life in letters written last week to the Governor of Uttar Pradesh, Union HRD Minister Smriti Irani and the Prime Minister's Office.\n\nHarish Kumar, a student of history, cleared the UGC NET in 2005. A resident of Hapur district in western Uttar Pradesh, Harish, whose mother is paralysed and father is a tailor, has published and presented more than 25 research papers. But he has run into a host of problems trying to pursue his research: he claims that it took him seven years to find a supervisor and that he was now being “harassed” for attendance problems.\n\n“Almost all the professors I met discouraged me from coming into higher education. Just because I don't have a 'suitable' surname, all the professors I approached refused to become my research supervisors,” Mr. Kumar told The Hindu.\n\nWhile Mr. Kumar claims that his attendance has been ‘shortened’ by the university staff, the Vice Chancellor of the university told The Hindu that this was not a case of “discrimination” but of lack of attendance.\n\n“Harish was short of attendance because of which he could not take the exam. Now he has been given one more chance to clear the course work test,” CCSU Vice Chancellor Prof. N.K. Taneja said, rejecting the allegation of discrimination against Dalit students.\n\nDr. Satish Prakash, an associate professor at Meerut University, also a Dalit, however, says there is discrimination against Dalits in U.P.’s universities, likening the experience of these students to that of Vemula.\n\nMr. Kumar and his friends cite several reasons to back his academic credentials: he cleared his UGC NET in 2005, has highlighted the abysmal condition of historical monuments in Meerut and Baghpat, runs a journal on ancient sturctures, has published more than 25 research papers and has also been published across national Hindi dailies.\n\n“In normal circumstances, a resume like this could have fetched him an easy Ph.D. offer from any university in U.P.,” claims Dr. Prakash.\n\nMr. Kumar relates what he sees as his harassment to RTI applications filed by him seeking information about the number of Dalit research students admitted to the Ph.D. in his department and the number of those who finally completed the research.", 
    "section": "national", 
    "title": "U.P. Dalit student alleges harassment, threatens suicide", 
    "subsection": "general", 
    "date": "2016-03-08"
}