{
    "author": [], 
    "text": "Students in the U.S. two to three times more often describe male professors as “brilliant” and “genius” than female professors, new research has found.\n\n“Male professors were described more often as ‘brilliant’ and ‘genius’ than female professors in every single field we studied —— about two to three times more often,” said lead researcher Daniel Storage from the University of Illinois, US.\n\nFor the study, the researchers conducted an analysis of more than 14 million reviews on RateMyProfessors.com, where students write anonymous reviews of their professors.\n\nStudents most often use the words “brilliant” and “genius” to describe male professors and in academic disciplines in which women and African—Americans are underrepresented — such as philosophy and physics — the findings showed.\n\nThe findings, reported in the journal PLOS ONE , included academic disciplines in the sciences, humanities, social sciences and math.\n\nThe new analysis offers new insights into students’ attitudes and thoughts, the researchers said.\n\n“What is valuable about spontaneous comments is that they provide an unvarnished reflection of how people evaluate others in their field, and what they look for in other people in that field,” Andrei Cimpian, professor at University of Illinois, noted.\n\nThe study also found that none of the following four factors could fully explain the underrepresentation of women or African-Americans in a field — average GRE (graduate school entry exam) math scores, the desire to avoid long hours at work, the selectivity of each field or the ability to think systematically. — IANS\n\nStudents in U.S. use those terms two to three times more while describing male professors", 
    "section": "national", 
    "title": "Women professors less often rated as brilliant and genius: study", 
    "subsection": "general", 
    "date": "2016-03-08"
}