{
    "author": [], 
    "text": "IIFA 2016 in Spain; Anil, Hrithik, Sonakshi spread Bollywood fever\n\nBollywood extravaganza, the International Indian Film Academy (IIFA) celebrations, will return to Europe for the fourth time, with the scenic Madrid in Spain as the chosen destination this year. Actors Anil Kapoor, Hrithik Roshan and Sonakshi Sinha are already in Madrid to spread the ‘filmy’ fever.\n\nAn official announcement will be made at an event in Madrid later on Monday, but of what is seen from the Twitter handles of the three Bollywood stars, they are soaking in the colours and energy of the city and looking forward to a new celebration of Indian cinema on foreign shores.\n\nHrithik has posted multiple images on his Twitter handle, and is seen looking casual yet dapper on a sunny day with Sonakshi and Anil. In one image, the Krrish star is also seen taking a selfie with a crowd that seems to be enthusiastic about the upcoming 17th edition of the gala, to be held during June 23-26.\n\n“Something about the IIFA Awards... The people, the places, the crew, the warmth. Love it. Every time a special experience. Madrid,” said Hrithik, who had extensively shot in Spain for Zindagi Na Milegi Dobara .\n\nEven Anil enjoyed himself as he roamed around the Market of San Miguel in Madrid.\n\nHe tweeted: “Mercado San Miguel is an explosion of sounds, colors & textures... And the gorgeous street performers! IIFA 2016.”\n\nIn fact, Anil even performed an impromptu jig on popular song Gallan Goodiyan on the streets in Madrid to regale a crowd that seemed to be enjoying the vibrancy that Bollywood and its glitterati exudes.\n\n“Hola Madrid! The entire county seems to be buzzing with energy for IIFA 2016! Vamos Vamos VAMOS,” Anil added following his experience.\n\nSonakshi, who tried some flamenco, shared: “Beautiful day in Madrid, exploring the city and getting it buzzing for IIFA with Hrithik and Anil Kapoor.”\n\nThis is the fourth time that IIFA will be held in Europe. It was earlier held in Yorkshire, London and Amsterdam. — IANS", 
    "section": "national", 
    "title": "Bollywood in Madrid", 
    "subsection": "general", 
    "date": "2016-03-15"
}