{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "In a rare admission, a top official of the Border Guard Bangladesh (BGB) has said that there has been a considerable fall in supply of cattle from India in the past two years and farmers in Bangladesh are being encouraged to take up ‘cow farming’ and ‘cow fattening’ on a large scale.\n\nSince the NDA government came to power, the Border Security Force (BSF) deployed along the eastern border tightened the noose around cattle smugglers. Following the government diktat, the BSF cracked down on cattle smugglers and Home Minister Rajnath Singh said last year that cattle smuggling had come down by 60-70 per cent.\n\nBGB region commander Khondoker Farid Hassan, who was in the Sunderbans, West Bengal, to attend a BSF meeting, told The Hindu , “We consume beef so there will be a demand, if somebody is getting [cattle] on a lesser price then he will go for smuggling. In the past two years, cattle flow from India has come down by 60-70 per cent.”\n\nWhen asked specifically, whether the change had anything to do with the NDA government coming to power, Mr. Hassan said, “I do not know about the change of government, but yes, it has come down. We don’t want that cattle to come from India.”\n\nLast year, Mr. Singh had also made a statement that due to clampdown in border areas, the price of beef in Bangladesh had gone up by 30 per cent. Responding to this, Mr. Hassan said, “It is not that much. Earlier it was 280-290 taka for a kilogram of beef, now it is 300-320 taka/kg. Basically Bangladeshi farmers have consented on cow fattening and cow farming now.” In 2015, the BSF shot dead 24 cow smugglers, compared to 10 in 2014.\n\nWhile addressing BSF personnel in April 2015, Mr. Singh had said, “I am told the price of beef has gone up by 30 per cent due to your heightened vigil. You must further intensify your vigil so that cattle smuggling stops completely and price of beef escalates 70 to 80 per cent so that the people of Bangladesh give up eating beef.”\n\nFarmers are being encouraged to take up ‘cow farming,’ says Bangladesh", 
    "section": "national", 
    "title": "Cattle smuggling to Bangladesh on the wane", 
    "subsection": "general", 
    "date": "2016-03-15"
}