{
    "author": [
        "Petlee Peter"
    ], 
    "text": "By the time Manish Tilokani’s (name changed) mother realised that her 21-year-old son needed professional help, he was already spending six hours a day in the bathroom scrubbing his body clean with a bar of strong detergent.\n\nThe architecture student’s strict adherence to personal hygiene, initially seen as a welcome quirk, gradually increased in intensity to the point where he would skip college to complete his daily ablutions, and would emerge from the bathroom with his feet encased in polythene bags for extra protection from dirt.\n\nDoctors at Bengaluru’s National Institute of Mental Health and Neurosciences (Nimhans) diagnosed Tilokani with obsessive compulsive disorder or OCD, a debilitating mental health disorder that people mistakenly associate with the need to be neat or tidy.\n\nOn an average, Nimhans sees eight new people seeking treatment for various forms of OCD every week. This is over and above the 40 to 50 patients who undergo treatment at the institute.\n\nDoctors attribute this rise in people seeking medical help to increased awareness on the disorder, which at its worst can drastically alter behaviour patterns.\n\n“Worldwide, the prevalence of OCD is two to three per cent, and it is the same in our country,” says Y.C. Janardhan Reddy, chief of OCD clinic at the Department of Psychiatry at Nimhans. “Two decades ago, people seeking treatment for the disorder was rare, but nowadays more people are coming forward especially to our Bengaluru facility. But there is still need for extensive awareness to kill taboo towards the disorder.”\n\nBut OCD is much more than a need to tidy up. It is, as doctors call it, a malfunction of the brain circuitry that has to be treated through medication, therapy, or a combination of both.\n\n‘8 new persons seek treatment for many forms of the disorder every week’", 
    "section": "national", 
    "title": "Cleanliness obsession is most common OCD: Nimhans", 
    "subsection": "general", 
    "date": "2016-03-15"
}