{
    "author": [
        "Staff Correspondent"
    ], 
    "text": "The Aadhaar (Targeted Delivery of Financial and Other Subsidies, Benefits and Services) Bill, 2016, which was passed in the Lok Sabha last week as a money bill, could spell disaster for India’s poor and marginalised, said activists at a media event in New Delhi on Monday.\n\nCriticising the NDA regime’s decision to bypass discussion of the Aadhaar Bill in the Rajya Sabha, Kavita Srivastava of the Right to Food Campaign said, “The States have their own concerns about the Aadhaar Bill, and that was why a discussion in the Rajya Sabha was vital. We, therefore, condemn the undemocratic passage of the Aadhaar Bill as a money bill.”\n\nNikhil Dey of the People’s Action for Employment Guarantee said the justifications given by the government for linking delivery of social benefits to possession of an Aadhaar card were not borne out in practice.\n\n“The government claims that the Aadhaar card will ensure higher efficiency, greater inclusiveness, and a reduction in corruption. But in Rajasthan, what we are getting are more inefficiency, more exclusion, and more corruption”, he said. “In Tonk district, for instance, 80% of the rightful beneficiaries were turned away due to biometric-related issues. In other districts, the inefficiency rate was 60%. Aadhaar neither prevents leakages of ration, particularly from the godown to shops, nor does it deter corruption.”\n\nAccording to the activists, biometric authentication has made the process more painful for the beneficiaries. “Sometimes, the fingerprints do not match. Other times, there are connectivity issues. People are harassed by being made to come back multiple times. Thanks to Aadhaar, biometric mismatch has now become a legitimate cover for the state to deny people their due,” said Mr. Srivastava.\n\nThe civil society groups called for making entitlements under MGNREGS, pension scheme, and the Food Security Act (FSA) independent of Aadhaar card ownership. “Contrary to the government’s claims, Aadhaar is not a development intervention technology but a surveillance technology, and it’s essential logic is one of invasion of privacy, not delivery of benefits,” summed up Mr. Srivastava.\n\nThe civil society had come together to present their analysis of the 2016 Union Budget, and belonged to seven different campaigns.\n\nAadhaar’s essential logic is one of invasion of privacy, not delivery of benefits: activist", 
    "section": "national", 
    "title": "Counterproductive, say civil groups", 
    "subsection": "general", 
    "date": "2016-03-15"
}