{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Strengthen institutions like municipalities, says Janaagraha\n\nIndia’s urban population is set to increase from 400 million to 800 million in the next 35 years and, in the absence of effective policy-making and systemic reforms, it will be difficult to managit and achieve desirable socio-economic progress, said Janaagraha, a non-profit that specialises in urban policy-making.\n\nDuring the release of its annual survey, Srikanth Viswanathan, coordinator of Janaagraha, said the government should abstain from managing the cities “the way it has managed them in the last 40 years” and devote time to strengthen institutions like municipalities and urban local bodies.\n\n“We have been consistently underestimating the scale of this problem (the surge in urban population),” said Mr. Viswanathan.\n\n“If we don’t go for a policy overhaul, empower mayors and commissioners, India’s economic growth will be impacted because cities are the country’s growth engines,” he said.\n\nMr. Viswanathan said the government did not seem to be on the right track when it came to examining its new flagship urban policies, Smart City Mission and Atal Mission for Rejuvenation and Urban Transformation (AMRUT). Since the schemes claim to empower municipalities, he said, they “will not be capable of bridging the (country’s) urban infrastructure gap.”\n\n“The estimates made about three years back suggests that India will need a trillion dollars, that’s about Rs 40 lakh crore, to fund the urban infrastructure deficit over 20 years,” said Mr. Viswanathan, adding that Smart City Mission and AMRUT only add a “few thousand crores” to urban planning.\n\nIn the Jaanagraha survey, all Indian cities fare badly with a score ranging between 2 and 4, compared to benchmark cities London and New York, which have a score of 10.\n\nThe study suggests that financial instability, frequent administrative reshuffles, inadequate human resources, high budget variance, poor track record of generating and releasing data are the main factors that hamper India’s urban progress.\n\nMr. Viswanathan said since 40 per cent of municipal posts were vacant in most States, it was hard to imagine mayors and commissioners formulating meaningful urban plans. The poor expertise at municipality level, he said, also discouraged private investors.\n\n“To manage the relationship between investments and outcome, we need systems to track where the money is going. With today’s technology, it is easy to geo-code projects at a city level and figure out where the money is being spent,” he said.\n\nWith that level of transparency, Mr. Viswanathan said, the Central and State money could be spent effectively, which could also attract private investors toward municipal projects. However, all that would be possible, he said, if the State governments amended the Municipal Corporation Act and empowered urban local bodies.", 
    "section": "national", 
    "title": "‘Empower local bodies to tackle surge in urban population’", 
    "subsection": "general", 
    "date": "2016-03-15"
}