{
    "author": [
        "Atul Aneja"
    ], 
    "text": "China on Monday said it had “not heard” about the presence of Chinese troops on the Pakistani side of the Line of Control (LoC) as reported in a section of the Indian media.\n\nIn response to a question regarding Chinese troop presence in the Pakistan Occupied Kashmir (POK), Chinese foreign ministry spokesman Lu Kang said he had “not heard about it”.\n\nMr. Kang said the Kashmir issue should be handled by the two countries bilaterally.\n\n“China’s position on the Kashmir issue is consistent. We believe it is an issue between India and Pakistan left over from history and should be properly handled by the two sides through dialogue and consultation,” Mr. Kang said. Responding to a question on the movement of Chinese forces across the Indian side of the Line of Actual Control (LAC), Mr. Kang said “it is learnt that China’s border troops were carrying out normal patrols on the Chinese side of the LAC”.\n\nSlams media\n\n“There is no such a thing as ‘border crossing’,” he said.\n\nMr. Kang slammed “some media” of having “twisted the fact and hyped up the China-India boundary question”.\n\n“We deeply regret that. At present, China-India relations are enjoying a sound momentum of development. Friendly cooperation represents the mainstream of the public opinion in the two countries. It is hoped that the relevant media can describe the situation along the China-India border as it is and do more to promote China-India friendship, mutual trust and bilateral ties,” he said.\n\nAn article in the State-run Global Times on Monday noted that “several Indian media outlets claimed on Sunday that Chinese People’s Liberation Army (PLA) troops have ‘transgressed’ the Line of Actual Control on the Pakistani side of Kashmir, passing nearly six kilometres inside Indian territory.”\n\nThe article said: “Indian media have repeatedly hyped up similar incidents, citing information from unnamed sources. There are divergences between Beijing and New Delhi over the border line, especially over the Line of Actual Control. Both China and India are well aware of it. Therefore, in order to avoid conflicts, both countries have agreed to take turns to patrol the area to stagger the chances of encountering one another.”\n\n‘No evidence’\n\nThe daily observed that there “is no evidence to prove India’s claim of the latest incident. But Indian media is inclined to make a fuss over such issues, and often use words like ‘transgression’ or ‘incursion’.”\n\n“The Chinese foreign ministry has repeatedly reiterated that Chinese troops have been patrolling on the Chinese side of the Line of Actual Control and have never trespassed over the line. On the other hand, it is reported that India has raised planning of infrastructural constructions in controversial areas, and carried out aggressive patrols in the disputed border regions.”\n\n“The Indian media is irresponsibly creating an image of China. Instead of poisoning the public opinion, the Indian media should ponder what will happen to bilateral ties if Chinese media depicts India in the same way. The truth is that not a single gunshot has been fired near the Sino-Indian border over the years,” the Global Times article observed.", 
    "section": "national", 
    "title": "Haven’t heard of our troop presence across LoC, says China", 
    "subsection": "general", 
    "date": "2016-03-15"
}