{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The mechanism between the two countries will go beyond intelligence sharing\n\nIndia and the Maldives are in the process of finalising a “cross-border counter-terror mechanism” to deal with radicalisation, and to tackle the spread of citizens trying to join the terror group, the Islamic State, in particular, a senior Maldivian official said on Monday.\n\n“Radicalisation is a big concern and a threat that we are extremely worried about,” said Foreign Secretary Ali Naseer Mohamed who met with his Indian counterpart S. Jaishankar on Saturday, adding that it was now “commonly acknowledged” that information sharing was the best way to prevent people from travelling to the IS-controlled areas. As a result, the Maldives, which believes about 40 of its citizens are currently fighting with the terror group in Iraq and Syria, wants to work closely with India and Sri Lanka, two countries that Maldivian citizens most travel to. Mr. Ali Mohamed denied that figures of Maldivian IS fighters were much more, as had been alleged by former President Mohammad Nasheed, who quoted a figure of more than 200 in a recent press conference. “Even the figure of 40 is quite big for a country the size of the Maldives which has a population of just 3,50,000. Even one Maldivian becoming a terrorist and killing people is enough to shake our society,” he said.\n\nExplaining that the mechanism between India and the Maldives would go beyond “intelligence sharing,” Maldivian High Commissioner to India Ahmed Mohamed said, “There is a discussion between the Indian government and the Maldives on establishing a cross-border mechanism to address this issue and already the Maldives has institutionalised the process.”\n\n“Our biggest challenge is the potential returnees from IS training camps, who are trained in firearms,” said Mr. Ali Mohamed, detailing the discussions with India and other countries on sharing policies on deradicalisation, as well as working with communities on preventing youth from being recruited for the brutal terror organisation. Maldives shot to international attention on the issue after a video, purportedly made by men who claimed to belong to the IS, threatened “bomb attacks” in the tourist-bound islands after the arrest of Islamist leader Sheikh Imran Abdulla last year. Mr. Abdulla, who leads the opposition Adhaalath party, was sentenced in February 2016 to 12 years’ imprisonment for inciting violence, which has only deepened the political crisis in the country.\n\nRadicalisation is\n\na big threat that we are worried about, says Maldives official", 
    "section": "national", 
    "title": "India, Maldives to finalise pact to fight Islamic State", 
    "subsection": "general", 
    "date": "2016-03-15"
}