{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "It puts in place safeguards against trafficking of children in the name of adoption: Bench\n\nNoting that the interests should be kept “first and foremost” during adoption, the Supreme Court on Monday directed the Centre and the States to frame regulations under the Juvenile Justice (Care and Protection) Act, 2015 to implement the new guidelines for in-country and inter-country adoption to make the process transparent, friendly and fool-proof.\n\n“Whether it is in-country or inter-country adoption, the interest of the child should be supreme. There should be no compromise whatsoever,” Chief Justice of India T.S. Thakur, who headed a three-judge Bench, told the Centre.\n\nThe new juvenile law defines “adoption” as the process through which the adopted child is permanently separated from his biological parents and becomes the lawful child of his adoptive parents with all the rights, privileges and responsibilities that are attached to a biological child. Section 2 of the 2015 Act mandates that adoption regulations should be framed by the authority notified for the purpose by the Centre.\n\nTerming the new law and its guidelines “comprehensive” and in line with the U.N. Convention on the Rights of the Child of 1989, the Supreme Court said it “puts in place safeguards against trafficking of children in the name of adoption.”\n\nThe government, represented by both Additional Solicitor-Generals Tushar Mehta and Pinky Anand, said the new Act brings adoption under the subject “care and protection of children” and “totally allays the fears of trafficking of children linked to inter-country adoption by making it transparent.”\n\nHowever, the court said several steps were yet to be taken to effectuate the implementation in the States.\n\n“We prodded you to make this law just like the Vishaka guidelines. This was Parliament’s function and not ours ... but nevertheless you have done it now,” Chief Justice Thakur said.\n\nWhen Ms. Anand responded that the issue of adoption was “emotional” and problems all hard to confine in a statute, Chief Justice Thakur said that was all the more reason to codify it in law so that nobody took undue advantage of persons wanting a child. The court asked the government’s statistics on child adoption.\n\nTo this, Ms. Anand replied that in 2007, there were 1,560 in-country adoptions and 770 inter-country adoptions. In 2011, there were 5,964 in-country adoptions and 589 inter-country adoptions. In 2014-15, there were 3,988 in-country adoptions and 374 inter-country ones.\n\nDisposing of the PIL filed by NGO Advait Foundation in 2012 highlighting the trafficking of children in the cover of adoption, the Bench, however, refused the NGO’s plea for an omnibus CBI probe into such rackets in the past in various parts of the country.\n\n“Bring specific instances of adoption rackets, we will order for CBI investigation. You cannot ask for an omnibus CBI probe into all adoption issues,” Chief Justice Thakur said.", 
    "section": "national", 
    "title": "Interest of child comes first: SC", 
    "subsection": "general", 
    "date": "2016-03-15"
}