{
    "author": [
        "Tca Sharad Raghavan"
    ], 
    "text": "40% of Aadhaar users said it did not ease financial transactions\n\nAlmost 40 per cent of people who have obtained Aadhaar numbers say that it has not helped them, with banking correspondents in rural areas reporting that accounts opened under the Pradhan Mantri Jan Dhan Yojana (PMJDY) using Aadhaar face authentication issues, leading to failed transactions, according to a report.\n\n“BMs (Bank Mitras) too prefer to open accounts through the e-KYC due to the simplicity and robustness of the account opening procedures. However, PMJDY accounts opened through e-KYC using Aadhaar number face frequent authentication issues during transactions. BMs report that the biometric signature of these customers is often rejected, leading to transaction denial”, a survey report by the international financial inclusion consultancy MicroSave found.\n\nThese findings assume greater significance following the recent passage of the Aadhaar Bill in the Lok Sabha, which will provide legal sanctity to the Aadhaar number. The government is keen to use Aadhaar as a means to better target its Direct Benefit Transfer scheme for subsidy payments and has used this argument to push it as a money bill in Parliament.\n\nHowever, the survey, conducted in December 2015, found that only 62 per cent of the respondents with Aadhaar numbers said it helped make financial transactions easier. In other words, nearly 40 per cent of the Aadhaar users said it did not help them.\n\nFinance Minister Arun Jaitley had, at the time of introducing the Bill in Parliament on Friday, said that targeting the LPG subsidy through Aadhaar had resulted in savings of over Rs.15,000 crore by the Centre. Four States which had started PDS delivery by a similar exercise on a pilot basis had saved more than Rs.2,300 crore, he said.\n\nNotably, of those who said that Aadhaar helped them, only a fifth said that the benefit they saw was in easing the process of receiving government subsidies, the very reason the government wants to use Aadhaar. The survey also said that only a tenth of those who found Aadhaar useful said that it served as a strong proof of identity.\n\nThe passage of the Aadhaar Bill in the Lok Sabha comes following long legal proceedings surrounding the legality of the Aadhaar number and whether the government can mandate its compulsory use. The Supreme Court, in October 2015, said linking Aadhaar to bank accounts or subsidy payments was voluntary.\n\nAt the moment, there is a case in the Supreme Court on whether Aadhaar represents a violation of privacy.\n\nOut of the 4,859 persons surveyed, 77 per cent said that they had an Aadhaar number and 62 per cent said they had an Aadhaar number linked with a bank account.", 
    "section": "national", 
    "title": "Jan Dhan-Aadhaar link poses hurdles", 
    "subsection": "general", 
    "date": "2016-03-15"
}