{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "A high-level inquiry committee formed to look into the February 9 incident on the Jawaharlal Nehru University (JNU) campus has recommended rustication of Anirban Bhattacharya and Umar Khalid for a certain period for “violating university rules,” sources in the university administration have said.\n\nThe five-member committee has also recommended imposing a fine on some university students, including JNU students’ union president Kanhaiya Kumar, who were present at the event. However, a final call will be taken by the office of the Chief Proctor. A meeting in this connection has been scheduled for Friday.\n\nMr. Kumar, Mr. Khalid and Mr. Bhattacharya were arrested by the Delhi police on sedition charges for allegedly raising slogans in support of the 2002 Parliament attack convict Afzal Guru. While Mr. Kumar was released on bail earlier this month, Mr. Bhattacharya and Mr. Khalid are still in judicial custody.\n\nAccording to sources, 21 students have been served show cause notices for “violating the rules and regulations of university” at the February 9 event. The students, however, have refused to accept the notice. “How can the inquiry committee come to a conclusion when our side was not heard,” asked Anant, one of the students who was issued the notice.\n\nThe students have to submit their replies to the Chief Proctor’s office by March 16, failing which the office will presume that they have nothing to say in their defence. While the inquiry committee had submitted the report on March 11, it came up for discussion at a meeting of the university’s top brass chaired by Vice-Chancellor M. Jagadesh Kumar on Monday.\n\nAn official statement from the university reads: “The high level inquiry committee constituted by the VC to enquire into the incident has submitted a unanimous report.\n\nAs per the report, some students have been found to have violated the university rules and norms. There are standard provisions in the university to take action in such cases. The high level inquiry is based on the rules of discipline and proper conduct of JNU.”\n\n“The VC has apprised the Dean’s Committee of the summary of the inquiry committee recommendations. The office of the Chief Proctor would take further action by issuing show-cause notices to the concerned students who have been found violating the rules and norms of the university,” the statement added. The university had on March 11 revoked the suspension of eight students, including Kanhaiya Kumar, in connection with the controversial event on its campus to protest the hanging of Afzal Guru. This was after the university’s high-level panel probing the issue submitted its report.\n\nThe varsity had clarified then that this did not signify a “clean chit” to the students and that the final decision in this regard would be taken after examination of the report by the Vice-Chancellor.", 
    "section": "national", 
    "title": "JNU committee recommends rustication of two students", 
    "subsection": "general", 
    "date": "2016-03-15"
}