{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "One of the producers of the sting video which allegedly shows Trinamool leaders and a senior police officer taking cash, while promising favours, said the operation was not related to coming elections in the State.\n\n“The sting has nothing to do with the West Bengal polls,” Mathew Samuel later told a Bengali news channel. So far no media organisation or the Opposition has claimed to have verified the authenticity of the video.\n\nIn the first segment, Md. Ahmed Mirza, former police chief of Bardhaman district, who claims in the video to be a trusted aide of Trinamool vice-president Mukul Roy, is ‘shown’ accepting money. He claims to have arranged “60 lakh” for Mr. Roy.\n\nIn a different shot, Mr. Roy is seen telling the conduit and the Narada News reporter to “go immediately” to “my SP Mirza” to pay the cash. It is not clear from the footage whether Mr. Roy is doing any favour to the fictitious firm, Impex Consultancy. He is not seen accepting money directly from anyone.\n\n“I am not taking it straightaway,” he says and instructs that the money be delivered to his office on Elgin Road in central Kolkata. In a press conference, Mr. Roy later challenged the content and denied his involvement.\n\nThe footage however, purportedly shows other leaders, including senior State Ministers, Subrata Mukherjee and Madan Mitra, taking bundles of cash. Mr. Mukherjee allegedly took Rs. 4 lakh, says an off-screen voice.\n\nMr. Mitra is ‘seen’ reclining on a bed while a hand from the right hand corner of the screen places many bundles of currency notes in front of him. Mr. Mitra watches from the corner of his eyes. After the entire amount is placed in front of him, he is seen picking up the money and passing it to his aide, telling him “Keep the money aside.” Mr. Mitra is presently in jail for his alleged involvement in the multi-crore Saradha scam.\n\nThe other important leader who is ‘seen’ taking a few bundles is the mayor of Kolkata Corporation, Sovan Chatterjee. Mr. Chatterjee is heard promising to introduce the team from the fictitious company to important power centres “after the election.”", 
    "section": "national", 
    "title": "Leaders promise favours", 
    "subsection": "general", 
    "date": "2016-03-15"
}