{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Union Home Minister P. Chidambaram on Monday claimed documents have gone missing in the 2009 Ishrat Jahan encounter case for “someone’s benefit”, and if found, will prove that the second affidavit filed by the UPA government was duly vetted by the then Attorney-General of India.\n\nMr. Chidambaram, who was in Mumbai for the launch of his book Standing Guard: A Year in Opposition , said the affidavit was vetted by the country’s senior-most legal authority at least thrice, while he had only made minor editorial changes to it.\n\nHinting at a larger conspiracy, the Congress leader said it was to ‘someone’s advantage’ to lose the documents. Reacting to allegations by former Home Secretary G.K. Pillai, he said Mr. Pillai was on record in Guwahati acknowledging the second affidavit was correct as the Intelligence Bureau inputs were not conclusive, but he later changed his stand.\n\n“There is no mystery or anything to hide in this matter anymore. The file passed through the Home Secretary and the Attorney General three times, now they say documents is missing. To whose advantage is that fact? It is a free country and he is free to change his views,” he said.\n\nMr Pillai had claimed that Chidambaram had himself dictated the Centre’s revised affidavit in the Ishrat Jahan case in 2009, in which the references to her alleged LeT links were removed.\n\nHe said while intolerance was always a part of country’s social fabric, debate and arguments have become difficult in the present circumstances.\n\nAttacking BJP’s student wing ABVP, he said it was playing the role of agent provocateur on campuses universities, vitiating the environment and the polity. “If left to them, there will be one god, one theology and religion on campuses. They will turn universities into monasteries,” he said.\n\nIf left to them, there will be one god, one theology and religion on campuses\n\nP ChidambaramSenior Congress leader\n\nThere is no mystery or anything to hide in this matter, says Chidambaram", 
    "section": "national", 
    "title": "‘Missing Ishrat files were vetted by A-G’", 
    "subsection": "general", 
    "date": "2016-03-15"
}