{
    "author": [
        "Rachel Donadio"
    ], 
    "text": "The latest guess is that the writer is a professor in Naples\n\nAs her following grows, so does the mystery surrounding the pseudonymous Italian writer Elena Ferrante, whose Neapolitan novels on the lifelong friendship of two women have become a global phenomenon.\n\nFiguring out the identity of Ferrante, who has never been identified, has become one of the literary world’s favourite guessing games, and on Sunday, Italy’s leading daily, Corriere della Sera, delivered its latest twist: Ferrante might be a professor in Naples named Marcella Marmo. Ferrante’s publisher, Edizioni E/O in Rome, swiftly denied the report, as it has every other stab at unmasking Ferrante over the years.\n\n“It’s nonsense,” said Sandra Ozzola Ferri, half of the husband-and-wife team that runs the publishing house. Marmo, a professor of contemporary history at Federico II University of Naples, also denied the assertion.\n\n“I’m not Elena Ferrante,” she said, in a telephone interview on Sunday.\n\nOver the weekend, Marmo had been responding to an article in Corriere della Sera’s Sunday literary supplement and an accompanying video, in which Marco Santagata, a novelist and university professor, argued that Ferrante fit the profile of Marmo.\n\nGuessing game\n\nHe based his analysis on a close reading of passages in parts of one of Ferrante’s novels set in the 1960s in Pisa, where one the book’s protagonists, Elena Greco, studied classics at the prestigious Scuola Normale. Both Santagata and Marmo studied at the Normale in the 1960s.\n\n“I created a profile — I didn’t say it was her,” Santagata said in a telephone interview, adding that he had never met or been in touch with Marmo. He said he had determined that some street names in the books were changed in Pisa after 1968, suggesting that the author must have left Pisa before then. Looking in Scuola Normale yearbooks, he found she was one of the few Neapolitan women at Pisa in the mid-1960s who had become an expert in the contemporary Italian history that is the backdrop to Ferrante’s Naples books.\n\n“I did philological work, as if I were studying the attribution of an ancient text, even though it’s a modern text,” added Santagata, a philologist by training and an expert on Petrarch and Dante who teaches at the University of Pisa.\n\nFerrante has published under a pseudonym since her first novel, ‘Troubling Love’, appeared in Italian in 1992. Her author notes say simply that she was born in Naples. In recent years Ferrante has given interviews, including one with The New York Times , but always via email through her publishers.\n\nFerri said she didn’t think Ferrante would respond to Santagata’s essay. Or that she would reveal her true identity.\n\nPublished between 2010 and 2014, Ferrante’s Neapolitan novels — ‘My Brilliant Friend’, ‘The Story of a New Name’, ‘Those Who Leave and Those Who Stay’ and ‘The Story of the Lost Child’ — have rocketed the novelist from near obscurity to international fame since the first appeared in English translation in 2012.\n\nCinematic in scope, the novels trace the friendship of two women, Elena and Lila, from their childhoods amid the poverty of postwar Naples through the political and social changes that swept Italy in the ‘60s and ‘70s, to the present day.\n\nIn “The Story of a New Name,” Elena, who is the books’ narrator and becomes an accomplished writer, studies at Pisa from 1963 to 1967. In a dramatic scene, she throws some enviably strong youthful writings by Lila, who does not fulfill her own writerly talent, off the Solferino Bridge in Pisa into the Arno one November. — New York Times News Service", 
    "section": "national", 
    "title": "Mystery around Elena Ferrante deepens", 
    "subsection": "general", 
    "date": "2016-03-15"
}