{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Monday refused to intervene in poll-bound Punjab’s push to pass a Bill to return land acquired for the Sutlej-Yamuna Link (SYL) canal, which is at the centre of a water-sharing dispute with Haryana.\n\nA five-judge Constitution Bench simply adjourned a Presidential Reference on the validity of a 2004 law — Punjab Termination of Agreements Act — under which Punjab had sought to ease out of its liability to share the waters of Ravi, Beas and Sutlej. The maiden hearing on the Reference, over a decade since it came to the Supreme Court for advice, saw the Bench adjourn the case to March 17.\n\nThis was despite the Haryana government seeking an early hearing.\n\nHaryana had revived the Reference even as the Punjab Cabinet gave the green signal for tabling the Punjab Sutlej Yamuna Link Canal (Rehabilitation and Re-vesting of Proprietary Rights) Bill, 2016, in the State Assembly. It provided for the return of over 5000 acres of land acquired from farmers for the canal.\n\nHaryana counsel and senior advocate Shyam Diwan made a strong pitch for the apex court’s intervention to stop Punjab from passing the Bill. Mr. Diwan said Punjab cannot “successively legislate” away the Supreme Court’s role as the primary protector of the Constitution and the court’s duty to strike a balance between the interests of both the States.\n\nHe said while the 2004 Act was intended to defeat two Supreme Court judgments ordering Punjab to construct the canal on its territory, the new Bill was aimed at rendering the current Reference infructuous. He squarely put the onus on the Bench to stop Punjab, arguing that “it is the duty of this Court to maintain the integrity of the federal structure.”\n\nMr. Diwan asked the Court to act against being pushed over by the new Bill and not adjourn the Reference hearing. The Haryana government claimed that the “unity and integrity of the nation” was at stake in this case.\n\nYou have to strike a balance between the States, large and small, powerful and weak, upstream or downstream. If you allow them to trump over your jurisdiction by successively legislating away, your powers, considered a linchpin in the Constitution, will lie denuded,” Mr. Diwan said.\n\nThe Bill provides for the return of over 5,000 acres acquired for\n\nthe canal", 
    "section": "national", 
    "title": "Supreme Court refuses to stop Punjab Bill on SYL canal", 
    "subsection": "general", 
    "date": "2016-03-15"
}