{
    "author": [], 
    "text": "She uses a special approach to overcome tense environments of the Palestine region\n\nThe finalists listen to Palestinian primary school teacher Hanan al-Hroub speak after she won the second annual Global Teacher Prize in Dubai on Sunday.— Photo: AP\n\nA primary school teacher from a refugee camp in conflict-torn Palestine has won $1-million Global Teacher Prize for educating her students about non-violence, beating nine other finalists from around the world, including an Indian.\n\nHanan Al Hroub beat India’s Robin Chaurasiya, who runs a not-for-profit school in Mumbai for girls from the city’s red light district of Kamathipura, and eight other finalists to bag the Varkey Foundation’s prize at the star-studded ceremony here on Sunday night.\n\n“I did it, I won. Palestine won. All 10 of us have the power, we can change the world,” said Ms. Hroub, who is in her early 40s, as her name was announced by Pope Francis via video link.\n\nPlay and learn\n\nMs. Hroub runs the Samiha Khalil High School in al-Bireh, Palestine, where she uses a special approach she developed herself detailed in her book ‘We Play and Learn’ to overcome tense environments of the region under the shadow of the Israel-Palestine conflict. “I am proud to present to you the message of teachers of Palestine: There is no doubt that we live in unnatural conditions.\n\n“Violence and Israeli occupation surrounds us from all sides and imposes itself and leaks to each corner of educational process and its components, so our task is complicated as we see daily the suffering in the eyes of our students and our teachers. We want our children to live peacefully, as all children of the world,” she said, in her part-English and part-Arabic acceptance speech.\n\n“A child has the right to play. Part of education is to teach children how to play because you learn how to be social through games as well as learn the joy of life,” Pope Francis said, in reference to the winning candidate.\n\nMs. Hroub’s approach has led to a decline in violent behaviour in schools where this was a frequent occurrence and she has inspired her colleagues to review the way they teach and their classroom management strategies.\n\n“I suggest that this year is the year of the Palestinian teacher. The world should support us to achieve hope for justice and peace,” Ms. Hroub said.\n\nThe Global Teacher Prize, now in its second year, was set up by Kerala-born entrepreneur and educational philanthropist Sunny Varkey to recognise an exceptional teacher who has made an outstanding contribution to the profession as well as to shine a spotlight on the important role teachers play in society.\n\nHollywood stars Matthew McConaughey and Salma Hayek and Bollywood stars Abhishek Bachchan, Akshay Kumar and Parineeti Chopra joined former British Prime Minister Tony Blair and Sheikh Mohammed Bin Rashid Al Maktoum, the Ruler of Dubai, at the gala awards ceremony in Dubai. — PTI", 
    "section": "national", 
    "title": "Teacher wins $1-m prize for peace lessons", 
    "subsection": "general", 
    "date": "2016-03-15"
}