{
    "author": [
        "N Rahul"
    ], 
    "text": "Outlay in tune with Chief Minister Chandrasekhar Rao’s repeated assertions\n\nTelangana Chief Minister K. Chandrasekhar Rao with Finance Minister Etela Rajender before the presentation of the budget in Hyderabad on Monday.— Photo: Special Arrangement\n\nIn sharp contrast to previous years, when non-plan expenditure used to be higher than plan expenditure, Telangana Finance Minister Etela Rajender on Monday presented the third budget with an outlay of nearly Rs. 1.30 lakh crore for 2016-17, with a plan expenditure of Rs. 67,630 crore and non-plan amount of Rs. 62,785 crore.\n\nThe size of the budget is Rs. 30,000 crore more than the revised estimates for 2015-16 and Rs. 5,000 crore less than that of Andhra Pradesh for 2016-17.\n\nMr. Rajender defended the higher plan expenditure saying it was “unprecedented” and done without compromising on non-plan commitments by a combination of rationalisation of expenditure and resource augmentation.\n\nAs part of rationalisation of expenditure, he explained that a number of plan schemes with similar activity had been clubbed together in a number of departments and a few schemes with only salary component had been shifted to non-plan.\n\nTo augment resources, ‘Mission Bhagiratha’ and double bedroom housing were proposed to be funded entirely from extra budgetary resources. Hence, no provision was made under plan for these schemes, except counterpart funding.\n\nThe budget estimates, as presented by Mr. Rajender, indicate a revenue surplus of Rs. 3,718 crore and fiscal deficit (expenditure in excess of revenue) of Rs. 23,467 crore which is 3.5 per cent of Gross State Domestic Product. The higher revenue surplus was entirely on account of proposed allocation of Rs. 25,000 crore, mostly capital expenditure, to the irrigation sector.\n\nThe huge expenditure on irrigation was in tune with Chief Minister K. Chandrasekhar Rao’s repeated assertions that the government will spend Rs. 75,000 crore on the sector over the next three years, starting 2016-17.\n\nMr. Rajender emphasised irrigation, Mission Bhagiratha and double bedroom houses as the core components of his budget, but substantial allocations were also made for power, agriculture, health, education, welfare, social security pensions, roads and buildings, urban development and law and order.", 
    "section": "national", 
    "title": "Telangana budget of Rs. 1.3 lakh crore focusses on irrigation, drinking water", 
    "subsection": "general", 
    "date": "2016-03-15"
}