{
    "author": [], 
    "text": "While the Left parties are finalising ‘seat adjustment’ with the Congress in West Bengal for the forthcoming Assembly polls, they will be decrying Congress’ “misgovernance” in the neighbouring Barak Valley region.\n\nThe southern Assam will see a triangular contest between the Left parties, the Congress and the Bharatiya Janata Party in the Assembly polls to be held on April 4 and 11.\n\nThe Barak Valley region has three districts — Cachar, Karimganj and Hailakandi — and 15 seats in the 126-member Assam Assembly. Silchar, itself an Assembly constituency, is the nerve centre of the region.\n\nSix Left parties would field candidates in 58 Assembly constituencies in Assam, including some seats in Barak Valley region, said Bijan Dhar, a member of the central committee of the Communist Party of India-Marxist (CPI-M). The other five parties are Communist Party of India (CPI), Communist Party of India (Marxist-Leninist), Revolutionary Communist Party of India, Forward Bloc, and Revolutionary Socialist Party.\n\n“The Left parties would contest against both ruling Congress and the BJP. They would highlight 15 years of misgovernance in Assam by the Congress,” he said.\n\nThe CPI-M would contest elections in 19 constituencies in Assam, including the crucial Silchar seat where it has fielded its trade union leader Supriya Bhattacharjee, he said.\n\nSilchar, along with Karimganj North and Karimganj South, has a close political association with the adjoining Left-ruled Tripura.\n\nThe BJP has re-nominated for the Silchar constituency sitting legislator Dilip Kumar Paul who bagged the seat in 2014 by-elections.\n\nThe Congress is yet to select its nominee from five contenders: party general secretary Rajesh Deb, former district president Arun Dutta Majumdar, former union minister Santosh Monhan Dev’s wife Bithika Dev, his daughter Bharati Dev, and former chairman of Silchar municipal board Tamal Banik, sources said.\n\n“Central leadership wants to win Silchar seat. The party will field a strong candidate here,” Lok Sabha member from Silchar Sushmita Dev said.\n\nSushmita is another daughter of Santosh Monhan Dev who held the Assembly seat before being elected for the Lok Sabha.\n\nThe CPI-M had last won the seat in 1978. Since that time, Congress and BJP won the seat four times each. — IANS", 
    "section": "national", 
    "title": "Triangular fight between Left, Congress, BJP in Barak Valley", 
    "subsection": "general", 
    "date": "2016-03-15"
}