{
    "author": [], 
    "text": "Marine turtles gained from decline of crocodile ancestors millions of years ago\n\nMarine turtles experienced an evolutionary windfall thanks to a mass extinction of crocodyliforms — group of animals that comprise modern crocodiles and alligators and their ancient ancestors — around 145 million years ago, say researchers.\n\nCrocodyliforms were major predators that thrived on Earth millions of years ago. However, around 145 million years ago crocodyliforms, along with many other species, experienced a severe decline — an extinction event during a period between two epochs known as the Jurassic/Cretaceous boundary.\n\nThe new study, published in the journal Proceedings of the Royal Society B , showed that the timing of the extinction coincided with the origin of modern marine turtles.\n\nEcological pressure may have been lifted from early marine turtle ancestors due to the extinction of many marine crocodyliforms, which were one of their primary predators, the researchers said. “This major extinction of crocodyliforms was literally a case of out with the old and in with the new for many species,” said lead author of the study Jon Tennant, from Imperial College London.\n\n“Marine turtles, the gentle, graceful creatures of the sea, may have been one of the major winners from this changing of the old guard. They began to thrive in oceans around the world when their ferocious arch—predators went into terminal decline,” Tennant noted.\n\nTo carry out the study on crocodyliforms the team used the Paleobiology Database, which is a professionally curated digital archive of all known fossil records.\n\nThe team analysed almost 1,200 crocodyliform fossil records. They found in the records a dramatic extinction of crocodyliforms during the Jurassic/Cretaceous boundary.\n\nUp to 80 percent of species on land and in marine environments were wiped out.\n\nThis decline was primarily due to a drop in sea levels, which led to a closing off of shallow marine environments such as lagoons and coastal swamps. These were the homes and primary hunting grounds for many crocodyliforms, the study pointed out. — IANS\n\nCrocodyliforms were predators that thrived on Earth millions of years ago", 
    "section": "national", 
    "title": "Turtles gained from the decline of crocodile forms", 
    "subsection": "general", 
    "date": "2016-03-15"
}