{
    "author": [
        "T S"
    ], 
    "text": "The situation is perfectly safe and people are working inside, says AERB chief\n\nPlant personnel have entered the reactor building of Unit-I of the Kakrapar Atomic Power Station (KAPS) in Gujarat and identified the spot of heavy water leak in one of the feeder pipes in the nuclear reactor.\n\nAround 9 a.m. on March 11, heavy water leaked following a rupture in one of the 306 feeder pipes in the first unit, leading to the reactor tripping and automatically shutting down. A plant emergency was declared.\n\nS.A. Bhardwaj, Chairman, Atomic Energy Regulatory Board (AERB), told The Hindu on Monday that plant personnel entered the reactor building of the first unit late on March 12 “after verifying the radiation field and they have identified where the leak occurred.” The personnel were working inside the reactor building and would prepare plans and procedures [on how to stem the leak]. “Whatever water has come out is being re-circulated,” Mr. Bhardwaj said. The AERB team, which went to Kakrapar to study the situation, had returned to Mumbai with data, the AERB Chairman said. Mr. Bhardwaj added: “The situation is perfectly safe and people are working inside. There is no disturbance. Everything is safe. Nobody has been exposed [to radiation] inside and outside the plant. That is confirmed.”\n\nWhen contacted, N. Nagaich, Director (Human Resources), NPCIL, said the plant personnel, who had entered the reactor building, were “normalising the systems one after the other.” The reactor was under cold shutdown now.\n\nAsked whether it was a big leak of heavy water, Mr. Nagaich said it was a ‘small leak.’ “Whatever has come out ... it is a small leak.” The reactor used an inventory of about 75 tonnes of heavy water. The leaked heavy water had mixed with about 2,500 tonnes of ordinary/light water from the suppression pool, which was used to cool the nuclear fuel core. “This degraded water is being circulated in the reactor now ... When everything normalises, we will recharge fresh heavy water in the reactor by upgrading the heavy water in the upgraders at the site,” Mr. Nagaich said.", 
    "section": "national", 
    "title": "Workers enter Kakrapar n-plant, locate leak site", 
    "subsection": "general", 
    "date": "2016-03-15"
}