{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They were trapped under the debris of a 50-foot wall built on boundary of a dug-up pit\n\nTwo labourers were killed and three injured when a mud wall at the basement of an under-construction site at the All India Institute of Medical Sciences (AIIMS) here collapsed on them on Wednesday.\n\nThey were trapped under the debris of the 50-foot wall built on the boundary of a dug-up pit where the new OPD and maternity ward is coming up.\n\nAccording to eyewitnesses, around 11-45 a.m., casual labourers were asked to dig around a corner of the wall on the Masjid Moth side as well as bind the rods when loose earth slid down on them.\n\nThe pile that accumulated after the collapse deposited on Ranjeet, Vinod and Islam. Fellow labourers Naseeb and Vijay, who rushed to help them, were also buried under soil as rest of the structure also caved in.\n\nAn eyewitness said he heard a loud noise and joined several others to rescue the victims. Hearing their calls for help, the other labourers at the site informed the contractors who alerted the fire department and the police. The injured were rushed to the AIIMS trauma centre where Islam and Vinod were declared dead on arrival.\n\nPolice said prima facie it appeared that the workers had died following suffocation and critical head injuries.\n\n“We have registered a case under Sections 304A [causing death due to negligence] and 288 [not taking precautions while construction of a building] of the Indian Penal Code,” said a police officer.\n\nAn NDRF officer said the workers were over 50-foot below the ground level and due to the combined weight of the debris, the helmets they were wearing had also broken.\n\nLabourers said a similar incident had happened a few days ago at the same site but the workers escaped with minor injuries. One of them said the soil on the ground had loosened as heavy construction materials were kept on the ground above.", 
    "section": "national", 
    "title": "2 die as mud wall caves in at AIIMS", 
    "subsection": "general", 
    "date": "2016-03-10"
}