{
    "author": [], 
    "text": "“The Prime Minister may have begun with the appeal, but the rest of his speech was a scathing attack on the Opposition, and at many points, it was an unreasonable attack, most of the time it had nothing to do with what the Opposition had said in the course of the debate. Names of Opposition leaders were taken, when they sought a clarification, the Prime Minister walked off. This is not conciliatory behaviour, not even the normal courtesy of allowing named MPs to respond,” he said.\n\nMr. Yechury said this was “not a prepared vote” despite the fact that the Congress had issued a three-line whip to its MPs on Tuesday evening. “This was not a prepared vote. The Congress issued a whip, but two of our [Left] MPs were absent. If it was a pre-organised thing, we would have been there in greater strength. The issue, however, was such and the debate on whether to allow the amendment was such that hardened positions, it is unfortunate, and it should not have happened like this,” he said.\n\nThe amendment expressed “regret” that the President’s address did not go into the issue of fixing educational qualifications for anyone wanting to contest the local bodies polls. “The issue is that you are putting conditions and qualifications on people who want to contest local bodies elections. The Constitution guarantees universal adult franchise, normally all those who have the right to vote have the right to contest [barring age limits, etc.,). By bringing in these extraneous factors, the principle of universal adult franchise is, according to us, being undermined. The matter is now before a judicial bench, who haven’t commented on the content of this rule but only asserted the right of the States to legislate. On the content, matters are lying before the judiciary. Given this situation, the concern of Parliament should be reflected in the motion of thanks,” Mr. Yechury said.\n\nMr. Yechury, who has been receiving death threats and abuse after students of Jawaharlal Nehru University (JNU) were charged with sedition, said this also contributed to the Opposition unity. “The atmosphere outside the House also contributed, like threat calls, sedition charges being pressed against me and others, all this has vitiated the atmosphere. The spirit of cooperation that the ruling party should be engaged in getting, all that has gone off into an abrasive confrontation. This is a democracy, sometimes someone gets a majority, other times someone else, you have to understand that and maintain the dignity,” he said.\n\nA fresh conflict between the government and the Opposition is brewing on the ordinary bills being turned into money bills.\n\n“What constitutes a money bill, if the Speaker declares a bill a money bill, that has to be certified against the clauses that make a bill a money bill. There are only two options left: one that there be a constitutional amendment to what can be considered a money bill, the sub-clause be defined, that the Speaker’s discretion cannot adhere to the clauses that define a money bill. The Chair of the Rajya Sabha will seek a certification from the chair of the Lok Sabha on what constitutes a money bill. It is not a small thing,” he said.", 
    "section": "national", 
    "title": "Behaviour of government to blame, says Yechury", 
    "subsection": "general", 
    "date": "2016-03-10"
}