{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Party announces first list of candidates for Assam and Bengal\n\nThe BJP has decided to field Netaji Subhas Chandra Bose’s grandnephew Chandra Kumar Bose against West Bengal Chief Minister Mamata Banerjee in the Assembly polls.\n\nIt was announced here on Wednesday by HRD Minister Smriti Irani at a press conference.\n\nMr. Chandra Kumar Bose said the change for which people had voted the Trinamool Congress to power in 2011 had not come. Only the BJP was capable of bringing about a change, he said.\n\nThe BJP has hardly any presence in Bengal and the high-profile contest may grab eyeballs and make its campaign create some buzz.\n\nThe saffron party also announced its first list of candidates for Assam — a State where it has a chance of winning the polls — and Bengal. The Assam list has announced all but two among the BJP’s own quota of candidates, sources said.Meanwhile, the BJP and its ally, the Asom Gana Parishad, have both undergone split because of the alliance, with the splinter groups rejecting the tie-up. This gives the Congress some reason to cheer in a tough contest.\n\nThe BJP’s campaign face and Assam chief ministerial candidate, Sarbananda Sonowal, will contest from Majuli.Kamakhya Tasha, being fielded against Chief Minister Tarun Gogoi from Titabor, is a sitting Member of Parliament from Jorhat.\n\nWhile the BJP hopes to increase its vote share in Bengal around the legend of Netaji — whose papers have been declassified by the Modi government, though these have not shed new light on his death — and issues like the Malda violence, it will try to take up the issue of Bangladeshi immigration in Assam and also try to benefit from the anti-incumbency sentiment in the State after a long stint of Congress rule. (With inputs from PTI)", 
    "section": "national", 
    "title": "BJP to field Netaji’s kin against Mamata Banerjee", 
    "subsection": "general", 
    "date": "2016-03-10"
}