{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Party undecided whether to project a chief ministerial candidate or look out for alliances\n\nWith Assembly elections in Uttar Pradesh a year away, the Congress is in a fix whether to project a chief ministerial candidate or look out for possible alliances in the State where the party vote share has fallen to desperate margins and negative headlines refuse to die down.\n\nSince the Congress has now appointed celebrity pollster Prashant Kishor to reverse these disastrous trends, the rank and file are curious what could be the nature of the party’s strategy in the country’s most populous State, where vice-president Rahul Gandhi’s much-touted “youth strategy” failed to pay any dividends in the previous election.\n\nOn Thursday, Mr. Kishor will land in Lucknow where he is scheduled to meet State Congress leaders.\n\nDwijendra Tripathi, party spokesperson in U.P., told The Hindu that Mr. Kishor would be briefed about the issues they could rally behind and update him about the strengths and weaknesses of the opposition parties.\n\nA buzz in the party headquarters is that Mr. Kishor is keen on projecting a “credible face” as the chief ministerial candidate for U.P. The senior leadership, however, is more inclined towards strengthening the campaign from the grassroots by sending Mr. Gandhi and a stable of its firebrand leaders to as many districts as possible.\n\nA senior Congress leader said there is also a talk of stitching up a Bihar-like alliance since it is hard for the Congress to cut through BSP leader Mayawati’s clout among the Dalit population and is well aware about the support the ruling SP has among the OBC communities. In view of these odds, the idea of naming any leader as a chief ministerial candidate sounds “illogical,” he said.", 
    "section": "national", 
    "title": "Congress in a fix over poll strategy in Uttar Pradesh", 
    "subsection": "general", 
    "date": "2016-03-10"
}