{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“I was spending sleepless nights receiving calls from Chief Ministers and Chief Secretaries [about one year ago] as they were panicky about non-availability of coal, but things changed… now nobody calls,” said an elated Anil Swarup, Union Coal Secretary, in Kolkata on Wednesday.\n\nWith increased production, import of coal has dropped 15 per cent, saving “Rs. 23,000 crore of foreign exchange”, Mr Swarup said. Coal India was now looking forward to 1-billion-tonne production by 2019-20, with a projected demand of around 1,200 million tonnes.\n\nCoal India lauded\n\nMr. Swarup profusely thanked the management of Coal India Limited, the public sector monolith, for the achievement.\n\n“Thanks to the management of Coal India for this miraculous achievement”, Mr. Swarup said.\n\nHowever, he may soon have sleepless nights again, but for different reasons. Coal India is having a pithead stock of over 45 million tonne, at a growth rate of nine per cent, and it is increasing by the day.\n\nAuctions on hold\n\nMr. Swarup, acknowledged, as he did in February during the Asian Mining Congress in Kolkata, that the Ministry was yet to finalise “nuances of the auctioning process” to facilitate fuel linkages to distribution companies.\n\n“Though the necessary ground work for auctioning of coal mines for private commercial mining is ready, we do not feel it is the right time to auction blocks on the basis of the government’s experience in the last round of auctions as well as improved coal supply situation in the country. It found no takers. The same applies for blocks for the power sector. We feel this situation will continue till as long as Coal India continues to produce at the current pace”, Mr. Swarup said.", 
    "section": "national", 
    "title": "Days of coal shortage over: Union Secretary", 
    "subsection": "general", 
    "date": "2016-03-10"
}