{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Gafoor being targeted, says Rabri Devi; Tej Pratap Yadav disapproves of the MLA’s jail visit\n\nWhile Lalu Prasad saw nothing wrong in the minister paying a visit to Shahabuddin in jail, his elder son and Health Minister, Tej Pratap (right), was critical of it.— PHOTO: PTI\n\nBihar Minority Affairs Minister and Rashtriya Janata Dal MLA Abdul Gafoor’s meeting with former RJD MP Mohammad Shahabuddin in a jail on March 6 has triggered discord in the family of party chief Lalu Prasad.\n\nWhile Mr. Prasad, along with his wife and younger son, defended the meeting, their elder son and Health Minister Tej Pratap disapproved of it. The Opposition BJP and its allies demanded the Minister’s resignation or dismissal from the Cabinet.\n\nOn Tuesday, when the photograph of the Minister along with another RJD MLA Harishankar Yadav meeting Mr. Shahabuddin in the Siwan jail, with snacks and other refreshments spread on a table went viral, Mr. Prasad said: “What is wrong in it? ... it was a normal courtesy.” The Minister himself declared the meeting a “courtesy call.” Charged in over 20 criminal cases and convicted in five others, the former RJD MP has been in jail for more than a decade.\n\nMr. Prasad’s wife Rabri Devi said: “The Minister is being targeted as he comes from the backward section, minority class … why don’t BJP leaders make hullabaloo when forward caste criminals meet people in jail?” Her younger son and Deputy CM, Tejaswi Yadav, said: “It is not an issue… even Priyanka Gandhi went to meet one of her father’s killers in jail.”\n\nBut, Tej Pratap Yadav, elder son of Mr. Prasad, was not amused. “He should not have gone to meet Shahabuddin. Even then, what was the need of getting photographed?” he asked.", 
    "section": "national", 
    "title": "Discord in Lalu family over RJD Minister meeting Shahabuddin", 
    "subsection": "general", 
    "date": "2016-03-10"
}