{
    "author": [
        "Bindu Shajan Perappadan"
    ], 
    "text": "The National Green Tribunal (NGT) which imposed a fine of Rs. 5 crore on Sri Sri Ravi Shankar’s Art of Living (AoL) Foundation on Wednesday, before giving the go-ahead for its World Culture Festival on the flood plains of the Yamuna, said it was unable to prohibit the event.\n\nPronouncing the verdict of the Bench, Justice Swatanter Kumar said: “For reason of delay and laches on the part of the applicant in approaching the Tribunal and for the reason of fait accompli capable of restoration and restitution, we are unable to grant the prayer of prohibitory order and a mandatory direction for removal of construction and restoration of the area in question to the applicant at this stage.’’\n\nThe Tribunal pointed out that the applicant had written to the Lt. Governor, Delhi in December last year but filed the present application in the Green Tribunal only on February 8 this year.\n\nComing down heavily on the AoL, the Tribunal stated that it had not obtained any permission as yet from the Delhi Police, Fire Department, Ministry of Water Resources, River Development and Ganga Rejuvenation. The AoL has been directed to obtain all required permissions. Justice Kumar noted that as per the documents on record “the flood plains have been drastically tampered with while destroying the natural flow of the river. Ramps, roads, compaction of earth, pontoon bridges and other semi-permanent or temporary structures have come up even without permission.’’\n\nHe said: “We hereby direct the Principal Committee constituted under the judgement, to submit a report within four weeks from today, in relation to the steps required to be taken for restoration, restitution and rejuvenation of the flood plains to its original status. It will also state the approximate cost that would be incurred for such restoration and restitution.’’\n\nPetitioner Manoj Misra of Yamuna Jiye Abhiyaan welcomed the order, stating that the direction clearly indicated that violations had taken place and that the court had viewed them seriously.\n\n“This is also a huge message to the government agencies and custodian of natural resources to ensure that they function properly. As for us appealing to the court late we accept it in all humility,’’ said Mr. Misra.\n\nEnvironmental activist Anand Arya rued that over 1000 acres of mostly marshland had been stripped.\n\n“The flood plains have been tampered with and the flow of the river destroyed.”", 
    "section": "national", 
    "title": "Foundation asked to get all clearances", 
    "subsection": "general", 
    "date": "2016-03-10"
}