{
    "author": [
        "Biju Govind"
    ], 
    "text": "Provisions in the Muslim Personal Law are against women, he said at a seminar early this week\n\nKemal Pasha had said that Muslim women were being deprived of their rights enshrined in Islam.\n\nRemarks by Justice B. Kemal Pasha, a sitting judge of the Kerala High Court, at a seminar in Kozhikode early this week on the Muslim Personal Law, have re-triggered discussions on Islamic Sharia, while sparking off vocal protests from Muslim organisations across the political and ideological divides.\n\nThe protesters have come out in unison against what they allege are attempts to amend the Muslim Personal Law, deeming it to be discriminatory against women. Justice Pasha, possibly in a jibe aimed at the religious outfits, had asked if Muslim men could have the privilege of four wives, why not Muslim women have four husbands.\n\nThe judge had also said that Muslim women were being deprived of the rights enshrined in Islam and that many provisions of the Muslim Personal Law were against women. As such, it was unfair to oppose the Uniform Civil Code (UCC). Even the Supreme Court was “reluctant” to interfere in the subject, Justice Pasha had observed.\n\nSuprabhatham , a Malayalam daily run by the Sunni group of the Samastha Kerala Jam Iyyathul Ulema identified with Islamic cleric E.K. Aboobacker Musaliar, in an editorial, lashed out at the judge’s remarks, saying that they would only strengthen the apologists of UCC.\n\nWhat Justice Pasha thinks about inheritance and divorce rights of women is not different from what the RSS conceives and it struck at the very existence of Muslims, it maintained.\n\nShaikh Muhammed Karakunnu, Assistant Ameer of Jamaate-e-Islamic Hind, Kerala, said Justice Pasha had touched upon two topics adopted by the Sharia. “Polygamy is very much inevitable at times considering the humanitarian factor. Who will marry a young widow whose husband died in the Kargil war or who has met with a fatal accident, and provide for their children,” he asked.\n\nHe said the paternity of a child cannot be decided if women had four husbands. Besides, inheritance in Islam is based on the idea that men are responsible for protecting women and children. It is the husband who pays maintenance to the wife after divorce, and not vice versa.\n\nKerala Naduvathul Mujahideen State president T.P. Abdulla Madani, general secretary P.P. Unneerkutty, and Kerala Jameyathul Ulama secretary M. Mohammed Moulavi warned that any attempts to dissect the Islamic Sharia through the prism of modernism would have far-reaching ramifications.\n\n“This is not for the first time Sharia has been subjected to such discussions. Time and again, these discussions have crossed limits,” they said.\n\nAccording to them, polyandry was unscientific and irreligious, while polygamy was scientific, religious and its objective is betterment of society.\n\n“Moves against Muslim Personal Law by people in responsible positions are a cause for concern. It has to be suspected whether the allegations raised against Sharia are part of the anti-Muslim movement,” they said.", 
    "section": "national", 
    "title": "Kerala HC judge’s remarks on Sharia draw ire", 
    "subsection": "general", 
    "date": "2016-03-10"
}