{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "The ruling Congress is facing more trouble in the appointment of the Karnataka Lokayukta as Governor Vajubhai R. Vala has sought clarifications from the government on the allotment of a residential plot in the Judicial Layout of the city to Justice S.R. Nayak, whose candidature has been recommended for the post.\n\nThe Janaadhikara Sangharsha Parishad (JSP), in a petition to the Governor, had alleged that Karnataka Law Commission Chairman Nayak flouted rules and secured the housing plot in the Judicial Layout, and urged him to take action ahead of taking a decision on clearing his name for the Lokayukta.\n\nSources in the Chief Minister’s office told The Hindu that the Governor has sought clarifications from the government on the allotment of the site to Justice Nayak.\n\nSince the beginning, the Opposition Bharatiya Janata Party had strongly opposed the candidature of Justice Nayak for the post, but Chief Minister Siddaramiah had gone ahead and suggested his name to the Governor.\n\nWhile the Governor has sought clarification from the government on a petition by the Janaadhikara Sangharsha Parishad (JSP) alleging that justice Nayak violated co-operative society by-laws before purchasing a site , Questions have also been raised over whether he can be appointed as Lokayukta despite having been Chairman of the Karnataka State Human Rights Commission.\n\nSome legal experts argue that according to the Human Rights Act, 1993, a person once appointed as Chairman of the Human Rights Commission, cannot be considered for any further employment by the Centre or the State.\n\nHowever, Justice Nayak is currently chairman of the State Law Commission and was appointed after his term in the Human Rights Commission came to an end.\n\nIt is learnt that the Governor had also sought the opinion of the Chief Justice on the candidature of Justice Nayak. However, officials in the Court and the Governor’s office refused to confirm if Justice Mukherjee had opposed Justice Nayak’s candidature. BJP members in the consultative committee to choose the Lokayukta had strongly argued for former Chief Justice of Karnataka High Court and retired Supreme Court judge Vikramjit Sen for the post.", 
    "section": "national", 
    "title": "Lokayukta candidate: Karnataka Governor seeks clarification", 
    "subsection": "general", 
    "date": "2016-03-10"
}