{
    "author": [], 
    "text": "The Lok Sabha on Wednesday passed a Bill to amend a 48-year-old law to guard against claims of succession or transfer of properties left by people who migrated to Pakistan and China after the wars.\n\nThe Enemy Property (Amendment and Validation) Bill, 2016, which amends the Enemy Property Act, 1968, was passed by voice vote amid the government’s assertion that the measure should not be seen from the prism of religion or caste.\n\nA demand by the Opposition for sending it to the Standing Committee of Parliament was turned down.\n\nReplying to a debate on the Bill, Home Minister Rajnath Singh said, “It does not pertain to Pakistan alone, but also to those Chinese who left India after the 1962 China-India War. Even their property comes under the ambit of this Bill.” In the wake of the India-Pakistan war of 1965 and 1971, there was migration of people from India to Pakistan and under the Defence of India Rules framed under the Defence of India Act. The government of India took over the properties and companies of such persons who had taken Pakistani nationality. These enemy properties were vested by the Union government in the Custodian of Enemy Property for India.\n\nThe amendments include that once an enemy property is vested in the Custodian, it shall continue to be vested in him as enemy property irrespective of whether the enemy, enemy subject or enemy firm has ceased to be an enemy due to reasons such as death. The new Bill ensures that the law of succession does not apply to enemy property; that there cannot be transfer of any property vested in the Custodian by an enemy or enemy subject or enemy firm and that the Custodian shall preserve the enemy property till it is disposed of in accordance with the Act. The amendments are aimed at plugging the loopholes in the Act to ensure that the enemy properties that have been vested in the Custodian remain so and do not revert to the enemy subject or firm. — PTI\n\nCentre turns down Opposition demand to refer the Bill\n\nto Standing Committee", 
    "section": "national", 
    "title": "LS passes Bill to amend Enemy Property Act", 
    "subsection": "general", 
    "date": "2016-03-10"
}