{
    "author": [], 
    "text": "Hindustan Unilever Ltd (HUL), which was facing a “class action litigation” from its former workers who were exposed to mercury vapour at its thermometer factory in Kodaikanal, has finally entered into a settlement to make “undisclosed” ex-gratia payments to the victims. The deal comprises future healthcare benefits for them as well.\n\nTerming the settlement as historical, R. Vaigai, counsel for the Pond’s HLL ex-Mercury Employees Welfare Association, said, “This is the first-ever class action litigation moved by industrial workers against occupational health exposure.”\n\nHighlighting the significance of the case, she said, “We had approached the court through a writ petition invoking Article 21, asking the Central and the State governments to protect the life and personal liberty of the workers. We had not moved a plea for compensation/damages.”\n\nNow in view of the settlement, a similar class action moved by the employees for damages before the High Court of London since the company is headquartered in United Kingdom will also be withdrawn, Ms. Vaigai said.\n\nAccording to a joint statement issued by the HUL and the employees association, the settlement has been entered into on humanitarian considerations to put an end to the long standing matter pending before the court for several years, in view of the suggestion of the Madras High Court.\n\n“We have worked hard over many years to address this and find the right solution for our former workers. We, alongside all involved, are glad to see an outcome to this long-standing case. The wellbeing of our employees and the communities in which we operate has and will always remain paramount. This agreement demonstrates our commitment to this,” Dev Bajpai, Executive Diector – Legal and Corporate Affairs said.\n\nS.A. Mahindra Babu, the president of the Pond’s HLL ex-Mercury Employees Welfare Association, said, “We welcome the actions taken by HUL to bring these negotiations to a satisfactory closure. We are pleased with all the terms of the agreement which will help to ensure the long-term health and well-being of the factory’s former workers. We now consider this issue to be fully resolved and have no more grievances against the company in this regard.”", 
    "section": "national", 
    "title": "Mercury poisoning: HUL, former staff sign settlement", 
    "subsection": "general", 
    "date": "2016-03-10"
}