{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Attorney-General Mukul Rohatgi told the Supreme Court on Wednesday that some “information” about industrialist Vijay Mallya’s assets was gathered from social media sites, and this showed his properties were mostly abroad. “Only a fraction is in India... maybe one-fifth,” he said.\n\n“Then how did you give these loans? Was there no secured assets on these loans?” asked Justice Kurian Joseph, who was on the Bench with Justice Rohinton Nariman.\n\nMr. Rohatgi, who appeared for the consortium of banks, replied that when the loans were granted, Kingfisher Airlines was a brand at its peak, with assets worth some thousand crores, and then “it crashed.” “We had some assets [as security] for the loans advanced,” he said.\n\nThe Bench issued notice to Mr. Mallya through his company United Breweries (Holdings) Limited, his counsel, the Indian High Commissioner at the U.K. and through his official Rajya Sabha email address.\n\nThe court sought a reply from him in two weeks and fixed the hearing for March 30. When Justice Kurian asked Mr. Rohatgi what was the guarantee that Mr. Mallya would be in the U.K. to receive the notice, Mr. Rohatgi replied: “He has tremendous assets there. We know he would be there... most likely.”\n\nThe banks moved the Supreme Court after the Karnataka High Court refused to pass an ex parte order against Mr. Mallya, the U.K.-based Diageo Plc and United Spirits Limited. They told the Supreme Court that the threat to their financial interests was immediate and grave.\n\nBefore moving the High Court, the banks filed four pleas before the Debt Recovery Tribunal in Bengaluru for immediate action such as freezing of Mr. Mallya’s passport, issuance of an arrest warrant and a garnishee order against Diageo Plc and United Spirits Limited from disbursing $75 million.\n\nFinal arguments on April 27\n\nA Delhi court on Wednesday fixed April 27 as the date for hearing final arguments in a two-decades-old case against the liquor baron.\n\n(With additional inputs from Nirnimesh Kumar)", 
    "section": "national", 
    "title": "Most of Mallya’s assets are abroad, says Attorney-General", 
    "subsection": "general", 
    "date": "2016-03-10"
}