{
    "author": [], 
    "text": "Uncharacteristically, he quoted Urdu poet Nida Fazli, asking for cooperation from the Opposition. Safar main dhoop toh hogi, jo chal sako to chalo, sabhi hain bheed main, tum bhi nikal sako toh chalo… [the sun’s harsh rays will be there, if you can, walk beside me, others are there too in the crowd, if you can come, walk beside me],” he said.\n\nHe dared Mr. Azad, referring to the amendment, to give one-third of Congress seats in polls to illiterate people. He quoted the former Prime Minister, Indira Gandhi, as saying: “There are some people who do the work, others who take the credit, let us strive to be the former,” in a jibe at Congress president Rahul Gandhi who claimed credit on Tuesday for the roll-back of the budget plan on EPF tax.\n\nAfter the Prime Minister’s speech, the Opposition sought clarifications. Vice-president Hamid Ansari said there was only one precedent for such a clarification. Mr. Ansari demitted the chair to vice-chairperson P.J. Kurien. By this time, Mr. Modi also left the House.\n\nWhen the Opposition moved the amendment, Leader of the House Arun Jaitley argued that the amendment could not be moved as it referred to an issue that was a State subject. “If we put this to vote, every State will have the right to move a resolution criticising the decisions made by Parliament,” he said.\n\nParliamentary Affairs Minister M. Venkaiah Naidu also pointed out that the right to contest elections was not a fundamental right, unlike the right to vote. He said the Centre had no role in the decision.\n\nDespite the government’s attempts, Mr. Kurien permitted the amendment as it did not refer to any State.\n\n“There is no mention of any State legislature. If there was a direct mention, we could have considered it in a different way,” he said, deciding to put the amendment to vote.", 
    "section": "national", 
    "title": "Opposition sees amendment through in Rajya Sabha, again", 
    "subsection": "general", 
    "date": "2016-03-10"
}