{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Action is in contrast to the NDA government’s ‘neighbourhood first’ diplomatic policy\n\nContrary to the NDA government’s “Neighbourhood First” diplomatic posture, the development assistance for all SAARC countries has been significantly reduced in the 2016-17 Budget. Except Pakistan, all other six members of SAARC receive significant financial assistance from India.\n\nThe slashing of the assistance to SAARC countries is in line with the cut in Budget to the Ministry of External Affairs this year that has fallen by about Rs. 500 crore, if one counts the allocation for the Ministry of Overseas Indian Affairs (MOIA) that was merged with the MEA this year.\n\n“We are at the Budget estimates stage where we have received Rs.500 crore less. We will, of course, continue with all our aid programmes for all the neighbouring countries, and if we do feel that we have need for additional funds, then at the revised estimates stage, we will seek those additional funds,” explained MEA spokesperson Vikas Swarup.\n\nBut the magnitude of the figures put out ((Notes on Demands for Grants No. 28/2016-17 for the Ministry of External Affairs) indicate the drop in development funds may not be something that can be covered up later in the year. Take a look at the numbers: Nepal that was hit by a major earthquake in 2015 was unable to use the full budget allocation of Rs. 420 crore last year, and saw its revised estimate fall to Rs. 300 crore.\n\nDespite the expectation that Nepal will need increased assistance as it begins its reconstruction programme this year, the allocation has seen a drop of 28.6%. Sri Lanka and the Maldives have seen cuts of 54% and 78.1% compared with the previous year. And even the countries with the lowest GDP, Afghanistan and Bhutan, saw cuts this year of 23% and 10.8% respectively.\n\nWhen asked, senior officials admitted to The Hindu that allocations had dropped, but for different reasons in each case, and expressed the hope that they would be increased when revised estimates would be in September-October 2016. Officials also denied reports in Nepal papers that the drop in aid was related to the strain in ties between New Delhi and Kathmandu that hit their worst patch in decades over the border blockade last year.\n\nMany projects over\n\nSimilarly, officials handling the other SAARC countries said that many projects that were started between 2005-2010 had been completed or were nearing completion and needed less assistance. For example, in Afghanistan, the Rs. 969-crore Parliament building that was completed and inaugurated by Prime Minister Narendra Modi in 2015, was started in 2009; the Salma hydel power project was nearing completion, and no new big projects had been announced.\n\nIn Bhutan, hydel projects such as Punatsangchhu I and II or the massive 720 MW Mangdechu were in the preliminary stages of progress, and hence, India’s assistance had not yet been raised. Bhutan accounts for over 70% of India’s foreign assistance.\n\nThe government also pointed out that in the case of Bangladesh, with a 40% cut, lines of credit at concessional rates had replaced direct development assistance. As of this year, India has extended an $862-million line of credit, while another $2 billion is in the pipeline.\n\n“We are not really worried about the drop in aid,” former Bangladesh High Commissioner Tariq Karim said, explaining that lines of credit gave the country more freedom to choose its own projects, adding, “But while Bangladesh has a well-managed economy, poorer countries in the region may be hit hard.”\n\nOn Maldives and Sri Lanka, officials denied that the Budget figures indicated a final figure. “We are yet to draw up our plans for Maldives and Sri Lanka this year, and so the revised estimates will be more accurate,” an MEA official dealing with the two countries said.\n\nThe one exception to the Budget proposals is Myanmar (not a SAARC nation), and saw a major 48% increase in development aid, due to the government’s focus on the Kaladan multi-mode transport corridor project, as well as the ‘Trilateral Highway’ project.\n\n“The Modi government has adopted a different approach which looks at all assistance as part of Development Compact”, says Sachin Chaturvedi, director general of the MEA-run think tank RIS (Research and Information Systems for Developing Countries), which itself got an increase to Rs.5.86 crore in the current Budget.\n\nMr. Chaturvedi claims that capacity building, lines of credit, bilateral trade, technology transfers, loans and direct grants would all be counted together to show India’s development aid to its neighbours and other countries. While the new accounting system will take a few years to implement, the Modi government may have to face more criticism from its neighbours over the allocations in the more immediate future, with a cut in aid to SAARC nations between 2015-16 and 2016-17 totalling a whopping 17.8% overall.", 
    "section": "national", 
    "title": "Sharp drop in aid to SAARC nations", 
    "subsection": "general", 
    "date": "2016-03-10"
}