{
    "author": [
        "Sathish G T"
    ], 
    "text": "Three elephants, separated from their herd, were spotted in Salagame hobli\n\nForest Department officials are using drone camera to monitor movement of tuskers that have caused panic in villages of Hassan taluk.— Photo: By Arrangement\n\nThe Forest Department officers in Hassan are now depending on drones to track the movement of elephants causing trouble in human habitats.\n\nOn Tuesday, the officers used a camera to trace the movement of three tuskers that have caused panic in villages of Salagame hobli in Hassan taluk for a week now.\n\nThe camera was in the air for about 75 minutes surveying nearly 8 sq kms of area. The three tuskers, separated from their herd, were spotted in villages of Salagame hobli last week. They visited farmlands and damaged standing crops, forcing farmers to stage a protest demanding compensation.\n\nResidents of Chakenahalli, Kelavarthi, Haruvanahalli and surrounding villages are in shock. They stay indoors in the evening hours, fearing elephant attacks.\n\nThe department has set up a camp and also brought two tamed elephants to assist in the operation. “On Monday night, the tuskers actually came close to our camp where the tamed elephants were tied up. We are trying to locate them with the help of drone cameras now,” said Ravindra Kumar, Assistant Conservator of Forests.\n\nThe officer consulted a friend in Mysore, who had a drone camera and asked him to assist in the operation. “The camera attached to a drone can go up to 150-200 metres high from the surface level. We covered an area of nearly 8 sq kms with the help of the camera. So far, we have not spotted them,” he said.\n\nThe drone cameras are best used in keeping a track of animals in forests of open canopy.\n\nFearing elephant attacks, villagers have been staying indoors in the evenings", 
    "section": "national", 
    "title": "Tusker trouble: drones to the rescue in Hassan", 
    "subsection": "general", 
    "date": "2016-03-10"
}