{
    "author": [], 
    "text": "Uttar Pradesh Governor Ram Naik on Wednesday asked for the unedited CD and transcript of senior Minister Azam Khan’s speech in the State Legislature in which the latter allegedly accused Naik of working under the “influence of a party”. “Taking cognisance of newspaper reports about remarks on him by Parliamentary Affairs Minister Azam Khan and others, including Speaker on Tuesday in the House, the Governor has written to Speaker Mata Prasad Pandey asking him to provide its unedited printed copies and audio and video CD at the earliest,” a Raj Bhawan release said here. The Governor in his letter said Mr Khan and other members have referred to U.P. Nagar Nigam Amendment Bill 2015 in the House, which he wanted to “read and see”.\n\nMr Khan has been engaged in a war of words with Mr Naik for some time, with the Samajwadi Party leader accusing him of being a “kar sevak” and “communally vitiating” the atmosphere in Uttar Pradesh at the behest of the Modi government at the Centre. While sticking to his earlier statement that he is an RSS volunteer, Mr Naik maintained that there was mutual cooperation between him and the Uttar Pradesh government and that his focus was on the development of the most populous State in the country. In a scathing four-page letter to the Governor last month, Mr Khan had accused him of adopting a negative approach to him and claimed that he was receiving threats because of Naik’s statements. Mr Khan even said he would raise the issue with President Pranab Mukherjee.\n\nMr Khan had on Tuesday accused the Governor of stalling several Bills by not giving his assent and alleged it was giving an impression that he was working under the “influence of a party”.\n\n“A Bill (UP Nagar Nigam Amendment Bill 2015) is pending with the Governor for over one year through which Mayors could be removed for financial irregularities. The Governor has stalled the Bill giving an impression that he is working under influence of a party,” Mr Khan had said in the State Legislature. Assent was not given to the Bill so that mayors could not be punished for their “dishonesty”, Mr Khan had alleged. - PTI", 
    "section": "national", 
    "title": "UP Governor peeved over Azam’s comment", 
    "subsection": "general", 
    "date": "2016-03-10"
}