{
    "author": [
        "Lisa Barnwell"
    ], 
    "text": "Their multi-tasking ability and emotional resilience brings benefits to the workplace\n\nMothers learn to dig deep and carry on in the most trying of circumstances, a skill that is transferrable to the workplace.— Photo: AFP\n\nWhen women become mothers, one of their biggest fears is that they will lose themselves. Rather than seeing pregnancy and birth as a learning experience or a series of opportunities, women often feel they have to prove that nothing has changed. That they’re still exactly the same person they were before having a child.\n\nFor working women, this leads to two scenarios: either new mothers rush to return to the workplace and back to their familiar corporate persona, battling privately with how to bring their new mother self into the equation. Or they feel that they no longer fit, so they decide not to return.\n\nDon’t lose talent\n\nFor years, businesses just accepted this as fact. But recently there has been a growing awareness that losing the talent you’ve cherry-picked and nurtured is not a great way to manage, and not great for business.\n\nMost managers want to do the right thing and support new mothers but they’re so often paranoid about saying the wrong thing that they say nothing at all or completely put their foot in it. From boardroom meetings to overheard tube conversations, the assumption is that when a woman falls pregnant, her career rise is over.\n\nIn celebration of working mothers and mothers-to-be, here are three clear advantages that mothers have over their male and female counterparts: They have the ability to multi-task like a ninja.\n\nA mother’s time is precious like never before. Gone are the hours spent thinking and debating, in its place a laser focus and commitment to output rather than hours. Most working mothers are carrying around the schedules of several people in their head and are managing the emotions and expectations of both their team and their growing family. As she’s committed to being out the door at 5 p.m. and notices her productively rises when she is personally fulfilled, she also approves of her team having the same opportunities, resulting in better work/life balance for everyone.\n\n“Baby brain” actually works in their favour.\n\nThe pregnancy brain is not a myth but it is not a negative change that occurs. Pregnant women show increased activity in the right side of the brain, the area related to emotional skills as they prepare to bond with their babies.\n\nThis gift from Mother Nature may have been designed to help women connect more intuitively to their newborn but these skills are transferrable to business. Women are known for having a talent for creating tight-knit, loyal teams. The ability to listen, nurture the ideas of others and leading through collaboration are all 21st century leadership traits.\n\nObstetrician Dr. Amali Lokugamage discovered the positive changes that pregnancy brought to her work first-hand, writing about the benefits and insights this provided to her medical practice and scientific knowledge.\n\nThey have an inner strength that could floor Ronda Rousey. Giving birth is not for the faint-hearted, the first few weeks and months are challenging beyond belief. Even the smoothest birth is testing and most women go through an untold amount of challenges to their self-esteem, beliefs and ego. A newborn doesn’t care that you secured a million dollar deal last month or led a team to success. Mothers learn to dig deep and carry on in the most trying of circumstances.\n\nFathers pick up same skills\n\nIt’s not to say that new fathers don’t acquire many of these skills or that men and women who are child-free are not effective. A report showed that a father’s emotional response to his baby is as powerful as the mothers. If men stepped back from their careers and stepped into the role of primary caregiver for the same period as women, they too could return with these super powers.\n\nBusinesses have a huge opportunity available to them.\n\nCompanies with more women leaders are more profitable. So, the only question to ask is what’s stopping them from harnessing this natural resource to ensure mothers are as welcome at the boardroom table as the changing table? — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Why hiring mothers makes good business sense", 
    "subsection": "general", 
    "date": "2016-03-10"
}