{
    "author": [], 
    "text": "About 220 persons who had registered for donating their eyes were issued identity cards by District Collector K.S. Palanisamy on Tuesday. Mr. Palanisamy appealed to the people to come forward to donate their eyes as there was huge demand. The corneas of the dead have to be harvested within six hours from death and on information teams from the eye bank would visit the place of the donor to carry out the harvest. A toll-free number for eye donation has been set up in the district and people can call 18004251465. Those who come forward to donate their eyes can register their names at the District Blindness Control Society office at the Mahatma Gandhi Memorial Government Hospital in the city by submitting the requisite form. More details can be had by calling 2770040 or 2771465/6/7, he said.\n\n‘Rename Lawsons\n\nRoad after Saravanan’\n\nThe Major Saravanan Memorial Trust has appealed to the State government to rename the Royal Road and Lawsons Road after Major Saravanan, who died in the Kargil war in 1999. In a representation to the Chief Minister, founder of the trust M. Amirthavalli pointed out that her son Major Saravanan was martyred in Operation Vijay and was called the Hero of Batalik. She appealed for naming the road as Major Saravanan Salai to inspire the youth and imbibe in them the spirit of selfless sacrifice and patriotism.\n\nDisabled get jobs\n\nin Chennai Hotel\n\nThirty differently abled persons who underwent a free training in catering under the auspices of the Department of Differently Abled Welfare at the Oxford Institute of Hotel Management in the district have received job offers at Hotel Anjappar in Chennai. District Collector K.S. Palanisamy issued the appointment orders to the persons on Tuesday. In a press release, Mr. Palanisamy said differently abled persons interested in undergoing the training during 2016-17 can apply to the District Differently Abled Welfare Officer.", 
    "section": "national", 
    "title": "220 pledge their eyes, given cards", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}