{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The 45th Army Postal Service Corps Day was celebrated at Tuticorin Head Post Office on Tuesday. During the programme, retired Army Postal service (APS) personnel shared their memories.\n\nThe participants paid tributes to Brig. D.S. Virk, AVSM, founder of Indian Army Postal Service Corps. The APS was recognised as a separate Corps on March 1, 1972, and the Brigadier was its head till June 30, 1973, Lt. Col. (Retd) M. Sundaram, who organised the programme, said.\n\nThe APS is the only army unit where civilian officers from the Department of Post on deputation donned army uniform and served as combatants. , Mr. Sundaram said that postal covers were printed on army, navy and air force and paramilitary forces in India. . The retired Colonel displayed a collection of his rare stamps and other memorabilia for people to view.\n\nBesides, commemorative postage stamps, first day covers (FDC), special covers and miniature stamps and foreign stamps were also displayed. Special covers on International Control Commission (ICC) established in Combodia, Laos and Vietnam in August 1954, on bidding adieu to ICG Ship ‘Ahalyabai’ at Thoothukudi, Sawerpuram village settlement bi-centenary celebration, FDC on freedom fighter V.O. Chidambaram Pillai, Bishop Caldwell and Our Lady of Snows Shrine Basilica attracted the attention of the visitors.\n\nThe stamps recalled the contributions of freedom fighters and revealed the history of Thoothukudi. Stamps on ‘Salt Satyagraha,’ Army Medical Services, Army Postal Services and valiant deeds of the Indian Navy were also on display.\n\nThe world’s first khadi (cloth) postage stamp on Mahatma Gandhi, issued by India Post, attracted the attention of many visitors.\n\nStudents from various schools visited this philatelic exhibition and enjoyed seeing the pictorial stamps of depicting India’s social, cultural, and scientific development.\n\nLt. Col. George Mathew, Officer Commanding NCC (Army), Lt. Cdr. Ravi Raman, OC NCC (Navy), Wing Cdr. V. Rajagopal (Retd), Officer (in-charge) Ex-servicemen Contributory Health Scheme Polyclinic, Capt Rajaji (Retd), Manager, Canteen Store Depot, Senior Superintendents of Post Offices R. Raj (Thoothukudi), Ramasamy (Kovilpatti), Assistants to Postmaster General Edwin Alexander, Joseph Arulraj and Pitchaiah, Postmaster of Thoothukudi Head Post Office A. Ramachandran and Marketing Executive Shankarkumar were present.", 
    "section": "national", 
    "title": "45th Army Postal Service Corps Day celebrated", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}