{
    "author": [], 
    "text": "The number of calls they get regarding huts on fire soars during the period between April and July\n\nSummer is the most demanding season of the year for firemen, who have to be on their toes to attend to calls from areas dotted with thatched huts.\n\nA senior official of the Tamil Nadu Fire and Rescue Services Department said the number of fire calls they get from areas with a lot of hutments increases during summer. Most fire breaks are due to electrical short circuits, while gas leaks from cylinders are another important cause. To rush to the rescue, firemen work without a break between April and July.Firemen say they have drawn out a plan to patrol hutments between noon and 3 p.m. – the period when most such incidents occur. Earlier, fire tenders were parked near select hutment areas but this proved ineffective. In the event of a fire elsewhere, they found it very difficult to despatch these vehicles on time. Hence, they decided to take up intensive patrolling in not only hutment areas but also other places to create awareness about measures to be taken to prevent fire accidents.\n\nThe fire tenders and other vehicles are being serviced to be ready for deployment.\n\nThe presence of policemen alone is not enough to prevent crime. Better use of technology is needed too. Realising this need, the T. Nagar police have resorted to installing closed circuit television cameras in a number of places.\n\nA police team conducted a comprehensive study of the streets that are prone to crime. “After identifying the locations, we installed 1,300 CCTV cameras in South Usman Road and K.K. Nagar. We have installed over 9,000 cameras in banks and other establishments whose footage we use when needed,” says a senior police officer.\n\nAll these cameras are being monitored by personnel at Mambalam police station. “Recently, a youth was found dead in M.G.R. Nagar. When we checked the camera in the locality, we found he had fallen from a building. But for the footage from the cameras, we would have suspected foul play. Similarly, it was due to video footage that we were able to nab a gang that specialised in robbing people after diverting their attention,” the officer adds.\n\n(Reporting by R. Srikanth and Vivek Narayanan)", 
    "section": "national", 
    "title": "A long, busy summer looms for firemen", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}