{
    "author": [
        "Staff Reporter"
    ], 
    "text": "While coronary artery bypass surgery (CABG), colloquially referred to as heart bypass, remained the commonly used option for treating Chronic Total Occlusion (CTO), doctors at Apollo Speciality Hospitals here said that the non-surgical angioplasty procedure is increasingly being used to treat the condition due to its advantages.\n\nCTO refers to the total blockage of a coronary artery which may result in a heart attack. Interacting with media during a workshop by two Japanese doctors for the doctors at Apollo, C. Vivek Bose, a doctor at Apollo, said, “While angioplasty is commonly used for partial blocks, using it to treat CTO is a high skilled procedure involving high-end machinery. However, it is becoming more popular now.”\n\nP. Shankar, another doctor, pointed out that Japan has always been a leading country in using angioplasty for CTO. “There is a cultural reason. The Japanese believe that once an open heart surgery is performed, the spirit of the person leaves the body. So they have traditionally preferred angioplasty,” he said.\n\nS.K.P. Karuppiah, another doctor, said that angioplasty for CTOs will be a boon for patients who cannot undergo bypass surgery due to other medical ailments like renal failure.\n\nHighlighting that Apollo Specialty Hospitals has already been doing angioplasty procedures for CTOs, Rohini Sridhar, Chief Operating Officer, said that the purpose of the workshop was to further improve the skills of the doctors by working together with the better experienced Japanese doctors.\n\nDr. Fumitaka Hosaka, Cardiologist, Okamura Memorial Hospital, and Dr. Masanori Teramura, Chief Cardiologist, Ichinomiya Nishi Hospital in Japan, had come for the workshop.\n\nThe two doctors along with the team of doctors from Apollo will be treating five patients during the workshop.", 
    "section": "national", 
    "title": "Angioplasty for treating CTO gains momentum", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}