{
    "author": [
        "Deepa H"
    ], 
    "text": "The flyover is one of the two being constructed at a cost of Rs. 117 crore at the intersection of Poonamallee High Road and Anna Nagar 3{+r}{+d}Avenue —Photo: R. Ragu\n\nChief Minister Jayalalithaa on Tuesday inaugurated the Rs. 35-crore flyover that takes off on Poonamallee High Road and lands on Nelson Manickam Road.\n\nWith this, motorists travelling from the Anna Nagar Arch and Koyambedu side to Nelson Manickam Road and beyond need no longer wait for the signal. Soon after the inauguration through video conferencing, traffic was allowed on the two-lane, uni-direction 361-metre-long flyover.\n\nN. Kumar, who works in Anna Nagar, hoped that the remaining portions of the flyover would be completed soon.\n\n“We also hope that the bus shelters that were removed for the flyover on Poonamallee High Road would be restored,” he said. Sources in the department said that eight spans of the other sections are expected to be constructed by September.\n\nThis flyover is one of the two L-shaped flyovers that are being constructed at a cost of Rs. 117 crore at the intersection of Poonamallee High Road and Anna Nagar 3{+r}{+d}Avenue. The design of the flyover, work on which began in June 2011, was changed in November 2012 after the State government decided to retain the twin Anna Arches.\n\n“Originally, the proposal was to demolish them and construct similar arches further, inside 3{+r}{+d}Avenue. But, the government instead chose to retain the arches and change the design of the flyover,” said a source in the Highways Department.\n\nThe arches were constructed to commemorate the platinum jubilee celebrations of former Chief Minister C. N. Annadurai and inaugurated by the then Chief Minister M. G. Ramachandran on January 1, 1986. On Tuesday, Ms. Jayalalithaa also inaugurated other works including a bridge at Kunnapatti in Kancheepuram district and laid the foundation for works totaling Rs. 1,354.78 crore including the six-laning of Vandalur to Walajabad road.", 
    "section": "national", 
    "title": "Anna Arch flyover opened for traffic", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}