{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu government on Monday launched a broadband service, ‘Arasu Fibre’, through the Arasu Cable TV Corporation Ltd (TACTV).\n\nThe service aimed at reaching every household in the State became the latest entrant in the fast growing broadband internet segment in Tamil Nadu. Vodafone will provide the bandwidth to Arasu Cable.\n\nChief Minister Jayalalithaa launched the service through a video conference.\n\n‘Arasu Fibre’ aims to provide broadband plans ranging between Rs. 299 and Rs. 899 with speeds of 2 Mbps and 4 Mbps. BSNL, Airtel, RailTel and ACT already provide broadband services in the State.\n\nLast year, Arasu Cable Corporation received an ISP license from the Ministry of Telecom, enabling it to offer broadband services. The service will be delivered to its consumers through cable operators.\n\nArasu Cable floated a tender for companies to provide bandwidth for the service. “Vodafone became the successful bidder and the work order has been issued to them. Arasu Cable will be paying them per Mbps used,” a State government official told The Hindu .\n\nThe cable corporation will use the control rooms set up in 32 districts for providing cable television.\n\n“Vodafone has terminated their bandwidth at these control rooms. Depending on the population and an estimated requirement, Arasu Cable has sought various Mbps/Gb requirements in each district. The bandwidth can be up scaled as and when required,” the official, who did not wish to be named, said.\n\n“As of now, 1,100 connections are live. These were mainly used for testing,” the official said. Arasu Cable will also invite cable operators to sign up for providing the ISP service on Tuesday.\n\n“When a preliminary survey was done by Arasu Cable, about 8,000 cable operators were ready to sign up. More operators are expected to join,” the official added.\n\nThe revenue will be shared by Arasu Cable, which is the ISP holder, the aggregator and the last-mile cable operators.", 
    "section": "national", 
    "title": "‘Arasu Fibre’ rolls out internet scheme in State", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}