{
    "author": [
        "Staff Reporter", 
        "M K"
    ], 
    "text": "Passport mela on Saturday\n\nThe Regional Passport Office in Coimbatore will be conducting a passport mela at the Passport Seva Kendra on Avanashi Road on Saturday. Regional Passport Officer S. Sasikumar said that residents of Coimbatore, Salem, Erode, Namakkal, Tirupur and The Nilgiris can make use of this opportunity.\n\nApplicants who have registered applications online atwww.passportindia.gov.inand obtained valid ARN can take appointment for the mela on Saturday and approach the Seva Kendra on the scheduled time. Registering applications for appointments for the mela was opened on Tuesday. Passports will be issued to applicants after police verification and other internal clearance.\n\nTatkal, police clearance certificate and walk-in applications will not be accepted on that day.\n\nGrievances redress\n\nSuperintending Engineer of Tamil Nadu Generation and Distribution Corporation, Coimbatore North, will conduct a grievances redress meeting on March 2 at 11 a.m. at the office of the executive engineer, K. Vadamadurai, according to a press release.\n\nAgreement signed\n\nCoimbatore District Small Industries’ Association has signed a Memorandum of Understanding with Sri Ramakrishna Advanced Training Institute, focusing on skill development in the fields of welding and plumbing for workers of the member units of the association.\n\nThe institute will customise the training programme\n\nfor the benefit of the industries.\n\nThere are also plans to\n\ntake up research by the\n\ntwo organisations in the fields of welding and plumbing.\n\nCODISSIA and Sri Ramakrishna Hospital\n\nhave also signed an MoU\n\nfor treating all the\n\nemployees and family members of the association at a concessional rate.\n\nThis MoU was signed\n\nby R. Vijayakumhar, managing trustee of\n\nSNR Sons Charitable Trust and E. K. Ponnuswamy, president of CODISSIA recently.", 
    "section": "national", 
    "title": "Briefly (Two Items)", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}