{
    "author": [
        "S Poorvaja"
    ], 
    "text": "As many as 13,814 candidates of Standard XII from Central Board of Secondary Education (CBSE) schools from across Tamil Nadu started writing the examinations on Tuesday. Students of standard 10{+t}{+h}, among whom a few had gone in for optional papers including tourism, too started taking their examinations.\n\nEnglish teachers of CBSE schools said that the paper was a standard one. “The paper wasn’t an easy one but the students said that they were able to attempt all questions. The comprehension passage in particular was interesting when compared to what the students were given last year,” said Anuradha Raman, English teacher from Bala Vidya Mandir.\n\nThough students like N. Bharati were initially apprehensive of how long it would take for them to finish the paper, most of them were able to finish it with ten minutes to spare and go through their answers as well.\n\nBeing the first exam, parents lined up outside examination centres to drop off their wards and offer moral support. A sea of parents and teachers was present at Chettinad Vidyashram School in Chennai, which housed around 555 students from 8 CBSE schools in the city, one of the largest examination centres. Outside most venues, parents lined up from as early as 8.30 a.m. and students were seated in their examination halls by 9.30 a.m.\n\nN. Vijay, who had come to drop off his daughter said it was a good decision to start the board exams with that English language. “Being a student of the science group, she is extremely worried about her Physics and Mathematics papers and having a relatively simpler paper first will help ease their pressure and give the students confidence,” he said. S. Amudha Lakshmi, principal of Chettinad Vidyashram, said the students found the paper to be straightforward. “It is a good start to the exams,” she said.\n\nThe school would be accommodating 652 students on Wednesday for the Class X science board examination.\n\nIn Coimbatore, as many as 3,700-odd students of Class XII and X appeared for the Central Board of Secondary Education examinations from over 20 schools in the city and district at seven examination centres.\n\n( with inputs from V.S.Palaniappan and Pon Vasanth Arunachalam )", 
    "section": "national", 
    "title": "CBSE XII, X exams off to smooth start", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}