{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Navalpakkam Narasimhan, Visranthi Mudhiyor Illam, Palavakkam, 3.45 p.m.; Nagai Mukundan, Gangai Kanda Mandapam, Triplicane, 7 p.m.\n\nGita: Satyavratananda Saraswati, Mylapore Club, Luz Church Rd., Mylapore, 11 a.m.\n\nThirupugazh: Mathivannan, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.\n\nJeevanmukti Vivekam: K.S. Maheswaran, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy Rd., Abhiramapuram, 5 p.m.\n\nGuru Mahimai: P. Swaminathan, D.K. Subamangala Maaligai, Baba Nagar, Villivakkam, 6.30 p.m.\n\nDevi Mahatmyam: Suprajananda, Ramakrishna Math, Mylapore, 8 a.m.\n\nVedanta Treatise: R. Aravindan, C Flat, Harmony, 20/39, Venkatarathinam Nagar, Adyar, 6.45 p.m.\n\nGENERAL\n\nIndo-Australian Chamber of Commerce: Interactive meeting on ‘University Partnerships in the IT Industry – an Indo-Australian Perspective’, Hotel Accord Metropolitan, 4.30 p.m.\n\nDr. Mohan’s Diabetes Specialities Centre: Presentation of the 25{+t}{+h}DMDSC Gold Metal Oration Award, Savera Hotel, 7.15 p.m.\n\nDepartment of Journalism and Communication – University of Madras and Madras Union of Journalists: Seminar on ‘Contemporary Tamil Journalism … Issues and Challenges’, Tower Clock Building, Chepauk, 10.30 a.m.\n\nSri Vishnu Mohan Foundation: Inauguration of seminar on ‘Peace and Reconciliation: Perspectives from Religion and Philosophy’, 7/15, New Giri Rd., T. Nagar, 10 a.m.\n\nThe Tamil Chamber of Commerce: Budget analysis meeting, Hotel Ambassador Pallava, 6.30 p.m.\n\nValliammai Engineering College: Math Fest 2k16 programme, Kattankulathur, 10.30 a.m.\n\nDMI Engineering College: Campus recruitment drive, Palanchur, 10 a.m.\n\nJ.N.N. Institute of Engineering: Annual day and Sports day, Kannigaipair, 10 a.m.\n\nDr. Ambedkar Academy The People’s Educational Trust: Discussion on ‘Economic development of Dalits’, L-73, Kavery Colony, 24{+t}{+h}St., Anna Nagar East, 6.30 p.m.\n\nKrishna Sweets: Programme on Deiveega Kaveearangam, Bharatiya Vidya Bhavan, Mylapore, 6 p.m.\n\nNarcotics Anonymous: Meeting, Staying Clean Group, St. Lourdes Church, Don Bosco School, Perambur, 7 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Kondithope, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Mandram, Ashok Nagar; The Lady of the Light Church, Luz, Mylapore; Jacob MHSS., Judges Colony, Periakuppam, Thiruvallur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Loyola MHSS., United India Colony, Kodambakkam; St. Lukes Church, Anna Nagar; Anglo Indian Association, Ponniyamman Koil St., Egmore; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Rd., Velachery; Kondithope Community Centre, Police Quarters, Waltax Rd.; St. Mathias Church, Kamarajar Salai, K.K. Nagar; C.S.I. Church, Moolakadai; and The Lady of the Light Church, Luz Church Rd., Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}