{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Heads admit that there are difficulties in getting water to their campus\n\n“My daughter will not drink water on her school days as she may have to use the toilet, which is not clean, or has no water,” This was how a parent responded when asked about cleanliness of toilets in schools run by the Madurai Corporation.\n\nWhen the Corporation claims to implement various initiatives to keep the city clean and green as part of Swachh Bharat mission, cleanliness of some of its schools leaves much to be desired.\n\nOfficials in the Education department of the Corporation of Madurai said that there are 16,852 students (boys and girls) studying in 26 elementary, 15 higher secondary, 14 middle and 9 high schools spread over different parts of the city. Only two schools functioned in private buildings, while the rest had their own, they added.\n\nInfrastructural facilities are available in all the 64 schools. But, the point to be noted is lack of upkeep that has led to cracks in the delivery mechanism. For instance, there are over head tanks in schools which do not have water in the bore-well. However, absence of periodic maintenance of these tanks and irregular supply of water through lorries have made toilets smelly. When The Hindu team visited some of the schools and interacted with the heads , they admitted that there were difficulties in getting water to their campus. “We have been managing so far without much trouble. Sometimes, we look for assistance from the ward councillor or the local Assistant Engineer, who would coordinate in getting water,” they said.\n\nThough there are bore-wells in schools, either there is very little water or they have gone dry. As for cleaning the campus, the Corporation has outsourced a private contractor for the purpose. According to officials, 88 conservancy workers are entrusted with the task of cleaning the school campuses daily and provide potable water. For middle schools, each class is given a pot of water. On an average, a child has to drink one litre of water and the OH tanks have capacity ranging from 1000 to 1500 litres.\n\nThe officials said that a team from the Government of India recently inspected some of the Corporation schools, including the EVR Nagammai Girls Higher Secondary School on South Veli Street and appreciated the cleanliness initiatives.\n\nPro-active councillors\n\nWherever the councillors were pro-active, the schools in their jurisdiction had very little problems. For example, a middle school at Villapuram on Velu Pillai Lane, which functions in a private building, has over 200 children studying in class 1 to 8.\n\nSpeaking to The Hindu , councillor Chellam (CPI-M) said that she had constructed a separate overhead tank from which water could be used for cleaning toilets. There is a separate toilet for the staff members as well.\n\nHowever, some of the higher secondary schools did not enjoy this luxury, especially the girls schools, a teacher said.\n\n“It is a fact that students in our school hesitate to use toilets. Either there is no water or it is not clean,” the teacher admitted.\n\nAs for the boys, there was no problem as they used toilets even if they were unclean or there was no water. A doctor, who was part of a screening team which conducted a medical camp in Corporation schools recently, said that girl students had confessed to not using toilets as they were unclean.\n\n“By not drinking enough water, girl students may experience problems such as dehydration, especially during summer. In the event of using unclean toilets, they may be exposed to infections, which looks common,” the doctor added.\n\nSimilarly, many students ate eatables sold outside the school campuses by roadside vendors, which were highly unhygienic.\n\nVerandah as classrooms\n\nWith shortage of space in a couple of higher secondary schools, the teachers use the verandah or the space under the trees as classrooms inconveniencing the students.\n\nDespite the shortcomings, teachers are upbeat about the results in public examinations even as they conduct special classes after school hours for slow learners.\n\nThe officials maintained that they gave their best for the education of the poor and, among the Corporation-run schools in Tamil Nadu, Madurai schools emerged on top in last year’s public examinations. But, campus cleanliness, especially of toilets, is far from satisfactory.", 
    "section": "national", 
    "title": "Cleanliness in most Corporation schools leaves a lot to be desired", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}