{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ondiveeran monument established at a cost of Rs. 64 lakh opened\n\nCollector M. Karunakaran paying respect to Ondiveeran statue installed at the monument in Palayamkottai which was inaugurated by Chief Minister Jayalalitha through video-conferencing on Tuesday.— Photo: A. Shaikmohideen\n\nChief Minister Jayalalithaa inaugurated lithotripsy facility at Tirunelveli Medical College Hospital (TVMCH) here on Tuesday through videoconferencing.\n\nIt is a treatment that uses ultrasound shock waves to break kidney stone or other calculus into small particles that can be passed out by the body. Since it avoids surgical procedure, there will be no blood loss. The Rs. 2.75 crore-facility is likely to be benefit over 150 patients a month.\n\nCollector M. Karunakaran, Dean of TVMCH K. Sithy Athiya Munavarah and others participated in the inaugural function.\n\nMs. Jayalalithaa also inaugurated Ondiveeran monument at Palayamkottai through videoconferencing. As the monument, established on an outlay of Rs. 64 lakh, was inaugurated, Dr. Karunakaran and chairman of Tamil Nadu Housing Board Murugaiah Pandian garlanded the martyr’s statue.\n\nThe moment the Collector and other government officials entered the monument, a group of people led by Naagai Thiruvalluvan of ‘Thamizh Puligal’ also entered the memorial with slogans hailing Ondiveeran that led to a brief commotion there.\n\nMr. Thiruvalluvan said the monument had been built only on 170.90 square metres though 725.56 square metres of land had been acquired. “The unused land should be fenced and protected from being encroached upon,” he said. One Arumugam from Nerkattumseval, the birthplace of Ondiveeran, said the descendants of the martyr, who were living in abject poverty, had migrated to neighbouring Kerala in search of employment.\n\n“Barring the 50 families, other descendants of Ondiveeran have settled down in Kerala and gather at Nerkattumseval only on his death anniversary. Apart from providing employment to us, the State Government should give us free houses,” Mr. Arumugam said.", 
    "section": "national", 
    "title": "CM inaugurates lithotripsy facility at Tirunelveli hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}