{
    "author": [
        "C Jaisankar"
    ], 
    "text": "A team from MCI is likely to visit the college in Pudukottai in December\n\nChief Minister Jayalalithaa on Tuesday laid the foundation stone for the government medical colleges in Karur and Pudukottai through video conferencing.\n\nThe college in Karur will come up at Sanapiratti at a cost of Rs. 229.46 crore. A site with an area of 30.27 acres has been identified in the town limit.\n\nThe site, which is under the control of Karur Municipality, is likely to be transferred to the Director of Medical Education within a few days for constructing medical college. To facilitate the transfer, the Karur Municipality, which met on Monday, passed a resolution.\n\nCollector T.P. Rajesh and MLAs Senthil Balaji and S. Kamaraj were present.\n\nS. Revathi, Dean cum Special Officer, Karur Medical College, told The Hindu that construction of college buildings, residential quarters, and hospital buildings would be taken up simultaneously. Three contractors had been engaged for the speedy construction.\n\nOf 30 acres, 25 acres would be effectively used for medical college. The remaining five acres would be maintained as park as per the land classification.\n\nIn Pudukottai, the college will come up at Mullur village on 127 acres at a cost of Rs. 229 crore.\n\nOf this, Rs. 108 crore would be used for construction of hospital buildings and Rs. 61.31 crore for residential quarters. A sum of Rs. 59.16 crore would be spent for administrative buildings.\n\nParimala Devi, Dean-cum-Special Officer, Pudukottai Medical College, told The Hindu that the built up area of the medical college buildings and residential quarters would be 41,309 square metres and 22,298 square metres respectively. The administrative buildings would have a built up area of 20,463 square metres. The total built up area of the college would be 84,069 square metres.\n\nShe said the government had sanctioned 150 seats for the college. It had been planned to enrol students from 2017-18. A team of the Medical Council of India might visit the college in December.", 
    "section": "national", 
    "title": "CM lays foundation stone for medical colleges in Karur, Pudukottai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}