{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Expenditure is expected to beRs. 153.25 crore with priority for roads\n\nThe Thanjavur City Corporation budget 2016-17 presented in the council meet here on Monday states that the civic body revenue is estimated at Rs. 153.56 crore and projects expenditure at Rs. 153.25 crore for a marginal surplus.\n\nThe total revenue receipts include Revenue and Capital Fund, Elementary Education Fund and Water Supply Fund.\n\nCity Commissioner M. Varadaraj released the budget proposals and Mayor Savithri Gopal received the first copy of he document.\n\nThe Mayor said the prime task before the corporation was to minimise the unnecessary expenses and increase revenue realisation by preventing pilferage and loss in those categories through effective implementation of integrated fiscal management principles.\n\nThe budget has been prepared with the aim of providing quality roads to all areas, potable water supply all through the year, adequate street lighting, and effective underground drainage system in all civic areas, Ms. Savithri Gopal added.\n\nStating that the administrative expenses take away 70.41 per cent of the revenue receipts, the Mayor claimed that the corporation would try to realise the tax arrears in the fields of property tax, profession tax as non-taxes, and fees to reduce the administrative expenses to 49 per cent.\n\nMajor projects\n\nAmong the projects planned for the year ahead included multi-level vehicle parking lots, another Amma Library in the slums areas, development works in the Sivaganga Park to attract more visitors, conduct special spoken English classes to the students of the corporation schools, construct new commercial complexes, life skill, and industrial training to women SHG members among other things, she said.\n\nFor the benefit of the pavement dwellers, night shelters would be built in the year ahead, the Mayor announced.\n\nCity Executive Engineer R. Srinivasan, and Health Officer Senthil Kumar were present.\n\nHIGHLIGHTS\n\nCorporation hopes to plug revenue leaks and prune expenditure\n\nAbout 70.41 per cent of revenue goes to administrative expenses", 
    "section": "national", 
    "title": "Corporation revenue put at Rs. 153.36 crore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}