{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The CPI members who submitted a petition to the Commissioner of Police seeking action against BJP leader H. Raja in Tiruchi on Tuesday.— PHOTO: A. MURALITHARAN\n\n: The Communist Party of India (CPI) has lodged a complaint with the Tiruchi City Police seeking appropriate action against Bharatiya Janata Party national secretary H. Raja for his “offensive remarks” targeting CPI Rajya Sabha member D. Raja over the JNU row.\n\nThe CPI Tiruchi urban district secretary K. Suresh on Tuesday submitted a complaint to the Commissioner of Police at the City Police Office here.\n\nIn the complaint, Mr. Suresh said he was shocked to hear the “offensive remarks” made by the BJP leader during a press conference held at Coimbatore on February 21 targeting the CPI national secretary D. Raja. He came to know of it through the media, Mr. Suresh said.\n\nQuoting the “offensive remarks” purportedly made by the BJP leader, Mr. Suresh said H. Raja had asked the CPI leader to prove his patriotism by asking his comrades to shoot the latter’s daughter Aparajitha for participating in “anti-national” protests at the university recently.\n\nThe complaint said that the BJP leader had also stated that CPI (M) general secretary Sitaram Yechury, CPI national secretary D. Raja and Congress vice president Rahul Gandhi should be sent out of the country.\n\nThe BJP leader’s remarks incited violence besides creating uproar among people. The remarks also tried to portray those indulging in protests in a democratic manner as anti-nationals, he further said.\n\nThe petition appealed to the Commissioner of Police to initiate appropriate action against the BJP leader under IPC sections 506 (ii) (criminal intimidation) and 109 (punishment for abetment).\n\nProtest\n\nSpecial Correspondent in Thanjavur reports:\n\nWorkers of the Communist Party of India (Marxist) staged a demonstration near the Railway Junction in Thanjavur on Tuesday condemning the Thanjavur City Corporation's various acts of omission and commission that they claimed were affecting the common man.\n\nThe protesters alleged that the shops and properties in the New Bus Stand were aggrandised by the ruling party men and that the corporation must re-possess them to augment the revenue. Similarly, many private players had encroached upon the Rani Vaikkal not far from the arterial Gandhiji Salai and nothing had been done over the years to retrieve those properties and revive the channel.\n\nThey demanded that the corporation provide clean water in all areas of the city. The unhygienic conditions prevailing in the New Bus Stand area must be cleared at the earliest, they said.\n\nThe CPI (M) town secretary, P. Senthil Kumar, led the demonstration in which MDMK Town Secretary S.K. Ravichandran, Viduthalai Chiruthaigal Katchi leader A. Jeganathan, and CPI’s G. Ganapathy participated.", 
    "section": "national", 
    "title": "CPI seeks action against Raja", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}