{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Arsenal Tower on the sprawling Palace Complex in Thanjavur has been illuminated with LED lights.\n\nIt was a dazzling display as various hues lit up the imposing Arsenal Tower and the Bell Tower in the Thanjavur Palace Complex even as the narrator traced the history of the Thanjavur royals, the region and its people from the period of the Muttarayar chieftains to the British Empire era enlightening the audience who were spellbound.\n\nAs the sun went down swathing the whole area in darkness, the magisterial monuments in the Palace arena came alive bright in light of various alternating colours that vibe well with the narration leading the audience through the greats of Thanjavur. This Rs. 65 lakh LED Light and Sound Show was the reply to the long pending demand for a similar effort at the Sri Brihadeeswarar Temple (Big Temple) but where the live temple atmosphere prevented such an entertainment show.\n\nThe show, on for about 40 minutes, is held twice in the evening for a maximum audience of 100 atop the Art Gallery roof that provides a panoramic view of the monuments around and on which scattering brightly coloured light rays run in rhythm to provide the perfect backdrop for a soulful narration.\n\nAt present the narration is in Tamil though plans are afoot to have that in English shortly and later on in French too.\n\nThe authorities charge Rs. 50 a person for the show that promises to reveal the greatness of Thanjavur to the domestic and international tourists as also for the discerning locals.\n\nCollector N. Subbaiyan who had initiated and coordinated the efforts to install the light and sound show atop the Art Gallery said that the show would be of great use to school students and the visiting travellers. The show is open to public since Saturday.", 
    "section": "national", 
    "title": "Dazzling display attracts visitors to Bell Tower", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}