{
    "author": [
        "B Kolappan"
    ], 
    "text": "In an election season where many smaller parties are presenting themselves as effective alternatives to the AIADMK and the DMK, Dravidian ideologue Suba. Veerapandian has contended that the two parties that have dominated Tamil Nadu for long cannot be dislodged. “The DMK and the AIADMK share among themselves a substantial voter base that does not provide space for an alternative. Other parties could only aid in tilting the balance between the two Dravidian parties,” argued the founder of Dravida Iyakka Tamilar Peravai.\n\nMr. Veerapandian, who recently triggered a controversy by asking the DMK to contest in 200 Assembly constituencies while accusing DMDK leader Vijayakant of lacking in ideology by simultaneously engaging three formations in alliance talk, contended that the DMK would be the ideal partner for the DMDK if Mr. Vijayakant was particular about dethroning Chief Minister Jayalalithaa.\n\n“The DMK and DMDK share the agenda of ousting the AIADMK from power. It will benefit both if they come together to fight the elections. But Mr. Vijayakant opened channels with every party and made all of them wait. That is why I felt it is not honest politics,” he told The Hindu on Tuesday.\n\n‘Not bound by ideology’\n\nHe said political parties came to an understating to share seats during the elections and they were not bound by any ideology. “It is a common purpose that brings them together,” he said. Making it clear that he was not against a third front or alternative front as he strongly felt that democracy would be served better by the emergence of more political formations, he said he had faith in the dictum “let a hundred flowers bloom.”\n\n“But in this elections, we cannot afford to fritter away the anti-incumbency votes,” he argued.\n\nMr. Suba. Veerapandian said though he never argued that the DMK should not be subjected to criticism, he was against the idea of placing the DMK on par with the AIADMK.\n\n“People often cite the late Kamaraj to drive home the point that both the AIADMK and the DMK are bad. I do not agree just as I will not say the CPI (M) and the BJP are sailing on the same boat just because they take a similar position on the Sri Lankan Tamil issue and the nuclear power projects,” he said.\n\nMr. Suba. Veerapandian said while the DMK implemented programmes and schemes keeping in mind the welfare of the people, Ms Jayalalithaa made statements under Rule 110 and they remained on paper.\n\n“In this election,\n\nwe cannot afford to fritter away the anti-incumbency votes”", 
    "section": "national", 
    "title": "Dravidian parties too strong to be dislodged: Suba. Veerapandian", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}