{
    "author": [
        "R Sivaraman"
    ], 
    "text": "The machines help in the implementation of transparent method of polling process\n\nElection officials conducting first level checks on Voters Verifiable Paper Audit Trail (VVPAT) machines in the presence of representatives from recognised political parties on Tueday, at the Election Department in Puducherry.- Photo: T. Singaravelou\n\nAiming to implement transparent method of polling mechanism in the forthcoming Assembly elections, the Election Commission of India (EC) has despatched Voter- verifiable paper audit trail (VVPAT) machines which will be introduced in three constituencies of Union Territory.\n\nLast month, the Chief Election Commissioner Nasim Zaidi had stated that the commission would introduce VVPAT in three constituencies - Ozhukarai, Orleanpet and Karaikal-South.\n\nFollowing the announcement, the Election Department of Puducherry received VVPAT machines from Bihar for the deployment during the forthcoming polls.\n\nWhile using the VVPAT, once the vote is cast by pressing the button, the elector shall be able to view, through the transparent window of the printer, kept along with the balloting unit inside the voting compartment, the printed paper slip showing the serial no, name and the symbol of the candidate for whom he has cast his vote. The slip will drop into the printer tray.\n\nChief Electoral Officer V. Candavelou said, “We have procured 100 VVPAT machines for the deployment and our officers with assistance of engineers are conducting first level checks on the machines.\n\nThough the commission has plans to introduce the VVPAT in three constituencies, it may be used in more constituencies depending upon the availability of machines.” The officials of Election Department on Tuesday conducted first level checks (FLC) in the presence of representative of political parties.\n\nDuring this FLC in addition to the normal FLC procedure, political party representatives were asked to check the printed ballot slip in VVPAT for each vote cast.\n\nDuring the exercise, the printed ballot slips of each VVPAT printer were counted to compute the result independent of the electronic result in the controlling unit and the result of the printed ballot slips was tallied with the electronic result of the controlling unit.\n\nThe tally should be shown to those present in the FLC. The whole process was videographed.\n\nAn official added that this exercise is as an opportunity for training the representatives of the political parties in the use of EVMs with VVPAT system.\n\nThe officials added that the VVPAT printers after taking out the printed paper slips will be kept in a separate strong room.\n\nIt will not be kept in the strong room where EVMs are stored, so that even if there is any election petition is filed from the constituency, the VVPAT units can be taken out for use, if required, without opening the strong room having EVMs.\n\nP.T. Ruthra Goud, Joint Chief Electoral Officer said the Election Department has plan to conduct awareness campaign among the political parties and electors of the constituencies, where VVPAT to be used.\n\nThey may be used in more constituencies depending upon the availability of machines", 
    "section": "national", 
    "title": "Election dept. receives VVPAT machines", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}