{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Ambassador expresses dissatisfaction over negative perception of the region\n\nExploring the potential that resides within the region rather than looking for opportunities elsewhere can improve cooperation, S.D. Muni, former Ambassador and special envoy, Government of India, said on Tuesday.\n\nMr. Muni, who is Distinguished Fellow at the Institute for Defence Studies and Analyses, was delivering the inaugural address at the three-day international seminar on Imagining ‘South Asia: Emerging Trends, Challenges and Alternatives’ hosted at UNESCO Madanjeet Singh Institute of South Asian Regional Cooperation (UMISARC), Centre for South Asian Studies, Pondicherry University.\n\nNegative perception\n\nExpressing dissatisfaction over the negative perception of the South Asian region, he said that focusing on an analysis of incidents and scenarios 15 years back along with a forecast for 15 years ahead could be more constructive for the region.\n\nWhile giving credit to the region for successfully dealing with insurgencies, Prof. Muni was of the view that the huge population of the region could be leveraged as a valuable human resource.\n\nStressing the imperative of a re-visioning concept in the current scenario, he said that there were broadly two ways to bring about cooperation in any region —by usual social science approaches and by using experiences and intuitions.\n\nIn his key note address, Prof. Imtiaz Ahmed, executive director, Regional Centre for Strategic Studies, Colombo, Sri Lanka, dealt with the role of religion and politics in South Asia. He was positive about the role of regional universities as well as archives for regional integration.\n\nR. Prabhakara Raya, Vice-Chancellor (in-charge), Pondicherry University, emphasised the importance of promoting regional cooperation alongside multiple initiatives that are being taken by the region like cross country grid network and joint exercises.\n\nFormer Ambassador expresses dissatisfaction over negative perception of the region", 
    "section": "national", 
    "title": "Exploring South Asian potential can further cooperation: Muni", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}