{
    "author": [
        "Special Correspondent"
    ], 
    "text": "No word on implementing M.S. Swaminathan Commission report: Kaveri Dhanaplan\n\nThe Union Finance Minister Arun Jaitley’s claims on giving a push for agriculture sector in the Union Budget 2016-17 notwithstanding, farmers’ representatives have expressed disappointment over the Centre’s failure to implement the M.S. Swaminathan Commission recommendations to ensure remunerative price for farm produce.\n\nThe National Commission on Farmers, chaired by Mr. Swaminathan, had recommended that farmers be given 50 per cent profit over and above the cost of production of agricultural produce, said Kaveri Dhanapalan, general secretary, Cauvery Farmers Protection.\n\n“The Bharatiya Janata Party had made an election promise to implement the recommendation but there is no effort to implement the promise. Without doing this, the avowed objective of doubling farmers’ income could not be achieved,” he said expressing disappointment over the Union Budget.\n\nMr. Dhanapalan found fault with the government for failing to utilise the additional revenue available through the decline in international crude prices for strengthening the agricultural infrastructure.\n\n“Although an allocation of Rs. 35,984 crore has been made to the agriculture, we have been demanding that the allocation to the sector should be on a par with Defence spending,” Mr. Dhanapalan said.\n\nAgreeing that the allocation for agriculture sector should be increased, Arupathi Kalyanam, general secretary of Federation of Farmers’ Associations, said it should be at least 20 per cent of the budgetary allocation. While the general orientation towards the agriculture was to be welcomed, the allocation to the sector was still meagre and this would not be enough to improving the living standards of farmers unless the recommendation of the M.S. Swaminathan Commission on 50 per cent profit for farm produce was implemented, he said.\n\nThe net sown area of the country should be declared protected area and the government should implement a crop insurance scheme that would compensate individual farmers.\n\nThe new crop insurance scheme should be implemented only through the Agriculture Insurance Company of India and not through private players.\n\nR. Raja Chidambaram, State Secretary, Tamizhaga Vivasayigal Sangam, demanded that the government do away with the interest subvention scheme for crop loans for prompt payment and extend all agricultural loans at uniform interest rate of 4 per cent.\n\nThe direct benefit transfer for fertilizer subsidy should be implemented without affecting poor farmers, he said and added that the initiative to promote organic farming should be extended to a larger area.", 
    "section": "national", 
    "title": "Farmers’ representatives pick holes in budget", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}