{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Ex-servicemen belonging to the 13 Engineer Regiment of Madras Engineer Group greet Colonel (retired) M.M. Khan during the regiment's Golden Jubilee celebration in Vellore on Tuesday.— Photo: C. Venkatachalapathy\n\nThey constructed the first floating bridge in Kashmir valley in just three hours in 1995. During the 1971 war, amid heavy bombardment, they converted a deeply mined railway line stretching from Balurghat, India to Hilli in East Pakistan into a road in lightening speed over night. They have worked in extreme weather conditions – sub-zero temperature of Ladakh and the blistering heat of Rajasthan. They are the “thambis” of 13 Engineer Regiment of the Madras Engineer Group, Indian Army.\n\nOn Tuesday, it was time to celebrate the regiment’s 50 years of existence, as a large gathering of ex-servicemen from Vellore and other parts of the State came together to go down on the memory’s lane.\n\n“The 13 Engineer Regiment’s job is to provide engineering service to enable the infantry to advance. We deal with explosions, we neutralise enemies’ minefields and lay mines. We have built thousands of bridges,” retired Colonel M.M. Khan, who was part of the regiment between 1973 and 1996 said.\n\nInterestingly, the regiment’s language was mostly Tamil. Most of the men recruited to the regiment came from Tamil Nadu, with Vellore main a major hub, he added.\n\nIn fact, the regiment’s motto was “Padimune Po Munne,” a slogan that kept the “thambis” going ahead even in the toughest conditions. Formed in 1966 in Sagar in Madhya Pradesh, the regiment played a pivotal role in the Indo-Pak 1971 war. “Our outstanding job forced Pakistan forces to surrender. We also received the East Pakistan Theatre Award. Our regiment has worked all over the borders of India. Whether floods or earthquakes, we are the first to go for aid and relief,” he pointed out.\n\nRecounting the construction of the first heavy assault floating bridge in Kashmir, he said that there were maximum wooden bridges in the valley, and during the militancy in 90s, the bridges used to be set on fire.\n\n“One such place was Khudwain in south Kashmir. Even the civil engineering departments ruled out the possibility of constructing a bridge. The bank of the river was steep, and water current was fast. We conducted reconnaissance and went ahead with the construction,” he recalled. The regiment constructed a 100 metre long bridge. In the absence of the bridge, the local population had to travel for 80 kilometres.\n\nAnother achievement was establishing a ditch cum bund that served as an obstacle to the enemies’ tanks. The regiment went on to bag six awards for its works.\n\nMany ex-servicemen recalled memories of the regiment. Ex-serviceman, Captain M. Sundaramoorthy, who was among the first to join the regiment, recalled how they had breached many minefields, while 72-year-old Captain M.V. Krishnan said that during the 1971 war, they were involved in several dangerous jobs.\n\nAs the ex-servicemen celebrated the Golden Jubilee, the regimental headquarters was also having a small celebration. Similar celebrations were being organised in Thrissur (Kerala), Secunderabad (Hyderabad) and Bengaluru (Karnataka), Colonel Khan noted.\n\nOrdinary Captain R.N. Chakravarthy, an ex-serviceman, said around 250 ex-servicemen from including Vellore, Madurai, Tiruchi, Salem, Puducherry and Krishnagiri took part in the Golden Jubilee celebrations.\n\nOut of his 37 years in the army, Subedar Major Ordinary Captain V. Xavier Yesudoss was part of the regiment for 32 years, while another ex-serviceman Subedar Madasamy named his house “thambi illam” in memory of the regiment, a fitting tribute indeed.", 
    "section": "national", 
    "title": "Golden occasion for ‘thambis’ of 13 Engineer Regiment", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}