{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Boy denied permission by school to appear for exams this year\n\nThe Madras High Court Bench here on Tuesday came to the rescue of a Class X student who was denied permission by a private matriculation higher secondary school at Vannarpettai in Tirunelveli to appear for the public examination this year. The school accused the boy of not being mentally stable and being prone to weird behaviours.\n\nDisposing of a writ petition filed by the student’s father, Justice Pushpa Sathyanarayana directed the school principal to make sure that the student sits for the examinations this year.\n\nIn his affidavit, the petitioner had accused the school of barring his son from writing the examinations since it feared that he might score less and affect the overall results.\n\nThe petitioner’s counsel, V. Karthikeyan, challenged the action of the school by relying upon a communication sent by the Director of School Education to the Chief Educational Officers in all districts on February 11.\n\nIn his proceedings, the Director had expressed deep concern over media reports of many schools issuing transfer certificates to less meritorious students before public examinations.\n\nStating that issuance of T.C. with an eye on increasing the pass percentage was a “completely wrong act,” the Director said that it would also jeopardise the future of students who actually required counselling and additional coaching.\n\nIt also warned school principals of stern action in case of such complaints and said that issuing T.C. before public examinations was a “punishable offence.”\n\n“The Chief Educational Officers are requested to make sure that such incidents do not occur in their districts by monitoring the schools and issuing necessary instructions to the principals and headmasters of all schools within their jurisdiction,” the proceedings of the DSE read.\n\nHe was accused of not being mentally stable, and being prone to weird behaviours", 
    "section": "national", 
    "title": "HC permits student to sit for Class X examinations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}