{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Cites circular mandating offices to display portraits of Babasaheb\n\nThe Madras High Court has set aside the order of a single judge which upheld the decision of the State Bank of India terminating one of its office assistants for allegedly putting up a portrait of Dr. B.R. Ambedkar on the bank’s premises.\n\nM. Gowrishankar, an office assistant at the bank’s Adyar Branch and a member of the SBI SC/ST Employees Welfare Association, was charged with placing a picture of Dr. Ambedkar in the bank hall without permission.\n\nOn July 16, 2004, the bank issued a memo stating that the portrait “spoiled the ambience of the hall”. Various SC/ST Associations objected to the statement and resorted to agitations. On September 21, 2004 the bank issued another memo following the protests. Subsequently, an enquiry was conducted and Gowrisankar was dismissed from service on December 2, 2005.\n\nAssailing the order, Gowrishankar approached the appellate authority, which modified the punishment to removal from service with superannuation benefits, on April 3, 2006.\n\nThe matter was then referred to the Central Government Industrial Tribunal-cum- Labour Court (CGIT) which held that the charges were proved. It, however, altered the punishment and ordered his reinstatement with continuity of service and all other attendant benefits but without back wages.\n\nMr. Gowrishankar appealed in the High Court questioning the portion of the award denying him back wages, while the bank challenged his reinstatement.\n\nA single judge passed a common order dated October 17, 2014, allowing the plea moved by the bank, while dismissing the petition filed by the Gowrishankar. The reinstatement awarded by the CGIT was also reversed.\n\nGowrishankar challenged the single judge’s order.\n\nIn its order, a Division Bench of Justices S. Tamilvanan (since retired) and D. Hariparanthaman cited a circular issued by the Union Ministry of Finance dated September 8, 2006 to all the nationalised banks and other financial institutions directing to display portraits of Dr. Ambedkar in their offices.\n\nConsequently it held, “In our view, the entire issue was not properly handled by the bank and the entire blame is on its own for irresponsibly using the remark in a sensitive matter”. Therefore, it directed that the employee be reinstated.\n\nCourt says the entire issue was not properly handled by the bank", 
    "section": "national", 
    "title": "HC reinstates man who put up Ambedkar’s portrait in office", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}