{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P. A. Ponniah, Railway Colony, 7.30 p.m.\n\nSaiva Siddhantha Sabha: Discourse on ‘Tiruvarutpayan’ by A. Arumugam, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S. S. Colony, 5 p.m.\n\nKamakoti Peravai: Maha Periyavar jayanthi; discourse by G. Karthikeya Sivam, Vasudhara, Tirupparankundram Road, Andalpuram, 6.15 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nTamil Isai Sangam: 41{+s}{+t}annual Tamil music festival; musical discourse on ‘Tirugnanasambandar’ by S. Subbulakshmi, Principal, Government Music College, 5.15 p.m.; vocal concert by Vijayalakshmi Subramaniam, Raja Muthiah Mandram, 6.45 p.m.\n\nGENERAL\n\nThiagarajar College: Extension programme on ‘Women and environment;’ S. Selvaraj, Headmaster, Government Higher Secondary School, and Sasikala Mohan, panchayat president, address; M. Eyini, Principal, presides, Tiruvadavur, 9 a.m.; awareness camp on basic amenities and rights, Community Hall, Narasingam, 10 a.m.; S. S. M. Sundaram, former Professor, speaks on ‘Vaazhviyal Vanigam,’ Main Hall, 10.30 a.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, Kallampatti, 2.30 p.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: R. Chokku speaks on ‘Woman’s rights and human rights,’ C. Ramalakshmi, Principal, presides, Poovanthi, 10.30 a.m.\n\nCSI College of Arts and Science for Women: NSS camp, Chettikulam, 10 a.m.\n\nMangayarkarasi College of Arts and Science for Women: Seminar on ‘e-Banking,’ Paravai, 10 a.m.\n\nK. L. N. College of Engineering: Samuel Jebakumar speaks on ‘Belief system and emotional intelligence,’ Mechanical Seminar Hall, 1.15 p.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Dheep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}