{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Mining baron S Vaikundarajan has lost the boardroom battle at the Thoothukudi-based Tamilnad Mercantile Bank to the faction led by S Annamalai of Sivakasi-based Pioneer Group, which includes foreign institutional investors.\n\nThe 94-year private bank headquartered in Tamil Nadu’s coastal town also got its first woman director Chitra Murali, an internal auditor of the bank.\n\n“Annamalai’s faction won the board and the board members had their first meeting today,” said a senior official from the bank. In all, 24 candidates were in the race for the election of Board of Directors held in January under the supervision of a retired High Court judge.\n\nThe elected board members include S Annamalai, P C G Asok Kumar, B Vijayadurai, V. V. D. N. Vikraman, S. R. Aravind Kumar, A. Shidambaranthan, B. S. Keshava Murthy , P. Yesuthasen, Chitra Murali and K Nagarajan.\n\nMr Annamalai told The Hindu , “The decision on who would be the chairman was not taken. We will decide on that soon. We also have the support of the FIIs,” he said.\n\nThe board would educate shareholders about the necessity to go for an IPO. During the bank’s Annual General Meeting the resolution for IPO got rejected by the shareholders. Mr Vaikundarajan and his team had contended that if the bank went for an IPO the bank would go out of the hands of the Nadar community. “We required a 75 per cent majority for the IPO and we did not get that. The capital adequacy norms should be strengthened and we will explain this to the shareholders,” he added.\n\nThe Pioneer Group was founded in 1945 with the setting up of Pioneer Match Works at Sivakasi by K.A.A.Sankaralingam and K.A.A.Arunachalam. According to the group’s website it has a turnover of Rs. 750 crore. The new board will be meeting in the next ten days.\n\nChitra Murali is the 94-year-old bank’s first woman director", 
    "section": "national", 
    "title": "Mining baron loses TMB boardroom battle", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}