{
    "author": [
        "S Senthalir"
    ], 
    "text": "The audience soak in the live music concert organised at Kasha-ki-Aasha Art Boutique and Cafe in Puducherry. (Below) Pianist Pablo Lapidusas and drummer Fabio Bergamini perform.— Photos: S.S. Kumar\n\nPianist Pablo and drummer Fabio perform at Kasha-ki-Asha\n\nIn the quiet lane of Surcouf Street, music lovers swayed to the tunes of pianist Pablo Lapidusas and drummer Fabio Bergamini at the rooftop restaurant in Kasha-ki-Aasha Art Boutique and Café in Puducherry.\n\nThe musicians, playing to the cool breeze of Saturday night, mesmerised the audience. Excited about coming together to perform in a live music concert after 20 years, Mr. Pablo and Mr. Fabio, who studied together at the State University of Campinas in Brazil, began with a Vidyasagar’s soundtrack ‘ Ding Dong Kovil Mani’ from Tamil film Ji with their drum and piano.\n\nThe duo had composed four tunes mixing Jazz and Carnatic for this concert. “We teach students and also learn Carnatic music from faculties at the Swarnabhoomi Academy of Music in Cheyyur,” said Mr. Pablo.\n\nBorn in Argentina, studied in Brazil and now in Portugal, Mr. Pablo is known for his complex rhythms and his inventive mix. Having started to study piano at the age of 11, he became a professional musician playing at parties at 14 years. It was in college at the age of 18 that he learnt Jazz. Now, he plays pop, jazz and electronic music.\n\nBoth Mr. Pablo and Mr. Fabio are faculties at the Swarnabhoomi Academy of Music for a three-month semester. “It is a very special night because our students are here, we are in a beautiful place and I am performing with my friend after 20 years,” says Mr. Fabio.\n\nHailing from Brazil, drummer and percussionist Mr. Fabio has been working as a touring drummer and faculty for over 20 years. He was also a member of the Madredeus Group in Portugal and authored the ‘Text book of Drums and Percussion of the Guri Project.’ His notes range from Jazz, Pop, Rock to Brazilian instrumental music, Balkan music and Orchestral Rock.\n\nThe two are coming to India for the first time. They have already started making plans for a new album. “This new album will have Carnatic music influence,” says Mr. Pablo.\n\nThey played their original compositions during the live music concert in Puducherry.\n\nKasha Vande, owner of Kasha-ki-Aasha Art Boutique and Café plans to tie up with Swarnabhoomi Academy of Music in Cheyyur, to offer a treat of live music every weekend to the music lovers in Puducherry. The academy invites faculties from different parts of the world to their institute. “There are plans to bring the faculty members and students to Puducherry to play to the audience. We are yet to firm up the contract,” said Robin Richard, Associate vice-president, Education Services, Swarnabhoomi Academic Institutions.\n\nThis weekend, people can enjoy gypsy jazz music by Lithuanian musicians.", 
    "section": "national", 
    "title": "Old friends come together for an evening of mesmerising music", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}