{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Technology has come in handy so much that the Passport Seva Kendras (PSKs) are heading towards paperless functioning.\n\nDespite rise in number of applicants seeking fresh passports, the number of days taken to issue, after police verification (PV) and other formalities, has been reduced drastically.\n\nSpeaking to media persons, Regional Passport Officer A. Maniswara Raja said here on Tuesday that the Ministry of External Affairs had streamlined the police verification system for passport issuance.\n\nFor this purpose, out of the 731 police districts in the country, 685 had been digitally integrated. As a result, the time taken to complete PV (national average) had come down from 49 days (in 2013) to 42 days (in 2012) and to 34 days (in 2015).\n\nFor issuance of passports, police verification is mandatory and is an integral part. The Union Ministry makes a payment of Rs 150 for every PV received within 21 days and Rs 50 if received after 21 days. Thus, between January and December 2014, the Centre had paid about Rs seven crore to the Tamil Nadu government towards PV . This is to aid the police department to procure gadgets, which could be used for passport verification.\n\nRecently, the Ministry has launched mPassport Police App for speedy submission of PV report. For instance, a field level verification officer could directly capture the PV report into the system digitally. In simple terms, the need to download and print personal particulars would no longer be required, resulting in paperless end-to-end digital flow of the entire process, he added.\n\nSimilarly, for re-issue of passports when there was no adverse reports or change in personal particulars in passport database it would help reduce number of PVs to be made by the police authorities. The State government would immensely stand to gain in terms of revenue, in the event of clearing PV reports within 21 days.\n\nLast year alone, the Madurai RPO had issued over two lakh fresh passports.", 
    "section": "national", 
    "title": "PSKs all set to become paperless offices", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}