{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector distributes ‘Amma’ mobiles to SHG members\n\nCollector S. Natarajan distributing sweets after Chief Minister Jayalalithaa inaugurated a rail overbridge in Paramakudi in Ramanathapuram district on Tuesday.— Photo: L. Balachandar\n\nChief Minister Jayalalithaa inaugurated, through video conferencing, a rail overbridge and Government Mental Hospital-cum-Rehabilitation Centre on Tuesday, even as Collector S. Natarajan launched the distribution of ‘Amma mobile phones’ in the district.\n\nAfter the Chief Minister declared open the rail overbridge, Mr. Natarajan distributed sweets to the general public gathered near the bridge in Paramakudi. All India Anna Dravida Munnetra Kazhagam district secretary R. Dharmar and scores of party volunteers were also present.\n\nThe overbridge built at Kattuparamakudi at a cost of Rs. 46.57 crore would benefit thousands of people who travelled to Paramakudi from Ponnaiyapuram, Mudukulathur, Ilayankudi and Sayalkudi areas.\n\nThe State government had spent Rs. 40.85 crore for the 818-metre- long bridge and the railways Rs. 5.72 crore, an official release said.\n\nThe construction began in August 2014 and the project suffered delay due to problems in removing encroachments and shifting Cauvery combined drinking water pipelines, it said.\n\nThe Chief Minister also inaugurated a 50-bedded Government Mental Hospital-cum-Rehabilitation Centre, built by Public Works Department (PWD) near Erwadi Dargah at a cost of Rs. 2 crore. J. Periyar Lenin, District Psychiatrist and Medical Officer, Erwadi, said that the hospital would start functioning soon after the beds and other infrastructure facilities were provided.\n\nThe rehabilitation centre, presently functioning in a rented building, would be shifted to the new premises, he said.\n\nThe construction was started in February last year and completed within the project period, he said.\n\nErwadi Dargah Haqdhar Management Committee had donated one acre of land for building the centre, which would provide comprehensive mental health care to the patients.\n\nThose visiting the Dawa Dua Centre at the dargah, which offered treatment to the mentally ill people, linking medicine with spirituality and required in-patient assistance, would be referred to the new centre, he added.\n\nMobiles to SHG members\n\nAfter attending the inaugural ceremony and distributing sweets, Mr. Natarajan launched the distribution of Amma mobile phones to trainers of women self-help groups on behalf of Tamil Nadu State Rural Livelihood and Puduvazhvu scheme. The free mobile phones would be distributed to 500 trainers in the district, an official release said.", 
    "section": "national", 
    "title": "Rail overbridge, rehabilitation centre inaugurated in Ramnad", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}