{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "33-year-old tried to fix device and pinhole camera in Guindy; hunt on for two of his accomplices\n\nIn a case that is clearly out of the ordinary, a Romanian national was arrested on Monday by the police on a charge of fixing a skimmer inside an ATM in Guindy on Anna Salai here and attempting to steal account details of customers.\n\nThe police are hunting for two other Romanians who travelled to Chennai with him. An alert has been sounded at all the airports and railway stations, claim police officers. According to the police, on Monday morning, Irimia Ionut (33) from Romania and one of his friends went to Canara Bank ATM inside a petrol bunk in Guindy on Anna Salai.\n\n“Irimia Ionut walked in around 6.30 a.m. and fixed the skimmer and a pinhole camera on the ATM machine,” said D. Kannan, Deputy Commissioner of Police, Adyar.\n\nIn the afternoon, the staff of the bank had come to the ATM to fill in money and noticed something unusual. “They saw the skimmer and the camera and informed the police. We rushed to the place and checked the CCTV footage and identified the foreigner,” added the officer.\n\nPlainclothes policemen were deployed at the bunk. Around 7.30 p.m., Ionut and his friend reached the ATM to collect the skimmer. “We identified them, but they began to flee. We chased the two, but were able to nab only one of them,” added Mr. Kannan. The police took him to Rajam Sea View Apartment, in VGP Layout, Uthandi, where he and two of his friends were staying. But the other two had escaped, the officer said.\n\n“We took the passport copy he had submitted at the place he was staying at and found the three had come on a tourist visa on February 25,” added the officer.\n\nThe police, who are finding it difficult to understand what the man is speaking, said he was not able to get any details of the customers.\n\nThe petrol bunk employees remember seeing the foreigner.\n\n“He was bulky and had tattoos on his legs. I vaguely remember his friend and guess he was waiting for him with a bike outside the bunk,” said one of the staff there. Others said that there had never been a security guard at this ATM, despite it being frequently used. A police officer confirmed there was no guard.\n\nP.N.A. Shankar, joint secretary, Cyber Society of India, said that though people were becoming more aware of skimming, the banks should ensure that a security guard is posted inside the ATM room.\n\nThe police say they chased two foreigners from the petrol bunk but were able to nab only one", 
    "section": "national", 
    "title": "Romanian fixes skimmer in ATM, arrested", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}