{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Rs. 16.5 cr. earmarked for salary, pension benefits of staff\n\nDindigul Corporation Mayor V. Marudha Raj presented a deficit budget for 2016-17 at a special council meet held here on Tuesday.\n\nPresenting the budget, the Mayor said that the deficit in the budget would be Rs. 4.52 crore. Projected income of the corporation for the next fiscal would be Rs. 33.26 crore – it was Rs. 29.51 crore in the last fiscal – and the expenditure was projected at Rs. 37.78 crore – it was Rs. 39.89 crore in 2015-16.\n\nThe deficit was reduced substantially this year from Rs. 10.38 crore recorded in the last fiscal. Income through water and drainage taxes would be around Rs. 13.35 crore, which was Rs. 6.97 crore last year.\n\nThe Mayor said that the deficit from water and other taxes last year was Rs. 2.37 crore.\n\nThe corporation would get a surplus income of Rs. 3.06 crore in the next fiscal owing to rationalisation water and other taxes, he noted.\n\nTo meet salary and other allowances and pension benefits of corporation employees, the urban local body earmarked Rs. 16.5 crore, against Rs. 15 crore earmarked in the last fiscal.\n\nA sum of Rs. 7.75 crore was allocated to meet pension benefits.\n\nThe allocation to maintain Amma canteen would be Rs. 70 lakh against Rs. 65 lakh set apart last year. A sum of Rs. 60 lakh was allocated for maintenance of street lights and purchase of electronic gadgets, Rs. 1.8 crore for sanitation-related works and Rs. 1.5 crore for capital works.\n\nCapital income through projects, subsidies and grants would be Rs. 12 crore – it was Rs. 6 crore in 2015-16. Capital expenditure was expected to rise up to Rs. 21.45 crore from Rs. 14.15 crore recorded last year. Project administrative expenses were estimated at 11 per cent of the project cost, he added.\n\nMr. Marudha Raj said that foundation stone was laid for an additional reservoir near Athoor dam to improve storage at an estimated cost of Rs. 20 crore to augment drinking water supply to Dindigul city.\n\nLater, councillors appealed to the Mayor to order cleaning of Aranmanaikulam and removal of encroachments around Siluvathur tank.\n\nA total of 51 resolutions for implementing various works were passed at the meeting.", 
    "section": "national", 
    "title": "Rs. 4.52-cr. deficit budget for Dindigul Corporation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}