{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stating that the budget presented by Mayor S. Soundappan has no new schemes, district Bharatiya Janata Party (BJP) has termed the budget booklet as a collection of pictures.\n\nNew\n\nschemes\n\nDistrict president R.P. Gopinath said that new schemes were announced by the corporation every year in its budget.\n\nIn the budget presented for 2015-16, the Mayor said that VOC Market would be demolished and new shopping complex would be constructed.\n\nHowever, no steps have been taken so far, he added.\n\nWards\n\nLikewise, Mayor had assured in last year’s budget that transit medical vehicles would be introduced, wards would be increased from the present 60 to 72, power generation through solar systems, smart board would be installed in all corporation schools and operation theatre facility would be established in all the corporation-run hospitals. But, the announcement remains in papers, Mr. Gopinath said.\n\nThe district president said that the Mayor in present year’s budget had said that 72 public toilets would be renovated and works would be completed by February 29. However, the progress is unknown, he added.\n\nAn eye-wash\n\nMr. Gopinath said that allotting Rs. 17 crore for solid waste management is mere eyewash as the civic body spends crores of rupees for the scheme without vision. He also questioned the status of the Phase II of Mettur – Salem Dedicated Water Supply Scheme as there is no clarity in completion of the project.\n\nMr. Gopinath said that the budget presented for 2016-17 has only colour pictures.\n\nPetitions\n\nHe said that Mayor failed to explain the action taken on each petitions received from the public during the weekly grievances day redress meeting as the booklet contains only pictures of Mayor receiving petitions.\n\n“If announcements in the past are yet to take shape, how can the corporation implement the schemes announced now”, he added.", 
    "section": "national", 
    "title": "Salem civic budget, a colourful booklet: BJP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}