{
    "author": [
        "S Ganesan"
    ], 
    "text": "The flyover will replace the narrow bridge connecting the Viralimalai road\n\nA view of the portion of Tiruchi's Aristo Roundabout bridge which was thrown open to traffic by Chief Minister J. Jayalalithaa through videoconferencing in Chennai on Tuesday.— PHOTO: A. MURALITHARAN\n\nThe Railway Junction-Dindigul Highway section of the new multi-level bridge coming up near the Railway Junction in the city was thrown open for traffic on Tuesday.\n\nChief Minister Jayalalithaa declared open the bridge through video conference from Chennai. The opening of this section is expected to ease to some extent the traffic congestion caused by the diversions enforced over the past couple of years to facilitate the construction of the bridge. The flyover would replace the narrow bridge, which has emerged a traffic bottleneck in recent years, at the Viralimalai Road intersection.\n\nThe new trestle and embankment bridges have been designed with seven arms leading towards the Chennai Bypass, Aristo Hotel Junction, Dindigul Highway, Central Bus Stand, Railway Junction, Madurai Highway, Kallukuzhi, and a new road to be laid near the MSP camp. Service roads would be provided at the ground-level along all important arms.\n\nThe project is executed in two stages at a cost of Rs. 81.40 crore. In the first stage, a new three-lane bridge with six arms is being built adjacent to the existing bridge. In the next stage, the old bridge would be dismantled and a new bridge with another arm built in its place.\n\nThe Highways Department and the railways are currently working on the first stage of the project, which is scheduled to be completed by February 2017. The Highways Department decided to open the Railway Junction-Dindigul Highway arm of the bridge so that the traffic congestion is relieved partly. This section runs for a length of 621 metres of the bridge’s length of 2,156 metres.\n\nOn Tuesday, the arm was opened with one way traffic allowed between Dindigul Highway and Railway Junction. Chief Whip in the State Assembly R. Manoharan and other elected representatives distributed sweets among members of the public after the bridge was opened.\n\nFor the Highways Department, the next target would be to complete the arm towards the Central Bus Stand and open it for traffic at the earliest. Construction of this section could be taken up only after the service road was built for which land acquisition notification is awaited from the State government.\n\nAlthough the Highways department is planning to complete the first stage of the project by the end of December this year, ahead of schedule, much would depend on the completion of the acquisition of some private land for the project.\n\nThe Highways Department could not take up work on full swing on the first stage of the project as Railways has to transfer about 5,095 square metres of its land. Parleys have been going on with the Railways for the transfer of the land over the past several months. The transfer agreement was delayed because of finalisation of the cost of land to be provided by the Railways, notwithstanding representations taken up with the Railway Board by P. Kumar, MP. The Highways Department was awaiting transfer of Defence land on the Mannarpuram side.", 
    "section": "national", 
    "title": "Section of Aristo Roundtana bridge opened for traffic", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}