{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sub-Inspector of Police S. Saravanan (left), who won a medal at All-India Police Duty Meet with Superintendent of Police N. Manivannan in Ramanathapuram.\n\nS. Saravanan, a 2011 batch Sub-Inspector of Police, has brought laurels to the district by winning bronze medal in the 58th All India Police Duty Meet held in Punjab in March in ‘Crime investigation and legal procedure’ category.\n\nCompeting with more than 150 personnel from various forces including Border Security Force (BSF) and Indo-Tibetan Border Police (ITBP), Mr. Saravanan, a native of Ramanathapuram district, scored 42 out of 50 marks in the written examination and won the medal.\n\nHe missed the first prize by four marks.\n\nMr. Saravanan, who was part of Tamil Nadu contingent, qualified to represent the State in the national-level event after he won gold medal in the State-level meet held in 2013. Chief Minister Jayalalithaa had awarded him a cash prize of Rs. 20,000 in Chennai on March 26.\n\nHe also received a share money of Rs. 50,000 of the total cash award given for the State contingent, which won the overall Championship, and Rs. 30,000 of the total cash award given to the State Scientific Team, which won the trophy.\n\n“It was a proud and encouraging moment,” he said, describing the receipt of cash award from the Chief Minister.\n\nThe SI, accompanied by Mariappan, Inspector of Police, Special Branch CID, called on Superintendent of Police N. Manivannan here and showed him the certificates and cheques.\n\nThe SP suggested that Mr. Saravanan, presently attached to SB CID wing, could be moved to Law and Order wing or Crime Branch.\n\nMr. Saravanan had a passion for investigation ever since he joined the police force in 1997 as a constable after completing his graduation at Sethupathy Government Arts College here. Later, he got directly recruited as SI and served in Sivaganga district before joining SB CID wing.\n\nThanks to the encouragement of Mr. Mariappan, he had helped the local police in cracking a couple of murder cases after tracing mobile call details and mounting technical surveillance. He focused on the use of scientific aids in investigations at the All-India Police Duty Meet, he added.", 
    "section": "national", 
    "title": "SI wins medal in all-India meet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}