{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "The Teachers of Rani Lady Meyyammai Achi Music School — Mala Gopalakrishnan, Viswampara and Amutha — performed along with their students on the sixth day of the 41st anniversary of Tamil Isai Sangam on Monday and portrayed scenes from “Sivapuranam” through Bharathanatyam.\n\nThe dancers started off with an explanation of the “Siva Panchatchara”, \"Nama Sivaya\", to the composition of Adisankara.\n\nThen each of the teachers performed with a different group of students.\n\nNatesha Kauthuvam in Hamsadhwani set to Chatushra Eka thalam of Tanjavur Quartette, a dance in praise of Lord Shiva, included both “ nritta” (footwork) and “ abhinaya”.\n\nThe dancers went on to express the love that the “Nayaki” had for the” Nayakan” in the Varnam in Kapi Ragam set to Rupaka Thalam.\n\nThe dancers satirically praised the Lord (Nindasthuthi), in the Patham “Ethukku Ithanai” by Marimutha Pillai”. It was a display of stamina and skill. Bharathiar’s Sivasakthi Koothu “Thaga Thaga Thaga Endru…\" in Ragam Siva Sakthi and Thalam Adi was a vigorous performance. Before the thillana in Mand by Lalgudi Jayaraman in the name of “Devi”, they also danced for a song from the famous “Thevaram” “Mathar Piraikanniyane”.\n\nThe song selections and the synchronization to music were enjoyed well by the audience.\n\nThe prime time was a Pattimandram, where the two great epics, Ramayana or Mahabharata, explained the ethical codes of life better.\n\nProfessors T.K. Subramaniyam, Visalakshi Subramaniyan and Rajkumar were pitted against professors Rajaram, R. Soundaravalli and R. Madu, with professor S.S.M. Sundaram as the judge.\n\nThe speakers made erudite references, which were very informative to the audience. The speakers on both sides gave extensive references to the Ramayana and the Mahabharata.\n\nThe judge while delivering his judgement said that Mahabharata being a complex epic showed the interaction between extraordinary characters, such as Bhishma and Karna and therefore had more lessons for humanity than the Ramayana.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Sivapuranam through Bharathanatyam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}