{
    "author": [
        "K Lakshmi"
    ], 
    "text": "This directive, issued by BIS, is going to have an impact on the construction and automobile sectors\n\nFrom March 18, Bureau of Indian Standards (BIS) will make ISI certification mandatory for more steel products. With this directive, those steel products meant for the construction and automobile sectors will need ISI marking to sell them in the city.\n\nAlready, 20 different steel products are under the ambit of ‘mandatory BIS certification’. Now, 15 more steel products, including raw material used in construction industry, and automobile components, would be brought under compulsory ISI mark.\n\nAccording to BIS, mild steel bars, hot-rolled steel strip used for welded pipes and bright bars used in engine components of automobiles would now have to be certified by the BIS before sales. At present, there are 151 licensees in Tamil Nadu who comply with standards prescribed to use ISI mark on steel products.\n\nOfficials of the BIS, southern region, said steel products are being brought under the quality control order in a phased manner since 2008. “We will test samples and also inspect the manufacturing units to check if they conform to the quality standards of BIS. Products that do not meet the standards will be disposed of as scrap and production can be started only after a license,” said an official.\n\nThis would also help regulate the imported steel products, particularly from China, being dumped in the indigenous market as even those from other countries need to comply with the BIS standard before distribution.\n\nWelcoming the BIS move, those in the construction industry said awareness about the use of ISI-marked products was already growing among customers, particularly after the Moulivakkam building collapse. This would further help the use of quality products in construction. D. R. Sekar, past state chairman of Builders Association of India and member of the technical team, BIS, said: “Builders and customers may have to pay a slightly higher price for ISI-marked steel products. But, it will ensure better quality. Most people prefer ISI-marked products as there is no cost difference between these and non-ISI ones in most cases.” Small and medium manufacturing units in the industrial estates noted that the move would reduce usage of rerolled steel as raw material in automobile components and fabrication industries.\n\nV. Raju, president of Ambattur Industrial Estate Manufacturers Association said: “Bringing manufacturers of basic steel material under the ambit of ISI marking will help in providing quality end product for vehicles and construction industry.”", 
    "section": "national", 
    "title": "Soon, ISI mark a must for steel products", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}