{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "‘Nothing to suggest meaningful transformation of entrepreneurship at the ground level’\n\nThe start-up community in the State felt that the Union budget could have been a little more generous. After all the hype at the Start-up India week, the sector was hoping for more goodies to be rolled out, but was disappointed.\n\nAlso, many felt that there was no further talk about the Rs. 10,000-crore innovation fund that was rolled out last year.\n\nChandu Nair, investor with Chennai Angels, said, “Overall, there is really nothing in the budget that gives us the idea that we are going to see a meaningful transformation of entrepreneurship at the ground level. Let’s take ease of doing business. It was stated that the Companies Act will be amended to enable setting up of start-ups in a day. But wasn’t this already mentioned by Prime Minister Narendra Modi during the January Start-up India Action Plan,” he asked.\n\nFinance Minister Arun Jaitley had announced a 100 per cent tax deduction programme for three years over a period of five years for start-ups approved before financial year 2019 under the Start-up India scheme. But start-ups feel that only a handful of them would make profits in first two years of operation and they were uncertain of the benefits of the proposed tax holiday. They also said that there is no mention of exit policy or listing of norms for start-ups in the Budget presentation. There is no indication of setting off of losses made in start-ups which could boost angel investment.\n\n“Yes, start-ups have been given a three-year tax holiday and capital gains exemption, but the 100 percent tax deduction programme is only for start-ups approved before FY2019 under the Start-up India scheme. And how many of those will there be? Regarding long-term capital gains for unlisted companies, the FM has reduced the holding period of from three to two years. Countries like Singapore have zero per cent Capital Gains Tax, making it more attractive to be domiciled there,” added Mr. Chandu.\n\nMajor misunderstanding\n\nVijay Anand of the Start-up Centre felt that there was a major misunderstanding between start-ups (companies that can grow really fast - are after large markets, have IP and generate high-end jobs) versus small businesses (where typically entrepreneurs make a living running restaurants or renting out tables and chairs).\n\n“Unfortunately, the government seems rather confused about what a start-up is and is actually talking about small businesses instead of start-ups,” he added.\n\nMr. Vijay also pointed out that changing the criteria for start-ups to participate in government contracts and tenders would help. “While that was announced during the event, it still stands to see whether and how much will be implemented as State governments and departments would still use caution against working with smaller companies and the Central government has no influence over it,” he said.\n\nUnfortunately, the govt seems rather confused about what a start-up is and is actually talking about small businesses.\n\nVijay Anand\n\nStart-up Centre", 
    "section": "national", 
    "title": "Start-ups find big push missing in budget", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}