{
    "author": [
        "S Prasad"
    ], 
    "text": "The government on Monday fixed Rs. 2,750 as State Advisory Price (SAP) per tonne of sugarcane. Chief Minister N. Rangasamy made the announcement after conducting a tripartite meeting with sugarcane growers and the mill management.\n\nFollowing requests from cane growers, the price for sugarcane has been fixed at Rs.2,750 a tonne. The Government will incur an additional expenditure of Rs.5.40 crores, Mr. Rangasamy said.\n\nCrushing season\n\nThe crushing season for 2014-15 will commence on March 4. A decision to this effect was also taken at the tri-partite meeting.\n\nSugarcane farmers have been asking the government to fix SAP for the past six months. For 2013-14, the Government had fixed the SAP at Rs. 2,700 per tonne. The SAP fixed by the Government for 2014-15 is Rs.100 less than the rate fixed by neighbouring Tamil Nadu.\n\nSo far, SAP offered by the Puducherry government has generally been above SAP of neighbouring States, except during 2012-13 when farmers were paid in the name of “advance” for their supply to Cooperative Sugar Mill\n\nMeanwhile, sugarcane farmers have expressed disappointment over the SAP announced by the Government for 2014-15.\n\n“We were expecting to get at least Rs.3,000 a tonne. But the SAP has come as a disappointment. The crushing season which should have normally commenced in November had not yet started as farmers had been left high and dry due to delay in payment of dues,” said a spokesperson of the Lingareddypalayam Sugarcane Farmers Association.\n\nThe mill management is yet to make payment to the tune of Rs.15 crore to farmers who had supplied cane for the crushing season during 2013-14 and 2014-15.\n\nMany farmers are not able to avail themselves of fresh crop loans as the management has not paid interest to the banks concerned, he said.\n\nMore than 18,000 farmers are now left in the lurch with the government yet to fix the State Advisory Price for the crushing season of 2015-16.", 
    "section": "national", 
    "title": "State Advisory Price of cane fixed at Rs. 2,750 per tonne", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}