{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District Judge R. Poornima adjourned the temple pujari suicide case till March 8 on Tuesday as the copy of the Madras High Court’s order did not reach the district administration to appoint the petitioner’s lawyer as public prosecutor to argue the case.\n\nAll the seven accused, including prime accused O. Raja, brother of Finance Minister O. Paneerselvam, appeared before the court in the morning. However, petitioner Subburaj, father of the deceased pujari, and his lawyer did not appear.\n\nDefence counsel M. Kannappan informed the court that the trial could not be conducted without appointment of the public prosecutor. After hearing his argument, the judge adjourned the case.\n\nSources said that the district administration was yet to receive the copy of the High Court’s order in connection with appointment of a new lawyer, as sought by the petitioner, to prosecute the case further.\n\nThe Collector would issue an order in this connection only on receipt of the court order.\n\nBefore issuing the order, he would certainly consult with the government pleader in the High Court. Then the new lawyer would present the copy of the appointment order in the district court and appear on behalf of the petitioner, the sources also added.\n\nThe Madurai Bench of the Madras High Court has directed the subordinate court to dispose of the case within four months.\n\nCharges were framed against Mr. Raja and others on December 15, 2015.\n\nEarlier on November 25, Theni District Court had transferred the case to Dindigul District Court on the direction of the Madurai Bench of the Madras High Court.\n\nS. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam committed suicide by hanging on December 8, 2012, after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "Temple pujari suicide case adjourned till March 8", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}