{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Youths climbing a slippery pole at Sri Mariamman Temple in Natham near Dindigul on Tuesday as part of Masi festival.— PHOTO: G. Karthikeyan\n\nThousands of devotees witnessed the climbing of slippery pole, a rural sport conducted as part of annual Masi festival celebrations held at Sri Mariamman Temple in Natham on Tuesday.\n\nNatham town wore a festive look as hundreds of devotees, clad in yellow, carried fire pots, lifted children in sugarcane cradle and took out a holy procession to reach the temple.\n\nMeanwhile, temple organisers prepared a gundam (fire path) for the fire-walk festival. A few tonnes of fire wood were burnt to lay the fire-path, according to temple officials. The ceremony commenced after the pole climbing event.\n\nMeanwhile, rural youth struggled for hours to climb the slippery pole erected before the temple. They used wet towels to gain grip to reach the top and grab the neem leaves tied at the tip of the pole.\n\nEarlier, the organisers had prepared the pole for this special event. They had polished a tall eucalyptus tree to create a smooth outer surface. Aloe juice and castor oil were applied to make it more slippery. After special pujas to the main deity, participants started climbing the pole. After hours of struggle, a youth reached the tip and grabbed the neem leaves. Thousands witnessed the event.\n\nLater the fire walk festival commenced with religious fervour. First, temple pujaris entered into the gundam. Later, around 12,000 devotees entered into the holy gundam. Men and women, irrespective of their age, walked on the fire-path. Devotees from Dindigul, Theni, Virudhunagar, Sivaganga, Tiruchi, Ramanathpauram and nearby districts witnessed the festival. The holy Kambam was immersed into the temple tank last night. The festival would conclude with the procession of goddess Mariamman on the palanquin in the town on Wednesday morning.\n\nTemple authorities and town panchayat administration had made elaborate arrangements for the festival. More than 500 police personnel were deployed to regulate the crowd. Special buses were also operated to Natham from Dindigul and Madurai for the convenience of devotees. The Maasi festival that began on February 15 would conclude on Wednesday.", 
    "section": "national", 
    "title": "Thousands throng Natham for Masi festival", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}