{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur: Theppam festival, Thayar purappadu from sanctum sanctorum, 6 p.m.; reaching theppam mandapam, 6.15 p.m.; purappadu from the mandapam, 8 p.m.; reaching sanctum sanctorum, 8.15 p.m.\n\nM.A.M. College of Engineering and Technology: Video conference on “Fundamentals of electronics materials and devices”, Parasuraman Swaminathan, Assistant Professor, IIT, Madras, resource person, 3 p.m.\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, poojas, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Kodiyalam Sri Krishnar Sannidhi, Kodiyalam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 17/3, Tagore Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nAnna Science Centre Planetarium: National Science Day, I.K. Mukherjee, former director-general, National Council of Science Museums, Kolkata, chief guest, P. Iyamperumal, Executive Director, TN Science and Technology Centre, 3 p.m.\n\nCauvery College of Engineering and Technology: National-level design competition, N. Senthil Kumar, vice chairman, CACET, chief guest, 10 a.m.\n\nBharathidasan University: Lecture on “Forests and pollution” by D. Stephen, Assistant professor, American College, 2.30 p.m.\n\nShrimati Indira Gandhi College Department of Management Studies: Release of compendium of articles, Motley , V. Raju, Principal General Manager, BSNL, chief guest, 4 p.m.; Nature Club and Exnora: Bio walk, Butterfly Park, 9.30 a.m.\n\nRajiv Gandhi National Institute of Youth Development and Shrimati Indira Gandhi College: Training programme on health and healthy lifestyle, S. Kunjithapatham, college secretary, inaugurates, college campus, 9.30 a.m.\n\nJ.J. College of Engineering: Lecture on “introduction to supply chain management and how to write a research paper by Kannan Govindan,” professor, University of Southern Denmark, 2.30 p.m.\n\nM.A.M. School of Engineering: Basics 2016 – State-level technical symposium, M.A. Peer Mohamed, college correspondent, inaugurates, 9.30 a.m.; V.Ramachandran, General Manager, Kothari Sugars and Chemicals Ltd., distributes prizes, 4.15 p.m.\n\nBishop Heber College: Golden jubilee State-level invitation inter-collegiate basketball tournament for Bishop Solomon Doraisawmy memorial trophy, 7 a.m.; Department of Social Work: Programme on stress management, CREA Children’s Academy, Nagamangalam, 4 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}