{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Fifth State Finance Commission Chairman S. Krishnan at the vermin compost plant in Coimbatore on Tuesday.– Photo: S. Siva Saravanan\n\nCoimbatore Corporation has begun vermin compost production at its plant in Vellalore. In the last 20 days, the corporation has produced close to 50 tonnes waste. The compost production comes after the civic body spent Rs. 4 crore to refurbish the plant that it took over from Ramky Infrastructure Limited.\n\nAccording to corporation sources, the civic body has been processing about 80 tonnes of organic waste a day.\n\nIt collects the waste from restaurants, eateries and markets to transports it to the vermin compost plant for processing.\n\nAt the plant, shreds the organic waste and transfers it to the windrow platform and lets the formation of windrows for three weeks. It aerates the waste spraying inoculums, transfers the semi-digested material to tanks where worms feed on the waste to produce vermin compost.\n\nThe sources say that the corporation ought to get 10 per cent of the organic waste as vermin compost but it has been getting only 5 per cent as the quality of organic waste has to be good, without inorganic waste.\n\nThe corporation is working on it by talking to restaurant owners and market vendors.\n\nOn Tuesday, S. Krishnan, Chairman, Fifth State Finance Commission; G. Prakash, Director, Municipal Administration; Prashant M. Wadnere; District Collector Archana Patnaik; and others visited the vermin compost plant.\n\nCorporation Commissioner K. Vijayakarthikeyan told them that it was the biggest vermin compost plant by a municipal body in the State.\n\nAs part of the waste processing facility, the sources said that the corporation had installed a bio-methanation plant to generate power.\n\nThe plant will take in three tonnes food waste a day to generate 240 units power.\n\nAt present the corporation is using the power to light street lamps in the Vellalore yard and run the machines at the vermin compost plant.\n\nThe corporation has invested Rs. 1,70 crore for the purpose.", 
    "section": "national", 
    "title": "Vermin compost plant begins production", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}