{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Superintendent of Police N Manivannan on Tuesday, honoured with cash awards, the wards of district police personnel who scored high marks in the SSLC and Plus Two examinations, results of which were announced last year. Ten boys and girls who scored 1,067 out of 1,200 marks and above in the plus two examinations and ten boys and girls who scored 481 out of 500 marks and above in the SSLC examination received cash prizes at a brief function held at the SP’s chamber here.\n\nThe 20 students were given total prize money of Rs. 61,500 after Ashokumar, Director-General of Police cleared the “Award of Educational Prizes – 2015” in February this year. N. Vishali, daughter of K. Narayanasamy, Special Sub Inspector (SSI) of Police, Danushkodi, who top scored with 1,169 marks in the plus two examinations, won cash award of Rs. 7,500 followed by R. Jaya Harun Shree, daughter T. Antony Kanmani, Superintendent, DPO, (1,160 marks) and R. Akalya, daughter of V. Ramachandran, Head Constable, Chathirakudi (1,154 marks). The second and third top scorers were given Rs. 5,500 and Rs. 3,500 respectively. Seven others were given Rs. 2,500 each. In the SSLC examinations, T. Yagavi, daughter of R. Thirumalai, Head Constable, Thiru Uthirakosamangai, scored 494 marks to win the first prize of Rs. 6,500. P. N. Manickavasuki, daughter of K. Pasupathi, Superintendent, DPO, won the second prize of Rs. 4,500 for scoring 491 marks and R. S. Adlin Jenifa, daughter of K. Rajendran, Head Constable, Sikkal Rs. 2,500 for scoring 484 marks. Seven other students who scored 483, 482 and 481 were awarded Rs. 2,000 each.\n\nGiving away the cash awards, Mr. Manivannan advised the students to focus on their studies and achieve greater heights in their careers. ADSP (Headquarters) A. Inbamani and S. Vellaidurai, ADSP, Prohibition and Enforcement Wing (PEW) were present.\n\n20 students given prize money of\n\nRs. 61,500 after DGP cleared the “Award of Educational Prizes – 2015”", 
    "section": "national", 
    "title": "Wards of policemen with top scores get cash awards", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}