{
    "author": [
        "Staff Reporter"
    ], 
    "text": "R.K. Singh, secretary of Indian Nuclear Society speaks at a national workshop on Quality Assurance and Radiation Safety in Diagnostic Radiology at CMC, Vellore- Photo: C. Venkatachalapathy\n\nThe Indian Nuclear Society (INS) on Monday launched a workshop on “Quality Assurance and Radiation Safety in Diagnostic Radiology” at Christian Medical College (CMC), Vellore.\n\nThe five-day workshop which is also jointly organised by the Christian Medical Association of India, is being attended by 43 experienced radiographers from various hospitals across the country, according to Rabi Raja Singh, professor of Radiological Physics, CMC.\n\nAim is to equip radioligists with quality assurance parameters\n\nIt aims to equip radiologists and radiographers with comprehensive details of quality assurance test parameters to conduct the tests on X-ray equipment, and radiation safety in diagnostic radiology.\n\nSpeaking on the occasion, R.K. Singh, secretary of INS, pointed out that the country has huge scientific power, and has come a long way in the field.\n\n“It is our duty to tell people about the applications of radiation. We should explain that it is beneficial and is used for the service of mankind for India to become a developed nation,” he said.\n\nS. D. Sharma, workshop coordinator and scientific officer at Bhabha Atomic Research Centre (BARC), said it was difficult to certify radiographers all over the country in a short time due to their large numbers. There are close to 35,000 X-ray departments in the country.\n\nChain of worksohps\n\n“Though radiation safety was incorporated into the curriculum, we do not know if it was actually taught to students. Radiographers need refresher training to have thorough knowledge to conduct quality assurance tests of diagnostic equipments used in departments and radiation safety.\n\nHence, INS will be organising chain of such workshops, at least two to three in a year. If demand increases, there will be more such workshops,” he added.\n\nThe workshop consists of 17 lectures and a few practical demonstrations. N.N. Bhat, senior scientist from BARC was also present.", 
    "section": "national", 
    "title": "Workshop for radiographers under way at CMC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-02"
}