{
    "author": [
        "Special Correspondent"
    ], 
    "text": "39 of them are in Kunnam segment and 30 in Perambalur segment\n\nSixty nine polling stations in the district have identified as sensitive based on the incidents and reports compiled about each and every station, said K. Nandakumar, District Collector.\n\nAddressing election officials here on Monday, he said that additional security measures would be put in place at these stations. While 30 of them were located in the Perambalur Assembly constituency, the remaining 39 were in the Kunnam segment, he added.\n\nAll necessary arrangements were under way across the district to ensure free and fair elections. Basic amenities would be provided at the time of election. Ramps had been set up at all the stations to facilitate the differently-abled persons, he added.\n\nThe Collector said that women outnumbered men in the electorate strength. The Perambalur Assembly constituency had 2,75,932 voters — 1,35,127 men, 1,40,792 women, and 13 transgenders. In the Kunnam Assembly constituency, the electorate strength was 2,54,896 – 1,26,996 men, 1,27,889 women, and 11 transgenders. Eight women booths would be set up — four in each Assembly constituency.\n\nThe district administration has made adequate arrangements for the safe despatch of Electronic Voting Machines. As many as 841 EVMs and 1,360 control machines had been brought to the district and kept under safe custody after preliminary verification. All the 636 polling stations in the district have been divided into 63 zones and zonal officers appointed to monitor the election-related arrangements.\n\nA control room with toll-free phone number 18004257031 has been set up. The Collector has appealed to the people to prefer their complaints, if any, to the control room.\n\nA round-the-clock vigil was being kept for monitoring effective implementation of model code of conduct.", 
    "section": "national", 
    "title": "69 booths sensitive in Perambalur", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}