{
    "author": [
        "V S"
    ], 
    "text": "Efforts being taken to identify 1 woman in every party district\n\nAfter pushing for 50 per cent of seats in local bodies for women by unanimously passing a Bill in its last Assembly session, the ruling AIADMK is likely to field one woman candidate in every party district in the coming Assembly polls.\n\nThe AIADMK has 50 party districts and if women are fielded from each district, the party would have earmarked more than 20 per cent for women candidates, sources say. Instructions to this effect have been given to the party district secretaries from party supremo and Chief Minister Jayalalithaa, a senior leader said.\n\nConfirming it, a district secretary in the western region said the instruction was to identify a woman candidate who would be able to win from a particular constituency and inform the party leadership.\n\nLooking at the electoral history of Tamil Nadu, the AIADMK has fared far better than its arch rival DMK in fielding women candidates from the time Ms. Jayalalithaa took over the party leadership. However, the percentage of women fielded by political parties has been about 12 per cent only.\n\n“Amma has always given representation and importance for women more than anyone in Tamil Nadu,” says S. Gokula Indira, Handlooms and Textiles Minister, who was appointed as the Secretary of the AIADMK Women’s Wing early this year.\n\nShe was given a seat in Anna Nagar in Chennai, nowhere near her native Sivaganga, in the 2011 Assembly elections, from where she was elected to the Assembly. “Only Amma can accomplish such victories,” she says.\n\nAnother woman MLA, requesting anonymity, said that Amma provides ample opportunities for women in the party to succeed. “In return, Amma expects us to be active and be loyal,” she says.\n\nPercentage of women fielded by political parties has been about 12\n\nper cent only", 
    "section": "national", 
    "title": "AIADMK may field more women", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}