{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "A Dalit youth in Ramanathapuram district has discontinued education after being “falsely” arraigned in a murder case and jailed for 65 days. The youth, M Karunakaran (21), a student of the Government Polytechnic College near Melur, was among the 12 accused arrested by the Paramakudi police in November last, in connection with the murder of a BJP functionary, C. Ramesh, near Thenpoduvakudi village.\n\nWhile the police insist that Karunakaran was part of a gang that hacked the victim, three of the co-accused claimed to The Hindu that he was in no way connected with the crime and that they were not familiar with him.\n\nKarunakaran and his family members say that on the day of the murder, he was at home as he was suffering from ear pain.\n\nA local paramedical staff says he administered injection to Karunakaran on that day at his home. Besides, medical records reveal that he had visited the Paramakudi Government Hospital, a day before the murder, with complaints of ear pain.\n\n“I was on leave when the murder happened and attended classes from the next day onwards. But in the small hours of Friday (four days after the murder), I was arrested by the police,” said Karunakaran. College administration acknowledged his presence in the classroom during the two days after the murder.\n\nThe jurisdictional Inspector, A John Britto, said that all the 12 accused — incidentally all are Dalits — were involved in the murder,\n\n“The victim was involved in a scuffle with V. Devaraj, the main accused in the case, over a minor road accident, a month before he was murdered,” he said.\n\nKarunakaran’s advocate K Muthukannan claimed that his client was detained on suspicion and there was nothing to connect him to the crime.\n\nA. Kathir, executive director of a civil liberties outfit ‘Evidence’, which is providing legal assistance to Karunakaran, has sought investigation by an external agency into the murder to bring out the truth.\n\nHowever, N. Manivannan, Superintendent of Police of Ramanathapuram district, denied that Karunakaran was innocent and said that he was arrested only after investigation confirmed his involvement. “As far as we are concerned, he is an accused in the case at this stage,” he said.", 
    "section": "national", 
    "title": "Arraigned in murder case, Dalit boy drops out of college", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}