{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A Free Trade Agreement between India and Australia has been delayed due to a number of technical issues and the two countries want a mutually beneficial agreement, a top Australian official said. “There are a number of technical issues that needs to be thought through. Negotiations are under way. When the agreement is concluded, we want it to adequately benefit both sides,” Harinder Sidhu, Australian High Commissioner to India, said.\n\nSpeaking at the 26th Annual Day of the Indo-Australian Chamber of Commerce on Monday, Ms. Sidhu said there was a deep political commitment towards the agreement. “We want a very high quality agreement,” she said.\n\nThe services sector is emerging as an important area of convergence between India and Australia, Mr. Sarat Chandran, Director, Indo-Australian Chamber of Commerce, said.\n\nPointing out that bilateral trade was just $18 billion, he said both countries have a strong small and medium enterprises sector.\n\nEarlier in the day at another event, Ms. Sidhu launched the Blue Economy Aquaculture Challenge that aims to encourage innovations in the areas of feed for aquaculture, new ocean products and sustainable designs.\n\n“Projects can be submitted by industry, NGOs, students and general public by June 30. The challenge is open to anyone but the projects must be specific to the Indian Ocean,” she said.\n\nAustralian Consul-General for South India, Sean Kelly, said the Australian Trade Commission was in the process of signing an agreement with the Marine Products Export Development Authority to bring in expertise to improve fishing capabilities and with the Tamil Nadu Fisheries Department in the areas of deep sea fishing and mother ship concept.\n\nAustralian High Commissioner\n\nsays the agreement should be mutually beneficial", 
    "section": "national", 
    "title": "Australia looking to seal free trade agreement soon", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}