{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Coimbatore-based companies — Salzer Electronics Ltd., and Aqua group of companies — have established innovation and research centres at Bannari Amman Institute of Technology (BIT) to provide hands-on training to students.\n\nThe two companies signed memorandums of understanding with BIT last week for the purpose. India was yet to catch up with European and American countries in electrical and electronics field. Aainst this backdrop, the Salzer-BIT Innovation Centre will mentor students to use technology with innovation in order to convert waste into value-added products, R. Doraiswamy, Managing Director, Salzer Electronics Ltd., said, during the MoU signing ceremony.\n\nInaugurating the Aquasub-BIT Research Centre, R. Radha Krishnan, Senior Vice-President, Aqua Sub Engineering, Coimbatore, emphasised on students gaining adequate exposure to practical dimensions of their theoretical study while in college, to be industry-ready.\n\nPresiding over, S.V. Balasubramaniam, Chairman, Bannari Amman Group, said the MoU envisaging practical training would infuse more meaning into hard work and perseverance to achieve well in career with a right mind frame.\n\nDomain knowledge\n\nIn his special address, P. Vijayakumar, Director, BIT, said employers expect sound domain knowledge, good articulation, communication skills and team spirit from the graduates, and that the practical experience could be gained only through practice.\n\nStudent achievers were announced on the occasion by A.M. Natarajan, Chief Executive, BIT.\n\nPrizes distributed\n\nAs many as 165 students who had excelled in various competitions including project design contest, paper presentation, conference, sports, yoga and various technical events, received cash awards totalling Rs. 1,72,000.\n\nThe students were assessed on a 14-point indicator for determining excellence, Mr. Natarajan said. The event also marked a farewell send-off to final year students.\n\n‘Students should gain exposure\n\nto practical dimensions of their theoretical study while in college’", 
    "section": "national", 
    "title": "BIT commissions innovation, research centres", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}