{
    "author": [
        "T Madhavan"
    ], 
    "text": "35 families headed by women are involved in the operation of the bio-methanation plant —Photo: G. Krishnaswamy\n\nExnora Green Pammal and Sam Foundation, which have been running a bio-methenation plant in Sankar Nagar, Pammal, have enhanced its capacity by 100 per cent.\n\nThe biogas plant was started in 2009 for generating 50 cubic metres of biogas per day with a feed of 500 kilograms of food waste, collected from the shops and hotels in Pammal and Pallavaram. The output from the biogas plant is being utilised as cooking fuel and for the generation of electricity to light 3 streets with 75 bulbs each of 11 watts.\n\n“With the support of the Tamil Nadu Pollution Control Board, the capacity of the biogas plant has been expanded to generate another 50 cubic metres of biogas per day,” said the managing trustee of Exnora Green Pammal.\n\n“For this, we have added one food waste crushing unit, one extra balloon, and one more biogas engine with 25kw capacity,” she says.\n\nThirty-five families headed by women are involved in the entire operation. Ten women are responsible for the collection of segregated food waste from restaurants in and around Pammal and Pallavaram. Fifteen families that lost their belongings in the recent floods are involved in the preparation of snacks. Bio gas serves as the cooking fuel in this process.\n\nThe total cost of expansion was Rs. 6 lakh, which was borne by Sam Foundation and TNPCB.\n\nAt a function held recently at Pammal, Additional Chief Secretary/Chairman, Tamil Nadu Pollution Control Board, K. Skandan, and Member Secretary, Convenor Tamil Nadu Pollution Control Board, K. Karthikeyan dedicated the new machinery for public use. The officials expressed satisfaction over the performance of the EGP and Sam Foundation as a unit. S. Balasubramanian, director, Sam Foundation for Eco Friendly Environment and Ravi Appaswamy, managing director, Appaswamy Real Estates, spoke on the occasion.\n\nThe entire land for setting up the biogas plant was gifted by Appaswamy Real Estates.", 
    "section": "national", 
    "title": "Capacity of biogas plant enhanced", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}