{
    "author": [
        "Special Correspondent"
    ], 
    "text": "devotion in the air:Devotees pulling the cars of Sri Ramanathaswamy Temple in Rameswaram on Monday on the occasion of Mahasivaratri.— Photo: L. Balachandar\n\nThe pilgrim island wore a festive look on Monday as thousands of sadhus and pilgrims, mostly from north India, thronged Sri Ramanathaswamy Temple on the occasion of Mahasivaratri.\n\nWhile the local people chose to visit temples of their family deities, located mostly in villages to offer worship, sadhus and pilgrims from north India visited the main temple in the island to have a darshan of the Gods and the Goddess on Mahasivaratri day.\n\nThe Mahasivaratri festival, which began on February 28 with flag hoisting, culminated for the Mahasivaratri on the ninth day on Monday with the car procession of Lord Ramanathaswamy, his divine consort Parvathavardhini Ambal, Lord Vinayaga, Lord Subramania and Chandigeswarar between 9 and 10.20 a.m. in ‘Mesha Lagnam’.\n\nThe idols were taken in decorated cars and pulled along the four Car streets as thousands of devotees offered worship.\n\nIn the evening, the idols of Lord Ramanathaswamy and Goddess Parvathavardhini Ambal were taken on a silver car around the temple.\n\nAfter the deities were brought back to the temple, the temple would be kept open throughout the night for the pilgrims to offer worship, S. Selvaraj, Joint Commissioner of the temple, said.\n\nOn ‘Masi Amavasya’ on Tuesday, the deities would be taken in a procession on Golden Rishaba vahanam to Agni Theertham seashore for ‘Theerthavari’ festival in the afternoon.\n\nAfter the deities were brought back to the temple in the evening, the flag would be lowered, marking the culmination of the Sivarathri festival, K. Mylvaganan, Assistant Divisional Engineer of the temple, said.", 
    "section": "national", 
    "title": "Car festival in Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}