{
    "author": [
        "Special Correspondent"
    ], 
    "text": "VLB Janakiammal College of Arts and Science in association with The Hindu presents the 6th edition of International Women’s Day 2016 celebration in Coimbatore. The event is powered by PSR Silk Sarees, Coimbatore.\n\nOn March 8, a panel discussion on the theme ‘gender parity’ will be held at the Convention Hall, PSG Institute of Management, Coimbatore, between 10 a.m. and 11.30 a.m. The discussion will be moderated by Shanthini Rajkumar and the panel members are Jitha Karthikeyan – contemporary artist; Swarnalatha, who runs an NGO; Grace Pachuau IAS – Collector trainee, and Sangeetha Velkrishna– a business woman. The event is open for all women.\n\nOn March 9, a cookery contest has been organised in association with SNR College of Arts and Science. It will be held from 9 a.m. to 1 p.m. at the Department of Catering Science and Hotel Management on the college premises.\n\nOn March 13, a treasure hunt for women titled ‘Heels on Wheels’ will be flagged off from The Hindu’s printing press located on Kamarajar Road in Singanallur.\n\nRegistration\n\nInterested participants for cookery and ‘Heels on Wheels’ contests can register their participation.\n\nFor registration, contact: 99943 36721, 0422 – 2446721. There will be only limited entries.\n\nThe event is presented by VLB Janakiammal College of Arts and Science powered by PSR Silk Sarees; associate partner- Twin Birds, Tirupur; automobile partner – Renault; hospitality partner - Sree Annapoorna Sree Gowrisankar, logistics partner - Coimbatore Auto Sports Club and experience partner Trio- Event Managers.\n\nSNR College of Arts and Science is the venue partner for cookery competition and PSG Institute of Management is the venue partner for panel discussion.", 
    "section": "national", 
    "title": "Celebrate Women’s Day in style", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}