{
    "author": [
        "T Madhavan"
    ], 
    "text": "Important road improvement work is expected to be completed soon\n\nTambaram muncipality is constructing a storm water drain at the Velachery main road near Selaiyur where water stagnation is a regular occurrence. —Photo: G. Krishnaswamy\n\nAfter a lull of a few months, basic infrastructure improvement work has resumed in Chitlapakkam town panchayat. The local body, which faces a financial crunch, received infra-fund from the State Government for improving roads ahead of monsoon.\n\nThough tenders were finalised for road widening and stormwater drain construction works, it could not commence immediately due to rain during November and December last year, officials said.\n\nThe local body’s Chairman R. Mohan said important road improvement works, at an estimated cost of Rs. 2 crore, would be completed soon. Apart from construction of the drains, four important link roads in the town would be black topped, he said.\n\nSince these roads are main thoroughfares, it was decided to carry out road-laying work during the night, said R. Chandramohan, the town panchayat’s executive officer.\n\n“Work on SWD was delayed as the Tangedco was planning a road-cut for laying power cables, for which we had to wait,” he said.\n\nAccording to residents these roads faced the fury of floods during December as water from Selaiyur Lake marooned many low-level streets. Residents pointed out that as a result, the wells of many houses were contaminated with sewage in the absence of an underground drainage network.\n\nTangedco commenced road-cutting on Mahalakshmi Nagar Main Road from Vallal Yousuf Nagar-Babu Street and also dug up a majority of road width to lay power cables to connect Rajakilpakkam sub-station with the Chitlapakkam sub-station.\n\nAs a result, access for residents of Babu Street was temporarily restricted and small buses services, diverted. Officials said inadequate cables had caused the delay and it was now sorted out.", 
    "section": "national", 
    "title": "Chitlapakkam gets busy again", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}