{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Coalition government is the only way for marginalised people like Dalits and minorities to share political power in the State, according to Viduthalai Chiruthaigal Katchi founder Thol. Tirumavalavan.\n\nAddressing the valedictory function of students’ union at Tamil Nadu Theological Seminary (TTS) here on Monday, Mr. Tirumavalavan said that reservation for Dalits in State Assembly and Lok Sabha had only ensured participation of the marginalised in the democratic process and not empowered them.\n\nIn the 60 years of rule by the Congress, Dravida Munnetra Kazhagam and All India Anna Dravida Munnetra Kazhagam in the State, the marginalised community did not get close to power. “This (lack of political power) is the root cause of the exploitation of the Dalits and minorities,” he said.\n\n“All kinds of oppression that are thought to be due to discrimination on casteist, religious and racist lines were not fully true. But, oppression was only by those in power against those who were not in power to ensure that the marginalised did not become equal on economic, social and political platforms,” he added.\n\nThe Dalits and minorities could never form big political parties like the Dravidian parties so that they could not come to power on their own strength, Mr. Tirumavalavan said.\n\n“Single party rule in the State should go. Only coalition government will ensure sharing of political power with the marginalised people… Even civil servants from the marginalised sections had to work under the political bosses,” he said.\n\n“Gone are the days that we expect political parties to share power with the Dalits. Instead, we should aim to capture power through continuous political struggles,” he said.\n\nTTS Principal David Rajendran and students’ union representatives were among those who spoke.", 
    "section": "national", 
    "title": "“Coalition govt. only way”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}