{
    "author": [
        "Aditi R"
    ], 
    "text": "Kannagi Nagar has only 19 children’s centres against the required 80\n\nThere is a woeful shortage of basic infrastructure in resettlement colonies created by the State government and crèches are no exception, experts say.\n\nA recent study published in the Journal for Land and Rural Studies states that Kannagi Nagar in Okkiyam Thoraipakkam has only 19 children’s centres under Integrated Child Development Services (ICDS), against the actual requirement of 80.\n\n“This is a crucial issue in all resettlement colonies,” said A. Narayanan, researcher, activist and director of the NGO CHANGEindia. According to the population norms of the Ministry of Women and Child Development, there should be one such centre for a population of 800. Both Kannagi Nagar and Ezhil Nagar have over 90,000 residents. While the former has 19, there are only five at Ezhil Nagar. Most of them function in flats constructed for displaced families living in the city slums and only around six operate from a building earmarked for them.\n\n“This a gross violation of ICDS norms. Why cannot they allot specific places for construction of the children’s centres instead of dingy and cramped single-room flats that lack ventilation and sanitation,” he asked.\n\nA door-to-door survey conducted last year by Information and Resource Centre for the Deprived Urban Communities (IRCDUC) states that of the 1,345 children till the age of six, only 156 have access to the government ICDS centres in Kannagi Nagar, while in Ezhil Nagar, only 69 of the 534 children have access to them. “The situation has not really improved lately. The disturbing thing is that a similar model is being followed in Perumbakkam too,” said Vanessa Peter, a policy researcher there.\n\nOfficials of the Tamil Nadu Slum Clearance Board (TNSCB) claim that they are planning to increase the number of centres. “We have been liasoning with the State government and will soon build adequate number of child care centres in the colonies,” said a senior official.\n\n“There are plenty of children in this area who are out of school, malnourished and need basic facilities. We hope the issue is addressed soon,” said Stephen Raj, a Kannagi Nagar resident.", 
    "section": "national", 
    "title": "Colonies get a raw deal", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}