{
    "author": [
        "Dennis S"
    ], 
    "text": "HC says sport cannot be considered irrelevant to police duties\n\nThe petitioner who claimed to have won national-level events in rifle shooting made a representation in March last for a job in police force under sports quota.— File photo\n\nRejecting a contention that the sport of rifle shooting was irrelevant to police duties, the Madras High Court has directed the State government to consider within two months a representation by a woman, who sought to include rifle shooting as sports event for recruiting police personnel under sports quota.\n\nWhen a plea filed by K. Bharathi, who claimed to have won national-level events in rifle shooting and made a representation in March last, came up for hearing, the Additional Advocate-General submitted that various rewards and awards were being given for excellence in sports.\n\n“As to what sport should get the benefit is for the respondent authorities to consider. We may, however, observe that by no stretch of imagination can rifle shooting be said to be irrelevant to police duties. In fact, the idea is to encourage sports and in the present case, it is the sport which is directly relevant for police duties,” the First Bench comprising Chief Justice S.K. Kaul and Justice M.M. Sundresh observed.\n\nWhen the Additional Advocate-General sought extended time, after the Bench gave a direction to favourably consider the request of the petitioner and a decision be taken within a maximum period of two months, the judges said, “…but we do not think this is a major policy decision which would require such a detailed examination” and further disposed of the plea.\n\nThe petitioner had sought a direction to the authorities to include rifle shooting as sports event for appointment under sports quota and direct them to consider her case.\n\nWe do not think this is a major policy decision which would require such a detailed examination\n\nChief Justice S.K. Kaul and Justice M.M. Sundresh", 
    "section": "national", 
    "title": "‘Consider plea to include rifle shooting for sports quota job’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}