{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Central Crime Branch of the city police arrested R. Santhosh Kumar and his wife Vasanthi of Ganapathy Maa Nagar on Monday for allegedly cheating an overseas job aspirant.\n\nThe police said that the victim, A. Tamilmani (27), was a mechanical engineering graduate from Attur, Salem. He approached the consultancy run by the couple in 2014 and gave them Rs. 3.49 lakh as he was promised the job of a design engineer in Australia.\n\nThey also gave him a forged visa clearance. While his persistence helped him get back Rs. 1 lakh, they did not return the balance.\n\nOn a complaint lodged by the victim on Monday, the couple was booked under Sections 468 (forgery for the purpose of cheating), 471 (using as genuine a forged document or electronic record) and 420 (cheating and dishonestly inducing delivery of property) of the Indian Penal Code and 10 read with 24(i)(b) of Emigration Act, 1983. The two were remanded.\n\nBomb hoax\n\nA bomb hoax saw hundreds of people at a mall on Avanashi Road leave the building in just minutes on Monday.\n\nThe police said that a group of youth were saying that a bomb they planted in the building was expected to go off around 9 p.m. at the parking lot. A person, who heard this, informed the police, who rushed to the spot around 8.30 p.m.\n\nLed by Assistant Commissioner of the East Sub Division (Law and Order) K. Sundarrajan, the police and bomb detection and disposal squad along with a sniffer searched the place. The public were evacuated from the place. On confirming that it was a hoax, the police decided to allow visitors around 9 p.m. But by then, almost everyone left the place and many shops decided not to open till the next morning.\n\nCase registered\n\nThe Selvapuram police have registered a case against five goldsmiths for allegedly cheating a fellow goldsmith, K. Manoharan (54) of Ashok Nagar in Selvapuram, by usurping 172 g of gold jewellery.\n\nThe police said that the case was registered based on a direction Manoharan received through court. It is learnt that Manoharan gave 20 gold chains that totally weighed 172 g to the five persons to make pure gold ingots, but they allegedly cheated him. The police registered the case under Sections 406 (criminal breach of trust) and 420 (cheating and dishonestly inducing delivery of property) of the Indian Penal Code.\n\nHouse burgled\n\nUnidentified persons burgled the house of T. Manopal (26) of Srinithi Garden in Thaneerpandhal near Peelamedu when there was nobody at home from the late hours of Saturday to Sunday morning. The Peelamedu police quoted the victim as saying that a laptop and a gold chain was stolen.", 
    "section": "national", 
    "title": "Couple held for cheating overseas job aspirant", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}