{
    "author": [], 
    "text": "ERODE\n\nBannari Amman Institute of Technology: International Women’s Day, presentation of Women of Excellence and Best Women Alumna Awards by J. Mohanasundari, Managing Director, Sharp Industries, Coimbatore, BIT president S.V. Balasubramaniam presides, 10 a.m.; LIONZERA 2K16 - National-level Technical Symposium by Civil Engineering Department, 9.00 a.m.\n\nSree Amman Arts and Science College: Annual Day, College Founder and Chairman T. Jayalakshmi inaugurates, 10 a.m.\n\nM.P. Nachimuthu M. Jaganathan Engineering College: International Women’s Day celebration, keynote address by Valarmathi Gunasekaran, Java Networking Developer, New York City, college Correspondent Vasantha Sudhanandhen presides, 10 a.m.\n\nRoyal Chettinad Hotel: International Women’s Day celebration, talk by Kirtanya, CEO, Mind Fresh, Chennai, 10 a.m.\n\nErode Sengunthar Engineering College: International Women's Day celebration, talk by S. Aanandhi, Divisional Engineer, BSNL, Erode; Subhashini K. Prasath, Mainframe Storage Administrator, Tata Consultancy, Chennai; and Sasikala, Delivery Manager, CapGemini India Pvt. Solutions, Bengaluru, 10.30 a.m.\n\nSALEM\n\nPeriyar University: Women’s Study Centre, International Women’s Day celebrations, C. Swaminathan, Vice-Chancellor, inaugurates, T. Anuradha, Designated Officer, Tamil Nadu Food Safety and Drug Administration Department, and Vani Pujarui, chief obstetrician, J.S. Hospital, speak, 10.30 a.m.; Village Adoption Scheme, Department of Sociology and Department of Textile and Apparel Designing, short term embroidery training programme for the SHG members, valediction, B. Dharmalingam, Director, Alagappa Career Development Centre, chief guest, M. Manivannan, Registrar, presides, 12.30 p.m.\n\nJunior Jaycees Wing of the Periyar Institute of Management Studies: Special health awareness programme ‘Health awareness in girls’, 3 p.m.\n\nThiagarajar Polytechnic College and Sona College of Technology: Sona-Thiag Fiesta, International Women’s Day, Shylaja Chetlur, media artiste and filmmaker, and G. Rubalakshmi, MD, GRD Bio-Clinical Research, Namakkal, chief guests, 10 a.m.\n\nAVS College of Engineering: International Women’s Day, Lakshmi Siddhartha, Director, TMS Eye Hospital, chief guest, K. Kailasam, Chairman, presides, 10 a.m.\n\nThe Kavery College of Engineering, Mecheri: Women Empowerment Cell, International Women’s Day, N.C. Nandhini, Chief Civil Surgeon, Government Hospital, Mettur, chief guest, S.K. Elangovan, secretary, presides, 11.30 a.m.\n\nSona College of Technology: Department of Information Technology and IEI IT student chapter, Port-2016, valediction, 5 p.m.\n\nAVS Engineering College, Ammapet: Women’s Forum, International Women’s Day, Anitha, ARMC-IVF Fertility Centre, chief guest, 2.30 p.m.\n\nSalem Railway Division: Women Empowerment Resource Centre and Divisional Staff Benefit Committee: International Women’s Day celebrations, Railway Officers Club, 10.30 a.m.\n\nSalem Jamathul Ulama Sabai and Noorul Islam Jamath: Bayan for women, Ammapalayam Women Maqtab Madrasa, 11.15 a.m.\n\nNAMAKKAL\n\nThangam Cancer Centre: International Women’s Day, honouring outstanding women and cancer awareness programme, V. Vanitha, DIF of Police, Coastal Security Group, V. Dakshinamoorthy, Collector, and others speak, M. Jayanthi Violet, Principal, Government Namakkal Kavignar Ramalingam Government Arts College, inaugurates exhibition, Hotel Golden Palace, 9.30 a.m.\n\nPaavai Educational Institutions: International Women’s Day, C. Lavanya, Government Veterinary College, chief guest, N. V. Natarajan, chairman, presides, 10 a.m.\n\nMahendra Engineering College: Academic leadership workshop for heads of departments, P.B. Kotur, GM, Wipro Mission 10X, chief guest, M. G. Bharathkumar, chairman, presides, 9.30 a.m.\n\nPaavai Polytechnic College: NSS special camp, Panchayat Union Elementary School, Kurukkupuram, 3 p.m.\n\nTIRUCHENGODE\n\nK.S.R. Institute of Engineering and Technology: Women’s Day, Nalini Sampathkumar speaks, 4 p.m.\n\nKOMARAPALAYAM\n\nExcel Engineering College: Department of Civil Engineering, national-level technical symposium, N. Saileswaran, MD, National Repair and Restoration Company, Salem, chief guest, V.K. Shunmuganaathan, Principal, presides, 10 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}