{
    "author": [
        "R Sujatha"
    ], 
    "text": "Difficult to improve facilities on current fee structure, say representatives\n\nPrivate engineering colleges are not expecting a fee revision in the next academic year as they feel a new government may play it safe.\n\nRepresentatives of private engineering institutions, who participated in the elaborate exercise of determining an acceptable fee structure for the national committee set up by the All India Council for Technical Education, are also not enthused.\n\nThe Justice Sri Krishna Fee Committee report, which is on the council’s website, has provided an elaborate break-up of the requirements for a college. It provides options for three categories of cities as classified by the VI Pay Commission.\n\nFor instance, the committee has fixed a maximum cap of Rs.1,44,900 to Rs.1,58,300 a year for colleges offering four-year BE/B Tech, depending on where they are situated.\n\n“Fee revision was done in 2012 and it was due last year, but the government did not take it up. The committee’s fee guideline is 60 per cent more than what the State government has fixed currently,” reasons K. Paramasivam, president, Association of Managements of Coimbatore Anna University Affiliated Colleges. Since the council itself was in limbo for nearly a year and without a chairman for many months, private engineering college representatives question the relevance of the report.\n\n“We have been representing repeatedly to Anna University about the difficult situation smaller colleges are in,” says secretary of the ssociation A.K. Natesan.\n\n“Anna University has announced a scheme to upgrade colleges with new machinery. But many college buildings are hypothecated and we pay steep interest rates. It will be difficult to take up any improvement with the current fee structures,” he adds.\n\nA college official in Puducherry said since the Union Territory also had a fee committee it was still uncertain whether the council’s report would be taken as the last word.\n\nS. Vaidhyasubramanian, Dean of Planning, SASTRA, however, felt that the committee’s “recommendation may be harmoniously adopted to ensure uniformity and encourage transparency. There is room for institutions with advanced facilities to have a 20 per cent increase, and anyway markets will decide how ‘advanced’ the facilities are,” he said, arguing for the implementation.", 
    "section": "national", 
    "title": "Engineering colleges expect no fee revision", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}