{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Public Works Department has completed eviction of encroachers along Perumpallam - Nanjai Uthukuli irrigation canal after a week of sustained operation.\n\nThe marathon operation that required the Public Works Department to demolish as many as 574 houses constructed without approval also warranted active participation by the Police, Revenue and Survey Department staff.\n\nOnly one structure, an apartment with a few houses at 46 Pudur, has not been levelled, since a final court clearance was awaited, sources said.\n\nThe PWD is required to submit a report on the eviction operation to a Madras High Court Bench during this week.\n\nThe operation followed a representation made to the High Court by Tamizhaga Vivasayigal Sangam stating that blockage of the irrigation canal over two decades has affected irrigation in 2,500 acres.\n\nThe dredging of the canal to a substantial length was carried out by Olirum Erodu Foundation earlier.\n\nBy and large, the occupants cooperated with the authorities by removing the belongings themselves.\n\nA section of the evicted people has understandably expressed disgust to the district administration suspecting the PWD’s leniency towards a commercial concern along Chennimalai Road, while carrying out the operation.\n\nThe Revenue Department will shortly carry out a re-survey based on old records at the location to allay public apprehensions, sources said.\n\nIn the next stage, the encroachments in the anicut that receives seepage water from Lower Bhavani Project canal will be removed to restore its original size of close to 12 acres.\n\nNearly half of the anicut area has been encroached. The measurements were taken in the last two days, and occupants in unauthorised structures will be issued notices shortly, it is learnt.\n\nGroundwater\n\nThe Nanjai - Uthukuli canal, once restored to its original size, will also enable in recharge of groundwater in Kasipalayam, Shastrhi Nagar, Lakhapuram, Nanjai Uthukuli and a few other localities.", 
    "section": "national", 
    "title": "Eviction of encroachers concludes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}