{
    "author": [
        "K Raju"
    ], 
    "text": "More than 100 farmers from 15 villages under Kudaganar River Ayacut thronged the Collectorate here on Monday, demanding withdrawal of a plan to construct an additional dam near Athoor Kamarajar dam.\n\nThe State government had sanctioned Rs. 70 crore for construction of an additional dam near Athoor dam to create additional storage facility for ensuring daily water supply to all residents, they said.\n\nConstruction of another dam would wipe out farm activities on 6,000 acres of fertile land at 15 villages, affecting thousands of farmers. Excess water from Athoor dam had been used to fill Thamaraikulam, Havildhar kulam, Ainthan kulam, Brahma Samudhram, Kottur and Avarampatti tanks for indirect irrigation. Before the construction of Athoor dam, the entire ayacut was a triple-cropping area, said R. Sundararaj, president of Kudaganar Farmers Association, Mylapore.\n\nAt present, half of the flow in Kudaganar river had been diverted towards south at Pullaveli before it reached Athoor dam. A sizable quantum of the remaining water was also diverted again to fill three tanks in Sempatti and Nilakottai before reaching the dam.\n\nOnly a reduced quantum of water reached Athoor dam. But the water overflowing from the dam was being used to fill Thamaraikulam and other tanks for irrigation of Kudaganar River Ayacut. Excess flow was the only source to recharge groundwater and irrigation and drinking water wells at 75 villages on both sides of river between Athoor and Azhagapuri dams, they claimed.\n\nConstruction of another dam would stop the flow in the river, destroying all drinking water and irrigation sources, and wipe out food production of 1,500 tonnes per season. Already, the western side of the river was affected owing to discharge of tannery effluents into Kudaganar river. If there were no flow in the river, tannery effluents would percolate into fertile land on the eastern side, farmers said.", 
    "section": "national", 
    "title": "Farmers oppose plan for additional dam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}