{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "‘Parents and teachers should stop focussing on results so much and be supportive of students’\n\nFor parents of children in classes X and XII, March is probably the most stressful month of the year. But combating stress at this point is crucial, say experts, and there are a number of ways parents and teachers can help students get through the exam season.\n\n“First off, a routine should be created. This is important, as it allows students to relax when they know what comes next. Along with studying, there must be a component of physical activity – twice a day for about half-an-hour each,” said Shiva Prakash Srinivasan, a child psychiatrist associated with the Schizophrenia Research Foundation.\n\nSince this is a period where students revise, teachers should ensure they consolidate their pre-existing knowledge rather than acquiring more, he said.\n\n“Parents and teachers should also stop focusing on results so much. They should tell students to do their best and finish their exams. The results then are not in anyone’s hands. They have to focus on the students’ current efforts, and reinforce them,” he said.\n\nAllowing children to express their fears and anxieties without inhibitions is also important, said V. Jayanthini, a city-based child psychiatrist.\n\n“Effective communication between parents and children from a very young age onwards is needed. Parents need to motivate their children and allay their fears – but the way in which they do this is significant. Emotional support is very necessary for children,” she said.\n\nReassuring children\n\nAsking children how you can help them, boosting them on up on their strengths and reassuring them that the efforts they are putting in will get them appropriate results can all help, the doctors said. “If there is a problem, parents should seek help. Consult another member of the family, a friend or get professional help. If parents feel students are over-anxious, worried or upset, it is best to get help as early as possible to prevent future problems,” Dr. Jaynathini said.", 
    "section": "national", 
    "title": "How to reduce stress levels this March", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}