{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Adimai Thiramum Aatral Thiramum’ by K. Manoharan, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: ‘Thanigai Puranam’ parayanam, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruppugazh’ by R. Umarani, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Tirumandiram’ by N.S. Sundararaman, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Amarnath Lingam darshan, Victoria Edward Hall, West Veli Street, 7 a.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: D.K. Subramaniam, former Head, Department of Tamil, Madura College, speaks on ‘Historiographical perspective of Natanagopala Nayaki Swamigal, 10.30 a.m.; of Tirumazhisai Alwar, Seminar Hall, School of Religions, Philosophy and Humanist Thought, 2.30 p.m.\n\nAmerican College: International Women’s Day celebration; Keerthi Priyadarshini, Deputy Collector, addresses, Main Hall, 11 a.m.\n\nMadura College: P. Hamsapriya, Principal, Mahatma CBSE School; S. Shanthi, Deputy Corporation Commissioner, and D. Kothai, Managing Director, Sri Ramalinga Spinners, address; D. Ramasubramanian presides, 9.30 a.m.; ‘patti mandram,’ K. Muthuvel moderates, 2 p.m.; cultural programme, Sankara Iyer Hall, 3 p.m.\n\nLady Doak College: Veni, entrepreneur, inaugurates International Women’s Day celebration, 9 a.m.; Tamizhachchi Thangapandian addresses, G. J. Auditorium, 2 p.m.\n\nThiagarajar College: Radha Thiagarajan remembrance day; Anandavalli Mahadevan, former Vice-Chancellor, Mother Teresa Women’s University, addresses; K. Thiagarajan, secretary, presides, Tholkappiar Arangu, 10.30 a.m.; NSS camp, P. Silaiman, 9 a.m.\n\nSaraswathi Narayanan College: International Women’s Day celebration, M. Kannan, Principal, presides, 11.30 a.m.\n\nMannar Thirumalai Naicker College: S. Subbulakshmi, Principal, Government Music College, speaks, Lakshmi Ammal Veerappa Naicker Auditorium, 11.30 a.m.\n\nMadurai Institute of Social Sciences: Bama Raja, vice-chairman, addresses, Alagarkoil Road, 11.30 a.m.\n\nSLS MAVMM Ayira Vaisyar College: K.V. Manimekalai, Principal, Crescent College of Education, addresses; M. Arunagiri, Principal, presides, Kallampatti, 10.30 a.m.\n\nNMS Sermathai Vasan College for Women: Anitha Devi Jothikumar and Muhil Amirtharaj address, Avaniapuram, 10 a.m.\n\nFatima Michael College of Engineering and Technology: A. Sendhil Lakshmi addresses, M. Stalin Arockiaraj, chairman, presides, Sivagana Road, 1.30 p.m.\n\nM. S. Chellamuthu Trust and Research Foundation: M. M. Jeyalakshmi, journalist, and R. Muthiah, Deputy General Manager, Indian Bank, address, Vriksha, 19 A Sudalaimuthu Pillai Lane, 3 p.m.\n\nDream Zone School of Creative Studies: Inauguration of Aesthetics ‘2016 by C. Swarnalatha of Anna University, Andalpuram, 9 a.m.\n\nCommittee of Hosts: Felicitation to Henri Tiphagne, recipient of Amnesty International Germany’s Human Rights Award; Vrinda Grover, Ruth Manorama, P.V. Rajagopal, N. Sethuraman and P. Nedumaran address, PTR Hall, Race Course Road, 5.30 p.m.\n\nTamil Nadu Council for Enterprise Development: Herbal business meet; K. Eswaran speaks, M. Jeyakumar presides, Simmakkal, 10 a.m.\n\nRotary Club of Madurai Star: Dharani Kesavan speaks on ‘Stress management,’ JC Residency, Lady Doak College Road, 6.30 p.m.\n\nV.A. Annamalai Padmavathi Trust: Medical camp for women, Devadoss Multispeciality Hospital, Alagarkoil Road, 10 a.m.\n\nAlcoholics Anonymous: Meeting, St. Mary’s Higher Secondary School, East Veli Street, and De Nobili Pastoral Centre, K. Pudur, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}