{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A three-day residential-cum-outbound training programme on ‘Effective Public Speaking and Corporate communication skills for MBA students’ was held at Yercaud hill station here recently.\n\nOrganised by the Periyar Institute of Management Studies (PRIMS), C. Swaminathan, Vice-Chancellor of Periyar University, said that the university is taking all steps to nurture the students as readily employable through various programmes and workshops along with imparting domain and subject knowledge.\n\n“The job market for MBA students is rising and it is up to the students to avail the opportunities that are coming on their way,” he added.\n\nThe Vice-Chancellor further said that though the university MBA students are groomed through various pedagogical methods like classroom lectures, assignments, case studies, field visits, internships and projects, a programme like this will foster the learning of the students about various skills much better. Hence, the university had taken the steps to organise the residential training programme for the MBA students at Yercaud hill station for three days, he added.\n\nThe inaugural programme was held at the Boat House Training hall of Hotel Tamil Nadu, Yercaud.\n\nN. Rajendhiran, Professor-Cum-Director, PRIMS, presided over the function while Dr. Selvarangan, Chief Executive Officer of Rishi Nethralaya Hospital, Salem inaugurated and delivered the special address. J. Senthil Velmurugan, Syndicate Member, Periyar University also spoke.\n\nThe programme was aimed at broadening the horizon of thinking and strengthening the skills of MBA students on public speaking and corporate communication, mastering the stage fear, acquiring basic skills of public speaking, structuring the speech, group discussion skills, interview skills, presentation skills, gestures, body language skills, manners and etiquette were some of the aspects students were trained.", 
    "section": "national", 
    "title": "Management students asked to utilise opportunities in job market", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}