{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Ready for an open debate with any State Minister, says M. K. Stalin\n\nStating that the AIADMK government had failed to deliver the goods on all aspects of governance, DMK treasurer M.K. Stalin on Sunday said that the women folk would unseat the AIADMK regime in the Assembly elections.\n\nSpeaking at the DMK’s women’s wing meeting held here, he said that the people, irrespective of caste, religion and gender, have been literally waging a war to vote out the “anti-democratic and anti-people” and “unpopular” government in the State elections. The time had come for them to register their anger by exercising their democratic right.\n\nCalling for an open debate with any Minister, he said Chief Minister Jayalalithaa had totally failed to implement the electoral promises made when she sought votes in the last Assembly elections.\n\nMost of her announcements were still on paper. She had announced the scheme of providing mobile phones to the Self Help Group members. But, it took about five months to start the scheme.\n\nListing out the failures of the government during the last five years, he said the State financial position had taken a severe hit due to the mismanagement and maladministration. When Jayalalithaa took over the reigns five years ago, it was said that the total debt of the State government was hovering around Rs.91,000 crore. But, it has multiplied. The irony was that she had laid foundation stones a few days ago for various schemes to the tune of Rs.15,198 crore. Where the Government would find resources for the schemes when the State was facing financial crunch, he asked.\n\nDMK MP, M.K. Kanimozhi, who presided, charged that the crime against women had seen dramatic increase in the AIADMK government. More than 21,000 cases of crime against women had been registered in the State during the last five years, she claimed.", 
    "section": "national", 
    "title": "“No security for women in TN”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}