{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Seek political consensus for passing reservation Bill\n\nGovernor K. Rosaiah, Chief Minister Jayalalithaa and senior political leaders of the State have extended their greetings on the occasion of International Women’s Day being celebrated today.In his message, Mr. Rosaiah observed women were the pillars of society and improving their status would bring about the development of the family and the nation.\n\n“Let us dedicate ourselves towards the cause of women upliftment and empowerment, eliminate all forms of discrimination and violence against women, safeguard their dignity and ensure their safety,” his message released by Raj Bhavan stated.\n\nChief Minister Jayalalithaa, in her statement, listed out the initiatives taken by her government for the upliftment of women; she also referred to the recent Bill passed in the Assembly which sought to increase the percentage of reservation for women from 33 to 50 in local bodies.\n\n“I extend my greetings for Women's Day by wishing women that they overcome all adversities with self confidence and hard work by turning them into steps to victory,” Ms. Jayalalithaa said.\n\nDMK leader M. Karunanidhi called upon political parties to support the Bill to provide 33 per cent reservation for women in legislative assemblies and in Parliament.\n\nIn his message, he said the Bill was introduced during the UPA regime in which the DMK was a partner. “But it could not be passed. All political parties should come together to ensure it becomes a reality,” he said.\n\nDMDK founder Vijayakant said though there have been demands to reserve one-third of seats in the assembly and Parliament for women, the rulers are not willing to implement it. Claiming that women who lost their husbands and sons to liquor have been suffering every day, he said, “There should be awareness among women to put an end to this.”", 
    "section": "national", 
    "title": "On women’s day, leaders swear by flower power", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}