{
    "author": [
        "R Arivanantham"
    ], 
    "text": "Over 2,000 cashew nut processing units across the State, including 535 in Kanyakumari district, downed shutters for two days from Monday, demanding withdrawal of 9.36 per cent duty imposed on import of raw cashew in the Union budget.\n\nM.P. Jayachandran, general secretary, Cashew Factory Owners’ Development Association of Tamil Nadu, told The Hindu that though the government was giving back 5 per cent of import duty while exporting the processed nuts, the factory owners could not bear the brunt as the industry was already in doldrums due to shortage of raw materials and not getting remunerative prices for the processed nuts.\n\nIn a memorandum faxed to Union Minister of State for Commerce and Industry Nirmala Seetharaman, the association said that “the import duty has been levied on import of raw cashew nut when the industry is facing trouble due to exorbitant cost of raw materials in the international market, coupled with domestic processing cost, which has affected the industry as a whole”.\n\nThe industry, which provided employment to over two lakh women, was resorting either to shutdown or restricting processing and production to one or two days a week. This had had a cascading effect on the livelihood of families depending on the industry. The budget announcement and subsequent notification, dated March 1, enhancing the import duty to 9.36 per cent, were unacceptable, the association said.\n\nIt feared that if the notification was brought into force, the cost of raw nut would go up by at least Rs. 10 per kg.\n\nThe hike in import duty on raw cashew would paralyse the industry and this would be in conflict with the present policy of the government to promote small scale industries, Mr. Jayachandran said.\n\nHe said that the industry was wholly dependent on import of raw cashew from Nigeria, Tanzania, Mozambique, Ivory Coast and Ghana and the condition to export one kg of processed nut for every four kg of raw cashew was not feasible, he said.\n\n“Withdraw 9.36\n\nper cent duty imposed on\n\nimport of raw cashew”", 
    "section": "national", 
    "title": "Over 2,000 cashew nut units down shutters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}