{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Polling booths, flying squads and video surveillance teams will soon be in place\n\ngearing up for polls:With the model code of conduct in force, workers are busy whitewashing wall paintings across the district.- Photo: C. Venkatachalapathy\n\nWith the Assembly polls two months away, works for the smooth conduct of the elections and compliance with the model code of conduct is underway in the district.\n\nAmong the initial set of works, is removing political hoardings and wall paintings by political parties. Keeping in line with the model code of conduct, which came into force on March 4, the district administration has engaged workers to whitewash paintings on walls by political parties.\n\nInspection\n\nOn Monday, Collector R. Nanthagopal inspected the works to remove the political wall paintings on Arni Road, Marakadai Street and near National Theatre in Vellore Corporation limit.\n\nA total of 3,439 booths will be established in Vellore district for the Assembly elections that would be held on May 16.\n\nAs per the electoral roll published on January 20, 2016, there are a total of 30,13,042 voters in the district - 14,88,256 men, 15,24,721 women and 65 transgenders.\n\nTo monitor violations of the model code of conduct in the 13 constituencies of Vellore, there will be 39 flying squads, 39 standing teams and 13 video surveillance teams.\n\nAlready, Mr. Nanthagopal, who is also the district election officer, has outlined the rules and regulations to officials and political party representatives during meetings. Wall posters, hoardings, political party symbols should be removed by the local bodies in their respective limits.\n\nNo new government scheme should be implemented, and new beneficiaries should not be enrolled in schemes already in force. In addition, there should be no new allotment of funds for schemes, and this would apply for funds of MLAs and MPs too.\n\nFlying squads\n\nThe flying squads would look into complaints of model code of conduct violations and take appropriate action. They would also look into complaints of gifts being presented to voters, distribution of liquor, food and cash, and movement of anti-social elements in a bid to threaten voters. They will also act on complaints regarding election-related expenditure.\n\nPublic can put forward complaints to the district complaints monitoring centre and district election control room on toll free number – 18004257014, and land line numbers 0416-2254500 and 2254400.\n\nThe complaints will be forwarded to the respective flying squad for appropriate action.", 
    "section": "national", 
    "title": "Preparations for conduct of Assembly polls under way", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}