{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Petrol pump needed\n\nRajiv Nagar and Shanmuga Sigamani Nagar are recently developed residential areas in Kovilpatti where most of the houses have either a two-wheeler or four-wheeler.\n\nTo fuel their vehicles, the residents have to go to either the main road or Ettayapuram Road which is far away.\n\nIf a petrol pump is provided on the Pasuvanthanai Road, it will cater to the needs of these areas.\n\nT. Manoharan,\n\nKovilpatti\n\nRoof over platform\n\nEveryday, 14 trains pass through Palayamkottai railway station and these are used by hundreds of students, teachers, office-goers and labourers. Since there is no roof on the platform, commuters find it very difficult to wait for trains during summer and in rainy season.\n\nThe railway authorities should take immediate steps to construct a roof over the platform, which should also be provided with protected drinking water, toilet and minimum seating arrangements.\n\nP. Victor Selvaraj,\n\nPalayamkottai\n\nAdvertisements\n\nA few days back, when I was in Bengaluru, I witnessed a few volunteers removing advertisement posters and small hoardings nailed or tied to the trunk and branches of trees on the roadside and I learnt that they belonged to an organisation called ‘Save Green.’ This service is done by them on Sundays. This kind of drive is the need of the hour in Tirunelveli and Palayamkottai also where advertising on roadside trees is on the increase. The advertisers are not aware that nailing boards on trees will stunt their growth. There are certain NGOs here which aim at planting saplings on the roadside and I wish such organisations can save the trees by removing the hoardings. Student-volunteers belonging to Youth Red Cross, Scouts and Guides and citizen activists may take up the initiative.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai\n\nSeepage in channel\n\nKottiady irrigation channel of Kanyakumari district is a concrete structure. As seepage was noticed in the channel, the Public Works Department floated tender for plugging it. Though the work has been completed, the seepages in the channel still remain unplugged. As the channel is leaky, water stagnates around the nearby habitations much to the inconvenience of the public.\n\nK. Chelliah,\n\nAundivillai\n\nProvide toilets\n\nI feel so happy that the KKNPP has donated garbage collection autorickshaws to eight village panchayats under Radapuram union ( The Hindu, March 6). It has already donated the same type of autos to village panchayats under the Valliyoor union. At this juncture, I request the KKNPP Project Director to pay attention to the health and hygiene of the residents of coastal villages that are close to the project and the township. Most of the houses do not have toilets. I request the Project Director to pay special attention to this issue and take steps to provide toilet facilities at these villages.\n\nS.J. Sylvestine,\n\nKoottapuly", 
    "section": "national", 
    "title": "Readers’ Mail (Tirunelveli)", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}