{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Last year, Corporation carried out road repair works with Rs. 25 crore\n\nENTIRELY COVERED:There is no space left for greenery on the sides of roads where the City Corporation has undertaken re-laying work in Erode. —PHOTO: M. GOVARTHAN\n\nGreenery created in front of houses in residential localities in the city is getting removed at places where the City Corporation is now in the process of re-laying roads.\n\nWhile well-grown trees are not chopped, the smaller ones are being removed as the entire breadth of road in front of the houses will have to be levelled and black-topped for better compaction, City Engineer Arumugam said.\n\nIn most of the residential localities, it is not uncommon to find greenery only outside the compound walls since almost the entire private space is occupied by the buildings. The culture of leaving space inside the compound wall is seemingly not prevalent in middle-class localities. It is to recompense for the absence of greenery inside the compound walls that the people had been utilising the space between the road and the wall for raising trees and plants.\n\nThe residents in Moolapalayam where the road re-laying work is now in progress and a few other places, including Sri Lakshmi Garden, where the relaying of the main road has been completed are relieved about the quality of the surface, but are apprehensive about the radiation impact during hot summer months in the absence of greenery in front of their homes.\n\nBut, according to road contractors, compaction is vital for improving the load-carrying capability of the roads. Since the re-laying of roads is being carried out along with construction of storm water drainages, permeability of water and air and the susceptibility of the surface to rutting is prevented, an engineer-cum-contractor explained.\n\nThe residents, according to Corporation officials, will have to put up with the inconvenience for now.\n\nA leading Non-Government Organisation Aram Sei has been entrusted with the responsibility to plant saplings in rows with minimal damage to the road surface after the relaying work is completed, it is learnt.\n\nThe main roads in almost all residential localities are expected to be re-laid with the Rs. 86 crore sanctioned by the State Government earlier this year. Under the initial phase late last year, the Corporation carried out road repair works with Rs. 25 crore.", 
    "section": "national", 
    "title": "Road re-laying: temporary erosion of greenery on sides inevitable", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}