{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Poll-related complaints can be registered by phone\n\nCollector M. Karunakaran on Monday inaugurated round-the-clock election control room on the Collectorate premises here where the public can register poll-related complaints through the toll-free number 18004257041.\n\nThe public can also contact 0462 – 2501172, 74, 75, 76 and 79 to register their complaints pertaining to the forthcoming Assembly elections.\n\nSpeaking to reporters after inaugurating the election control room, Dr. Karunakaran said that the public and the functionaries of political parties could register their complaints through the toll-free number. While an official in the rank of Tahsildar would monitor the functioning of the election control room, it would be manned by three officials in the rank of Deputy Tahsildar in three shifts.\n\n“All complaints being received in the control room will be forwarded to the officials concerned for appropriate and immediate remedial measure,” Dr. Karunakaran said. Cheranmahadevi Sub-Collector V. Vishnu and District Revenue Officer M.G. Kulandaivel were present.\n\nPhone numbers of Returning Officers of Assembly constituencies in the district are: Sankarankovil (SC) – 94435 28280; Vasudevanallur (SC) – 95005 90401; Kadayanallur – 94430 79580; Tenkasi – 95540 00478; Alangulam – 99767 14626; Tirunelveli – 94450 00476; Ambasamudram – 94450 00477; Palayamkottai – 94422 18000; Nanguneri – 94450 00379; Radhapuram – 95005 90401.\n\nExclusive booths\n\nThe Election Commission of India, which was keen on encouraging every differently abled voter to cast his or her vote in the Assembly election, had planned to establish exclusive polling booths for them if a particular area had a minimum of 100 such voters, Mr. Karunakaran said in a statement.\n\nIf differently abled persons SMS their Electors’ Photo Identity Card (EPIC) number to 1950, the EC would take steps for establishing a polling booth exclusively for them in areas housing a minimum of 100 such voters, he added.", 
    "section": "national", 
    "title": "Round-the-clock election control room inaugurated", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}