{
    "author": [], 
    "text": "The underground drainage system has been rendered redundant as the sewage treatment plant at Panjapur has been closed. Similar was the fate of the common ETP put up by the textile dyers in Tirupur in the 90s. The authorities think that their job is over after setting up these public utilities at a huge cost. Why there has been no back-up facility in the first place is a puzzle as it is a critical part of an STP. Why should the expensive plant and machinery be exposed to plunderers? The imminent threat is pollution of the Cauvery river leading to health hazards to the people of Tiruchi.\n\nT.M. Ranganathan,\n\nSrirangam\n\nRestore speed-breakers\n\nThe South Devi Street-Subramaniapuram Road stretch was re-laid sometime ago. But this has put the pedestrians at great risk, thanks to reckless driving. The speed-breakers were flattened on the stretch at many places during the recent relaying works. With the road stretch in the area very narrow, the danger of road accidents is real. The speeding four-wheelers and two-wheelers instil a distinct sense of fear in the minds of pedestrians. The area is frequented by a number of children as two major schools are situated on this stretch. I appeal to the authorities to take steps to erect speed-breakers for the safety of children.\n\nV. Subashini,\n\nSrirangam\n\nA school is on Ammamandapam Road, Srirangam. During peak hours, traffic on the road is heavy. Schoolchildren run here and there on the road. Accidents lurk as there is no speed-breaker on the road near the school. There is no “school zone” or “go slow” signboard. Who will take the responsibility if accidents occur? I request the corporation to do the needful.\n\nAravind K.Rao,\n\nSrirangam\n\nAllow meetings only\n\nat designated spots\n\nWith the date for elections to the State Assembly announced, the election campaign will soon reach a feverish pitch. The district administration should ensure that the election meetings are held only at designated spots. Sometime ago at a meeting with the district administration, representatives of various political parties gave assurances to the officials that meetings will not be held on busy stretches. With the administration reluctant to take on political parties, the situation is back to square one. The district administration should crack the whip at least this time as the code of conduct has come in to force.\n\nJ. Anantha Padmanabhan,\n\nSrirangam\n\nNew address\n\nfor post office\n\nHitherto the Srirangam North Sub-Post Office was functioning at Neduntheru, Melur Road. Recently, it was shifted to a building near Dasavathara Sannidhi, near North Melur Road. I appreciate Not enough publicity has been given about the new address. Many senior citizens and pensioners find it difficult to locate the new premises. I request the concerned authorities to put up a signboard near Neduntheru Junction Bus Stop and also a notice board on the old premises.\n\nVijayalakshmi Bargavan,\n\nSrirangam\n\nOpen academy in\n\nSaravanan’s name\n\nThe Major Saravanan Memorial Trust has appealed to the State Government to rename the Royal Road and Lawsons Road after Major Sarananan. The brave soldier's sacrifice has already been recognised by putting up a “Major Saravanan Square” at Royal Road and Lawsons Road junction. Instead of asking for such renaming the roads, the trust can seek the help of the Government to start an academy in Tiruchi in the name of “Major Saravanan “ to train youths to join the Defence services. There are many other brave soldiers like Major Saravanan who have also laid their lives in defending our country who are yet to be recognised, as it is not practically possible to put up memorials for each one of them in their own towns.\n\nT. Nirmala,\n\nCantonment\n\nRemove encroachments\n\nDespite several appeals, narrow pavements in Thillainagar continue to be encroached by platform vendors, tea stalls, and juice kiosks forcing people to walk on the main road with great risk endangering their lives. At some places, even walls and advertisement flex boards are erected. I request the corporation authorities to remove all encroachments.\n\nA.V. Narayanan,\n\nThillainagar\n\nIssue new ration cards\n\nWe had applied for a new ration card on February 4 and were asked to collect the card after a month. When we went to collect the card, we were told that the new ration card would be issued only after the elections. We were taken by surprise by this reply. In Tamil Nadu, ration card is a basic requirement for address proof and ID proof. Even fresh applications for ration card are not accepted till the election is over. There was a large number of people similarly placed who were disappointed by not getting their ration cards. We fail to understand the logic behind linking issue of ration card to elections. We would like to draw the attention of the election authorities to look into this and issue instructions to enable people get their ration cards.\n\nT.V. Gopalan,\n\nThanjavur\n\nCurb corrupt practices\n\nIn a few months, voters of Tamil Nadu will elect their representatives to the State Assembly. Tiruchi being a highly vigilant district, requires constant education about the duties of citizens, especially bribing of voters. This can be done by the district administration, Election Commission, and the non-governmental organisations. It is heartening that the district administration was the first in the State to implement the code of conduct for the State Assembly elections just minutes after the election dates were announced. This vigilante culture must continue and corrupt practices curbed.\n\nA. Prabaharan,\n\nPuthanampatti\n\nRestore train\n\nTwo decades ago, the Trichi-Chennai Fast Passenger (110) was running via main line. It started around 4.10 p.m. at Tiruchi Junction, and reached Chennai Egmore around 4 a.m. next day. This train was popular as those who do not get tickets in express trains could travel by it without much difficulty. During gauge conversion, this train was stopped and has not been restored after conversion. If this train is reintroduced, it will benefit passengers. It may be run with the same timing as earlier or it may be converted into day-time fast passenger.\n\nDimple R. Mohan\n\nMahalakshmi Nagar East Extension\n\nPoster menace\n\non new bridge\n\nThe new bridge across the Coleroon connects Samayapuram No.1 Tollgate with Tiruvanaikovil. Posters are already pasted on the newly bridge, spoiling its beauty. I request the authorities to take steps to prevent such practice and maintain the beauty of the newly built bridge.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nPost office at\n\na remote spot\n\nThe Post Office at Bikshandarkoil is at a remote location. People have to walk long distance to buy stamps and for other services. People, especially senior citizens, find it difficult to access the post office. The post office used to be in Menaka Nagar, Lalgudi Road, near Tollgate and it was easily accessible to everybody. I appeal to the authorities concerned to find a place that is easily accessible.\n\nS.R. Dasarathan,\n\nTiruchi\n\nClean the roads\n\nSand accumulation has become a nightmare to road users in city. The roundabout at Mannarpuram and the G-Corner grounds have become accidents zones because of bad planning. The accumulated sand should be cleared immediately. Similarly, near Mannarapuram, vehicles are parked near an eatery and this leads to traffic bottlenecks at this location. Will the people at the helm of affairs do the needful to prevent accidents ?\n\nH. Ghouse Baig,\n\nCrawford", 
    "section": "national", 
    "title": "Sad state of affairs at STP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}