{
    "author": [
        "K Raju"
    ], 
    "text": "Rise in production, huge arrivals from other districts lead to a glut\n\nWith a huge arrival of shallots (small onion) from major onion production centres in Dindigul and nearby districts, the wholesale onion market in Dindigul, one of the biggest markets in the State, has witnessed a sharp fall in the prices.\n\nThe drop of a little over 50 per cent in prices of shallots in a month baffled both farmers and traders. The prices of shallots that hovered around Rs. 18 per kg last month came down suddenly to Rs. 8 in Dindigul on Monday.\n\nRegular arrivals from Theni, Andipatti, Dharapuram and Udumalpet were good.\n\nWith sufficient rainfall at the right time, the yield was high in major shallot production centres in the district now, said onion traders in the whole sale market.\n\nThe market received 4,500 bags of shallots on Monday, of which the arrival from domestic production centres, especially Iyyalur, Eriyode and Gujiliamparai, was around 2,800 bags.\n\nIncrease in production and arrivals from neighbouring districts caused a glut in the wholesale market. Exports too did not pick up much in the last one week owing to fresh arrivals of shallots. Exporters preferred matured, completely dry shallots. The shelf life of fresh onions was very short when compared to matured onions, traders added. The farmers were deeply worried over the sudden slump in shallot prices as the existing sale price would not even meet their plucking and transport costs.\n\nThe traders opined that shallot prices would fall further in the months to come as harvesting would be completed in major production centres in the neighbouring districts.\n\nNormally, the wholesale market receives onion in large quantities from Nilakottai, Sengurichi, Gujiliamparai in Dindigul district, and Thuraiyur, Udumalpet and Namakkal, some of the major onion production centres in the State, and from Mysore in Karnataka.\n\nRise in production, huge arrivals from other districts lead to a glut", 
    "section": "national", 
    "title": "Shallot prices fall in Dindigul", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}