{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students of Meenakshi Sagar from Aradhana School of Dance in Coimbatore giving a bharatanatyam recital at Sri Akilandeswari-Jumbukeswarar Temple in Tiruchi on Monday on the occasion of Mahasivaratri.— PHOTO: B. VELANKANNI RAJ\n\nA large number of devotees offered worship to Lord Siva at all major shrines in the district on Monday night on the occasion of Mahasivarathiri festival.\n\nSpecial alankaram was performed to the presiding deity of Lord Siva.\n\nAt Tiruvanaikovil, it turned to be a festival of dance, with artistes from different parts of the State performing dance recital all through the night.\n\nDisciples of various dance schools and institutions vied with one another in presenting their recital. Interestingly, they chose the “kirtans” and hymns composed by saints and swamijis in glory of Lord Jambukeswarar.\n\nFor instance, the students of the Salangai Academy, gave a performance titled “Salangai Natyanjali”. They classified their performance into Bharatanatyam, Mohiniyattam, and “Margam on Appu Lingeshwar”.\n\n“Our students have been using this festival to dedicate their talents at the Feet of Lord Jambukeswarar for the past two decades,” said Mukundan and Vijaya Mukundan, principal of the academy.\n\nIn all, 14 students from the academy participated in this year’s event. Sridev presented vocal support, Veeramani on the violin, and Nellai Hariharasundan on the mridangam.\n\nAnother artiste, Meenakshi Sagar from Aradhana School of Dance in Coimbatore, said that her 16 disciples had meticulously chosen compositions suited to Sri Jambukeswarar temple.\n\n“For instance, the popular composition Jambu patthae by Muthuswamy Dikshitar provides the detailed description about the presiding deity of this shrine,” she said.\n\nTheir performance also included recital on hymns sung by Saivite stalwarts in glory of this temple.", 
    "section": "national", 
    "title": "Sivaratri celebrated with dance", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}