{
    "author": [
        "S Senthalir"
    ], 
    "text": "In the small tourist town of Puducherry, women are slowly but surely storming male bastions. We have had women turning entrepreneurs, signing up as bus conductors and now even drive autorickshaws.\n\nThirty-seven-year-old Jaya Gowsalya from Vanarapet is one such person. Deserted by her husband in her early thirties, she had to shoulder the responsibility of bringing up two young children.\n\nSporting a bindi with vermilion on her forehead, she drove towards the beach road to meet us on the eve of the International Women’s Day. A reticent person, Ms. Gowsalya slowly opens up to talk about her life as a woman autorickshaw driver in Puducherry.\n\n“I was compelled to take up a job to bring up my children. Since my husband was an autorickshaw driver, this seemed a familiar field,” says Ms. Gowsalya.\n\nClad in a yellow saree and brown uniform over it, she adjusts her position on the driver’s seat to share what motivated her to take up to driving autorickshaw. “I have studied only till Class IX. Once I chanced upon a woman autorickshaw driver called Lakshmi. Seeing her, I immediately decided to work like her. I asked her to help me get a licence and permit to drive autorickshaw. In December 2011, I got the licence and started driving autorickshaw in 2012,” says Ms. Gowsalya.\n\nThere might be at least 10 women driving autorickshaws in this town. “Initially, people warned me not to take up this work as it is not considered safe for a woman to drive an autorickshaw. I once faced a problem with a drunken man. However, male auto drivers helped me out. After that incident, I never had any discomfort so far,” she says.\n\nHowever, she adds: “The number of people from different places coming to Puducherry to consume alcohol has increased over the years. They create problems and pose a risk to women autorickshaw drivers. But, then this is not uncommon in any other city.”\n\nDespite all these odds, she continues to work even on weekends with her mother being a pillar of support.", 
    "section": "national", 
    "title": "Storming a male bastion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}