{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Both the groups clash over what constitutes Tamil identity\n\nWith Dravida Munnetra Kazhagam facing severe criticism for its perceived failure to intervene in the final stages of the Sri Lankan civil war in 2009, the Tamil nationalist space occupied by smaller fringe Periyarite and Dravidian groups has come to be dominated by a much more fierce form of Tamil nationalism articulated by the likes of Naam Tamilar Katchi (NTK), headed by filmmaker-turned politician Seeman.\n\nThis development has led to a face-off between the Dravidian ideologues on one side and Tamil nationalist ideologues on the other. While the Tamil nationalists say that Dravidian ideology is enslaving the Tamils even as it elevated those hailing from a non-Tamil lineage into positions of power, the Dravidian ideologues say that the Tamil nationalism as articulated today is a mask for ‘glorification of casteism’.\n\nWhile fringe parties that speak of Tamil nationalism have always allied themselves either with Periyarite or Communist groups, the new form of Tamil nationalism, as put forward by the NTK, has raised a question mark on what constitutes the Tamil identity.\n\n“Nationalism must have a positive content; it cannot be based on birth as it is the case with the caste system,” says Viduthalai Rajendran, general secretary, Dravidar Viduthalai Kazhagam. “In TN, Arundhathiyars, one of the most oppressed communities in Tamil Nadu, speak Telugu and Kannada. For the NTK, they are not Tamils. An ideology that alienates the oppressed cannot be considered good for the society,” he maintains.\n\nFailure of 2 Dravidian parties\n\nThe failure of the two big Dravidian parties to advance social justice and provide a non-corrupt government has created a political void, which other parties are hoping to fill up. A.R. Venkatachalapathy, historian and currently a professor at the Madras Institute of Development Studies, says that Dravidian parties have failed to carry forward the ideals of their movement. “The idea of social justice has been reduced to ensuring reservations while caste injustices have gone unaddressed,” he says.\n\nSpeaking about Tamil nationalism as it exists today, he says, “There is no strong democratic content in it. These groups have an ambiguous attitude to caste, religious minorities. Without directly confronting caste inequities and injustices head on, it is not possible to forge a Tamil identity. You cannot get rid of caste system by simply uniting as Tamils.”\n\nWhen asked to respond to criticisms levelled against Tamil nationalism that it is a conduit for caste-based rule and that it ‘others’ linguistic and other minorities in the State, Packiarajan Sethuramalingam, media co-ordinator, NTK, says that it is wrong to project his party and its politics as ‘fascist’ and ‘casteist’.\n\nHe added that NTK’s official policy is not to give tickets to those from numerically strong dominant caste in constituencies.\n\n“In over 16 regular constituencies, we have announced candidates from scheduled caste communities. Which Dravidian or Communist party that claims to annihilate caste and poverty has done this? We have realised that we cannot allay the fears of alienating non-Tamils through our words; we will show how progressive we are through our actions,” he says, adding, “Let time decide whether it is viable.”\n\n‘The idea of\n\nsocial justice has been reduced\n\nto ensuring reservations’", 
    "section": "national", 
    "title": "Tamil nationalists, Dravidian ideologues locked in battle", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}