{
    "author": [], 
    "text": "RELIGION\n\nSri Srinivasa Perumal Temple, BHEL Township : Brahmotsavam, Simha vaganam, 6 a.m.; thirupaithadu thirumanjanam, 3 p.m.; Yanai vaganam, 7 p.m.\n\nArulmigu Aivannanathar Temple Vara Vazhipattu Mandram : Nayanmar guru pooja, abishekam, aradhana, Woraiyur, 6.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam,Vinayagar Temple, Sri Vignesh Paradise, Melur Road, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 16, Thirunavukkarasar Street, Ayyappa Nagar, 6 p.m.\n\nCULTURE\n\nKalai Kaviri College of Fine Arts : International Women’s Day – record attempt at dance and music show, K.Meen, former vice chancellor, Bharathidasan University, chief guest, 4.30 p.m.\n\nGENERAL\n\nAll Women’s Associations of Tiruchi : International Women’s Day celebration, R.Jaya, Mayor, presides, Lathika Saran, former DGP, chief guest, Hotel Femina, 11 a.m.\n\nThe Booksellers and Publishers Association of South India : Book fair, Corporation grounds, Anna Nagar, Thennur, 11 am. to 9 p.m.\n\nHoly Cross College : International Women’s Day, A.Kaliyamurthy, former superintendent of police, chief guest, 8.45 a.m.\n\nRotary Club of Tiruchi Midtown: Talk on Stem cell therapy by Dr.V.R.Ravi, orthopaedic surgeon, Hotel Sangam, 7 p.m.\n\nPeople’s Development Initiatives : International Women’s Day celebration, rally, C.Krithika, III Additional Sub Judge, flags off, near Railway Junction, 2 p.m.; meeting, N.Manimekalai, Head, Department of Women’s Studies, Bharathidasan University, chief guest, Sri Srinivasa Mandapam, near Central Bus Stand, 3 p.m. Seethalakshmi Ramswami College Department of Economics: G.Sakuntala Rao speaks on Importance of communicative and soft skills, 2 p.m.\n\nSt.Joseph’s College : International Women’s Day, M.Jayanthi, principal, Seethalakshmi Ramaswami College, Jeusin Francis, principal, Holy Cross College, and V.Sujatha, Principal, Cauvery College for women, participate, 4 p.m.\n\nM.A.M.School of Architecture: International Women’s Day celebration, A.Saburnisha, vice chairperson, MAM Group of Institutions, chief guest, 10 a.m.\n\nMahalakshmi Engineering College, Thudaiyur : International Women’s Day celebration, Savitri Sivakumar, chief guest, 2 p.m. a.m.\n\nBharathidasan University Department of Women’s Studies : International Women’s Day, documentary film screening and interaction with students, Revathi, Special District Revenue Officer, Road Sector Project, chief guest, Khajamalai campus, 2 p.m.\n\nMaharishi Vidhya Mandir Service Centre and School for the Hearing Impaired and Pravaag Transitional Centre and School for Children with Autism: Sports meet, B.Rajkumar, Chairman, Round Table No.54, chief guest, Armed Reserve playground, K.K.Nagar, 8 a.m.\n\nM.A.M. College of Engineering and Technology : Workshop on Innovative electronics, 10 a.m.\n\nM.A.M. School of Engineering: Lecture on Recent methods in finite element analysis by T.Ramesh, professor, National Institute of Technology, 9.45 a.m.; workshop on .Net and C#, Anusha priya, senior technical analyst, Centauruss Pvt.Ltd., speaks, 10 a.m.\n\nThe Institution of Engineers: A.Kirubakaran, AGM, SSTP, BHEL, Tiruchi, speaks on Mobile location bases services, Institution building, BHEL Township, 5 p.m.\n\nCauvery College of Engineering and Technology, Perur : Blood donation camp, 10 a.m.\n\nM.A.M. College of Engineering: Lecture on Fundamentals of conduction and convection heat transfer process by Tanmay Basak of IIT, Madras, 2 p.m.\n\nKongunadu College of Engineering, Tholurpatti : Seminar on Women and leadership, 11.30 a.m.\n\nBishop Heber College Department of Social Work : Awareness programme on stress management, Dolphin Special School, Thillai Nagar, 2 p.m.; talk on Moral values, Watson Hostel, Bishop Heber Higher Secondary School, Puthur, 6 p.m.; awareness programme on preventive measures of communicable diseases, Thappai, Pullampadi, 6 p.m.; programme on holistic development mentally challenged persons, Vidivelli Special School, 2.30 p.m.\n\nLeo Club of Jamal Mohamed College (women): Release of Siragugal – annual magazine, V.R.Narendra Raj, past district governor, chief guest, 3.30 p.m.\n\nBharathidasan University National Service Scheme and Green Campus Project: Inauguration of one lakh sapling plantation drive, V.M.Muthukumar, Vice Chancellor, chief guest, university campus, 10.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}