{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "On Monday, one more person was arrested in connection a case that involved the sale of a country-made pistol. On Sunday, based on a tip-off that a few gun dealers were present in the city, a team headed by S. Saravanan, superintendent of police, Organised Crime Intelligence Unit (OCIU) used a decoy and nabbed Mohanraj, Sabarai Rajan, and Rajesh Kumar at a place near the Koyambedu market.\n\nA .22 mm country-made gun was seized from trio.\n\nOn further investigation it was revealed that Mohanraj’s brother Murugan was also involved in the crime, the police said.\n\n“He was picked up on Monday by the Koyambedu police. We are continuing our investigations,” said a senior police officer. With these arrests, there is a fresh insight into how guns make their way into the State, especially Chennai from West Bengal.\n\nSources claimed that nowadays goons in Tamil Nadu carry .22 mm or 9 mm pistols instead of knives. Most of the country-made guns were found in North Chennai, and occasionally with some groups coming from some other states residing in South Chennai, they added.\n\nSources said Sabari Rajan of Porur, one of three men arrested by the police, made contacts with gangs that were making counterfeit currencies, while working in the banking sector. “He was earlier working for a corporate company in Abu Dhabi, before resigning and coming to the city. Through his contacts in West Bengal, he procured the gun. Initially, the trio lied that the gun was from a man named Aarif, but they came clean,” said a source.\n\nThe source also added that most of the dealers paid anywhere between Rs.50, 000 and Rs.75, 000 for one such gun and then sold them for Rs. two lakh in Tamil Nadu.\n\n“They earn a profit of Rs. one lakh per deal. And it is not easy to purchase the gun from them as each gang has their own counter intelligence system that prevents this,” added the source.\n\nOne of the methods by which guns are brought in from West Bengal and Bihar is by covering it up with sugarcane syrup.\n\n“The gun is placed in a sweet box and covered with the syrup. The firearm is fully immersed in it and came pass off for a sweet before it is transported by train,” said the source.\n\nTransported by road\n\nThese guns are also transported by road. “The smuggler purchases it in West Bengal and reaches Tamil Nadu via Bhubaneshwar, Hyderabad and Tirupathi. The guns are often hid under tyre tubes,” added the source.\n\nThe state police have instructed the railways to carefully check single travellers. In 2015, over 30 cases pertaining to country–made guns were booked across the state and nearly 10 of them were from the city. The rate of detection is increasing,” said a police officer.", 
    "section": "national", 
    "title": "Tracing the journey of country-made guns into city", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}