{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector V. Dakshinamoorthy has warned unauthorised dyeing units functioning in Pallipalayam and Komarapalayam against discharging effluents into River Cauvery and polluting the river.\n\nThe Collector said that many small and medium sized processing units are functioning in the two places of which many are unauthorised.\n\nA total of 569 unauthorised dyeing units were demolished in the past years by the officials of the Tamil Nadu Pollution Control Board (TNPCB).\n\nWhile authorised units have effluent treatment plants, the unauthorised units discharge the effluents directly into the river thereby polluting it. This turns the colour of water into black.\n\nDrinking purpose\n\nThe Collector said that currently discharge from Stanley Reservoir is very less and is only for drinking purpose. If the effluents are discharged into the river, it affects the drinking water source, he added.\n\nMeeting held\n\nHence, to chart out a solution a meeting chaired by Tiruchengode Revenue Divisional Officer G. Mahatma was held on Saturday.\n\nOwners of dyeing units from Pallipalayam, Komarapalayam, and representatives of trade unions, engineers from TNPCB, District Environmental Engineer, municipal commissioners and officials from electricity board participated.\n\nIt was decided that without treating the effluents, water should not be discharged into the river and if violations were found, action would be taken by the District Integrated Committee.\n\nThe action include cutting off electricity supply and closing the units. It is also said that unauthorised units would be demolished by the TNPCB and sought the cooperation from all owners. The RDO said that zero liquid discharge would only be allowed and asked all the stakeholders to follow it.", 
    "section": "national", 
    "title": "Unauthorised dyeing units warned against discharging effluents into river", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}