{
    "author": [
        "Staff Reporter"
    ], 
    "text": "37 sheep die due to anthrax, department vaccinates cattle in eight villages in Vellore\n\nTeams have been formed to vaccinate sheep, goats and cattle in the village. So far 2000 animals have been vaccinated.\n\nAfter laboratory tests confirmed that the death of 37 sheep in Nemili block was due to anthrax, the Department of Animal Husbandry, Vellore has started to vaccinate sheep, goats and cattle against anthrax in eight villages. Officials said the disease spread has been contained now.\n\nOn March 4, the officials of the department received information that 37 sheep had died in two days in Keezh Venkatapuram in Nemili block.\n\nBlood samples were drawn and sent for testing to the Central Research Laboratory, Ranipet and District Referral Laboratory, Vellore, a senior official said.\n\nTests confirmed Anthrax\n\nTests confirmed that the sheep had died of anthrax. He further added that the sheep owners did not seek any medical assistance on seeing the symptoms in the animals.\n\n“First, one or two sheep had died, and we were not informed. The owners resorted to self-medication. It is said that they had used contaminated needles. This had resulted in the spread of the disease among the sheep, and subsequently death. We suspect an outbreak of anthrax and have taken up preventive measures,” he said.\n\nFollowing this, the department formed four teams, each consisting of eight persons to vaccinate sheep, goats and cattle in the village and surrounding areas.\n\n“We started to administer anthrax vaccine to sheep, goats and cattle in eight villages, covering a radius of 8 km from Keezh Venkatapuram on Friday. The vaccines were supplied from the Institute of Veterinary Preventive Medicine, Ranipet. So far, we have covered 2,000 animals, and will vaccinate the remaining in three days,” he said.\n\nOnce vaccinated, it will take two to three days for the animals to develop immunity, he added.\n\nSymptoms\n\nThe symptoms of anthrax include high fever and loss of appetite. “There will be sudden death of animals. There will be bleeding from the rectum and vagina,” he said. In such cases of animal deaths, the officials have advised villagers not to try to remove the skin of animals. “The animals should be buried. Persons rearing sheep, goats and cattle should pay close attention. We have taken up cleaning works in the villages and spread bleaching powder,” he said.\n\nThe officials allayed apprehensions of anthrax spread to human as the disease has been contained well.", 
    "section": "national", 
    "title": "Vaccination drive to counter anthrax threat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}