{
    "author": [
        "R Rajaram"
    ], 
    "text": "The number of public meeting spots: 27; the number of street corner meeting venues: 42\n\nWith high-voltage electioneering poised to take off in the days to come, the police have notified certain spots for political parties to hold public meetings and street corner meetings.\n\nThey have increased the number of poll-meeting venues based on request from political parties. The venues have been identified and notified after considering the local situation and the density of traffic flow in the respective areas. Although Tiruchi district accounts for a total number of nine assembly constituencies, the city police have within its jurisdiction the entire of Tiruchi West and Tiruchi East constituencies and a portion of Srirangam and Tiruverumbur assembly segments. The remaining constituencies fall within the purview of the Tiruchi rural police.\n\nPolice sources told The Hindu that the designated spots to hold public meetings and street corner meetings have been conveyed to the Assistant Commissioners of Police and the jurisdictional Station House Officers besides to the political parties.\n\nEncompassing four ranges – Cantonment, Fort, Golden Rock and Srirangam, the city police have 14 police stations under its jurisdiction. The notified public meeting and street corner meeting spots are spread across the city limits. The number of notified public meeting spots were 27; 42 venues have been notified for organising street corner meetings.\n\nProminent among the designated public meeting spots include ‘G’ corner railway ground at Ponmalai, North Devi street near E.B. office in Srirangam, Illupur road near Mannarpuram, VOC Thidal in Ponmalaipatti, Uzhavar Santhai ground, Ulariyamangalam Manthai and Pillaiyar Kovil street in E. Pudur.\n\nAs regards street corner meeting venues, the designated spots include E. Pudur main road near Thangaraja theatre, Kora street junction in Woraiyur, Koradanthoppu, Mela Ambikapuram, North Ukkadai, South Ukkadai, Keezhapudur East, Kooni bazaar West and Devi theatre junction in Srirangam.\n\nCommissioner of Police Sanjay Mathur said the venue would be allotted on first-cum-first served basis to the applicants after scrutinizing the petition from law and order point of view. The number of meeting venues has increased this time following request from political parties, he added.\n\nA single window system would be followed on this and the permission for the meeting would be granted by the respective Returning Officers. The jurisdictional police officers have been directed to ensure that flex boards and banners erected by the political party were removed immediately after the meeting got over, the sources said.\n\nMr. Mathur said the City Police was coordinating with the election cell established at the Collectorate. Eight Flying Squads comprising police personnel have been constituted within city limits with three per assembly constituency. Besides, Static Surveillance Teams had been constituted.", 
    "section": "national", 
    "title": "Venues for poll meetings notified", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}