{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "State reportedly opposed to the concept as it gives importance to Hindi in the schools\n\nTamil Nadu is the only State that does not have a Navodaya Vidyalaya. A file picture of JNV in Kalpetta in Wayanad district of Kerala\n\nThe announcement in Union Budget 2016-17 that 62 new Jawahar Navodaya Vidyalaya (JNV) schools will be opened in districts hitherto uncovered in the country has raised the question whether Tamil Nadu will allow opening of JNVs in the State now.\n\nTwenty years after the introduction of JNVs, run by Navodaya Vidyalaya Samiti (NVS) under the Union Ministry of Human Resource Development, Tamil Nadu remains the only State which does not have a JNV, reportedly because of the perception that importance is given to Hindi in these schools.\n\nJNVs, renowned for quality education, provide residential education from Class VI to Class VIII free of cost while a nominal fee of Rs. 200 is charged from students in Class IX to Class XII. In the admission, which is done through an entrance exam, 75 percent of seats are reserved for children from rural areas, apart from reservations for children belonging to SC and ST communities.\n\nMany in the education sector opine that opening of JNVs is being prevented in the State because of misconceptions about the language policy of JNVs.\n\nC. Muthiah, Principal of Kendriya Vidyalaya (KV) Madurai, said importance given to regional language in JNVs was better than KVs. “In KVs, learning the regional language is not mandatory. However, in JNVs, students have to learn the local language apart from Hindi and English,” he said.\n\n“So when KVs, which mainly help Central government employees, are allowed, then why not JNVs, which help rural children? All they have to do is to allocate land,” Mr. Muthiah said.\n\nThe prospectus available on the NVS website says that the medium of instruction will be in regional language up to Class VIII.\n\nHowever, Prince Gajendra Babu, General Secretary of State Platform for Common School System, rejected the idea of JNVs altogether, stating that it went against the principles of equitable access for all to quality education.\n\n“JNVs in a district may admit 50 to 100 children in a class and provide high quality education. Do the other children not deserve same high quality education?” he questioned.\n\n“The concept of varying quality of education depending on schools should be stopped. Government should instead prioritise upgrading the quality of all schools,” he added.", 
    "section": "national", 
    "title": "Will TN allow Navodaya Vidyalayas?", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}