{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Election Commission on Monday informed the Madras High Court that it is taking every step to have an accurate voters list, which will in turn ensure free and fair elections in the State.\n\nRajesh Lakhoni, Chief Electoral Officer, made the submission on a plea moved by the Dravida Munnetra Kazhagam (DMK) alleging that over 57 lakh bogus voters have been added to the recent voters list released by the EC.\n\nThe main contention put forth by the DMK’s advocate, senior counsel P. Wilson, was that the population of Tamil Nadu as per the 2011 census was 7.21 crore. In this, the population in the age group of 13 to 17 was 50.56 lakh. This age group could have attained the age of 18 to 22 by 2015.\n\nAccording to the EC’s voter list the total number of electorate in 2011 was 4.71 crore. Therefore, total number of eligible voters as on January 1, 2016 should be 5.21 crore (4.71 crore + 50.56 lakh). “But the EC has published an electoral list on January 20 giving an astronomical electoral population of 5.79 crore,” he said.\n\nOpposing the claim, Mr. Lakhoni said, “It is pertinent to point out that in 2011, the Electoral Population (EP) of the State was only 65.31 per cent. This was much less than the actual EP ratio. This implies that there were many leftover voters and due to proactive measures taken by the EC in these years, the EP ratio has increased.”\n\n“Comparing this increase with the growth rate is not correct as this increase not only accommodates the new voters who would have turned 18, but also the leftover voters which was significant to the extent of five per cent,” the CEO contended.\n\nAs to the allegation that the State government employees deputed in the election duty are hand-in-glove with the ruling party, the EC submitted that the Electoral Registration Officers and the Booth Level Officers are strictly acting as per the directions of the Commission and the same was being supervised.\n\nPointing out show-cause notices issued against four officers for dereliction of election duty, Mr. Lakhoni said, “It is not correct to say that the election officials are favouring the ruling party. The election machinery is acting on the directions of the EC.”\n\nThe EC further submitted that representations of all the political parties including that of the petitioners have been constructively considered and the entire process has been conducted involving the political parties also.\n\nCase transferred to\n\nFirst Bench\n\nWhen the petition came up for hearing before Justice R. Subbiah, the judge directed the High Court registry to transfer the plea to the First Bench in view of a notification issued by the registry on Monday informing that all the cases relating to Assembly Elections, 2016 for the State of Tamil Nadu and the Union Territory of Puducherry will be listed before the First Bench presided over by Chief Justice.\n\nDMK’s case listed before the First Bench", 
    "section": "national", 
    "title": "Will ensure free and fair election, EC assures court", 
    "subsection": "tamilnadu", 
    "date": "2016-03-08"
}