{
    "author": [
        "M Ahiraj"
    ], 
    "text": "The sighting of the birds has spurred the Forest Department into action, and it has posted additional anti-poaching units and personnel in the Sirguppa region.— Photo Samad Kottur\n\nThe banks of the Tungabhadra in Karnataka’s Sirguppa taluk have provided a ray of hope for the revival of the critically endangered Great Indian Bustard (GIB).\n\nOn Sunday, a group of nature enthusiasts and avid birdwatchers sighted three GIBs — two adults and a chick — in interior Sirguppa taluk. The presence of the chick is evidence that the vast grasslands there are a breeding ground for the species that is on the verge of extinction.\n\nThe team comprised Santosh Martin, president of Sloth Bear Foundation, Abdul Samad Kottur, president of Society for Wildlife and Nature Conservation (SwAN), Sonia Martin and Anand Kundargi.\n\nThey were among the first to spot the species here in 2006. In the years preceding that, it was assumed that the GIB had been wiped out from Karnataka.\n\nSince then, more birds have been sighted, and recently, an egg was also found. “We will start a survey of the entire area to find out whether there are other groups of GIBs and document the findings,” said Mr. Kottur.\n\nThe semi-arid and arid grasslands in the interiors of Sirguppa taluk could potentially be a perfect habitat for the Bustard. However, the expanse of irrigation networks has seen the habitat shrinking through the years. “Though sighting a group of GIBs repeatedly in this area has made us very happy, we are concerned that nothing is being done for its conservation or the habitat,” said Mr. Martin.\n\nTakat Singh Ranawat, Deputy Conservator of Forests, Ballari, said: “We will initiate steps to protect the birds from poachers by appointing locals as ‘watchers’, besides strengthening the information network. We need to ascertain whether the GIBs spotted were residents or migratory.”\n\nThe Forest Department also plans to identify government and private lands that could serve as a habitat for the species, he said.\n\nThe sighting of the GIB has spurred the Forest Department into action, with additional anti-poaching units and personnel being deployed in the region.\n\nUnlike other forest areas, the vast grasslands of Sirguppa taluk are not in the control of the Forest Department and are owned by private individuals.\n\n“We are happy with the sighting, but we fear that this may attract poachers or people may throng the area to get a closer look. This disturbs the habitat, and we appeal to people not to approach the Bustards. These are rare creatures after all,” said Ravi Ralph, Principal Chief Conservator of Forests (Wildlife).\n\nForest officials in Ballari have already been told to cordon off the area and ensure the birds are not disturbed.\n\nWhile environmental activists have been up in arms over the allocation of 9,723 acres of grasslands in Challakere, Chitradurga, for a ‘science city’, the Forest Department hopes to enforce a plan to conserve the GIB through this.\n\nAt least six major government agencies and industries, including the DRDO, the Bhabha Atomic Research Centre, the Indian Institute of Science (IISc.) and ISRO, have been allotted and for industrial, research purposes.\n\nThe allocation ran into trouble in the courts and was granted only after numerous conditions were enforced, including creation of a GIB conservation plan..\n\nThree Great Indian Bustards, a critically endangered\n\nspecies, spotted\n\nin Karnataka", 
    "section": "national", 
    "title": "A ray of hope for nature enthusiasts", 
    "subsection": "general", 
    "date": "2016-03-07"
}