{
    "author": [
        "Special Correspondent"
    ], 
    "text": "There are conflicting reports about the cause of the popular Malayalam actor’s death.— Photo: K. Ananthan\n\nPopular Malayalam actor Kalabhavan Mani died at a private hospital here on Sunday evening. He was 45. The death occurred around 7.15 p.m.\n\nDr. Sanjeev Singh, senior medical administrator at the Amrita Institute of Medical Sciences here, told The Hindu that the actor was admitted to the hospital on Saturday night with haematemesis (vomiting of blood). Sources said the actor suffered from liver and kidney ailments.\n\nAmid conflicting reports about the cause of the death, it has been decided to conduct a post-mortem at the Government Medical College Hospital in Thrissur on Monday. “The body will be kept at the mortuary in the hospital before completing the formalities as early as possible on Monday. A decision on whether to keep the body for the public to pay homage in Thrissur would be taken later. Efforts are on to conduct the cremation at Chalakudy by Monday evening,” said Edavela Babu, representative of the Association of Malayalam Movie Artistes.\n\nA senior official at the Cheranalloor police station confirmed that the hospital authorities had informed them on Sunday morning that the actor was admitted after vomiting blood. “We could not record his statement as he was in a critical condition and put on ventilator,” he said.\n\nMani had acted in over 200 films in Malayalam and other South Indian languages.\n\nThe actor’s sudden death came as a shock for the Malayalam fraternity and his hundreds of fans. Many, including senior actors and technicians, rushed to the hospital to pay their homage.\n\nP.K. Ajith Kumar writes from Kozhikode:\n\nSallapam might be remembered more for Manju Warrier’s debut as heroine and a superb musical score by Johnson. But, those who saw the film would also remember Rajappan, the wicked toddy tapper. It may have been a small role, but that was enough for Kalabhavan Mani to show the world what he was capable of. That was in 1996.\n\nOver the next couple of decades, Mani went on to establish himself as one of the more popular actors in Malayalam cinema. Comedy was his forte, but he proved that he was not just a comedian.\n\nWith his superb portrayal of a blind singer in Vasanthiyum Lakshmiyum Pinne Njanum , (remade in Tamil as Kasi ), he was a favourite to win both the State and national awards for the best actor.\n\nHe also made an excellent villain, in films such as Gemini ( Tamil). He was a good singer and the folk songs he rendered were extremely popular. His untimely death has dealt another blow to Malayalam cinema in 2016, which recently lost actor Kalpana, lyricist O.N.V. Kurup, directors Rajesh Pillai and Mohan Roop, cinematographer Anandakuttan, composer Rajamani and musician Shan Johnson.", 
    "section": "national", 
    "title": "Actor Kalabhavan Mani dead", 
    "subsection": "general", 
    "date": "2016-03-07"
}