{
    "author": [
        "Asif Yar Khan"
    ], 
    "text": "Ravela Susheel and his driver remanded in judicial custody\n\nRavela Susheel, son of Andhra Pradesh Social Welfare Minister Ravela Kishore Kumar Babu, was arrested by the Banjara Hills police early on Sunday on charges of outraging modesty of a woman. His driver M. Ramesh was also arrested.\n\nBoth were produced before a court which remanded them in 14 days judicial custody.\n\nThe police booked cases under the Nirbhaya Act invoking Section 354 (outraging modesty of woman) 354D (stalking) and 509 (Word, gesture or act intended to insult the modesty of a woman) of Indian Penal Code against Mr. Susheel and Mr. Ramesh.\n\n“Initially, a case under Section 509 was register against one Appa Rao and another person. On investigation, we gathered more evidence and added two more Sections 354 and 354 D. On enquiry, we came to know that the driver’s name is Ramesh and not Appa Rao and the occupant in the car was Susheel,” DCP (West) A. Venkateshwara Rao told presspersons on Sunday afternoon.\n\nMr. Venkateshwara Rao said that around 4 p.m., some persons called up the Banjara Hills police station and said that there was some trouble at Road No. 13. “A blue colts team went to the spot and found one person injured. The police took him in his car to a private hospital and admitted him. He was later, identified as Mr. Ramesh. We came to know that Mr. Susheel escaped from the place in the melee,” he said.\n\nAround 5 p.m., a woman who identified herself as a school teacher lodged a complaint with the police alleging that a person named Appa Rao and another man teased her and tried to pull her into a car. She said that the other person had a tattoo mark on her hand. “Based on a complaint, a case was registered and investigation is going on,” the official explained.\n\nAnother complaint was made by Mr. Ramesh against a group of persons who allegedly thrashed him. Mr. Susheel and Mr. Ramesh were reportedly thrashed by group of persons after they allegedly stalked and misbehaved with the woman. Following the complaint, the police registered a case under Section 324 (hurt) against unknown persons.\n\nMr. Venkateshwara Rao said that the police are acting in a professional way. “We are going as per the content of the complaint. Our teams are checking the footage recorded by closed circuit cameras installed on the stretch to ascertain the facts,” he said.\n\nAccording to sources, Mr. Susheel along with his advocate came to the police station around 1.30 a.m. and surrendered. Efforts to obtain bail failed.", 
    "section": "national", 
    "title": "A.P. Minister’s son held for ‘outraging modesty of woman’", 
    "subsection": "general", 
    "date": "2016-03-07"
}