{
    "author": [
        "Avinash Bhat"
    ], 
    "text": "Bike riders with huge delivery bags on their backs or riding two-wheelers with large boxes fitted on the chassis are a familiar sight in the city. With a steady income to be made by working as a bike delivery man, many have signed up for the job and use their own vehicles for their work.\n\nHowever, according to Transport Department officials, this may not be entirely legal. The use of private registered two-wheelers for commercial purposes has now come under the scanner of the RTO.\n\n“There have been drives in the past to stop such practises,” said Narendra Holkar, Joint Commissioner Transport.\n\nThe department clarified its stand on bike taxis earlier this week, saying they were being operated illegally. In the coming days, a serious crackdown is expected on bike taxis found operating in the city. Bikes being used for delivery of goods are also expected to be stopped.\n\nCurrently, officials say that there is no particular class of registration for two-wheelers used for commercial purposes like delivery of goods.\n\nHowever, the issue has been largely ignored by the traffic police and the RTO and cases are booked only when the goods carried are conspicuous. “The usual problem with such vehicles is that they are found parked on the kerbside or in no-parking spots. We fine them when we see violations but no specific drives have been conducted. There is no specific classification of offences for such vehicles,” said M.A. Saleem, Additional Commissioner of Police (Traffic).\n\n‘Not easy’\n\nBeing a delivery executive in a city like Bengaluru is not easy.\n\nEmployees have to deal with endless traffic jams, incomplete addresses, irate customers and long traffic signals. With salaries that barely cover the cost of living and pressures from office to meet targets, it is not uncommon to break rules, employees say.\n\n“We have to start deliveries from 9 a.m. People want their deliveries on time. We try and avoid breaking rules but it is not always possible,” says Ramesh, a delivery executive with an online retail site.\n\nStarting salaries for bike delivery executives range from Rs. 10,000 to Rs. 15,000, depending on the experience and the ownership of the vehicle.\n\nHaving a bike is mandatory for most companies who do not own their vehicles.\n\nUse of private\n\ntwo-wheelers\n\nfor any commercial purpose comes under the scanner", 
    "section": "national", 
    "title": "Bengaluru to crack down on bike taxis", 
    "subsection": "general", 
    "date": "2016-03-07"
}