{
    "author": [
        "K Umashanker"
    ], 
    "text": "A summer resort built in 1913 by British officials atop the Kambakam Durgam hill in the Chittoor district of Andhra Pradesh is all set to get a facelift, with the objective of attracting tourists from neighbouring Tamil Nadu.\n\nThe 774-foot hillock, spread over B.N. Kandriga and Varadaiahpalem mandals, is surrounded by thick forests in an area of about 30 sq. km. Since the hill happens to be the only high elevation point for over 200 miles along the east coast in the vicinity of erstwhile Madras overlooking the Bay of Bengal, the British officials built a summer resort and a watchtower here.\n\nThe bridle path used to carry many a British officer atop the hill on horseback. During World War I and II, the watchtower was used to monitor the movement of warships along the east coast.\n\nHowever, in the last five decades, the resort and watchtower have been subjected to the wrath of treasure hunters. Only a small dilapidated piece of outhouse stands witness to the military prowess of the British Raj today.\n\nSpeaking to The Hindu , Divisional Forest Officer (East-Wildlife) K. Venkataswamy said work was on to give a facelift to the watchtower zone.\n\n“We plan to construct a rest house and a telescopic view-point on the hill. It will be a feast for tourists to watch the Bay of Bengal and the virgin forest around the slopes. The bridle path will be retained.”\n\nThe DFO said picnic lovers, exclusively from Chennai and surrounding areas of Tamil Nadu, throng the picturesque Tada falls (also known as Ubbalamadugu) abutting the Kambakam forests.\n\n“Though they want to do a night stay and watch nature in the forests at dawn or dusk, they are not able to do so for want of any cottage or night shelters. If we can cater to their requirement, it will lead to good tapping of tourism potential here. It is high on our agenda,” he said.\n\nDuring World War I and II, the watchtower in Chittoor was used to monitor the movement of warships along the east coast", 
    "section": "national", 
    "title": "British era resort & watchtower in Andhra Pradesh to get a facelift", 
    "subsection": "general", 
    "date": "2016-03-07"
}