{
    "author": [
        "Devang Pathak"
    ], 
    "text": "Final day of the conclave saw a celebration of reason and secularism\n\nIf the first day of the Mumbai Collective conclave on freedom and pluralism was about fiery speeches in defence of dissent and free speech, the second day was a celebration of reason and secularism.\n\nIn a discussion on ‘Assault on reason and higher education,’ Hamid Dabholkar, psychiatrist and son of rationalist Narendra Dabholkar who was brutally murdered in Pune in August 2013, said: “The Central government, State governments and the CBI failed us … we repeatedly told the police that this was not a personal or family murder but a political one. We even warned them that there could be more such political murders.”\n\nPrabhat Patnaik, Professor Emeritus at the Centre for Economic Studies, Jawaharlal Nehru University, pointed out the significance of pluralism.\n\n“Any thinking requires raising questions which often results in multiple answers from multiple people; multiplicity is thus a symptom of thinking. The killing of multiplicity is the killing of thoughts.” He noted how the various protests had occurred only in public institutions.\n\nThe panel of ‘Artists against communalism’ featured film-makers Kabir Khan and Anand Patwardhan. Mr. Khan talked about the resistance he faced for naming his movie Bajrangi Bhaijaan, ranging from the VHP filing a case to the speculation that ‘love jihad’ was the theme of his movie.\n\nBut Mr. Khan refused to buckle under pressure tactics.\n\nDocumentary film-maker Anand Patwardhan reflected how it had become unfashionable to think well of Mahatma Gandhi and argued that it was important to note how radical Gandhi became as he grew older. He showed excerpts from his past work such as Jai Bhim Comrade and War and Peace to shed light on Gandhi’s legacy.\n\nAdvocate Mihir Desai gave a historical breakdown of sedition in India and the correct understanding of the term in its legal sense in the session on ‘Sedition and the spectre of the anti-national.’\n\nReferring to the sedition trial of Mahatma Gandhi in 1922 as the ‘Gandhian Blunder’ of the British Empire, he described the case against Kanhaiya Kumar as the “Gandhian blunder” of Prime Minister Narendra Modi and HRD Minister Smriti Irani. “If they had read history, and not mythology, they would have realised their blunder,” said Mr. Desai as he appealed for the removal of the sedition law under Section 124 A of the IPC.\n\nCall for popular resistance\n\nThe final panel of the conclave saw political leaders appeal for popular resistance among the masses against communal and divisive forces.\n\n“MPs and MLAs who used to earlier hand you character certificates are now giving certificates of patriotism and nationalism,” said NCP MLA Jitendra Awhad.\n\n(The author is a freelance writer)", 
    "section": "national", 
    "title": "‘Case against Kanhaiya Kumar is Modi’s Gandhian blunder’", 
    "subsection": "general", 
    "date": "2016-03-07"
}