{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "Former Bangladesh enclave dwellers are practically living within “another enclave” in India\n\n“Zero Point” is both a loved and hated phrase in 60-year-old Swapnarani Roy’s lexicon. It is at this point on the Bangladesh-India border in north Bengal that Swapnarani meets her husband twice or thrice a month. Her husband, Balaram Roy, travels nearly 50 kilometres from his village to reach zero point for the rendezvous.\n\nThey gaze at each other for about 10 minutes from a distance of about 15 feet and return to their homes: Swapnarani to her settlement camp in the Mekhliganj subdivision of Cooch Behar and Balaram to Patgram village in Lalmanirhat district of Bangladesh.\n\nZero point ensures that they get to see each other. But it also separates them.\n\n“We can’t talk as my husband starts crying. He asks me why I left with the kids for India after 40 years of our marriage. I can only remain silent…,” Swapnarani said sobbing uncontrollably. An agreement between India and Bangladesh last year empowered the countries to exchange territories. Following the Land Boundary Agreement, more than 900 Indians from the enclaves of north Bangladesh were moved to India and were settled in three camps in Cooch Behar district. Mekhliganj is one such settlement camp. The Roy family is the victim of a complex 2011 survey that preceded the 2015 agreement. The survey asked enclave-dwellers if they wanted to stay back or leave for the neighbouring country. But the problem was many, like Balaram Roy, were left out of the survey. “There was a communal riot in our enclave-village [Patgram] in Lalmanirhat district in Bangladesh. My husband ran away and within a few months of the riot the survey took place. My husband was not in the village and his name was left out,” said Swapnarani.\n\n‘Inhuman survey’\n\nGayatri Burman, 18, of the same camp in Mekhliganj is also separated from her husband, for a different reason. “We were not married when the survey took place and my husband used to live in the Bangladesh territory, outside the enclave, and was therefore left out,” she said. Bhupal Burman shifted to her wife’s residence in the enclave after their marriage. “But since his name was not listed, I had to leave with our three-year-old daughter,” she said. Nearly all the families blamed an “inhuman and hasty” survey for their misery.\n\nDiptiman Sengupta, chief coordinator of the erstwhile enclave exchange committee, denied the allegation. “The survey was done in Bangladesh in a completely free and fair manner and no one was discouraged from leaving Bangladesh,” he told The Hindu . One cannot gain access to the Mekhliganj camp that houses 198 residents, unless government officials of Cooch Behar issue an order. This correspondent entered the camp without permission as no one was manning the entrance early in the evening. While the locals were talking to this correspondent, a middle-aged man appeared with a young civic volunteer. The man introduced himself as constable Rabiram Burman and asked this correspondent to leave “immediately as no one is allowed in the camp without permission.” Mr. Burman refused to explain why visitors needed permission to meet the camp dwellers, who are now Indian citizens.\n\nLock-Up Register\n\nThe real shocker perhaps is the register that a visitor, once he or she is granted official permission to enter the camp, has to sign. It is a ‘Lock-Up Register’ which has 13 columns. The guests are made to sign under a column titled “Name/Father’s name/Full Address of the Arrestee.” In effect, any outsider entering the camp of the erstwhile enclave dwellers automatically becomes an ‘offender.’ The other columns are titled ‘Arrest case No./ General Diary No. and so on. The name of the ‘arresting officer’ will also have to be mentioned alongside “date and time of arrest” with “lock-up in” and “lock up out” timings.\n\nThe District Magistrate of Cooch Behar, P. Ulaganathan, who did a commendable job ensuring a smooth transfer of the enclaves with his officers, was apologetic. “Yes, I know it is not desirable and in a few days I will have a word with the SP to remove the chowki,” he said. But why was it there in first place? Two reasons, said Mr Ulaganathan. “One, there were a few unsavoury incidents and two, it is close to the Bangladesh border.”", 
    "section": "national", 
    "title": "Change in territory but not in woes", 
    "subsection": "general", 
    "date": "2016-03-07"
}