{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "If Congress and AIUDF get more seats, then there will be no stopping illegal migrants, he says\n\nSarbananda Sonowal says if the Congress and AIUDF get more seats, there will be no stopping illegal migrants.\n\nMarking a departure from its campaign in the recent Bihar Assembly elections, the BJP has announced a chief ministerial candidate for Assam in Union Sports Minister Sarbananda Sonowal, who termed these polls a “defining one” for the State, where the “greater Assamese society that includes its minorities will be preserved” against illegal migration and infiltration.\n\nIn an exclusive interview to The Hindu , Mr. Sonowal said the party was confident of victory fighting issues of Assamese identity after having sewn up a rainbow alliance with the Asom Gana Parishad (AGP), the Bodo People’s Front (BPF) and an understanding with tribal groups such as Rahas and Tiwas, whose members met Prime Minister Narendra Modi recently.\n\n“These elections are important for the preservation of the greater Assamese society that includes Hindus, Muslims, Marwari, Punjabi, Ahomiys and Bengali. If the Congress and the All India United Democratic Front [AIUDF] get more seats, then there will be no stopping illegal migrants. Therefore, we want alliances with everyone other than these two for the good of greater Assamese society,” Mr. Sonowal said.\n\nHe has been invoking the symbolism of the medieval Battle of Saraighat, when the Ahom kings under the legendary general Lachit Borpuhukan repulsed an attack by the Mughals in 1671.\n\n“The battle of Saraighat protected our swabhiman [self-respect] also our sovereign territory from the Mughals. It was Lachit Borphukan, along with his deputy known as Ismail Sidiique, also referred to as “bagh [tiger] Hazarika” who protected Assam,” he said, likening it to preserving indigenous Assamese identity from infiltration.\n\nHe dismissed any suggestions that the NDA government had gone back on its word on not operationalising the Indo-Bangladesh land boundary agreement that saw Assam lose vast tracts of land. “It is because of the clarity of the land boundary agreement that the work to fence the borders between India and Bangladesh at Dhubri, Cachar and Karimganj can take place,” he said. “Home Minister Rajnath Singh has visited Dhubri and Karimganj in January and made a commitment for fencing of the borders,” he said.\n\nCentre’s aid\n\nHe pointed out that it was under the NDA, that the State got Rs. 144 crore to carry on the work of the National Register of Citizens (NRC) that would determine citizenship of India. “This was not updated under the Congress, after the tripartite meeting in 2005, held by then Prime Minister Manmohan Singh, where the State government, the Ministry of Home Affairs and the All-Assam Students Union, the three signatories to the Assam accord were present, and it was decided that the NRC would be done in the next two years. They just did the pilot project, in Barpeta and Chaygaon constituencies, where there was resistance from minorities, and the government took the plea of that protest to suspend this,” he said.\n\nOn Assam Chief Minister Tarun Gogoi’s declaration that the fight in Assam was between him and Prime Minister Modi, not Mr. Sonowal, he termed the three-term Chief Minister “frustrated.”\n\n“He started his politics with the ‘mosquito net and blanket’ strategy of povertarianism and doles, and after 15 years he has run out steam. Nearly nine lakh people have moved out of the State looking for small jobs in other States,” he said. “Nowadays, young people are greatly exposed to what’s happening in other States, and want development,” he added.\n\nBJP leader says Congress has run out of steam after 15 years in power in Assam", 
    "section": "national", 
    "title": "Defining battle of identity: Sonowal", 
    "subsection": "general", 
    "date": "2016-03-07"
}