{
    "author": [], 
    "text": "He’s the name behind the world's first electric supercar, winning international plaudits for his ingenuity. But for Croatia's 28-year-old Mate Rimac, it all started as a hobby in his garage.\n\nA keen techie since high school, Rimac was racing an old BMW when he blew the engine and decided to turn the car into an electric one starting with pieces he bought on the Internet.\n\nA decade later, his firm Rimac Automobili is becoming a global leader in electric vehicle technology, selling Concept One supercars for €850,000 ($923,000) each and giving a much-needed boost to Croatia's start-up scene.\n\n“We want to be the best in the world in what we do and we are changing the world,” Rimac told AFP.\n\nRimac formed the company in 2009 when he realised there was not much left of the original vehicle he had transformed in his garage, and the aim was to build an electric supercar from scratch.\n\n100 km in 2.8 seconds\n\nThe company unveiled the Concept One at the 2011 Frankfurt Motor Show, where nobody expected a small Croatian firm to showcase an electric car that could reach 100 km per hour in a staggering 2.8 seconds.\n\nLast week at the Geneva International Motor Show, Rimac introduced the production version of the car along with a prototype of its “evil twin”, the even more powerful Concept S.\n\nMany expected Rimac's success would lead him to move to Silicon Valley, Germany or Italy. But instead he has kept the business in Croatia, a country slowly emerging from six years of recession.\n\n“I want to do it here... I'm stubborn,” he said. “I think it is possible, I mean we are doing very well.”\n\nHe plans to build another factory in Sveta Nedelja, while his employee numbers are set to double this year to 300. Their average age is 30, and many are young engineers straight out of university.\n\nThey build most of the supercar parts from scratch on-site — from the body and chassis to the power distribution unit and batteries — sticking to Rimac's philosophy of creating know-how and jobs instead of outsourcing.\n\n“That's why we are growing so quickly and becoming experts in different fields,” said Rimac, who won financing from three international investors in 2014 and is now in a second round of fundraising.\n\nTwo Concept One prototypes, including the red vehicle unveiled in Frankfurt, were on display behind Rimac as he spoke to AFP, while nearby engineers worked on three cars to be delivered to the US, Germany and Italy within a month.\n\nThe firm is producing a limited quantity of just eight Concept One vehicles for clients who are both motor fanatics and technology aficionados — and can afford the hefty price tag.\n\nWorld going electric\n\nThe supercar may be Rimac's headline product, but he says it is only a showcase for the company's technology, from infotainment systems to battery packs, which aim to reach a far wider audience -- in ordinary cars, planes, ships, bicycles and wheelchairs.\n\n“We are helping the world to go electric. Our business is to implement these technologies and help other industries to go electric,” he said.\n\nSpin-off firm Greyp Bikes, set up in 2013, produces high-performance electric bicycles that can reach up to 70 kilometres per hour. So far around 80 have been sold around the world for 8,500 euros each.\n\nRimac said the company was not directly affected by Croatia's problematic business environment, which sees companies burdened by excessive red tape and changeable fiscal rules.\n\n— AFP", 
    "section": "national", 
    "title": "Electric supercar wins young Croatian global fame", 
    "subsection": "general", 
    "date": "2016-03-07"
}