{
    "author": [], 
    "text": "Scientists from University of Chicago have discovered evidence of a rare element named curium that was present during the formation of the solar system.\n\nThe team found evidence of curium in an unusual ceramic inclusion they called “Curious Marie”, taken from a carbonaceous meteorite.\n\n“Curious Marie” and curium are both named after Marie Curie whose pioneering work laid the foundation of the theory of radioactivity.\n\nThis finding ends a 35-year-old debate on the possible presence of curium in the early solar system and plays a crucial role in reassessing models of stellar evolution and synthesis of elements in stars.\n\n“Curium is an elusive element. It is one of the heaviest-known elements, yet it does not occur naturally because all of its isotopes are radioactive and decay rapidly on a geological time scale,” explained lead author Francois Tissot.\n\nCurium became incorporated into the inclusion when it condensed from the gaseous cloud that formed the sun early in the history of the solar system.\n\nOn Earth, curium exists only when manufactured in laboratories or as a by-product of nuclear explosions.\n\n“The possible presence of curium in the early solar system has long been exciting to cosmochemists, because they can often use radioactive elements as chronometers to date the relative ages of meteorites and planets,” said study co-author Nicolas Dauphas in a paper that appeared in the journal Science Advances .\n\nWith the help of study co-author Lawrence Grossman, the team was able to identify and target a specific kind of meteoritic inclusion rich in calcium and aluminium. These CAIs (calcium, aluminium-rich inclusions) are known to have a low abundance of uranium and likely to have high curium abundance.\n\nOne of these inclusions — Curious Marie — contained an extremely low amount of uranium.\n\nThanks to this sample, the research team was able to calculate the amount of curium present in the early solar system and to compare it to the amount of other heavy radioactive elements such as iodine-129 and plutonium-244.\n\nThey found that all these isotopes could have been produced together by a single process in stars.\n\n“This is particularly important because it indicates that as successive generations of stars die and eject the elements they produced into the galaxy, the heaviest elements are produced together, while previous work had suggested that this was not the case,” Dauphas explained. — IANS\n\nScientists find evidence of curium in a ceramic inclusion taken from a meteorite", 
    "section": "national", 
    "title": "Element that helped form solar system discovered", 
    "subsection": "general", 
    "date": "2016-03-07"
}