{
    "author": [
        "Shane Hickey"
    ], 
    "text": "The device can be pulled out into a 50-metre-long system in 2 minutes\n\nJohn Hingley had a solution stuffed in his rucksack: a thin and lightweight portable solar panel that unfolded and could generate enough energy to power his phone, camera and computer. As well as keeping him charged in the mountains, the simple device commonly used by travellers and outdoor enthusiasts gave him an idea — to make a much bigger version.\n\n“The reason why this worked so well was because of the big surface area that you have got ... and I started working on ways to scale this sort of concept,” he said. Three years after returning from his world trip, Mr. Hingley has developed a large steel container that contains a long spool of solar panels, all attached together on a strong flexible fabric that can be pulled out into a 50-metre-long system in two minutes.\n\nThe portable, carpet-like solar system, which stores generated energy in batteries in the steel housing, is expected to be used for disaster relief when power systems have been knocked out, by armies on the move, and in mining stations located in areas without any power. “The market for off-grid energy is huge and growing — 24 per cent of the world is off grid but everyone needs energy these days,” said Mr. Hingley.\n\nThe system uses copper indium gallium selenide solar cells (CIGS) that are bonded with a tensile fabric. The strength of the combined material can cope with being rolled in and out, he said, and it can be in full operation a few minutes after it is deployed. “It is like a microgrid in a box. It has all of the components integrated into it that you need to run a 24-hour microgrid.” The spool of solar panels is typically pulled out by a vehicle, which takes about two minutes, but can also be done manually, albeit by a number of people. When ready for market, after it goes through regulatory checks, Mr. Hingley’s company Renovagen will make the solar power systems bespoke, according to what size the buyer wants. The surface it is placed on does not have to be flat, he said.\n\nPrototype\n\nAn initial prototype had a capacity of 6 kW, about twice that of a solar array on a typical family home. The current generation will have a capacity of up to 18 kW, said Mr. Hingley, and similar levels of efficiency to solar systems sold for homes in the U.K. However, since they may be used in countries where the demand for energy is much less, the Renovagen system will be able to serve many more homes than a comparable solar array in Britain, he said. The steel unit in which the spool of panels is housed has lifting rings on the top which can be attached to helicopters so that the unit can be dropped by air.\n\nWhen the Philippines was hit by Typhoon Haiyan in 2013, Tacloban City was cut off from supplies and while hospitals had diesel generators, there was no diesel to fuel them. It is occasions like that where the Renovagen system could have been used to best effect, said Mr. Hingley. “I could see that if we could drop this on the ground at the beginning, right after the disaster, then it could have powered all of that equipment in the hospital,” he said.\n\nA second market is for the military, and specifically for forward operating bases where fuel is sometimes, in the case of remote operations, being flown in.\n\nThe protection of fuel convoys has resulted in large numbers of military deaths, Mr. Hingley said.\n\nMining companies which may be exploring in specific areas for short periods at a time, and need to be able to up and move, are also potential customers, he said.\n\n“You might only be at a particular site for a few weeks and then you might move a few miles [and] be on that next site for a few weeks. And all of that might be so remote that you would have to fly fuel in for the diesel generators that you would be running.” So far, Renovagen has received orders for three prototype systems from an unnamed client. Mr. Hingley expects them to get full regulatory approval in four months so they can start to make and sell them on the market. The early versions can cost between £50,000 and £110,000, though he expects the price to drop substantially as the business grows and the cost of solar and battery components comes down. — © Guardian Newspapers Limited, 2016\n\nThe system can be used for disaster relief, armies on the move and mining stations", 
    "section": "national", 
    "title": "Energy on tap with solar panel that fits in a bag", 
    "subsection": "general", 
    "date": "2016-03-07"
}