{
    "author": [
        "Devesh K"
    ], 
    "text": "The Central Bureau of Investigation has carried out searches in connection with alleged illegal remittances of over Rs. 3,000 crore in foreign exchange to Dubai and Hong Kong through current accounts opened with a Bank of Baroda branch in the national capital. The agency suspects the involvement of 11 persons and private firms.\n\n“The searches were conducted at 10 places on the official and residential premises of the suspects in Delhi and other places as part of the ongoing investigation into alleged violation of banking norms. About 8,500 transactions were made from 59 bank accounts opened in the name of various firms against on-paper import of goods and software from Hong Kong and Dubai,” said a CBI official. During the searches, the CBI seized Rs. 40 lakh in cash, rubber stamps of 44 different companies, 15 PAN cards, pen-drives and computer hard disks containing details on the case. Currencies of the United States, China, Europe, United Arab Emirates, Nigeria, Hong Kong and Sri Lanka were also found.\n\nBased on a complaint from the bank management, alleging overseas remittances on the basis of imports that were never made, the CBI registered a corruption case last October. Investigations revealed that the bank accounts, used to transfer the funds, had been opened in the names of firms set up on the basis of fraudulently obtained identification documents. The transactions were kept below $1 lakh to evade detection.\n\nThe CBI had arrested the bank’s Assistant General Manager S.K. Garg and in-charge (foreign exchange) Jainish Dubey in December last year. In the money laundering case, the Enforcement Directorate has arrested six people. According to the ED, unscrupulous exporters supply goods to conduits at inflated prices, on the basis of which they claim undue drawback duty incentive. However, the conduits sell the same goods to end-buyers at genuine prices.\n\nSeizes Rs. 40 lakh in cash, rubber stamps of 44 companies and\n\n15 PAN cards", 
    "section": "national", 
    "title": "Forex scam: CBI searches many places in New Delhi", 
    "subsection": "general", 
    "date": "2016-03-07"
}