{
    "author": [], 
    "text": "This image courtesy of the National Oceanic and Atmospheric Administration (NOAA), Office of Ocean Exploration and Research, Hohonu Moana, shows a small translucent octopus. It does not have any pigment cells.— Photo: AFP/NOAA\n\nScientists have discovered a “ghostlike” octopus in deep water off Hawaii that appears to belong to a previously unknown species, researchers said.\n\nA submersible research craft spotted the small, translucent octopus by chance around four kilometres underwater off Necker Island on the northwestern end of the Hawaiian Archipelago, the US National Oceanic and Atmospheric Administration (NOAA) said.\n\nSitting on a rock\n\n“As the remotely operated vehicle was traversing a flat area of rock interspersed with sediment at 4,290 meters, it came across a remarkable little octopod sitting on a flat rock dusted with a light coat of sediment,” the NOAA’s Michael Vecchione said.\n\n“The appearance of this animal was unlike any published records and was the deepest observation ever” for this type of marine creature, he added, in a statement released on March 2.\n\nThe octopus — nicknamed “Casper the Friendly Ghost” on social media — was caught on camera by the Okeanos Explorer, which the NOAA uses to explore underwater geology and marine life in little-known parts of the world’s oceans.\n\nSingle row of suckers\n\nVecchione said the newly discovered octopus has a single row of suckers on each tentacle instead of the usual two, but is “particularly unusual because it lacked the pigment cells, called chromatophores, typical of most cephalopods, and it did not seem very muscular.”\n\n“It is almost certainly an undescribed species and may not belong to any described genus,” he said.\n\nTwo distinct groups\n\nDeep-sea octopods are easily separated into two distinct groups: the cirrate, or finned, octopods, characterised by fins on the sides of their bodies and fingerlike cirri associated with the suckers on their arms and incirrate octopods, which lack both fins and cirri and are similar in appearance to common shallow-water octopus.\n\nThe octopod imaged in detail was a member of the second group, the incirrates. A distinctive characteristic was that the suckers were in one, rather than two, series on each arm.\n\nCirrate octopods have been reported to depth of over 5,000 metres.\n\nHowever, the deepest published reports for incirrates are all less than 4,000 metres.\n\n“We are now considering combining this observation with some other very deep incirrate observations by a German cruise in the eastern Pacific into a manuscript for publication in the scientific literature,” said Vecchione. — PTI\n\nThe octopus was nicknamed “Casper the Friendly Ghost” on social media.", 
    "section": "national", 
    "title": "Ghost-like octopus found in the deep off Hawaii", 
    "subsection": "general", 
    "date": "2016-03-07"
}