{
    "author": [
        "Samarth Bansal"
    ], 
    "text": "Carefully crafted tweets and follow-backs ensured success\n\nA recent study by researchers at the University of Michigan, published in the Economic and Political Weekly , provides insights into how Prime Minister Narendra Modi’s online image was constructed and evolved over time. By analysing data from @narendramodi Twitter handle — official account of Mr. Modi — researchers found that a combination of carefully crafted tweets and strategic follow-backs to other Twitter accounts helped Modi build a powerful online brand.\n\nWhom did he follow till general election?\n\nAs of May 2014, Mr. Modi followed 1,043 Twitter accounts, which were categorised under different heads based on public information provided in their account description. It was found that the largest category belonged to laypersons, which constituted 41 per cent of the accounts. Such a behaviour is an exception to the rule as most politicians use Twitter as a one-way tool for broadcasting information. According to the authors, Mr. Modi’s reciprocity to the layperson and BJP members (12 per cent) means a call to action. Fourteen per cent of accounts being followed were of BJP politicians. A number of celebrity accounts were also followed by Mr. Modi.\n\nSpeaking with The Hindu , Arvind Gupta, head of BJP’s IT Cell, said: “In my personal opinion, the Prime Minister does not view social media as a one-way broadcast medium. He uses this to listen, get feedback, engage and get a sense of the mood of the youth and wide diversity of Indians who have taken to social media in a big way. The Prime Minister’s follow-back list is merely a reflection on getting a sense of the mood on social media across a cross section of voices.”\n\nHow social media message changed over time?\n\nAn analysis of the content of tweets from four phases between February 2009 and February 2015 sheds light on how Mr. Modi’s social media message has changed over time. Youth and development were consistent themes in all phases. Hinduism theme — referring to “Hindutva” or Hindu greetings, practices, festival and gods — was dominant in the first two phases but drops off significantly leading to 2014 general elections.\n\nIn terms of word count, mention of “Gujarat” declines after the first two phases, signifying Mr. Modi’s transition from a regional politician to a national one. In the third phase, election rallies and political confrontation dominate.\n\nRetweets and favourites\n\nConsistent growth of retweeting and favouriting of Mr. Modi’s tweets was observed between 2009 and 2015. Though retweeting was higher until February 2014, favouriting overtook retweeting — as is of most celebrity accounts — with increase in Mr. Modi’s online following. This analysis shows evidence of consistent activity in pre election retweeting by Mr. Modi’s followers.\n\nIn an email conversation with The Hindu , Professor Joyojeet Pal, one of the researchers, said: “Higher retweet rate is typically a sign that someone is trying to propagate your message — your followers or supporters, for instance. A higher favourite rate, on the other hand, is more indicative of either a kind of ‘fandom’ or some form of casual acknowledgement.”\n\nThe significance of retweets becomes amply clear by comparing accounts of Rahul Gandhi and Shashi Tharoor, Prof. Pal said.\n\nHe observed that even though Mr. Tharoor’s follower count was eight times compared to that of Rahul, tweets of the latter, on an average, get retweeted several times more, which was an evidence that there was a support base retweeting Rahul’s content.\n\nHe said tweets that were carefully crafted having persuasive messages — as were of Rahul and Mr. Modi — had better potential for retweeting compared to Mr. Tharoor’s casual citizenry style of tweeting.", 
    "section": "national", 
    "title": "How Twitter helped create Brand Modi", 
    "subsection": "general", 
    "date": "2016-03-07"
}