{
    "author": [
        "Jim Yardley"
    ], 
    "text": "Risotto gets cooked at the Bollate Penitentiary in Milan, where an inmate-run restaurant has become an unexpected culinary success story.— Photo: NYT\n\nThe waiters glided through the crowded dining room of InGalera, a restaurant that opened recently to rave reviews. Dinner reservations are almost fully booked for March, and the Milanese elite have taken note. A former bank president came a few weeks ago. So did a former Miss Italy. Families come on weekends.\n\nFor Silvia Polleri, the restaurant’s manager and visionary, InGalera is a dizzying triumph, if more because of the locale than because of the food.\n\nIt is inside the Bollate penitentiary, a medium-security prison with 1,100 inmates on the outskirts of Milan. The waiters, dishwashers and cooks have been convicted of homicide, armed robbery, drug trafficking and other crimes. “May I take your plate, sir?” a waiter, Carlos, an inmate dressed in a tie, white shirt and black vest, asked as he cleared a table on a recent night.\n\nIt is hard to imagine a less likely culinary success story than InGalera, or a more intriguing experiment in rehabilitating inmates — and confronting public attitudes about them.\n\nFew people think of prisons as a place for a nice night out, yet the novelty of going to the prison grounds for food and drink has resonated, and even become something of a marketing tool.\n\nMs. Polleri decided that the best way to reassure patrons was to take a wink-wink approach. The name, InGalera, is Italian slang for “In Prison.”\n\nThe restaurant’s design is sleek, airy and modern, but the walls are decorated with posters from famous prison movies, including Escape From Alcatraz with Clint Eastwood.\n\nCuriosity about a forbidden and feared world has turned a night at InGalera into a daring adventure, with a fine meal as a bonus. (It has a rating of 4.5 out of 5 stars on TripAdvisor.)\n\n“We wanted to see the reality here,” said Carla Borghi, who came with a group of couples from the nearby town of Paderno Dugnano. “It is not the classic restaurant. But it is a classic restaurant. The food is excellent.”\n\nRehabilitation\n\nThe issue of how best to rehabilitate offenders — and lower the recidivism rate — remained difficult. Italy has long allowed inmates in medium-security prisons to move around the facilities during the day.\n\n“The main problem has been that they do little during the day, which doesn’t help them at the present, nor for their future outside prisons,” said Alessio Scandurra, who works for Antigone, a nonprofit group focused on the rights of detainees.\n\nThe force behind the restaurant is Ms. Polleri, who spent 22 years teaching kindergarten before becoming a caterer and later founding a social co-op in 2004 to help inmates. She hired select inmates from Bollate for catering jobs outside the prison. Once, she took a convicted bank robber to wait on tables at a reception in a bank.\n\nBut the idea of starting a restaurant was an altogether different challenge.\n\n“People looked at me like I was crazy,” she said. “They also thought I was crazy when I said I wanted to name it InGalera. But I wanted to stop talking about this in a sweet way.” — New York Times News Service", 
    "section": "national", 
    "title": "Italian cuisine worth going to prison for", 
    "subsection": "general", 
    "date": "2016-03-07"
}