{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Bringing a political party under the Right to Information Act will lead to an undemocratic infringement on its confidential discussions, including its attitude to the government and plans to organise agitations against the “wrong policies of the government”, Communist Party of India (Marxist) general secretary Sitaram Yechury has told the Supreme Court.\n\nOn behalf of his party, Mr. Yechury made the statement in an affidavit filed in response to the Supreme Court’s query why parties should not be declared “public authorities” under the Right to Information Act, 2005. If the court decides that parties are indeed public authorities, six national parties involved in the litigation will be accountable to the public and will have to disclose the details of their income, expenditure, funding and donations and the identity of donors.\n\nBesides the Congress and the BJP, the petition filed by RTI activist Subhash Chandra Agarwal and NGO Association for Democratic Rights arraigns the CPI(M), the CPI, the Nationalist Congress Party and the Bahujan Samaj Party.\n\nThe petition is based on orders of the Central Information Commission in 2013 and on March 16, 2015, declaring all national and regional parties public authorities.\n\nIn a nuanced response, Mr. Yechury said his party believed in transparency and giving the public access to the financial details of political parties. But the CIC’s order to declare parties public authorities was wrong in facts and law. For one, Mr. Yechury argued, a political party is a “voluntary association of citizens” who believe in an ideology. They hold free and frank discussions. Declaration of a party as a public authority would “destabilise the very party system in the country.” Opponents would use the RTI Act as a tool to gain access to confidential information. “In a democratic political system, protection is granted to political parties to keep the confidentiality of the inner-party discussions on policies, programmes, assessment of other political parties, the governments, attitude towards them, chalking out agitations and struggles against the wrong policies of the government, preparation of manifestos, selection of candidates and leaders to the various levels of the party...,” the affidavit said.\n\nOtherwise, it will lead to undemocratic infringement,\n\nsays Yechury", 
    "section": "national", 
    "title": "Keep parties out of RTI Act, CPI(M) tells SC", 
    "subsection": "general", 
    "date": "2016-03-07"
}