{
    "author": [], 
    "text": "While intelligence inputs said 15,000-20,000 people would attend it, 40,000-50,000 people assembled for the meeting, the commission said, criticising intelligence officials for not making available the video-recording of the mahapanchayat.\n\nIt held responsible the then SSP, Muzaffarnagar, Subhash Chandra Dubey, and local intelligence inspector Prabal Pratap Singh and recommended administrative action against them for negligence.\n\nThe commission also went into the role of the then DM, Kaushal Raj Sharma, and sought clarifications from him. It pointed to the fallout of the transfers of the then Muzaffarnagar DM, Surendra Singh, and the then SSP, Manzil Saini, as they triggered anger among the Hindus, especially Jats.\n\nThe report said inflammatory speeches were made by members of both communities and put the blame for the riots on the “acute communal divide” in Muzaffarnagar and Shamli districts because of the Kanwal incident of August 27, 2013. “The riots resulted from the ‘polarisation’ between Hindus and Muslims as a consequence of the Kanwal incident, in which a Muslim youth Shahnawaz and two Hindu youths Sachin and Gaurav were killed,” the report says. The commission also pointed to the role of the social and print media in rumour-mongering and exaggerating reports but did not single out any group.\n\nSenior lawyer Asad Hayat, a co-petitioner in a Muzaffarnagar riots case in the Supreme Court, called the report a “cover-up.” “What was the use of the commission if it cannot take action against leaders like Sangeet Som? What legal use will it serve for victims? Over 80 murders were not considered part of the riots. Why has the commission failed to reach out to those people?” Mr. Hayat said.\n\nShehzad Poonawalla, a petitioner in the case, condemned the report for giving a “clean chit” to the government and BJP leaders.\n\n“What was the use of the Commission if it cannot take action against leaders like Som?”", 
    "section": "national", 
    "title": "Local officials to blame, says Muzaffarnagar probe panel", 
    "subsection": "general", 
    "date": "2016-03-07"
}