{
    "author": [
        "Josy Joseph"
    ], 
    "text": "The Comptroller and Auditor-General (CAG) has flagged several instances of possible revenue loss to the government in the joint ventures running the airports in Mumbai and Delhi, even as it has been awaiting access to the account books of the two companies for over seven months, show documents accessed by The Hindu .\n\nBased on a limited audit of the books of the Airports Authority of India (AAI), which holds a 26 per cent stake in both the JVs, the CAG has pointed out significant financial losses suffered by the authority because of various anomalies in the implementation of JVs. The federal auditor was entrusted by the AAI on July 29, 2015, with the task of examining if it was receiving a fair share of revenue from DIAL (Delhi International Airport Ltd.) and MIAL (Mumbai International Airport Ltd.).\n\nThe CAG was to be allowed access to records of DIAL/MIAL under provisions in Clause 11.3 of the Operation, Management and Development Agreement (OMDA).\n\nWorrisome letter\n\nWhat has raised concern in government circles is Union Civil Aviation Minister P. Ashok Gajapathi Raju’s letter to the CAG, Shashi Kant Sharma, on January 22. “Both DIAL & MIAL have expressed their reservations about nomination of CAG as AAI’s representative in terms of section 11.3 of OMDA, on the ground that clause 11.3 cannot be read in isolation and that this clause was part and parcel of overall scheme of audit which has already been completed as per OMDA. Since AAI did not accept their contention, they have requested that the matter be treated as “dispute” and provisions relating to dispute resolution in OMDA be followed. Accordingly, they have requested for invoking arbitration under clause 15.2 of OMDA for resolution of above ‘disputes’,” it said.\n\nAfter elaborating on the objections raised by the two private parties, the Minister’s letter said he was not going “into the merits of their contention at this stage.” The statement has surprised many sources who told The Hindu it was contrary to the AAI’s decision to ask the CAG to audit the JV, as well as the Supreme Court’s April 2014 order upholding the right of CAG to carry out the audit of private entities which share revenue with the government, and provisions of the OMDA (Operation, Management and Development Agreement) for the airports.\n\n“Their [the private operators] game is to delay the audit, and finally send it to arbitration,” one senior official said. The Minister’s letter suggested that instead of the CAG asking for records from DIAL/MIAL as a “representative” of AAI, the AAI will ask for records and then make it available to CAG. In Parliament last week, Minister of State for Civil Aviation Mahesh Sharma claimed that the AAI had sought documents from its JV partners.\n\n“That has been the position for seven months now,” one source said, about the standoff with GMR, which runs the Delhi airport, and GVK, which runs the Mumbai airport.\n\nPrasenjit Mukherjee, deputy CAG, wrote to the Civil Aviation Secretary R.N. Choubey on February 2, seeking a time-bound action from AAI. In his two-page letter, Mr. Mukherjee pointed out that the CAG had carried out a verification of revenue collections of AAI from the two airports, based solely on the AAI books. The findings were startling.\n\n“It was seen that though significant revenues are earned by MIAL and DIAL through their concessionaires including Joint Ventures (JVs), the independent auditor [from whose report AAI derives assurance regarding accuracy of the reported revenues of MIAL and DIAL] does not have access to books of accounts of such concessionaries and JVs of MIAL and DIAL,” Mr. Mukherjee said. Earlier the CAG had said intransigence by the two airport JVs were “not only a violation of the provisions of the OMDA but against accepted norms of transparency.”\n\nPrivate operators\n\nof Mumbai, Delhi airports denied access to accounts despite JV clause", 
    "section": "national", 
    "title": "Minister deflects CAG queries on revenue loss", 
    "subsection": "general", 
    "date": "2016-03-07"
}