{
    "author": [
        "National Bureau"
    ], 
    "text": "Delegates take selfies with Prime Minister Narendra Modi at the valedictory session of the National Conference of Women Legislators at Parliament House on Sunday.— PHOTO: PTI\n\nPrime Minister Narendra Modi on Sunday stressed the importance of women-led development and said a nation was always empowered by its women.\n\nMr. Modi, addressing the valedictory session of the National Conference of Women Legislators in the Central Hall of Parliament here, said: “We must think beyond “women development,” and move towards “women-led development.”\n\n“A country is always empowered by its women. It is she who in different roles — as a mother, a sister and a wife — nurtures citizens and these empowered citizens then play a role in building up an empowered society and country,” said Mr. Modi.\n\nMr. Modi said that multi-tasking, which is considered to be a very important element of modern-day management, comes naturally to women.\n\n“In the managerial world multitasking is a speciality and our women are the best in handling numerous tasks at a given time,” he said.\n\nWomen representatives from both Houses of Parliament, State Legislative Assemblies and Councils are attending the two-day conference that began on Saturday here.\n\nCongratulating Lok Sabha Speaker Sumitra Mahajan, for her leadership and vision in organising the conference, Mr. Modi said that in addition to the structured component of such events, experiences shared informally among delegates are also extremely enriching.\n\nMr. Modi urged the women legislators to engage with their constituents using technology.\n\nThe Prime Minister described his own experience in this regard, and spoke of the enriching thoughts and views he has been receiving through the MyGov platform and Narendra Modi App.", 
    "section": "national", 
    "title": "Modi calls for women-led growth", 
    "subsection": "general", 
    "date": "2016-03-07"
}