{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "An initiative by the Supreme Court to probe gender discrimination in Islamic personal law has opened the door for Muslim women hailing from various parts of the country to come forward against their own religious practices of marriage, divorce and property inheritance.\n\nLatest in the trickle of petitions being filed in the Supreme Court is one by the Kerala-based organisation, NISA - Progressive Muslim Women Forum, through its representative V.P. Zuhara. This organisation in Kozhikode district works for the civil and matrimonial rights of women\n\n“Women who practice Muslim faith are still subjected to grave social evils that find sanction in the Shariat law and as a consequence, proliferates discrimination against the Muslim women in society,” it said.\n\nIn its plea, the organisation, represented by advocates Sriram Parakkat and Govind Manoharan, said the community was stuck in time since the passage of Muslim Personal Law (Shariat) Application Act by the British in 1937. Progressive laws like the Dissolution of Muslim Marriages Act, 1939, and the Muslim Women (Protection of Rights on Divorce) Act, 1986, have not been able to wean the community away from discrimination shown to Muslim women.\n\nThe organisation rebuts the claim that a court cannot adjudicate on Muslim personal laws. The plea contends that courts can adjudicate under Article 13 if the Shariat law is found to be “inconsistent with or in derogation of the fundamental rights” of Muslim women.\n\nThis plea immediately follows the Supreme Court’s admission of an earlier petition filed by Shayara Bano to declare the practice of triple talaq, nikah halala (bar against remarriage with divorced husband without an intervening marriage with another man) and polygamy under Muslim personal laws as illegal, unconstitutional, and violative of the rights to equality, dignity, life and freedom of religion under the Constitution.\n\nMs. Bano had said she only wished to “secure a life of dignity, unmarred by discrimination on the basis of gender or religion.\n\nOn October 16, last year, the Supreme Court decided to register a PIL suo motu titled “Muslim women’s quest for equality” on gender discrimination women face under Muslim personal law.\n\nThe suo motu PIL and Ms. Bano’s petition are scheduled for hearing on March 28.\n\nResponse from across the country on practices of marriage, divorce and inheritance", 
    "section": "national", 
    "title": "More Muslim women join cause with SC’s PIL for gender parity", 
    "subsection": "general", 
    "date": "2016-03-07"
}