{
    "author": [
        "Abdul Latheef Naha"
    ], 
    "text": "A mini version of cricket with different rules is gaining popularity among youngsters\n\nA mini version of cricket with different rules is becoming a passion among the youngsters in some areas of the district.\n\nLocally called Mutty-4 cricket, this version of game has been attracting crowds in huge numbers in places such as Tirurangadi, Kottakkal and Vallikkunnu. A Mutty-4 tournament held at Cherumukku near Tirurangadi on Saturday night saw 52 teams from the neighbourhoods participating in it.\n\nCompact, quick\n\nThe tournament, which began at 9 p.m. on Saturday, went on to Sunday morning. Sacrificing their sleep, a large number of youngsters witnessed the final match played at 9.30 a.m. on Sunday. “The popularity of the game is amazing. It’s largely because of the compactness and quickness of the game,” said M. Shafi, president of the Action and Sports Club, Tirurangadi, which organised the tournament.\n\nThe game got its name Mutty-4 from the style of play permitted within the small field having a diameter of less than 22 metre.\n\n“We held the tournament in a 17-metre ground,” said Mr. Shafi. Each team comprising seven members could play three overs. When no fast-bowling was permitted, the batsmen had many restrictions too. Apart from the usual catches and stumping, a hit over the boundary could get the batsman out. The batsmen playing on a seven-metre-long pitch could pick up runs from drives to all positions except slips, third man, gully, leg gully, and fine leg.\n\nA knock going past the wicket-keeper did not bring any run.\n\nHowever, no-balls and wides had runs. The game had no leg-byes. “It was all about spinning with the softball and driving along the ground without getting out,” said A.K. Mustafa, a promoter of the game.\n\nThe umpire could use his discretion to decide the optimum speed of the ball. Beyond a limit, he could call it a dead ball. The Kings team of Pantharangadi won the championship when the S.S. team from Vallikkunnu became the runner-up.", 
    "section": "national", 
    "title": "Mutty-4 takes Malappuram by storm", 
    "subsection": "general", 
    "date": "2016-03-07"
}