{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says he will transfer alleged undisclosed assets to govt. for a nominal Re. 1 if it can make a list\n\nP. Chidambaram says he is the real target of allegations against his son.\n\nCongress leader and former Finance Minister P. Chidambaram on Sunday said if the Centre made a list of all the allegedly undisclosed assets it said his son Karti owned, the family would voluntarily execute any document necessary to transfer to the government the same for a nominal consideration of one rupee.\n\n“Let the government become the owner of the alleged undisclosed assets,” Mr. Chidambaram said in a statement. Mr. Karti, he said, was being targeted only for being his son.\n\nHe rejected as “malicious and totally false” allegations that Mr. Karti holds undisclosed assets abroad.\n\nMr. Chidambaram said the allegations against his son were politically motivated.\n\nThe “real target is me,” he said in response to reports about the alleged investments of Mr. Karti in real estate and other business activities in 14 countries across the world.\n\nReports alleged that Mr. Karti’s investments had come to light through documents recovered during raids by the Enforcement Directorate and the investigation wing of the Income Tax Department in the Aircel-Maxis scam.\n\n“If the government is of the view that Karti has undisclosed assets, I would ask the government to make a list of such alleged undisclosed assets … Ultimately, truth will prevail,” the former Finance Minister said.\n\nHe said Mr. Karti ran a legitimate business, apart from managing inherited property, adding he had been an income tax assessee for many years.\n\nHe had filed his income tax return, including a statement of assets and liabilities, every year and that the assessments had been completed up to the assessment year 2013-14 by the Income Tax Department, the former Finance Minister said.\n\nOn allegations of foreign exchange violations, the Enforcement Directorate, in December, searched the Chennai premises of a company belonging to Mr. Karti in continuation of the operation against two other firms owned by his associates.\n\n“I was informed that they are investigating three firms and two of them belong to my friends. They are owned by professionals and managed by a competent Board of Directors. I am not aware of the third firm,” Mr. Karti had said then.\n\nHe had also said that there was no basis for the ED to have visited his office or to make any enquiries. He also made it clear that neither he nor any member of his family was a shareholder or director of these firms. “We do not have any economic interest in these firms,” he said.\n\nThe authenticity of the documents seized during the search is yet to be ascertained by the ED. Investigations are at a nascent stage, government sources told The Hindu .", 
    "section": "national", 
    "title": "‘My son runs legitimate businesses’", 
    "subsection": "general", 
    "date": "2016-03-07"
}