{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Reptile named Wallaceophis Gujaratensisis\n\nNine years after they first saw it in a photograph, two researchers from Mumbai and three others from Gujarat have confirmed the discovery of a new snake species. The find is one of the rarest of moments in the recent reptile history of India.\n\nThe new snake genus, Wallaceophis is named after Alfred Russel Wallace for his pioneering work on biogeography, and for co-discovering the theory of natural selection. The species has been named gujaratensis . The findings were published in the journal Plos One .\n\nMumbaikar researchers Zeeshan A. Mirza and Rajesh Sanap, along with three wildlife enthusiasts from Gujarat; Raju Vyas; Harshil Patel and Jaydeep Maheta were instrumental in the discovery.\n\nMr. Mirza, a herpetologist from National Centre for Biological Science, Bangalore, and the lead author of the study, came across an image of this snake in a paper published by Mr. Vyas back in 2007.\n\n‘Odd-looking’\n\n“The snake was odd-looking, and I called Mr. Vyas to seek his opinion on the identity of the snake, but he just had an image,” said Mr. Mirza. “Seven years later, Harshil Patel, a researcher from Gujarat studying reptiles and amphibians of southern Gujarat, informed me that the snake has been found by snake rescuer Jaydeep Maheta.”\n\nRajesh Sanap, a research associate with the National Centre for Biological Sciences, aided with the lab work. While Mr. Patel compared specimens from the collection of the Bombay Natural History Society, Mr. Mirza studied the snake with literature available.\n\nIn the meantime, Mr. Vyas collected data on 12 individuals of the same species from several locations in Gujarat.\n\nBased on scalation, tooth number, bone morphology and DNA, the snake was identified as belonging to a group of colubrid snakes that include racers, royal snakes and whip snakes. “A paper jointly written by us was submitted last year July to Plos One , which finally got accepted later this January,” said Mr. Sanap.\n\nColubrid snakes (Family Colubridae) are represented across the world with more than 1,800 species, and it is likely this number will grow with advanced techniques in species delimitation.\n\nWallaceophis gujaratensis has until now been found in seven locations in Gujarat.", 
    "section": "national", 
    "title": "New snake species discovered in Gujarat", 
    "subsection": "general", 
    "date": "2016-03-07"
}