{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Baishali Dalmiya, Trinamool candidate and daughter of Late BCCI president Jagmohan Dalmiya, in Howrah on Sunday.- Photo: PTI\n\nDiscontent against the leadership of the Trinamool Congress erupted in several districts of West Bengal within 48 hours of the party announcing candidates for the coming Assembly polls. Party chairperson and Chief Minister Mamata Banerjee warned her colleagues against indulging in anti-party activities.\n\nTMC workers in the Hemtabad constituency in Uttar Dinajpur district blocked NH 34 for half-an-hour on Sunday morning against the candidature of Sabita Khettry, wife of local block president of the party.\n\nIn South 24 Paraganas district, Abdus Salam Molla, a local TMC leader of Bhangar constituency, known for his close proximity to party strongman and former MLA Arabul Islam, quit the party against the candidature of expelled Communist Party of India-Marxist (CPI-M) leader Abdur Rezzak Molla, who recently joined the TMC. Mr. Salam has decided to contest as an Independent in Bhangar and his supporter staged a demonstration in the the Ghatakpukur area.\n\nEarlier on Saturday, hundreds of disgruntled TMC workers from Bardhaman’s Bhatar constituency held demonstrations in front of the TMC State headquarters against the decision to not re-nominate sitting MLA Banamali Hajra.\n\nIn neighbouring Howrah, supporters of local TMC leader Masud Alam Khan protested in front of a crucial Indian Oil depot in the Mourigram area. They demanded that Mr. Khan be made the candidate instead of the sitting MLA Brajamohan Majumdar.\n\nIn Birbhum district, supporters of the TMC zilla parishad member Jatileswar Mondal who was denied ticket staged a road blockade and shouted slogans in front of the local TMC office. Protests were also reported from Paschim Medinipur district.\n\nRallies were held against the nomination of Minister Rabindranath Bhattacharjee from Singur constituency.", 
    "section": "national", 
    "title": "Protests erupt over Mamata’s list of candidates", 
    "subsection": "general", 
    "date": "2016-03-07"
}