{
    "author": [
        "Laiqh A"
    ], 
    "text": "Bhanumati K. Patel from Junagadh wins three gold medals atthe 37th National Masters’ Athletics Championship in Mysuru\n\nFor the second successive year, Bhanumati K. Patel from Junagadh in Gujarat is returning home with gold medals from the National Masters’ Athletics Championship.\n\nThe 76-year-old aced her rivals in the 5-km run, 5-km walk, and 1,500 metres run at the 37th athletics championship, which concluded at Chamundi Vihar Stadium in Mysuru on Sunday.\n\nMs. Patel told The Hindu that she took to competitive athletics after she was spotted praying, standing on one leg, at a temple in Junagadh and a devotee asked her to enrol in the Masters’ Athletics Association in her city.\n\n“I took his advice and participated in the 36th athletics championship held at Dharamsala in Himachal Pradesh last year and won three gold medals. This year also, I won three gold medals,” she said.\n\nMs. Patel’s diet is very frugal. A strict vegetarian, she has a roti for breakfast with milk. During the day, she eats a little rice and vegetables whenever hungry.\n\nShe wakes up around 4.30 a.m. to do household chores. “I stay alone, so I have to do all the chores by myself,” she said. She then walks to the market or the temple, before returning and going to a school, where she teaches to earn a living.\n\nMs. Patel said she does not practice for such events, but has managed to remain fit, thanks to her 2-3 km walk regime every day. She said has no ailments. “I don’t have diabetes or blood pressure.” Ms. Patel’s message to women is to remain active in life. “Do lots of work, eat well and participate in sports,” she says.\n\nThe championship in Mysuru attracted 864 women against the total 3,335 participants from different parts of the country, aged 35 and above. The oldest woman participating in the event is 90-year-old K. Mahalakshmi from Andhra Pradesh.", 
    "section": "national", 
    "title": "Running strong at 76", 
    "subsection": "general", 
    "date": "2016-03-07"
}