{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "There is a need for popular resistance, says CPI(M) general secretary Sitaram Yechury\n\nIssuing a call to rise above electoral alliances and party politics to form a popular people’s resistance, Communist Party of India (Marxist) general secretary Sitaram Yechury on Sunday called for a united front in the battle of ideas against the Bharatiya Janata Party (BJP) and the Sangh Pariwar. “Whether it is Jai Bhim of one party or lal salaam of some others, ultimately it has to converge into inquilab for all. There is a need for popular resistance cutting across political parties, rising above all differences,” he said, addressing the concluding session of the Mumbai Collective at the YB Chavan centre.\n\n“This is not limited to certain elections or alliances formed for the sake of electoral politics,” Mr yechury said.\n\n“People’s resistance has to be the centre. It is the battle of ideas that is currently going on in the country and all views must be discussed.”\n\nCiting the example of state action against the Jawaharlal Nehru University, Mr Yechury said all forces joined hands against the government on the matter: “We as Left were there, but then came Rahul [Gandhi], Nitish’s party [Nitish Kumar’s Janata Dal (United)] , followed by the others. We need to identify and isolate those spreading poison in society.”\n\nD Raja of the Communist Party of India (CPI), Jitendra Awhad of the Nationalist Congress Party (NCP) and Kapil Patil of Lokbharati also addressed the session.\n\nMr Raja called JNU student union leader Kanhaiya Kumar the best product of Prime Minister Narendra Modi’s ‘Make in India’ initiative.\n\nEarlier, at a press conference, Mr Yechury and Mr Raja said the government was using nationalism to hide misgovernance and inept handling of the economic crisis.\n\nMr Yechury said, “For the West Bengal assembly elections, our slogan is TMC hatao, Bengal bachao . Let the Congress too say it first. We have formed a united front of all other parties to contest the elections. There is no alliance or front with the Congress today.”", 
    "section": "national", 
    "title": "‘Unite above poll politics to fight BJP-RSS’", 
    "subsection": "general", 
    "date": "2016-03-07"
}