{
    "author": [], 
    "text": "Remove encroachments\n\non Arcot Road\n\nArcot Road passes through Vadapalani, Virugambakkam, Alwarthirunagar, Valasarawakkam and Porur. Shops, hotels and commercial establishments have encroached upon both sides of the road at Avichi School, La Chateline School, Keshavardini and Karambakkam. The width of the road has shrunk at these places, leading to traffic jams near Forum Vijaya Mall and Saligramam. There is no proper stormwater drain. The road is filled with water even after a light shower. We request the government to remove encroachments, widen the road and dig a stormwater drain.\n\nS.V. Nagaraj\n\nValasarawakkam\n\nOld building a threat\n\nto nearby structures\n\nThere is a building on Amman Koil Street, which is more than 100 years old. Big trees have grown inside the house and the roots cause damage to the houses and shops nearby as their walls are cracked. I have already filed complaints with the authorities concerned, but no steps have been taken so far. People living in houses next to the old building feel unsafe because of this.\n\nG.T. Krishnamurthy\n\nPark Town\n\nMonsoon spells\n\nchaos for GST Road\n\nDuring every monsoon, Grand Southern Trunk Road (GST Road) is flooded at three locations in Chrompet — near the police station, Tambaram Taluk government hospital and BSNL office. Though it has been happening for several years now, authorities still have not been able to find a solution to this problem. Due to flooding, the traffic comes to a standstill on the road. Even ambulances get caught in the traffic jam. GST Road has not been provided with proper drainage and most of the culverts have either disappeared or been encroached upon. There are many encroachments upon the lakes in the area. I appeal to the Kancheepuram Collector to remove the encroachments on waterbodies.\n\nV. Santhanam\n\nNew Colony\n\nComputerise\n\nration shops\n\nWhen consumers go to the ration shops and present their cards, the employees take time to search for the customer’s details from the ledger. After finding the details, they again take time to write a bill. Considerable amount of time is wasted this way for the staff and the cardholders. Authorities should ensure computerisation of ration shops, which will be a win-win situation for all involved.\n\nT.S. Karthik\n\nBhuvaneshwari Nagar\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu@ gmail.com)", 
    "section": "national", 
    "title": "03JANCHMAK01_reader_mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}