{
    "author": [
        "Deepa H"
    ], 
    "text": "Aavin, which has been on an expansion mode quietly over the past four years adding capacity to process five lakh litres of milk a day, is working to add another eight lakh litres per day (LLPD) this year.\n\nA total of Rs. 45 crore is being invested in the Coimbatore dairy to increase its capacity from 2 LLPD to 5 LLPD, Rs. 12 crore in Madurai to expand from 2 LLPD to 3 LLPD and Rs. 27 crore for works in Ambattur, Sholinganallur and Madhavaram dairies in Chennai.\n\nAlready 75 per cent of the construction works at the new dairy coming up in Padalur village in Perambalur is over, officials said.\n\nOn completion, it will add one LLPD of processing capacity for the Tamil Nadu Cooperative Milk Federation, whose brand is called Aavin. The dairy is being constructed at a cost of Rs. 36 crore.\n\nAt present, Aavin has capacity to process over 30 lakh litres per day in its 21 dairies of which four are in Chennai. Last year, during the flush season when there was an abundance of milk and many private dairies stopped procuring milk, Aavin processed 31.30 lakh litres of milk a day on certain days.\n\nAsked if Aavin’s capacity addition was enough to meet the demand, an independent milk industry analyst said that for the present this was good enough.\n\n“Aavin has been on an expansion mode for the past 4 or 5 years, which means it can serve more milk producers thereby strengthening the industry in the State. Once the cooperative sector becomes strong, it will be able to able to dictate terms to the private dairies,” he said.\n\nPrivate dairies that reduced procurement prices last year have still not increased them. Aavin procures cow milk at Rs. 28 per litre and buffalo milk at Rs. 35 a litre. Of the 30 lakh litres, only around 25,000 litres are buffalo milk.\n\nK.A. Senguttuvel of Tamil Nadu Milk Producers Welfare Association said that Aavin must follow the Gujarat model where around 35 per cent of milk is converted to milk-based products. “This will increase profit. Similarly, the government must also provide milk to schoolchildren. It will produce healthy generation of youngsters,” he said.", 
    "section": "national", 
    "title": "Aavin to process 8 lakh litres more per day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}