{
    "author": [], 
    "text": "Number of CASES REGISTERED with the police reduces\n\nThere are many mobile phone users who complain about repeated telemarketing calls or annoying unwanted calls. The number of complaints lodged with the cyber crime police regarding such calls has reduced from around 300 in 2014 to 192 till mid December this year.\n\nRecipients of such calls should immediately make a note of the number and add it to the block list (on their phone) to avoid receiving calls. In case of receiving calls from multiple numbers, the receiver should inform the cyber crime police at the Police Commissioner’s office, as there is a risk of the victim's number getting posted online along with inappropriate content.\n\nAccording to officials in the cyber crime cell in the city, 90 to 95 per cent of such nuisance calls are made by persons known to the victim. The other five per cent are by those who dial a random number and try to build a conversation with the person at the other end. The targets are mostly women. About numbers posted online, the police said that they write to the administrators of the website on which the number is posted and ask them to remove it.\n\nPersons making obscene calls can be booked under section 67(A) of Information Technology Act, which attracts imprisonment for three years.\n\nThe Telecom Regulatory Authority of India (TRAI) in 2007 announced that anyone who has registered with the ‘Do Not Call List’ with their service provider should not be called by anyone for telemarketing. But despite registering in that list, mobile users continue to get calls. It is learnt that such numbers are not disturbed by telemarketers working for leading corporate companies, because telecom service providers share their database after filtering the Do Not Call List with those companies. Mobile users felt that the list should be made available on a common platform (online). This would help smaller telemarketing companies and their sub agents to verify mobile numbers against the list before calling them.\n\nReporting by\n\nM.K. Ananth", 
    "section": "national", 
    "title": "Avoid unwanted calls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}