{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Concern over lack of adequate maintenance in his fort\n\nThe 257th birth anniversary of legendary freedom fighter Veerapandiya Kattabomman was celebrated at Panchalankurichi, his birth place in Ottapidaram taluk on Sunday.\n\nKattabomman, known for his bravery, fought courageously against the British during the freedom struggle. Scores of people thronged Panchalankurichi, where a temple of Veerasakka Devi Amman, the freedom fighter’s ancestral deity, was built during the ancient period, and special prayers and poojas were offered.\n\nThe Veerasakka Devi Amman Temple committee members took out a procession from the temple and moved up to Kattabomman’s Memorial Fort at Panchalankurichi, where they garlanded his statue. The programme was presided over by M. Muruga Boopathi, president of the committee.\n\nThe freedom fighter’s descendants and members of his clan also paid respects to Kattabomman.\n\nIt was in recognition of his gallantry and sacrifice that Kattabomman Memorial Fort was built at Panchalankurichi in 1974, and subsequently 202 houses were built under the title, ‘Kattabomman Santhathiyar Kudiyiruppu,’ for his descendants.\n\nVeemaraja, alias Jegaveerapandia Subramaniya Kattabommudurai, a direct descendant at Panchalankurichi, said Kattabomman took the throne as “Kurunila Mannar” and ruled 96 villages.\n\nC. Mallusamy, joint secretary of the temple committee, expressed concern over lack of adequate maintenance in the fort. The fort should be renovated and ‘sound and light’ show organised to attract tourists.\n\nThe descendants living in the ‘Kattabomman Santhathiyar Kudiyiruppu’ were below poverty line and the government should look into their economic conditions and launch new schemes to render them economic support. The livelihoods of breadwinners in the Kudiyiruppu depended on salt pan operations and building construction industry. Of the 202 houses in the Kudiyiruppu, 180 houses were in existence and the remaining ones ruined, he said.\n\nIlasai Manian, secretary, Raghunathan Library, Barathi Research Centre, Ettayapuram, said that weaponry that were used by soldiers of the British East India Company, which took revolt against the Indian patriots, were being maintained in the government museum, Chennai.\n\nThe weaponry should be maintained in the new memorial at Kayathar to attract historical tourism, he said.\n\nNagarajan, Ottapidaram Tahsildar, R. Balakrishnasamy from Kattabomman Santhathiyar Kudiyirupu, and people from Athanur, Keela Seithalai and Kattabomman Nagar in Tuticorin took part in the celebrations.\n\nThe freedom fighter’s descendants and members of his clan paid respects to Kattabomman", 
    "section": "national", 
    "title": "Birth anniversary of Kattabomman celebrated", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}