{
    "author": [
        "L Renganathan"
    ], 
    "text": "D. Srinivasan, Principal, K. Ramakrishnan College of Engineering, receiving the ‘Best Emerging College for Engineering in India’ award from Vasuben Trivedi, Minister for Higher and Technical Education, Gujarat, in Amhedabad.\n\n‘Best Emerging\n\nEngg. College’\n\nK. Ramakrishnan College of Engineering has bagged the ‘Best Emerging College for Engineering in India’ award at the national-level Education Excellence Awards-2015, organised by The Education Post along with ASSOCHAM in Ahmadabad. The award was received by D. Srinivasan, Principal, K. Ramakrishnan College of Engineering from Vasuben Trivedi, Minister for Higher and Technical Education, Gujarat. The award was given based on parameters such as infrastructure, intellectual capital, research, and development, placements, and industry-institute interface, according to a college release.\n\nTalk on ‘Necleotide’\n\nM. Nethaji, Professor, Chief Research Scientist, Department of Inorganic and Physical Chemistry, Indian Institute of Science, Bangalore, spoke on “An Insight into the Metal Complexes of Nucleotide Constituents” under the auspices of the Space and Sputnik, Department of Chemistry, Seethalakshmi Ramaswami College. He explained nucleoside, the coordination of nitrogenous bases with metals and their interactions. He discussed the crystallographic data of interactions and described the structural aspects.\n\nLecture on ‘Savitri’\n\nWriter and literary critic, Prema Nandakumar, delivered a lecture on “Savitri: An English Epic by Sri Aurobindo” at a meeting of the Pegasus Literary Association of the Department of English, Srimad Andavan Arts and Science College. She made a comparison on the works of Vyasar and Sri Aurobindo and spoke on immortality and eternity of life after encountering Yama. S. Ramamurthy, Dean of Academics, presided. Staff and the students of UG and PG English Literature took part.\n\nExtra curricular courses\n\nAIMAN College of Arts and Science for Women organised extra curricular courses such as drawing, embroidery, tailoring, typewriting, beautician, and spoken English for students. Nearly 100 students attended the courses. V. Subathra, principal, stressed the importance of learning skills which could enable student take up self-employment. Certificates were given to the students.\n\nPrime Institutions\n\nalumni reunion\n\nFor the old students of the Prime College of Education, Keezhvelur, Nagapattinam district, it was a time to reminisce and rejoice as they all gathered to celebrate the Alumni Association meet for the year 2015 recently and in doing so they enjoyed the moment to the hilt.\n\nWhile cultural events regaled the evening meet audience, speakers recalled the contribution of the Prime Group of Institutions and their teachers to their career development. Once students and now occupying socially important jobs, the alumni of the institution reiterated their commitment to social development.\n\nChairman, Prime Group of Institutions, N. Govindaraj, urged the alumni to keep in mind their domestic, social, and global commitments and shape their career accordingly.\n\nVirtues would hold them in good stead, he reminded them. Director, Prime College of Education, A.V. Balu, Directors of Prime College of Architecture and Planning, R. Paulraj and S. Ramdoss, and Principal, Prime College of Education, Ponni, spoke.\n\nL. RENGANATHAN\n\nAND G. PRASAD", 
    "section": "national", 
    "title": "CAMPUS CONNECT", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}