{
    "author": [
        "M K"
    ], 
    "text": "Though motorists are left unhappy because of chaotic traffic on several days, the city police have taken steps in the last one year to improve traffic management and ensure safety of road users.\n\nOne major drive in 2015 by the police resulted in the city topping in the State in most number of cases registered against helmet violators in the first two months after the Madras High Court made it mandatory from July. It helped bring down accident deaths.\n\nApart from these, efforts for better traffic management got a boost as after more than one-and-a-half-years the city police started reviving faulty signals and CCTV cameras. It has decided to install more CCTV and IP cameras.\n\nFor better administration, nomenclature with which the 15 police stations in the city of stations changed to make it easy to identify the stations. Some of the major developments on the law and order front:\n\nMarch 17 – Double death sentence awarded to A. Senthil (32) for murdering three, including two children at Saravanampatti in June 2014.\n\nMay 3 – Maoist leader Rupesh his wife P.A. Shyna and their accomplices Anoop, Kannan and Eswaran were arrested at an eatery at Karumathampatty.\n\nAugust 26 – Three persons were murdered on Neelambur Bypass Road–Tiruchi Road junction over gang rivalry to avenge the murder of an advocate at Thanjavur on April 3.\n\nSeptember 14 – Armed gang waylay employees of a jewellery shop and loot three kgs gold jewellery and 4.8 kgs silver articles.\n\nNovember 18 – R. Meenakshi (38) of Gandhipark who was riding a moped with her son K. Rahul was killed when two chain-snatchers pulled her in a bid to snatch her chain.\n\nDecember 3 – Eight former labourers of Pricol were awarded double life term after they were found guilty of beating to death the HR Vice-President of the company Roy J. George in September 2009.", 
    "section": "national", 
    "title": "City scores on better traffic management", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}