{
    "author": [
        "R Sivaraman"
    ], 
    "text": "BJP and Hindu Munnani criticise government for not implementing a dress code\n\nDevotees in shorts wait in queue to have darshan at Sri Manakula Vinayagar Temple on Saturday.— Photo: S.S. Kumar\n\nEven as most of the temples in neighbouring Tamil Nadu have brought dress code into force from January 1 following an order of Madras High Court, the temples in the Union Territory did not do so. Many devotees and tourists were found wearing dresses contrary to the code prescribed in the temples in the neighbouring State.\n\nA top official of Hindu Religious Department said, “The court’s direction was only to Tamil Nadu Hindu Religious and Charitable Endowments and we were not a party or respondent to the case in which the court had issued direction.”\n\nIn the first week of December, the Madras High Court prescribed a dress code for men, women and even children wanting to visit temples maintained by the Hindu Religious and Charitable Endowments (HR and CE) Department across Tamil Nadu.\n\nObserving that the object of imposing dress code was to restrict devotees who visit temple in “improper clothing, the court ordered that from January 1 men should wear a “dhoti or pyjama with upper cloth or formal pants and shirts” to temples and women should wear “a sari or a half sari or churidhar with upper cloth.”\n\nFollowing which the HR and CE Commissioner issued a circular to all temples under his jurisdiction to strictly adhere to the dress code. Most of the temples have implemented dress code from January 1 in Tamil Nadu.\n\nDifferent scene\n\nDifferent scenes were witnessed at the temples of Puducherry where most of devotees and tourists came to the temples wearing attire as per their whims and fancies.\n\nAt Sri Manakula Vinayagar Temple, several devotees and tourists were found wearing dresses such as short jeans, short trousers, tattered jeans, leggings and netted tops.\n\nSome of the male devotees wore bermuda trouser shorts. Interestingly a few foreign tourists came in traditional Indian dresses.\n\nWhen contacted the officials of Hindu Religious Department, said, “Several of devotees are either oriented towards French culture or foreigners. Even the deity here has been fondly called ‘Vellaikara Pillaiyar.’ Then how can we bring dress code here?”\n\nMeanwhile, the Bharatiya Janata Party and Hindu Munnani strongly criticised the government for not implementing the dress code in Puducherry. BJP general secretary V. Saminathan said, “The government should not hesitate to bring in dress code in all temples. The devotees should be advised to wear only traditional dresses and a notice board should be put up in all the temples. The High Court direction should be applied here also immediately.”\n\n“The Puducherry Government should also bring similar dress code like what is implemented in Tamil Nadu. Here the male devotees should be asked to wear only traditional dhotis than pants,” said Sanil Kumar of Hindu Munnani.", 
    "section": "national", 
    "title": "Dress code not an issue in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}