{
    "author": [
        "Subha J Rao"
    ], 
    "text": "24-year-old Deeraj Vaidy explains how he came to direct the much-awaited Jil Jung Juk. subha j rao\n\nThere’s a certain fearless confidence in the young. Add to that a curious mind and clarity of thought, and you get Deeraj Vaidy. How else do you explain a 24-year-old engineer directing such a big movie, without ever having been an assistant director? Deeraj says he’s always loved writing, and when the Chennai boy went to Coimbatore to study engineering, he sought refuge in short films. “We needed a space to get creative. My films were zero-budget and I took care of everything. I learnt something new with every film; each one made more progress,” he recalls. But he was clear even then that someone could fault a film for being technically poor, but that “there could be no excuse for bad content.”\n\nIt was during his last year of college that Deeraj considered filmmaking as a career—he was encouraged by the awards his short films were bringing in. He worked for nine months at a software company before taking the plunge. And, he never considered assisting a director. “I’ve always believed that the best kind of learning is from self-interest and curiosity,” he smiles.\n\nIf his first short film took a laptop and five days of skipping college, his first feature was wrapped up in less than six months. By now, everyone knows Deeraj roped in Siddharth for Jil Jung Juk using a well-made pilot. “It was an offbeat film that did not need a conventional hero. I needed someone who thought that way in real life too. In my head, Siddharth Sir is someone who never hesitates to experiment. When I went to his house and saw the CD wall in his room, I knew he was the right person,” Deeraj recalls.\n\nThe film is made with a small budget, and Deeraj’s friends have doubled as the crew. “These guys have been with me for years; I had to have them in the film. And Siddharth Sir was ready to invest in me and my team. We’ve worked hard to live up to that faith and give him a top-class product.”\n\nJil Jung Juk has been getting rave reviews for its innovative teaser, trailer and songs.\n\n‘Shoot the Kuruvi’ is almost a youth anthem. Deeraj says the film has grown into something much bigger than he envisioned. “But it’s an organic growth. Nothing was forced. It’s overwhelming to see the film in its current avatar. We are very excited to show it to people.”\n\nDeeraj says Siddharth was a delightful producer who saw the idea for what it was, without trying to measure it in terms of money. “When a producer gives you freedom, it shows in the movie,” he says.\n\nThe film, he says, will have something that everyone wants, but it has been shot in a very different format. The team had to scale back due to the floods, but is making up for it, by working day and night to complete post-production.\n\nAfter the film’s release, Deeraj plans to “vanish” for some months, think afresh and begin writing his next script. “Filmmaking takes a toll on you. It’s impossible for me to jump from one project to another so quickly,” he says.\n\nDeeraj is anxiously awaiting the audience’s verdict. He has a lot to prove—to his family that was concerned when he quit his job, and to people who questioned his wisdom in not taking the usual route.\n\nWhen a producer gives you freedom, it shows in the movie", 
    "section": "national", 
    "title": "Engineering his dream onscreen", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}