{
    "author": [
        "V S"
    ], 
    "text": "Passers-by probably haven’t noticed the building on the busy State Bank Road or Railway Station Road. It is hidden behind trees and shops. Moreover, it is in a sad condition.\n\nIt was originally a colonial bungalow with a well sitting on 85 cents of land (3,488 sq ft). Englishman F.A. Hamilton, who served in the Indian Police bought it for Rs 20,000, a big investment those days. The payment was made through a cheque drawn on Madras Bank. It was turned into a club where officers and those up to the rank of Sub-Inspectors stayed. Part of this building is still in use by police personnel.\n\nState Bank Road or Railway Station Road where the club is located was back then known as Imperial Bank Road, according to earliest records. The records also list the governing members of the club. They included Aruputhasamy Pillai, T.K. Krishnasamy Pillai and Hambareesh. They were joined by Uthukuli Zamin, Uthukuli Chinna Zamin, Samathur Zamin, S.L. Subbarao, Mathipalayam Village Munsiff Kuppanna Gounder, Muthuraman Chettiar of Erode, Coimbatore T. Krishna Chettiar, Udumalai Malayandi Chettiar, Velampalayam Muthukumara Chettiar, Kallipatti Marappa Gounder, R.K. Shanmugam Chettiar (Former Union Finance Minister), Sundakkamuthur Arumugam Pillai, Vellakinaru V.C. Vellingiri Gounder and Khan Bahadur alias M. Aminuddin Sahib Bahadur. In 1928, the Police Club now known as the Hamilton Club was accorded a co-operative society status and was assigned the identification number K547.\n\nThe building has six rooms with space earmarked for table tennis, a library and a big kitchen. Many documents and British law books were recently unearthed. The original bungalow’s walls are 2 m thick and it has a 12 ft ceiling.\n\nThe building was added to over the years and the Tothenham block with its tiled roof and six rooms were reno vated in 1998. But it is in a deplorable condition now. On August 14, 1951, the Harvey block was created with eight rooms each on the ground and first floor. The deluxe block in concrete structure today has shops that fetch rental revenue of little more than Rs 1 lakh that is used for the running of this club. Till 1989, the Coimbatore Urban Deputy Superintendent of Police was the secretary of the building and after Coimbatore became a Commissionerate in 1990, Deputy Commissioner of Police (Headquarters) became the President of the club.\n\nCity Police Commissioner A. Amalraj told The Hindu that a team of experts are studying the building including its structural stability. They will try to renovate the building without tampering with its original identity. Modern-day building materials will be eschewed in favour of traditional techniques.", 
    "section": "national", 
    "title": "Facelift for colonial building", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}