{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The farming community in the district has opposed the choice of locations identified by the Tamil Nadu Pollution Control Board for establishing Common Effluent Treatment Plants (CETP), with an apprehension that the proposed facilities in the midst of cultivable areas will pollute ground water.\n\nThe TNPCB has reportedly purchased land at Murungathozhuvu village for the CETP in Chennimalai, at a location close to the dyeing cluster in Bhavani town, and in an area situated between Kalingarayan canal and Cauvery River for the industries in Erode.\n\nAs for Perundurai town, the CETP, in all likelihood, would be located inside the SIPCOT Industrial Estate, it is learnt.\n\nThe CETPs are meant to be constructed by the Tamil Nadu Water Investment Corporation under the Rs. 700 crore scheme of the State Government for addressing pollution in Erode, Tirupur, Salem and Namakkal districts where small units have been struggling to comply with the Zero Liquid Discharge norms.\n\nThe fear of the farmers is that, even after the Reverse Osmosis process, the effluent with concentrated chemicals would find its way into the ground, apprehension TNPCB officials explain is unfounded.\n\nThe locations were finalised considering the natural gradient and gravity, and the ease in conveying effluent water.\n\nA suitable location within the reach of clusters, and closer to water bodies due to their low-level location, has been the criteria.\n\nThe system of water treatment through ZLD mechanism is such that not a drop will get into the ground, official sources said.\n\nIn Chennimalai town, the industrial units are scattered and, hence, there is no scope for laying pipelines to the CETP.\n\nThe combined usage of water is three lakh litres per day, of which 10 per cent would be conveyed to the CETP sites in tanker lorries, the sources said.\n\nAccording to TNPCB sources, public opposition to sewage treatment plants and CETPs is not unusual. In the absence of CETPs, industries operating on a small scale would face closure, the sources said.\n\nIn fact, industrial units would not be able to make illegal discharges once the CETPs become operational since the effluent flow would be metered, and monitored online, the sources said.\n\nIn any case, the farmers would be involved in consultations before the CETP project takes shape, the district administration has reportedly assured.", 
    "section": "national", 
    "title": "Farmers oppose locations for proposed CETPs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}