{
    "author": [], 
    "text": "AIADMK MLA Om Sakthi Sekar along with party cadres during a protest in front of a star hotel where DMDK chief Vijayakant stayed in Puducherry recently.— Photo:T. Singaravelou\n\nParty cadre seen standing as groups, each owing loyalty to one or the other factions during a protest\n\nThe fissures in the Puducherry unit of the AIADMK came out in the open during a protest staged by the party cadre against the visit of DMDK president Vijayakant to condemn his alleged remarks on Tamil Nadu Chief Minister Jayalalithaa.\n\nThough the party cadre came out in impressive numbers, one could see them standing as groups, each owing loyalty to one or the other factions. While one group was headed by AIADMK deputy legislative party leader A. Anbalagan the other group was headed by Legislator Om Sakthi Sekar.\n\nWhen one of the group resorted to burning an effigy of the DMDK leader they failed to bring petrol to set it on fire.\n\nMr. Anbalagan was seen shouting at his men for coming unprepared to carry out the agitation. While the volunteers were scrambling for the fuel one of them ultimately got a bottle of kerosene from a shop in the vicinity.\n\nProactive in poll preparations\n\nSandeep Saxena, Deputy Election Commissioner, on Saturday came all the way from New Delhi and reviewed the progress of summary revision of electoral rolls with officials connected with election works. Apart from assessing the poll preparedness, he also held a separate meeting with police officials on law and order situation.\n\nAfter detailed discussions, Mr. Saxena expressed satisfaction on the progress of summary revision of electoral rolls which is due for final publication on January 11 and also appreciated the election preparations.\n\nNot stopping with that, Mr. Saxena also made field visits to a few places and later, the officers of Electoral Registration officers where he carried out random checks and verified the quality of disposal of forms submitted during the summary revision.\n\nAll eyes on Kannan\n\nWith the All India NR Congress, Congress and People’s Welfare Front having taken a step forward towards forth coming Assembly elections, parties are keenly watching the moves of estranged Congress leader P. Kannan. He is yet to spell out his stand.\n\nA few months ago Mr. Kannan had said, “I am not for anything and am for people. I tried and tried all these years. This is my last attempt to unseat the government and bring good governance.”\n\nHis supporters have been waiting anxiously to see whether he would be placated by Congress leadership again or would move towards AIADMK as predicted by some section of media or jump into bandwagon as independent.\n\nBy S. Prasad and\n\nR. Sivaraman", 
    "section": "national", 
    "title": "Fissures in AIADMK come out in the open", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}