{
    "author": [
        "S P"
    ], 
    "text": "The new parking fee is Rs. 5 for bicycles and Rs. 7 for two-wheelers\n\nThe Salem Corporation has proposed to increase the parking fee for two-wheelers at the parking stand on New Bus Stand premises from April 1. —PHOTO: E. LAKSHMI NARAYANAN\n\nMotorists parking their vehicles at the Dr. MGR Integrated Bus Terminus (new bus stand) have to shell out more as the City Municipal Corporation has decided to hike the parking fees from April 1.\n\nPresently, Rs. 3 is charged for bicycles and Rs. 5 for two-wheelers for 24 hours. The parking token is valid only for a day .\n\nThe new parking fee is Rs. 5 for bicycles and Rs. 7 for two-wheelers.\n\nOver 1,400 vehicles are parked in the Corporation-owned and private contractor-operated stand on the premises for many years now. Due to space crunch, the parking area was extended from 15,700 sq.ft to 23,700 sq.ft, two years ago.\n\nAlso, concrete flooring was done apart from erecting roof-top for the stand. Since, the stand is located on the premises, motorists find it convenient to park their vehicles and board the buses easily.\n\nThe hike in fee comes after the Corporation had proposed to increase the tender value of the parking area from the present Rs. 2 lakh per year to Rs. 5 lakh per year. The existing contract period and the value were fixed for 2014-15 and 2015-16. Since, the contract period is to end on March 31, the civic body has proposed to increase the tender value so as to increase the income level, officials said.\n\nThe new contract period would be in force for 2016-17, 2017-18 and 2018-19. Also, there would an increase in contract value by five per cent for the second and third year, officials added.\n\nCorporation officials told The Hindu that with fall in income and increase in expenditure, the civic body was unable to implement scheme and have to depend on the government.\n\nHence, by increase in overall contract value, including market areas and lakes, the income is expected to be up by 15 to 20 per cent.", 
    "section": "national", 
    "title": "From April 1, pay more for parking at new bus stand", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}