{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Once completed, the fishing harbour will cater to the anchoring needs of fishermen in18 villages. —Photo: B. Velankanni Raj\n\nWork on the construction of a fishing harbour, which suffered a setback during the northeast monsoon, has resumed at Poompuhar, a coastal village historically noted for trade and commerce.\n\nOnce completed, the harbour will cater to the anchoring needs of fishermen of 18 villages in and around Poompuhar. At present, the fishermen from these villages, including Vanagiri, Tirumullaivasal, Chinnangudi, Tranquebar, Pudhukuppam, Madathukuppam, and Naickankuppam, have been anchoring their boats at Poraiyar, a far off place.\n\nThey undergo the ordeal of landing their mechanised boats in the absence of harbour. On reaching Poompuhar, fishes are transported head load by labourers.\n\nThe work is being executed at an estimate of Rs. 148 crore, shared by the Union and State governments .\n\nTechnical details\n\nThe project is aimed at diverting backwaters towards northern side of Poompuhar so that the large area could be used for anchoring mechanised vessels.\n\nThe project involves construction of main break wall on the seawaters to a length of 1,100 metres, leeward break wall to a length of 390 metres, and diaphragm wall to a length of 480 metres. “The diaphragm wall comprises two components — one along the shore to a length of 440 metres and other on the reverse for a length of 20 metres each on two sides — so that the total length of the diaphragm wall is 480 metres,” an official source told The Hindu here on Sunday.\n\nThe direction of the current was first diverted from Poompuhar to Cuddaalore port by putting up thousands of boulders.\n\n“We shall be setting up hundreds of tetrapods each weighing anywhere between 2 tonnes and 10 tonnes depending on its size,” said the official. The tetrapods are set up on the seaside to dissipate waves.\n\nAt deeper areas, tetrapods weighing 10 tonnes are used and in other zones, pods with lesser weight is used. The pods are cast on the shores of Poompuhar.\n\nThe work which commenced last year following announcement under provisions of Section 110 by Chief Minister Jayalalithaa on the floor of the Assembly on September 11, 2013, is expected to be completed within a year.\n\nAs many as 350 mechanised boats will be anchored at the harbour. A full-fledged infrastructure will be provided on the sprawling area of 16.5 hectares where the harbour would be set up. It would have net mending centre, auction yard, toilet blocks for men and women, administrative office block, etc.\n\nOriginally, the project was estimated to cost Rs. 78.5 crore. However, it has been revised now commensurate with the change in techniques and designs.", 
    "section": "national", 
    "title": "Harbour work at Poompuhar resumes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}