{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Minister for Cooperatives Sellur Raju giving away certificate of appreciation to N. Mirunalini, Managing Director of Tiruchi District Central Cooperative Bank, for her service in the flood-hit Cuddalure district.\n\nWorkers of the Communist Party of India (Marxist) mobilising funds for the general elections in Tiruchi on Sunday.— PHOTO: B. VELANKANNI RAJ\n\nIn their unique style, a group of CPI(M) workers have taken updoor-to-door collection drive in Tiruchi district\n\nEven as leaders of leading parties in the State were working out a strategy for evolving a strong alliance, workers of the Communist Party of India (Marxist) in Tiruchi district have taken up mobilising election funds from members of the public.\n\nIn their unique style, a group of workers have taken up door-to-door collection drive. With a view to imbibing confidence among the voters, particularly women, the group is led by S. Renuka, district executive member of the party.“Our fund raising drive has twin purpose: It is a sort of campaign for the party too as we project both local issues and Stateide problems,” says S. Vedanayagam, a worker. As for local issues, they assure that a satellite bus stand would be provided in the city. As for State-level issue, they refer to the need for protecting the natural resource and checking spiralling rise in prices of essential commodities.\n\nSite engineers and workers currently involved in the work on renovation of Samayapuram Sri Mariamman temple near Tiruchi have to exercise caution while moving the building material and removing the debris.\n\nFor, space constraint in the temple has been posing a challenge to them. “A good part of renovation and expansion work besides construction of ‘rajagopuram’ and other ‘prakaram’ is being executed using stones, boulders,” say the temple authorities.\n\nUnlike other ancient temples which have spacious ‘sannidhi streets’ or ‘car streets’ all around the temple, Sri Mariamman temple at Samayapuram does not have adequate land around its periphery. “Once you step out of the temple, you trek on a private assigned property,” the official explains.\n\nScanty space, however, does not deter the authorities in executing the renovation work. “We keep altering the arrangement for regulating the queue from time to time, matching with the renovation process,” the official says explaining the safety measures being adopted while moving cranes, earthmovers and stone boulders around the temple.\n\nIt is time to recognise the services of those rendered to the flood hit people. They are being slowly recognised. N. Mirunalini, Managing Director, Tiruchi District Central Cooperative Bank, was among those recognised for their service. Appreciating her dedicated service, the Minister for Cooperation and Consumer Affairs Sellur K. Raju handed over a certificate with a shawl at the review meeting of Joint Registrars of Cooperatives and Managing Directors of Central Cooperative Banks in Chennai recently. Shiv Das Meena, Secretary, Food and Consumer Protection, Jayashree Muralidharan, Registrar, Cooperative Societies also appreciated Mirunalini.\n\nM. BALAGANESSIN\n\nAND C. JAISANKAR", 
    "section": "national", 
    "title": "Hitting the campaign trail a bit early", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}