{
    "author": [], 
    "text": "RELIGION\n\nPanniru Thirumurai Mandram: Discourse on Siva Gnanabotham by N.S. Sundararaman, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85th year sreemath gita siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal Sixth Street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs, 6 a.m.; Paavai songs and devotional songs, Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nGita Natanagopala Nayaki Mandir: 173rd Jayanthi celebrations, No. 3 Mariamman Teppakulam West Street, 6 p.m.\n\nThiruvalluvar Mandram: Discourse on Kanthapuranam by A. Arumugam, Thiruvalluvar Mandram, Sakthi Velammal Nagar, SS Colony, 5 p.m.\n\nMeenakshi Sundareswarar Temple: Discourse on Periyapuranam by M. Gnanapoongothai, Old Thirukalyana Mandapam, 5 p.m.\n\nGita Bhavanam: 68th anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, The Madura College, 6.30 a.m.\n\nGENERAL\n\nSri Sathguru Sangeetha Samajam: 64{+t}{+h}Music and Arts Festival, inauguration of 64{+t}{+h}anniversary celebrations by K. Velusamy, General Manager, Canara Bank, vocal concert by Ramakrishnan Murthy and party, Lakshmi Sundaram Hall, 5.15 p.m.\n\nGandhi Memorial Museum: JC Kumarappa’s 124{+t}{+h}birth anniversary celebration, lecture on ‘JC Kumarappa and Micro Industries’ by S. Venkatachalam, Library, 5.30 p.m.\n\nGovernment Girls Higher Secondary School: 10{+t}{+h}Annual Day celebration, Prof K Gnana Sambandan, chief guest, T Vadipatti, 2.30 p.m.\n\nMeenakshi Mission Hospital: Two-day conference on ‘Developments in paediatric intensive care in India,’ Dr. Traci Wolbrink of Harvard Medical School speaks, 10.30 a.m.\n\nRotary Club of Madurai Star: Meeting, Hotel JC Residency, 6:30 p.m.\n\nThyaga Deepam Peravai: Veerapandia Kattabomman birth anniversary celebrations, Welfare Club Office, TPK Road, 8.50 p.m.\n\nAlcoholics Anonymous: Meeting, Holy Redeemers Church, Pondy Bazaar, 7 a.m.; Quality Care Hospital, Ellis Nagar, 7 p.m.; AG Church, Gomathipuram, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}