{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It was a free health camp with a difference, with Narikuravas as the targeted group of beneficiaries.\n\nThe camp, organised jointly by the Health Department, Sri Durga Hospital, Ponnamaravathy, and the Road Safety and Rescue Association, at Rengammal Chathiram Colony near Vellanur on Sunday, it evoked an overwhelming response from men, women, and children belonging to the Narikurava community. In all, 212 persons were screened on the occasion. And most of them were found to be healthy.\n\nThe camp aimed at sensitising the members of this community to avail themselves of the Chief Minister’s Health Insurance Scheme, said D. Parimala Devi, Dean cum Special Officer, Pudukottai Medical College who inaugurated the camp.\n\nA. Thangaiah, Vellanur village panchayat president, said a large number of Narikuravas were residing in the panchayat and the camp would go a long way in creating awareness about the health care programmes being implemented by the State government.\n\nS. Swaminathan, Pudukkotai District Project officer of Chief Minister Health Insurance Scheme, explained the eligibility norms for getting treatment under the Chief Minister Health Insurance Scheme. Every card-holder under the scheme will be eligible for treatment for 1,016 types of diseases and surgeries, 113 follow-up treatment like cancer, heart ailment, diabetes mellitus, 23 kinds of pathological tests besides CT, MRI scan services.\n\nV.C. Subash Gandhi, Research Scholar, spoke on “Healthy life to Narikuravas”. He explained the harmful effects of tobacco and advised them to change their lifestyle and food habits. He gave useful tips on personal hygiene.\n\nA. Azhagesan, president of Sri Durga Hospital, said the camp benefited Narikuravas of a cluster of villages including Rengammal Chathiram, Sathyamangalam, Muthudaiyanpatty, Melur, and Vellanur villages.", 
    "section": "national", 
    "title": "Many turn up at camp for Narikuravas", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}