{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Driving force among farmers was to do away with chemical fertilizers and pesticides to provide good food to consumers\n\nOrganic farming is steadily gaining momentum among farmers in Vellore district. In the last few years, many farmers have started to move away from inorganic farming to adopt organic means of raising crops.\n\nYawning gaps to be addressed\n\nYet, officials say that a number of gaps need to be addressed. Among them is the need to raise awareness among farmers on obtaining certification for organically raised produce.\n\nSeveral farmers have been creating awareness on organic agriculture in the last few years. For them, the need to do away with chemical fertilisers and pesticides to provide good food to consumers was the driving force to take up organic farming.\n\nD. Damodaran, a farmer in Vellari village, Gudiyatham taluk, has been in agriculture for 43 years. However, he turned to organic farming nearly seven years ago with an aim to provide toxic-free food for consumers.\n\n“In my experience, a major chunk of income, that I got from agriculture, was spent on pesticides. Hence, I took to organic farming,” he said.\n\nTo protect the crops from pests, he uses products available on his land to prepare “Panchakavya”, an organic product consisting of elements such as cow dung, cow urine.\n\nReduced expenses\n\n“The crop yield in organic farming is 70 per cent, but our expenses have drastically come down due to making use of locally available resources. Organically produced vegetables, fruits and flowers are fresher and have a better shelf life than those from inorganic farming,” he added. He raises bananas, paddy, ragi and sampangi flowers.\n\nFor Annakilli, a farmer, organic farming goes back to 2001 when they formed Kalanjiyam Women Farmers Group.\n\n“About 900 women organic farmers are part of this group. Women are not recognized as farmers. We started this group to ensure food security and oppose genetically modified crops, and promote organic farming. For decades, the soil has lost its fertility due to constant use of chemical based products. Organic farming helps to restore the soil’s fertility,” Annakilli, the group’s executive member, said.\n\nWomen cultivate millets\n\nThe women have been taking up cultivation of millets, pulses and flowers on a large scale in Walajah, Arakkonam and Nemili. They have been taking up collective farming too. “Now, 100 of us have registered with Participatory Guarantee Systems India to get organic certification so that we can motivate many more farmers” she said.\n\nNevertheless, organic farmers, mostly, do not seek higher rates for produce and go by the prevailing market rates, they said.\n\n“This is not a problem now as our expenses are much less. People too prefer organic produce, and we do not want to demand higher rates,” Mr. Damodaran said. Ms. Anakilli too said providing good food for consumers was of prime importance than profit for many of them.\n\nNeed for authentication\n\nR. Jayasundar, director of Seed Certification and Organic Certification said there is a need for authentication of organically raised produce.\n\nIt is here that the Tamil Nadu Organic Certification Department comes in. Established during 2007-2008, the department carries out inspection and certification of organic production system in accordance with the National Programme for Organic Production (NPOP) of the Central government.\n\nIt certifies crop production, food processing, organic input producing units and trade. It sees to that the products have been produced or prepared in compliance with NPOP norms.", 
    "section": "national", 
    "title": "Organic farming gains momentum in Vellore district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}