{
    "author": [], 
    "text": "Whether it is forming an alliance for the Assembly polls or delivering on the promise of lifting the ban on jallikattu, nothing seems to be moving smoothly for the BJP in Tamil Nadu. Despite the pressure building up on all sides to show concrete results, BJP State president Tamilisai Soundararajan puts up a brave face stating that the 2016 Assembly elections will see the party emerging stronger and bigger. In an interview with Sruthisagar Yamunan , she talks about the BJP’s electoral ties, the criticism against the Centre’s role in flood relief and more. Excerpts:\n\nTH: Your party promised lifting the ban on jallikattu as a New Year gift to the people of Tamil Nadu. But the Animal Welfare Board of India (AWBI) has opposed the move to revive the sport. The Centre seems to be silent. Could you comment?\n\nTamilisai: For 18 months now, the BJP has been trying hard to bring back the sport which is a revered tradition of Tamil Nadu. But at the last moment, we are seeing opposition from animal rights activists. The AWBI has opposed it and the Attorney General has not given a favourable opinion. But what has shocked us is the reaction of the Congress. They are responsible for banning jallikattu. Even the then Prime Minister Manmohan Singh voiced his opposition. While we are trying to unite everyone, the Congress is playing politics. The BJP will continue to strive to revive this traditional sport this year.\n\nHow did the BJP give an assurance on this without anticipating opposition? Did you do it to attract votes of some communities involved in the sport?\n\nThe argument of the rights groups is that the sport is cruel to animals. We say it is not. You cannot generalise quoting a few exceptions. We believe the sport could be held without any cruelty to animals. There is no question of appeasing any community here. Our aim is to protect Tamil culture and tradition.\n\nWhy is the BJP struggling to attract allies in Tamil Nadu?\n\nWhich party is not? DMK president M. Karunanidhi has invited the Congress and the DMDK but no deal is in sight for them. Why won’t you call the DMK desperate? Holding talks does not mean we are struggling. We are trying to ensure the alliance works so that the people could be presented with a strong alternative. Tell me which party has held coordinating meetings with allies in these 18 months? Why is this question being asked to the BJP alone?\n\nYour one-time ally, the PMK does not want to compromise on the chief ministerial candidature of Anbumani Ramadoss. How does the BJP view this?\n\nI have always insisted that one has to be practical in politics. Our view is that we need to first make the ground ready for us to win that position [Chief Minister]. An alliance is necessary for this. Obviously, the PMK will not be able to achieve this goal by contesting alone. Only if a strong alliance is formed can we give a fight to the two major Dravidian parties. Situation and arithmetic are two important factors. Situation is conducive for us. We need to work out the arithmetic. PMK has announced the CM candidate for the party. We feel we should first ensure we win and decide on this later for the alliance.\n\nBut the DMDK and PMK have been trading charges and don’t look like they could work together...\n\nThis is the same argument made during Lok Sabha election. But we made the alliance work and you saw the results. We are confident of doing it again.\n\nWhat if the strategy does not work? Do you have a plan B?\n\nWe are trying to rejuvenate the NDA and are doing all that we can. But in case it doesn’t work we will look beyond it. Our aim is to do everything to send BJP members to the Assembly so that people-friendly MLAs are present there. Once people get a taste of people-centric functioning of our members, they will surely back us strongly.\n\nThe opposition has blamed the Centre of ignoring Tamil Nadu in flood relief…\n\nDisaster management is not that simplistic. The Centre responded swiftly during the floods by sending rescue teams. The Prime Minister surveyed the flood-hit areas and released funds almost immediately. The Centre has promised all help in reconstruction of houses and is willing to change the modalities of some schemes to help Tamil Nadu. The Centre will extend more help as and when needed. For leaders like Mr. Elangovan (Congress) and Mr. Vaiko (MDMK), they have a blinkered view. Anything that the Centre does is wrong. This is mere politics.\n\nThere is perceptive softening of the BJP’s criticism of AIADMK government. Is this with an eye on a potential alliance?\n\nI differ. We have consistently taken on the State government but we also appreciate when something good is done. During the floods, we thought it was important to improve Centre-State coordination to help people. In that situation, this was more important than playing politics. But when criticism emerged on the Chembarambakkam reservoir issue, we demanded that the State should agree to an investigation if it felt it was not at fault. We take stands base on issues and not for the sake of criticising.", 
    "section": "national", 
    "title": "Our priority is to send BJP members to Assembly: Tamilisai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}