{
    "author": [
        "Dennis S"
    ], 
    "text": "More than six-and-a-half years after the civil war between the Sri Lankan government and the rebel Liberation Tigers of Tamil Eelam (LTTE) ended, over 1.22 lakh people from the neighbouring island continue to live as refugees in other countries, while another 50,000 people are internally-displaced, according to the latest figures from the United Nations High Commissioner for Refugees (UNHCR).\n\nA total of 1,22,533 persons from Sri Lanka are living as refugees in other countries and 15,504 persons (pending cases) have sought asylum there.\n\nA total of 50,268 have been internally displaced within the country, the Mid-Year Trends 2015 released by UNHCR recently stated.\n\nWhile 231 refugees returned to the island in the first half of last year, none of those who had been internally-displaced went back to their original home during that period. Though there are conflicting versions about the number of persons killed in the war, according to an estimate of the United Nations about 40,000 persons have been killed. S.C. Chandrahasan, Treasurer of Organisation for Eelam Refugees Rehabilitation (OfERR) said,\n\n“The government of India should come with a generous package to supplement the efforts of the Sri Lankan government in facilitating the return of the refugees.”\n\nReferring to the recent developments in the island, including the release of over 700 acres of civil land so far under the control of the Army to the civilian authorities, Mr. Chandrahasan said this was the right time to encourage more refugees to return as most of the land owners are living in camps in India.\n\nOfERR has organised Skype meetings between refugees living in India and the returnees who went back to the island on how the situation has improved. “To make things easy for their return, ferry services must be recommenced, as that would also ease the financial burden on the aiding agencies in helping the return of refugees.”\n\nThe government of Tamil Nadu, where over a lakh Lankan refugees are living in camps, has been sceptical of their return to Sri Lanka. In January last year, the then Chief Minister O. Panneerselvam said that the conditions in the Northern and Eastern provinces of Sri Lanka were “still not conducive” for the refugees to return.\n\nAccording to an estimate of UN, about 40,000 persons were\n\nkilled in the war", 
    "section": "national", 
    "title": "Over 1 lakh Tamil refugees in India", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}