{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Saturday’s terrorist strike at the Pathankot Air Force base cannot be construed as intelligence failure, Union Minister for Micro, Small and Medium Enterprises Kalraj Mishra said here on Sunday.\n\nHe told reporters at a press meeting that the security forces had successfully eliminated the infiltrators, whose aim was to disturb the fledgling peace process that got a thrust after Prime Minister Narendra Modi’s surprise stop over in Lahore.\n\nA similar attack had happened soon after the then Prime Minister Atal Bihari Vajpayee launched a peace initiative with Pakistan, the Minister recalled and added that the Government was committed to protecting the borders, preventing terrorist strike, and also building on the good will created with Pakistan.\n\nUP Assembly poll\n\nThe next Uttar Pradesh Assembly election would be a triangular fight among the Bharatiya Janata Party, Samajwadi Party and Bahujan Samaj Party and there was no possibility of a grand alliance in the State, said Mr. Mishra, who is an MP from the State.\n\nThe Central Government was committed to bringing in the Goods and Services Tax Bill and that too at the earliest but he was not sure if the Congress wanted GST. Journalists and the public should question the Congress whether it was not interested in giving people the benefits of GST, he said. The Minister added that he was confident that the Government would be able to win over the Congress for the passage of the GST Bill.\n\nOn the party’s performance in the Bihar Assembly election, he said that he had predicted a defeat for the party given the nature of alliance between Janata Dal United and Rashtriya Janata Dal and the caste forces at play. But it was not a defeat for the BJP as the party had never been in power, except for sharing power with Nitish Kumar.", 
    "section": "national", 
    "title": "‘Pathankot attack was not due to intelligence failure’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}