{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Members of People's Welfare Front staging a demonstration at Alanganallur near Madurai on Sunday, demanding removal of the ban on 'jallikattu.'Photo: R. Ashok\n\nWith no positive announcement on lifting the ban on ‘jallikattu’ coming from the Centre, political parties and organisers of the bull taming sport are mounting pressure on the State and Central governments with protests.\n\nPalamedu Grama Pothu Mahalingasamy Madathu committee, whicht has been organising the bull-taming event at Palamedu for several decades, has decided to go on a hunger strike. Its secretary P. Karthigairajan said that a decision to also down shutters of all shops and commercial establishments on Friday was taken in consultation with leaders of various communities.\n\n“Our single-point demand to the State and the Centre is to take steps to conduct ‘jallikattu,” Mr. Karthigairajan said.\n\nMeanwhile, members of People’s Welfare Front on Sunday threatened to intensify protests across the State if the ban on ‘jallikattu’ was not lifted. This was announced at a demonstration it staged at Alanganallur. Marumalarchi Dravida Munnetra Kazhagam urban district secretary M. Boominathan said that the Centre had promised to ensure conduct of the event. “If it failed, we will intensify the stir across the State,” he said.\n\nStating that ‘jallikattu’ was a traditional sport and a cultural event of Tamil Nadu, he said that it was wrong on the part of the Central government to bring bulls under list of wild animals. “What will happen to the lakhs of bulls reared in rural areas, if the ban is extended to using bulls for land preparation in agriculture and other related farming activities such as pulling carts and harvesting process,” he said.\n\nHe said that in such a scenario, everyone would be forced to abandon animals, and in the process the bulls will become extinct in no time. “We worship the bulls with all reverence on ‘Mattu pongal’ day by offering new ropes and towels because they are treated as members of a farmer’s family,” he said.\n\nThe Satta Panchayat Iyakkam staged a protest by observing a day-long fast at Avaniapuram, pressing for the same issue.", 
    "section": "national", 
    "title": "Pressure mounts for lifting ban on ‘jallikattu’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}