{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Corpn. asks tax collectors to speed up collection in worst-affected areas that recorded a dip\n\nEven before the city is yet to fully recover from the massive damage caused by the floods, the Chennai Corporation has reportedly asked its staff to speed up property tax collection, which has recorded a dip in certain areas.\n\nResidents, particularly in the worst hit areas, are angry that they are being forced to cough up tax for property in less than a month after suffering huge losses in the recent floods. Tax collectors are in a spot, as they have been asked to speed up collection in flood affected areas that have recorded a dip in collection.\n\nAhmed Sirajudeen of Perambur High Road said that with 2.5 feet high water entering homes on in their locality, they had suffered severe damages.\n\n“Property tax payment immediately after the floods will be a burden,” said Mr.Sirajudeen.\n\nDespite intensification of tax collection drive in the past few days after the floods, collection as on January 1 this was Rs.373 crore, while it was Rs.380 crore in January last year.\n\nTax collectors in most of the flood-affected localities have complained to their senior officers about resistance from residents.\n\nThe tax collectors in Jafferkhanpet, Adyar, Saidapet, West Mambalam, Nesapakkkam, T. Nagar, Villivakkam, Saligramam, Perambur and Valasaravakkam are unable to complete even ten bills a day, officials said.\n\nFormer Mayor M.Subramanian said the Corporation should give remission of property tax to residents for two half-year periods.\n\n“They should not force owners of residential or commercial properties to pay property tax,” Mr.Subramanian told The Hindu.\n\nThe civic body was able to collect Rs.576 crore as property tax in 2014-2015.\n\nWith a higher demand of Rs.600 crore in 2015-2016, senior officials of the civic body have instructed tax collectors to achieve a major portion of the tax collection before notification of Assembly elections.\n\nTax collectors fear that flood-affected residents might direct their anger at them.\n\nHowever, a senior official said some tax collectors who failed to meet the target, passed the blame on resistance from residents.\n\nDuring the last half-year period, all the 200 tax collectors were able to collect tax from less than 50 per cent of the total number of 11.7 lakh assessees.\n\nPeople forced to cough up tax for property after suffering huge damage", 
    "section": "national", 
    "title": "Property tax puts flood-hit in a spot", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}