{
    "author": [
        "S Prasad"
    ], 
    "text": "The number of passport applications from Puducherry is expected to increase after the Passport Seva Kendra starts functioning. The Kendra has been established on the premises of Animal Husbandry department.Photos: T. Singaravelou\n\nAll infrastructure work for the mini passport office has been completed\n\nThe hassle of standing in long queues at the Regional Passport Office in Chennai to submit an application will soon become a thing of the past with the mini Passport Seva Kendra (PSK) in the city expected to start functioning from this month.\n\nAll infrastructure work have been completed and the installation of equipment is under way. The PSK has been established on the premises of the Department of Animal Husbandry on Maraimalaiadigal Salai, said an official.\n\nThe PSK catering to residents of Puducherry and Karaikal, will receive applications, check and scan the documents, take photographs of the applicants and capture their biometric fingerprints, besides speeding up the issue of passports.\n\n“All aspects including collection and scrutiny of applications and police verification will be taken care of at the PSK while the Regional Passport Office in Chennai will act as a backend office in printing and despatch of passports. Candidates need not go to Chennai except for Tatkal passports and complaints,” Regional Passport Officer K. Balamurugan told The Hindu .\n\nMr. Balamurugan said the RPO in Chennai had been witnessing a steady increase in the number of applications from Puducherry and Karaikal regions. On an average, around 150 applications were received from Puducherry daily besides receiving applications from Cuddalore and Villupuram districts.\n\nThe number of passport applications from Puducherry is further expected to increase after the PSK starts functioning. The PSK is expected to be integrated with the Crime and Criminal Tracking Network System (CCTNS) in the future to enable online verification of applications, he added. Instead of waiting in long queues, the PSK offers adequate seating and waiting hall for the applicants. It will cater to residents of Puducherry and Cuddalore and Villupuram districts and will ease the rush at Chennai passport centre.", 
    "section": "national", 
    "title": "PSK will cater to Cuddalore, Villupuram too", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}