{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Dr. Stephen Gottet and his tour guide B. Rajendran share their experiences of cataloguing over 15 sacred groves and village temples in Tamil Nadu.— PHOTO: A. MURALITHARAN\n\nSwiss national Stephan Gottet, a dentist with a keen interest in history and archaeology, has spent over three years studying the ancient sacred groves and village gods of Tamil Nadu. The results of Dr. Gottet’s work will be published as a 364-page German book Heilige Haine – Blicke auf Mysthische Tongfiguren Sudindiens (Sacred groves: Views on Mythical Clay Figures in Southern India) , in March 2016.\n\n“This is just the first volume, which gives an introduction to the sacred groves in Tamil Nadu,” Dr. Gottet, 75, told The Hindu while on a recent visit to Tiruchi.\n\n“I have subtitled this book as ‘After Thoughts’, as it is part travelogue, part history, and mostly a meditation on life,” he added. In a conversation peppered with French and German explanations to English questions translated by his Srirangam-based tour guide B. Rajendran, who is one of the many collaborators in the project, Dr. Gottet said that the 15 sacred groves that have been highlighted in the book confirmed his view that Tamil Nadu represents the zenith of Indian civilization.\n\n“Like Greece in Europe, which practised polytheism and had the best scholars, in India, Tamil Nadu has had the best of ideologies and arts. That’s why, when I came here for the very first time in 1995, it felt like I was returning home. And yes, both Greek and Tamil cultures share the idea of sacred groves,” he said.\n\nThe book focuses on groves and village temples dedicated to Lord Ayyanar and other deities in Mugaiyur, Naalu Veda Patti, Vilankudi, Koothadi Vayal, Panjathi, Villangattur, Marungapuri, Ooropathi, Devanam Pattinam, Nedungudi, Pethakkon Patti, Kaavalkaranpatti, Karapattu and Narthanmalai which are located in the vicinity of Tiruchi, Nagapattinam, Madurai and Karaikudi. “I chose them because of their antiquity, and the finesse of their terracotta work,” said Dr. Gottet. “It’s a pity that many of these village temples have fallen into disuse because folk customs are dying out.”\n\nHeilige Haine , which Dr. Gottet calls his “homage to Tamil Nadu,” also features a foreword in German by scholar Max Kunze and an essay by architect Peter Fochs (who visited the sites twice and has done the line drawings of the temple complexes in the book). Architects Michel Adment and Bernard Dragon have contributed a chapter on their restoration of the heritage Chettinad mansion Saratha Vilas in Kothamangalam, in French.\n\nMr. Rajendran recounts his experience of the project’s logistics in English and Tamil.\n\nDr. Gottet has done most of the photography in the book, picking out aspects of votive terracotta figures in the stylised shape of horses, conjoined oxen, fertility symbols and humans, while occasionally foraying into scenes of daily life in rural Tamil Nadu.\n\nThe second volume is expected to be released in December 2017.\n\n“The sacred groves were the first places to speak up for afforestation, because the trees have overgrown here. Now, they are the last place where we can find the State’s native vegetation,” says Dr. Gottet, who lives in the municipality of Bremgarten in Switzerland. Heilige Haine is thought to have cost Dr. Gottet around $ 30,000 from research to publication. “I’d like to dedicate it to the children of India and the rest of the world,” he concluded.\n\nThe sacred groves were the first places to speak up for afforestation, because the trees have overgrown here.", 
    "section": "national", 
    "title": "Sacred groves of Tamil Nadu fascinate this Swiss dentist", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}