{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "‘Ezhuchi Tamilagam (Rising Tamil Nadu),’ a new movement, was announced at a gathering of more than 1,500 people, predominantly youngsters, here on Sunday with the demand for IAS officer U. Sagayam to lead them for a political change in Tamil Nadu.\n\nThough the organisers said that the movement would not morph into a political party until Mr. Sagayam agreed to enter politics, many in the conference also said that they would be ready to enter politics with the ‘guidance’ of Mr. Sagayam. While conceding that they did not receive any hints from Mr. Sagayam, the organisers expressed confidence that he will enter politics. “We are very sure that we can persuade him,” said one of the coordinators who identified himself as ‘Chennai’ William.\n\nAngst about their perceived failure of all political parties was palpable among the participants who had connected primarily through Facebook. Although they appeared to be earnestly craving for a political change, the ideas for change expressed by many seemed simplistic.\n\nWhile a Tiruchi-based youngster said that he was working on a ‘robust’ framework, which, according to him, was a first in the world, to ensure only good and eligible persons enter the movement, another young woman from Theni district said that State-run telephone booths should be established everywhere and complaints made through the phones should be immediately addressed by officials.\n\nSome, who appeared pragmatic about the prospects, said that 2016 elections was not their target and the goal was long term. When asked about other alternatives and the success of Aam Aadmi Party (AAP) in Delhi, many said that AAP did not stand a chance in the State and Mr. Sagayam could be the only alternative.\n\nBut for the organisers, many participants were reluctant to reveal their identity.\n\n“Time for\n\n‘virtual’ leaders”\n\nFormer American College Principal T. Chinnaraj Joseph, who claimed that he came just to observe the proceedings, said that while celluloid heroes became leaders in the past, this appeared to be the time of ‘virtual’ leaders. “Mr. Sagayam has not indicated anything so far. These people are projecting him as the change through social media in a virtual manner. I think Mr. Sagayam should clear the air and not mislead these youngsters by remaining silent,” he said.", 
    "section": "national", 
    "title": "Sagayam admirers float a new movement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}