{
    "author": [], 
    "text": "Waste collected, segregated and disposed of in a 10-acre site at Ramapuram near the town\n\nhe Sriperumbudur town panchayat in Kancheepuram district, which launched a comprehensive door-to-door collection of waste collection a year ago, has started a separate resource recovery park and other supportive solid waste management mechanisms.\n\nThe Directorate of Town Panchayats has signed a Memorandum of Understanding with the NGO Hand in Hand in 2012-13 for collection, segregation and disposal of waste at a 10-acre site in Ramapuram near the town.\n\nThe solid waste management scheme has been provided Rs. 4.44 crore under Urban Infrastructure Development Scheme in Satellite Towns (UIDSST).\n\nForty new pushcarts for door-to-door collection of garbage and a lorry purchased under the UIDSST were being used, said Parimala Kumar, president of the town panchayat, which has a population of over 25,000. For every 150 homes, one pushcart has been provided, to remove segregated wastes to landfill.\n\nM.J. Sampath, executive officer of the local body, said the 6,470 households in 15 wards generated 12 metric tonnes of waste.\n\nHand in Hand provides comprehensive solid waste management services such as garbage collection, sorting, transportation and disposal.\n\nWhile the biodegradable garbage will be sent for composting, items such as paper, metal and plastic will be sent for recycling.\n\nSince mobilising the community and getting their agreement to participate was a crucial part of the waste collection and disposal programme, awareness drives on waste management were conducted with the help of civic groups, Ms. Kumar added.\n\nSriperumbudur Town Panchayat\n\nKancheepuram district\n\nPopulation: 25,336 (exclusive of floating population of 2,500/day)\n\nNumber of households: 6,470\n\nPlace: Ramapuram, Sriperumbudur\n\nArea: 10 acres\n\nValue of the project: Rs. 4.44 crore\n\nScheme: Urban Infrastructure Development Scheme in Satellite Towns\n\nNumber of wards: 15\n\nWaste generation: 12 metric tonnes (MT)\n\nSource segregation by door-to-door collection: 42 pushcarts\n\nStaff: ULB 20 + 40 Hand in Hand", 
    "section": "national", 
    "title": "Sriperumbudur shows the way", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}