{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Thirteen statues, including that of ‘Tamil Annai’ and eminent Tamil scholars installed during the Fifth World Tamil Conference in the city in 1981, were cleaned and given a facelift by ‘Vaa Nanba,’ a collective of volunteers, here on Sunday.\n\nThese youngsters, who hailed from various walks of life, cleaned these statues last year also. MC Saravanan, one of the coordinators of ‘Vaa Nanba,’ said that though majority of the statues were maintained properly after last year’s clean-up, some were not. “While posters were pasted on the pedestal of statues in places such as Kalavasal, there was wild growth of plants around some other statues,” Mr. Saravanan said.\n\nThe cleanup exercise was carried out after obtaining permission from the Madurai Corporation. Mayor V.V. Rajan Chellappa inspected the cleanup activity and congratulated the volunteers. “”We received full support from the sanitation department of the Corporation,” Mr. Saravanan said.\n\nA team of more than 150 volunteers started the clean-up job in the morning, starting with the Tamil Annai statue in front of Tamukkam Grounds. Later, the volunteers split themselves into 12 teams and cleaned 12 statues across the city. They also a put up a small board near the statue with details of the scholars.\n\nA. Raguman, another key member of the group, said that they received an overwhelming response from volunteers for the statue cleanup exercise compared to their other weekly initiatives.\n\nTalking about the increasing participation of volunteers, Mr. Saravanan, however, said that funding remained an issue. “For instance, we have many saplings ready for planting. But buying tree guards for them is a problem with our shoestring budget of contributions from volunteers,” he said.", 
    "section": "national", 
    "title": "Statues of Tamil scholars get facelift", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}