{
    "author": [], 
    "text": "A slogan coined by the State unit has merely reversed the slogan of the Tamil Maanila Congress\n\nThe BJP was hailed for its innovative campaign during the 2014 Lok Sabha elections which helped it to capture power at the Centre. Prime Minister Narendra Modi even campaigned via 3D halograms, something unprecedented in electioneering history.\n\nHowever, the State BJP seems to lack this innovative vigour if one goes by the slogans they coin.\n\nAt the State party headquarters in Kamalalayam, a cut out of Mr. Modi, Amith Shah and Tamilisai Soundararajan bears this slogan: Valimayana Bharatam, Valamana Tamilagam.\n\nSounds familiar? This is just the motto of Tamil Manila Congress reversed: Valamana Tamilagam, Valimayana Bharatam.\n\nPerhaps, the Tamil Nadu BJP needs a few lessons on innovation.\n\nMDMK general secretary Vaiko does not seem to be content with just punctuating his speeches with heroic episodes from world history and liberation movements.\n\nThe leader revels in pontificating the deeds of heroes has also named his Rajapalayam dog after Peritas, the favourite dog of Alexander, the Great.\n\nPeritas always accompanied Alexander during his expedition and died while protecting the Macedonian King. Alexander named a city, believed to be in India, after Peritas.\n\nWill M.K. Alagiri be back in the DMK? The question has started making rounds again. “If leaders like Karuppasamy Pandian and Anita Radhakrishnan could be admitted, why not Alagiri?” asks a close confidant.\n\nOn New Year’s day, supporters of ‘Anja Nenjan’ lined up at his residence in Satya Sai Nagar, Madurai but the bonhomie was missing. Cadres came with fruits and shawls, but the jubilation was missing.\n\nWhen reporters and videographers too managed to get in, security personnel at the gate politely said: “No videos or photos. You can greet Annan and come out.” The reporters were told to confine to wishing him a happy new year... “No questions.”\n\nConfident that he would be back in the party and anticipating the good news before the birthday, his supporters have already started pasting posters in Madurai. Sample this: “Your victory may be delayed...but no one can stop your victory...”\n\nFor now, Alagiri appears to have chosen to remain silent, at least till his birthday.\n\nAfter blaming the media for ignoring his efforts during the floods, PMK chief-ministerial candidate Anbumani Ramadoss has taken to social media to register the help he rendered to the flood-affected. Last week, a video putting together images of Dr.Anbumani on coracles supplying relief material to flooded areas stormed WhatsApp, Twitter and Facebook. But as usual, criticism followed with some wondering what is the need for the publicity if the intention was only to help and not attract political support.\n\nWhen Nanjil Sampath joined the AIADMK from the MDMK after his tussle with Vaiko, Chief Minister Jayalalithaa appointed him the Deputy Propaganda Secretary. Along with the post, Mr. Sampath was given an Innova car to fulfil his responsibilities which included touring widely to speak in public meetings across the State. When he lost his post last week right after two television interviews, social media raised a question: Did they take away the Innova too?\n\n(Reporting by Sruthisagar Yamunan, B. Kolappan, L. Srikrishna and B. Aravind Kumar)", 
    "section": "national", 
    "title": "TN BJP’s lack of creativity", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}