{
    "author": [
        "C Jaisankar"
    ], 
    "text": "unday is supposed to be an off-day for office-goers. Logically, there should be thin traffic on the roads compared with weekdays. But, chaos rules the roads in Tiruchi on Saturdays and Sundays, especially on arterial roads in Cantonment.\n\nSunday turned out to be yet another tough day for traffic policemen to restore order on Rockins Road that connects Tiruchi Railway Junction and Central Bus Stand. With a large number of buses, cars, and other vehicles lined up on both directions, the traffic on the road came to a standstill between 2 p.m. and 3.30 p.m. The bottleneck was cleared only after about 90 minutes. This problem is not confined to Rockins Road alone. Bharathidasan Road, Collectorate Road, Birds Road, Reynolds Road, Royal Road, V.O. Chidambaram Pillai Road, and other roads in Cantonment area and around Central Bus Stand witness a similar situation.\n\nAlthough motorists and passengers are put to hardship every day, it turns worse on Saturdays and Sundays, thanks to the heavy inflow of buses, including long-distance private buses.\n\nIn the absence of good bus shelters or parking area for omni buses bound for Chennai, Bengaluru, and Thiruvananthapuram, they collect passengers on roads close to the Central Bus Stand, hindering the free flow of traffic in the evening.\n\nThe buses of Tamil Nadu State Express Transport Corporation (Thiruvalluvar) were once operated from its own bus stand on Rockins Road. Since it has become defunct, they enter the bus stand to pick up passengers.\n\nMoreover, private operators operate more services on Saturdays and Sundays to cash in on long-distance travellers to north and southern destinations of the State.\n\nThe bus stand, built 50 years ago, is designed to operate 81 buses at a time. According to an estimate, over 350 buses are operated from the bus stand, causing chaos, and confusion. With the closure of a few important roads for the construction of the bridge near Railway Junction, the buses are diverted via V.O.C. Road.\n\nA senior police officer told The Hindu that the bus stand had become inadequate to take the load of traffic. It would become chaotic even when a driver of a bus made a mistake by boarding passengers on the road or overtaking. A new system was followed to allow buses into central bus stand in batches.\n\nAlthough there was a little improvement, the problem would only be solved by building integrated bus stand, which was long-felt demand of people of Tiruchi.", 
    "section": "national", 
    "title": "Traffic jams worst on Sundays", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}