{
    "author": [
        "S Sundar"
    ], 
    "text": "Agricultural land or house is the only property or source of income for many\n\nA section of the land proposed to be taken over by the State government for Madurai airport expansion work.— Photo: G. Moorthy\n\nA seventy-three-year-old weaver, R. Dhanushkodi, bought 55 cents of plots at Ayan Pappakudi in 2004 with an ambition to build a house for himself and sell the remaining plots to marry off his four daughters. He managed to marry off his first daughter. But his fate failed him.\n\nThe district administration took over his 55-cent plot that was among 615 acres of a land around Madurai airport acquired for runway extension in 2008. “I could neither sell my land nor pledge it to raise money for the marriage of my daughters,” he said.\n\nNow, his three daughters, aged between 31 and 33 years, are waiting for years for marriage as Mr. Dhanushkodi has no other property to meet the expenses. “Since the revenue officials have frozen further transactions of these lands, the Department of Registration does not entertain any transaction,” said P. Pandiyarajan, an advocate.\n\n“Not even relatives will lend money on the land since it carries no value with the district administration yet to arrive at its value,” Mr. Dhanushkodi said.\n\nSame is the case with M. Mohan (66), who used to work in a handloom unit in Sellur. He is not able to sell his three plots of 15 cents in Chinna Udaippu. A diabetic, Mr. Mohan has been borrowing money by pledging his house in Sellur for meeting the medical bills for himself and his wife. “My wife suffers from arthritis and she has developed heart ailment too. With no income for long, we have been spending around Rs. 3,500 a month for medicines alone,” he said.\n\nStating that his family economy had worsened over the years, he said that he could not even afford to buy chocolates for his grandchildren. “I am losing my respect in their eyes,” he rued.\n\nG. Karpagavalli (38) has a similar story to narrate. Her father G. Ayyappan is in deathbed. “His only wealth was the seven cents of land,” she said. Since her two brothers were in a poor economical condition, she had been taking care of her father. “My father has a pricking conscience that he could not leave something good for his sons. He could also not realise his dream of constructing a house,” she said.\n\nAll these problems and much more of some 3,000 land-holders in villages around the airport are not only because of land acquisition for the airport. “It is because of the inordinate delay in making payment for the lands that were taken over some seven years back,” said a retired TWAD Board engineer, V. Subburajan.\n\nExcept for a few who had bought land for investment purpose, for most of them agricultural land or house was their only property or source of income.\n\n“Many are not able to construct a toilet, as any additional construction done after the initial survey would not fetch them any compensation,” he added.\n\nAs per the Land Acquisition Act, the process of valuation and handing over compensation should be completed within two years. “At least, the government should consider giving an interim relief with the value for the property fixed in 2008,” Mr. Pandiarajan said.\n\nMr. Subburajan, who has been waging a war seeking information on the issue through the Right to Information Act, said that he had been made to run from pillar to post right from the beginning.\n\n“All officials at different levels are giving a different picture. We now come to know that the district administration has failed to even fix the value for properties of individual land holders. And that is what is making our wait agonising,” he said.", 
    "section": "national", 
    "title": "Turbulence for landowners as land acquisition for airport is delayed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}