{
    "author": [
        "S Senthalir"
    ], 
    "text": "Traders from Chennai too bring their stock for the discerning at Sunday Market in Puducherry\n\nStudents can look for their textbooks, dictionaries at low prices in these book stalls at the Sunday Market on M.G. Road in Puducherry.— Photo: S.S. Kumar\n\nAs you walk down on M.G. Road on Sundays, the cosmopolitan nature of Puducherry will definitely not skip your view.\n\nThe eclectic collection of books laid out on the pavement for sale in the Sunday Market brings out the hidden treasures of Puducherry.\n\nBooks in German and French languages for sale add an international aura to it. No customer will return home disappointed as they cater to the varied interests of book lovers. These pavement bookstalls meet the demand for wide ranging subjects, offering the customers most valuable books at a lower price.\n\nThe range of books includes children’s books, arts, religious, politics, social sciences, novels, science, medicine, travel and many more. If you find Wilbur Smith in a corner of the bookstall, there will also be Freud’s book on the other side. Students can also look for their textbooks, dictionaries at a cheaper price in these places.\n\nFifty-five year old S. Mani, one of the booksellers from Chennai brings hundreds of books every week to the Sunday Market.\n\n“I bring at least four to five sacks of books to this market. This time, I got three sacks containing English books and one and half sacks of Tamil books,” he says.\n\nHe has been selling second-hand books for the past 30 years on the Mount Road in Chennai. “I started visiting Puducherry only 10 years back. I come here every Sunday in a private bus specially arranged for the traders who come here from Chennai,” he says.\n\nValayapathi (53) from Ambattur in Chennai had incurred huge loss in his second-hand bookstall at Mount Road after the construction of Metro rail started. But he found a silver lining in the Sunday market.\n\n“I work in a sugarcane juice shop in Chennai during the weekdays and come to Puducherry on Sunday to sell books. I get at least 500 to 750 books and we also have a godown here to store 40-50 sacks of books.\n\nThere is A. Idhurs (43), a bookseller from Chennai who sees a potential market on Sundays here. “We have organised a vehicle that would pick up and drop traders coming from Chennai,” he says.\n\nWith a regular customer of more than 20 people, he earns Rs. 3,000 to Rs. 4,000 in a lean day. “The sales will go up when there are new books and we might earn between Rs. 8,000 to Rs. 9,000,” says Idhurs.\n\nThe books sold here are affordable, which attracts more people.\n\n“There are Tamil books including interesting novels sold at a low cost. You can even negotiate the price. The cost of books range from Rs. 20 to Rs.100 or Rs.150 and these markets are a blessing for students who cannot afford expensive text books, says Sakthivel.M, a regular customer to these bookstalls.\n\nAt dusk on a Sunday, these booksellers pack up the unsold books only to return back the next Sunday.", 
    "section": "national", 
    "title": "Valuable books at affordable prices", 
    "subsection": "tamilnadu", 
    "date": "2016-01-04"
}