{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Chhattisgarh Chief Minister Raman Singh on Monday blamed the “anti-industry” attitude of “some people” for the backward status of Maoist insurgency-hit Bastar region of the State.\n\nSpeaking during a discussion titled “Bastar Yesterday, Today and Tomorrow” at Chitrokot town in Bastar, the Chief Minister in an emotionally charged speech said, “Some people oppose industry in Bastar. Does the iron ore of Bastar belong to Japan, China and other countries? Does Bastar not need roads and infrastructure?”\n\nLambasts Naxals\n\nLashing out at Naxals, Mr. Singh questioned the outlawed party’s contribution to Bastar and its progress.\n\n“Naxals talk of unequal land distribution and claim to be fighting against feudalism. But there was no inequality or feudalism in Bastar. Even the richest person in the village used to go and collect tendu patta (leaves) here. They (Naxals) came to Chhattisgarh because Chhattisgarh’s tribals are bhola bhala (modest). Now, the people of Bastar understand that Maoists have only exploited the region,” he said.\n\n“Have you (Naxals) educated the people of Bastar in the last 40 years? Have you talked of land reforms? Have you trained people here? It’s all about extorting money,” Mr. Singh charged.\n\nThe Chief Minister said the people of Bastar never accepted Maoists who used terror as the tactic.\n\n“Only due the fear of the gun, they (Maoists) were given a place here. Now, only two percent of the people support them and that too due to terror. People are convinced that Bastar cannot progress with violence,” Mr, Singh said.\n\nRecounting how the construction of an 8 km-long road in Sukma district a few years ago witnessed the killing of eight policemen by Maoists, Mr. Singh said the situation, however, was improving rapidly.", 
    "section": "national", 
    "title": "Anti-industry mindset kept Bastar backward: Raman Singh", 
    "subsection": "general", 
    "date": "2016-01-26"
}