{
    "author": [
        "Somesh Jha"
    ], 
    "text": "The NDA government’s pursuit of contentious labour law reforms such as easier norms for hiring and firing employees has compelled all central trade unions, including the RSS-affiliated Bharatiya Mazdoor Sangh (BMS), to join hands again to discuss a collective course of action.\n\n“We will not allow the labour reforms to happen, especially those related to ‘hire and fire’ amendments,” BMS president B.N. Rai told The Hindu .\n\nHe said all Central trade union leaders would meet on Wednesday to take on the legislative changes proposed by the government and review the progress on their larger charter of demands presented to the government.\n\n“We asked the government to give more powers to labour commissioners, make it compulsory for employers to attend conciliation meetings and asked for harsher punishments to employers for violation of labour laws. However, the government is going ahead with its ‘hire and fire’ proposals,” Mr. Rai said.\n\nThe development assumes significance as the BMS had swung from being extremely critical of the NDA government’s labour policy in early 2015 and backing a day-long strike along with all trade unions on September 2, to pulling out of the strike action at the last moment. The strike targeting the government’s labour reform agenda was seen as successful, with other unions claiming that 15 crore employees had participated.\n\nLast month, when the Payment of Bonus Act was cleared by Parliament, BMS leaders jointly briefed the media with Union Labour and Employment Minister Bandaru Dattatreya. They asserted that the law enhancing bonus payouts demonstrated that the union had taken the right call by not joining the strike as the government had assured them that some of their demands would be fulfilled.\n\nThe union later organised a function on December 30 to felicitate Finance Minister Arun Jaitley, Power Minister Piyush Goyal and Petroleum Minister Dharmendra Pradhan. The government has proposed a slew of changes in labour laws dealing with industrial relations to ease retrenchment norms while enhancing the social security net for employees laid-off and separate regulations for small factories.\n\nApart from resisting some of these reforms, the charter of demands of the unions includes strict enforcement of labour laws, universal social security cover for workers, firm action against price rise, employment generation and a halt to disinvestment. They have also sought minimum wages of Rs. 15,000 for all workers and an embargo on foreign direct investment in the railways, insurance and defence sectors.\n\nThe trade unions will review the action taken by the central government to address their charter of demands.\n\n“We will be discussing all the issues related to our charter of demands. All the issues are still pending. Based on that, we will decide the future course of action,” said A.K. Padmanabhan, president, Centre for Indian Trade Unions (CITU), affiliated to the Communist Party of India (Marxist).\n\nAt a pre-budget meeting held with Mr. Jaitley early this month, union leaders had expressed strong reservations against some of the labour reform proposals.\n\n“The process of labour law reforms being pursued by the government to provide for unhindered hire and fire and for pushing the majority of workers outside the purview and protection of most of the labour laws — all for ease of doing business — must be stopped,” the unions had said in a joint memorandum.\n\nWe will not allow ‘hire and fire’ amendments as planned by the govt.: labour leader", 
    "section": "national", 
    "title": "As govt. presses for labour reforms, trade unions reunite", 
    "subsection": "general", 
    "date": "2016-01-26"
}