{
    "author": [
        "Bindu Shajan Perappadan"
    ], 
    "text": "‘There is no question of allowing any form of isolation based on caste/religion’\n\nStudents who manage an admission to the All India Institute of Medical Sciences (AIIMS) here — the country’s premier medical school — admit that they still do an Internet search about “ragging and suicides” at the Institute which made news some years ago.\n\n“All of us here know about how the situation was a decade ago when caste-based ghettos were common at the AIIMS hostels and students from non-Hindi or English stream faced harassment [both academic and personal] trying to cope with the rigours of the new life,” says an undergraduate student at the AIIMS on condition of anonymity.\n\nThe institution witnessed a series of protests in 2012 when a Dalit student, Anil Kumar Meena, committed suicide, not even leaving a note behind. The lower caste students were quick to conclude that caste discrimination had pushed Meena to end his life.\n\nSince then the AIIMS administration has “consciously taken measures towards integration of all students. Integration of students begins at the very beginning,” maintains the AIIMS administration.\n\nThough the last student suicide — third-year nursing student in 2014 — allegedly due to academic strain and harassment at school is still a fresh memory, the AIIMS asserts that implementation of the integration programmes and anti-ragging measures are followed in a stringent manner.\n\n“Students are monitored, offered counselling and security and there is no question of allowing any form of isolation or groupism based on caste/State/religion etc here,” says Dr. Sanjeev Lalwani, Registrar, AIIMS.\n\nHe says that to prevent any isolation of certain groups, “after the initial admission process, students are allotted hostel rooms and faculty mentors by draw of lots and this is done in a totally random manner. The concept is to ensure that no student faces discrimination and is quickly integrated with the system.”\n\n“The AIIMS has already put in place a rigorous system to ensure that there is no ragging, harassment or maladjustment among the students. We have several systems in place including, ice-breaker programme, student and faculty orientation sessions, mentoring scheme and a robust security system which ensures that students have the facility to speak up and discuss their problems with the new challenging environment and the academic load,” says Dr. Lalwani.\n\nThe AIIMS also conducts language (English and Hindi) classes which are to help students to tide over any communication problems they may face.\n\n“Above all, the Institute has requested the faculty — often the first contact point for students — to ensure that they stay accessible to students all the time,” says the Registrar.", 
    "section": "national", 
    "title": "At AIIMS, integration begins at the start itself", 
    "subsection": "general", 
    "date": "2016-01-26"
}