{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India’s refusal to amend nuclear liability laws cited as reason\n\nOne year after the Indo-U.S. civilian nuclear deal was announced as done, the commercial end of the deal is moving slower than hoped, says the co-chair of the U.S. Congressional Caucus on India and Indian Americans, Ami Bera. Mr. Bera, who had accompanied U.S. President Barack Obama for his Republic day visit in January 2015, had predicted “billions of dollars” in trade for U.S. companies after India clarified its liability laws at the time.\n\nThe two companies that had been expected to close deals for nuclear power reactors were GE-Hitachi and Toshiba-Westinghouse, each of which had planned six reactors each several years ago, but had shelved them after India refused to amend its nuclear liability laws. Westinghouse has since revived negotiations on the basis of India’s assurance of an insurance pool for the nuclear supplier, for a plant in Gujarat’s Mithivirdi that it had signed an “early works” MoU for in 2012. Even so, GE has remained “less than satisfied” with the Indian law, Mr. Bera told The Hindu , adding, “On the nuclear side, things have been moving quite slowly.\n\n“I wouldn’t use the term disappointed, but it’s not moving as fast as I would have liked to see,” Mr. Bera said in an exclusive interview to The Hindu during a visit to Delhi recently.\n\nAccording to Mr. Bera, it is the defence sector that has seen “real progress” in the year following Mr. Obama’s visit. “I am optimistic and pleased with how the defence relationship is faring. Companies like Boeing and Lockheed Martin are looking to produce here, take advantage of Make in India, and it’s all happening quite rapidly,” he said. However, he said he hadn’t given up hope on the nuclear partnership, given that other countries such as Canada, Japan and Australia were moving ahead in their nuclear trade with India. “We’ll see progress on the civil nuclear front, hopefully, because we are seeing other countries starting to take advantage of the structure, and we hope (U.S.) companies will take advantage of the opportunities there too,” Mr. Bera, who represents Sacramento, California, which has many companies that can benefit from the deal, said.\n\nOfficials say the next big fillip to the Indo-U.S. nuclear deal could come when Prime Minister Narendra Modi travels to Washington in March this year to attend the Nuclear Security Summit hosted by Mr. Obama. In recent weeks, negotiations between Toshiba-Westinghouse have picked up pace, Westinghouse chief executive Daniel Roderick disclosed in an interview to Reuters agency in mid-January. In the interview, Mr. Roderick said that the aim was to make a “commercially significant announcement” during Prime Minister Narendra Modi’s visit, and the final decision would be taken after a closer scrutiny of the Rs.1,500-crore ($222 million) liability-capped insurance pool.\n\nAccording to Reuters, Mr. Roderick said Mr. Modi’s office was “driving the deal,” but other government authorities also had to hasten the process. “It is just going to take everyone deciding to have this done by March,” Mr. Roderick said.\n\nCalling for “patience” from U.S. companies wishing to do business with India, Mr. Bera said that despite Mr. Modi’s commitment to improving the “ease of doing business,” a lot still needed to be done to remove red-tape.\n\n“I think the Prime Minister’s challenge is more on the domestic front, working through his bureaucracy on the Indian side,” Mr. Bera explained, adding, “My message to U.S. companies would be to be patient. It could take 4-5 years to pass the necessary reforms, so they shouldn’t lose sight of the broader goal.”\n\nOn the U.S. election campaign, Mr. Bera, the first Indian-American in the U.S. Congress and who is a supporter of Hillary Clinton, said he expected Indo-U.S. ties to move “without a hitch” if Ms. Clinton was elected. On the Republican side, it’s anyone’s guess,” he said.", 
    "section": "national", 
    "title": "Business yet to take off: U.S. Congressman", 
    "subsection": "general", 
    "date": "2016-01-26"
}