{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "A day after the BJP government sought President’s rule in politically embroiled Arunachal Pradesh, the Congress on Monday called on all the non-BJP Chief Ministers to fight the Centre’s “conspiracy to destabilise” governments in non-BJP States across the country.\n\nAt a press briefing here, senior Congress leader Kapil Sibal said: “the party will move the Supreme Court against the Union Cabinet’s recommendation for President’s rule in the State.\n\n“I, in fact, believe that all non-BJP Chief Ministers should sit together, all these political parties in the Lok Sabha and Rajya Sabha should together raise this issue in the House,” said Mr. Sibal.Later in the evening, a delegation of senior Congress leaders along with Arunachal Pradesh Chief Minister Nabam Tuki met President Pranab Mukherjee to oppose the Union cabinet’s bid to bring in the president’s rule. Mr.Sibal said ever since the political turmoil hit the state, its Governor, J.P. Rajkhowa, has gone out of his way to support the coup.\n\nMr.Sibal went on attacking the governors of other states, accusing them of “acting as Parcharaks of the RSS and the long arm of the union government.” He then named the governors of West Bengal, Bihar, Rajasthan, Tripura, Assam, Uttar Pradesh and Karnataka, highlighting their recent statements that challenge the idea of secular democracy.\n\nPolitical turmoil hit Arunachal Pradesh in early December when 21 Congress MLAs rebelled out of its 47 MLAs. The balance of power shifted toward the dissident MLAs when 11 BJP MLAs along with deputy speaker of the state assembly joined the rebellion in the 60-member House. As the assembly session was round the corner, the speaker disqualified the insurgent MLAs along with the deputy speaker, who in turn declares the order void. Congress soon began accusing the deputy speaker of undermining the authority of the speaker. Much to Congress party’s dismay, Governor Rajkhowa chipped in by allowing the rebel group to conduct an assembly session under the supervision of the deputy speaker, sidelining the Chief Minister Tuki and other Congress leaders.", 
    "section": "national", 
    "title": "Congress seeks support of non-BJP Chief Ministers", 
    "subsection": "general", 
    "date": "2016-01-26"
}