{
    "author": [
        "National Bureau"
    ], 
    "text": "Narendra Modi and French President Francois Hollande at the inauguration of the Interim Secretariat of the International Solar Alliance in Gurgaon on Monday.— PHOTO: Shanker Chakravarty\n\nFrench President Francois Hollande on Monday committed €300 million (around $325 million or Rs. 2,200 crore) over the next five years for the global development of solar energy and said the real challenge was to attract investments worth a trillion dollars to promote the renewable source.\n\n“The French Development Agency will allocate for the development of solar energy €300 million over the next five years,” Mr. Hollande said after inaugurating the interim Secretariat of the International Solar Alliance at Gurgaon, with Prime Minister Narendra Modi.\n\nThrough this solar alliance, the French President said, he would like to open a new chapter to help give countries with no resources other than the sun an opportunity to produce electricity for meeting the needs of most of their people.\n\nThe International Solar Alliance, envisaged to bring together 122 countries that lie wholly or partly between the Tropic of Cancer and the Tropic of Capricorn, is an initiative announced by Mr. Modi at the COP 21 Summit in Paris in November. The member countries are to be those that enjoy 300 or more days in a year of bright sunlight.\n\n“For the last one year, the world has been discussing global warming and how to mitigate it… For two weeks, there were discussions on global warming in Paris. India expressed keenness on solar alliance. President Hollande was very helpful, did everything possible to bring all nations together,” Mr. Modi said.\n\nThe Alliance, Mr. Hollande said, would focus on three broad areas. “First, it is about pooling together the requests of countries with a huge potential in order to reduce their cost of capital. Second, it is about opening the markets in order to reduce the cost of investment. Third, it is about transferring the necessary technology and know-how from developed to developing countries,” he said.\n\n“The challenge is also to bring in a lot of investments. We estimated the amount necessary for the advancement of this energy to be more than $1 trillion. We therefore mobilised all resources provided by the COP 21 so that they are made available to all the countries willing to develop solar energy,” Mr. Hollande said.\n\n“Progress is impossible without energy. The developing countries still have a lot of progress to achieve. But the problem is that energy through fossil fuels yields issues of global warming and harm to the environment, and without energy, these countries will sink into darkness,” Mr. Modi said.", 
    "section": "national", 
    "title": "France commits €300 million for solar energy", 
    "subsection": "general", 
    "date": "2016-01-26"
}