{
    "author": [
        "L Renganathan"
    ], 
    "text": "“My chances of getting re-elected from the Tiruvarur Assembly Constituency are bright. If the electorate so desires, I will contest from here again,” said former Chief Minister and DMK president M. Karunanidhi.\n\nIn a brief interaction with the media after paying homage to his mother Anjugam Ammal at her samadhi at Kattur near here on Monday, Mr. Karunanidhi said the DMK manifesto would centre on democratic aspects and governance.\n\n“We will welcome other parties if they come forward to join our alliance and will never turn anyone away,” he said, adding the DMK would appreciate those willing to deliver the goods for the people.\n\n“No comments,” was his cryptic remark when asked to assess the AIADMK rule of the past five years.\n\nDemands judicial inquiry\n\nHe said that the State government must order a judicial inquiry into the circumstances leading to the death of three girl students of a private college in Villupuram. So far, there has not been any tangible action by the authorities, he observed.\n\nIn a separate statement on the death of three students near Villupuram, Mr. Karunanidhi alleged that there seemed to be attempts to hush up things as some reports claim that the trio were found floating with their hands tethered and that they were part of a group of students who had staged a protest against the college administration recently.\n\nHeeding the voice of many parties and organisations, the State government must come forward and announce a judicial inquiry by a sitting Judge of the High Court, Mr. Karunanidhi demanded.\n\nEarlier, Mr. Karunanidhi arrived here on Monday morning to a rousing reception by the DMK party men to participate, among other functions, in the rally arranged to commemorate the sacrifice of the language martyrs.", 
    "section": "national", 
    "title": "I will contest from Tiruvarur again if people want it: Karunanidhi", 
    "subsection": "general", 
    "date": "2016-01-26"
}