{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Lance Naik Mohan Nath Goswami from the Army’s elite Para Special Forces has been awarded the Ashok Chakra, the country’s highest peacetime gallantry award, posthumously for his role in saving two colleagues during an encounter with militants in Kashmir last year.\n\nAnother of his colleague, Subedar Mahendra Singh was awarded Kirti Chakra for his valiant actions in the same operation.\n\nThese are among the 365 gallantry awards and other defence decorations approved by President Pranab Mukherjee on the eve of the 67th Republic Day Celebrations.\n\nThese include four Kirti Chakras, 11 Shaurya Chakras, one Bar to Sena Medal, 48 Sena Medals, four Nao Sena Medals, two Vayu Sena Medals in addition to 298 Distinguished Service medals.\n\nLate night on September 2 last year, Lance Naik Goswami was engaged in a fierce encounter with terrorists hiding in the Haphruda forest in Kupwara, North Kashmir.\n\nWhen two of his colleagues were wounded, he rushed to rescue them, braving the volley of fire despite getting grievously wounded himself.\n\nIn the same operation, Subedar Mehendra Singh moved with Lance Naik Goswami to evacuate his colleagues, drawing heavy fire in the process. He returned fire and killed one terrorist at close quarters which also bought them additional time, officials said. He was awarded the Kirti Chakra for his “exemplary leadership, selflessness and courage beyond compare”.\n\nThe other Kirti Chakra was posthumously awarded to Sepoy Jagdish Chand from the Defence Security Corps for his display of raw courage in tackling terrorists during the attack on the Pathankot air base on January 2.\n\nOf the eight Shaurya Chakra given to Army personnel, two were awarded posthumously.\n\nAmong the four Navy gallantry awards, three went to personnel at INS Shikra , the naval air station in Mumbai, for their efforts in the rescue of vessels in distress.\n\nIn the Air Force, the two Vayu Sena Medals (Gallantry) went to Wing Commander Nirmal Kumar Bakshi and Wing Commander Rajiv Dobhal, both Mi-17 helicopter pilots, for their role in Operation Maitri to provide relief operations in adverse weather conditions in Nepal following the devastating earthquake last year.\n\nPresident Pranab Mukherjee approves 365 gallantry awards and other defence decorations", 
    "section": "national", 
    "title": "Lance Naik Mohan Nath Goswami posthumously awarded Ashok Chakra", 
    "subsection": "general", 
    "date": "2016-01-26"
}