{
    "author": [], 
    "text": "The snowy village of Tuntou churns out pumpkin-shaped lamps used during the Spring Festival, the biggest holiday of the year in China\n\nA worker hangs red lanterns in a factory in the village of Tuntou, in China’s Hebei province, for the upcoming Lunar New Year celebrations on February 8.— PHOTO: AFP\n\nCarefully steadying the gleaming red lantern between her knees, a worker applied the Chinese character for “wealth” in golden glitter — one of the millions that will illuminate the forthcoming Lunar New Year.\n\nA high wooden arch at the entrance to the snowy village of Tuntou, in Hebei province southwest of Beijing, proclaims it is the “lantern capital” of the People’s Republic.\n\nBai Liwei, the village’s Communist Party leader, said proudly: “Eighty to 90 per cent of the lanterns used in China come from here.”\n\nFor the past two months, the town has been churning out the pumpkin-shaped lamps in preparation for the biggest holiday of the year in the world’s most populous country. Known as the ‘Spring Festival’ in China, the holiday, which falls on February 8 on this occasion, compares in importance to Christmas in the West, and marks a time when for far-flung family members return home for merriment and meals — according to tradition, they must be back by midnight on the eve of the new year.\n\nTuntou village has specialised in artisanal lantern-making for nearly 40 years. It is not the site of enormous factories, instead the industry is driven by a number of private workshops in which families concentrate on the production of a single lantern element — their spindly metal frames, the exterior “skin” of fabric or silk, the decorative inscriptions.\n\nAt the back of one assembly unit, high piles of nearly completed lanterns awaited processing, while workers wielded wooden canes to lift others high off the ground to dangle delicately from the ceiling.\n\nThe colour red symbolises luck and happiness in Chinese culture, and the lanterns are omnipresent throughout towns and countryside, trotted out at most important occasions: marriages, business openings, and most of all the Lunar New Year, which generally falls in late January or early to mid February.\n\n“Outside of the peak holiday season, we also receive special requests: giant models, for example, or orders to decorate the Forbidden City in Beijing,” explained Mr. Bai.\n\n“Tens of millions of lanterns are produced each year and all or almost all of them are sold. A portion is exported to Southeast Asia, the US or Japan. It’s become an economic pillar for the village,” he said.\n\nTraditionally, positive Chinese characters such as “happiness”, “peace”, and “family” are painted on their sides. But in recent years their inscriptions have become increasingly political. “The majority of these lanterns are decorated with one of the twelve ‘socialist core values’ promoted by President Xi Jinping,” said Mr. Bai. — AFP", 
    "section": "national", 
    "title": "New Year glow at ‘lantern capital’", 
    "subsection": "general", 
    "date": "2016-01-26"
}