{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "Former State Election Commissioner Prabhakar Timble here on Monday launched a new regional party, Goa Forward, with the main objective of ousting the ruling BJP in the next State Assembly elections in 2017. Goa Forward has said it would join hands with other political parties and independent politicians in its attempt to unseat the BJP.\n\nDetermined to cash in on the public opposition over the State government’s recent decision amending a law to re-classify coconut tree as palm apparently to allow farmers to cut the trees down more easily, the new outfit has promised to bestow the former status again on the Cocus nucifera and declare it a “State tree.”\n\n“We will declare coconut tree as the State tree and we promise that it will be brought under the Preservation of Trees Act once again,” Mr. Timble said.\n\nIn a direct rejection of national parties that operate on the directions of their Delhi-based high commands, the Goa Forward said it has decided to “have Goans as its high command.” The party has also promised to oppose junkets for ministers and bureaucrats as a party principle and shun special privileges and VIP racism.\n\nThe party’s manifesto promises imposition of non-occupancy charges to deal with speculative real estate business, pursuit of Special Status for the State and implementation of the Public Service Guarantee Act.\n\nThe Goa government controversially amended the Goa, Daman and Diu Protection of Trees Act, 1984, in the recent winter session of the State Legislative Assembly to formally de-classify the coconut palm as a tree. The decision invited strong criticism from the Opposition, coalition partners as well as the civil society and social media.\n\nStating that three independent MLAs — Vijai Sardesai, Rohan Khaunte and Naresh Sawal — have already expressed their support for the Goa Forward, Mr. Timble said talks were on with two other legislators, besides Zilla Parishad members, councillors and other local body authorities. Replying to a question, Mr. Timble said the party has decided not to join the Aam Aadmi Party, which holds similar social objectives, solely because its high command was situated in Delhi as the new party would have their “high command in Goa.”", 
    "section": "national", 
    "title": "New regional party launched", 
    "subsection": "general", 
    "date": "2016-01-26"
}