{
    "author": [
        "Nirnimesh Kumar"
    ], 
    "text": "A court here on Monday remanded 12 accused persons who were arrested from different places and charged with recruiting and financing people willing to join terrorist outfit Islamic State in the custody of the National Investigation Agency (NIA) till February 5.\n\nAlthough the investigating agency had sought 14 days remand of the accused, the court remanded them in custody for 11 days.\n\nEarlier in its remand application, the NIA submitted that their custodial interrogation was necessary to unearth the conspiracy of the IS to expand their reach in the country.\n\nThe accused persons would be interrogated to collect more evidence about their activities and network, and their presence might also be required at different places for identification and corroboration of their statements, the remand application said.\n\nDuring preliminary interrogation, all the accused persons disclosed several facts about their involvement in recruiting and financing persons willing to join the ‘Caliphate’ of the IS in Syria, the application stated.\n\nThe accused were also in regular touch with active members of the terror outfit in Syria on the Internet, chatting through Skype, Signal and Trillion. They also had a presence on social networking sites to motivate youths to join the IS, the application said.\n\nM.S. Khan, the Counsel for 10 of the accused, opposed the police remand plea, arguing that the NIA had lodged the FIR on suspicion. Mr. Khan submitted that the NIA could only procure records of the alleged internet chats from service providers, and this could not be a ground to send his clients to NIA custody. He also argued that the accused were arrested on January 22 and 23 and they had been in NIA custody since. Therefore, there was no need to remand them in police custody.", 
    "section": "national", 
    "title": "NIA remand for alleged IS recruiters", 
    "subsection": "general", 
    "date": "2016-01-26"
}