{
    "author": [], 
    "text": "J.K. Rowling, who will be honoured for her advocacy of free expression, has been the target of censorship.— File Photo\n\nJ.K. Rowling’s latest honour isn’t only for her writing.\n\nThe Harry Potter author is to receive the PEN/Allen Foundation Literary Service Award, PEN America told The Associated Press on Monday. Ms. Rowling will be presented her award on May 16 at the literary and human rights group’s annual spring gala in New York. Previous winners include Toni Morrison, Salman Rushdie and Tim Stoppard.\n\nIn its announcement on Monday, PEN cited Ms. Rowling’s advocacy of free expression; her founding of the charitable trust Volant, which supports multiple sclerosis research and other causes; and her nonprofit organisation Lumos, which works to reconnect institutionalised children with their families.\n\n“I’m deeply honoured to receive this award and humbled that my work has been recognized as having moral value by an organisation I so admire,” Ms. Rowling told the AP in a statement. “I’ve long been a supporter of PEN, which does invaluable work on behalf of imprisoned writers and in defence of freedom of speech.” Ms. Rowling’s own Potter books have been the targets of censorship and attempted censorship, with the fantasy series’ feats of wizardry leading to worldwide allegations that the author advocates witchcraft and the occult.\n\nPEN America president and prize-winning author Andrew Solomon said in a statement that Ms. Rowling’s writing provides a wealth of “imagination, empathy, humour, and a love of reading, along the way revealing moral choices that help us understand ourselves.”\n\n“Through their experiences with Rowling both on and off the page, countless children have learned not only the power of speaking their own minds, but the critical importance of hearing others,” Mr. Solomon said. — AP", 
    "section": "national", 
    "title": "PEN award for J.K. Rowling", 
    "subsection": "general", 
    "date": "2016-01-26"
}