{
    "author": [
        "National Bureau"
    ], 
    "text": "President Pranab Mukherjee, addressing the nation on the eve of the 67th Republic Day, warned against the forces of violence, intolerance and unreason in the backdrop of the Dadri lynching incident and the death of Dalit student Rohith Vemula, even as he put the Opposition on the mat for blocking crucial reforms in the economic sphere.\n\n“Reverence for the past is one of the essential ingredients of nationalism. Our finest inheritance, the institutions of democracy, ensure to all citizens justice, equality, and gender and economic equity. When grim instances of violence hit these established values which are at the core of our nationhood, it is time to take note. We must guard ourselves against the forces of violence, intolerance and unreason,” he said.\n\nIf this was a pointed reference to the incidents in Dadri and Hyderabad, the President also did not spare the Congress party over the continuing Parliamentary impasse. “For revitalising the forces of growth, we need reforms and progressive legislation. It is the bounden duty of law makers to ensure that such legislation is enacted after due discussion and debate. The spirit of accommodation, cooperation, and consensus building should be the preferred mode of decision making. Delays in decision making and implementation can only harm the forces of development,” he said.\n\nThe President, who is the Chancellor of various universities across the country, displayed a deep concern in his address for the universities and academic spaces of the country, a very contested space at the moment, not just in terms of ideological pedagogy and appointments, but also student and faculty unrest.\n\n“An eco-system that fosters critical thinking and makes teaching intellectually stimulating is necessary. Through an open-minded approach to the wider spectrum of ideas emanating from within, our academic institutions must become world class,” he said.\n\nThe address strongly advocated talks between India and Pakistan, saying that the Indian “subcontinent has a historic opportunity to become a beacon to the world at a time of great danger.”\n\nHe ended the address with a quote from Tagore, hailing the advent of the new generation. “Delay not, delay not, a new age dawn,” he said from Tagore’s “Nutan Yugey Bhorey.”", 
    "section": "national", 
    "title": "Pranab warns against intolerance, criticises Parliament impasse", 
    "subsection": "general", 
    "date": "2016-01-26"
}