{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Nine months after Prime Minister Narendra Modi made the surprise announcement in Paris for the direct purchase of 36 Rafale fighter jets from France, the two countries on Monday signed the Inter-Government Agreement (IGA) on the acquisition, except for “some financial issues” which the two leaders agreed should be resolved soon. The pact was signed by the two Defence Ministers in the presence of the two leaders after their bilateral talks. This means that the two sides have failed to reach an understanding on the crucial issue of pricing.\n\nAddressing the joint press conference Mr. Modi announced, “Except for the financial aspects, we have an inter-governmental agreement for 36 jets. We will resolve financial issues very soon.”\n\nTerming the deal a “decisive step”, French President Francois Hollande said that the financial issues would be sorted out in a couple of days.\n\nAs reported by The Hindu earlier, the pricing of the aircraft has been a sticking point even as the issue of offsets has been sorted out. Officials had said that the cost per aircraft is over Euro 100 million or about Rs.740 crore and efforts were on to reduce the price by 20 per cent.\n\n“These fighter jets are precisely those which are fighting against the Islamic State of Iraq and Syria (ISIS) in Syria. They have proven themselves against the ISIS and we are happy to be able to provide them to India,” Mr. Hollande said. However, experts were quick to point out that the ISIS had neither an air force nor an effective air defence network which would put the Rafale jets to the test.\n\nCommenting on the agreement, Manoj Joshi, Distinguished Fellow at the Observer Research Foundation, said that ideally, defence agreements should not happen during summit-level visits. “There is needless pressure on the parties to show some results. This was not the practice before,” he told The Hindu .\n\nMr. Joshi also expressed reservations on the number of aircraft in question. If the government stuck to 36, it would not meet the requirements of the Indian Air Force. If the government wanted to go for more, it would make sense to order them now as it would ensure a better price. “I am not sure the government has thought it out,” he said.\n\nAnother issue in the Rafale deal is the delivery timelines. France has conveyed to India that with the level of customisation sought by the Indian Air Force, the aircraft would have to be built from scratch, resulting in longer timelines. In the case of Egypt’s order,jets were pulled off the assembly line meant for the French Air Force.", 
    "section": "national", 
    "title": "Rafales fighting the IS, says Hollande", 
    "subsection": "general", 
    "date": "2016-01-26"
}