{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The commission questioned Oommen Chandy on the role of the SIT.\n\nThe judicial commission examining the solar energy investment fraud asked Kerala Chief Minister Oommen Chandy on Monday whether the Special Investigation Team that probed the scandal had lost sight of its original purpose — exposing the involvement of those influential few who facilitated the deceit.\n\nThe commission, headed by former judge of the High Court G. Sivarajan, held a marathon sitting here for Mr. Chandy to state his side of the case that rocked the government in 2012-13 and, arguably, brought disrepute to the Chief Minister’s Office.\n\nThe SIT, headed by Additional Director-General of Police, South Zone, A. Hemachandran, had told the commission that the police had received no specific complaints against the three persons removed from the Chief Minister’s Office (CMO) after the scandal broke, the judge said.\n\nThey were Tenny Joppan, Jikkumon Jacob, and the Chief Minister’s gunman Salim Raj — all of them allegedly the damning links between the solar fraudsters and the highest levels of government.\n\nThe commission said the complainants in the case were concerned only about salvaging the money they had trustingly invested in solar case suspects Saritha S. Nair and Biju Radhakrishnan. The public interest inherent in the case was not their concern.\n\nMr. Chandy defended the SIT. He said it had charge-sheeted 33 cases and ensured conviction in one. The commission said the court had ruled that the solar accused pay back the aggrieved person Rs.1 crore. “By the time they were a big zero and in jail,” he said.\n\nThe Chief Minister made a strong political statement that he had nothing to bury by patiently sitting through the hearing in a sweltering government guest house hall with faulty air-conditioning for nearly eight hours, with an hour’s break in between.\n\nAt no point was the Chief Minister taciturn or irritated. The session was continuing into the night.", 
    "section": "national", 
    "title": "Solar scam panel grills Chandy", 
    "subsection": "general", 
    "date": "2016-01-26"
}