{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "A video showing Jammu and Kashmir Teachers Forum (JKTF) president Qayoom Wani making indecent remarks against Indian Administrative Services (IAS) topper and State Director, Education, Shah Faesal, has gone viral in J&K.\n\nIn the video, widely circulated on social networking sites, Wani describes Faesal as “ Oloo ka patha ” and “chocolate boy” in his speech to his forum’s members in Srinagar in an undated video.\n\n“I am from jageerdar (landlords) family. Look at his [Faesal] property in Kupwara and now in Srinagar. How does he acquire such a property…He doesn’t know he has laid his hand in lion’s mouth,” says Wani in the video.\n\nWani apparently was enraged by the department’s move to transfer many teachers associated with the forum. Faesal has been critical of the forum in the past and called it “a mafia.”\n\nPeoples Democratic Party (PDP) leader and MLC Nayeem Akhtar, also former Education Minister, expressed his “deep regret” over the video.\n\n“To put it mildly, our public discourse has touch a new low. It becomes a societal crisis when it’s led by a teacher against the son of another teacher, who has distinguished himself as one of the best statements Kashmir society has made in recent history,” said Mr. Akhtar.\n\nWhile netizens demanded action against the teachers’ leader for his remarks, Wani distanced himself from the video. “It is a managed video…My speech was not against Faesal, but the government policies,” Wani told The Hindu .\n\nHe said his forum is organising state wide protests on January 30 against the government policies. “The government under Nayeem Akhtar and others instituted screening test for teachers and is imposing more bureaucrats than academicians on the department. Similarly, the ban on private tuition during the winters has affected 13.5 lakh students, while government-run coaching is a big failure. Teachers hired under several schemes continue to be without salaries for months together,” said Wani.\n\nOn Facebook Faesal wrote: “Our problem is that we didn’t join IAS to get easy salary and run the system as per requirements of the moment. We didn’t join to make fortunes or make friends with the evil. We were trained to challenge the status quo.”", 
    "section": "national", 
    "title": "Video taunting Kashmir’s IAS topper goes viral", 
    "subsection": "general", 
    "date": "2016-01-26"
}