{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Locals and right-wing groups mobilise thousands to block them from setting foot in the temple\n\nA file photo of the late Narendra Dabholkar (second from right) and actor Sriram Lagoo outside the Ahmednagar police station after protesting against the practice of women not being allowed entry in the sanctum sanctorum of the Shani Shingnapur temple. Women are prohibited as locals believe there is ‘harmful vibration emanating from Saturn.’\n\nWith hours to go for Republic Day, Pune-based women’s outfit, Ranragini Bhumata Brigade, on Monday said it would go ahead with its plan to offer worship at the Shani Shingnapur temple in Maharashtra’s Ahmednagar district on Tuesday, defying strong local opposition and administrative diktat.\n\nBy tradition, women are prohibited from offering worship at the famous temple’s sanctum sanctorum owing to the myth of ‘harmful vibration emanating from the Saturn God or Lord Shani.’\n\nThe brigade is determined to do away with the gender barrier and age-old patriarchal tradition, using democratic means to achieve its goal.\n\n“We are not going to resort to any form of violence. We are not going to ‘storm’ the inner sanctum as is being perceived. All 400 women will walk in a single line and worship Lord Shani,” said Trupti Desai, president of the brigade, reacting to the notice served by the Joint Charity Commissioner’s office in Pune barring the brigade’s entry in the temple premises.\n\nCopter booked\n\nMs. Desai said the brigade had booked a helicopter as part of its plan.\n\nAs per the plan, Ms. Desai is to alight from the helicopter to offer worship at the prohibited inner sanctum even as the local administration has doubled its security for fear of a melee that might cause damage to temple property.\n\n“They may bar us on land but they cannot stop us from the skies,” she said, adding that even if her outfit’s activists were denied entry to the premises, they would offer flowers to their detractors to win them over.\n\nMeanwhile, in the village of Shani Shingnapur, locals and several right-wing groups, represented by the Sanatan Sanstha, the Hindu Janjagruti Samiti and its women’s wing, Ranragini Shakha, are galvanising thousands to block the activists from setting foot in the temple.\n\n“It is not an issue of gender discrimination … an age-old ritual stipulated by the Vedas and the shastras decrees that no woman can perform the puja of Lord Shani,” said Sanjay Bankar, the temple manager.\n\nAnita Shete, the first woman to be elected president of the temple trust board, said the age-old practice barring women would be “upheld.”", 
    "section": "national", 
    "title": "Women activists firm on worship today", 
    "subsection": "general", 
    "date": "2016-01-26"
}