{
    "author": [
        "B Kolappan"
    ], 
    "text": "The idol of Wallajapet Venkatramana Bhagavathar with the tamburas used by him and his guru, Saint Tyagaraja, at the Saurashtra Sabha in Madurai.— Photo: special arrangement\n\nTwenty more keerthanas of Wallajapet Venkatramana Bhagavathar, one of the prime disciples of Saint Tyagaraja, have been discovered.\n\nThey will be incorporated in the next edition of a book containing his keerthanas .\n\nThe book will be published on March 2, on the 235th birth anniversary of Venkataramana Bhagavathar at Ayyampettai near Thanjavur.\n\n“The 20 keerthanas are in addition to the 70 keerthanas already published as a book by me. These include 15 selected from the palm leaf manuscripts handed over to me by T.G. Ananthagopalan, a descendant of Venkatramana Bhagavathar, 15 by V.N Nagaraja Bhagavathar and 40 published by late musicologist P. Sambamurthy,” said T.R. Damodharan, former curator of the Saraswati Mahal Library in Thanjavur.\n\nVenkataramana Bhagavathar (1781-1874), born into a family of Saurashtra Brahmins at Ayyampettai, composed 150 keerthanas .\n\nHe had settled in Wallajapet, a small town in Vellore district. Thus the town’s name became part of his too.\n\nHis son, Krishnaswamy Bhagavathar, was also a disciple of Tyagaraja. It was the father-son duo who preserved many of the keerthanas of Tyagaraja and passed them on to posterity.\n\n“Tyagaraja handed over all his belongings, including his tambura , idols of Rama and some deities, palm leaf manuscripts and his padukas (wooden sandals) to Krishnaswamy Bhagavathar. While the idols are still in Wallajapet the other things have been brought to the Saurashtra Sabha in Madurai,” said Mr. Damodaran.\n\nMost of Venkataramana Bhagavatar’s works are keerthanas. But he has also penned a few Varnams ( tana and p ada ), Swarajatis and one Thillana . While some of these are in Telugu, others are in Sanskrit.\n\nHis Sanskrit shows his knowledge of that language, good vocabulary and a simple and elegant diction.\n\nThey are in addition to the 70 keerthanas already published as a book", 
    "section": "national", 
    "title": "20 more keerthanas of Tyagaraja’s disciple discovered", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}