{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "AIADMK cadres taking out a rally in Tirunelveli on Wednesday. (Below) Campaign at Kovilpatti in Tuticorin district. — Photos: A. SHAIKMOHIDEEN AND N. RAJESH\n\nJayalalithaa Peravai takes out rallies to highlight the “achievements” of government\n\nAll India Anna Dravida Munnetra Kazhagam cadres kick-started their election campaign here with the party’s Jayalalithaa Peravai taking out a rally here on Wednesday to highlight the “achievements” of the government led by Chief Minister Jayalalithaa.\n\nTaking out the rally from Eesaana Vinayaka Temple near Swamy Nellaiyappar Temple in Tirunelveli Town, the AIADMK cadres, led by Sudha K. Paramasivan, Jayalalithaa Peravai’s Tirunelveli city district secretary, went up to Santhi Pillaiyar Temple corner via Sathyamoorthy Street, Bharathi Street and South Car Street.\n\nAfter handing over pamphlets to the public, the ruling party office-bearers appealed to the voters to back the AIADMK in the forthcoming Assembly poll for “having served Tamil Nadu in a matchless fashion”.\n\nMPs K.R.P. Prabhakaran, Vasanthi Murugesan and Vijila Sathyananth, MLAs Nainar Nagenthran and Muthuselvi, Mayor E. Bhuvaneshwari, Deputy Mayor P. Jeganthan alias Ganesan and heads of various wings of the party participated in the rally.\n\nKanyakumari\n\nAIADMK’s Amma Peravai kick-started the election campaign from the entrance of Sthanumalayan temple at Suchindram in Kanyakumari district after a puja at the Vinayakar temple near the temple theradi.\n\nAIADMK district secretary N. Thalavai Sundaram inaugurated the campaign in an open van and distributed pamphlets to the people on the four Mada Veedhis.\n\nMr. Thalavai Sundaram said party workers should reach out to every voter to achieve 100 per cent victory.\n\nThe open van campaign was presided over by R. Xavier Manohar, district secretary, Amma Peravai, and Chairman of the Tamil Nadu State Fisheries Cooperative Federation. The two AIADMK MLAs K.T. Pachaimal (Kanyakumari) and A. Nanjil Murugesan (Nagercoil) participated. Chairman of Wakf Board and Secretary of the Anaithulaga MGR Mandram A. Tamilmagan Hussein took part in the part in the campaign. Amma Peravai district deputy secretary T. Selvakumar proposed a vote of thanks.\n\nTuticorin\n\nS.P. Shunmuganathan, Tourism Minister, inaugurated the campaign at Kovilpatti in the presence of J. Jeyasingh Thiayagaraj Natterjee, Tuticorin MP. It was organized by Jayalalithaa Peravai and its district secretary, C. Raju, Kovilpatti MLA, made the arrangements. S.T. Chellapandian, Tuticorin MLA, and G.V. Markandeyan, Vilathikulam MLA, took part.\n\nEarlier, the cadres took out a rally, which commenced near the Travellers’ Bungalow and ended near Sowbaghya Mahal.", 
    "section": "national", 
    "title": "AIADMK kick-starts election campaign", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}