{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Pattali Makkal Katchi (PMK) has convened a meeting here on Friday to discuss the vexatious fishermen issue with leaders of fishermen associations from the coastal districts and work out a lasting solution.\n\nPMK president G.K. Mani told reporters here on Wednesday that party’s Chief Ministerial candidate and former Union Minister Anbumani Ramadoss would chair the meeting and take up the issue with the Centre after taking the local fishermen into confidence.\n\nRejecting a suggestion that the PMK had convened the meeting to woo the fishing community ahead of the Assembly elections, he said that the party had been voicing its concern over the plight of farmers, weavers and fishermen, and the meeting had been convened to genuinely address the issue.\n\nMr. Anbumani Ramadoss was seriously concerned about the frequent arrests of fishermen by Sri Lankan Navy on the charge of poaching, and wanted to redress their grievance, he said.\n\nHe said that more than 300 fishermen were shot dead by the Lankan navy and hundreds of arrested fishermen were released after long periods of incarceration in the past 25 years.\n\nA lasting solution to the problem eluded as the Central governments, headed by the Congress in the past and the BJP at present, turned a blind eye to the issue, and treated Tamil Nadu fishermen in a step- motherly manner, he charged.\n\nMr Mani said that the party wanted the traditional fishing rights of Tamil Nadu fishermen over the Palk Strait to be protected. India should get back Katchatheevu, which was given to Sri Lanka. He said that Fazil Rajapaksa had reached an agreement with India to resolve the issue when he visited India on October 26, 2008, but it could not be implemented.\n\nCondemning the recent arrests of fishermen by the Lankan navy, he demanded the release of all the 104 fishermen with their 66 boats before Pongal.", 
    "section": "national", 
    "title": "Anbumani to meet fishermen association leaders tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}