{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "The Chennai city police has begun to conduct meetings with officials of banks to alert them about the danger their customers face everyday.\n\nAccording to the police, gangs that employ a novel attention diversion tactic to rob those leaving banks and the ATM kiosks after withdrawing money, are on the prowl. They are also said to target those leaving jewellery showrooms after making a purchase.\n\nThese gangs, mainly consisting of women, are said to be active during festive seasons when people are likely to withdraw substantial amounts of cash.\n\nWith Pongal and the marriage season round the corner, the threat from these gangs assumes a sense of immediacy.\n\nNetwork of relatives\n\n“These gangs basically thrive on a huge network of relatives. All of them are natives of O.G. Kuppam in Andhra Pradesh. But many of them are also settled in areas such as Rajamangalam, Karimedu in Tiruvottiyur and Ramji Nagar in Tiruchi,” said Virugambakkam crime inspector A. Elangovan.\n\nMembers of these gangs travel to Hyderabad to get the itching powder which they call nasima in their language. “The powder is made out of the seeds of a plant which is called poonaikanjan in Tamil. The seeds are dried and then smashed to produce a golden-coloured powder. When the powder falls on the body, it causes itchiness, which gets aggravated when the victim begins scratching the spot,” said M. Ashok Kumar, grade 1 head constable at Virugambakkam police station.\n\n“One of the members throws the powder at the victim carrying cash or jewels. Once he starts scratching the spot, another member of the gang approaches him and offers water to wash himself. As the victim is no longer paying any attention to the bag, he is carrying, another gang member steals it and walks away,” added M. Rajmohan, grade 1 head constable attached to Vadapalani police station.\n\nAn alternative tactic used by them is to chew biscuits and spit it at the target. When the victim stops to wash it off, another gang member walks away with the bag.\n\nTrain children too\n\n“These are only a few of the tactics they employ. They keep improvising. They also train their children in these techniques,” said Ashok Kumar.\n\nThe police have formed special teams headed by assistant commissioner A. Subburayan, inspector Elangovan, Vadapalani inspector Kumaran and the two head constables Ashok Kumar and Rajmohan.\n\n“It is better to take another person along while going to withdraw money from a bank or jewels from a shop. In 2015 alone, we recovered 150 sovereigns from different members of these gangs,” added Elango.\n\nThe gangs target those leaving banks, and jewellery shops after a purchase", 
    "section": "national", 
    "title": "Attention diversion takes a scratchy turn", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}