{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Many flood victims yet to receive the money as their accounts are yet to be validated by the banks\n\nBanks were crowded after flood-affected people came in droves to collect the relief amount which was credited to their accounts on Wednesday. -Photo: S. R. Raghunathan\n\nMany banks on Wednesday saw large crowds of customers demanding to know their account balance as many of their neighbours and friends started getting the flood-relief money in their bank accounts from Tuesday.\n\n“The passbook update machine in my bank broke down after the floods and the ATM machines are not functioning, so I had to go to the teller to get the passbook updated to find out if the relief amount has been credited into my account. My neighbours have received Rs. 5,000 in their account,” said Kamakshi, a resident of Kannagi Nagar in Thoraipakkam in Kancheepuram district. Shekar, an autorickshaw driver, who is yet to receive the amount, said he could not check in any other ATM as he would be charged for it.\n\nMany beneficiaries were not aware that the amount has been credited into their account. Most of them did not have net banking facility and the only option was an SMS alert, which they did not get.\n\nChief Minister Jayalalithaa on Monday had as a token handed over the amount to five families at the Secretariat.\n\nThe State government had released flood relief amount of Rs. 700 crore for 14 lakh families. By January 11, the government would transfer funds to other residents as well.“Those who were enumerated in the beginning are getting their funds now. The data is still being entered into the system for many others. The accounts have to be validated by the bankers before the funds can be transferred,” explained a source in the revenue department. Over one lakh residents had either provided wrong numbers, misspelt names or had provided different names and numbers.\n\n“Banks have account numbers from 9 to 16 digits and even if one digit goes missing the money will not reach them. Text messages have been sent to these residents and if they reply with the correct details, the error can be rectified,” the source explained. Residents, who have been missed out in the enumeration are still submitting petitions in tahsildar offices. “Their details will be verified and then processed,” the source added.\n\nMany residentssaid despite having SMS alert facility for their accounts, they had not been getting regular alerts after the floods.\n\n“We did not get any text alert as is the case with any debit/credit transactions in our account. The government could perhaps consider texting residents about funds transfer since they have their mobile numbers,” said K. Easwaran, a resident of ICF. Sources in banks said high traffic could be the reason for SMSs not reaching residents.\n\nOver one lakh\n\nhave either provided wrong account numbers or misspelt names", 
    "section": "national", 
    "title": "Banks crowded as relief disbursal begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}