{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Bharathidasan University would open a Career and Counselling Cell as per the University Grants Commission’s 12th Plan guidelines, according to its Vice-Chancellor V.M. Muthukumar.\n\nThe cell would be inaugurated on January 9 and the inaugural would be marked by a job fair on the university’s Khajamalai campus in the city. Various companies, including Equitas Micro Finance Pvt. Ltd., L&T, TVS, Life Insurance Corporation of India, Kotak Bank, IDBI Federal Life Insurance, CBC Fashion, ABT Maruthi, Eureka Forbes, ICICI Academy for Skills, Waves, Purani Textiles, Neptune Impex, Alert Insurance, Triumph, G4S Secure Solutions, 108 Ambulance, Primus Consultancy Service, Shiva Automobiles, Divya Spinning Mills and Sudharsan HRD Services would be recruiting candidates for various positions such as finance executive, manufacturing agents, fashion designer, customer support executive, supervisor, salesperson and tele-caller.\n\nInterested passed-out candidates are requested to be present at the venue at 10 a.m. on January 9 along with six copies of their resume and passport size photographs. The candidates should be prepared for personal interviews.\n\nThe details of various positions and companies are available at http:// www.bdu.ac.in/ptc/ docs/ccc/ccc_job_fair_ notification.pdf\n\nThe Placement and Training Cell of the university would conduct an employability skills training programme on January 7 and 8 to improve the performance of the candidates in the interview process.\n\nThe training would include aptitude tests, psychometric tests, and sessions on interview etiquette. Interested candidates are requested to be present at the Bharathidasan University Technology Park seminar hall on Khajamalai campus at 10 a.m. on January 7, Dr. Muthukumar said in a release.", 
    "section": "national", 
    "title": "Bharathidasan varsity opens Career Counselling Cell", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}