{
    "author": [
        "R Sivaraman"
    ], 
    "text": "For estimating the availability of groundwater, surface water and formulation of a realistic plan for water resource development\n\nThe census is expected to create a clear picture of the number of minor irrigation schemes, and the irrigation potential created.— Photo: T. Singaravelou\n\nDrawing from the lessons learnt due to unprecedented rains and floods, the authorities have taken up the work of identifying minor irrigation schemes and waterbodies that are near-extinct.\n\nThe Public Works Department (PWD) is set to start a major exercise across the Union Territory (UT) to conduct a census to catalogue all minor irrigation schemes and waterbodies.\n\nAhead of the census, the PWD conducted workshop-cum-training for officers who would be out on the field shortly for the purpose. The officers were imparted training on how to enumerate and collect the data from villagers.\n\nB. Umapathy, scientist of Central Ground Board, said, “The census is conducted to get a clear picture of the minor irrigation schemes, including their number, the irrigation potential created and extent of utilisation, which is essential for estimating the availability of groundwater, surface water and formulation of a realistic plan for water resource development.”\n\nCentral scheme\n\nThe Centrally sponsored scheme, ‘Rationalisation of Minor irrigation Statistics (RMIS),’ was launched in 1987 with 100 per cent Central assistance to the States/Union Territories. The aim of RMIS is to build a comprehensive and reliable database in the minor irrigation sector for future planning. The major activity under the scheme is all-India census of minor irrigation schemes conducted once in five years in the States, covering all groundwater and surface water minor irrigation schemes.\n\nThe first census of minor irrigation schemes with reference year 1986-87 was conducted in the States/ UTs and the report was published in November 1993.\n\nThe second census with reference year 1993-94 was held in September 1994 and the report was published in March 2001. The information in respect of adoption of newly developed technology of water and energy conserving devices such as sprinkler and drip irrigation systems and use of non-conventional energy sources such as solar pumps and wind mills was collected in this round. For the first time, census data was computerised with the help of National Informatics Centre and the results were put on the Ministry website.\n\nThe third census with reference year 2000-2001 was conducted in 33 States/UTs and the report was released in November 2005. The fourth census was conducted with the reference year 2006-07. The data has been processed and is expected to be published soon. The data collected in the census is utilised for formulation of the proposals for the Five-Year Plans.\n\nThe census data is also utilised for estimation of groundwater resources by the Central Ground Water Board. In addition to this, Central Water Commission and various wings of the Ministry of Water Resources use the data extensively. The fifth census of minor irrigation schemes will be conducted with reference year 2013-14.\n\nSchedules\n\nAs per schedules drawn out for the UT, the enumerators will first collect information about total agricultural, irrigated area and the number of minor irrigation schemes and waterbodies in the village as a whole. In the second schedule, they will collect detailed data related to specific groundwater schemes — dug well, shallow tube well, medium tube well and deep tube well. In the third schedule, they will collect details on scheme design such as surface flow or surface lift irrigation.", 
    "section": "national", 
    "title": "Census of minor irrigation schemes, waterbodies on", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}