{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Officials assess extent of damage to crops in Ettayapuram taluk\n\nA three-member Central team, comprising Y.R. Meena, Additional Commissioner, Ministry of Agriculture; Sumit Goyal, Assistant Director, Ministry of Power, and V.C. Behra, Director, Ministry of Rural Development, inspected and ascertained the extent of damage caused in parts of Tuticorin district following heavy rains and floods in November.\n\nThe team inspected agricultural fields in Ettayapuram taluk and flood-hit residential areas in Tuticorin city. Baskar, a farmer of Ettayapuram, said that he could hardly realise a harvest of one quintal of green gram this year, against the normal yield of six quintals. Collector M. Ravikumar asked the farmer whether the crop was insured and said insurance benefits to the tune of Rs. 36 crore had been given to farmers this year. Assistant Director of AgricultureS. Mathiazhagan, said that the crop duration of pulses was 70 to 75 days and it required a rainfall of 300 to 350 mm. But it rained beyond the limit.\n\nWhen the team visited Kurinji Nagar in Tuticorin, where stagnant water is being drained into Buckle canal, the Collector said that a comprehensive plan was being worked out to avoid stagnation of rainwater.\n\nJothilingam, a resident of Rahmath Nagar, said that water stagnation had been causing difficulties for the last 46 days and residents, on their own, had dropped 3,000 sandbags in the pool to mitigate the problem.\n\nSelvaraj of Adiparaskathi Nagar complained that flooding of the area was caused by blocking of two drains.\n\nK. Krishnasamy, Puthiya Tamilagam president and Ottapidaram MLA, said that water stagnation was still prevalent in some more areas of Tuticorin, and wanted the team to inspect those areas as well.\n\nResidents Anthoniyarpuram sought immediate relaying of damaged roads in the area. They also observed a fast in support of this demand.\n\nEarlier, a meeting was convened at the Collectorate to apprise the team of the extent of damage caused in 10 panchayats and Tuticorin Corporation. The Collector informed the team that an estimated Rs.110.35 crore was required for temporary restoration and Rs.627.39 crore for permanent restoration.\n\nDirector of Municipal Administration G. Prakash, Tuticorin Sub-Collector S. Gopala Sundara Raj, Joint Director of Agriculture V. Jeyakumar, Superintendent of Police Ashwin M. Kotnis, Director, District Rural Development Agency, Pichai, Mayor A.P.R. Anthony Grace and Corporation Commissioner R. Poongodi Arumaikan and officials from various departments attended the meeting.", 
    "section": "national", 
    "title": "Central team visits flood-hit areas of Tuticorin", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}