{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Award-winning German film Victoria screened first\n\nWith the participation of over 800 delegates, the13th edition of the Chennai International Film Festival was inaugurated at the Woodlands theatre in Royapettah on Wednesday evening.\n\nPostponed due to the floods, the inauguration was a low-key affair despite the presence of a large number of film buffs and students.\n\n“After the floods hit us, we never thought that we could run this festival. We thought that the festival would have to be cancelled. But with the support of the government and film buffs, we have been able to conduct the festival. This year too we have a great line up of movies including 20 Oscar nominated films,” said E. Thangaraj, director of Chennai International Film Festival.\n\nThe inauguration had the participation of Nadigar Sangam office bearers including actor Karthi and other CIFF regulars including Suhasini Maniratnam who has been actively involved in the film festival over the last few years.\n\nThe chief guests included Tanu Rai, deputy director, Indian Panorma and Helmut Schippert, director of Goethe Institut.\n\nThe closing ceremony promises to be grander as organisers claim actor Rajinikanth has agreed to attend, provided his busy schedule allows it.\n\nThe first day had a lot for film buffs in the city. “There were three films which were well received. First one was the Turkish film, Eksik , which is about a victim of a certain political event in the country. The next one was Death of Fish , an Iranian film about the strange will of a woman. The film for the evening was an award-winning German film, Victoria ,” said E. Thangaraj, director of Chennai International Film Festival.\n\nVictoria was screened as the first big film to open this year’s festival.\n\nHelmut Schippert, director of Goethe Institut, introduced the movie to the packed cinema hall. Around 183 films from over 50 movies will be screened.", 
    "section": "national", 
    "title": "Chennai International Film Festival kicks off", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}