{
    "author": [], 
    "text": "Religion:\n\nPanchapadika: R. Manidravid, Sankara Gurukulam, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nMaha Periyava: Indra Soundara Rajan, Sankara Nethralaya, 41/18, College Rd., 4.30 p.m.\n\nMahabharatham: Keeranur Ramamoorthy, Sath Sangam Hall, Anna Salai, Pammal, 6.30 p.m.\n\nThiruppavai: N. Rajeswari, Bashyakara Adhi Chenna Kesava Perumal Temple, West Mambalam, 7 a.m.; Kidambi Narayanan, Narada Gana Sabha, T.T.K. Salai, Alwarpet, 7 a.m.; K. Venkatesan, Kanchi Shri Krishna College of Arts and Science, Kilambi, 1 p.m.; Devanathachariyar, E-55-B, 19th Cross St., Besant Nagar, 4 p.m.; T.N. Aravamudha Thathachariyar, Sri Desika Dharsana Sabha, Pandiyan St., Taramani, 4 p.m.; V. Ramamoorthy, 35, Dr. Azhagappa Rd., Purasawalkam, 6 p.m.; Ram Mohandoss, Sri Prasanna Venkatesa Perumal Temple, Sathanipettai, Guindy, 6 p.m.; Kalian Sampath, Sri Kasi Viswanathar Temple, Krishnapuram, Ambattur, 6-15 p.m.; J. Chinnathambu, Siva Vishnu Temple, Periyar Nagar, 6-30 p.m.; Venu Raza Narayanan, Sri Rama Kulasekara Azhwar Temple, Edward Park St., Kosapet, 6-30 p.m.; T.A. Srinidhi Swami, Narayaniammal Kalyana Mandapam, Mandaveli, 6-45 p.m.; D. Srivallaban, 1, Sriram Nagar 1st St., Selaiyur, 7 p.m.; P.T. Seshadri, Damodara Perumal Temple, Villivakkam, 7 p.m.;\n\nVishnu Sahasranamam: Velukudi Krishnan, Sri Lakshmi Narasimhar Temple, MMTC Colony, Nanganallur, 6.30 p.m.\n\nSri Bhaktha Anjaneyar Cultural, Charitable and Spiritual Association: Nama Sankeerthana Bhajans, Sri Bhaktha Anjaneyar Temple, 4th Cross St., AGS Colony, Kottivakkam, 6.45 p.m.\n\nSulabasutras: Sundararama Vajapeyayaji, The Kuppuswami Sastri Research Institute, No 84, Thiru Vi Ka Road, Mylapore, 10 a.m.\n\nPanchadasi: Satyavratananda Saraswati, Mylapore Club, 39, Luz Church Road, Mylapore, 11 a.m.\n\nGeneral:\n\nSundaram Finance’s Mylapore Festival: Mikeless kutchery, Nageswara Rao Park, 7 a.m.\n\nWomen's Christian College: Conference on viable synergies in mathematics and natural sciences, College Road, Nungambakkam, 9.30 a.m\n\nThe Chartered Accountants Study Circle: Lecture, Prince Arcade, Cathedral Road, 6.30 p.m.\n\nPeriyar Library Reader's Circle: Meeting, Periyar Thidal, Vepery, 6.30 p.m.\n\nNarcotics Anonymous: Meeting, Keep It Simple Group, St. Joseph High School, Vepery High Rd., Vepery, 7 p.m.\n\nAl-Anon: Meetings, Divine School, Perumal Koil St., Pudur; CSI Inbarasu Aalayam, Tollgate; Puthiya Shakthi Group, Ezhil Nagar 3rd St., Kodungaiyur; Santhome Boys HSS., Santhome; and Philomina MHSS., Injambakkam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Church of Christ, Anna Nagar; Chennai School, Arunachalam St., Chintadripet; Victory Child Development Centre, Muthalamman Koil St., Selaiyur; Church of Victorious Cross, Jawaharlal Nehru Salai, Ashok Nagar; St. Joseph Church, Cholapuram Rd., Ambattur; St. Sebastian Church, Madhavaram; Ganapathy Sachidananda Ashram Hospital, Velachery; C.S.I. Church, Thiruvottiyur; and Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}