{
    "author": [
        "L Renganathan"
    ], 
    "text": "A Dalit was laid to rest on Wednesday after two communities fought over the funeral path for four days at Thirunal Kondachery.\n\nOfficials from the departments of police, revenue and rural development held talks with both groups.\n\nWhen a group tried to take the body through Vazhuvoor, the police lathi-charged them.\n\nLater, they went in a different route to the graveyard.\n\nA total of 75 persons have been picked up.\n\nSellamuthu (85) of Vazhuvoor died on Sunday of senility related complications. His family wanted to take his body for funeral through a circuitous 6.5 km route passing via neighbourhoods populated by the dominant community people.\n\nThis was objected to by the caste Hindus leading to tension.\n\nSubsequently, action on a petition, the Madras High Court had directed the district administration to ensure that his funeral was not disrupted.\n\nThere is a long history of tumult due to caste conflict in the villages as the upper caste people did not allow Dalits to carry holy water from the common pond for temple rituals.\n\nOver the past one year, the issue gathered a lot of noise and dust besides embroiling the villagers in a legal tussle. Death of Sellamuthu’s wife Kunjammal (80) last November raked up the caste issue but the funeral was undertaken swiftly after a promise from the administration to lay the road.\n\nBut the issue took a serious turn now as both sides had adopted an adamant stance, said a villager tracing the history of the tangle.\n\nInquiries reveal that during Kunjammal’s death, there was no proper path from Thirunal Kondachery to the Kadalaazhi riverside graveyard and villagers wanted to use the common path through Vazhuvoor that was opposed by the villagers there.\n\nOfficials engaged both groups and promised to lay a proper path but it was not kept.\n\nUnder a direction from the Madras High Court, the district administration made arrangements to conduct the funeral through a makeshift path but that was stalled at the last minute by the oppressed community.\n\nWhen officials tried to remove the corpse on Tuesday, some relatives of Sellamuthu doused themselves with kerosene and threatened immolation forcing the officials to back off.\n\nNagapattinam Collector S. Palanisamy told The Hindu on Wednesday that the administration had made arrangements to clear the path and lay a new road and construct a culvert across a channel for the Thirunal Kondachery people to go to the graveyard.\n\nDeputy Inspector General of Police, Thanjavur Range, Senthil Kumar, SPs Abhinav Kumar (Nagapattinam) and Jeyachandran (Tiruvarur) have been camping in the region with a strong police contingent to prevent any untoward incident.", 
    "section": "national", 
    "title": "Dalit laid to rest after four days", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}