{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District Judge R. Poornima on Wednesday adjourned the temple pujari suicide case till January 19 on Wednesday as the petitioner’s lawyer informed the court that the petitioner had filed an affidavit in the High Court seeking an advocate instead of public prosecutor to argue the case.\n\nThe court was expected to examine witnesses in the morning. Ten out of the 19 witnesses appeared before the court. O. Raja, brother of Finance Minister O. Paneerselvam, and other accused too appeared before the court. But the petitioner, Subburaj, father of the deceased, did not appear.\n\nThe petitioner’s advocate told the court that the petitioner feared that the public prosecutor appointed by the government would support only All India Anna Dravida Munnetra Kazhagam functionaries. The petitioner had already submitted a petition to Collector T.N. Hariharan demanding change of the public prosecutor. Since his request was turned down, he filed an affidavit in the High Court in this connection, the advocate added.\n\nDefence counsel Kannappan said that the petitioner neither appeared before the court nor produced any court order to stay the proceedings.\n\nThe petitioner, who demanded speedy trial, was now dragging the case.\n\nHe could have applied for change of prosecutor while seeking High Court direction for change of the court for impartial hearing, Mr. Kannappan said, and sought issue of a warrant against the petitioner to make him appear before the court.\n\nThe judge advised the petitioner’s advocate to produce the High Court order in this connection during the next hearing, and adjourned the case.\n\nShe also ordered the defence counsel to give a reply to the petitioner’s plea. The petitioner was advised to appear before the court during the next hearing.\n\nCharges in the case were framed against Mr. Raja and the others on December 15. Theni District Court had transferred the case to Dindigul District Court on November 25 on the direction of the Madurai Bench of the Madras High Court.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam, by hanging on December 8, 2012, after he was allegedly subjected to harassment.\n\nO. Raja, brother of Finance Minister O. Paneerselvam, and other accused appeared before the court", 
    "section": "national", 
    "title": "Dalit temple pujari suicide case adjourned", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}