{
    "author": [
        "A D Balasubramaniyan"
    ], 
    "text": "Two groups of differently-abled persons stage a sit-inin the Tiruvannamalai collectorate on Tuesday.- Photo: C. Venkatachalapathy\n\nDifferently-abled persons staged a sit-in in the Tiruvannamalai district collectorate complex on Tuesday.\n\nThe Tiruvannamalai District Differently abled Federation sat in protest in front of the Collectorate main building. The Federation had demanded the suspension of the District Differently Abled Welfare Officer Balaji on Monday, for not distributing aid to the disabled properly. The sit-in continued on Tuesday too.\n\nWaiting agitation\n\nSimilarly,, another group, the district unit of the Tamil Nadu Association for the Rights of All Types of Differently Abled and Caregivers (TARATDAC) also began a protest in front of the Collectorate on Tuesday.\n\nCalling the protest as a ‘Waiting agitaion’ they insisted on a three-point demand which they had already notified.\n\nDemands\n\nTheir demands included, resuming monthly cash assistance to disabled persons to whom the assistance was stopped this year; Wanted monthly special grievance redressal meet to be held for the differently abled at the Revenue Divisional Offices in Tiruvannamalai and Cheyyar and offering seating arrangements and drinking water facility in differently abled welfare office.\n\nThough the Additional SP Rangarajan offered to facilitate a meeting with the collector to fulfil these demands, the TARATDAC District President C. Ramesh Babu rejected it.\n\nHe was very particular that the collector should come to the venue of the protest, give assurances in writing and also conduct a press meet in their presence. Hence the stalemate continued till late in the evening.\n\nOne of the groups called their protest as a waiting agitation and had a three-point demand", 
    "section": "national", 
    "title": "Differently-abled groups stage protest in collectorate", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}