{
    "author": [
        "P V"
    ], 
    "text": "harmapuri district has witnessed a reckonable drop in the number of road fatalities in 2015. The number of accidents had fallen by 30 per cent in relation to 2014, bringing the fall in absolute numbers by 80 lives.\n\nIn 2015, under the fatal accidents category, the number of casualties was 297 and the number of cases registered was 272. Under the non-fatal accidents category, the number of injured was 1,974; and the number of cases registered was 1,291.\n\nAccording to the Superintendent of Police J. Loganathan, this drop in casualties substantiates that strict enforcement and booking of motor petty cases was a deterrent against violations. “We found that the monthly average deaths were around 15 to 20, when the helmet norm was not enforced. From June onwards, an average of 7,000 cases were booked per month for helmet norm violation.”\n\nAn analysis of a five-year data from 2011 on fatal and non-fatal accidents shared by the district police with The Hindu , show that a series of measures have led to this positive drop.\n\nThe data was analysed under three heads: the roads where accidents took place; the vehicles that were often caught in or cause accidents; time of the day, when accidents occur predominantly; and the age group of the victims.\n\nAccording to the data from 2012 to 2015, the number of fatalities and non-fatal accidents alternated largely between the State Highways and the district roads. This is contrary to the perception that accidents largely occur on the NH.\n\nThe number of fatal accidents on the State highways was 119 in 2015, and 118 in 2014; followed by district roads that witnessed 75 fatal accidents in 2015 and 153 fatal accidents in 2014. The number of fatalities on national highways was 72 and 73 in 2015 and 2014 respectively.\n\nSimilarly, the State Highways witnessed a whopping 590 non-fatal accidents in 2015 and 478 non-fatal accidents in 2014.\n\n“It is just about 8 km of NH running through the district. We found that the district roads were the sites of accidents and hence took up extensive monitoring of the district roads.”\n\nDrawing from the five-year data that showed that accidents occurred largely between 3 p.m. and 9 p.m, the district police conducted checks during this time of the evening, says Mr. Loganathan.\n\nAccording to the data, a large number of accidents are caused primarily by motorcycles followed by mass rapid transport vehicles (buses).\n\nThe victims were also found to be in the productive age group of 21 and 50 years of age.\n\nA total of 47,631 Motor Vehicle Petty cases were registered in 2014 in the district.\n\nThe number of cases registered more than doubled with over 1,06,310 cases registered in 2015.\n\nIn 2014, 10,494 cases were registered for helmet violations; in 2015, the number of cases registered was 52,571.\n\nIf the figures were an indicator, it could well be that sustained vigilance on district roads; enforcement of helmet norm; and punitive action against road violations may have cumulatively contributed to bringing down on mindless deaths.", 
    "section": "national", 
    "title": "Drop in number of accidents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}