{
    "author": [
        "Deepa H Ramakrishnan"
    ], 
    "text": "The Election Commission (EC) is gearing up to monitor the social media expenditure of political parties and candidates in the State.\n\nAs the parties firm up alliances, their IT wings too are getting active with campaigns on websites, WhatsApp, Facebook and YouTube, the EC has procured a software tool to monitor the internet.\n\nPreventing objectionable matter\n\n“We are testing it now and putting systems in place so that monitoring could begin once the model code of conduct comes into force.\n\nThe software tool will scan the internet for poll-related advertisements and we can check whether the ads are paid or free. We can also examine the content to ensure nothing objectionable is propagated. This would help the EC to keep a tab on expenditure details submitted by candidates and parties,” Chief Electoral Officer Rajesh Lakhoni told The Hindu .\n\nThe EC would also get advertisement tariff from ad agencies to cross check the information provided by the candidates and parties. A social media consultant is also being drafted to assist the EC, Mr. Lakhoni added.\n\n“The expenses would be noted in the shadow expenditure register. The consultant would also assist the EC to reach out to the voters through social media,” he said.\n\nThe Twitter handle of the CEO, @TNelectionsCEO, has become active once again and has been offering advice on various issues, including how to make corrections on voter ID cards and how to replace ID cards lost in the recent floods.\n\nOnline political advertisements have to be certified by the poll body. The EC had issued guidelines on social media in October 2013 and the expenses are to be submitted to the Commission post-elections.\n\nCommission procures software tool to monitor the internet for poll-related ads.", 
    "section": "national", 
    "title": "EC to monitor social media expenditure", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}