{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stating that DMDK MLA Alagapuram R. Mohanraj had allegedly forged documents and converted a part of Ismail Khan Lake as patta land in his name, the members of Tamil Nadu People Rights Movement on Wednesday staged a protest demanding retrieval of the lake.\n\nAs many as 20 protestors led by the Movement’s State president Poomozhi took part in the protest and raised slogans.\n\nMr. Poomozhi said that the 24-acre lake is located in Reddiyur Village in Survey No. 39-1/2, 3 in the city. Revenue documents in ‘A’ Register, Lake Map and documents received under Right to Information Act dated 23, August 2011 showed that the lake belongs to the government. But the Corporation’s Town Survey Register Ward C, Block 4 shows that 6.89 acre land in the survey number belongs to the MLA.\n\nEncumbrance Certificates (EC) taken for 70 years revealed that no documents were registered in any individual’s name for the survey numbers between 1942 and 1986. However, the lake was registered in the names of many individuals 1987 to 2011. The MLA along with three others purchased the land in 1989 and over the years, many have sold their land to him, he added.\n\nMr. Poomozhi said that with the help of government officials, the MLA had allegedly forged documents and converted the lake as patta land in his name. He demanded action against the MLA and the officials and retrieval of the lake.\n\nRevenue Divisional Officer C. Vijay Babu and Assistant Commissioner of Police, Law and Order (West Range), P.V. Vijeya Karthick held talks with them. The RDO asked the PWD officials to survey the lake and fix the boundary and check for encroachments and submit a report. He assured that necessary action would be taken to remove the encroachments if found. Later, the members withdrew their protest. The MLA was not available for comments. However, sources close to him said that he possesses patta for the land and there was no encroachment.", 
    "section": "national", 
    "title": "Encroachment of lake by DMDK MLA alleged", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}