{
    "author": [
        "Staff Reporter"
    ], 
    "text": "She was leading protest against attack on BJP member Sivaprakasam\n\nBJP state president Tamilisai Soundararajan leads a protest condemning the attack on the party functionary Sivaprakasam in Vaniyambadi on Wednesday.- Photo: C. Venkatachalapathy\n\nCondemning the delay in nabbing the attackers of the party’s functionary Sivaprakasam, Bharatiya Janata Party’s State president Tamilisai Soundararajan demanded constituting a special police team to trace the culprits immediately.\n\n“Even five days after the attack, the police have not made any arrests in the case or picked up any suspects. There is a general feeling among party persons that the police officers are functioning in a biased manner. Hence, a special team should be formed to trace the culprits,” she said. She was leading the party’s protest against the attack on Wednesday.\n\nOn January 1, Sivaprakasam (60), BJP’s State council member and State vice president of Endowment Cell was attacked by unidentified men when he had stepped out of a temple in Vaniyambadi town at nearly 7 a.m. The men had assaulted Sivaprakasam using iron rods, leaving him with head injuries.\n\nMs. Soundararajan questioned the reason behind alleged police inaction.\n\n“Such attacks are occurring again in Ambur and Vellore. These places are not only turning unsafe for the BJP but also for the police personnel there,” she said in reference to the Ambur riot last year that left several police men injured.\n\nReferring to the crude bomb explosion near Meenakshi Temple, Madurai, she asked if there were “terrorist activities” in the State.\n\nWhen asked if the ban on jallikattu will be lifted, she said, “BJP has been taking genuine and consistent efforts for the conduct of jallikattu this season.”\n\nShe said the Congress government could have brought a permanent solution to facilitate conduct of jallikattu if they had taken appropriate measures.", 
    "section": "national", 
    "title": "Form team to nab attackers: Tamilisai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}