{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stress is a silent killer among correctional officers and detention officers and contributes to physical and psychological changes, says expert\n\nPrison officers attending a training programme on life-style management at the Academy of Prisons and Correctional Administration in Vellore on Wednesday—Photo: C. Venkatachalapathy\n\nFor prison officers, work within the four walls of a jail leaves them highly stressed. The stress levels go on to impact their health condition too.\n\nTo help these officers cope with workplace stress and manage their lives in a better way, the Academy of Prisons and Correctional Administration (APCA), Vellore, in collaboration with the Department of Business Administration, Auxilium College, launched a training programme on lifestyle management for prison officers.\n\nOn Wednesday, the first batch of 20 participants, including four women officers, took part in the three-day training programme. The officers were from the rank of Central prison superintendents, deputy superintendents, assistant superintendents, joint superintendents, jailors, deputy jailors and assistant jailors from Andhra Pradesh, Karnataka, Kerala, Telangana and Tamil Nadu.\n\n“Whether it is acknowledged to be factual or not, stress is a silent killer among correctional officers and detention officers. The stress contributes to physical and psychological changes in their body and mind that lead to high blood pressure, depression, anxiety, diabetes, heart attack and stokes,” A. Badarudeen, deputy director of APCA, said.\n\nHe added that they witnessed mental and emotional trauma on the job and rarely realised the impact of such events until it was too late. “Those working in correction live between two worlds — prison life and life over the wall. The question is — how they balance these lives?” he said. And this is where the course on lifestyle management will help.\n\n“This course has been designed exclusively for prison officers. It will cover health management, personality development, stress and time management, relationship skills, parenting skills and media management,” said Beulah Suresh, assistant professor and head, Department of Business Administration, Auxilium College.\n\nMs. Suresh, who did her Ph.D. thesis on Occupational Stress of Prison Officers, said that prison officers were always occupied with thoughts about their job, and did not spend time with family, nor thought about themselves. “They deal with hard-core criminals on a day-to-day basis, and this creates a sense of constant fear and pressure,” she pointed out.\n\nIn fact, the job of prison officers has been ranked fifth among the most stressful occupations, she said, adding,\n\nThe course, according to her, will help them manage life and their job better, enabling them to enjoy life while doing their work.\n\nMr. Badarudeen said that the course would be conducted on a regular basis for prison officers, and would also be included in the routine training programmes.\n\nSr. Mary Josephine Rani, Vice-Principal of Auxilium College, inaugurated the training programme.", 
    "section": "national", 
    "title": "Helping prison officers manage workplace stress", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}