{
    "author": [
        "R Rajaram"
    ], 
    "text": "It will house 1,000 ancient idols\n\nWith the construction of the Icon Centre at Perambalur town having been completed, antique idols kept in temples in the district with inadequate safety measures would soon be housed in the centre.\n\nBuilt with funds generated from different temples coming under the Hindu Religious Charitable and Endowments Department (HR&CE), the Icon Centre will provide a safe shelter to nearly 1,000 ancient idols.\n\nEquipped with requisite security and safety measures, including burglar alarm, the Icon Centre has been built at a cost of Rs. 94 lakh on a nearly two-acre site in Perambalur.\n\nThe centre will house idols belonging to temples spread across the district. Official sources told The Hindu that the construction of the Icon Centre had been completed with excess funds from major temples under the control of the HR & CE department.\n\nObjective\n\nThe objective of setting up the Icon Centre is to protect the ancient idols kept in temples with scarce security and safety measures across the district, a senior official said and added that the facility would be opened soon.\n\nThe Icon Centre would be provided with Closed Circuit Television facility as an added security measure as a monitoring mechanism to protect the icons of different sizes kept inside the facility.\n\nThe focus would be on shifting the prized idols of ancient times kept in temples with inadequate safety measures and situated in desolate places in the rural areas to the Icon Centre, the official said. The Perambalur district alone accounts for over 250 temples.\n\nA similar Icon centre coming up at neighbouring Ariyalur is on the verge of completion, say the sources and added that the need for establishing such safe shelters was prompted by theft of idols from various temples in the State.", 
    "section": "national", 
    "title": "Icon centre in Perambalur getting ready", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}