{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Cash and valuables recovered by police in the course of investigation need not be necessarily handed over to their owners pending trial since criminal courts only decide on granting interim custody to a person who lays a better claim of possession over the properties and it is up to civil courts to decide on lawful ownership after conclusion of criminal trial, the Madras High Court Bench here has said.\n\nJustice M. Venugopal made the observations while dismissing a revision petition filed by an accused seeking custody of Rs. 1 lakh and 124 grams of gold jewellery seized from him by T. Kallupatti police near here in connection with a criminal case booked against him on a charge of marrying several women claiming to be an Intelligence Bureau official.\n\nThe petitioner, Thiruvarulrajan, assailed an order of a Judicial Magistrate in Peraiyur who had handed over the cash and the jewels to the mother of a woman whom the petitioner had married last since the aged widow had produced her bank pass book and the bills to prove that the money and jewels were given in dowry.\n\nHolding that the Magistrate had rightly handed over interim custody of the cash and jewels to the widow, Justice Venugopal said: “While considering interim custody of properties, the aspect of possession and right of possession alone will be considered by the criminal courts in an ordinary manner. The ownership and title issues are purely in the realm of an appropriate civil court’s decision.”\n\nNo documentary proof\n\nHe added that the petitioner had not produced any convincing materials or documentary proof to establish his superior right over the jewels and cash and therefore the Magistrate had rightly granted interim custody to the widow on condition that she should execute a bond for Rs. 5 lakh along with two sureties, besides undertaking to produce the properties in court whenever necessary.", 
    "section": "national", 
    "title": "“Interim custody of seized property does not confer ownership”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}