{
    "author": [
        "S Poorvaja"
    ], 
    "text": "129 start-ups have registered for placements at the Institute this year\n\nYoung engineers and graduates writing a test during a campus placement programme held at Indian Institute of Technology, Madras (IIT-M) in Chennai on Wednesday —Photo: M. Moorthy\n\nThe second phase of placements began for students of the Indian Institute of Technology-Madras (IIT-M) on Wednesday.\n\nThe first phase of placements was conducted on December 1.\n\nThe forenoon placements session, which began at 7 a.m. saw 15 companies conduct tests and interviews. Among them were Airbus, Flipkart, Xiaomi, Code Nation and Credit Suisse.\n\nFollowing the forenoon session, Babu Viswanathan, Placement Advisor, IIT-M, said that 66 students had received offers and they had expected around four more offers to come in by the night.\n\n“We had hoped that the recruiters make at least 70 offers and are extremely happy with the result since there were a few concerns running about the fact that most of the other IITs were finished with their placements,” he said.\n\n“The fact that start-ups, including Swiggy, UrbanLadder and Clean Max Solar, have come today to recruit has given many of us, who want to be a part of something that is growing, a great opportunity,” a student said.\n\n1,350 candidates\n\nWhile 56 start-ups had registered the previous year, 129 start-ups have registered for placements at the IIT this year and are offering 198 profiles.\n\nNames in the afternoon session of placements included start-ups UrbanLadder and Swiggy as well as companies such as Sandisk India Device Design and ICICI, among others; and the session had been scheduled to go on till 12.30 a.m. on Thursday.\n\nMr. Viswanathan also said that the IITs would refrain from revealing the highest pay packages this year onwards.\n\n“With students already under a lot of pressure, we did not want to add to it. With around 1,350 students having registered for placements this year, our primary concern is to ensure that they are all placed,” he said.", 
    "section": "national", 
    "title": "It rains start-ups at IIT-M", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}