{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Announces toll-free, mobile number and Skype ID for the service\n\nThe Jipmer has launched a toll-free number for emergency services.\n\nThe line 1800-425-6565 is aimed at as an improvement to the ‘Dial-Jipmer’ telemedicine emergency service for tele-consultations which had been launched in November by Jipmer Director Dr. S.C. Parija.\n\nFurther, a mobile number 9787757279 and three landline numbers (0413-2271301/2271302/2271303) are launched for public to utilise this service effectively.\n\nA team of senior and junior doctor would be given a Smartphone to attend to any call from a patient requiring emergency consultation.\n\nThe doctor on duty will guide the patient telephonically for immediate first aid possible to relieve the distress of the patient. If patient’s distress is relieved, then the patient may be asked to come the following day in the concerned outpatient department as advised by the casualty doctor.\n\nIn case of no relief, the patient will be asked to come to the casualty of Jipmer at the earliest, where the duty doctor would guide the patient on the mode of transportation, where to report in the casualty of Jipmer, the formalities to be completed and whether old records to be brought or not. In case of distance being very far from Jipmer casualty then casualty doctor may guide patient to another hospital closest to the patient.\n\nSkype call\n\nPatients with an internet connection on their handphone, tablet, laptop or desktop, can also talk to Jipmer casualty doctor on-duty over Skype. The Jipmer Skype ids are ‘Casualty Desktop Telemedicine JIPMER’ and ‘Casualty Mobile Telemedicine JIPMER’. Using this Skype service, patient can see the Jipmer doctor and talk to them. Patient can even show his/her injuries to the casualty doctor to get the advice. Jipmer strictly advices that general enquiry will not be entertained as this will be a hotline for emergency purposes only.\n\nAnnounces\n\ntoll-free, phone numbers\n\nand Skype ID\n\nfor the service", 
    "section": "national", 
    "title": "Jipmer creates hotlines for emergency services", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}