{
    "author": [
        "V S"
    ], 
    "text": "48-day camp is being held along the banks of river Bhavani in Thekkampatti\n\nOne of the temple elephants on its way to the camp site on Wednesday. — Photo: Special arrangement\n\nThirty elephants from various temples and mutts across the State and neighbouring Puducherry turned up on Wednesday evening at the site for the 48-day-long rejuvenation camp along the banks of river Bhavani in Thekkampatti near Mettuppalayam on Thursday morning.\n\nThe camp has been established at the foot hills of the Nilgiris alongside the river in a serene atmosphere, providing the jumbos a feel of their natural habitat. Eleven-year-old Prakruthi from the Thirunallaru Saneeswarar temple near Karaikkal was the first to turn up.\n\nThe elephants were off-loaded from the trucks at a make shift ramp between the camp site and Vanabadrakaliamman temple.\n\nThe temple staff led by Assistant Commissioner and Executive Officer K. Ramu and chief priest S. Parameswaran performed pujas for each elephant and welcomed them to the camp.\n\nThough the State expected 40-odd elephants, only 30 have turned up as of Wednesday evening and two more elephants from the Rameswaram temple and Srivilliputhur are expected to join the camp later after the festivals in both the temples get over. Mahouts and cavadis (elephant handlers) accompanied the jumbos on the truck.\n\nOn reaching the camp site they said that the elephants were normal and cheerful and there was no sign of fatigue or tiredness owing to a long distance travel and that too at a slow speed.\n\nThe camp site has been fortified. Private security guards and forest department staff patrol the five km long boundary to ward off wild elephants from getting into the camp site.\n\nThe camp begins on Thursday morning at 8 a.m. with a Ganapathy homam and special pujas. Sheds for kitchen to prepare food for elephants have been built. Showers for the jumbos are also ready.", 
    "section": "national", 
    "title": "Jumbo time: 30 elephants arrive at rejuvenation camp", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}