{
    "author": [
        "Annie Philip"
    ], 
    "text": "Ari Gautier weaves a story around her highlighting the hypocrisy of society\n\nPriests of Sri Manakula Vinayagar Temple performing pujas to Lakshmi, the temple elephant, ahead of her journey for the 48-day rejuvenation camp in Mettupalayam in Coimbatore district. (Right) Author Ari Gautier with his book Carnet secret de Lakshmi .— Photo:s T. Singaravelouand Speical Arrangement\n\nEvery resident here is familiar with this gentle creature, and almost every tourist takes time out to visit Puducherry’s most famous animal.\n\nNow, a new book narrates a fictionalised story of Lakshmi, the elephant at the Sri Manakula Vinayagar Temple, examining elements like caste, destiny and life choices.\n\nA French book Carnet secret de Lakshmi by Ari Gautier also aims to put Puducherry on the literary map, says the author.\n\n“For some unexplained reasons, there are very few fiction novels about Puducherry. The few books depicting this place are riddled with clichés and stereotypes. I believe it is time for Pondicherians to take our literary destiny in own hands,” says Mr. Gautier, who has spent his childhood here and studied at the Lycee Francais.\n\nBorn in Madagascar to a Pondicherian father and a Malagasy mother, the author has lived in France, and now stays in Oslo.\n\nUsing the power of fiction, Mr. Gautier attempts to highlight the hypocrisy of a society which venerates Lord Ganesha while it is insensitive to the plight of the elephant. So the author employs an invented caste system (much like the one in Indian society) for elephants.\n\nLakshmi belongs to the ‘Gajahramane’ caste which deems them to be temple elephants. The other castes in this complex system are the Gajatryas, the Gajasyas, the Gajasudras and the Gajavasis, says Mr. Gautier.\n\nWhile Lakshmi dreams of becoming a movie star or a polo player, fate brings her to Puducherry as a temple elephant. The adventures and whether she is able to break through the shackles of her destiny follow the rest of the plot. Giving Lakshmi company are a three-legged dog, Tripod Dog Baba, and a flying fish, Alphonse. While Baba is street smart and has outwitted others into believing he is a spiritual guru, Alphonse who was born in the Ariyankuppam river, is presented as a reincarnated soul of Siddha teacher.\n\n“Through Tripod Dog Baba, the reader can discover Puducherry and its history. In his own way, also tries to flee his destiny which was to be an insignificant dog among others,” says the author.\n\nHe adds, “Through Alphonse I wanted to write the stories of this beautiful city where 29 Siddhars walked and went into Jiva Samadhi and also wanted to give a mystical and spiritual aspect to the entire story.”\n\nIt is Alphonse who helps Lakshmi to understand the true meaning of life, says Mr. Gautier.\n\nThe story will help readers reflect about life choices and the role of destiny, says the author. “Is the Karmic notion which is deeply rooted in our society prejudicial? These are the questions Lakshmi is asking herself and to Tripod Dog Baba,” says Mr. Gautier.", 
    "section": "national", 
    "title": "Lakshmi, the protagonist of French fiction", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}