{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Finance Minister O. Paneerselvam distributing pamphlets to voters in Theni on Wednesday; (below) AIADMK men kick-starting their election campaign at Kumaran Thirunagar in Dindigul on Wednesday.— PHOTO: G. KARTHIKEYAN.\n\nFinance Minister O. Paneerselvam kick-started AIADMK’s election campaign by distributing pamphlets on the four-year “achievement” to the public here on Wednesday.\n\nThe Amma Peravai cadres and party booth agents would tour the entire district and campaign for the party’s victory, he said.\n\nHe flagged off a rally at Nehru statue junction and distributed pamphlets to vendors and passengers at Theni old bus stand and people in the nearby areas.\n\nPamba festival\n\nLater, Mr. Paneerselvam went to Sabarimala to take part in the Pampa Sangamam, an annual cultural festival, organised by the Travancore Devaswom Board (TDB) in association with the State government, on Wednesday evening as Sabarimala achieved the status of a national pilgrim centre.\n\nHR&CE Minister R. Kamaraj accompanied him. HR&CE Ministers of southern States were expected to take part in the festival. Sources said that Kerala planned to offer land to Tamil Nadu and other southern states for establishing their information centres in Sabarimala.\n\nThe Finance Minister will go to Sri Iyappan Temple in Sabarimala for a darshan on Thursday.\n\nDindigul\n\nAIADMK cadres and members of the Amma Peravai launched the election campaign at Kumaran Thirunagar in the town.\n\nEarlier, they took out a massive rally which started at Kumaran Thiru Nagar and ended at YMR Patty after passing through streets in these residential colonies.\n\nIn the absence of Minister for Power R. Viswanathan, his brother-in-law R.V.N. Kannan presided over the campaign in Dindigul.\n\nThe cadres undertook door-to-door campaign and distributed pamphlets to voters in these areas.\n\nThe cadres started the campaign at 7.40 a.m. in both the districts.", 
    "section": "national", 
    "title": "Paneerselvam kick-starts election campaign in Theni", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}