{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A passport mela will be organised by Regional Passport Office, Coimbatore, on January 9, at the Passport Seva Kendra on Avinashi Road.\n\nAccording to a release, applicants from Coimbatore, Salem, Erode, Namakkal, Tirupur and The Nilgris districts who have registered online at www.https://passportindia.gov.in and obtained a valid ARN, can approach the Kendra at the appointment time on January 9.\n\nFor those who prefer to submit applications at the venue, appointments will be available from January 7, at 1.30 p.m.\n\nApplications for the issue of ordinary international passport under normal course will be accepted and only applicants with appointments will be allowed.\n\nTatkaal, police clearance certificate and walk-in applications will not be accepted on the day.\n\nAward by Nehru\n\nYuva Kendra\n\nNehru Yuva Kendra has invited applications from registered youth and women’s clubs for the best club award for 2015-16.\n\nAccording to a release, youth and women’s clubs will have to apply with invitations, photographs, news clippings of their events and other documents for the award, which carries a cash prize of Rs. 25,000.\n\nThe release says that the clubs can collect the applications from the Nehru Yuva Kendra office and submit the filled-in applications by January 9, to the Youth Coordinator, Nehru Yuva Kendra, 45, First Floor, Murugan Nagar, Union Road, Kavundampalayam,\n\nFor more details dial 0422 2434097.\n\nSelected\n\nShima Sendhil, Director, Rathinam Educational Institutions, has been selected as one of the 100 women achievers under the ‘#100Women Initiative’ that the Union Ministry of Women and Child Development (MWCD), Government of India, and Facebook have launched.\n\nAccording to a release, the two have come together to launch the initiative to recognise and acknowledge women who are making a difference in their communities. The initiative selects the achievers through public nominations and voting through social media.\n\nMs. Sendhil has taken steps to provide scholarships to under privileged students and launched the ‘Green Kalam Project’ planting nearly 10,000 saplings around the Rathinam Campus.", 
    "section": "national", 
    "title": "Passport mela on January 9", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}