{
    "author": [
        "S Sundar"
    ], 
    "text": "“Irrigation, drinking water needs will be fulfilled with ease”\n\nIt is after 1992 that Vaigai credit of water from Vaigai dam is released for the third successive time in an irrigation season this year without any flood in Periyar-Vaigai Basin.\n\nPublic Works Department sources said that 4,000 mcft of water would have been released from Vaigai credit by January 13. The third phase of water release for the third reach (Ramanathapuram district) and second reach (Sivaganga district) began on Monday.\n\nThe PWD has proposed to release 1,350 mcft in 10 days. Significantly, all the 4,000 mcft of release would have taken place in little over a month’s time.\n\nAn official said that such a surplus release of water was happening after nearly two decades. Vaigai dam now has 3,554 mcft of Vaigai credit and 412 mcft of Periyar credit.\n\nAll the tanks in Madurai district had storage of around 70 to 100 per cent. “We have around 3,000 mcft of water in tanks alone. In fact, all the tanks in the city limits had good storage. Vandiyur tanks have been surplussing for the last couple of weeks,” the official added.\n\nThe storage in tanks in city had led to abrupt recharge of groundwater table.\n\nHe said that adequate storage would be ensured in Vaigai dam, including Vaigai credit, to take care of drinking water requirements of the southern districts till June 1. Similarly, he hoped that Theni, Dindigul, Madurai, Sivaganga and Ramanathapuram districts would get adequate water for irrigation too.\n\nWith Periyar dam still having 6,025 mcft of water, the officials were confident of a good harvest in Madurai and Theni districts this year. “A total of 9,000 mcft of Periyar credit water (including water in tanks) will definitely make irrigation easier,” he said.\n\nTurn system\n\nThe officials are waiting to implement turn system of irrigation for the standing paddy crop in single and double crop areas after the mandatory continuous supply of water for 45 days.\n\n“Once we ensure that the first round of water release reached all the areas, we will implement turn system so that water is used judiciously and irrigation is done with much ease during the final stage of farming,” he added.\n\nWater would be released for five days and stopped for five days.", 
    "section": "national", 
    "title": "Periyar-Vaigai basin has adequate water", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}