{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Volunteers are clearing Chennai beaches of garbage from the recent floods, ahead of the turtles’ nesting season\n\nEven as the time nears for Olive Ridley turtles to arrive in large number on the shores of Chennai to lay eggs, environmentalists and volunteers have been busy ridding the coastline of the garbage that got accumulated following the December floods.\n\nYoussef Labidi, coordinator of ‘Turtle Talks’, one of the organisations involved in clean-up activities for over a month now, said they found over six tonnes of garbage during clean-ups at the seashore near Pattinambakkam and Broken Bridge over the weekend. “The clean-up has to be done periodically and we will continue such weekend drives till the end of March, which is the end of the nesting season,” he said.\n\nStudent’s Sea Turtle Conservation Network (SSTCN), Chennai Trekking Club and many volunteers were also a part of the clean-up activity.\n\nStating that the amount of garbage on the shores this year had been massive compared to the previous years, Akila Balu, coordinator at SSTCN, said a bulk of it comprised thermacol, styrofoam cups and plastic waste.\n\n“If there is so much garbage on the sands, it will become impossible for the turtles to come and lay their eggs. Another issue we’ve been facing over the years are the bright lights along the beach, which might result in the baby turtles moving towards the source of illumination on the road. They become vulnerable to animal attacks and accidents,” she said.\n\nA Government Order, she said, had instructed that high mast lights be switched off during the Olive Ridley nesting season.\n\nOver the years, however, the number of volunteers, environmentalists, conversationalists and general public who have taken an interest in the protection of the species, which has been classified as ‘vulnerable’ by the International Union for Conservation of Nature and Natural Resources, has risen with a number of public walks and awareness drives.\n\nThe city in February is also set to host a ‘Ridley Run’, a marathon to propagate the importance of protecting the species.\n\nHelping volunteers\n\nKarunakaran, a fisherman and supervisor of a hatchery near the broken bridge said that many like him had taken a keen interest in the turtles and were coordinating with volunteers during the nesting time.\n\n“We try to minimise our visits into the sea in January and February and help volunteers who go on turtle walks in the night with the nests they find. Since these walks end at 3 a.m., we go and scour the beaches after that to see if any nests have been left with eggs and take them into the hatchery,” he said.", 
    "section": "national", 
    "title": "Preparing to welcome Olive Ridleys", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}