{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "M. Rajarajan, Principal of Cardamom Planters’ Association College, Bodinaickanur, was removed from Convenor's Committee (CC) of Madurai Kamaraj University (MKU) at the Syndicate meeting held in Chennai on Wednesday.\n\nWhile staff associations, mainly the Joint Action Council MKU (JAC-MKU), said that he had been removed following repeated allegations, Mr. Rajarajan claimed that his removal was just to reduce the strength of the CC to two, similar to other universities. Highly placed sources said that while reducing the strength of the CC was the cited reason, allegations against Mr. Rajarajan played a crucial role.\n\nThe MKU CC, in-charge of administration as the Vice-Chancellor post is presently vacant, had three members, apart from the Higher Education Secretary, Apoorva (convenor).\n\nSources said Ms. Apoorva, who chaired the Syndicate meeting, called for a vote through secret ballot by the 10 participants, excluding her, to choose two members to be retained in the CC. The CC members, including Mr. Rajarajan, who are part of the Syndicate as well, also took part in the vote.\n\nOf the 10, sources said that six votes were for M. Ramakrishnan and V. Venkatraman, the other two members of the CC.\n\nThe JAC-MKU had recently written to the Governor and Ms. Apoorva levelling allegations, including financial irregularities and misuse of power, against Mr. Rajarajan.\n\nFollowing the recent arson incident in the main guest house of the university, JAC-MKU had been demanding an impartial investigation. It had also said that P. Ananth Kumar, a JAC-MKU member, had been falsely implicated in the case as he was acting as a whistleblower.\n\nSpeaking to The Hindu , Mr. Rajarajan, however, said that his removal had nothing to do with allegations, which were “baseless.” “It was only to reduce the CC strength as stated in the meeting by the Secretary. It was done in a democratic manner and I have no regrets,” he said.", 
    "section": "national", 
    "title": "Rajarajan removed from MKU’s Convenor’s Committee", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}