{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Poor patronage for yatri nivas\n\nTourism infrastructure provided at Tholur village panchayat near Gangaikondacholapuram, 106 km from here, which is noted for the Chola temple dedicated to Sri Brahadeeswarar, has been largely in disuse for the past five years.\n\nConstructed at an estimate of Rs.50 lakh, the infrastructure, among other things, include five yatri nivas, a shopping complex of seven units and a restaurant.\n\nIt was declared open on February 4, 2010 at Tholur, about 200 metres on eastern side of the temple. Built on an area of two acres, it has adequate space for parking vehicles. A hoarding in front of the complex proclaims that the site is meant for use by devotees and tourists. The glass panes of a few windows are found broken and strewn in the area. A cross section of devotees and pilgrims point out that the infrastructure should be properly utilised. V. Murugan, secretary of the Melanikuli Agriculture Club, says that adequate publicity should be made about the availability of the cottage to the devotees and foreign tourists.\n\nAccording to official sources of Hindu Religious and Charitable Department, the cottage has one VIP suite and three ordinary suits.\n\nThe daily rent is Rs. 300 for the VIP suite and Rs. 200 for the other category.\n\nThe shopping complex together with the yatri nivas was located at a distance from the temple – one of the main reasons for the traders and visitors not utilising the facility. The infrastructure was provided at a distance from the Chola temple as the monument was protected by the Archaeological Survey of India banning any construction activity to a radius of about 100 metres in the periphery.\n\nThe source said that the yatri nivas was allotted to devotees on demand though the patronage was not up to the expected level. Further, four of the seven units at the shopping complex were now being used as a godown.\n\n“Private wholesale dealers have stocked their goods at this shopping complex,” the source added.", 
    "section": "national", 
    "title": "Shopping complex becomes a godown", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}