{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "Gayathri Venkatraghavan presenting a vocal concert at the 64th music and arts festival of Sri Sathguru Sangeetha Samajam in Madurai on Tuesday.— Photo: R. Ashok\n\nOn the second day of Sri Sathguru Sangeetha Samajam’s 64th anniversary celebrations on Tuesday, Gayathri Venkatraghavan propitiated the lotus feet of the Elephant God in a viruttam and then entreated rasikas in the verse of Sivan to worship “Shivalokanathanai” in Mayamalava Gowlai, which she elaborated with Kalpana swarams. “Guha Saravanabhava” in Simmendra Madyamam followed with the same energy.\n\nA slokam on Srimad Sundaranayaki was given to melody and devotion, as was “Akilandeswari” in Dwijavanthi by Dikshithar.\n\nThe concentration and creativity with which she presented Madhyamavathi for Thyagaraja’s “Ramakatha” won her a big round of applause.\n\nThe response of the violinist, R.K. Sriramkumar, to her singing was noteworthy. Neyveli R. Narayanan on the mrudangam and Krishnan on the ghatam performed with speed and variety during the thani, making the main song a great success.\n\nA pallavi penned by the violinist, “Swara sangeetha laya anandha,” in dedication to M.S. Subbulakshmi took centre stage following raga alapana and the singer presented several sangathis of the same in Purvikalyani.\n\nThe final pieces included “Srinivasa Thiruvengadamudayan,” “Nenjukku needhiyum” and “Evvul kindandhane” on the deity at Thiruvallur.\n\nThe visual enhancement of the stage with pictures of the three musical greats was appealing. Given the uplifting quality of Gayathri’s music, the celebration is bound to draw a younger crowd to listen to Carnatic music in the days to come.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Singer’s uplifting music bound to draw a younger crowd", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}