{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Civic body received over 100 complaints\n\nThe Corporation has started impounding stray cattle in Tirunelveli and Palayamkottai as cattle owners continue to allow their animals wander along the busy thoroughfares of the city.\n\nAfter the stray cattle that can be seen wandering along all busy roads of Tirunelveli and Palayamkottai to cause accidents involving two-wheelers, the Corporation received more than a hundred complaints urging the urban local body to impound these animals.\n\nSubsequently, Commissioner S. Sivasubramanian convened a meeting in which dairy farmers were urged to keep their animals in their backyard or keep their cows in the enclosures created by the Corporation if they did not have adequate space.\n\nWhen the Corporation’s efforts on curbing the stray cattle menace failed due to the non-cooperation of the owners, impounding of the domestic animals started on Tuesday and these animals were kept in an enclosure adjacent to the Palayamkottai zone office.\n\n“On the payment of Rs.7,500 towards fine, all impounded cattle were freed on Wednesday and our operation against the stray cattle will continue,” said an official from Palayamkottai Zone.\n\nMayor E. Bhuvaneshwari said the stray cattle, which would be taken to the designated enclosures in all four zones on being impounded, would be handed over to the owners only if they paid the fine of Rs. 500 per animal within three days.\n\n“The amount we collect from the owners is for feeding the animals while under the custody of the Corporation.\n\nIf the owners fail to take their animals back after paying the fine within three days, the impounded cattle would be sent to the authorized cow sheds without prior notification to the owners,” Ms. Bhuvaneshwari said, adding that the Corporation could not be held responsible for handing over the impounded cattle to the cow sheds after three days or for the sudden death of the animals while under the civic body’s custody.", 
    "section": "national", 
    "title": "Stray cattle being impounded in Nellai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}