{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Chennai International Film Festival opens with German movie Victoria\n\nHelmut Schippert, director of Goethe Institut, lighting a lamp at the inaugural ceremony of the 13th Chennai International Film Festival on Wednesday —Photo: K. Pichumani\n\nWith the confirmed participation of over 800 registered delegates, the thirteenth edition of the Chennai International Film Festival was inaugurated at Woodlands theatre in Royapettah on Wednesday evening.\n\nThe inauguration of the festival, which had been postponed due to the unprecedented floods, was a low-key affair. However, a large number of film buffs and students were present on the occasion.\n\n“After the floods, we never thought we could run this festival. But thankfully, with the support of the government and film buffs, we have been able to conduct the festival. This year too, we have a great line-up of movies, including 20 Oscar-nominated films,” said E. Thangaraj, director of Chennai International Film Festival.\n\nSupported by the Government of Tamil Nadu, the inauguration was attended by Nadigar Sangam office bearers, including actor Karthi and other CIFF regulars such as Suhasini Maniratnam who has been actively involved in the film festival over the last few years. The chief guests included Tanu Rai, deputy director, Indian Panorama and Helmut Schippert, director of Goethe Institut.\n\nThe closing ceremony promises to be grander as, according to the organisers, actor Rajinikanth has agreed to participate in the ceremony, provided his busy schedule allows it.\n\nThe first day offered a lot for film buffs in the city. “There were three films which were well-received – the Turkish film, Eksik , which is about the victim of a certain political event in the country; Death of Fish, an Iranian film about the strange will of a woman; and the German film, Victoria ,” said Mr. Thangaraj.\n\nAward-winning German film, Victoria , was screened as the first big film to open this year's festival. Mr. Schippert introduced the film to the packed cinema hall.\n\n“ Victoria is a film that has the distinction of winning several awards. The previous works of the film’s director, Sebastian Schippert weren’t received that well and the most interesting aspect of the film is that it was filmed in a single shot,” he said while introducing the film.\n\nAround 183 films from over 50 countries will be screened.\n\nThe festival also promises freewheeling discussions about films in general and select topics with prominent personalities from the film industry. These sessions will be moderated by Cinema Rendezvous, a well-known film club in the city.\n\nUnlike in the last few years, foreign filmmakers are unlikely to participate in the festival as it has been delayed. However, the Tamil film industry is expected to get involved in the festival in a big way.", 
    "section": "national", 
    "title": "Though low-key, film fete sees enthusiastic crowds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}