{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Central team makes second visit to assess damage owing to rains in December\n\nThe Central team members inspect the damaged bridge near Magaral on Wednesday.-Photo: D. Gopalakrishnan\n\nFor a fortnight now, fifty-two-year-old K. Selvam, a marginal farmer in Narayanapuram, a small village near Poondi, around 60 km north of Chennai, slowly began his paddy cultivation for this season after draining the floodwater from his farmland .\n\nHis five-hectare agricultural land was among the 31, 732 hectares of standing paddy in Tiruvallur district that was damaged by the rains on December 2 and 3 last year. In other words, Tiruvallur district lost more than two-thirds of its standing paddy on a total of 49, 619 hectares of paddy in December. In fact, rains on December 2 and 3 last year doubled the total damage in the district, including civic infrastructure from Rs. 800 crore to Rs. 1,805 crore.\n\n“Our paddy cultivation loss was high. We want the State government to provide more farm subsidies, including easy availability of seeds, fertilizers and electricity,” farmer Selvam told a visiting eight-member inter-ministerial Central team led by TVSN Prasad, Joint Secretary, Ministry of Home Affairs, on Wednesday.\n\nAccompanied by Tiruvallur Collector, K. Veera Raghava Rao, the team listened to affected farmers and families in areas, including Kattupakkam near Poonamallee, Kaduvetti and Senniekuppam near Thiruverukadu on its second survey since November last.\n\nThe second visit, Tiruvallur officials said, was mainly to access the damage incurred to the district on December 2 and 3. The team also inspected medical camps, temporary bridges and marooned areas near Poonamallee and Tiruvallur.\n\n“We saw the extensive damage to roads and buildings. We are satisfied with the relief work done by the State government. The Union government will help the State in this regard,” Mr. Prasad told The Hindu .\n\nStaff Reporter writes\n\nfrom Kancheepuram\n\nThe inter-ministerial team, headed by Union Joint Secretary (Home) T.V.S.N. Prasad, on Wednesday inspected the low-level bridge across the Cheyyar near Magaral in Kancheepuram district, which was damaged in the recent floods.\n\nTalking to reporters, he said the team had visited certain flood-affected spots in Tiruvallur and Kancheepuram districts on Wednesday.\n\n“The unexpected rain and flood have caused extensive damage to public facilities and led to loss of lives and cattle,” he said.\n\nCommending the State government for its pro-active efforts taken to minimise the loss of human lives and cattle, Mr. Prasad said the Centre would extend the best possible assistance based on the report filed by the team.\n\nStaff Reporter\n\nwrites from Puducherry\n\nA two-member team from the Centre on Wednesday visited rain-affected areas in Puducherry for assessment of the damage caused by the rains.\n\nThis is the second visit of the Central team after its earlier visit in December.\n\nThe team comprising of N.M. Krishnan Unni, Superintending Engineer, Ministry of Water Resources, and D.S. Arvind, Regional Director, Ministry of Road Transport, assessed the damage to crops at Olavaikal and listened to the grievances of farmers.\n\nStating that the compensation announced by the Puducherry government was inadequate, the farmers pointed out that they were carrying out farming operations under oral lease agreements.\n\nCollector D. Manikandan told the team that the government would take necessary steps to ensure distribution of relief to the affected farmers.\n\nThe team also visited Kommandamedu, a border village over the Pennaiyar and inspected the damage to the bed dam.\n\nThe team also examined a feeder canal in Manapet and the Chunnambar boat house and Paradise islet.", 
    "section": "national", 
    "title": "Tiruvallur lost over two-thirds of standing crop to floods", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}