{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam : Sri Hanuman Jayanthi, special homam and raghu-kethu peyarchi special homam, South Chithrai Street, Srirangam, 6 a.m.; discourse by Ganesh Kannan and keyboard recital by R. Akash-R.Prakash & party, 5 p.m.; music programme by Lalgudi Ramprasad, 7 p.m.\n\nSri Andavan Ashram, Srirangam : Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam : Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Kattazhagiasingar Sannidhi, Thiruvanaikovil, 6 p.m.\n\nSri Rama Nama Sath Sangam : Rama Nama parayanam, 28, Amman Street, Amman Nagar, 6 p.m.\n\nGovindammal Tamil Mandram : Rajaram speaks on Vinayagar Perumai, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nSeethalakshmi Ramaswami College : Graduation day, V.Irai Anbu, Principal Secretary/Commissioner, Economics and Statistics, delivers the graduation day address, 1.25 p.m.\n\nNational College Department of English : National conference on Translation vs New Writing and Discovery, G.Bhaskaran, Vice Chancellor, Tamil University, inaugurates, 9.30 a.m.\n\nSrimad Andavan Arts and Science College : State level seminar on International financial reporting standards and Indian accounting standards, Ammani V.Balaji, college correspondent, presides, 9.30 a.m.\n\nHoly Cross College Department of Rehabilitation Science : ‘Everybody counts,’ – sports, exhibition and screening camp for the differently abled, M.S. Nagarajan, chief guest, 9 a.m.\n\nJamal Institute of Management : Lecture on Career opportunities in the Middle East by Hanifa J.Alaudeen, Project Manager, Ascon Marble and Granite, 3 p.m.\n\nTamizhaga Vivasayigal Sangam : State executive meeting, Ravi Mini Hall, 11.30 a.m.\n\nUrumu Dhanalakshmi College Department of Tamil : Inauguration of branch of Tamil Marubu Arakkatalai, K. Subashini, Vice President, Tamil Marabu Arakkatalai, Germany, speaks, 3 p.m.\n\nAtlas Hospitals : Awareness rally on improving road safety, R.Jayanthi, Deputy Commissioner of Police (Crime and Traffic), chief guest, St.Joseph’s College, 10.30 a.m.\n\nSaranathan College of Engineering and Yokogawa India Ltd : Workshop on DCS and FF Overview, Udhayakumar and Ramkumar, resource persons, 9.30 a.m.\n\nM.A.M. College of Engineering : Faculty development programme on prefabricated structures, 9.30 a.m.\n\nBharath Heavy Electricals Limited: Southern region customer meet and workshop on boilers and auxiliaries, C.Radhakrishna, Director,Projects,Telangana State Power Generation Corporation Limited, chief guest, G.Sivaprakasam, Director (Generation), Tangedco, speaks, Welding Research Institute auditorium, 9.30 a.m.\n\nSt.Joseph’s College Department of Botany : International conference on Frontiers in Life Science, Sandy Loh Hwei San, professor, School of Bio Sciences, University of Nottingham, Malaysia, inaugurates, Rev.S.John Britto, Rector, presides, 9.30 a.m.; Department of Mathematics: National conference on Advancements in mathematical sciences, Rev.A.Albert Muthumalai, Rector, Sacred Heart College, inaugurates, 9 a.m.\n\nVoice Trust : Flagging of eco camp team to Pachamalai by N.Anandhi, Chief Educational Officer, CEO’s Office, 8 a.m.\n\nDept of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}