{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Cold air, viral infections, mould or fungus can all contribute to more wheezing and discomfort\n\nCold air, viral infections, mould or fungus can all contribute to more wheezing and discomfort.— File Photo\n\nWinter in Chennai may not be as cold as elsewhere, but for residents with asthma, it can be tiresome.\n\nThe cold air, viral infections going around and mould or fungus can all contribute to more wheezing and discomfort, say doctors.\n\nAsthma is a disease that inflames and narrows the airways — which means that the amount of air going in is reduced and the patient has a sensation of breathlessness. “It is an episodic disease,” says Prasanna Kumar Thomas, consultant pulmonologist at Fortis Malar Hospital.\n\n“This means there may not be symptoms every day. They are intermittent, and generally become worse in winter because of a rise in infections,” he says.\n\nDr. Kumar has seen around a 20 per cent rise in the number of cases, but most of these are patients who have stopped their medications.\n\n“Those who have continued with their medications are more comfortable this season. With asthma, it is important to remember that an absence of symptoms is not an absence of disease,” he says. The disease is still under-diagnosed, said Dr. Kumar.\n\n“In the long run, if asthma is not treated, the airflow becomes lower and lower, leading to very little air going in and out, which will severely compromise day-to-day life,” he says, adding that approximately 3 to 7 per cent of the people in Chennai may have asthma.\n\nR.P. Ilangho, senior consultant-respiratory physician, Apollo Hospitals, says the number of cases he sees goes up by between 30 and 50 per cent in the winter. “But more research is needed on this, since there are no current statistics on asthma’s rise in winter,” he said.\n\nPeak flow meters, inhalers and spacer devices are key to improving the quality of life for those with asthma, he says.\n\n“Peak flow meters are small devices that check how good your airways are — they are essential to people with asthma just as blood pressure (BP) monitors are to those with BP problems,” he said. Spacer devices are plastic chambers attached to inhalers that help the inhalant to be taken in properly and prevent side effects — very useful in children.\n\nResidents tend to close their windows because of the cold, and this could lead to mould and dampness — a trigger factor for asthma.\n\n“Cross-ventilation is very important,” said Somu Sivabalan, paediatric pulmonologist at Kanchi Kamakoti Childs Trust Hospital.\n\n“This season, people with asthma must try and dilute the load of irritants by making sure their immediate environment is clean and tidy, practising hand hygiene and eating healthy,” he said.\n\nStay healthy this winter\n\nEnsure your immediate environment has good cross ventilation\n\nKeep your home clean and tidy\n\nWash your hands frequently and eat healthy to stave off infections\n\nDo not stop your medications even if you have no symptoms without consulting a doctor\n\nIf you think you have asthma, see a doctor and get treated early", 
    "section": "national", 
    "title": "Uneasy time for asthmatics", 
    "subsection": "tamilnadu", 
    "date": "2016-01-07"
}