{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The work was taken up at an estimate of Rs.21.95 crore\n\nConstruction of box culverts, numbering 19, on a stretch of five km on the Vedaranyam – Velankanni segment has come as a great relief to the villagers particularly during the New Moon Day and the Full Moon Day every month when the backwater level rises in the area to some extent.\n\nAs per the announcement made by the Chief Minister Jayalalithaa on the floor of the Assembly under Rule 110, indicating the acute and felt need of the facility, the box culverts were constructed. In the absence of these culverts, the villages remained marooned during monsoon and it was a difficult task for officials to carry out rescue or relief operations. “A number of villages remained totally cut off during the monsoon and neither revenue nor fire service and rescue personnel could reach these villages till the backwater and storm water receded for about a fortnight or so during floods,” said an official of the Public Works Department.\n\nThe government sanctioned construction of 19 box culverts so that the backwater from the eastern side of the villages could pass through the western part of the village without causing any marooning or water-logging. The work was taken up at an estimate of Rs.21.95 crore and the box culverts were constructed in Thetthakudi North, Sembodai and Thetthakudi South villages – all spread over a distance of five km. Each box-culvert contained two vents. While 17 box culverts measured 2 metres by three metres, another box culvert measured two metres by two metres. The 17th box culvert measured three metres by three metres. The height of the box culvert is 1.5 metres.\n\n“During the incessant rain and floods during last November and December, the water level increased by at least one metre,” the official said adding that but for the timely construction of the box culverts, the situation would have got aggravated. Now, with the completion of the work, officials have started laying road. “Non-bitumen work has been completed and the work on bitumen layer would be completed in a month,” he said.", 
    "section": "national", 
    "title": "19 box culverts constructed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}