{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students participating in a job mela organised at VIT University in Vellore on Wednesday. —Photo: C. Venkatachalapathy\n\nA total of 866 candidates were selected for jobs at a Mega Job Mela organised by the Centre for Sustainable Rural Development and Research Studies, VIT University on Wednesday.\n\nS. Tamilmaran, project officer of the centre, said more than 6,000 students from various parts of the State, including Vellore, Tiruvannamalai, Kancheepuram and Tiruvallur, took part in the job mela.\n\n“Sixty five companies from manufacturing and service sectors participated in the mela. Till now, 866 candidates have been selected for jobs, while the remaining will be called for another set of interviews later,” he said.\n\nMeant for rural students, the job mela was being held for the second time. Last year, 1,400 candidates participated and 500 got jobs, he added.\n\nInaugurating the mela, VIT Chancellor G. Viswanathan said unemployment was a huge problem in developing countries, and it was high in India owing to more number of young persons.\n\n“In the country’s population of 125 crore persons, 66 per cent are below 35 years. Five per cent of the people are unemployed youth. This differs from State to State. For economic growth, the target should be growth with employment,” he said.\n\nHe added that the service sector was growing in the country. In developed nations, manufacturing sector is well developed, and this should be the same in India too. Hence, the ‘Make in India’ initiative was aimed at reducing imports and increasing employment opportunities in the country, he observed.\n\n“For this, we need investors, manpower and trained persons. Foreign companies fear to come to India due to procedural delays and corruption. In global rankings, India lags behind in the ‘ease of doing business’ and this should change,” Mr. Viswanathan insisted.\n\nHe also urged students to utilise opportunities to become entrepreneurs.", 
    "section": "national", 
    "title": "866 candidates get jobs at VIT University mela", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}