{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Last Friday, 20-year-old Supriya* collected 50 gundu mani seeds and swallowed them. The seeds, highly toxic, caused her to start bleeding and she was vomiting blood, she said, when her husband rushed her to hospital.\n\nOn Wednesday afternoon, Supriya was at the Rajiv Gandhi Government General Hospital’s poison control centre, hooked on to a blood bag and being treated for her severely inflamed colon. There is no specific antidote for gundu mani seeds, and so, she is being given supportive treatment until she recovers, said S. Raghunandan, head of the centre.\n\nThe poison control centre at RGGGH, is a one-of-a-kind facility in the government health system in the State. Set up nine years ago this month, the centre sees around 3,000 cases a year, ranging from snake bites and scorpion stings to ingestion of pesticides and poisonous leaves.\n\n“We are a tertiary care facility and so we focus on patient care, training and research,” said Dr. Raghunandan. A 20-bed ward, ventilators, a dialysis unit, a temporary pacemaker, an antidote bank, a lab and other specialised equipment; and a dedicated staff team make up the unit.\n\nAs a referral centre, the unit sees the direst of cases. Over the years, it has encountered all kinds of poisons — accidental ingestion form less than 10 per cent of the cases seen — most are animal bites or deliberate ingestion. “We still see ingestion of pesticide and oleander seeds reported from more rural areas, but in the cities, they are hair dyes, toilet cleaners, mosquito repellents, nail polish removers, rat killers, chemical cow dung powders and a lot of tablets,” he said. Tamil Nadu had the second-highest number of suicides in the country in 2014, at 16,122. Among major cities, Chennai topped the list at 2,124 suicides. Twenty-six per cent of the suicides in the country were by consuming poison, as per the National Crime Records Bureau.\n\nFor every suicide, said Lakshmi Vijayakumar, founder of Sneha suicide prevention centre, there are 10 to 15 suicide attempts. More young women than men attempt suicide, she said, at the ratio of 2:1. “Many a time, it’s a cry for attention. For a majority of people, it’s a very impulsive action,” she said.\n\nAt the ward, one couple was recovering from having swallowed mosquito repellents. While the husband was very ill, the wife was recovering, a doctor said. Antidotes are only available for about 40 per cent of toxins — for the rest, only symptomatic treatment can be given. The most important thing, said Dr. Raghunandan, was to ensure the patient was observed to find out what was happening. The centre has to work with other departments in the hospital too — including cardiology, nephrology and gastroenterology, as the poisons can affect body systems.\n\nOver the last six years or so, over 4,000 medical personnel have been trained in handling animal bites and poisons, in order to establish a uniform treatment protocol across the State, said Dr. Raghunandan.\n\nResearch too, is a focus area. One of the current projects is the long-term effects of snake venom toxicity on the kidney and other systems.\n\nSupriya hesitates when asked why she ingested the seeds. “Stomach pain,” she says, finally. Staff at the unit will find out why it happened and offer her counselling. They will also follow up on her once she’s back home.\n\nBesides the State helpline 104, suicide prevention helpline Sneha can be reached at 24640050/60.\n\n(* Names changed)", 
    "section": "national", 
    "title": "A centre of last resort for victims of poisoning", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}