{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The 108 ambulance service is in the dock after one of its drivers refused to take a victim of a hit-and-run case, near Seegehalli gate of Tavarekere, on the city’s outskirts, to the nearest hospital on Monday night. For nearly 45 minutes, the victim lay on the road in pain.\n\nThe victim Maruthi, (28), a construction labourer from Gangavathi, was crossing the road when an unidentified vehicle knocked him down at around 8.30 p.m. Passers-by rushed to his aid and one of them alerted the ambulance service before informing the police.\n\nThe ambulance reached the spot at around 8.42 p.m. Though Maruthi lay on the road writhing in pain, the ambulance refused to take him to the hospital. The staff claimed that the hospital would not admit anyone without an attendant.\n\nThe matter was resolved only when Tavarekere police reached the spot at around 9.15 p.m., and pulled up the staff and sent Constable Shivaraj in the ambulance with Maruthi to the hospital. Based on the police direction, the victim was rushed to a nearby private hospital and later referred to NIMHANS.\n\nObjecting strongly to the incident, the Tavarekere police said they would file a case against the ambulance staff and send a report to the authorities concerned. A case of hit-and-run has been registered and efforts are on to trace the vehicle.\n\nReacting to the incident, Syed Suhale Parveez, Senior Manager of GVK Emergency Management and Research Institute (GVK EMRI), said, “After we got a call at 8.42 p.m., we sent the nearest ambulance to the spot. There was some miscommunication between the ambulance driver and those attending to the patient. The attendant took the patient to a nearby hospital for first aid. Our driver waited for an hour till first aid was given and then took the patient to NIMHANS.”\n\nMr. Parveez added that he was unaware of the fact that a policeman had accompanied the patient to thehospital in the ambulance.\n\nThe driver agreed to transport the victim only after the police arrived on the spot", 
    "section": "national", 
    "title": "Ambulance staff refuse to transport accident victim", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}