{
    "author": [
        "Deepa H"
    ], 
    "text": "TU-40 variety not only resists yellow mosaic virus but gives more yield\n\nImpressed by the resistance of TU- 40 variety of black gram (urad dhal) more farmers want the seeds. The Agriculture department had procured variety of seeds from the Bhabha Atomic Research Centre, Trombay, that are resistant to the yellow mosaic virus (YMV) and had given it to a few farmers so that they can be sown and more seeds produced.\n\nFarmer G. Bhaskaran of Sozhampoondi village in Villupuram district, who got five kilos of the BARC variant, said that not even one plant got the bug that the crop is notorious for. “I had planted Vamban – 5 in the adjacent field and even though a few plants in that crop had been attacked by the virus, not even one in this BARC variety was infected. And the plus point was that I got more yield. From the Vamban variety I got 370 kg in 70 cents of land. I got the same quantity from TU- 40 sown in 50 cents,” he said.\n\nThough he and his neighbours were sceptical when they first sowed the seeds, they were doubly happy with the harvest. Now around 360 kilos of urad dhal have been given back to the department so that it can be used as seed. Around 18 hectares could be cultivated using this quantity, explained an official in the agriculture department.\n\nThe YMV is a huge problem when it comes to urad dhal and many times, even up to 50 per cent of the crop has been damaged. “The virus does not allow the pod to form. We can only prevent the spread of the bug but not repair damage it causes . This variety also seemed to be water resistant. The crop stood in water for over two weeks but managed to give such a good harvest,” said another farmer.\n\nThe seed had been earlier tried out in Tirunelveli district and there too the harvest was very good. “The farmers were impressed by the yield of the plants and their resistance to the bug. We will now cultivate these seeds and get more seeds and then take them to more villages. Along with eliminating the bug, it will help increase pulse production,” explained an official of the agriculture department.\n\nSources in the BARC said the TU-94-2 variety had been released and notified for Tamil Nadu, Andhra Pradesh, Kerala and Karnataka. The plant grows like a creeper and farmers in other States have been using the seeds for over a decade now.\n\n“Vamban variety gives 370 kg in 70 cents of land but TU- 40 gives the same quantity in 50 cents”", 
    "section": "national", 
    "title": "BARC’s black gram seeds a hit among farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}