{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Imagine passing an examination when there is no answer sheet or even a pen in front of you.\n\nFor students of physical education at Bangalore University, passing their ‘compulsory’ swimming subject posed a similar problem: for the university has not had a functional swimming pool for over seven years.\n\nIn 2014-15 academic year, the physical education department had introduced swimming as a compulsory subject for M. P.Ed students. However, the university pool has been closed since 2008 for renovation, and it has yet to be opened – leaving the students in a quandary of an ‘unpassable’ subject. “We had introduced it as a compulsory subject hoping that our pool which has been under repair for several years now would be complete.\n\nHowever, the renovation is likely to be complete only by June,” Sundar Raj Urs, head of the University College of Physical Education, told the academic council on Tuesday.\n\nInstead, he requested that the sport be replaced by kabaddi, volleyball, softball, kho-kho, football, table tennis, basketball, wrestling or hockey.\n\nThe candidate has to choose a game that has not been selected in any of the other semesters. This request was passed by the council.\n\nWhile Bangalore University has spent Rs. 88 lakh on renovations, Mr. Urs added that a majority of the State-run universities still do not have pools.\n\nThe meeting also saw the University deciding to introduce German, French, Sanskrit, Banking and finance under the soft-skills programme for fifth semester arts and science students; while, also allowing those who have failed any fifth semester examination to write the supplementary examination in the next semester instead of waiting for another year.\n\nAnnouncements for 2016-2017\n\nA sexual harassment prevention cell will be set up at the university at a cost of Rs. 20 lakh\n\nGender sensitisation programme will be started for students at a cost of Rs. 20 lakh\n\nRs. 23.99 crore has been allocated for research activities\n\nRs. 20 lakh has been allocated for Karnatatka State Lectureship Eligibility Test\n\nConstruction of four new hostels at the Central College and Jnana Bharathi campus", 
    "section": "national", 
    "title": "‘Cannot pass swimming exam without a pool’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}