{
    "author": [
        "Deepa H"
    ], 
    "text": "Bid to encourage motorists to buy the prepaid cards\n\nOnly around 100 vehicles are now using the cards on a daily basis on the Chennai-Bangalore highway.- File Photo\n\nIn an effort to woo motorists to use FASTag, the prepaid radio frequency ID cards at toll plazas across the country, the Centre is mulling over a proposal to give them a concession in the fee.\n\n“The proposal is still at a nascent stage. The idea is to reduce the rates for those who pay in advance. It would begin with say a reduction of 10 per cent of the total charge and then be brought down to 7.5 per cent, 5 per cent and then 2.5 per cent,” said a source in the National Highways Authority of India (NHAI).\n\nThe tags were launched last year on select national highways across the country. They were meant to reduce waiting time at plazas and save on fuel.\n\nIn Tamil Nadu, the facility has been implemented on the Chennai – Bangalore highway that has three toll plazas and only around 100 vehicles are using the cards on a daily basis. “There are motorists who use them on a regular basis too. But the numbers have not been too encouraging. The cards are issued by two private banks and payment can be made online,” said an official source in the NHAI.\n\nA few years ago when a 10-km long elevated highway was constructed for Bengaluru’s Electronic City and prepaid cards were introduced, not many opted for them. “It took the contractor quite sometime to convince more motorists to buy the cards. Even now there are long queues on that highway even though there is a separate lane for card-holders,” explained another source.\n\nTruck owners in the State had objected to the proposal of prepaid cards stating that toll plazas must be shut down in the first place and that their rates were too high.\n\nIt’s aimed at wooing motorists to use the pre-paid radio frequency ID cards at toll plazas", 
    "section": "national", 
    "title": "Centre mulls concession for FASTag users", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}