{
    "author": [
        "Special Correspondent"
    ], 
    "text": "When workers de-silting a supply channel at Alangulam in Kilakarai police limits two days ago stumbled upon parts of a two-wheeler buried on the bank, little they realise that they had unearthed a crucial evidence to crack a five-year-old murder case.\n\nAfter a 45-year-old man went missing in April, 2011, along with his unregistered two-wheeler, the Kilakarai police had almost closed the case stating that he could not be traced.\n\nThe case took a curious turn after the workers unearthed parts of the two-wheeler. A special team led by Deputy Superintendent of Police K. Maheswari jotted down the chassis number and launched an investigation only to find that it was purchased by S. Dharmar, who went missing since April 13, 2011. As the DSP pursued further leads, the ‘man missing case’ turned out to be a cold-blooded murder.\n\nAs the needle of suspicion pointed towards Pandiammal (37), wife of Dharmar, and her paramour P. Murugesan (38), the special team grilled them. Based on Murugesan’s confession, police exhumed the skeletal remains, allegedly that of Murugesan at Periyakanmai on Wednesday and buried them back after a post mortem on the spot, police said.\n\nThe special team, working under the direct supervision of Superintendent of Police N. Manivannan, took Pandiammal and Murugesan into custody for further interrogation and launched a dragnet for three others engaged for committing the murder, police added.\n\nInvestigations revealed that Dharmar, who was working in Dubai for about 15 years, returned home in 2010 to settle down in his native Idambadal. Couple of months later, he found that his wife, mother of two children, had an illicit affair with Murugesan, a conductor in the Tamil Nadu State Transport Corporation.\n\nDespite his protest, Pandiammal got her daughter married to the relative of Murugesan and since then they had frequent family feuds, police said. It was at this stage that Pandiammal and Murugesan hatched a conspiracy to eliminate Dharmar, police said.\n\nOn April 13, 2011, after Dharmar went out in his newly bought two-wheeler, Pandiammal alerted her paramour, who, with the help of hired killers, waylaid and murdered him. They buried the body at Periyakanmai and in a bid to destroy the evidence, buried the two-wheeler on the bank of the supply channel after removing the wheels and engine, the police added.", 
    "section": "national", 
    "title": "Closed man-missing case turns out to be murder", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}