{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The defence counsel on Wednesday filed a counter affidavit to a petition filed by Special Public Prosecutor (SPP) B. Mohan, seeking removal of the names of four serving and retired police officers from the list of witnesses and their inclusion in the list of accused in the temple pujari suicide case.\n\nAll the accused, including O. Raja, brother of Finance Minister O. Paneerselvam, were present in the court.\n\nThe SPP argued that ADSP (retd) Uma, DSP Sethu, Inspectors Ilangovan and Chellapandian instigated pujari Nagamuthu to commit suicide and that prior sanction from the government was not necessary to prosecute them.\n\nThe prosecution also charged that the police fabricated records.\n\nDefence counsel M. Kannappan, however, said that the petitioner had approached the court several times. But he did not raise the issue till now. Moreover, the police had registered a PCR case against two persons – Vengidusamy and Palanisamy – and recorded it in the register meant for it. An FIR was filed on September 2, 2012. Inquiry was on. Later, the Theni court referred it as ‘Mistake of facts’ and issued notices to petitioner Nagamuthu on October 10, 2012. But the petitioner did not appear before it.\n\nPrior sanction was a must for prosecuting government officers. He further said that the prosecution did not mention about the crime committed by each police officer in the petition.\n\nThere was no provision in law to include an investigation officer in the list of accused. On fabrication of records, the court alone had the right to question the status of records, he added.\n\nOn hearing their arguments, Principal District Judge R. Poornima adjourned the case till April 1.\n\nMr. Mohan had filed a petition on March 24 seeking inclusion of the names of the four serving and retired police officers in the list of accused. Twenty of the 61 witnesses have been examined and cross-examined. Six witnesses turned hostile.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam on December 8, 2012, after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "Counter affidavit filed in pujari suicide case", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}