{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "A 17-year-old Dalit boy, a casual worker in a restaurant here, was allegedly tortured in illegal detention by Ramanathapuram police for five days on a murder charge.\n\nThe police released the boy, V. Suresh (name changed), who has no criminal record, on Tuesday morning, giving him Rs. 100 for “conveyance” as he was found to be innocent.\n\nSuresh, who has been admitted to Government Rajaji Hospital here with bruises and contusions, told The Hindu that he was picked up by the police on Thursday last while sleeping at his house in Karumbalai here.\n\nWhen his mother and family members went to Anna Nagar police station, where he was taken, the police allegedly said that it was for an inquiry and he would be released soon. “Later, we realised that he was taken to Abiramam police station,” said his mother V. Muthumari, a domestic help.\n\n“The policemen tied both my hands to a bar and beat me up with a pipe,” Suresh said.\n\nHe said the police asked him to “confess” and showed him some pictures to “identify”. Only later he knew from the police and other suspects that it was in connection with the murder of a Dalit youth from Madurai, K. Vigneswaran, under Abiramam police limits the previous day.\n\nMs. Muthumari said when they reached Abiramam station in the wee hours of Friday they were shooed away by the police.\n\n“We visited the station daily and the police kept saying they would release Suresh soon,” she claimed.\n\nOn Monday, advocate N. Thirukkumaran moved a request under Section 97 CrPC against illegal confinement before Kamuthi District Munsif-cum-Judicial Magistrate, who formed a two-member committee to search Abiramam police station.\n\n“The police came to know about it and hid Suresh. But the statement of a co-accused that Suresh was in the station until then was recorded in the committee’s report,” Mr. Thirukkumaran said.\n\nSuresh said that he was kept in a bushy area behind the station until late evening. He was released the next morning.\n\nWhen The Hindu contacted Kamuthi ASP Deshmukh Shekhar Sanjay, he said, “Three persons were arrested and five others surrendered in court in connection with the case. No boy was picked up.”\n\nHowever, Abiramam Inspector Ramakrishnan said that the boy was taken for inquiry only on Monday night to Madurai Anna Nagar police station and was released the next morning.\n\nThe boy has been admitted to GRH in Madurai with bruises and contusions", 
    "section": "national", 
    "title": "Dalit boy detained illegally, beaten up by police", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}