{
    "author": [
        "R Sivaraman"
    ], 
    "text": "They have been at loggerheads since the ruling party allotted RS seat to AIADMK\n\nThe future of the two-year-old alliance between the ruling All India NR Congress led by Chief Minister N.Rangasamy and the Bharatiya Janata Party is likely to be known on Thursday.\n\nAlthough senior leader and Union Minister M.Venkaiah Naidu and local leaders had expressed their desire to ally with ruling AINRC two months ago, there is yet to be a clear positive response from AINRC president Mr. Rangasamy.\n\nA top leader of the BJP unit told The Hindu, “Union Environment Minister Prakash Javadekar, who is the party in-charge for the Assembly elections in Tamil Nadu and Puducherry, and party secretary Mahesh Giri will come down to Puducherry. There will be a workers’ meeting and the leaders are likely to spell out the party strategy on Thursday.”\n\nThe BJP and the AINRC worked out an electoral understanding ahead of the Parliamentary elections in 2014.\n\nThe AINRC bagged lone Lok Sabha seat with huge margin. Later as quid pro-quo measure, the AINRC gave the nominated MLA post to then president M.Visweswaran.\n\nHowever, the two parties have been at loggerheads ever since the AINRC allotted the Rajya Sabha seat to the AIADMK and sealed a deal last year. The BJP leaders openly started criticising the Government for lack of effective coordination between the two alliance partners.\n\nThe alliance also came under strain following Mr. Rangasamy making his displeasure known in clear terms at various meetings and complaining that the Centre has not been releasing the flood relief assistance sought by the Union Territory Government.\n\nWhile all along, local unit leaders of the BJP have been maintaining that the party’s alliance with the AINRC continues, Mr. Rangasamy has refused to reciprocate.\n\nIn this context, it was significant that BJP president V.Saminathan stated in New Delhi last week that the people of the Union Territory were expecting a “better alternative” in the Union Territory.\n\n“People want a better government in UT under Mr. Modi’s governance,” Mr. Saminathan had said in the party national executive committee in New Delhi.\n\nAnd, with the ruling AINRC deferring formulation of a poll strategy, the Puducherry unit of the Bharatiya Janata Party has already commenced its campaign in some constituencies.\n\nThe campaign vehicle has been doing the rounds in Lawspet, Raj Bhavan and other constituencies with pictures of Prime Minister Narendra Modi, BJP national president Amit Shah and other local leaders. BJP cadres are campaigning without naming any candidate to the constituency or proclaiming an alliance.\n\nUnion Minister Prakash Javadekar and BJP secretary Mahesh Giri are visiting today", 
    "section": "national", 
    "title": "Fate of BJP-AINRC alliance may be known today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}