{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "T. Nagar resident James G. Prakash’s original plan was to be in Hong Kong from May 14 to 21{+s}{+t}with his extended family, and have his daughter cut her tenth birthday cake at the Disneyland there on their first day. But, the dates of the Assembly elections in Tamil Nadu, announced early in March threw these plans — made in January — off gear.\n\nMr. Prakash, who runs an agro-farming business, changed the dates of the holiday — the family is now going from May 8 to 15, back just in time to cast their votes.\n\n“It’s our responsibility to vote and I wanted to make sure it happened. There are six adults on this trip, so we decided to advance our holiday,” he said. The cake cutting will still happen at Disneyland, only at the end of their trip instead of the beginning, he said.\n\nWith the elections falling smack in the middle of summer vacations, travel agents say that while some families are continuing with their holiday plans regardless, several are changing plans to ensure they are in the city to exercise their franchise.\n\nAt Shakthi Tours and Travels, CEO Charanya Ramesh has received about half a dozen requests to change dates.\n\n“Travellers are telling us that even a late afternoon or evening flight out of the city is all right on May 16, but they want to be here in the morning to have time to vote,” she said.\n\nThree large groups going to Europe have changed plans because of the elections, said Venkatraman Suresh, senior manager, Akshaya India Tours and Travels. “We have postponed the plans of two of the groups and advanced the plans of another one. The groups have about 45 people each and we got lots of calls from them telling us specifically that they wanted to be in town for the elections,” he said.\n\nSharat Dhall, president, Yatra.com, said that while there were no cancellations, travellers who were planning their trips were re-scheduling them to avoid being away on voting day.\n\nHowever, Priya Menon, owner, Aaditya Tours and Travels, said they had not received any requests to change dates as of now.\n\n“In the last elections, people were changing plans, but as of now, we haven’t seen that this time,” she said.Popular destinations\n\nPopular destinations this summer, travel agents said, included Ladakh, the North East, eastern Europe, Australia, New Zealand and Mauritius.\n\nThere are around 38 lakh voters in Chennai district.\n\nSeveral families are rescheduling their vacations to ensure they can cast their votes on May 16", 
    "section": "national", 
    "title": "For some, vacations can wait for voting", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}