{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Seeking to break away from the party’s contentious past, Pattali Makkal Katchi’s chief ministerial candidate Anbumani Ramadoss on Wednesday affirmed that the party’s past was behind them and it has changed for the better.\n\n“Any organisation has a past; the BJP’s roots could be traced to the RSS. Our past is over. Change is for us too; we have changed and stand for progress,” he declared. He was speaking at “Ungal Oor, Ungal Anbamani,’ an interactive session with residents of Tiruchi and Karur to discuss issues relating to the two districts.\n\nDr. Anbumani’s statement came in response to a city resident who observed that though he could be acceptable to many, the words and deeds of his party men were a put off. “Have you seen any of our partymen speaking or acting in deviant manner over the past one or two years? We may not be perfect. But we have definitely changed,” Dr.Anbumani said.\n\nHe also promised to consider the “long pending” demand for making Tiruchi the second capital of the State if his party was voted to power. “We will study the demand with the help of experts,” he said and added that some of the departments could be decentralised.\n\nThough Tiruchi was centrally located, the previous governments have not exploited the advantage and the city has seen little development in terms of infrastructure and basic amenities.\n\nSome of the popular demands from city residents such as establishment of an integrated bus stand, which he said has not come up due to the political rivalry and petty politics between the two Dravidian majors, expansion of the airport, building a ring road, upgradation of the Mahatma Gandhi Memorial Government Hospital as a super specialty hospital and laying of service roads along Thanjavur highway would be addressed if the PMK was voted to power. He also promised to promote agro-economic zones for banana and drumstick processing and exports in the Tiruchi-Karur region. Cooperatives would also be promoted for specific farm and marine products, he said.", 
    "section": "national", 
    "title": "Forget our past, we have changed: Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}