{
    "author": [
        "Staff Reporter"
    ], 
    "text": "All decks have finally been cleared for the appointment of judges to the Madras High Court, with the President’s office clearing six names from the list of prospective candidates recommended by the High Court’s collegium.\n\nOnce the appointments are officially made, the strength of the Madras High Court would increase from 34 to 40. But still, the court would have a deficit of 35 judges, given its sanctioned strength of 75.\n\nOut of the six new judges, four are from the Bar and two are from the judicial service. V. Bharathidasan, S.S. Sundar, M.V. Muralidharan and D. Krisshnakumar are from the Bar.\n\nP. Kalaiarasan, the present Registrar General of the Madras High Court, and B. Gokuldass, retired Chief Judge of Small Causes Court, Chennai, are being elevated for the judicial service.\n\nAll the six are expected to be sworn-in by April 7 once the necessary warrant is issued by the President of India.\n\nMr. Gokuldas (60) is the eldest among the six and will serve for nearly two years, as the age of superannuation of high court judges is 62.\n\nBorn on June 7, 1955 in Kizhur village, Kanchipuram district, he is an alumnus of the Madras Christian College. He completed law in Dr. Ambedkar Government Law College, Chennai in 1978. Mr. Gokuldas joined judicial service in August 1984 as a second Class Judicial Magistrate and was later promoted as a District Judge in 2000. On June 30, 2015 he retired from service as Chief Judge, Court of Small Causes, Chennai.\n\nP. Kalaiarasan (59), who is the Registrar General of the Madras High Court currently, was born on May 1, 1956, in Kullamudaiyanur, Salem district. He holds a post-graduate degree in law. Mr. Kalaiarasan was appointed as a Judicial Second Class Magistrate in January 1983 and as District Judge in December 1999.\n\nA first graduate in his family, V. Bharathidasan was born on May 7, 1960 in Alathur Village, Thanjavur district. He holds a law degree from Dr. Ambedkar Government Law College, Chennai. Initially he worked under the guidance of R. Desabandhu, the then Government Pleader. He held the post of Secretary of Madras Bar Association from 2009 to 2011.\n\nFifty-two-year-old S.S. Sundar was born on May 3, 1963 in Kootampuli village, Thoothukudi. A law graduate from the Dr. Ambedkar Government Law College, Chennai, he enrolled as an advocate in April 1988. Mr. Sundar then shifted his practice to the Madurai Bench of the Madras High Court in 2005.\n\nM.V. Muralidharan, who was born on April 16, 1962, is a native of Vellore. After completing his law degree from the Dr. Ambedkar Government Law College, Chennai, he enrolled as an advocate on September 12, 1990. Born in a family of lawyers on May 22, 1963, D. Krisshnakumar is a native of Dharapuram, Tiruppur district. An alumnus of the Presidency College, Chennai, he completed law from the Dr. Ambedkar Government Law College, Chennai. He has been holding the office of Special Government Pleader since 2013.", 
    "section": "national", 
    "title": "HC to get six new judges", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}