{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has dismissed a public interest litigation petition filed by a retired Indian Audit and Accounts Service (IAAS) officer against permission granted by Kanyakumari Collector to construct walls around an incomplete building permitted to be used for prayer meetings until reconstruction of a 202-year-old church at Achankulam.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam refused to entertain the petition after stating that the petitioner, D. Murugaiah, a former civil servant, should have understood the Constitutional goals of practising tolerance and mutual respect between people professing different religions before taking the decision to file a case against the church in “public interest.”\n\nThe judges also quoted the Supreme Court to have said recently that “these days unfortunately some people seem to be perpetually on a short fuse, and are willing to protest often violently about anything under the sun…These are dangerous tendencies and must be curbed with an iron hand. We are one nation and must respect each other and should have tolerance”.\n\nWriting the judgement, Mr. Justice Manikumar recalled the apex court to have also said: “Every person, whatever be his religion, must get an assurance from the State that he has the protection of law freely to profess, practise and propagate his religion…Otherwise, the rule of law will become replaced by individual perceptions of one’s own presumptuous good social order.”\n\nIn so far as the present case was concerned, the judge said that the Collector had on January 6 directed the management of the CSI church to stop construction of a new building close to a temple since it was being built without his permission.\n\nOn the same day, he directed the management to demolish and rebuild the old church within 18 months.\n\nThe Collector also permitted prayer meetings in the newly constructed but incomplete building until the reconstruction of the old church. Subsequently, on March 2, the Collector permitted the church to construct temporary sidewalls around the incomplete building, facing ‘stop construction’ order, since it was represented that the devotees were suffering from sun and rain.\n\nThe Division Bench said that the petitioner, a native of Achankulam, had failed to prove his claim of the district administration having succumbed to the church’s request only due to the impending elections to the Legislative Assembly.\n\nPetitioner failed to prove district administration succumbed to church’s request only due to elections", 
    "section": "national", 
    "title": "High Court stresses need for practising tolerance", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}