{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "45 fishermen have been left in the lurch by their employer in Saudi Arabia\n\nSixty-three fishermen, including one from neighbouring Kerala, had been left in the lurch by their employers for more than nine months in Al Jubail in Saudi Arabia, said P. Justin Antony, founder-president, International Fishermen Development Trust (INFIDET), here on Wednesday.\n\nIn a release, he said that the INFIDET mailed representation to the Union and State governments to save the fishermen who were employed by Saudi Arabia-based Yousuf Khaleel Ibrahim Al-Amery and Yacoob Yousuf Khaleel.\n\nRamanathapuram\n\nThe family members of 45 fishermen thronged the Collectorate complex here. They urged the district administration to take up the issue with the State government and facilitate their return.\n\nThe family members, hailing from fishing hamlets of Thirupalaikudi, Morepannai, Mullimunai, Karangadu and Valinokkam, said they had been struggling to make both ends meet for the past six months as their breadwinners could not send money.\n\nThe fishermen — 45 from Ramanathapuram and others from Kanyakumari, Nagapattinam, Cuddalore and Thanjavur districts —were virtually left at the ‘cross roads’ as their employer failed to pay the six months salary arrears, they said.\n\n“We are at the mercy of friends and those who had come from Tamil Nadu and leading a miserable life for the past six months,” S. Sandhiyagu, one of the fishermen from Karangadu, told The Hindu over phone from Al Jubail. They raised a banner of revolt two months ago after which the employer left them in the lurch, he said. They could not return home as their passports were with the employer. Most of the fishermen remained there for more than three years, he said.\n\n“We have been in touch with the Embassy for more than a month now but there has been no assistance,” he regretted.", 
    "section": "national", 
    "title": "Kin of stranded fishermen appeal for their safe return", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}