{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The IV-Additional District Judge here, on Wednesday, awarded death penalty to a 30-year-old man for murdering the wife and daughter of his neighbour, who had earlier testified against him in a murder case.\n\nAdditional Public Prosecutor E.R. Sivakumar said that M. Rajivgandhi alias Marimuthu (30) of Subbaiya Goundan Pudur Sungam near Anamalai, murdered Kanagaraj on November 1, 2005. The Fast Track Court in Coimbatore awarded him life imprisonment on August 7, 2006.\n\n“He made an appeal in the Madras High Court where the sentence was commuted to seven years imprisonment. Rajivgandhi was released in 2012. He held a grudge against his neighbour N. Murugan (60) for testifying against him in the murder case,” Mr. Sivakumar said.\n\nRajivgandhi and Murugan were farm labourers who lived in adjacent houses that they built on a poramboke land.\n\n“Rajivgandhi asked Murugan for a portion of the latter’s land to expand his house, which Murugan refused,” Mr. Sivakumar said and added that this infuriated Rajivgandhi further.\n\nAround 6 p.m. on February 11, 2012, Murugan’s wife M. Palaniammal (55) and two daughters M. Jothimani (31) and M. Magudeeswari (28) went to a vacant space behind their house to ease themselves, when Rajivgandhi blocked their way and attacked them with a machete.\n\n“Suffering around 18 deep cuts all over their bodies, Palaniammal and Jothimani died on the spot. Badly injured Magudeeswari fell unconscious. Murugan and his son Manikandan (26) tried to rescue the three when Rajivgandhi threatened to kill them. He fled on a two-wheeler in which his accomplice, Jothimani (55), was waiting,” Mr. Sivakumar added.\n\nAnamalai Police registered a case under sections 302 (murder), 307 (attempt to murder) and 506(ii) of the Indian Penal Code.\n\nThey arrested Rajivgandhi about 15 days later as he was under hiding and he was lodged in jail since then.\n\nAccomplice Jothimani who helped him escape the scene died during the course of trial about a year ago.\n\nOn Wednesday, judge G. Vijaya awarded death sentence to Rajivgandhi for a murder, life imprisonment for another murder and three years imprisonment for attempt to murder, all to be served concurrently. Rajivgandhi was lodged at the Coimbatore Central Prison.", 
    "section": "national", 
    "title": "Man gets death penalty for double murder", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}