{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "In six months, Chennai Metro Rail may have its first solar power generation facilities with a production capacity of 1MW.\n\nAccording to officials of Chennai Metro Rail Limited (CMRL), they have signed an agreement with a firm in this regard.\n\nAt first, the solar power panels will be installed on the rooftop of the shed in the depot at Koyambedu; then, they will explore the option of installing it in stations too, officials said.\n\nThis depot, which sprawls over 26 hectares, is being built at a cost of Rs. 198 crore; and it houses stabling lines, workshops, washing plants for trains and also the Operation Control Centre (OCC) from where all trains of Chennai Metro Rail can be controlled and monitored.\n\n“Currently, we use about 40,000 units of electricity; if this solar power generation begins, it may be able to take about 30-40 per cent of the total energy consumption. We may be able to use it for various functions including running of escalators, lifts and other such purposes,” an official said.\n\nRamya Gopinath of Solar Mango, a solar energy consulting firm said aiding the supply of electricity with solar power is a great initiative for mass rapid transit.\n\n“1MW may not be huge investment for a mass rapid transit like Chennai Metro Rail; but it is a good startWith 1MW, they can meet up to 30 per cent of the total energy requirement. But it will help to a great extent only if they eventually increase the production capacity. It will be better if they at least go up to 3 MW,” she said.\n\nDelhi Metro Rail had exploited this resource to such an extent that they were given an award for the highest capacity installation of grid connected solar power plants on rooftops last year.\n\nThey have commissioned about 2,000 KWP of rooftops solar plants and also signed a power purchase agreement for another 7MW capacity.\n\nIn December, they signed an MoU with Solar Energy Corporation of India for production of 500MW for catering to its upcoming phase III project.\n\nSimilarly, Bangalore Metro Rail too has made plans to exploit solar energy potential in its station premises.\n\nThe power panels will generate 1MW that will take care of 30 per cent of energy requirement", 
    "section": "national", 
    "title": "Metro Rail to go solar in six months", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}