{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A mobile voter facilitation centre was launched here on Wednesday for voters to verify whether their names have been included in the electoral rolls or not.\n\nCollector K.S.Palanisamy, who inspected the centre, said the centre would visit all parts of the city and urged residents to make full use of the facility. He pointed out that Voters Service Centres have been opened at 21 places across the district including the Tiruchi Corporation and its zonal offices, taluk and offices of Revenue Divisional Officers. Eligible voters can apply for inclusion, deletions, migration and corrections at these service centres. Voters can also apply for colour EPIC cards at the service centres on payment of Rs.25.\n\nMeanwhile, Corporation Commissioner N.S.Prema, in a press release, said eligible voters can check whether their names have been included in the electoral rolls at the mobile facilitation centre and submit applications for inclusions at the corporation service centres. The mobile facilitation centre would visit the following areas in the city as per the following schedule over the next few days:\n\nApril 5, 9, 14, 19, 23, 28, May 3 and 7: near Periyasamy Towers, near Kamarajar Statue in Chathram Bus Stand, Chinthamani Anna Statue, near Shrimati Indira Gandhi College, Singarathope, Big Bazaar Street Town Hall, NSB Road and Marakkadai in West Boulevard Road in Srirangam zone.\n\nMarch 31, April 4, 8, 13, 18, 22, 27, May 2 and 6: Gandhi Market, Jailpettai, Palakkarai Bus Stop, East Boulevard Road, Tharanallur Bazaar, Mudaliar Chathram, Khajapettai, Eda Street Mallaigaipuram and Varaganeri Bazaar in Ariyamangalam zone.\n\nApril 1, 6, 11, 15, 20, 25, 29 May 4 and 9 – District Court, Central Bus Stand, Railway Junction, TVS Tollgate, Mannarpuram,Wireless Road, Airport, K.K.Nagar and Subramaniapuram in Golden Rock Zone.\n\nApril 2, 7, 12, 16,21, 26, 30 May 5 and 10 – Pillaiyar Kovil Street in Edamalaipattipudur, Crawford Main Road, Krishnamurthy Nagar, RMS Colony, Azvarthoppu bus stop, Thennur Uzhavar Sandhai, Anna Nagar, Thennur Tangedco Office, General Bazaar, Kumaran Nagar Main Road, Srinivasa Nagar Main Road, Uyyakondan Thirumalai, Puthur Ramalinga Nagar, Puthur High Road (near Bishop Heber Higher Secondary School), Kura Street Woraiyur, Thillai Nagar X Cross Road, Thillai Nagar V Cross Road, Salai Road Housing Unit, Takkar Road, Kuzhumani Road, Nachiyar Kovil Main Road and Pandamangala Vellalar Street in K.Abishekapuram zone.\n\nThe mobile facilitation centre can be reached at 7402711173, Ms.Prema said.", 
    "section": "national", 
    "title": "Mobile voter facilitation centre launched in city", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}