{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The mustering or life certificate furnishing process for pensioners or family pensioners who take pension from the treasury or sub treasuries will begin in April, says a release from the district administration.\n\nThose who wish to present themselves in the treasury or sub treasuries should go with pension book and details of their bank account (account number of the core banking account). They should also present Aadhaar details and PAN card if they had not done so by presenting photocopies of the documents along with their pension payment order.\n\nThose would not be able to present themselves at the treasury or sub treasuries – they should send photocopies of their pension book, live bank account details, Aadhaar card, PAN card and public distribution system (ration) card along with life certificate to the treasury concerned. The pensioners may download the life certificate form atwww.tn.gov.in/karuvoolam.\n\nThey should get the life certificate signed by officials at the bank account where they operate the pension account or a Central or State government gazetted officer or tahsildar or deputy tahsildar or revenue inspector.\n\nBut before furnishing the photocopied documents, the pensioners should write down their pension payment order on all the documents.\n\nThose pensioners who lived abroad should get life certificate authorised by the magistrate or notary or bank managers there or the Indian High Commission/Embassy officials. This would be in addition to the aforementioned documents.\n\nThe release also said that pensioners should furnish their Aadhaar details to the treasury for the account to be linked to the Aadhaar number. This was being done through the ‘Jeevan Praman’ website. If the pensioners living abroad had uploaded Aadhaar details in the Jeevan Praman website, they could get the life certificate online.\n\nIf the pensioners failed to present themselves before June 2016 or furnish proper documents, their pension would be stopped from August 2016.", 
    "section": "national", 
    "title": "Mustering of pensioners to begin in April", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}