{
    "author": [
        "Special Correspondent"
    ], 
    "text": "While the Model Code of Conduct has prevented new infrastructure projects from taking off this summer, an exception seems likely to be made for civic projects associated with the Smart City initiative. Work on the Smart City project is expected to gain momentum even before the completion of Assembly elections.\n\nOfficials of Greater Chennai Corporation are already making preparations to work on various aspects of the Smart City proposals.\n\nSmart City proposals in Chennai include providing easy access to public transport and enhancing mobility by use of ICT (Information & Communications Technology) solutions, city beautification, safety against natural disasters, easier commuting and mitigating inner-city congestion.\n\nThe implementation of the mission at the local level will be done by a Special Purpose Vehicle (SPV) created for this. “We have written to the Centre, asking them to get an exemption from the Election Commission of India. If we get permission, work may start before completion of elections,” said an official of the Greater Chennai Corporation.\n\nThe SPV will plan, approve, release funds, implement and manage the Smart City development projects. The State government may also initiate measures on a dedicated and substantial revenue stream for the SPV so as to make it self-sustainable. “Work on raising additional resources from the market would be challenging,” said an official.\n\nThe execution of projects would be done through joint ventures, subsidiaries and public-private partnerships. The SPV will be a limited company incorporated under the Companies Act, 2013, at the city-level, in which the State and the civic body will be the promoters having 50:50 equity shareholding.\n\nSafety of residents is expected to be a key aspect that has been assured in Chennai. Video surveillance via a common control centre, which will simultaneously help reduce traffic violations and ensure efficient on-street parking management, will be established.", 
    "section": "national", 
    "title": "No poll impact on Smart City initiatives seen", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}