{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Officials write to EC to treat it as a special case and give permission\n\nCorporation officials have sought permission from the Election Commission to carry out works in the city ahead of the annual Chithirai festival.\n\nOfficials said here on Tuesday that since the festival would start next month, works such as laying roads around Meenakshi Sundareswarar Temple, such as Masi and Avani Moola streets were to be implemented. A major part of those works were taken up once the underground drainage project was completed in the area. But, in order to facilitate the car festival, which formed part of the Chithirai festival, the roads had to be widened, an Assistant Commissioner said.\n\nSince model code of conduct was in force from March 4, fresh works could not be carried out. However, the officials had written to the Election Commission to take it as a special case and give permission to execute the pending works.\n\nThe Chithirai festival is celebrated in April-May, the highlights being the celestial wedding of Meenakshi with Sundareswarar and the entry of Lord Sundararaja Perumal from Alagarkoil into the Vaigai river. Close to a million people participate in the festival. This year, the celestial wedding will take place on April 19, car festival on April 20 and Kallazhagar entry into the Vaigai on April 22.\n\nWith the election notification expected to be announced on April 22, the city is heading for some hectic activities this summer.\n\nUnfinished work\n\nThough the Corporation claims to have sanctioned Rs. 26 crore for laying over 100 roads in the city, work on a few stretches remain unfinished. Residents of Kalai Nagar Second Main Road off Old Natham Road said that they were facing hardship in the absence of the unfinished metalled road. Dust emanating from the gravel was posing a health hazard, they said.\n\nWhen contacted, an engineer overseeing the work said that some councillors from the opposition parties had stalled it. Similar was the fate with few other roads in K. Pudur, Sellur and Tahsildar Nagar. However, work on construction of two flyovers in the city at a cost of Rs. 30 crore was progressing, he said.", 
    "section": "national", 
    "title": "Nod sought for civic works ahead of Chithirai festival", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}