{
    "author": [
        "Vasanth Srinivasan"
    ], 
    "text": "Proponents of poll reforms see it as a ray of hope,others feel votes could be better used\n\nThe 2013 Assembly Elections in five states saw the debut of the NOTA (short for the None of the Above) option that enables voters to reject all the candidates in the fray in a particular constituency.\n\nWhile the Supreme Court itself primarily focused on secrecy (which the earlier 49-O process compromised on as it required voters to record their decision not to vote) when calling for the introduction of NOTA, it is NOTA as a tool of political dissent that seems to have captured voters’ imagination. Nowhere was this more evident than in the Nilgiris constituency where NOTA votes totalled 46,559 (about 5% of the total votes polled) in the 2014 Parliamentary Elections.\n\nBut parties that are challenging the political status quo marked by a see-saw battle between the two Dravidian majors – AIADMK and DMK – are desperately trying to woo these “politically disenchanted” NOTA voters, who, they hope, would endorse their claim of being the change that everyone wants to see.\n\n‘Support good candidates’\n\nSiva Elango, an RTI activist and a leader of Puthiya Sakthi, an agglomeration of social activists and organisations that have come together to fight this Assembly elections, says, “Our slogan is ‘Say tata to NOTA’. With their obsession for voting only for ‘winning’ candidates, voters are actually losing every election. We want to appeal to people considering NOTA to look seriously at the candidates’ profiles and track record. If they can vote and boost the vote share of someone who is also like one of them trying to bring about a change, it will motivate them to stay in the electoral arena. Merely voting for NOTA discourages good candidates.”\n\nGnani Shankaran, a political commentator who was earlier actively involved in creating awareness about 49 O, says, “NOTA’s objectives are definitely noble.\n\nFor one, it helps in avoiding impersonation and bogus voting.\n\nTwo, it tries to put moral pressure on political parties to field good candidates.\n\nBut the provision, as it stands today, can only bark and not bite as they exclude the NOTA votes while counting, treating them as invalid. When I vote, I want my vote to be treated as any other. It should have a value.” He explains further:\n\n“The Election Commission should say if the number of NOTA votes are higher than the votes polled by the most popular candidate (in terms of votes polled) in a particular constituency, then all the candidates in that constituency are disqualified. They should not be allowed to contest again. Only this will force political parties to look for quality candidates.”\n\nThe Election Commission has merely gone by the letter of the law and not by its spirit in the rollout of NOTA, says Prof. Jagdeep S. Chhokar, Founder and Trustee of Association for Democratic Reforms.\n\n“The political class is trying to bad-mouth NOTA. But it is an investment that will yield long-term dividend. When NOTA gets more votes than any candidate, the EC would lose the moral authority to announce anybody a winner. It will be forced to expedite electoral reforms. And I would not equate NOTA with the right to reject, which has a negative connotation. NOTA is a [positive] call against malicious and manipulative democracy,” he adds.", 
    "section": "national", 
    "title": "NOTA: More than just an option", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}