{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Murasoli’ alleged that Vaiko was helping AIADMK win polls\n\nunited we stand:Leaders of People’s Welfare Front being garlanded by the cadres at Aruppukottai in Virudhunagar district on Wednesday.— Photo: S. James\n\nLeaders of People’s Welfare Front (PWF) have refuted the charge of Dravida Munnetra Kazhagam that Vaiko was making desperate attempts to keep the All India Anna Dravida Munnetra Kazhagam in power in the State.\n\nAddressing a public meeting here on Wednesday, PWF co-ordinator Vaiko said that it was only the front’s leaders who had been consistently flaying the ruling party on various issues. “We criticised Chief Minister Jayalalithaa for her silence when 20 woodcutters from Tamil Nadu were killed by Andhra Pradesh police. We demanded her resignation when Chennai was badly affected by the floods. We fought against the government when Gandhian Sasiperumal died fighting for prohibition. But, the DMK did not do so much in condemning the Chief Minister or criticising the government on these important issues,” Mr. Vaiko said.\n\nHe was referring to an article that appeared in the DMK party organ, ‘Murasoli’ on Wednesday that made a veiled reference to MDMK general secretary Vaiko of trying to help the AIADMK win the elections.\n\nMr. Vaiko said that the cadres of the PWF would take on directly all those who tried to distribute money to voters. The new alliance on coming to power would confiscate the ill-gotten wealth of the corrupt leaders of the rival Dravidian parties and make public auction of them.\n\nViduthalai Chiruthaigal Katchi president Thol. Thirumavalavan said that the AIADMK government was inefficient and had made people addicted to alcoholism.\n\nCommunist Party of India State secretary R. Mutharasan said that only the AIADMK and the DMK were known for their political conspiracy and not the leaders of the PWF.\n\nDesiya Murpokku Dravida Kazhagam propaganda secretary V.C. Chandrakumar listed a series of corruption charges against the AIADMK government.", 
    "section": "national", 
    "title": "PWF leaders refute DMK’s charge against Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}