{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Fact-finding team moots social audit of standards and seeks better infrastructure in the institutions\n\nA fact-finding committee of representatives from various social organisations recommended the formulation of a ‘Social Audit for Safety Standards’ in all private and government schools and the implementation of a comprehensive school child protection policy.\n\nRepresentatives from the Centre for Child Rights and Development (CCRD), Human Rights Advocacy and Research Foundation, Centre for Social Education and Development and Sakthi Vidiyal formed a fact-finding committee to study the safety and protection measures at a private school in Tirupur, following the death of a six-year-old boy at the school on January 27. He was beaten by a 12-year-old boy studying in the same school.\n\n“Based on our study, we found that the school where the incident happened had over 1,500 students but adequate safety measures were not in place. Students would come to school as early as 7.45 a.m. though classes started only at 8.30 and there was absolutely no adult supervision either by faculty or non-teaching staff such as the watchmen there,” said Thomas Jayaraj, Director of the Centre for Child Rights and Development.\n\nStating that the school at present had watchmen as well as CCTV cameras installed, S. Thengapandian, who headed the committee, posed a question as to why those measures were not in place before.\n\n“To create a safe environment at school and discourage such student behaviour, educational institutions should have counsellors,” he pointed out, and said that there had been an increase in such incidents where students displayed aggressive behaviour that put those around them at risk.\n\nThe fact-finding committee also stressed on the need to have better infrastructure in schools to ensure that the environment there was safe.\n\n“The 12-year-old student assaulted the younger boy with stones collected from debris that were unnecessarily piled up on school campus. This could have been avoided,” said C. Nambi, Executive Director of CSED.", 
    "section": "national", 
    "title": "Ramp up safety in schools: activists", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}