{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The NLC Tamil Nadu Power Plant Limited (NTPL) will establish a new solar power plant with a capacity of 200 megawatt, S. Sathiyanarayanan, Executive Director and Chief Executive Officer, NTPL, Thoothukudi, said while talking to media personnel here.\n\nHe said a techno-commercial feasibility study was on to set up the solar power plant over an area of 1,200 acres spread over Paraikuttam, Melapandiapuram and Muraman near Maniyachi.\n\nMeanwhile, Mr. Sathiyanarayanan said, production from two NTPL units each with 500 mw capacity was in full swing.\n\nPower allocation\n\nOn power allocation to various States, he said the power generated from these two units was distributed in the following quantum: Tamil Nadu – 439 .02 mw (44 per cent), Karnataka – 179.13 mw (18 per cent), Andhra Pradesh -133.18 mw (13 per cent), Telangana -155.65 mw – (16 per cent), Kerala – 82.24 mw – (8 per cent) and Puducherry – 10.78 mw- (1 per cent).\n\nWhile commercial production from the first unit of NTPL commenced on June 18 in 2015, the second unit got off to a start on August 29. Referring to its performance, 80.6 per cent plant load factor (PLF) was achieved during last month and 85 to 90 per cent of PLF was expected next month.\n\nHe said the national average PLF was 67 per cent. On coal consumption, he said around 14,000 tonnes of coal was being used on an average daily for production in this plant, which was designed to handle 70 per cent of indigenous coal and 30 per cent of imported coal. Currently, 2.35 lakh tonnes of coal was maintained at the stockyard here, he said.\n\nFor corporate social responsibility activities of the NTPL, Rs.19 crore was allotted for 2016-17, the CEO said. S. Gurusamynathan, General Manager (Human Resources) and A.R. Neelakanda Pillai, General Manager, Operation and Maintenance, were present.", 
    "section": "national", 
    "title": "Solar power plant to come up in Thoothukudi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}