{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Applied Psychology Department of Pondicherry varsity hosts meet\n\nIs a surfeit of technology in modern lives weakening familial ties, especially the attention given to the elderly?\n\nAnisa B. Khan, Vice-Chancellor-in-charge, Pondicherry University, feels that dependence on technology was leaving an impact on inter-personal relationships, especially with the elderly.\n\nInaugurating a conference on ‘Caring the Elderly: Psycho-social perspectives’ hosted by the Department of Applied Psychology, Pondicherry University, Prof. Khan pointed out that the warmth of relationship seems to have waned due to over-dependence on information Technology.\n\n“Emotional aspects are getting neglected and our relationship with the elderly is getting reduced to a Skype call,” she said.\n\nIn his key-note address, Jitendra Mohan, Professor Emeritus of Psychology, Panjab University, Chandigarh, said ageing in no way diminished one’s ability to exhibit excellence.\n\n“We need to provide the avenues for that,” he said.\n\nEminent personalities in fields of psychology, gerontology and geriatric care, including Prof. Sibnath Deb, Suneet Varma, Meena Sehgal, Jamuna Duvvura, and Renu A Varughese delivered plenary talks in different areas ranging from quality of life to models and implications of geriatric care.\n\nResearchers and academicians from different parts of the country presented research papers on different themes like family and life style perspectives, needs and challenges, ageing and well-being; interventions and applications.\n\nProf. Gopa Bhardwaj, Former Professor and Head, Department of Psychology, University of Delhi, said while old age presented special and unique problems, these have been aggravated due to the unprecedented speed of socioeconomic transformation leading to a number of changes in different aspects of living conditions.\n\nPresiding over the valedictory session, Prof. G. Govindaraj, Dean, School of Physical, Chemical and Applied Sciences, Pondicherry University, emphasised the need for caring for the elderly in society in general and at homes in particular.", 
    "section": "national", 
    "title": "Technology’s negative impact on relationships highlighted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}