{
    "author": [
        "Staff Reporter"
    ], 
    "text": "On April 21, about 10 lakh people are expected to visit the town\n\nOn Chitra Pournami, lakhs of devotees from various parts of the State throng Tiruvannamalai to perform girivalam. -File Poto\n\nClose to 10 lakh devotees are expected to throng Tiruvannamalai town on April 21 in view of ‘Chitra Pournami’. The district administration is taking preparatory measures to handle the crowd and provide the required amenities for devotees.\n\nOn Wednesday, Collector A. Gnanasekaran conducted a meeting to review the preliminary arrangements for ‘Chitra Pournami’ when devotees will circumambulate the Annamalai Hill.\n\nAs the devotees will perform ‘Girivalam’ on the 14-km path, the district administration is taking steps to provide the required facilities including drinking water, toilets, and shelters, and also set up emergency medical centres in and around the path.\n\nFor the benefit of devotees, the sanctum of Sri Arunachaleswarar temple will be kept open from 4 a.m. to 11.10 p.m., according to a press release.\n\nDrinking water taps will be installed at various places and purified water will be supplied through Reverse Osmosis system. Apart from these, water tanks will also be brought to the use of devotees. Butter milk will be provided to devotees .\n\nShelters on roads\n\nKeeping in mind the soaring mercury level, shelters will be set up on the roads and identified places, and coir mats will also be laid. Shelters will be established at three places along the Girivalam path. Separate bathrooms and toilets for men and women will also be made available for devotees, the release said.\n\nMobile toilets\n\nOfficials said mobile toilets will also be put to use for devotees on ‘Chitra Pournami’ day. There are already 29 mobile toilets with local bodies in Tiruvannamalai, and another 25 that were used during the ‘Mahamaham’ which will be brought for the use of devotees. These toilets will be made available including at bus stands and places where crowds converge.\n\nArrangements are being made to deploy adequate manpower to take up sanitation work and ensure proper lighting and uninterrupted power supply. The Health Department is also setting up emergency medical facilities for devotees.\n\nOfficials said there are nine entry points to the temple town. Four temporary bus stands will be established on the town’s outskirts for the day. These bus stands will be at least two to four kms away from the temple.", 
    "section": "national", 
    "title": "Tiruvannamalai gears up for ‘Chitra Pournami’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-31"
}