{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Judicial Magistrates N. Veluchamy and K. P. Ilavarasi interacting with prisoners at the Special Camp and Prison Adalat in district jail in Ramanathapuram on Saturday.\n\nSix remand prisoners, including four from Uttar Pradesh, who were arrested and remanded in connection with theft cases were convicted and ordered to be released after they served the sentence period at the Special Camp and Prison Adalat held at the district jail and Sub jail on Saturday.\n\nAt the special camp held at the district jail here, K. P. Ilavarasi, District Munsif cum Judicial Magistrate, Thiruvadanai, holding additional charge, Rameswaram, found four accused from Uttar Pradesh guilty of stealing gold jewellery from pilgrims while taking holy dip at the Agnitheertham seashore in Rameswaram and awarded them 180 days imprisonment.\n\nThe Rameswaram police had arrested Manjesh Kumar (40), Lalith Kumar (26), Sylender (50) and Shyam Kishore (48), all hailing from Deoria district in Uttar Pradesh on October 12 last year.\n\nAs they had served 103 days in judicial custody, she ordered their release aft0065r they served 77 more days, R. N. Muraleedharan, Senior Administrative Officer, District Legal Services Authority said. After their conviction, they were shifted to Madurai central prison, he said. The legal services authority organised the one-day special camp and prison adalat on the orders of Principal District Judge (in-charge) M. P. Ram, he said.\n\nIn another case, Judicial Magistrate N. Veluchamy ordered the release of A. John Prakash (22), who was arrested on November 6 last year on charges of attempting to steal a two-wheeler near Erwadi Dargah. The Magistrate convicted and awarded him 60 days imprisonment. As the accused had already served 79 days, he was set free on Saturday.\n\nHolding the camp at Mudukulathur sub jail, S. Muthu Maharajan, District Munsif, holding additional charge as Judicial Magistrate, Mudukulathur set free I. Rajesh (26) arrested in connection with a two wheeler theft case on September 20. The Magistrate awarded him 125 days imprisonment, which the accused completed on Saturday.", 
    "section": "national", 
    "title": "6 remand prisoners convicted, released at prison adalat", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}