{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Justice V. Ramasubramanian complains of lack of talented lawyers in State\n\nJustice Sanjay Kishan Kaul, Chief Justice, Madras High Court, (second from left) having a word with S. Nagamuthu, Judge, Madras High Court, at the Third State Law Seminar-2016, in Madurai on Saturday. Judge S.Vimala and Judge V. Ramasubramanian look on.— Photo: S. James\n\nNearly one-fourth of court cases pending in the State are more than five years old. Hence, a concerted effort was required on the part of the Bar and the Bench to work towards considerably reducing the time taken by a case from its birth to burial, Chief Justice of Madras High Court Sanjay Kishan Kaul said here on Saturday.\n\nDelivering his inaugural address at a seminar conducted by Lawyers Association of Madurai District Court (LAMDC), the Chief Justice said that the number of cases in Punjab and Haryana High Court that were more than five years old were brought down to below three per cent during his tenure as the Chief Justice there between June 2013 and July 2014.\n\n“If we work together, I don’t see any reason why we can’t achieve it here. The fact that more number of cases keep coming to courts is actually a matter of pride and not of fear. It is a measure of the belief that people have on the justice delivery system… Therefore, old cases which are pending for long must see the light of the day soon,” he stressed.\n\nReferring to recent incidents of disciplinary action being initiated against a section of lawyers, the Chief Justice said judges do not gain any pleasure from punishing lawyers. Pointing out that courts, being temples of justice, could not be closed to the litigant public in the guise of boycotts, he said taking action against advocates had always been the last resort of the judiciary.\n\nAdvising young lawyers to spend more time in court halls than “sitting in canteens and abusing judges,” the Chief Justice said the advocates could learn more by observing how different judges conduct court proceedings. “You can learn ways to tackle a judge not with a hammer, but with the force of your arguments and ability to put forth what is required from him,” he added.\n\nFalling standards\n\nLamenting unavailability of talented lawyers in the State, Justice V. Ramasubramanian pointed out how he could not find qualified candidates to fill up 175 posts of District Munsif and Judicial Magistrate in 2012. As many as 10,443 candidates applied and 8,990 applications were accepted, but only 6,702 took the written examination in all four papers. “Candidates under general category were required to score a pass mark of 40 per cent in all four papers with a relaxation of five per cent for Backward Classes and another five per cent for Scheduled Castes and Scheduled Tribes. Yet, out of 6,702 candidates, only 460 qualified for interview. Similarly in 2014, a notification was issued for filling up eight posts of District Judge. “Though 782 candidates applied, we could select only five. This is the standard to which we have fallen,” he said and urged lawyers to pull up their socks.\n\nJustices S. Nagamuthu, K. Ravichandra Baabu and S. Vimala spoke.\n\nEarlier, E.M. Sudarsana Natchiappan donated Rs.25 lakh to LAMDC from his Member of Parliament Local Area Development Scheme fund.", 
    "section": "national", 
    "title": "A fourth of court cases in TN over five years old, says CJ", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}