{
    "author": [
        "Annie Philip"
    ], 
    "text": "Visitors pick up the products displayed at the Auroville International Potters' Market 2016 and some of the attractive exhibits in the market being held at Auroville on Saturday.— Photos: S.S. Kumar\n\n‘Demo tent’ is the new feature of this year’s Auroville International Potters’ Market\n\nA customer’s interest is naturally piqued when he or she can witness the craft behind the product they plan to purchase.\n\nVisitors to this year’s Auroville International Potters’ Market will get to see just that at the ‘demo tent,’ the new addition to this edition.\n\nEvery afternoon, participating potters will show basics like ‘throwing on the wheel’ and ‘hand building’ techniques in ceramic pottery. Some workshops like Raku by Welsh potter Jane Malvisi and Hayu slip by Ange Peter of Forest Pottery, Auroville, preceded the market.\n\nThe second edition of the Auroville International Potters’ Market from January 23 to January 26 has 27 participants, with stalls from across India and those from international potters in Auroville, having tableware, homeware, jewellery and decorative pieces in stoneware, earthenware, terracotta and slipware.\n\nEach product has a price ceiling of Rs. 4000.\n\n“The speciality of this potters’ market is that the products are handmade. It is a place to exchange ideas among potters and for them to showcase their work,” says Ms. Peter, who is one of the organisers of the market.\n\nShe adds that bringing together different potters is also a way of striving towards the Auroville goal of human unity.\n\nThe market also provides the opportunity for potters like Ms. Peter who is generally involved in sculpture and gallery art to make special products. Her limited edition ‘Mug for Life’ has 24 karat gold plating and comes with the promise of being replaced if broken.\n\nThe market is also a platform to showcase different methods of technique and material.\n\nIndrani Singh, a potter based in Puducherry, showed how she turned clay found near Ossudu Lake into a decorative object. Ms. Singh also showed decorative pieces made using ‘lustre firing’ which is essentially a low-temperature method which traps carbon, she explains.\n\nHer attempt was to show the different things in ceramic apart from stoneware.\n\n“The aesthetic of wood-fired pottery is the speciality here. Other cities do not have wood-fired kilns. One can learn from the different potters here. It is also easier to source material. Many of the potters make their own clay here,” says Ishaan Lamba from Delhi who is on a residency programme with Golden Bridge Pottery studio, headed by Ray Meeker and Deborah Smith who are considered the pioneers of glazed stoneware handmade pottery in South India.\n\nThere are around nine studio potters in Auroville, and another five in the bio-region, says Sabrina, co-organiser of the market. Ms. Sabrina, has among products in her stall, wood-fired and gas-fired pottery, allowing visitors to appreciate the difference between the two.\n\nWith last year’s market having made around Rs. 5.5 lakh, organisers have set a target of Rs. 10 lakh this time.", 
    "section": "national", 
    "title": "A glimpse into the art of pottery", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}