{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Conservationists urge residents to encourage sparrows to make parts of the city their homes again\n\nFor over five years now, Sadhana Rajkumar has been distributing wooden nest boxes, setting up spaces for bird baths and encouraging sparrows to make parts of the city their homes again.\n\nThe diet and fitness consultant said that so far she has distributed around 1,200 nest boxes. “Next week, I am going to distribute more on the streets of Besant Nagar and Tiruvanmiyur where I saw some sparrows nesting,” she said.\n\nShe is not alone. Other sparrow conservationists across the city are also quietly and resolutely continuing their efforts to ensure that the population of this passerine bird increases in the city.\n\nIn March, Ameer Rahuman of Ilam Piraigal is planning to get school students in north Chennai interested in sparrow conservation. “I will approach the schools and if possible, give the children nest boxes to set up at home. We may also do a rally about this,” he said.\n\n“The sparrow population in the city has declined considerably over the last two decades or so,” said T. Murugavel, project coordinator with Environment Monitoring and Action Initiating. The main problems, he said, are: no nesting places, no places to roost and lack of food.\n\nSome pockets of the city, however, continue to have these birds fly in every day — in north Chennai, in areas such as Perambur, Tondiarpet and Old Washermanpet, sparrows are frequently seen. The old-style homes and the larger number of trees make north Chennai more popular with sparrows, said Ms. Rajkumar — the fishing hamlets in Besant Nagar too, have many of the birds.\n\nSo what can you do? If you live in an area sparrows frequent, encourage more of them — get nesting boxes for them, said Ms. Rajkumar.\n\n“You can also place deep bowls of water for them to splash about and put in bird feeders with millets or grains. Try planting native species of shrubs such as nithya malli and gunda malli around your home — this too will help,” she said.\n\nInfobox:\n\nIf you live in an area sparrows frequent, encourage them:\n\nGet a nesting box and set it up on your balcony or veranda. The opening in the box should face south or west and the box should be at least 10 feet above ground level. Make sure cats, squirrels and crows do not get near the box.\n\nEnsure there is some sort of foliage around – try planting native species of shrubs such as nithya malli and gunda malli\n\nScatter grains – millet or paddy, or place them in a bird feeder\n\nSet up deep bowls or water for the birds to splash about in and if possible, set up mud baths too\n\nEncourage others in your building/neighbourhood to feed the birds too. If possible, set up sparrow gardens in neighbourhoods\n\nTo get free nesting boxes, call: 9445249240\n\nSource: Sadhana Rajkumar\n\nIf you spot birds in your locality which are injured or are in danger, the Forest Department can be contacted at 044- 2220 0335", 
    "section": "national", 
    "title": "A sparrow spring, again", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}