{
    "author": [
        "S Prasad"
    ], 
    "text": "(Clockwise): Models of Subramania Bharati, Mother Teresa and other leaders made of flowers and fruits kept on display at the Flower Show on Saturday; Chief Minister N. Rangasamy inaugurates the sale of flowers and saplings; the show in progress.— Photos: T. Singaravelou\n\nThe 30th flower, fruit and vegetable show was inaugurated at the Government Botanical Garden in Puducherry\n\nThe Government has initiated several progressive measures to boost agricultural production and also to encourage farmers through various packages and incentives to stabilise farm production in the Union Territory, Chief Minister N. Rangasamy has said.\n\nInaugurating the 30th Flower, Fruit and Vegetable show cum Farm Fest at the Government Botanical Garden here on Saturday, he said that although conversion of agricultural land for development of industries had brought down the area under agriculture in the Union Territory, the Government was keen on increasing production through latest technologies.\n\nMr. Rangasamy said that the total area under agriculture which was around 25,000-30,000 hectares in the UT during 1991 had now reduced to 15,000-20,000 hectares. He called upon the farmers to adopt innovative farm practices and updated technologies so that Puducherry could become self-sufficient in agricultural production.\n\nReferring to the havoc caused by the recent rains and subsequent flooding, he said that the Government had disbursed Rs.23 crore to farmers for crop damage. All the cardholders in Puducherry and Karaikal regions were also being covered under the distribution of rain relief, he added. The Chief Minister also went around the stalls and interacted with the participants.\n\nVisitors to the flower show were treated to a riot of colours with varieties of roses from Pune and Bengaluru, mocara orchids imported from Thailand, varieties of anthuriums, dahlia, marigold, petunia, zinnia, Chinese balsam and other foliage plants kept on display on the premises.\n\nModels of the Aayi Mandapam and vegetable carvings of former President A.P.J. Abdul Kalam, Mother Teresa, and Subramania Bharati were the highlight of the show.\n\nFloral arrangement, Japanese Ikebana arrangement, cut-flower collection and arrangement, fruit and vegetable carving, replicas of vegetable garden and orchards which have been created by the Department of Agriculture and other institutions have also been kept on display.\n\nA number of competitions have also been organised like best private and institutional garden, rose garden, medicinal and herbal gardens, floral rangoli, best bonsai and best displays.", 
    "section": "national", 
    "title": "Adopt innovative farm practices: Rangasamy", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}