{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Fearing threat to their lives, the childless couple handed over the child to government authorities\n\nThe district police have registered a First Information Report (FIR) against a couple for allegedly harassing a childless couple and demanding money from them after giving them their girl child in ‘adoption’.\n\nAs the father of the child, M. Sakthivel, demanded Rs. 5 lakh from the childless couple and threatened them over phone as well as in person, the couple offered to return the child. But Sakthivel refused to accept the child and demanded that they pay the money, the police said.\n\nFearing threat to their lives, the childless couple handed over the child to government authorities to be taken care of under the ‘cradle baby scheme’.\n\nActing on a complaint preferred by a relative of the childless couple, the police registered a case against Sakthivel and his wife Kavitha under Sections 294 (b), 323, 506 (I) of the Indian Penal Code and Section 4 of the Women Harassment Act.\n\nThe police said that Kavitha, mother of two daughters, delivered her third child, also a girl, at a private clinic here in October , and offered to give the baby to a childless couple.\n\nThe chid was given to the childless couple on mutual consent without any legal procedures for adoption being followed, they added.\n\nAs Sakthivel and Kavitha refused to take back the child, Child Welfare Committee (CWC) handed it over to Grace Kennett Foundation, a Madurai-based adoption centre, for 60 days’ custody.\n\nConflicting reports\n\nAs there were conflicting reports with Sakhivel alleging that his child went missing from the private clinic, Child Welfare Officer R. Sakunathala asked Human Trafficking Wing of the police to investigate the matter. The police said that Sakthivel’s house was locked and he could not be traced for questioning.\n\nMs. Sakunthala said that when the CWC asked Sakthivel and his wife to take back the child, Sakthivel refused, stating that he was not sure whether the child was theirs, and insisted on a DNA test to prove its parentage.", 
    "section": "national", 
    "title": "Case against couple for harassing ‘adopted’ parents of their child", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}