{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Justice V. Ramasubramanian of the Madras High Court on Saturday reeled out statistics related to alarming increase in Non-Performing Assets (NPA), and said that it was unfortunate that civil courts had failed in assisting banks to recover their dues on time.\n\nInaugurating a workshop on ‘Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest (SARFAESI) Act, 2002’ for bankers and lawyers here, he said that even this legislation, considered draconian, had not been able to reduce the NPA considerably.\n\nHe said that there were 29 public sector, 19 nationalised and 13 private sector banks in the country apart from 43 foreign banks from 26 different countries having 334 branches in the country and 46 foreign banks from 22 countries operating representative offices in India.\n\n“The 334 foreign bank branches represent just one per cent of total banking branch network in the country but they account for seven per cent of total banking sector assets and around 11 per cent of profits,” he said.\n\nFurther quoting from Report on Trend and Progress of Banking in India submitted by Reserve Bank of India to the Centre, he said that the total amount of advances made by public sector banks in 2013 was Rs. 40,559 billion and the NPA was Rs. 1,559 billion but the corresponding figure for 2015 rose to Rs. 49,161 billion and Rs. 2,671 billion respectively.\n\nSimilarly, nationalised banks made advances to the tune of Rs. 28,061 billion in 2013 when their NPA was Rs. 959 billion but the corresponding amounts rose to Rs. 34,315 billion and Rs. 1,962 billion respectively in 2015.\n\nAll scheduled commercial banks, excluding foreign banks, had made advances to the tune of Rs. 63,548 billion in 2015 and their NPA was a whopping Rs. 2,987 billion, he said.\n\nOn the status of recovery of dues by the banks, he said that in 2014-15, 91.31 lakh cases involving Rs. 887 billion were referred to lok adalats but only Rs. 43 billion could be recovered. In the same year, 1.71 lakh cases involving Rs. 3,789 billion were referred to Debt Recovery Tribunals and the banks could recover only Rs. 531 crore.\n\nHowever, out of the 12.41 lakh cases, involving Rs. 4,705 billion, dealt under the SARFAESI Act, the banks were able to recover Rs. 1,152 billion.\n\nNevertheless, of the total number of 1.05 crore cases involving Rs. 9,381 billion dealt with under all the three modes of recovery in 2014-15, the banks could recover only Rs. 1,726 billion, he lamented.\n\n“Data available with the Finance Ministry shows that just 30 companies together owe Rs. 16,877 crore to public sector banks as on September 30, 2013… This is probably because borrowers think that it is not in their interest to pay the principal and it is not their principle to pay interest,” he said, amidst a hearty laughter.\n\nR.S. Garg, Executive Director, National Housing Bank, and Pala Ramasamy, convenor of the workshop, and others spoke at the inaugural of the two-day workshop organised by Centre for Advocating Research and Education based here.", 
    "section": "national", 
    "title": "“Civil courts failed in assisting banks to recover dues”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}