{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Residents remove the fence after officials, police leave the place\n\nResidents of a host of residential colonies protesting against the Coimbatore Corporation fencing off a portion of the reserved site in Reliance Garden in Singanallur.– Photo: S. Siva Saravanan\n\nThe Coimbatore Corporation on Saturday fenced off a portion of a reserved site in Reliance Garden amid opposition from Councillor S. Balan (Ward 62), and residents of neighbouring localities.\n\nSoon after the corporation officials and the police left, residents removed the fence. A resident said that they had removed the fence to gain access to the Trichy Road.\n\nAccording to sources, following instructions from senior officials, a team from the Town Planning wing fenced off the 100-cent reserved site in Reliance Garden that had been in use as a pathway. The rest of the reserved site is a park.\n\nAt the time of layout formation in 2005, the developers had earmarked nearly 100 cents as reserved site, and then obtained approval from the Directorate of Town and Country Planning.\n\nThis site was close to the reserved site of Sri Krishna Garden.\n\nThe corporation had developed a park on the reserved sites leaving out a strip of land to be used as pathway.\n\nBut there were efforts to first use the pathway for a bicycle stand and then for a gym.\n\nThe residents of Reliance Garden took objection to the move and approached a Coimbatore court for fencing off the pathway to be used as park.\n\nThe court had ruled in their favour in 2008. A Coimbatore Corporation appeal against this order was dismissed the next year.\n\nThereafter, as the corporation did not act, the residents moved the senior Municipal Administration officials, who asked the civic body to act. Based on the instructions, the Corporation’s Town Planning wing officials on Friday attempted to fence off the land in vain.\n\nOn Saturday they returned with police protection and fenced off the land.\n\nMr. Balan and residents of Sri Krishna Garden and a few other areas alleged that obstructing a pathway used by residents for long time was unfair.\n\nMr. Balan termed the action illegal and wanted the officials to remove the fence.\n\nK. Loganathan, a resident of Sri Krishna Garden, said that by fencing off the pathway, the residents of the area, Krishnapuram Medu, Andal Layout, and Iyer Layout among others would be forced to take a circuitous route to Trichy Road.", 
    "section": "national", 
    "title": "Corporation retrieves reserved site in Singanallur", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}