{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“Issues like harassment while travelling in buses still persist in the village”\n\nDalit families in Kuruvithurai near Sholavandan complained to the National Commission of Scheduled Castes (NCSC) team which inspected the village on Saturday that discrimination by caste Hindus was going on for long culminating in the violence last week in which more than 20 Dalit houses were damaged and at least eight injured.\n\n“We are in a way happy that the incident happened now since it has helped in bringing out our hardships to light,” said M. Madurai Veeran, an elderly Dalit man. Only around 450 people belong to Dalit community in Kuruvithurai, which has a total population of more than 3,000.\n\n“The caste Hindus don’t like the fact that we are also coming up in life, taking up jobs and dressing properly,” said A. Sathish Kannan, a youngster who is a tailor.\n\nRefuting the allegations by caste Hindus that a provocative song played by Dalits in loudspeaker during Pongal triggered the incident, Mr. Sathish said that they were playing only movie songs.\n\n“The song they were pointing out apparently had a line saying that “enough being slaves and it is time to retort”. It was not played intentionally. On the contrary, during their (caste Hindus) functions, they play songs glorifying their caste throughout,” he said. The Dalits alleged discrimination in providing of basic amenities and allocation of government schemes to their areas. Many villagers alleged that issues like harassment while travelling in buses, double-tumbler system where plastic cups were used for Dalits in teashops still persisted in the village.\n\nAs many Dalits alleged that they were not allowed to buy from the PDS shops located in the caste Hindus dominated area on all days, revenue officials now ordered to open a part-time PDS shop in the Dalit area soon.", 
    "section": "national", 
    "title": "Discrimination going on for long: Kuruvithurai Dalits", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}