{
    "author": [
        "P V"
    ], 
    "text": "No difference between AIADMK and DMK: CPI (M) leader\n\nIt is for the DMDK to decide if they want to be part of People Welfare Front (PWF), said G.Ramakrishnan, State secretary of Communist Party of India (Marxist) here on Saturday.\n\nSpeaking to the media in Dharmapuri ahead of the party’s constituency conference in Pennagaram, the CPI (M) leader added it was for Mr. V ijayakant or Mr. Vasan (TMC) to decide on their alliance partners.\n\nThere was no difference between the AIADMK and the DMK, be it on corruption, economic policies, divisive politics; or issues of social justice. Both the parties pursued pro-capitalist economic policies, just as the Congress and the BJP pursued at the Centre, he said.\n\nThe leaders of both parties were facing corruption charges; and had never taken a principled stand on issues of social justice.\n\n“When a CPI (M) member raised a query on special legislation to deal with honour killings in the State, the then Chief Minister O. Paneerselvam denied the occurrence of any honour killing in the State.\n\nDMK leader Stalin, who was in the Assembly, raised no objection to his statement,” said Mr. Ramakrishnan.\n\nBrushing aside doubts over the stability of the alliance formed by the MDMK, CPI (M), CPI and VCK, Mr. Ramakrishnan explained that the PWF was formed in June 2015, almost a year ahead of the elections with a promise of providing an alternative politics to people of the State. The front was not an arrangement of convenience with an eye on the elections, Mr.Ramakrishnan said.\n\n“Different methods were adopted in the past, and the parties had themselves allied with the two Dravidian parties. But none of the groupings had helped people of the State.”\n\nLater, he told The Hindu the challenges faced by the PWF by caste-based politics of the PMK and smaller outfits that had rallied along caste lines. Mr.Ramakrishnan said that alternative politics meant an alternative to not just the two Dravidian parties, but also to the Congress, BJP and also the divisive politics of parties such as the PMK.\n\nAccording to Mr. Ramakrishnan, there has been a sharp fall in economic growth from 21.92 per cent in 2011 to 14.68 in 2014.\n\nThe number of unemployed registered with the employment exchange was 73.95 lakh in 2011.\n\nBy 2014, the numbers had increased to 83.35 lakh, alleged the CPI (M) leader.\n\nConference\n\nOn January 26, the leaders of the constituent parties of the PWF will come together for Maatru Arasiyal Ezhuchi Maanaadu (alternative politics renaissance conference) in Madurai, with the participation of CPI (M) leader Sitaram Yechury and CPI leader Sudhakar Reddy.\n\nThe first leg of the campaign of Makkal Nala Kootani is likely to commence around February 7 and 8, in Cuddalore, Nagapattinam, Tiruvarur, and Thanjavur.\n\n“There is no rule that campaigning should begin only after seat sharing is decided upon between coalition partners,” Mr.Ramakrishnan added.\n\n‘The People Welfare Front is not an arrangement of convenience with an eye on the elections’", 
    "section": "national", 
    "title": "‘DMDK should decide on being part of PWF’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}