{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Show of strength:Marumalarchi Dravida Munnetra Kazhagam cadres taking out a procession while receiving Vaiko ahead of the party workers' meeting in Thoothukudi on Saturday.— Photo: N. Rajesh\n\nThe Dravida Munnetra Kazhagam is taking “all-out efforts” to woo cadres from other parties as it is getting weakened even as the Assembly elections are approaching fast, Marumalarchi Dravida Munnetra Kazhagam general secretary Vaiko has said.\n\nAddressing a party workers’ meet here on Saturday evening, Mr. Vaiko said that the DMK, which tried thrice in the past to break the MDMK by enticing its leaders and cadres through a range of allurements, had failed and bitten the dust as a few insignificant defections alone could be orchestrated. However, all these minor defections that in fact hurt him a lot could not harm the MDMK. Instead, their departure had purified and strengthened the party further.\n\n“The DMK, which is getting weakened in an unprecedented manner, is encouraging defections as it is desperately in need of cadre strength,” Mr. Vaiko said.\n\nHe came down heavily on the ruling All India Anna Dravida Munnetra Kazhagam for “adamantly refusing” to impose total prohibition in Tamil Nadu and the DMK for having introduced liquor to Tamils. “The women voters of Tamil Nadu will teach a befitting lesson to both the DMK and the AIADMK for having ruined their families with liquor,” he said.\n\nThe MDMK cadres took out a huge motorcade at Thoothukudi while receiving Mr. Vaiko near the Collectorate. Youths riding on over 200 bikes and cadres in 100 cars received Mr. Vaiko and took him to the meeting venue in a procession.\n\nWhen the rally was about to reach the function venue, the police stopped the motorcade, saying that the cadres could not be allowed to continue the procession as they had not obtained permission. As it triggered a heated argument between the police and the party cadres, senior police officers took up the matter with Mr. Vaiko, who was not prepared to dampen the cadres’ enthusiasm.\n\nOnly after continuing the rally via old bus-stand, Cruz Fernandez Statue, Old Corporation Building, VE Road and Balavinayagar Temple Street, the processionists reached the venue after garlanding the statue of C.N. Annadurai near vegetable market.", 
    "section": "national", 
    "title": "“DMK wooing other party cadres”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}