{
    "author": [
        "S P"
    ], 
    "text": "He has decided to wait for visceral analysis report\n\nThe doctor who conducted the post-mortem on Syed Imthiyas (24), whose body was found near the tracks at Omalur on Thursday, at Government Mohan Kumaramangalam Medical College and Hospital, has reserved his opinion on the cause of the death, preferring to wait for the visceral analysis report.\n\nK. Gokula Ramanan, Head, Department of Forensic Medicine, Government Mohan Kumaramangalam Medical College, in his report said that grease was smeared all over the body and there were several ant bite marks. Injuries were found on forehead, knees and abrasions on the back of right shoulder. Also, the brain was crushed and the skull had a fracture, the report said. The report concluded that the viscera was sent for chemical analysis.\n\nOn Saturday, his parents - Syed Sultan and Piyari Begum - met C. Sridhar, Inspector General of Police, West Zone, at the Office of Superintendent of Police in Salem and demanded a copy of the autopsy report.\n\nAfter the request was given in writing, a copy of the post-mortem report was handed over to them. The parents had earlier protested outside the hospital, refusing to accept the body. They suspected that Imthiyas had been murdered, as he had been in love with a Hindu girl. Some people had warned him against pursuing the girl, they alleged.\n\nMr. Syed Sultan has demanded a murder case be filed and that the case be transferred from the Railway police to the Omalur Police, and also that a second post mortem be done.\n\nThe body of the autorickshaw driver was found near the railway track in Omalur on January 21. The Dharmapuri Railway police registered a case and sent the body to the Salem GH and the postmortem was done the same evening.\n\nSince his parents refused to receive the body, it was kept at the mortuary and police personnel were posted on the premises to prevent untoward incidents.\n\nThe body of the auto driver was found near the railway track in Omalur on Jan. 21", 
    "section": "national", 
    "title": "Doctor reserves opinion on cause of Muslim youth’s death", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}