{
    "author": [], 
    "text": "ERODE\n\nBannari Amman Institute of Technology: Inauguration of BIT Trophy 2016 - Inter-Collegiate Staff Cricket Tournament, 8 a.m.; NSS Special Medical Camp by PSG Hospital team, 10 a.m.; Awareness programme on Organic Farming and Skill Training, Panchayat Union Elementary Schools, Kaliyappagoundanpudur and Vettuvanpudur, 6 p.m.\n\nUnion Bank of India Officers’ Association - Tamil Nadu: 23rd General Body Meeting, inaugural address by Sanjay Sharma, General Manager, FGMO, Chennai, Hotel Club Melaange, 10 a.m.\n\nSALEM\n\nRamakrishna Mission Ashrama: Uma Maheswari speaks on ‘Bhagavad Gita’, 5.30 p.m.\n\nMecheri Arulmigu Badrakaliamman Temple: Maha kumbabishekam festival, Maha Ganapathi homam, Lalitha Sahasranamam, abishekam, alankaram, deeparadanai, 8 a.m..; music concert by Sirkazhi Siva Chidambaram, Sankar Ganesh and Malathi Lakshman, 7 p.m.\n\nSri Skandashramam Trust, Udaiyapatti: Thaipoosam festival, Ganapathi homam, 5.30 a.m.; mahanyasajabam, 6.30 a.m.; ko pooja, 7 a.m.; Sai bhajan by Salem Sai Sath Sangam troupe, 6.30 a.m.; abishekam and deeparadanai, 9.30 a.m.; maha deeparadanai, 12.30 p.m. and 6.30 p.m.; Veena concert by S. Sivakami Karunakaran, 4 p.m.\n\nShree Parshwanath Jain Trust: Sri Kesariya Swetambar Jain Temple Maha Kumbabishekam, poojas, 9 a.m.; devotional songs concert, temple premises, Sankarnagar,\n\n6 p.m.\n\nSalem Sangeetha Vidwath Sabha: Carnatic music concert by Lalitha Rukmani of Kalakshetra, Chennai, Dr. Vijayaragavachariar manram, Cherry Road, 6.15 p.m.\n\nIndian Medical Association: College of General Practitioners –Salem sub-faculty, continuing medical education programme, A.K. Kannan, consultant physician, speaks on ‘stress busters for doctors’, M. Muthukumaran, presides, Dr. Sundaravaradachariar memorial hall, IMA premises, 6 p.m.\n\nPaalam book stall: Readers Forum, T. Senthilkumar reviews the book ‘War and Peace’ authored by Leo Tolstoy, Advaitha Asrama road, 11 a.m.\n\nNeuro Foundation and Rotary Club of Omalur: Free medical counselling camp by R. Natarajan and team, South Indian Matriculation Higher Secondary School, Panjukalipatti, 9 a.m. to 2 p.m.\n\n12 Tamil Nadu Battalion NCC: Mini marathon for NCC cadets, CSI Polytechnic College, 6 a.m.\n\nKnowledge Institute of Technology and Confederation of Indian Industry Salem: Faculty Development programme on ‘personal effectiveness to organisational excellence’, P. Suresh Kumar, Director, Research and Industrial Consultancy, resource person, 10 a.m.\n\nIndian Medical Association – Salem branch: Installation of M. Muthukumaran as president and his team of office-bearers, N. Muthurajan, State secretary, IMA-Tamil Nadu branch, chief guest, J.A. Jayalal, president-elect, IMA Tamil Nadu branch, R.M. Krishnan, former State president, IMA Tamil Nadu branch and others speak, P. Manivannan presides, IMA premises, 6.30 p.m.\n\nBharathi Vidyalaya Higher Secondary School Old Boys Association: Anniversary, free heart and diabetes screening camp in association with Bengaluru Narayana Health City, Yuvabaharathi Matriculation School, 10 a.m.\n\nNational Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nCooptex: New Year and Pongal handloom textiles exhibition, Bose Maidan, 10 a.m. to 8 p.m.\n\nNAMAKKAL\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}