{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Students of Government Polytechnic College, Karaikal, present a mime on the need for young voters' to participate in the elections.— Photo: T. Singaravelou\n\nAs a prelude to the forthcoming Assembly election, the Election Department on Saturday conducted a mock poll to demonstrate to young voters the polling process.\n\nInspired by innovative idea introduced by the Election Department of New Delhi and following instructions of Election Commission of India (ECI), the Election Department has been conducting a three-day Youth Voters Festival 2016 to encourage young voters to participate in the democratic process.\n\nBreaking away from stereotyped speeches on democratic principles, ‘Ballot’, the second day program of the festival started with flash mob dance of Government Engineering College, Puducherry that surprised the young audience.\n\nA mime performance was also staged by Government Polytechnic, Karaikal, which stressed that all young voters should come forward to vote to ensure 100 per cent participation in the democratic election process.\n\nDistrict Collector D. Manikandan openly admitted that he did not vote when he was 18 years of age and cast his first vote when he was 23 after realising the importance of democratic duty. He also said there was not much motivation to youngsters in those days like the government agencies have been doing now.\n\n“Youth should come forward to vote at the time of polling. They should not harbour a bad impression of the political system and should have proper perspective on politics and social responsibility,” said Deputy Inspector General of Police Kannan Jagadeesan while addressing the gathering.\n\nLike an induction programme to a student while entering into college, the officials gave power-point presentation and slide shows on how the election machinery functions and the model code of conduct commences.\n\nLater, a mock poll started with real-time Returning Officer and Deputy Collector A. Vincent Rayar issuing notification for election to a constituency which was named as ‘Votupatti,’ students from the gathering filed their nominations along with proposers.\n\nLike real-time polling process, withdrawal, scrutiny of nominations, rejection and publishing list of candidates followed and symbols were allotted. The contestants were allowed to campaign their manifestoes to the voters.\n\nJ. Arvindanraj, a contestant said if he was elected, he would encourage the usage of cycles for the transport by giving incentives.\n\nMariya Theresa, another candidate said she would work for corrupt-free government if she won. Thus the contestants campaigned.\n\nModel polling booths were set up and over 400 voters cast their votes in electronic voting machines (EVMs). Results were declared and winners received certificates at the end of polling process.\n\nA. Muthamma, Art and Culture Secretary-cum- Chief Co-ordinator of SVEEP (Systematic Voters’ Education and Electoral Participation) said young voters have been scary of entering into polling stations located at government offices.\n\nAs per suggestion of International Institute for Democracy and Electoral Assistance, the mock poll was conducted to allay apprehensions of first time voters.\n\nModel polling booths set up and over 400 students cast their votes using electronic voting machines", 
    "section": "national", 
    "title": "Enlightening youth on poll process", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}