{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘If the benefits of growth have to reach everyone, then people must have access to education and health’\n\nChief Minister Jayalalithaa told the Assembly that growth has to be inclusive and this means ensuring that even the weakest sections of society enjoyed its benefits.\n\nIn her reply to the debate on Governor’s address in the Assembly on Saturday, Ms. Jayalalithaa said she is not looking at growth merely on economic terms. “The growth of gross state domestic product alone is not healthy growth. It may help the country prosper. If the benefits of growth have to reach everyone, then people must have access to education and health,” she said, emphasising that only such an inclusive approach would lead to equitable development.\n\nEmphasising that her government is pro-poor and to substantiate it, she said that the AIADMK government had increased funding for school education by 116 per cent in the past five years, compared to the previous DMK government.\n\nLikewise, the funding for higher education was only Rs. 6,142 crore during the DMK regime which had gone up to Rs. 14,906 crore in the AIADMK government.\n\nIn fact, the gross enrolment ratio in the State for higher education is the highest in the country at present, she said. In 2011 during the DMK rule, it was 18 per cent. The national average was 15 per cent. While the national average is 23.6 per cent now, the gross enrolment in the State is 44.8 per cent, an increase of 26.8 per cent, she said.\n\nSimilarly, the DMK government had spent Rs. 149 crore for first-generation graduates in engineering colleges, benefitting 78,045 students. “My government has spent Rs. 2,268 crore benefitting 2.84 lakh students [pursuing professional education],” Ms. Jayalalithaa said.\n\nIn the health sector, the government has spent Rs. 2,759 crore on the Chief Minister’s Health Insurance scheme benefitting 13.27 lakh persons. The government’s free sanitary napkins has benefitted 33 lakh adolescent girls in rural areas every year, she said, reeling out statistics to prove that maternal mortality rate and infant mortality rate had come down in the past five years.\n\n1 crore jobs\n\nAs per the Employees Provident Fund accounts, about 1.08 crore new jobs had been created in the past five years. The government alone had recruited over 3.03 lakh persons in its departments, she said.", 
    "section": "national", 
    "title": "Growth has to be inclusive, says Jayalalithaa", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}