{
    "author": [
        "Vijetha S N"
    ], 
    "text": "Officials file FIR against two, seize property, and collect over Rs. 2 lakh as fine\n\nThe Bengaluru Urban District Commissioner on Friday raided an illegal sand filter unit on land meant for a graveyard at Hemmigepura, Kengeri, which belonged to the Bruhat Bengaluru Mahanagara Palike (BBMP).\n\nAn FIR has been registered against two persons, who have been accused of illegally drawing sand and blasting it with water from the surrounding stormwater drain. Officials also seized the property and collected a fine of Rs. 2,78,000.\n\n“We reached the spot after getting a complaint from the Aam Aadmi Party (AAP) and caught the workers while they were filtering sand using the water collected in the stormwater drain that surrounds the property. There is lake nearby to which the stormwater drain is connected. They were using this as a channel to transport water to filter the sand,” Bengaluru Urban District Commissioner V. Shankar said, adding that it is possible that the sand could have been extracted from the lake.\n\nThe authorities have seized two tractors and 30 other odd-vehicles that were parked around the facility. “These were clearly being used to transport the filtered sand to areas out of the district. We do not know if it is a nexus or not. We are questioning two people in connection to this,” Mr. Shankar said. According to the State’s sand policy, those involved in illegally extracting or filtering sand are liable to be criminally prosecuted along with hefty fines. “The problem of sand filtering is getting rampant. This makes it the 32nd case that we have had in the last year-and-a-half. In this case, we have registered a FIR in the Kengeri police station against a private party and will investigate if there is any official involvement,” Mr. Shankar said.\n\nOfficials from BBMP said that although the land belonged to the civic body, action against those engaged in illegal activities could be taken by the police, the Urban District Commissioner or the Mines and Geology Department.\n\nAAP co-convener Ravi Krishna Reddy, who accompanied the officials on the raid, said that in such cases, low quality sand is usually sold at a premium to unsuspecting people. “Sand filtering is illegal. This has been running for months. When we reached the spot, we could see that the labourers were migrants from the north who did not seem to comprehend that they were engaged in illegal activities,” Mr. Reddy said.", 
    "section": "national", 
    "title": "Illegal sand filter unit hijacks land meant for graveyard", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}