{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The infighting in the Manithaneya Makkal Katchi, which took a turn in October last, seems to have surfaced to split the party again.\n\nM.H. Jawahirullah was removed from Manithaneya Makkal Katchi by its executive committee after a day-long meeting in the city on Saturday.\n\nThe decision was announced by Thameemum Ansari, who claims to have taken over the party’s leadership.\n\n'Instigating violence'\n\n“He has been removed for instigating violence against the members of the party. The executive committee has accepted the removal of Mr. Jawahirullah from its primary membership,” said Thameemum Ansari.\n\nHe also alleged that Mr. Jawahirullah tried to disrupt the executive committee meeting by sending goons. “Despite all this, the executive meeting went off peacefully. The executive committee has been given full authorisation by the cadre to decide on the alliance,” he said.\n\nHe accused the police of not doing enough to stop the violence.\n\nWhen asked if this expulsion would affect the alliance with the PWF, he said,“The alliance with the PWF is not the reason why Mr. Jawahirullah has been removed. This problem has been going for the last 5-6 years,” he said.\n\nPolice said that members of the Manitha Neya Makkal Katchi lodged a complaint with the Egmore police stating that their office had been ransacked by a group of people when their meeting was going on.\n\n“They claim that some people shouted slogans and damaged the property inside. We are investigating,” said a police officer.\n\nAbdul Samath, who claims that he is the party’s general secretary, was also removed by Mr. Ansari. However, in a statement, Mr. Samath claimed that Mr. Ansari had actually been removed from the party’s membership in October last year for disciplinary reasons. “This was welcomed at the executive committee meeting held in Madurai in November 2015. He is creating confusion by using the party’s names and flags. We will take action against him,” he said.\n\nM.H. Jawahirullah removed from\n\nparty by Thameemum\n\nAnsari", 
    "section": "national", 
    "title": "Infighting intensifies in MMK", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}