{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Thiruarutpa Ahaval parayanam 8 a.m., annadhanam, Railway Colony, 11 a.m.\n\nSri Meenakshi Sundareswarar Temple: Theppa thiruvizha, twelfth-day event, deity procession 5 a.m., teppakulam tank 10 p.m.\n\nSolaimalai Murugan Temple: Thaipusa thiruvizha, tenth-day event, theerthavaari mahapurnahuthi, Thai pusa abishegam, kalasa abishegam 10.30 a.m., deeparathana and deity procession, Solaimalai Mandapam, Alagarkoil, 5.30 p.m.\n\nSri Swami Tatwananda Ashram: Upanishad class by Swami Samanandar, P and T Nagar, 6.45 p.m.\n\nPaneeru Thirumurai Mandram: Pannisai by S.S. Mohanram, Adi Street 7 a.m., Discourse on ‘Periapuranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar, 5 p.m.\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama parayanam and puja, No. 21, Sambandamoorthy Street, 6 p.m.\n\nThe American College: Sunday vespers service, Dr. S. Wellington preaches, W. Prince Earnest leads, Jubilee Chapel, 6 p.m.\n\nChurch of Christ: Sunday service, Devamanickam speaks, Thanksgiving by M.S. Raja, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nCULTURE\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nGovernment Rajaji Hospital : Inauguration of Platinum Jubilee year celebrations, Minister for Cooperation ‘Sellur’ K. Raju, Minister for Health C. Vijaya Baskar, Health and Family Welfare Department Secretary J. Radhakrishnan, participate, Silver Jubilee Hall, Madurai Medical College, 5 p.m.\n\nCentre for Advocating Research and Education: Valedictory session of fourth workshop on SARFAESI Act, Justice D. Hariparanthaman chief guest, releases book on ‘Valuer’s guide’ authored by L. Balaji, DGM (Recovery), M. Karthikeyan receives first copy, DGM State Bank of India P. Sivakumar presides, Hotel Poppys, Ring Road, 4.15 p.m.\n\nJain Vidyalaya (CBSE): First annual day celebration, First Additional District Judge Deepthi Arivunithi, chief guest, distributes prizes, school campus, 6 p.m.\n\nAmerican College: Mini-marathon flagging off by Principal Dr. M. Davamani Christober and Col. Ujjal Singh, Officer Commanding 7(TN) NCC (Army), American College, 7 a.m.\n\nMadurai Green: Tree walk in association with Dhan Foundation, Paralipudur (Natham Road), 2 p.m.\n\nASSEFA: Gandhi darshan, community marriage for 108 couples, Gandhi Museum president T.R. Dhinakaran chief guest, ASSEFA Managing Director S. Loganathan presides, Gandhi Museum, 6 a.m.\n\nMaamannar Thirumalai Naicker Samooga Nalasangam: Celebration of 433{+r}{+d}birth anniversary of Thirumalai Naicker, president T. Radhakrishnan presides, garlanding statue, Palace Road, 9 a.m.\n\nTamil Desiya Periyakkam: Conference on “Mozhipor – 50,” R. Illankumaran inaugurates, Tamukkam Grounds, 9.30 a.m.\n\nMalar Trust: Seminar on “Thirukuralil Uyirsuzhal,’ Secretary to Govt. (Tamil Development) M. Rajaram, chief guest, Valluvakudil, T.Kallupatti-Rajapalayam Road, 10.30 a.m.\n\nVidiyal: Science forum, Dhinakaran addresses, 9.30 a.m., Fathers’ meet, 11.30 a.m., drawing and painting, Rathinapuram 2 p.m.\n\nAlcoholics Anonymous: Meeting, Krishna Iyer Community Hall, 7 p.m.; Alfred Noble Mat HSS, Tirunagar 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}