{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students of Government Arts College, Salem, at the youth motivation campaign organised by the Salem District Cooperative Union.\n\nThe motivation programme for students organised by the Salem District Cooperative Union created awareness on various programmes implemented by the cooperative bodies.\n\nThe event was held at the Government Arts College in the city on Thursday.\n\nC. Srinivasan, Joint Registrar of Cooperative Societies, in his inaugural address, said that the cooperative movement and the cooperative bodies played a vital role in improving rural economy. Many cooperative societies have been time and again registering profits and have set worthy example for others to emulate. This was mainly possible due to the support extended by the people, he said. The Tiruchengode Agricultural Producers Cooperative Marketing Society has set up a self-service unit, LPG distribution unit, gasoline retail outlet and they are functioning successfully.\n\nThe cooperative movement has been serving the tribal community too in an effective manner through the Adivasi multipurpose cooperative (LAMP) societies. The 19 LAMP societies functioning in the State have ensured in improving the living condition of the entire tribal community.\n\nThe cooperative movement is also playing a pivotal role in the distribution of essential commodities to the public through innumerable fair price shops, he said. The department is reaching out to the student community by launching student cooperative stores in different educational institutions, Mr. Srinivasan added.\n\nMalarvizhi, Deputy Registrar of Cooperative Societies; Kandasamy, Managing Director, Salem District Cooperative Union; Tamil Mangai, Principal, Nachiappa Cooperative Management Institute; Sureshbabu, Head of the Department of Cooperation, Government Arts College, and a host of officials from the cooperation department spoke on the occasion.", 
    "section": "national", 
    "title": "Motivation programme for students", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}