{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Central Marine Fisheries Research Institute (CMFRI) would launch a month-long National Marine Fisheries Census- 2016 from February 1 in all maritime states and two Union Territories of the country involving an outlay of Rs. 3.8 crore.\n\nThe island regions of Andaman and Nicobar and Lakshadweep would be enumerated under the supervision of Fishery Survey of India, a release from CMFRI, a body under the Indian Council of Agriculture Research (ICAR), here said.\n\nThe exercise would cover collecting information about marine fishermen families, fishing crafts and gears, social and educational profile and demographic features of marine fishing villages, it said.\n\nThe census, funded by Department of Animal Husbandry, Dairying and Fisheries (DAHDF) of Union Ministry of Agriculture and Farmers Welfare, would be coordinated by the staff of the regional, research, field centres and headquarters of ICAR-CMFRI located along the maritime coast of the country, the release said.\n\nAbout 3,000 enumerators trained by the ICAR-CMFRI officials would visit 11 lakh fishermen families spread across 4,250 marine fishing villages located in 73 districts to collect the details, it said. “The entire process will be monitored and supervised by around 220 officials of ICAR-CMFRI posted at the 26 centres,” it said.\n\nIn Tamil Nadu, 564 fishing villages in 13 coastal districts and 27 fishing villages in the Union Territory of Puducherry will be covered under the census.\n\nThe data would be analysed by the scientists of ICAR-CMFRI to develop a comprehensive census database, which would be helpful in facilitating formulation of fisheries related plans and policies in the marine sector, the release said. The last census was carried out in the year 2010, it added.", 
    "section": "national", 
    "title": "National Marine Fisheries Census from February 1", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}