{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Many city schools will begin the process in February. For the parents though, it began a few months ago\n\nVidya Sujai is through with the rigmarole of admissions. Her three-year-old has gotten into a CBSE school in the city. Getting here was however not easy. Ms. Sujai began to look for a school in December, because some schools started giving out forms then.\n\n“I had zeroed in on three schools which I thought would be good for my daughter. The school where she has joined, issued the forms in December and had an interview earlier this month for us parents and the child following which she was selected,” she said.\n\nIn February, the admission activity is bound to intensify.\n\nWhile a few matriculation and CBSE Schools started issuing application forms in December, many others are set to start the process from February and March. The principal of a private school in the city on condition of anonymity said that they were going to start the admission process from mid-February and would keep aside the required seats for the RTE act.\n\nHowever, a few schools are already done with their nursery admissions this year.\n\n“A few schools began their admission process as early as November and are already done with it. Many parents like me were not aware that admissions were on at some of these schools,” a parent said.\n\nTo escape the mad rush of admissions in many major schools which are highly favoured, many parents have taken to admitting their wards in exclusive nursery schools which have only Pre-KG, LKG and UKG.\n\n“Till about two years ago, we used to get a lot of children who used to come ahead of school interviews to be taught basic concepts, which include colours and shapes. While many schools have dispensed with tough interviews for small children, parents have also taken to approaching nursery schools where the admission process is easier,” said Sapna Dugar, who runs Worldly Wise, an activity centre in Kilpauk.\n\nRaghavan, who is looking to admit his son in LKG in a top State board school in the city in February or March, said that since his son had attended Pre-KG at a playschool, he was confident of securing a seat.\n\n“Children are now simply taken into a class and encouraged to interact with the other kids and are then observed by the teachers there. They are asked to participate in some simple activity,” he explained.\n\nOffice bearers of various school associations have expressed concern over the lack of regulation in the admission processes.\n\n“It is not uncommon to see parents queuing up outside popular schools in the city for admission forms from the previous night. Even for nursery classes, we have been hearing of recommendations being sought from politicians and industrialists which is worrying,” said K.R. Nandhakumar, from the Tamil Nadu Nursery, Primary, and Matriculation Schools Association.\n\nAnanda Arumugam of the Tamil Nadu Nursery, Primary, Tamil Nadu Nursery, Primary, Matriculation & Higher Secondary Schools Welfare Association said that they had been appealing to the State government for the last 15 years to enforce rules pertaining to the admission.\n\n“A common procedure should be followed. That applies to the dates of distribution of applications. Many don’t known when admissions begin and lose out on opportunities,” he said.\n\nMost matriculation and CBSE schools will start issuing applications forms this month", 
    "section": "national", 
    "title": "Parents feel the pressure as admission season begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}