{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The People Studies, a multi-disciplinary research institute, has come out with an exit poll claiming that the All India Anna Dravida Munnetra Kazhagam (AIADMK) is likely to get a slender lead over its rival, the Dravida Munnetra Kazhagam (DMK) if polls were to be conducted today.\n\n“At this point of time, when concrete electoral alliances are yet to be formed, 33.3 per cent say that they would vote for AIADMK, while 33.1 per cent say they would vote for the DMK. However, when asked to take a guess on who is likely to form the government, the sample size felt that DMK-led front would form the government,” said Rajanayagam, director, People Studies, as he explained the results of the survey on Saturday.\n\nThe survey, which covered 39 parliamentary seats and 120 Assembly constituencies in Tamil Nadu, had a sample size of 5,464 people. “The demographics of the sample size had representations from Scheduled Castes (19.8%), MBCs (28.9), OBCs (41.2%),” he said.\n\nInterestingly, the survey shows that less than one per cent criticised the freebies scheme.\n\n“Around 23.6 per cent of people considered the mixer, grinder and fan given by State favourably, while the free laptop schemes were appreciated by 21.1 per cent of the people. The rest were appreciative of pension for elderly and financial help for conducting marriages. These policies were received well as it gave poor people a better quality of life,” he said.\n\nCompared to the results of surveys conducted in November 2014 and August 2015, the January 21016 survey shows that the DMK’s vote share has increased by 7.1 percentage points, while the AIADMK’s vote share by almost 10 percentage points.\n\nVijayakant’s popularity\n\nThe survey also points out that the public behaviour of Vijaykant, president of Desiya Murpokku Dravida Kazhagam, had not dented his reputation in the eyes of the public. Around 56.4 per cent have said that this was not a problem, while 12. 4 per cent believe that his popularity had increased.\n\nMr. Rajanayagam also said issues such as Sri Lankan Tamils, jallikattu and a push towards prohibition had a strong resonance with the Tamil community, but may not count at the polling booth.\n\n‘Biased survey’\n\nTamil Manila Congress leader G.K. Vasan criticised the survey conducted by People Studies for not being very thorough and accused it having ulterior motives. “With an intention to confuse the minds of people, People Studies has done a survey taking feedback from just 5,464 people. It doesn’t reflect the mindset of people of Tamil Nadu. It is not a balanced and an unbiased survey,” said G.K. Vasan in a statement to the media.\n\nHowever, it says the DMK-led front is likely to form\n\nthe next government", 
    "section": "national", 
    "title": "Slender lead for AIADMK as of now, says survey", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}