{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The death of Rohith Vemula, a research scholar of the University of Hyderabad, should be condemned in the context of inequalities and discrimination prevailing in modern institutions in urban spaces, which were supposed to be egalitarian, said speakers at a meeting organised by the People’s Watch here on Saturday.\n\nThey pointed out that discrimination in the name of caste was apparent and tangible in rural areas whereas it was silent and subtle in urban spaces.\n\nHenri Tiphagne, Executive Director, People’s Watch, said that the silent discrimination in the name of caste would grow if the protest was muted and regretted that the suicide of Rohith was yet to create an impact in local colleges.\n\nStalin Rajangam, writer, said that the society and its systems were responsible for the death of Rohith, who had now converted his suicide into an agitation. The suicide revealed how modern urban institutions handled Dalits from rural areas, especially first generation students. He said that there was a political reason behind the death and it was time to ponder whether modern institutions really provided reprieve from an oppressive, caste-dominant rural life. Psychological repression was prevalent in different forms in all fields, he said and added that it would not be wise to look at it as a Dalit issue as it was a problem of the society.\n\nExecutive Director of Evidence, A. Kathir, said that Rohith had ignited a huge fire in the country by his death. He called for the arrest of the Union Minister of State for Human Resource Development and the Vice-Chancellor of the University of Hyderabad for abetting the suicide and said that the death was a social and democratic issue.\n\nP. Jeyapragasam, writer, felt that Dalit liberation would be the only solution to put an end to discrimination. P. Maniyarasan, president, Tamil Desiya Perriyakkam, accused the Hindutva forces of using educational institutions to spread hatred in the name of religion and said that the BJP was attempting to gain a foothold in Tamil Nadu by invoking casteism as it was aware that communalism would not sell here.", 
    "section": "national", 
    "title": "“Society and its systems responsible for death of Rohith”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}