{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Some of the birds found at Arugankulam near Tirunelveli during the bird census. — Photo: A. SHAIKMOHIDEEN\n\nThe midwinter Tamirabharani Waterbird Count (TWC) in select waterbodies of Tirunelveli and Thoothukudi districts for the sixth successive year commenced on Saturday. Along with volunteers, experts are also involved in the exercise, which will conclude on Sunday.\n\nAgasthyamalai Community-based Conservation Centre (ACCC), Manimuthar, and Ashoka Trust for Research in Ecology and Environment (ATREE), Bangalore, have joined hands with Pearl City Nature Society (PCNS), Thoothukudi and Nellai Nature Club (NNC) to conduct the waterbird count this year.\n\nThe perennial Tamirabharani feeds a larger network of irrigation tanks in both the districts. The Tamirabharani wetlands support over 90 species of waterbirds, including migratory birds.\n\nThere are important bird habitats such as Koonthankulam, Tirupudaimaruthur and Vagaikulam in Tirunelveli district and tanks in Srivaikundam region of Thoothukudi district that attract a large number of birds. Birdwatchers get to see various birds in these places.\n\n“With an increasing demand for water for both developmental needs and human use, these wetlands are under threat. The communities living around the wetlands should guard these precious natural resources against such changes for the benefit of both the people and biodiversity. The TWC is an effort to draw the attention of the local people to these wetlands,” said Mathivanan, Field Coordinator, ACCC, who is involved in the waterbird count around Gangaikondan.\n\nOver 67,000 birds were counted during the TWC last year with the help of volunteers in 53 irrigation tanks. “The number will increase this time, as most of the waterbodies in these two districts are brimming with water,” he said.\n\nThe enthusiastic volunteers, who were divided into several groups following a comprehensive orientation programme on identifying the water birds, visited the waterbodies to count the birds.", 
    "section": "national", 
    "title": "Tamirabharani waterbird count begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}