{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Disposal of cases pertaining to helmetless travel remains a challenge\n\nWhen Mohan Rajan’s (name changed) two-wheeler driving licence was seized near Gemini Flyover for not wearing a helmet, he was not too worried. He thought he could just pay the fine at a mobile court and get the document back. But, as it turned out, it was weeks before he got the licence back. The reason: insufficient number of mobile courts to handle the huge number of cases.\n\nBased on a Madras High Court direction in June 2015, the City police started the crackdown on motorcyclists without helmets from July that year. The policeman seizes the documents pertaining to the two-wheeler or the vehicle itself and gives a receipt for the same. After paying the fine at the mobile court, the motorist can take the document from the police station concerned.\n\nOn an average, 1,500 cases are booked by the police every day. However, there are only two mobile courts in the city to dispose of the cases.\n\n“On an average, each court disposes of over 250 cases per day. In a month, each disposes of nearly 7,500 cases. However, over 45,000 cases are booked per month. Hence, it is not possible for just two courts to clear everything,” said a police source.\n\nDelay\n\nDue to this, there is a delay in motorists getting back their documents or vehicles.\n\n“Many have to take leave to come and wait in the court. They have to follow the court wherever it goes. It is a pathetic situation,” added the officer.\n\nSources said the number of mobile courts should be increased to four.\n\n“Now there is an increase in traffic violation cases, especially drunk driving and helmet-less travel. They can also dedicate two days a week to disposing of the helmet-less travel cases alone,” said a retired judge.\n\nBesides, the two buses that function as mobile courts are in a bad shape.\n\n“They were introduced nearly twenty years ago. The ones in the district were given more recently and have facilities like toilets. But in Chennai, there is no such facility in the mobile court buses,” said a senior police officer.\n\nSome even felt that video-conferencing could be used to dispose of the cases.\n\n“The judge can sit in the respective Deputy Commissioner’s office and hear the cases using video-conferencing. This is the same methodology adopted in family courts,” added V.S. Suresh, a Motor Accidents Claims Tribunal lawyer.", 
    "section": "national", 
    "title": "The long road to delay", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}