{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Expert say while the hobby is time consuming, it also gives great joy to those interested in plants\n\nCasuarina, Water Jasmine, Ficus Green Island and Babul — these were some of the bonsai plants on display at the exhibition organised by the Chennai Bonsai Exotica. Some of these plants were nearly 40 years old.\n\nVisitors to the exhibition were provided information on the origins of the trees on display. They also found out what it takes to keep a bonsai at home.\n\n“Cultivating bonsai at home can be a time-consuming and expensive hobby, but gives immense joy to people who truly love plants,” said Vikram Thambuswamy, who had about 35 of his plants on display at the exhibition.\n\nWhile bonsai is known as the art of growing any tree in miniature using techniques such as pruning, wiring, defoliation and grafting, there are some who see it as cruelty to plants.\n\n“Saying that bonsai promotes cruelty to plants is a huge misconception. In today’s age, when gardens have become non-existent due to shrinking spaces, we are taking a bit of green into our homes with bonsai plants in addition to developing a hobby,” said K. Sivaji, president of the bonsai association.\n\nThe two-day exhibition concludes on Sunday (10 a.m. to 7 p.m.).\n\nRising interest\n\nWhile the association has 38 members now, Mr. Sivaji said that the interest among people to learn about bonsai cultivation had been steadily increasing.\n\n“Most of us who have been cultivating it for a while now deem it the highest form of meditation,” he said.\n\nInteracting with visitors at the exhibition, G. Raja, the association secretary, said that it was important to pick trees which are best suited for tropical climate, which the city has.\n\n“Most who have been cultivating it for a while deem it the highest form of meditation”", 
    "section": "national", 
    "title": "The art and science of bonsai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}