{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Ranganathaswamy Temple, Srirangam: Thai car festival, sapthavarnam, Namperumal purappadu from kannadi arai, 7 a.m.; reaching Santhanu Mandapam, 7.15 a.m.; thirumanjanam, 11 a.m.; purppadu from Santhanu Mandapam, 6 p.m.; reaching sanctum sanctorum, 8.45 p.m.\n\nArulmigu Mariamman Temple, Samayapuram: Thai poosam festival, Amman purappadu in Kannadi pallakku, 8 a.m.\n\nSri Andal Thirupaavai Mahotsava Sabha: Tirupaavai mahotsavam, Sri Vedanata Desikan Sannidhi, discourse by Sri V.Rajagopalachariar, Srirangam Srimad Andavan Ashram, North Chithirai Street, Srirangam, 10 a.m.; discourse by Sri P.B.Rajahamsam, 11 a.m.; discourse by Sri S.N.Sampath Kumarachariar, noon.\n\nSri Lakshmi Narayana Perumal Sannidhi, Keezha Valadi: Sri Radha Kalyana mahotsavam, 11 a.m.; thiruveedhi ula, 6 p.m.; Sri Anjaneyar utsavam, 10 p.m.\n\nSri Kanchi Sankara Mutt: Gayathri homam, North Street, Thiruvanaikovil, 8 p.m.\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha: Sri Seetha Rama Vivaaha viabhavam, sampradaya unchavruthi, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 7.30 a.m.; Sri Seeetharama Vivaham, 9 a.m.; Anjaneya utsavam, 4 p.m.\n\nHindu Samaya Mandram: Sri Radha Kalyana mahotsavam ashtapathi bhajan, 30 Rajaji Street, Renga Nagar, Srirangam, 8.30 a.m.; Nama sangeerthanam, 4 p.m.; divyanamam, dolothsavam, 8 p.m.\n\nSri Varasiddhi Vinayagar Temple: Thai poosam, abishekam to Subramanyar, Swarna pushpa arachana, Ganapathi Nagar, Thiruvanaikovil, 5.30 p.m.\n\nSrimad Ubhaya Vedantacharya Peetam: “Bhagavata Dasamaskandam” by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Udayalakshmi Flats, Raghavendrapuram, 6 p.m.\n\nCULTURE\n\nTiruchi Carnatic Musicians: TCM Vaihbav 2016, presentation of TCM Lifetime Achievement Award to Ambujam Vedantham, veteran vocalist, Sarubala R. Tondaiman, former Mayor, chief guest, Sri Akilandeswari Vidyalaya, Ganapathi Nagar, Thiruvanaikovil, 10 a.m.; ‘Thiruvarutpa’ – thematic recital by disciples of Ms. Vedantham, 11 a.m.; tribute to M.S. Subbulakshmi by G. Girish and party, 2 p.m.; musical discourse by Visaka Hari and party, 4 p.m.\n\nBharatiya Vidya Bhavan: Kalaiyurum Kaviri 2016 — music, dance and drama festival, keyboard recital by A. Rohith and party, Kalai Kaviri College of Fine Arts, 6 p.m.; ‘Malarum Manitham,’ drama by A. Patric and troupe, 7 p.m.\n\nGENERAL\n\nJCI Tiruchi and JCI Tiruchi Excel: Game show-cum-workshop for family members, R. Panchanadhan and Sankari Santhanam, participate, Saraswathy Bala Mandir, Srinivasa Nagar, 10 a.m.\n\nAkara Foundation for Education and Research: Parents’ Forum on future learning, Palani Rathinam, Chairman of Foundation, Sivakumar, Actor, Br. Selvanathan, former principal, Campion School, speak, Hotel Femina, 4 p.m.\n\nK.A.P. Viswanatham Government Medical College: Inauguration of Department of Minimal Access Surgery by C. Vijaya Baskar, Minister for Health, T.P. Poonachi, Minister for Khadi and Village Industries, R. Manoharan, Chief Whip, and J. Radhakrishnan, Health Secretary, speak, Mahatma Gandhi Memorial Government Hospital, 11 a.m.\n\nUzhaipor Urimai Iyakkam: Inauguration of Khajapettai branch, Madurai Veeran Kovil Street, Khajapettai, 5 p.m.\n\nTrichy Plus: Discussion with Shikha Kumar, author, V Cross, Fort Station Road, Thillainagar, 10 a.m.\n\nAIMAN College of Arts and Science for Women and UNWO: Muballika graduation, Sirajudeen Ahamed, correspondent, Saudiya Oriental Arabic Higher Secondary School, Chinthamanipatti, delivers graduation day address, 10 a.m.\n\nHindu Mission Hospitals, Tiruchi and Tambaram and Rotary Club of Tiruchi Midtown: Distribution of artificial limbs and registration of new beneficiaries, hospital premises, Anna Nagar, Thennur, 9 a.m.\n\nSharon, JCI Tiruchi Excel and GVN Hospital: Free medical camp, Panchayat Union Elementary School, Palayam, 10.30 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo-Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}