{
    "author": [
        "R Sivaraman"
    ], 
    "text": "catching them at the right time:Electo Fest\" - Puducherry Youth Voters' Fest - 2016 being held at the Kamban Kalai Arangam. (From Left) Deputy Collector A. Vincent Rayar, Art and Culture Secretary-cum-Chief Co-ordinator of SVEEP A. Muthamma, Chief Electoral Officer V. Candavelou and Deputy Collector S. Rajamanickam are seen the picture. (Below) Young voters taking part in the event.- Photos: T. Singaravelou\n\nAim of the 3-day event is to encourage more youth to vote\n\nWith an aim to encourage more number of youth to come forward to vote at the time of elections, a three-day ‘Electo Fest’- Youth Voters Festival 2016 organised by the Department of Elections got under way on Friday.\n\nA large number of youth who has enrolled as first time voters turned out at the festival held at Kamban Kalaiarangam here.\n\nInaugurating the festival, V.Candavelou, Chief Electoral Officer(CEO), Union Territory of Puducherry said, “There are 9.27 lakh voters in the Union Territory of Puducherry as per final electoral rolls released on January 11. Still some youth were left out. We were not able to catch all the eligible voters who attained the age of 18 years on January 1.”\n\nHe called upon more youth to turn out in large numbers at polling stations to exercise their franchise without fail. The CEO pointed out that the Election Commission of India (ECI) had instructed the Election Department to enroll all eligible voters who attained the age of 18 years on January 1 and special revision campaign was conducted and a final electoral rolls were released.\n\n“It is the duty of every individual to ensure that his or her name is in the list. Please do not hesitate to check the list which is available in the website of Election Department. People should not regret at the time of polling. As the continuous updation of electoral rolls is on, any omitted name can be included till the last date of filing nomination in each constituency,” said Dr. Candavelou while asking first time voters to participate in democratic process in large numbers.\n\nAdding that Puducherry had 85 per cent polling both in the last Assembly and Parliamentary polls, he said youth and first time voters should come forward to make it 100 per cent.\n\nHe called up the young voters to ensure that they did not fall a prey to inducements during elections and ensure that ethical voting was encouraged to have a free and fair poll.\n\nExplaining the object of organising the festival, A. Muthamma, Art and Culture Secretary-cum- Chief Co-ordinator of SVEEP (Systematic Voters' Education and Electoral Participation) said “We thought youth has to gain more knowledge on democratic principles.\n\nThey should be more knowledgeable on election process and democratic process, the way of election is being conducted and everything. Basically the programme is organised to enhance knowledge of youth on electoral process.”\n\nAt the festival, several distinguished persons are going to address the youth. An array of inter-collegiate programmes are scheduled. Flash mob, singing, dance, quiz, essay- writing and elocution competitions are among the fare being organised to attract youth.\n\nThe Election Department will also conduct mock election on Saturday.", 
    "section": "national", 
    "title": "Youth Voters Fest concludes today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-24"
}