{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The High Court had earlier rejected minority status to Sikhs in Punjab saying they were numerically strong. The judgment was later stayed by the apex court.—File Photo: Nissar Ahmad\n\nA Supreme Court Constitution Bench on Monday decided to examine whether a religious community should be granted minority status in a State where they are both numerically strong and suffer no apprehension of being “dominated” by others.\n\nThe case may see the Supreme Court take a re-look at the circumstances in which a State government declares a community a religious or linguistic minority.\n\nThe five-judge Bench led by CJI Tirath Singh Thakur has appointed senior advocate T.R. Andhyarujina as amicus curiae and asked the Centre to be impleaded in the case.\n\nThe case concerns a challenge by the Shiromani Gurdwara Parbhandak Committee (SGPC) of a Punjab and Haryana High Court judgment of December 2007, stayed later by the apex court.\n\nA Division Bench of the High Court had quashed notifications issued by the State government granting minority status to SGPC-run educational institutions. The notifications had allowed the SGPC to reserve 50 per cent seats in its institutions for students from the Sikh community.\n\nNo deprivation\n\nThe High Court had rejected minority status to Sikhs in Punjab on the grounds that the community was numerically strong. Moreover, it had held that the Punjab government had produced no material to show that Sikhs “apprehended deprivation of their religious, cultural or educational rights in the State from any other community, which may be in majority and which may gain political power in the elections.”\n\n“So the issue here is whether Sikhs are a minority or a majority in Punjab... This is a serious issue,” the CJI observed. “Can Muslims, who are in majority in Kashmir, still be treated as minority? Can Sikhs be minority in Punjab? Can Christians be minority in Meghalaya?” he asked. The Constitution Bench drew a parallel between the High Court’s conclusion in 2007 and the Supreme Court judgment in the 2005 Bal Patil case concerning the religious minority status of Jains.\n\nIn the Bal Patil judgment, the Supreme Court had held that a community should be protected as a minority only if there was an apprehension that the community may be “dominated” by other communities.\n\n“Minority as understood from constitutional scheme signifies an identifiable group of people or community who were seen as deserving protection from likely deprivation of their religious, cultural and educational rights by other communities who happen to be in majority and likely to gain political power in a democratic form of Government based on election,” the 2005 Patil judgment by then CJI M.N. Venkatachaliah had observed.\n\nThe case has been posted after four weeks for a detailed hearing.", 
    "section": "national", 
    "title": "Are Sikhs a minority in Punjab, asks SC", 
    "subsection": "general", 
    "date": "2016-01-19"
}