{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "Demands the arrest of Kanwar Lal Meena, who allegedly slapped peaceful protesters on Saturday\n\nTwo days after a mob attacked members of jawabdehi yatra in Jhalawar district’s Aklera region that saw the participation of several groups, including the Mazdoor Kisan Shakti Sangathan (MKSS) spearheaded by social activists Aruna Roy and Nikhil Dey, activists on Monday demanded the “immediate arrest” of BJP MLA Kanwar Lal Meena for allegedly beating up members with a lathi and slapping and abusing women activists.\n\nAddressing the media here, Ms. Roy said: “MLA Meena had 24 cases against him. The case we filed is the 25th. However, no action has ever been taken against him.” She said it was surprising that the MLA was not named a “history-sheeter” and was instead given a ticket by his party to contest the election.\n\nQuoting from an FIR filed by Rajasthan Administrative Service officer Ramniwas Mehta against Mr. Meena in 2005, Kavita Srivastava of the People’s Union for Civil Liberties alleged that the MLA had threatened to kill Mr. Mehta after placing a revolver on his temple.\n\nOn Sunday, State BJP president Ashok Parnami issued a notice to the MLA, who represents the Manohar Thana Assembly constituency, asking him to submit his clarification within seven days on his involvement in the violence.\n\nSpeaking to The Hindu , the MLA on Sunday denied any role in the violence. By Monday evening, 11 persons of the “30-35 unknown persons” mentioned in the FIR were arrested. Video clippings of the MLA indulging in violence were submitted to the police.\n\nJhalawar Superintendent of Police Rajendra Singh told The Hindu : “If we find that the MLA has participated in the violence, the case against him would be investigated by the CID-Crime Branch.” Mr. Singh confirmed that by Monday evening no action had been taken against Mr. Meena.\n\nCalling the assault “pre-planned”, Mr. Dey said it was an “attack on democracy” where goons wanted to inflict violence on people undertaking a peaceful yatra questioning the accountability of the government and raising awareness on government schemes across Rajasthan.", 
    "section": "national", 
    "title": "BJP MLA is a ‘history-sheeter’: Aruna Roy", 
    "subsection": "general", 
    "date": "2016-01-19"
}