{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "With former Union Minister Satyanarayan Jatia being appointed observer for the election of the new Uttar Pradesh BJP chief, the election for the party’s new State president is likely anytime now.\n\nThe State, which the BJP swept in the Lok Sabha polls but where its State-level apparatus is far from strong, goes to polls in 2017.\n\nThe party strategy in U.P., sources say, is two-pronged: there is high likelihood of an OBC leader becoming party chief, and it is expected that the name would be a low-profile one, who would serve more as an organisational figure than a public face.\n\nThe names doing the rounds are of OBC leaders Dharampal of the Lodh caste; Swatantra Dev Singh, a Kurmi; Keshav Maurya, who is Kushwaha by caste, and Scheduled Caste leader and Union Minister Ram Shankar Katheria. Some say Dinesh Sharma, a Brahmin, may be in the race, though some insiders suggest that an OBC leader is more likely to become party chief in the State.\n\nThe BJP’s winning formula in U.P. in the early 1990s was to garner the support of a chunk of non-Yadav OBCs to bolster a core of upper caste support in the State. OBC Lodh leader Kalyan Singh did the trick for the BJP at that time.\n\nThe upper castes constitute one-fifth of the State’s population. The party is looking to consolidate them and add small OBC castes — which are not comfortable with ‘Yadav dominance’ in the Samajwadi Party — to this core chunk to put up a fight in the State.\n\nThe task is not going to be easy. An organisationally weak BJP is unlikely to find it easy to combat powerful regional players in the BSP and the SP.\n\nBJP leaders suggested that an upper caste face may be projected as Chief Minister to cement the core. In Bihar, the party went to the polls without a face and lost. In U.P., the party will have to go to polls with a high-profile face to match BSP’s Mayawati and SP’s Akhilesh Yadav.\n\nAt present, however, the party is looking at the Assembly polls in 2016 in Assam. On Sunday, the BJP tied up with the Bodoland People’s Front to bolster its chances in the State.", 
    "section": "national", 
    "title": "BJP sets ball rolling to elect U.P. State chief", 
    "subsection": "general", 
    "date": "2016-01-19"
}