{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "In a submission that may indicate the Kerala government’s position on access to women aged between 10 and 50 to the Sabarimala shrine, the State asked the Supreme Court on Monday to call for the records of a 1991 judgment of the Kerala High Court, which held that the restriction was in accordance with a usage from time immemorial and not discriminatory under the Constitution.\n\nA Division Bench of the Kerala High Court had, on April 5, 1991, examined the Sabarimala Thanthri (chief priest) and upheld the restriction on women of a particular age group trekking up the holy hills and offering worship at the shrine.\n\nThe HC Bench of Justices K. Paripoornan and K.B. Marar held that the prohibition imposed by the Travancore Devaswom Board was not violative of Articles 15, 25 and 26 of the Constitution. Neither was it violative of the provisions of the Hindu Places of Public Worship (Authorisation of Entry) Act, 1965 as the prohibition was only in respect of women of a particular age group and not women as a class.\n\nThe HC also examined Ravivarma Raja of the Pandalam royal family, to which the temple belonged, and the Ayyappa Seva Sangham secretary. The judgment referred to the belief that the deity is a ‘Naisthik Brahmachari.’\n\nSenior advocate V. Giri, appearing for Kerala, urged the special three-judge Bench led by Justice Dipak Misra to summon the records of the 1991 case. “According to him, these customs and usages had to be followed for the welfare of the temple. He said only persons who had observed penance and followed the customs are eligible to enter the temple and it is not proper for young women to do so,” the 1991 judgment had said. Twenty-five years after this High Court judgment, the Supreme Court has questioned the “logic” behind the restriction, even wondering whether there was any proof that women did not enter the sanctum sanctorum 1,500 years ago.", 
    "section": "national", 
    "title": "Call for 1991 Sabarimala case records: Kerala", 
    "subsection": "general", 
    "date": "2016-01-19"
}