{
    "author": [
        "M L", 
        "Melly Maitreyi"
    ], 
    "text": "‘Technocrat’ Chief Minister N. Chandrababu Naidu has been invited to the crucial World Economic Forum’s annual meeting at Davos, Switzerland, from January 20 to 23.\n\nMr. Naidu is the only Chief Minister to be invited as a special guest and is among the three key dignitaries attending the Davos meet. The other two are Union Finance Minister Arun Jaitley and RBI Governor Raghuram Rajan.\n\nThe invitation to the prestigious and important WEF’s annual meeting is seen as a fillip to the Andhra Pradesh Chief Minister’s efforts to attract investments over the past one-and-half years.\n\nHis participation in the meeting, which will be attended by government representatives from across the world apart from business, industry and IT leaders, is seen as significant.\n\n“A platform like WEF paves the way to connect to world leaders — both from the government and the industry, and it will help bring visibility to the State and its leaders apart from explaining the policies, resources and potential of the State with its long coastline,” a senior official said.\n\nMr. Naidu, accompanied by Finance Minster Yanamala Ramakrishnudu, will lead a delegation of senior officials from Finance, Industry, Energy, Investment and Infrastructure, and will make a stopover at Zurich on January 19 to participate in the investors’ meet. He will make a presentation to the representatives of the Swiss industry, particularly food processing and luxury goods.\n\nMr. Naidu will co-chair at least half a dozen events on various topics at Davos. He has lined up bilateral meetings with CEOs of reputed multinational companies in many sectors, sources said. “It should go a long way in building bridges and creating confidence among investors about the Andhra Pradesh government’s commitment to the economic growth of the State,” said official sources.", 
    "section": "national", 
    "title": "Davos, a platform for Naidu to promote Andhra Pradesh", 
    "subsection": "general", 
    "date": "2016-01-19"
}