{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "The Ahmedabad police have charge-sheeted Hardik Patel and his aides for sedition and conspiracy to wage war against the state for launching a violent agitation under the banner of the Patidar Anamat Andolan Samiti (PAAS), which was not even a registered entity. This is the second case of sedition against him.\n\nThe 2,700-page charge sheet contends that the accused “ incited Patel community youths to resort to violence as part of their conspiracy to put undue pressure on the government to accept their unconstitutional demand for quotas in education and government jobs.”\n\nThe police claimed that “due to inflammatory messages sent by Hardik and his aides, the State witnessed violence that led to imposition of curfew in several areas.”\n\n“We have provided details regarding attacks on policemen and damage to public properties during the agitation,” said a police official involved in the probe.\n\nThe police have included statements of over 500 witnesses, including police officials, forensic experts and transport and railway officials. The police have also attached call data records (CDR) and call transcripts of mobile phones of those spearheading the agitation, CDs containing video and audio clips and WhatsApp messages.\n\nFIR registered in October\n\nThis is a second sedition case against 22-year-old Hardik.\n\nOn January 8, the Surat police had charge sheeted him for sedition alleging that he had “advised a Patel youth to kill policemen instead of committing suicide.”\n\nBesides Hardik, his three aides Chirag, Dinesh and Ketan also have been charge sheeted by the Ahmedabad crime branch that lodged the FIR against Hardik and others last October.\n\nMeanwhile, Hardik withdrew his bail plea from the High Court, which held that a fresh plea can be filed after the charge sheet is taken on record in the sessions court.\n\nPolice file 2,700-page charge sheet with statements of over 500 witnesses", 
    "section": "national", 
    "title": "Hardik Patel, aides charged with sedition again", 
    "subsection": "general", 
    "date": "2016-01-19"
}