{
    "author": [
        "National Bureau"
    ], 
    "text": "India and the European Union on Monday held a stock-taking meeting on “outstanding issues” — including duty cut on automobiles and wines/spirits as well as easier temporary movement of skilled professionals — which had stalled talks on the proposed bilateral free trade agreement (FTA).\n\nCommerce Secretary Rita Teaotia said the meeting was “extremely positive”, adding that the EU has suggested a secretary-level meeting, following which both sides would take a decision “on how we would like to proceed.”\n\n“We are keen to go ahead and work towards a balanced agreement,” she said.\n\nThe FTA talks were launched in 2007 and around 16 rounds of negotiations were held till 2013. Though after that, no negotiations have been held, India has moved ahead on many issues (that were demanded by the EU) such as permitting 49 per cent FDI in insurance, 100 per cent FDI in telecom and easing of foreign investments norms in the banking sector.\n\n“So these have been the changes between 2013 and now. In addition to that, we have now a model Bilateral Investment Treaty approved by the Cabinet and that forms the basis on which investment discussions can also go on,” Ms. Teaotia said.\n\nThe main demands of the EU included duty cuts on automobiles, wines and spirits, while India’s demands included data security status, easier temporary movement of skilled professionals, seamless intra-corporate movement, real market access in terms of sanitary and phytosanitary (norms related with plants and animals) and technical barriers to trade measures adopted in EU.\n\n“So there is a work to be done yet. The negotiations will proceed once a decision is taken on whether there is enough ground to move ahead. We are very positive,” she added.\n\nThe talks were to be restarted in August 2015, but India deferred them expressing disappointment and concern over the EU banning sale of around 700 pharma products clinically tested by GVK Biosciences.\n\nOn this issue, Ms. Teaotia said: “There has been a progress ... As we speak, our delegation is already in Brussels and there is a meeting (going on) between the regulators to discuss the GVK matter”.\n\nThe main demands of the EU include duty cuts on automobiles,\n\nwines and spirits", 
    "section": "national", 
    "title": "India, EU hold stock-taking meet on outstanding issues on FTA", 
    "subsection": "general", 
    "date": "2016-01-19"
}