{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "External Affairs Minister Sushma Swaraj lays a wreath at the Hall of Remembrance at the Yad Vashem Holocaust Memorial, in Jerusalem on Monday.- Photo: AP\n\nIndia’s ties with arch rivals Israel and Iran came into focus on Monday as External Affairs Minister Sushma Swaraj travelled to Israel while India maintained silence on the landmark lifting of decades-old sanctions against Iran.\n\nNeither Ms. Swaraj nor her Ministry has issued any official statement regarding the final lifting of sanctions against Iran though India was among the first responders when the “parameters of a comprehensive settlement” of the Iran nuclear issue was announced on April, 2015 in Lausanne.\n\nThe absence of an official statement on the end of the sanctions regime has drawn attention since the India-Iran Joint Commission meeting held two weeks ago sewed up plans for post-sanctions economic cooperation between Iran and India.\n\nMs. Swaraj received a warm welcome in Israel and held talks with the Israeli Prime Minister Benjamin Netanyahu and President Reuven Rivlin on Monday. She was also welcomed in a public event featuring Israeli and Indian entrepreneurs and supporters.\n\nHowever, commentators have noted that the lifting of sanctions was on expected lines and therefore India was prepared to balance the outreach to Israel with the Iranian development.\n\n“The end of the sanctions regime was announced soon after the conclusion of the Joint Comprehensive Plan of Action (JCPOA) so there is no surprise with the successful lifting of the sanctions. That apart, India is aware that the Israelis have not been in favour of the nuclear deal,” said Arundhati Ghose, former ambassador of India to the Conference on Disarmament (CD) in Geneva who explained that India has to maintain a cautious approach while dealing with the mutually exclusive rivals of West Asia.\n\nMs. Ghose, said the message from the end of the crisis over Iran is loud and clear and is being heard by the West Asian rivals of Iran.\n\nIsraeli sources also took note of India’s careful attitude on Iran while Ms. Swaraj is in Israel. Anat Bernstein-Reich, Chairperson of Israel-India Chamber of Commerce, feels that by being diplomatic India seem to be asserting its regional stature.\n\n“It is a fact that India is in a position to be a central political player in the West Asian/Middle Eastern neighbourhood as it enjoys good relations with all the major players in the region,” Ms. Bernstein-Reich told The Hindu .\n\nIn Israel, Sushma Swaraj held talks with Prime Minister Netanyahu and President Rivlin", 
    "section": "national", 
    "title": "India silent on lifting of sanctions against Iran", 
    "subsection": "general", 
    "date": "2016-01-19"
}