{
    "author": [
        "Bee Shapiro"
    ], 
    "text": "The Hunger Games star is trying edgier gowns and developing a style that is all her own\n\nJennifer Lawrence hit the red carpet in a scarlet Dior dress, at the Golden Globes in Los Angele earlier this month.— Photo: NYT\n\nWhen she’s not jet-skiing with Amy Schumer, or taking on equal pay in Hollywood, Jennifer Lawrence, a self-professed workaholic, is likely to be found on the red carpet swathed in Dior.\n\nLawrence, 25, was just nominated for an Oscar for her role in Joy and was in contention for her roles in that movie and in The Hunger Games: Mockingjay Part 2 at the Critics’ Choice Awards on Sunday. She was signed to a lucrative deal by the French luxury brand in 2012 and has, to some red carpet commentators’ lament, been a proper mannequin since.\n\nBut a style seems to be slowly emerging. “She’s definitely coming into her own; you can see that with her starting to talk about politics in interviews and discussing things that mean something to her personally,” said Hillary Kerr, a founder of the website WhoWhatWear.com .\n\n“That all comes together, too, in style, because it’s part of owning who you are and realising that the way you dress communicates something about you,” she said.\n\nMore daring\n\nWorking with her long-time stylists Jill Lincoln and Jordan Johnson, protégées of Rachel Zoe who struck out on their own in March and took a plum roster of celebrities with them, Ms. Lawrence, who was born in Louisville, Kentucky, has been more daring in the past year. (Lincoln and Johnson declined to comment.) Gone are the fairy-tale gowns that might double as bedsheets. Rather, “she experiments; she’s never boring,” Ms. Kerr said.\n\nThough Lawrence prefers plunging necklines, such as a sweet long slip dress by Dior in the palest yellow that she wore to the Joy New York premiere in December, and a ruffled black Ralph Lauren gown she donned for the The Hunger Games: Mockingjay Part 2 premiere in Madrid, she occasionally tries a more demure cut.\n\nThe scarlet Dior creation Lawrence wore to the Golden Globes would be considered nearly conservative were it not for strategic slivers of exposed abs. (Some preferred the casual Versace slip dress she switched to for the after-party.)\n\nMonths earlier, she chose a Dior gown for a Mockingjay 2 screening in Los Angeles. The high sheer netting might have read ice-skating matron had it not been for her “fresh textured hair and bright lip,” Ms. Kerr said.\n\nThe actor has been trying edgier gowns. “It helps that her looks can go from all-American to elegant to exotic,” Ms. Kerr said. For the Mockingjay premiere in London, she picked a dramatically cut print Dior gown decorated with chains.\n\n“This isn’t a silhouette or style I’ve seen on her before,” Ms. Kerr said. “She’s trying something new, whereas her contemporaries are wearing strapless mermaid dresses with Veronica Lake waves,” she added.\n\nBut perhaps her best recent look was a lingerie-like Schiaparelli couture confection worn to the Mockingjay premiere in New York, featuring a full skirt and sheer bodice layered over a bra. Paired with wine-coloured lips and layered necklaces, the dress had a kind of witchy magic.\n\n“Jennifer is definitely worth watching,” Ms. Kerr said. — New York Times News Service", 
    "section": "national", 
    "title": "JenLaw turns darling of Dior", 
    "subsection": "general", 
    "date": "2016-01-19"
}