{
    "author": [
        "C Gouridasan Nair"
    ], 
    "text": "The Kerala government is gearing up for an ambitious rollout of Direct Benefit Transfer (DBT) of pensions to some 12 lakh beneficiaries on February 6. The total amount to be transferred on the day will be a whopping Rs. 504 crore.\n\nThe disbursement system will involve local government institutions. Pension cheques will be handed over to the functionaries concerned so that the beneficiaries can get them instantly. The State has an estimated 32 lakh welfare pensioners. The February 6 transfer will involve pension arrears for three months.\n\nThe decision to switch over to the DBT system was taken following serious lapses in pension disbursement through the postal network. However, the government has decided not to dispense with the services of India Post. About 18 lakh pensioners will continue to receive their pension through the postal network. Two lakh will receive money orders, with the option to switch over to the DBT system. Pensions will be credited to bank accounts of the beneficiaries on the 15th of every month.\n\nThe Cabinet decision to give welfare pensioners the option to switch over to the DBT system on December 3 last was based on the findings of a random sampling study conducted by the Finance Department under the guidance of Additional Chief Secretary (Finance) K.M. Abraham.\n\nThe study was the fallout of serious complaints of non-disbursement of pension in thousands of cases and discussions between Chief Minister Oommen Chandy and Post Master General A.N. Nanda. The postal authorities informed the government that of the Rs. 925.54 crore passed on to them in stages, Rs. 863.06 crore had been credited in the postal savings accounts of the beneficiaries and Rs.814. 47 crore out of this had already been withdrawn.\n\nGovt. decision comes in the wake of complaints about serious lapses in postal network", 
    "section": "national", 
    "title": "Kerala plans direct pension disbursal", 
    "subsection": "general", 
    "date": "2016-01-19"
}