{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Access to justice cannot be dented through intimidation, says Bench\n\nNo temple or governing body can bar women from entering Sabarimala shrine where lakhs of devotees throng annually, apex court had observed last week.\n\nNoting that access to justice cannot be dented through intimidation and justice will not fall prey to individual perceptions or whims, the Supreme Court on Monday directed the Delhi Police Commissioner to investigate death threats received by the president of the Indian Young Lawyers’ Association (IYLA) for complaining about gender inequality at the Sabarimala temple by prohibiting entry to women aged between 10 and 50.\n\nA three-judge Special Bench led by Justice Dipak Misra made it clear that “access to justice” was not hostage to any person or authority, and only a court could control it within the parameters of the law. Individual perceptions or fancy of what was just had no room in the debate, which would be eventually held in the Supreme Court, on the constitutionality of the restriction imposed on women at the shrine.\n\nSecurity to advocate\n\nIn a specially convened hearing, the Bench directed the Delhi Police to provide security to advocate Naushad Ahmed Khan, who had received about 500 threatening calls after the Supreme Court questioned the logic of the restriction last week. On finding that an FIR had already been registered, the Bench ordered the police chief to probe and report back to the court.\n\nThe Bench further made it clear that once a PIL was admitted, even the withdrawal of the petitioner was of no consequence and would not deter the court from examining the issue at hand.\n\nOn January 11, the Bench had taken a swipe at religious customs and temple entry restrictions violating women’s constitutional rights. It had orally observed that no temple or governing body could bar a woman from entering the famous Sabarimala shrine in Kerala where lakhs of devotees throng annually.\n\n“Why can you not let a woman enter? On what basis are you prohibiting women entry? ... What is your logic? Women may or may not want to go [to worship at Sabarimala], but that is her personal choice,” Justice Misra had remarked on January 11.", 
    "section": "national", 
    "title": "SC orders protection to petitioner", 
    "subsection": "general", 
    "date": "2016-01-19"
}