{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Dr. Karl Deisseroth wants to deconstruct the brain, understand it, and unearth its mysteries.\n\nOn any given day, there are ideas flying around in his bioengineering lab at Stanford University.\n\nThe neuroscientist, who won the 2016 Breakthrough Prize in Life Sciences, gave a lecture to a packed auditorium at the Indian Institute of Science here on Monday.\n\nIt was the first of a three-city lecture, part of the Sixth Annual Cell Press-TNQ India Distinguished Lectureship Series.\n\nDr. Deisseroth is exploring the cellular connections that underlie psychiatric symptom domains.\n\nHe and his students are interested in the questions of motivation and reward and hope; what makes organisms do things and not to do things; what states they can get in to.\n\n“And this relates to depression. Patients who have major depression, they have a negative outlook on the world and on the future, and often simply cannot see the positive outcome. And this cannot be reasoned out of them any more than a schizophrenic patient can be reasoned out of a delusion,” he told the audience.\n\nHe is building the technology to throw light on these problems. The tools he uses are optogenetics, a technology that he helped develop, which uses opsins or light-sensitive proteins to control cells in living tissue.\n\nFor instance, specific neurons in mammalian cells turn blue, and can be switched on and off in experimental animals to modify their behaviour.\n\nAfter illuminating the brain, he brought transparency to it through ‘Clarity’, an acronym for a technology he pioneered that allows a brain to be left intact but still get cellular resolution.\n\nIt allows researchers and scientists to explore once hidden parts of the brain to study neurological illnesses like Alzheimer’s.", 
    "section": "national", 
    "title": "Striving to unearth mysteries of brain", 
    "subsection": "general", 
    "date": "2016-01-19"
}