{
    "author": [], 
    "text": "In four of those attacks, terrorists sneaked in through the same forest nursery in Samba, and in two of them they changed their wet clothes in spots a hundred metres or so away in the nursery before launching the attacks. Also, attacks in the Punjab-Jammu belt have happened not very far from National Highway 1A that runs parallel to the International Border.\n\n“Attacks across this part are primarily meant to cause a few casualties and grab a lot of media attention. To infiltrate into the Valley a terrorist needs to be very well trained to trek across the high mountains, whereas here it is mostly a walk across, or at best wading through some water,” one official says.\n\nAccording to authoritative sources, around the time attacks started in two of the instances, a militant each surrendered around 40-50 km away from the attack spot. “It isn’t just a coincidence,” one of them argued.\n\nOn the morning of July 27, 2015 in Dinanagar even as the attack began, a militant walked to a security installation around 50 km away in the Jammu region. Sources said the surrendered militant, who claimed to be from Naushera in Rajauri district, was carrying an AK rifle, a pistol, one AK magazine, 30 AK rounds, two magazines of pistol and Rs. 8,100 in currency. He claimed to have been in a Pakistani prison, after being arrested there for allegedly spying for the Indian Army since 2012. “The story was improbable, and strangely coincided with yet another terror attack. This was the second instance that I noticed of a militant surrender about an hour’s drive from the attack spot in this belt,” one official said.\n\nOfficials suspect that it is not just the drug smuggling network that is involved in facilitating the attacks in the region, but other players such as cross-border sources too seem to have a role in these attacks.\n\nIn the new trend of attacks, Haria Chak Forest Nursery in Kathua is a preferred infiltration route for the terrorists. They have used the same route for launching several attacks, even though the BSF claimed to have plugged the Chhap Nullah, through which they cross into the nursery along the IB with the Riverine Integrated Surveillance and Communication System. During investigations into attacks on the Hiranagar police station on September 26, 2013 and March 20, 2015 attack in Kathua, wet clothes that the terrorists had thrown off before launching the attacks in army fatigues were recovered just a few hundred metres away.\n\nLt. Gen. Syed Ata Hasnain, former GOC of 15 Corps and a leading commentator on terrorism, says, “In the hierarchy of terrorist targets the highest are the metros for which you need highly trained terrorists. Number two is the fidayeen attacks in the Valley where a very organised grid of the Army exists. Third are the cannon fodder that are now coming to north Punjab and Jammu areas.” In the Valley, fidayeen will take a minimum of 20 days before he reaches a safe house, and can take another month or two to launch an attack, says Gen. Hasnain. “But here they are dead in a few days’ time,” he adds.", 
    "section": "national", 
    "title": "Terror attacks and curious surrenders near Pak. border", 
    "subsection": "general", 
    "date": "2016-01-19"
}