{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "I knew something was wrong, Rohith was not talking to anyone including me, says mother\n\nRohith Vemula, the Dalit research scholar, who killed himself on Sunday, had sent warning signals long before taking the drastic step.\n\nIn a letter dated December 18, 2015 that bordered on a suicide note, he had asked the university authorities to offer “euthanasia” for him and other research scholars.\n\nIn the note, he described some possible modes of suicide. Vemula asked the Vice-Chancellor to supply, “a nice rope to the rooms of all Dalit students through the chief warden… or serve 10 mg of sodium azide to all the Dalit students at the time of admission.” The letter was submitted along with a petition demanding that the university administration revoke their expulsion from hostels.\n\nAs per the order issued by the university on December 16, all five Dalit students — Rohit, D. Prashanth, Vijaya Kumar, C. Seshaiah and V. Sunkanna — were barred from contesting student union elections, apart from entering hostels, administrative buildings and other common places in groups. All students were part of the Ambedkar Students Association (ASA).\n\nStudents who stayed put at the New Research Scholars’ (NRS) hostel, keeping watch over the body of Rohith, did not allow the police to enter it till 7.30 a.m.\n\nLighting a camp fire, over 100 students belonging to various political outfits barred entry into the hostel premises in the early hours of Monday even as the Cyberabad police brought in a Rapid Intervention Vehicle to quell the agitation. Massive police and Rapid Action Force presence was found on the campus till Monday morning.\n\nSpeaking to The Hindu , Rohith’s mother, Radhika, who arrived on the spot on Monday, said, “I knew something was wrong, he was not talking to anyone, including me. The university is answerable.” Ms. Radhika, who has separated from her husband, said she wanted to cremate her son in Uppal in Hyderabad where they are staying in a rented flat. However, with “police insistence we were forced to cremate the body at Amberpet [also in the city] electric crematorium even when most of our family members had not reached the spot.”\n\nRohith was the eldest of her two sons.\n\nProtests spiral out\n\nProtests against the student suicide spiralled out of UoH with students from Osmania University and English and Foreign Languages University taking out rallies and burning the effigy of Union Minister Bandaru Dattatreya and Vice-Chancellor P. Appa Rao.\n\nProtests were staged in Jawaharlal Nehru University, New Delhi, Tata Institute of Social Sciences, Mumbai, Madras Institute of Development Studies, Chennai, Indian Institute of Technology, Bombay, Mahatma Gandhi University, Kottayam and districts in Kerala, including Thiruvananthapuram, Kozhikode, and Malappuram.", 
    "section": "national", 
    "title": "University missed warning signals", 
    "subsection": "general", 
    "date": "2016-01-19"
}