{
    "author": [
        "J R"
    ], 
    "text": "The prize moneyfor celebrity boutsran into lakhs\n\nLong before cricket went on to become a national obsession, Bezwada was under the spell of three popular contact sports – kushti (wrestling), chedugudu (kabaddi) and football. The traditional Indian sport – kushti - fought on soil, was of great importance and the rural folk showed interest in mastering the grappling manoeuvres on a mud pit.\n\nThe bustling One Town was once the hub of wrestling activities and kushti doddis (rings) run by Adapa Ramulu, Nalla Butchaiah, Kandhi Narasimhulu and Pyla Ramulu dotted the landscape. “The site of the present corporation building was once a kushti doddi or an ‘akhada’. Places like Wynchipet, Railway Institute, Nagarala Kalyana Mandapam, Gymkhana Grounds, Tummalapalli Kala Kshetram, Sarabhayya Gudulu and Hindu High School had mud pits, and youngsters used to practise hard to grow up as pehlwans,” recollects octogenarian and national-level wrestler Kandhi Gangadhara Rao.\n\nSundays witnessed nerve-racking bouts featuring both professional and amateur musclemen. The organisers deployed rickshaws fixed with public address systems to announce the fights. “The city walls were full of posters highlighting the fights. People used to throng the kushti dangis (platforms) in large numbers.”\n\nOrganisers staged celebrity bouts pitching famous wrestlers against each other by offering prize money running into lakhs. Famous freestyle wrestlers like Dara Singh, Gama and King Kong enthralled the sports lovers by showcasing their hand-to-hand combat. “Tickets were sold out in no time and we had chairs, benches and gallery to accommodate spectators,” says Mr. Rao.\n\nAs Bezwada was centrally located, well-known wrestlers from north and west India like Bhim, Chandgi Ram, Halappa, Wadi Ayoub, Malwa, Mehruddin, and Ajit Singh visited the city to take part in the bouts.\n\nVeterans fondly remember the role of film ‘baddie’ Nellore Kantha Rao in the promotion of wrestling in and around Bezwada. “His weekly bouts were a huge success as it gave a platform for both professionals and amateurs to showcase their skills. Nellore Kantha Rao used to draw huge crowds and his bout once held at Eluru compelled the railway authorities to run a special train,” says Kandhi Appa Rao, who runs a gymnasium atop Gandhi Hill.\n\nStar value\n\nFor wrestlers of the generation, winning a silver mace (gadha) was important as it added star value to their personality. “The vanquished used to get a silver bucket”, recollects Appa Rao.\n\nThe role of R. Munuswamy, a disciple of Nellore Kantha Rao, is worth mentioning as his arrival from Nellore ignited the wrestling activities in Bezwada. The champion-wrestler inspired many youngsters and he began nurturing precious talent. Sri Hanuman Railway Vyayamasala in Poornanandampet, equipped with a mud pit, was a prominent one and it produced several state and national-level wrestlers.\n\nThe traditional mud sport is fast dwindling. The introduction of new rules by the International Wrestling Federation has forced wrestlers to learn the tricks on synthetic mats. “The mud pit is used only for exercises now,” says former wrestler Jagdish Kaliraman.", 
    "section": "national", 
    "title": "When ‘kushti’ ruled the roost in Bezwada", 
    "subsection": "general", 
    "date": "2016-01-19"
}