{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Prime Minister Narendra Modi with Sheikh Mohammed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi, upon his arrival at the Palam airport, in New Delhi on Wednesday.— PHOTO: PTI\n\nSheikh Mohammed Bin Zayed Al Nahyan, Crown Prince of Abu Dhabi and the Deputy Supreme Commander of the United Arab Emirates’ armed forces, received a warm welcome when he arrived here on Wednesday. Prime Minister Narendra Modi personally received him at the airport with a warm embrace. Though the official part of the visit is scheduled for Thursday, both sides held a round of discussions immediately after his arrival.\n\nThe Crown Prince held talks with the External Affairs Minister Sushma Swaraj in his first meeting in Delhi to revise the plan of diplomatic engagements for Thursday. Sultan Al Mansoori, Minister of Economy, UAE, who is part of the delegation, called on his counterpart Arun Jaitley. A press release from the Government said that Mr. Jaitley and Mr. Mansoori focused on investment, innovation and Small and Medium Enterprises.\n\nOn Monday, UAE Ambassador Ahmed Al-Banna told the media that at least sixteen agreements, including one on nuclear collaboration, were expected to be signed during the visit of the Crown Prince. However, officials told The Hindu that only “initial conversations” on the nuclear issue were on the cards. “Nuclear issues will be agreed as an area of cooperation. There is no bilateral civil nuclear cooperation treaty under negotiation yet with the UAE.” “The only agreement that we can confirm right now is the one for visa free travel for Indian diplomats to the UAE,” said a diplomatic source. Many of the agreements, he said, were still being finalised.\n\nSovereign Fund\n\nThis is Sheikh Mohammad Bin Zayed’s third visit to India, but his first as crown prince. “We brought him for an official visit when he was Commander of the forces in 2003,” said former Ambassador to the UAE K.C. Singh. “India has wasted a lot of time engaging with the UAE leadership since then, as we were not ready for closer cooperation at the time,” he said.\n\nThe main bilateral meeting d at Hyderabad House on Thursday is expected to throw up a clutch of agreements. Earlier, Anil Wadhwa, Secretary (East), said India was eyeing the $ 800 billion Sovereign Fund of the UAE, which it hoped to access especially for investments in infrastructure sector.\n\nSheikh Mohammad Bin Zayed will also discuss the newly announced Strategic Partnership, where UAE’s cooperation on terror is a major highlight. In the past few months, many Indians suspected of IS links have been detained and deported to India.", 
    "section": "national", 
    "title": "Abu Dhabi Prince arrives, n-deal not on agenda", 
    "subsection": "general", 
    "date": "2016-02-11"
}