{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "After projecting yoga and Baba Ramdev through the International Day of Yoga, the government is now set to highlight the ‘Art of Living’ of Sri Sri Ravi Shankar at a mega festival from March 11-13 in the Capital.\n\nThe collaboration between the Ministry of External Affairs and the Art of Living Foundation is unprecedented as the MEA has never supported an event of this scale by a single private party.\n\nHighlighting the ‘Art of Living’ has also raised questions about promoting more contemporary forms of spirituality, which are different from classical cultural traditions like Buddhism and yoga. The event — World Culture Festival — is also drawing criticism from those who oppose mixing diplomacy with new age spirituality.\n\n“The agenda of the Ministry of External Affairs should not include Art of Living. Moreover, all the diplomatic delegates coming for the conference also have led lives that have been far from spiritual. So why this collaboration between the MEA and the Art of Living?” asked former External Affairs Minister Natwar Singh.\n\nOfficials told The Hindu that Sri Sri Ravi Shankar’s inclusion in the MEA’s agenda is backed by the international standing that he enjoys. The Art of Living founder recently met with Deputy Prime Minister of Nepal Kamal Thapa, which reportedly helped in creating a breakthrough between the leadership of India and Nepal. Sri Sri Ravi Shankar also emerged as a unique connector between India and Pakistan because of the popularity of ‘Art of Living’ in Lahore and Islamabad. (Pakistan’s National Security Adviser Sartaj Aziz is reported to have attended Art of Living meetings in Pakistan.)\n\nConsultations have begun between the volunteers and the MEA officials on how to ensure an incident-free festival, which will feature CEO of Afghanistan Abdullah Abdullah, former President of Sri Lanka Mahinda Rajapaksa, former Pakistan PM Yousaf Raza Gilani and a host of other dignitaries.", 
    "section": "national", 
    "title": "‘Art of Living’ diplomacy next on MEA’s agenda", 
    "subsection": "general", 
    "date": "2016-02-11"
}