{
    "author": [], 
    "text": "U.S. publisher agrees to pay $14 million in settlement\n\nA 1922 songbook that was submitted as evidence in a lawsuit filed by artists claiming that Happy Birthday to You is no longer covered by copyright.— Photo: NYT/WOLF HALDENSTEIN\n\nHappy Birthday to You , often considered the most popular song in the world, looks finally set to be free for everyone to sing.\n\nAfter prolonged legal wrangling, U.S. publisher Warner/Chappell Music agreed to pay $14 million in a settlement that would effectively end its claims to the song’s copyright.\n\nThe dispute began in 2013 after makers of a low-budget film on the history of Happy Birthday to You balked at the $1,500 the publisher demanded for the song’s use.\n\nThe film-makers filed a class action suit on behalf of people who paid to use the song, which became widely known in the United States a century ago and has since spread globally.\n\nIn a settlement submitted to a federal court in Los Angeles on Monday, the publishing house, which is part of the Warner Music conglomerate, agreed to pay $14 million and end its efforts to collect royalties for the song.\n\n“By declaring the song to be in the public domain, the settlement will end more than 80 years of uncertainty regarding the disputed copyright,” the settlement submitted by plaintiffs to the court said.\n\nThe deal needs a judge’s approval, which is likely because both sides are in agreement.\n\nWhile the publisher was not chasing down birthday party revellers to seek payment, it had routinely asked for compensation for films, television shows and recordings seen as making money on the song.\n\nThe settlement said that $14-16.5 million represented the estimated amount that Warner/Chappell would have earned through 2030, the earliest date at which its disputed copyright would end.\n\nThe film-makers’ lawyers would pocket one-third of the settlement money — $4.62 million — with the rest divided among people who had paid to use “Happy Birthday to You”.\n\nThe settlement enables the publisher to avoid a potential trial at which it would risk being ordered to pay far more.\n\nThe plaintiffs said they saw the agreement as a victory and decided to settle to avoid further costs.\n\nThe film-makers had partly won the case in September, when a judge ruled that Warner/Chappell did not hold a legitimate copyright to the song.\n\nBut he stopped short of declaring the song in the public domain, leaving open the possibility that others may hold the copyright and setting the stage for a trial.\n\nDisputed origins\n\nHappy Birthday to You is among the most recognisable songs in history. Famous performances range from Marilyn Monroe’s sultry singing for President John F. Kennedy to a version performed by NASA’s Curiosity rover to celebrate one year on Mars.\n\nBoth sides in the court case generally agreed that the song was put to paper in 1893 by Patty Hill, a kindergarten instructor in Kentucky, with her sister Milfred, though some say the melody came earlier.\n\nSchoolchildren would sing the tune, which was initially entitled “Good Morning to You”. The dispute centred on who put the Happy Birthday to You lyrics to the melody.\n\nJessica Hill, another sister, published the lyrics in 1935 in a copyright that was bought decades later by Warner/Chappell, but the plaintiffs countered that the tune had already been widely in public use. The case is the latest high-profile dispute regarding song copyright.\n\nLast year, a judge controversially ordered Pharrell Williams and Robin Thicke to pay more than $7 million to the family of Marvin Gaye for alleged similarities between their 2013 smash hit “Blurred Lines” and the late Motown legend's “Got to Give It Up”. — AFP", 
    "section": "national", 
    "title": "Cut the cake, Happy Birthday song soon in public domain", 
    "subsection": "general", 
    "date": "2016-02-11"
}