{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Afroz Begum (right) and Jahan Aara, the first women Qazis of Rajasthan. —Photo: PTI\n\nIslamic seminary Darul-Uloom Deoband came to the defence of two Muslim women from Rajasthan — Afroz Begum and Jahan Ara — who became Qazis (judges), who, in Islamic legal jurisprudence, has the authority to function as the head of informal arbitration centres to sort out disputes related to personal laws as well as other matters.\n\nDeoband’s support for the two women came days after conservative religious clerics in Rajasthan protested against the two women being awarded the certificate of “Qaziat” by a Islamic training Centre in Mumbai.\n\nThe spokesperson of the seminary, Maulana Ashraf Usmani, told The Hindu that Muslim women had all the right to become scholars and Qazis.\n\n“Becoming a Qazi is a matter of expertise, knowledge and training. Any man or woman who fulfils the criteria of knowledge and training can become a Qazi,” he said.\n\n“Women in Islam have all the right to become religious scholars. They can become a Qazi and a Mufti. Islam doesn’t discriminate between men and women when it comes to gathering knowledge,” Maulana Usmani said.\n\nArguing that there was nothing in Islam that prohibits women from becoming a Qazi or a Mufti, Maulana Usmani said those who protest against women becoming Qazis don’t do justice with the rights Islam bestows on women.\n\n'Islam empowers women'\n\n“Islam empowers women through knowledge. Nobody has any right to prevent women from becoming a Qazi or a Mufti,” he said.\n\nMaulana Usmani also said there was no reason for anyone to oppose the two Qazis because there are “several madrasas that train women to become a Qazi or a Mufti.”\n\nZakia Soman, the trustee of Bharatiya Muslim Mahila Andolan that runs the Darul Uloom-e-Niswa which trained the two women from Jaipur, welcomed the reaction of the seminary.\n\n“It is indeed an encouraging and positive reaction from Darul Uloom Deoband. This shows that they are moving with the times and are acknowledging the sense of empowerment accorded to women by Islam,” Ms. Soman said.\n\nMaulana says any man or woman who has training and knowledge can become a Qazi", 
    "section": "national", 
    "title": "Darul-Uloom Deoband backs appointment of women Qazis", 
    "subsection": "general", 
    "date": "2016-02-11"
}