{
    "author": [], 
    "text": "Four Indian American engineers are among 80 new members selected to the prestigious US National Academy of Engineering (NAE) for their valuable contributions to the society.\n\nAnil K. Jain, Arati Prabhakar, Ganesh Thakur and K.R. Sridhar were formally inducted during a ceremony at the NAE’s annual meeting in Washington, DC, on Tuesday, NAE president C.D. (Dan) Mote Jr announced in a statement.\n\nMr. Jain, a distinguished professor in the department of computer science and engineering at the Michigan State University in East Lansing, was elected for his contributions to the engineering and practice of biometrics.\n\nA B.Tech graduate from the Indian Institute of Technology-Kanpur, his research interests include pattern recognition, computer vision and biometric recognition.\n\nMr. Jain has also been a consultant to the Indian government’s Aadhaar programme.\n\nDr. Prabhakar, director of the US Defence Advanced Research Projects Agency (DARPA) in Virginia, was chosen for national leadership to advance semiconductor and information technologies.\n\nBeginning her career as a Congressional Fellow, Dr. Prabhakar has served on the National Academies’ Science Technology and Economic Policy Board. In addition, she chaired the Efficiency and Renewables Advisory Committee for the U.S. Department of Energy.\n\nMr. Thakur, who is the president of Thakur Services Inc. in Houston, Texas, was named a member for leadership in the implementation of integrated reservoir management techniques.\n\nDr. Sridhar, the principal co-founder and chief executive officer of Bloom Energy Corporation in California, was selected for the “contributions to transport phenomena and thermal packaging of electrochemical systems and generation of clean, reliable and affordable power”. — IANS\n\nAnil K. Jain, Arati Prabhakar, Ganesh Thakur and K.R. Sridhar inducted on Tuesday", 
    "section": "national", 
    "title": "Four Indian-Americans selected to U.S. National Academy of Engineering", 
    "subsection": "general", 
    "date": "2016-02-11"
}