{
    "author": [
        "Vidya Venkat", 
        "Shiv Sunny"
    ], 
    "text": "R K. Pachauri used sexually suggestive nicknames to call a woman staff member of TERI, and made sexually loaded remarks. She narrated instances when Mr. Pachauri boasted to her about his virility and strength, despite his old age.\n\n“One day, when I was on leave because of ill-health, he called me up on my mobile to ask why I was not in office. When I told him that I was suffering from migraine, he said: “ Hum bahut achhi champi kartein hain…aap chahein to kar sakte hain (I can do a very good head massage… if you want, I can do a massage for you).”\n\nMr. Pachauri also allegedly handed over a manuscript of his novel containing graphic sexual descriptions to the complainant. The novel, ‘Return to Almora’, was later published. When the ex-employee raised these concerns with Commodore Joshi, the then director, administration, services and TERI press, he refused to believe her, saying she may have “misread Mr. Pachauri’s warmth,” the statement said.\n\nWhen Mr. Pachauri saw her resignation letter, he allegedly threatened her with dire consequences.\n\nThe complainant alleged that her counsel, Ms. Grover, met DCP (South Delhi) Prem Nath on February 26, 2015, and sent a follow-up letter a week later. She also alleged that a letter to Delhi Police Commissioner B.S. Bassi, requesting that her statement be recorded, was not taken up.\n\nThe DCP, however, said he could not proceed with the investigation as Ms. Grover was unwilling to bring the victim in front of the investigators. “The counsel was not ready to even share the victim’s name claiming that they needed to maintain secrecy. How could I probe when I did not even know the victim’s identity?” Prem Nath told The Hindu.\n\nResponding to the DCP’s claims, Ms. Grover said she had requested the police to visit her office where the victim’s statement could be taken in secrecy. “I requested that the statement be recorded at a place of the victim’s convenience,” she said, dismissing claims that she had refused to even share the woman’s name.\n\n“I only wanted that the woman’s identity not be revealed to other policemen,” she said.\n\nShe has claimed that she has documented evidence in the form of letters with receipts and text messages of her conversations with the DCP.\n\nThe victim’s counsels have clarified that they never asked for a fresh FIR in this case. “All that the victim wanted was that her statement against Mr. Pachauri be recorded so that she could be a witness against the accused person’s character,” said the victim’s other lawyer Ratna Appn", 
    "section": "national", 
    "title": "He threatened her with dire consequences", 
    "subsection": "general", 
    "date": "2016-02-11"
}