{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "In a startling revelation, Special Public Prosecutor Ujjwal Nikam claimed on Wednesday that Lashkar-e-Taiba (LeT) operative David Coleman Headley could still be sentenced to death by the U.S. court for his involvement in the 26/11 Mumbai attack if he is found to be lying to the Indian court.\n\nHeadley had agreed to plea-bargain with the U.S. government and was sentenced to 35 years in prison on terrorism charges that would otherwise have attracted the death penalty there. Among the conditions in the plea-bargain is a commitment from Headley to depose truthfully before foreign judicial commissions.\n\nThe only question now is how India would prove whether or not Headley is lying, as most of the evidence and all his handlers are in Pakistan. And even if India had conclusive evidence that Headley was lying in the video deposition, would the appropriate U.S. authorities accept India’s claims?\n\n“Headley has given an undertaking before the U.S court that if he is not truthful in his replies before the court here, then the U.S government is entitled to seek the death penalty for him,” Mr. Nikam told The Hindu . Mr. Nikam also claimed that only if he is satisfied with Headley’s replies and only if he certifies it will Headley become an approver. Only his offer to become an approver has now been accepted. “The pardon granted to Headley is conditional and, according to the Indian law, the public prosecutor is authorised to forfeit the pardon. I will take a call only after the completion of evidence. Also, to decide if his pardon is to be forfeited or kept alive, I have to probe Headley on various angles and it can be decided after considering his entire evidence.”\n\n“Headley was handed a lesser punishment because of the plea-bargain and on the agreement that he would also be truthful in his deposition to foreign judicial commissions,” a senior government official said. “The U.S can reopen the case if its finds that the agreement has been breached.”\n\nMr. Nikam claimed he got the clearance from NSA Ajit Doval to make an offer to turn Headley into an approver. Later, when they presented the idea to Prime Minister Narendra Modi, he also concurred.", 
    "section": "national", 
    "title": "‘Headley can still get death sentence in U.S.’", 
    "subsection": "general", 
    "date": "2016-02-11"
}