{
    "author": [], 
    "text": "Experimental tests examined the animals’ spontaneous reactions to photographs\n\nHorses have the ability to recognise human emotions as researches have shown that ponies can distinguish between angry and happy human facial expressions.\n\nPsychologists studied how 28 horses reacted to seeing photographs of positive versus negative human facial expressions.\n\nWhen viewing angry faces, horses looked more with their left eye, a behaviour associated with perceiving negative stimuli.\n\n“We have known for a long time that horses are a socially sophisticated species but this is the first time we have seen that they can distinguish between positive and negative human facial expressions,” said one of the researchers Amy Smith from University of Sussex in England. Their heart rate also increased more quickly and they showed more stress-related behaviours.\n\n“The reaction to the angry facial expressions was particularly clear — there was a quicker increase in their heart rate, and the horses moved their heads to look at the angry faces with their left eye,” Mr. Smith noted.\n\nThe study, published in the journal Biology Letters , concluded that this response indicates that the horses had a functionally relevant understanding of the angry faces they were seeing. For the experiments, the horses were shown happy and angry photographs of two unfamiliar male faces. The experimental tests examined the horses’ spontaneous reactions to the photos.\n\n“There are several possible explanations for our findings. Horses may have adapted an ancestral ability for reading emotional cues in other horses to respond appropriately to human facial expressions during their co-evolution,” study co-lead author Karen McComb, professor at University of Sussex, noted.\n\n“Alternatively, individual horses may have learned to interpret human expressions during their own lifetime. What is interesting is that accurate assessment of a negative emotion is possible across the species barrier despite the dramatic difference in facial morphology between horses and humans,” Ms. McComb said. — IANS", 
    "section": "national", 
    "title": "Horses know when you are happy or angry", 
    "subsection": "general", 
    "date": "2016-02-11"
}