{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "For the first time in its history, the India Meteorological Department — best known for its monsoon forecasts — will issue a summer forecast for April, May and June. Those involved say that though such a forecast may not be of much help to farmers — who rely on IMD’s rain forecasts to make sowing decisions and don’t plant their crops in these months — the information would be useful to power companies, several service-sector industries and state planners who’d like a heads-up on possible water shortages.\n\nIn mid-March, the IMD will send out a colour-coded map of India, showing how temperatures in different regions of the country are likely to deviate from what’s normal, during summer months. These numbers would be updated every five days, Madhavan Rajeevan, Secretary, Ministry of Earth Sciences (MoES) told The Hindu . The IMD reports to the MoES.\n\n“We are now experimenting with new kinds of climate models and a lot of people have demanded summer forecasts…we’re trying it this year but it will take at least a year for it to work smoothly,” said Mr. Rajeevan.\n\nBusinesses that have requested summer forecasts include manufacturers of refrigerators, air conditioners, ice cream and cold drinks, he added.\n\nEl Nino and heatwave\n\nThe IMD’s initiative comes even as India bears the brunt of one of the longest and severest El Ninos ever experienced. Said to be responsible for two consecutive droughts as well awry winter patterns in North India, the El Nino — a meteorological phenomenon marked by an unusual warming of the surface waters of the Pacific Ocean and associated with droughts — is likely to continue for a couple of months more. While this may mean more heatwaves, it would not affect this year’s monsoon, according to Mr. Rajeevan.\n\nThe IMD does give warnings about imminent heatwaves and dry weather but these are no more than five days ahead. The key factor to forecasting weather a few months ahead is in ensuring that the computerised weather models are consistently able to simulate the weather as it actually plays out. “It’s useful information,” said N. Bhanumurthy, of the National Institute of Public Finance and Policy. “Farmers are now not the only people interested in weather forecasts.”\n\nLast month, the IMD officially expunged the word “drought” from its vocabulary, months after it correctly forecast one of India’s severest monsoon deficits last year.\n\nIt could be of use to power companies, service-sector industries and planners", 
    "section": "national", 
    "title": "In a first, IMD to bring out summer forecast", 
    "subsection": "general", 
    "date": "2016-02-11"
}