{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Accuses BJP of dismantling schemes put in place Cong.\n\n: All India Congress Committee (AICC) vice-president Rahul Gandhi has alleged that the Narendra Modi government functions at a superficial level and deliberately dismantles the various structures put in place by the Congress over the years to extend protection to the poor and weaker sections of society.\n\nStating that the BJP had captured power at the Centre on a communal agenda of dividing the people, Mr. Gandhi, addressing the Kerala Pradesh Congress Committee (KPCC) executive body’s special meeting here on Wednesday, saw two different parallel streams in the Modi government’s functioning: one is the focus on development and the other is the more poisonous underground campaign of dividing the people on communal lines.\n\nThe Bihar elections proved that the BJP could be defeated if all others stood together. “The Prime Minister does not like to go into details. His political functioning is in the form of big events. There is a certain amount of hollowness and a lack of understanding,” Mr. Gandhi said, pointing to the different perceptions that Mr. Modi and his Finance Minister had on the Mahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS).\n\nMr. Modi felt it was a hollow programme, while the Finance Minister asserted that it had helped growth in rural areas. He faulted Mr. Modi’s approach on the issue of a pact with Nagaland. None of the Chief Ministers, the Union Home Minister and officials was aware of a pact on the complex Naga issue.\n\nIn the case of Nepal, Mr. Modi’s first visit to that country was a success, but within months the ties between the two countries were destroyed. “The Modi government is going from one slogan to another. But nothing is happening,” he said.\n\nHe lamented that the government was dismantling the structures that the Congress had built over decades to extend protection to the people by formulating various welfare schemes, whether it was MGNREGS, the Right to Education or Right to Food Acts.", 
    "section": "national", 
    "title": "Modi govt. anti-poor, says Rahul", 
    "subsection": "general", 
    "date": "2016-02-11"
}