{
    "author": [
        "G Mahadevan"
    ], 
    "text": "The continuing inability of the University of Kerala to comprehensively tackle the problem of ‘mass copying’ in its examinations points to the lacunae in laws governing the conduct of examinations and in particular to the laxity shown by the university in revising its examination manual.\n\nThe examination manual of the university, last revised in 2005, is silent on the question of mass copying. Any disciplinary action taken by the university in cases of mass copying has its basis in provisions in the manual to deal with individual cases of copying. Mass copying is different in two ways.\n\nIn the case of individual copying, the student is more often than not caught with incriminating material on his or her person. The student is then hauled up in front of the disciplinary committee and given due punishment. In the case of mass copying, even though there is general evidence of malpractice the university is often unable to prove that every student who wrote an examination at a particular centre is guilty of malpractice.\n\nSo, it is entirely possible that an innocent student also gets caught unfairly in this process. Such a student often has no way to prove to the university disciplinary committee that he or she is innocent of malpractice.\n\nSecondly, mass copying invariably implies the collusion of the invigilators. However, the university, as of now, has no legal provision to deal with this issue. Neither can it haul up erring teachers in front of a committee nor can it impose any meaningful disciplinary action on them.\n\nThe only action that the university can now take against an institution and its teachers is to either deny the status of an examination centre to that college or to debar erring teachers from invigilation duty for three years. Neither measure has proven to be an effective deterrent in the past.\n\nIn 2013, the university constituted a Syndicate committee to suggest reforms to the examination manual. This process has not reached anywhere.\n\nAccording to university sources, mere reforms in the examination manual will not help the university initiate meaningful action against teachers; for this, legislative measures have to be initiated.\n\nFor over a decade, the varsity has been lax in\n\nrevising exam manual", 
    "section": "national", 
    "title": "No end in sight to ‘mass copying’ in Kerala University examinations", 
    "subsection": "general", 
    "date": "2016-02-11"
}