{
    "author": [
        "Special Correspondent"
    ], 
    "text": "AICC vice president Rahul Gandhi called upon senior Congress leaders in the State to sink their differences and fight the election unitedly to ensure a second term for the United Democratic Front (UDF) government.\n\nAddressing a special session of the Kerala Pradesh Congress Committee’s (KPCC) executive body meeting here, Mr. Gandhi said the CPI(M) cannot defeat the Congress. “Only the Congress can defeat the Congress. Senior leaders are exceptionally talented. Each has his own strengths and weaknesses, but together they can fill the space and complement each other,” he said.\n\nHe wanted Congress leaders to stand together as a family and fight as a family in the next two months leading to the Assembly elections. “After the elections you can fight. I have no problem with that. I will come and listen to your fights. But for now, let’s not fight. Let’s hold hands together and allow the Congress-led UDF to rule once again so that the balance between development and protection of the poor can be maintained. Only the Congress party can create the balance,” he said.\n\nCongress Working Committee member A.K. Antony maintained that the era of people voting on the basis of election symbols had come to any end.\n\nThe candidate’s profile had become equally important. Therefore, the party leadership should pay special attention to candidate selection, with the only criterion being victory and the determination to emerge victorious to recapture power, marking a historic turn to the five-year shift in ruling dispensations in Kerala.\n\nKPCC president V.M. Sudheeran criticised the CPI(M) for pursuing the cult of violence and wanted the party leadership to shun this brand of politics.\n\nChief Minister Oommen Chandy expressed confidence about the UDF winning a second term on the strength of his government’s performance.\n\nKerala Home Minister Ramesh Chennithala also spoke on the need to stand united to return to power.", 
    "section": "national", 
    "title": "Only Cong. can defeat Cong.: Rahul", 
    "subsection": "general", 
    "date": "2016-02-11"
}