{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Not far from Ayodhya, a battle is emerging ahead of the Bikapur by-election scheduled for February 13.\n\nThe contest is being keenly watched for the larger political ramifications that it may have in the 2017 Assembly polls — the possibility of communal polarisation, the Muslim frame of mind, the inclination of Dalit voters and the disposition of the general public towards the ruling Samajwadi Party.\n\nThe talking point has been the entry of the Hyderabad-based All India Majlis-e-Ittehad-ul Muslimeen (AIMIM) into the poll arena in Uttar Pradesh. AIMIM leader Asaduddin Owaisi, who is seeking to consolidate Dalit-Muslim votes with the cry of “Jai Bhim-Jai Meem”, has fielded a Dalit candidate, Pradeep Kori, in the constituency which has a substantial population of the two communities.\n\nMr. Owaisi, who had been denied permission by the SP government to hold rallies in Uttar Pradesh on several occasions in the past, addressed two public meetings in Faizabad district over the past few weeks. He refrained from any polemics over the Babri Masjid issue and instead targeted SP supremo Mulayam Singh and his son and Chief Minister Akhilesh Yadav, accusing them of duping Muslims with unfulfilled promises, especially on the issue of reservation.\n\nMr. Owaisi also invoked Babasaheb Ambedkar, while accusing the SP government of having an anti-Dalit mindset. As the Bahujan Samaj Party (BSP) is not contesting the by-poll, the Dalit votes are up for grabs.\n\nIn 2012, the BSP’s candidate Firoz Khan came a close second with fewer than 2,000 votes behind the veteran SP leader, Mitrasen Yadav, whose death due to prolonged illness necessitated the by-poll.\n\nThe SP candidate, Anandsen Yadav, Mitrasen’s son and a former Minister in the BSP government, hopes to garner the sympathy votes but could also face the wrath of Dalits. In 2011, he was convicted of the gruesome murder of a pregnant Dalit student Shashi, but the Allahabad High Court acquitted him of homicide charges in 2013. The BJP has fielded a Ram Mandir activist, Ram Krishna Tiwari. BJP leaders say the party hopes to bag votes by seizing on the AIMIM’s entry into the contest and also poach on the BSP’s Dalit voters.\n\nThe underdog in the fight, however, could be the RLD, which has fielded its State president Munna Singh Chauhan. The RLD top brass, both Ajit Singh and Jayant Chaudhary, have campaigned for Mr. Singh, who hopes to cash in on his pro-farmer and clean image.", 
    "section": "national", 
    "title": "Owaisi makes electoral foray into Uttar Pradesh", 
    "subsection": "general", 
    "date": "2016-02-11"
}