{
    "author": [
        "Mohit M"
    ], 
    "text": "A picture shared on social media was taken in an African sanctuary\n\nA picture of a leopard by a tree, talk of people having ‘sighted’ two leopards near schools and ‘visuals’ telecast by television channels kept Whitefield and its surrounding areas on tenterhooks through Tuesday night and Wednesday.\n\nThough no ‘conclusive proof’ of the presence of a leopard was found, forest officials procured two cages for the area as a precautionary measure.\n\nThree days after a dramatic operation netted a leopard that had strayed into Vibgyor High School, social media and residents of the sprawling area pockmarked with IT companies and residential complexes went into a tizzy as rumours of more felines kept pouring in.\n\nOne of the most widely-shared pictures on social media and even some media outlets – that of a leopard against a tree – that fuelled much of the rumours was in fact taken in an African sanctuary.\n\nHowever, the fear was such that many people living behind the school and Turubarahalli burst crackers and set a grove on fire on Tuesday night to keep wild animals away. In some areas, large groups of people carrying sticks were seen patrolling near grassland patches in search of the ‘elusive’ feline.\n\nNearly 40 officials of the Forest Department and the local police descended on the area to verify the ‘sightings’.\n\nWhile many pug marks were dismissed as those of a dog, on Wednesday evening a suspicious ‘pug mark’ at Nellurhalli saw the department placing a cage there. Another was kept behind Vibgyor school.\n\n“We are not taking any chances,” said Jaganath Reddy, Deputy Range Forest Officer. With calls of ‘fresh sightings’ by fear-stricken residents pouring in through Tuesday night and Wednesday, Forest Department officials at Whitefield spent much of their time attending to what they said were ‘hoax’ calls.\n\n“Some claim numerous people have spotted a leopard, but when we go to the scene, not one person will be there or will confirm. We have to attend to each call and go to the spot to verify. Almost every hour, we are forced to go to either Nellurhalli or Vibgyor School (a distance of around 5 km),” said an officer.\n\nThe ‘sighting’ was first reported at Nellurhalli on Tuesday afternoon. Officials rushed there. The search was called off after nearly three hours as officials were convinced that there was no leopard around.\n\nHowever, barely a few hours later, more calls started coming.\n\nForest personnel from Anekal and K.R. Puram sub-divisions have been camping in the area since Sunday when a leopard entered Vibgyor School.\n\nIt started off with ‘sightings’ and is being fuelled by ‘visuals’ telecast by television channels", 
    "section": "national", 
    "title": "Pictures, visuals of leopard keep Bengaluru on its toes", 
    "subsection": "general", 
    "date": "2016-02-11"
}