{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "ABVP activists demand expulsion of organisers, administration orders inquiry\n\nStudents affiliated to the ABVP protest outside the office of the JNU Vice-Chancellor in New Delhi on Wednesday.- Photo: PTI\n\nMembers of the Akhil Bharatiya Vidyarthi Parishad (ABVP) staged a protest at the Jawaharlal Nehru University (JNU) here demanding the expulsion of students who organised an event on Parliament attack convict Afzal Guru who was hanged in 2013. This comes a day after Guru’s third death anniversary.\n\nThe university administration has ordered a “disciplinary” enquiry into the issue as it said the event organisers “went ahead without permission.”\n\nThe event organisers had pasted posters across the campus inviting students to gather for a protest march against “judicial killing of Afzal Guru and Maqbool Bhat” and in solidarity with the “struggle” of Kashmiri migrants at the Sabarmati dhaba in the campus.\n\nUniversity officials said the act amounted to “indiscipline” as any talk about national disintegration cannot be “national”, adding that a committee headed by the Chief Proctor of JNU would investigate the matter.\n\n“It is an act of indiscipline as permission for the programme was sought by providing incomplete information. A committee headed by the Chief Proctor will examine the footage of the event and speak to the witnesses. The varsity will take appropriate action based on the report,” JNU Vice-Chancellor Jagadesh Kumar said.\n\nExplaining the “incomplete information”, a varsity official said there was no mention of Afzal Guru in the permission letter. Members of the ABVP had on Tuesday objected to the event and written to the Vice-Chancellor saying such marches should not be held on the campus of an educational institution, prompting the university administration to order cancellation of the march fearing it might “disrupt peace on the campus.”\n\nHowever, the organisers went ahead with the programme despite the cancellation of the permission, and held a “cultural programme.”\n\nABVP members gathered outside the V-C’s office and shouted slogans, demanding the expulsion of the students.\n\nJoint Secretary of the JNU students union, Saurabh Kumar, the only ABVP member in the union, said, “How can an event on Afzal Guru, who attacked the temple of democracy, be held here? We demand the expulsion of those who organised it”.", 
    "section": "national", 
    "title": "Protest on Afzal’s ‘judicial killing’ sets off controversy", 
    "subsection": "general", 
    "date": "2016-02-11"
}