{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "The Rohingya refugee crisis has become a “regional issue involving countries of South and Southeast Asia,” a recent report on the community said, putting the number of Rohingyas living in India at 40,000-50,000.\n\nThe report, ‘Rohingyas: The Emergence of a Stateless Community,’ prepared by Calcutta Research Group, an independent research organisation, says that the number of families settled in different Indian States is 10,565. According to the latest data, 6,684 families of the community have settled in Jammu and Kashmir, 1,755 in Andhra Pradesh, 760 in Delhi and 361 in West Bengal.\n\nIt says 32,000 Rohingyas registered with the United Nations High Commissioner for Refugees (UNHCR) are residing in Bangladesh, and three-five lakh people of the community live outside the formal camps in that country.\n\n“At a time when the refugees crisis is spreading over Europe, we, in Southeast Asia, are not aware of a similar crisis closer to home involving the Rohingyas,” Sabyasachi Basu Ray Choudhury, Vice-Chancellor of Rabindra Bharati University and one of the editors of the report, told The Hindu . Ranabir Samaddar, an expert in migration and post-migration, is also an editor of the report.\n\nInterviews with the community members recorded in the report suggest the Rohingyas crossing over from Bangladesh to India prefer the camps in Jammu, Hyderabad and Delhi for better economic opportunities. “In West Bengal, there is no fixed settlement area for Rohingyas. The largest identifiable number is concentrated in correctional homes,” the report says.\n\nResearchers who have painstakingly interviewed those from the families incarcerated have listed the “disintegration of the refugee family” and the accompanying trauma as one of the major observations of the report. Even refugee cards issued by the UNHRC are not accepted as a valid document in West Bengal, and Rohingyas are put behind bars.", 
    "section": "national", 
    "title": "Report puts spotlight on status of Rohingyas", 
    "subsection": "general", 
    "date": "2016-02-11"
}