{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "An unusual drop in snowfall in Kashmir this year has spoiled the plans of honeymooners and skiers, mainly foreigners, and hit the prospect of winter tourism in the State.\n\nOnce abuzz, the skiing destination of Gulmarg, around 55 km from Srinagar, has recorded the lowest ever footfall of skiers this year so far.\n\n“Last year, my company was able to plan skiing trips for 700 foreigners for Gulmarg. However, this year, it was as low as 15 skiers,” Shamim Shah, the head of the Travel Association of India, J-K chapter, told The Hindu .\n\nThe negligible footfall is attributed to low accumulation of snow. According to the Tourism Department records, the bowl of Gulmarg used to receive snowfall up to six feet and upper skiing slopes of Kongdoori and Afarwat, located at the height of 4,390 metres, would receive more than eight feet snow.\n\n“This winter, we had less than two feet accumulated snowfall in the main bowl and around four feet in the upper slopes. Only the upper slopes can host professional skiers. However, increasing day temperature and fast melting snow is unusual,” said Ilyas Ahmad, an official with the J&K Tourism Department.\n\nGulmarg is known for its deep and dry curry powder snow. According to experts, the snow quality here is unique due to high altitude and southern exposure of the continent at about 35° latitude, a rare phenomenon in the country.\n\nHowever, against normal minimum temperature of -6 degrees Celsius for February, Gulmarg on Wednesday recorded only -2 degrees Celsius.\n\nSimilarly, against the normal day temperature of 1 degree Celsius, it was 6 degrees Celsius, a departure of 5 degrees, on Wednesday.\n\n“We were able to conduct winter activities like snow sculpting and national ski championship. However, we pray for fresh snowfall to host foreign skiers now,” Tourism Deputy director Peerzada Zahoor said. Against a footfall of around 1,000 foreigners per day last year, Gulmarg hosted just around 200 this year.", 
    "section": "national", 
    "title": "Scant snowfall hits winter tourism in Kashmir", 
    "subsection": "general", 
    "date": "2016-02-11"
}