{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The Patidar agitation in Gujarat and its persistence is worrying the BJP high command enough for party president Amit Shah to depute party general secretary Om Mathur to travel to the State and give a ground assessment of the situation.\n\nTop sources in the party have confirmed to The Hindu that the results of the local body polls in the State in December last year, where the BJP won all six urban local bodies but lost out in the rural areas have upset the party. It wants to know just how much damage has been done on the ground because of the Patidar agitation led by Hardik Patel and how much is due to other reasons.\n\n“Mathurji will travel to Gujarat in a couple of days and has been asked to submit a report to both the party president and Prime Minister Narendra Modi. The results of the local body polls especially the fact that the Congress bested the BJP in rural areas are very worrying,” said a source.\n\nThe Patidar agitation, or the demand for reservation for the intermediary caste of Patels, who were mid-level peasants has shaken things up in a State that the Prime Minister hails from. While Mr. Modi was hardly a Patel leader, he had managed to co-opt the numerically dominant community while he held sway in the State between 2001-2014.\n\nAccording to the source, “the party is concerned about the fact that the State will face its first Assembly poll in a decade and a half without Mr. Modi at the helm, and if there is a rot to stem, it should be done now.”\n\nAll this is not good news for Chief Minister Anandiben Patel who is reeling after allegations of unduly favouring her daughter Anar Patel and her business partners have hit the headlines.\n\nThe Congress has, after a very long time, seen electoral gains in the State. It swept 21 out of 31 district panchayats and 110 out of 230 taluka panchayats.", 
    "section": "national", 
    "title": "Shah, Modi seek report on Gujarat by-poll losses", 
    "subsection": "general", 
    "date": "2016-02-11"
}