{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The death of an eight-year-old boy allegedly in a celebratory firing by Samajwadi Party workers in Shamli gave new political ammunition to Opposition parties amid the ongoing campaign for the Uttar Pradesh by-elections for three Assembly seats. The BJP and the BSP have used the instance to project the SP government as “lawless”.\n\nThe impact of the tragedy could be felt much more in two of the three seats going to by-polls — Deoband and Muzaffarnagar — as they are close to the place of incident.\n\nThe incident, which the BJP termed as “classic instance of SP rule,” found mention in the speeches of BJP leaders in the two constituencies. The BJP leaders mentioned the incident in a much more aggressive manner as the elections are a direct contest between the BJP and the SP in the elections. The BSP has not fielded any candidate for the polls.\n\nState BJP chief Lakshmi Kant Bajpayee said the Shamli incident was not the first of its kind and would “certainly not be the last one.”\n\n“The very day the election results for the 2012 U.P. Assembly polls were out, a person was hit by a bullet in the celebratory firing by Samajwadi Party workers. This incident shows that the party is drunk in its love for power and has not learnt its lessons and would continue to make the ordinary public suffer,” Mr. Bajpayee told the media.\n\nThe BJP candidate from Deoband, Rampal Singh Pundhir, repeatedly mentioned the Shamli firing, saying the SP government was the government of “goons who harass and kill ordinary and innocent public even while expressing happiness”.\n\n“These people killed an innocent child while celebrating their victory. Just imagine what they would have done had they lost elections in Shamli. Again and again, the SP government has proved that it is a complete failure in protecting citizens,” Mr. Pundhir said in Deoband.\n\nCulprits yet to be arrested\n\nMoreover, the five culprits allegedly responsible for the boy’s death are yet to be arrested. The local administration has announced prize money for any information about them.\n\nThe SP legislator from Kairana Assembly constituency, Nahid Hasan, who is one of the accused in the case, told The Hindu that he did not endorse “any kind of wrongdoing by any SP worker ever”. He also clarified that he was not present at the spot of the firing.\n\nMr. Hasan, who organised a Mahapanchayat on Wednesday to demonstrate public support in his favour, told The Hindu: “this is a political conspiracy against me. I was not present at the spot. Never ever have I approved or endorsed such kind of reckless and irresponsible way of celebration by party workers. I am being unnecessarily targeted by my political opponents using this unfortunate incident as a pretext.”\n\nChief Minister Akhilesh Yadav on Tuesday announced Rs. 5 lakh as compensation for the family of the victim and invited them to meet him in Lucknow.\n\nThe BJP and the BSP have used the instance to project the SP government as “lawless”", 
    "section": "national", 
    "title": "Shamli incident adds heat to by-poll in U.P.", 
    "subsection": "general", 
    "date": "2016-02-11"
}