{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The Army andAir Force flew 200 sorties with equipment to get to the 10 soldiers\n\nUnder almost 30 feet of ice, all that Lance Naik Hanumanthappa had going for him was a small air pocket and a lot of grit. Outside, a group of well-trained Army men, two dogs, a small team of medical professionals and military pilots carried out a relentless, almost death-defying rescue act at over 19,500 feet, on a snow mountain where temperature dropped to as low as -55 degrees.\n\nDetails of the rescue operation that brought Hanumanthappa out alive after five days is already the stuff of legends. A small band of men refused to give up on their lost comrades and cut through ice walls that were harder than concrete. The Army and the Air Force between them flew over 200 sorties to rush deep penetration radars, radio signal detectors and rock drills to get to the 10 soldiers who were buried under the snow.\n\n“The rescue of Lance Naik Hanumanthappa personified the triumph of indomitable spirit of human resilience against all odds, including the mighty nature, and the determination of man to never give up on his fellow men,” an officer involved in the rescue told his friends in a small note.\n\nThough the avalanche stuck early on February 3, its ferocity and the extent of damage it caused at 19,600 feet became apparent only after the first helicopter sortie by the Air Force. Soon, personnel from the Army Mountaineering Institute and Siachen Scouts were moved in.\n\n“The Base Camp was not equipped to handle a situation of that magnitude. So men and resources were quickly requisitioned from all around,” said a soldier.\n\nAt almost 20,000 feet, working round the clock is near impossible. So at a given time, a group of about 20 men went to work. “They worked for 30 minutes and took rest and occasionally some of them were brought down to lower altitudes,” said an officer. Troops from 19 Madras, Ladakh Scouts and the Siachen Battle School were part of the operation.\n\nOnce Lance Naik Hanumanthappa was located on the evening of February 8, a doctor on the spot stabilised him and kept him alive all night as evacuation could be done only the next morning. At first light on Tuesday, he was airlifted in an army helicopter.\n\n“The pilots had dared to fly in the middle of a snow blizzard through narrow mountain features, inching forward despite all the turbulence and extremely poor visibility (at top barely 60-70m initially). They finally made a successful landing at the makeshift helipad, which was only a little bigger than the helicopter itself,” one of the officers involved in the rescue said.", 
    "section": "national", 
    "title": "Tale of a heroic operation", 
    "subsection": "general", 
    "date": "2016-02-11"
}