{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The civil-military relations need an overhaul to get over the impression that the armed forces will topple the civilian system of this country, said General V.K. Singh, former Army Chief and Minister of State for External Affairs, on Tuesday. He was speaking at the launch of the book 1962: The War That Wasn’t written by Shiv Kunal Verma.\n\n“The psyche has continued since Independence, and the psyche is that the armed forces are the naughty boys, they will probably do something and they need to be kept under total control. It got perpetuated over time,” Gen. V.K. Singh said.\n\nElaborating on the need, he said, “As per rules, the Defence Secretary [who is not a specialist] is responsible for the defence of India, and not the three service chiefs.”\n\n“This has been talked about for the past 3-4 decades,” General Singh observed, and pointed out that even the Kargil review committee had proposed it. “It is high time we discussed it seriously,” he said.\n\nHowever, this should be complemented by a strong leadership in the Army which can take decisions in the interest of the forces. In 1962, India suffered a terrible defeat at the hands of the Chinese and the scars have not healed. The Henderson Brooks report, which did a post-mortem of the war, has been highly controversial and successive governments have refused to declassify it.\n\nStating that the report would be declassified soon, BJP leader Subramanian Swamy said the war was mainly a psychological failure.\n\n“There are a few in the government opposing it… but it will be declassified. Mr. Parrikar [Defence Minister] has assured me on this,” said Dr. Swamy. However, he said the report was “now out of date” and would be of interest only to historians.", 
    "section": "national", 
    "title": "Time to overhaul civil-military ties: Gen. Singh", 
    "subsection": "general", 
    "date": "2016-02-11"
}