{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Standing on a mountain of garbage as tall as a four-storey building, watching a plane disappearing in the cloud, Noor Mohammad blamed the wind for changing its direction last month. “That changed direction took the smoke to those high rises,” pointing at the new skyscrapers that have sprung up in the Govandi, Deonar area over the last few years. “And people realised that the Deonar dumping ground was on fire. For many years, we have been witnessing at least two to four such instances annually. Neither the politicians bothered nor the media,” he says.\n\nAs if to support his claim, a fire brigade truck entered the dumping ground at a distant spot. “Look there! Look at the smoke coming out of the garbage. Thanks to the wind, smoke will now move towards the Vashi creek and no one will realise that the dumping ground was on fire on Wednesday as well,” adds Mr Mohammad, who is in his late 30s and has spent his entire life in Deonar.\n\nFire in the dumping ground is routine for around 6,000 residents of Rafique Nagar. The garbage site is always on fire, they say. They add that authorities do not bother most of the time since it is only them, the slum-dwellers, who inhale smoke. “Just dig a few feet. The hot gases will come out,” says Ehsan Ahmed Sheikh, another resident of Rafique Nagar.\n\nIt was in 1996 that the Rafique Nagar slum pocket came up adjacent to the dump yard, after the slum dwellers were removed from a location where a garden was meant to come up. It’s been 20 years of inhaling garbage fumes 24 hours a day. “Who wants to live near the garbage site? But do we have a choice? This dumping ground gives us our daily bread. Almost 5,000 ragpickers and their families from nearby areas depend on it,” says Mr Sheikh.\n\nWhether registered or non-registered, the Deonar dumping ground assures every ragpicker who dares to segregate plastic, wood and iron, a minimum of Rs 200 a day. Spread over almost 132 acres of land, this is where the entire city of Mumbai dumps its garbage, almost 2,000 tonnes every day. Mohammad Salman Khan from Uttar Pradesh is one of the registered ones, who works without hand gloves, boots or masks like many others. “For an illiterate like me, this is the only job that will give me money.”\n\n“Closing down the dumping ground cannot be an option,” Mr Sheikh says, supported by others. According to him, the lives of thousands of people are dependent on this dumping ground. “Before closing it, the government must think about the people whose lives depend on it. The government must concentrate on following rules such as building a proper boundary wall so that the garbage doesn’t spill over into their slum, setting a limit for the garbage sent here and give alternative livelihood options to ragpickers.”", 
    "section": "national", 
    "title": "Why 6,000 people want Deonar dumping ground to stay open", 
    "subsection": "general", 
    "date": "2016-02-11"
}