{
    "author": [
        "Somesh Jha"
    ], 
    "text": "In a first, the government is set to mandate four months of paid maternity leave to women having babies through surrogacy and those who adopt a newborn within three months of birth.\n\nExpectant mothers would be entitled to six-and-a-half months of paid leave, compared to just three months now, under the proposed amendments to the Maternity Benefit Act 1961 that are expected to be considered by the Cabinet soon.\n\nCrèche mandatory\n\nUnder the proposed amendment, offices with 50 or more workers will have to compulsorily provide crèche facility on their premises.\n\n“Women who legally adopt a child up to 3 months of age will get maternity leave of 16 weeks. A commissioning mother or women having babies through surrogacy will also get 16 weeks of paid leave from the date of handing over of the child,” a senior Labour Ministry official told The Hindu . The idea was to allow women to take care of the child and then get back to work in a healthy condition\n\n“It is a very commendable move,” said Dr. Sushila Gupta, a practising gynaecologist at Sanjivani Nursing Home here. “Six and a half months is a good time period for women to get back to work after delivering a baby. Already, a lot of companies have increased maternity leave to around six months to encourage women’s participation in the workforce.”\n\nWhile Women and Child Development Minister Maneka Gandhi had suggested raising maternity leave to eight months from three months, women’s unions said the government’s move to raise the leave to six months is a good start and the benefit must be extended to those working in the unorganised sector.\n\nJagmati Sangwan, general-secretary, All-India Democratic Women’s Association, said it was a very positive step. “We appeal to the government not to add any conditions to the proposed benefits. Also, these benefits must reach the unorganised sector as well.”\n\nGlobally, around 98 countries provided maternity benefit of at least 14 weeks till 2013, said a report titled ‘Maternity and Paternity at Work’ prepared by the International Labour Organisation. Forty-two countries gave 18 weeks of paid maternity leave.\n\nWomen working in government offices in India get a six-month maternity leave, according to the Central Civil Service (Leave) Rules 1972.\n\nCabinet to also consider 4 months’ leave for women having babies through surrogacy", 
    "section": "national", 
    "title": "Woman adopting newborn may get maternity leave", 
    "subsection": "general", 
    "date": "2016-02-11"
}