{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "Group of former employees condemns re-appointment of Pachauri\n\nEven after a harassment case against him, if R.K. Pachauri has continued to be here, something is really wrong, says a former colleague.\n\nYoung women who join The Energy and Resources Institute (TERI) are cautioned by their seniors to be careful with the executive vice-chairman R.K. Pachauri, a woman working with the organisation said.\n\nIn an organisation which has a large number of women employees, there is unrest and disappointment, after Mr. Pachauri was announced as the new executive vice-chairman of the organisation two days ago.\n\nAccused by a former 29-year-old colleague of sexual harassment in February 2015, Mr. Pachauri, then director general of the organisation, was forced to leave TERI. However, two days ago, he was officially back at the helm of things.\n\n“For the rest of the world, it might look like he is back at the helm of things. But the fact is, he never went anywhere. Except the days when he was not allowed to enter the organisation, he has always been like an inseparable part of the organisation,” said an employee of the organisation.\n\n“This is an extremely unsettling situation for all of us because we are all disappointed with the way the organisation dealt with the case. Some of our colleagues have even quit their jobs and some of us feel like quitting,” she said.\n\nAnother said: “It seems like Mr. Pachauri and TERI are inseparable. Even after a sexual harassment case against him, if he has continued to be here, something really wrong is happening.”\n\nAccording to sources in the organisation, between May and December last year, 10-15 people have left the organisation, the majority being women employees.\n\nA mid-level researcher at the green body, who quit the organisation last year, told The Hindu : “Working in TERI was getting extremely irritating for me. Apart from the fact that I was upset with the way the organisation dealt with the case, I was also upset about the organisation’s attitude towards employees who chose to believe the woman’s side of the story.”\n\n“Our computers were constantly under surveillance and we were being constantly kept under a watch. I also know for a fact that people who had an opinion on the issue were not appreciated. In such a scenario, it was just good for me to quit the place,” she said.\n\nA couple of months ago, a friend of the complainant woman also resigned from the organisation, saying that he was being forced to convince the woman to withdraw her case. The woman, in an open letter written on Tuesday, also mentions that her friends in the organisation were forced to persuade her for reconciliation. “Not a day passed without a message like this showing up on my mobile phone: ‘Ask your lady friend to settle out of court. That would be best for her as she has nothing more left to achieve’,” she wrote in her letter.\n\nMeanwhile, a group of former TERI employees has written a letter to the governing council condemning Mr. Pachauri’s appointment, saying that it was a “slap” in the face of those fighting against gender discrimination and demanded deferment of his elevation till the case was decided by the court.", 
    "section": "national", 
    "title": "Women staff at TERI unnerved", 
    "subsection": "general", 
    "date": "2016-02-11"
}