{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Councillors say there are stretches worse than those identified for repairs\n\nThe Corporation will take up repair of nearly nine roads that were battered in the recent floods, in the first phase. A damaged road near Makkan area.— Photos: C. Venkatachalapathy\n\nThe November rains wrecked havoc on many roads in Vellore Corporation causing hardship to road users. To take up temporary restoration of rain battered stretches, the Corporation has been allocated Rs. one crore in the first phase.\n\nThe Commissionerate of Municipal Administration had given administrative nod to take up temporary restoration of tar and concrete roads damaged in the north east monsoon at a cost of Rs. one crore.\n\nFirst phase of funds\n\nThis, according to officials, is the first phase of funds for the works, and more funds will be released later.\n\nThe local body has identified around nine places to take up the patch works.\n\nThe works listed are - restoring tar roads laid on 12th street in Gandhi Nagar East (ward 12) at Rs. 12 lakh, third main road, Gandhi Nagar East (ward 9) at Rs, 10 lakh, Venkatraman Nagar area (ward 10) at Rs, 10 lakh, Vigneswara Nagar area (ward 19) at Rs, 10 lakh, third main street (ward 23) at Rs. nine lakh, Arokiya Madha Koil Street (ward 31) at Rs. 13 lakh, Veppamara Street (ward 33) at Rs. 15 lakh, Burma Colony area (Ward 57) at Rs. 12 lakh and concrete road in Makkan area (ward 59) at Rs. nine lakh.\n\nConsidering the urgency of these works, the Mayor had given administrative nod to call for tenders. This along with the list of works were placed before the council recently.\n\nHowever, patchworks will be taken up for a total length of 1.8 km, with the length of selected stretches ranging from 130 m to 300 m.\n\nHowever, a number of councilors are unhappy with the selection of stretches. They say that there are worse roads that need immediate attention.\n\nStretches identified\n\n“With this Rs. one crore, the Corporation has identified stretches in areas that were not flooded in the November rains.\n\nRoads in parts of Kazhinjur, Dharapadavedu, Muthamizh Nagar, Bharathi Nagar and V.G. Rao Nagar are badly battered roads, and are in dire need of repair. But officials are saying this is only the first phase works, and more roads will be covered later,” a councillor said.\n\nHe added that roads around Kazhinjur Lake were damaged after the water body was filled up, and surplus water overflowed onto the roads. Another councillor said that instead of allocating Rs. nine to Rs. 15 lakh for each of the works on the identified stretches, the fund could have been divided and distributed for 20 to 25 wards.\n\n“This way, each of the 20 or 25 wards could have been given Rs. three to five lakh to take up patchwork on roads that need immediate repair works. Most of the roads identified are concentrated in Katpadi side. Motorists are finding it extremely difficult to travel on many rain battered stretches where repair works should be done at the earliest,” he said.\n\nHe said the National Highways department should take up measures to repair damaged portions of the arterial Anna Salai.\n\nAn official said the government will next provide funds for permanent restoration works of rain battered stretches.\n\nThe present fund was to take up patchwork on highly damaged roads.", 
    "section": "national", 
    "title": "1 cr. allotted for restoring battered roads in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}