{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Potters enrolling themselves as members of Welfare Board at a special camp in Erode district on Tuesday.— PHOTO: M. GOVARTHAN\n\nTwo hundred potters registered themselves with the Tamil Nadu Pottery Workers Welfare Board at a special camp organised by the Labour Department here on Tuesday.\n\nRegistered workers in the age group of 18 to 60 years are entitled to get education assistance, marriage assistance, maternity benefit, purchase of spectacle, funeral expenses, assistance for natural death, accidental death, and disability.\n\nThose completing 60 years are entitled to monthly pension. A person suffering from disability after five years of membership with the Board is also entitled to monthly pension even before attaining 60 years.\n\nRegistration of the manual workers with the board was made by the District Labour Officer - Social Security Scheme Munian after due verification of their identity by the Village Administrative Officers.\n\nThe potters in the district, who have been facing impediments in sticking on to the vocation, have welcomed their registration with the Board.\n\nSustained encroachment of tank beds has been denying them their livelihood. They are no longer able to source clay from tank beds for nominal costs.\n\nA tractor load of clay costs upwards of Rs. 5,000. Potters say they face the ignominy of paying hefty fines to revenue authorities for sourcing even small quantities of clay from the tank bed.\n\nTwo hundred more potters could have registered with the Board if not for the delay in providing net connection to the Corporation Marriage Hall near the Main Bus Stand where the special camp was conducted.\n\nThe camp began at 10 a.m., but the internet connection was provided by BSNL four hours later.\n\nAccording to sources, a communication gap was the cause.\n\nThe BSNL is learnt to have provided temporary net connection to the Marriage Hall from 5 p.m. on Monday till 9 a.m. on Tuesday.\n\nThe connectivity was provided after the potters threatened to take to streets, sources said.", 
    "section": "national", 
    "title": "200 potters register with Welfare Board", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}