{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "More than 300 pigeons would vie for honours in this year’s annual pigeon racing conducted by the Ramanathapuram Racing Homer Club here from January 10 to February 27.\n\nGiving details of the event, N. Ramesh, Managing Director of the Homer club said 15 people, who were rearing racing homers have registered for the competition to be held in five phases beginning January 10 from Tambaram in the first leg.\n\nEach participant would be allowed to use five to nine birds in each leg as they were trained to fly particular distance with accurate timings, he said. In the first leg, the pigeons would fly for 423 km from Tambaram, followed by Nellore (615 km), Ongole (708 km), Vijayawada (852 km) and Warangal (1050 km) in the other legs, he said.\n\nA three-member committee has been formed to carry the birds to various destinations and the timing of the release of the birds and their arrival at the homes of those who reared the birds would be videographed, he said.\n\nLast year, the final leg was held from Kammam in Andhra Pradesh covering a distance of 950 km and this year, it has been extended to Warangal to cover a total distance of 1050 km, he said. In the final leg, the birds would be let off at Warangal at 7 a.m. on February 27 and they were expected to return here by 2 to 3 p.m., two days later, he added.\n\nBirds which returned back to the base within the prescribed time would be awarded points in each leg and a participant’s bird which earned highest points would be awarded the overall championship.\n\nThe winner would be given prize money of Rs. 15,000, the runner up Rs. 8,000 and the third prize winner Rs. 5,000, he said.\n\n“More than money, it is prestige that matters in the competition,” Mr. Ramesh told The Hindu here on Tuesday. Racing homers were special breed of pigeons with homing instinct and could fly at high speed non-stop. The participants spend lot of money in rearing and readying the birds for the competition, he added.", 
    "section": "national", 
    "title": "300 racing homers in the fray for honours", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}