{
    "author": [
        "Parshathy J Nath"
    ], 
    "text": "Students of Drama Club of PSG College of Arts and Science rehearsing the play ‘Neer Nadodigal’ in Coimbatore.– Photos: M. Periasamy\n\nA play about human vulnerability in the face of natural disasters\n\n“Floods remind you of your history and collective past. Even the ragged clothes, will have a story to tell,” says theatre person, S. Murugaboopathy. He is directing a play ‘Neer Nadodigal’ with the students of Drama Club, PSG College of Arts Science.\n\nSpeaking of the Chennai floods he said it reminded him of a village in Dhanushkodi that was once submerged in the sea.\n\n“A lot of literature on theatre and poetry was lost to us. But, once in two years, when the water recedes, the ruins of the village rise up!”\n\nNeer Nadodigal does not just talk about Chennai, but explores how a natural disaster makes a puppet out of humans.\n\n“Irrespective of whether you are rich or poor, everyone suffers equally. The body becomes yet another prop at the hands of Nature.”\n\nThe students requested Murugaboopathy to direct them after they watched one of his plays, says Hardhik Bafna, the organiser and a second-year BBM student.\n\nWorkshop\n\n“The workshop has been on for 25 days. We had sessions on mask making, voice workshops, brainstorming ideas and prop management. The script has evolved in the process through discussions and improvisations.”\n\nInitially, the play had nothing to do with the floods because they had started working on it before the disaster struck Chennai, says Sushmita Ayyagari, a third-year B.Com student and actor.\n\n“Chennai was a later addition. As we were rehearsing, the news of the deluge poured in. Many of our friends were caught in it and some of them even went to Chennai to volunteer. We knew we were young and we had to do our bit. It has been an intense and emotional journey for us.” Murugaboopathy says that students showed amazing levels of maturity while handling this theme.\n\n“The play uses body extensively and is non-verbal. Forgetting about gender barriers, the students acted out without inhibitions. They truly imbibed the spirit of the play.”\n\nMurugaboopathy, whose play ‘Kugaimaravasigal’ was selected for the Bharat Rang Mahotsav at National School of Drama, has done his Masters in theatre at Puducherry University and followed that up with research at Thanjavur Tamil University.\n\nHe says it was his childhood memories of lives around circus tents that later influenced him in his plays.\n\n“Lives of refugees have been a strong theme in my plays. And circus tents always remind me of a big refugee camp, with artists from across the country.”\n\nNeer Nadodigal also depicts how man is reduced to a refugee in the face of natural disaster.\n\n“The play brings focus on animals, trees, and insects…everyone who was carried along by the floods will revisit you through our play.”\n\nNeer Nadodigal will be staged on January 9 at PSG CAS at 6 p.m. The tickets are available at Green Trends, RS Puram, Zucca Pizzeria, Mehta Jewellers, R.S. Puram and Vs Café, Sai Baba Colony.", 
    "section": "national", 
    "title": "A flood of stories", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}