{
    "author": [
        "V S"
    ], 
    "text": "They will start arriving tomorrow; elephant safari to be suspended in Anamalai Tiger Reserve and Mudumalai Tiger Reserve\n\nThe Government has allocated Rs 1.04 crore for the camp to facilitate participation of 43 elephants this year— PHOTO: S. SIVA SARAVANAN\n\nThe stage has been set for the inauguration of the rejuvenation camp for temple and mutt elephants at Thekkampatti along the banks of river Bhavani near Mettuppalayam on Friday.\n\nThe Government has allocated Rs 1.04 crore for the camp to facilitate participation of 43 elephants this year. However, taking into account the ailing elephants and those that refuse to board the trucks, officials expect only 33 jumbos to turn up. The pachyderms might start arriving at the five-acre camp site from Wednesday afternoon onwards.\n\nThe Forest Department has elephant camps at Kozhikamudhi and Chinnar in Top Slip in Anamalai Tiger Reserve (ATR) and Mudumalai Tiger Reserve (MTR) in the Nilgiris, besides two elephants at a satellite camp at Chadivayal on the foothills of Siruvani in Coimbatore. They will rejuvenation at their camp locations.\n\nOfficials said ailing elephants, those which refuse to board trucks and in musth (the frenzied state of certain male animals, especially elephants or camels, associated with the rutting season)would be exempted. The camp will go on from January 7 to February 23. The regular schedule for the elephants would include a morning, shower in the Bhavani river, pujas and a healthy and nutritious diet as prescribed by the veterinarians.\n\nThe diet would include coconut, banyan and palm leaves besides sugarcane, rice, ragi, horse gram and green gram besides chayvanprash, ashtachoornam, vitamin and mineral mixtures. The quantity of diet will be prescribed on the basis of gender, height, weight and age of each pachyderm. The progress card on the health of each elephant will be updated during the camp period, officials said.\n\nOfficials have almost completed work relating to putting up sheds for housing kitchen for the jumbos and mahouts and cavadis, resting sheds for elephant handlers, sheds for storing veterinary medicines and mahouts and cavadis. From this year, the elephants will get an extra shower.\n\nThe entire five-acre has been fortified with solar fencing and the fence along the road has been covered with metal sheets.\n\nThis is to prevent wild elephants from entering the camp site, which is close to the Western Ghats.\n\nWhile private security personnel have been hired to maintain vigil, forest personnel will patrol the camp site boundary.", 
    "section": "national", 
    "title": "All set for elephant rejuvenation camp", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}