{
    "author": [
        "S Senthalir"
    ], 
    "text": "Yogacharini Meenakshi Devi Bhavanani addresses the 22nd International Yoga Festival; children display their skills in asanas at Subalakshmi Mahal and free Yoga classes being held on the Beach Road as part of the festival in Puducherry on Tuesday.— Photos: T. Singaravelou and M. Samraj\n\nNearly 1000 participate in the various categories of competitions and workshops\n\nSubalakshmi Mahal in Muthialpet on Tuesday started buzzing with yoga enthusiasts, children and adults alike, keen on displaying their proficiency in asanas.\n\nYoga ambassadors from different states to first-time entrants, the participants were warming up to the three-day event that will be packed with competitions and workshops.\n\nThere were 992 candidates participating in the competition and 20 were foreigners. Yoga enthusiasts from Germany, Spain, Italy and Hong Kong were part of this festival.\n\nTwo separate stages were set for the girls and boys to perform. The jury sat around a mat where the children between the age group of 10-15 performed. As they twisted arms and legs performing difficult asanas, the jury wrote down the marks in a black slate and displayed it after every asana. The other participants were seen practising asanas under the supervision of their coaches.\n\nThe International Yoga Festival in Puducherry has a long history dating back to 1992. Many have participated in the competitions more than once. Coming from far off places, they have also won medals. “It is a pleasure coming to Puducherry. The serene environment and beautiful city has always attracted us to this city,” says Saksham Mishra, a participant.\n\nThe enthusiastic reception of Yoga Festival has given the Tourism Department an impetus to organise this festival from January 4 to 7 every year. This is the 22{+n}{+d}International Yoga Festival.\n\nThe Uttarakhand brand ambassador for Yoga was seen at the yoga competition. Just 21 years old, Dilrajpreet Kaur has won gold medal in International Yoga Competition held in Thailand in 2011. She is a student of Devsanskriti Vishwa Vidyalaya and said to be participating in the International Yoga Festival in Puducherry for the fifth time.\n\nThe competitions are held for different age groups. Six categories have been formed to conduct the competition. The categories were divided based on the age groups — 10-15 years, 16-20, 21-25, 26-35, 36-50 and 51 years and above.\n\nWomen participants above 30 years were at the venue keenly looking forward to their opportunity to perform. Thirty-two year old Archana, an international player who represented India for Asia Competition for Yoga in Hong Kong in 2011 was also present. It was the first time she has come to Puducherry. “I am hoping to win a gold medal even here,” she says with confidence.\n\nWorkshop on various topics like World Peace through Yoga, yoga for school children and management of arthritis or back pain were conducted at Gandhi Thidal. The workshop began at 10 a.m. and went on till Tuesday night.\n\nGlitch\n\nEven as the competitions and workshops took off smoothly, there were some glitches as well. Disgruntled parents accused the jury of not being qualified enough to judge the performers. A parent from Coimbatore, who did not want to be named, complained: “I do not think the jury members are qualified enough to judge the performers. I am going to raise this issue with the officials concerned.”", 
    "section": "national", 
    "title": "Asanas galore at International Yoga Festival", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}