{
    "author": [
        "S Poorvaja"
    ], 
    "text": "At first, 11 schools across the city declare a holiday; many others follow suit as rumours continue to spread\n\nParents take their children back after they receive messages about a bomb scare in some city schools. A scene from Chinthadripet —Photo: R. Ragu\n\nOn Tuesday, many schools in areas near East Coast Road (ECR), including Thoraipakkam, Injambakkam and Palavakkam, wore a deserted look after 12.30 p.m. as parents took away their children claiming they had received messages on WhatsApp warning them about bomb threats to schools in the area.\n\nHowever, the fear was not restricted to these areas as the bomb scare spread to schools in Mylapore too — many schools saw anxious parents queuing up outside the gates to take their wards home even as Principals and teachers assured them that there was no bomb threat.\n\nAt first, 11 schools across the city declared a holiday. Soon, many others followed suit as the rumours continued to gain in intensity.\n\nSchools send messages\n\nA few schools sent messages to parents stating that there was a rumour because of which they were declaring a holiday, and asked them to pick up their wards.\n\nS. Lakshmi Devi, whose daughter studies at a school on ECR, said many of them rushed to the school after hearing about a bomb threat to schools in the area.\n\n“We wanted to take away our children and the school declared a holiday since many of us had assembled there,” she said.\n\nSource unknown\n\nThe Principal of a school in Mylapore further said that they had no idea how the rumours spread.\n\n“There are many schools in the area; and there was a cause for concern. We informed the local police of the rumours. They assured us that it was a hoax and we conveyed the same to the parents immediately,” the Principal said.", 
    "section": "national", 
    "title": "Bomb scare keeps schools shut for half a day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}