{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Bypass riders operated by the Tamil Nadu State Transport Corporation for various destinations from Tuticorin enter Ettayapuram, delaying the journey of passengers. Travellers complain that this defeats the purpose of operating bypass riders.\n\nIt was unfortunate for passengers who, despite being promised a travel on the bypass road, were taken on longer, time-consuming routes, R Kanagavel, a passenger said. After waiting for long, most of the passengers confidently board the ‘bypass rider’ buses with the hope of reaching their destinations in time. But, passengers are at the height of their anger when buses bound for Madurai and other destinations slow down near Ettayapuram and deviate from the bypass road. . While boarding the bypass riders, no passenger was informed about the buses taking a detour into Ettayapuram, S. Muthupandi, another passenger, rued.\n\nIn bypass riders, a fare of Rs.90 is collected from a passenger from Tuticorin to Madurai. For Madurai-bound buses plying through Ettayapuram, Aruppukkottai and Pandalkudi , the fare is Rs.85. When passenger rights were violated, the issue should be taken to court, Lawrency Vijay, a passenger, said.\n\nDespite such delays, passengers on board these buses also had to wait in a motel near Pandalkudi. Since the buses stopped in the wayside motel and plied to Ettayapuram, the journey was delayed by about 25 to 30 minutes. Sometimes, it took over three hours to reach Madurai from Tuticorin. But, many a time buses plied non-stop between Tirunelveli and Madurai, another passenger M. Shanmugam lamented.\n\nM. Piramanayagam, secretary, Tuticorin District Passengers’ Welfare Association, said bus services such as ‘one-to-one’ on Tirunelveli – Nagercoil and Tirunelveli- Tenkasi routes and ‘end-to-end’ service between Tuticorin and Tirunelveli could be introduced on Madurai route also. K. Murugan, TNSTC General Manager, told The Hindu that it was based on Collector M. Ravikumar’s order that bus drivers were instructed to enter Ettayapuram since the residents there had placed a strong demand that all buses should touch Ettayapuram.", 
    "section": "national", 
    "title": "Bypass riders do not bypass Ettayapuram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}