{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The eight-member Central team headed by Joint Secretary of the Union Home Ministry T.V.S.N Prasad inspecting the flood affected area at Saidapet in Chennai on Tuesday.-Photo: B.Jothi Ramalingam\n\nAn inter-ministerial team from the Centre on Tuesday commenced its two-day survey in the flood-affected areas in the city, the second such survey since November last year.\n\nThe eight-member team headed by Union Home Ministry Joint Secretary T.V.S.N. Prasad called on Chief Minister Jayalalithaa at the Secretariat, before heading for spot assessment of the large-scale damage to properties and loss of lives in the torrential rains last month, which was declared as ‘Calamity of Severe Nature’ by the Centre.\n\nSame team\n\nThis was the same team which conducted spot assessment in rain-affected areas in various districts in November 2015.\n\n“The requirement of funds for relief and restoration of infrastructure are well beyond the resources available with the State. I therefore request the Central team to make an in-depth assessment of the damage suffered by the State and to submit its report to the Ministry of Home Affairs expeditiously,” Ms. Jayalalithaa told the team and thanked the Prime Minister for sending the same team, according to an official release.\n\nThe State government has sought Rs. 25,912 crore for relief and restoration efforts.\n\nThe release also quoted Mr. Prasad as saying, “There was widespread appreciation in the Ministries of Government of India about the prompt manner in which the State government machinery rose to the occasion and attended to rescue, relief and restoration work. The State government was successful in preventing outbreak of any epidemic by timely measures such as chlorination and health camps.”", 
    "section": "national", 
    "title": "Central team meets CM, visits flood-hit areas", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}