{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: R. Krishnamurthy, Sri Sankara Gurukulam, 9/20, C.P. Ramaswany Street, Abhiramapuram, 6-45 p.m.\n\nMahabharatham: Keeranur Ramamoorthy, Sath Sangam Hall, Anna Salai, Pammal, 6-30 p.m.\n\nThiruppavai: N. Rajeswari, Bashyakara Adhi Chenna Kesava Perumal Temple, West Mambalam, 7 a.m.; Kidambi Narayanan, Narada Gana Sabha, T.T.K. Salai, Alwarpet, 7 a.m.; K. Venkatesan, Kanchi Shri Krishna College of Arts and Science, Kilambi, 1 p.m.; Devanathachar, E-55-B, 19th Cross St., Besant Nagar, 4 p.m.; T.N. Aravamudha Thathachari, Sri Desika Dharsana Sabha, Pandiyan St., Taramani, 4 p.m.; V. Ramamoorthy, 35, Dr. Azhagappa Rd., Purasawalkam, 6 p.m.; Ram Mohandoss, Sri Prasanna Venkatesa Perumal Temple, Sathanipettai, Guindy, 6 p.m.; Kalian Sampath, Sri Kasi Viswanathar Temple, 6-15 p.m.; J. Chinnathambu, Siva Vishnu Temple, Periyar Nagar, 6-30 p.m.;\n\nVenu Raza Narayanan, Sri Rama Kulasekara Azhwar Temple, Edward Park St., Kosapet, 6-30 p.m.; T.A. Srinidhi, Narayaniammal Kalyana Mandapam, Mandaveli, 6-45 p.m.; D. Srivallaban, 1, Sriram Nagar 1st St., Selaiyur, 7 p.m.; P.T. Seshadri, Damodara Perumal Temple, Villivakkam, 7 p.m.; T.G. Narayanaswamy, 273-B, 2nd Main Rd., Natesan Nagar, Virugambakkam, 7 p.m.\n\nVishnu Sahasranamam: Velukudi Krishnan, Sri Lakshmi Narasimhar Temple, MMTC Colony, Nanganallur, 6-30 p.m.\n\nJeevan Mukti Vivekam: K.S. Maheswaran, Sri Sankara Gurukulam, 9/20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nCULTURE\n\nGoethe-Institut Chennai/Max Muellar Bhavan and Indo Cine Appreciation Foundation: 13th Chennai International Film Festival 2015, Woodlands Theatre, Royapettah, 6-30 p.m.\n\nGENERAL\n\nDr. M.A.M. Ramaswamy Chettiar of Chettinad Charitable Trust: Condolence meeting of M.A.M. Ramaswamy Chettiar and unveil portrait, Governor K. Rosaiah participates, Rani Meyammai Hall,, Egmore, 6 p.m.\n\nKanchi Shri Krishna College of Arts and Science: Seminar on ‘Certain biochemical and immunological aspects of cancer’, Kilambi, Kancheepuram, 10 a.m.\n\nRukmini Devi College of Fine Arts: Convocation, Rukmini Arangam, Kalakshetra Foundation, Thiruvanmiyur, 10 a.m.\n\nSri Bhaktha Anjaneyar Cultural, Charitable and Spiritual Association: Inauguration of Hanumath Jayanthi festival, 4th Cross St., AGS Colony, 7 a.m.\n\nSri Panchamuga Anjaneyar Trust: Hanumath Jayanthi festival, Pazhaniappa Nagar, Gowrivakkam, 8 a.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}