{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Coimbatore, touted to be a potential destination for meetings, incentives, conferencing and exhibitions (MICE), needs better air connectivity to attract major events, say hoteliers and industry owners.\n\nCoimbatore has an inventory of 800 rooms in the three-star and above rated hotels. A major conference or event should have 1,000 to 2,000 participants and Chennai and Bengaluru are some of the preferred cities in the south now.\n\nAccording to Erine Louis, General Manager at the Residency Towers, all segments of the economy in a city should benefit when there is a major conference or exhibition. Similarly, the stakeholders in the tourism sector (the Government, tour operators, hotels, and event managers) should take joint efforts to promote meetings, exhibitions and conferences. There should be pre-tours and post-tours, he says.\n\nAt the CODISSIA Trade Fair Complex, which is one of the main venues for such events, there had been the annual exhibitions that are held usually. Except for the expo on the machinery sector, the other exhibitions had good response in the last one year. This could be because industries are reluctant to make capital investments and the slowdown, said a representative of the association.\n\nIf a visitor should come to Coimbatore from New Delhi or Kolkata, the air connectivity options are limited. There should be more venues that permit entertainment and social gatherings after the event and tour operators need to have packages for the visitors to shop, go on one-day visits, etc, say managers of a couple of leading hotels here.\n\nHowever, the slowdown had not affected local exhibitions, loan melas and events. Any expo, such as consumer trade fairs, that requires minimum investment (for the exhibitor and the visitor) had good response in the last one year, says E.K. Ponnuswamy, president of Coimbatore District Small Industries’ Association.\n\n“We usually organise four loan camps a year. This year, we did five,” according to VG Ads, an event organiser.\n\nCoimbatore should complement its strengths in industries and infrastructure with more facilities to attract organisers of major conferences and exhibitions, say the hoteliers and industry owners.", 
    "section": "national", 
    "title": "Coimbatore needs to address bottlenecks to be a MICE destination", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}