{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Govt. employee was charged excess due to faulty meter\n\nThe State Consumer Disputes Redressal Commission, Puducherry has directed the Electricity Department to refund the excess amount charged from a consumer and also ordered compensation besides the litigation cost.\n\nS.Rajasekar, a Government employee, was residing at Government quarters.\n\nFaulty meter\n\nHe found in July 2007 that the electricity meter at his house was not functioning properly. He immediately intimated the same to the concerned meter reader of the Electricity Department.\n\nThough the consumption of electricity was the same, the bill escalated from Rs.45 to Rs. 95 per month. In spite of his repeated complaints to the department, there was no response.\n\nHence, he preferred the complaint before the district forum seeking a direction to the department to replace the defective meter. He also sought refund of the excess amount charged from him.\n\nThe Electricity Department contended that the service connection stood in the name of executive engineer Public Works Department. Therefore the complainant has no locus standi to file the complaint.\n\nIt also contended that the meter could not be replaced immediately as there was acute shortage of meters and the same was replaced after sometime.\n\nFurther it contented that the billing was properly done and there was no unjust demand.\n\nJudgement\n\nAfter hearing both parties, the district forum dismissed the complaint. Hence, he preferred the present appeal before the State Commission.\n\nDelivering on judgement on the appeal, the Commission headed by its president Justice K. Venkatraman said, “It is also not disputed that the electricity service connection stood in the name of the PWD Department.\n\nHowever, one shall not forget the fact that the complainant is enjoying the power supply in the premises occupied by him. Sec 2 (d) for the Consumer Protection Act 1986 which defines consumer states that not only the person who buys the goods but also a person enjoys such goods shall be considered as consumer.”\n\nCompensation\n\nViewing that there was a deficiency in service, the Commission said the Electricity Department has to repay the excess amount collected from the complainant. It also directed the department to pay Rs.5,000 as compensation and another Rs. 5,000 towards litigation cost.", 
    "section": "national", 
    "title": "Commission directs Electricity dept. to refund money to consumer", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}