{
    "author": [
        "C Jaisankar"
    ], 
    "text": "“Effort is aimed at attracting attention of parents to enrol their wards in the school”\n\nDwindling students’ strength in government schools has been a matter of concern for many, including policymakers and teachers. However, the Headmistress of Tiruchi Corporation Middle School at Bheema Nagar has made a sincere attempt to lure students by establishing a smart classroom on par with private schools with her own contribution.\n\nEntry to the school itself gives fresh feeling to the visitors that it was definitely better than other government schools.\n\nBesides the headmistress room and primary section, the main hall, where smart classroom is established, looks elegant with shining tiles, refurbished furniture, and curtains.\n\nA projector beams characters and pictures with simple explanation, much to the delight of students, who hail from poor background. About Rs. 1.25 lakh has been spent for setting up smart classroom.\n\nThe walls have been dotted with the quotes of noted leaders and educationists, enlightening the students and visitors.\n\nThe headmistress of the school D. Raja Rajeswari, who had spent substantial money to set up the smart class, says the effort was aimed at attracting the attention of parents to enrol their wards in the school from the next academic year.\n\nThe school, which was started in 1925, had a maximum strength of 450 students in early 90’s. During its heydays, it had 2,000 children. The strength has slipped to 56 students now.\n\n“There are five private schools within 500 metres of our school. The parents invariably prefer private schools. It has ultimately brought down the strength. Our efforts will send the message that the Corporation school too has good infrastructure thereby bringing more students,” says Ms. Rajeswari.\n\nShe said the school had collected educational compact discs, prepared by the District Institute of Education Technology, Vellore, for the Classes 1 to 7. Since it had positive response from the students, they would be screened at the smart classroom on a daily basis.\n\nIn addition to the contribution of Ms. Rajeswari, other teachers of the school such as S. Sagunthala, R. Subbulakshmi, M. Nargeese, and L. Paulin Valarmathi spend Rs.1,500 a month towards auto charges for transporting students to the school.\n\nThe school authorities have arranged for morning breakfast for the students with the support of Sathru Samharamoorthy Ashram.", 
    "section": "national", 
    "title": "Corporation school headmistress spruces up school with her own funds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}