{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Unidentified persons hurled a crude bomb — kerosene-filled liquor bottle — on Central Market Lane close to the East Tower of Sri Meenakshi Sundareswarar Temple here on Tuesday night.\n\nHowever, none was injured and no property damaged. The police found two more broken liquor bottles at a distance near the North-East Chithirai Street junction. At least a score of persons were around when the bomb exploded at the Central Market Lane which is a main thoroughfare to the world-renowned temple for pilgrims on their way to the main parking lot of the temple.\n\nThe bomb, suspected to have been hurled from behind the 10-foot-high compound wall of the Soil Testing Centre of the Department of Agriculture, landed on the wall of a stationery shop.\n\nThe flames coming out of the bottle set on fire waste materials on the road. “The flame also spilled over a two-wheeler but was put out immediately without any major damage,” an eye-witness said. Water from a public toilet being operated next door came in handy for putting out the flames, a neighbour, Srinivasan, said.\n\nThe incident is said to have occurred at around 7 p.m. when there was heavy rush of Ayyappa devotees from across Tamil Nadu and neighbouring States visiting the Meenakshi Sundareswarar Temple. Besides, many devotees were standing outside the public convenience after taking bath. A few shops and roadside hawkers were around when the incident took place.\n\nThe Deputy Commissioner of Police (Law and Order), Bandi Gangadhar, along with senior police officials, inspected the spot. The police suspect that the accused could have trespassed into the Soil Testing Centre through the damaged portion of the compound wall on the Old Central Vegetable Market side, where the vehicle parking lot is now functioning.\n\nOne of the broken bottles was found near the parking lot where a couple of vendors were selling eatables. Another bottle was found on the entrance of a Corporation-run public toilet. Police officials enquired with some of the shopkeepers about the incident.\n\nIt may be noted that only on Tuesday, a team of National Security Guards completed its two-day review of security at the temple.", 
    "section": "national", 
    "title": "Crude bomb explodes near Meenakshi temple", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}