{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Karunanidhi says State’s failure to open Chembarambakkam reservoir in time caused flooding\n\nA massive turnout at the demonstration called by the DMK in Chennai on Tuesday, demanding a judicial probe into the release of water from the reservoir.— Photo: S. R. Raghunathan\n\nAlleging that the State government’s failure to open the Chembarambakkam reservoir in time had caused the recent flooding leading to loss of lives and property, DMK leader M. Karunanidhi on Tuesday said the AIADMK government would be brought to reckoning for its failure.\n\nAddressing a demonstration in Chennai demanding a judicial probe into the release of the water from Chembarambakkam last month, Mr. Karunanidhi said the AIADMK had the audacity to suggest that it could win the elections even though its government was responsible for the entire crisis.\n\n“If the State government had acted swiftly it could have avoided all the loss. But it failed,” he charged, adding “time is not far away when we will give a fitting reply to the ruling party through a legal and democratic way. The ruling party is also prepared for the eventuality. We have the responsibility to save the people of Tamil Nadu.”\n\nMr. Karunanidhi said people in the State faced great hardship and instead of taking remedial measures the government had justified whatever that had happened.\n\nDemanding a probe by a sitting judge of the Madras High Court, a resolution adopted in the meeting urged the State government to distribute relief to all affected people impartially. DMK treasurer M.K. Stalin said even though the DMK regime also had witnessed severe rain in 1999 and the Puzhal reservoir was facing a breach, the then Tiruvallur District Collector contacted Chief Minister Karunanidhi early in the morning and water was released. DMK MP Kanimozhi, senior leader Duraimurugan and T.R. Baalu participated.", 
    "section": "national", 
    "title": "DMK blames govt. for rain havoc", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}