{
    "author": [
        "K Lakshmi", 
        "Poorvaja Sundar"
    ], 
    "text": "Water Resources Department plans to write to the Kamarajar Port Trust\n\nMud dumped in a portion of north Buckingham canal is reportedly affecting the flow of water -Photo: B.Jothi Ramalingam\n\nThe Water Resources Department plans to write to the Kamarajar Port Trust seeking that steps be taken to stop dumping of mud in a portion of north Buckingham canal at Athipattu near Ennore.\n\nIt may be recalled that environmental activists had expressed concerns over a portion of the Buckingham canal being filled with mud two days ago.\n\nFollowing this, a team of WRD officials had visited the site.\n\n“The port authorities have not sought any permission to use the stretch of the canal that belongs to the Department. This work will affect the free flow of the canal that is 30 metres wide at the stretch near Ennore,” said an official.\n\nSources in the WRD said the port authorities had informed that this was a temporary work and the mud would be removed.\n\n“Dumping of mud has been stopped. But, we plan to ask them to remove the mud blocking the flow of the river within two weeks as permission had not been sought from the Department,” an official said.\n\nEnvironmental activists said that the Buckingham Canal and the Ennore Creek were 'Tidal influenced' water sources which meant that there was a constant inflow of salt water.\n\nPooja Kumar, Coordinator for the Coastal Resource Centre, said: “The brackish water is essential for fish resources such as prawn and crab. Even fish hatchlings find it easier to survive in brackish water. In tidal influenced water sources like this, there is a constant movement of fish which come in to lay their eggs there,” she said.\n\nShe further said that while the mud dumped also changed the natural flow of the river, material dumped on the banks of the Buckingham canal also affected mangroves and other trees which attracted a large number of birds.\n\n“Members of the fishing community met a few of the contractors at the port two days ago and appealed to them to not dump mud in the canal,” she added.", 
    "section": "national", 
    "title": "Dumping mud in portion of Buckingham Canal opposed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}