{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Several fish farmers in Tiruvallur, Kancheepuram and Cuddalore districts have incurred heavy losses as the recent floods washed away the fish reared by them in ponds. “There was water everywhere and it was raining heavily so I just could watch fish weighing a kg or so jumping out of the ponds,” said K. Natarajan, a retired government employee who lost about Rs. 35 lakh of his investment.\n\n“I wanted to start a fruit tree farm on this land but a soil and water test showed that I could only rear fish. So I invested my gratuity and savings. I didn’t insure the fish farm and I am hoping for some assistance from the government,” said Mr. Natarajan of Poosiwakkam in Kancheepuram district, who lost several aerators, motor pumps and almost all the matured fish in his ponds.\n\n“Some fish farmers I know are contemplating suicide. They had invested over Rs. 70 lakh. But as we are technically counted as agricultural farmers, the government can offer us a compensation of only Rs. 12,500 per acre. When we rear a huge quantity of fish, officials from every aquaculture body showcase our efforts proudly, but now there is none to help,” charged an angry J. Sivagnanam of Kattur in Tiruvallur district.\n\nHe supplies live fish to stores and also cultivates American white prawn that has a good export market. “I had planned to harvest the fish in the first week of December so that I could repay the loans taken for my daughter’s wedding. My plans have been washed away,” he said.\n\nMany inland fishermen, who depend on Public Works Department’s tanks have also suffered a loss of livelihood. S. Murugammal, president of Meenavar Sangam (fishers association) at the Nathampet lake in Kancheepuram, said that the 100 fishers, including 40 women, have been without any work for the past month-and-a-half.\n\n“All the kendai fish swam away. Catching kendai pays better as it is costlier. We take one portion of the sale proceeds while the Fisheries Department takes the rest. In case of Tilapia, which is what we catch now, we get Rs. 10 per kg and after a day’s hard work all we get is Rs. 100 to Rs. 150,” she said.\n\nThe association members are seeking compensation as they have remained without work and had to purchase fishing nets.\n\nBut local Fisheries officials have ruled out compensation. compensating them.\n\nHundreds of fish farmers and inland fishermen in the flood-ravaged districts are seeking adequate just compensation from the government.\n\nFarms in Tiruvallur, Kancheepuram and Cuddalore ruined by recent floods", 
    "section": "national", 
    "title": "Fish farmers in deep waters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}