{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here on Tuesday reserved its judgment on a petition seeking a police inquiry into many appointments and transfers made in State-run liquor shops by producing “fake” recommendation letters issued in the name of Natham R. Viswanathan, Minister for Electricity, Prohibition and Excise.\n\nJustice M. Venugopal deferred his verdict without mentioning a date after hearing elaborate arguments advanced by Additional Advocate General (AAG) K. Chellapandian on behalf of the Directorate of Vigilance and Anti-Corruption and advocate N. Satish Babu, appearing on behalf of the petitioner, B. Selvam, a liquor shop supervisor.\n\nThe petitioner’s counsel produced a few transfer orders issued by Tamil Nadu State Marketing Corporation (Tasmac) officials and claimed that most of them had reference to recommendations made either by the Minister or his Personal Assistant Selvam. He claimed that the DVAC did not register a case though the letters, along with a complaint, were submitted to them. Referring to the DVAC Manual, he contended that the sleuths were duty bound to conduct a discreet preliminary enquiry immediately after receipt of any complaint and then begin a detailed enquiry if they find that there were prima facie materials against the accused. “No such preliminary enquiry was conducted on the basis of my client’s complaint,” the counsel claimed.\n\nRebutting his allegations, the AAG said that the DVAC did not register a case since the petitioner himself had accepted that only “fake” recommendation letters had been issued in the name of the Minister. However, he pointed out that the DVAC had duly forwarded the complaint lodged by the petitioner to the Managing Director of Tasmac for necessary action.\n\n“The Tasmac MD, in turn, has ordered a departmental enquiry into the issue and appointed the Chief General Manager (Finance) as the enquiry officer. By way of abundant caution, the Minister’s Personal Assistant Selvam, a government employee, had also been relieved from the Minister’s office and reverted to the parent department in which he was working,” the AAG said.", 
    "section": "national", 
    "title": "High Court reserves judgment in Tasmac appointments case", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}