{
    "author": [], 
    "text": "TMC leader says decision on alliance will be based on people’s mood in February\n\nThe revived Tamil Maanila Congress (TMC) is at the crossroads ahead of this year’s Assembly election. Though the party’s real strength is yet to be proven, G.K. Vasan , son of the late Congress veteran G.K. Moopanar, is confident that the TMC would fare reasonably well. He tells Sruthisagar Yamunan that it is wrong to dismiss the party as its leaders and cadre are spread across Tamil Nadu. For the moment, he wants to play his cards carefully and denies that the party is pro-AIADMK. Excerpts:\n\nThe Hindu: Why has the TMC of 2016 failed to command the same attention as it did in 1996?\n\nG.K. Vasan: I cannot compare myself with the stature and experience of my father. In 1996, the party had no time to observe its functioning and went into the elections immediately. The anti-incumbency against the then ruling party was such that the TMC and its allies swept the polls. This situation does not exist today. Here, I took a decision (to revive the TMC) 17 months before the elections.\n\nYour party is still viewed as one with its base confined to the Cauvery delta region.\n\nThis is an absolutely wrong reading. The TMC has former MPs and MLAs in every region of the State. Our party organisation is spread across Tamil Nadu and you cannot confine us to one region alone.\n\nBut you have not positioned yourself as an alternative to the two Dravidian parties like few others have done.\n\nNo party has assertively decided on (poll) strategies. As far I am concerned, my tour of the State continues and will end in February. I am still gauging the mood of the people. How can I decide when I am still not too sure about what the people want? We will announce our decision based on the mood of the people in February.\n\nDo you think the DMK has the moral authority to claim to be the better alternative to the AIADMK regime?\n\nEvery party has the right to seek the support of the people and device strategies accordingly. This is democracy. But as far as the TMC is concerned, since we have not decided on our position on elections I would have to keep my cards close to my chest.\n\nThe DMK has said the Congress will be invited to its alliance. Can the TMC and Congress function in the same front?\n\nThe TMC will ensure that the individuality of the party is not lost in any alliance. I also feel this is a hypothetical question since the formations have not yet solidified. We will decide at the appropriate time on alliances.\n\nThe DMK is yet to invite the TMC for an alliance...\n\nWhat is the date today? What is the hurry? Each party will take decisions according to its needs. By this, I don’t mean I am expecting an invite. But electoral decisions could be made even as late as March.\n\nWhat would be the main stipulations for the TMC to enter an alliance?\n\nPublic issues. For example, we have stressed for long that prohibition has to be imposed gradually even if not immediately. When the time comes for alliances, we will put this forward.\n\nWill that mean you won’t join if there is no assurance on prohibition?\n\nI am saying when an alliance is formed it would be our duty to reflect the majority opinion to the allies. If the TMC is going to contest a majority of seats, I can stress (on it). But if we don’t, I can only persuade and ensure it is implemented step by step and create awareness.\n\nYou have been portrayed as being soft on the ruling AIADMK. Even an AIADMK spokesperson has gone on record claiming that you have a soft corner for them.\n\nEver since my party was launched, I have commented widely on all policy issues of both the State and Centre. I have taken positions based on public interest. My statements will tell you I have criticised whenever there was a need. The problem today is that attention comes only when someone indulges in personal attacks. But for the sake of attention, I cannot lower my standard.\n\nHow do you view the criticism of Chief Minister Jayalalithaa that she does not meet the media regularly and the information flow from the government is weak?\n\nKeeping the media informed of matters in the government will always help the government. Otherwise, it leads to unnecessary doubts and criticism even when you are right.\n\nWere you happy with the response of the State to the floods?\n\nThis has to be analysed carefully. Naturally, when such unprecedented rainfall occurs, whether it is AIADMK or DMK or any other party’s government, I am sure they do not have the mechanism to face it. But still, on aspects like quick response, food, shelter…it will always be a debatable issue. One may praise and the other may criticise. But you must remember I have not given credit to the government on this.", 
    "section": "national", 
    "title": "I am not soft on AIADMK: Vasan", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}