{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Rate of recovery of property was 49 in 2015, says Police Commissioner\n\nREPORT CARD:Commissioner of Police T.S. Anbu (centre) addressing the media in Tirunelveli on Tuesday.— Photo: A. SHAIKMOHIDEEN\n\nCrime rate in the city came down by 30 per cent in 2015 from the figure recorded in 2014 due to various preventive measures taken by police, said Commissioner of Police and Deputy Inspector General of Police (Tirunelveli Range) T.S. Anbu.\n\nSpeaking to reporters here on Tuesday, Mr. Anbu said that 82 persons were detained under the Goondas Act in 2015, while the number was 35 in 2014.\n\nPatrol teams on 14 bikes and 11 four-wheelers had been pressed into service for better policing.\n\nThe police recovered Rs. 48.14 lakh-worth properties, detected 17 murder cases, two murder for gain cases, 18 robberies and 140 theft cases last year, he said.\n\n“While the rate of recovery stood at 32 per cent in 2014, it increased to 49 per cent in 2015,” Mr. Anbu said, adding the number of fatal accidents came down from 93 to 87 in 2015.\n\nThe police booked cases for rash driving (504), overloading (1,269), helmetless two-wheeler riding (56,688), driving vehicles without licence (2,969), three persons riding a bike (2,944), number plate violations (6,867), drunk driving (1,300) and riding vehicles while speaking on mobile phone (4,199) in 2014.\n\nRs. 2 crore fine\n\n“In 2015, 1.73 lakh traffic rule violation cases were registered and a total fine of Rs. 2.36 crore was collected from the offenders. The total fine collected from offenders was Rs. 2.35 crore in 2014,” Mr. Anbu said.\n\nHe said that the services of ‘best performers’ among the police personnel was being acknowledged by placing flex boards with their photographs at public places and the Collector’s permission had been sought for installing surveillance cameras at 17 places after similar measure yielded good result at four places in the city.\n\n“Based on intelligence inputs, adequate security arrangements are being made at high-security installations such as Kundnkulam Nuclear Power Project site and ISRO’s Propulsion Research Complex (IPRC) at Mahendragiri,” said Mr. Anbu.\n\nRejects rumours\n\nHe also rejected as baseless the rumours spread by a group of people from Panagudi about sighting of a flying object over the IPRC.\n\nHe said that the police would take action against those who were using ‘Press’ stickers illegally only if formal complaints were filed.", 
    "section": "national", 
    "title": "“In 2015, crime rate came down by 30 per cent in Tirunelveli”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}