{
    "author": [], 
    "text": "RELIGION\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nPaneeru Thirumurai Mandram: Thiruvasagam Mutrodal by M. Balasubramanian, 7 a.m., Isai vazhipaadu, Adi Streets, 6 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Sekkilar Pillai Tamil,’ by T. Arunachalam, S.S. Colony, 5 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85{+t}{+h}year Sreemath Gita siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal 6{+t}{+h}street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs 6 a.m., Paavai songs and devotional songs, Adi Street 6 p.m.\n\nGita Natanagopala Nayaki Mandir: 173{+r}{+d}jayanthi celebrations, No. 3 Mariamman Teppakulam West Street, 6 p.m.\n\nRamasamajam: Discourse by R. Hariji on ‘Ramayanam – Sita Kalyanam’ Sri Saratha Temple, Sringeri Mutt, bypass road, 6.30 p.m.\n\nAnushathin Anugraham: Sri Mahaperiava aradhanai vizha, discourse by noted writer Indra Soundararajan, Opposite Mahatma School, Velayutha Nadar Kalyana Mandapam, KK Nagar, 6.30 p.m.\n\nKamakodi Peravai: Sri Mahaperiava jayanthi, discourse by Muthu Santhanam, Viswas Kalaiarangam, Vasudara complex, 6 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 64{+t}{+h}music and arts festival, Dr. Bala Nandakumar’s Layashetra and party presents ‘Bharatanrithyam,’ Lakshmi Sundaram Hall, 6 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nJCI Dindigul Winners: Inaugural and installation ceremony of new chapter “JCI Madurai Dynamic” P. Saktivel as charter president and team, R. Raja Govindasamy chief guest, MEPCO Hall, Kamarajar Salai, 6 p.m.\n\nThiagarajar College: Workshop on ‘How to crack aptitude test’ by Sitrarasu Director Amazing Institute of Management, Diamond Jubilee Hall, 11 a.m.\n\nMannar Thirumalai Naicker College: International workshop on ‘communicating third space: A special reference to African literature,’ by Dr. Jessie Furvin of University of Swaziland, Southern Africa, Andal Ammal Moorthy Naidu Seminar Hall, 10.30 a.m.\n\nAlcoholics Anonymous: Meeting, Dheep Hospital, K. Pudur, 7 p.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, A.G. Church, near State Bank, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}