{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Schools are eager to have library if infrastructure and librarian are provided\n\nCorporation of Madurai runs 64 schools in the city, in which close to 17,000 students are studying. But it has only one full-fledged air-conditioned library at Pandian Nedunchezian Higher Secondary School situated near V.P. Rathinasamy Nadar Road.\n\nThere are 15 higher secondary schools, nine high schools, 14 middle schools and 26 primary schools run by the Corporation.\n\nWhen The Hindu team visited a few high and higher secondary schools and conducted inquiries with the headmasters and teachers about reasons for the absence of full-fledged libraries, they came out with startling information.\n\nFirst and foremost was that the Corporation had not established a post of librarian for its schools. Second, a majority of the schools have their ‘library’ in just one or two almirahs with a few books gifted by donors. Since the students have no knowledge about how a library would look like, many pointed their fingers at the broken almirahs as libraries.\n\nOnly last year, the Corporation, at its council meeting, passed a resolution appealing to the government to sanction a post in the rank of junior assistant, who could be appointed as librarian in schools. But, the paper has not moved beyond this level, according to reliable sources in the council. So, the proposal is in cold storage now.\n\nA headmaster, wishing anonymity, admitted that they would be too eager to have a library in their school, which has close to 300 students studying in Plus Two. “Apart from developing their knowledge, the children can also spend valuable time in the library as a ‘good book is a good friend indeed’,” she added.\n\nA senior teacher at EVR Nagammai Girls’ Higher Secondary School said that there was a meeting hall in the school, which could be converted into a library. “On the lines of Pandian Nedunchenzian School, a librarian can be posted,” she suggested.\n\nWhen there are many donors from Rotary Clubs, Lions Club, Ladies Circle and other individual philanthropists willing to come forward to gift books the children, the Corporation could utilise the opportunity and simply provide the basic infrastructure, including a hall and a full-time librarian, she noted.\n\nRecalling how some of their students successfully passed competitive examinations and how students participating in elocution contests using the library came out with laurels, Pandian Nedunchezian Higher Secondary School Headmaster S. Syed Burhan, who took over recently, said with pride that they encouraged their students to read newspapers, available in the library, daily for 30 minutes during Value Education (VE) period.", 
    "section": "national", 
    "title": "Madurai Corporation runs 64 schools, but only one has full-fledged library", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}