{
    "author": [
        "Annie Philip"
    ], 
    "text": "Report reveals goitre endemic in all four districts of Union Territory\n\nWhile a country-wide ban on consumption of non-iodised salt has been in place since 2006, it is still being consumed in the form of rock salt in Puducherry, Karaikal and Yanam, revealed the Report on the Iodine Deficiency Diseases Survey in the Union Territory of Puducherry (December 2014 - March 2015).\n\nIt also revealed that all four districts of the UT, including Mahe, are endemic for goitre. While iodine deficiency can be prevented through consumption of iodised salt, it is a major health concern especially for children and pregnant women.\n\nApart from causing goitre, iodine deficiency is understood to lead to perinatal mortality, mental and physical retardation, deaf-mutism and cretinism.\n\nAccording to the 2014-2015 Annual Report of the Ministry of Health and Family Welfare, sample surveys from 386 districts covering States and Union Territories revealed that 335 districts are endemic (prevalence of Iodine Deficiency Disorders is more than 5 per cent), and that no State or Union Territory is free from IDD.\n\nSurvey across UT\n\nAs per the recommendations of the National Iodine Deficiency Disorders Control Programme (NIDDCP) to carry out prevalence surveys every five years in all States and Union Territories, the survey here was carried out by the Departments of Community Medicine and Biochemistry, Indira Gandhi Medical College and Research Institute, Puducherry, in cooperation with the Departments of Health and Family Welfare Services and School Education, the Puducherry State Health Mission and regional administrations of all districts.\n\nA study sample of 3,358 children (1,680 boys and 1,678 girls) between 6 and 12 years were selected from 30 schools from all four districts of the UT for the survey from December 2014 to March 2015. The report examines prevalence of goitre through clinical examination, the median urine iodine concentration in a sample of the children, and the level of iodine in salt samples in households.\n\nAmong 839 households surveyed in all four districts, it was found that 134 of them were not using adequately iodised salt (above 15 ppm). The highest proportion of households not consuming iodised salt was found to be in Yanam (44.6 per cent). However, since the last survey in the UT in 2008, there has been an increase in use of iodised salt.\n\n“The increased availability and use of iodised salt is one of the reasons for the decline in the prevalence of IDD. During our survey, we observed crystalline salt or rock salt is still being used for cooking and majority of these salt samples were not-iodised or were inadequately iodised,” said Dr. Kavita Vasudevan P., Head, Department of Community Medicine, Indira Gandhi Medical College and Research Institute and Principal Investigator of the survey.\n\nAccording to NIDDCP, a district is declared as endemic district if the total goitre rate is above 5 per cent in children of 6 to 12 years.\n\nAmong the surveyed, goitre prevalence rate was found to be 22.1 per cent for Puducherry, 17.1 per cent for Karaikal, 8 per cent for Yanam and 14.9 per cent for Mahe.\n\nPositive news is that there is a decline in the total goitre prevalence in all districts since the last survey in 2008, from 27.4 per cent for the Union Territory, to 19.8 per cent now. Following the survey, a list of all children with goitre (grade 1 and 2) was provided to the school managements for intimation to parents and appropriate medical care for the children, said Dr. Kavita.", 
    "section": "national", 
    "title": "‘Non-iodised salt still in use’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}