{
    "author": [
        "S Ganesan"
    ], 
    "text": "Traffic management near exit points on both sides may become a problem\n\nThe Odathurai bridge in Tiruchi may create more problems than it solves, according to some activists.— PHOTO: B. VELANKANNI RAJ\n\nWith the Odathurai bridge along the Cauvery banks in the city set to be opened for traffic soon, civic activists have expressed concern over the bottlenecks that are likely to emerge at the city end of the new bridge and on the Tiruchi-Chennai Bypass.\n\nThe new bridge, which connects Chinthamani with the Chennai Bypass is nearing completion after several time overruns. The project, which took off in March 2010, faced several hurdles right from the start. Sources in the Highways Department indicated that the bridge is complete but for some finishing work and is likely to be thrown open to traffic before the end of this month.\n\nHowever, civic activists point out the bridge, once opened, could cause traffic bottlenecks at both ends of the Oyamari Road.\n\nOn the city side, the bridge joins the road towards Chinthamani just a few metres away from the Cauvery bridge. Vehicles heading towards the Chennai Bypass via the new bridge would have to take a turn just ahead of the Cauvery bridge.\n\nThis, activists say, would make it a potential accident prone zone.\n\nOn the other side, a narrow two-way bridge across the canal along the Chennai Bypass would emerge as a bottleneck as the traffic volume is bound to increase sharply once the bridge is opened. The service lane, used for two-way traffic, is cut off at this spot and vehicles have to go against oncoming traffic on the busy bypass.\n\nThe missing link\n\nA sub-committee formed by the District Traffic Advisory Council after inspecting the spot has emphasised that a bridge across the canal has to be built to provide the missing link on the service lane. “We have insisted this is a must and the district officials have directed the NHAI to take steps. Otherwise, major accidents could take place,” said M.Sekaran, member of the council and the sub-committee. The committee has suggested installation of high mast lights, speed breakers, and provision of side barriers to prevent accidents. The emerging problem on the city side does not seem to have been studied yet.\n\nN. Ramakrishnan, founder, MGR Nalpani Kazhagam, points out that the city side could be equally dangerous for road users. Unless a wide traffic island is created, there could be a huge problem.\n\n“Accidents could become frequent as vehicles from both the Cauvery bridge and the new bridge are bound to come at high speed on the descent. When vehicles take a right turn at this spot, there is bound to be chaos,” he said faulting the design of the bridge.\n\nSignal trouble\n\nEnquiries with the Highways Department revealed that a traffic island is not part of the design of the bridge. They indicated that the police were considering installing automatic signals at the junction to regulate traffic. But, Mr. Ramakrishnan said this would not solve the problem. “Accidents will take place especially at night and early hours when the signals are not operated,” he said questioning the wisdom of having signals at the descent of bridges. “The district authorities should consult experts and come up with a comprehensive solution,” he said.\n\nMr. Sekaran, while conceding that this was likely to emerge a problem, promised to raise the issue at the District Road Safety Council.", 
    "section": "national", 
    "title": "Odathurai bridge may create bottlenecks: activists", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}