{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Do you think a new train will serve the people of your town with direct connectivity to a popular destination of tourist, commercial or pilgrimage importance?\n\nAre you frustrated with the long delay in implementing a gauge conversion work for years together? Or else you have a suggestion to prevent crime or train accidents?\n\nIf the answer to any of these questions is yes, you can air the suggestion or your wish to the Union Railway Minister with a request to include it in the next Union Railway Budget slated to be presented next month.\n\nFor that, all one needs to do is fill up an online proforma found on the homepage of the official website of Indian Railway- indianrailways.gov.in\n\nThe suggestions should be sent by January 15.\n\nRail users can provide their suggestion on 15 topics pertaining to the Indian Railways.\n\nIt can be as simple as seeking a foot overbridge for your nearest railway station or even as complex as giving an expert opinion on the ways and means to augment revenue for Indian Railways that handle one of the biggest rail networks in the world.\n\nAmong the given topics are computerisation, electrification of lines, suggestion on freight movement, creating additional infrastructure like freight corridors, port and mine connectivity and public-private partnership.\n\nBesides, people can advise the railways on commercial usage of its land and give tips on station development works.\n\nRail users can post their demands for new rail line, road overbridge or road under bridge, expedition of on-going gauge conversion works or doubling works.\n\nThey can give their valuable suggestions on crime prevention in trains and railway premises and advise on safe running of trains. Opinion on new trains, extension/augmentation of existing trains, increasing the frequency of trains, tourist or pilgrimage-related trains could also be posted on the railway website.\n\nBesides, people could give any other suggestion that has not been covered in the above said topics.\n\nThey can also upload any documents supporting their suggestion.", 
    "section": "national", 
    "title": "People’s suggestions sought on next Railway Budget", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}