{
    "author": [
        "S Prasad"
    ], 
    "text": "AITF’s role in systematic development of Francophone literature recalled\n\nProf. K. Madanagobalane, president, Association of Indian Teachers of French, confers the AITF award on Prof. Nathali Watteyne, Sherbook University, Canada, at a function in Puducherry on Tuesday.— Photo: T. Singaravelou\n\nThe study of Francophone literature especially of Quebec literature has gained momentum in the University departments and colleges with scholars evincing keen interest in African and French Canadian literatures, said Prof. K. Madanagobalane, president, Association of Indian Teachers of French (AITF).\n\nSpeaking at the Bharathidasan Government College for Women (Autonomous) on Tuesday after conferring the AITF award on Prof. Nathali Watteyne, Sherbrook University, Canada in recognition of her contribution to the promotion of Quebec literature, Mr. Madanagobalane said that special lecturers on francophone literature were unheard of in the past.\n\n“Only French literature was deemed fit to be taught in the University departments. Fortunately such a trend started slowly to change and scholars evinced a keen interest in African and French Canadian literatures. Research work was undertaken and the study of Francophone literature especially of Quebec literature gained momentum in the university department and colleges.”\n\nThe AITF has played a vital role in the systematic and sustainable development of Francophone literature across India. The University of Madras was a unique centre to develop Quebec studies and was also the most funded centre until 2002. Quebec literature was thus introduced not only in the university programme but also in the UGC curriculum for NET examination, he said.\n\nThe AITF has been regularly conducting international congresses dedicated to Francophone studies and has also translated many French Canadian masterpieces into Tamli and Hindi with aim to create awareness among young students about research potential for Quebec literature in India.\n\nHe said Prof. Nathali Watteyne, Sherbrook University, Canada was chosen for the AITF award in recognition of her contribution to the promotion of Quebec literature.\n\nOnly 10 scholars were honoured with the award in the past since its inception.\n\nProf. Nathali Watteyne is a professor literature at Sherbrook University, Canada and also the director of Anne Hebert Centre. A specialist in French literature of 19th and 20th centuries, Comparative literature (French and Quebec literature) she has published a number of articles and books.", 
    "section": "national", 
    "title": "Professor honoured for promoting Quebec literature", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}