{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Tuesday came down heavily on an AIADMK advocate for filing a case with a plea to detain DMDK president Vijayakant under the Goondas Act and said such frivolous and “publicity oriented litigations” could be curtailed to a large extent if the media decides to black out names of the litigants.\n\nDismissing the case filed by him in the guise of a public interest litigation (PIL) petition, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran said: “Our experience shows that PIL petitions filed in this court fall under different categories. Some are filed really in public interest. Some are filed in private interest. Some are filed as proxy litigations on behalf of somebody else.\n\n“Some PIL petitions are filed as a measure of revenge to expose the misdeeds of others so as to derive sadistic pleasure and some are filed with an eye on publicity that such litigation gets. Publicity oriented litigations can be divided in to two sub categories: those filed with a view to gain publicity for the sake of publicity and those filed with a view to gain publicity which is capable of being encashed,” the court said.\n\nObserving that the case on hand falls under the one of the two sub-categories, the judges went on to state: “In olden days, the only way in which the worker of a political party could gain recognition and appreciation from his political bosses was to work tirelessly on the field, pasting posters, distributing publicity materials and organising meetings.\n\n“However, after political bosses became too busy to take note of the sacrifices of small-time party workers of unnoticeable status, some of them have invented ingenious ways to attract attention. Filing a public interest litigation petition for initiating action against the leader of another political party has become one such method… If media decides to black out names of such persons, the same may act as a disincentive.”\n\nFurther, pointing out that the petitioner had not even collected details of criminal cases pending against the DMDK president before filing the present petition to invoke the preventive detention law against the latter, the judges said it was quite strange that a lawyer, duty bound to advance the cause of freedom of individuals, had come up with a plea to curtail the freedom of an individual.\n\n“We are of the considered view that the only intention of the petitioner in filing this petition is to gain publicity and attract the attention of the leaders of the political party to which he belongs so that he could harvest the reward at the appropriate time,” the Bench concluded.\n\nCourt slams AIADMK lawyer for filing case to detain Vijayakant under Goondas Act", 
    "section": "national", 
    "title": "Publicity-oriented cases have become tools to impress political bosses: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}