{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Around 700 children took part in National Children’s Science Congress\n\nS. Oviya of St. Joseph of Cluny School and her team will attend an outstation internship programme in May.— Photo: SPECIAL ARRANGEMENT\n\nA project by students from the Union Territory of Puducherry made it to the top 16 list of outstanding projects in the recently-concluded 23rd National Children’s Science Congress (NCSC) at Chandigarh University, Punjab.\n\nThe project, ‘Studies on the Microclimate and growth of eggplants under shade nets,’ was represented by child scientist S. Oviya of St. Joseph of Cluny Higher Secondary School at the NCSC held from December 27 to 31.\n\nHer team members were P.V.S. Senthil Nirai Nilavu and S. Snekha and their guide teacher was J. Ambujavalli. The project concluded that shade nets can be used to grow eggplants organically in rooftop gardens to get larger and good quality produce for domestic needs.\n\nMs. Oviya made the project presentation in front of over 50 evaluators who chose the 16 top projects from 32 which had made it to the second round. In the first round of presentations, there were 650 projects said a press release from the Pondicherry Science Forum.\n\n“We had interactions with scientists which was interesting. Scientific activities was organised and we were given activity kits. We were also taught how to learn mathematics easily. Apart from this, there were cultural programmes in the evenings,” said Ms. Oviya.\n\nShe is looking forward to an outstation 15-day internship programme in May, which she will get to attend with her team members, she said. The young scientist has set her sights on a career in medicine and hopes to get into Jipmer, Puducherry.\n\nThe NCSC is organised annually under the Ministry of Science and Technology. This year’s event continued with the last focal theme: Understanding Weather and Climate and its six sub-themes. The NCSC saw the participation of around 700 child scientists from across India, including delegations from United Arab Emirates, Qatar and Kuwait, said the press release.\n\nSix team leaders from the UT had attended the NCSC in Chandigarh after winning in district and State level competitions held in the last few months, organised by the Pondicherry Science Forum in association with the Directorate of School Education and Department of Science, Technology and Environment, Puducherry Government.", 
    "section": "national", 
    "title": "Puducherry students’ project makes to top 16 in NCSC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}