{
    "author": [
        "L Renganathan"
    ], 
    "text": "In major thoroughfares in Thanjavur\n\nConcerted action following an inquisitive exploration by the Thanjavur Corporation is all set to provide some relief from water logging during rain to residents especially those residing in the core civic area.\n\nResidents in major thoroughfares in Thanjavur such as the West Main Street, North Rampart, East Main Street, East Rampart, South Main Street and South Rampart had to endure repeated water logging during the recent rain.\n\nRainwater flowing down the main roads and bylanes flooded the residential areas unable to find a way through the encroached storm water drains running along the road margins. This was not the case just during the recent rain but had been a common feature for several decades.\n\nCivic officials and political leaders had mulled ways and means to address the issue but solution eluded them consistently.\n\nMayor Savitri Gopal and Commissioner P. Kumar tried to solve the water logging problem.\n\nThey wanted to solve stormwater stagnation and rehabilitate some tanks in the city limits by harvesting rainwater to rejuvenate them. When they wanted to solve the stagnation issue, their search yielded results as officials and workers stumbled on a decades-old arch type culvert at the junction of North Main Street and West Main Street leading to a major drain into the moat that encircles the town.\n\nUnfortunately, people residing nearby had piled up cow dung, gravel waste and domestic refuse over the years into a 20-feet drain underneath the arch type, baked earthen brick built structure that had got effaced altogether. On top of it, literally, a couple of huts had encroached on the structure and stay perched there on its flat head.\n\nAfter figuring the means to clear the piled up silt and cow dung maze through the corridor drain underneath the culvert structure, the Mayor and Commissioner ordered testing the strength of the structure and when they found it was good enough to last the effort and withstand flood water’s fury, they ordered the cleaning of the structure.\n\nBesides, Ms. Savitri Gopal has sanctioned funds to the tune of Rs. 10.50 lakh to construct a culvert and leading drain from the street to the culvert drain and through that to the moat itself so that any rainwater accumulation during monsoon period could easily flow unhindered to the moat, putting an end to a vexed problem.", 
    "section": "national", 
    "title": "Relief likely for a section of residents from water logging", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}