{
    "author": [
        "S P"
    ], 
    "text": "There is a sharp increase in the number of self-immolation attempts on the Collectorate premises during the grievances redress meetings held on Mondays despite the presence of the police personnel.\n\nThe self-immolation attempts of over 14 persons were foiled by the police personnel at the entrance of the Collectorate, while three persons consumed poison and entered the meeting hall in the past two months.\n\nOn Mondays, people from across the district come to the Collectorate to submit petitions. Both men and women were frisked by the police personnel at the entrance and were allowed inside.\n\nFollowing self-immolation attempts, the police tightened the checks resulting in seizure of bottles filled with kerosene.\n\nIn the recent months, petitioners even before nearing the entrance, take the bottle from their bag and douse them with kerosene. This creates flutter at the entrance with the police rushing to prevent them from self-immolating. They were later taken to the police station and warned and let off.\n\nMost of them complain of inaction by the police and revenue officials related to their issues such as encroachment of lands, demand for reunion of wife with husband, cheating, harassment by money lenders and threat by family members. They said that despite repeated complaints to the police and the district administration, no action was taken to resolve their issues forcing them to take the extreme step.\n\n“Though I won’t justify my act, I had no other choice, but to end my life as my long-battle for getting justice failed,” said a man who attempted unsuccessful bid here recently.\n\nSenior police officials said that a few petitioners now had a misconception that only if they attempted such acts, their problems would be sorted out.", 
    "section": "national", 
    "title": "Self-immolation bids on the rise on collectorate premises", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}