{
    "author": [
        "R Rajaram"
    ], 
    "text": "In Tiruchi, Nagapattinam and Thanjavur districts\n\nA special wing to probe serious grave crimes has been constituted in select districts in the Central Zone.\n\nChristened “Serious Crime Squad,” the wing has been created in Tiruchi, Nagapattinam and Thanjavur districts besides in Tiruchi city.\n\nPolice officers serving in the respective districts have been redeployed and posted to the squad which has been formed consequent to a State government order. Each squad would comprise of two Inspectors, four Sub Inspectors and eight other ranks to carry out the tasks assigned to it.\n\nSources told The Hindu that the squad would take up investigation of grave crimes such as important murders, rape, kidnap for ransom cases in which the culprits were not known. It would take up investigation of any other grave offences as ordered by the respective Commissioner of Police or the Superintendent of Police. It would pursue prosecution in all those cases taken over by it. It would function under the direct supervision of the respective Commissioner of Police / Superintendent of Police.\n\nInspectors have been nominated for the squad in Tiruchi and Nagapattinam besides in Tiruchi city.\n\nThe squad would be provided with vehicles and other necessary paraphernalia including investigation kit, digital voice recorder, laptops, digital still camera and video camera and computers.\n\nIt would function under the direct supervision and monitoring of the respective Commissioner of Police / Superintendent of Police.\n\nThe sources said the squad had been initially constituted in 20 districts / cities initially.\n\nOfficers forming parting of the squad would be imparted specialised training in investigation capability by the Tamil Nadu Police Academy or the Police Training College in a phased manner.", 
    "section": "national", 
    "title": "Serious crime squad constituted", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}