{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Coimbatore Corporation implementing the Swachh Bharat programme in the city is under scrutiny as a Central Government-appointed team is in city. According to sources, a three-member team from Quality Austria-Central Asia arrived in the city on Tuesday to study how the city has fared in implementing the Prime Minister’s pet project.\n\nArmed with internet-enabled tablet computing devices, two members of the team went around various pockets to document how the city has performed in solid waste management, public and individual toilet construction, underground drainage and other parameters.\n\nThe members will continue to do so till Thursday, when they will hold a meeting with the Corporation officials. The third member of the team is at the Corporation head quarters checking the records, documents and papers that the Corporation has got to support its claim. The team’s visit to the city is the first. It will carry out similar exercise in Chennai, Madurai and Tiruchi – the other pilot cities implementing the Swachh Bharat programme.\n\nThe four Tamil Nadu cities are part of the 75 cities in the country where the Central Government has asked for an audit. Sources in the Corporation say that the team is doing a thorough work by going into the finer details, choosing places of their choice, and clicking photographs at spots and uploading them immediately. The team is visiting bus stands, railway station, temples, schools and also residential colonies. A member of the team says that the study is to independently assess the work the Corporation has carried out in the city in 2014-15. The Ministry of Urban Development may come out with a report based on the team’s assessment. It may be recalled that in the last Swachh Bharat ranking the city has fared poorly – it was ranked 169 among the assessed cities.", 
    "section": "national", 
    "title": "Swachh Bharat assessment team arrive in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}