{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Today is observed as ‘Veshti Dhinam’\n\nWhether the effort to create a buzz around ‘Veshti Dhinam’ (Dhoti Day), works or not, this unstitched garment worn by Indian men in a variety of styles has an enduring appeal that transcends fashion and fads, say its fans.\n\nJanuary 6 was instituted as ‘Veshti Dhinam’ by Tamil Nadu Handloom Weavers’ Co-operative Society, or Co-optex, to promote the wider use of handloom dhotis in the State. But in 2014, the humble dhoti sparked a debate on sartorial tastes and cultural identity when a veshti-clad judge was denied entry into the Tamil Nadu Cricket Association Club in Chennai because he was deemed to have violated the establishment’s dress code.\n\nThe resulting public and political outcry led to the State government punishing establishments that discriminated against dhoti-wearers with a one-year jail term and a fine of Rs. 25,000. It seemed to give an impetus to observing Veshti Dhinam.\n\nIronically, in southern India, wearing a veshti with a Western coat, tie, and a turban was considered a perfect ensemble for educated and professional men up to the 1950s. As Western menswear became more common from the 1960s, the veshti (pronounced as vetti) began to lose its importance in the urban southern Indian wardrobe.\n\nHowever, the dhoti managed to keep its allure alive as a costume for festive and wedding celebrations among the younger generation. Some companies have tried to create ready-to-wear novelty versions complete with adhesive cloth strips and pockets.\n\n“Wearing the veshti is fun experience for youngsters,” S.M. Rashad, a chartered accountancy student told The Hindu . “Most schools and colleges ask their pupil to wear traditional dress for Pongal celebrations. Usually the boys wear veshtis and the girls saris. There is camaraderie among us when we all dress similarly for a celebration,” he added.\n\nFor travel executive Mohamed Wasif, who wore a veshti for his pre-wedding rituals last year, the dhoti is one of the leading symbols of Tamil culture. “Most foreigners associate India with vibrant colours, whether in food, clothes or sights,” he said. “All our package tours in the State include a visit to an ethnic clothing store where the assistants will demonstrate how to wear the dhoti and sari. Many guests like to buy silk veshtis with colourful borders as souvenirs.”\n\nThe loose weave of the handloom veshti makes for a more pliable drape, said businessman M. Syed Ibrahim Shah, who has worn it regularly since 1988. His entire annual stock of pure white veshtis and matching shirt material is hand-woven in Coimbatore.\n\n“I feel the veshti is ideal for summer, because it absorbs sweat and keeps the wearer cool throughout the day. Power loom veshtis, tend to tear faster than the handloom variety,” he said.\n\nDespite its homely charm, the veshti (usually measured in ‘muzhams’) is a high-maintenance garment as it requires professional bluing and starching to keep its pristine look.\n\nWith a blitz of advertising, the veshti has become associated not just with the political class, but also a growing number of film stars.", 
    "section": "national", 
    "title": "Tamil culture incomplete without a veshti", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}