{
    "author": [
        "Staff Reporter"
    ], 
    "text": "With the 10-day Thai Poosam festival scheduled to commence on January 18, elaborate arrangements have been made for the convenience of pilgrims, mostly padayatris. Top priority has been given to ensure safety of pilgrims on the hill and in the town, according to Collector T.N. Hariharan.\n\nAddressing a special meeting held here on Tuesday, he said that six kavadi mandapams near Ayakudi, Oddanchatram and Reddiyarchatram were kept ready and thatched shelters would be erected at seven places on Palani and Dharapuram Highways.\n\nFree parking space for tourists’ buses was created and facilities for stay provided there. A temporary bus stand would be established on the campus of Palani Municipal Higher Secondary School, he added.\n\nSufficient toilet facilities and basic amenities would be provided at Idumban temple, elephant path, south giri veedhi, winch ground station, north giri veedhis, Azhagu Nachiar Temple and Goshala campus. Two temporary toilets would also be set up at Periyanayaki Amman Temple and near the rope car ground station. First aid centre would be set up at Kudamuzhukku mandapam and ambulance van would be kept ready at Sri Padhavinayagar temple and at the winch station.\n\nSeparate path to climb the hill was created at Kudamuzhukku Mandapam to avoid congestion. The stairway that starts at Sri Padha Vinayagar Temple would be used by pilgrims to climb down from the hill. On the hill, separate halls would be provided for pilgrims waiting for special darshan and VIP dharshan. Separate queues would also be formed for free darshan. All three groups would enter the hill temple in three directions, he added. He also advised highways to relay the highly-damaged road near three level crossings near Palani town.\n\nOver 4,000 police personnel would be mobilised to provide adequate security to pilgrims. Municipal officials said that 260 sanitary workers would be deployed for cleaning work in the temple town. Special buses would be operated from Dindigul and nearby districts to the temple town, said officials.\n\nThirukalyanam was scheduled on January 23, Thai Poosam car procession on January 24, float procession on January 27. The festival would conclude on January 27.", 
    "section": "national", 
    "title": "Thai Poosam: arrangements in place", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}