{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Chennai Metro Rail workers fill the stretch on Poonamallee High Road that caved in; (right) the Metrowater lorry that got stuck —Photos: R. Ravindran and V. Ganesan\n\nMetrowater lorry gets stuck on Rajamannar Street off G.N. Chetty Road\n\nThree roads in different parts of the city caved in on Tuesday. A Metrowater lorry got stuck off G.N. Chetty Road at the spot where the road had given way.\n\nThe first incident occurred at 6.30 a.m. on Tiruvalluvar Salai in Alwarthirunagar. “Tiruvalluvar Salai connects Arcot Road and Ramapuram. Traffic was diverted through adjacent roads due to the incident,” said a traffic police officer. Residents claimed there was already a drainage problem near the spot where the road caved in and suspect it to be the result of a sewage leak.\n\n“The drainage pipe carries water from Valsaravakkam to Nesapakkam. Residents claim that during the rain, water was leaking onto the stretch, and that despite repeated complaints, no action was taken,” said a traffic police officer.\n\nIn a few hours, the hole was filled with debris and made fit for vehicular traffic.\n\nAnother cave-in occurred on Rajamannar Street off G.N. Chetty Road around 1.30p.m. “A Metrowater lorry turned into the street and the road gave way. The rear wheels of the lorry got stuck in it,” said a police officer. He said that traffic was not affected as the incident occurred on a small lane in the afternoon.\n\nFirst, the water was transferred to another lorry. Police officials and residents say the recent rain must have caused the accident. Road restoration work was carried out by Chennai Corporation as soon as the lorry was removed.\n\nMeanwhile, on Poonamallee High Road, the cave-in occurred on the stretch near Ega Theatre. Traffic was blocked between Taylors Road and Ega Theatre signal.\n\n“A small portion of the water distribution main was dislocated and caused a water leak due to Chennai Metro Rail work. Repairs are being carried out,” said a Chennai Metrowater official.\n\nOfficials of Chennai Metro Rail Limited (CMRL) however said their work did not lead to the leak. “We don’t know how the pipe leaked, but it loosened the soil and hence the road caved in. We have already started repair work and it will be over soon,” he added.\n\n(With additional reporting by K. Lakshmi and Sunitha Sekar)", 
    "section": "national", 
    "title": "Three more stretches cave in", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}