{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam: Sri Hanuman Jayanthi, special homam, South Chithrai Street, Srirangam, 7 a.m.; discourse on Sundara Kanda Mahimai by Sri Renganathan Swamigal, 5 p.m.; vocal concert by Koviladi Madhwa Prasad and party, 7 p.m.\n\nSri Andavan Ashram, Srirangam: Tirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha: Tirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Tirumala Tirupati Devasthanam: Tirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai: Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Parayana goshti procession, South Gate, Srirangam, 5.30 a.m.; Sri Vishnu Sahasranama parayanam, Thirukuralappan Sannidhi, South Gate, 6 p.m.\n\nSri Rama Nama Sath Sangam: Rama Nama parayanam, 14/B, Kamaraj Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nPeriyar E.V.R.College, Training and Placement Cell: Training programme on human rights, J. Vincent Comraj, principal, Government Law College, Tiruchi, inaugurates, 9.30 a.m.\n\nJamal Mohamed College Commerce Association: Lecture on “Opportunities for professional accountants” by P. Damodaran, 11.30 a.m.\n\nSeethalakshmi Ramaswami College, Department of Economics and Scientific Research Association for Economics and Finance: Seminar on “Dr. Abdul Kalam’s economic ideas”, M. Jayanthi, principal, inaugurates, 10 a.m.\n\nUrumu Dhanalakshmi College: Seminar on “Tamil literature”, 12.30 p.m.\n\nSri Sivananda Balalaya: K. Akbar Hussain, Chief Executive, Lax Limra Academy for Excellence, speaks on Train the Brain, Adavathur campus, 10 a.m.\n\nSaranathan College of Engineering and Yokogawa India Ltd: Workshop on “DCS and FF Overview”, Udhayakumar and Ramkumar, resource persons, 9.30 a.m.\n\nM.A.M. College of Engineering: Faculty development programme on prefabricated structures, 9.30 a.m.\n\nSrimad Andavan Arts and Science College: Record attempt in mimicry by P.Vijay, post graduate student, 10 a.m.\n\nHallmark Business School : Orientation programme on Marketing strategies for educational services, 2 p.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo-Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}