{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Following suggestions from different textile associations, the leading six trade unions in Tirupur knitwear cluster have come up with combined set of demands in the run-up to the signing of new wage pact for knitwear sector workers.\n\nThe existing four-year wage pact is coming to an end this month and the trade unions namely CITU, AITUC, INTUC, LPF, ATP and MLF had initially given separate set of demands.\n\nNow, they have come up with a consolidated 14 demands.\n\nCITU state secretary M. Chandran told The Hindu that the unions, this time, would be pressing for a minimum basic pay apart from asking for the other wage components.\n\nThe trade unionists were of the opinion that they would be staunchly demanding inclusion of House Rent Allowance (HRA) and educational assistances which were presently not disbursed to the workers in the cluster.\n\nApart from that, the trade unions had asked for a 100 per cent hike on piece-rate wages given to people deployed in tailoring, cutting, checking, labelling, packing and hand folding, among few other section of knitwear industry.\n\n“We have asked for increase in travel allowances considering the steep increase in fuel costs and also the charges levied by public transport buses”, said Mr. Chandran.\n\nThe trade union leaders were of the view that the textile associations should not delay the signing of the wage pact unlike what happened on the previous occasions.\n\nThe representatives of textile associations, however, are tight-lipped at the moment not wanting to disclose much on the scales of upward revision in wages they plan to agree.\n\nThough the trade unions wanted the signing of new wage pact before Pongal, it looks unlikely for that to happen as usually the revisions were arrived at only after around 20 rounds of talks between the trade unions and industry representatives.\n\nThe existing four years wage pact\n\nis coming to\n\nan end this\n\nmonth", 
    "section": "national", 
    "title": "Trade unions come up with combined demands", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}