{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Proximity to Salem, Erode markets is an advantage to farmers in Uppilliyapuram\n\nThe colour of the turmeric plants has turned yellow at many places, indicating that the crop is almost ready for harvesting.— FILE PHOTO\n\nSmall and marginal farmers of the district expect a bumper harvest of turmeric crop thanks to the favourable climate and good northeast monsoon.\n\nUnlike Erode, Coimbatore, and Salem districts, where turmeric is a major crop, it is cultivated in a few pockets of the district, including Uppilliyapuram, Thathaiyengarpettai, and Thuraiyur blocks. About 350 hectares have been brought under turmeric cultivation this season that starts in May and ends in February. Of 350 hectares, Uppilliyapuram alone accounts for more than 60 per cent of turmeric cultivation in the district.\n\nIt is mainly due to the presence of alluvial soil in the region. The proximity of farmers to Salem and Erode, which are known for turmeric cultivation, is also cited as the reason for Uppilliyapuram farmers preferring turmeric cultivation. The colour of the plants, which had looked green till a few weeks ago, has been changing to yellow. The leaves are also drying, which is a sign of crop maturity.\n\nWith the prevailing climate suitable for the last stage of the crop, farmers expect good yield.\n\n“We did not get expected rain during the last monsoon. However, it was not poor. We have managed to save the crop by harvesting rainwater. I expect good yield this year,” said M. Rajendran of Sopanapuram near Uppiliyapuram, who has raised turmeric on his two acres of land.\n\nP. Ravichandran, Assistant Director of Horticulture, said it was expected that the after-process yield would be around 1.5 tonnes per acre. He said the area coverage, which had reached around 1,000 hectares when price of turmeric was hovering around Rs. 17,000 a quintal a few years, had come down to 350 hectares this season mainly due to price instability. However, it was likely to go up in the next season.\n\nWe did not get expected rain during the last monsoon. I expect good yield this year.\n\nM. Rajendran of Sopanapuram", 
    "section": "national", 
    "title": "Turmeric farmers looking at bumper harvest", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}