{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "From two-lane to four-lane on an outlay of Rs. 213.70 crore\n\nThe work to widen the 27.2-km Madurai Ring Road from two-lane to four-lane at an estimated budget of Rs.213.70 crore was expected to commence by March, said sources from the Tamil Nadu Highways Department.\n\nAlthough the project was announced in July 2014 by the Chief Minister Jayalalithaa, tender was called for only in the second week of December last year and the bidding process is likely to be completed by January-end.\n\nThe project, to be executed by the Tamil Nadu Road Infrastructure Development Corporation (TNRIDC), which is a wing of the Highways Department, will be carried out through the Public-Private Partnership (PPP) model on Build, Operate and Transfer (BOT) basis with toll booths, said R. Guha Prasad, Superintending Engineer of the Highways Department here.\n\nIt may be noted that the toll collection on the present two-lane road by Madurai Corporation, which maintained it until recently, was stopped after opposition from the public. Sources said any unexpected delay in the bid approval could stop the commencement of the work as the model code of conduct for the Tamil Nadu Assembly elections might come in place around that time.\n\nThe Highways Department sources said that the work, once commenced, would be likely to be completed in a year except for the widening of the three bridges in the 27.2-km stretch, which might take more time.\n\n“The road, however, will remain usable for the vehicles even during the work,” said A.K. Rajadurai Veerapandian, Divisional Engineer.\n\nThe Ring Road, laid more than 15 years ago from the Meenakshi Mission Hospital to Kappalur to reduce congestion in the city, provides crucial connectivity for the vehicles from the north to south going through Madurai.\n\nWhile the road could handle traffic when it was inaugurated, over the years, the traffic exceeded the road capacity. The increased traffic coupled with poor maintenance made the road accident-prone.", 
    "section": "national", 
    "title": "Widening of Ring Road may commence by March", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}