{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Marumalarchi Dravida Munnetra Kazhagam (MDMK) leader Vaiko said that that cases would be registered against all officials and politicians who had amassed wealth disproportionate to known sources of income when Makkal Nala Kootani, comprising MDMK, CPI (M), CPI and VCK parties, was voted to power.\n\n“Our topmost priority will be to have zero tolerance to corruption which has been biggest retarding factor to the economic and social prosperity of the State. The Front will also ensure liquor prohibition, as liquor consumption is a social evil”, he told The Hindu on the sidelines of the party’s regional-level conference held here on Tuesday.\n\nOn why Makkal Nala Kootani will become the best alternative to successive AIADMK and DMK regimes, Mr. Vaiko said that no one could point their fingers on any one of the parties when it comes to corruption.\n\n“We will be banking on the votes of the 65 per cent of the electors, who are usually apolitical, to emerge victorious in Assembly elections.\n\nThis majority segment of the electoral society has been voting AIADMK and DMK to power alternately till now as there was no other credible alternative been available then when they got fed up with the successive regimes of those two parties. Hence, we feel optimistic of coming to power”, he added.\n\nHe assured that as part of the common minimum programme of the Front, rights of Tamil Nadu on various issues would be protected including the riparian rights of farmers along the banks of River Cauvery.\n\nOn extending the alliance beyond the present four parties in Makkal Nala Kootani, Mr. Vaiko pointed out that the Front had extended the hands to parties like DMDK and Tamil Maanila Congress.\n\n“I hope they will take a correct decision”, he said adding that BJP would not be able to make a foothold in the Dravidian soil.\n\nHe reiterated that the Front would continue with the efforts to get the ban on jallikattu lifted.", 
    "section": "national", 
    "title": "Zero tolerance to corruption will be top most priority of Makkal Nala Kootani: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}