{
    "author": [
        "M K"
    ], 
    "text": "Coimbatore International Airport, Coimbatore Corporation and Residents Awareness Association of Coimbatore (RAAC) have initiated zero waste management at the airport premises, from Monday.\n\n“About 900 kilograms of garbage is generated at the airport here daily. More than 85 per cent of it comes from 25 domestic and two international flights that land here every day. The rest is the waste produced by eateries, etc at the airport,” says Airport Director G. Prakash Reddy.\n\nThe waste is in huge volumes and comprises mostly of plastic bottles, cartons and carry bags, besides food waste. It is all dumped in an open yard close to the cargo section. Corporation trucks collect the garbage from there once a day in the morning or afternoon.\n\nAs it is just once a day, the garbage is accessible to stray animals, vermin and birds that scatter the litter across the nearby areas. This attracts the bigger birds posing a danger of bird hits.\n\n“We realised that stopping the food chain would put an end to entry of stray animals to the airport,” adds the airport director.\n\nThe initiative was inaugurated by the Corporation Commissioner K. Vijayakarthikeyan on Monday. Now, the airlines will collect the wastes from the aircraft and deposit it into a kiosk near the terminal building. Persons deployed by RAAC will collect the garbage twice a day from the kiosk and take it to a segregation unit that has been lying unused for eight months since it was established. There, the waste will be segregated into degradable, non-degradable, recyclable and non-recyclable wastes.\n\n“They will segregate it from 9 a.m. to 11 a.m. and again from 4 p.m. to 6 p.m. and sell the recyclable materials to recycling units. Degradable and non-recyclable wastes will be collected by the corporation. It will put an end to the garbage menace without any expense to the airport,” says Terminal Manager Vanaja Sole.\n\nAccording to Mr. Prakash Reddy the Airport Authority of India (AAI) is also planning to establish a biogas plant at the airport later this year after studying the volume of degradable wastes generated at the airport.", 
    "section": "national", 
    "title": "Zero waste management", 
    "subsection": "tamilnadu", 
    "date": "2016-01-06"
}