{
    "author": [
        "S Ganesan"
    ], 
    "text": "Entries of dead voters and multiple entries detected\n\nAbout 27,300 entries of dead voters and multiple entries are to be deleted from the electoral rolls in the district.\n\nThe electoral purification exercise was taken up following complaints of bogus entries in the electoral rolls.\n\nAddressing a press conference here on Saturday, Collector K.S.Palanisamy said the names of 10,834 dead voters, 13,159 multiple entries and 3,325 multiple EPIC entries are to be deleted from the voters list. The maximum of 3,112 multiple entries was detected in the Tiruverumbur constituency.\n\nThe lowest of 703 was in Manachanallur constituency.\n\nMr. Palanisamy said the list of the multiple entries and dead voters have been provided to the political parties and relatives of the dead voters. The entries would be deleted with the permission of the Election Commission and it would reflect in the supplementary rolls to be released in the run up to the Assembly poll. Applications for inclusion of names in the electoral rolls can be submitted till April 19.\n\nConsequent to the publication of the final electoral rolls in the district on January 20, about 40,007 applications have been received for inclusions, deletions, corrections and migrations in the nine assembly constituencies. Of these, 28,832 were for inclusions, with the maximum of 5,106 coming from Srirangam constituency, 5,685 for corrections, 2,261 for deletions and 3,229 for migrations within the same constituency.\n\nAs per the final rolls released in January, the district had a total of 21,45,201 voters including 10,52,925 male, 10,92,156 female and 120 transgenders. The district would have 2,502 polling stations and of these 270 have been identified as vulnerable stations where tighter vigil would be maintained in terms of law and order. About 11,115 ballot units and 3,500 control units were available.\n\nAbout 12,224 polling personnel would be deployed for the election, besides 324 micro observers, all Central government officials. Following the announcement of the election, the administration has begun removing wall writings and unauthorised hoardings, Mr.Palanisamy said. “We have asked the political parties to voluntarily remove them. We have launched a drive to remove wall writings,” he said.\n\nFor expenditure monitoring, 27 flying squads and static surveillance teams and 18 video surveillance teams have been formed in district. Three flying squads, three static surveillance teams and two video surveillance teams would be on duty to monitor the enforcement of the model code of conduct in each of the nine constituencies. All flying squad vehicles have been fitted with GPS instrument to track their movements and attend to complaints quickly.\n\nRound-the-clock control rooms have been set up at the Collector’s office and offices of the Returning Officers and complaints can be lodged over the specified telephone numbers, he said.", 
    "section": "national", 
    "title": "27,300 entries to be deleted from electoral rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}