{
    "author": [], 
    "text": "RELIGION\n\nGita: R.Aravindan, Andhra Mahila Sabha, Luz, Mylapore, 7.30 a.m.; Satyavratananda Saraswati, Samskrita Bharati, Radhakrishnan Salai, Mylapore, 8.30 a.m.\n\nNarayaneeyam: V.K.S.N..Raghavan, Seetharama Bhavan, Hariharan Hospital Rd., Nanganallur, 6.50 p.m.\n\nPhilosophical significance of Sri Ramakrishna Aratrikam: Paramasukhananda, Sri Ramakrishna Math, Mylapore, 5.30 p.m.\n\nUnderstanding Buddhism: Thomthog Rinpoche, Sri Dakshinamurthy auditorium, P.S.HSS., R.K.Mutt Rd., Mylapore, 9.30 a.m.\n\nCULTURE\n\nPattali Makkal Katchi: Launch of publication of Pattali Makkal Katchi founder S. Ramadoss, The Hindu Group Chairman N.Ram releases the books, GRT Convention Centre, T.Nagar, 10 a.m.\n\nKizhakku Padhipagam: Launch of publication, CPR Centre, Alwarpet, 6 p.m.\n\nGENERAL\n\nDr Ambedkar Law University School of Excellence: 6th K.R. Ramamani Memorial Taxation Moot Court Competition, Madras High Court Judges P.R. Shivakumar and Justice T.Mathivanan participate, Auditorium PG and Research Block, 5, Dr.DGS Dinakaran Salai, 4 p.m.\n\nSingamsetty Ateendrooloo Chetty’s Charities: Bicentennial celebration, Madras High Court Judge V. Ramasubramanian participates, Ethiraja Kalyana Nilayam, TTK Road, 10 a.m.\n\nBharath University: 28th Convocation, ICMR Director General Soumya Swaminathan participates, Sree Balaji Medical College and Hospital auditorium, Chrompet, 11 a.m.\n\nBrahma Kumaris: Workshop on ‘Empowering the self and the nation - role of media,’ Avvai Shanmugam First Lane, Royapettah, 5 p.m.\n\nTambaram Study Circle of ICAI: Discussion on ‘Union Budget 2016’, Jaigopal Garodia National Higher Secondary School, East Tambaram, 6.30 p.m.\n\nTamil Nadu Medical Practitioners Association and IMA Chennai Central: CME on ‘Youth for ever’ by J.S. Rajkumar, The Village, Kalavakkam, OMR, 2 p.m.\n\nM.N. Eye Hospital: Public awareness programme on Glaucoma, Anna Nagar Tower Park, 10 a.m.\n\nTamil Nadu Investors Association: SEBI Securities awareness programme, CPR Convention centre, Alwarpet, 10 a.m.\n\nHindustan Chamber of Commerce: Programme on Trade and Commerce in Medieval Madras, Kothari Memorial Hall, Greams Road, 6 p.m.\n\nSankara Eye Hospital: Free eye cataract screening, 80/36 Muthiah Mudali St., Old Washermanpet, 9 a.m.\n\nLions Club of Chennai Royapuram Heritage: Meeting, Hotel Clarion, Radhakrishnan Salai, 11 a.m.\n\nPrince Srivari Vidyalaya: Annual Day, College Rd., Nanganallur, 4.15 p.m.\n\nInternational Arts Literature Spiritual Annadana Seva Organisation: Anniversary celebrations, Palmgrove Hotel, Nungambakkam, 9.45 a.m.\n\nThiruvalluvar Mission: Anniversary celebration, Thiruvalluvar temple, Mylapore, 3 p.m.\n\nTirumala Tirupati Devasthanam: Free eye camp, TTD, T.Nagar, 8.30 a.m.\n\nHumour Club Besant Nagar: Competition, RBI staff quarters, Besant Nagar, 4 p.m.\n\nNarcotics Anonymous: Meetings, Good Company Group, St. Teresa’s Church, Assumption School, Nungambakkam, 11 a.m.; Miracle on Marina Group, Chennai School, 1, Venkatarangam Pillai St., Triplicane; and Circle of Life Group, Annai Velankanni Church, Besant Nagar, 7 p.m.\n\nAl-Anon: Meetings, New Beginning Al Anon Group, Holy Angels Convent, T. Nagar, 11 a.m.; Sunshine Al Anon Group, Risen Redeemers Church, United India Colony, II Cross St., Kodambakkam, 4 p.m.;\n\nBroadway Al-Anon Group, St. Francis Xavier Church, Broadway, 6 p.m.; Al-Anon Group, Kesari HSS., Pondy Bazaar, T. Nagar, 7 p.m. and Al-Anon Group, Satya Matriculation School, Poonamallee Bus Stand, 7 p.m.\n\nAlcoholics Anonymous: Meetings Assumption School, St. Teresa Church, Nungambakkam, 10.30 a.m.; St. Mathias Church, Kamarajar Salai, K. K. Nagar;\n\nECI Church, 15, Dr. Ambedkar St., Arumbakkam; and CSI School, Gandhi Main Rd., Oragadam, Ambattur, 11 a.m.; Dr. Boaz Memorial Hospital, Velachery Rd., Santhosapuram, Selaiyur; Infant Jesus Church, Manali New Town, Manali;\n\nCSI Peters Church, Vyasarpadi, 11.30 a.m.; St. Francis Xavier Church, Broadway, 6 p.m.; Kesari HSS., Pondy Bazaar, T. Nagar; Police Boys Club, 1st Sector, Chinmaya Nagar, Koyambedu; Sri Ganapathy Sachidananda Ashram Hospital, Dutta St., Baby Nagar, Velachery;\n\nSingaram Pillai Boys High School, Opposite Nathamuni Theatre, Villivakkam; Arul Kadal, 136, Santhome High Rd.; and St. Infant Teresa Church, 7, KKR Avenue, Sembium, Perambur, 7 p.m.", 
    "section": "national", 
    "title": "5MAR16CHADI- Chennai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}