{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "‘Alumni Buddy Connect’ to be inaugurated today\n\nOld students of the Bishop Heber College (grouped as Heber Alumni Association or HEBAA), have united to make the institution’s golden jubilee celebrations more meaningful by launching, among others, a pilot three-month mentoring programme for current students of Computer Science in order to bring them up to match with industry requirements.\n\nTitled ‘Alumni Buddy Connect’ (ABC), the programme will be formally inaugurated on Monday. “All of us know the problems that students face today - lack of communication skills, technical knowledge and a disconnection between college education and industry experience. ABC addresses all these problems,” E. Andrew Santhosh, president of the revived HEBAA told The Hindu . “Since we are in the industry, we will be able to guide the students accordingly.”\n\nEarlier in the week, 545 students sat for the qualifying aptitude and Computer Science fundamental tests out of which 50 were selected. The list was further trimmed to 20 finalists after personal interviews by alumni association members who are involved in the ABC programme. The finalists will be participating in Monday’s inaugural session.\n\nFive teams of alumni mentors from across the globe have signed up for the free project on the understanding that they would interact daily with their mentee through email correspondence or video conferencing.\n\n“Verbal and communication skills play an important part in the entire world. I feel people are either held back by the Tamil medium education or they are not putting in enough effort to overcome the language barrier,” said Suryanarayanan, who did his B.Sc. Maths and Masters in Computer Applications in Bishop Heber College. “Our programme is not about job placements. We will improve the capability of the person and make him or her ready to face the world better, irrespective of where they want to go later on,” he added.\n\nBesides this, HEBAA is planning to set up a technology incubation centre to give Computer Science students and alumni an opportunity to work together on IT projects. A section of the college’s present computer lab will be utilised for this purpose.\n\nThe alumni association will also support the college management through the HEBAA education and social platform, a web-based portal to work for the economically and socially disadvantaged.\n\nHEBAA’s ‘industry institution model’ will be aimed at increasing partnerships with academia and corporations in information technology.\n\nThe association is hoping to increase the corpus of old students by starting a registration drive for alumni.\n\nBishop Heber College will be hosting a get-together for old students on August 13 and 14, which will be organised by the Computer Science Department alumni association. After a period of observation, the mentoring project is expected to be taken up by other departments of the college.\n\nBishop Heber College will be hosting a\n\nget-together for\n\nold students on August 13 and 14", 
    "section": "national", 
    "title": "Alumni’s gesture to alma mater", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}