{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Fishermen to resort to massive protest if amendments were not withdrawn\n\nThe fisherman at the grievance day meeting in Thoothukudi.— Photo: N. Rajesh\n\nMost of the country boat fishermen expressed their displeasure with the amendments made to Tamil Nadu Marine Fishing Regulation Act, 1983 at the grievance redressal meeting convened by the Department of Fisheries here on Friday.\n\nS.J. Gayes, president of Country Boat Fishermen Association, Manapad, said that the Act was implemented only to protect traditional fishing by country boats. The amendments were not withdrawn, the fishermen would resort to a massive protest.\n\nM. Johnson, a fisherman from Threspuram, said that the amendments were implemented on February 20 without taking into consideration from country craft fishermen, and they were favouring mechanised boat operators.\n\nSanthya Pacheik, another fisherman from the same area, said that already there were large-scale violations of this Act by the mechanised boat fishermen. Most of the mechanised boats were measuring beyond the stipulated length and were equipped with high horse power motor engines.\n\nAnother fisherman, Paramasivan, said that since mechanised boats were engaged in bottom trawl net fishing, pearl fishery resources were depleting.\n\nMoreover, letting of sewage into the coast here had endangered several marine organisms, he said.\n\nCollector M. Ravikumar, who presided over the meeting, said that all such grievances would be brought to the notice of the government. He said that the Fishing Regulation Act was strictly adhered to by Thoothukudi fishermen.\n\nJoint Director of Fisheries R. Amal Xavier said that amendments were not notified by the government.\n\nR. Vino, a fisherman from Manapad, alleged irregularities in constructing houses for 50 families under Tsunami Rehabilitation Scheme.\n\nResponding to the charge, the Collector said that an enquiry would be conducted and necessary action would be taken against officials, if found guilty.\n\nS. Maharahan, president, Tharuvaikulam panchayat, said that the long-pending demand of the residents for house site pattas was yet to be fulfilled.\n\nAssistant Director of Fisheries J. Isaac Jeyakumar and Inspector of Fisheries T. Vijayaraghavan were also present.", 
    "section": "national", 
    "title": "Amendments to Marine Fishing Regulation Act opposed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}