{
    "author": [
        "S Senthalir"
    ], 
    "text": "Artists prepare to paint the shutter of a shop as part of the Public Art event to be held in Puducherry on Sunday morning.— Photo: S.S. Kumar\n\nCan the drab ‘No Parking’ sign boards be converted to a visually, aesthetic artistic work? Artists from Puducherry and Auroville are preparing to show how public art could beautify this coastal town.\n\nThis Sunday morning, the walls, shutters and doors of private and abandoned spaces in the boulevard area would be splashed with colours. Art students and artists from Puducherry and Auroville will beautify the city through their paintings.\n\nOn Saturday evening, a few artists ventured out on Perumal Koil Street and M.G. Road, seeking permission from property owners to beautify their walls with their artistic works. “We are going to paint them with different themes,” says Kirti Chandak, founder of TASMAI art gallery.\n\nThis year, Shilpataru Art Event 2016 is concentrating on public art as the main theme to spread awareness on the importance of public art. “Public art changes the mundane space into a lively one. This event is open to any artist who would like to volunteer to create art work on these large empty spaces. This is an attempt to make Puducherry synonym to Art city,” she said.\n\nThe artists would work on the themes of beauty, art, love and emotion. “When cycling around or walking, if the people see a beautiful image, they would enjoy,” she said.\n\nGopal. J, a Puducherry-based artist, added that public art is needed to make a place beautiful.\n\nPublic art is also seen as an effort to create good community feeling amongst the artists and public as well. The artists would also paint murals on the walls using water colour and enamel paintings on shutters.\n\n“The main idea is to show what public art means to the government and people. This is an initial step towards expanding public art on larger public space. This is a step towards enriching our culture,” she said.\n\nArtists and art students will splash walls, shutters and doors of private and abandoned spaces with colours on various themes", 
    "section": "national", 
    "title": "An exercise to promote public art", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}