{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "After a flurry of orders over the past week at the Pondicherry Central University that saw changes at the level of the Vice Chancellor-in-charge and officiating Registrar, Prof. Anisa Basheer Khan is back at the helm on the basis of a communication from the Ministry of Human Resource Development (MHRD).\n\nOn February 27, the University announced that Prof. R. Prabhakara Raya, Dean, School of Management, Pondicherry Central University has been appointed Vice Chancellor in charge of the University. This was following the expiry of the Deanship of Prof. Anisa Basheer Khan, who was holding the post of VC-in-charge, after Prof. Chandra Krishnamurthy was put on compulsory wait with effect from August 22, 2015.\n\nOn the day preceding the expiry of her Deanship, Prof. Khan had issued an order relieving J. Sampath from the post of registrar in-charge on February 26 and posting M. Ramachandran in his place.\n\nThe following day, the order relieving the VC-in-charge came from Mr. Sampath, Registrar-in-charge.\n\nThe order which was issued on the basis of communication from the MHRD also announced that Prof. Prabhakara Raya, the next senior most Dean as per University records, shall perform the functions of the Vice Chancellor as per Statute 1 (A) 7 from February 28 to March 7, 2016, or until the existing Vice Chancellor (who has been put on compulsory wait) resumes duty or a new VC is appointed.\n\nThe drama continued with Prof. Raya, on assuming charge as V-C, on February 29, cancelling Anisa Khan’s order and retaining Sampath as registrar-in-charge.\n\nOn Friday, the MHRD came out with another order stating that Prof. Khan would continue to be the VC-in-charge till a new person assumes charge or the existing Vice-Chancellor resumes office.\n\nConsultation with ministry\n\nIn a communication to the University, Subodh Kumar Ghildiyal, Deputy Secretary to the Government of India, said this followed a consultation with the Ministry of Law and Justice, Department of Legal Affairs.\n\nThe legal opinion has delinked the appointment in extraordinary circumstances of Prof. Khan from the Statute 1 (A) 7.\n\n“The situation like the present one (VC on compulsory wait) cannot be seen as an opportunity to hold to the post of VC-in-charge. The intent of both provisions is altogether different and cannot be intermixed in the present situation,” the legal department said.\n\nIt also held that the statute nowhere provided that the terms of Deans officiating as in-charge is co-terminus with his/her tenure as Dean and would cease to hold office of officiating VC after expiry of her term as Dean.\n\n“In view of the above, there appears to be no objection in continuation of Prof. Khan as officiating VC even if her terms as Dean has expired, till a new VC assumes charge or until existing VC assumes office,” the order said.\n\n“This is not a reinstatement but a continuation without break of the tenure of Prof. Khan as officiating VC,” said Prof. Ramachandran, Registrar-in-charge as per Prof. Khan’s order on February 26, the day preceding expiry of her Deanship.\n\nMeanwhile, Prof. Sampath, who issued the order relieving Prof. Khan as VC-in-charge as officiating Registrar, is now the joint registrar.\n\nUniversity sources said what played out as a virtual musical chair game was attributable to the confusion over interpretation of the statute book.\n\n“In this case, the Law department’s interpretation has upheld primacy of the initial order issued in extraordinary circumstances of a VC being put on compulsory wait and which had stipulated that the officiating VC would continue until a new person was appointed.\n\nThe view is that this is separate from the routine elevation to the three-year Deanship which is done on a rotation basis,” a professor said.", 
    "section": "national", 
    "title": "Anisa back as Central varsity VC-in-charge", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}