{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Car-Free Sundays, an initiative by The Hindu Tamil in partnership with the Coimbatore Corporation and Coimbatore City Traffic Police on NSR Road here (from 6.30 a.m. to 9 a.m.), is entering the second week. The Hindu (English) is the media partner.\n\nOn March 6, there will be a stand-up comedy by Laughter Club, a street play by students of Hinduthan Group of Institutions and a yoga performance by Krishnagopal and team. Plans are afoot to line up new events every week.\n\nThis week, people can play games such as snakes and ladders, frisbee, chess, chalk painting, and tattoo art, balloon art and many more. Performers from different parts of the city will enthral them with Bharathnatyam , classical dance, magic show and live music.\n\nWorkout sessions will be organised by Beethovan’s BodyZeal Fitness Studio. DPS Music Academy is playing instruments (guitar, keyboard, drums). The event manager is Mark 1 Event and radio partner is Radio City.\n\nThis week, changes have been made in the 800-meter stretch that is being used for the events. Events have been moved a little away from Thadagam Road side towards NSR Road to ensure free movement on Church Road and entry and exit for those in P & T Quarters.\n\nAvila Convent Matriculation Higher Secondary School, which has entered the golden jubilee year, is joining the event in a big way. An approximate number of 200 students, 50 staff, parents and former students will be there to drive home the maxim, ‘keep the car away and gain extra years to your life’, says Sister Shalini, principal of the school.\n\nAnother school, Lisieux Matriculation Higher Secondary School, is also taking part. The activities to be presented by the Avila Convent include band display and musical notes of popular numbers in addition to the band performance by National Model Higher Secondary School students from Peelamedu.\n\nThe other events are cycle rally to promote physical fitness, skipping, jogging, skating, silambam , display of gadgets – guides, karate, yoga, painting, rangoli, games of our soil, shuttle badminton, human pyramid, hoola hoops by kindergarten students, zumba, group song, western dance on women empowerment, thiruvathirakali, magic with fingers (keyboard), today’s Prabhudevas (western dance) and Tamil folk events.", 
    "section": "national", 
    "title": "Car-Free Sundays on NSR Road enters second week", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}