{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Following the government’s decision to recalibrate the interest rate of small saving schemes from April 1, depositors have raise concern over the decrease in interest for their savings.\n\nLast month, the government had announced that it would revise interest rates of small savings schemes on a quarterly basis to align them with the market rate of other government securities. If the move is implemented, new depositors will have to settle for a slightly lesser interest rate.\n\nThe rate of interest for some of the schemes such as recurring deposit, time deposit and kisan vikas patra may decrease by 0.25 per cent. In Chennai City region, there are over 60 lakh savings deposit holders now.\n\nPostal agents too fear that the number of people depositing money in post offices may decrease if the decision is implemented.\n\nS. Rajpandian, president of Tamil Nadu Postal Agents Welfare Association, said the maturity period of kisan vikas patra might have to be revised according to the interest rate that is being provided. This may discourage some depositors as the amount invested will double during the maturity period. Time deposits and monthly income schemes (MIS) are some of the popular schemes.\n\nHowever, interest rates of schemes like MIS, selvamagal semippu thittam, ponmagan podhuvaippu nidhi and those for senior citizens will remain the same. The association plans to submit a memorandum to the Postal Department seeking continuation of the existing interest rate and increase in the incentives given to them.\n\nMany post offices are yet to receive any directives about the new move with regard to savings schemes. Officials said that the interest rate, even if revised, would still remain higher than those offered by financial institutions and banks. It would not affect the deposits as people, particularly those in rural areas, would prefer to invest in post offices, they added.", 
    "section": "national", 
    "title": "Concern over decision to decrease interest rates of postal savings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}