{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The State cannot seek review of a court order by claiming that there was an error on the face of the record after having actually failed in its duty to bring relevant documents to the notice of the court before the judicial order was passed, the Madras High Court Bench here has held.\n\nJustices S. Manikumar and C.T. Selvam passed the order while dismissing a review petition filed jointly by the Home Secretary, Director General of Police and Commissioner of Police here challenging an order passed on October 29 to recruit a person who had undergone laser eye surgery as a constable.\n\nAccording to R. Lakshmanan, counsel for the constable aspirant G. Shanmugasundaram, a single judge of the High Court had dismissed a writ petition filed by his client. However, on appeal, a Division Bench found that no reason had been assigned to explain how appellant's corneal scars would affect his vision.\n\nHence, it allowed the appeal and directed the State government to recruit him as Grade-II police constable giving rise to the present review petition which was argued on the ground that the Division Bench had failed to take note of an amendment made to Tamil Nadu Special Police Subordinate Service in 2006.\n\nThe three review applicants claimed that the Division Bench would not have allowed the writ appeal if it had taken note of a Government Order passed on June 8, 2006, amending the special service rules and making laser surgery undergone by an applicant in either of his eyes as a disqualification for police service.\n\nStating that the review applicants had not explained what prevented them from bringing the G.O. to the notice of the Division Bench which allowed the appeal, the Bench led by Mr. Justice Manikumar said: “What has not been brought to the notice of the court cannot be claimed to be an error committed by the court.”", 
    "section": "national", 
    "title": "Court orders cannot be faulted with for litigants’ mistakes: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}