{
    "author": [
        "Special Correspondent"
    ], 
    "text": "New thrust areas being social infrastructure and renewable energy sources\n\nThe Annual Credit Plan for Tirunelveli district for the next fiscal envisages an outflow of Rs. 7,050 crore, an increase of 17 per cent over the current year and against Rs. 7,313.91 crore estimated in Nabard’s Potential Linked Credit Plan (PLP).\n\nCollector M. Karunakaran released the Annual Credit Plan at the Collectorate here on Friday.\n\nThe Indian Overseas Bank, the lead bank of the district, which has prepared the ACP has taken into account various parameters aspects such as the Nabard’s PLP, past performance, schemes of State and Central governments, special area development projects, new thrust areas such as social infrastructure and renewable energy sources.\n\nThe ACP has given thrust to all sectors and employment generation activities in agriculture, services and industries sectors. Provision has also been made for sanction of government schemes under various sectors. In Agriculture, term loan lending has been given importance to the tune of 35 per cent to increase the capital assets of farmers.\n\nFor the development of new sectors such as social infrastructure and renewable source of energy, Rs. 150 crore has been allocated for installation of windmills, solar lights, solar-powered pumpsets, schools, sanitation and drinking water facilities.\n\nWhile major share of the credit plan has been taken by Indian Overseas Bank (20 per cent), Pandyan Grama Bank (15.48 per cent), Canara Bank (12.89 per cent), Tamilnad Mercantile Bank (8.86 per cent) and State Bank of India (8.83 per cent) and a few more banks have also assured to ensure significant credit outflow.\n\nChief Regional Manager of Indian Overseas Bank and Convener of District Consultative Committee S.C. Mohanta; K. Ramalingam, AGM, Nabard; H. Vijayakumar, Project Director, DRDA; Raja Jeyabala, Project Director, Mahalir Thittam; and S. Alagarsamy, Lead District Manager, participated in the meeting.", 
    "section": "national", 
    "title": "Credit plan envisages outflow of Rs. 7,050 crore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}