{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Officials briefed about Model Code of Conduct and other election-related processes\n\nOfficials appraised:Returning Officers and Assistant Returning Officers participate in a training programme conducted by the Election Commission of India on Saturday.— Photo:T. Singaravelou\n\nIn the run up to the forthcoming Assembly elections, the Election Commission of India conducted the first phase of training programme for Returning Officers (ROs) and Assistant Returning Officers (AROs) here on Saturday.\n\nK.F. Wilfred, Principal Secretary, ECI acted as a resource person for the training session. All the ROs and AROs were explained in detail about the implementation of the Model Code of Conduct and other election related processes.\n\n“The officials were briefed about the rules to be followed while receiving nomination papers from candidates. They were also explained at length about rules to be followed for scrutiny, eligibility and disqualifications for a contestant. Allotment of symbols and legal issues connected with these processes were also discussed,” Chief Electoral Officer V. Candavelou told The Hindu .\n\nThe ROs and AROs were appraised about the Voter Verifiable Paper Audit Trail (VVPAT) system. This system will be introduced in Uppalam, Orleanpet and Karaikal South constituencies in the coming elections.\n\nVVPAT is a system of providing feedback to the voter. It will generate a printed-slip showing the candidate to whom he/ she cast the vote.\n\nThe slip can be viewed by the voter and however cannot be taken away by the voter.\n\nThe slip will be automatically collected in the collection compartment of the machine. Mr. Candavelou said that a meeting would be held with representatives of various political parties on March 8 followed by a workshop for media persons on paid news and media communication and monitoring committee.", 
    "section": "national", 
    "title": "EC holds first phase of training programme", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}