{
    "author": [
        "Udhav Naig"
    ], 
    "text": "With rumours doing the rounds that Desiya Murpokku Dravida Kazhagam (DMDK) and Dravida Munnetra Kazhagam are engaged in the final round of electoral negotiations, DMDK president Vijayakant’s speech at his party’s public meeting in Kancheepuram has come into focus once again.\n\nAt the meeting, Mr. Vijayakant had openly asked the party cadre: “Do you want me to be the king or king-maker?” The cadres answered in unison: “The king!”\n\nWhile the alliance agreement could dent Mr. Vijayakant’s image as the ‘king’ and possibly trigger more debates on whether he could ever dream of becoming the ‘king’, what many missed was the consistent use of ‘feudal’ ideas such as ‘king,’ ‘capturing the fort,’ ‘commander’ in the political discourse of a modern, democratic Tamil Nadu.\n\nRavi Kumar, general secretary, Viduthalai Chiruthaigal Katchi, posed a question asking why the Dravidian parties continue to use feudal signifiers despite their progressive politics and six decades of democracy in India. “The DMK used cinema, a product of modern technology, to their benefit. But, they have not been able to shake off the pre-modern signifiers in their discourse,” he wrote on social media later.\n\nAcademics and political commentators unanimously agree that the use of feudal signifiers is the result of rhetoric developed by the Dravidian parties in the early days of its inception. “The political rhetoric of the Dravidian movement has always relied on Tamil militarist imagination. C.N. Annadurai made frequent references to military exploits of the Tamils not just as a glorification of Tamils’ past, but vitally as a mobilisation strategy during the anti-Hindi agitations. We must read the current usage of terms like ‘king’, ‘commander’ etc as a product of this legacy,” says Karthick RM, a scholar from University of Essex, whose thesis is based on the works of Frantz Fanon and Periyar.\n\nAnother point of view has it that Dravidian parties have always invoked such ideas using fancy language to get the cadre up to speed. “The Dravidian party leaders have relied on aduku mozhi vasanam or word play, because their cadre liked and admired it. Sometimes, the message is not deemed important. For a party that was formed for the purpose of spreading rationalism and social justice and spoke of strengthening federalism, their obsession with Tamil literary figures such as Kannagi and hero worship have become a problem,” said Punitha Pandian, editor, Dalit Murasu .\n\nDespite the progressive politics of Dravidian parties, especially of the DMK, the leaders have always appealed to the emotive cultural identity of the Tamil electorate, said Ramu Manivannan, professor of politics, Madras University.\n\n“Indian society is largely feudal. The parties also appeal to the primordial values of society. We have already accepted caste and family successions as a part of democratic politics. The parties could have gone ahead and changed the political imagination, but it is the leaders who need to be blamed for this current sorry state,” he said", 
    "section": "national", 
    "title": "Feudal remnants in political discourse", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}