{
    "author": [
        "Staff Reporter"
    ], 
    "text": "District Judge interacts with tribal people in remote Sirumalai village\n\nR. Poornima, District Judge, interacting with villagers at a legal awareness camp at Thalaikadai village on Sirumalai hills in Dindigul district on Saturday.— PHOTO: G. Karthikeyan\n\nFinancial constraints should not be a barrier to tribal people from getting justice. Free legal aid centre was aimed at protecting their rights and extending all help to them in getting justice.\n\nAny belittlement, torture or mental agony, physical or mental threat and exploitation of tribal people would be viewed seriously, said District Judge R. Poornima.\n\nInteracting with tribal people at Thalaikadai, one of the remote villages on Sirumalai hills, during a special legal awareness camp organised by the District Legal Services Authority on Saturday, she said that there were special laws to protect their rights. Justice should not be denied owing one’s lack of money. Approaching the court would suffice for them to avail all legal services to protect their rights.\n\nThe DLSA would extend all help in redressing their grievances and get benefits from the government, the Judge said. She also advised tribal people to educate their wards for economic and social upliftment.\n\nExpressing concern over lack of power supply at the village, she was keen on knowing about visit of doctors, women healthcare and education of girl child.\n\nAdditional Sub Judge A. Deepa appealed to the people to register birth of their wards as it was mandatory to avail benefits of government schemes. Legal Aid Cell advocates would assist them in getting birth certificates, she also said.\n\nChief Judicial Magistrate S. Jeganathan expressed concern over lack of basic amenities and medical facilities at the village.\n\nPetitions given\n\nThe tribal people handed over several petitions seeking electricity to their village, healthcare, education, financial assistance for livelihood activities, land patta and community certificates.\n\nDLSA secretary K. Karunanidhi and Additional district judge M. Sai Saravanan spoke.\n\nSince many tribal people did not know how to write the petitions, lawyers from the DLSA assisted them. The district judge assured that their petitions would be sent to the departments concerned for speedy action.\n\n“Free legal aid centre aimed at protecting their rights, extending\n\nall help to them in getting justice”", 
    "section": "national", 
    "title": "“Financial constraint no barrier in getting justice”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}