{
    "author": [
        "Staff Reporter"
    ], 
    "text": "To check violations of code of conduct and monitor election expenditure of candidates, one flying squad, one static surveillance committee, one video viewing committee and one accounts committee were formed for each of the 11 Assembly constituencies in the district.\n\nAddressing the media here on Saturday, District Election Officer and Collector V. Sampath said that each team will monitor for eight hours in each constituency to check violations and monitor the expenses of each candidate during the campaign. There are 27,96,984 electors and 3,241 polling stations in 11 Assembly constituencies for which polling is to be held on May 16. He said that people can inform election related complaints to the control room at 0427-2450032, 2450034 and 2450035.\n\n“Since the Model Code of Conduct is in place from 3.30 p.m. on Friday, he asked all political parties to adhere to the rules so that no violations were reported.”\n\nEarlier, chairing a meeting of recognised national and State-level political parities, he said that Voter-Verified Paper Trail (VVPT) is introduced for the first time in Salem North Assembly constituency in the district.\n\nRepresentative of Communist Party of India said that more than one lakh families are dependent on the silver anklet business in the district and added that the silver bars carried for processing should not be seized. Mr. Sampath said that clarification has been sought from the Election Commission of India and response is awaited.\n\nIn Namakkal district, 18 flying squads were formed for the six Assembly constituencies on Friday.\n\nCollector V. Dakshinamoorthy chaired a meeting with representatives of all recognised political parities.\n\nAddressing the media, he said that persons carrying more than Rs. 50,000 in cash should have sufficient documents so as to prevent seizure.", 
    "section": "national", 
    "title": "Flying squads formed in Salem district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}