{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district administration has planned to deploy three flying squads and as many static squads in each Assembly constituency in the district besides erecting three check-posts on the arterial roads leading to these segments to prevent transportation of unaccounted cash and other banned articles.\n\nSpeaking to reporters here on Saturday, Collector M. Karunakaran, after holding discussion with the representatives of recognised political parties on carrying out electioneering without violating established norms and conducting the May 16 polls in a free and fair manner, said three flying squads and as many static squads along with videographers had been deployed in each of the 10 Assembly constituencies in the district to check violation of Model Code of Conduct that had come to stay following the Assembly election notification.\n\nMoreover, three check-posts would be erected on three important points in each Assembly segment and the check-posts would be shifted based on necessity. On getting reports from the flying and static squads everyday, appropriate action would be taken to check violations, if any.\n\n“Political parties can get permission for conducting election rallies or campaigns by submitting their application online and the representatives who attended today’s meeting have been asked to cooperate with the officials to complete the electioneering and polling process in a smooth manner. Violations will be viewed very seriously,” Dr. Karunakaran said.\n\nThe District Collector said an election control room would be established shortly on the Collectorate premises where the public and the political parties could register their complaints pertaining to poll code violations.\n\n“The designated phone number of the election control room will be informed through the media shortly. Till then, the public can contact the ‘Hello Police’ number 99527 40740 to register their complaints round-the-clock,” the Collector said.\n\nWhen asked about the alleged distribution of assistance Rs. 5,000 each to the village forest committees in a function organised at Ambasamudram on Friday after the Election Commission of India came out with the election notification, Dr. Karunakaran said there was no problem in executing the ongoing development works or schemes that were already commenced before the notification. He also said the portraits of Chief Minister Jayalalithaa would be removed from all government offices and the officials concerned had been given adequate instruction in this connection.\n\nSuperintendent of Police V. Vikraman said 380 booths in the district had been identified as ‘hypersensitive’ and hence four or five companies of Central forces would be deployed in these places to reinforce security further and instil confidence in the minds of the public.\n\nDeputy Commissioner of Police (Law and Order), Tirunelveli City, Santhosh Hadimani, Commissioner and Tirunelveli Corporation S. Sivasubramanian were present.", 
    "section": "national", 
    "title": "Flying and static squads for each segment in Tirunelveli", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}