{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a bid to streamline number plates of registered motor vehicles across Tamil Nadu, the government has floated a tender inviting bids from companies for implementing the guidelines issued by the Union Road Transport and Highways Ministry to introduce high-security registration plate system (HSRPS) in all motor vehicles.\n\nThe project to implement the revised Rule 50 of the Central Motor Vehicles Rules, 1989, as notified by the Ministry for issuance of HSRPS, would be implemented on ‘Build, Own and Operate’ basis.\n\n“On existing registered vehicles also, the High-Security Registration Plates will be individually embossed and affixed only upon receipt of the authentication document from the Registering Authority,” the tender document states.\n\nThe sizes of the plates for different categories are: two and three-wheelers (200x100 mm, 285x45mm), light motor vehicles/passenger cars (340x200mm, 500x120mm), medium commercial vehicles, heavy commercial vehicles (340x200mm). The size of registration plates for agricultural tractors shall be 285x45 mm for the front plate and 200x100 mm for the rear plate. In the case of motorcycles, the size is 285x45 mm.\n\n“The letters on the High-Security Registration Plates shall be in black colour on yellow background in case of transport vehicles and in black colour on white background in other cases. The letters of registration mark shall be in English and the figures shall be in Arabic numerals, and the letters and numerals shall be embossed and hot stamped,” it adds.\n\nThe plate should bear the letters ‘IND’ in blue colour on the extreme left centre of the plate and should be suitable for hot stamping and the reflective sheet has to be guaranteed for imperishable nature for minimum five years, one of the conditions laid down by the documents states.\n\nThe tender was floated before the Model Code of Conduct came into force.", 
    "section": "national", 
    "title": "Government floats tender for high-security number plates", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}