{
    "author": [
        "V Venkatasubramanian"
    ], 
    "text": "The elector will be able to verify whether the vote was cast for the intended candidate\n\nElectors in the Kancheepuram constituency will be part of the first batch of voters in Tamil Nadu to be provided with a facility to verify whether they had cast their vote for the intended candidate on the Electronic Voting Machine, in the forthcoming Assembly elections.\n\n16 constituencies\n\nThe other 16 Assembly constituencies where the Voter Verifiable Paper Audit Trail (VVPAT) system will be used are: Anna Nagar (in Chennai), Vellore, Krishnagiri, Salem (North), Erode (West), Tiruppur (North), Coimbatore (North), Dindigul, Tiruchirapalli (West), Cuddalore, Thanjavur, Villupuram, Madurai (East), Thoothukudi, Tirunelveli and Kanyakumari.\n\nHow it works\n\nExplaining the functioning of the VVPAT system here on Saturday, R. Gajalakshmi, Collector and District Election Officer, said that upon casting the vote by pressing the button on the ballot unit, the voter will be able to view a printed slip through the transparent window on the VVPAT machine.\n\nThe printed slip containing the serial number, name and the symbol of the candidate for whom he or she has cast the vote would be displayed for about three minutes.\n\nAfterwards, it gets cut and drops in the drop box of the machine, she said.\n\n397 machines\n\nThe District Election Wing has received a total of 397 VVPAT machines for use in the Kancheepuram Assembly constituency for the upcoming election.\n\nThe constituency has a voter population of around 3 lakh.\n\nEarlier, students from the arts and science colleges functioning in Kancheepuram made a formation displaying the spelling VVPAT in the open space near Sri Krishna Arts and Science College, Kancheepuram.\n\nA printed slip can be viewed through the transparent window on\n\nthe machine", 
    "section": "national", 
    "title": "Kancheepuram voters to have VVPAT facility", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}