{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Pradosha puja 4.30 p.m., Bhairavar puja, Railway Colony, 6 p.m.\n\nPanniru Tirumurai Mandram: Pann Isai by S.S. Mohanram, Adi Street, 7 a.m., Discourse on ‘Periapuranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar 5 p.m.\n\nTiruvalluvar Kazhagam: 27{+t}{+h}anniversary celebrations of Youth Literary festival, SP. Tirupathi presides, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nRamakrishna Mutt: Discourse on ‘Bhagwan Sri Ramanarin Vaalvum Vaakum’ by Dr. Kalarani Rangasamy, 5.45 p.m., aarathi, New Natham Road, 6.30 p.m.\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Amarnath Lingam darshan, Victoria Edward Hall, West Veli Street 7 a.m., Kedarnath Lingam darshan, 408 North Masi Street 7 a.m. and 4 p.m.\n\nSringeri Sarada Peetham: Pradosha puja, No. 88 Amman Sannidhi Street, 6 p.m.\n\nSri Swami Tatwananda Ashram: Upanishad class by Swami Samanandar, P and T Nagar, 6.45 p.m.\n\nChaplain The American College: Sunday Vesper service, Rev. Dr. W. Samuel Soundarapandian, Dr. S. Wellington leads, Jubilee Chapel, 6 p.m.\n\nChurch of Christ: Sunday service, Bro. Deva Manickam and M. S. Raja conduct, Viswasapuri, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nCULTURE\n\nUniversal Peace Sanchiary: Free meditation class by Sathguru Sundaramoorthi Sachidananda, No. 138 Kamarajar Road, Mariamman Teppakulam, 7 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar P and T Nagar; 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nGENERAL\n\nVivekananda College: One-day special camp by ‘Appar Swamigal uzhavara kuzhu’ Pon Perumal Temple Vadipatti, 8 a.m. and 5 p.m., NSS volunteers to attend camp, college campus, 6 a.m. and 5 p.m.\n\nThiagarajar College: NSS camp, Silaiman panchayat, 9 a.m.\n\nJCI Madurai Dynamic: World Women’s Day celebration in association with Agrini Enclave Houses and Flat Owners’ Association, Selvi Santhosham, Head Administrator, TVS Schools, chief guest, S.V. Sankara Narayanan, zone president, JCI India, guest of honour, Near Agrini Park, 4 p.m.\n\nThe Humanist Club: International Women’s Day, short films, IGSR Hall, Gandhi Museum, 10.30 a.m.\n\nGalileo Science Centre: One-day science workshop for students and teachers, Maniammai Primary School, North Masi Street, 10 a.m.\n\nAlcoholics Anonymous: Meeting, Justice Krishna Iyer Community Hall, 7 p.m., Alfred Noble Mat. HSS, Tirunagar, 8{+t}{+h}bus stop, 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, Melur, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}