{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "Thevara isai exponents Pon M.Muthukumaran and Pon M.MuthuVinayagam filled Tamil Isai Sangam with religious fervour with Thevaram.\n\nApart from singing about the yearning of the devotees for the grace of God in plaintive and persuasive tones, the brothers also played the kunnakkol and one of them did a verbal percussion to elaborate the variety of rhythm intrinsic to these hymns.\n\n“Pirai ani” in nattappaadai pan, “Sadayai enuamai’ in hindolam and “Aadinai narunai” in Gandhara panchama pan were some of the Thevarams that are related to miracles performed by Sambandhar.\n\nTwo thousand students have learnt these songs free of cost at Tamilisai Sangam. This was the dream of Dr. M.A.M. Ramasamy, one of the founders of this organisation, whose aim was to spread Tamil Isai free of cost.\n\nAt the beginning of the second programme, Mahati worshipped “Varana Muhava” in hamsadwani and these auspicious lyrics by Koteeswara Iyer were followed by VenkataSubaiyer’s injunction to fear none in ragam Manirangu beginning, “Yaar enna sonnalum anjadhe”.\n\n“Nambi Kettavar evarayya” followed an in-depth delineation of ragam hindolam by alapana and was rounded off with chittai swarams for the kriti by Papanasam Sivan. “Pada vendume” in hamsanandam by Dandapani Desikar and “Thaye thripura sundari” in sudha saveri added to the variety.\n\nThe main song was a favourite of stalwarts, the kriti “Thiruvadi Charanam” by Gopalakrishna bharathi in kamboji.\n\nN. Sampath’s contributions on the violin to the creative aspects of the song were appreciable. So was the tani by Sai Giridhar on the mridangam and K.V.Gopalakrishnan on the kanjira.\n\n“Chinninanjiru kiliye”, “Kanda naal mudhal” and a tillana were some of the concluding pieces. A wide range of compositions was thus presented to the rasikas of Madurai.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Mahati stuns audience", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}