{
    "author": [
        "Staff Reporter"
    ], 
    "text": "District Election Officer and Collector V. Sampath speaking at the all-political party meeting at the Collectorate in Salem on Saturday. —Photo: E. Lakshmi Narayanan\n\nDistrict Election Officer and Collector V. Sampath has asked election officials to maintain neutrality and adhere to Model Code of Conduct so as to ensure free and fair election.\n\nA meeting was held at Collectorate on Saturday to sensitise all department heads on the code of conduct so that they can explain their subordinates about the code. Since many of the heads of departments were absent, the Collector said memos would be issued to them for failing to attend the meeting.\n\nHe said that returning officers of all Assembly constituencies should ensure that all political parties and election officials are well aware of the Model Code of Conduct so that violations do not occur.\n\nAbout the new building opened in Attur on Saturday, he said that the Returning Officer will investigate and initiate action.\n\nThe Collector said that pictures of Prime Minister, Chief Minister and Ministers should be removed from offices and even calendars and diaries that possess their pictures should not be used.\n\nTransport Department was asked to ensure that drinking water bottles do not carry the pictures of Chief Minister apart from hospitals covering the government schemes written in walls.\n\nAlso, officials were asked to monitor whether freebies were distributed during temple festivals in the district.\n\nOfficials were also asked not to meet Ministers or other members of political parties and violate the code, the Collector added.\n\nDistrict Revenue Officer Sugumar, City Police Commissioner Sumit Sharan, Superintendent of Police G. Subbulakshmi, DRDA Project Director Kavitha, returning officers of 11 Assembly constituencies and election officials were present at the meeting.", 
    "section": "national", 
    "title": "Maintain neutrality, election officials told", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}