{
    "author": [
        "Dennis S"
    ], 
    "text": "Besides commercial interests, it would promote research in partnership with universities\n\nAn aquarium tunnel with a 100-metre walkway to observe about 250-300 marine species, an underwater restaurant with a capacity of 60 seats and a penguin park with 50 birds are some of the features in the world-class oceanarium the State government is planning to set up at Mamallapuram at a cost of Rs. 257 crore under Design, Build, Finance, Operate and Transfer (DBFOT) basis.\n\nThe oceanarium, which would come up over 13 acres of land on the shores of Mamallapuram, would have alliances with universities and marine biology research centres, besides its commercial interests. Since the land area marked is empty, no resettlement issue is involved in implementing the project.\n\nThe oceanarium would have a submerged winding acrylic tunnel, which would take the public on a “fascinating tour with views in all directions. The tunnel creates an impression of walking on the seabed and the visitor becomes part of the marine environment,” according to the ‘Request for Qualification’ issued by the government, inviting interested companies.\n\nThe oceanarium aims to attract at least one third of the footfall it receives as the ancient historic town, which is a UNESCO World Heritage Site housing monuments of archaeological value. Of the total 13 acres, the oceanarium would occupy only 6.54 acres and the remaining area would be used for fish stocking, game fishing, laser show and a turtle park.\n\nThe special effect multimedia theatre with seating for 300 people is also on the cards for showing the wonders of ocean and other marine-based educational movies. The design norms of the project include an underwater restaurant. A cultural food court, musical fountain, all-terrain scooter and cars, classroom for 100 persons with provision for have an audio visual show, souvenir shops, touch pools, are some of the other features mentioned in the document.\n\nThe oceanarium would come up over 13 acres of land on the shores of the town", 
    "section": "national", 
    "title": "Mamallapuram to house oceanarium", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}