{
    "author": [
        "S Prasad"
    ], 
    "text": "Nearly 300 workers have been roped to remove banners, graffiti and flags\n\nCleaning commences:With the Model Code of Conduct having come into force, walls with election slogans are white-washed at Saradambal Nagar in Puducherry.— Photo:T. Singaravelou\n\nWith the Model Code of Conduct (MCC) coming into force following the notification of Assembly elections, teams from the Oulgaret and Puducherry municipalities have swung into action to remove posters, banners, flags, graffiti and other political publicity material in various areas of the city.\n\nAccording to a senior official, as many as 300 workers from the municipalities have been roped in for carrying out the cleaning operations from Saturday. The drive would continue till the elections. The Chief Electoral Officer V. Candavelou already asked officials to comply with the MCC or face action.\n\nThe civic body has formed teams which are being sent to various parts of the city to erase paintings on walls (white washing).\n\nHowever, wall writings on arterial roads such as the Mahatma Gandhi Road are yet to be erased. Official sources promise that it would be done away with soon.\n\nMeanwhile, in exercise of the powers conferred by Section 4 of the Puducherry Open Places (Prevention of Disfigurement) Act, 2000 (Act No.6 of 2000), the Lieutenant Governor has prohibited all political/election related advertisement in public and private places open to public view in the whole of the Union Territory.\n\nNo interference\n\nAccording to the notification, no person shall impair or interfere with the appearance and beauty or damage, disfigure, erect, fix, spoil or injure in any manner or deface any place open to public view in the whole of the UT, by writing or marking with ink, chalk, paint or any other material for the purpose of political propaganda and electioneering till the completion of the General Elections to Puducherry Legislative Assembly, 2016.\n\nHowever, programmes conducted by the Government under Systematic Voters Education and Electoral Participation (SVEEP) for the election purpose are exempted from the notification.", 
    "section": "national", 
    "title": "Municipal staff remove publicity material in all areas of city", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}