{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A hoarding of Chief Minister Jayalalithaa that is yet to be removed from the Coimbatore Medical College Hospital compound.- Photo:S. Siva Saravanan.\n\nWith the Election Commission announcing election dates and the Model Code of Conduct coming into force, the district administration officials in-charge of the conduct of elections, have started implementing the rules by removing hoardings.\n\nAccording to Collector Archana Patnaik, who addressed reporters on Friday, the officials had started removing all illegal hoardings and that of political parties. She had constituted 30 teams to check the flow of cash. Members of the public would be allowed to carry up to Rs. 50,000 without documents or source for the same. For higher amounts, the members of the public should produce proper documentations. If not, the officials would seize the money and hand it over to the district treasury.\n\nA release from the district administration said that for Mettupalayam, the District Supply and Consumer Protection Officer at the collectorate would be the Returning Officer (RO) and the Mettupalayam Thasildar the Assistant Returning Officer (ARO). For Sulur, the Special Deputy Collector (Special Programme Implementation) would be the RO and Sulur Thasildar the ARO. For Kavundampalayam, the Assistant Commissioner, Urban Land Tax, would be the RO and the Coimbatore North Taluk Thasildar the ARO. For Coimbatore North, the Special Deputy Collector (Social Security Scheme) would the RO and the Special Thasildar, Civil Supplies – Coimbatore North, the ARO.\n\nFor Thondamuthur, the Revenue Divisional Officer, Coimbatore would be the RO and the Coimbatore South Taluk Thasildar the ARO. For Coimbatore South, the Deputy Commissioner, Coimbatore Corporation, would be the RO and Assistant Commissioner, South Zone, Coimbatore Corporation, the ARO. For Singanallur, the District Adi Dravidar and Tribal Welfare Officer would be the RO and the Assistant Rationing Officer, Circle III, the ARO. For Kinathukadavu, the District Backward Class, Most Backward Class and Minorities Welfare Officer would be the RO and the Madukkarai Thasildar the ARO.\n\nFor Pollachi AC, the Sub Collector would be RO and Pollachi Thasildar the ARO, and for Valparai the Inspection Cell Officer, Coimbatore Collectorate, would be the RO and the Valparai Thasildar the ARO. The district would have 2,892 polling stations in 949 locations. The administration had sent proposal to set up 19 auxiliary polling stations to the Election Commission. For administrative purpose, the district administration had divided the district into 241 zones and there would be 241 zonal officers.\n\nAt the district collectorate, the administration had set up a control room, which the people could contact by dialling toll free number 1800 425 5141 and complaints could be sent tocbecontrolroom2016 @gmail.com\n\nAs for expenditure monitoring, there would be 70 teams and 30 flying squads. There would also be 30 static surveillance teams and 10 video surveillance teams.", 
    "section": "national", 
    "title": "Officials start removing hoardings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}