{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "Collectors hold meetings with police and revenue officials and representatives of political parties to explain the dos and don'ts\n\nSealing of the MLA offices, constitution of teams for keeping a close vigil against poll-related violations and white-washing of wall writings and clearing of hoardings set up by various political parties formed part of the action taken by the district administration as part of implementing the model code of conduct on Saturday.\n\nCollector K. Nandakumar convened a meeting to explain the model code of conduct to police personnel and revenue officials who will be posted for election duty. He advised them to keep a close vigil against violations and initiate legal action. He said that flying squads, static surveillance teams and video surveillance teams have been constituted for each constituency. Members of the public can contact these committees in case of any assistance, he added. The officials have been drafted for election duty from different departments.\n\nPerambalur Assembly constituency:\n\nThree flying squads led by Kannan (9489222590), R. Rajendran (9751023610), R. Sivakumar (99945-92877) have been formed.\n\nStatic Surveillance Team is led by S.P.K. Karunamurthy (96778-30266), R. Nagarajan (96559-30466) and Vijayakandeepan (97863-77886).\n\nVideo viewing team is led by Sampathkumar (91598-44146).\n\nFor the Kunnam Assembly constituency:\n\nThe flying squads are led by T. Senguttuvel (98942-73152), S. Ramesh (99628-66747) and T. Jayalakshmi (74026-07754).\n\nThe static surveillance team comprises G. Asokan (91598-49408), A. Ravichandran (94877-11987) and Gurumurthy (97515-16795).\n\nThe video viewing team is led by Pazhanimuthu (94439-60156).\n\nPudukottai\n\nA total of 295 polling booths have been identified as sensitive in the six Assembly constituencies in the district, said Collector S. Ganesh.\n\nIn a release issued here on Saturday, he said that the district administration has taken steps for providing additional security at these booths. The district has an electorate of 12, 23,183 -- 5,11,587 men, 6,11,473 women and 23 transgenders.\n\nThe following is the list of Returning Officers for the Assembly constituencies : Gandarvakottai (Res) – Selvaraj, Adi Dravidar Welfare Officer; Viralimalai – M. Vadivelprabu, Revenue Divisional Officer, Iluppur; Pudukottai – S.P. Amrith, Sub-Collector; Tirumayam – Suriyakala Special Deputy Collector; Alangudi – Jayabarathi, District Supply Officer and Aranthangi – R. Ramyadevi, Revenue Divisional Officer.\n\nThe Collector said that as many as 8,202 officials from various departments have been drafted for polling duty. A round-the-clock control room has been set up at the Collector’s Office with phone number 04322-221627. Those in need of any information or assistance can contact the control room.\n\nLater, addressing representatives of various political parties, Mr. Ganesh explained the procedure to be followed as per the model code of conduct. Those in need of any assistance can contact the cell or dial toll-free 1950, he added.\n\nTiruvarur\n\nPolitical parties must ensure peaceful conduct of Assembly elections by adhering to the model code of conduct in force, Collector and District Election Officer M. Mathivanan told representatives of parties here on Saturday.\n\nAddressing a consultative meeting, he said District Supply Officer K. Prem Kumar would be the Returning Officer for the Tiruthuraipoondi (reserved) Assembly constituency, RDO Selvasurabhi would be the RO for Manargudi constituency, RDO Muthumeenakshi for Tiruvarur constituency and Assistant Commissioner (excise) Asokan would be RO for the Nannilam constituency.\n\nSuperintendent of Police T. Jeyachandran, District Revenue Officer T. Mohanraj, and representatives of recognized political parties participated in the deliberations.\n\nKarur\n\nCollector T.P. Rajesh on Saturday asked the political parties to remove the posters, banners and wall paintings immediately.\n\nSpeaking to the reporters after meeting the representatives of political parities and printers, he said since the model code of conduct had come into immediate effect with the announcement of election dates on Friday, the political parties had been given a briefing about do’s and don’ts in the run up to the State elections. They should immediately remove the publicity materials and wall paintings. So far, 656 banners had been removed by the officials.\n\nHe said no one should intimidate or influence the voters under any circumstances. Similarly, the candidates or their agents should not influence voters with cash or kind. Action would be taken as per 171 B of Indian Penal Code.\n\nMr. Rajesh said that as many as 12 flying squads and 4 video surveillance teams had been formed to monitor the activities of political parties and candidates. Vehicles would be subjected for checking so as to prevent people carrying unaccounted money with ulterior motive. The Election Commission had allowed the people to carry Rs.50,000.\n\nIf they carried more than that, they should possess necessary supporting documents. A control room had been set up at the Collectorate. The people could contact at 18004257029 to register complaints. They could also contact the District Election Officer (Collector) at 7373003577 or Deputy Election Officer at 9445000918 for lodging complaints.\n\nThe district would have 1006 polling booths in 588 locations. Sixty six booths had been identified as sensitive booths.", 
    "section": "national", 
    "title": "Official machinery geared up for election work", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}