{
    "author": [
        "Staff Reporter"
    ], 
    "text": "With the announcement of poll dates for the Assembly elections and the model code of conduct coming into force in its wake, an all-party meeting was held here under the District Election Officer and Collector C. Kathiravan on Saturday.\n\nPresiding over the meeting here, the Collector advised the representatives of political parties to strictly adhere to the Election Commission norms and not to engage in provocative campaigns along the lines of caste, creed, and religion intended to hurt sectarian sentiments.\n\nPolitical parties have also been warned against illegal manoeuvres to garner votes, including distribution of liquor, gifts, organising feasts, etc. Wedding halls shall not be allowed for political campaigns that could be used clandestinely for holding of feasts, distribution of gifts etc.\n\nIn urban areas, no political campaign adverts including flex boards, hoardings, paintings, may be displayed on public and private buildings. In rural areas, due written permission must be secured from the owner of the private land, or owner of the wall space, for display of posters, hoardings, hoisting of flags etc.\n\nThe permission must include details of the size of the political advert that is intended to be displayed on the private property and the same shall be submitted to the concerned election officers.\n\nSimilarly, no political adverts may be displayed on government buildings, schools, hospitals. Parties have also been advised to not paste posters over the posters of other parties that would trigger conflict. Use of mobile campaign vehicles, such as vans, autos for political campaigns shall be allowed only with the prior permission of the concerned police.\n\nAction will be taken against persons for unauthorised adverts pasted on public and private buildings, government premises etc under Section 171 (H) of IPC, the District Election officer and Collector has warned.\n\nPolitical parties and public are advised to be vigilant of the operation of model code of conduct.", 
    "section": "national", 
    "title": "Parties told to adhere to EC norms", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}