{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Civic body engages a private company for the purpose\n\nMayor P. Rajkumar (second left) initiating the work to install water flow devices at the Pilloor master storage reservoir on Friday. Water supply engineers are in the picture.\n\nIn a first step towards ensuring equitable flow of water in areas where it distributes Pilloor water, the Coimbatore Corporation on Friday initiated the work to install water flow monitoring and reading devices.\n\nAccording to Mayor P. Rajkumar, the civic body will take up the work, as announced in the 2016-17 budget at Rs. 1.60 crore. It will install nine water flow monitoring devices and construct a control room that will keep tab on the water flowing in the Pilloor water supply project.\n\nThe civic body has engaged a private company, Lantrasoft, for the purpose. The company has executed similar work in the Mysuru City Corporation and has been successfully running it for the past three years, says A.N. Nagarajan, Director, Lantrasoft.\n\nMr. Rajkumar says that the Corporation will install nine flow monitoring devices on the inlet and outlet pipes at the Master Storage Reservoir (MSR) in Ramakrishnapuram and many service reservoirs.\n\nExecutive Engineer T. Gnanavel said that the civic body would install the devices in Maniakarampalayam, Ganapathy, Vilankurichi, Raja Street, Tatabad, Sidhapudur, Avarampalayam and VOC Park service reservoirs.\n\nMr. Nagarajan says that the devices, connected to wireless networks, will send details to the server in the control room, from where water supply engineers, concerned will get details concerning their area.\n\nThe supervising engineers and senior officials will get the complete picture.\n\nWith this device, the Corporation will also be able to identify leaks, he adds.\n\nMr. Rajkumar says that this is just the first phase of the project and the devices will be fitted to more service reservoirs to map the entire Pilloor water supply area and also the Siruvani-fed area. The system will be in sync with the 24x7 water supply project the civic body will implement soon. The current work will get over by April 20, right in time to monitor water supply during summer, Mr. Rajkumar adds.", 
    "section": "national", 
    "title": "Pilloor water flow to be monitored", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}