{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Police have retrieved from Oothumalai forest the decomposed body of a car driver from Genguvarpatti in Theni district.\n\nWhen the shepherds found a decomposed body of a youth lying in the forest near Oothumalai on Friday night, they informed the police about the corpse. As the police recovered the driving license of the deceased, he was identified as Jegadish of Genguvarpatti in Dindigul district.\n\nDuring investigation, police found that car driver Jegadish’s employer Nallamalai, a Kodaikanal-based financier, had collected deposits from a few customers from Oothumalai on the promise that he would give attractive interest for their investments.\n\nWhen Nallamalai failed to keep the promise, six investors contacted the financier over phone and urged him to return their money with the interest promised by him. Even as Nallamalai was dragging on, the investors, in a bid to bring the investor to their place, told him that they would invest Rs. 10 lakh more in his firm if he was able to come to Oothumalai with another attractive investment proposal. Believing their words, Nallamalai along with his car driver Jegadish came to Oothumalai a few days ago. On reaching the village, the investors took the duo to a secluded place near Oothumalai and asked Nallamalai to return their investments with the attractive interest promised by him.\n\nWhen he refused, it triggered heated argument and scuffle between the two sides. As Nallamalai shot one of the investors with his revolver amidst the scuffle, one Velladurai, who is working with the Department of Fire and Rescue Services, suffered a bullet injury. Agitated over this, the investors attacked Nallamalai and Jegadish in which Jegadish died on the spot while the financier managed to escape. Velladurai has been admitted to a private hospital here for treatment.\n\nHowever, the crime came to light after the shepherd spotted the body lying in the forest near Oothumalai. Police have picked up Nallamalai for interrogation.", 
    "section": "national", 
    "title": "Police recover decomposed body of car driver from Oothumalai forest", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}