{
    "author": [
        "R Rajaram"
    ], 
    "text": "A camera would capture ‘live’ the activities taking place 360 degrees\n\nAs the city sees demonstrations and other forms of protests besides public meetings at regular intervals, the police have put in place a technology-oriented monitoring system to have a closer watch on such activities taking place at public places in addition to deployment of police personnel.\n\nA police vehicle fitted with an advanced camera and equipped with other paraphernalia has been deployed to cover such activities in public spots for improved surveillance on wheels.\n\nThe sophisticated IP (internet protocol) camera has been fitted on one of the exterior portion of the police vehicle and connected to the monitor installed inside.\n\nFitted atop the vehicle, the camera would capture ‘live’ the activities taking place 360 degrees and the entire sequence could be watched in the monitor inside the vehicle. The mobile surveillance mechanism by deploying a camera-fitted vehicle was put in place recently to improve the efficiency of policing and monitoring system.\n\nThe vehicle would move to the designated spot where a public meeting or protest or other forms of stir was to take place to capture ‘live’ the activities taking place in that area till such time the event gets over. The entire ‘live’ video footages is stored in a digital video recorder installed inside the police vehicle which is also equipped with a UPS (uninterrupted power supply). This would help the police in taking CDs of such footages if needed to keep watching the activities numerous times as and when required. The system would enable the police monitoring the ‘live’ activities to pass on information to superiors in case of any suspicious activities to those deployed on the field.\n\nA select band of police personnel have been trained in this mechanism and provided with walkie-talkie sets. In one such mission, the mobile camera vehicle was deployed to cover a demonstration organised by the People’s Welfare Front at Srirangam on Friday. The vehicle was deployed as a precautionary measure during the Kuzhumayee Amman temple festival in Puthur area which attracted devotees a large number of devotees. Police strength in good numbers was deployed for the festival.\n\nWith the assembly elections round the corner, the mobile camera vehicle is expected to be deployed for many missions in the days to come to cover poll-related meetings also.", 
    "section": "national", 
    "title": "Police employ new system to monitor public events", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}