{
    "author": [
        "Staff Reporter"
    ], 
    "text": "People’s Welfare Front cadres staging a demonstration in front of the Collectorate in Nagercoil on Friday, demanding relaying of damaged roads and replacement of damaged TNSTC buses in Kanyakumari district.\n\nPeople’s Welfare Front (PWF) cadres staged a demonstration in front of the Collectorate here on Friday, urging the government to safeguard all waterbodies in Kanyakumari district by desilting and removing encroachments from them.\n\nPresiding over the demonstration, N. Murugesan, convenor of the PWF, said that the direct procurement centres (DPCs) for paddy opened by the district administration in Thalakulam,Thazhakudi, Therur, Ozhiginaseri, Kurunthancode and Tirupathisagaram recently did not have the minimum facilities such as manpower and weighing machines.\n\nThe paddy brought to these centres with over 18 per cent moisture content was not procured. Since the district had a unique climatic condition with more moisture, the paddy with more than 20 per cent moisture content should be procured, he said.\n\nMr. Murugesan said that roads in the district were in a bad shape. The district administration should take appropriate action to relay damaged roads and replace old buses with new ones. He also appealed to the Central and State governments to prevent further fall in rubber prices.\n\nState executive committee member of the Communist Party of India (Marxist) S. Noor Mohamed inaugurated the demonstration.\n\nCPI district secretary S. Isakkimuthu, Marumalarchi Dravida Munnetra Kazhagam district secretary S. Vetrivel, Viduthalai Chiruthaigal Katchi Kanyakumari district sectaries P. Tirumavendhan (East) and Mathur Jayan (West) spoke. CPI State deputy secretary M. Veerapandian offered the valedictory speech. Former MP A.V. Bellarmin, former MLA R. Leema Rose and others participated.", 
    "section": "national", 
    "title": "“Repair damaged roads, replace TNSTC buses”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}