{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Work to fix breaches and damage to lakes and channels in Chennai affected by fund crunch\n\nMany waterbodies and channels that suffered heavy damage during last year’s torrential rains are still awaiting restoration for want of funds.\n\nIt may be recalled that breaches in several lakes — particularly those in southern suburbs — led to the inundation of neighourhoods in the city. Though the Water Resources Department (WRD) managed to temporarily plug breaches in these lakes and reservoirs, it continues to struggle to take up measures to restore the waterbodies and channels, due to inadequate funds.\n\nBunds of several waterbodies in Tiruvallur and Kancheepuram districts were severely affected and breaches have been plugged with sand bags and casuarina poles.\n\nFor instance, the floodgate walls of Chembarambakkam reservoir and bunds of waterbodies in places such as Velachery, Manimangalam, Nemam and Ayanambakkam have developed cracks that have been temporarily arrested.\n\nSources in the WRD said they were unable to take up works to restore the damaged causeways and breaches in river banks as they were yet to settle funds for the temporary works completed by the contractors.\n\nOf the nearly Rs.180 crore worth works taken up across the State, only funds of about Rs. 50 crore has been sanctioned so far.\n\nIn this, works in Tiruvallur and Kancheepuram districts account for nearly Rs.60 crore.\n\nThe department is unable to rope in contractors to do repair works as there is hesitation among them to execute the projects without funds. Restoration works have to be initiated immediately in 100 locations in and around Chennai and neighbouring districts.\n\n“We managed to save water resources in several places and also prevent further flooding due to the timely temporary measures. Several lakes are 70 per cent full even now. But, much needs to be done to fix severe damages,” said a source.\n\nOf Rs.180 crore worth works taken up, only funds of about Rs. 50 crore has been sanctioned", 
    "section": "national", 
    "title": "Restoration of waterbodies slows down", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}