{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "On Thursday afternoon, three schoolgirls were admitted to the Institute of Child Health, Egmore after they reportedly drank water mixed with lice medicine.\n\nThe girls, studying in class VI of a Chennai Corporation school in the city, were rushed to the hospital by their school teacher when they fell sick.\n\nThey were first taken to a nearby government hospital, and then referred to Egmore.\n\nAll three have been treated and are now undergoing counselling, doctors at the hospital said. However, why the girls decided upon taking this step is unclear.\n\nAbout a month ago, claimed Roopa*, 12, one of the girls, two of her classmates decided to take a mobile phone that they saw on the window ledge of a house a few streets away from their homes. The phone was hidden in Roopa’s schoolbag.\n\n“But the man whose phone it was found out, came, and shouted. We returned the phone,” she said.\n\nHowever, a part of the phone or its pouch was missing, apparently thrown away by her classmate Saranya*, recollected Roopa.\n\nAfter some trouble though, the issue seemed more or less resolved.\n\nBut, a few days ago, Roopa said, there was a minor argument between a few of her classmates. “Our teacher shouted at them,” she said. The man whose mobile phone was stolen also reportedly shouted at the girls again.\n\nThough it is unclear why, Saranya and Venilla*, according to Roopa, decided they would take lice medicine. On Wednesday, one of the girls brought the lice medicine from home. The girls drank a solution of it at lunchtime.\n\nPrema*, an 11-year-old friend of theirs, curious about the ‘juice’ her friends were drinking, wanted to try it too.\n\n“I didn’t know what it was. I asked them to give me some of the ‘milk’ and drank it,” she said. Roopa too, took one mouthful, she said.\n\nWhile Venilla seemed to be fine, Roopa said, the other three fell sick, with the most affected being Saranya. “My stomach hurt and my legs were trembling,” said Roopa. The girls were treated at the hospital.\n\n“What they took was probably a carbamate – an organo-phospherous insecticide.\n\nSaranya* was not in good shape at first, but all three of them have recovered,” said a senior hospital official.\n\nOne horrified mother said she had no idea this had happened, and had at first thought it was a case of food poisoning.\n\n“The mobile phone issue had been resolved. I don’t know why they did this,” she said. A father of one of the girls said none of them were giving a clear reason as to why they had done this.\n\nThe students were rushed to the hospital and later referred to the Institute of Child Health, Egmore", 
    "section": "national", 
    "title": "Schoolgirls consume chemical, 3 hospitalised", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}