{
    "author": [
        "T Madhavan"
    ], 
    "text": "While a DJ Night, starring Ireland’s top female DJ Kaila Troy, made an impact on students on Friday night, it was Devi Sri Prasad, an Indian music composer, singer, and director, who took centre stage at a late-evening show on Saturday at SRM University, Kattankulathur.\n\nThe music director was at his best presenting the super hits he had produced for the screen at Milan 2016, the University's annual fest. The open air theatre was choc-a-bloc with audience clapping and dancing all the time. There was the ceaseless roaring of the crowd. The artist enraptured everyone with his ebullient personality and power-packed performance. He indulged the crowd and ensured they had fun. To sum it up, it was a day for music, knowledge-sharing and skill exploring competitions.\n\nSurrounded by hair-raising rhythms set to stories that only the band members could tell, the audience violently shook their heads . “There is an appeal in the rawness, it all seems so divine,” said an ecstatic P. Prasad from Valliammai Engineering College.\n\nAero-modelling championship valedictory was the highlight of the morning. Ponraj Vellaichamy, Technical Advisor to former President, A.P.J. Abdul Kalam, spoke about the ongoing work on the Tamil book, ‘Puyalai Thaandinal Thendral’ which explains the vision he and Dr. Kalam had for Tamil Nadu. He awarded the A.P.J. Abdul Kalam Trophy and a cash prize of Rs. 25,000 to Sanjay from P.S.G University.\n\nEvents like the British Parliamentary Debate showcased a fierce battle which was a reflection of how the British government is dealing with the migrant crisis and whether Britain should remain in the European Union or not.\n\nIn ‘The Presidential Campaign’, participants were given extensive details about the state of Genova, a country in need of a new leader to take it out of its present peril. Raghav Anand from VIT Vellore and Hariharan from SRM were adjudged winner and runners up respectively.\n\nTheatre\n\nThe ever so theatrical dramatics domain began the day with Broadway. The first prize was won by New College, which performed a classical mime and the second prize by Crescent Engineering College which performed a shadow play consisting of a melange of neon lights and mime.\n\nThe ever exciting choreo night took place and a total of 15 teams flaunted their dance skills on stage. .\n\nDeadpool, Ironman, Lord of the Rings, Game of Thrones. You name it and they had it. The Environment Domain set up their hand made bookmarks stall in Java Green, with funds from the proceedings going towards the cleaning of the area near the back gate of SRM.\n\nSports domain had several players. It wasn’t just the buildings on campus that were abuzz with activities, the paths in the varsity too were vibrant with the Creative and Arts domain conducting their event ‘Road Graffiti’ based on the theme ‘Violence Against Women’.", 
    "section": "national", 
    "title": "Serious debates and musical treat mark Day 3 at Milan’16", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}