{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector S Natarajan addressing representatives of political parties, returning officers and police officials on model code of conduct for the May 16 Assembly elections at the Collectorate in Ramanathapuram on Saturday.Superintendent of Police N. Manivannan is seen; (bottom) workers removing banners and hoardings.— Photos: L. Balachandar\n\nCollector and District Election Officer S. Natarajan addressed representatives of recognised political parties, election staff and police personnel and sensitised them on the need for strictly adhering to the model code of conduct for the May 16 Assembly elections.\n\nChairing a meeting with Superintendent of Police N. Manivannan here on Saturday, the Collector advised the political parties to deface wall writings and remove banners and flex boards by Sunday and obtain prior permission for organising election rallies and use of vehicles for election purposes.\n\nThe Collector told the representatives of the political parties to organise meetings and rallies at the permitted venues and only after obtaining prior permission from the concerned Returning Officers (ROs). The ROs should accord the permission within 24 hours after the receipt of the applications, he said.\n\nThe political parties could seek the permission through online, he said adding general public could lodge complaint on any violation of MCC through the toll free number 18004 257038, he said.\n\nThere were 1,307 polling stations for four Assembly constituencies in the district and 125 of them had been identified as sensitive, critical and vulnerable, the Collector said. Four video viewing teams and four video surveillance teams had also been formed to ensure that the parties followed the MCC, he added. A total of 6,750 polling staff and 1,845 police personnel had been drafted for the election work, he said adding 2,500 Electronic Voting Machines and 1,674 Control Units had been checked and kept in a state of readiness.", 
    "section": "national", 
    "title": "Stick to model code of conduct: Collector", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}