{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Those employed under Mahatma Gandhi National Rural Employment Act for 100 days work in a year could approach the District Legal Services Authority if they faced problems in getting employment or wages, Assistant Sessions Judge S. Ganapathisami said.\n\nAddressing a legal aid literacy camp on ‘Poverty alleviation,’ organised by the DLSA and Rotary Club of Golden Ramanathapuram at Melavalasai near here on Friday, he said that the employees could approach the legal services authority and redress their grievances by availing free legal aid.\n\nThe Assistant Sessions judge, who is also the secretary of the DLSA, said that poverty could be alleviated only through education and poor people could seek admission for their wards in private schools as a matter of right, as 25 per cent of the seats were reserved for them under Right to Education Act.\n\nSpeaking at the function, Chief Judicial Magistrate J. Chandran said that half of the problems could be addressed if the people were educated. People could come out of the poverty line if they were educated and asserted their rights, he said.\n\nThe aged poor who faced problems in getting Old Age Pension (OAP) could approach the legal services authority for relief, he said adding the unemployed graduates could also approach the authority for getting bank loans for starting their own ventures.\n\nPeople could approach the Alternative Disputes Resolution Centre (ADRC) and attend lok adalts to settle their pending and pre-litigation disputes.\n\nThey could avail free services of advocates if they approached the legal aid centre, he added.\n\nBenefits detailed\n\nJudicial Magistrate II N. Veluchamy, detailing the benefits available for workers in the unorganised sector, suggested that they could avail the benefits if they registered their names with the welfare board.\n\nSenior Administrative Officer P.N. Muraleedharan, District Bar Association president K. Gunasekaran and Secretary, Rotary Club of Golden Ramanathapuram, G. Kalidasan, were present on the occasion.", 
    "section": "national", 
    "title": "Stress on importance of education", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}