{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A student in action at the Mini Dirt Bike 2016 competition at Kumaraguru College of Technology in Coimbatore on Saturday.\n\nForty six teams from Coimbatore, Chennai, Tirunelveli, Trichy and Salem participated in the second edition of the KCT Mini Dirt Bike 2016 contest organised by the Department of Automobile Engineering of Kumaraguru College of Technology, on Saturday. It was jointly organised by the SAEINDIA collegiate club and the automotive association of the college.\n\nThe main objective of the event is to test the engineering skills of students in design, fabrication and marketing. Students brought the mini dirt bikes that they designed and fabricated for the contest that was conducted in two categories - viz. 60 cc and 80 cc - to test the mettle of students.\n\nThis contest was conducted in three rounds to decide the top five teams for the final race. Head of the department C. Vasantharaj said that in the first round a team of experts inspected the bikes’ design, fabrication, rigidity and innovative features and if it met the parameters for the category.\n\nIn the second, the brake and acceleration of the vehicles were tested, following which student racers rode their bikes on the 1.7-km dirt track with challenging hurdles, jumps and quick turns to test the structural rigidity and endurance of the bikes and that of the riders as well. The riders had to cover two laps in the track.\n\nBased on the combined scores of the three tests, the top five leading teams participated in the final race where the riders had to cover two laps in the dirt track.\n\nThe race was conducted separately for both the categories. The winning teams bagged total cash prizes to the tune of Rs. 50,000, medals and trophies. The best rider, innovations in the bike and best aesthetic bike were also awarded.\n\nWinners\n\n80 cc category: winning team - G Tunes, SNS College of Technology; runner up – Spark Ignitorz, SNS College of Technology; best rider – Pugazhenthi, Team Race to Prove, Karpagam Institute of technology.\n\n60 cc category: winner – Team Dirt Cats, Akshaya College of Engineering and Technology; runner up – Team Vernieuwers, SNS College of Technology; best rider – K. Hemchander, Team Vernieuwers, SNS College of Technology.\n\nInnovation award – Team Crank Booster, Dr. NGP Institute of Technology, Coimbatore; best aesthetics bike award – Team G Tunes, SNS College of Technology.", 
    "section": "national", 
    "title": "Students exhibit technical and riding skills at Mini Dirt race", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}