{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Two visually challenged entrepreneurs, who were recently selected for a State award, were felicitated at a function organised by the Confederation of Voluntary Organisations and Tirunelveli District Special Schools here on Friday.\n\nB. Muruganantham, General Manager, Bharat Sanchar Nigam Limited, felicitated E. Muthukumar (29) and his partially sighted brother E. Nainar (27), who bagged the State award for successfully running a two-wheeler workshop at Maruthakulam near here. They received financial assistance from a nationalised bank with the help of District Disabled Rehabilitation Office.\n\nWhen the brothers came to the Collectorate on March 4, 2009, in search of help along with a two-wheeler assembled by them with spare parts collected from junk, District Disabled Rehabilitation Officer T. Manohar had a chance meeting with them. He gave a patient hearing to their plight. Though Mr. Muthukumar lost his vision at the age of 10, he started a ‘two-wheeler clinic’ at Maruthakulam with the help of Mr. Nainar, who lost vision in his right eye.\n\n“Though my brother lost his vision, he trained me in repairing two-wheelers,” recalls Mr. Nainar, who is likely to lose his vision in the other eye also, according to ophthalmologists.\n\nSince the visually-challenged brothers found it difficult in handling standard two-wheelers, they started collecting discarded spare parts, including engine of a moped, from the junk to make a customised motorcycle that consumes petrol and kerosene mixed in 1:1 ratio and can be started with just rotating the back wheel with the toes.\n\nAs the brothers wanted assistance to expand the workshop, they sought Mr. Manohar’s help. A nationalised bank offered subsidised loan and the brothers expanded their workshop which is popular among villagers and students of a nearby engineering college.", 
    "section": "national", 
    "title": "These two brothers are special entrepreneurs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}