{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two persons who were among the gang arrested by the city police for abducting a Perur- based gold businessman’s family and holding them hostage in a lodge at Chinniyampalayam in Coimbatore were detained under the Goondas Act on Saturday.\n\nPeelamedu Inspector J.K. Gobi said that the accused Paramasivam (51) of Thoothukudi and Maharajan (36) of Kovilpatti were detained under the act by City Police Commissioner A. Amalraj. The detention order was served to them at the Coimbatore Central Prison, where they are lodged since their arrest. Search was underway for Johnson, the last of the six accused in the abduction case.\n\nTwo die of snake bite\n\nTwo women who were bitten by snakes in separate incidents died at the Coimbatore Medical College Hospital on Friday. Vadavalli Police said that in the first incident B. Rajathi (35) of Manoj Nagar in Veerakeralam was walking in front of her house on Thursday night when she was bitten by a snake. She was admitted to the CMCH, she died there on Friday evening.\n\nIn another incident, Perur Police said that V. Theivamani (45) of EB Quarters at Mathampatty was bitten by a snake when she was plucking fruits in a nearby farmland in the evening on Friday. She was admitted to CMCH where she died the same night.\n\nHouse burgled\n\nThe house of K. Narayanasamy (42) of Chandra Mani Nagar in Periyanaickenpalayam was burgled on Thursday. The police said that around 13 sovereigns gold jewellery and Rs. 15,000 was stolen from the house. Periyanaickenpalayam Police was investigating the case.\n\nChild drowns in tank\n\nTwo-year-old H. Krish Nayak of S.S. Garden at Kapikadai near Kovilpalayam died after drowning in a ground level water tank near his house on Friday. Kovilpalayam Police said incident occurred when the boy was playing near the house in the afternoon while his mother was preparing food. A neighbour saw the boy drown in the water tank and on her alert the victim was rushed to a private hospital where he was declared as brought dead.\n\nMan run over by bus\n\nAn unidentified man aged around 45 to 50 years died after he was run over by a government bus near Ukkadam on Friday night. The police said that the victim was a beggar and was sleeping on the platform near Ukkadam bus depot, when the bus running between Ukkadam and Mayilampatti that came in the reverse gear ran over him.", 
    "section": "national", 
    "title": "Two detained under Goondas Act", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}