{
    "author": [
        "M K"
    ], 
    "text": "Though the Fire and Rescue Services Department is equipped with the latest equipment the department is running short of firemen (fire fighters), due to a freeze on the recruitment by the Tamil Nadu Uniformed Service Recruitment Board (TNUSRB) since 2013.\n\nOf the sanctioned strength of 876 firemen in the 64 fire and rescue and two rescue stations one each at Hogenakkal and in The Nilgiris in Western Region, there are 335 vacancies, due to retirements and opening of new stations. There is also a heavy shortage of drivers as not many are interested in taking up the job in the department.\n\nBut for involvement of the public and overstretched existing manpower, it would be impossible to fight fires and carry out rescue operations. Field level personnel said that more trained firemen would facilitate quicker rescue operations and fire fighting else they are forced to wait for men from other stations to be diverted to the scene.\n\nCoimbatore District has a sanctioned strength of 134 firemen in the eight stations in the district and 75 posts are lying vacant, taking the vacancy to 55 per cent.\n\nRural stations such as Valparai and newly opened Annur have only one fireman – against the sanctioned strength of 11 per station. The vacancy is made up by deputing personnel from other stations where the vacancy is not so bad.\n\nThe situation is worse in The Nilgiris, where there are 35 vacancies in the sanctioned strength of 61 firemen. A senior officer said that the sanctioned strength of drivers in that district is 22 and 15 are vacant.\n\nThere is nearly 50 per cent vacancy of firemen in Erode and Tirupur and more than 40 per cent vacancy in Krishnagiri, Dharmapuri and Namakkal.\n\nAmong the nine districts in this region only Dindigul and Salem are in a comfortable position with only 10 and 15 per cent firemen vacancies, respectively. But, a section of the men here are deployed on deputation in the districts that have more vacancies. Vacancy of drivers is high in Erode, The Nilgiris and Tirupur.\n\nTop department officials said that even if the TNUSRB announces recruitment now, it would take about a year for the recruitment and training the personnel and for them to join the stations as firemen. “By then more firemen would have retired and vacancies are bound to go up,” an official here said.\n\nSenior department personnel expressed the need for a reserve force for the department like the Armed Reserve for the city and districts police units across the State - who are deployed for various field level policing duties in case of shortage of manpower in the police stations.", 
    "section": "national", 
    "title": "Western region hit by severe shortage of fire fighters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}