{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Dheeran Kongunadu Munnetra Kazhagam (DKMK) will join as an allay of a party that will strive hard for the development of Kongu region, the party’s founder president ‘Best’ S. Ramasamy said.\n\nFlood-hit\n\nAddressing a public meeting organised here recently he said: “all political parties raised their voice for relief for flood hit Cuddalore, Chennai, Kancheepuram and Thoothukudi Districts.\n\nDrought relief\n\nBut, no party has voiced for drought relief for Coimbatore, Tirupur, Erode, Salem and Karur where farmers are badly affected due to the failing monsoon.,”\n\nHe said he was hopeful that such issues would be given the due importance by the major political parties in the coming election.\n\nDemands\n\nHe also released 23 demands (pertaining to this region) to be met by the party with whom they should join hands for the elections.\n\nResolutions passed at the party conference included expediting Avinashi-Athikadavu Ground Water Recharge Scheme, implementing the GAIL gas pipeline laying project without affecting farmers, widening Coimbatore-Pollachi Road into a four lane road, expediting Smart City project for Coimbatore and putting an end to the man-elephant conflict in Coimbatore.\n\nFarm loans\n\nWaiving farm loans and protecting farmers and industries specific to the region, ring roads for all towns and rail connectivity within the region and permitting farmers to tap toddy till total prohibition was brought to force in the State were also among the important demands of DKMK.\n\nSankari Fort\n\nMr. Ramasamy also sought declaration of the birth anniversary of Deeran Chinnamalai (April 17) as a government holiday and to convert the Sankari Fort in Salem District where he was hung to death as a tourist spot.", 
    "section": "national", 
    "title": "Will ally with party that will work for Kongu region: ‘Best’ Ramasamy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}