{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Work is on in full swing for the Rs. 27.2-crore Parson Valley Scheme - III to improve water supply in Udhagamandalam town. The work that began in January this year and scheduled to be completed in February 2017 is carried out by the Tamilnadu Water and Drainage (TWAD) Board in two phases – through two contractors.\n\nA senior municipal official said that one of the contractors is carrying out the works at Parson Valley and establishing the treatment plant, which has already begun. The other contractor is working on the tank, sump and pipeline works in Udhagamandalam Town.\n\nPipes for the 10-km-long conveying main from Parson Valley to Theetukal has arrived and pipes have been laid for a stretch of five km. In the town, laying of the distribution lines has been competed on Ettines Road for a stretch of 500 metres. Pipe-laying works are underway at Thitukal for 600 metres, Nondimedu for 500 metres, Kodapamund for 420 metres and Bedhams Road for 400 metres. The digging of roads and footpaths for a stretch of 28 km in the town as part of the scheme will be done in a phased manner.\n\nOn completion of the works, the water supply to the town is expected to increase from the existing 12 million litres per day to 17 million litres a day. This would, in turn, increase the water supply per person from the existing 100 litres to 105 litres a day (or lesser when there is a damage in the pipeline) to 135 litres a day.\n\nOnce the pipeline works are completed in the town, eight of the roads will be laid as part of an existing scheme. While patch work will be carried on the more than 35 other roads, they could be laid afresh only when funds are sanctioned by the State Government, as part of the 150th year of the formation of Udhagamandalam Municipality. As part of the 150{+t}{+h}year facelift project for the town, the local body sought Rs. 128 crore for carrying out various development works. This includes Rs. 30 crore for relaying roads in the town for the roads that have been dug and will be dug for Parson Valley Scheme-III. This scheme is still at the proposal stage and it could get sanctioned only after the elections.", 
    "section": "national", 
    "title": "Work under way for Parson Valley Scheme-III", 
    "subsection": "tamilnadu", 
    "date": "2016-03-06"
}