{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The police have registered 14 cases against various political parties for poll code violations so far in the four assembly segments. Majority of the cases related to non removal of flag posts, and not removing graffiti.\n\nThe cases were registered based on complaints from flying squads and officers on poll duty. The police sources said that eight cases were in Thondamuthur, and five in Coimbatore South.\n\nThe cases were registered against AIADMK, DMK, DMDK, BJP, Samathuva Makkal Katchi, Manithaneya Makkal, Katchi, Popular Front of India, and communist parties.\n\nSections 4 and 4-A (1)(a) (1)(b) of the Tamil Nadu Open Places Prevention of Disfigurement Act 1959 have been invoked against them.Arms\n\nOf the 893 licensed gun holders in the city, 275 have deposited their guns at the local police stations and authorised arms centres in the city till Friday. The police said that the Election Commission had exempted some licensed gun holders from surrendering their weapons.\n\nDeputy Commissioner of Police (Law and Order), Nisha Parthiban, said that members of the National Rifle Association of India taking part in competitions, personnel on security duty for banks, ATMs and cash transporting vehicles, and those claiming to be under threat need not surrender their weapons.\n\n“They should make a representation to the City Police Commissioner –the licensing authority – to get permission to hold back their weapons,” she said.\n\nThe district administration had thus far registered 40 cases for poll code violations in the 10 Assembly constituencies in the district. A release here has said that 19 cases had been registered for violations in the Thondamuthur Assembly constituency – the maximum, followed by five each in Pollachi and Kavundampalayam Assembly constituencies.\n\nCash seized\n\nThe election officials in The Nilgiris on Saturday seized Rs. 3.61 lakh from four persons in Vandicholai, Katteri checkpost and Kattabettu junction, said a release from the district administration here. Thus far the officials had seized Rs. 60.21 lakh.", 
    "section": "national", 
    "title": "14 cases against political parties", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}