{
    "author": [
        "Vishal Menon"
    ], 
    "text": "It’s easily the most exciting new love angle in Tamil cinema, and one you least expect to see in a film tiled Mapla Singam . I’m talking about the kind of romantic relationship where it’s the girl who gets to call the shots. The kind we saw in films like Vinnaithaandi Varuvaayaa , Engaeyum Eppothum , and most recently, in Raja Rani . It’s a nice little departure from love stories driven by men, their ambitions, and their primal needs, with women being mere facilitators. And surprisingly, Mapla Sigham has not one, but two such women and their love stories. The first is Shylu (Anjali), a criminal lawyer who’s also the ‘man of her house’. When goons enter her house to beat up her elder brother, it is she who comes to his rescue instead of it being the other way around.\n\nThe second is the daughter (Madhumila) of a caste-based political leader (Radha Ravi), who wants to work after she’s completed her masters — the only one to do so in her family. So, when she runs away from home, she’s not exactly eloping with her lover. She’s just gone to Coimbatore to attend an interview.\n\nEven her love story is the result of her pursuing him with dozens of love letters and cards. It’s in the middle of these strong women that we find Anbu (Vemal), someone who specialises in splitting up couples from different castes. Anbu’s the heir apparent to his uncle’s school of divisive politics, and ascribes to his policy of women from his caste not needing to work, including his educated cousin. His entourage includes a white guy (and also Soori and Kaali Venkat), who gives us an outsider’s perspective into caste and their brand of politics.\n\nIn one scene, Soori asks the white guy where his lover hails from, to which he answers America. Soori responds saying, “ Veli ooru kariya irundha prachana illai. Vera jadhiya irundha dhan prachana .” (It’s ok if you love someone from another place, but we won’t tolerate it if she is from another caste.)\n\nBut all that’s set to change the moment Anbu falls for Shylu. She’s from another caste, and his entire belief system (and political future) is at stake if he is to pursue her. It is here that he begins to see things from a woman’s point of view.\n\nIt is also here that he abandons his vellai veshti vellai sattai for colour and also for progress.This is where the film’s inherent charm lies. I only wish the makers had been able to see it too.\n\nWhile they get it right in coming forward to handling such a delicate subject with light-handedness, you only wish they’d written better scenes. Every scene which is primed for comedy is hammed by unfunny dialogue from Soori, one after another.\n\nWhile the film’s main conceit is itself ripe for humour, one wonders why the film deviates into a thoroughly tedious election sub-plot with Anbu fighting Shylu in a local election.\n\nIt not only removes you from the only interesting part of the film, but it also makes you wonder if all that worked for you so far was just accidental.\n\nMapla Singam isn’t disappointing merely because the jokes don’t work, it disappoints because it would have been great to see a comedy with progressive ideas doing well in the hinterland.\n\nvishal menon\n\nMapla Singam\n\nGenre:Comedy\n\nDirector:Rajasekhar\n\nCast:Vemal, Anjali, Radha Ravi, Soori\n\nStoryline:A caste-based politician falls in love with a girl from another caste", 
    "section": "national", 
    "title": "A flat comedy with serious ambitions", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}