{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Scores of women belonging to different age groups and from different walks of life had a gala time sprinkled with some food for thought with a variety of events at the day-long World of Women (WoW) celebration organised here by The Hindu on Saturday.\n\nThe day started with ‘Heels on Wheels,’ a car rally-cum-treasure hunt flagged off by M.V. Muthuramalingam, Chairman of Velammal Group of Institutions, at the Velammal Medical College Hospital and Research Institute (VMCHRI) . The participating women had a fun time as they were made to navigate through nine pit-stops to get their clues with an activity waiting for them at each one of them.\n\nLater, a bike rally from Gandhi Museum to Fortune Pandiyan Hotel was flagged off by B. Kalpana, Director of Guru Hospitals, in which around 50 women participated. A large number of women had gathered at the hotel for the events that followed in the day. Before the celebrations came to a brief halt for lunch, the participants took part in a treasure-hunt organised at the hotel. They also participated in a free medical check up and blood donation camp. The participants were shaken up post-lunch by the electrifying Parai performance by the Dindigul-based all-women Sakthi Porparai Group. The group kept the participants on their toes, literally, as they started dancing to the rhythms. Soon after the performance came to an end, a laughter-riot began with the performance of stand-up comedienne A. Sasikala.\n\nAs the fun-filled sessions came to an end, a sober panel discussion on women empowerment followed with participation from J. Charukesi, Postmaster General, Southern Region, Rajkumari Jeevagan, Chairperson of Women Entrepreneurs (WE), Helen Christina of Sri Meenakshi Government College for Women, Chitra Ganapathy, Managing Director of Kadambavanam, Hema Sathish, Managing Director of Devadoss Multispecialty Hospitals, and S. Selva Geetha, radio jockey. The session, moderated by Soma Basu, Deputy Editor, The Hindu Metroplus, explored the life experiences of woman leaders and what made them reach the heights they were in today. The discussion revolved around what women could do to empower themselves.\n\nThe day-long World of Women event was sponsored by VMCHRI and powered by Sri Jeyaprabha Jewellers. Canara Bank, Twin Birds, Sprinkle Salt and VVD Oil were the associate sponsors. Gift sponsors were SVS Kadalai Maavu, Sundar Tyres, Roshan Bags, VLCC and Naturals. Fortune Pandiyan Hotel was the hospitality partner and the radio partner was Hello FM, with Sagar TV as channel partner. The TV branding partner was Ad Inn Advertising Agency and the event was organised by Rise Advertising.", 
    "section": "national", 
    "title": "A fun-filled World of Women", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}