{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Any film with the word “ kadhal ” in the title is usually served in one of three flavours — a general romance; its cutesy variant, the rom-com; or what might be called the rom-trag, where boy and girl jump off a cliff, or are hacked to pieces or . Nalan Kumarasamy’s Kadhalum Kadanthu Pogum is (d) none of the above.\n\nThe story gets going when Yazhini (Madonna Sebastian) loses her IT job in the recession. She has to give up the posh high-rise apartment she shared with roomies and move into a matchbox of a flat, past a low entrance that bears the warning: Kunindhu sellavum . It’s a constant reminder of just how much she’s come down in life. Another reminder lives in the opposite flat, a rowdy named Kathir (Vijay Sethupathi). A less adventurous film would chart their unlikely love story— opposites attract, et cetera. Kadhalum… , though, invites us to ponder this question: What kind of relationship can there be between a girl who reads A Brief History of Time and a guy who’s just been released from jail? This is, in many ways, an anti-romance. It’s no accident that the film Yazhini and Kathir end up watching on TV is... Kadhalikka Neramillai . Who has time for love?\n\nThere are other things to think about. Yazhini needs a job right now, but she also harbours a vague ambition that she cannot put into precise words. Kathir says that’s okay. Goals should not be easily understood. The film is filled with these lovely little non-dialoguey half-thoughts, which crop up when real people converse. Kathir has a goal too. He wants to own a bar. And till that happens, till he gets rich, he’s got to watch what he spends. Note the scene where he pays for Yazhini’s breakfast and later asks her to pay him back. It isn’t just a funny moment about a man who wanted to show off in front of the hotel manager. It also showcases his desperation.\n\nKadhalum… , then, is about two ships— or maybe we should say catamarans— passing in the night, on a stormy sea. And we get an answer to what kind of relationship could exist between them. Kathir and Yazhini become each other’s support system, a kind of lifeline — for they seem to have no one else to turn to.\n\nThere’s a lot of nice filmmaking here—though how much is from the South Korean original, My Dear Desperado , I do not know. Yazhini’s entire arc with her ex is so delicately handled, we barely notice it. But apart from a handful of scenes, I wasn’t particularly drawn to anything or anyone. I felt nothing for Yazhini when she was humiliated by a couple of interviewers. Kadhalum… takes a very long time to find its rhythms, and the first half, especially, just sits there, animated solely by Santhosh Narayanan’s score. The composer may be getting too tied down to a sound — lush, quirky, local — but at least it throbs with life.\n\nThe casting doesn’t help. As much as I appreciate Vijay Sethupathi seeking out varied roles and using his star power to lure audiences to films they may not see otherwise, his I-can’t-be-bothered persona doesn’t let us into Kathir’s head at all. Madonna Sebastian is a nice presence, but she looks too vacuously model-pretty.\n\nAs second films go, Kadhalum… has to count as a letdown, but give Nalan Kumarasamy this much—he hasn’t made Soodhu Kavvum II , and he hasn’t gone commercial with a vengeance either.\n\nHe isn’t just reshaping the Kollywood romance here. He’s also reshaping the sarakku scene, by having the hero get drunk with the heroine, instead of a male friend. Hearing the song “Oru oorula orey oru veeran” over Kathir striding into a bar to bash up some goons, we expect macho fireworks, a fight scene worthy of that song, worthy of a hero. But Kathir gets beaten up instead.\n\nWalking out, I wondered if this angle wouldn’t have made for an interesting movie on its own, without the crutch of the South Korean romance. But I have to admit that the Kathir-Yazhini scenes accrue weight towards the closing portions, so much so that we find ourselves completing their stories in our heads during the drive home.\n\nJust as the film comes to an end, we feel it’s beginning.\n\nbaradwaj rangan\n\nKadhalum Kadanthu Pogum\n\nGenre:Romance\n\nDirector: Nalan Kumarasamy\n\nCast: Vijay Sethupathi, Madonna Sebastian\n\nStoryline:The story of two people, who are poles apart, sharing a peculiar relationship", 
    "section": "national", 
    "title": "A letdown, but not a lazy one", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}