{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The State government should initiate steps to accord citizenship to the inmates of Sri Lankan refugee camps, said R. Murali of the People’s Union for Civil Liberties (PUCL) here on Saturday.\n\nReleasing the report of a fact-finding team that visited the Uchapatti refugee camp near here following the death of S. Ravindran (48), a refugee, Dr. Murali regretted that all political parties in the State were concerned about Tamils living in Sri Lanka and did not look at the pathetic condition of those in refugee camps.\n\nNow that a new generation of inmates had come up in the form of children of those admitted to the camps in the 1970s and 80s, it was time to consider according citizenship to them, he said. “The new generation refugees speak the Madurai dialect,” he added.\n\nC. Mathivanan of the All India People’s Forum said that all political parties of Tamil Nadu should clearly spell out their stand on according citizenship for Sri Lankan Tamil refugees in their election manifesto.\n\nHe sought a compensation of Rs 25 lakh for the family of Ravindran.\n\nThe government should meet the medical expenses of his son, Pradeepan, who is suffering from haemophilia. He wanted the government to withdraw the Q Branch police from refugee camps.\n\n‘Give up roll call’\n\nA. Santha, former Professor, Madurai Kamaraj University, said that the practice of roll call should be given up.\n\nThreatened\n\nRavindran climbed up a high tension electric tower on March 6 after Duraipandian, a retired Revenue Inspector employed on consolidated payment, threatened to delete the name of his son, Pradeepan, who was not being present during the roll call on the first Sunday.\n\nRavindran informed the retired official in charge of taking roll call that his son was not present as he was being treated at the Government Rajaji hospital for his ailment.\n\nWhen Duraipandian refused to entertain his request, Ravindran climbed up the tower and got electrocuted.", 
    "section": "national", 
    "title": "Accord citizenship to Sri Lankan Tamils living in camps: PUCL", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}