{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The ambitious Noyyal river restoration project, ‘Noyyalai Nokki,’ involving various stake holders in all the four districts through which the river flows will begin at Kooduthurai at Madhvarayapuram, near Alandurai, on March 26.\n\nManaging trustee of Siruthuli, Vanitha Mohan, told reporters here on Saturday that Anna Hazare, who was instrumental in upgrading the ecology and economy of Ralegan Siddhi village in the drought prone Ahmednagar district, in Maharashtra, will inaugurate the restoration drive.\n\nAs part of the initiative, water collected from various sacred rivers in India will be poured into Noyyal at its originating point.\n\nMs. Vanitha Mohan said that restoring the 160 km long river and the 34 feeding streams and canals (of which only four exist) too would be carried.\n\n“Noyyal is encroached upon by farmers and government bodies. It is a dumping ground for debris and effluents.\n\nAdding to it is illegal sand mining in a big but silent manner,” she added.\n\nShe said that the Chief Engineer of the Public Works Department has agreed to open a water restoration organisation in Coimbatore for Noyyal River area to play an active role in the river restoration work.\n\nSiruthuli chairman S.V. Balasubramaniam said that the Noyyal River Restoration Federation (Norfed) promoted by Siruthuli in Coimbatore was formed with the support of those from three districts.\n\nChairman of Norfed C.R. Swaminathan said that the river runs through 68 km in Coimbatore district, 47 km through Tirupur, 42 km through Erode (including its Tirupur border) and a short distance through Karur before joining River Cauvery. According to him pollution of the river was politically backed and it would take a series of efforts to put an end to pollution of the river.\n\nHe said that 15 engineering colleges have come forward to conduct a survey of the river, tributaries, and connected tanks.\n\n“The survey will be completed in six months and will be submitted to the government,” he said and added that the government would be actively involved through out the course of the restoration and in the monitoring process.", 
    "section": "national", 
    "title": "Anna Hazare to inaugurate Noyyal restoration works", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}