{
    "author": [
        "L Renganathan"
    ], 
    "text": "Members of the Tamil Nadu Federation of All Farmers' Association locking up the Kotak Mahindra Bank branch in Thanjavur on Saturday in protest against the attack on farmer G. Balan.- Photo: R.M. Rajarathinam\n\nThe assault by some police personnel and agents of the Kotak Mahindra Bank on a farmer G. Balan of Cholagankudikadu who, defaulted on a loan, has galvanised farmers’ outfits in the delta region into action.\n\nOn Saturday, the non-political All Farmers Coordination Committee cadres locked up the bank branch premises and staged a sit-in at the Collector's Office demanding action against the perpetrators of the “crime”, while the CPI and the CPI (M) sponsored farmers fronts have threatened that they would launch a road roko on Tuesday.\n\nAll Farmers’ Coordination Committee coordinator P.R. Pandian alleged that finance firms were deploying goons to recover arrears from defaulting farmers and the public.\n\nCalling upon farmers to drive out of State the lending agency that extended credit to Balan and then, assaulted and intimidated him, Mr. Pandian led a group of farmers to the bank's Thanjavur branch.\n\nFinding it closed on account of second Saturday holiday, the protesters put locks brought by them.\n\nThe protesters urged the State and the Central governments to waive all loans availed by farmers.\n\nThanjavur Superintendent of Police M.N. Mayilvahanan spoke to a group of farmer leaders and apprised them of the action being taken against the errant police personnel.\n\nThe Tamil Nadu Vivasyigal Sangam and the Tamilaga Vivasaya Sangam, front organisations of the CPI and the CPI (M), jointly discussed the issue here and announced that since the demands for taking proper action against the errant police personnel were not met, the cadre would resort to a road roko on Tuesday.\n\n18 held in Tiruchi\n\nMeanwhile, 18 members of the Tamizhaga Vivasayigal Sangam, led by its district president M.P.Chinnadurai, were arrested after they attempted to observe a fast in front of the office of the Inspector General of Police, Central Zone, in Tiruchi on Saturday morning.\n\nThe arrested farmers were demanding the return of the seized tractor to the farmer Balan, action against the private bank officials and immediate halt of distraint proceedings against farmers defaulting on all farm loans by banks and financial institutions.", 
    "section": "national", 
    "title": "Assault on Balan raises farmers’ hackles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}