{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“There will be a two-quarter lag for private investment to follow public expenditure at current levels of underutilised private capacity and when this happens, aggregate demand will increase in the future,” said NITI AAYOG member and economist Dr. Bibek Debroy while analysing the Union Budget at a speech at the SASTRA University here on Saturday.\n\nDr. Debroy’s budget speech was part of the CUB Shri V. Narayanan Memorial Lecture organised by the SASTRA University in memory of the bank’s late Chairman V. Narayanan.\n\nDr. Debroy said that Swachch Cess of 0.5 per cent was levied based on the recommendation of a group of Chief Minsters. About the perceived poor allocation for social sectors such as health and education, he said these were not in the Union List and the responsibility of the Centre was to focus on delivery in the Centrally-sponsored social schemes and not primary budgetary support.\n\nHighlighting the role of governments at all levels – Union, State and local bodies — he said the triple databases – socio economic caste census, the PM Jan-Dhan Yojana, and the AADHAR would be instrumental in ensuring that subsides, insurance benefits, and pension reached the deserving rural population while the government agencies ensured availability of public goods and services in a prioritised manner. Dr. Debroy encouraged students and other stakeholders to be more participative through mygov.in and make the budget-making exercise more democratic.\n\nS. Vaidhyasubramaniam, Dean, Planning and Development, SASTRA University, welcomed the gathering. He said this budget had shades of an Indian family – father’s aspiration, mother’s allocation, distant relative’s objection, and astrologer’s prediction.\n\nChief Executive Officer and Managing Director of the City Union Bank N. Kamakoti proposed a vote of thanks.", 
    "section": "national", 
    "title": "Budget is aimed at increasing demand in future, says Debroy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}