{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a daring act, burglars struck at the police quarters here on Friday night and decamped with about 30 sovereigns of gold jewellery and Rs. 85,000 after tying the hands of the wife of a Special Sub Inspector before attempting to rape a woman in a nearby area.\n\nAccording to police and reports received at the police quarters at Tamizh Thai Koil Street, a two-member gang first struck at the house of Inspector of Police Azhagarsamy on the first floor before looting the gold jewellery and cash from the Special Sub Inspector (SSI) of Police Singarayar’s house on the ground floor, 30 minutes past midnight.\n\nThe reports said that the Inspector of Police and SSI, attached to the Karaikudi South plice station, were away on night patrol when the burglars struck. They gained entry into the house of the Inspector, who was living alone, by breaking open the lock and looted Rs. 5,000. While climbing down, they found the door of the SSI’s house slightly ajar and entered the house. Sagayam, wife of the SSI, had kept the door open as she expected her husband to return home around that time. After tying her hands and legs, the burglars held her at knife-point before getting the keys and looting the jewellery and cash. Sagayam and her two-year-old grandson were at home.\n\nWhile fleeing, one of the burglars entered the house of a 35-year-old woman at Annamalai Chettiyar Second Cross Street and attempted to rape her, police said. When the woman bit his hand and raised an alarm, the assailant escaped after biting her cheek, police said. She was living alone with her two children, police added.\n\nSuperintendent of Police Ziaul Haque visited the police quarters and was eted with Karaikudi Deputy Superintendent of Police Muthamizh and other senior police officials and drew strategies to bring to book the culprits. As the burglary brought embarrassing moments for the police force, it had launched swift action to track down the assailants.", 
    "section": "national", 
    "title": "Burglars strike at police quarters, loot jewels and cash", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}