{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Participants at the panel discussion on ‘Men for Women – Understanding Gender, Equality,’ organised by the Indian Women Network in Puducherry on Saturday.— Photo: S.S. Kumar\n\nBashir Ahmad Khan, former vice-chancellor of Sido Kanhu Murmu University, Jharkhand, called for change in mindset and the flawed belief system in our society that demeans women.\n\nHe spoke during a panel discussion on ‘Men for Women – Understanding Gender, Equality’ on Saturday organised by the Indian Women Network, an initiative of Confederation of Indian Industry.\n\nDiffering with organisers for having a panel discussion on Men for Women, he stated it should have been the other way round. He said that it was important to understand gender equality. But, talking about family-oriented values is not enough. “We are still grappling with old ideas. There is a need to change in mindset and the belief systems that perpetuate gender equality,” he said. The IWN had organised the panel discussion to observe Women’s Day on Saturday. They had invited men to talk about women in their lives. Mr. Khan spoke how gender roles have been deeply ingrained in our mindset that even his wife Anisa Basheer Khan, vice chancellor (i/c), Pondicherry Central University, continues to manage domestic chores and her profession. “I am not going to talk about my role for success of my wife. It is the other way round,” he said.\n\nP. Rangaraj, chairman and MD, Chemin C&I Private Limited, spoke about his daughter-in-law Radhiga Ragu’s contribution and her role in strengthening the company.\n\nIt was 17-year-old Chirag Shah’s talk that left many in the audience moist-eyed. Son of Chitra Shah, director, Satya Special School, Chirag detailed his mother’s achievement and humility. He said: “How can a son not tell the world that she is the best,” he said.\n\nAnanda Balayogi Bhavanani, deputy director, Centre for Yoga Therapy, Education and Research, said that life of both men and women should be cherished. He spoke of the importance of three women – mother, wife and daughter – in his life. Malathi Rajavelu, chairperson, The International Movement of Tamil Culture, gave special address.", 
    "section": "national", 
    "title": "Call to change mindset, belief system that demean women", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}