{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Along with Santhosh Hegde, Prashant Bhushan releases draft version of the Lokayukta bill\n\nThe Modi government may not be facing corruption charges, but is systematically destroying every anti-corruption institution in the country, said lawyer Prashant Bhushan here on Saturday.\n\nHe was in the city to release a draft version of the Lokayukta bill along with former Lokayukta of Karnataka Santhosh Hegde. The event was organised by Arappor Iyakkam.\n\nThe Centre passed a weak Lokpal bill, but it had not filled the post for the last two years.\n\nImportant posts in Central Vigilance Committee and Central Information Commission were given to ‘weak and pliable’ bureaucrats or to those who were downright corrupt, Mr. Bhushan alleged.\n\nNow, the Centre wanted to bring amendments to the Prevention of Corruption Act which could undermine the Act, he said and added that the plan was to remove an important section called ‘criminal misconduct’.\n\nThe section prohibits favouring a private company or private person without any public interest. In many cases, it was difficult to prove transaction has taken place, he said.\n\nMr. Santhosh Hegde said poor people were the most affected by corruption.\n\n“I remember how a poor couple, whose child was unable to excrete properly, were fleeced at a government hospital,” he recollected.\n\nWhile talking about how a strong Lokayukta could help bring the powerful politicians to face the full force of the law, he warned that Lokayukta could also be misused if it was not headed by a person with integrity. He urged the people of Tamil Nadu to make a Lokayukta a reality.\n\nThe organisers said they had created a model anti-corruption ombudsman which could be taken as a first step in moving towards setting up a robust anti-corruption mechanism in Tamil Nadu.\n\n‘Centre wants to bring amendments that undermine Prevention of Corruption Act’", 
    "section": "national", 
    "title": "Centre not keen to end corruption: Bhushan", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}