{
    "author": [
        "S Senthalir"
    ], 
    "text": "Visual art exhibition at Alliance Francaise Pondicherry to be open till Tuesday\n\nPaintings by artists Manoj K.P. , Seema Devi and Vipin. T. Paloth on display at Alliance Francaise in Puducherry on Saturday.—Photo: S.S. Kumar\n\nThree self-taught artists from three different places came together at 3veni Painting Exhibition to showcase their art in Alliance Francaise Pondicherry.\n\nDifferent textures and shapes of a woman’s face in varied colours on canvases welcome you at the entrance of the exhibition hall. They are the paintings of 68-year-old medical practitioner and self-taught artist Seema Devi. She depicts nature in the form of a female. “I like to paint faces in many fashions. It is the expression of a soul,” she says.\n\nAs we proceed into the hall, we see a portrait of Pandit Bhimsen Joshi, paintings of women drenched in moonlight in green and yellow colours and nature. Different shades of green — earth green, hookers green, sap green, olive green and emerald green spread the colours of nature in the canvas. Manoj K.P. from Kannur, Kerala, says: “When I paint tender leaves, I drift into a romantic state of mind. I feel that I am in the midst of a vast green world and everything is green around me — the sky, earth, river and the sea.”\n\nThe intricate detail of leaves, shrubs and flowers stands out in Manoj’s paintings. He says his paintings are a result of music. “I transfer music into a visual melody on my canvas with my favourite colour,” he says.\n\nComing from a family of artists, Manoj started painting when he was in the fifth standard. A graduate in economics from Calicut University, he works as a freelancer artist.\n\nAmidst the big canvases, one would find paintings of vast nature fit in a small canvas. Vipin T.Paloth from Kasaragod in Kerala likes to paint trees and abandoned dilapidated homes as they convey silence. “I like to paint vastness in limited canvas. I start with an empty canvas, just pouring colours with no preconceived image. Slowly, a dialogue develops between me and the canvas and I proceed to finish my painting,” he says.\n\nAn introvert, Vipin likes to juxtapose light with deep, dark tones to indicate the true facts of life, birth and death. Dr.Seema Devi, through a social networking site, brought together the two artists from remote areas of Kerala to exhibit their paintings along with her works in Puducherry.\n\nThe exhibition will be on till March 15 at Alliance Francaise Pondicherry on Dumas Street.", 
    "section": "national", 
    "title": "Confluence of three painting styles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}