{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Relatives of S. Kalaivani (24) staged a protest near Fortis Malar Hospital on Friday night and Saturday morning after her death following deterioration of brain function. A case of unnatural death has been registered, police said.\n\nAccording to M. Perumal, brother-in-law of Kalaivani’s husband Shivaprakasham, she had been three months pregnant, but doctors said the pregnancy had to be aborted due to medical reasons. “We took her to a private hospital on February 27. They tried to perform a D&C, but she developed complications and her situation turned critical. We then decided to shift her to Fortis Malar. There, she was initially fine, but all of a sudden, doctors told us that she had developed a brain clot and was brain dead,” he said.\n\nA statement from Fortis Malar Hospital said Ms. Kalaivani was admitted on March 7.\n\n“The patient was brought here with complications developed due to an MTP (Medical Termination of Pregnancy) performed in another hospital. All the necessary medical and surgical treatment was initiated immediately on arrival. The patient hasn’t responded well to the treatment provided at Fortis Malar and her vital parameters further deteriorated resulting in the decline of brain function. The hospital has consistently kept the patient’s family informed about the condition of the patient and the treatment provided.”\n\nOn March 11, a team of doctors attending to the patient met her family to brief them, the statement said.\n\nA police officer said Kalaivani had been declared dead around 3.35 p.m. on Saturday and that her body had been sent to Rajiv Gandhi Government General Hospital for a post-mortem.\n\n“The victim’s mother, Jaya, lodged a police complaint,” he said, adding that the protest had been on since Friday night.", 
    "section": "national", 
    "title": "Death in hospital sparks protest", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}