{
    "author": [
        "B Kolappan"
    ], 
    "text": "Party leaders don’t think multi-cornered contest will be a disadvantage to the combine\n\noving past the setback caused by actor Vijayakant’s decision to go it alone, the DMK on Saturday announced a four-member committee to hold seat-sharing talks with its alliance partners.\n\nThe committee members are party treasurer M.K. Stalin, principal secretary Duraimurugan, deputy general secretary I. Periyasamy and oganisation secretary Alandur R.S. Bharathi.\n\nMr. Duraimurugan sought to play down the DMDK development, saying that it would not affect the DMK’s electoral gains.\n\n“Today, I visited my constituency and gathered the feeling that DMDK’s absence is unlikely to have any impact in the election. It may reduce our victory margin, but will not prevent us from winning the elections,” he said.\n\nAsked whether multi-cornered contests in the election would affect the DMK’s chances, he said the new alliances could offer only “street-corner contests,” hinting that they would not make an impact on major parties.\n\nDMK MP Kanimozhi said a political party could not prepare itself for an election just by pinning its hope on prospective alliance partners. “We took a conscious decision to align with some parties. We invited Mr. Vijayakant to join our alliance. We, however, cannot compel him if his party decides to contest alone,” she said.\n\nMs. Kanimozhi also said the DMK, a cadre-based party with a time-tested vote bank, would be able to win the election, and the creation of new fronts would not affect its victory.\n\n“People are clear about their choice and they will not waste their votes on others when their objective is to oust the AIADMK government,” she reiterated.\n\nAccording to Ms. Kanimozhi the absence of Left parties, Viduthalai Chiruthaikal Katchi (VCK) and the PMK, which were part of DMK alliance in 2006, would also not have any adverse effect on her party’s prospects. “They were not with us in 2011 and faced the elections as part of the AIADMK combine. So only the ruling party is going to lose heavily,” she said.\n\nTNCC president Elangovan agreed with the views of the DMK leaders and went one step further to accuse Mr. Vijayakant of deciding against the wishes of Tamil Nadu people and his own partymen.\n\n“As a well-wisher of Mr. Vijayakant, I am really disappointed by his decision. He missed a great opportunity,” he said, reiterating the that combination of the DMK, Congress, and the Indian Union Muslim League (IUML) was strong enough to emerge victorious.", 
    "section": "national", 
    "title": "DMK forms panel to hold talks", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}