{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Employees' Provident Fund Organisation (EPFO) has announced an Incentive Refund Scheme that encourages employers to provide Universal Account Numbers (UAN) to all employees, a step aimed at bringing transparency and accountability to the EPF system, said P. Senthil Kumar, Regional PF Commissioner here on Friday.\n\nIn a release issued here, he said that the scheme would enable employers to claim a refund of up to 10 per cent of the administrative charges paid by them in each quarter, provided they qualify for it based on certain criteria.\n\nThe scheme will be effective from January 1 to December 31, 2016, according to a notification issued by the labour ministry on February 10, 2016.\n\nUAN offers easy portability of PF accounts between employers. It also allows members to view their EPF accounts with current and former employers.\n\nIf a company has provided member account details of 80 per cent of its workforce to the retirement fund/ body and linked 80 per cent of the accounts to Aadhar as well as 100 per cent to bank accounts and PAN numbers wherever applicable, it will be eligible for a refund of 10 per cent, provided also that it has given UAN to all the members whose details have been furnished with the EPFO.\n\nAn establishment that has provided details of at least 60 per cent of employees will be eligible for a refund of 5 per cent on the administrative charge, if 70 per cent of the accounts are linked to Aadhaar and 100 per cent to bank accounts and PAN. The employer also has to provide UAN to at least 60 per cent of its workforce. The incentive by way of refund shall be payable at the end of every quarter starting from quarter ending March 2016, as per the procedure prescribed by the CPFO.\n\nHe said that the incentive scheme shall be in operation for one year with effect from January 1, 2016 to December 31, 2016 i.e. for the quarters beginning January, April, July and October 2016, the release added.", 
    "section": "national", 
    "title": "EPFO introduces incentive for employers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}