{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Action sought at Senate meeting of Manonmaniam Sundaranar University\n\nThe alleged forcible collection of money from students of Rani Anna Government College for Women at Pettai came in for sharp criticism from members at the Manonmaniam Sundaranar University’s 41st Senate meeting held here on Saturday.\n\nRaising the issue, member C. Retna Sigamony said the students had been forced to pay Rs. 600 per head between October 26 and 28 and were threatened that those who would pay their contribution alone would get the hall tickets for the November 2015 semester examination.\n\n“Even as the students are being forced to pay money, parents, who could not take part in the Parent-Teachers’ Association meeting owing to preoccupation, are being fined. The MSU administration should stop this by issuing stringent warning to the college Principal,” Mr. Sigamani said.\n\nWhen it was replied that no student had filed any formal complaint in this connection, Mr. Sigamani said the money collected from the students should be returned immediately. “Above all, action should be taken against the Principal so that it will be a warning to others,” he said.\n\nMember R. Wilson said the excess fee to the tune of Rs. 60 lakh collected from the students undergoing MSU’s satellite courses being offered at Muslim Arts College and Malankara Catholic College between 2008 and 2012 should be returned without further delay. “Moreover, action should be taken against the managements of these two colleges,” he said.\n\nWhen he was given the reply that the matter was pending with the enquiry committee, Dr. Wilson said the enquiry committee, after holding enquiry at the college and with the students, had come to the conclusion that excess fee had been collected. “Hence, MSU should take immediate action against the colleges concerned and take steps for returning the excess fee collected from students,” he said.\n\nSyndicate member S. Subbaraju said de-affiliation of these colleges, which could be the appropriate punishment, had been stayed by the Madurai Bench of Madras High Court. “Since MSU’s name has been misused to collect excess money from students, the university should take immediate steps to vacate the stay to get these two colleges de-affiliated,” Prof. Subbaraju said.\n\nWhen an adjournment motion on hiking the salary of faculty members working with MSU’s constituent colleges was moved in the meeting, Syndicate member C. Radhakrishnan Nair said working condition of lecturers in self-financing colleges was bad. “While they are being forced to work for more than 20 hours a week, they are not given any privilege like casual leave or even maternity leave. A pregnant faculty member of a college in Kanyakumari district was asked to have the delivery during summer vacation and return for work as the next academic year started. They are being treated like bonded labourers, who are being given a paltry sum of Rs. 3,000 as salary. To begin with, the MSU should think of hiking the salary of faculty members of its constituent colleges,” Dr. Nair said.\n\nApproving it, Vice-Chancellor K. Bhaskar said the hike would be effected as per the Government Order.", 
    "section": "national", 
    "title": "Forcible collection of money from students draws criticism", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}