{
    "author": [
        "S Senthalir"
    ], 
    "text": "Don Bosco Boys Transit Home children soak in the annual event organised by Edforall trust\n\nChildren of Don Bosco Boys Transit Home actively participate at a sports event organised by ‘Ed For All’ trust as part of a two-day camp on Jipmer campus in Puducherry on Saturday.— Photo: S.S. Kumar\n\nThe underprivileged children from Don Bosco Boys Transit Home at Thattanchavady were unstoppable on Saturday. Their energy levels went high as they were let to jump obstacles, climb trees, play basketball and football on the Lister Square in Jawaharlal Institute of Postgraduate Medical and Education Research (Jipmer).\n\nIt was the first day of the annual event CAMP (Creating, Ability, Meaning, Purpose) organised by the students from different colleges in Puducherry under the banner ‘Education for All’ (Edforall) trust.\n\nTwelve-year old Thamizh Dhilipan from the Don Bosco Boys Transit Home says they eagerly wait for this event every year. “This is the third year. We get to play different games and important personalities are invited to introduce us to varied fields,” he says.\n\nThe Education for All trust, a non-profit youth voluntary organisation, run mainly by the students from institutions like Jipmer, Pondicherry Central University and VIT University, took up the task of teaching English language to the underprivileged children three years ago. Following the Oxford University curriculum, they started teaching the children at the shelter homes.\n\nThe students spend two hours in the weekend teaching the children. They first started with 100 children in Don Bosco Boys Transit Home three years ago and extended their work to Fathima Girls Convent at Rajendranagar.\n\n“We did not want to stop just with taking English language classes. We wanted to expose the children to the world of career opportunities. Hence, this annual event is organised,” said Arya Rachel Thomas, student of Pondicherry Central University and president of the trust.\n\nNinety children from the Boys Home participated in the sports and games event. “At least ninety volunteers from different institutions are also present to organise and conduct the event,” said Pooja Sai, a second year MBBS student from Jipmer and who is also a part of the HR team of the trust.\n\nDhilipan said that every year they are introduced to different personalities from Army, diving school. “We are expecting to meet a different personality this year and learn more about the opportunities we get,” he adds.\n\nEleven-year old Enos Venslas says that they have started communicating in English and it was fun learning.\n\nThis year, SVARAM from Auroville will hold a music workshop for the children and later into the night, Jipmer and PIMS musical band entertained them with western music.\n\nOn Sunday, Auroville will conduct a workshop on organic farming and there will also be a workshop on hygiene and public health.", 
    "section": "national", 
    "title": "Fun and learning begin at ‘CAMP’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}