{
    "author": [
        "P V"
    ], 
    "text": "The rescue came in the nick of time for Radha*, a young Irula girl in Shoolagiri. She was about to be married off to a 38-year-old, already married, at Ponnalnatham near here. Not only was the wedding stopped, the bridegroom and three brokers, including a woman, were also arrested and remanded.\n\nRadha, an orphan in the care of her maternal aunt, was decked up in a saree and minimal accessories sponsored by the bridegroom, when she was rescued and taken to the District Child Welfare Committee office here.\n\n‘Not taken any cash’\n\nSpeaking to The Hindu at the office of the DCWO, Basamma, Radha’s maternal aunt denied having taken any cash. She said the broker had told them that the groom was only 27. “We are STs and have no means. I only thought she would have better life there,” Basamma added.\n\nBasamma and Radha had no inkling of the man’s age, or the fact that he was married. Radha, who is unaware of her own age, had first set eyes on the bridegroom only on Friday morning.\n\nRadha ran away from a mill in Erode, where she was working under the infamous Sumangali scheme. “She came here after her mother died of some disease a year and half ago. She has two younger siblings who are employed in a brick kiln in Chengalpattu,” says Basamma.\n\nThe all-male wedding party that had driven up from Andiyur in Erode to a Murugan temple here in Shoolagiri for the pre-dawn function was in for a surprise when Child Welfare Committee officials landed at the venue with Gurubarapalli police.\n\nAccording to original sources that tipped off the media, Balasubramani, the bridegroom, had been married twice, and his two spouses were reportedly from Mecheri and Andiyur, in Erode. However, he insisted that he was married only once.\n\nThough unconfirmed sources from Erode that had tipped off the media had claimed that a broker was paid Rs.35,000, as initial payment against the promised sum of Rs.65,000, there is no proof yet for that.\n\nHuman trafficking case?\n\nPolice are inquiring into the human trafficking angle, where girls from impoverished families with no wherewithal are being sold under the cloak of matrimony.\n\nWhen contacted, Superintendent of Police said the accused Balasubramani (38), and three brokers Munusamy, Ellammal, and Ramesh were remanded under 294 B and 506 (1) on Friday night.\n\nBridegroom and three brokers, including a\n\nwoman,\n\narrested", 
    "section": "national", 
    "title": "Irula girl’s wedding with much married man averted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}