{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It was an event that caught the attention of the Saturday evening crowd at the Marina Beach here.\n\nThe video montages spoke about how able a leader AIADMK supremo and Chief Minister Jayalalithaa has been. Everyone from students to professionals to even bureaucrats described instances of how she had been able to take tough decisions for the well-being of the State but not aimed at votes.\n\n“She is an inspiration for people like me. She is very determined, courageous and commands tremendous control over a large organisation with over one crore members. There are many people who are trying to project themselves as the chief ministerial candidates but there is none like her,” said M.S. Sudhakar, a resident of Chromepet, who happened to watch the programme organised by a group of Amma’s fans.\n\nC. Karthik of Madipakkam, who aims to meet Ms. Jayalalithaa one day, said as a Chief Minister she had been able to reach many services to the people. “Look at the Amma Unavagams, lakhs of people benefit from them,” he said.\n\nCalled ‘My Leader’, the campaign is aimed at attracting youth. “Many youth just hate politics. A large section does not even believe in voting. But when you talk to them, you find that they are impressed by Amma and respect her. We just wanted bring together such youngsters,” said K. Karthik, one of the organisers. Many more events, including one next week, with youngsters drawn from corporates, have been planned to take the campaign forward, said N. Sharmila, another organiser. The event began with a 10-minute-long performance by Drums Kumaran and then followed by Parkouring by members of the Chennai Parkouring Club.\n\nMeeting with cadres\n\nMeanwhile, the AIADMK held meetings with cadres in R.K Nagar and Perambur constituencies on Saturday. “The elections have been announced and the cadres have been demanding work. Booth-level and street-level committees have been formed and they held a meeting today to discuss election work,” said P. Vetrivel, party secretary, Chennai North.\n\nP. Madhusudhanan, party presidium chairman, urged cadres to keep in touch with the voters and remind them of Amma’s work and her leadership qualities. On Sunday, meetings for Villivakkam and Kolathur constituencies will be held.\n\nThe campaign is aimed at attracting youth; many more events planned to take it forward", 
    "section": "national", 
    "title": "Jayalalithaa fans launch ‘My leader’ campaign at Marina beach", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}