{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu Petroleum Dealers Association (TNPDA) has urged the Ministry of Petroleum and Natural Gas and the oil marketing corporations to fix the dealer commission based on market conditions and disburse the same with retrospective effect as recommended in the 2011 report submitted by the Director of Marketing to the Government of India.\n\nThe meeting was attended by D. Sathya Narayanan and M. Narayana Prasad, president and honorary general secretary of Consortium of Indian Petroleum Dealers, and K.P. Murali and M. Hyder Ali, president and general secretary of TNPDA.\n\nA resolution to this effect was passed at the second convention and 35{+t}{+h}annual general body meeting of TNPDA. The resolution said that it was time that oil marketing companies enforced the Retail Selling Price curbing the practice of selling petroleum products on a discounted price.\n\nWith low dealer commissions and mounting operational costs, the dealers will not be able to offer discounts. Under such circumstances outfits operated by certain associations were offering discounts on retail price, thus, denying a level playing field. TNPDA not only wanted oil marketing companies to stop such practices of discounts on retail sales but also sought compensation for the TNPDA members who were affected because of the practice of discounted sales resorted to by fellow outlets.\n\nThe meeting also sought measures to curb the practice of lifting 2 kilo litres to 12 kilo litres of petroleum products from the outlets in smaller tankers and selling them at different outlets at present resorted to by a section of the dealers.\n\nThe meeting pointed out that it was a violation of licensing conditions.\n\nThe meeting urged the oil marketing corporations to force the dealers to lift branded/premium fuels for the sake of showing marketing figures and statistics. The dealers could sell only what the consumer wants and they, in turn, cannot force it on the consumers, the meeting added.", 
    "section": "national", 
    "title": "Petroleum dealers press for charter of demands", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}