{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Programmes will be held in at least 200 places such as parks, beaches and malls\n\nAhead of Assembly elections, at least 200 places such as parks, beaches and malls will be identified for organising voter awareness programmes in the city.\n\nChennai District Election Office on Saturday launched a systematic awareness and education campaign as part of measures to increase voter turnout.\n\nStreet plays, puppet shows, exhibition, folk arts performance, debates, flash-dancing and rallies have been proposed to be organised by the Chennai District Election Office.\n\n“We are seeking to improve upon last year’s poll turnout of 68 per cent. In urban areas, such a turnout is fairly good. These programmes are expected to motivate more people to exercise their franchise,” said Chennai District Election Officer B. Chandra Mohan.\n\nIn the first phase of the programme, information will be provided on time and date of elections, services offered for various categories of voters, postal ballots, ramps at polling stations for voters with disabilities, separate queues for male and female voters, priority for senior citizens and voters with disability and facilities for women.\n\nCultural programmes incorporating information pertaining to documents required for voting, exercising None of the Above (NOTA) option and to the polling process will be held.\n\nIn addition to the two congregating spaces identified in each Assembly constituency in the district for organising systematic awareness programmes for voters every day, more areas are likely to be covered by the programme with assistance from civil society and traders.\n\nWard-level officials have started to identify more parks across Chennai district for the programme.\n\nOn Saturday, election officials distributed pamphlets to passengers at the Chennai Mofussil Bus Terminus at Koyambedu.", 
    "section": "national", 
    "title": "Poll awareness programme kicks off", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}