{
    "author": [
        "Special Correspondent"
    ], 
    "text": "District Collector and District Electoral Officer M. Karunakaran has warned printing press owners against printing anything that could trigger violence during elections and urged them to comply with the established norms of poll code.\n\nAddressing the meeting held at the Collectorate on Thursday evening, Dr. Karunakaran said posters and pamphlets being printed on behalf of political parties or politicians should carry the name and address of the printing unit without fail as the Election Model Code of Conduct was in force in the district following the notification for May 16 Assembly polls.\n\nThe printing units should not print messages triggering communal or religious hatred.\n\n“Along with the copy of printed material, the printing unit owners should submit the ‘A’ and ‘B’ forms issued by the Election Commission of India to the Returning Officer and Tahsildar concerned within three days from the date of printing. Moreover, the printing cost should also be declared while the printed materials and the forms are submitted since it will be added to the election expenditure. As the posters and pamphlets being released now are being videographed, any violation will be viewed seriously and cases registered under Section 171 H of Indian Penal Code,” Dr. Karunakaran cautioned.\n\nDistrict Revenue Officer M.G. Kulandaivel, Sub-Collector, Cheranmahadevi V. Vishnu, Divisional Revenue Officers P. Fermi Vidhya of Tirunelveli and Venkatesh of Tenkasi were present.\n\nIn a meeting held with the local cable television channel operators, the Collector urged them to comply with instructions of Election Commission and told them not to broadcast any material that would harm communal harmony and political confrontation.", 
    "section": "national", 
    "title": "Press owners cautioned against printing messages triggering hatred", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}