{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The prohibition policy pursued by the State Government had badly hit the overall development of the State on all fronts, said Anbumani Ramadoss, MP and Chief Ministerial candidate of the Pattali Makkal Katchi.\n\nThe presence of Tasmac shops has ruined the entire society, particularly the present day younger generation, besides badly affecting the rural economy. There is an urgent need to correct this and introduction of total prohibition was the only way out to put the State back on the development track and salvage the prestige of Tamil society, Dr. Anbumani said while addressing a meeting “Anbumani on Tamil Nadu’s development: lecture, question and answers on the prohibition policy” held here on Friday evening.\n\nParty founder Dr. Ramadoss has been fighting relentlessly for total prohibition in the State for the past 34 years unmindful of the party’s electoral fortunes. The party has led various agitations and even went to the court seeking the closure of Tasmac shops.\n\nAbout 600 Tasmac shops functioning on the highways were closed on the direction of the High Court and Supreme Court on the petition filed by the PMK.\n\nAt present, all the political parties, except the ruling AIADMK, have been demanding total prohibition in the State. This is a big success for the PMK, he said.\n\nDr. Anbumani said that parties such as the DMK were demanding total prohibition only for namesake, as half-a-dozen liquor manufacturing units of the dozen in the State were owned by DMK men.\n\nReferring to the observation of the AIADMK regime that closure of Tasmac shops will only lead to illicit liquor, Dr. Anbumani said that people in the past evinced interest in lottery tickets. But, once it was banned, no one showed interest in it. “The people will have no inclination to consume liquor if the TASMAC shops are closed,” he said.\n\nThe PMK will face and overcome any challenge from any quarter, including the liquor lobby, in its task of doing away with the liquor in the State. “We will go to any extent to achieve our goal of total prohibition in the State”, he said.\n\nMore than 46 per cent of the youths of the State have become liquor addicts, he said and added that he will open rehabilitation centres in all taluks in the State to cure the chronic alcoholics, if his party was voted to power.\n\nLater, at an interaction session, Dr. Anbumani clarified the various doubts raised by the participants.", 
    "section": "national", 
    "title": "‘Prohibition policy has hit development’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}