{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At a memorial meet on Saturday for the late V. Kumaraswami, former director-in-charge of the National Institute for Research in Tuberculosis and the National Institute of Epidemiology, there were tears, some laughs and a lot of recollections.\n\nScientists, researchers and professors, who had known Dr. Kumaraswami, participated in the meet, held at the National Institute for Research in Tuberculosis (NIRT), and spoke about his extraordinary contribution to filariasis control in the country, his commitment to research, his strength as a teacher and his quirky sense of humour.\n\nSoumya Swaminathan, director general, Indian Council of Medical Research (ICMR) and former director of NIRT said, “He was a role model for so many people, in such a quiet and unobtrusive way.” On the filariasis control programme in India, she said he was the one man who stood behind it and worked for 30 years towards it. Calling him a “one in a million individual”, Dr. Swaminathan also read out an online message by the neglected tropical diseases community that mourned his loss. “We can do him service by trying to emulate him in whatever way possible,” she said.\n\nDr. Swaminathan and several others recalled instances of his humour, his April Fool pranks, his helping of friends in need and his influencing the lives of many around him.\n\nNalini Krishnan, director, REACH, an organisation that works for the care and support of tuberculosis patients, said that no matter how busy Dr. Kumaraswami was, he always made time for REACH. “His silent strength enabled us to build REACH…we will carry his memory with us,” she said.\n\nV.I. Mathan, chairman, scientific advisory group of ECD, ICMR, said Dr. Kumaraswami had achieved immortality by touching the lives of others and through his scientific work.\n\nA presentation with photographs of Dr. Kumaraswami’s contributions was screened and several doctors also spoke about his wife, Ms. Lakshmi, who also passed away in the accident that killed him.\n\nDr. Kumaraswami’s children, Sameer and Manju and his brother Ravi also participated in the memorial meet.", 
    "section": "national", 
    "title": "Remembering a medical legend", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}