{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Free availability of liquor had led to a spurt in crime against women”\n\nWomen taking part in an election awareness rally organised by Tamizhaga Pengal Koottamaippu in Ramanathapuram on Saturday.Photo: L.Balachandar\n\nThe district unit of Tamizhaga Pengal Koottamaippu has demanded the removal of Tasmac-run retail outlets in public places and near educational institutions and places of worship throughout the state.\n\nThe federation, in its International Women’s Day celebration here on Saturday, said through a resolution that free availability of liquor had led to a spurt in crime against women and demanded compensation to families which lost their breadwinners on account of the liquor menace.\n\nIn another resolution, it urged the State and Central governments to provide subsidy for building individual toilets in all the households and abolish open defecation as it posed grave health hazards.\n\nDespite sustained propaganda, child marriages were still taking place in several backward villages in the State, it said and urged the government to step up the drive against such illegal marriages.\n\nIt said the much talked about 33 per cent quota for women in legislative Assemblies and Parliament was still a distant dream and urged the Centre to pass the Women’s Reservation Bill during the current budget session itself.\n\nEarlier, a large number of women took out a rally led by A. Sengole Mary, district unit, and took a pledge to assert their rights in governance.\n\nFederation office-bearers Prema, N. Ramalakshmi, A Rejina Mary and district councillor A Ravichandra Ramavanni were present at the function.\n\nDistrict Election Officer and Collector S. Natarajan flagged off the rally, which also served the purpose of creating election awareness. Around 2,000 women from eight panchayat unions participated in the rally, holding placards on election awareness and urging voters to take part in the democratic process.", 
    "section": "national", 
    "title": "Remove liquor outlets in public places: forum", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}