{
    "author": [
        "A D Balasubramaniyan"
    ], 
    "text": "There is potential for tourism, say naturalists\n\nPoets may allude partners of love to ‘Andril’ bird, taking a cue from references to the bird in Sangam literature. Yet, most of them wouldn’t have glimpsed an andril swimming on a wetland in reality. If at all they are keen on seeing a kind of Andril (black headed ibis), all that they need to do is to drop in at Samuthiram Eri in Tiruvannamalai.\n\nThe huge irrigation tank has plenty of water this year after a gap of many years. Towering palmyra trees, several wild flowering plants and wild bushes on either side of the bund of the ecologically rich water tank provide a wonderful scene for those coming there to catch a glimpse of wetland birds.\n\nDespite indiscriminate mining and invasion of exotic prosopis juliflora (seemai karuvel) the place is serene and ecologically rich, and home to innumerable plants and wetland creatures, including beautiful birds.\n\nNaturally it attracts several local bird watchers though neither the Tourism Department nor the Public Works Department and Forest Department did anything to protect the ecosystem and guide tourists to the place.\n\nThis correspondent visited the lake in the company of seasoned bird watcher and painter Kumar alias R.Sivakumar and spotted a large number of spot billed ducks, red wattled lapwings (aakkatti), night herons (vakka), grey heron, prinia, larks, bush chats, sand piper, bay backed shrike (keechan), darters (paambu thara), little cormorants (neer kagam), and black winged stilt (Pavazhakkal Ullan), apart from a beautiful black-headed ibis.\n\nEven a month ago, other migratory birds were also seen, says Kumar. The abundant water in the tank after several years seems to be a boon and it is a chance for local bird lovers to catch a glimpse of these birds and for students to learn about wetland eco system, he said. The tourism department could rope in naturalists, ornithologists and bird watchers and could facilitate eco tourism in the tank with their help, naturalists familiar with Samuthiram tank feel.", 
    "section": "national", 
    "title": "Samuthiram Eri turns into birds’ paradise", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}