{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Regional Joint Director, Collegiate Education, Coimbatore, has written to the State Government asking it to administer the CBM College of Arts and Science, Coimbatore.\n\nIn his letter of February 04, 2016, the officer said that the Government should invoke Section 14(A) of the Tamil Nadu Private Colleges Regulation Act to appoint a special officer, who would manage the college by keeping away the management.\n\nThe Coimbatore office had in May 2009 and September that year sent letters recommending special officer because the government-aided college lacked basic amenities, suffered shortage of teaching staff, poor laboratory infrastructure and the management adopted an anti-non teaching staff stance.\n\nThe Regional Joint Director, K. Jagadeesan, had said that the except for a few, most of the lacunae pointed out in the two aforementioned letters remained unaddressed to date.\n\nThe students continued to suffer without toilet and laboratory facilities. The management had appointed honorary teachers but had failed to pay their salaries.\n\nTo resolve the issue, his office had held several rounds of discussions but there had been very little progress. The students and non-teaching staff had made several representations to this office for suitable action and it was also on that basis that he made the suggestion for appointing special officer.\n\nOn February 3, 2016, around 150 students had gathered at his office and protested. They gave up the protest only after he had promised to reiterate his recommendation of appointing a special officer and convene a meeting on February 5 involving them, representatives of college management, police and government officials, the Regional Joint Director said.\n\nFurther, the officer had also said that despite getting government grant, the College management had acted against government rules and in a manner that would affect the students, teaching and non-teaching staff.\n\nIn response to the letter, the College Secretary C.M. Ramraj said that he was not aware of any such recommendation in the issue. If at all the officer had written to the government, the latter cannot act because there’s a court order staying appointment of special officer.", 
    "section": "national", 
    "title": "Take over CBM College, government told", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}