{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Vigneswara pooja, 6 p.m.\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, moolavar-utsavar serthi thirumanjanam, 9 a.m.; vaidyatri, pushpa palakku, 7 p.m.\n\nSri Varasiddhi Vinayagar Temple: “Srimad Ramayanam” by V. Mani, Ganapthy Nagar, Thiruvanaikovil, 6 p.m.\n\nSrimad Ubhaya Vedantacharya Peetam: “Bhagavata Dasamaskandam” by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Vasudeva Perumal Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Krishnar Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 58, Vinayagar Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nTamil Sangam: T. Durairasapillai birth anniversary, P. Venkatesan, speaks on ‘Kamban kavinayam,’ Tamil Sangam building, W.B. Road, 6.15 p.m.\n\nSt. Joseph’s College: Paschal programme, “Kalvari nayagan” – sound and light show on the life history of Jesus Christ, Most Rev. Antony Devotta, Bishop of Tiruchi Diocese, presides, Inigo Block, St. Joseph’s College, 6.30 p.m.\n\nTamizhaga Panpattu Kazhagam: Presentation of Raja Kalaingan award to Y.Gee. Mahendra, Sundar Bhattar, inaugurates, Thevar Hall, 4 p.m.\n\nGENERAL\n\nChidambaram Pillai College for Women, Manachanallur: Graduation Day, V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, delivers the graduation day address, 10.45 a.m.\n\nPattali Makkal Katchi: Anbumani Ramadoss speaks on “Agricultural revolution”, A.K. Mahal, Thiruvanaikovil, 6 p.m.\n\nTiruchi District Retired Government Officials Association: Meeting, Bishop Heber Higher Secondary School, Teppakulam, 3.30 p.m.\n\nThe Booksellers and Publishers Association of South India: Book fair, Corporation grounds, Anna Nagar, Thennur, 11 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}