{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector and District Election Officer Sajjansingh R. Chavan monitoring the fixing of tracking device in vehicles allotted for flying squads in Kanyakumari district on Saturday.\n\nOfficials attached to the election department on Saturday began fixing vehicle tracking device to vehicles allotted to the flying squad and static surveillance team officers deputed for election duty.\n\nTechnical staff from a private firm fixed the equipment in all the 36 vehicles (18 each in SST and flying squads) in the presence of the Collector and District Election Officer Sajjansingh R. Chavan.\n\nThe equipment has two components – a global positioning system (GPS) component and a general pocket radio service (GPRS) component.\n\nWhile the former locates and records the vehicle position using latitude-longitude coordinates, the latter sends the recorded data to the server.\n\nOfficials at the District Election Office and zonal election offices would get to track the movement and gather details of vehicles under their command based on the access, the equipment manufacturers’ give, sources said.\n\nThe district officials would get an overall picture while the zonal officials would only get details of vehicles plying in their respective zones on real-time basis.\n\nThe equipment have been designed in such a way that if the vehicles were static or switched off, the last recorded location was sent to the server and in relaying the information there would only be a minute’s delay.\n\nThe objective was to communicate information to the teams to reach to the nearest troubled spot based on their presence on real-time basis, the officials added.\n\nIn addition to this, a Media Certification and Monitoring Committee is on the job monitoring paid news in newspapers. Steps have been initiated to take action on election related complaints.\n\nSpecial Tahsildhar (Election) Subramanian and Personal Assistant to Collector (General) P. Rajendran were present.\n\nWhile one locates and records vehicle position using latitude-longitude coordinates, the other sends data\n\nto server", 
    "section": "national", 
    "title": "Tracking device fitted to vehicles of flying and surveillance squads", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}