{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Salt traders of Tuticorin are unhappy over the prevailing market for the commodity. Shipment of large quantities of manufactured salt from Gujarat, the largest salt producer in India, to Thoothukudi, the biggest contributor of salt in Tamil Nadu, has had an impact on the local market, according to M.S.P. Thenraj, president, Thoothukudi Thanpadu Uppu Ettrumathi Viyabarigal Sangam.\n\nMoreover, required quantity of salt is not available here since its production had declined considerably last year, following rains. While the demand for salt grew during the period, its prices shot up.\n\nSubsequently, many stakeholders did not hesitate to purchase salt from Gujarat. Aggravating the situation, ‘Amma Salt’, which was supplied through fair price shops at a subsidised price in Tamil Nadu, and a similar arrangement in Karnataka affected the trade much. “Earlier, salt from Thoothukudi was supplied to Kerala, Andhra Pradesh and North Karnataka. But now Gujarat has gained control over the market in Tamil Nadu as well as the other States. To overcome this trend, the manufacturers here should come up with improvements both in quality as well as quantity,” he told The Hindu here on Saturday.\n\nZonal scheme\n\nT.S.P. Jeyabalan, secretary of the Sangam, said that when the ‘Zonal Scheme’ was in force, Thoothukudi enjoyed the monopoly of supplying salt to Kerala, Karnataka, Andhra Pradesh and Orissa.\n\nDescribing it as a ‘golden period’, he said around 300 truckloads of salt were transported daily to other parts of Tamil Nadu and other States.\n\n“Currently, only less than 100 trucks are transporting salt everyday from Thoothukudi. However, it has been a bitter experience for salt traders after the Zonal Scheme was scrapped on March 31, 2002. The scheme should be re-implemented to support the salt traders,” he opined.\n\nRegain lost market\n\nS. Petchimuthu, salt manufacturer, said that not only the domestic market but also the international market had suffered a blow as export of Thoothukudi salt was not encouraging. Since many importers were not happy with quality of manufactured salt, the flagship product of Thoothukudi had earned a bad reputation. Only when export market for salt was in the boom, manufacturers and traders could satisfy the buyers with the best quality and value. Hence, the manufacturers were looking for budding exporters to regain lost market, he said.", 
    "section": "national", 
    "title": "Traders not happy about salt market trend", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}