{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Discrimination of Dalits, particularly women, has risen for the last five years in the State that neither the government nor the judiciary has come to their rescue.\n\nVarious speakers condemned this attitude and called for a perceptible change at least in the future, which may give a new life for the downtrodden.\n\nThe government may claim that it has given space for the Dalits in politics. But in reality, none of the woman elected representatives in local bodies has been allowed to function with freedom. Since there is undue delay in getting legal relief, the offenders have been encouraged to humiliate Dalits.\n\nEvidence, an NGO, which has been fighting for the cause of the Dalits, conducted a seminar on ‘Justice for Dalit Women’ here on Saturday where advocates, social activists and research scholars spoke.\n\nAdvocate Nirmala Rani said that atrocities, especially, honour killing crimes, had become common in Tamil Nadu. Only by taking a stern action against the offenders, the social evil could be prevented. Not only was a girl killed, but her parents or relatives, who were behind the crimes, too went scot-free. This was atrocious and the judiciary should intervene, which alone would give some hope and security to the downtrodden, she appealed.\n\nA few of the victims, who had experienced humiliation in the hands of caste Hindus and a few other communities in the society, narrated their tales.\n\nA Dalit woman, who was holding a position in a village panchayat, was successfully prevented from discharging her duties. She was not even allowed to sign the official records. Such was the discrimination and the custodians of law only tried to bring in a “compromise” and refused to register a case, she alleged.\n\nThough the country had been identified as secular and was known for its different culture and languages, caste played a big role that Dalits were deprived of their rights. As a result, Dalit participation in political system had been either marginal or neglected. They were not offered education as well.\n\nFrom time immemorial, Dalits had been sidelined on some pretext or the other and thus it became easy for the dominant community to have an upper hand, A. Kadir, Executive Director, Evidence, said, adding that crimes such as sexual harassment were on the rise. At a time, when Dalits were facing poor economic conditions, discrimination had only made their lives more miserable. The victims looked for justice and judicial intervention alone would prevent atrocities against them, he pointed out.", 
    "section": "national", 
    "title": "“Woes of Dalit women on the rise in last five years”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-13"
}