{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Fisheries department has provided life jackets for all of them\n\nEscorted by the Indian Coast Guard (ICG) and Coastal Security Group (CSG), a total of 3,249 pilgrims — men 2,401, female 694, male children 89 and female children 65 — sailed for the annual St Antony’s Church festival at Katchatheevu, even as the local and Q branch police denied permission to about 20 pilgrims for want of proper records.\n\nThe pilgrims sailed in 92 mechanised boats from the fishing jetty here on Saturday morning after completing immigration and customs formalities and obtaining security clearance from the district police, Q branch police and Intelligence Bureau (IB).\n\nCSG Additional Director General of Police (ADGP) C. Sylendra Babu, who reviewed the safety and security arrangements with Superintendent of Police N. Manivannan, escorted the first batch of pilgrims up to the International Maritime Boundary Line (IMBL) and ensured that the 24.9-km voyage was safe for the pilgrims.\n\nThough the fisheries department provided life jackets for the all pilgrims, the CSG deployed a team of swimmers and divers to come to the rescue of the pilgrims in the event of any untoward incident.\n\nThe pilgrims left in batches, escorted by the ICG and CSG personnel up to the IMBL. The first boat left at 6 55 a.m. and the last and 92nd boat at 2 p.m., police said.\n\nThe ICG positioned three ships at the IMBL and monitored the handing over the pilgrims to the Lankan navy, while the Mandapam Station of ICG deployed its Air Cushion Vehicle (ACV) 190 and three interceptor boats for search and rescue operation in case of any emergency, its Commandant H.H. More told The Hindu .\n\nThe local and Q branch police denied permission to 20 pilgrims, including a Lankan Tamil refugee’s wife, a local Tamil and two children after screening their identity and address proofs.\n\nRev L. Sagayaraj, Verkodu Parish Priest and chief coordinator of the pilgrimage, sailed in the last boat after coordinating with the revenue and police officials. The pilgrims would return by Sunday afternoon after attending the Feast Mass in the islet, he said.", 
    "section": "national", 
    "title": "3,249 pilgrims leave for St. Antony’s Church festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}