{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Rameswaram temple authorities and the district police have made elaborate arrangements for the Mahamaham festival, scheduled to be held at the sacred ‘Jada Maguda Theertham” on the Danushkodi road, about 13 km from here, on Monday.\n\nTens of hundreds of devotees are expected to throng the ‘Jada Maguda Theertham Siva Temple’ when the once-in-12-years festival, coinciding with the Kumbakonam Mahamaham festival was organised, S. Selvaraj, Joint Commissioner, and K. Mayilvahanan, Assistant Divisional Engineer of the Sri Ramanathaswamy Temple, said.\n\nLord Ram washed off his hair (jada) in the tank after killing Ravana to purify himself, according to religious belief.\n\nThe temple authorities have installed 50 sprinklers around the tank for sprinkling holy water drawn from the ‘Jada Maguda Theetham’ tank during the festival, which would begin after the ‘Theerthavari’ festival at 11 a.m. after the ‘Panchamoorthy’ procession reached the temple tank, they said. The Mahamaham festival would commence at 12.05 pm, they said.\n\nThe Sri Ramanathaswamy temple would be closed in the morning after Lord Ramanathaswamy and his consort Goddess Parvathavardhini would be taken out in a procession to the Jada temple, they said.\n\nAs they made arrangements for sprinkling of holy water, devotees would not be allowed to enter the temple tank, they said. Wooden barricades have been erected for the devotees to offer worship at the temple and a shower has been installed at the temple entrance for the benefit of the devotees, who missed the sprinkling of holy water, they said.\n\nCollector S. Natarajan and Superintendent of Police N. Manivannan held a meeting with the temple authorities here on February 17 and reviewed the security arrangements for the festival. Police expected about one lakh people to take part in the festival and made elaborate security arrangements. They have installed 22 CCTV cameras as part of the security arrangements. The local municipality has arranged drinking water and set up temporary toilet facilities for the devotees.", 
    "section": "national", 
    "title": "All ready for Mahamaham festival tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}