{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Poonamallee Municipality does not have a proper drainage system and often lets sewage into Cooum river\n\nFor several years now, Poonamallee Municipality has been struggling to dispose of sewage and often lets untreated sewage into the Cooum river.\n\nThe delay in providing an underground sewage network has further aggravated this problem for the past few months.\n\nThe local body, which does not have a proper drainage system, conveys the sewage through the neighbouring localities of Senneerkuppam and Mangadu before releasing it into the Cooum river. For the past few days, motorists travelling along the Avadi-Poonamallee Road near the Seneerkuppam junction have been put to severe hardship as they have had to deal with overflowing sewage on the road.\n\nSources in the Poonamallee municipality said sewage often overflowed to the road as the drain carried more than its capacity and some companies also illegally connected their sullage. Residents of Senneerkuppam panchayat often objected to sewage being carried through their area and frequent overflows.\n\nTo put an end to the problem temporarily, the municipality, along with the State Highways Department, is laying a pipeline for nearly one km along the Avadi-Poonamallee road to convey sewage.\n\nG.R. Thirumalai, Poonamallee Municipality chairman, said the population in Poonamallee had grown to nearly 60,000 and nearly eight million litres a day (mld) of sewage was being generated. “We plan to complete the work to lay the pipeline in a few days and resolve the sewage management problem temporarily. There may not be any more sewage overflows on the roads,” he said.\n\nIt may be recalled that the proposal to provide underground sewer network was mooted four years ago. However, the local body has been made part of a cluster of 12 areas, including Mangadu, Vanagaram, Mowlivakkam, Iyyappanthangal and Paraniputhur, that will have an integrated sewer network. A detailed project report is being prepared to design the network to collect and treat a minimum of 33 mld of sewage in these cluster areas. Sources in Poonamallee Municipality said there was no expertise or facility to treat the sewage. Though flow from domestic septic tanks is partially prevented from entering the Cooum river, many local bodies are polluting the waterway with untreated sewage for want of better infrastructure.\n\nThe government must expedite steps to implement the scheme to prevent pollution of the waterway.", 
    "section": "national", 
    "title": "An ongoing struggle with untreated sewage", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}