{
    "author": [
        "R Sivaraman"
    ], 
    "text": "The State Consumer Disputes Redressal Commission, Puducherry has directed an anaesthetist to pay Rs.15 lakh compensation to the family members of a person who died due to medical negligence in 2002.\n\nThe Commission comprising of its president Justice K.Venkataraman, members- K.K.Ritha and S.Tirougnanassambane passed the order on an appeal filed by the bereaved family seeking to order compensation.\n\nTo remove stone\n\nfrom gall bladder\n\nKanniakumar was advised by the specialist to undergo surgery to remove stone from the gallbladder. The surgery was fixed on July 27, 2002.\n\nAt 1.00 p.m, the specialist and the anaesthetist were present at the operation theatre.\n\nAt 3.00 p.m., the patient's relatives were informed that the operation would be completed in an hour.\n\nAfter some time, they stated that the operation could not be continued because the patient had complicated cardiac problem.\n\nA cardiologist who was called in, declared that the patient had died long back. The relatives of staged a protest and a case was registered.\n\nComplaint filed\n\nThe family members filed a complaint before District Consumer Disputes Redressal Forum, Puducherry for compensation from the nursing home, the specialist and anesthetist. The District Forum dismissed the complaint. Hence, the family members filed an appeal before the commission.\n\nHolding that the managing director of private nursing home was not liable to pay any compensation, the commission pointed out that he had only leased out the second floor of complex to the urology clinic.\n\nThe commission said that the patient had collapsed even before the specialist began his work and therefore he was left off.\n\nIn the judgement, Ms. Ritha noted, “A simple surgery had turned out to be fatal for a patient who had no health problems as per his medical records. Simple anaesthetic procedure turned out to be complicated due to the lackadaisical attitude of the anaesthetist. We have observed that two failed intubations, hypoxia and also plenty of medicines were pumped into the body of patient. When everything failed, tracheotomy was also done. Finally, it was beyond the control of the concerned doctor to save the life. Thus, the lapse on the part of anaesthetist amounts to medical negligence.”\n\nSimple procedure turned complicated due to lackadaisical attitude of the anaesthetist", 
    "section": "national", 
    "title": "Anaesthetist directed to pay compensation for medical negligence", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}