{
    "author": [
        "D Madhavan"
    ], 
    "text": "National Research Laboratory for Conservation of Cultural Property to restore murals on domes at Madras HC\n\nFor years, salinity in the breeze wafting in from the Bay of Bengal and pigeon droppings have been affecting the murals on the onion-shaped domes of the Madras High Court building.\n\nThose weather-beaten paintings will, for the first time, get a new lease of life soon as the Lucknow-based National Research Laboratory for Conservation of Cultural Property (NRLCCP), an organisation under the Union Ministry of Culture, will restore the paintings.\n\nThe Rs.2.70-crore project, which will be funded by the State government, will be monitored by the High Court Heritage Committee headed by Justice R. Sudhakar of Madras High Court.\n\nThe North Presidency division of Public Works Department (PWD) will coordinate with the NRLCCP in the restoration work.\n\n“We are waiting for the government’s nod, which is expected soon. Once the order is passed, we will issue tenders for the work,” an official at the Madras High Court told The Hindu . At present, the single-storey High Court building, which has 13 court halls on each floor, has a total of 24 domes of which paintings were found only on 20 domes by the expert team of the NRLCCP. The paintings on the other four domes have been destroyed.\n\nThe NRLCCP will restore the existing murals. The domes were constructed using fired bricks with three layers of lime plaster. Except for the large dome, which is around 40 metres high, the domes are around 20 metres tall. The entire conservation work will be done in five phases in a span of three years. Initially, paintings on domes 3, 4, 5 and 6 will be taken up.\n\n“Salt particles are the major reason for the damage to heritage structures. Such buildings that face the sea should be restored at least once in five years,” said V. Jeyaraj, former curator, Government Museum (Egmore).\n\nInterestingly, PWD officials found original paintings last year on the walls and roof of Raja Mannar Hall during routine maintenance work of the ‘Madras Terrace,’ a roof style followed in the city during the British era. Restoration of the paintings at Raja Mannar Hall will also be taken up simultaneously.", 
    "section": "national", 
    "title": "At long last, a touch of colour to HC murals", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}