{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bharat Heavy Electricals Limited, Tiruchi, on Saturday despatched the first main ceiling girder of its new fully bolted design for the 3x660 MW super critical steam generator being supplied by it to NTPC’s North Karanpura Thermal Power Station at Tandwa in Jharkhand.\n\nThe massive consignment was flagged off by S. Gopinath, Executive Director, BHEL Tiruchi, at a function held at BHEL’s outsourcing partner Master Fab Engineering Industries at Devarayneri.\n\nAccording to a BHEL release, the ceiling girder assembly is the main load-bearing structure which supports the entire set of boiler pressure parts which are suspended from it.\n\nEach 660 MW boiler at North Karanpura project will have seven such main girders weighing 56 tonnes measuring 33 m in length, 4.5 m in height, flange thickness of 115 mm and are largest sizes supplied by BHEL so far. The structure will have three end girders and 109 cross beams.\n\nA total of 12,196 high tensile bolts in seven different sizes are used to bolt the structure together. High precision, accurate alignment and the multiplying effect of close tolerances are the challenges faced in the fabrication and drilling of bolted structures.\n\nMr. Gopinath commended the joint efforts of BHEL officials and Master Fab Engineering Industries in completing the new design girder which will reduce the quantum of welding at the site to a great extent without compromising the strength of the structure.\n\nM. Murugaiah, General Manager, Outsourcing, BHEL, appreciated the efforts of Master Fab Industries in meeting the delivery schedule and adhering to the high quality standards that BHEL equipment were required to maintain.\n\nG. Mathivanan, General Manager, Quality, R. Rajamanohar, General Manager, Planning & Development and Central Planning Group, K.S. Mariappan, Additional General Manager, NTPC, N, Venkat Rao and N.Jagan Mohan Rao, Managing Partners, Master Fab Industries, spoke.", 
    "section": "national", 
    "title": "BHEL despatches ceiling girder", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}