{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bookings for BuildMat 2017, an international biannual Construction and Interior Fair organised by Coimbatore chapters of three professional bodies in the construction industry, Builders Association of India (BAI), The Indian Institute of Architects (IIA) and Association of Consulting Civil Engineers (India) (ACCE (I)), will begin on Monday.\n\nThe construction industry plays a key role in the economy and employs over 30 million people.\n\nThe pressing need for infrastructure development has increased the demand of the construction industry in India.\n\nThe construction industry is poised to enter its next phase of growth. BuildMat 2017 has been aptly timed to enable participants to spearhead the growth of their brands, according to BuildMat 2017 chairman G. Ramamoorthi, secretary C. Prabhakar and treasurer S. Balakrishnan.\n\nBuildMat 2017, the eighth in the series of its successive exhibitions, will be held at CODISSIA Trade Fair Complex for four days from February 2, 2017.\n\nStalls\n\nThe fair will have over 400 fully air conditioned stalls in Hall A, B and C in a layout with facilities matching international standards.\n\nThere will be several outdoor stalls for construction machinery and equipment. A separate section is being earmarked for overseas participants.\n\nThe business lounge at the fair will facilitate deals through detailed discussions. All the three organising bodies will conduct conferences and seminars as concurrent events which will bring in their professional members from all over the country.\n\nThe fair is expected to attract around 5,000 industry professionals and over 50,000 business visitors.\n\nExhibitors from areas such as architecture and engineering, machinery and equipment, interiors, realty, building materials, construction technologies, raw material manufacturers, and sanitary and plumbing will be taking part in the event.\n\nThirteen national and regional construction industry organisations and trade bodies are supporting the fair. The fair helps construction professionals and actual users of constructions keep abreast of the evolving trends in the global and regional arena.\n\nThe bookings will be launched at The Residency Towers. R.Srinivasan, managing director, Saint Gobain India Private Limited, Ajit Sabnis, president, Association of Consulting Civil Engineers(I) and D. Nandakumar, president, The Indian Chamber of Commerce and Industry, Coimbatore, will take part.", 
    "section": "national", 
    "title": "Bookings for BuildMat 2017 to begin tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}