{
    "author": [], 
    "text": "RELIGION\n\nBhagavatham: B. Sundar Kumar, Sanskrit College, Mylapore, 4 p.m.; Gomatam Madhavachari, Aasthika Samajam, Venkateswara Nagar, Pozhichalur, 5 p.m.; Kidambi Narayanan, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.\n\nGita: R. Aravindan, Andhra Mahila Sabha,, Luz, Mylapore, 7.30 a.m.; Satyaprabhananda, Ramakrishna Mission Ashrama, T. Nagar, 5.30 p.m.\n\nVishnu Sahasranamam: Sudha Seshayan, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nBhakti and Jayadeva’s Astapadis: Sujata Mohapatra, Sri Vishnu Mohan Foundation, 7/15, New Giri Rd., T. Nagar, 6 p.m.\n\nCULTURE\n\nTamil Nadu Eyal Isai Nataka Manram: Poongaavil Therukoothu programme on ‘Keechakan Samhaaram’, Nageswara Rao Park, Mylapore, 6.30 p.m.\n\nHindu Munnani, Chennai City: Release of DVD, Guru Balaji Thirumana Maligai, Sundaram St., T. Nagar, 10 a.m.\n\nPavithram and Tejas Foundation: Release of publications, Gokale Sastri Hall, Karpagambal Nagar, Mylapore, 10 a.m.\n\nGENERAL\n\nOrganising Committee: Homage to K.Padmanabhan, former vice president TI Cycles of India, ISTD hall, Nelson Manickam Rd., 4 p.m.\n\nIDP Education: Education fair, ITC Grand Chola, 11 a.m.\n\nVelammal Institute of Technology: Alumni meet, Panchetti, 10 a.m.\n\nRotary Club of Madras South and Tamil Nadu Differently-Abled Federation Charitable Trust: Inauguration of coaching centre for differently abled persons, 10, 4th Cross St., Balaji Nagar, Ekkatuthangal, 10.30 a.m.\n\nTamil Nadu Investors Association: SEBI’s securities awareness programme, PS HSS., Mylapore, 10 a.m.\n\nSpartan Educational Events and Services: Spartan Spelling Bee zonal level competition, MCC HSS., Harrington Rd., Chetpet, 9.30 a.m.\n\nNorth Gopalapuram Residents Welfare Association: Lecture cum demonstration on ‘Home Waste Management’, Ganapathy Girls HS, Gopalapuram, 4 p.m.\n\nHindu Theological High School: Mega Telugu old boys meet, Indian Officers Association, Royapettah High Rd., 10.30 a.m.\n\nMadarasu Telugu Abhyudaya Samajamu: International Languages Day celebrations, Arani Gangan St., Old Washermenpet, 9.30 a.m.\n\nAll Indian Social Service Association and Hindu Mission Hospital: Medical Camp, St. Patricks Church, Butt Rd., St. Thomas Mount, 9 a.m.\n\nNarcotics Anonymous: Meetings, Good Company Group, St. Teresa Church, Nungambakkam, 11 a.m.; Miracle of Marina Group, Chennai School, Venkatarangam Pillai St., T. Nagar; and Circle of Life Group, Annai Velankannai Church, Besant Nagar, 7 p.m.\n\nAl-Anon: Meetings, Holy Angels Convent, T. Nagar, 11 a.m.; Rise and Redeemers Church, United India Colony, Kodambakkam, 4 p.m.; St. Francis Xavier Church and ‘Sri Sathya Sai HSS., Theradi, 6 p.m.; Kesari HSS. T Nagar; and CSI Wesley Church, Poonamallee, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Assemption School, St. Teresa Church, Nungambakkam, 10.30 a.m.; St. Mathias Church, Kamarajar Salai,, K.K. Nagar; ECI Church, Dr. Ambedkar St., Arumbakkam; and C.S.I. School, Gandhi Main Rd., Oragadam, Ambattur, 11 a.m.; Dr. Boaz Memorial Hospital, Velachery Rd., Selaiyur; Infant Jesus church, Manali New Nagar, Manali; C.S.I. Peters Church, Vyasarpadi, 11.30 a.m.; St. Francis Xavier Church, Broadway, 6 p.m. Kesari HSS., T. Nagar; Police Boys Club, Chinmaya Nagar; Sri Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Singaram Pillai Boys HSS., Villivakkam; Arul Kadal, Santhome High Rd.; and St. Infant Teresa Church, K.K. R. Avenue, Sembium, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}