{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Rathina Vinayagar Thirukovil, D.B. Road: Sri Natarajar special pooja, 10 a.m.\n\nRaj Vidya Kender: Discourse on Inner Peace, Ardra Hall, Huzur Road,\n\n11 a.m.\n\nGnanavani Sangam and Kovai Arya Vaidhya Pharmacy Ltd: Oration on Bakthi Yogam, Dhanvantri Temple, Olympus, 6 p.m.\n\nGENERAL\n\nY’s Men’s Club of Coimbatore and Coimbatore Institute of Technology: Mini Marathon 2016, Coimbatore Institute of Technology, 6 a.m.\n\nCoimbatore Acme Round Table 133: Tiger Run 2016, around Coimbatore Golf Club, Chettipalayam, 6.30 a.m.\n\nAvila Convent Matriculation Higher Secondary School, Project Deepam, Ramakrishna Hospital, BRJ Ortho Centre, MAK Hospital and Rotary Club of Coimbatore Down Town: Free health camp, Avila Convent School, 9 a.m.\n\nJudicial Department: Inaugural of Tamil Nadu State Judicial Academy, Race Course, 9 a.m.\n\nThe Indian Chamber of Commerce and Industry: Start-Up India – Start-Up Expo and Conference, ‘C’ Hall, CODISSIA Trade Fair Complex, 9 a.m.\n\nRanganathan Educational Institutions: Diploma Job Fair ’16, 9 a.m.\n\nSLV Hospital, Sulur Lions Club and Bank of India: Free medical consultation camp, Lions Hall, Kalangal Road, Sulur, 9.30 a.m.\n\nGCT Alumni Association: GCT Alumni Centre, 10 a.m.\n\nCoimbatore Corporation, Green Global Trust, Sacon and Animal Rescuers: Inauguration of Urban Nature Interpretation and Education Centre and Wetland Day Celebrations, Singanallur Boat House, 10.30 a.m.\n\nDr. R.V. Arts and Science College, Mettupalayam: Felicitation to outgoing students and parents, 10.30 a.m.\n\nKalam Literary Meet: 39{+t}{+h}meet, S.P. Narasimalu Naidu High School, near Marakadai Bus Stop, 10.30 a.m.\n\nDr. J.K.P. Medical Center and Indian Medical Association: Dr. J.K. Periyasamy Endowment Oration on Preventive Cardiology, IMA Hall,\n\n12 p.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}