{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "After four days of protesting this month, organisations working for disability rights called off their agitation on Saturday afternoon and welcomed the Chief Minister’s announcement that met some of the demands they had struggled for.\n\n“We welcome the move to extend financial assistance to those with 40 per cent and above disabilities. The removal of the ‘destitute’ clause and the setting up of a committee to monitor the implementation of welfare schemes are moves in the right direction,” said S. Nambu Rajan, State general secretary, Tamil Nadu Association for the Rights of All Types of Differently Abled & Caregivers, one of the four organisations involved in the protest.\n\nOn setting up of a State coordination committee headed by Social Welfare Minister, Smitha Sadasivan, member of the Disability Rights Alliance, Tamil Nadu, questioned what had happened to the State coordination committee for so long.\n\n'Non-functional'\n\n“The committee had earlier been set up but has not been functioning for several years. We have made repeated queries but were always told that it was ‘under process.’ Why has the government not been transparent about the committee and its procedures so far,” she asked.\n\nWhile appreciating the move to provide support to those with 40 per cent and above disabilities, Ms. Sadasivan said the government should also provide for social protection to those with high-support and other needs.\n\nMaheshwari Thangaraj of the Society for Rights of All Women with Disabilities said the announcements were good but implementation should start as soon as possible to benefit the community.\n\n“We hope that the government will also take into consideration our other demands such as setting aside funds for accessibility and providing housing for those with disabilities,” Mr. Nambu Rajan added.\n\n‘Govt. should also provide for social protection to those with high-support and other needs’", 
    "section": "national", 
    "title": "Disability rights activists call off stir, welcome announcement", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}