{
    "author": [], 
    "text": "MINISTER travels with people in the new bus service\n\nThe presence of actor Tapsee at the inauguration of a new jewellery showroom in Salem city gave some tense moments to the city police.\n\nA large number of film enthusiasts gathered in front of the showroom at Swarnapuri much before Tapsee arrived.\n\nAs soon she arrived, the young and old vied with each other to have a glimpse of the star.\n\nThe police had a tough time in controlling the crowd and they dispersed only after Tapsee came out of the showroom and waved to the crowd and left the venue.\n\nThe highlight of the inauguration of Tamil Nadu State Transport Corporation bus service in the new Sankagiri – Pachampalayam – Erode route was P. Thangamani, Minister for Industries and Transport, himself travelling in the maiden service.\n\nThe residents of Allinayakkanpalayam, Pachampalayam, Goundanur, Nathamedu villages in Padaiveedu town panchayat in Namakkal district have been demanding direct bus service to Erode.\n\nMr. Thangamani recently inaugurated the bus service on this new route at Sankagiri and travelled in the bus from India Cements bus stop to Ammankoil stop, much to the delight of the passengers.\n\nSelvakumara Chinnaiyan, MP (Erode), too travelled with the Minister.\n\nThe residents of Vengamedu village near Paramathivelur in Namakkal district witnessed a different kind of ‘s eer procession’ recently.\n\nThe alumni of the Government Middle School in the village along with people took out the ‘ seer procession’ to the school to thank their alma-mater. The school has been producing good results and the enrolment of students is on the increase year by year. The local people created drinking water facility, constructed additional class rooms and also compound wall.\n\nAs a thanksgiving gesture, they took out a ‘ kalvi seer ’ procession carrying books, notebooks, uniforms, and all other things needed for the poor students and handed over the same to the school authorities.\n\nReporting by\n\nSyed Muthahar Saqaf\n\nin Salem", 
    "section": "national", 
    "title": "Fans keep police on their toes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}