{
    "author": [
        "Staff Reporter"
    ], 
    "text": "If wishes were horses, Bangalore Development Authority (BDA) would like to build a grand tri-junction flyover to decongest the traffic bottleneck at K.R. Puram junction at an estimated cost of Rs. 630 crore.\n\nThat is the solution the development authority pitched to Bengaluru Development Minister K.J. George on Friday.\n\nBefore the BBMP elections in 2015, Chief Minister Siddaramaiah, during his city rounds, had directed the BDA to conduct a traffic study and put up a concept note to decongest the junction. The flyover is their answer to the problem.\n\nP.N. Naik, member, Engineering, BDA, told The Hindu that the flyover now planned would have three up and down two-way ramps with one exclusive down ramp, all adding up to a length of 6 km.\n\n“It will start from Gangenahalli, take a left to form a tri-junction near the K.R. Puram railway line, where vehicles can take a left turn towards ITPL and a right turn to move towards Marathahalli on Outer Ring Road. Vehicles coming from Marathahalli can either move towards Hebbal and the city,” he explained.\n\nThough Mr. George approved of the concept note and praised it as a good solution, there seems to be nothing concrete on the source of funding for the project.\n\n“It is a preliminary concept note stage and the detailed project report will be prepared in two months,” Mr. George said. Traffic expert M.N. Srihari agreed that an intervention was needed at the junction to free the bottleneck, and added that the proposed flyover network would only ease the bottleneck at the spot.\n\nMeanwhile, infrastructure expert Ashwin Mahesh said a mere road solution was inadequate and the need of the hour was a hybrid solution involving the Railways too.\n\nThe detailed project report will be prepared in two months, says\n\nK.J. George", 
    "section": "national", 
    "title": "Flyover is BDA’s solution to decongest K.R. Puram junction", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}