{
    "author": [
        "Sruthisagar Yamunan", 
        "V Venkatasubramanian"
    ], 
    "text": "Desiya Murpokku Dravida Kazhagam leader Vijayakant on Saturday said his party wanted him to be a 'king' in Tamil Nadu politics, rather than a ‘kingmaker’, indicating that his party would lead an alliance or enter into an agreement with parties that would support his candidature for the Chief Minister's role.\n\nSpeaking before him, his wife Premalatha indicated the same thing in as many words. Both of them threw questions at the crowd and elicited the response that favoured Mr. Vijayakant as the Chief Minister. This also means that he has virtually shut the doors on the DMK which has been seeking to rope him into its alliance with the Congress.\n\nMr. Vijayakant said he was no longer willing to “pawn” his outfit and its cadres. Speaking at the mega party rally here, Mr. Vijayakant, on multiple occasions, asked the crowd if he should be part of an alliance. As an overwhelming majority responded negatively. “Should I be the King or the Kingmaker,” he asked the huge crowd. When they shouted ‘King’, he said “Oru panai sotruku oru soru padham,” indicating that this reflected the opinion of the entire party.\n\nHowever, he was quick to add that he would solicit the views of his party leaders over the next few days.\n\nBut it was Ms. Premalatha’s speech that added credence to the view that the DMDK might keep away from the DMK. “The corrupt DMK and AIADMK have converted the State into a burial ground,” she charged.\n\nSlamming the AIADMK government, Mr. Vijayakant alleged that economic growth had slumped. He dared the ruling party to go it alone in all the 234 constituencies.\n\nEarlier, Mr. Vijayakant released a part of the DMDK’s election manifesto. A smart village scheme in the name of former President APJ Abdul Kalam would be launched under which a monthly income of Rs. 25,000 would be ensured for one individual in every household, he said.", 
    "section": "national", 
    "title": "I want to be the king, not kingmaker, says Vijayakant", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}