{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A high-level team from the National Inspection and Monitoring Committee (NIMC) raided an illegally run scan centre at Attur and seized equipment here on Thursday.\n\nThe scan centre, run by R. Dhamayanthi, a doctor at Primary Health Centre in Thalaivasal, was already suspended for revealing the foetus of a patient and the case is pending in the court.\n\nThe centre, attached to the private hospital, was functioning on Kamarajar Road in Attur.\n\nIn September, 2015, a pregnant woman from Perambalur district underwent scanning at the centre where doctors revealed that the foetus was female which is in violation of Pre-natal Diagnostic Techniques (Regulation and Prevention of Misuse) Act, 1994. The pregnancy was terminated by a surgery and she died later.\n\nFollowing complaints, Perambalur District Collector, Darez Ahamed, informed Salem Collector, V. Sampath, about the incident and a team led by Joint Director of Medical Services R. Vijayalakshmi inspected the scan centre on September 16, seized the equipment and sealed it. However, the doctor purchased new equipment and continued running the centre illegally.\n\nFollowing a complaint, a 15-member team inspected the scan centre and seized the machines and re-sealed it. Officials said that the centre was sealed in 2014 for revealing the foetus of a patient and case was filed in the court.\n\nFine\n\nAfter the doctor paid Rs. 1,000 as fine in the court, the centre was opened.\n\nHowever, the centre continued functioning violating the norms, they added.\n\nDr. Vijayalakshmi told The Hindu that the centre was sealed twice for violations and the Director of Public Health Service was informed about the doctor.\n\n“The team will submit report to the authorities concerned after which action will be initiated against the doctor”, she added.", 
    "section": "national", 
    "title": "Illegal scan centre run by Govt. doctor sealed for third time", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}