{
    "author": [
        "L Renganathan"
    ], 
    "text": "Officials say nearly 20 lakh have visited the Mahamaham tank since February 13\n\nThousands of pilgrims made their way into Kumbakonam on the eighth day of the Mahamaham 2016 rituals on Saturday. Being a weekend, there was heavy rush of pilgrims in the Mahamaham tank, Portraramari Tank, and the Chakra Padithurai bathing ghat on the Cauvery banks in the temple town that is now sporting a seamless fabric of enthusiastic pilgrims. More than 20 lakh pilgrims have taken part in the rituals over the past eight days, according to one estimate.\n\nThe devotees were thronging the important spots related to Mahamaham and the numerous temples in Kumbakonam since early morning. Despite restrictions coming to impede free movement of vehicles and in spite of buses dropping outstation pilgrims in the seven temporary bus stations that were operated from Saturday, the enthusiasm of the elderly and the young, men and women in all hues was seen to be believed as they did not mind legging their way through the maze of crowds to reach the Mahamaham tank and other locations.\n\n“We could come only today as we had to work all through the week. In fact, I sought and got my week's wages from my boss insisting that my family must go to Kumbakonam for Mahamaham and here we are. We understand the difficulty of allowing vehicles too close to the town area and we are happy to trek our way through the crowds,” said C. Senthilnathan of Chennimalai in Erode district and a powerloom unit worker who had brought his parents, wife, and child to the Mahamaham.\n\n“I had walked long distances during the previous two Mahamahams to reach the sacred tank and other temples. But this time, it seems that a significant distance has been reduced from the bus stations to the tank and autorickshaws are also plying. Thank god I'm able to visit yet another Mahamaham,” said a septuagenarian V. Sadagopan of Thiruppathiripuliyur in Cuddalore district. The shuttle service arrangement for the elderly and the differently abled was good but they could not leave their dependants in the congregation, he said.\n\nOfficial sources indicate that the number of pilgrims who would have visited this Mahamaham 2016 would have crossed the 20 lakh mark on the eighth day of the festivities. With Sunday and Monday to go, the peak crowd is expected over the two days.\n\nThe sources said that peak crowd gathering of more than 13,000 devotees entered the Mahamaham tank around 7 a.m. on Saturday, exceeding the previous day's peak figure of 10,500 early in the morning.", 
    "section": "national", 
    "title": "Inflow of devotees expected to peak today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}