{
    "author": [
        "V S"
    ], 
    "text": "Till date, the image of Singanallur lake is that of a defunct boat jetty and a tank full of sewage and water hyacinth. This is all set to change if the initiative beginning on Sunday goes on well.\n\nThe Coimbatore Corporation, Green Global Trust, Salim Ali Centre for Ornithology and Natural History (SACON) and Animal Rescuers are coming together to put the Singanallur lake to some constructive use by opening an Urban Nature Interpretation and Education Centre. Inauguration of the centre also marks the World Wetland Day celebrations.\n\nOn the occasion, a book on ‘Bio-diversity of Singanallur lake’ is also being released and the authors of the book are Vinny R. Peter, L. Joseph Reginald, P. Pramod, R. Mohanraj and M. Murugesan. The event starts at 7 a.m. and the official inauguration of the centre will be around 10 a.m. by Mayor P. Rajkumar.\n\nDuring the inaugural, there will be guided tours on birds, plants, butterflies, dragonflies and Damselflies, demonstration of bird songs and studies, workshop on nature photography, nature painting, photo exhibition on amazing birds of Coimbatore besides planting of saplings and free distribution of educational materials on birds.\n\nOn the choice of Singanallur lake, organisers said that it was ecologically, culturally and economically an important eco system in Coimbatore urban area. Monitoring of the water body over the last ten years indicated the presence of 700 species of flora and fauna and avian species and was found to be a fit choice for connecting people with nature.\n\nActivities planned in near future would include nature walks, guided tours for school students, promoting school level studies and projects related to eco system, conducting nature camps during holidays, promoting nature photography and painting and developing systems for walking and cycling through a natural area.\n\nThere are plans to have events throughout the year, except in September, December, March and April when students will be busy with exams.\n\nThe lake is found to be a host for 675 species including 155 species of birds (28 of them migratory birds), 369 plants (including 165 species of medicinal plants), 60 butterflies, 22 mammals, 21 reptiles, two Amphibians, 10 varieties of fish, 21 varieties of dragonflies and Damselfies and 15 other common life forms.\n\nOf the bird species, 9 are from the Red List of threatened bird species as per International Union for Conservation of Nature (IUCN). The species are Black Bellied Tern (endangered), Lesser Adjutant-Stork (vulnerable) and the near threatened varieties included; Spot-billed Pelican, Darter, Painted Stork, Oriental White Ibis, Pallid Harrier, Black Tailed Godwit and River Tern.", 
    "section": "national", 
    "title": "Interpretation and education centre to come up at Singanallur lake", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}