{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "“State government should weed out anomalies in the 6th Pay Commission”\n\nMembers of Joint Action Committee of Tamil Nadu Teachers’ Organisation (JACTTO) formed a human chain at Palayamkottai on Saturday to highlight their demands.\n\nThey said the State government should weed out pay anomalies in the 6th Pay Commission and reintroduce the older pension scheme by withdrawing the Contributory Pension Scheme.\n\nThe Teacher Eligibility Test (TET) should be scrapped and give all perks being given to the Central Government employees. Fifty per cent of dearness allowance should be merged with basic pay. Services of the teachers working on consolidated pay scheme should be regularised. Special officer should be appointed for distributing the welfare schemes to the students.\n\nThe State Government should give 6 per cent salary hike to those who had 30 years of teaching experience in private schools, they said.\n\nThe protestors, to highlight their demands, formed the human chain between Palayamkottai bus-stand and Palayamkottai Zone office of Tirunelveli Corporation.\n\nSimilar protest was organised in Tuticorin also where the JACTTO members formed human chain near Rajaji Park.\n\nNagercoil\n\nOver 50 members staged a demonstration in front of the Collectorate.\n\nThough the JACTTO planned a human chain agitation, they were given permission only for demonstration owing to another agitation in front of the Collectorate, police sources said.\n\nThe demonstration was presided over by V.L. Benin Devakumar, State general secretary, Promoted Graduate Teachers and Tamil Pandits Association.\n\nThe demonstration was inaugurated by the JACTTO State Committee Member Nagarajan.\n\nA. Mariya Bagya Seelan, district president, Tamil Nadu Higher Secondary Postgraduate Teachers Association, welcomed the gathering. G.P. John Kennedy, Tamil Nadu Teachers’ Federation, proposed a vote of thanks.", 
    "section": "national", 
    "title": "JACTTO members form human chain", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}