{
    "author": [
        "Special Correspondent"
    ], 
    "text": "P. Velmurugan, Registrar (Vigilance), of Madras High Court, giving away the shield to the students of Government Law College, Tiruchi, in a competition on 'Tamil proceedings' in mock court on Saturday. P. Vanangamudi, Vice Chancellor of Tamil Nadu Dr. Ambedkar Law University, and J. Vincent Kamaraj (right), Principal of the College, are with them.— PHOTO: B. VELANKANNI RAJ\n\nThe Tamil Nadu Dr. Ambedkar Law University has sent a proposal to the State Government for creating an exclusive department for translating of government orders being issued by the Central and state government and court judgements into Tamil, said P. Vanangamudi, Vice-Chancellor of Tamil Nadu Dr. Ambedkar Law University.\n\nAddressing students of law college at a State-level moot court contest organised here on Saturday, Dr. Vanangamudi said that there was a strong case for translating thousands of judgements pronounced by the High Court and the Apex court.\n\nA separate department, if created, could be assigned the responsibility of translating all these judgements.\n\nIn this context, he assured that the Law University would extend all help for translating the G.O. and judgements.\n\n“We have experts in Tamil with a sound knowledge in both law and English and will utilise their services for the translation process,” he said.\n\nDr. Vanangamudi said that Tamil language in general and the ancient Tamil literature in particular had codified various rules and regulations which formed the basis for framing Acts.\n\nCiting the verses from “Tholkappiam” and “Silapadhikaram”, he said that Tirukkural was the epitome of the faculty of law. The objective of the moot court contest, he said was to hone the skills – both in law and in presenting arguments.\n\nP. Velmurugan, Registrar (Vigilance) of the Madras High Court, said the law students should adhere to their professional ethics during their career.\n\nHe said that lawyers should develop the skill for using Tamil as court language.\n\n“Although use of Tamil is permitted up to the district-level courts, a majority of lawyers are not quite comfortable using the language,” he said.\n\nJ. Vincent Kamaraj, Principal of Law College, said that nine teams — one each from nine colleges, participated in the contest. Four teams qualified for the semi finals, and two teams entered the finals.\n\nThe team from Government Law College, Tiruchi, bagged the first prize.\n\nMr. Velmurugan gave away the prizes to winners in the contest.", 
    "section": "national", 
    "title": "Law varsity moots department for translation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}