{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Under the Pradhan Mantri Kaushal Vikas Yojana, it Will train 1 lakh persons\n\nB. Senguttuvan, Member of Parliament, hands over a certificate to a candidate who underwent training, in Ambur on Saturday.- Photo: C. Venkatachalapathy\n\nThe Leather Sector Skill Council (LSSC) is training about 50,000 persons across the country under the Pradhan Mantri Kaushal Vikas Yojana (PMKVY) this fiscal year, and is looking ahead to train another one lakh persons in the coming year to equip people with skills required by leather industries.\n\nEmbarking on an effort to create skilled manpower for leather industries, and simultaneously, provide employment, LSSC is one of the sector skill councils established under the National Skill Development Corporation (NSDC).\n\n“Of the 50,000 persons, we have already trained 30,000 persons under PMKVY. More than 50 per cent of these persons have been employed in leather industries,” Habib Hussain, chairman of LSSC said.\n\nOn Saturday, B. Senguttuvan, Member of Parliament, handed over certificates to 500 candidates who had completed the training in Vellore Lok Sabha constituency. The candidates included house wives, persons who have completed class VIII, and those from lower economic groups.\n\nNumber of industries\n\n“Currently, the total turnover of leather industries in India – domestic and exports – is 13 billion dollars. The Government of India has asked us to double this to 27 billion dollars in the next five years,” Mr. Hussain said, while addressing the certificate distribution ceremony.\n\nAlready, the leather sector provides jobs to three million persons in the country, and the target for the next five years is to add another one million jobs, he said, adding that the key component was skilling, and industries wanted such certification that makes candidates employable.\n\nUnder PMKVY, the candidates are trained in different job roles such as stitching leather for a duration ranging from one to three months.\n\n“NSDC is encouraging all industries to set up skilling centres. The Union Ministry of Skill Development also wants all industries to open multi skill centres in all constituencies,” he added.\n\nP.R. Aqeel Ahmed, regional chairman-south, Council for Leather Exports, said in Tamil Nadu, unlike in other States, 70 per cent of those employed in the leather industry is women.\n\nHe highlighted the need for trained manpower in the footwear and leather industry.\n\nMr. Senguttuvan, while speaking on the occasion, said he reiterated in the Parliament the need to establish a central institute for leather technology in Vellore district that is home to 700-odd tanneries.\n\n“Such an institute can impart training to local people and also have research facilities,” he said.\n\nShafeeq Ahmed, director of LSSC, B. Chandrasekaran, director of Central Leather Research Institute and R. Ramesh Kumar, chief executive officer, LSSC also spoke.", 
    "section": "national", 
    "title": "Leather sector to train one lakh persons", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}