{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Conduct of Lok Adalat has considerably reduced pendency in the courts in the district.\n\nLast week, 455 cases were heard at 11 centres, and settlements to the tune of Rs. 7 crore were made. Principal District and Sessions Judge G.P. Elango handed over cheques to the litigants during the Lok Adalat held on the premises of Combined Court Complex in the city.\n\nWhile 210 cases hitherto heard in the courts were disposed off through payment of Rs. 6 crore as compensation, the remaining 245 cases settled for Rs. 1 crore accounted for defaulted payments to nationalised banks. Retired and sitting judges and advocates held the sittings at 11 places including Bhavani, Sathyamangalam, Kodumidi, Gobichettipalayam and Anthiyur besides Erode.\n\nLast December, 45 sitting and retired judges and advocates held Lok Adalats at 23 locations and settled 43,019 cases involving Rs. 36 crore compensation.\n\nThe highlight of the Lok Adalat is the immediate settlement of cases pertaining to MCOP, Non-Performing Assets of nationalised banks, and settlements related to traffic and motor vehicle violations.\n\nBesides the pending cases in the courts, the Lok Adalat also looks into complaints against Revenue Department over delay in issual of birth and death certificates, old-age pension, legal heir certificate, and community certificate.\n\nAccording to the legal fraternity, the tendency to approach courts even for petty cases has caused the huge pendency.\n\nDuring June last year, the Tamil Nadu Legal Services Authority initiated the State’s third Alternative Dispute Resolution (ADR) Centre in Erode.\n\nThe ADR system introduced during 2010 in the country was considered the best approach to dispense justice free of cost suiting the poor and the downtrodden sections of the society, more importantly, without time loss.\n\nThe District Legal Services Authority has been mandated with the task of creating awareness about the ADR system at various levels, including among prison inmates. The ADR is composed of representatives of non-governmental organisations, lawyers and retired officials.", 
    "section": "national", 
    "title": "Lok Adalats for speedy justice", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}