{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Management students distributing woven bags free of cost among shoppers on NSB Road in Tiruchi on Saturday as part of the 'Make A Difference' initiative to rid Rockfort area of plastic bags.— PHOTO: B. VELANKANNI RAJ\n\nOnly if we can give the street vendors eco-friendly options within the range of 25-30 paise will they be able to meet their ends.P.R. Rohit,Student\n\nix students from the Indian Institute of Management (IIM) Tiruchi have been trying to raise awareness about the harmful effects of plastic bags through an innovative social initiative this week.\n\nHari Kishan Sudheer, Pratikantham Siva Rohit, Tanay Rusheel, Akhil Vishal, Rajeev Varma, and Narasimha Naik, all MBA students, have set up a stall on the busy NSB Road in the heart of the city’s commercial district and are giving away A4-sized non-woven fabric bags to passers-by in a bid to create a plastic-free zone around the Rock Fort area.\n\nOperational since Friday (February 19), the initiative is part of the IIM’s curricular ‘Make a Difference’ (MAD) team project, meant to make postgraduate students collaborate on an issue of social importance. The student team has been supported by local authorities and also has the backing of Corporation Commissioner M. Vijaylakshmi.\n\n“We have noticed that it is mostly street hawkers who are using plastic bags of below 40 micron density,” Hari Kishan Sudheer told The Hindu . “Based on the value of the goods that they are selling, it is not viable for them to use a plastic bag that costs more than their products.” A plastic bag of 20 microns costs around 25 paise, compared to the 40 microns bag which is sold at Rs. 2.\n\nThe students have bought 1,500 non-woven fabric bags made by women’s self-help groups affiliated to the Women Entrepreneurs Association of Tamil Nadu (WEAT), of which 600 had been given away by Saturday afternoon.\n\n“We felt it was essential to keep the supply chain local to keep our costs down, and also to show shopkeepers in Tiruchi that they too could source these items from suppliers in their own vicinity,” said Hari Kishan. The bags are on sale for a nominal price.\n\nOn Saturday, the students were able to help their suppliers garner an order for 10,000 non-woven fabric bags from a shop proprietor on NSB Road through their kiosk.\n\n“We have realised that this exercise can work in many ways. It is the first time we have seen how the real economy works outside our textbooks,” said Tanay.\n\n“We want to tie up the buyers and suppliers through our kiosk,” added P.R. Rohit who was handing out flyers and bags to passers-by. “Only if we can give the street vendors eco-friendly options within the range of 25-30 paise will they be able to meet their ends,” he said. “Tiruchi has been named as the third cleanest city in India recently. We felt that making it plastic-free could be one way we could help its image,” said Tanay. All the six students are originally from Andhra Pradesh. The kiosk, which is open from 9.30 a.m. to 6 p.m., is expected to close on Monday. The students have spent around Rs. 9,000 to set up their stall (including the cost of the bags and rent for the sidewalk spot). They plan to scout for sponsorship fees from local establishments to make the next phase of the project more economically attractive. Results of their project will be brought out in the form of a report.\n\nOnly if we can give the street vendors eco-friendly options within the range of 25-30 paise will they be able to meet their ends.P.R. Rohit,Student", 
    "section": "national", 
    "title": "MAD idea for plastic-free Rockfort", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}