{
    "author": [
        "S Prasad"
    ], 
    "text": "Application forms have been made available from February 19\n\nThe new Passport Seva Kendra is equipped to handle around 150 applicants a day.- Photo: T. Singaravelou\n\nThe mini Passport Seva Kendra (PSK) established on the premises of the Animal Husbandry Department on Maraimalaiadigal Salai will become operational from Monday. Chief Minister N. Rangasamy will inaugurate the PSK in the presence of Regional Passport Officer K. Balamurugan.\n\nApplications for normal fresh and reissue application forms have been made available from February 19. Applicants from Puducherry and Karaikal will have to log on to www.passportindia.gov.in, create a user ID and password and submit the application forms online.\n\nMode of payment\n\nThe applicants can make payment of passport fees online through debit/credit card or internet banking of State Bank of India (SBI).\n\nThe applicants should note the Application Reference Number (ARN) schedule, take a print-out of the slip, visit the PSK on the day of appointment and submit all original documents along with photocopies and two colour photographs. Photographing of the applicant will be done at the PSK to prevent incidence of impersonation, an official said.\n\nChecking of documents\n\nThe PSK catering to residents of Puducherry and Karaikal, will receive applications, check and scan the documents, take photographs of the applicants and capture their biometric fingerprints, besides speeding up the issue of passports.\n\n“All aspects including collection and scrutiny of applications and police verification will be taken care of at the PSK while the Regional Passport Office in Chennai will act as a backend office in printing and despatch of passports,” said Regional Passport Officer K. Balamurugan.\n\nThe new PSK is equipped to handle around 150 applicants a day.\n\nAt present, we will issue 150 slots a day through three counters.\n\nCandidates need not go to Chennai except for Tatkal passports and complaints. However, applicants for Police Clearance Certificate (PC) have to take appointment from any of the PSK in Chennai, he said.\n\nThe PSK in Puducherry offers adequate seating and waiting hall for the applicants.\n\nIt will cater to residents of Puducherry and Karaikal districts and will ease the rush at the Chennai passport centre.", 
    "section": "national", 
    "title": "Mini Passport Seva Kendra to become operational tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}