{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Nirmala Sitharaman says Centre doing everything on this\n\nThe Centre was taking necessary steps to boost exports and help exporters tide over the fall in global demand, said Nirmala Sitharaman, Union Minister of State for Commerce and Industry, here on Saturday.\n\nIn a brief interaction with the media here, Ms. Sitharaman said the decline in exports was because of the contraction of global economies and fall in demand, among other reasons. “The process of identifying the problems has been happening,” she said. The Centre, she said, had been extending concessions on export-based performance and exploring export opportunities in new territories.\n\nReferring to her recent meeting with fire cracker manufacturers at Sivakasi, Ms. Sitharaman said the manufacturers had told her that it was a happier Deepavali last year as the government had intervened to check the entry of Chinese firecrackers into the market. “No licence is given for importing firecrackers and hence entry of foreign made firecrackers into the Indian market is illegal. Steps were taken to seize and destroy foreign-made firecrackers. The State governments too extended their cooperation. The drive will continue this year too,” she said.\n\nTo a question on the problems faced by the ancillary units of the Bharat Heavy Electricals Limited, Tiruchi, especially in terms of procurement of components, Ms. Sitharaman said she would help take up the matter with the Ministry concerned.\n\nOn the recent protest by jewellers against the Centre’s decision to make submission of PAN card details mandatory for jewellery purchases above Rs. 2 lakh, Ms. Sitharaman said the move was intended to check black money.\n\nIt was for the Finance Ministry to take a call on the jewellers’ demand for raising the limit to Rs. 10 lakh, she said.\n\nJNU row\n\nCommenting on the controversy over the arrest of the JNU Students’ Union president Kanhaiya Kumar, Ms. Sitharaman said freedom of expression was a “valued virtue.” The (university) campus is well known for its open discussions and, in this particular incident, the platform might have been allowed to be exploited by forces that are anti-India,” she said.\n\nLater, the Minister held an interaction with members of the BHEL Small and Medium Industries Association, Tiruchi District Tiny and Small Scale Industries’ Association, and other industry representatives.", 
    "section": "national", 
    "title": "Minister holds out hope for exporters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}