{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Indigenous implants, doctors with expertise need of the hour: expert\n\nMore indigenous orthopaedic implants, a dust-free operation theatre, regimentation of sterility and doctors with an excellent understanding of technique are some of the things the country needs to be able to provide joint replacement surgeries to all those who need them, said K.H. Sancheti.\n\n“Some theatres, for instance, do not have laminar airflow facilities. If sterility procedures are not followed, the infection rates are high. If the doctor does not understand the technique of this mechanically complicated operation well, the revision rate will be high,” he said.\n\nDr. Sancheti, founder and chief orthopaedic surgeon at Sancheti Hospital, Pune, was speaking on the sidelines of a Global Arthroplasty Congress being held at Sri Ramachandra University.\n\nDr. Sancheti, who invented the indigenous knee implant, Indus Knee, and has since used it in over 6,000 operations, said that a 10-year study on this implant was nearly complete. “We have seen that 60 per cent of patients, who have had the Indus Knee surgery, have movement above 135 degrees and are able to sit cross-legged. For the remaining 40 per cent too, the quality of life had improved significantly,” he said.\n\nThere are 70 per cent more knee problems than hip problems in India, Dr. Sancheti said, but the demand for hip replacements too was growing, he said.\n\n“Implants have to be cost-effective for most people who need them to be able to afford them,” he said. Earlier, Dr. Sancheti had exhorted doctors at the congress not to differentiate between rich and poor patients.\n\nDemonstrations\n\nThe congress, which saw the participation of around 400 doctors from across the country, had demonstrations of knee and hip replacement surgeries on 14 cadavers, said Samuel Chittaranjan, head of the orthopaedics department at the university.\n\nOne technique, the direct anterior approach for hip replacement, which was not done in India, was also being demonstrated at the congress by surgeons from Italy and the United States, he said. “This is a soft tissue sparing approach that reduces pain and the length of the hospital stay and leads to faster recovery,” he said.\n\nAround 400 doctors are participating in the Arthroplasty Congress", 
    "section": "national", 
    "title": "‘More indigenous implants needed’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}