{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "They charge that some projects under MPLADS and MLALADS have been delayed by councillors\n\nA raft of projects under Local Area Development Schemes of MLAs and MPs are hanging fire. With the elections round the corner, the Greater Chennai Corporation is trying to create a sense of urgency about these schemes, directing the departments concerned to implement them.\n\nSome of the MLAs and MPs have alleged that resistance from councillors of certain wards of the Corporation has partly led to a delay in the implementation of these projects.\n\nAt least 50 percent of the works recommended by MLAs have been delayed. According to data compiled by the Corporation, which is the nodal agency for implementation of the projects, many of the works recommended in 2011 have not been taken up so far.\n\n“An MLA gets Rs.10 crore for the five-year tenure. Recommendation for projects has been made for the entire amount in our constituency. But, I have been able to complete just 50 per cent. Around 25 per cent of the works have been dropped because of councillors who prevented contractors from participating in tenders,” said an AIADMK MLA, who did not wish to be named.\n\nBoth opposition and ruling party MLAs face similar challenges. For instance, 12 Solid Waste Management Projects have been recommended under MLALADS but not even one has been initiated.\n\n“Once an opposition party MLA recommends a project under MLALADS, officials produce documents claiming that the work has already been sanctioned under another scheme. So, the proposal is rejected. But many of these projects continue to remain on paper,” said Deva Jawahar, Corporation councillor in Kolathur.\n\nMost of the incomplete works are likely to be suspended after notification of Assembly elections. Many MLAs and MPs recommend that projects be started on certain lands without knowing that they belong to another agency, said an official of Chennai Corporation.", 
    "section": "national", 
    "title": "MP, MLA schemes for city in a limbo", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}