{
    "author": [
        "Special Correspondent"
    ], 
    "text": "K. Dharani (left), second year student of M.Sc., (physics) and K. Sindhuja, third year B.Com., student receiving the medal and Best outgoing Student Shield from Union Minister of State for Commerce and Industry at the 65th College Day of Seethalakshmi Ramaswami College in Tiruchi on Saturday.— PHOTOS: B. VELANKANNI RAJ\n\nUnion Minister of State for Commerce and Industry Nirmala Sitharaman on Saturday urged women to venture into the fields of science and politics without hesitation.\n\nReferring to the perceived misgivings among women on entering politics, the Minister said that it was not enough to have women just in local bodies. “Science needs more women and so does politics. There is nothing wrong with politics and it will become better if more women come into it,” she said speaking at the College Day celebrations of Seethalakshmi Ramaswami College, her alma mater, here.\n\nConceding that it was difficult for women to reach positions of stature, she affirmed that women who had access to education had a major role to play in social development. “Apart from academic excellence, you have to give back something to society,” she said and suggested that students take up the task of helping disadvantaged women.\n\nShe went down memory lane to recall the influence of her teachers during her study at the institution, Ms. Sitharaman urged the students to actively participate in competitions and work to the plan of the faculty members.\n\nKannan Pachapakesan, Director (Academics), M.Jayanthi, Principal and R.Selvameena, Vice-Principal, Seethalakshmi Ramaswami College, spoke.\n\nR. Panchapakesan, Managing Trustee of the institution, was present.\n\nThe Union Minister says women should not have misgivings about career in science", 
    "section": "national", 
    "title": "Nirmala Sitharaman says more women must join politics", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}