{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Notices had been issued to 128 of 468 persons against whom execution of non-bailable warrants was pending in Kanyakumari district, said Superintendent of Police G. Dharmarajan here on Saturday.\n\nAddressing reporters, Mr. Dharmarajan said that ahead of the assembly elections, the district police were taking steps to secure the persons against whom the non bailable arrest warrants were pending.\n\nOf the total number of pending non-bailable warrants, 409 are above six months and 59 are below three months.\n\nAs part of preventive measure, the district police also taking steps to secure anti-social elements and bonds are being collected from habitual offenders.\n\nSo far seven persons had been detained under the Goondas Act during the year and it was 39 last year, he said.\n\nWhen asked about the development in the investigation into the theft attempt at the People’s Cooperative Bank at Veppamudu junction in Nagercoil on Thursday night, Mr. Dharmarajan said that the fingerprints of thieves had been lifted from the scene of crime, police got a clue about them and they would be caught soon.\n\nAs a follow-up of the theft attempt, police identified 138 cooperative banks and were insisting the managements on commissioning CCTV on their premises.\n\nHe said that 35 areas in the district were identified as vulnerable and 152 polling booths in these areas were categorised as sensitive.\n\nCell formed\n\nA separate cell called — job fraud prevention — was established at the District Police Office with a view to protecting gullible persons from the hands of fraudsters, said Superintendent of Police G. Dharmarajan here on Saturday.\n\nHe told reporters that during the last three months, over 100 people were defrauded by the recruitment agencies across the district. Hence, the cell was set up, he said. The local inspectors were asked to enumerate the travel agencies handling overseas recruitments in the district, their track record etc.\n\nThe cell at the District Police Office would be monitored by the Deputy Superintendent of Police Kader Basha and the contact numbers are: 04652-220657 and SIs: Ramachandran 9486215732 and Ramesh Mohan 9498192414, Mr. Dharmarajan said.", 
    "section": "national", 
    "title": "Notices issued to 128 persons, says SP", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}