{
    "author": [
        "Staff Reporter"
    ], 
    "text": "From holding hands and standing together to be garlanded the leaders of the four parties in the People’s Welfare Front (PWF) tried to convey the message of unity among them and that of their allies. The show of their unity went to such an extent that the district level functionaries of the four parties - who spoke ahead of their state representatives - spent a good deal of time in mentioning the names of the state and district level functionaries of their party and that of their allies as well, to avoid any misunderstanding. At one point, one of the leaders intervened and stopped the culture of mentioning names of all leaders of the local units as it proved to be a time consuming affair.\n\nHowever, cadre of these political parties proved that it would take time for them to adapt to behavioural and cultural differences among them, as the style of functioning of each constituent party had remained different all along in many ways. Members of the Communist parties were annoyed by the behaviour of a section of the crowd of another party owing to frequent interrupting whistles, hooting and howling displaying signs of cheer when their leader arrived.\n\nDuring the course of their speech the leaders of the four parties asked their cadre to stay united and campaign together.\n\nViduthalai Chiruthaigal Katchi (VCK) founder Thirumavalavan asked the district, union and grass root level functionaries to replicate the example set by the state level leaders of the parties on the stage and stay united before and after the election.\n\nMarumalarchi Dravida Munnetra Kazhagam (MDMK) general secretary Vaiko and convenor of the front – before making his speech – had to signal his party cadre not to cheer him alone, when they enthusiastically kept chanting his name. He said that expectations of their foes in politics to see the alliance divided would be an unfulfilled dream.\n\nWhile emphasising on unity among cadres, former MP and Communist Party of India (CPI) leader K. Subbarayan during his speech lost his fuse and shouted on the public address system asking the cadre of another party to maintain discipline.", 
    "section": "national", 
    "title": "PWF leaders try their best to project their ‘unity’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}