{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "For many families, a running event is the icing on the cake of a great holiday\n\nPraveen Giriya of Chennai Runners and his family not only participated in the Sohra Cherrapunjee Marathon but also explored the region—Photo: Special Arrangement\n\nLast year, when Praveen Giriya, a telecom sales professional, went to Cherrapunji with his family, it was primarily for the Sohra Cherrapunjee Marathon, but it doubled as a holiday.\n\n“The run was beautiful,” he said, from Shillong to the town famous for its rains, and the family then spent about four days, before and after, touring the region.\n\nWith a growing enthusiasm for running, more runners from Chennai are beginning to travel for running events across the country and abroad, and some are combining them with holidays or even work, says Neville J. Bilmoria, a runner who founded the Dawn to Dusk marathon that takes place in the city every year. And, while running is one of the best ways to see the city, runners say, small trips in various locations are fun too.\n\nIn September 2014, schoolteacher Ashwin Prabhu travelled with his wife and child to run the Berlin marathon, but also spent a week looking around the city.\n\n“The way I look at it, I have two different interests — running and travelling, and doing something like this allows me to bring them both together,” he said. Up next is a three-week trip for the London marathon in April. “While I am running in London to raise funds, we’re also planning to travel a little in the country,” he said.\n\nFor Vaishali Dhanda, her first run was practically a honeymoon run — just two months after her wedding, in Auroville. Since then, she and her husband Shameek Dhanda, also a runner, have travelled to various parts of the country, including Delhi, Hyderbabad, Mumbai and Coimbatore, and have generally taken an extra day or two to enjoy sightseeing, said the 36-year-old.\n\n“It becomes a mini-holiday and it’s a great break,” she said.\n\nGauri Jayaram, founder, Active Holiday Company, a tour operator specialising in marathon tours that sees many runners from Chennai, said that about 30 to 40 per cent of the runners extend their trips to sightsee.\n\n“With the running scene evolving in India, more runners want enjoyable experiences on their trips in addition to accomplishing their personal goals,” she said.\n\nLater this year, K. Govindarajan, whose entire family — wife, daughters and son — runs, is planning to go to either Dubai or Singapore. “We’ll do a holiday and a run for a week or 10 days,” says the IT professional.\n\nFor many families, an event such as a marathon is the icing on the cake of a great holiday", 
    "section": "national", 
    "title": "Running away from it all", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}