{
    "author": [
        "L Renganathan"
    ], 
    "text": "Suicide bombers on the prowl, claims an anonymous letter\n\nWith an anonymous letter to the police claiming movement of suicide bombers in the Mahamaham tank area targeting VIPs, security was tightened in the temple town. Additional Director General of Police J.K. Tripathy led senior police officials in monitoring the security arrangements.\n\nAs surging crowd thronged Kumbakonam on the eighth day of the Mahamaham rituals on Saturday, administration officials started enforcing restrictions on vehicular and human movement within the town limits on specific stretches. However, a shuttle service for the elderly and the physically challenged came as a relief to those sections.\n\nEarly on Saturday, thousands of devotees gathered to draw the chariots of the Sri Kumbeswarar temple here. First the Sri Vinayakar and Sri Murugan chariots were rolled out, followed by the Sri Chandikeswarar, Sri Adi Kumbeswarar and Sri Mangalambikai deities. That was a milestone event as after 1968, only during the current Mahamaham the chariot festival of Sri Adi Kumbeswarar was being held. In 1980, 1992 and 2004 fearing excess crowd and related difficulties, only the processional deities were ensconced in the throne atop the chariots in a symbolic fashion. Members of the Srinivasa Vaibhava Mahotsava Trust and Aranmanai Rangaswamy Trust conducted Sri Vishnu Sahasranama, Sri Sudarsana, Sri Dhanvantri, Sri Ganapathy and Sri Chandi homams for world peace and unity. After the mahapoornahuthi, the sanctified waters in a pot were emptied in the Mahamaham tank by the priests.\n\nThe Hindu Religious and Charitable Endowments Department has brought out a souvenir on the occasion of Mahamaham and it was released by Thanjavur District Collector N. Subbaiyan . Additional Commissioner of the HR & CE Kavitha received the first copy at a function held near the Sri Kasiviswanathar temple. Dr. Subbaiyan said that all Tasmac outlets in the Kumbakonam division have been ordered closed from Saturday to Monday. Violators will be dealt with severely, he warned.", 
    "section": "national", 
    "title": "Security tightened in Kumbakonam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}