{
    "author": [
        "M K"
    ], 
    "text": "(From right) VCK founder Thol. Thirumavalavan, CPI (M) State secretary G. Ramakrishnan, MDMK general secretary Vaiko, CPI's K. Subbarayan, MDMK presidium chairman S. Duraisamy, former MP P.R. Natarajan of CPI (M) and MDMK's R.R. Mohankumar at a public meeting in Coimbatore on Saturday.— Photo:S. Siva Saravanan\n\n“Single-party rule has been a curse for Tamil Nadu for the past few decades when the two Dravidian majors ruled the State. A coalition government alone can give good governance,” said Vaiko, convener of the People’s Welfare Front (PWF) and MDMK general secretary.\n\nAddressing a public meeting to launch the second phase of the front’s campaign in Coimbatore, he said that a coalition government alone would ensure checks and balances where one constituent party could question another on policy related issues.\n\n“We will give a corruption-free and liquor-free government. Honest officers like Sagayam will be given the right place and a free hand to work ,” he said.\n\nVoters might have a dislike for any of the constituents of the PWF for some reason or the other, but voting for the PWF was the only way to save the State from corrupt forces which had ruined the State, Mr. Vaiko said.\n\nViduthalai Chiruthaigal Katchi founder Thol. Thirumavalavan was confident that the PWF would replicate the DMK’s style of victory over the Congress in the 1967 election. The two Dravidian majors that ruled the State alternatively had wasted tax payers’ money by not pursuing projects that were introduced by the previous government.\n\nCPI-M State secretary G. Ramakrishnan alleged that the DMK and AIADMK had ruined the principles of politics in the country. Former MP and CPI leader K. Subbarayan lamented the “widespread corruption” in government departments.\n\nLater, the leaders campaigned at Pollachi before heading to Palladam in Tirupur district. The second phase of the campaign will conclude in Dindigul on Monday.", 
    "section": "national", 
    "title": "Single-party rule ruined TN: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}