{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Finance Minister cites slow growthin commercial taxes\n\nOwing to a sluggish growth in commercial taxes, the State’s Own Tax Revenue (SOTR) receipts in the first six months of 2015-16 fiscal have only shown a marginal growth rate.\n\nAccording to the ‘Review of trends in receipts and expenditure in relation to the budget estimates 2015-16’ tabled in the Assembly on Saturday, the SOTR up to September 2015 constituted 39.84 per cent of budget estimates. It has shown a growth rate of 3.30 per cent over the receipts in the corresponding period of the previous year.\n\nSlow growth rate has been witnessed in commercial taxes, where the resources realisation was not as expected due to a drastic fall in international crude oil prices and as the State had not hiked sales tax on petroleum products, said Finance Minister O. Panneerselvam. The government was taking efforts to improve tax collection and reduce the shortfall, he added.\n\nThe State’s Own Non-Tax Revenue up to September 2015 was Rs 2,966 crore as against the estimate of Rs 9,072 crore.\n\nThe Centre had revised the sharing pattern of certain Centrally-sponsored schemes, which implied that the State has to contribute more resources from its kitty. As non-receipt of Central grants would put the State finances under severe strain, the departments had been instructed to follow up with the Centre for timely release of Grants-in-Aid, he said.\n\nIn his reply to the discussion on the budget, Mr. Panneerselvam said the State’s finances could not be gauged solely on the basis of revenue deficit.\n\nAt times of alternative economic growth, a government could not function without revenue deficit.\n\nAll those welfare measures taken up under the revenue account could not be dismissed as freebies. Capital expenditure was essential. Equally necessary were the health, education and nutritious meal schemes, he said.\n\nThe key indicators of a sound economy lies in containing fiscal deficit within three per cent of GSDP and keeping Outstanding Debt to GSDP ratio within the norms adhered to in the past five years, he told the House.", 
    "section": "national", 
    "title": "State’s Own Tax Revenue growth sluggish", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}