{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Is Bengaluru in danger of becoming a city that is divided along the lines of class and caste? Terming today’s urban reality an apartheid city, activist and former bureaucrat Harsh Mander has said the perpetuation of caste, class and the neoliberal ‘greed is good’ motto, have made the middle class one of the most uncaring communities the world over.\n\nAnd what happens when the divide enters the classroom? “Rohith Vemula and Kanhaiya Kumar show what kind of talent we will be missing out on if we don’t create egalitarian spaces,” said Mr. Mander who was speaking at the City Scripts Urban Writing Festival organised by Indian Institute of Human Settlement here on Friday.\n\nMr. Mander termed the Right to Education (RTE) as a big step towards desegregating our classrooms. He observed that the arguments made against the policy were very similar to rights made against desegregation of public spaces during the 1960s’ Civil Rights movement in the United States of America.\n\n“The argument that the child from a socio-economically backward background cannot ease into the classroom is ridiculous. Why is the onus of adjusting always on that kid from the backward community? Why not the other way round?” Mr. Mander sought to know.\n\nHe said that with segregated schools, cinemas, gated communities, all interaction of the middle class with the less fortunate was with only those who serve them.\n\n“The lived experience of urban poverty is more brutal than that of rural poverty as the people experiencing it are more isolated and uprooted,” he said. “What adds to the brutality is the over-monetisation of the homeless urban life. Even nature’s call, bath, blankets-on-hire for the night, food everything is monetised. Most of these things are taken for granted in a village community space. A homeless man in Mumbai once said that he fears the mirror, if it will ask for money to show my reflection,” he added.", 
    "section": "national", 
    "title": "‘The lived experience of urban poverty is more brutal than rural poverty’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}