{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sundararaja Perumal Temple, Anbil: Masi maham festival, purappadu, 7 p.m.\n\nSri Varasiddhi Vinayagar Temple, Periyar Nagar: Discourse on Srimad Ramayanam, 6 p.m.\n\nOrganising Committee: Sri Seetha Kalyanam, Aditya Apartments, North Adayavalanjan Street, Srirangam, 8 a.m.; bavalimpu utsavam, 7 p.m.\n\nSrimad Ubhaya Vedantacharya Peetam: “Bhagavata Dasamaskandam” by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Garuda Mandapam, Srirangam Sri Ranganathaswamy Temple, 5.15 p.m.; Nachiyar Kovil, Woraiyur, 6.45 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 58, Vinayagar Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary, Desathai Kathal Sei , drama by S. N.V. Creations, W.B. Road, 6.30 p.m.\n\nGENERAL\n\nSVD Fraternity, Tamil Nadu: National seminar on centenary memorial celebrations of Rev. Fr. Karl Ritz, Rev. Fr. Augustine Karamel, Arockia Annai Shrine, Vadipatti, chief guest, St. Charles Apostolic School, Ponmalaipatti, 9.30 a.m.\n\nSri Sathya Sai Seva Organisations: Sri Sathya Sai Balavikas convocation, Sri Sathya Sai Spiritual Centre, Srimathi Shiva Shankar, Vice President, HCL Technologies, Chennai, speaks, Srirangam, 9.45 a.m.\n\nTiruverumbur Thanjai Main Road-Navalpattu Road Viyaparigal Kootamaippu: Inaugural ceremony,A.M.Vikramaraja, State President, Tamil Nadu Vanigar Sangangalin Peramaippu, speaks, Bharath Thirumana Mandapam, Navalpattu Road, 4.30 p.m.\n\nCentre for Ultimate Studies: Freelance researchers first conference on “Rock arts language-philosophy and history,” release of the book Kizhvalai Rock Art , G. Baskaran, Vice-Chancellor, Tamil University, chief guest, E.R. Higher Secondary School campus, 10 a.m.\n\nSangamam Multi State Cooperative Credit Society Limited: Introductory meeting, A.K. Residency Hall, near Chathram Bus Stand, 6.45 p.m.\n\nRajaji Vidyalaya: Annual sports meet, N. Annavi, former international athlete, chief guest, 8 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}