{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Rafeeque Ahmed, chairman of Council for Leather Exports, speaks at the certificate distribution ceremony of Pradhan Mantri Kaushal Vikas Yojana at Ambur on Saturday.- Photo: C. Venkatachalapathy\n\nFifteen years ago, the State accounted for 65 to 70 per cent of the country’s leather exports, while it is 38 per cent now, raising the need for the government to establish leather parks, encourage domestic investors, and revisit its policy of freezing new licenses, according to M. Rafeeque Ahmed, chairman, Council for Leather Exports.\n\n“One of the reasons why our share in total leather exports reduced is the rapid growth of the leather sector in States such as Uttar Pradesh.\n\nThe industry has grown exponentially in places such as Kanpur, Agra and Noida,” he told reporters during the sidelines of the certificate distribution ceremony of Pradhan Mantri Kaushal Vikas Yojana (PMKVY) on Saturday.\n\n“There is a need for the government to re-look into this policy of freezing licenses and see how technology can be adapted to ensure that ground water is not affected. This is required to improve the production sector,” he said.\n\nScope for improvement\n\nMr. Ahmed said that the State government could open leather parks to aid in the development of the sector. “Things should be made easy for investors, and at the same time, domestic investors should be encouraged. Leather industries cannot be concentrated in one district, and should be expanded to other places too,” he added.\n\nDistricts such as Perambalur and Krishnagiri could be viable options for this expansion, he said.\n\nBrazil, China evince interest\n\n“As per the Government of India’s direction, we visited five countries – China, Brazil, Germany, Italy and USA – to attract investors. We explained to possible investors on why they should come to India and invest in the leather sector, the available labour force, wages and taxation,” he said.\n\nFollowing this, Brazil and China have shown more interest to invest in India, while the U.S. has promised to discuss with manufacturers to visit the country. “We have got three to four queries so far,” he added.\n\nIn the last four months, there has been a slowdown globally, with exports down by 10.2 per cent. Hence, even the ban on cow slaughter has not had an impact on the leather sector, he observed.\n\nStressing the need for creating jobs, and not just train people, he said more investment should be brought. “The Government of India is ready to provide up to Rs. 125 crore as subsidy if the State government identifies land for establishing mega leather clusters,” he added.", 
    "section": "national", 
    "title": "TN share in total leather exports dwindles", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}