{
    "author": [
        "S Senthalir"
    ], 
    "text": "Two girls were molested by two unidentified persons inside the Pondicherry Central University campus, leading to protests by students through the Friday night. This is not the first time students are flagging concerns over security arrangements at the university campus.\n\nThe unknown persons who came in a two-wheeler were said to be in the campus for more than six hours orally abusing the girl students. The students alleged that at 6.30 p.m, one of the them got down from the bike and physically molested a student of the Department Food and Nutrition. Another student was molested at 7.45 p.m near the Girls’ Hostel in the campus.\n\nA large number of students gathered at Gate Number 2 at the University campus around 8.30 p.m. on Friday. They wanted the security in the campus to be beefed up. They alleged that despite lodging a complaint with the security personnel in the evening, about the mischief makers, no action was taken. “The hostel security staff’s attitude was lackadaisical. The chief warden did not come to the spot,” Jishnu. E.N, Secretary, Pondicherry University Students’ Council, said. The protest went on till late night Friday. “The vice-chancellor stepped in at 11.30 p.m. and promised to address the issue,” added Jishnu.\n\nTamilvanan, a student of Pondicherry Central University and supporter of Ambedkar Students Association, said: “There are at least 2000 students in the campus. The girls visit the library or shop within the campus. As the incident has occurred close to the hostels, it is very unsafe for them. .” Jishnu added that instead of considering this incident as a security lapse, the administration would attempt to curb the freedom of girls in the name of security.\n\n“This should not happen this time. The library will be open till 10 p.m. and students should be allowed to access it ,” he said.\n\nWhen The Hindu spoke to the chief warden Professor K.Ilamathy Janakiraman, she said: “I was not in town when the students called me to inform about the incident. I spoke to the chief warden of the boys’ hostel to immediately address the issue. I reached Puducherry only by 11 p.m. but could not drive over to the University immediately. However, the Vice Chancellor met the students and informed me that that a meeting would be held on Saturday morning,” she said.\n\nStudents staged protests till late night on Friday demanding better security arrangements", 
    "section": "national", 
    "title": "Two girls molested on campus", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}