{
    "author": [
        "R Sujatha"
    ], 
    "text": "The convener of the Madurai Kamaraj University Vice Chancellor search panel, C. Murukadas, has issued a rebuttal in response to allegations made recently by Mu. Ramasamy, one of the three members on the search panel.\n\nAccording to Prof. Murukadas, the panel had met five times since it was constituted and “all the decisions were made unanimously after discussions.”\n\nAt its first meeting on April 24 last year, the panel decided to place an advertisement and accordingly it was published in dailies and also on the university website.\n\nA total of 142 applications were received, including those sent to the residential address of the convener, before the cut-off date, he said.\n\n“A hard copy of the consolidated list of 142 applications was given to the panel members at the meeting held on August 22, which was received by Prof. Ramasamy on September 7.\n\nAt the October 10 meeting it was resolved to create a panel at the next meeting, which was held on November 11. Prof. Murukadas said the member had raised the issue of processing appointments.\n\nHe alleged that the member “could not understand the process of talent search and confused the same with the selection process for the appointment of professors.”\n\nThe meeting was adjourned. Later, repeated requests for convening a meeting elicited no response from the member. Finally, Prof. Ramasamy agreed to a meeting after February 10, 2016.The meeting was fixed for February 17, but the member resigned by then, Prof. Murukadas said.\n\nHe also alleged that the member had leaked details of the search committee selectively to the media. He alleged that the member had come with a fixed agenda and had failed to discharge the duties of a search committee member, Mr. Murukadas added.\n\nMadras University panel\n\nThe search panel members of the University of Madras said they had not come to a consensus on the probable candidates for the post of V.C. yet. The panel had received around 60-70 applications, including from 11 former V.C.s. The search panel was constituted in mid-January. A member said another meeting was likely to be held on Monday before the probable names could be given to the Governor Chancellor.", 
    "section": "national", 
    "title": "V-C search panel convener rejects allegations", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}