{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector K. Veera Raghava Rao distributing Youth Club award at the birth anniversary celebrations of of Dr. B.R. Ambedkar in Madurai on Saturday.— Photo: S. James\n\nUrging youngsters to follow the ideals of B.R. Ambedkar, who was instrumental in the making of the Indian Constitution and a social reformer, Collector K. Veera Raghava Rao said that it would be a fitting tribute to have equal opportunity – both socially and educationally — in the society.\n\nCelebrating the 125{+t}{+h}birth anniversary of Dr. Ambedkar, organised by the Nehru Yuva Kendra on the Gandhi Museum campus here on Saturday, the Collector said that despite limitations from his early days, Dr. Ambedkar had risen up to the top echelons that the nation remembered even after a century his contribution to the society.\n\n“It was the turn of the youth to take it up further and spread it to the masses,” he added.\n\nSuperintendent of Police Vijayendra S. Bidari said that we, as a society, should take Dr. Ambedkar as a model as his works had been a source of inspiration.\n\nIn the absence of even basic facilities, Dr. Ambedkar had contributed innumerable services to the nation and excelled. Today, in an information-filled era, when there were aplenty of facilities, we had much bigger role to take his ideals to the masses. The youth, particularly, students, should follow the principles of Dr. Ambedkar, he reiterated.\n\nOn the occasion, the youth handed over a “jyoti” to the Collector, who presented awards to various youth clubs from the district. A handbook on Dr. Ambedkar and a yoga handbook were released.\n\nAn exhibition on the life and works of Dr. Ambedkar was open to public. A number of activities, including film show, folk arts, yoga for harmony and peace among others were conducted.\n\nNehru Yuva Kendra district youth coordinator K. Jawahar welcomed. American College Dean of Curriculum Development and Research C. Muthuraja spoke on the life and philosophy of Dr. Ambedkar. Several other speakers, including G. Gnanaprabhu, V. Ratnam, and P. Mohamed Nazar, spoke.", 
    "section": "national", 
    "title": "Youth urged to follow ideals of Ambedkar", 
    "subsection": "tamilnadu", 
    "date": "2016-02-21"
}