{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In the latest shuffle by the State government, a total of 12 senior IAS officers were transferred and given new posts on Saturday.\n\nWhile Mission Director of State Rural Health Mission Shambhu Kallolikar was transferred and posted as Commissioner of Agriculture Marketing and Agri Business in the temporary post, Deputy Commissioner in Chennai Corporation R. Lalitha was posted as Deputy Secretary in Cooperation, Food and Consumer Protection Department, an official release said.\n\nFormer Commissioner of Delhi Development Authority Dayanand Kataria, on reversion to State cadre was posted as Commissioner of Minorities Welfare and Managing Director of Adi Dravidar Housing Development Corporation Limited. A. Suganthi was posted as Joint Secretary in Rural Development and Panchayat Raj Department. Likewise, Joint Secretary in Ministry of Information and Broadcasting Supriya Sahu is placed at the disposal of Tamil Nadu Industrial Investment Corporation (TIIC) for appointment as Managing Director.\n\nFormer Director of Sericulture P. Senthilkumar was posted as Joint Secretary in Animal Husbandry, Dairying and Fisheries Department and Chennai Corporation's Regional Deputy Commissioner (Central) G.K. Arun Sundar Thayalan was posted as Deputy Secretary in Adi Dravidar and Tribal Welfare Department.\n\nFormer Additional Chief Secretary in Youth Welfare and Sports Development Department Hemant Kumar Sinha has been placed at the disposal of Tamil Nadu Small Industries Corporation (TANSI) for appointment as Chairman and Managing Director.\n\nDeputy Secretary in Municipal Administration Department Praveen P. Nair was placed at the disposal of Chennai Corporation for appointment as Regional Deputy Commissioner (North) and Deputy Secretary in School Education Department Subodh Kumar would be placed for appointment as Regional Deputy Commissioner (Central) in Chennai Corporation.\n\nManaging Director of Poompuhar Shipping Corporation Limited Rajendra Ratnoo would be given an additional charge of Commissioner of Social Security Schemes in the office of the Commissioner of Revenue Administration. Deputy Secretary in Finance Prashant M. Wadnere would hold full additional charge of the post of Member Secretary of 5th State Finance Commission.", 
    "section": "national", 
    "title": "12 senior IAS officers transferred and given new posts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}