{
    "author": [
        "L Srikrishna"
    ], 
    "text": "It will manufacture paper plates for Tirumala-Tirupati Devasthanam\n\nThere are a plenty of self-help groups. Many have flourished. Some have not. Among the different groups, Sakti Balaji SHG is making a silent revolution.\n\nStarted about a decade ago in a very small way, the group’s president, V. Sita, never imagined that theirs would be a hit.\n\nWith the objective of manufacturing paper cups and plates, the group purchased a machine for Rs.40,000 through bank loan. After a few years, the Mahalir Thittam officials inspected their work station at Milaharanai, a hamlet near Alanganallur. Impressed by their work, they recommended expansion and the SHG had three machines.\n\nDuring the then Collector Anshul Mishra’s tenure in Madurai, his encouragement further facilitated the group to work hard that Ms. Sita received an award for being the ‘best woman’.\n\nThe Tamil Nadu Public Accounts Committee members, who heard the SHG’s tale from scratch, too recommended for expansion of infrastructure. The Industries minister recognised her as “Vetri Penmani” (victorious woman).\n\n“But, all these had happened only due to hard work and nothing else,” said Ms. Sita. The Corporation of Madurai had supported them so extensively that today the SHG has 20 machines and close to 100 women, a majority of them widows and destitutes, working for it.\n\nToday, the SHG’s monthly turnover is anywhere around Rs 10 lakh. With plastic use being discouraged and more and more people becoming aware of its consequences, the practice of using paper cups and plates has become the norm even in small roadside tea stalls and eateries.\n\n“Recently, when we approached the Tirumala-Tirupati Devasthanam (TTD) officials, they issued an order for the supply of paper cups and plates. We will start supply from March-April. With high volumes anticipated, we are now approaching a few banks to give us advance. This would, in turn, enable us to purchase raw material in bulk,” she said.\n\nSome of the women workers at the SHG’s unit said they worked from 9.30 a.m. to 6.30 p.m. A majority of them got a daily wage of Rs.150. While the 12 members in the SHG drew just Rs.6,000 per month, the profits were carefully spent on their children’s education.\n\nA humble Ms.Sita said, “I have an invitation to attend a summit in Gujarat on January 24, to receive an award from the Union government.”", 
    "section": "national", 
    "title": "A silent revolution by a woman self-help group", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}