{
    "author": [
        "Special Correspondent"
    ], 
    "text": "PMK MP Anbumani Ramadoss, on Saturday, made a strong case for a single system of administration for Chennai city, arguing that the three-tier administrative system had created wheels within wheels.\n\n“As a district it is administrated by Collector; as a corporation Mayor presides over the administration and as a metropolitan area it comes under the CMDA. But there is hardly any co-ordination among them,” he said after releasing the document— The Chennai We Want-Towards a new urban agenda for Chennai Metropolitan Area.\n\nAlleging that destruction of water bodies and canals that worked as a natural drainage system for Chennai had caused the flood in the recent monsoon, he said Pallikaranai, a marsh land rich in flora and fauna had been converted into a dumping yard.\n\n“This clearly shows the lack of vision of our rulers and officials. Instead of adopting a sustainable development, we have destroyed all natural resources in the name of achieving growth,” he said.\n\nDr. Anbumani also pointed out that desalination plants were suitable only for deserts and Chennai, with its water bodies, could easily meet the water requirements of its people.\n\n“Sustaining desalination plants also costs a lot. If we can bring water from Veeranam lake, almost 300 miles away from Chennai, why not from lakes in the neighbouring districts. We need two big lakes and eight small lakes,” he said.\n\nFormer IAS officer M.G. Devasahyam, who received the first copy, said all over the world, 80 per cent of the storm water was drained through the natural drainage system and man-made construction constituted only 20 per cent. He alleged conversion of special economic zones into real estate sector with the help of Foreign Direct Investment was the root of all the evils Chennai had been forced to suffer.", 
    "section": "national", 
    "title": "Anbumani for single system of administration for Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}