{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Governor inaugurates ‘Salangai Naadam’ in Thanjavur\n\nA troupe performs at the inauguration of 'Salangai Naadam' organised by the South Zone Cultural Centre in Thanjavur on Saturday.— PHOTO: R.M. RAJARATHINAM\n\nPropagation of art forms build bridges of understanding among diverse communities and their cultures which are necessary for strengthening the national fabric, Governor K. Rosaiah said here on Saturday.\n\nThe Governor was inaugurating the Salangai Naadam cultural programmes organised by the South Zone Cultural Centre.\n\nMr. Rosaiah said the people’s continued engagement with diverse culture and vibrant art forms would ensure the nation's progress.\n\nLauding the South Zone Cultural Centre for having taken art forms across lands and territories, Mr. Rosaiah said that arts nourish the inner persona providing sustenance, comfort, and inspiration to excel.\n\nThe Centre through its Guru Sishya Parampara series had ensured that knowledge of art forms was imparted in the time-tested gurukula system where the sishya learnt from the guru not just the finer nuances and skills of the trade but also the complete way of life to be a true maestro in his or her own right, he said.\n\nSalangai Naadam had over the past few years acquired the stature of a prestigious festival that presented a rich vista of folk, tribal, and traditional art and craft to enrich the country’s diverse nation,\n\nThe Governor said the initiatives taken by the Centre had vastly increased over the years across eight States and union territories.\n\nThe Centre had dedicated itself to bring varied indigenous culture closer to the masses for strengthening the national bond.\n\nJoyous celebration of art builds bridges across different cultures and the success of Salangai Naadam cultural programmes prove that, the Governor said.\n\nHousing Minister R. Vaithilingam, School Education Minister K.C. Veeramani, District Collector N. Subbaiyan, Thanjavur MP K. Parasuraman, MLA M. Rengasamy, Mayor Savithri Gopal and Director of South Zone Cultural Centre E.N. Sajith spoke.\n\nMore than 1,000 artistes and artisans from across the country are participating in the festival which would be on till January 17.", 
    "section": "national", 
    "title": "Art builds bridges between cultures, communities says Rosaiah", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}