{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Jet fuel accounted for most part of operational cost of airlines’\n\nUnion Minister for Civil Aviation Ashok Gajapathi Raju on Saturday asked the State governments, including Tamil Nadu, to rationalise taxes on Aviation Turbine Fuel (ATF) so as to energise the aviation industry.\n\nStating that he had written letters to the Chief Ministers of States and Union Territories on slashing the Value Added Tax on ATF, he said that jet fuel accounted for most part of operational cost of the airlines. There was a strong need to rationalise taxes on ATF to fuel overall growth in aviation and tourism sectors. The Governments should come forward to reduce VAT on aviation fuel.\n\nHe was speaking to reporters here after meeting the representatives of various industrial and tourism bodies.\n\nMr. Raju said only a few States had responded positively. The Governments of Maharashtra, West Bengal and Chhattisgarh had slashed taxes in select airports. Some States, including Andhra Pradesh, had brought down ATF taxes to less than 5 per cent, triggering noticeable growth of passenger and cargo traffic. In Tamil Nadu, tax on ATF was 29 per cent. It was on a higher side. Hence, it needed to be brought down.\n\nHe said that his Ministry had planned to construct four more modern airports, two each on the west and east coasts in the country, similar to Hyderabad, Bengaluru and New Delhi. It was his endeavour that Chennai should have a modern airport with parallel runways. It could be done only with the active cooperation of the State government, which had an important role to play in land acquisition. If it was established, Chennai could again become the busiest airports in south India.\n\nOn establishing airports in all district headquarters, Mr. Raju said though the Centre was willing to the proposal in principle, the current aviation economics suggested that the airports could not make headway in revenue generation. Even if set up, they would join the list of non-functional airports. Hence, there was no immediate plan to construct airports in district headquarters.\n\nThe Minister said that two more airlines had applied for license to operate domestic air services in the country.", 
    "section": "national", 
    "title": "Aviation Minister asks States to rationalise tax on jet fuel", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}