{
    "author": [], 
    "text": "RELIGION\n\nBhagavad Gita: R.Aravindan, Andhra Mahila Sabha, Luz, Mylapore, 7.30 a.m.; Satyaprabhananda, Vivekananda Hall, Ramakrishna Mission Ashrama, 3. M.S.Salai, T.Nagar, 5.30 p.m.\n\nPunjab Association: Lohri Mela, Anna Adarsh College for Women, Anna Nagar, 7 p.m.\n\nGENERAL\n\nWorld Tamil Chamber of Commerce: Second World Tamilar Festival, Governor K.Rosaiah participates, Chinmaya Heritage Centre, Harrington Rd., Chetpet, 5.30 p.m.\n\nThe Madras Canine Club: 107th, 108th and 109th All Breeds Championship Dog Shows, YMCA College of Physical Education, Nandanam, 9 a.m.\n\nSundaram Finance: Kutcheri in the park, Nageswara Rao Park, Mylapore, 7 a.m.\n\nLions Club Chennai Royapuram Heritage: Meeting, Hotel Clarion, Dr.Radhakrishnan Salai, 7 p.m.\n\nHumour Club International: Meeting, Mylapore Fine Arts Club Auditorium, Oliver Rd., 10 a.m.\n\nThiruvalluvar Paintamizh Ilayakkiya Mandram: Meeting, Alagappa Matric HSS., Purasawalkam, 4.45 p.m.\n\nThiruvallikeni Vyabarigal Sangam: Meeting, Presentation Community Hall, Royapettah, 6 p.m.\n\nNarcotics Anonymous : Good Company Group, St. Theresa’s Church, Nungambakkkam, 11 a.m., Miracle on Marina Group, Corporation School, Triplicane, Circle of Life Group, Annai Velankanni Church, Besant Nagar, 7 p.m..\n\nAl-Anon : New Beginning Al Anon Group, Holy Angels Convent, T. Nagar, 11 a.m., Sunshine Al Anon Group, Rise and Redeemers Church, Kodambakkam, 4 p.m., Broadway Al Anon Group, St. Francis Xavier Church, Broadway, Deiva Shakthi Kuzhu, Sri Sathya Sai Hr. Sec School, Theradi, 6 p.m., Al-Anon Group, Kesari Hr. Sec School, Teynampet, Al-Anon Group, C.S.I. Wesley Church, Poonamalee, 7 p.m..\n\nAlcoholics Anonymous : Assumption School, St. Teresa Church, Nungambakkam, 10.30 a.m., St. Mathias Church, Kamarajar Salai, K. K. Nagar, ECI Church Campus, 15, Dr. Ambedkar St, Arumbakkam, C.S.I. School, Gandhi Main Road, Oragadam, Ambattur, 11 a.m., Dr. Boaz Memorial Hospital, Velachery Road, Santoshpuram, Infant Jesus Church, Manali New Nagar, Manali, C.S.I. Peters Church (Near Jeeva Railway Station), Vysarpadi, 11:30 a.m., St. Francis Xavier Church, Broadway, 6 p.m., Kesari Higher Secondary School ( Near G.R.T. Hotel), T. Nagar, Police Boys Club, First Sector, Chinmaya Nagar, Koyambedu, Sri Ganapathy Sachidananda Ashram Hospital, Datta Street, Baby Nagar, Velachery, Singaram Pillai Boys High School (Opp Nathamuni Theatre), Villivakkam, Arul Kadal, 136, Santhome High Road, MRC Kalyana Mandapam, St. Infant Teresa Church (Near Don Bosco School), 7, K.K.R. Avenue, Sembium, Perambur, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}