{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The chief sthapathi of Hindu Religious and Charitable Endowments (HR and CE) Department inspected the idol of Ambal Parvathavardini, the consort of Lord Ramanathaswamy, at Ramanathaswamy Temple here on Saturday.\n\nTwo days after the Madurai Bench of Madras High Court directed the temple authorities to conduct the consecration ceremony, scheduled for January 20 after repairing the damaged portion of the idol of Ambal (if any) or cover the damaged portion with gold ‘kavacham,’ chief sthapathi M. Muthiah inspected the idol.\n\nAccompanied by Pichai Gurukkal, the chief priest of Pillayarpatti Vinayagar Temple, the sthapathi entered the sanctum sanctorum after the temple authorities performed an ‘abishekam’ to the idol with holy water and checked the idol for any damage.\n\nAfter a 30-minute-long inspection, Mr. Muthiah told reporters that the idol was perfect and no damaged portion could be found. As the ancient idol was several centuries old, it suffered wear and tear owing to continuous ‘abishekams,’ he said. The temple authorities could go ahead with the ‘Kumbabishekam’ after providing a ‘gold kavacham’ to the idol, he opined. To prevent further wear and tear, the temple authorities were performing abishekams to the Ambal after providing gold kavacham, temple sources said.\n\nJoint Commissioner of the temple, S. Selvaraj, and Assistant Divisional Engineer K. Mayilvahanan were present during the inspection.\n\nEarlier, Superintendent of Police N. Manivannan held a meeting with temple authorities and various security agencies, including the Coastal Security Group, Q branch and Intelligence Bureau and reviewed security arrangements for the consecration ceremony.\n\nHe said a posse of about 1,000 police personnel would be deployed for the security from January 15, when the rituals for consecration would begin, he said. CCTV cameras would be installed at 30 strategic points and all vehicles entering the island would be checked at the entry point of Pamban road-bridge before they were allowed into the island.", 
    "section": "national", 
    "title": "Chief sthapathi inspects Ambal idol for damage", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}