{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "In a shocking incident, a Class VI student of Municipal Girls’ Higher Secondary School here was found carrying ‘uli’ (a sharp edged chisel-like tool) with the alleged intention of stabbing her teacher for admonishing her for coming late to school.\n\nPolice said that the girl, who was accompanied by her mother, carried the ‘weapon’ covered in a handkerchief, when she came late to school after lunch break on Friday. When the Tamil teacher asked them to meet the Headmistress for coming late, she heard the girl’s mother asking the student to stab her “come what may,” police said.\n\nIt was only after a little commotion, did the teacher notice the girl carrying the ‘weapon’ and seized it, police said. After a wordy duel, the girl’s mother left the school, after which, the school HM handed over the girl to the all-women police with the ‘weapon,’ police said.\n\nObjecting to the school handing over her daughter to the police, the girl’s mother visited the school again in the evening and abused the HM, right in the middle of the road, police said.\n\nTension broke out as a huge crowd gathered near the school and police had a tough time dispersing it. The middle-aged woman also abused a woman Inspector of police, police said.\n\nAmid high drama, police detained the woman and the girl on Saturday for questioning. During interrogation, the woman, told the police that she used to send her daughter to the school with the ‘weapon’ for her safety and denied having given it to stab the teacher.\n\nThe Tamil teacher lodged a complaint with the police, but police avoided registering a First Information Report against the woman and her daughter, considering the future of the girl. Police, however, registered a case against the girl’s mother for abusing the HM.\n\nIt is alleged that she brought a sharp edged chisel-like tool", 
    "section": "national", 
    "title": "Class VI girl brings weapon to school", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}