{
    "author": [
        "S Senthalir"
    ], 
    "text": "They took part in a walkathon on Puducherry beach\n\nParticipants at the walkathon organised as part of Coast Guard Raising Day celebrations 2016 held on Beach Road in Puducherry on Saturday.Photo: S.S. Kumar\n\nIn view of the 40{+t}{+h}Raising Day of Indian Coast Guard to be observed on February 1, coast guards along with their family members in Puducherry took part in a walkathon on beach road on Saturday morning.\n\n“This walkathon is organised to create awareness on clean and safe waters,” said Suresh C Tyagi, deputy inspector general, Commander Coast Guard (Puducherry).\n\nConcerned over the dumping of plastic waste along the beaches, he said: “We need to have good practices for better climate. This walkathon is to spread the message of co-existence of people with nature.”\n\nWith an objective of associating with people living along the coastline , the Coast Guards plan to work with the government departments and non-governmental organisations (NGOs) to create awareness. “We should spread the message of keeping the sea water clean. Littering on the beach should not be allowed. Steps should be taken to stop flow of drainage water into the sea and conserve marine life in order to protect environment and for the future generation,” he said.\n\nEven children took part in the Raising Day of Indian Coast Guards in Puducherry. They carried placards with message of protecting environment. Vansika, studying 7{+t}{+h}standard in Kendriya Vidyalaya School, says: “Every year, we observe this day. Last year, in Tuticorin we carried out beach cleaning day on the occasion of the Coast Guard’s Raising Day programme.”\n\nA painting and drawing competition for the children of Coast Guard officials will be organised on January 26. The winners of this competition will be awarded prizes on February 1. “We are also organising a cultural programme where children will stage a play and recite poems. We are expecting at least 350 to 400 people to gather at that event,” said Mr Tyagi.\n\nHe added that ships will be illuminated based on the availability on February 1.", 
    "section": "national", 
    "title": "Coast guards, families walk for clean seawater", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}