{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Water level in many areas has gone up by 6-8 metres this month. Quality has improved too\n\nThe heavy rain of the northeast monsoon has replenished the groundwater level in many parts of the city.\n\nAccording to Chennai Metrowater’s data, the water level in many areas has gone up by 6-8 m this month and the water quality has improved. Residents, who were struggling to fill overhead tanks despite operating motors for several hours, now have water just a few feet below the surface. But, how long this level can be sustained depends on the soil condition and extent of extraction, officials said.\n\nResidents of Ambattur, Puzhal, Saidapet and Kotturpuram can now draw water with ease as it is now available within one metre below ground level.\n\nAreas like Ayanavaram, Parrys’ Corner and Little Mount, where water level had sunk to 10 m, now have water at an average of 5 m below the ground.\n\nLast year, Chennai received 209 centimetres against its yearly average of 140 cm.\n\nMetrowater monitors water level and quality in 145 observation wells to collate the data about the groundwater potential in city. Locations like Mandaveli and Besant Nagar too have seen considerable rise in groundwater.\n\nSources in the Central Ground Water Board said most of the locations have recorded a considerable improvement in the groundwater level because of the abundant monsoon rain. “This year, most lakes are brimming with water.\n\nThis will help sustain the groundwater recharge at least till June,” said an official. Areas like T. Nagar, where the water level was at 7.8 metres, now have groundwater available at just 2-3 metres.\n\nHowever, at places like Tiruvottiyur and Ayanavaram, water is still nearly 5 m below the ground.\n\nExperts say this could be due to lack of proper means of percolation and rainwater harvesting.\n\nRain Centre’s director Sekhar Raghavan, said people with open wells and those living close to water bodies may experience better groundwater recharge.\n\nHowever, thickly-populated localities like Triplicane and Tondiarpet may not see much of a rise in water level. “In these areas, there is not much space to harness rainwater by households. The government must take steps to harvest rainwater in such areas,” he said.\n\nWhile the rise in levels in clayey and rocky region is temporary, sandy areas will have a better water table as percolation is distributed to more depth, he said.", 
    "section": "national", 
    "title": "Copious rains help raise water table", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}