{
    "author": [
        "M K"
    ], 
    "text": "In October last year, 70-year-old K.V. Pushkar alias Mani and his wife Bhavani (60) went to Chennai, in search of a better livelihood. The couple from Thrissur lived in Coimbatore for 40 years before that.\n\nBut Mani, who once owned two lorries, and his wife were spotted begging for food near the Eachanari temple on Thursday.\n\nAfter losing his vision, undergoing a heart surgery and suffering knee problems, Mani sold the vehicles and worked as a watchman in Coimbatore for Rs. 4,500 a month. His wife made a few hundred rupees as domestic help, before they vacated their rented house at Madukkarai and went to Chennai in October 2015 with all their worldly possessions.\n\nThe couple rented a house at Velachery and Mani got a job as a watchman and was promised Rs. 7,000 a month. His wife worked as a domestic help in several homes. But, the rains in Chennai changed everything for this couple. “The day before we were to get the first month’s salary the floods washed away everything,” Mani said.\n\nTheir ration card and voter’s ID were also washed away. His employer could not pay his salary as he too suffered heavily. The couple was rescued from the flood and was in a relief camp, from where they returned to Coimbatore, in a free bus operated by the government.\n\nThey went to Eachanari three weeks ago as a few persons known to them lived there.\n\n“We had lunch at the Eachanari temple and starved for the rest of the day,” Bhavani said with tears. Hungry, they began to beg a few days ago.\n\nA kind hearted policeman gave them Rs. 100 a day for a couple of days with which the couple managed to buy food and they slept in a nearby government school.\n\nOn Thursday, the Podanur Police and Eera Nenjam Trust came to know about their plight and took them to the night shelter at R.S. Puram. “Now, we are getting food and have a place to stay,” Mani said.\n\nThe Managing Trustee of Eera Nenjam, P. Mahendiran, said that they will appeal to the district administration to help the couple get the flood benefits and to provide them with old-age pension. “There are many such illiterate families from other places who suffered the same plight in the floods at Chennai. The government should work out a mechanism to identify and rehabilitate them,” he added.", 
    "section": "national", 
    "title": "Couple reduced to begging after Chennai floods washed away everything they owned", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}