{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Judges were very impressed by the sportsmanship exhibited on the first day of the show which saw six breeds competing in different rounds —Photos: R. Ravindran\n\nNearly 400 dogs participated on day one of the Madras Canine Club’s All Breeds Championship Dog Show. The importance of preserving Indian breeds such as Rajapalayam and Chippiparai was stressed at the event\n\nabradors, Retrievers, Great Danes, Beagles and Pugs — canine cuteness came in various sizes at the YMCA grounds in Nandanam as the All Breeds Championship Dog Show organised by the Madras Canine Club kicked off on Saturday morning.\n\nThe dog show, this year, had Labrador Speciality Show and Great Dane Speciality Show for the breeds, which saw a number of entries from across the state. Many people flocked to the Great Dane Speciality Show in which over fifty dogs participated.\n\n“While about 386 dogs, which include 46 breeds, have registered, we have seen a slight dip in the registrations for the show owing to the postponement of the show from December due to the rains. The crowd has however been good and we expect a bigger crowd on Sunday,” said C.V. Sudarsan, President of the Madras Canine Club. Among the rare breeds participating this year are the Afghan Hound, Wire fox Terrier, Boerboel and Australian Shepherd.\n\nMaking a case for promoting Indian breeds, Mr. Sudarsan said that the Madras Canine Club and the Kennel Club of India had been creating awareness about Rajapalayam, Chippiparai and Mudhol Hound. “The kennel club facilitates the free injection of microchips for Indian breeds. We also tell people who want to take pets into their homes to not discriminate between breeds,” he said.\n\nPraising the sportsmanship exhibited at the dog show on the first day, Judges William R. Umana from Costa Rica and Timothy Thomas from Australia said the dogs in the fray were impressive. “The Dachshunds in particular have been very good,” Mr William said.\n\nWhile the first day of the event saw about six breeds competing in different rounds, Sunday will also have other breeds participating in the show and a finale which will follow in the evening.\n\nSwamy, a trainer from the K9 Gurukul, Bengaluru, who was a part of a team of trainers with 10 Labradors and Rottweilers, said that the competition was tough this year .\n\n“The weather however has been more hot and sultry than we expected so all the trainers are being cautious and ensuring that the dogs are hydrated and don’t tire out,” he said.\n\nThe Great Dane Speciality Show in which over fifty dogs participated was a huge hit", 
    "section": "national", 
    "title": "Dogs of all coats flock to YMCA", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}