{
    "author": [
        "Pankaja Srinivasan"
    ], 
    "text": "The FLO Bazaar offers an opportunity to get back to traditional foodstuff brought there by SHGs and women entrepreneurs.\n\nSo much is spoken about sustainable development, eating food that is grown in the neighbourhood and encouraging local businesses. The FLO (FICCI Ladies Organisation) Bazaar at Suguna Kalayana Mandapam on Avinashi Road encourages just that.\n\nIt is their aim to help women at grassroots levels set up modest enterprises, provide them with business skills and furnish a platform for them to market their products.\n\nDivided into two sections, the exhibition has an outer enclosure with saris, jewellery, beauty products, home décor, etc. But what is really worth spending time over are the stalls tucked away behind.\n\nThat is where you meet the people who grow food, weave cloth and offer homemade nourishment.\n\nYou can buy things from them that may not be readily available to you in your supermarkets, and perhaps at a fraction of the cost.\n\nRajammal comes every year for the FLO Bazaar.\n\nShe weaves pure cotton saris in Sirumugai and she sells them here for anything between Rs. 250 and Rs. 800. There is also terracotta jewellery, beaded jewellery, baskets, petticoats and blouse pieces.\n\nBut it is the foodstuff that is noteworthy. S. Damayanthi generously scoops up a delicious powdered sweet (made up of mixed kanji podi roasted and powdered peanut, sesame and sugar). She is a nutritionist, she says, and swears by the goodness of millets and sprouted grains. She sells millet, kambu, ragi and wheat meal. She has a multi grain porridge mix made entirely of healthful things.\n\nThere are several stalls selling health food. R. Parimala is from Koundampalayam and she sells aval made of ragi, cholam, kambu and wheat, karupatti vellam and whole millets.\n\n“It is all organic,” says Parimala. You know the murukku, paniaram, coconut, sesame and peanut burfis and obattu are nutritious.\n\nDrawing master Mr. R. Manickam proudly displays paintings made with seeds, dried leaves and bark by his tribal students from Anaikatti and Piloor. His work is apart of the programme by Avinashilingam Jan Shikshan Sansthan.\n\nPadma sells laundry bags, school bags and carry bags. “They are made of parachute cloth. They are durable and convenient to carry,” she says. The bags are pocket-sized when they are packed and open into big shopping bags when opened. “They can easily carry up to 25 kg,” she says. And it is a great thing to keep in the handbag or your car so that you can say ‘no’ to plastic bags.\n\nThe cost of these bags range from Rs. 99 to Rs. 799. they are already half sold out, but Padma assures us that she will home deliver the bags if you so want.\n\nThe Bazaar is on from 10 a.m. to 8 p.m.", 
    "section": "national", 
    "title": "Eat healthy; lend a helping hand too", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}