{
    "author": [
        "Special Correspondent"
    ], 
    "text": "English has been able to absorb new words from world over, says V. Balasubramanian\n\nGovernor K. Rosaiah giving away the gold medal and a degree certificate to N. Malathi, a postgraduate student of literature, at ninth convocation of Tamil University in Thanjavur on Saturday. At right is V. Ramasubramanian, judge, Madras High Court. Minister for School Education K.C. Veeramani (second from left) and G. Bhaskaran (left), Vice-Chancellor, are with them.— PHOTO: R.M. RAJARATHINAM\n\nTamils must learn to replicate the success and sweep of English language that did not stagnate at its origins but revolved to retain its relevance and eminence.\n\nThis will partly address genuine concerns amongst Tamils on the future of the language and cultural identity of its speakers, V. Ramasubramanian, Judge, Madras High Court, counselled the graduates and scholars at the ninth convocation of the Tamil University here on Saturday.\n\nDelivering the convocation address Mr. Ramasubramanian sought to draw the attention of the Tamil scholars to the means for redeeming the hallowed sanctity of Tamil language by pondering over the background. “Language exhibits the culture of a society, the way of life of its people. Institutions such as Tamil University must hold aloft the illustriousness of the language and the culture that it exemplifies,” he says.\n\nAlthough adorable, antiquity in several instances fails to pass muster when compared to youthful exuberance and language was no exception to that maxim. It was unfortunate that in a commercialised world, the classical Tamil has paled in comparison with the English language.\n\nThat was because English and its speakers had never flinched from adopting new words and coinages as exemplified by the Bard of Avon Shakespeare who making use of the advent of the printing machine coined new words and usages out of Latin to revolutionise the language.\n\nWith a significant portion of the earth under its belt by the turn of the 19th Century, English was able to absorb words and usages from several tongues the world over, Mr. Ramasubramanian pointed out and added that Tamil needed to adopt that malleability.\n\nDoubting the efficacy of Tamil medium as the only means to inculcate the language among young minds, Mr. Ramasubramanian said effectuation amongst students that a way to unwind oneself from the rigours of commercial living was in developing interest in classical languages could partly achieve that. You could take a pony to a pond but could not make that drink water, he said. The Judge, who hails from Thanjavur, implored the Tamil University to research and publish the contents of the numerous palm leaf manuscripts in the Thanjavur Maharajah Serfoji's Saraswati Mahal Library terming that it would be yeoman service to the future generations. The varsity could venture into creating encyclopaedias in Tamil for the expanding branches of knowledge.\n\nTamil Nadu Governor and Chancellor of the university K. Rosaiah presided over the convocation and conferred degrees to 238 M. Phil scholars among others.\n\nThree students were awarded gold medals for outstanding performances.\n\nK.C. Veeramani, Minister for School Education, Tamil Official Language and Tamil Culture, and also the Pro-Chancellor of the University, Tamil Development and Information Secretary M. Rajaram and Tamil University Vice-Chancellor G. Bhaskaran were present.", 
    "section": "national", 
    "title": "Enrich Tamil with new words: judge", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}