{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The club lures youth towards gambling activities, they allege\n\nThe farming community has complained to the district administration about what they consider a cultural degradation caused by an entertainment club at Ekkatampalayam village along Chennimalai-Kangayam Road.\n\nLetter\n\nIn a letter to the District Collector S. Prabakar, the president of Thadapalli-Arakankottai Ayacut Farmers’ Association, Subi Thalapathi, said the agricultural community, especially youth, were lured into gambling activities in the club, and had lost enormous money and property.\n\nRepresentations to the Superintendent of Police about anti-social activities in the club have gone unheeded, Mr. Thalapathi said.\n\nThe club with facilities for games and swimming pool was frequented by several customers. Several youths in the surrounding villages have become victims of alcohol and other vices after frequenting the club, said farmers belonging to Pasuvapatti village.\n\nWhen the issue was raised in the farmers’ grievances redress meeting on Wednesday, District Revenue Officer R. Satheesh assured that the licence of the club will be verified.\n\nBaseless allegations\n\nSuperintendent of Police M.R. Sibi Chakravarthy said that the allegations turned out to be baseless when the police department had, in the past, conducted raids on a couple of occasions following such complaints.\n\nThe farming community was incensed by a recent incident of an employee of the club riding a two-wheeler in an inebriated condition and fatally knocking down an aged farmer who was moving on a moped with his three grandchildren in the vicinity of the club.\n\nThe grouse of the farmers was that the police have not done enough to rein in the club.\n\nThe club with facilities for games and swimming pool was frequented by several customers, farmers say", 
    "section": "national", 
    "title": "Farmers demand closure of entertainment club", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}