{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The country’s first Fast Reactor Fuel Cycle Facility (FRFCP) is coming up at Kalpakkam at a cost of Rs. 9,600 crore, said S.A.V. Satya Murty, director of Indira Gandhi Centre for Atomic Research, Kalpakkam.\n\n“This is a first of its kind plant in the country. It is an integrated facility that will have a fuel fabrication, fuel reprocessing, reprocessed uranium oxide, core sub-assemblies plants and waste management facility all in the single complex,” he said.\n\nHe was delivering the inaugural address on “Nuclear power for energy security for enhancing quality of life” at InoVIT-2016, South India-level science contest for school children on Saturday.\n\nTalking about the three-stage nuclear power programme, he said, “In stage I, we have Pressurised Heavy Water Reactors (PHWR) where we already have 18 operating power plants, and four are under construction.”\n\nFast Breeder Reactors come in stage II. “The 500 MWe Prototype Fast Breeder Reactor at Kalpakkam is under commissioning, and it will become operational in a few months,” Mr. Satya Murty said. The third stage comprises thorium based reactors. Noting that fast reactors play an important role for energy security, he said, “Two 600 MWe Commercial Fast Breeder Reactors are in the advanced stage of design. Already, we are designing Metal Fuel Test Reactors for next generation of reactors. By 2030, we are planning for Metal Fuel Breeder Reactor of 1,000 MWe.”\n\nHe said that nuclear power, which is a clean and green source, is an inevitable option for India.\n\nCoal reserves\n\nExplaining this, he said the estimated coal reserves in the country was 200 billion tonnes, all of which cannot be used for electricity generation alone and was also required by steel and chemical industry.\n\n“Coal can meet demands for 130 years if used for electricity generation alone. Hence, it is essential to reduce coal consumption for electricity,” he explained. He noted that solar plants were costly and disposal of waste was a problem.", 
    "section": "national", 
    "title": "First fast reactor plant coming up at Kalpakkam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}