{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Minister says State’s average paddy yield is 3,100 kg a hectare\n\nAgriculture Minister R. Vaithilingam (second from right) inspecting paddy varieties at the Farmers' Day exhibition held at the Tamil Nadu Agricultural University in Coimbatore. Minister S.P. Velumani (right) and Collector Archana Patnaik (left) are in the picture.— Photo: M. Periasamy\n\nTamil Nadu’s food production will increase to 170 lakh tonnes in 2015-16, said Agriculture Minister R. Vaithilingam at the Farmers’ Day function in Tamil Nadu Agricultural University (TNAU) on Friday.\n\nHe said that at the start of the financial year the State had fixed 145 lakh tonnes as the target but the efforts of the government, TNAU, and farmers had ensured that the target was surpassed.\n\nIn 2014-15, the government had fixed 128 lakh tonnes as the target.\n\nThe State’s food production had increased after the AIADMK Government assumed office and had declared that doubling food production and tripling farmers’ income was its goal.\n\nFor long the State’s annual production had stood at around 75 lakh tonnes.\n\nMr. Vaithilingam said that in 1970-71, the State’s average paddy yield was 1,900 kg a hectare. Now it stood at 3,100 kg a hectare. Likewise, the average yield of small cereals and pulses had increased respectively to 2,394 kg a hectare, and 572 kg a hectare.\n\nThis was because of the TNAU releasing high-yielding, pest-resistant crop varieties and taking it to the farmers.\n\nSo far, the TNAU has released 799 high-yielding varieties of various crops, and this year it had introduced eight new varieties and three farm implements.\n\nState Agriculture Director M. Rajendran said the State stood first in terms of agriculture productivity and had even surpassed Punjab, where canal irrigation is strong. In pulses too the State is doing extremely well and has won the Krishi Karman Award.\n\nTNAU Vice-Chancellor K. Ramasamy said that after a long time the State Government had given money to carry out research. It usually only supported the institution to meet salary expenses. This year the government’s support for research was Rs. 75 lakh and it was Rs. 23 lakh more than last year’s.\n\nHe added that if the State Government could promise water for every farmer in the cultivation season, it could work wonders.\n\nPollachi V. Jayaraman, Deputy Speaker, spoke on the need for drip irrigating the Parambikulam-Aliyar Project canal ayacut areas for improving production.", 
    "section": "national", 
    "title": "Food production to touch 170 lakh tonnes in 2015-16", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}