{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "High import duties on machinery and raw materials are bothering knitwear printing unit owners in the apparel production chain in Tirupur.\n\nHigh import duty on machinery, raw materials and finance mobilisation issues have hit knitwear printing units in Tirupur knitwear cluster.\n\nThe entrepreneurs in the sector feel that the import duty presently levied at the rate of 30 per cent on printing inks, other raw materials and machine spare parts , and at the rate of 27 per cent on the machinery has affected the operational viability of the units.\n\n“It should be noted that 80 per cent of the printing ink used by the around 500 units in the cluster are imported from countries such as the United States of America, Italy, Israel and Japan. Almost 95 per cent of the modern machines used for knitwear printing here are imported ”, T. R. Srikanth, president of Tirupur Export Knit Printers Association, told The Hindu .\n\nThe high import duty slabs along with periodic rise in power tariff and labour costs will spell doomsday for the units if adequate steps were not taken by the authorities to support the segment on a war footing, he added.\n\nKnit printing unit owners also have a slew of reasons to substantiate their claim for drastic reduction in the import duty rates.\n\n“Printing actually gives value-addition to the exports of end-products (garments). Around 70 per cent of the garments presently exported from the cluster have printings, a significant leap in the recent years. Only the end-product exporters alone get the benefit of duty drawback not us”,” Mr. Srikanth said.\n\nOn the finance front, the knitwear printers expressed unhappiness over the reported compulsions by the banks for 100 per cent collateral security against loans sought for machine and raw material purchases by the micro, small and medium-sector knitwear printing units. High interest rates on the loans, despite slashing of Repo rates by RBI four times in the last one year, also bother the capital-intensive knit printing segment.", 
    "section": "national", 
    "title": "Heavy import duty a deterrent for knitwear printing segment", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}