{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Cathedral stands as a centre of learning, says P.J.Kurien\n\nThe landmark was completed in 1815 and consecrated the following year — Photo: R. Ravindran\n\nThe bicentenary celebrations of St. George’s Cathedral began on Thursday.\n\nLaunching the celebrations, Rajya Sabha deputy chairman P.J. Kurien said the cathedral is an icon in the city of Chennai. “The Cathedral stands as a centre of learning. It is a shining star,” he said.\n\nPointing to the role played by the church in nation building and development, Prof. Kurien said the heritage structure should continue to improve the quality of life of the people and empower the marginalised.\n\nChurch of South India Moderator and Bishop-in-charge Rev. G. Dyvasirvatham said the cathedral occupies a central place in the city, adding beauty and also facilitating reconciliation and forgiveness.\n\nThe heritage building was built in 1815, emerging as one of the most beautiful landmarks in the city. The building was completed at a cost of 41,709 pagodas. The furniture, the organ and the architect’s commission increased the cost to 57,225 pagodas. (One pagoda was equivalent to Rs.3.50)\n\nOn January 6, 1816, the first Anglican Bishop in India Rt. Rev. Thomas Fanshaw Middleton consecrated the church. It houses one of the oldest pipe organs in the city. On September 27, 1947, the Church of South India was inaugurated in the cathedral.\n\nWith its tall steeple, majestic pillars, wide sweeping entrance, and the tiered steps on which it rests, the cathedral is an architectural delight, attracting worshippers and tourists in large numbers.\n\nThe Turret clock was set up on the three faces of the Church steeple, which is 139 feet high. The stained glass windows and the two panes on either side of the altar, which depicts the baptism of Jesus and his meeting with Mary Magdalene after his resurrection, are lovely examples of medieval art.\n\nThe heritage building, one of the most beautiful landmarks in the city, was built in 1815", 
    "section": "national", 
    "title": "Iconic St. George’s Cathedral celebrates bicentenary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}