{
    "author": [
        "M K"
    ], 
    "text": "106 persons missing in 2015 are yet to be traced\n\nThere is an increase in the number of missing persons cases registered by the police in Coimbatore City and Coimbatore District in 2015. Five hundred and sixty one people went missing in 2015 while in the previous year the number was 500. According to the police, 106 persons missing in 2015 are yet to be traced.\n\nIn Coimbatore city alone, 254 persons went missing in 2014 with 21 yet to be traced. In 2015, 279 people went missing and 54 are yet to be found.\n\nIn Rural Coimbatore, 211 of the 246 missing persons in 2014 were traced. In 2015, of 282 persons 52 of them are still missing.\n\nPriority\n\nTracing missing persons is a priority for them, say the police as there have been cases when some of the people have been found murdered. City police officers said sometimes they have traced missing persons even after two years.\n\nIn July last year, the police tracked down children who left their homes three years ago. They were reunited with their parents.\n\nIn most cases, the police say, the relatives know the whereabouts of the missing persons or why they went missing, but they will not disclose the fact.\n\nThis makes it more difficult in tracing them.\n\nStatistics show the number of women and girls missing is more.\n\nReason\n\nSometimes a disinclination to attend school or college is the reason for leaving home or in some cases it is because of parental opposition to youngsters in love.\n\nThe police register a case against the girl’s lover for kidnapping if she is less than 18-years-old.\n\nLast year a few men who eloped, married and sexually abused minor girls were booked under the Protection of Children from Sexual Offences Act and were convicted. Incidents of married people eloping with someone else are also booked as missing, a police officer said.\n\nSometimes these cases take an unexpected turn, say the police.\n\nFor example, the case of a child in an area under the jurisdiction of Race Course Police Station who was kidnapped and handed over to a couple in Kerala.\n\nThe police traced her two years later, but she refused to return to her original parents as her new parents were very good to her.", 
    "section": "national", 
    "title": "Increase in number of persons who went missing last year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}