{
    "author": [
        "P Sudhakar"
    ], 
    "text": "None of their relatives turned up to take care of them after their father set the mother afire\n\nWhen three frail-looking boys, aged between 11 and 7, entered the Mahila Court hall around 6 p.m. along with a couple of police officers on Friday even as the staff were preparing to leave, those who were standing on the corridor could not understand as to why the children had been brought to the court at this time. Only when Mahila Court Judge J. Flora started speaking to the children with compassion and discussed with the police officers about their future, the onlookers had a sketchy idea about the purpose of the boys’ visit.\n\nAfter hearing the case pertaining to the burning of a woman alive by her husband, Ms. Flora had sentenced on Friday morning the accused husband, M. Subbiah (44) of Semaputhur under Koppampatti police station limits in the district to life imprisonment, leaving a big question mark over the future of the couple’s three boys.\n\nWhen the Judge, through the police, tried to meet Subbiah’s relatives in a bid to convince them to take care of the almost orphaned children, none of them turned up, saying that they would not accept them. This made the judicial officer’s job tougher. However, her repeated attempts to bring the boys’ maternal uncle to court finally fructified and he agreed to take care of the children until they are admitted to a home at Adaikkalapuram near Tiruchendur being run by the Roman Catholic Missionaries.\n\n“After the drunkard father Subbiah, a labourer, set afire their mother in the presence of the three children, he was arrested and subsequently enlarged on bail. However, the alcoholic never bothered about the education of his malnourished children even after coming out of jail on bail. Hence, the Judge before leaving the court wanted to ensure the children’s unhindered studies besides ensuring their safety by admitting them in a safe and government-recognised home,” said a police officer accompanying the boys.\n\nWhen the Judge left the court complex after ensuring a relatively consoling environment for the three unfortunate children, it was past 7.30 p.m. even as her son was waiting at home for his mother.", 
    "section": "national", 
    "title": "Judge secures future of orphaned boys after sentencing father to life", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}