{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Villagers engaged in preparation of ground where jallikattu will be conducted in Koolamedu village, near Attur, in Salem district.— PHOTO: E. LAKSHMI NARAYANAN\n\nt’s jubilation time in Koolamedu village and its surrounding areas near Attur town. For people of Koolamedu, one of the famous centres for jallikattu in the western region, and the surrounding dozen villages, the Centre’s notification on Friday enabling the conduct of the sport has brought much delight.\n\nJallikattu has been a regular event during the Pongal festival in this village for decades together. Due to the Supreme Court ban, the sport was not held last year.\n\nPeople were keeping their fingers crossed this year too without knowing the fate of the event. Their joy knew no bounds when the news of the Centre’s nod for jallikattu came on Friday.\n\nThe organising committee of jallikattu did not lose any time and swung into action instantly. While one set of organisers rushed to Salem city to meet the district authorities to present petition and discuss the formalities for holding the event on January 18, another set launched the preparation works.\n\nThough jallikattu was a regular event in Thammampatti and Kondiyampalli along with Koolamedu in the past, people of the other areas except Koolamedu could not continue the sport due to stringent conditions laid down by the Supreme Court. The continuous holding of jallikattu event without any break at Koolamedu has also found a mention in the government gazette.\n\nThe work of levelling the five-acre Perumal Temple ground, spreading the river sand and setting up barricades have already commenced and a large number of youths of the village are involved in the same.\n\nOne prime reason for Koolamedu remaining in the jallikattu centres’ map continuously is the presence of a good number of bull tamers, and bulls.\n\nExpecting a positive outcome from the Centre this year, the bull owners of Koolamedu had started training the bulls a couple of months ago.\n\nAccording to A. Kandasamy, former president of Koolamedu panchayat and convener of the jallikattu, more than 200 bulls from the surrounding villages and also from the districts of Madurai, Pudukottai, Namakkal, Perambalur and Ariyalur are expected to participate in the event.\n\nMr. Kandasamy said that the organisers would abide by the conditions laid down by the Supreme Court and had already given an assurance in this regard to the authorities. The villagers say that the condition of depositing Rs. 2 lakh was very much on the higher side and mobilising this amount through public donations is proving a difficult task. Already the organisers have to cough out much for meeting the conditions of the Supreme Court. The State Government should take this into consideration and come forward to provide special funds to the villages conducting the event, Mr. Kandasamy said.", 
    "section": "national", 
    "title": "Koolamedu gearing up for jallikattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}