{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Bharatiya Janata Party Government lifting the ban on jallikattu and other bull sports is a victory for all political parties that have been demanding it, Pattali Makkal Katchi general secretary G.K. Mani said here on Saturday.\n\nAddressing reporters at a press meet, he said that several political parties including the PMK had championed the cause of jallikattu enthusiasts and sought lifting the ban. PMK’s chief ministerial candidate Anbumani Ramadoss had met the BJP leaders including Prime Minister in this regard.\n\nTherefore the lifting of the ban was a victory for all the parties.\n\nThe PMK was very much open to alliance with the Bharatiya Janata Party provided the latter accepted the party’s conditions, the foremost among which was Mr. Anbumani Ramadoss’ nomination as chief ministerial candidate. The PMK was for an alternative alliance that did not include either the AIADMK or DMK.\n\nHe then spoke about the meeting the party’s NGO-arm, Pasumai Thayagam, had organised in the city on January 12 with captains of the industry and owners of micro, small and medium enterprises to discuss their problems in the State.\n\nIt was a non-political event aimed at listening to their problems and explore ways to address those problems. The outcomes could form a part of the PMK’s manifesto for the 2016 Assembly election, Mr. Mani said.\n\nThe situation was so bad in the State that industries no longer displayed the ‘workers wanted’ boards outside their establishments.\n\nLikewise, there was very little support for establishing new industries in the State.\n\nThe State suffered power shortage, increase in raw material price, lack of marketing support, he said and added that they needed to be addressed to make the State number one in industrial production.\n\nHe also said that the meeting could see the participation of representatives of over 250 associations from across the State.", 
    "section": "national", 
    "title": "Lifting of ban a victory for all, says PMK", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}