{
    "author": [], 
    "text": "RELIGION\n\nRamakrishna Math: Discourse on “Aanmeega Vaazkai,’ by Swami Rajeshanandar, 5.45 p.m., Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nPaneeru Thirumurai Mandram: Pannisai by S.S. Mohanram, Adi Streets, 7 a.m., Discourse on ‘Periyapuranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar, 5 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSreemath Bhagavath Gita Siravana Samajam: 85{+t}{+h}year Sreemath Gita Siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal 6{+t}{+h}Street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs 6 a.m., Paavai songs and devotional songs, Adi Street 6 p.m.\n\nMadurai Srimad Venkatramana Bhagavatha Seva Samajam: 235{+t}{+h}jayanthi celebrations of Venkatramana Bhagavathar, third-day events, Malligai Balachandar presides, 10.30 a.m., flute by Dr. G. Baskar Rajan Sourashtra Sabai, Sri Renga Mahal, No. 13 South Krishnan Koil Street South Masi, 8 p.m.\n\nThe American College: Sunday Vespers Service J. John Rajkumar preaches, W. Prince Earnest leads, Jubilee chapel, 6 p.m.\n\nChurch of Christ: Sunday service, Bro. Devamanickam speaks, Thanksgiving by M.S. Raja, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 64{+t}{+h}music and arts festival, vocal concert by Sanjay Subrahmanyan, Lakshmi Sundaram Hall, 6 p.m.\n\nHindu Temple Protection Committee: Uzhavara Pani, Koodal Alagar Temple, Sri Akilandeswari Samedha Thirumulanadhar Temple, Sholavandan, and Sivan Temple, Melur, 9.30 a.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nRama Samajam: Upanyasam on ‘Sri Meenakshi Thirukalyanam’ by Visaka Hari Sringeri Sri Saradambal Sannidhi, bypass road, 6.30 p.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nMadurai Hindu Nadar Bakta Sabai: Discourse by Illampirai Manimaran on ‘Geethai Ennum Pokkisham,’ Mottai Vinayagar Mahal,’ East Masi Street, 6.30 p.m.\n\nSivananda Tapovanam: Swami Vimalananda’s 15{+t}{+h}mahasamadhi aradhana special function, Swami Sivananda Sundarananda presides, Thirumurai Isai by Meenakshi Temple Oduvars, Thoppur Sivananda Nagar, 6 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nSri Sathguru Sangeetha Samajam: Conferment of the titles – 2016 Madhurakala praveena on Sangeetha vidwan Sanjay Subrahmanyan, Madhurakala Mani on Mrudanga vidwan Palladam R. Ravi, presentation of cash award to violin vidwan M. Dhakshinamoorthy by Shobana Ramachandran, president, samajam, Lakshmi Sundaram Hall, 5.15 p.m.\n\nMadurai Media and Film Studies Academy: Interaction with cine director Chimbu Devan and distribution of certificates for the first batch of students, Academy Director Dr. T. Chinnaraj Joseph Jaikumar, presides, Old Natham Road, 5 p.m.\n\nGomathipuram Thendral Nagar Residents’ Association: Inauguration of CCTV cameras, Commissioner of Police Shailesh Kumar Yadav chief guest, Rajaprabha Kalyana Mandapam, fifth main road, 10.30 a.m.\n\nMadurai Vetrilai Paaku Beedi Cigarette Varthagar Sangam: 73{+r}{+d}anniversary, Minister ‘Sellur’ K. Raju, Mayor V.V. Rajan Chellappa, Madurai MP R. Gopalakrishnan address, Sangam president P.A. Sankar presides, Chandrakulandai Thirumana Mahal, Kamarajar Salai, Teppakulam, 10 a.m.\n\nNeyam Special School: Graduation day and grand opening of mainstream classroom, hi-tech sensory, developmental and speech therapy rooms, V.C. Gandhi and B. Deivanayakam guests of honour, R. Azhagarswamy presides, Sasi Nagar West, Edison Street, P and T Nagar, 11 a.m.\n\nGiants Group of Madurai Thirunagar: New office-bearers installation, P.S. Kannan Kings College of Engineering, Thanjavur chief guest, CA.M. Lakshmanan, Deputy World Chairman, Giants International, guest of honour, V. Ayyappan speaks, No. 26-A Rajaji Street, Tirunagar, 6.30 p.m.\n\nAlcoholics Anonymous: Meeting, V.R. Krishna Iyer Community Hall, 7 p.m., Alfred Noble Mat. HSS Tirunagar, 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}