{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "BRISK BUSINESS:Members of Amma Mannai Mahalir Kuzhu at Vellivalasu in Erode district who are involved in manufacture of animal feed are in the process of expanding customer base.- Photo: M. Govarthan\n\nRunaway success in experimental animal feed production has brightened prospects for the Amma Pannai Mahalir Kuzhu at Vellivalasu to transform into full-fledged entrepreneurs.\n\nThat the group with 20 members, who do the production work themselves, has clocked turnover of Rs. 62 lakh comes in as no surprise since there are buyers for the entire 50 tonnes produced a month at a rented building for which they pay a monthly rent of Rs. 5,000.\n\nThey had a confident start after receiving training at the Animal Feed Analytical and Quality Control Laboratory attached to Veterinary College and Research Institute, Namakkal.\n\nThey have named the brand Chinnamman-periyamman after their traditional deity. The Kuzhu was among 32 such farm women groups initiated in the district during November 2014.\n\n“The feed is sold at a competitive rate of Rs. 15.80 a kg and hence the demand. The consumer network was created with the support of other farm women groups and cooperative milk societies,” said Kulandaivelu, Assistant Director of Agriculture, Modakurichi Block.The samples are tested regularly for validating the right ratio of inputs -- rice bran, groundnut cake, minerals mixture, black gram husk, jaggery, bajra, maize, sorgam, palm cake, cotton seed, common salt, red gram husk, and bengal gram husk.\n\nThe customers have responded positively saying the milk yield has increased by 15 per cent to 20 per cent.\n\nThough the formula is uniform for all branded animal feed, the women group is able to offer their product for a few rupees lesser per kg since the overheads is low on account of own labour.\n\nIn all probability, the Vellivalasu group that has invested Rs. 15 lakh by itself for the venture will qualify for the State Innovative Scheme that would entitle it for substantial subsidy benefit, Mr. Kulandaivelu said.", 
    "section": "national", 
    "title": "Making a fortune from animal feeds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}