{
    "author": [
        "S Poorvaja"
    ], 
    "text": "While some from film fraternity are sceptical about pricing, others hope it can screen unreleased movies\n\nThe arrival of Netflix in India has evoked a mixed reaction from the Tamil film fraternity. While some say the pricing is high and will not go down well with the audience here, others say that this could be a platform for movies that are unable to be released due to want of screens.\n\nThe Tamil film industry has the maximum number of movies that do not hit the screens. Some of these films are more than three years old. If Netflix could capitalise on this, it would be a win-win situation for both parties, analysts said.\n\nNetflix’s basic plan starts from Rs. 500 per month. For Rs. 650, subscribers can view HD content on 2 screens and subscribers who pay Rs. 800 a month can view content on 4 screens. Existing players in this industry like Hooq charge Rs. 199 per month upwards while Ogle charges Rs. 249 per month, an expert said.\n\n“This could also curb piracy and encourage legitimate viewing. Quality-wise, it has HD content which is far better than the pirated DVDs,” said Mr SenthilKumar, co-founder, Real Image Media Technologies. “The pricing however could have been lesser,” he said.\n\n“If they could get the pricing right they can succeed, because today, pirated DVDs flood the market on the first day of a film’s release and can even be downloaded online,” said the CEO of a firm which tracks pirated films online. Kalpathi Suresh of AGS Group, said, “Given the limited number of theatres, most movies are not released. This can be a significant alternate channel suited for small budget films.”\n\nBut some feel that the pricing is neutral. “The availability of good television shows and movies for which movie buffs had to hunt online is a huge appeal for us. The pricing of Rs. 500 per month is good for the content they offer,” said Ashok Gautham, a senior verification Engineer in the city.\n\nEchoing his views about the access to content, Prabhu, a resident, said this platform has added advantages like subtitles and a recommendation engine which helps find fresh content.\n\nSome say pricing high, while others look forward to capitalising on films that do not hit screens", 
    "section": "national", 
    "title": "Mixed reaction to arrival of Netflix", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}