{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Following Friday night’s incident, dean of Rajiv Gandhi Government General Hospital R. Vimala said a meeting with the Commissioner of Police had been set up for Monday.\n\n“At present, the police strength at the hospital is 39. We are going to request that it be increased to 80 and for a separate inspector to be attached to GH,” she said.\n\nMedical superintendent G. Sheelarani said a security system was already in place for the casualty and emergency sections with police personnel posted, but the police presence would be increased now.\n\nOn the number of attendants accompanying patients, she said: “The hospital policy is to only have one attendant per patient, but sometimes, usually in emergency cases, more people come in.”\n\nThe hospital has a total of 187 CCTV cameras at various points, but some of these have been removed at a block that is being demolished. There are 11 CCTV cameras at the casualty, said Dr. Sheelarani.\n\n“We are now planning to put in more cameras at the entry and exit gates,” she said.\n\nA senior police officer attached to the Flower Bazaar police station said that there were always two patrol vehicles around the hospital – one specifically for the hospital and another from the station.\n\n“Both vehicles are equipped with weapons and walkie-talkies, and at any given time, 14 to 15 police personnel can be there in case of an emergency,” he said, adding that the police too would make a push for increased security at the hospital.\n\nSeveral organisations have condemned earlier attacks and called for the stricter implementation of laws meant to protect hospitals.\n\nC. N. Raja, member of the Indian Medical Association, Tamil Nadu State Branch, and its past State secretary said: “We have the Act but it is not being implemented. This is the biggest problem we are facing right now. Cases are booked after a lot of pressure from our side, but after that no further action is taken,” he said.\n\nLast May, the association had called for a 24-hour strike demanding, among other things, more protection for hospitals and medical professionals.\n\nA statement from the Doctors Association for Social Equality said its secretary G. R. Ravindranath had supported the protesting students.", 
    "section": "national", 
    "title": "‘Need more protection’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}