{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "More farmers have come forward to avail themselves of the scheme\n\nThe Madurai district administration’s focused drive in promoting farm ponds coupled with the more than average rainfall received this season has helped in improving the water table at several pockets.\n\nThadayampatti panchayat in Sedapatti block, which was given special focus by the administration, is a case in point.\n\nMore farmers from the village had come forward to avail themselves of the scheme after witnessing the improvement in groundwater level in places where farm ponds have already been dug.\n\n“In fact, our area received inadequate rainfall compared to nearby places. Nevertheless, the water collected in farm ponds has improved the ground water level apart from acting as a drinking water source for cattle,” said P. Alagarsamy, panchayat president.\n\n“Whatever amount of water we used to get by running the bore-well pump for four hours, we are getting the same now in less than two hours,” said V. Balakrishnan from the village.\n\nOf the 61 ponds already dug this year (2015-16) in Sedapatti block, 52 had been dug in Thadayampatti panchayat alone.\n\n“The idea was to dig considerable number of farm ponds in one panchayat so that their usefulness could be demonstrated clearly,” said B. Rohini Ramdas, Additional Collector and Project Officer of District Rural Development Agency. According to her, the two main objectives of digging farm ponds were to provide a backup source for farmers in emergency situations and also to improve the water table in the area.\n\nDespite being fully funded by the government through MGNREGS, the difficulty, however, was in persuading farmers to set aside a cultivable portion of land for the pond. “Particularly, the small land-holding farmers prefer to utilise their entire land for cultivation. But the success in places like Thadayampatti is helping us to convince them,” she said.\n\nMs. Rohini added that with the target of 1290 ponds to be dug in 2015-16, approval had already been provided for 800 ponds of which 300 had been dug.\n\n“Since the farmers are busy with cultivation, the initiative will gain momentum again from next month,” she said.", 
    "section": "national", 
    "title": "Panchayat reaps benefits of farm ponds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}