{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Experts are of the view that technology is also underutilised\n\nFor the past few weeks, incidents of chain and bag snatching have been reported frequently across the city. While residents and experts stress the need for increased patrolling, the question many ask if there are enough policemen to do the job.\n\nThe city with a population of nearly 70 lakh, has a police strength of only 20,000, including 6,000 armed reserve policemen, and 136 stations. This means that there is only one policeman for approximately 350 persons in Chennai.\n\nSecurity experts feel that it is not sufficient considering the rapid pace at which the city is developing. Though the sanctioned strength is 22,000, there is a shortage of nearly 2,000 personnel as on date.\n\n“There is a need for at least a 10 per cent enhancement in the strength of the force,” says R. K. Raghavan, former Director, Central Bureau of Investigation.\n\nMany in the police force contend that the ideal ratio of police to residents would be at least 1:300.\n\n“We need at least 26,000 policemen. Now over 8,000 Youth Brigade personnel have written the exams and are undergoing training to become constables. However the problem is many will be used for clerical work and drivers job and as orderlies,” adds a source from the police department.\n\nPolice personnel are also complaining of stress due to over working.\n\n“In each police station, there are three shifts (7 a.m to 1 p.m, 1 p.m to 9 p.m and 9 p.m to 7 a.m). Earlier, each cop had to do only one shift. Now he/she has to do two shifts. Besides, there is a shortage for night rounds too,” a police constable says.\n\nMeanwhile, some experts feel that more than the number it is the quality that counts.\n\nMr. Raghavan adds that apart from increasing manpower it is important for the city police to develop its technological monitoring.\n\n“In countries like Israel, U.K and the US, the police use more of technology. In Chennai too, more surveillance cameras can be used as is being done in cities like Mumbai and Hyderabad,” he adds.", 
    "section": "national", 
    "title": "Police in Chennai too are overworked, understaffed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}