{
    "author": [
        "L Renganathan"
    ], 
    "text": "Include the proposal in railway budget and allocate funds: activists\n\nActivists and public of Nagapattinam district are seeking the revival of the Mayiladuthurai-Tranquebar rail link that would provide fascinating connectivity to hallowed spots and tourist destinations boosting the economy of the region besides increasing transport facilities. Inclusion of the proposal in the coming Railway Budget and allocation of funds to kick start the project will provide steam to the long-pending demand of the region, they say.\n\nCompletion of the section would provide a circular rail route covering the Cauvery delta linking Thanjavur, Kumbakonam, Mayiladuthurai, Tranquebar, Karaikal, Nagapattinam, and Tiruvarur that could be remunerative for the Railways as useful for pilgrims and traders.\n\n“The 30-km section that served for 60 years from 1926 to 1986 needs to be revived. Daily around 10,000 students and public are travelling between two crowded destinations with much difficulty. Revival of the project and extending it up to Karaikal and Nagapattinam will link up all important economic and pilgrimage spots on this region of the East Coast,” says organiser of the Mayiladuthurai-Tarangambadi Train Restoration Committee Arupathy P. Kalyanam. Four important rail branches in the Cauvery delta region were removed between 1975 and 1987 despite public protest. They are Nidamangalam-Mannargudi, Peralam-Karaikal, Tiruthuraipoondi-Agasthiyampalli and Mayiladuthurai-Tarangambadi. Projects to revive them save the last section were drafted and are in various stages of implementation. In fact, in the 2005-06 Rail Budget, a survey for reviving the project was announced.\n\nThe survey completed in the next fiscal estimated the cost of the project as Rs. 114.57 crore. With no sign of implementation, another survey was done in 2010-11 that revised the project cost as Rs. 175 crore. Activists refer to the 2006-07 and 2010-11 surveys of the Railway Ministry for a project linking Tarangambadi with Karaikal for a distance of 17.3 km that could provide a circular route to cover the entire Cauvery delta destinations.", 
    "section": "national", 
    "title": "‘Revive Tranquebar- Mayiladuthurai line’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}