{
    "author": [
        "Deepa H"
    ], 
    "text": "Keeping in mind the large number of devotees visiting important temples including the Navagraha shrines in Thanjavur district, the Highways department has begun works to improve roads leading to a select few.\n\nThe 14 km-long Girivalam path around the Arunachala hill in Tiruvannamalai district that is treaded by lakhs of devotees every month, including on full moon days and on Karthigai Deepam festival, is getting a facelift. A detailed project report found that a total of Rs. 65 crore is required for the work and in the first phase Rs. 25 crore has been allocated by the State government under the Comprehensive Road Infrastructure Development Project (CRIDP).\n\nTenders are under progress for this project, which includes construction of wider footpaths, improvement of lighting and construction of rest rooms. On full moon days, including Chitra Pournami around 8 lakh devotees walk around the hill and on Karthigai Deepam festival nearly 25 lakh.\n\nSathyapriya Swarnam, Tiruvannamalai resident, who frequents the Annamalaiyar temple and walks the girivalam, said instead of a tar road, a walkers’ pathway would be helpful. “In some places, the fine gravel that forms the top layer of the roads, which has come off pokes the soles causing pain. Walking the distance is not an issue. The administration could consider laying some kind of tiles or even just earth on the path,” she said.\n\nRoads leading to Kumbakonam\n\nWith the famous Mahamaham festival just a couple of months away, the roads leading to Kumbakonam and also connecting the Navagraha temples are being improved at a total cost of Rs. 30 crore. “The existing roads surrounding the Kumbakonam town which are in bad condition are considered for improvements for effecting easy traffic flow and to avoid traffic congestion. These works are nearing completion,” said a source in the Highways Department.\n\nS. Ganesan, Modern Radios, Karaikal, who visits the Navagraha temples regularly, said that he had seen works being carried out on roads including those leading to Kumbakonam.\n\n“Along with the highways, the government could look at the interior roads. They are in dire need of repair. Many times motorists use these roads as short cuts to important temples,” he said.\n\nRs. 25 crore has been allocated by the State\n\nfor works in the first phase", 
    "section": "national", 
    "title": "Roads to important temples being spruced up", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}