{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Around 1,400 students from classes IX to XII from 150 schools are taking part in the exhibition\n\nAn auditorium packed with school students and their scientific innovations brought in flavour for InoVIT 2016, a south India level science exhibition for school children.\n\nThe two-day exhibition, organised by VIT University, comprises four contests – working model, quiz, poster presentation and idea presentation. Around 1,400 students from classes IX to XII from 150 schools in Tamil Nadu, Karnataka, Andhra Pradesh, Telangana, Kerala and Puducherry are taking part in the fifth edition of InoVIT. Winners of the contests will receive Rs. 3 lakh worth prizes.\n\nV. Jyothsana, I. Fouziya and D. Viveka Varthini of class IX of Shiksha Kendra, Pallikonda have come up with a rescue robot with scissors lift.\n\n“This can be used during earthquakes, floods, in mines and other natural disasters. It has military purposes too,” Jyothsana said. The robot, the students said, can climb stairs and go on rough terrain too. They have connected a wireless camera to the robot to capture images and display on television.\n\nAnother team of students – M. Raghuram Reddy, V. Rohith Reddy and M.S. Sakeeth Goud of class IX, Little Flower School Hyderabad, came up with a working model to generate power through kinetic energy.\n\nTheir model involves placing rollers on the surface of a busy road and generating power when the rollers move in anti-clock wise direction on movement of vehicles. The electricity generated can be stored in power houses.\n\nA key attraction at the exhibition was a Go Kart by B. Keerthivasan, G.V. Sandeep and K.P. Sajith of class X of Devi Academy, Chennai.\n\nThe students have introduced safety features. There is a ‘kill switch’ to enable the driver to turn off the engine in case of an emergency when he is unable to stop the car.\n\nThey have installed car steering in the race car, apart from the engine of a car and disc of a motorbike.\n\nA wireless camera, solar panel, self-start mechanism and fire extinguisher have been put in place.\n\nThey said they started working on the racing car six months ago as they were interested in racing.\n\nG. Viswanathan, VIT University’s chancellor highlighted the importance of innovation.\n\n“This country was once dominating the world. We produced one-third of the world’s products and accounted for 33 per cent of the world’s GDP. Now, the GDP share has reduced to three per cent. Students should resolve this problem and enable India to attain prominence in the world,” he said.\n\nR. Dhamodharan, professor of Chemistry, IIT-Madras, said discovery is driven by curiosity to explore.\n\nAmong others G. V. Selvam, university’s vice president, Anand A. Samuel, V-C, R. Vijayaraghavan, dean, School of Advanced Sciences and A. Ruban Kumar, organising secretary of InoVIT 2016 were present.\n\nThe expo comprises four contests – working model, quiz, poster and idea presentation", 
    "section": "national", 
    "title": "Scientific innovations by young minds on display at InoVIT 2016", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}