{
    "author": [
        "Annie Philip"
    ], 
    "text": "(From left) K.V. Raman, Director, Department of Health, P.T. Rudra Goud , Director of Local Administration, N.G. Pannir Selvam, LAD Minister, A. Anbalagan, MLA and K. Gunasekaran, Scientist of VCRC, at a workshop on dengue prevention in Puducherry on Saturday. (Left) Participants at the workshop. — Photos: S.S. Kumar\n\nThe total number of cases in 2014 was 1408, while in 2015 it was 80, says health official\n\nIntensive awareness campaigning on prevention of dengue has paid off with number of cases dropping by half in the peak season period in 2015 compared to the previous year, said the Puducherry government.\n\nFrom 942 dengue cases during the peak season period of October to December in 2014, there has been a fall to 475 cases in the same period in 2015, said Dr. K.V. Raman, Director, Health and Family Welfare Services, during the inauguration of an advocacy workshop for self-help groups and sanitation workers on Saturday. The total number of cases in 2014 was 1408, while in 2015 it was 807, said Dr. Raman. There were no dengue-caused deaths either in 2015, he added. He added that filariasis had been phased out from Puducherry.\n\nThe workshop was organised by the departments of health, local administration and the National Vector Borne Disease Control Programme. The inauguration was also attended by Local Administration Minister N.G. Pannir Selvam, LAD Director P.T. Rudra Goud, AIADMK MLA A. Anbalagan.\n\nGovt. inefficient, says Anbalagan\n\nMr. Anbalagan, however, used the opportunity to tear into the government’s claims and said public infrastructure leaves a lot to be desired in terms of ensuring people’s health. He criticised the administration for improper maintenance of the drainage system, not clearing garbage on time, lack of public waste bins and spraying of ineffective mosquito repellent, among other things, and said this had led to spread of diseases. Mr. Anbalagan also refuted the claim that filariasis had been wiped out in Puducherry. The MLA said that SHGs were offered no uniforms or incentives for carrying out their tasks.\n\nAssuring SHGs of incentives and uniforms, Mr. Pannir Selvam said the government was committed to public health.\n\nHe asked participants to ensure there was no water collected at their homes and surrounding areas where dengue mosquitoes could breed.\n\nHe also assured the effectiveness of the fogging operations being carried out by the departments of health and local administration.", 
    "section": "national", 
    "title": "Significant drop in dengue cases: Govt.", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}