{
    "author": [
        "Udhav Naig"
    ], 
    "text": "At the Interactive Corner, organised by the film club Cinema Rendezvous on the sidelines of the Chennai International Film Festival, at Woodlands theatre on Saturday, filmmaker Vetrimaran discussed much more than films with students and film buffs.\n\nIn conversation with Shylaja Chetlur and filmmaker Ashwin Saravanan (Of Maya fame), Vetrimaran spoke about how he and the Kaaka Muttai team took the film to the world, his plans of releasing the uncensored version of Visaranai, possibly on Netflix, the positive effects of social media and how there is no conflict between ‘following the dreams’ and ‘commerce’.\n\nAsked to elaborate on how it was possible for Kaaka Muttai to break international markets such as Hong Kong, Vetrimaran gave credits to its producer Dhanush who didn’t press for the film’s release despite waiting for one year.\n\n“The film was ready in 2014 and we waited for a year to get a good release. Though the film was sold for far less than what it earned, we still got a lot of mileage out of it. I just heard that the film did better than PK and Lunch Box in Hong Kong,” he said.\n\nHe said social media had emerged as a good tool to let people talk. “With a simple hashtag, it is possible to let the world know about Visaranai . We did that when we screened in Venice. If films such as Visaranai and Kaaka Muttai are spoken about in social media, it helps to a great extent. Social media is driving public opinion,” he said.\n\nHe further said that he would make sure that the uncensored version of Visaranai would be available for Tamil fans.\n\n“There is no great difference between the two versions. The censored version will have too many beeps. But Dhanush and I are coming up with a strategy. We didn’t know Netflix would arrive in India so soon,” he said.\n\nAsked what would be his definition of a ‘good film’, filmmaker Ashwin said that films that were made with passion and love for cinema and not just for commercial exploitation were good. Vetrimaran weighed in as well. “I don’t think there is any conflict with making a film as a dream and monetising the film. You are conceiving a film to monetise it,” he said.", 
    "section": "national", 
    "title": "‘Social media is clearly driving public opinion’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}