{
    "author": [
        "Rohit R", 
        "T K"
    ], 
    "text": "As per agreement with State government, they have to complete projects by March 31\n\nWith the deadline for the expiry of the control period fast approaching, solar power companies that have signed power purchase agreements with the Tamil Nadu government are racing against time to finish their projects.\n\nThe rains in November and December across the State either slowed down or completely halted operations at the construction sites, the companies claim. But the Tamil Nadu Electricity Regulatory Commission (TNERC) has put its foot down and declined any extension of the control period which expires on March 31.\n\nUnder the current agreement, companies setting up solar power projects before March 31, 2016 get a price of Rs. 7.01 per kWhr for a period of 25 years.\n\nRepresentatives of at least two companies – Adani and SunEdison – who are setting up solar plants of a total capacity of nearly 800 MW in the State say the floods have delayed work on their projects.\n\nAdani’s 648-MW plant is coming up at Kamudhi in Ramanathapuram, while SunEdison is setting up 3 plants of 50 MW at Virudhunagar.\n\n“We have lost about a month of work due to the rains. After the rains stopped, the soil condition was bad and it became soft, which led to the machinery being unable to move,” Pashupathy Gopalan, President, Asia-Pacific, SunEdison, told The Hindu . The company is working hard to finish the work before the deadline, he said.\n\nThe rains caused flooding in the area and led to stoppage of work. “We have already started work on the plant again and are confident we will complete the project ahead of time,” a source at Adani Group told The Hindu . The source added that they would now work extra hours to make up for the lost time,” the source said.\n\nIndustry sources said they expected the government to provide some relief by way of extension of the control period – the timeframe within which a project has to be commissioned to avail a specific price.\n\nBut a senior official at TNERC denied there was any proposal to extend the deadline. Any extension of the deadline will only hurt the Tamil Nadu Generation and Distribution Corporation (Tangedco) financially, especially when the price of solar power is coming down, the official said.\n\nUnder the Solar Policy of 2012, the government had envisaged an addition of 3,000 MW of solar power by the end of 2015. As per data available on the Tangedco website, the State has an evacuation capacity of 1.1 GW of solar power. A senior official of the Tamil Nadu Transmission Corporation (Tantransco) said work on the transmission facilities were progressing well and these areas were hardly affected by the North-East monsoon.", 
    "section": "national", 
    "title": "Solar power firms racing against time", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}