{
    "author": [
        "Staff Reporter"
    ], 
    "text": "After a six-day search, the Coimbatore District Police arrested three persons who stole a double-barrel bridge load gun, 25 twelve bore rounds and 10 ball edges (35 bullets) from the house of a Border Security Force jawan at Ramanathapuram in Chinna Thadagam, near Thudiyalur, last Sunday.\n\nThis incident gave sleepless nights for the police as activities of the Maoists are on the rise in Kerala, which is only a few kilometres away from the place the gun was stolen. The police also feared that the weapon could have been sold to the extremists.\n\nIdentified\n\nThe accused were identified as S. Vicky alias Crime Vicky (20) of Udayampalayam who was involved in many cases in the city for housebreaking, and his two friends V. Vicky alias Thoppai Vicky (21), of Sanganoor, and R. Ramkumar (20), a college student of Rathinapuri.\n\nBSF head constable Thiruvasagam, who owns the weapon, serves in Gujarat. On January 3, his wife and two daughters who stay in the house here went out when the trio entered the house in the morning.\n\nThe same day Superintendent of Police of Coimbatore District R.V. Ramya Bharathi conducted preliminary inquiries at the spot and formed four special teams to nab the accused.\n\nThe teams that checked ex-convicts’ records zeroed in on the trio when they committed another house break-in at Kinathukadavu on Thursday, and robbed a van driver at knifepoint near an eatery at NGGO Colony on Friday.\n\nAfter these incidents, intensive vehicle checks were conducted from Friday, in which they were caught near the Vellakinar check-post on Saturday morning.\n\nAccording to the police, the accused confessed that one of them broke into the house, while others waited on a motorbike. The person, who went in saw the bullets kept near the jewel box in the cupboard.\n\n“On seeing the image of a gun in the package in which the bullets were kept, he was tempted to handle a gun and was on the look out for it,” Thudiyalur Inspector S. Saravanan said.\n\nOn finding the double-barrel gun wrapped in a piece of cloth, he left the place with nine-sovereign jewellery, the gun and bullets. “The trio hid the gun amidst bushes near the railway track at Nallampalayam,” the Inspector said. The jewellery and weapons were retrieved and the accused were lodged in the Borstal Home at Pollachi.", 
    "section": "national", 
    "title": "Three youth held for stealing gun, bullets from house", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}