{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam: Sri Hanuman Jayanthi, discourse by S. Gopalan, South Chithrai Street, Srirangam, 5 p.m.; nadaswaram concert by Sheikh Mehboob Subhani and Kalisha Bi, 7 p.m.\n\nPanniruthirumurai Varavazhipattu Mandram of Arulmigu Erumbeeswarar Temple, Tiruverumbur: Thiruvasagam muttrothal and annual day, abishekam, 7 a.m.; musical discourses, 10 a.m.; Maheswara pooja, 1 p.m.; panniru thirumurai parayanam, 2.30 p.m.\n\nSri Agathiar Sanmaarga Sangam: Maha thiruvilakku pooja for world peace and Avathara dinam of Thavathiru Arumuga Arangamaha Desikan, Kalaignar Arivalayam, 8 a.m.\n\nOrganising Committee: Sri Radha Madhava vivaha vaibhavam, Ramji Mahal, Woraiyur, 8.30 a.m.; Anjaneya utsavam, 12.30 p.m.\n\nSri Srinivasa Perumal Temple Trust, Indira Nagar: Margazhi utsavam, Sahasranama parayanam, 5.30 p.m.; discourse on Sri Andal Avatharam and Tirupaavai by Sri Vasu Aradhakar, 6.30 p.m.\n\nSri Andavan Ashram, Srirangam: “Tirupaavai” by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha: “Tirupaavai” by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Tirumala Tirupathi Devasthanam: “Tirupaavai” by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai: Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Kothandaramar Sannidhi, New Seshadripuram, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, Srinivasa Perumal Temple, Indiranagar, 6 p.m.\n\nVidyasthanam Gurupeetam, Thiruvanaikovil: “Sri Maha Periyaval Mahimai” by V.M. Ananthanarayanan, Sankara Mutt, Thiruvanaikovil, 6.30 p.m.\n\nCULTURE\n\nSalangai Academy of Indian Classical Arts: Anniversary celebrations and arangetram of students, Padma Subramanyam, chief guest, Thevar Hall, W.B. Road, 6.05 p.m.\n\nSri Kailash Kamala Ganapathy Temple, Kailash Nagar: Pongal festival, drawing competition, V.M. Kalyana Mandapam, Kailash Nagar, 9.30 a.m.; group discussion, 10.15 a.m.; and cultural events, 6.45 p.m.\n\nAmbuja Arts Academy: Tirupaavai conference, P. Narayanan inaugurates, Sri Veli Andal Sannidhi, Mela Adayavalanjan Street, Srirangam, 4 p.m.\n\nKarivarthan Kainkarya Sabha and Srirangam Educational Society: Painting exhibition on Sri Ramanuja, V.S. Mahal, Keezha Adayavalanjan Street, Srirangam, 10 a.m.\n\nGENERAL\n\nTamil Nadu Police Traffic Warden: Opening of new office, Sanjay Mathur, City Police Commissioner, chief guest, near Kalaiarangam Theatre, 5.30 p.m.\n\nSiragukal Special Children’s Parents Association and Tamil Nadu Agricultural University: Pongal festival for mentally retarded children by parents, TNAU Agricultural College and Research Institute, Navalurkuttapattu, 10.30 a.m.\n\nMarcellin Trust: New year and Pongal celebrations, Mahaimanthan, chief guest, Uyyakondan Thirumalai, 11 a.m.\n\nTiruchi District Retired Government Officials’ Association: Meeting, Bishop Heber Higher Secondary School, Teppakulam, 3.30 p.m.\n\nConfederation of Real Estate Developers Association of India: Fair pro 2016 – property show, Hotel Sangam, 10 a.m.\n\nHindu Mission Hospitals, Tambaram and Tiruchi and Rotary Club of Tiruchi Midtown: Free coronary disease screening camp, Hospital premises, Anna Nagar, Thennur, 9 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St. John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nNehru Yuva Kendra and White Rose Welfare Association: Zonal level sports meets, E.R. Higher Secondary School grounds, 9 a.m.", 
    "section": "national", 
    "title": "Tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}