{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Accident causes disruption to power supply in parts of Mahadevapura\n\nParts of Mahadevapura, including the police station on Whitefield Main Road, plunged into darkness after a truck driver lost control and rammed a roadside tree before bringing down six electric poles on Thursday midnight.\n\nThe speeding truck was heading towards the city.\n\nThe driver lost control while trying to overtake another truck and rammed into a tree. Electric wires got entangled in the branches of the tree. Without realising this, the driver began to reverse the truck. As a result, six electric poles were uprooted and there was an explosion in a transformer.\n\nRealising something amiss, the driver brought the truck to a halt.\n\nHowever, by then, the damage had been done. Power supply to the surrounding area was disrupted till Friday evening.\n\nPolice detained the driver before cordoning off the area and alerting Bescom whose officials rushed to the spot and disconnected power supply to avoid further damage.\n\nThe police have booked the driver for negligence and seized the truck. Bescom has filed a complaint with the Mahadevapura police against the driver for causing damage to its property.\n\nWhat Bescom says\n\nBescom officials said six poles fell due to the impact of the accident. An official said, “The incident occurred around 12.05 a.m. By 2.30 a.m., we restored supply in the residential areas. But in Puttappa industry compound, we could restore power only by 3.30 p.m. on Friday. As for Satya Choultry, we have not been able to do much due to heavy traffic movement on that road. However, the choultry is closed for renovation and we have convinced them that power will be restored soon.”\n\nThe police have booked the\n\ndriver for negligence and seized the truck", 
    "section": "national", 
    "title": "Truck driver rams tree, brings down six electric poles", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}