{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Aadhaar Enabled Payment System launched at Ariyankuppam, to be extended across UT soon\n\nBusiness correspondent of Indian Bank demonstrates the launch of the Aadhaar Enabled Payment System at Ariyankuppam village in Puducherry on Saturday. (From right) Hota, CEO of NPCI, Balachandran, Chairman of NPCI, Puducherry Assembly Speaker V. Sabapathy and Rishi Raj Singh, Head of Operations and Principal Officer of CSC e-Governance Services are in the picture.— Photo: S.S. Kumar\n\nResidents of Ariyankuppam Village Panchayat need not travel looking for ATMs anymore to withdraw money. They can do so just by going to a nearby Customer Service Centre (CSC) and by giving their Aadhaar number and bank account details. Within a week, people across Puducherry can also avail of this facility.\n\nThe National Payments Corporation of India (NPCI), an umbrella organisation for all retail payment systems in collaboration with CSC e-Governance Services India Limited on Saturday launched Aadhaar Enabled Payment System (AePS). The service was inaugurated by V. Sabapathy, Speaker of Puducherry Legislative Assembly at the Ariyankuppam Village Panchayat.\n\nWithin a week, this facility will be extended in all the 60 CSC offices in the village panchayats across Puducherry.\n\n“Any bank account holder can go to the CSC offices provide their Aadhaar number and withdraw money. The fingerprint will authenticate the account holder. Hence, there is absolutely no chance of committing fraud,” said Balachandran. M, chairman, National Payments Corporation of India (NPCI).\n\nHe added that after authentication, cash will be given to the customer. “They will also receive the receipt with the account balance. People can withdraw up to Rs. 10,000 at these service outlets,” he said.\n\nNearly 40 banks in Puducherry are mapped with the unique identification number (UID), thus allowing any bank account holder to avail this facility. “There are 1,40,000 such branches across India and 80 per cent of the population in India has Aadhaar number. This benefit will reach many people across India,” he added.\n\nMr. Balachandran pointed out that the CSC service outlets which hither to provided citizen services of various types would now be able to offer financial services. This will be done on digital platform by partnering with banks. The thrust would be on under-banked and unbanked locations in the country. Rishi Raj Singh, Head of Operations and Principal Officer, CSC e-Governance Services India Limited, said that within a month, the facility to deposit money will also be made available at the CSC service outlets.\n\n“After a week, this service will be implemented across the country,” he said.\n\nMr. Singh told that they plan to increase the number of CSCs to 2,50,000 in an year to ensure that each village panchayat is covered and customers of banks get the service in their vicinity.\n\nCSC service outlets also facilitate disbursement of government entitlements like NREGA, Social Security pension, Handicapped Old Age Pension etc. of any Central or State Government bodies, using Aadhaar and authentication thereof as supported by UIDAI. They are also allowed to sell insurance of any company and collect renewals of all companies deposit premiums.", 
    "section": "national", 
    "title": "Use Aadhaar number to bank at CSCs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}