{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Accident victims were taken to TVMCH and KGMCH due to paucity of doctors, nurses, staff\n\nThe five-year-old 28-bedded hospital at Valliyoor, established with the Central funding of Rs. 64 lakh, is not able to serve the public effectively, especially during emergencies like major accidents, as adequate number of doctors, nurses and other paramedical staff are yet to be allotted.\n\nAfter the surroundings of Valliyoor, the largest town on the Tirunelveli – Nagercoil four-lane National Highway, witnessed frequent mishaps and victims with grievous bleeding injuries had to be rushed either to Tirunelveli Medical College Hospital (TVMCH) or to hospitals at Nagercoil, it was decided to upgrade the Primary Health Centre housed in a dingy building into a full-fledged 28-bedded hospital to extend timely medical assistance to emergency and trauma care patients.\n\nSubsequently, the PHC graduated into a 24-hour hospital with operation theatre and allied facilities on 3.80 acres of land. However, it still remains only a lifeless concrete structure as only three doctors (including the orthopaedic surgeon who has already put down his papers) are working here now along with four nurses and as many paramedical staff for the 450 to 500 outpatients a day, which should actually have a minimum of seven physicians and surgeons to serve the patients, especially accident victims.\n\n“As of now, the doctors working there are doing excellent service. If an orthopaedic surgeon, an obstetrician and gynaecologist, a general surgeon and a general physician are appointed here, it will be of great help to the public, particularly to the accident victims. Moreover, the operation theatre can be used to the optimum level,” said a doctor from Valliyoor. “Since this place is not a taluk headquarters, the official machinery does not consider it for creating better medical facilities,” he added.\n\nHence, the accident victims, even after the 28-bedded hospital came into existence at Valliyoor, were being brought either to the TVMCH or taken to Kanyakumari Government Medical College at Aasaaripallam or to private hospitals in and around Nagercoil that consumes more than 45 minutes. Even the victims of yesterday’s accident that consumed nine lives and left 33 others injured had to be taken to Nagercoil as there is no trained manpower at Valliyoor hospital situated at about just 5 minutes drive away from the accident spot.\n\n“Since Valliyoor, situated on the national highway witnesses frequent mishaps, this hospital should have adequate trained manpower. Hence, in addition to the existing doctors, a minimum of five more doctors should be appointed in this hospital considering the well-being of the public, particularly the accident victims,” said Sathyan of Communist Party of India.", 
    "section": "national", 
    "title": "Valliyoor hospital waiting for full-fledged trauma care unit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}