{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Candidates enrolling themselves at the Off Campus Recruitment Drive organised by Bharathidasan University in Tiruchi on Saturady.PHOTO: A. MURALITHARAN\n\nVice-Chancellor of Bharathidasan University V.M. Muthukumar on Saturday inaugurated the Career and Counselling Cell and job fair on its city campus in Khajamalai.\n\nHe asked the students to develop self-confidence and self-determination citing the life of the renowned scientist Stephen Hawking. He said that the university was providing various facilities to students from all walks of life to equip skills on its city campus like library, Placement and Training Cell and Career and Counselling Cell.\n\nLater, he released the user names and passwords to 60 students selected to take up continuous online aptitude test arranged by the Placement and Training Cell. He gave away certificates to the I Year MCA students of the Department of Computer Science, Bharathidasan University, who completed the Soft Skills – Effective English Communication Course during the last semester.\n\nP. Manoharan, AGM, BHEL (Logistics); R. Mangaleswaran, Syndicate Member, Bhrarathidasan University, Gopinath Ganapathy, Director, Bharathidasan University Technology Park, and N. Prasanna, Co-ordinator, Career Counselling Cell, spoke.\n\nA large number of job aspirants took part in the job fair for various positions such as Finance Executive, Manufacturing Agents, Fashion Designer, Customer Support Executive, Supervisor, Sales Person, and Telecaller in various companies such as Equitas Micro Finance Pvt. Ltd., L&T, TVS, LIC, Kotak Bank, IDBI Federal Life Insurance, CBC Fashion, ABT Maruthi, Eureka Forbes, ICICI Academy for Skills, Waves, Purani Textiles, Neptune Impex, Alert Insurance, Triumph, G4S Secure Solutions, 108 Ambulance, Primus Consultancy Service, Shiva Automobiles, Divya Spinning Mills, and Sudharsan HRD Services.\n\nOf the 420 candidates participating in the job fair, 276 were selected for various posts. Some candidates were shortlisted for the next level selection process.", 
    "section": "national", 
    "title": "Varsity opens career counselling cell", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}