{
    "author": [
        "S Ganesan"
    ], 
    "text": "DMDK members want him to be the king, not kingmaker this time\n\nPlaying his cards close to his chest on the alliance issue, DMDK leader Vijayakant on Saturday said that he would announce his decision on the party’s stand at an appropriate time.\n\nThe party kept its suitors guessing as its executive committee and general council meeting here authorised Mr.Vijayakant to decide on the its stand for the Assembly election.\n\nParty sources indicated that there was not much discussion on the question of alliance at the meeting.\n\nIt was Mr.Vijayakant’s brother-in-law L.K.Sudheesh who sought to get some feedback from the general council members by asking them whether “they wanted the Captain to be the king or the kingmaker?” The members responded enthusiastically that they wanted him to be the king, said a general council member.\n\nCiting the overwhelming response, Mr. Vijayakant’s wife Premalatha said the party would come up with appropriate strategy to fulfil their desire.\n\nWhile a section of the party was said to be in favour of an alliance with the DMK, none came out openly with the suggestion. Mr.Vijayakant and Ms. Premalatha targeted the AIADMK mostly, but they also made brief references to the DMK and indicated that there was no change in their stand on keeping both the major Dravidian parties equidistant, the sources said.\n\nThere was no mention of the BJP either, except for a resolution which thanked the Centre, Prime Minister Narendra Modi and Union Ministers Prakash Javadekar and Pon.Radhakrishnan for taking steps to allow the conduct of jallikattu in the State.\n\nIn scathing attack on the ruling party, Mr.Vijayakant accused it of singling out the DMDK for “vengeful actions” such as preventing the party MLAs from discharging their duty in the Assembly and foisting cases on party office-bearers.\n\nA resolution adopted at the meeting said the DMDK was ashamed of having worked to bring the AIADMK to power and vowed to remove the “anti-people” regime headed by Chief Minister Jayalalithaa.\n\nPlea to EC\n\nThe general council went on to urge the Centre and the Election Commission to conduct the Assembly election without giving any room for irregularities under the Governor’s rule after dismissing the State government. A large number of the 23 resolutions adopted at the meeting were critical of the performance of the State government, including its flood management, the relief operations, price rise, industrial and infrastructure development. Through other resolutions, the meeting demanded the implementation of total prohibition and constitution of a Lokayukta in the State and a permanent solution to end the frequent arrests of Tamil fishermen by Sri Lankan Navy.\n\nParty will come up with strategy\n\nto fulfil cadre’s desire, says Premalatha", 
    "section": "national", 
    "title": "Vijayakant to decide at ‘appropriate time’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}