{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Ambur mill has not paid Rs. 300 per tonne till date for last season\n\nThough a cutting order has been issued for this season, farmers are in no situation to take it up. A farmer displays the order in his field near Ambur.— Photo: C. Venkatachalapathy\n\nThe delay in settling dues for sugarcane crushed last season has left hundreds of farmers in dismay. Financially hit, the sugarcane farmers say they are in no position to take up cutting this season.\n\nLike the Vellore Cooperative Sugar Mill at Ammundi, the Ambur mill too has not settled the dues for sugarcane supplied last crushing season. With the price per tonne last year being Rs. 2,550, farmers registered with the Ambur Cooperative Sugar Mill said the mill is yet to pay Rs. 300 per tonne till date.\n\nThe Ambur mill has issued cutting order for the forthcoming crushing season. But farmers said they do not have the money to pay for labourers for cutting the cane, and cannot borrow as they were already facing mounting debts.\n\nRamamoorthy, a farmer in Kammavanpettai said, “I supplied 150 to 160 tonnes of sugarcane to the Ambur mill last season. I am yet to receive the pending amount of Rs. 300 per tonne. This year, I have raised sugarcane on more than 1.5 acres of land but how can I bear the cutting cost for labourers without the dues being settled?”\n\nFarmers said that they will have to pay Rs. 450 to Rs. 500 per tonne for labourers as cutting cost. Apart from this, they will have to give one kilo rice and Rs. 25-30 for cooking for each labourer. While the government bears the transportation cost, the farmers said they end up paying the lorry driver at least Rs. 600 to Rs. 700. “Our family has been supplying sugarcane for the mill for close to 30 years but this is the first time that the dues have not been settled for nearly a year. In the previous season, the pending amount was settled in six months,” he added.\n\nD. Kumaran, another sugarcane farmer, had supplied 110 tonnes of sugarcane last season. “The mill officers told us that the bills will be settled before Pongal but nothing has happened till now,” he said.\n\nIt is a different problem for another farmer, K. Anbazhagan of Saduperipalayam in Tiruvannamalai district, who had supplied 60 tonnes of cane last season. “The mill had diverted the cane to another mill and I am yet to receive the full payment,” he said.\n\n“There are farmers who had borrowed up to Rs. 1 lakh to meet the cutting cost, and had also taken the government’s interest-free loan for planting. As the dues have not been settled, the farmers could not repay the loans on time. The interest rate has shot up to 14 per cent now,” he said.\n\nAn official of the Ambur Cooperative Sugar Mill said at a Minister level meeting, it was said that the dues will be settled before Pongal.", 
    "section": "national", 
    "title": "With mills yet to pay farmers hopes of cane cutting fade", 
    "subsection": "tamilnadu", 
    "date": "2016-01-10"
}