{
    "author": [
        "Peter Griffin"
    ], 
    "text": "Umar Khalid is the JNU student accused of organising the Afzal Guru event. Maryam Fatima, the eldest of his four sisters, is a Ph.D. candidate in a U.S. university. She is in daily communication with her family in Delhi over the current situation. She agreed to answer a few questions over email.\n\nYour family has received threats. Could you tell us the nature of these threats and how they were delivered? Has there been any other intimidation?\n\nLast week after the Times Now and Zee News debates, my family was understandably agitated. My sisters wrote responses to the comments on the videos on YouTube clarifying my brother’s political position: what he wasn't allowed to say on TV himself, because he kept getting yelled at. They received threats soon after (rape and acid attack) as responses to their comments and as Facebook messages — including my 12-year-old sister who doesn’t even fully comprehend what’s happening. We’ve also come to know of posters in Munirka where a large part of the student population lives, posters calling for Umar’s death. This has us worried about vigilante attempts to lynch him.\n\nAre you aware of Umar’s political views? He is reported to profess atheism. Is this something that has been discussed in the family?\n\nYes, the family has been aware of his communism and atheism from the very beginning. I see that that’s being used to portray a divided, broken family. But that couldn’t be farther from the truth. Yes, we had a difference of opinion. Our parents have been worried, as any believing Muslims would be. But Umar is still an integral part of the family and has always been.\n\nMy father’s interview on News24 is a testament to how much we respect him despite a difference in opinion. We were all together at a family function this January. Any attempts to say he had broken away from his family are ridiculous. It causes my parents anguish that he’s an atheist but it’s been enriching to have been part of a family like ours where we are respected as individuals capable of independent thought.\n\nUmar is reported to have been organising a series of events around India that valourise Afzal Guru, a convicted criminal for crimes against the state. He is reported to have publicly expressed a desire for the breaking up of the Indian state. Were you and are you aware of these events and statements? What is your reaction to this?\n\nThe event on Feb 9 [was] like any other student-organised event on campus; the poster said that students were going to gather for a cultural evening of protest songs. This is not new either in JNU or elsewhere. As for the anti-India slogans raised at the event (especially crude and distressing ones like ‘Bharat ki barbadi’ and ‘tukde’), it is becoming increasingly evident that they were orchestrated by the ABVP and the organisers of the event didn’t respond to it. As for the Afzal Guru event itself, there is nothing wrong with questioning capital punishment; legal experts have raised this question a million times without it snowballing into a sedition case.\n\nWhy is Umar in hiding?\n\nWe don’t know why Umar is in hiding. We’ve not had any contact with him since right after the Arnab Goswami debate. We are really worried for his safety.", 
    "section": "national", 
    "title": "‘ABVP orchestrated anti-India slogans at university event’", 
    "subsection": "general", 
    "date": "2016-02-19"
}