{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The Army brass in January recommended Major General N.K. Mehta to the rank of Lieutenant-General. Now it turns out that he is only good enough to be a brigadier.\n\nThe Lucknow Bench of the Armed Forces Tribunal (AFT) has set aside the promotion of the officer from the rank of Brigadier to Major General as the promotion was based on “fraud.”\n\n“Since from material on record, there appears to be concealment of material facts, respondent No. 1, prima facie, seems to be not eligible for promotion even to the rank of Major General, we direct the respondents to maintain status quo ante forthwith,” the Bench said in its judgement against Maj. Gen. N.K. Mehta in response to a case filed by Maj. Gen. R.S. Rathore on Wednesday.\n\nThis is essentially a case of competition for a limited number vacancies in the steeply pyramid structure in the upper echelons of the Army.\n\nRuling over-ruled\n\nWith this verdict, the AFT has over-ruled its own earlier ruling in favour of Maj. Gen. Mehta.\n\nBoth the officers in question belong to the same batch of Army Ordnance Corps inducted in 1979.\n\nHowever, Maj. Gen. Rathore was apparently senior to Maj. Gen. Mehta and both names came up for consideration for the rank of Major General on October 10, 2011 and the selection board approved then Brigadier Rathore for the next rank.\n\nHowever, the result was withheld “due to a pending Disciplinary and Vigilance (DV) ban” on him in an earlier case which was later revoked and he assumed the rank of Major General.\n\nMaj. Gen. Mehta approached the AFT in 2012 against it as he was not promoted and the AFT then approved his promotion without adequate Confidential Reports for consideration.\n\nThe Army appealed against this but was turned down.\n\nIn 2013, Maj. Gen. Rathore approached the AFT against this and the verdict was given on Wednesday in his favour.\n\nNoting that there appears to be a “deliberate attempt on the part of certain persons to create disturbance in the way of applicant by commission of fraud,” the order said, “No judgment of a court, no order of a minister can be allowed to stand if it has been obtained by fraud.”\n\nClosing the case, the Bench made a strong observation: “We feel that corruption has crept in every system of the country and pray to the Almighty to impart justice and help the country to recognise merit of the persons serving nation instead of extraneous consideration.”", 
    "section": "national", 
    "title": "Armed Forces Tribunal demotes Major General", 
    "subsection": "general", 
    "date": "2016-02-19"
}