{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "The Jagdalpur Legal Aid (‘JagLag’), a group of woman lawyers which provides free legal aid to tribal people implicated in Maoist-related cases, and a freelance journalist in Jagdalpur, the district headquarters of Bastar in Chhattisgarh, have been asked to vacate their houses within eight days, allegedly at the behest of the police.\n\nAccording to advocate Isha Khandelwal, one of the founding members of ‘JagLag’, the police on Wednesday night visited their landlord, a driver by profession, and took him away to the police station.\n\n“He was kept in the police station till early morning and his car was impounded. The house owner informed us at 2 a.m. today [Thursday] that he had no option but to ask us to vacate the house and our office within a week,” Ms. Khandelwal told The Hindu .\n\nWithin hours of the eviction notice to JagLag, freelance journalist Malini Subramaniam, who once headed the International Committee of the Red Cross (ICRC) in the State, was also asked to vacate her house within eight days by her house owner.\n\n“In the evening, members of the Samajik Ekta Manch [a vigilante group supported by the Bastar police] came to the JagLag office, shouting slogans, and created a ruckus,” said Ms. Abhinav Gupta, an associate of JagLag.\n\nMs. Subramaniam has been consistently reporting on the atrocities on tribals and police excesses in Bastar. Last week, some members of the Samajik Ekta Manch attacked her house and damaged her car. The police have taken no action even after Ms. Subramaniam named two persons in her complaint.\n\n“The timing of these events does not escape our notice. This is coming at a time when the whole countryside of Bastar is on fire. Under the guise of anti-Naxal operations, security forces are indulging in rape, pillage and plunder. With teams of women activists, we have documented at least three cases of mass sexual violence in the past three months alone, in which security forces have run amok in villages, stripping women, playing with their naked bodies and indulging in gang rape, looting their precious food supplies and destroying their homes and granaries,” said a statement issued by Ms. Khandelwal and Shalni Gera of JagLag.\n\nAsked about the eviction notice to JagLag members and Ms. Subramaniam, Superintendent of Police R.N. Das told The Hindu that he had “no idea” about it. Bastar police chief S.R.P. Kalluri did not respond to the calls from The Hindu . Collector Amit Kataria said he was unaware of the developments.\n\nLandlord reportedly forced to ask them to vacate their houses, office within eight days", 
    "section": "national", 
    "title": "Bastar police target legal aid group, scribe", 
    "subsection": "general", 
    "date": "2016-02-19"
}