{
    "author": [
        "T K"
    ], 
    "text": "Modi govt. showing a lot of political will to reform, says Belgian envoy\n\nA Belgian Research Institute has developed a technology not only to clean sewage water but also to produce electricity out of it, an official said.— File photo: Ranjeet Kumar\n\nBelgium is keen on taking part in the “Clean Ganga” campaign, and a Belgian mission with companies specialising in sanitation will meet Indian government officials soon, a top Belgian official said.\n\n“We have specific solutions which are unique. A Belgian Research Institute, Vito has developed a technology not only to clean sewage water but also to produce electricity out of it,” Joren Vandeweyer, spokesperson for the Belgian Secretary of State for Foreign Trade, Pieter De Crem, said.\n\nAsked about the challenges, Mr. Vandeweyer said: “First is cleaning up the actual pollution — there are certain companies that specialise in that. The second is preventing pollution; that is a huge effort, but that will come.”\n\nAsked whether the current events in the country, including the student protests, would hamper foreign investments in India, Jan Luykx, Belgium Ambassador to India, said protests were a part of democracy.\n\nRecalling the number of protests that happen in the European Union and Brussels, Mr. Luykx said, “As part of democracy, this [protests] happens. That’s not a drama. People protest, there is a little bit of chaos on the streets. This is healthy in a way.”\n\nMr. Luykx and Mr. Vandeweyer said the government was making the right efforts with regard to the economy. “This government is showing a lot of political will to reform, to make it more business-friendly. There are certain measures to be taken, certain measures are already good,” Mr. Luykx said.\n\nMr. Vandeweyer, however, added that the government had to have a business-friendly climate with good regulations and a good legal system.\n\nHe called for a predictable tax regime for investors. “… not [on] Day 1, you ask so many taxes, day 2 you increase … it is important to have predictability because they [businesses] invest for 20-30 years. If you do that, businesses will come. India is a huge emerging market and the economy is growing,” he said.\n\nBelgium also wants to diversify its trade with India in the diamond business, which contributes to a large part of the bilateral trade. Prime Minister Narendra Modi is expected to visit Belgium as part of his EU tour in March.\n\n'“It is work in progress. There will be nice outcomes from this visit,” Mr. Luykx said.", 
    "section": "national", 
    "title": "Belgium keen on joining ‘Clean Ganga’ drive", 
    "subsection": "general", 
    "date": "2016-02-19"
}