{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The Bharatiya Janata Party, in pushing the nationalism issue centre stage, appears to have succeeded — even if temporarily — in shifting the focus from the intolerance/freedom of choice debate to a discussion in which participants can either be patriots or traitors.\n\nSome TV channels have already created the space for a sharply polarised debate on the subject. The BJP has announced a Swabhiman Yatra to amplify its message and the RSS too has sent out a signal of approval.\n\nAddressing an RSS regional conclave in Meerut on Sunday, its joint general secretary Dattatreya Hosabale justified the government’s action against students of the Jawaharlal Nehru University for raising “anti-India” slogans, stressing that all universities must be purged of all kinds of “anti-national” elements.\n\nThe song with which the conclave commenced and ended demonstrated how Hindutva can be easily subsumed into the sangh parivar’s nationalist discourse, linking “Hindu” blood to everyone who lives in the country: “ Sanskriti sabki ek chirantan/khoon ragon me hindu hai (Everyone’s culture flows from the same branch, the blood that runs through everyone’s veins is Hindu.)”\n\nThe violence unleashed by members and sympathisers of the BJP — MLA O.P. Sharma and some lawyers — seen in the courtroom where the case of JNUSU president Kanhaiyya Kumar, who is being tried for sedition, has accentuated the message that anything that smacks of disloyalty to the nation will not be tolerated. Already, reports are coming in of vigilantes marching through the streets of Delhi, demanding the gallows for all “traitors.” Two such groups were spotted in Dwarka and Saket earlier this week.\n\nWith the BJP, the ABVP and the sangh parivar having set the agenda, it is becoming increasingly hard for anyone to give a qualified response to, say Central Minister Mukthar Abbas Naqvi’s poser: Are you for “Build India” or “Break India”? An Opposition leader acknowledged that an answer such as “Build India, of course, but not the BJP’s idea of India” would immediately be read as suspect.\n\nFor the BJP, the nationalism issue has helped it change the optics, even make a temporary recovery from its clumsy handling of the Rohith Vemula case. It has taken the Opposition unawares, leaving it scrambling for an effective counter.\n\nEdge for the BJP\n\nComing as it does just ahead of a Parliament session in which the government’s failure to fix the economy and reverse the economic slowdown and the BJP-led NDA’s ignominious electoral defeat in Bihar might otherwise have been the backdrop, bringing the nationalism issue to the fore will give the BJP an edge in confronting its critics — for the moment.\n\nAn RSS source explained, “Hindutva only seeks to consolidate Hindus by breaking caste boundaries. Nationalism and rashtrabhakti (love of one‘s country) seeks to bind all citizens, regardless of their economic, social or religious backgrounds.”\n\nThe Opposition has its work cut out for it: it will have to articulate its vision of nationalism without sounding as though it is prevaricating. If the mainstream Left Parties will have to send out a clear an unequivocal message differentiating itself from Maoist methods and ideology, the Congress must desist from associating nationalism with the Gandhi family alone, as vice-president Rahul Gandhi did on Thursday: responding to the BJP’s “anti-national” dig against him, he asserted, “Nationalism is in my blood. I have seen my family sacrifice again and again and again for this nation.”\n\nOn the negative side for the sangh parivar is the fact that the churning in its ranks is not over. A senior BJP Dalit leader said: “For the moment, this raising of the nationalism issue will work for our party, but it is still dominated by upper castes. The Rohith Vemula issue demonstrated that unless all castes are treated equally, it can backfire — and this nationalism issue too can backfire.”", 
    "section": "national", 
    "title": "BJP game plan may have succeeded for the moment", 
    "subsection": "general", 
    "date": "2016-02-19"
}