{
    "author": [
        "Swathi V"
    ], 
    "text": "Relocating villages under Amrabad and Kawal Tiger Reserves is a difficult task for authorities as they are unable to find large tracts of Revenue land\n\nRelocation of villages to create inviolable sanctuary space for tigers in Amrabad and Kawal Tiger Reserves could be a long drawn out and laborious process though the package has been voluntarily opted by many villagers in both the reserves.\n\nAs per the package offered by the National Tiger Conservation Authority (NTCA), each family may choose either Rs. 10 lakh as monetary compensation, or five acres of land, a house and cash incentive for moving out of the sanctuary’s core area. However, relocating each village as a whole will be a Herculean task for the district authorities, owing to scarcity of Revenue lands matching the size. The options left are purchasing land at higher price or diverting forest land — the latter could take a long time considering the bureaucratic hurdles it has to overcome.\n\nA total of 700 families expressed willingness to relocate from three villages of Amrabad reserve in Mahabubnagar, while the number stands at 200 at Kawal, Adilabad district.\n\n“At Amrabad itself, we would need over 3,000 acres of land, even if we are to allot three to four acres of land to each family, and have housing colony constructed. Attempts to explore the possibility of finding government lands of such extent have failed. We cannot scatter the families, as it could affect their social bonding,” a forest official informed under the condition of anonymity.\n\nOn the other hand, purchasing land at market price could cut into the component of monetary compensation, he said. District-level officials are pinning their hopes on diversion of forest land, and have already begun to work towards that. Project Director, DWMA, Mahabubnagar, Damodar Reddy informed that they could close in on the degraded reserve forest at Jonnalabogada village of Pedda Kottapalli mandal, where the families could be relocated.\n\n“The place also comes with the additional advantage of falling under the command area of Kalwakurthi lift irrigation scheme. I have asked the Divisional Forest Officer if the land has been surveyed, and also passed on the information to the District Collector. The forest land could be occupied after being de-notified,” Mr. Reddy said.", 
    "section": "national", 
    "title": "Creating space for tigers a long-drawn-out process", 
    "subsection": "general", 
    "date": "2016-02-19"
}