{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The government is “reconsidering” the denial of One Rank One Pension (OROP) to personnel opting Pre-Mature Retirement (PMR) in light of the concerns expressed by serving and retired military personnel.\n\n“This aspect is under consideration. We understand that there is a problem… I am talking of the PMR which is required for the forces,” Defence Minister Manohar Parrikar said on Thursday in an interview to India Today TV on the programme, “To the point”.\n\nThe PMR in the armed forces is a way of maintaining a younger officer profile at the middle level and open up vacancies for lower ranks. Currently the PMR tenure for Jawans and Junior Commissioned Officers (JCO) is 15 years and for officers it is 20 years after which they are eligible for pension.\n\nHowever, he said that there has to be a distinction between those leaving service for greener pastures and those leaving for the sake of the country.\n\nDefending the equalisation of pension every five years as it was mentioned by the Koshyari committee, Mr. Parrikar said it would be looked into by the one-man judicial committee. “We have no objection in referring anything and everything to the committee…” he added in response to questions from journalist Karan Thapar.\n\nThe government issued the notification implementing the OROP in November last year which stated that personnel opting for the PMR will be out of the ambit of the OROP effectively distinguishing those who had already retired and those opting for the PMR in future.\n\n“Personnel who opt to get discharged henceforth on their own request…. will not be entitled to the benefits of the OROP. It will be effective prospectively,” the notification said.\n\nThis statement goes against the recommendations of the A.V. Singh committee of 2004 which recommended ways of lowering the age of Commanding officers and brigade commanders for combat and support arms.", 
    "section": "national", 
    "title": "Government reviewing denial of OROP for premature retirees", 
    "subsection": "general", 
    "date": "2016-02-19"
}