{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India to keep pressure over fighter jet deal ahead of U.S.-Pakistan Feb. 29 talks\n\nWe have conveyed our opinion quite clearly to the U.S, says Manohar Parrikar.\n\nExpressing “hurt” over the U.S.’ decision to sell Pakistan eight F-16 fighter jets, the government said it had made it clear that the deal was unacceptable to India.\n\n“I am quite hurt by [the sale of F-16s to Pakistan] and we have expressed our opinion quite clearly to the U.S.,” Defence Minister Manohar Parrikar told India Today TV’s ‘To The Point’ programme in an interview on Thursday.\n\nThe Minister’s statement comes nearly a week after the Ministry of External Affairs had summoned U.S. Ambassador Richard Verma to express India’s “disappointment” and displeasure over the announcement of the deal worth approximately $699 million.\n\nWhile the U.S. government had formally notified its Congress of its intention to make the Foreign Military Sale (FMS) last Friday, the deal may take some months, especially after objections from Congressmen of any plans by the U.S. of subsidising the deal.\n\nSources said India had made it clear that not only was its opposition to the deal over the fact that the military hardware would be used to bolster Pakistani defences against India rather than counter-terror operations, it was also upset by the timing of the deal.\n\nSenior officials said the F-16 sale came even as India was hoping to keep the pressure on Pakistan to deliver action on the Pathankot terror attack.\n\nAsked if the U.S. decision and rejection of India’s concerns went against Prime Minister Narendra Modi’s statement that India and the U.S. were “natural allies,” Mr. Parrikar told journalist Karan Thapar, “There are ups and downs in all relationships. Overall the relationship has improved a lot. Of course, this [F-16 sale] is a [down]. We don’t accept this deal and that is what we have told the U.S.”", 
    "section": "national", 
    "title": "Hurt by U.S. plan to sell F-16s to Pakistan: Parrikar", 
    "subsection": "general", 
    "date": "2016-02-19"
}