{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "Shailesh Gandhi (left) has written to the Centre objecting to the possible appointment of B.S. Bassi to the CIC.\n\nShailesh Gandhi says a transparent procedure should be followed in the selection process\n\nAlarmed at speculation that Delhi Police Commissioner B.S. Bassi could be appointed Information Commissioner in the Central Information Commission, RTI activist and former Chief Information Commissioner Shailesh Gandhi on Thursday shot a letter to the Centre objecting to the appointment.\n\nIn a letter shot to Cabinet Secretary P.K. Sinha, Mr. Gandhi said: “There are news reports that Mr. Bassi is likely to be made an Information Commissioner in the Central Information Commission. This would be a travesty of the process. There should be a transparent process for selecting an Information Commissioner in line with the spirit of the Right to Information Act.”\n\nPointing out that though the final selection of an Information Commissioner could be solely a political decision of the incumbent government, Mr. Gandhi said: “There should be a transparent process for short-listing the panel to be presented to the selection committee. Not doing this is doing great harm to the RTI Act.”\n\nStating that the choice of Mr. Bassi would be unfortunate especially in the light of the Delhi Police failure to prevent attack on journalists and JNU student leader Kanhaiya Kumar, Mr. Gandhi said: “By his collusive inaction, journalists were attacked and the sanctity and respect for the judicial system and the courts was diminished. Even when a citizen does this, it is unacceptable. From a public servant charged to uphold the law, it deserves the strongest condemnation.”\n\n“If the government now makes him an Information Commissioner, it would be a sad day for democracy, and people will believe that the denigration of the two estates of governance had the approval of the government,” he wrote in the letter.\n\nThe Opposition has accused Mr. Bassi of favouring BJP-led government to angle for a plum posting post-retirement. The IPS officer retires from service this month.", 
    "section": "national", 
    "title": "It will be a sad day for democracy: ex-CIC", 
    "subsection": "general", 
    "date": "2016-02-19"
}