{
    "author": [
        "B Pradeep Nair"
    ], 
    "text": "Path-breaking technology of Light-Fidelity uses light as a medium to carry data\n\nImagine an LED bulb doubling up as an access point for connecting to the Internet and ordinary light being used as a medium to carry data.\n\nA whole new world wherein a bulb would not only give us light but also help us access the Web might not be too far away, if a new technology called Li-Fi (or Light-Fidelity) goes mainstream.\n\nProf. Harald Haas of the University of Edinburgh, who coined the term Li-Fi in 2011, demonstrated the new technology to a packed auditorium at the Wipro’s Electronics City campus on Wednesday.\n\nHe streamed a video from the Internet on a laptop using light from an LED bulb to access the Web.\n\nProf. Haas said Li-Fi was a disruptive technology that could transform business models, create new opportunities, and was poised to be a $113 billion industry by 2022.\n\nHe said that the RF (radio frequency) spectrum would not be enough considering the rate of growth of wireless data communication.\n\nThe visible light spectrum was much larger.\n\nThe use of the light spectrum for Li-Fi overcomes the issues in traditional wireless communication, like the shortage of spectrum and network disruption because of interference.\n\nIn Li-Fi, anyone who has access to light can access the Internet. The system also allows users to move from one light source to another without losing their network connection.\n\nWhat about connecting to the Internet in the night? The stream of photons can be reduced to a minimal level that won’t produce visible light but enough to carry data.\n\nProf. Haas said though Li-Fi was poised to compete with Wi-Fi, it was not meant to replace it.\n\n“We are not looking at an either-or situation.”\n\nThough the inability of light rays to pass through walls and similar structures is seen as a major drawback of this technology, Prof. Haas has a totally different view.\n\nHe said it is an advantage since restriction by walls provides more security to the network and eliminates the risk of the signal leakage to eavesdropping.\n\nThe Li-Flame, described as the world’s first true Li-Fi system, was displayed at the Mobile World Congress in Barcelona in March last year. The third generation of the product has now been developed and will be on display at the MWC later this month.", 
    "section": "national", 
    "title": "LED bulb could connect you to Internet", 
    "subsection": "general", 
    "date": "2016-02-19"
}