{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "‘New crop insurance scheme has lower premium at 2 per cent, no limit on claims for damage’\n\nPrime Minister Narendra Modi on Thursday said that the former UPA government’s indifference towards farmers during its 10-year rule was responsible for the critical condition of the farmers in the country.\n\nMr.Modi, who was addressing a farmers’ rally at the Kisan Kalyan Mela at Sherpur village in Sihore district of Madhya Pradesh, said the Pradhan Mantri Fasal Bima Yojna (PMFBY), the new crop insurance scheme launched by his government last month, would be instrumental in ending farmers’ woes.\n\n“For the BJP and the NDA governments, farmers’ welfare has always been a priority. It was during the Atal Bihari Vajpayee government (1998-2004) that the first constructive attempt towards crop insurance scheme was made. But later, the UPA government made changes to the scheme following which the farmers lost faith in the scheme and did not benefit”, Mr.Modi said.\n\n50% coverage targeted\n\n“It was due to lack of faith in the earlier schemes that not more than 20 per cent of the farmers were associated with it”, said Mr.Modi, adding that his government targeted covering at least 50 per cent of all farmers under the new scheme.\n\n“The new scheme will address all apprehensions of farmers as we have removed all discrepancies of previous insurance schemes,” he said, adding that under new scheme, there was no cap on claims, while there is a cap of 2 per cent on premium, unlike the premium of up to 14 per cent in earlier schemes.\n\nExplaining the benefits of this comprehensive crop insurance scheme to the farmers, Mr.Modi said earlier, the farmers would get compensation only when 50 per cent of the crop was damaged due to natural calamity, but now, the norms had been relaxed and compensation would be given even if the damage was caused to one-third of the crop area.\n\nPTI reports\n\nMr.Modi that even if a crop was damaged up to 14 days after the harvest, farmers would get the insurance claim.\n\nAlso, even if only a single farmer was affected in a village, the insurance would be granted to him/her.", 
    "section": "national", 
    "title": "Modi blames UPA for farmers’ woes", 
    "subsection": "general", 
    "date": "2016-02-19"
}