{
    "author": [], 
    "text": "Study shows a signal of breeding in the ‘opposite’ direction: human DNA in a Neanderthal genome, rather than Neanderthal DNA in human genomes\n\nReconstructions of a Neanderthal man and woman at the Neanderthal museum in Mettmann, Germany. —FILE Photo: AP\n\nNeanderthals may have been mating with modern humans 100,000 years ago, tens of thousands of years earlier than previously thought, a new study based on several different methods of DNA analysis has found.\n\nScientists provide the first genetic evidence of a scenario in which early modern humans left the African continent and mixed with the now-extinct members of the human family prior to the migration “out of Africa” of the ancestors of present-day non-Africans, less than 65,000 years ago.\n\nSequencing in 2010\n\n“It’s been known for several years, following the first sequencing of the Neanderthal genome in 2010, that Neanderthals and humans must have interbred,” said Professor Adam Siepel, from Cold Spring Harbor Laboratory (CSHL) in the U.S.\n\n“But the data so far refers to an event dating to around 47,000-65,000 years ago, around the time that human populations emigrated from Africa. The event we found appears considerably older than that,,” said Prof. Siepel.\n\n“One interesting thing about our finding is that it shows a signal of breeding in the ‘opposite’ direction from that already known,” he said. “That is, we show human DNA in a Neanderthal genome, rather than Neanderthal DNA in human genomes.”\n\nThis finding, the result of several kinds of advanced computer modelling algorithms comparing complete genomes of hundreds of contemporary humans with complete and partial genomes of four archaic humans, has implications for our knowledge of human migration patterns.\n\nPeople of European, Eurasian and Asian descent have well-identified Neanderthal-derived segments in their genome.\n\nThese fragments are traces of interbreeding that followed the “out of Africa” human migration dating to about 60,000 years ago. They imply that children born of Neanderthal-modern human pairings outside of Africa were raised among the modern humans and ultimately bred with other humans, explaining how bits of Neanderthal DNA remain in human genomes.\n\nOutside Africa\n\nContemporary Africans, however, do not have detectable traces of Neanderthal DNA in their genomes.\n\nThis indicates that whatever sexual contact occurred between modern humans and Neanderthals occurred among humans who left the African continent.\n\n“Ancestors of present-day African populations likely didn’t have the opportunity to interbreed with Neanderthals, who lived largely outside of Africa,” said co-author Ilan Gronau, a former member of Prof. Siepel’s Lab who is now at the Herzliya Interdisciplinary Centre, Israel.\n\nThe team’s evidence of “gene flow” from descendants of modern humans into the Neanderthal genome applies to one specific Neanderthal, whose remains were found some years ago in a cave in south-western Siberia, in the Altai Mountains, near the Russia-Mongolia border.\n\n“The signal we are seeing in the Altai Neanderthal probably comes from an interbreeding event that occurred after this Neanderthal lineage diverged from its archaic cousins, a little more than 1,00,000 years ago,” Prof. Siepel added.\n\nThe study appears in the journal Nature . — PTI", 
    "section": "national", 
    "title": "Neanderthals, humans interbred earlier than thought", 
    "subsection": "general", 
    "date": "2016-02-19"
}