{
    "author": [], 
    "text": "NASA funded the project with $6.5 mn\n\nAn engineer from the University of Michigan has developed a prototype of a thruster that may form the basis for a propulsion system to take a manned spacecraft to Mars in the 2020s.\n\nNASA has funded a spaceflight propulsion system to be built around a tabletop-sized thruster developed by Alec Gallimore, the Richard F and Eleanor A Towner professor of engineering.\n\nThe US space agency awarded $6.5 million over the next three years to Aerojet Rocketdyne for the development of the propulsion system, dubbed the XR—100.\n\nMr. Gallimore’s thruster, called X3, is central to this system and his team will receive $1 million of the award for work on the the device.\n\nPlasma principle\n\nThe XR—100 is up against two competing designs. All three of them rely on ejecting plasma — an energetic state of matter in which electrons and charged atoms called ions coexist — out of the back of the thruster.\n\nBut the X3 has a bit of a head start. For thrusters of its design power, 200 kilowatts, it is relatively small and light.\n\nThe core technology — the Hall thruster — is already in use for manoeuvring satellites in orbit around Earth.\n\n“For comparison, the most powerful Hall thruster in orbit right now is 4.5 kilowatts,” Mr. Gallimore said.\n\nThat’s sufficient to adjust the orbit or orientation of a satellite but it’s too little power to move the massive amounts of cargo needed to support human exploration of deep space.\n\nScott Hall, a doctoral student in Mr. Gallimore’s lab, will use the funding to put the X3 through a battery of tests, running it up to 60 kilowatts and then up to 200 kilowatts.\n\nDoctoral student Sarah Cusson will investigate a tweak that could allow the X3 to remain operational for five-to-10 times longer than its current lifetime of a little over a year. — IANS", 
    "section": "national", 
    "title": "Now, a novel propeller for Mars expeditions", 
    "subsection": "general", 
    "date": "2016-02-19"
}