{
    "author": [], 
    "text": "The Supreme Court on Thursday vacated its order to maintain status quo in crisis-ridden Arunachal Pradesh, which may pave the way for government formation by rebel Congress MLAs with the support of BJP lawmakers.\n\nReferring to the Gauhati High Court order staying the disqualification of 14 rebel MLAs, a five-judge Constitution Bench headed by Justice J.S. Khehar said, “It does not call for any interference.”\n\nThe Bench, which also perused the records summoned from Gauhati High Court pertaining to disqualification of the rebel legislators, said it was “prima facie” satisfied with the High Court order and not inclined to interfere with it.\n\n“Prima facie we are not inclined to interfere with the High Court order, we are satisfied with it. Having seen the original records which are put before us by the Registrar-General of the Gauhati High Court, the order of January 7 calls for no interference at this stage.”\n\n“Accordingly, the ad-interim order passed is vacated,” the Bench also comprising Justices Dipak Misra, M.B. Lokur, P.C. Ghose and N.V. Ramana said.\n\nSenior Advocate Fali S Nariman opposed the order and said until the Gauhati High Court decided the matter, some conditions might be imposed.\n\nAttorney-General Mukul Rohatgi opposed the contention of Mr. Nariman and said the matter was settled and no conditions should be imposed.\n\nMr. Nariman opposed his presence in the matter and asked “what is Union government doing in this case.”\n\nTo this, Mr. Rohatgi said “I will explain everything. I am here because the injunction had come in between the revocation of President’s rule in the State.”\n\nThe Bench then said the injunction of status quo was consciously passed by it to prevent the situation from going out of hand till it was satisfied by the facts of the case.\n\nThe Bench also transferred the case regarding disqualification of the 14 rebel MLAs from the single judge to the Division Bench of the High Court and asked it to expeditiously decide the matter within two weeks. — PTI", 
    "section": "national", 
    "title": "SC vacates status quo in Arunachal", 
    "subsection": "general", 
    "date": "2016-02-19"
}