{
    "author": [
        "Chintan Girish Modi"
    ], 
    "text": "Veteran Hindi film actor Sharmila Tagore is being billed as the star attraction at Pakistan’s Lahore Literary Festival (LLF) scheduled to take place on February 20 and 21. Ms. Tagore, who has previously headed India’s Central Board of Film Certification, crossed the Attari-Wagah border on foot to enter Pakistan on February 17.\n\nShe was welcomed by LLF Founder and CEO Razi Ahmed, who also posted a photograph of himself with Tagore on Twitter. At the festival, she will be in conversation with Dawn Media Group CEO Hameed Haroon. This session, titled ‘Safar’, will focus on Ms. Tagore’s illustrious career in films, which has spanned five decades.\n\nAs part of their efforts to facilitate cultural exchange between Pakistanis and Indians, the organisers have invited a large contingent of Indian speakers to interact with audiences in Lahore, a city renowned for its patronage of the arts.\n\nFilm-maker Mahesh Bhatt, who recently roped in Pakistani ghazal maestro Ghulam Ali to sing for his play ‘Milne Do’ will also speak at the festival.\n\nThe festival, which was scheduled to be a three-day affair, was recently shortened to two days. The organisers were unavailable for comment despite repeated attempts. However, the festival’s Facebook page announced on Thursday that the “truncated festival” would be held at Hotel Avari instead of the Alhamra Arts Complex.\n\nSecurity concerns\n\nReports in the Pakistani media had earlier indicated that the ‘No Objection Certificate’ granted for the festival had been revoked by the authorities concerned over security concerns, leading to rumours that the festival might be cancelled.\n\nThe hotel is a heavily guarded venue that is frequented primarily by Lahore’s elite while the arts complex is a more accessible public venue.\n\nThe other Indian speakers at the festival include art historian B.N. Goswamy, novelist Sonia Faleiro, cinema studies expert Ranjani Mazumdar, documentary film-maker Shohini Ghosh, historian Tanika Sarkar, journalist Karan Thapar, art gallery owner Amrita Jhaveri, and cookbook writer Madhur Jaffery, who has acted in several films including the Merchant Ivory production Heat and Dust.\n\nVeteran Hindi film actor Sharmila Tagore will be the star attraction of the two-day festival", 
    "section": "national", 
    "title": "Sharmila Tagore is star of Lahore literary festival", 
    "subsection": "general", 
    "date": "2016-02-19"
}