{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Weeks after Defence Minister Manohar Parrikar spoke about sending troops to fight the IS in Syria, India on Tuesday told the United Nations Special Committee for Peacekeeping Operations that it recognises the need for “flexibility” on international anti-terror operations if they are backed by U.N. authorisation.\n\nPresenting India’s position on the HIPPO (High Level Independent Panel on Peace Operations) report, which is aimed at countering international terror groups, Syed Akbaruddin, the Permanent Representative of India at the U.N., said: “We understand that these issues [response to counter-terrorism operation with U.N. authorisation] need to be viewed with flexibility in response to emerging challenges.”\n\nThe HIPPO report has expanded the scope of counter-terror operations beyond the traditional U.N. peacekeeping operations by recommending that “ad hoc coalitions authorised by the U.N. Security Council” can undertake counter-terror operations with the intention of peacekeeping and peace-enforcement.\n\nDiplomatic sources told The Hindu that the HIPPO report recommendations will be implemented after “cost-benefit analysis” for India. However, military experts have argued that India, which is one of the largest troop-contributors to the U.N. peace missions, has been looking for a flexible agenda to help it coordinate the peace operations better under the U.N.\n\nMr. Akbaruddin also highlighted that peacekeeping under the U.N. needs to be strengthened in view of the expanding international networks of terrorism.\n\nA senior diplomatic source said that though India has no intention of sending troops to Syria now, it cannot turn away from the crisis due to the presence of more than six million remittances-generating Indian citizens in various Arab countries.\n\nHowever, it is understood that any action in that direction will have to factor in the fate of the 39 Indians who are missing in Iraq since June 2014.\n\nThat apart, India welcoming the U.N. report has triggered a debate with experts suggesting that the mention of “ad hoc coalitions authorised by the U.N. Security Council”, has opened up possibilities of India’s participation in foreign anti-terror operations to safeguard “Indian interests.”", 
    "section": "national", 
    "title": "‘Strengthen peacekeeping under U.N. to counter new threats’", 
    "subsection": "general", 
    "date": "2016-02-19"
}