{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "A group of students led by the All India Students Federation (AISF), the Left parties’ student wing, took out a protest march on Thursday against the arrest of Jawaharlal Nehru University Student’s Union (JNUSU) president Kanhaiya Kumar and clashed with the State BJP workers and ABVP members outside the party headquarters here.\n\nThe police used mild force to disperse the students while the BJP leaders accused the ruling party Janata Dal (United) of “sponsoring the attack on the BJP office.”\n\nThe clash erupted when the students led by the AISF, of which Kanhaiya Kumar is a member, reached the BJP office on the Beerchand Patel Marg and raised slogans against the party for attacking the JNUSU president on the court premises in New Delhi on Wednesday.\n\nThe students also demanded his early release.\n\nWorkers of the BJP and members of the ABVP, the party’s student wing, then came out of the office and confronted them. “The students clashed with the BJP workers and ABVP members outside the BJP office. We dispersed them,” said a police official.\n\nHowever, the BJP leaders charged the ruling party JD(U) with sponsoring the protest and attack. State BJP chief Mangal Pandey challenged the JD(U) to “confront them from the front and not through backdoor.\n\nThe JD(U) leaders, later addressed the media and expressed solidarity with Kanhaiya Kumar. “We’re and will be with Kanhaiya Kumar…we’d like to ask the Central government what are the charges against him?” asked JD(U) leader Sanjay Singh and spokesperson Neeraj Kumar.\n\nMr. Kumar had visited Kanhaiya Kumar’s village and met his family members on Wednesday.\n\nMeanwhile, the district authorities in Begusarai have provided security to the Kanhaiya Kumar’s family members as a “precautionary measure”. “In view of the attack on the court premises in Delhi we have deployed some policemen at his home in Masnadpur village of Bihar,” said a senior police official of the district Manoj Kumar.\n\nThe local BJP and ABVP workers protested in Begusarai district demanding stern action against Kanhaiya Kumar for his “anti-national” sloganeering in JNU. However, a group of local theatre artistes and social activists staged a protest in Patna on Wednesday and demanded his immediate release.", 
    "section": "national", 
    "title": "Students clash with BJP workers in Patna", 
    "subsection": "general", 
    "date": "2016-02-19"
}