{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "Thousands of people took out a march from Mandi House to Parliament Street in New Delhi on Thursday in solidarity with JNU students protesting against the arrest of Kanhaiya Kumar.— Photo: Sandeep Saxena\n\nhousands of people, including teachers and students from various universities, lawyers, academicians, artists and activists poured out on the streets of Delhi on Thursday afternoon in support of Jawaharlal Nehru University and its students’ union president, Kanhaiya Kumar, now in custody on sedition charge.\n\nA call for march in solidarity with JNU was given by the students of the varsity, however it turned out to be a people’s march when around 10,000 people joined in. Holding placards that read — “Long live JNU”, “Stand with JNU”, “Oppose attack on right conscience”, “I am Kanhaiya” and “I am Umar”, people marched from Mandi House to Parliament Street.\n\nA large number of them also held roses in their hands and raised them in the air at the start of the march. Even as some people initially had reservations about taking out such a march outside the university, due to security concerns of the students, the march finally ended up violence-free.\n\n“JNU has always been a very vibrant campus. All kinds of voices have always been allowed in the campus, we believe in debating and accommodating other people’s views, even if we disagree with them. And what has been done to Kanhaiya and the way police have been allowed to crack down on our university is completely unacceptable, and we will not take things lying down. We stand in solidarity with Kanhaiya, and demand his immediate release,” a JNU student said. Students from Delhi University, Jamia Milia Islamia, All India Institute of Medical Sciences, Allahabad University, Hyderabad University, Aligarh Muslim University and various other institutes joined the agitation.\n\n“We have been receiving support and solidarity from campuses across the country. And today, in this unprecedented show of solidarity, oceans of people from different organisations marched with students and teachers to reclaim the streets of Delhi from the ongoing ABVP-RSS-BJP campaign of terror, intimidation and slander”, said Shehla Rashid, vice-president, JNU students’ union. “It was necessary to reclaim the streets of Delhi for JNU students after the negative atmosphere that has been created against the students from the institution,” Anant Kumar, another JNU student said.", 
    "section": "national", 
    "title": "Thousands join march in support of JNU students", 
    "subsection": "general", 
    "date": "2016-02-19"
}