{
    "author": [
        "Special Correspondent"
    ], 
    "text": "What is common to the VC of Hyderabad University Appa Rao Podile who is currently on leave, and the newly appointed Vice-Chancellor of Jawaharlal Nehru University, Professor Mamidala Jagadeesh Kumar? Scientists both, they have also earned the collective wrath of their students and teachers for letting them down in abdicating their responsibility and failing to protect them. Not just that, in both universities, two students Rohith Vemula and Kanhaiya Kumar have emerged as symbols of resistance and a rallying point for all students in the country.\n\nProf. Mamidala Kumar had taken the day off when his students and teachers marched along Mandi House on Thursday, to protest the arrest and assault by lawyers of one of their own — Kanhaiya Kumar — on the court premises. He has been charged under the serious sedition Act. The venue where the students and teachers of JNU marched, along with students from Ambedkar University and Delhi University, was apt for, it is here where the performing arts — theatre, music, dance and letters — thrive in an atmosphere of freedom unfettered by the state.\n\nProf. Kumar’s arrival on the campus comes at a time of ferment similar to the one Prof. Podile faced in Hyderabad. Unlike Hyderabad University which escaped being targeted and tarnished by members of the political class, the threat that JNU faces is imminent. It has been unfairly bestowed with a terror, largely because of its Left-liberal atmosphere in the times of a majoritarian right-wing government. And right from the start, colleagues say Prof. Kumar misread the situation on February 9, when students had allegedly chanted anti-India and pro-Pakistan slogans. For one, he should not have called the police in merely on the basis of a complaint by a rival student group and an FIR by a BJP MLA of Delhi. The VC, who goes by the rule book, quickly appointed a three-member committee which decided in great haste to suspend eight students without giving them a hearing. Allowing the police to arrest student leader Kanhaiya Kumar did not go down well either with the students or their teachers.\n\nScientists both, they earned wrath of students & teachers for not protecting them", 
    "section": "national", 
    "title": "Two VCs and campus unrest", 
    "subsection": "general", 
    "date": "2016-02-19"
}