{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Festival Fatigue, Thomas Vinterburg’s latest and the green-card soldiers ofSoy Nero brought to you from the theatres of Berlinale 2016\n\nFestival Fatigue. You won’t find it in the medical books, but it’s a real condition, whose symptoms include (a) the gentle drooping of eyelids some 30 minutes into a movie, (b) the mild panic that you have an hour (or three) to go, and (c) the anxious calculation of how many feet you’re going to step over if you make a bolt for the exit.\n\nFestival Fatigue doesn’t have anything to do with the actual quality of the film. Eugène Green’s Le Fils de Joseph ( Son of Joseph ; French) was turning out to be pretty good, with its story, about a boy who wants to find out who his father is, divided into chapters with appropriately Biblical titles: ‘Son of Abraham’, ‘The Golden Calf’ and so forth. But even the always welcome presence of Mathieu Amalric, who plays a slimy publisher (there’s something about that face that keeps lending itself to slimy characters), couldn’t keep me awake.\n\nIt was the same story with another French film, Dominik Moll’s Des Nouvelles de la Planète Mars ( News from Planet Mars ), which begins with Titan II blasting off in black-and-white footage, over an announcer’s excitement: “Through the magic of the camera, earthlings take their first ride into space.”\n\nThe title, however, comes from a decidedly grounded 49-year-old — it’s just that his name happens to be Phillipe Mars (François Damiens). And he just happens to be a little spaced out, having to deal with a son who’s become a vegetarian and claims he’s “sick of this castrative society,” a daughter who won’t stop studying and thinks her father is a loser (“the opposite of winner,” the son helpfully explains), and a colleague who slices his ear off with a meat cleaver. During surgery to reattach the ear, Phillipe sees his dead parents. You’d think that would be enough to keep me from eyeing the exit, but...\n\nThomas Vinterberg’s Danish drama Kollektivet ( The Commune ) was a bit of a disappointment given his earlier outings ( The Celebration and, especially, The Hunt ). Anna (Trine Dyrholm), a famous television newscaster, tells her husband Erik (Ulrich Thomsen) that she wants a change. “You’re sweet and you make me laugh, but I need to hear someone else speak.” Their solution? Invite like-minded people into their large house and live in a commune. Under the hippie surface, however, there is streak of puritanical finger-wagging — this is a be-careful-what-you-wish-for fable.\n\nWhen Erik falls for a younger woman, Anna begins to question the wisdom of her decision. She wants to be the kind of woman who will welcome her husband’s lover into their home (“we’ll work something out”), but is that kind of sharing humanly possible?\n\nAnna’s plight is wrenching, but Ang Lee’s The Ice Storm did a far better job of reminding us that our desire to be hip wanderers is often constrained by the ball and chain of society’s conservative programming.\n\nRafi Pitts’s brilliant Soy Nero (English, Spanish) begins with a laugh-out-loud anecdote about a sexual encounter between an ant and an elephant. This is another be-careful-what-you-wish-for fable, about immigrants (aka ants) who seek to acquire a green card by volunteering for military service.\n\nNero (Johnny Ortiz), who’s Mexican but who insists he’s basically from Los Angeles, crosses the border to be with his brother, who lives in a gated mansion that looks like Al Pacino’s digs in Scarface — times two . There’s a stuffed zebra. The bathroom is the size of Mexico. It’s the American dream — or is it? Soon, a white family returns from vacation, and Nero realises his brother merely works there. The embarrassed brother has to turn Nero out. Over a parting hug, he says, “Be safe, all right?” And we cut to Nero in a desert warzone, (as the brochure puts it) “fighting for his citizenship with a machine gun in his hand.”\n\nOut there, for a while, Nero — as a representative American — becomes lord and master. “Can I see some ID?” he asks locals who want to go past his station. It’s the slyest of jokes, for back in the US, Nero was the one constantly being asked the same question... by white cops. But the equations aren’t all that different. We’re still talking about brown and black soldiers doing all the dirty work under a white sergeant (who seems a distant figure), and we’re still seeing Nero being searched and cuffed after an operation goes awry. Pitts fills the soundtrack (even in the pre-war portions) with the hum of helicopters — it’s an awful omen, an even more awful reminder that you are always under surveillance", 
    "section": "national", 
    "title": "With an eye on the exit", 
    "subsection": "general", 
    "date": "2016-02-19"
}