{
    "author": [
        "Special Correspondent Zubeda Hamid"
    ], 
    "text": "Just over a year after the setting up of a multi-disciplinary health research unit at Madras Medical College, three research projects are underway, and expected to be completed by the end of 2017.\n\nThe unit, which was set up as part of an initiative by the Department of Health Research, government of India, spans 300 square metres at one of the blocks of the college and has equipment to the tune of Rs. 1 crore, necessary for research, said K. Narayanaswamy, State nodal officer for the research units.\n\n“We were given Rs. 1.25 crore by the government of India. Rs. 25 lakh was used to set up the unit, renovation and other work,” he said.\n\nThe unit aimed at encouraging and strengthening an environment of research in medical colleges and bridging gaps in infrastructure. Special focus is paid to the field of non-communicable diseases such as obesity, diabetes, cancer and cardiac problems.\n\nK. Kalaichelvi, head of the medical oncology department, is researching the prevailing molecular aberrations in gastric cancer, specifically sporadic gastric cancer and attempting to find molecular markers for it. “We get about 400 cases of stomach cancer every year at the hospital, and most come in the advanced stage. Chennai has 12 cases of stomach cancer per 1 lakh population, which is the highest among metros in India,” she said. Each research team has two scientists, two technicians and one person for data collection. Any faculty member of the college can start a research project, which is first vetted by an ethical committee, a local advisory research committee and then approved of by the government of India, he said.\n\n“Two or more departments together can also work on a project — the idea is to promote multidisciplinary work. The faculty can also collaborate with outside research institutions,” he said.\n\nEach research team has two scientists, two technicians and one person for data collection", 
    "section": "national", 
    "title": "1 year on, 3 projects under way at MMC research unit", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}