{
    "author": [
        "Dennis S"
    ], 
    "text": "A total of 548 persons from Odisha and Chhattisgarh working as bonded labourers in a brick kiln in Tiruvallur district were rescued by authorities on Wednesday. —Photo: Dennis S. Jesudasan\n\nThey are woken up at 3 a.m. every day and forced to work for hours together under the hot sun making bricks. They can’t even cite pain as a reason to stop work as a person claiming to be a doctor residing permanently at the brick kiln would administer pain killers to keep them at it, with paltry wages.\n\nAt least 548 migrant labourers, including women and children from various districts of Odisha and Chhattisgarh, rescued on Wednesday by government officials, have been victims of oppression and exploitation from day one since they arrived here.\n\nBased on a tip-off from NGO International Justice Mission (IJM), a team of officials led by Revenue Divisional Officer of Ponneri M. Narayanan conducted a raid on Sri Lakshmi Ganapathi brick kiln at Ponthavakkam village here – the second such raid in the last four years.\n\nThe documents, including the pay roll, shown by one of the supervisor does not add up to reflect the actual number of workers in the kiln. While the permission sought from the government shows a total of 455 workers in two units of the kiln, the pay rolls have only 324 of them.\n\n“They pay Rs. 400 a family per week and we have to manage everything with that. Since Malik saab does not give us food, we fight it out in nearby ration shops to get rice at Rs. 5 a kilo,” says Savitri, who was cleaning fish for lunch, which she had caught from the stream flowing nearby.\n\nThe labourer from Samalpur village in Odisha, in his late 20s, who doesn’t want to be identified, was apparently waiting for the right opportunity to expose the owner of the brick kiln. “The owner even made a pregnant woman to work. You should catch hold of him,” he says through a translator.\n\nAfter an enquiry with some of the labourers and ‘supervisors’, Mr. Narayanan accepts a case of bonded labour is made out.\n\n“The workers have been forced to work for meagre pay. They have not been allowed to go home. Even if they were, only one in the family of four was allowed to go. In one case, when the husband died while on his trip to his native, the owner had not allowed wife to for his funeral.”\n\nSix persons have been detained in connection with the case and the investigation is on.", 
    "section": "national", 
    "title": "548 migrant bonded labourers rescued", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}