{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Showcasing the martial art of Kalaripayettu. (right) An Ottamthullal performance at Tantrotsav. (Right) An Ottamthullal performance at Tantrotsav. —Photo:Special Arrangement\n\nNine-day Tantrotsav festival features classical, martial art forms and ethnic rituals\n\nPUDUCHERRY: From the swordfights of a kalaripayettu mock duel to the dulcet sound of anklets on a dancer’s feet, the Tantrotsav 2016 is resonating with classical, martial and ritual art forms.\n\nThe annual event hosted by the Hindustan Kalari Sangham at the Yogishananda Peetham, near Adi Shakti is providing an immersive experience in the realm of art and theatre to several performing artists from across India and a few from abroad.\n\nThe nine-day festival which began on Sunday is featuring residency training in the martial art of kalaripayattu, the aesthetics of manodharma in Bharatanatyam, exposure to Ottamthullal and everyday satsang sessions to discuss various aspects of music, dance and theatre.\n\nThe day starts early with kalaripayattu and Tantric yoga and ends with a late evening cultural performance of Bharatanatyam, Mohiniyattam, Odissi or Ottamthullal.\n\nThe Hindustan Kalari Sangham, which is headquartered in Kozhikode, opened its Puducherry chapter about five years ago, with one of its core objectives being the physical grooming of dancers of Adi Shakti in kalari techniques, says Lakshmanan Gurukkal, who heads the Sangham unit here.\n\nThe Sangham perpetuates Yogishananda’s Tantra tradition and a philosophy which essentially deconstructs life itself as a confluence of the cosmic symbols of Shiva (consciousness) and Shakti (energy).\n\nThese principles of consciousness and energy very much serve as the undercurrent of the Tantrotsav festival.\n\nOne of the standout experiences for participants was the Ottamthullal performance by a team led by Kalamandalam Suresh Kaliyat.\n\nA visit by the popular Oorali Express, which is a show designed around a bus with plenty of music, theatre and visuals, is expected on March 6. Oorali Express is a performance ensemble from Sadhana Centre for Creative Practice, an art collective based out of Thrissur. The fete will culminate on Mahashivaratri falling on March 7, with a full day programme featuring body practice demonstrations, conversations, dance, music, kalarippayattu, and ritual theatre performance.\n\nThe concluding day will feature meditation, discussions, temple procession to percussion rhythms, demonstrations of traditional Indian gymnastics alongside Parkour, a fast evolving modern physical training practise, and kalarippayattu. This year’s ritual art performance will feature Kandakarnan Theyyam, a ritual art once practised in Malabar to prevent outbreaks of small pox.", 
    "section": "national", 
    "title": "A confluence of arts and culture", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}