{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mayor A.P.R. Anthony Grace presented the Corporation budget for 2016-17 at an urgent council meeting convened here on Wednesday.\n\nThe budget envisaged a revenue deficit of Rs. 808.51 lakh, surplus of Rs. 789.19 lakh in water tax and Rs.79.41 lakh in education. Immediately after the budget was presented, the All India Anna Dravida Munnetra Kazhagam councillor of Ward 19, Periyasami, charged the Mayor of lethargic in translating the promise of Chief Minister to establish an integrated bus stand for Thoothukudi at a new location. However, the Mayor said that measures were being taken to construct the bus stand. But dissatisfied with the reply, the councillor walked out of the meeting.\n\nA.D. Alexander, Congress councillor of ward 52, thanked the Mayor for permitting the Thoothukudi Press Club to construct an office building on an unused land near an integrated nutritious meal centre on Palayamkottai Road.\n\nSome AIADMK councillors raised the issue of disparity in levying property tax. While the civic body collected property tax from industries at the rate of Re.1 for construction on one square feet of land, it collected Rs.3 from individuals for constructing houses. The Mayor replied that the property tax system would be overhauled. Corporation Commissioner R. Poongodi Arumaikan had not even formed a committee to revise and finalise property tax, the Mayor said. But the Commissioner said that every activity was being carried out as per norms.\n\nS. Sureshkumar, DMK councillor of ward 26, appealed to the Mayor to bring down the three-fold increase in water tax. The Mayor said that until the fourth drinking water pipeline project work was completed, the surcharge on water tax would not be levied. A. Lakshmanan, Excutive Engineer, S.M. Rakkappan, Executive Engineer, Planning and others attended the meeting.", 
    "section": "national", 
    "title": "A deficit budget for Thoothukudi Corporation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}