{
    "author": [
        "K Venkataramanan"
    ], 
    "text": "Chief Minister Jayalalithaa’s fresh proposal to release the seven convicts serving life terms for their role in assassinating Rajiv Gandhi appears to be a political gambit in an election season.\n\nHer government’s decision to remit the remainder of their life sentence using the State’s statutory powers of remission and seek the Centre’s view as required under Section 435 of the Criminal Procedure Code is a virtual repeat of what she did in 2014, a day after the Supreme Court commuted the death sentences of the seven convicts. Succeeding in this attempt to garner goodwill by getting the convicts released hinges on the Union government’s cooperation.\n\nHer earlier effort ended a failure after the Supreme Court stayed the release of the convicts following an urgent petition by the United Progressive Alliance government against the decision. Ultimately, the matter went up to a Constitution Bench, which answered some legal questions in favour of the Union government. The one difference between then and now is that in 2014, she had fixed a three-day time limit for the Centre to respond, but has set no such condition now.\n\nThe Bench had ruled that the Centre has ‘primacy’ in matters of remission requiring consultation between the two governments and that the word ‘consultation’ used in Section 435 meant ‘concurrence’. The state government has sought a review of the judgment, but given the present legal position, it is virtually impossible to release the Rajiv case convicts without the Union government’s consent.\n\nAnother impediment the State government faces is that the Supreme Court had some harsh words to say about the assassins of Rajiv Gandhi: “…we find no scope to apply the concept of ray of hope to come for the rescue of such hardened, heartless offenders, which if considered in their favour will only result in misplaced sympathy and again will be not in the interest of the society.” While it is theoretically possible that the BJP-led government may take a different view, it may feel constrained by the tenor of these words.\n\nAnother legal point that stands in the way is that the Supreme Court had noted that the power of remission can only be exercised in the statutorily prescribed manner. That is, the government has to obtain the opinion of the presiding officer of the court that delivered the death sentence. Whether this norm was complied with before the release was ordered is not clear as of now.\n\nIn political terms, questions are likely to be raised by the Opposition as to why the AIADMK government did not attempt the Constitutional route of advising the Governor to remit the life sentences under Article 161 of the Constitution (power of pardon, remission etc.) The Constitution Bench had approvingly cited earlier judgments that held that this power of the Governor and the President’s corresponding power under Article 72 were constitutional remedies that “will remain untouched”. In Ms.Jayalalithaa’s defence, it could be argued that the same Bench has also ruled that the rejection of earlier mercy petitions by Constitutional authorities will not be a bar on the State government using its remission power.\n\nEarlier, apex court had ruled that the Centre has ‘primacy’ in matters of remission", 
    "section": "national", 
    "title": "A political gambit that risks legal hurdles again", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}