{
    "author": [
        "S Sundar"
    ], 
    "text": "Through 50 expos to be conducted across the country by July\n\nT.N. Venkatesh, Managing Director, Co-optex, looks at a new design sari at an outlet in Madurai on Wednesday.— Photo: R. Ashok\n\nCo-optex has set a target of Rs. 5 crore through sale of its “cool comfort” cotton saris through 50 exhibitions to be conducted across the country by July this year.\n\nTalking to The Hindu here on Wednesday, its Managing Director T.N. Venkatesh said that the last year sale was for Rs.3.3 crore through 44 such exhibitions held during from February to July, considered a lean period for sale.\n\nThe cooperative body has procured over 47,000 saris from its 12 cotton clusters across the State. Among them, 12,000 saris had been procured from Madurai region comprising Madurai, Ramanathapuram, Theni, Virudhunagar, Sivaganga and Dindigul.\n\nThe Co-optex had roped in young designers who had passed out of National Institute of Design, Ahmedabad, to produce a series of colours for pan-India appeal. “We want to sell our products in any part of the country,” he said.\n\nTalking about the drastic changes made in the cotton varieties, he said that besides a wide variety of designs, high standard had been maintained in the quality of yarn. “This gives a longer life for our cotton saris,” he added. “We have introduced a blend of classic but contemporary designs,” he said.\n\nStating that its clientele still hold Co-optex for its authenticity and originality for handloom saris, Mr. Venkatesh said the new designs had attracted young college-going and office-going women.\n\n“Our cotton saris have become an office wear even for IT professionals,” he said. The Cotton saris varieties from Dindigul and the Chettinad variety from Karaikudi were famous among the cotton saris.\n\nThe exhibitions that started on February 20 have so far covered Vijayawada and Baroda.\n\nThe saris were priced between Rs. 750 and Rs. 2,500 out of which 40 to 50 per cent went as wages for the weavers.\n\nHe said that an additional sale for Rs. 35 lakh was possible for the Co-optex through its online portal. “People are showing interests to buy silk saris, especially from the US, Dubai and Muscat,” he added.", 
    "section": "national", 
    "title": "Co-optex fixes Rs.5-crore target for sale of cotton saris", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}