{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Niligiris Collector P. Sankar (second right) releasing the annual credit plan at the Collectorate in Udhagamandalam on Wednesday. (From right) Lionel Benedict, Chief Manager State bank of India, Udhagamandalam, K. Arivalagan, lead bank manager, and C. Sankara, Manager, Canara Bank, Udhagamandalam, are in the picture.\n\nLoans extended by banks to the priority sectors in Coimbatore District will be 17.27 per cent more in 2016-2017, according to the Annual Credit Plan released by Coimbatore District Collector Archana Patnaik here on Wednesday.\n\nThe total credit outlay for the next financial year is estimated to be Rs. 14,249 crore, which is Rs. 2099 crore more than the outlay for the current year. The district has already exceeded the credit outlay projected for the current financial year.\n\nIn 2016-2017, the MSME sector (Micro, Small and Medium scale Enterprises) is expected to get almost 24 per cent more loans than what it received this year. The outlay for 2015-2016 for this sector is Rs. 5,028 crore and for next year it is Rs. 6,233 crore. Advances given to the medium-scale industries are now classified as priority sector. Since Coimbatore has a large number of MSMEs, the outlay is higher.\n\nIn the case of agricultural sector, the outlay for next fiscal is Rs. 5,742 crore, which is nearly 12 per cent increase (Rs. 5,127 crore for the current year). The focus will be on horticulture crops, agri bio-tech projects, green house, minor irrigation, wasteland development, warehouses and cold storage facilities, agri marketing infrastructure, agro and food processing, farm mechanisation, and minor irrigation systems.\n\nThe credit plan allocation for the other priority sectors is Rs. 2274 crore for 2016-2017, which is almost 14 per cent more than the allocation for the current year.\n\nAccording to Coimbatore District Lead Bank Manager K. Krishnamoorthy, the plan has been prepared taking into account the potential linked credit plan, the new priority sector guidelines, infrastructure facilities available, recovery climate and government schemes. The thrust areas are watershed management, wasteland development, and self help groups. There will be cluster approach for pumpset, knitwear and coir industries.\n\nReleasing the annual credit plan, the Nilgiris District Collector P. Shankar said of the total outlay, priority sector loans are expected to be Rs. 2,170 crore during 2016-2017. Of this, loans to the agricultural sector will be to the tune of Rs. 1,555 crore, to the MSMEs it will be Rs. 345 crore and for other priority sectors it will be Rs. 270 crore. In order to achieve the quarterly targets, banks should extend loans for education, agriculture, housing and industrial segments.", 
    "section": "national", 
    "title": "Credit outlay for Coimbatore district up by 17.27 p.c.", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}