{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "The Fast Track TaskForce set up by the Department of Electronics and IT (DeitY) wants the Tamil Nadu government to come up with a suitable package to revive the Nokia facility at Sriperambudur, near Chennai. The team met State Industries Minister P Thangamani on Wednesday.\n\n“We want the Tamil Nadu government to come up with an action plan soon because in the last one year 35,000 jobs have been created in the mobile manufacturing space in India. If this facility was functional we could have created a substantial amount of job opportunities here too,” said Pankaj Mohindroo, national president, Indian Cellular Association (ICA), who is also the Chairman of the Fast Track TaskForce (FTTF). “We had a meeting today and we are hopeful the state would revert soon. We don’t want Tamil Nadu to miss the bus,” he added.\n\nIndustries Minister Thangamani has informed the DeitY team that he would convene a meeting and would reach out to them soon. Officials from the Industries department could not be reached for comments.\n\nIt’s been exactly one year since Prime Minister Narendra Modi announced that the Nokia Chennai plant would be revived. The Prime Minister had then said, “Let me assure you. We have started efforts in this direction (to reopen the unit). The result of this effort will be that in the coming days, Nokia plant should start functioning again and people will get employment.”\n\nPost the announcement a committee was formed to revive the facility. In October 2015, the committee sent a letter to the Tamil Nadu government in which it had requested the State to clear the decks for a clear resolution to transfer title from Nokia to the ultimate buyer. It had also requested for a VAT exemption, 20 per cent capital subsidy and stamp duty waiver. The State government had designated IT Secretary TK Ramachandran as member of the FTTF to look into this issue.\n\nTheNokia plant in Chennai was set up in 2006 and during its peak, the plant employed over 9,000 employees.", 
    "section": "national", 
    "title": "DeitY team wants State to act fast on Nokia", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}