{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "Students of Nritya Ranjani Fine Arts, Mumbai, mesmerising the audience with their performance at Tamilisai Sangam's anniversary celebrations in Madurai.— PHOTO: R. ASHOK\n\nWith sure footwork, lithe movements and a bright smile Revathi Srinivasa Raghavan sailed across the stage, displaying an excellence in nritta, nritya and abinaya aspects of classical dance on the seventh day of Tamilisai Sangam’s 41st anniversary celebrations on Tuesday. “Mudatkarartha modakam,” the well known shloka by Shankaracharya, provided the music for the first dance. Agasthiar, the ancient Tamil poet’s “Srichakraraja” was well presented by the dancer.\n\nThe drama in “Vanam Sendrane,” a translation of Tulasidas’ Ramayana, was brought out by the dancer taking on several roles such as those of Kaikeyi, Dasaratha, Rama, Lakshmana and Sita.\n\n“Chinnanchiru kiliye” ended with “Araro Ariraro”, showcasing mother’s love in all its depth. Her portrayal of various poses of Neelakanta to the panchakshara stuthi of Shankara to a variety of talas by the kanjira and mridangam had the rasikas spell bound.\n\nG.R. Praveen who had provided life to the lyrics with his singing ended the performance with a salutation to Maha Periyava, “Arindum”.\n\nHe was well supported by Sri Muruganandam on the violin and Devaraj on the flute. The percussion skills of Satish Krishnamurthy, alternatively on the mridangam, kanjira and konnakol, impressed those assembled.\n\nAt the end of her performance, the dancer took on the role of vocal percussionist to the next programme of the day.\n\nBakthi Pravaham\n\nEight students of Revathi Srinivasa Raghavan, from Nritya Ranjani Fine Arts, Mumbai, namely, Sruthi Kannan, Tejasri Bolubi, Maduvanthi Srinivasa, Divya Balachandran, Thayathvini Nirmal, Gayathri Santosh, Sanchana Senapathi and Mikika mesmerised the stage with an overflow of pure devotion with their performance titled Bakthi Pravaham.\n\nTheir first obeisance was to “Sri Vignarajam” through a pushpanjali in arabi set to adi talam. The dancers portrayed a dancing Ganesha with his ears swaying and his face filled with grace.\n\nThey acknowledged the spiritual power of Tamiliasai by dancing to one of the most popular compositions of Arunagirinadhar, “Mutthaithiru” in misrachapu, in which they depicted Lord Shiva, glorious and resplendent with 12 arms. Lord Narayana on Adisesha appeared on stage, as the choreographer had chosen unusually to present alarippu to the lyrics beginning “Sriman Narayana” by Annamacharya.\n\nDurga vanquished Mahishasura to the tunes of Ayigiri Nandini, and the other songs to which the young dancers performed include, “Maha Deva”, “Govinda Kuzhalosai” and “Dolayam.”\n\nThe mudras, adavus, and abhinaya of the young dancers were impressive and showed their commitment to excellence.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Displaying excellence in classical dance", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}