{
    "author": [
        "S Senthalir"
    ], 
    "text": "A group of musicians, theatre artistes, professionals and dancers move to the rhythm as they express nuances of ‘bhava’.\n\nThey were exploring the aesthetics of Manodharma in Bharatanatyam at the ‘Rasabharati’ workshop as part of the annual Yogishananda Peetham’s Tantrotsav 2016 near Adi Shakti on Edyanchavadi Road in Auroville.\n\nEminent Bharatanatyam exponent, educator and vocalist Rajashree Warrier, who is conducting the workshop, says: “This is about understanding the rhythms in the body and improvisation.”\n\nShe adds: “Whoever performs should have rhythm and that rhythm is what elicits ‘bhava’. They express ‘bhava’ through their body and the audience experiences ‘rasa’. That is the essence of any Indian classical dance.”\n\nThe workshop that began on February 28 will end on March 7. “Everyday the workshop is evolving. First, the participants were taught ‘thala’ structure to understand the rhythm structure properly in order to express ‘bhava’ effectively. One has to go through different time measures to get it adapted in their body,” says Rajashree, recipients of the Kalasree Title and the Kerala Sangita Nataka Academy award for Bharatanatyam.\n\nShe is also a Carnatic vocalist, who has been awarded doctorate in music by Kerala University for her research in Varnas in Dual Forms.\n\nThe majority of the participants at the workshop were not professional dancers. “I am not teaching Bharatanatyam, but trying to bring out Manodharma in the best possible way. Whatever you need to speak out, your body speaks automatically. I am only trying to fine tune. Everything needs to be benefitting and complementary,” she says.\n\nShe incorporates theatre in her dance performance. She has presented Lankalakshmi , a play written by C.N.Sreekantan Nair as a thematic dance solo recital, essaying several roles of mythical characters Ravana, Hanuman, Sita, Lakshmana, Surpanaka and Vibhishana.\n\nFor her, this workshop has surprisingly turned out to be a learning process. “I am not working with Bharatanatyam dancers and this has been a learning experience in itself,” she says. Arianna Romano, an Italian contemporary dancer, who is attending the workshop, said that she was introduced to Bharatanatyam after coming to Auroville. “It is an enriching experience understanding the aesthetics of Manodharma in Bharatanatyam. I love to learn this dance form till my stay in India,” she says.\n\nLavanya Rao, a media professional from Karnataka says that there is a lot that was being decoded during the workshop. “We are totally enjoying it. It is such an intense group and the energy levels are high and we are progressing by the day. It is about getting rhythm pattern into the body itself, which I have never learnt earlier in classical dance. We are getting to the depth of what Manodharma is by exploring it ourselves,” she says.\n\nI am not teaching Bharatanatyam, but trying to bring out Manodharma in the best possible way", 
    "section": "national", 
    "title": "Exploring aesthetics of Manodharma", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}