{
    "author": [
        "D Madhavan"
    ], 
    "text": "Cultivation of jasmines and marigolds has begun early due to availability of water after rains\n\nThere is no sign of the morning sun on the horizon, but a group of women are already at work on a three-hectare-farmland in Thirukkandalam village, near Red Hills. They pluck jasmine and a few hours later, will be heading to the Koyambedu Wholesale Market to sell these flowers.\n\nThe jasmine has clearly arrived early. It’s only in June–July every year that jasmine will be ready to be plucked.\n\nThe heavy rains in December last year have created a conducive environment for starting cultivation of these flowers early. Since early January, a variety of flowers including jasmine, marigold ( samandi ), firecracker flowers ( kanagambaram ), country rose, tube rose, and cox comb, are being cultivated in small patches of land between large tracts of paddy fields in the northern and western areas of Chennai that border neighbouring Tiruvallur district. These areas include Manjakuppam, Movur, Morur Kandigai, Monnvedu, Monnavedupettai, Othapai, Krishnapuram, Rangaravam, Venkatapuram, Velammakandigai, and Thiruvalankadu.\n\n“Unlike paddy, flowers can be cultivated in a small area with just family members involved in the work. The November – December 2015 rains filled our wells, and there is enough water to irrigate our fields for an entire year now,” said 52-year-old Thangammal, a jasmine cultivator in Movur village near Avadi. Farmers hold only small parcels of land that are anywhere between three and seven hectares. And, whole families are engaged in flower cultivation.\n\n“As most flower cultivators are small farmers, the rains helped save on the costs of digging more borewells,” an official with the Department of Horticulture and Plantation Crops told The Hindu.\n\nHorticulture officials said that 14 agriculture extension centres in the district covering major cropping areas like Gummudipoondi, Poonneri, Red Hills, Uthukottai, Tirutani, Pallipattu and Tiruvallur have been coordinating with flower cultivators to ensure modern irrigation methods reach them.\n\n“All the jasmine sold at Koyambedu wholesale market is said to come from Tiruvallur district. In fact, except for ‘Bangalore’ roses, which come from Hosur in Krishnagiri district, all the flowers come from Tiruvallur district every day,” said P.K. Krishnan, a flower trader in Koyambedu.", 
    "section": "national", 
    "title": "Flowers bloom early on the outskirts", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}