{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Could the trillions of bacteria in our gut hold the key to understanding why some people get diabetes and also offer a potential cure?\n\nTo find out, doctors in India and Denmark are collecting samples of stool from about 900 people in both countries, extracting DNA from it and studying it — to figure out for instance, if Indians have more aggressive gut bacteria leading to insulin resistance, or how diverse the bacteria are, and how they are affecting the health of people.\n\nThe study called ‘Microbdiab’— jointly funded by the Danish government and the department of biotechnology, government of India — is a collaboration between three organisations in India, including Dr. Mohan’s Diabetes Specialties Centre, as well as the University of Copenhagan.\n\nThe stool samples are from people who are pre-diabetic, diabetic and normal — 450 samples in each country.\n\nOluf Pedersen, professor of molecular metabolism and metabolic genetics, faculty of health and medical sciences, University of Copenhagen, Denmark, says, “Gut bacteria produce thousands of compounds that enter the bloodstream, are circulated to all organs, and have an impact. Studies have shown they impact the brain too. They can cause diabetes or lead to obesity.\n\nDifferent disorders\n\nThey have enormous capacity for inducing different disorders. Is there a role for gut bacteria in the development of pre-diabetes and type 2 diabetes and is there a universal gut bacteria that’s contributing to causing diabetes worldwide — these are some of the questions we are studying,” said Prof. Pedersen.\n\nProf. Pedersen was presented the 25th DMDSC Gold Medal Oration Award on Wednesday. Research has indicated that certain gut bacteria are linked to type 2 diabetes, but whether they are innocent bystanders or part of the causation is yet to be explored, he said.\n\nThe Microdiab study began a year ago, and is expected to come up with findings in about six months or so, said R. M. Anjana, joint managing director of the Centre.\n\nIndians could have less good bacteria or less diverse bacteria or more bad bacteria, said V. Mohan, chairman of the Centre.\n\nThe Indian diet could be a contributing factor, as diet affects gut bacteria.\n\nProf. Pedersen, in previous research, has been able to show that those who have more diverse gut bacteria are protected from various diseases like type 2 diabetes and obesity, he said.\n\nEventually, the goal would be develop prebiotics or probiotics, to help good bacteria flourish so as to prevent type 2 diabetes, said Prof. Pedersen.\n\nHis research has shown that even monozygotic twins have different gut bacteria.\n\nElaborating on his experiments, he said injecting the gut bacteria of an obese mouse into a germ-free mouse could make the latter obese.\n\nInjecting a lean mouse’s gut bacteria into a germ-free mouse led to the mouse remaining lean — showing that gut bacteria could influence obesity\n\n900 stool samples will be taken from people who are pre-diabetic, diabetic and normal in India and Denmark", 
    "section": "national", 
    "title": "Gut bacteria could help understand diabetes better", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}