{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "An individual secretary to the government cannot be punished under the Contempt of Courts Act, 1971 for non-compliance of orders involving a policy decision of the State government, the Madras High Court Bench here has held.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam passed the order while dismissing a contempt petition moved against School Education Secretary D. Sabitha for the delay in enacting a comprehensive legislation to govern all types of schools in the State.\n\n“In a matter pertaining to a policy decision of the government, regarding framing of a comprehensive Act, the Secretary to the government, School Education Department, in her personal capacity, cannot be said to have committed contempt,” the Division Bench said. The contempt plea had been moved by 86-year-old T.N. Vidyanandan, a retired headmaster, who had been filing a series of cases for over a decade against deprivation of statutory right of appeal, against punishments, to teachers working in government-aided minority schools.\n\nHe had now accused the School Education Secretary of not complying with a direction given to her by another Division Bench on February 9 last year to take necessary steps for enactment of a comprehensive law, covering all kinds of schools in the State, within six months.\n\nOpposing the petition, Special Government Pleader (SGP) VR. Shanmuganathan said the School Education Department had constituted a seven-member expert committee led by educationist K. Aludiapillai on November 23 to offer its opinion on framing the new legislation.\n\nStating that the committee comprising Law Secretary S.S. Poovalingam, Director of School Education, Director of Elementary Education and Director of Matriculation Schools, had met twice so far, the government contended that there was no wilful disobedience of court order passed on February 9 last.\n\nAccepting his submission, the Division Bench led by Mr. Justice Manikumar said: “The issue of framing of a comprehensive Act to govern all private schools, in the light of the uniformed system of education, requires a study of all the Acts governing school education and it requires time.”", 
    "section": "national", 
    "title": "High Court ruling on punishing government secretaries for contempt", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}