{
    "author": [
        "S Poorvaja"
    ], 
    "text": "App to help locate an e-toilet. The city has 188 e-toilets\n\nIn a step towards ensuring that provisions made for better sanitation are optimally used, Eram Scientific Solutions — the company which has installed electronic toilets (e-toilets) across the city — launched an app on Monday to make it easy for people to locate these e-toliets. The app, which can run on both android and iOS platforms on mobile phones, helps users find the nearest e-toilet. Currently, 188 e-toilets are currently located in the city including at Broadway, Beach Road, Anna Nagar, R.A. Puram. Ramakrishna Mutt Road, Taramani, Thiruvanmiyur and Velachery.\n\nK Anvar Sadath, CEO, Eram Scientific Solutions Private Ltd, said while launching the app they hoped to have more e-toilets across the city. “While 110 are currently functioning, the rest need to be provided with electricity and water connections by the Greater Chennai Corporation,” he said.\n\nThe per-fabricated e-toilets, which are self-cleaning, have sensors that enable automatic pre- and post-use flushing as well as automatic floor-cleaning at fixed intervals. The stainless steel structure, which occupies a space of 35 square feet, have LED lights and Fans which switch on when a person enters. While most toilets come with a small sewage treatment plan, toilets that have access to a drainage system are connected there. “Chennai has the highest number of e-toilets in the country. While most other cities we work with charge people per use with a coin machine, we generate advertising revenue by selling space which will be divided between the Corporation and us,” Mr. Anvar explained.\n\nBack-end alerts engineers about maintenance needs\n\nThe e-toilet app also gives users the option of sending feedback about the cleanliness of the toilet and connecting with the company about probable areas where e-toilets need to be installed.\n\n“For our service engineers, we have a back-end system where we are notified about the daily usage of the toilets in different areas. They are constantly monitored and tracked and if we see that a toilet is not being used by anyone for over five hours, we send our engineers to the spot to see if there is any problem,” an engineer with the company said.\n\nWhile the eastern-style toilets are now being installed at a cost of Rs 3.7 lakh per unit, Eram Scientific is developing prototypes for e- toilets for women, which will have sanitary napkin dispensers and incinerators, as well as e-toilets for the differently-abled.", 
    "section": "national", 
    "title": "Improving sanitation through technology", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}