{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Jewellery shops remain closed in Tirunelveli Town and Tuticorin (right) on Wednesday.— Photos: A. Shaikmohideen and N. Rajesh\n\nCondemning the Centre’s proposal to levy one per cent excise duty on gold ornaments, jewellers across south Tamil Nadu commenced a three-day strike on Wednesday.\n\nOver 650 jewellery shops across Tirunelveli district, including 450 shops in Tirunelveli and Palayamkottai, downed shutters as a mark of protest. Almost all goldsmiths closed their units in support of the protesting jewellers.\n\nNagercoil\n\nOver 3000 small and big jewellery shops and 10,000 goldsmiths across Kanyakumari district struck work as part of the three-day strike.\n\nP. Narayanamurthy, secretary, Jewellers’ Association of Kanyakumari District, told The Hindu that the proposed excise duty would affect the middle class and poor people, as they would have to shell out at least Rs. 250 per sovereign of gold ornaments. It would be an additional burden imposed on small buyers, besides the one per cent Value Added Tax, he said.\n\nTightening the noose on gold purchase through various measures would deny the opportunity to poor people to buy gold for their daughters’ marriage, Mr. Narayanamurthy said.``In the event of the Union government not withdrawing the announcement, we will decide the next course of action after three days,’’ Mr. Narayanamurthy said.\n\nEarlier, on February 11, the jewellers had closed shop protesting against the mandatory reference to PAN for purchase of gold jewellery worth Rs. 2 lakh and above.\n\nDindigul\n\nMore than 250 jewellery shops and 1,000 jewellery making units in Dindigul and 200 jewellery showrooms in Theni downed shutters, condemning the imposition of one per cent excise duty on gold jewellery.\n\nThe Main Road in Dindigul wore a deserted look owing to the bandh by jewellers. Jewellers, who staged a demonstration, raised slogans against the Centre, demanding the withdrawal of the announcement made in the budget. Jewellery sale worth Rs.10 crore would be affected in the district, said jewellers. All jewellers in Theni too downed and held a demonstration.\n\nRamanathapuram\n\nAbout 1,500 jewellery shops in Ramanathapuram and Sivaganga districts downed shutters on Wednesday. Gold and silver jewellery merchants’ associations in the two districts closed down shops, also urging the Centre to increase the gold purchase limit to Rs. 10 lakh for making PAN card mandatory.\n\nAssociation general secretary B Parthiban said that a similar excise duty was levied by Pranab Mukherjee when he was the Finance minister but rescinded the same after the jewellers launched a nation-wide agitation. He said that the levy of excise duty had come at a time when the jewellery merchants were fighting against the Centre’s decision to make PAN card mandatory for gold purchases of more than Rs. 2 lakh.", 
    "section": "national", 
    "title": "Jewellers go on strike against move to levy excise duty", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}