{
    "author": [
        "Aditi R"
    ], 
    "text": "1500 residents in the resettlement colonies of Kannagi Nagar signed and submitted a petition to the CM Office on Wednesday, requesting the authorities waive off the maintenance charges. Residents claim that they have not been able to pay the sum, due to joblessness.\n\n“If you look around you can find that most people here have no jobs, and are debt-ridden. Our dues are getting piled up day after day. We really need help,” said Stephen Raj, a resident of Kannagi Nagar who in the year 2005 was allotted a house under Emergency Tsunami Reconstruction Porject (ETRP).\n\nThe tenements were built exclusively to resettle slum dwellers residing in the city. Over the years, the settlement at Kannagi Nagar has steadily grown from an initial size of 3000 houses to over 15,000, another 6000 are under construction under JNNURM.\n\nAccording to a survey by the Information and Resource Centre for the Deprived Urban Communities (IRCDUC), 79.3 percent of those resettled had lost their jobs immediately after relocation due to the increased distance to their places of work.\n\n“Ever since we moved in here, we are going through many ordeals. With no jobs in hand, it has become very difficult to afford these houses, which were rightfully allotted. It puts us in a very vulnerable position,” said Kavitha R, a domestic worker from Kannagi Nagar.\n\nEach family has to pay Rs 150 to Rs 250 as a monthly installment for their flat for a period of 20 years depending on the year of allotment under the TNSCB ‘Hire Purchase Scheme’.\n\nOnly the houses constructed under ETRP and CMRL are free, but the sale deed has not been issued for the same.\n\nSale deed sought\n\nHowever, officials say residents will have to pay the maintenance cost and that issuing sale deed at this point would only encourage them to sell the tenements.\n\n“If we give them the deed, they will sell the houses and go back to the slums. That is why we have asked them to wait for few more years. For their own good,” said a senior from the TNSCB.\n\nOfficials said if they gave sale deeds to residents, they would sell their homes and return to slums", 
    "section": "national", 
    "title": "Kannagi Nagar residents want maintenance fee waived off", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}