{
    "author": [
        "R Srikanth"
    ], 
    "text": "The grievance meetings organised by the Tamil Nadu Generation and Distribution Corporation (Tangedco) at various Executive Engineer offices in the city and suburbs received less than 50 complaints from the residents. The consumer base of Tangedco is around 35 lakh in the city.\n\nA senior official said about 40 complaints were received from the domestic consumers covering north and south regions. While the north region, comprising 11 Executive Engineer office divisions, received 13 complaints, the south comprising six EE divisional offices, received 27 complaints.\n\nA senior official of city south region said most of the 27 complaints received pertained to low voltage, replacement of damaged poles, defective meters, replacement of conductors and cables and billing issues.\n\nTransformer installed\n\nComplaints were received from Tambaram division about low voltage problems in Chromepet area. A local official of Chromepet division said residents in Elumalai Street, Radha Nagar had been complaining about low-voltage fluctuations and so a transformer was installed within a few hours.\n\nSimilarly, a senior official of Tangedco’s Central region said five complaints were received from four divisions comprising Anna Salai, T. Nagar, Egmore and Mylapore. Of the five complaints pertaining to electricity billing and defective meters, three were from Egmore and two from Mylapore.\n\nNo complaints were received in Anna Salai and T. Nagar.\n\nIn the West region, six complaints were received from Anna Nagar, Ambattur and Avadi areas; five from the areas of Tondiarpet, Vyasarpadi, Perambur and Ponneri were registered.\n\nStrengthening networks\n\nA senior official of Tangedco said that the distribution network in various parts of the city, particularly T. Nagar, Anna Salai, Mylapore and Egmore, had been strengthened by installing transformers and pillar boxes to prevent low voltage fluctuations and power cuts due to a spike in demand for electricity.\n\nThe official said the 40 petitions had been marked to the local officials with instructions to rectify the problems within three days and also to intimate the petitioners without fail.\n\nOfficials have been asked to rectify problems within three days and inform petitioners", 
    "section": "national", 
    "title": "Less than 50 complaints received at Tangedco meet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}