{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Harivamsam’ by V. Govindarajan, Railway Colony, 7.30 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Thayumanavar’ by D. Sundarakannan, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Tirukkural’ by S.P. Balakrishnan, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nTamil Isai Sangam: 41{+s}{+t}annual Tamil music festival; Tirumurai music by Pon. M. Muthukumaran and Pon. M. Muthuvinayagam, 5.15 p.m.; vocal concert by S. Mahathi, Raja Muthiah Mandram, 6.45 p.m.\n\nGENERAL\n\nYadava College: R. Ilango, former Vice-Principal, Vivekananda College, speaks on ‘Personality development in the eyes of Swami Vivekananda,’ S. Dhanasekaran, Principal (in-charge), presides, T. Rajendran Auditorium, 10.30 a.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, Kallampatti, 2.30 p.m.\n\nCSI College of Arts and Science for Women: NSS camp, Chettikulam, 10 a.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: 12{+t}{+h}Graduation Day; V. Balachandran, Registrar (in-charge), Alagappa University, addresses, Poovanthi, 4 p.m.\n\nK.L.N. College of Engineering: M. Swarnalatha of HCL TSS inaugurates ‘Dreamz 2016,’ talent meet; K.N.K. Ganesh, secretary, presides, PG Conference Hall, 10 a.m.\n\nFatima Michael College of Engineering and Technology: R. Selvaraj, Principal Scientist, Central Electrochemical Research Institute, inaugurates workshop on ‘Writing research paper and project proposal,’ M. Stalin Arockiaraj, chairman, presides, Sivaganga Road, 10 a.m.\n\nBethshan Special School: Meeting to felicitate B. Nagavel of Kalyani Honda, State-level Best Employee awardee; D. Gunashekar, president, Rotary Club of Madurai Metro, speaks, 188 Vakkil New Street, 11 a.m.\n\nMadurai Productivity Council: Panel discussion on ‘Central Budget 2016-17,’ C. Muthuraja, Dean, The American College, moderates, 52 TB Road, Mahaboobpalayam, 6.15 p.m.\n\nAlcoholics Anonymous: Meeting, Rosary Church, Town Hall Road; Kalangarai Vilakkam Church, Anuppanadi; and Dheep Hospital, K. Pudur, 7 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}