{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Southern Railway is expected to get around 200 coaches of various classes by the end of the next fiscal. —File Photo\n\nCoach Factories have stepped up production of Linke Hofmann Busch (LHB) coaches after the policy to migrate from conventional to LHB coaches has gained pace, thanks to the intervention of Railway Minister Suresh Prabu.\n\nAccording to railway sources, the production of LHB coaches suffered a slowdown in the last two years. Instead of phasing out conventional coaches and rolling out LHB coaches, the coach factories were working the other way. It was only after the intervention of the Railway Minister that the making of LHB coaches gained momentum.\n\nSouthern Railway is expected to get around 200 coaches of various classes by the end of the next fiscal enabling the zone to introduce more of full LHB rakes on popular sectors. On Monday, full LHB rakes, including Air-Conditioned coaches, were introduced between Chennai and Mangalore.\n\nLHB coaches that are built on German technology are considered safer and comfortable compared to the conventional coaches.\n\nIn some trains there is hardly any time for maintenance in terms of cleanliness and safety. For instance, the Madurai-Chennai Vaigai Express arrives here at 2.40 p.m. and the same leaves to Tiruchi as Pallavan Express at 3.45 p.m. Similarly, the Sapthagiri Express runs between Chennai and Tirupati without much cleaning because there is little time at either ends. “There is hardly any time to clean the coaches. As soon as the trains enter the platform, passengers rush into the coaches and keep their baggage,” a senior railway official said.\n\nThe Navajeevan Express that arrives from Ahmedabad is run to Coimbatore as Cheran Express within a few hours. “Going by safety guidelines, a rake once turned out from a pit line has to be examined after 3,500 kms…there cannot be any compromise on quality of examination and repairs. Any laxity in examination is detrimental to the quality, reliability and safety in operation. But the Navajeevan / Cheran Express runs more than 4,500 kms which is a compromise on safety,” a senior official said.\n\nSince rake maintenance is essential after 3,500 kms of running, the Southern Railway had sent a proposal to Western Railways to create pit line facilities for Navajeevan Express at Ahmedabad, the official said adding that the issue remains unresolved.", 
    "section": "national", 
    "title": "Making of LHB coaches picks up steam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}