{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Navalpakkam Narasimhan, Shirdi Sai Baba Temple, 16{+t}{+h}St., Thillaiganga Nagar, Nanganallur, 6.30 p.m.; Nagai Mukundan, Gagai Kondamandapam, Triplicane, 7 p.m.\n\nLalitha Trishati: V. Abhiramasundaram, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 7 p.m.\n\nThirupugazh: Mathivannan, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.\n\nAdaiyaalam: Kidambi Narayanan, Anjaneyar Sannidhi, Nanganallur, 6.30 p.m.\n\nPanchapadika: R. Manidravid, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nVedanta Treatise: R. Aravindan, C Flat, Harmony, 20/39, Venkatrathinam Nagar, Adyar, 6.45 p.m.\n\nTyagaraja Mahima: Buddhidananda, Ramakrishna Math, Mylapore, 4.45 p.m.\n\nGENERAL\n\nZoological Survey of India: Centenary celebration and seminar on Faunal Diversity of Eastern Ghats and Western Ghats, Governor K. Rosaiah participates, Madras School of Economics, Gandhi Mandapam Rd., Kottur, 11 a.m.\n\nDr. MGR Janaki College of Arts and Science for Women: Graduation Day, Andhra Pradesh and Telangana Governor E.S.L. Narasimhan participates, Narada Gana Sabha, T.T.K. Rd., Alwarpet, 11 a.m.\n\nWater Today: Inauguration of anniversary edition of Water Expo 2016, Chennai Trade Centre, Nandambakkam, 10 a.m.\n\nMadras Progressive Writers and Authors Association and Indian School of Social Sciences: Seminar on ‘Attack on JNU and the question of Nationalism and sedition’, ICSA Centre, Pantheon Rd., Egmore, 6 p.m.\n\nAdvertisting Club, Madras: Conferment of ‘Distinguished Service Award’ to CMD, Srinivasan K Swamy, for his contribution to the advertising industry, Taj Club House, Anna Salai, 7 p.m.\n\nTamil Manila Pengal Iyakkam; Arogya Agam – Theni District; and Centre for Child Rights and Development: Consultation meeting on ‘Status of child marriages in Tamil Nadu laws and challenges’, ICSA, Pantheon Rd., Egmore, 10 a.m.\n\nRajaji Centre for Public Affairs: Discussion on ‘Union Budget’, PS HSS., Mylapore, 6 p.m.\n\nSRM University: Inauguration of cultural festival ‘Smilan ‘16’, Kattankulathur, 4 p.m.\n\nHindustan Institute of Technology and Science: Lecture on ‘Developing Innovative IoT Smart Sensor Technologies for High-impact Applications’, Padur, 2.45 p.m.\n\nRajiv Gandhi College of Engineering: Inauguration of cultural programme ‘PETROEXPRO ‘16’, Sriperumbudur, 9.30 a.m.\n\nAlpha College of Engineering: Management meet ‘ENTHRAL 2016’, Thirumazhisai, 9 a.m.\n\nD.B. Jain College: Programme on ‘Jain IT Vista 2016’, Thoraippakkam, 1.30 p.m.\n\nMeasi Institute of Management: Discussion on ‘An Analysis of Indian Budget 2016-17 and its impact on the economy’, Peters Rd., Royapettah, 11 a.m.\n\nInstitute of Chartered Accountants of India: Meeting on Union Budget 2016, Rama Rao Kalamantap, Karnataka Sangha, Habibullah Rd., T. Nagar, 6 p.m.\n\nPeriyar Library Reader’s Circle: Meeting, Periyar Thidal, Vepery, 6.30 p.m.\n\nNarcotics Anonymous: Meeting, Keep It Simple Group, St. Joseph High School, Vepery, 7 p.m.\n\nAl-Anon: Meetings, Divine School, Perumal Koil St., Pudur; CSI Inbarasu Aalayam, Tollgate; Puthiya Shakthi Group, Ezhil Nagar 3{+r}{+d}St., Kodungaiyur; Santhome Boys HSS., Santhome; and Philomina MHSS., Injambakkam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Church of Christ, Anna Nagar; Chennai School, Arunachalam St., Chintadripet; Victory Child Development Centre, Muthalamman Koil St., Selaiyur; Church of Victorious Cross, Jawaharlal Nehru Salai, Ashok Nagar; St. Joseph Church, Cholapuram Rd., Ambattur; St. Sebastian Church, Madhavaram; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; C.S.I. Church, Thiruvottiyur; and Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "MRR/CHENNAI TODAY FOR MARCH 03 (THURSDAY) FOR CHENNAI CITY FOR PAGE 4", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}