{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The new structure will come up parallel to the existing bridge\n\nA new bridge will be built parallel to the existing one across the Koraiyar on Dindigul Main Road in Tiruchi. The foundation stone for the work was laid through videoconferencing by Chief Minister Jayalaliathaa in Chennai on Tuesday.— PHOTO: A. MURALITHARAN\n\nA new two-lane bridge would be built across the Koraiyar river on the city stretch of the Tiruchi-Dindigul Highway.\n\nThe bridge would be in addition to the existing narrow bridge across the river. The need for a new bridge had become a felt need after the city stretch of the highway was widened recently from Ponnagar to Kallikudi, from where the national highway (NH 45) has been widened to a four-lane road by the National Highways Authority of India.\n\nChief Minister Jayalalithaa on Tuesday laid the foundation stone for the bridge that is to be built at a cost of Rs. 4.90 crore under the Comprehensive Road Infrastructure Development Programme. The State government has sanctioned Rs. 101.56 crore for taking up various road development work in the district in 2015-16 under the Comprehensive Road Infrastructure Development Programme (CRIDP) and the construction of the bridge is one of the 129 works taken up as part of the programme.\n\nAccording to sources in the Highways Department, the new bridge with a width of 7.50 metres would be built adjacent to the existing bridge and cater to traffic on one direction. The existing bridge, highways officials said, was in a good condition and would be retained for traffic on the other direction. The new bridge would run for 105 metres and was intended to remove the bottleneck at the narrow bridge across the river near Dheeran Nagar.\n\nLocal residents point out scores of residential colonies and a slew of educational institutions had come up along the highway, which generated huge heavy vehicle traffic. Commercial development along the roadside had led to heavy encroachments. Although the Highways Department had widened the stretch from Ponnagar to Kallikudi, steps should be taken to remove encroachments and prevent roadside parking, they demanded.", 
    "section": "national", 
    "title": "New two-lane bridge to be built across Koraiyar", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}