{
    "author": [
        "T Madhavan"
    ], 
    "text": "The legal proceedings over the land were initiated by one the heirs of the donors of the property who claimed the 1.50-acre plot was not donated to the school —Photo: D. Gopalakrishnan\n\nThe Government Boys Higher Secondary School in Padappai, about 12 kilometres from Tambaram, has finally got back a piece of land measuring 1.50 acres, after a legal battle spreading over 20 years.\n\nSriperumbudur District Munsif cum Judicial Magistrate, B. Santhosh delivered a judgement recently in a case filed by the heirs of one of the donors of the property, who claimed that the said 1.50 acres was not donated to the school.\n\nHe dismissed the submission by the plaintiffs for want of sufficient records to supplement their claims. The original suit was filed in 1996 with Poonamallee court, which was later transferred to Sriperumbudur in 2008. Recalling the struggle over the years, C. K. Shanmugam of Padappai and executive committee member of the school’s Parent-Teacher Association, said the case was filed by Punitha Ammal and 16 others claiming the ownership for the apportioned land of 1.50 acres lying on the school’s frontage.\n\nWhen the school wanted it, they went to court to stay the proceedings. After the case was transferred to the Sriperumbudur court, Mr. Shanmugam filed a petition at Madras High Court in 2013. The High Court favoured the petitioner Shanmugam and issued orders to the Sriperumbudur court to begin the hearing within six months.\n\n“After hearing the arguments, the Sriperumbudur court rejected the plea of complainants who claimed ownership,” said Mr. Shanmugam, who added that it was a big victory for the government school as it needed the land for carrying out improvement works.\n\nThe PTA has already started clearing vegetation to construct a compound wall.", 
    "section": "national", 
    "title": "Padappai school gets back land after 20-year court battle", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}