{
    "author": [
        "S Poorvaja"
    ], 
    "text": "An artist from the city has begun a rather unusual petition on Change.org. Ganapthy Subramaniam started a petition on Tuesday asking the Archaeological Survey of India (ASI) to allow sketching of historical monuments, without having to obtain permission.\n\n“A group of artists, who are a part of the Chennai Weekend Artists, had gone to the Shore temple in Mahabalipuram on Sunday to sketch the monument. However, as soon as we settled down with our sketchpads, the security guards there told us that it was prohibited,” he said.\n\nThrough the guards, the artists managed to meet officials from the Archaeological Survey of India who told them that there were rules that prohibited the sketching of monuments as it amounted to ‘copying’ the structure and prior permission had to be obtained for the same. In chapter VIII of the Ancient Monuments and Archaeological Sites and Remains rules, it is specified that permission is required for copying certain monuments.\n\n“The process to obtain permission is long-wounded and in this day and age, when monuments are being photographed and recorded digitally, why should this rule apply to us? In many parts of the world, people who visit famous historical sites simply take out their drawing books and sketch or paint,” Mr. Ganapathy pointed out.\n\nHe further said that at the site in Mahabalipuram, there were no restrictions on tourists and visitors taking videos and photos on their phones.\n\nThe group of 20 artists were finally only able to sketch the historical site while standing on the other side of the railings around the place.\n\nOnline petition\n\nIn the online petition, which is to be submitted to the Director General of the ASI, the artist has said that many tourists would love to capture the essence of the place through small sketches and that it helps to improve their craft.\n\n“We mean sketching from an artistic point of view and not any survey or measurements using equipment. While it is perfectly allowed to photograph or shoot videos of all these monuments, this rule preventing sketching is indeed archaic, and needs to go,” the petition reads.\n\nASI officials\n\nsaid sketching amounts to ‘copying’ the structure", 
    "section": "national", 
    "title": "Petition urges ASI to allow sketching at historical sites", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}