{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Congress seeks the intervention of Lt. Governor and Chief Secretary\n\nSenior Congress leader and former Union Minister of State V.Narayanasamy on Wednesday sought intervention by the Lieutenant Governor, Chief Secretary and other concerned officers in preventing alleged irregularities perpetrated by the ruling All India NR Congress government.\n\nCentac admissions\n\nAddressing reporters here, Mr. Narayanasamy pointed out that although his party gave a memorandum to Lieutenant Governor on the alleged irregularities in Centralised Admission Committee (CENTAC) admissions, there was no action on that so far.\n\n“In the backdrop of Assembly polls , over thousand persons have been employed in the Public Works Department, Cooperative and Milk Producers’ Union in violation of all norms and an order of Supreme Court,” he contended.\n\nSalaries not paid\n\nDisputing the statement of Chief Minister N.Rangasamy who recently said the financial position of Union territory was in good condition, Mr. Narayanasamy alleged that the government had not been in a position to settle salaries of over 5,600 employees working in public sector undertakings.\n\nAlleging corrupt practices and irregularities in the present ruling government, Mr. Narayanasamy pointed out that no tender was floated for purchase of mixers and grinders meant for free distribution. Alleging that norms have been violated in procurement of such materials, he demanded a judicial probe.\n\nFisherman’s death\n\nMr. Narayanasamy also demanded a judicial probe into the death of a fisherman and alleged repressive measures by police against fishermen protesting the planned move by Coast Guard to set up a hoverport at Veerampattinam coastal village.\n\nThe Congress leader also said the AINRC implemented only three of 167 promises made during last Assembly polls .\n\nThe poll would teach a lesson to the ruling AINRC as unemployed youth, government staff, weaker section and traders were reeling under hardship due to the poor performance of the government, he said.\n\n“Supreme Court order violated in PWD, Co-op milk union appointments”", 
    "section": "national", 
    "title": "Plea to check AINRC ‘irregularities’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}