{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Those who raised Poovan and Karpooravalli variety suffer extensive losses\n\nA load of banana being despatched from Alakarai village near Musiri in Tiruchi district. Crash in prices of banana has left many small growers of the region impoverished.— PHOTO: A. MURALITHARAN\n\nFor C. Ramalingam (60), a banana grower of Alakarai near Musiri in the district, life is not as rosy as he finds it difficult to get back the money spent for raising banana on his four acres of land holding.\n\nSince the market does not seem to be promising, he had to wait for more than two weeks to harvest banana even after attaining maturity until the third week of February. His wait did not bring good price as he expected.\n\nFinally, he bowed to the pressure of retrieving the jewellery that he had pledged for getting Rs. 1 lakh for raising ‘Karpooravalli’ variety of banana.\n\nSince the Tiruchi market offers very low prices, Mr. Ramalingam had sent a load to Madurai market expecting better price. However, it was not good there too. He sold a bunch of banana to Rs. 50 as against the average price of Rs. 150 to Rs. 200. There were instances in the past where a bunch of banana sold for Rs. 250 too.\n\nMr. Ramalingam said he spent about Rs. 1,50,000 over the last 12 months to raise banana on an acre. Of it, he spent Rs. 1 lakh for purchasing wooden logs to provide support to the banana plants during wind season. However, he had sold fruits only for Rs. 50,000. He would have to wait for two more years to get back the money that he had invested.\n\nHe is not the only farmer who suffered losses. Several farmers, who raised Karpooravalli and Poovan varieties of banana, have suffered extensive loss. There are reports that some farmers dumped the fully ripened fruits because of sharp fall in prices of banana in the market.\n\n“I have seen farmers in his village dumping the fruits in the garbage instead of transporting them to the market by paying huge transportation cost. It is really a tough time for us,” Mr. Ramalingam added.\n\nOn a slippery ground\n\nPrevailing price: Rs. 50\n\nAverage price on normal days: Rs. 150 to Rs. 200\n\nBanana yield per acre is fetching a revenue of only Rs. 50,000", 
    "section": "national", 
    "title": "Price fall leaves banana growers in distress", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}