{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Joseph Rajan, an employee of a multi-national company, was allegedly beaten up and abused by the car driver of a senior police officer in full public view on Tuesday after he objected to them violating traffic rules on the busy Museum Road.\n\nNarrating the ordeal in a Facebook post, Mr. Rajan said he was on his way to his office next to Good Shepherd Auditorium on the road when a white Sedan belonging to a senior police officer attempted to overtake his car from the left in a rash manner. The car had a sticker that read ‘police’ on the front and the rear.\n\n“Since the road was chock-a-block with vehicles, I obviously couldn’t move my car to the right to give him space to overtake from the left (and break the law!). As soon as the signal light went red, the driver of the car started yelling and abusing me in Kannada. I tried explaining my situation to him, but in vain. He kept abusing me,” Mr. Rajan said in his post.\n\nLater, in front of the main gate of St .Joseph’s Boys High School, the Sedan driver intercepted his car and continued the abuse. “The driver tried to pull me out and abused me, asking how I could teach traffic rules to a policeman. (He said) you are not even from Karnataka, you are an outsider,” Mr. Rajan said.\n\n“He started thrashing me through the window, tore my shirt and scratched my chest. I was angry and embarrassed. But I knew I couldn’t harm a man in uniform,” Mr. Rajan stated. According to the post, within a few minutes a crowd gathered and the public, including an autorickshaw driver, came to his aid. However, the policeman allegedly told the auto driver to back off or have his papers taken away. “Noticing that more people were gathering and objecting to his behaviour, he managed to flee the spot,” Mr. Rajan said.\n\nRecords reveal that the Sedan belongs to the MD of BMTC, and it was being used by the director of Security and Vigilance, BMTC, B.A. Mahesh. At the time of the incident, the director was not in the car. Despite repeated attempts, Mr. Mahesh did not respond to calls or text messages from The Hindu .", 
    "section": "national", 
    "title": "Road rage: policeman thrashes MNC worker", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}