{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A sleeper class rail coach has been modified to carry out the awareness\n\nThe Tiruchi Railway Division will embark on a safety awareness campaign on wheels at select stations falling within its vast jurisdiction to drive home safety messages to students and general public.\n\nA sleeper class rail coach has been modified to carry out the safety awareness on wheels that commences on March 3.\n\nThe coach will contain safety-related posters and other material and screen short films on safety to public during the course of its journey.\n\nStarting from Thanjavur on Thursday, the coach will cover Kumbakonam, Mayiladuthurai, Cuddalore, Puducherry, and Tiruchi during the fortnight-long awareness campaign.\n\nStudents and general public would be allowed entry into the coach free of cost to sensitise them to the safety-related measures they needed to adhere to and help the railways, a senior railway official here said.\n\nAn LED TV has been equipped inside the coach to screen short video films on a mosaic of safety measures, including the dos and dont’s to be followed while passing through an unmanned level-crossing, desisting from footboard travel, desisting from carrying fire crackers and other inflammable material in coaches among others.\n\nThe coach would be attached to a passenger train and stabled at the stations identified by the Tiruchi Railway Division on specified dates. The objective behind this initiative is to create awareness among public on rail safety, the official said.\n\nAccording to a Southern Railway release here, the coach would be stabled at Thanjavur Junction on March 3 and 4; Kumbakonam on March 7; Mayiladuthurai on March 8 and 9; Cuddalore on March 10; Puducherry on March 11 and at Tiruchi Junction from March 14 to 16. The coach would be kept open for public viewing from 8 a.m. to 6 p.m.\n\nA team of railway officials would travel in the coach during the course of the campaign, the official said and added that depending on the response, it would be extended to other stations in Tiruchi Division.", 
    "section": "national", 
    "title": "Safety awareness campaign on wheels", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}