{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Communist Party of India (Marxist) Central Committee member U. Vasuki said that the Section 124 A (sedition) of Indian Penal Code need to be repelled to avoid the misuse of “trying to equate government with nation” and thereby, strangulate the voices of dissent against government.\n\n“The said IPC Section is nothing but a ‘colonial relic’ which was used in earlier times to suppress the voices of Indians against the British government. What the present BJP government is doing is to suppress the criticisms against them by terming the criticisers as anti-national”, she added.\n\nMs. Vasuki told this to The Hindu on the sidelines of a street protest organised by the CPI (M) members here on Tuesday to express their dissent over the sedition charges filed against CPI (M) general secretary Sitaram Yetchury for extending support to JNU students. She came down heavily on Sangh Parivar stating that the outfit is trying to gain foothold in JNU and Hyderabad University campuses by going to the extent of masterminding sedition charges against people who support the students’ causes.\n\nMs. Vasuki quipped that why BJP had an alliance with PDP even after the latter had the view that the hanging of Afzal Guru was a ‘travesty of justice’. “By supporting PDP, the BJP should be called ‘anti-national’ if one goes by the party’s stance on filing sedition charges”. She also wanted to know why sedition charges were not framed against a BJP MP who made a remark that farmers’ suicides were a ‘fashion’ at a time when it had been a national issue of concern. Ms. Vasuki wanted BJP leader H. Raja to be arrested for his remarks against CPI leader D. Raja on JNU issue, which amounted to inciting violence.", 
    "section": "national", 
    "title": "‘Sangh Parivar trying to gain foothold in campuses’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}