{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The expo on wheels will provide a glimpse into climate change\n\nThree-day halt:Students look at various charts and models inside the 16-coach Science Express.- Photo: C. Venkatachalapathy\n\nThe 16-coach special train – Science Express Climate Action Special – chugged into platform-3 of Vellore Cantonment Railway Station on Tuesday. The science exhibition on wheels, which has travelled over 1,35,000 kms with 435 halts, will halt in the station till today.\n\nIn its eighth phase of journey, Science Express aims to create awareness on climate change, its impact, mitigation and adaptation. When a student enters the Science Express, the journey through 13 coaches of the train will provide a glimpse into various aspects of climate change.\n\nBroad theme in each coach\n\nEach coach deals with a broad theme starting with understanding climate change, its impact, adaptation and mitigation, international negotiations on climate change, exhibitions put up by Department of Biotechnology and National Innovation Foundation.\n\n“Earth has fever”, a model of a globe holding a thermometer, says it all. Move on, and one can see how climate change is affecting coral reefs, mangroves, mosquito ecology, and much more.\n\nThe coaches throw light on green house gas effects, temperature rise, monsoon variations, sea level rise, impact of climate change on water, agriculture, forests and biodiversity and human health.\n\nOne of the main highlights of the Science Express is the thrust on harnessing renewable energy such as solar, biomass and wind, as one of the means of mitigation.\n\nWith abundance of wind energy, India was in fact the fifth largest wind energy producer in the world. Various government initiatives to promote solar energy and energy targets by 2022 are also outlined.\n\nInteresting one-liners do serve as attractions to visitors. In an effort to take forward the message, “Increase your handprint. Decrease your footprint”, Science Express provides simple but effective ways to what each person can do.\n\nOne can help by some of these doable things – pass on your old textbooks, print in draft mode, toner saving mode, avoid printing transaction slips while using ATMs, use pressure cooker, have a last person out policy in school/office/home to shut down electrical appliances, have your own kitchen garden and prefer carbon neutral kitchen appliances.\n\nHistory of tigers\n\nTracing the history of tigers, the exhibition informs that 60 to 70 per cent of all tiger genes are still in Indian tigers, thereby emphasising the need to save tigers.\n\nSome innovations suggested by students were also on display at an exhibition by National Innovation Foundation such as travel bag with folding seat and modified walker with adjustable legs.\n\nThe train will travel to Kumbakonam, Pudukottai, Rameswaram and Tirunelveli after its halt in Vellore. On the first day, the Science Express received good response with hundreds of students of various schools and colleges in Vellore visiting the train.", 
    "section": "national", 
    "title": "‘Science Express’ chugs into Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}