{
    "author": [
        "T Madhavan", 
        "R Srikanth"
    ], 
    "text": "The introduction of small buses by the Metropolitan Transport Corporation (MTC) in the city and suburbs has helped enhance connectivity, a fact acknowledged by residents who take these small buses.\n\nHowever, the success of the initiative has been spoiled by the fact that many of the interior roads that these small buses ply on do not leave a lot to be desired. These roads are narrow. They are made worse by encroachments due to parking of vehicles.\n\nT. Sadagopan, a resident of Pattabhiram, said most of the small buses in Avadi were being operated through suburban areas and they connect several villages where the roads are narrow, have blind curves and are in a poor condition.\n\nCiting the case of route S49 from Avadi to Prakash Nagar, he said that while the small buses have helped residents give up their reliance on autorickshaws, by linking bus termini and railway stations, efforts should be taken to improve conditions of interior roads in suburban areas if the services could be optimally enjoyed by commuters. There should be an end to unauthorised parking of autos and two-wheelers.\n\nThe situation is the same in south Chennai, which has many small buses routes.\n\nR. Madhusudhanan, who commutes by S8 route from Hastinapuram to Tambaram West, pointed out the that haphazard parking of vehicles between Karunanidhi Street and Haridaspuram Main Road led to traffic jams and even small buses could not be operated without any difficulty.\n\nHe wanted the traffic police and the local authorities to take steps to prevent such unauthorised parking of vehicles. Similarly, operators of S3 (Chromepet to Madambakkam), S10 (Chromepet to Jothi Nagar) and small buses plying on interior roads covering Balaji Nagar Main Road, NSC Bose Road and Ponniamman Koil Street in Madipakkam and Ullagaram Puzhuthivakkam, are faced with the same problem.\n\nWhile there has been a grievance that small buses are not being operated significantly within the city, motorists are facing difficulties after a new bus route linking Kodambakkam to DMS (S37 bus route) was launched on Tuesday.\n\nA senior official of the MTC said the concept of small buses was launched mainly to serve the interior areas of the city and suburbs by avoiding the main roads to provide link to the public transport hubs.\n\nRegarding the narrow road conditions, the local bodies and the traffic police have to take steps to remedy the situation, he added.", 
    "section": "national", 
    "title": "Small buses face big trouble in driving on narrow roads", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}