{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Union Government should have a roadmap for implementation of the projects, in the nine major areas, proposed in the Union Budget, according to speakers at a panel discussion, which was a part of the session on post budget analysis, organised by the Confederation of Indian Industry – Coimbatore Zone here on Wednesday.\n\nChartered accountant G. Karthikeyan, who was the moderator for the panel discussion, said the expectations from the budget were high this year and though it is not a populist one, it is seen as a “pro-poor budget”.\n\nWhile the allocations for sectors such as agriculture, rural, and infrastructure are welcome measures, the Government should develop a mechanism to monitor and implement the proposals.\n\nIt should have a roadmap for each of the major sectors that the budget gives thrust to.\n\nK. Ilango, former chairman of CII – Coimbatore Zone, said the government has increased allocation for rural sector, and agriculture.\n\nBut the delivery mechanism needs to be improved so that the benefits reach the targeted beneficiaries.\n\nWhen the country is moving towards Goods and Services Tax, the taxation system is only getting complicated for those in business.\n\nThe budget does not seem to encourage the manufacturing sector, though the government is focusing on Make in India.\n\nIT entrepreneur N.K. Anand said the contribution of IT and ITES to the economy is huge though it employs less than 1 per cent of the population.\n\nGrowth\n\nSubstantial growth in the economy in the last one year is because of this sector and the budget is positive for the IT and ITES segments.\n\nAccording to S.K. Sundararaman, former chairman of CII – Coimbatore Zone, when the global economy is going through a phase of slowdown, the focus of the budget should have been on industries.\n\nThe textile industry is going through unprecedented sluggishness and the budget does not have much for the sector.\n\nC. Ramasamy, former Vice-Chancellor of Tamil Nadu Agricultural University, said that there are some positive developments in the budget for the agricultural sector.\n\nIn the last two years the sector did not attract attention. Now, there is a change as there is thrust on agriculture.\n\nThough it is one of the main areas that the government has given attention to, income of the farmers should grow by 20 per cent every year.\n\nIn the last few years, the sector has grown by just about 3 per cent annually.\n\nThe allocation for segments such as research and development, and organic farming should have been more.", 
    "section": "national", 
    "title": "Stress on monitoring, implementation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}