{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An Assistant Professor of the Department of History of Manonmaniam Sundaranar University, who remained under suspension for the past six months following sexual harassment charges levelled against him by a few girl students, has been reinstated as a teaching faculty of MSU Constituent College at Nagalapuram in Thoothukudi district.\n\nSources said that the decision on posting Vinod Vincent Rajesh in the English Department of the college was taken by the administration as his reinstatement in the same position could revive protests by the students.\n\n“Since the girls who filed the complaint will complete their courses in the next two years, the MSU authorities decided to bring him back then to avoid embarrassing developments,” the sources said.\n\nAfter sexual harassment charges against Mr. Vinod surfaced in August, the MSU campus witnessed a series of agitations by the affected students and their supporters.\n\nDespite a threatening posture by the administration, police and revenue officials, the students continued their protest for a few days that led to the suspension of the faculty member. Moreover, two increments were stopped without cumulative effect as part of the punishment.\n\n“He was under suspension for six months and now has been reinstated as per the Syndicate Committee’s resolution. Since he has prescribed qualification in English, he’ll be handling the subject at the constituent college,” said Registrar A. John De Britto.\n\nGeneral secretary of MUTA (Madurai Kamaraj, Manonmaniam Sundaranar, Mother Teresa and Alagappa University Teachers’ Association) S. Subbaraju opined that since the charges were of serious nature, the issue should be probed as per MSU statutes in a transparent manner.\n\n“When a resolution favouring the reinstatement came up for discussion at the Syndicate Committee’s last meeting, we (members of MUTA) opposed it, saying that an unbiased decision could be arrived at only after conducting a fair probe. We’ll raise this issue in the next Syndicate Committee meeting on Friday,” Prof. Subbaraju said.", 
    "section": "national", 
    "title": "Suspended assistant professor shunted to Thoothukudi college", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}