{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Inspector of Police R. Gopinatha Pandian (43) was arrested by Thadikombu police on a charge of robbing a dealer of cigarette bundles worth Rs. 36 lakh and Rs. 2.5 lakh on National Highway 7 near here. He was produced before Judicial Magistrate Court I here and remanded in custody for 15 days on Tuesday.\n\nThe police had arrested real estate businessman Raj Kumar of Villapuram in Madurai in this connection last week.\n\nActing on information provided by him, they arrested the Inspector and produced him before the court.\n\nOn February 12, three persons in police uniform intercepted the van owned by cigarette dealer Siva Perumal of Thathaneri in Madurai on NH 7 and robbed him of the cigarette bundles and cash. They also abducted him and his driver in a car to Nilakottai.\n\nOn reaching Nilakottai, the gang took away the cigarette bundles and cash, leaving Siva Perumal, his driver and the vehicle.\n\nSiva Perumal filed a case with Nilakotti police.\n\nLater, the case was transferred to Thadikombu police station. The police found that the Inspector’s car was involved in the robbery.\n\nExtended\n\nIn another waylaying and intimidation case, Gopinatha Pandian was produced before Judicial Magistrate Court III on Tuesday afternoon and the court extended his judicial custody by 15 days.\n\nEarlier, Ammayanaickanur police had arrested and produced the Inspector at the residence of the Judicial Magistrate III on the charges of intimidation and waylaying after 9 p.m. on February 16. In his complaint, Mr. Siva Perumal said that the Inspector intercepted his car on January 27 and demanded documents and bills for the products he was carrying.\n\nHe also threatened to file a case against him.\n\nThen the Inspector collected Rs. 1 lakh and allowed him to go.\n\nThe complainant filed a case against him with Ammayanaickanur police too.\n\nInspector Gopinatha Pandian of Usilampatti, who belongs to the 1996 batch, has served in Theni and Dindigl districts.\n\nIn Dindigul, he served as Inspector in DCRB and PEW and was later shunted to the control room. He was on medical leave when he was arrested.\n\nEarlier, Ammayanaickanur police had arrested and produced the Inspector at the residence of the Judicial Magistrate", 
    "section": "national", 
    "title": "Thadikombu police arrest inspector", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}