{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Union government’s slogan of “Maximum governance, minimum government” is not working well and there is a need to improve administrative systems and bring in reforms, C. Rangarajan, former chairman of the Prime Minister’s Economic Advisory Council, said.\n\n“The ease of doing business can be helped by improving or removing the hitches and procedural delays,” Mr. Rangarajan, Chairman of the Madras School of Economics, said on Wednesday.\n\n“Minimum government is not happening because whatever is happening (in the country) is keeping the government where it is,” he said. The government must focus on maximum governance and ensure that the delivery systems improve, Mr. Rangarajan said.\n\nDelivering the keynote address at a meeting organised by the Southern Indian Chamber of Commerce and Industry to analyse the recent union budget proposals, Mr. Rangarajan commended Finance Minister Arun Jaitley’s proposals to keep the fiscal deficit at 3.5 per cent of the GDP.\n\nComparing the way fiscal deficit is measured in Europe and India, he said in Europe the fiscal deficit takes into account the Centre and the States and the deficit is 3 per cent, while here if the states are also taken in to account, the deficit would work out to 6 per cent.\n\nThe economist said it was not clear from the budget whether the recommendations of the 7th Pay Commission had been included in its expenditure proposals. “It is possible to defer some of the recommendations, but then the burden will move on to another year, or will they modify the recommendations… that is not clear,” he said.\n\nResponding to a query on the government’s proposal to tax the interest on EPF at retirement, Mr. Rangarajan said the idea, perhaps, was not to tax the corpus but the income.\n\n“Apparently the idea is when somebody retires, one should not take out the entire funds. In fact, they want to promote what they call annuities, in the sense that it will come in the form of pension.”\n\nHe also said governments must bring out progress reports on projects for which funds are allocated.", 
    "section": "national", 
    "title": "Time to usher in admin reforms: Rangarajan", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}