{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "The District Cricket Association of Tirupur (DCAT) has quietly marched into its sixth year but quite a few of its players have already made a big impact in the State.\n\nIt is the smooth and professional approach of the men in command in the DCAT that has earned the district the desired results in various age group categories.\n\nPradosh Ranjan Paul, N. Gokul Raj and Joy Gupta are some of the consistent performers for Tirupur in the inter-district matches.\n\nPradosh, in particular, has been cracking tons and double tons with ease with almost every other team in the State and for the State.\n\nPerformance\n\n“We are happy with the performances of our boys but we want them to go places. My dream is to see a Mahendra Singh Dhoni or a Kapil Dev emerging from this part of the region,” said N. Chandran, the DCAT Head, who has been a guiding force for the players and the officials.\n\n“We are working out on various areas – right from creating pitches to player development,” he added.\n\nMr. Chandran is willing to travel the distance. “If any talented player wants to upgrade himself and play in a city like Chennai, I am even willing to support them.”\n\nThe DCAT Secretary N. Prakash was also pleased with the growth chart.\n\n“We have been planning and working hard each year. We had gone to every nook and corner of the district to tap potential players and, today it has paid off. We will continue to work hard in our journey,” he added.\n\n“Mr. Chandran has never hesitated to support and encourage the players. So are the other members of the Association. We have conducted a minimum of 300 matches in a year and this exposure has helped us produce talented cricketers,” said M. Subramaniam, the DCAT Joint Secretary.\n\nThis year, the DCAT plans to give more opportunity to the youngsters. It has come up with Talent Search Tournaments (TST) to identify raw talents. It also has ideas to rope in experienced national players to train the young lot and shape them into future stars.\n\nThe DCAT also rewarded the winners of the various tournaments, the umpires, the coaches and the schools that have lent their support over the past one year during the sixth annual day celebration at the Club House here recently.\n\nSir Robert Stanes Memorial Cricket Club emerged the first division champion and took home the Nachimuthu Rolling Trophy.", 
    "section": "national", 
    "title": "Tirupur growing in leaps and bounds", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}