{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur: Theppam festival, Thayar purappadu from sanctum sanctorum, 6 p.m.; reaching theppam mandapam, 6.15 p.m.; purappadu from the mandapam, 8 p.m.; reaching sanctum sanctorum, 8.15 p.m.\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, dwajarohanam, yaga sala pravesam, 8.45 a.m.; purappadu, 9.30 a.m.; perithadanam, 5 p.m.; Perumal purappadu in tholukkiniyan, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Vaishnava Ramanuja Koodam, 12, Malligaipoo Agraharam, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 6, Vivekananda Street, Ayyappa Nagar, 6 p.m.\n\nGovindammal Tamil Mandram: Devotional music by Tiruchi Dharalam music troupe, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nSeethalakshmi Ramaswami College Department of Economics: V.B.Athreya, advisor, M.S.Swaminathan Research Foundation, speaks on “Decoding the Union Budget”, 11.30 a.m.\n\nJamal Mohamed College Department of Botany: International Year of Pulses and World Wildlife Day, 10 a.m.\n\nNehru Memorial College: Inauguration of Science Academies lecture workshop on “New frontiers in plant sciences and bio technology”, M. Ponnambalam, college chairman, presides, 10 a.m.\n\nM.A.M. College of Engineering: Lecture on “Opportunities for civil engineers” by A. Ranganathan, research associate, Irrigation Management Training Institute, 10 a.m.\n\nEntrepreneurship Development Institute of India, Periyar E.V.R. College and Tiruchi District Tiny and Small Scale Industries Association: Entrepreneurship awareness camp, N. Kanagasabapathy, president, TIDITSSIA, speaks, college campus, 9.30 a.m.\n\nBishop Heber College: Finals of golden jubilee State-level invitation inter-collegiate basketball tournament for Bishop Solomon Doraisawmy memorial trophy, V.P. Danapal, FIBA Commissioner, distributes prizes, 6.30 p.m.\n\nNational Institute of Technology Department of Civil Engineering: Moments - inter collegiate symposium, G.Narayanan, former general manager, Southern Railway, inaugurates, Srinivasan Sundarrajan, Director, NIT-T, presides, 10.30 a.m.\n\nBharathidasan University Department of Economics : Lecture on Union Budget by V.B.Athreya, economist, Khajamalai campus, 2.30 p.m.\n\nM.A.M.B.School: Lecture on Supply chain management by A.Kadar Mohideen, associate professor, M.A.M. College of Engineering and Technology, 2 p.m.\n\nJamal Mohamed College : Comex 2016 – inter collegiate extravaganza,K.M.Mohamed Ismail Sait, correspondent, Green Park Matriculation School, chief guest, 9 a.m.\n\nBishop Heber College Department of Social Work : Medical camp for students, Sri Sivananda Balalaya, Ramalinga Nagar campus, 10 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}