{
    "author": [
        "Deepa H"
    ], 
    "text": "Chinnayya has also been removed from party post as secretary of Kancheepuram (east) district.\n\nChief Minister Jayalalithaa on Wednesday dropped Animal Husbandry Minister T.K.M. Chinnayya from the Cabinet. She also relieved him and Health Minister C. Vijaya Baskar from party posts.\n\nWith hardly a few days left for the announcement of elections, the AIADMK supremo continues to effect a series of changes in the party and the Cabinet.\n\nBased on the recommendation of the Chief Minister, the Governor allocated the portfolio additionally to B. Valarmathi, Social Welfare Minister, an official communiqué from Raj Bhavan said.\n\nMr. Chinnayya has also been removed from his party post as secretary of Kancheepuram (east) district. Thandarai K. Manoharan, AIADMK’s Kancheepuram (Central) district secretary, was also sacked. Former Member of Parliament Chitlapakkam S. Rajendran will hold additional charge of the central and east districts. He met Ms. Jayalalithaa immediately and sought her blessings.\n\nRemoving M. Karikalan, the party’s Tambaram town secretary, she posted M. Koothan, district secretary of the Anna Thozhil Sangam, in his place. The reasons the partymen cite for the complete change of guard are corruption charges levelled by the DMK councillors at Tambaram municipal meet two days ago and the way the ruling partymen handled the situation. Meanwhile, Dr. Vijaya Baskar was removed from the post of Pudukottai district secretary and was replaced by P. K. Vairamuthu, MLA and secretary of the party’s agriculture wing.\n\nAccording to party sources, he could have been dropped to appease the Muthariyar community, a dominant caste in Pudukottai and Tiruchi districts.\n\nA few months ago, the community leaders staged demonstration condemning certain remarks made by him. However, the effective handling of public health in the aftermath of the Chennai floods could have saved him the Minister’s post, sources said.\n\nA week ago, Minister for Dairy Development B.V. Ramanaa was dropped from the Cabinet and relieved of his party post.", 
    "section": "national", 
    "title": "T.K.M. Chinnayya dropped from Cabinet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}