{
    "author": [], 
    "text": "Noting that the jurisprudence of death penalty is the subject of debate in various forums, including the courts of law, and considering the cry among a section of civil society that death penalty should be abolished as it grossly violates the human rights, the Madras High Court on Wednesday commuted a double death sentence awarded by a trial court in a triple murder case to life imprisonment.\n\nHowever, a Division Bench of Justices M. Jaichandren and S. Nagamuthu attached a rider to their verdict that the accused shall not be entitled for any remission at least for 25 years.\n\nIn March 2015, the Coimbatore District Mahila Court had found Selvam guilty of murdering M. Vatsala Devi (27), and her two sons, six-year-old Mahilan and 11-month-old Praneeth in 2014.\n\nAdjudicating the referred trial (When a Court of Sessions passes a sentence of death, the proceedings shall be submitted to the High Court as per section 366 of CrPc, and the sentence shall not be executed unless it is confirmed by the High Court) and the appeal moved by the accused the Bench pointed out a Supreme Court order which declared that generally, life sentence should be the rule and death sentence should be an exception.\n\nThe Bench also referred to another observation of the Apex Court which stated that a court is obliged to balance between the aggravating and mitigating circumstances and impose appropriate punishment as to do justice to the parties.\n\nNoting that standardisation of sentencing process tends to sacrifice justice at the altar of blind uniformity, the Bench said,\n\n“The present case does not fall within the rarest of rare doctrine.”\n\nObserving that the prosecution has failed to prove the motive for the occurrence of the offence the Judges said, “At the same time, killing children who were sleeping is brutal and gruesome, the same cannot be tolerated by any man of ordinary prudence.”\n\nThe Bench then altered the sentence by reducing the death penalty to life imprisonment, with a condition that the accused shall not be entitled to any remission for 25 years.", 
    "section": "national", 
    "title": "Triple murder case: HC commutes double death sentence to life term", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}