{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Viduthalai Chiruthaigal Katchi member Vinayagamoorthy holding a poster during the corporation council meeting in Erode on Wednesday seeking adoption of a resolution against GAIL project.—PHOTO: M. GOVARTHAN\n\nThe revised estimate of Rs. 484.45 crore for Uratchikottai drinking water scheme has been approved under Atal Mission for Rejuvenation and Urban Transformation (AMRUT), Mayor Malliga Paramasivam said on Wednesday.\n\nProjects implemented under the scheme envisage 50 per cent funding by the Central Government, 20 per cent by the State, and the rest by the civic body.\n\nA proposal sent earlier at an estimate of Rs. 409 crore was returned to the Corporation by the Union Ministry of Urban Development.\n\nThe scheme promises 135 litres water per capita per day for domestic consumption.\n\nThe project has been a long-felt need of the city residents, the Mayor said while presenting the budget for 2016-17.\n\nThe budget projected revenue of Rs. 497.47 crore, expenditure of Rs. 496.88 crore and surplus of nearly Rs. 59 lakh. Property tax accounting for a chunk of the revenue amounts to Rs. 20.92 crore.\n\nOn the progress of underground drainage works, officials said the evaluation was carried out under five divisions: 65.85 per cent completion under first, 41.28 per cent under second, 93.44 per cent under third, 92.40 per cent under fourth and 30 per cent completion under fifth division.\n\nA detailed estimate has been forwarded to the government for incorporation of extension areas including B.P. Agraharam, Suriyampalayam, Gangapuram, Thindal, Ellapalayam and Villarasanpatti, the house was informed. Officials said there was substantial progress in replacement of fluorescent tubes with LED devices for street lights, whereby 35 per cent energy saving could be achieved.\n\nWalkout\n\nPrior to the start of the meeting, DMK members staged a walkout criticising the late start of the meeting.\n\nThey alleged that the late start was a deliberate design to rush through the proceedings similar to the last meeting about 10 days ago when 227 resolutions were adopted in a matter of minutes.", 
    "section": "national", 
    "title": "Uratchikottai drinking water scheme gets approval", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}