{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Party feels move may set a precedent for other States\n\nWhile the DMDK is determined that its president Vijayakant should be declared the chief ministerial candidate as a precondition to forging an electoral alliance with the BJP, the national party seems to be reluctant to concede the demand. The DMDK has been holding parallel talks with the DMK too but in the eventuality of the alliance coming through, it would be amenable to a junior partner’s role.\n\nThe BJP leadership feels declaring a chief minister candidate in Tamil Nadu might lead to similar demands by allies in other States and may complicate its position.\n\nFurther, there was also the perceived mismatch as far as the base of the parties are concerned, with some leaders expressing concern that the BJP’s urban, middle-class voters may not back such a set up.\n\n“Our stakes are higher in many other States; so, we have to be very cautious in making such a decision in Tamil Nadu. This call will now be taken by national president Amit Shah,” said a senior leader.\n\nOn Wednesday, sources confirmed that the Tamil Nadu BJP had asked Union Minister Prakash Javadekar not to make a trip to the State immediately, indicating that the party might be hardening its stand on the negotiations with the DMDK.\n\n“We have told Mr. Javadekar let’s wait for the DMDK to open channels again. Without any concrete movement, senior Ministers meeting DMDK leadership again and again may send wrong signals that the BJP is desperate,” said a top state unit leader.\n\nTo demonstrate that it cannot be arm-twisted by potential allies, the BJP has decided to go ahead with receiving applications for all 234 constituencies.\n\nObservers feel the party is in a fix and has little space to manoeuvre. Besides DMDK’s demand, the other possible ally, PMK, has made the chief ministerial candidature of Anbumani Ramadoss non-negotiable. “Nobody wants to make compromises,” the leader added. However, the party does not want to alienate potential allies either.\n\n“The reality is that the AIADMK has not opened any channel so far,” said the functionary.\n\nWhatever be the outcome, the party wants to conclude alliance talks by March second week when Mr. Shah is expected to attend a public rally in Tiruchi.\n\nBJP’s State unit has asked Union Minister Prakash Javadekar not to make a trip to the State immediately", 
    "section": "national", 
    "title": "Vijayakant as CM pitch finds few takers in BJP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}