{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A patient from Tamil Nadu who was diagnosed with an autoimmune disease resulting in tightening of skin and dysfunction of organs has now recovered fully after successfully undergoing immunotherapy facility at Jawaharlal Institute of Postgraduate Medical Education and Research (Jipmer) here.\n\nAccording to a release, a young male from Tamil Nadu noticed tightening and darkening of the skin of his hands and feet.\n\nThere was also poor blood circulation in his fingers causing them to become blue on exposure to cold.\n\nThe symptoms worsened and the tightness of the skin spread to his arms, thighs and chest. He was referred to the department of Clinical Immunology of Jipmer, Puducherry for diagnosis and treatment where he was diagnosed to be suffering from an autoimmune disease called diffuse systemic sclerosis, which causes tightness of skin and dysfunction of other organs of the body.\n\nA team of doctors led by Vir Singh Negi, Head of the department of Clinical Immunology started immunotherapy involving stem cell infusion and monoclonal antibodies. The patient underwent immunotherapy procedure at the department of Clinical Immunology in January 2016.\n\nThe patient recovered fully and is presently under close follow up.\n\nThis is for the first time that such an advanced procedure has been performed in India, offering hope for the patients suffering from autoimmune disorders.\n\nAccording to S.C Parija, Director of Jipmer, immunotherapy is likely to be an important treatment option for patients suffering from severe autoimmune disorders like SLE, Rheumatoid Arthritis, Juvenile Arthritis and Multiple Sclerosis.\n\nMr. Parija said that only a few centres in Europe and the U.S. have started treating patients with their own stem cells isolated from blood or bone marrow.\n\nJipmer has now planned to start this state-of-the-art treatment to patients with autoimmune disease from all over the country, especially Southern India. The treatment costing more than Rs.10 lakh will be provided free of cost to patients.", 
    "section": "national", 
    "title": "Youth with autoimmune disease recovers at Jipmer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-03"
}