{
    "author": [
        "K Umashanker"
    ], 
    "text": "Fresh fire lines carved out in the Seshachalam forests of the Tirumala hills in Andhra Pradesh to prevent forest fires during summer.— Photo: K.V. POORNACHANDRA KUMAR\n\nThe Tirupati wildlife division has chalked out an action plan to tackle forest fires by deploying over 200 staff at hilltops and base camps in the Sri Venkateswara National Park spread over 353 sq. km, in Chittoor and Kadapa districts.\n\nSpeaking to The Hindu , Divisional Forest Officer (Tirupati wildlife) T.V. Subba Reddy said special surveillance began in February and will continue till the monsoon rains in June. “It is a dual strategy which covers fighting forest fires and tackling red sanders smuggling. The young teams stationed at vulnerable points will not only work as fire-fighters but also extend combing services in flushing out woodcutters from deep inside the national park in addition to preventing them from entering the core belt at the base camps,” he said.\n\nThe DFO said forest fires are noticed during summer in Seshachalam hills when pilgrims cook food; shepherds set wild grass ablaze expecting greens shoots; and red sanders smugglers and woodcutters set fire to bushes for easy detection of terrain.\n\nReferring to the forest fires triggered by red sanders smugglers in Tirumala hills four years ago, Mr. Reddy said that barring a few incidents, the smugglers and woodcutters in most cases prefer not to set ablaze the forest cover. “They know that once their regular paths suffer forest fires, the chances of their getting detected are high. Hence, the major threat comes from shepherds and pilgrims bound for Tirumala on foot,” he said. Pedestrian routes for pilgrims at the down-reaches of Tirumala, such as Papanasanam, Tumburu Theertham, and several theerthams (sacred waterfalls) in Seshachalam hills were cleared and bushes cut for 10-ft both sides.\n\nFresh fire lines were arranged all over the wildlife division, while the firefighting personnel were supplied with all paraphernalia such as fireproof jackets, walkie-talkies, shoes and vehicles for swift action in case of emergency.", 
    "section": "national", 
    "title": "Action plan to tackle forest fires on Tirumala hills", 
    "subsection": "general", 
    "date": "2016-03-14"
}