{
    "author": [
        "Staff Correspondent"
    ], 
    "text": "Himachal Chief Minister Virbhadra Singh, who is facing a widespread criticism on the cancellation of India-Pakistan cricket match from various quarters, reiterated his stand on Sunday for not providing the security and came down upon heavily on BCCI secretary Anurag Thakur who has alleged that the hill State lost at least Rs, 3000 crore because of the inconsistent stand of the Chief Minister.\n\n“I don’t need to prove my nationality to Anurag Thakur or his money minting cricket association whose sole aim is to make money”, said the Chief Minister in a statement on Sunday.\n\nHe said it was the ex-service men and martyrs’ families who had opposed the T20 match after the killings of Himachal soldiers in Pathankot and Pampore in Jammu Kashmir. He blamed the BJP leader and the BCCI for having no respect for the feelings of martyrs’ families.\n\nMr. Singh said it was the ICC and the BCCI that had shifted the match to Kolkatta and his government had never refused to provide security to the players. But he had simultaneously said that his forces would not stop the ex-servicemen from protesting against the Pakistan players or the match. Mr. Singh also named some BJP leaders including Shanta Kumar from the anti-Dhumal camp who were opposing the match. He said it was the duty of Mr. Thakur and the HPCA to have talked to the martyrs’ families in advance instead of taking out a “Tiranga Yatra” now.\n\nThe BCCI secretary, on the other hand, said Mr. Singh had tarnished the image of the country by giving an opportunity to Pakistan to declare that India was unsafe.\n\nAs an unfortunate follow out Himachal has also not been allotted any IPL match and that would result in a big loss to the State.\n\nOn the other hand the State Congress has termed the “Tiranga Yatra” of BJYM president launched this weekend from Shimla as a gimmick. “We want to expose the anti-national forces like the Congress and Left in this country”, had claimed the BJYM leader.", 
    "section": "national", 
    "title": "Anurag, BCCI have no respect for martyrs’ families: Virbhadra", 
    "subsection": "general", 
    "date": "2016-03-14"
}