{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "In 540 villages of Pune district, groundwater level has dropped below 1 metre\n\nWith Maharashtra staring at its worst water crisis in recent decades, a law and order problem has arisen in the parched Marathwada region over sharing scarce water in dams.\n\nLast week the police were called in to escort water tankers after furious residents of Dongargaon village refused to part with water for nearby Latur city.\n\nEleven villages, including Dongargaon, say they too are in dire need of water from the crucial Dongargaon dam.Eventually, 25 tankers were deployed under police protection to supply water for Latur.\n\nThe city is no stranger to acute scarcity with water being supplied just once a month as recently as September last year.“If drought is declared again this year, it will be hydrological in nature and not a meteorological one,” says Prof. H.M. Desarda, economist and former member, Maharashtra State Planning Board.\n\nA string of bad rainfall years, bureaucratic myopia and indiscriminate urbanisation have wreaked havoc with the groundwater table in Western Maharashtra, which normally receives heavy rainfall.\n\nFalling groundwater table\n\nIn the 540-odd villages across 13 talukas in Pune district, groundwater levels have plummeted to as low as one metre, a recent report by the Groundwater Surveys and Development Agency (GSDA) said.\n\nIn more than 100 of these villages, the situation is alarming with groundwater levels below three metres.\n\nThis acute water scarcity has also hurt the rabi crop with eight of the 12 tehsils of the district reporting sowing at 40 per cent below normal.\n\n“The government has failed to develop durable social assets in the form of micro-watersheds. The only solution to avert catastrophe is to stop all non-essential uses of water and direct it only for drinking purposes,” Prof. Desarda warned.\n\nPune Mayor Prashant Jagtap’s claim last Thursday that the city would not face any further cuts in water supply was met with scepticism among activists and citizens since Marathwada’s water woes have a direct bearing on the water supply in Pune district and its neighbouring areas.\n\nThe State government’s intentions to divert water from Pune’s dams to parched areas like Latur mean imminent water cuts for the city’s residents, contrary to the Mayor’s assurances.\n\nBone of contention\n\n“This year, we must bear in mind that many parts of the State are facing grave water cuts and that each district must help others to overcome it,” said Pune’s Guardian Minister Girish Bapat.\n\nThe primary bone of contention in nascent water war is the precious 6.77 TMC water left in the Bhama Askhed dam in Khed taluka in Pune district.\n\nThe urban areas of Pune, Solapur and Daund, have staked claim on this vital asset, while the State government has hinted that it might supply arid Latur and other parts of water-bereft Marathwada.", 
    "section": "national", 
    "title": "As dams dry, Marathwada faces water wars", 
    "subsection": "general", 
    "date": "2016-03-14"
}