{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "His statement lacks political maturity, says Naqvi\n\nEnraged over the remarks of senior Congress leader, Ghulam Nabi Azad, who drew a parallel between the global terror network IS and the Rashtriya Swayamsevak Sangh (RSS), the BJP leadership is in a fix whether to raise the issue in Rajya Sabha or brush it aside to let the House function.\n\nSince the amended version of Whistle Blowers Protection Act Bill is scheduled to be discussed and expected to be passed without much resistance from the Opposition, the BJP leadership on Sunday was split, arguing whether to challenge Mr. Azad in the upper House for making what they called a “derogatory” distinction between the IS and the RSS.\n\nMinister of State for Parliamentary Affairs, Mukhtar Abbas Naqvi, told The Hindu that while “some leaders” strongly advocated for protesting against Mr. Azad in the House, the leadership is yet to come up with a decision.\n\n“We [will] take a final call tomorrow,” said Mr. Naqvi.\n\nHowever, Mr. Naqvi said that Mr. Azad’s statement lacked “political maturity” as it places the RSS, the BJP’s ideological mentor, in a “bad light.”\n\n“There is no difference between his [Azad’s] speech and the anti-national slogans that were chanted at the JNU. This mindset suggests that Congress is glorifying terrorists and that’s precisely what we are fighting against,” Mr. Naqvi said.\n\nMeanwhile, senior Congress leader Digvijaya Singh backed Mr. Azad. “I totally endorse and support Ghulam Nabi Azad when he condemned the IS as strongly as he condemned the RSS. They are two faces of the same coin,” Mr. Singh tweeted.\n\nMr. Azad kicked up a row at an event organised by Jamiat Ulema-e-Hind on Saturday as he said Indian Muslims “oppose organisations like IS, the way we [Indian Muslims] oppose RSS.”", 
    "section": "national", 
    "title": "BJP unsure of raising Azad jibe in House", 
    "subsection": "general", 
    "date": "2016-03-14"
}