{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "The familiar sight of a swayamsevak in khaki shorts is set to be a thing of the past, as the Rashtriya Swayamsevak Sangh has decided to replace its khaki shorts with brown trousers.\n\nThe announcement was made here on Sunday by RSS general secretary Suresh (Bhaiyyaji) Joshi in response to a question.\n\n“We have changed our uniform. We move with the times and are not rigid,” Mr. Joshi said.\n\n“We have decided to replace the khaki shorts with brown trousers.”\n\nHe said the details of when the new uniform will become functional will be worked out. Care would be taken to ensure that the new trousers would be comfortable while doing physical activities, a component of the daily routine of the RSS morning shakhas (branches), he said, saying even cricketers and martial artists wear full trousers.\n\nAsked whether this would not take away from the RSS volunteer his distinctive identity, Mr. Joshi said the Sangh was known for many attributes and not just the uniform and that the new uniform would also become part of the Sangh’s identity within months.\n\nHe added, in a lighter vein, that the Sangh would not mind if anyone wearing a brown trouser was considered a Swayamsevak.\n\nThe RSS has till now been recognised by the trademark shorts, with opponents often coining derisive slogans on them. Even books on the RSS — like the famous Khaki Shorts and Saffron Flags — have sometimes based their titles on the khaki shorts.\n\nThe replacement of the shorts apart, there is no other change in the uniform.\n\nThere have been slight changes in the RSS uniform earlier too, old-timers say. It is said that the white shirt replaced a khaki shirt in the closing years of RSS founder Dr. K.B. Hedgewar himself.\n\nIn the times of Balasaheb Devras in the 1970s, it is said, the Sangh changed its heavy shoes to lighter ones. The leather belt was replaced with a cotton belt years back.\n\nWe move with\n\nthe times and\n\nare not rigid, says RSS general secretary", 
    "section": "national", 
    "title": "Brown trousers to replace khaki shorts for swayamsevaks", 
    "subsection": "general", 
    "date": "2016-03-14"
}