{
    "author": [], 
    "text": "Gadkari says government will raise around Rs. 70,000 crore to develop sea, river fronts\n\nThe government is looking to harness the country’s 50,000 kilometres of sea and river fronts as waterways and mulling over innovative ways to raise around Rs. 70,000 crore to develop these stretches in the first phase, Union Minister Nitin Gadkari said.\n\nParliament, by passing the crucial bill to declare 111 rivers across the country into National Waterways last week, has paved the way for development of these stretches as transport carriers. So far, only five of the river stretches had been declared as National Waterways.\n\n“India has its unique advantage. Its 14 States are bestowed with 7,500 kilometres of coastline with 14,500 km of potentially navigable waterways. In addition, 116 rivers across the country provide 35,000 kilometres of navigable stretches.\n\n“In total, we have about 50,000 km of waterways, which on development will change the face of India,” said the Road Transport, Highways and Shipping Minister.\n\nBesides budgetary support, multilateral funds, public-private-partnership and market borrowing would be explored. Access to funds like National Clean Energy Fund (NCEF) and Central Road Fund (CRF) would also be required because of environment benefit of IWT, he said.\n\nLogistics cost\n\nMr. Gadkari said by promoting water transport, logistics cost, which was 18 per cent in India as compared to barely 8-10 per cent in China and 10-12 per cent in European countries, would come down significantly.\n\nThe reforms in the sector would be visible in a few years, he said. Water transport was not only environment-friendly but also much cheaper, he said. It would cost Rs. 1.5 a km to carry cargo by road and Re. 1 by rail. Through waterways, the cost would be a mere 25 paise a km. — PTI", 
    "section": "national", 
    "title": "Centre plans 50,000 km of waterways nationwide", 
    "subsection": "general", 
    "date": "2016-03-14"
}