{
    "author": [], 
    "text": "This set off a furore in Parliament and outside of it, with strong criticism from women’s rights activists.\n\nMs. Gandhi had essentially repeated the government’s stand from April 2015, when it had said that there was no proposal to amend Section 375 of the Indian Penal Code which makes an exception to “sexual intercourse by a man with his own wife” so long as the wife is above 15 years of age. At the time, the Minister of State for Women and Child Development, Haribhai Chaudhury, had admitted that the amendment had been refused by the government in a reply to the UN Committee on Elimination of Discrimination against Women.\n\nSince then, however, the government has agreed, along with about 150 world leaders, to adopt the 17 Goals for 2030 set out by the UNDP. At the United Nations Sustainable Development Summit on September 25, 2015, Prime Minister Narendra Modi addressed the UNGA committing India to the goals which include a target of eliminating “all forms of violence against all women and girls in the public and private spheres.” The reference to private spheres is what the U.N. believes must include the criminalisation of marital rape, if India is to keep that promise.\n\n“The PM of this country went to Parliament to say the safety of women is a priority. So I wouldn’t question the commitment, but we need to make it the goal,” Ms. Clark said. Asked for her response to the government’s submission that Indian culture doesn’t accept the concept of marital rape, Ms. Clark said, “It’s pretty clear in the circles I move in at the U.N. that rape is rape. The issue is the consent of the women, and if it isn’t there it is rape.”\n\n(For full interview visit: http://bit.ly/1WiJJlg)\n\n‘PM’s commitment to safety of women is not questionable, but he must make it a goal’", 
    "section": "national", 
    "title": "Criminalise marital rape: U.N. official", 
    "subsection": "general", 
    "date": "2016-03-14"
}