{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "The gruesome daylight attack was reportedly captured on a surveillance camera\n\nThree youths, one of them brandishing a weapon, seen leaving the scene of crime on a motorcycle in Udumalpet on Sunday.—Photo: Special Arrangement\n\nIn a suspected case of honour killing, a Dalit student, who had recently married a caste Hindu girl, was brutally murdered in public view in front of a shop at Udumalpet in Tirupur district on Sunday. A three-member gang that came on a motorcycle attacked V. Sankar (22) and his wife S. Kausalya (19), with lethal weapons.\n\nWhile Sankar died on the way to the hospital, his wife who suffered a head injury was admitted to the Coimbatore Government Hospital.\n\nRelatives of the girl who had opposed her marriage with the Dalit youth are suspected to be involved in the incident.\n\nThe gruesome daylight attack was reportedly captured on a surveillance camera installed in the locality. Local people even took pictures (on mobile phones) of the suspects escaping on the motorcycle leaving the victims in a pool of blood, police sources said.\n\nSankar, a native of Kumaralingam near Udumalpet, and Kausalya, a native of Palani in Dindigul district, were students of a private engineering college in Pollachi where they met and fell in love. The couple got married a few months ago against the wishes of the girl’s family.\n\nKausalya, who had just joined the college, gave up her studies and went to a private firm in Tirupur for work to support her husband who was in the final year. On Sunday, Sankar and Kausalya went to a departmental store in Udumalpet when the accused attacked them. Sankar suffered a grievous injury on his neck and succumbed to the injury while being rushed to the hospital.\n\nThe condition of Kausalya was said to be stable. Even as many people in the area watched in shock, the accused fled the scene on a motorcycle. A senior police official who inspected the scene of crime said one of the girl’s close relatives had hired mercenaries to murder the Dalit youth. “We have detained a prime suspect who masterminded the attack. The three assailants would be apprehended soon,” he said.", 
    "section": "national", 
    "title": "Dalit youth killed for marrying caste Hindu girl", 
    "subsection": "general", 
    "date": "2016-03-14"
}