{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "RSS general secretary Suresh (Bhaiyyaji) Joshi told a press conference here on Sunday that those who sought equal access for women in temples must not make it a political issue.\n\nMr. Joshi was referring to the Shani Shingnapur temple issue.\n\nHe said women are sages and offered religious discourses even today.\n\nHe took a nuanced position on the environmental concerns that dogged the grand event organised by the Art of Living of Sri Sri Ravi Shankar.\n\n“Maybe there are environmental issues but people should try to find a way out. Following rules is important but so is the prestige of such an event.”\n\nOn JNU row\n\nHe, however, was not as charitable on JNU, whose students were recently booked for sedition after an event on Afzal Guru, who was executed after conviction in the Parliament attack case.\n\n“What does anyone think of the mindset that seeks to offer tributes to the Parliament attack accused? What would we say to slogans that the country be broken to pieces? Some people say someone charged did not say so. Let the law take its own course. But who allowed this atmosphere to get created in a university? This is a matter for intellectuals to ponder on and not a political issue.”\n\n‘Seek counsel of Dharma-Pithas’\n\nPrakash Kamath reports from Panaji:\n\nThe Hindu Janajagruti Samiti (HJS) on Sunday advised the RSS to seek the advice of Hindu “Dharma-Pithas”(highest religious authorities) before backing the entry of women into the inner sanctum of certain temples.\n\nIn a press note, HJS spokesperson Ramesh Shinde, said such decisions over age-old Hindu traditions and temple practices must be taken by the “Dharma Sansad.”\n\nThe HJS urged the RSS not to play into the hands of elements opposed to Hinduism by taking unilateral decisions in a hurry.\n\n“We appeal to the RSS to seek the advice of “Dharma-Pithas” before making any announcements about “spiritual matters related to equality of gender,” said Mr. Shinde.\n\nOn dress change\n\nReferring to a recent decision of the RSS to change the dress of members from age-old “half-pant” to full trousers, Mr. Shinde said that just as it took so many years of deliberations for this decision, the RSS should also take adequate time and advice in decisions on practices linked to temples.\n\n“Or else people will accuse it of surrendering to activist Trupti Desai who is spearheading the women’s temple entry movement with the backing of the Congress,” Mr. Shinde said.\n\n‘RSS should take adequate time and advice on decisions on practices linked to temples’", 
    "section": "national", 
    "title": "Don’t politicise temple entry issue: RSS", 
    "subsection": "general", 
    "date": "2016-03-14"
}