{
    "author": [
        "Robin Mckie"
    ], 
    "text": "Spacecraft’s Trace Gas Orbiter will seek out methane — usually produced by living organisms — in planet’s atmosphere\n\nThe Mars probe, the first of a two-phase exploration of the Red Planet by European and Russian scientists, is scheduled to be blasted into space on a Proton rocket from Baikonour cosmodrome in Kazakhstan on Monday. — File Photo: AFP\n\nSpace engineers are making final preparations for the launch of a robot spacecraft designed to sniff out signs of life on Mars.\n\nThe probe, ExoMars 2016 — the first of a two-phase exploration of the Red Planet by European and Russian scientists — is scheduled to be blasted into space on a Proton rocket from Baikonour cosmodrome in Kazakhstan at 0931 GMT on Monday.\n\nThe spacecraft consists of a module called Schiaparelli that will test heat shields and parachutes in preparation for future probe landings on Mars and a second main component, the Trace Gas Orbiter or TGO, that will analyse the planet’s atmosphere. In particular it will seek out the presence of the gas methane which, on Earth, is produced by living organisms.\n\n“Essentially our spacecraft is a giant nose in the sky,” said Jorge Vago, an ExoMars project scientist based with the European Space Agency (Esa).\n\n“We are going to use it to sniff out the presence of methane on Mars and determine if it is being produced by biological processes.” Methane is normally destroyed by ultraviolet radiation within a few hundred years of its creation. Its presence on Mars would therefore suggest life had recently been active there.\n\nThe U.S. robot rover Curiosity, which landed on Mars in 2012, initially found no sign of methane. Subsequent analyses in 2014 did report the presence of methane in the Martian atmosphere in one area. However, some scientists have argued that it may have been created by non—biological means.\n\nOn Earth most methane is generated biologically, but it can be made by chemical processes under the surface. To differentiate between these two processes, the ExoMars trace gas detector will not only analyse methane levels in more detail than any previous mission but also study other gases that will provide information about its likely source. “If methane is found in the presence of other complex hydrocarbon gases, such as propane or ethane, that will be a strong indication that biological processes are involved,” said another project scientist, Manish Patel, of the Open University.\n\n“However, if we find methane in the presence of gases such as sulphur dioxide, a chemical strongly associated with volcanic activity on Earth, that will be a pretty sure sign that we are dealing with methane that has come from the ground and is a byproduct of geological processes.”\n\nExoMars is expected to arrive at the Red Planet on 19 October after a journey of 496m km across space, and will be followed by a second ExoMars mission, a Mars rover, scheduled for launch in 2018. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "ExoMars: ‘giant nose’ to sniff out life on Mars", 
    "subsection": "general", 
    "date": "2016-03-14"
}