{
    "author": [
        "National Bureau"
    ], 
    "text": "Legislation will givea fillip to reforms process: Jaitley\n\nUnion Finance Minister Arun Jaitley and IMF MD Christine Lagarde on the concluding day of the Advancing Asia conference in New Delhi on Sunday.— PHOTO: PTI\n\nThe National Democratic Alliance government hopes to press the accelerator on reforms and pass the landmark Constitution (122nd Amendment) Bill for a national Goods and Services Tax (GST) and a separate bill for Bankruptcy and Insolvency Code, 2015, in the second half of the Budget session beginning April 20, Union Finance Minister Arun Jaitley said on Sunday.\n\nThe current session of Parliament has already seen the passage of one landmark legislation two days ago, Mr. Jaitley said, referring to the Aadhaar (Targeted Delivery of Financial and other Subsidies and Services) Bill, 2016.\n\nThe legislation meant to provide statutory backing to the unique identification number was passed last week. “I do hope to see another two being passed in the second part of the session with regard to the bankruptcy and insolvency laws and GST,” he said, addressing the Advancing Asia Conference.\n\nThe passage of the GST and the bankruptcy and insolvency laws, he said, would give a major fillip to India’s reform process. “We are trying to have special emphasis now both in terms of legislative changes and resources being put to strengthen the banking system… next few months, in bringing about structural change, are going to be extremely important.”\n\nMr. Jaitley said that the constituency within India supporting reforms is much bigger than its opponents. He also said that exhibiting determination to move on the reforms path, India can provide a significant amount of growth to the world.\n\nThere is a broad national consensus that the Indian economy be strengthened further so that it can attract more foreign capital, he said.\n\nThe GST Bill was passed by the Lok Sabha but is stuck in the Upper House, where the ruling NDA does not have a majority and is dependent on the support of the Congress for its passage. The Constitution amendment Bill needs two-third majority or 162 votes in the 242-member Rajya Sabha. The Congress, the original author of the GST reform, has refused to support the Constitution amendment Bill in its present form.\n\nAfter it clears the Rajya Sabha, the legislation will have to be ratified by at least half of the 29 States. Also speaking at the Conference, IMF Managing Director Christine Lagarde said that the world had lots to learn from India’s Aadhaar initiative that would affect revenue generation in a big way.\n\nMs. Lagarde also told reporters she didn’t see much of a downside from the global economy to India’s growth rate since the country has a “solid” growth model, a growing population, scale of market and was pursuing reforms. India, she said, has been the prime net beneficiary from low oil prices and had done well to prepare for the spill-over effects of asymmetric monetary policies of central banks across the world.", 
    "section": "national", 
    "title": "Govt. hopes to pass Bankruptcy, GST Bills", 
    "subsection": "general", 
    "date": "2016-03-14"
}