{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The growth rate of pulses output in the last four decadeshas surpassed the growth rate of rice, wheat and all cereals together. —Photo: Special Arrangement\n\nIn an encouraging sign of rise in pulses production, the country has seen a gradual rise in the growth rate of pulses output at 2.61 per cent during the last four decades, which has surpassed the growth rate of rice, wheat and all cereals together.\n\nAgriculture Ministry data shows that during the last four decades (1970-2010) the production of pulses in the country has witnessed a gradual upward trend and notably, it has more or less remained nearly 18 million tonnes since 2010. Earlier the production hovered around 14-15 million tonnes.\n\nIn 2013-14, the production touched an all time high of 19.78 million tonnes. However, due to inclement weather in the current season, the pulses production in 2015-16 is likely to stay at 17.30 million tonnes.\n\nFigures suggest the growth rate in pulses production during this decade has been at 2.61 per cent, which has been higher than that of rice that stands at 1.59 per cent, wheat at 1.89 per cent and all cereals together at 1.88 per cent.\n\nAgriculture Minister Radha Mohan Singh in a statement said the development of transgenic pigeonpea and chickpea for resistance against gram pod borer is at an advanced stage at the Indian Institute of Pulses Research (IIPR). Once achieved, this will help boost pulses output further and will go a long way to help the country achieve self sufficiency.\n\n“IIPR is striving to intensify the breeding programme through both conventional and genomics-enabled crop improvement. It has exclusive focus on development of hybrids in pigeonpea, transgenics against pod borer in chickpea and pigeonpea, high yielding varieties with tolerance to biotic and abiotic stresses,” he said.\n\nHe said the institute is also working towards bio-intensification of pulse-based cropping systems and resource conservation, mechanisation and minimising post harvest yield loss.\n\n“Climate risk management and efficient extension models for dissemination of pulse-based technologies for farmers to make the pulse cultivation in the country productive and remunerative are also being worked upon,” he added.", 
    "section": "national", 
    "title": "Growth rate of pulses production encouraging", 
    "subsection": "general", 
    "date": "2016-03-14"
}