{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The planes are operated by the IAF, Navy and Coast Guard. A few have been exported to Mauritius and the Seychelles.— File Photo\n\nDefence aircraft maker Hindustan Aeronautics Ltd. has said it plans to make and operate two Dornier-228 aircraft for civil operations.\n\nThe board sanctioned the plan to operate the light, 14- /19-seater aircraft for civil and possibly VIP transport at its meeting held in late February. HAL’s airport at Nasik would be the hub.\n\nThe amount sanctioned for the proposal and the schedule were not immediately available.\n\n“HAL’s board has sanctioned the manufacture of two civil Dornier aircraft. It intends to operate [them] from its airport at Nasik,” the company said.\n\nSince 1983, HAL has manufactured over 120 of the Do-228 aircraft under licence from Swiss OEM (original equipment manufacturer) RUAG at its Transport Aircraft Division in Kanpur. The planes are operated by the Air Force, Navy, Coast Guard. A few aircraft have been exported to Mauritius and the Seychelles.\n\nThe aircraft would be upgraded, the company said, adding “HAL is also exploring cost reduction to make the aircraft viable for more export opportunities and internal civil operations.”\n\nIn preparation to this, the Kanpur division has also received the approval of the civil aviation regulator, the Directorate General of Civil Aviation, for manufacturing the civil versions as per Civil Aviation Requirement (CAR) 21G.\n\nMeanwhile, the first of four export shipsets of structures for the Do-228-212 New Generation has been handed over to RUAG’s Germany unit. “We have manufactured and supplied the shipset in record time, ahead of schedule,” against the order received four months back, HAL CMD T. Suvarna Raju was quoted as saying.\n\nRUAG’s MD Volker Wallrodt and his team of senior officials were present at the event, HAL said.", 
    "section": "national", 
    "title": "HAL eyes civil foray through 2 light Dorniers", 
    "subsection": "general", 
    "date": "2016-03-14"
}