{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "The border-guarding forces of Bangladesh and India conducted their first-ever joint exercise in the riverine borders of the Sundarbans.\n\nIn an attempt to bring in more synergy in coordinated border management, border-guarding forces of Bangladesh and India conducted their first-ever joint exercise in the riverine borders of the Sundarbans.\n\nThe exercise between the Border Security Force (BSF) and the Border Guard Bangladesh (BGB) commenced with troopers, including dog and bomb squads, from both the forces carrying out joint searches of cargo vessels on the Ichamati river.\n\nThe second day of the drill called ‘Sundarbans Maithri’ on Sunday was supervised by Inspector General, South Bengal frontier, Sandeep Salunkhe, Colonel Khandekar Farid Hassan, Region Commander BGB onboard the floating border outpost (BOP) Kamakhya.\n\nTwo floating BOPs of BSF — Kamakhya and Durga —along with BGB Ship Shahjalal were deployed in the waters of the Ichamati along the international border that serves as the international border between the two countries.\n\nCongratulating both the forces on the successful conduct of the drill, senior BSF and BGB officers said the exercise would become a “regular affair” in the future.\n\n‘Deterrent to smugglers’\n\nWhile Mr. Salunkhe expressed hopes of more such exercises, Mr. Hasan said the drill “can be a big deterrent to smugglers and criminals who will have to deal with the combined efforts of both the forces”.\n\nThe officials said the joint exercise would be extended on land as well to make it part of a coordinated border management plan.\n\nSpeaking about cross-border smuggling, both BSF and BGB officers pointed out that smuggling of cattle has come down by nearly 60 to 70 per cent in the recent times. BSF officials also flagged concerns about smuggling of Fake Indian Currency Notes (FICN). Regarding concerns about smuggling of Phensedyl from India to Bangladesh, BSF officials said the recent decision to ban on the cough syrup would help the forces to stop smuggling.\n\n“Now with the substance being banned, this will strengthen our hands,” Mr. Salunkhe said, adding that, earlier, in order to attract penal provisions under the Narcotic Drugs and Psychotropic Substances (NDPS) Act, more than 10,000 bottles had to seized.", 
    "section": "national", 
    "title": "India-Bangladesh drill in Sundarbans", 
    "subsection": "general", 
    "date": "2016-03-14"
}