{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India's pluralist society is an inspiration for conflict-prone countries of the West Asian region, Ahmed Badreddin Hassoun, the Grand Mufti of Syria said on Saturday as he argued for greater dialogue between India and the Arab world.\n\n“Despite poverty and economic hardship, India has important message for our region, as it shows that people can live despite differences and diversity,” the Grand Mufti, said in a lecture at the Centre for West Asian Studies (CWAS) of Jawaharlal Nehru University on Saturday.\n\nThe Grand Mufti marked the beginning of his historic first visit to India, during which he will deliver a series of public speeches asking for a cessation of hostilities in Syria. “India needs to be experienced by us as the lesson from Indian diversity is relevant for our world,” Mr. Hassoun said.\n\nThe visiting Grand Mufti will be felicitated at a public event on Monday at the India Islamic Cultural Centre (IICC) and he will be one of the main speakers at the World Sufi Forum, between March 17 and 19, which will feature a large number of leading figures of the Sufi world.\n\n“The historic first visit by the Syrian Grand Mufti to India is significant, as the Arab world is passing through the most difficult phase in its recent history,” said Abdul Moid Azhari, an Islamic scholar associated with the World Sufi Forum.\n\nThe Grand Mufti, known for his proximity to the troubled government of Syria led by President Bashar Al Assad, has consistently opposed violent elements like the ISIS and been campaigning for a solution to the ongoing conflicts in West Asian. Hosts of the World Sufi Forum told The Hindu that the presence of several important regional figures will provide a unique opportunity for dialogue among various West Asian players competing for power.\n\nOn maiden visit, Grand Mufti of Syria called for greater dialogue with the Arab world", 
    "section": "national", 
    "title": "‘Indian pluralism an inspiration’", 
    "subsection": "general", 
    "date": "2016-03-14"
}