{
    "author": [
        "Firoz Rozindar"
    ], 
    "text": "In a curious case, a resident of Vijayapura in Karnataka has dragged a ‘vaastu’ consultation firm to the District Consumer Forum, saying his life did not witness the promised changes after he made “architectural corrections” at his house as suggested.\n\nBased on his complaint, the Consumer Forum has ordered issuance of notice to ‘Sarala Vastu’ being run by Chandrashekhar Guruji.\n\nMahadev Dudihal, working in a legal firm, in the petition, said he had spent lakhs of rupees and was facing financial and domestic problems since 2007.\n\nTV programme\n\n“Over a year ago, I saw a television programme in which Guruji was advertising about ‘vaastu’ where some people were claiming how they were benefited after constructing/renovating their houses as per ‘vaastu.’ Since I was also suffering from problems, I decided to take the help of Sarala Vastu,” he said in the petition.\n\nMr. Dudihal said a representative who arrived from Hubballi, collected Rs. 11,600 consultation fee and gave a ‘blueprint’ for the renovation of the house.’\n\nHe has attached a copy of the ‘blueprint’ and a document which was given by the agency that promised positive change within 3-8 months of making modifications based on the ‘vaastu.’ Even after a year, nothing had changed in his life, he alleged.\n\n“ I was already facing acute financial crunch, yet hoping that ‘vaastu’ would change my life, I borrowed money and spent about Rs. 4.5 lakh to renovate the house as per ‘vaastu’. I demolished the walls, changed the direction of the main door and made some more changes in the house which took around two months,” he said.\n\n‘No response from firm’\n\nMr. Dudihal said that when he found no positive change in his life, he contacted the ‘vaastu’ firm on many occasions, and even visited the Hubballi office but he received no positive response.\n\nHence his petition before the Consumer Forum through his advocate, P. S. Anantapur who said the case had been filed in connection with unfair trade practices and deficiency of service under Consumer Protection Act.\n\nMeanwhile, Mr. Dudihal told The Hindu that he was not only seeking justice for himself but also for other people like him who have approached the agency.\n\nDudihal says his life has not seen any change after he modified\n\nhis house", 
    "section": "national", 
    "title": "Let down by ‘vaastu’, man drags firm to consumer forum in Karnataka", 
    "subsection": "general", 
    "date": "2016-03-14"
}