{
    "author": [], 
    "text": "In a breakthrough for energy-efficient computing, engineers at the University of California-Berkeley have shown for the first time that magnetic chips can operate with the lowest fundamental level of energy dissipation possible under the laws of thermodynamics.\n\nThe findings mean that dramatic reductions in power consumption are possible — as much as one-millionth the amount of energy per operation used by transistors in modern computers.\n\nThis is critical for mobile devices, which demand powerful processors that can run for a day or more on small, lightweight batteries.\n\nData centres\n\nOn a larger industrial scale, as computing increasingly moves into ‘the cloud’, the electricity demands of the giant cloud data centres are multiplying, collectively taking an increasing share of the country’s — and world’s — electrical grid.\n\nReducing energy needed\n\n“We wanted to know how small we could shrink the amount of energy needed for computing,” said senior author Jeffrey Bokor, a UC Berkeley professor of electrical engineering and computer sciences.\n\n“The biggest challenge in designing computers and, in fact, all our electronics today is reducing their energy consumption,” he added in a paper appeared in the peer-reviewed journal Science Advances . Lowering energy use is a relatively recent shift in focus in chip manufacturing after decades of emphasis on packing greater numbers of increasingly tiny and faster transistors onto chips.\n\n“Making transistors go faster was requiring too much energy,” said Bokor, who is also the deputy director the Centre for Energy Efficient Electronics Science, a Science and Technology Centre at UC Berkeley funded by the National Science Foundation. “The chips were getting so hot they’d just melt.”\n\nMagnetic computing emerged as a promising candidate because the magnetic bits can be differentiated by direction, and it takes just as much energy to get the magnet to point left as it does to point right. — IANS\n\nThe findings mean that dramatic reductions in power consumption\n\nare possible", 
    "section": "national", 
    "title": "Magnetic chips to enhance energy efficiency of computers", 
    "subsection": "general", 
    "date": "2016-03-14"
}