{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Even as the Kingfisher Airlines employees sought the intervention of Prime Minister Narendra Modi for non-payment of salary and provident fund dues by Vijay Mallya, the Employees’ Provident Fund Organisation (EPFO) said the company has no pending PF and that it has not received a single complaint from any employee of the now-defunct airline.\n\nIt, however, said that the Airlines had to pay the PF department only Rs. 7.62 lakh as penalty charges due to delayed salary payment.\n\n“Notice issued to the company for levy of penal damages (Rs.3,34,016) and interest due (Rs.3,55,678) for belated remittances for certain months and payment of short remittances of Rs.71,910.\n\nTotal liability in the notice is Rs.7,61,604,” the EPFO said in a note, reviewed by The Hindu , on Sunday.\n\nLabour Minister Bandaru Dattatreya had earlier told the news agency Press Trust of India in Hyderabad that the Labour Ministry would examine the provident fund contribution of Kingfisher Airlines after it had stopped operations in 2012.\n\nThe note said that the last inspection of the company revealed that it had paid the EPF and other dues on salary payable up to December 2012. The Directorate General of Civil Aviation had suspended Kingfisher Airline’s aviation licence in October 2012.\n\n“The employment strength gradually dropped after December 2012 due to closure of their operations and remittances were made for two skeletal employees up to Sept 2015 and thereafter minimum administrative charges were paid,” the note also said.\n\nThe payment of EPF contribution stopped after September 2015 as it was found that Form 10, which states the date and reason for exit of employees from employment or EPFO membership, was not submitted by the company.\n\nSurprisingly, the note said that the EPFO hasn’t conducted the verification of records in 2013. “The returns that they have filed till yet have been found to be okay. They have to pay the penal charges for delayed salary payment and contribution toward the EPFO,” an EPFO official said.\n\nAccording to the note there is no complaint either from the employees or trade unions regarding non-payment of PF.\n\nMinistry will examine airline’s PF contribution after it stopped operations in 2012", 
    "section": "national", 
    "title": "No complaint from Kingfisher staff on PF dues, says EPFO", 
    "subsection": "general", 
    "date": "2016-03-14"
}