{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Military upgrade on border lags Chinese modernisation\n\nIndia will be making only incremental improvement to its military infrastructure along the border with China, even as its most ambitious plan for dealing with the neighbour’s military prowess is stuck because of a resource crunch.\n\nMilitary officers describe the China strategy as “timid” and no match to the aggressive modernisation of border capabilities and overhaul of military structure by the neighbour. “The momentum is lost,” a senior officer said on the adverse impact of lack of resources for the upgrade of military infrastructure.\n\nThe Indian Air Force, which re-launched two upgraded advanced landing grounds (ALGs) in Arunachal Pradesh on Saturday, will upgrade six more of those World War II vintage strips in the border State. The entire project, approved in 2009 and budgeted at about Rs. 1,000 crore, has been inching ahead to provide better logistical access for airdropping troops and equipment in forward areas.\n\nThe IAF has upgraded three of the ALGs with paved runway surfaces and facilities such as aprons for ground manoeuvring and air traffic control towers. It says the new runway surfaces and other infrastructure are at par with any other modern airfield in the country.\n\nThree more ALGs — Mechuka, Pasighat, Tuting — are scheduled to be inaugurated in the next three months.\n\n“Those are good moves, but not good enough,” a senior military officer dealing with the China border says, pointing out that these are incremental but not enough to catch up with the Chinese modernisation and threat from across the border.\n\nMilitary officers argue that the Indian military’s most ambitious plan to deal with Chinese challenge — raising a dedicated Mountain Strike Corps — is languishing for lack of government attention and financial allocation.The 17 Corps, which would be country’s fourth strike corps, is now temporarily headquartered in Ranchi. “There are not much resources available to complete the raising,” a source said.\n\nThe UPA government had sanctioned the strike corps in 2013, projecting a total expense of over Rs. 64,000 crore and nearly 90,000 personnel.\n\nAccording to reports, the Army started equipping it with War Wastage Reserves, in the expectation that budgetary support would follow.\n\nThe Chief of the Army Staff, General Dalbir Singh, has said that the strike corps would be ready by 2021.\n\nHowever, officers said that they were far from reaching that target.\n\n“We have a complete division in Panagarh, and that is it,” one of them said.\n\nA strike corps would require at least two full divisions. With no significant budget increase this year, there is no hope that the second division can be raised anytime soon, they say.\n\nMany officers point out that the policy focus that was brought on dealing with China border in recent years has slowed down significantly.", 
    "section": "national", 
    "title": "Officers rue ‘timid’ strategy on China", 
    "subsection": "general", 
    "date": "2016-03-14"
}