{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "As the administration plans to give voting rights to more than 13,000 erstwhile enclave dwellers in the upcoming West Bengal elections, some key problems of the ‘new’ citizens are yet to be addressed.\n\nThe issues are different for two sets of enclave dwellers — Indians who came from Bangladesh and the Bangladeshi citizens who were already residing on the Indian side. More than 14,000 people were granted Indian citizenship on both sides following the ratification of the Land Boundary Agreement between the two countries in 2015.\n\nA crucial issue facing the enclave dwellers is the settlement of private land on which the families on the Indian side were settled. The residents of a former enclave on the Indian side — Poaturkuthi — complain that they have not been given any paper establishing their claim over the land.\n\n“The patta [land right document] has to be given to us so that we know that the land belongs to us,” said Saddam Mia. “The administration has initiated a process to construct government infrastructure in the [erstwhile] enclaves. While we welcome the move, we need to know about the legal boundary of our individual land,” he said.\n\nPeople are becoming restless and in some pockets they are resisting the survey to build government infrastructure like roads, police stations and post offices. “They [land surveyors] are planning roads through houses or setting up a police station on our land without a thought that people have been living there for hundreds of years,” said Anil Ray Laskar who led the protest in Mrigipur Chit [enclave] Number 15 in Haldibari subdivision. “This is because our property has not been demarcated.” They have met district officials who have “promised” to sort out the issue. But wary residents say such promises are routinely made but rarely kept.\n\nLack of jobs\n\nAn important issue that worries Indian citizens of Bangladesh is lack of jobs. “If we work as wage labour for 100 or 150 rupees a day, as we are desperate for work, it ruins the local job market. So, the local farm workers tell us to stay home, as they charge 250 rupees or more for a day’s work,” said Naresh Burman of Dinhata camp that houses about 60 families.\n\nDistrict administration arranged for work in a jute mill close to Kolkata, but the dwellers refused to move citing low wage and for fear of “being permanently displaced” from home where they had just arrived.\n\nJayprakash Roy of another camp, Haldibari, said that while they did not have the problem of wage discrepancy in their area, the quantity of food grains provided was an issue. “A family of eight or 10 is only given as much food grain as a family of one or two is. The remaining, they have to buy from the market,” Mr. Roy said. But without any savings, most camp residents cannot afford to do that.\n\nCheck post\n\nAnother problem is the police check post outside Mekhliganj camp. It still remains, the district administration’s “promise” to remove it notwithstanding. “Even on Sunday, when a Bangladeshi citizen Nagendranath Burman, who holds a proper passport and visa, came to visit his relatives in the camp he was told to stay outside by the constable manning the check post,” said a resident.\n\nNow their only hope is to raise the issues with the candidates, when they reach the enclaves to campaign for the upcoming poll. The number votes in certain pockets is quite high. “But we do not know if they will ever come,” said Mr Roy.\n\n‘Issues will be resolved’\n\nThe District Magistrate of Cooch Behar, P. Ulaganathan, promised that the “remaining” issues will be addressed soon. “Ration is provided based on the economic condition of the families, as defined in the National Food Security Act. So we cannot increase or decrease the quantity at the district administration level,” he said. As for the land survey, he said the “necessary process” will be initiated on the basis of clearance by the Cabinet. “It should also start soon,” he said.\n\nThe district president of the Trinamool Congress, Rabindranath Ghosh, also a candidate from the district, said the work in the erstwhile enclaves and the camp had “suffered” due to the Central government’s “poor planning.”\n\n“The district administration has just received some money… may be Rs. 50 crore… when the Central government had approved a thousand crore earlier. The amount is released nearly a year after the signing of the agreement… it will be unreasonable to blame the district administration for lack of infrastructure and other issues,” he said.\n\nPeople are becoming restless and, in some pockets, they are resisting surveys to build government infrastructure", 
    "section": "national", 
    "title": "Old problems still haunt ‘new citizens’", 
    "subsection": "general", 
    "date": "2016-03-14"
}