{
    "author": [], 
    "text": "In a bizarre incident in the U.S., a woman dumped her 8-year-old son at a hospital with a note saying she did not want him anymore as he was “rude and ungovernable.”\n\nThe woman is facing child abuse charges after dropping off her son at the hospital in West Jordan, Utah. The incident took place at the Jordan Valley Medical Centre last month.\n\nThe woman left the child with nothing but the clothes on his back and a note which read, “This kid is rude and ungovernable! I do not want him in my house at all!”\n\n“I don’t think I’m necessarily a bad mother. I got more like overwhelmed,” the mother was quoted as saying by FOX 13 News.\n\nSalt Lake City District Attorney Sim Gill said there are resources available for parents in these situations. He said what this woman did was not acceptable.\n\n“Whether you physically abuse a child or you abandon a child it can have physical scarring or emotional scarring so those are all great concerns for vulnerable children who are not in a position to protect themselves,” Gill was quoted as saying.\n\nThe mother was charged with child abandonment and child abuse.\n\nCourt documents state the boy told hospital staff that his mother hit him with a spoon, leaving a bruise on his arm.\n\nThe mother, however, has denied hitting her son.\n\nShe said she had recently separated with her husband, and was left alone to care for all four of their children. She could not handle her son all by herself.\n\n“He was calling me names...he was pulling his pants down in public,” said the mother.\n\nThe boy was placed in foster care while the mother and father have since gotten back together.\n\nThe mother has been visiting her son, and said she wants him back and he wants to come back.\n\nIf convicted the woman faces up to six years in prison. — PTI\n\nShe is now facing child abuse charges and, if convicted, faces up to to six years in prison", 
    "section": "national", 
    "title": "U.S. woman dumps 8-year-old son for being ‘rude, ungovernable’", 
    "subsection": "general", 
    "date": "2016-03-14"
}