{
    "author": [
        "National Bureau"
    ], 
    "text": "Lt.Gen. J.F.R. Jacob played a key role in the negotiations which led to the surrender of Pakistani troops in Dhaka during the 1971 war.\n\nLieutenant-General J.F.R. Jacob, who died in New Delhi on Wednesday, was one of the heroes of the 1971 war with Pakistan. Born in Kolkata in 1923, where his Jewish family had migrated from Baghdad, Lt.Gen. Jacob started his military career with the British Indian Army.\n\nHe served across Asia and Africa, graduated from artillery schools in England and the U.S., and finally opted to serve with the Indian Army after Independence. He breathed his last at the Army Research and Referral Hospital in New Delhi.\n\nLt.Gen. Jacob was 92.\n\nThe Chief of the Army Staff, General Dalbir Singh, said Lt.Gen. Jacob personified the “best qualities of a soldier and a statesman who will always be remembered as one of the most prominent leaders in the annals of Indian military history.”\n\nLt.Gen. Jacob began his career during World War II in 1942 as a young Army officer.\n\nHe served in northern Iraq, North Africa, Burma (now Myanmar) and Sumatra as part of the British forces. After World War II, Lt.Gen. Jacob graduated from artillery schools in England and the United States.\n\nLt.Gen. Jacob has composed an Indian Army manual on desert warfare.\n\nHe also took part in the Indo-Pakistan war of 1965.\n\nHowever, it was in the Indo-Pakistan War of 1971, which resulted in the liberation of Bangladesh, that Lt.Gen. Jacob, as Major-General and Chief of Staff of the Eastern Army Command, achieved his military glory, playing a crucial role in negotiating the surrender of Pakistan in Dhaka. Later, Lt.Gen. Jacob became the Commander-in-Chief of the eastern command.\n\nHe retired from the Army after 37 years of service in 1978. During his retirement years, he was appointed Governor of Goa and Punjab.\n\nIsraeli Ambassador Daniel Carmon said, “For many years, the General has been a staunch supporter of India-Israel relations and visited Israel a number of times. He shall forever be remembered as a human bridge between our peoples.”", 
    "section": "national", 
    "title": "A hero of the Bangladesh liberation war passes away", 
    "subsection": "general", 
    "date": "2016-01-14"
}