{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "The dream of Prasar Bharati — under which All India Radio and Doordarshan operate — to create a national channel for classical music will be realised on January 26, 2016. The 24 x 7 radio satellite channel, which users can access on TV too, will be called ‘Raagam’ and will air Carnatic and Hindustani music.\n\nApart from the Direct To Home platform that the broadcast will be available on, the programme will be simultaneously webcast, according to officials of Akashavani Bengaluru. The music channel will be inaugurated by A. Surya Prakash, Prasar Bharati Chairman, at Bengaluru’s Town Hall on January 26. “Bengaluru is more involved in technical broadcast and content management, even as 14 other stations will officially contribute to its programmes,” said Dr. N. Raghu, Programme Executive, Akashavani Bengaluru, who is also in charge of ‘Raagam.’\n\nFor millions of radio enthusiasts, medium-wave plays spoilsport with its noisy interruptions and signal breaks. “We are aware that even radio manufacturers were finding it difficult to satisfy connoisseurs … Prasar Bharati’s move to create ‘Raagam’ on DTH with concurrent webcast will bring in clarity,” said Mr. Raghu adding that the App for Webcast has been developed.\n\nThe channel will introduce personalised interactions with listeners in its broadcast and research-oriented capsules. While Akashavani stations in New Delhi, Mumbai, Kolkata, Pune, Dharwad, Bhopal and Lucknow will contribute to Raagam’s Hindustani music, Bengaluru, Chennai, Thiruvananthapuram, Tiruchi, Thrissur, Hyderabad and Vijayawada will provide Carnatic content. “We in AIR have the largest artistes pool. Add to this our own recording for ‘Raagam’ at every station and our biggest archival pool. This will bring in variety and diversity,” said Mr. Raghu.\n\nThe classical channel could occupy the space created by satellite radio Worldspace after it shut down. “We are starting off with no advertisements though and will decide on the flow gradually,” say officials.\n\nThe 24x7 radio channel will air Carnatic and Hindustani music from Jan. 26", 
    "section": "national", 
    "title": "Akashvani’s ‘Raagam’ to captivate connoisseurs", 
    "subsection": "general", 
    "date": "2016-01-14"
}