{
    "author": [], 
    "text": "If you are suffering from obesity, reducing the time spent on watching television or playing computer games may be as important as doing exercise to reduce the risk of diabetes and heart diseases, suggests new research.\n\nSedentary behaviour is associated with poor cardiovascular health and diabetes in adults with severe obesity, independent of how much exercise they perform, the study said.\n\nAccording to the researchers, the findings could be used to design and test programmes meant for adults with severe obesity that emphasise reducing time spent sitting, rather than immediately working toward increased moderate to vigorous-intensity physical activity or exercise, such as brisk walking.\n\n“Adults with severe obesity often have difficultly following national guidelines to participate in at least 30 minutes per day of moderate to vigorous-intensity physical activity for health benefits,” said lead author Wendy King, associate professor at University of Pittsburgh in the US.\n\n“Our findings suggest that replacing sedentary behaviour, like watching television or sitting at the computer, with low-intensity physical activities, such as light housework or going for a casual stroll, may improve cardio-metabolic health in this population,” Mr. King added.\n\nFor the study, the researcher followed 927 patients participating in a prospective study of patients undergoing weight-loss surgery at one of 10 different hospitals across the US.\n\nFor every hour per day, participants spent in sedentary bouts of at least 10 minutes, their odds of having diabetes increased by 15 percent, metabolic syndrome by 12 percent and elevated blood pressure by 14 percent.\n\n“These findings indicate the importance of investigating sedentary behaviour as a distinct health risk behaviour, not simply lack of moderate to vigorous-intensity physical activity, among adults with severe obesity,” Mr. King pointed out.\n\nThe study was published online in the journal Preventive Medicine . — IANS\n\nSedentary lifestyle is tied to poor cardiovascular health in adults with obesity", 
    "section": "national", 
    "title": "Are you obese? Cut down on sitting time", 
    "subsection": "general", 
    "date": "2016-01-14"
}