{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Even as West Bengal Chief Minister Mamata Banerjee continues to claim that no incidents of communal violence take place in the State, data presented by the Home Ministry in Parliament prove otherwise.\n\nIn response to questions asked by two MPs, Minister of State, Ministry of Home Affairs, Kiren Rijiju, placed on record the number of communal incidents in 2014 and between January and October 2015. In fact, in West Bengal the number of communal incidents increased from 16 in 2014 to 24 during January-October 2015, the reply submitted in the Lok Sabha, read.\n\nPeaceful State: CM\n\nHowever, on January 8, Ms. Banerjee said: “Bengal is a peaceful State. There is no communal tension or incident. We do not allow it.”\n\nThe Minister’s reply shows that in 2014, 644 communal incidents were recorded in the country. This increased to 650 between January and October 2015.\n\nAn analysis of data provided by the Home Ministry shows that the number of communal incidents in West Bengal has remained more or less the same over the past few years. While in 2012, 23 communal incidents occurred in West Bengal where nine persons lost their lives and 66 were injured, in 2013, 24 communal incidents were reported in which one person died and 80 were injured.\n\nIn fact, during the previous Communist Party of India (Marxist)-led Left Front government, whose leadership claims that the situation was “better” than now, the number of communal incidents remained nearly the same.\n\nDuring the regime of the United Progressive Alliance government, Union Minister of State, Ministry of Home Affairs, R.P.N. Singh, had put on record details on communal incidents in the country from 2010. He pointed out that in 2010 (when the Left Front was in power in West Bengal) 21 communal incidents occurred in which six persons lost their lives and 82 were injured.\n\nState has seen violence both under Left Front and Trinamool", 
    "section": "national", 
    "title": "‘Bengal no stranger to communal violence’", 
    "subsection": "general", 
    "date": "2016-01-14"
}