{
    "author": [
        "Devesh K"
    ], 
    "text": "One of India’s biggest bank loan default cases has taken a murky turn with the Central Bureau of Investigation claiming that several vital documents pertaining to the case have been stolen in a conspiracy involving some of its own officials.\n\nThe documents pertain to investigations against Zoom Developers Private Limited, which is being probed for allegedly defrauding several nationalised banks of Rs.2,200 crore by taking out loans on the pretext of launching realty projects in Europe.\n\nIndian public sector banks have been witnessing massive loan defaults by big corporate houses, many of which are suspected to be criminal conspiracies to siphon off funds and not merely business turning bad.\n\nThis was one of the biggest alleged default cases that the CBI is investigating.\n\nThe CBI has registered a case against its own unidentified officials, the company and its director Vijay Choudhary, under various provisions of the Indian Penal Code and the Prevention of Corruption Act. Criminal conspiracy, theft, criminal breach of trust and criminal misconduct are the substantive charges.\n\nOfficials under scanner\n\nThe CBI has alleged that by abusing their official position, some of its own officials helped prime accused Choudhary and his company get hold of these stolen papers that were used by the accused for their benefits at various places.\n\nWhile the theft was detected in June 2014, the agency is yet to sum up investigations and identify all those involved in the case.\n\nIt lists six such documents, which include the papers provided by Punjab National Bank, parts of a report on loans sanctioned by Syndicate Bank, and a confidential report prepared by a senior CBI official. Copies of another confidential letter and the complaint lodged by Punjab National Bank and papers containing certain internal comments on the investigations were also stolen.", 
    "section": "national", 
    "title": "CBI papers on Zoom Developers case stolen", 
    "subsection": "general", 
    "date": "2016-01-14"
}