{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The Union government on Wednesday approved the much-talked about new crop insurance scheme in which it has kept the premium amount for farmers at a maximum of two per cent for foodgrains and oilseeds while capping it up to five per cent for horticulture and annual commercial crops.\n\nThe new scheme is being perceived as Prime Minister Narendra Modi’s first significant move to address rural hardship and woo rural voters ahead of key elections.\n\n“It is a historic day and I strongly believe the Pradhan Mantri Fasal Bima Yojana will bring about a huge change in the lives of farmers,” Mr. Modi tweeted after the scheme was jointly announced by the Ministers of Home, Agriculture and Parliamentary Affairs.\n\nHome Minister Rajnath Singh told reporters here that the Cabinet had approved the PMFBY, replacing the existing National Agricultural Insurance Scheme (NAIS) as well as the modified NAIS. The scheme will be implemented from the kharif season this year.\n\n“The farmer’s share of premium has been substantially reduced and the government will provide subsidy on premium,” said Mr. Singh, adding that government liability on premium subsidy would be shared by the Central and State governments on a 50:50 basis.\n\nThe scheme will have a uniform premium of only two per cent to be paid by the farmers for all kharif crops and 1.5 per cent for all rabi crops. In case of annual commercial crops such as cotton and horticultural crops, it will be only five per cent.\n\nThe premium rates to be paid by farmers are kept very low and the balance premium will be paid by the government to provide full insured amount to the farmers against crop loss on account of natural calamities.\n\nThere is no upper limit on government subsidy. Even if the balance premium is 90 per cent, it will be borne by the government.\n\nCoverage raised\n\nThe scheme comes at a time the country is facing a drought for the second straight year due to poor monsoon rains and the government wants to enhance insurance coverage to more crop area to protect farmers from climate variations.\n\nThe government expects the scheme to help increase the insurance coverage to 50 per cent of the total crop area of 194.40 million hectares from the existing level of about 25-27 per cent crop area.\n\nMeanwhile, the BJP has welcomed the initiative terming it as a pro-farmer decision which will go a long way in reducing farmers’ woes.", 
    "section": "national", 
    "title": "Centre clears new crop insurance scheme", 
    "subsection": "general", 
    "date": "2016-01-14"
}