{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Even as political parties continue to blame one another over the violence at Kalichak in West Bengal’s Malda district, the district administration has begun a drive to destroy the extensive poppy cultivation in the district.\n\nSenior officials of the excise department told The Hindu on Wednesday that poppy cultivated on nearly 500 acres had been destroyed in Kaliachak and adjoining areas over the past one week.\n\n“The drive started on January 5 and till today evening (January 13), 1,500 bighas (495 acres) of poppy cultivation has been destroyed in a joint operation where the police, BSF and excise department are involved,” the official said.\n\n“We have also registered cases against the owners of the land where it has been cultivated. While several theories are floating about the January 3 violence in the Kaliachak area, it is also believed that illegal poppy cultivation could be one of the reasons behind the incident. Several police vehicles were torched and the local police station was attacked during the violence.\n\nAlong with other illegal activities like smuggling of fake Indian currency notes and illegal arms, poppy cultivation remains an open secret in Malda.\n\nThousands of acres of land is used for the cultivation under the guise of mango orchards, with mango trees grown just on the periphery. Officials said a similar drive had been taken up a couple of years ago. The drive that was started on January 5 was likely to continue for a few more weeks, they said.\n\nFake currency smuggling\n\nOther than poppy cultivation, smuggling of fake currency is also a major concern for law enforcement authorities in the district which shares a border with Bangladesh. Fake currency notes amounting to Rs.3.08 crore were seized in the district in 2015 and 105 cases were registered. Also, 187 cases of possessing illegal arms were registered in the district in the same year.", 
    "section": "national", 
    "title": "Crackdown on poppy in Malda", 
    "subsection": "general", 
    "date": "2016-01-14"
}