{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "Curtains came down on the Scorpene submarine deal bribery scandal of 2005 on Wednesday with the Delhi High Court refusing to order a court-monitored probe by the CBI or a special investigation group into the allegations of irregularities and presence of middlemen in the transaction with French company Thales.\n\nA Division Bench of the High Court dismissed a public interest writ petition in the matter, while observing that a preliminary inquiry report filed by CBI had concluded that the allegations of irregularities were not established and the sufficient material was not available to register a case under the Prevention of Corruption Act, 1988.\n\nThe petition was filed by the Centre for Public Interest Litigation (CPIL) with the allegation that a bribe of Rs.500 crore was paid to influence the government decision makers before the Rs.19,000 crore deal was approved.\n\nThe Bench, comprising Chief Justice G. Rohini and Justice Jayant Nath, said it had carefully gone through the preliminary inquiry report of the CBI and found that the allegations regarding irregularities in processing of Scorpene deal were not established.\n\nIt was concluded in the report that in view of the inquiries made with the Ministry of Defence and in the light of the discussion of various aspects mentioned in it, no case was made out for an offence under the Prevention of Corruption Act.\n\n“In the light of the said report, the relief as prayed for cannot be granted,” said the court in its brief four-page judgment.\n\nThe CPIL had alleged that the government had gone ahead with the deal despite having knowledge about involvement of middlemen as pointed out by the Central Vigilance Commission and the Chief Vigilance Officer of Ministry of Defence in 2002.", 
    "section": "national", 
    "title": "Curtains come down on Scorpene bribery scandal, HC refuses probe", 
    "subsection": "general", 
    "date": "2016-01-14"
}