{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Decks will be cleared by this weekend for the BJP to elect its new president, most likely incumbent Amit Shah, as a large number of state units are expected to complete their own processes of electing a local president.\n\n“According to the party’s constitution, at least 50% of state units are expected to complete the election process from district and block to state level, for the new national president to be elected. That process will get done by this weekend,” said a senior source in the party.\n\nThe quorum for state chiefs required for electing a national president is 19, of which 17 states have completed the election process, with Gujarat and Odisha expected to be done over the weekend. “That will also coincide with the end of the inauspicious khar maas that falls before Makar Sankranti. Most likely we can expect an announcement between January 19th -23rd,” said a source.\n\nThe election of the party president and the setting up of his team will also clarify future plans of a Cabinet reshuffle, party sources said. There are at least three ministers facing the axe on the basis of their performance and political calculations. “That could happen in the inter session period between the two parts of the Budget session of Parliament,” said the top source in the party. A national council of the party may also be called during that period to endorse the new president,” said the source.\n\nIf re-elected, this would officially be Mr. Shah’s first term as party president as he was elected to complete former party president and current Home Minister Rajnath Singh’s term when the latter was made a member of the Union Cabinet.\n\nSenior RSS leaders are expected to be in Delhi over the weekend to finalise the choice of president (elections to the president’s post are usually unanimous) but sources said that no schedule has been drawn up for a meeting.", 
    "section": "national", 
    "title": "Decks cleared for BJP president’s election", 
    "subsection": "general", 
    "date": "2016-01-14"
}