{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "Raghu's mother made a living by begging in a Dalit colony in Karnataka's Mandya district\n\nRaghu applied for the jobof a sweeper in a bank, but his application was rejected because his caste columnwas left blank.\n\nWhat is the caste of a child born to a rape victim who is mentally unsound and is also speech and hearing impaired? Twenty-four-year-old Raghu, whose mother was the victim, has been seeking a Scheduled Caste certificate since she made a living by begging in a Dalit colony in Mandya district.\n\nAfter running from pillar to post for months, there is some hope for Mr. Raghu now. The government has finally agreed to explore the possibility of giving him a caste certificate after a ‘mahajar’ (inspection) by officials to establish that his mother was begging in the Dalit colony.\n\nBank job\n\nMr. Raghu, who has passed his SSLC, had applied for the job of a sweeper in a bank in Mandya, but his application was rejected because his caste column was blank. Born in 1991, Mr. Raghu was separated from his mother after birth because she was in no condition to take care of him and he was sent to a government home in Ballari.\n\nKarnataka Minister for Social Welfare H. Anjaneya convened a meeting of officials and former and present chairpersons of the Karnataka State Commission for Backward Classes on how this vexed issue could be addressed and legal hurdles circumvented.\n\nAccording to Mr. Anjaneya, certain guidelines had to be followed before issuing an SC certificate. Mr. Raghu’s school transfer certificate (after SSLC) categorises him as “Hindu” but does not mention any caste.\n\nHe, however, said there was prima facie evidence to prove that his mentally challenged mother was begging in a slum dominated by SC and ST communities.\n\n“I have asked the authorities to take cognisance of the issue and conduct a ‘mahajar’ (inspection) and explore the possibility of issuing him an SC certificate,” the Minister said.", 
    "section": "national", 
    "title": "Finally, ray of hope for rape survivor’s son to get Scheduled Caste certificate", 
    "subsection": "general", 
    "date": "2016-01-14"
}