{
    "author": [
        "Lalatendu Mishra"
    ], 
    "text": "Union Minister for Shipping and Transport Nitin Gadkari, along with Michael Pinto, former Secretary, Ministry of Shipping (left), and Sunil Kanoria, Assocham president, at a conference in Mumbai on Wednesday.— PHOTO: PAUL NORONHA\n\nThe Union government is working on a strategy to increase the movement of goods and passengers through waterways by nearly five-fold from a mere 3.5 per cent now to 15 per cent by 2019, Union Shipping and Transport Minister Nitin Gadkari has said.\n\nMr.Gadkari, who was addressing a conference organised by ASSOCHAM here on Wednesday, said the development of coastal shipping and inland waterways was a priority for the NDA government.\n\n“The passenger and cargo traffic share in the country through water transport will be increased to at least up to 15 per cent by 2019. Currently, the share of passenger and cargo traffic is only 3.5 per cent as against the average of 30 to 40 per cent in countries such as China, South Korea, United Kingdom, Germany and France,” Mr.Gadkari said.\n\nHe said the development of waterways would reduce the logistics cost, enabling India to effectively compete in the international market.\n\n“Coastal shipping and inland water transport is a fuel efficient, environment friendly and cost effective mode, especially for bulk goods. While the road transportation cost per km is Rs.1.50 and for the Railways it is Re.1, for waterways, it would be 25 to 30 paise” he said.\n\nAwareness should be created to reduce the logistics cost which was adding 30 per cent to the cost of any product exported from India, thereby making our products uncompetitive in the global markets.\n\n“The government is working on a priority basis to bring down the logistics cost and increase exports,” Mr.Gadkari said. “The coastal shipping system has to be made development-oriented. Besides we need to implement fast-track decision-making which will come about only when people change their mindset,” he said.\n\nThe Minister said the Shipping Ministry had prepared a vision document on coastal shipping, tourism and regional development to increase the share of inland water transport and coastal shipping, development of regional centres to generate cargo for coastal traffic and promotion of cruise tourism.\n\nTo encourage transportation of goods by coastal shipping, service tax has been brought on par with road and rail transport. The government has also relaxed cabotage (right to operate transport services within a particular territory) for specialised vessels like Ro-Ro, Hybrid Ro-Ro, car carriers and truck carriers for a period of five years.\n\n“We have taken steps for the modernisation, mechanisation and computerisation of the coastal shipping system to promote transparency and the NDA government has zero tolerance for corruption,” he said.\n\nPorts to be developed\n\nOn port development, Mr.Gadkari said the government had taken a decision to start three major ports at a cost of Rs.18,000 crore to Rs.20,000 crore. These include a port at Wadhwan near Dahanu in Maharashtra, Colachel Port near Kanyakumari and the Sagar Island Port in West Bengal.\n\nThe Wadhwan Port will be built as a joint venture between JNPT and the Maharashtra Maritime Board, and was intended to decongest the overburdened JNPT Port at Nhava Sheva.", 
    "section": "national", 
    "title": "Govt. plans boost to water transport", 
    "subsection": "general", 
    "date": "2016-01-14"
}