{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "With 610 deaths in just two months, State records highest ever number of suicides by farmers\n\nThe BJP–led government claims to have undertaken several measures to tackle the agrarian crisis, which has emerged after three consecutive years of drought.\n\nSuicides by farmers touched a grim high in 2015. The year that had recorded 2,590 suicides until October -- the higher ever since 2001 -- went on to register 610 more deaths in just the last two months. The death toll on December 31, 2015 stood at 3,228, indicating that the slew of measures the government undertook through the year failed to arrest the disturbing trend.\n\nMaharashtra has recorded 20,504 farmer suicides since 2001. Data obtained from the government shows Vidarbha, the region Chief Minister Devendra Fadnavis hails from, was the worst hit last year, with around 1,541 farmers from Amaravati and Nagpur division committing suicides. As many as 1,130 farmers ended their lives in the Aurangabad division of Marathwada. Nashik in North Maharashtra witnessed 459 cases of farmer suicides.\n\nFigures indicate that that Pune division, which covers the state’s prosperous Western region, too recorded 96 suicides of which 27 were registered in the last two months of the year.\n\nOf the 3,228 suicides, the state has found only 1,841 eligible for government aid, while 903 were found ineligible. While 484 cases are pending for inquiries, ex-gratia aid has been extended to 1,818.\n\n“Packages will no longer work for farmers and the government seems to be missing this point completely. There is a need of farmer oriented policy and not packages,” said Chandrakant Wankhede, an activist from Vidarbha working on issues of farmers’ suicides. He said when loan waivers were announced in 2008, there was a drop in suicides. But since 2011, no such steps have been forthcoming. “The number may only increase in the coming years.” Maharashtra had recorded a 75% deficit in rainfall between June and September last year. While the CM had announced a Rs 10,512 crore package of farmers in December 2015, he had refrained from announcing any loan waivers. On Wednesday, Mr Fadnavis thanked Prime Minister Narendra Modi for launching the PM Crop Insurance Scheme, which assures covering over 50% of the farmers under the insurance scheme in the coming three years. Under this scheme, 90% premium money will be paid by the Centre and not just the fully grown crop but even the stem will be insured.\n\nIn the last three to four years, Maharashtra witnessed extreme weather conditions that have either destroyed crops or left them damaged.", 
    "section": "national", 
    "title": "Maharashtra saw 3,228 farmer suicides in 2015", 
    "subsection": "general", 
    "date": "2016-01-14"
}