{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Salvatore Girone with the marine Massimiliano Latorre (right), who was allowed to leave India on health grounds.\n\nAmid news reports that Italian marine Massimiliano Latorre will not return to India to face the criminal trial for the murder of two Indian fishermen in 2012, the Supreme Court on Wednesday allowed his stay in Italy to be extended for another three months till April 30.\n\nMr. Latorre and another marine, Salvatore Girone, on duty aboard the vessel Enrica Lexie , are accused of shooting dead two fishermen off the Kerala coast in February 2012, mistaking them for pirates.\n\nA Bench of Justices Anil R. Dave, Kurian Joseph and Amitava Roy agreed to the submissions made by counsel Soli Sorabjee and K.T.S. Tulsi that Mr. Latorre, who suffered a brain stroke and returned to Italy to recuperate in September 2014, needed more time.\n\nSenate stance\n\nOn Tuesday, the president of the defence committee of the Italian Senate said Mr. Latorre would not return.\n\n“Massimiliano Latorre will not go back to India, and work is being done on the possibility of requesting for Salvatore Girone to be able to return to Italy,” Senatore Nicola Latorre (not related to the marine) was quoted as saying by Italy’s ANSA news agency.\n\nLatorre has been given periodic extensions by the Supreme Court to stay back ever since he left the country. Girone, however, is still in India.\n\nIn August 2015, the court suspended all proceedings in India against the marines following an interim order passed by the International Tribunal for the Law of the Sea (ITLOS) asking India to maintain “status quo” till the issue of which country had the right to conduct the trial was decided. Italy has invoked international arbitration challenging India’s jurisdiction to try the marines.\n\nArbitration\n\nTo a question from Justice Roy when the arbitration proceedings would be concluded, Mr. Sorabjee said it might take at least a year. However, the court asked Additional-Solicitor General Pinky Anand to take instructions from the government and report back on April 13 on how long the proceedings would take.\n\n“We will post it on April 13. We will decide then on what future course of action to take in the case,” Justice Kurian explained to the court for the Bench.\n\nSupreme Court agrees to submission that Latorre needs more time to recover", 
    "section": "national", 
    "title": "Marine can stay in Italy till April 30", 
    "subsection": "general", 
    "date": "2016-01-14"
}