{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The lack of coordination between the Congress high command and its Mumbai unit left the party at an odd spot on Wednesday.\n\nThe All India Congress Committee’s disciplinary board headed by former Defence Minister A.K. Antony sent a show-cause notice to Sanjay Nirupam, the chief of Mumbai Congress unit, seeking his explanation on the controversial article that was published in Congress Sandesh magazine last December.\n\nSince Mr.Nirupam is the editor of the magazine, which is the party’s mouthpiece in Mumbai, he was asked to explain how an article filled with criticism of the Gandhi family could get published under his watch.\n\nEngrossed in making arrangements for Congress vice-president Rahul Gandhi’s two-day visit to Mumbai — starting from January 15 — Mr. Nirupam denied having received any such notice.\n\nSpeaking to The Hindu , he said if he received any such notice, he was “happy to explain” his position.\n\nBack in New Delhi, the Congress high command went into a damage control mode with senior party leaders neither confirming nor denying to have sent the notice.\n\nThe Congress sources said that the high command declared the notice invalid after realising that Mr.Nirupam was leading the preparations for Mr. Gandhi’s Mumbai visit. “The leadership thought the notice may spoil Rahulji’s visit, so they postponed it,” a senior party leader said.\n\nA closer look at the confusion also reveals intra-party rift brewing in the State unit. The Congress sources said that one faction was led by two senior Congress leaders Gurudas Kamat and Kripashankar Singh, and another by Mr.Nirupam.\n\nThe Kamat-Singh duo is what’s recognised as “Maratha” lobby.\n\nSince Mr.Nirupam is from Bihar, sources said, Mr. Kamat doesn’t want a Bihari lobby to dictate rules in the party.", 
    "section": "national", 
    "title": "Nirupam issue reveals lack of coordination in Cong.", 
    "subsection": "general", 
    "date": "2016-01-14"
}