{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The Centre on Wednesday shifted the onus of lifting the ban on ‘jallikattu’ on the Tamil Nadu government, saying that the State could promulgate an ordinance invoking its jurisdiction under Entry 28 of the State List under the Constitution. But legal experts are of the view that such a law will not stand court scrutiny and might only end up embarrassing the State.\n\nEntry 28 puts markets and fairs under the State List. It is under the category of ‘fairs’ that the Centre wants the State to bring in a new law to preserve ‘jallikattu’.\n\nMohan Parasaran, former Solicitor General, said such an ordinance would still contravene the provisions of the Prevention of Cruelty to Animals (PCA) Act. “The State cannot take recourse to Entry 28 since it will not remove the repugnancy to PCA Act, which is a Central Act. The Supreme Court called ‘jallikattu’ itself cruel,” he pointed out, adding that the apex court had already struck down a State Act (Tamil Nadu Regulation of Jallikattu Act) in its order banning the sport.\n\nSenior advocate K.M. Vijayan said the Centre’s statement was more political than legal.\n\n“If it is sub judice to the Centre, how is not sub judice to the State? Tamil Nadu is an impleaded party and the same would apply to the State government too,” he said. Union Minister Nirmala Sitharaman had cited the judicial proceedings in the Supreme Court as the reason for the inability of the Centre to promulgate an ordinance.\n\nMr. Vijayan said the matter had little to do with Entry 28 in the State list.\n\nOn the other hand, it was Entry 17 in the Concurrent List, which provides powers to the State and the Centre to enact laws to prevent cruelty to animals, which was important.\n\nIf the State decides to invoke its jurisdiction under Entry 17 of the Concurrent List, then the ordinance needs “prior concurrence” of the President.", 
    "section": "national", 
    "title": "‘Ordinance on ‘jallikattu’ may embarrass T.N. govt’", 
    "subsection": "general", 
    "date": "2016-01-14"
}