{
    "author": [], 
    "text": "Ace fashion designer Manish Malhotra revisits the rich textile legacies of Benaras and Gujarat and gives them a modern spin\n\n‘Glamourising’ handlooms:Malhotra says it is the first time he is doing all clothes in woven and excited about it.\n\nAce fashion designer Manish Malhotra will be bringing the essence of Benaras and Gujarat with his latest collection titled ‘Regal Threads’ for his label Manish Malhotra.\n\nAsked why he named the collection ‘Regal Threads’, Mr. Malhotra, whose creations have been donned by Bollywood stars such as Aishwarya Rai Bachchan and Kareena Kapoor Khan, said over phone from Mumbai: “This is the first time I am doing all clothes in woven and it’s all a part of Make in India (initiative). It’s exciting to work in something that I have not ventured into.”\n\nWhile watching old movies, he discovered that there was “so much luxury in the lifestyle of India.”\n\n“There was so much of respect and texture that India has...For all this dying crafts, it’s important that a few of the designers get it out there in focus in their own style. I am doing it in my own style,” he said.\n\n“This is another venture where we (me and my label) are focussing on various textures from Gujarat and Benaras. They have a certain regalness, royalty and a history...And that’s why ‘Regal Threads’,” he added.\n\nMr. Malhotra, who has styled global names like Michael Jackson, Reese Witherspoon, Kylie Minogue, Naomi Campbell, said the collection was “for a bride, a girl attending a wedding and for a boy. It’s festive and evening wear.”\n\nThe designer has used an array of colours for the collection such as red, black, soft pink, aqua blue, aqua green; salmon pink, blue, beige and ivory.\n\nMr. Malhotra said he wanted to “glamourise” the Benarasi and Gujarati handlooms like he did for Kashmiri embroidery.\n\n“I want to put up my own centres to help the weavers there (Benaras). I was in Benaras for three days and I noticed that the weavers need a lot more work. “I am doing a lot of bandhinis , which are untouched and untapped. I am glamourising it like what I did with Kashmiri embroidery. I got it in focus in bridal lehengas, evening wear and saris. That’s what I want to do for Benaras and Gujarat,” he said.\n\nThe ‘Regal Threads’ range, which consists of saris, high-waisted skirts, lehengas and jackets, will be showcased in Mumbai’s Regal Room. Fitoor actors Katrina Kaif and Aditya Roy Kapur will up the glam quotient of the new range.\n\nAsked why he chose Katrina and Aditya as showstoppers, the designer said: “It’s a very Indian collection. It’s very organic. I think Katrina and Aditya are tall, beautiful, very today, sexy and glamorous. ” — IANS", 
    "section": "national", 
    "title": "Picking up the threads", 
    "subsection": "general", 
    "date": "2016-01-14"
}