{
    "author": [
        "G Anand"
    ], 
    "text": "The VACB of Kerala says there is no evidence to criminally indict the former Finance Ministerfor graft\n\nThe Vigilance and Anti-Corruption Bureau (VACB) of Kerala has given former Finance Minister K.M. Mani a second reprieve in the bar licence renewal bribery case.\n\nThe agency reiterated that there is no evidence to criminally indict him for graft. An anti-corruption court here rejected a similar finding by the agency in October and ordered a further inquiry.\n\nThe agency’s final report absolves Mr. Mani of all guilt rested primarily on four findings.\n\nThere is no merit in the imputation that Mr. Mani had a corrupt motive in deferring the Cabinet’s decision on renewal of non-standard bar licences from March 26 to April 2, 2014.\n\nThe postponement was as per mandatory rules of business and to get the Law Department’s opinion. The next Cabinet decided not to renew the licences and the complainant, the Kerala Bar Hotel Association (KBHA), has no case that it got a favourable decision in reciprocation for the bribe it allegedly gave.\n\nThe allegation that KBHA officials had handed over Rs.15 lakh to Mr. Mani at his private residence in Pala on March 22, 2014, was full of holes.\n\nSaju Dominic, who supposedly handed over the bribe money to one John Kallat at the Minister’s house, was at Ponkunnam, 24 km away, at the time.\n\nThe trail of digital mobile phone evidence left behind by the alleged bribe-givers disproved their contention that they all had met at a public place on the evening of April 1, 2014, to collect Rs. 35 lakh to be paid to Mr. Mani at his official residence early next day. A forensic metadata analysis showed the “bribe givers” were at different locations at the time.\n\nKBHA president Rajkumar Unni had arrived at the Minister’s residence at 6.55 a.m. on April 2. But there was no evidence that he had met or bribed the Minister. The guard register showed that he had left five minutes later. There was no time for his driver to go out a second time to collect the bribe money from a nearby location as alleged.", 
    "section": "national", 
    "title": "Probe absolves Mani of bar bribery charge", 
    "subsection": "general", 
    "date": "2016-01-14"
}