{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "A day after it stood up for the bull’s right to life and dignity by staying a government notification allowing jallikattu, an “unimpressed” Supreme Court refused to alter its stand despite fresh interventions on Wednesday blaming the court for being influenced by the “fogged vision” of city dwellers at the cost of hurting the traditions of pastoral Tamil Nadu.\n\nA Bench led by Justice Dipak Misra held that the stay was granted in accordance with one of the highest of principles enshrined in the Constitution, that is, compassion for living creatures.\n\nIt referred to the Supreme Court judgment of 2014, which held that jallikattu caused “considerable pain and distress to the bulls.”\n\n“The 2014 judgment enshrines the concept of Article 51A (g) and (h) of the Constitution. There cannot be a scintilla of doubt that the Constitution is an organic and compassionate document. We are unimpressed... and do not alter our stay order,” Justice Misra held, adding Pongal will happen even without jallikattu.\n\nThe drama, a sequel to the jallikattu hearing on January 12, started when certain individuals, who claimed to be “affected” by the Supreme Court stay of the January 7, 2016 notification issued by the Ministry of Environment and Forests allowing the sport, made an urgent mention before Chief Justice of India T.S. Thakur on Wednesday morning. They sought to intervene in the Supreme Court to voice the concern of rural Tamil Nadu about the stay.\n\nThe petitioners, led by A. Ramakrishnan, a Chennai resident, was referred by the CJI court to the Bench of Justices Dipak Misra and N.V. Ramana, who had ordered the stay the previous day.\n\nJustice Misra’s Bench took up the matter at 3 p.m. Advocate N. Rajaraman spoke for the rural farmers, who “rear bulls like children and brothers.”\n\n“The 2014 judgment of the Supreme Court did not ban jallikattu. It only said, stop the cruelty. It only asked for safe play, not ban, declaring jallikattu as cruelty,” Mr. Rajaraman argued.\n\nHe contended that a ban will have a sociological impact and a devastating effect on indigenous breeding.\n\n“The stay order is a result of the fogged vision of the city dwellers about what happens at jallikattu. We worship bulls... The farmer, with his moustache twirled, breeds bulls as a matter of pride,” Mr. Rajaraman submitted.\n\nHe warned that the prohibition would only force farmers to now send their bulls to Kerala to be slaughtered.\n\nTo this, Justice Misra asked: “You say you treat these bulls like family members. So now the bull has no purpose, you send them to Kerala for slaughter?”\n\n“It is our necessity. No jallikattu means poverty. Economy will collapse,” Mr. Rajaraman responded.\n\nMr. Rajaraman, at one point, even asked the court to send Animal Welfare Board of India counsel and senior advocate Aryama Sundaram and PETA counsel Anand Grover to visit jallikattu arenas in the capacity of the court’s commissioners to check whether bulls are cruelly treated.", 
    "section": "national", 
    "title": "SC refuses to lift stay on jallikattu", 
    "subsection": "general", 
    "date": "2016-01-14"
}