{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Akhilesh Yadav has suspended four MLAs in Sitapur and expelled many office-bearersin Fatehpur.\n\nWinning 60 out of the 74 posts, the ruling Samajwadi Party secured a resounding victory in the recently concluded zilla panchayat elections in Uttar Pradesh. While the results brought the party much joy, the polls also exposed the fractures and disagreements within the party over selection of candidates and dissent by several senior functionaries.\n\nCracking the whip on dissenters, Chief Minister Akhilesh Yadav on Wednesday suspended and expelled several party members.\n\nProbe launched\n\nActing sternly against rebels in Sitapur, where the party faced open rebellion, the SP has suspended four MLAs — Mahendra Singh alias Jheen Babu, Anoop Kumar, Radheshyam Jaiswal and Manish Rawat. A probe has also been initiated against them.\n\nIn Sitapur, the SP faced embarrassment as Jitendra Yadav, the son of a rebel party MLA Rampal Yadav, defeated the official SP candidate Seema Gupta. The party also dissolved its district executive unit, and removed district chief Shamim Kausar. In Mirzapur and Shravasti districts, too, the SP expelled three zilla panchayat members\n\n“The party has acted against those leaders and office-bearers who opposed our declared candidates, showed indiscipline and made efforts to ensure their defeat,” Cabinet Minister Rajendra Chaudhary said.\n\nFormer MP suspended\n\nThe SP also suspended for six years former Shahjahanpur MP Mithilesh Kumar, while in Fatehpur it expelled around a dozen office-bearers, including former MLA K.K. Singh and former State Minister Samarjit Singh.\n\nDuring the zilla panchayat elections, the SP made it clear that indiscipline would not be tolerated. The party went to the extent of expelling three popular youth leaders, including two close aides of Akhilesh Yadav — Sunil Singh Yadav alias Sunil Sajan and Anand Bhadauria — for anti-party activities. The two were later re-instated.\n\nAkhilesh Yadav suspended four MLAs suspended in Sitapur and expelled many office-bearers in Fatehpur.", 
    "section": "national", 
    "title": "SP rebels face the music after U.P. zilla panchayat elections", 
    "subsection": "general", 
    "date": "2016-01-14"
}