{
    "author": [], 
    "text": "Scientists have discovered the most energetic light ever detected in the universe from the centre of a supernova known as ‘Crab pulsar’ which is situated 6,500 light years away from Earth.\n\nThe Crab pulsar is the corpse left over when the star that created the Crab nebula exploded as a supernova.\n\nIt has a mass of 1.5 times the mass of the Sun, concentrated in about a 10 km diameter object, rotating 30 times per second.\n\nIt is surrounded by a region of intense magnetic field 10 thousand billion times stronger than that of the Sun.\n\nThe pulses were found by researchers working with the Major Atmospheric Gamma-ray Imaging Cherenkov (Magic) observatory in the Canary Islands, Spain.\n\n“We performed deep observation of the Crab pulsar with MAGIC to understand this phenomenon, expecting to measure the maximum energy of the pulsating photons,” said Emma de Ona Wilhelmi from the Institute of Space Sciences (IEEC-CSIC) in Barcelona.\n\nThe new observations extend this tail to much higher, above trillion electron volt (TeV) energies, which is several times more energetic than the previous measurement,” added Roberta Zanin from ICCUB-IEEC, Barcelona.\n\nThe Crab pulsar, created in a supernova explosion that occurred in 1054 A.D., is located at the centre of a magnetised nebula visible in the Taurus constellation.\n\nThe Crab is the most powerful pulsar in our galaxy and it is one of only a few pulsars detected across all wavelengths, from radio up to gamma rays.\n\nIn its rotating magnetic field, electrons and positrons are accelerated up to relativistic energies and emit radiation that arrives to our telescopes in the form of pulses every 33 millisecond, each time the neutron star rotates and meets our telescopic sight.\n\nBefore the MAGIC measurement, this radiation was believed to stop abruptly when the photons reach an energy few billion times larger than visible light.\n\nThe new discovery challenges current theories about how neutron stars operate, the authors of the study noted in a paper that appeared in the journal Astronomy & Astrophysics . — IANS", 
    "section": "national", 
    "title": "The most energetic light ever in space", 
    "subsection": "general", 
    "date": "2016-01-14"
}