{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Discusses security arrangements during electioneering and on polling day\n\nAdditional Director General of Police J.K. Tripathy at the Tirunelveli DIstrict Police Office before attending the review meeting on Saturday.\n\nAdditional Director General of Police (Law and Order) J.K. Tripathy chaired a meeting held here on Saturday to review the law and order situation prevailing in the southern districts and instruct his subordinates the security arrangements to be ensured during the run-up for the poll and also on the date of election.\n\nAs electioneering and polling would usually be a tense affair in the southern districts, particularly in Tirunelveli and Thoothukudi districts, the district administrations, with inputs provided by the police, have identified ‘sensitive polling stations’ wherein Central Forces would be deployed along with the State police on the polling day.\n\nTo decide on the security arrangements to be made during electioneering and also in these polling stations on May 16, Mr. Tripathy had comprehensive discussions with his subordinates.\n\nHe reportedly told his colleagues to prepare a comprehensive list of anti-social elements, who could trigger law and order problems and unleash terror during election campaign and also on May 16 and flush them out in an unbiased manner.\n\nInspector General of Police, South Zone, C. Murugan, Commissioner of Police, Tirunelveli City, R. Thirugnanam, Deputy Inspector General of Police, Tirunelveli Range, R. Dinakaran, Superintendents of Police V. Vikraman of Tirunelveli, Ashwin M. Kotnis of Thoothukudi and G.. Dharmarajan of Kanyakumari and Deputy Commissioners of Police, Tirunelveli City, Santhosh Hadimani (Law and Order) and Rajan (Crime and Traffic) participated in the meeting.", 
    "section": "national", 
    "title": "ADGP reviews law and order situation in the south", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}