{
    "author": [
        "R Srikanth"
    ], 
    "text": "For the low and high-tension industrial consumers who suffered huge losses due to the floods, the ordeal is not over yet.\n\nThis time, it is the electricity bills from the Tamil Nadu Generation and Distribution Corporation (Tangedco) that have added to their financial woes.\n\nAn entrepreneur who had shut down his industrial unit in Ambattur for several days during the heavy rains in November and December last year, has reportedly received electricity bills based on average monthly consumption of the previous months.\n\nThis comes at a time when many of units have suffered enormous losses due to damage to machinery, loss of production days caused by closure of the units and financial loss due to other reasons, the entrepreneur rued.\n\nIn this background, several industrial unit owners whose electricity meters were damaged in the floods were shocked to see exorbitant electricity bills from Tangedco. .\n\nV. Raju, president, Ambattur Industrial Estate Manufacturers’ Association (AIEMA), said the industrial owners who had been facing financial distress because of the flooding saw a glimmer of hope when Chief Minister Jayalalithaa announced that the meters would be replaced free of cost and electricity charges for industrial units that did not operate during the floods would be waived. While the officials of Tangedco have replaced the meters, they have not made good the promise of the Chief Minister to waive the electricity charges.\n\nCircular\n\nHowever, a senior official of Tangedco said a circular had been issued to officials of Chennai, Kancheepuram and Cuddalore to replace meters free of cost and not to collect electricity consumption charges from the affected industrial consumers.\n\nBut Mr. Raju complained that the local officials have denied the issue of any such circular.", 
    "section": "national", 
    "title": "After floods, a power shock", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}