{
    "author": [
        "D J Walter Scott"
    ], 
    "text": "Every day, exactly at 8.30 a.m., the Velavar temple area near the entrance of the Collectorate complex reverberates with the ‘kaaa… kaaa… kaaa’ crowing of birds perched on the branches of a banyan tree as a mechanic walks in to feed them.\n\nR. Jayapandian, who is running a four-wheeler mechanic shop at Bharathi Nagar here, has been feeding the crows for the past two decades and no single day passes without him feeding the crows with the tasty ‘kara bonda’ prepared at the nearby teashop.\n\nIt all began 21 years ago when the mechanic, after his morning walk around 8.30 a.m., bought a couple of ‘bondas’ and threw them for the crows, little realising he was getting locked in an emotional bonding with the birds. When he came the next day around the same time with no memory of the birds, the crows took him by surprise as they swooped down from the tree, voicing ‘kaaa kaaa.’\n\n“That’s how the feeding started,” Mr. Jayapandian told The Hindu. As he continued feeding, the crows started flocking the area in large numbers and now he spends about Rs. 200 a day for feeding about 100 to 150 birds.\n\nThe feeding lasts hardly 10 minutes before he returns to his workshop. The feeding was possible for 21 years thanks to K. Subramanian, who runs the tea shop and had been preparing the ‘bonda’ for about 30 years.\n\nThough he makes both sweet and ‘kara bonda,’ the crows prefer the latter, Mr Jayapandian says. “I will continue feeding the crows during my lifetime as I don’t want to disappoint the birds,” he says. He would not attach any sentiments though it was widely believed that one could appease ‘Sani Bhagwan’ by feeding crows.\n\nAlso in real estate business, when Mr. Jayapandian goes abroad, he would entrust the task with the teashop owner. Except on days when it rains heavily, the crows flocked his shop on all days, says Shanmugam, son of the teashop owner.\n\nIt all began 21 years ago when he threw ‘bondas’for the crows, little realising he was getting locked in an emotional bonding", 
    "section": "national", 
    "title": "Breakfast for the crows", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}