{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Eligible people being sensitised to cast their votes without fail\n\nAppealing to all the staff on poll duty to cast their votes without fail in the ensuing general elections - 2016, a little over 1500 police personnel dressed in khaki and white uniforms from different wings, including Battalion and Home Guards, took part in a human chain and also formed themselves with wordings – “Postal Ballot 100 per cent vote…” at the Armed Reserve Police Grounds here on Saturday.\n\nThe district administration, in association with the police, organised the campaign. Collector and Election Officer K. Veera Raghava Rao, SP Vijayendra S. Bidari and other officials participated in the human chain.\n\nThe SVEEP (Systematic Voter Education and Electoral Participation) is being held to sensitise all eligible people to cast their votes without fail. The district administration had been conducting it with support from educational institutions, NGOs and service organisations. The objective was to cast vote without fail. In this connection, a signature campaign and a cycle rally were also held in the city.\n\nDuring elections, as the government servants would be deployed on poll duty, the Election Commission had earmarked postal ballot for them. However, due to some reason or the other, the officials could not achieve 100 per cent voting by means of the postal ballot.\n\nWhen the last general elections were held, the district had achieved 70 per cent postal ballot. Now, the officials were keen on ensuring 100 per cent votes.\n\nThe SP said that they would enlist all police personnel, Home Guards, Fire Service, Forest Guards and other uniformed personnel to cast their votes this time. The Collector also said that the staff on poll duty would be given training in casting their postal votes.\n\nAn official in the election wing said that lack of awareness of the procedures involved in casting led to invalid votes.\n\nThis time the preparations had been done in a methodical way that 100 per cent would be achieved, the official added.", 
    "section": "national", 
    "title": "Campaign for achieving 100 per cent postal vote", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}