{
    "author": [], 
    "text": "Vaanavil Television from Maayajal Entertainmentis available on a few satellite platforms\n\nAudience looking for more variety on television now have one more channel to watch.\n\nPosters announcing the launch of a new Tamil channel — Vaanavil Television — have been greeting residents for the past few days.\n\nAccording to sources in Vaanavil Television, the channel will have programmes in various genres, including talk shows, reality shows, television serials and films. A variety of topics, including health, lifestyle and fashion, will be covered.\n\nA colourful logo inspired by the seven colours of the rainbow has been designed for the channel; this is aimed at conveying the idea of variety, sources say.\n\nAs of now, the channel from Maayajal Entertainment is available on a few satellite platforms and it is in the process of tying up with other digital platforms to reach out to a wider audience.\n\nThe channel was launched on February 14.\n\nA Tamil channel for 24X7shopping\n\nEarlier this week, Shop CJ Network Limited launched its 24X7 home shopping channel in Tamil.\n\nHome shopping, which has a market of over Rs. 3,000 crore in India, is immensely popular as it gives the buyer the option of purchasing things from the comfort of their homes, choosing from the options presented on television.\n\nDhruva Chandrie, Chief Operating Officer (COO), said that Tamil Nadu was one of the States with a high penetration rate of television and that was the reason for this new initiative.\n\n“Products on offer include cosmetics, fashion, small household and kitchen appliances and jewellery,” he said. Shop CJ Network also has a seperate web and mobile app platform.\n\nWhen asked about the successful product ranges, Mr. Chandrie said that cosmetic and household appliances had been a huge hit among viewers.\n\n(Reporting by K. Lakshmi and S. Poorvaja)", 
    "section": "national", 
    "title": "Channel promises variety of content", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}