{
    "author": [], 
    "text": "RELIGION\n\nGita: R. Aravindan, Andhra Mahila Sabha, Luz, Mylapore, 7.30 a.m.; Satyaprabhananda, Ramakrishna Mission Ashrama, M.S. Salai, T. Nagar, 5.30 p.m.\n\nUpanishad Saaram: Jamadhagni, Vyasa Mandali, 3rd St., V.V. Colony, Arumbakkam, 7 p.m.\n\nVishnu Sahasranamam: Velukkudi Krishnan, Valluvar Gurukulam School, West Tambaram, 7 p.m.\n\nNammazhvarum Thiruvaimozhiyum: Bharathi Suraj, Seetharama Bavanam, 7, Hariharan Hospital Rd., Nanganallur, 6.45 p.m.\n\nPathivrutha Mahatmyam: Aravind Lochanan, Sitadevi Garodia Hindu Vidyalaya MHSS., Kalamegam St., East Tambaram, 6.45 p.m.\n\nVinayagar Agaval: Amaresh, Chinmaya Satsang Hall, Chinmaya Nagar, 6.45 p.m.\n\nYoga Vaasishtam: T.G. Narayanaswamy, 273-B, 2nd Main Rd., Natesa Nagar, Virugambakkam, 6 p.m.\n\nKandharanuboothy: K. Sundaram, Perambur Kalvi Kazhagam, 12/2, Gurumurthy Garden St., Perambur, 10 a.m.\n\nBrahmasutras: Satyavratananda Saraswati, Kesari HSS., Pondy Bazaar Extn., T. Nagar, 5.30 p.m.\n\nBhagavan Sri Ramakrishna: 181st Jayanthi celebrations, Ramakrishna Math, Mylapore, 4.30 p.m.\n\nBhajans: N.V. Sankar, Sri Vishnu Mohan Foundation, 7/15, New Giri Rd., T. Nagar, 6 p.m.\n\nCULTURE\n\nSampradaya Anushtana Rakshana Abhiman: Launch of publication ‘Yamunai Thuraivar Thirumuttram’, Kalyan Nagar Association Hall, West Circular Rd., Mandaveli, 6.30 p.m.\n\nGENERAL\n\nVista India Communication Inputs: Distribution of Mayan awards 2015, Governor K. Rosaiah participates, The Raintree Hotel, 11.30 a.m.\n\nAlumni Association – College of Engineering Guindy: Alumni Day, Anna University, Guindy, 3 p.m.\n\nMeenakshi Academy of Higher Education and Research and Meenakshi Medical College Hospital and Research Institute: CME on Rheumatology – Rheuma Basics 2016 ‘To approach Rheumatology in a rational way’, Vembuliamman Koil St., West K.K. Nagar, 10 a.m.\n\nArunodaya Centre for Street and Working Children: Convention on ‘Adolescents voice against drug and substance abuse’, Selvarani Mahal, 232, Surya Narayana St., Royapuram, 4 p.m.\n\nTamil Nadu Investors Association: SEBI’s securities awareness programme, PS HSS., Mylapore, 10 a.m.\n\nMa Foi Foundation: Alumni day celebration, Agni College of Engineering, Thalambur, 3 p.m.\n\nKRM Public School: Programme on ‘Paridhi – Vernal Equinox’, 2nd Lane, Shanthi Nagar, Sembium, 9 a.m.\n\nChennai Storytellers: Programme, Anna Library, Kotturpuram, 11 a.m.; and Odyssey Book Store, Adyar, 5 p.m.\n\nPappichetty Ragaviah Chetty’s Charities: Founder’s day celebrations, P.R.C.C. Centenary Hall, 21/17, Venkatraman St., T. Nagar, 6.30 p.m.\n\nAnna Nagar Thamizh Sangam: Meeting, 14, D Block, 2nd Avenue Extn., Anna Nagar East, 10 a.m.\n\nLions Club of Meenambakkam Charitable Trust: Programme to raise funds to run medical project ‘Lions Chinmaya Medical Center’, Music Academy, T.T.K. Salai, Alwarpet, 7 p.m.\n\nSankara Eye Hospital: Eye Camp, SKDT HSS., AGR Cinema Theatre, Villivakkam, 9 a.m.; Govt. HSS., Tirutani Rd., Kanakamachattiram, 9 a.m.\n\nNarcotics Anonymous: Meetings, Good Company Group, St. Teresa Church, Nungambakkam, 11 a.m.; Miracle of Marina Group, Chennai School, Venkatarangam Pillai St., T. Nagar; and Circle of Life Group, Annai Velankannai Church, Besant Nagar, 7 p.m.\n\nAl-Anon: Meetings, Holy Angels Convent, T. Nagar, 11 a.m.; Rise and Redeemers Church, United India Colony, Kodambakkam, 4 p.m.; St. Francis Xavier Church, Broadway; and ‘Sri Sathya Sai HSS., Theradi, 6 p.m.; Kesari HSS. T Nagar; and CSI Weekly Church, Poonamallee, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}