{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CII SME Finance Facilitation Centre works as one-stop shop for funding\n\nThe SME Finance Facilitation Centre of CII has facilitated the members of Small and Medium Enterprises to receive loan from various banks to the tune of Rs. 650 crore, according to Amit Kumar Tripathi, Deputy Director, Confederation of Indian Industry.\n\nSpeaking at a session on “empowering SMEs through addressing the finance needs” here on Friday, he said accessing credit had been a major issue of SMEs. To address the issue, the CII had launched the SME Facilitation Centre to facilitate the financial requirements of its members. It had arranged finance to the tune of Rs. 650 crore during the last one-and-a-half years.\n\nThe Centre, which was functioning online, is providing advisory and credit facilitation support to SMEs.\n\nIt is operating as a one-stop-shop, aggregating financing options from multiple large financial institutions.\n\nIt had received tremendous support from the SMEs since it was launched in 2014 as they just wanted to apply through online.\n\nThe facilitation centre took just 24 hours to process the application received from all corners of the country and then forwarded to the banks. Since they were referred to the headquarter branches of banks, the loan applications had been given due importance by the officials. There were many instances in which loans were cleared within 15 days of submitting applications.\n\nMr. Tripathi said the CII had partnered with leading banks and financial institutions, including State Bank of India, Indian Overseas Bank, ICICI Bank, Indian Bank, Federal Bank, SIDBI, Union Bank of India, Lakshmi Vilas Bank, DHFL, Electronica Finance Ltd., Muthoot Fincorp, Reliance Capital, and Religare Finvest.\n\nS. Sampath, Chairman, CII, Tiruchi zone, said the loan facilitation concept had given a big boost to the SMEs.\n\nThe SMEs in Tiruchi region should come forward to use the unique opportunity. The interested SMEs could apply for their fund requirements through the CIIs online portal and could establish access to multiple banks and NBFCs through the centre.\n\nThe CII members of the region should create awareness among the members. The non-members could utilise the opportunity.\n\nN. Kanagasabapathi, president, TIDITSSIA, and Senthil Kumar, secretary, BHELSIA, spoke.\n\nCreating awareness\n\nKARUR: Speaking at a seminar on MSME Financing hosted by the CII in Karur on Thursday, Mr. Tripathi said CII SME Finance Facilitation Centre was working towards creating awareness amongst the SME members about various financing options and schemes.\n\nThe centre will match the SMEs financing demands with the banks and financial institutions, and project large requirements for finance across financial institutions, provide facilitating role for SMEs to approach the process of accessing funds in a more professional manner. It also work towards creating financial literacy among the SME members by organising road shows, seminars, and webinars.\n\nSudhakar Palanisamy, Chairman, CII Karur, said SME’s had a huge potential to grow and there was a pressing need for setting up a apparel cluster to ensure that SME are provided with credit at cost effective rates, to meet their demand for working capital as well as expansion and diversification.\n\nIt had been observed that the delay and other issues related to credit delivery was primarily because of lack of understanding of various schemes offered by the banks and financial institutions as well as the procedure and documentation required for processing credit from banks.\n\nHe released the CII SME Finance Facilitation Centre brochure and the first copy was received by M. Nachimuthu, President, Karur Textile Manufacturers and Exporters Association, and M.K. Rajendheren, Vice-Chairman, CII, Karur.", 
    "section": "national", 
    "title": "CII arm helps SMEs secure loans of Rs. 650 cr.", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}