{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Leaders instruct local office bearers to begin talks\n\nThe number of seats Congress and DMK will be contesting in the forthcoming Assembly polls will be known by next week, according to party leaders of both parties.\n\nFollowing the meeting of senior Congress leader Ghulam Nabi Azad and DMK president M. Karunanidhi last month, the alliance between the two parties was firmed up in Tamil Nadu and Union Territory of Puducherry.\n\nTop level leaders of both parties have instructed the local office-bearers of the parties in the Union Territory to begin talks with leaders of the Puducherry Congress Committee shortly on seat-sharing and identifying winning constituencies.\n\nPradesh Congress Committee president A. Namassivayam told The Hindu , “The number of seats will be decided by next week when our senior Congress leader Ghulam Nabi Azad will meet DMK president M.Karunanidhi in Chennai. Then only a clear picture will emerge in seat-sharing talks between both parties.”\n\nParty sources indicated that by the time of seat-sharing talks between the parties will be concluded in Tamil Nadu, the number of seats and the name of constituencies where both parties will be decided.\n\nDuring 2011 Assembly polls, the Congress-DMK combine forged an alliance with Pattali Makkal Katchi (PMK) and Viduthalai Chiruthaigal Katchi (VCK). Then the DMK was allotted 10 seats, PMK- 2 and VCK- 1 while Congress contested in 17 seats. Congress- DMK alliance won 9 seats. Congress bagged seven seats while the DMK got only two.\n\nThis time DMK Puducherry unit is likely to demand over 12 seats from Congress which is heading the alliance in the Union Territory.\n\nDMK north unit convener and former minister S.P.Sivakumar said by next week there will be meeting with top level leaders of both parties in Chennai.\n\nThen they will decide the number of seats and later on, we will commence discussion on identifying the prospective constituencies. There will not be any hitch in the talks.”", 
    "section": "national", 
    "title": "Congress, DMK decision on seat-sharing next week", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}