{
    "author": [
        "T K"
    ], 
    "text": "Authenticity of data reported by the State also comes under cloud\n\nA provisional ‘State of the Nation, RTE Sec 12 (1) (c), 2016’ report, prepared by the Right to Education Resource Centre (RTERC) at IIM-Ahmedabad, has found school participation rate in Tamil Nadu has risen to 51.24 per cent in 2014-15 from 23.65 per cent in 2013-14.\n\nThe State had claimed a school participation rate of 76 per cent in the data submitted to the Centre. But, RTERC, using numbers reported under District Information System for Education (DISE), and further cleaning up the data, found that the State had a participation rate of 51.24 per cent.\n\nTamil Nadu also had a high seat-fill rate of 37.75 per cent in 2014-15 compared to 13.82 per cent in 2013-14. “Out of 1,29,104 seats available under this section, 48,740 seats were filled in 2014-15,” according to the report. Only Delhi with a seat-fill rate of 44.61 per cent and Rajasthan with 39.26 per cent were ahead of Tamil Nadu.\n\nBut, Prince Gajendra Babu, General Secretary of State Platform for Common School System,says the state government’s position on the issue fails to provide equitable action to children. The report has found that the State had neither appointed any authority to oversee the selection process nor prescribed any upper or lower age limit for any class.\n\nThe report found that Tamil Nadu had not mentioned how frequently the per-child expenditure would be calculated or any authority financially responsible for books and uniforms.\n\n“The Tamil Nadu government has sanctioned Rs. 97 crore for reimbursement to the schools admitting students under this section. But the government has not released any order on the spending per student for LKG and UKG. So, they are paying what the schools ask,” he said.\n\nMr. Babu said the government had said it would pay the fees determined by the fee determination committee. “But, in many cases the fees for LKG and UKG in these schools are more than what is spent by the government for 1{+s}{+t}standard. It is an illegal transfer,” he alleged.\n\nThere also seems to be a discrepancy in the numbers sought under the Right to Information Act and numbers reported by the State, according to the report. Under the Central RTI, 1,31,566 students were admitted during 2014-15. But data from other sources – numbers reported by the states to the Centre and from state governments’ website – found only 86,729 students admitted during the year, the report said.", 
    "section": "national", 
    "title": "Despite high ‘seat fill’ rate, State’s RTE record chequered", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}