{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Dravida Munnetra Kazhagam, if voted to power in the May 16 Assembly polls, will create de-addiction centres in all government hospitals, besides clamping total prohibition in Tamil Nadu, party’s Rajya Sabha MP Kanimozhi has said.\n\nAddressing a meeting organised at Venkataampattti near Kadayam in Tirunelveli district on Saturday evening to highlight the need for total prohibition in Tamil Nadu, Ms. Kanimozhi said the DMK president, M. Karunanidhi, who waived crop loan to the tune of Rs. 7,000 crore when he assumed office as Chief Minister in 2006, despite acute financial crunch, would enforce prohibition in the State if he was voted to power in 2016. Having realised the problems faced by women and children from their alcoholic breadwinners, he would do it positively.\n\nApart from women and children, even men, especially students, had started demanding the enforcement of prohibition in Tamil Nadu as they were personally experiencing this agony on a daily basis. “The DMK, which deems it as the ‘Voice of the Society’ will certainly respect it and clamp the ban on sale of liquor. Since the breadwinners, instead of going for work, are going to the liquor shop as they get up from bed as they have become addicts, the DMK government will create de-addiction centres in every government hospital to rehabilitate our men who have become alcoholics,” Ms. Kanimozhi said.\n\nAddressing a public meeting in Tirunelveli Town in the night, the DMK MP demanded CBI enquiry into the mysterious suicide of S. Muthukumarasamy, Executive Engineer, Department of Agricultural Engineering.\n\n“As the upright officer refused collect bribe for appointing drivers in his department, he was threatened by his bosses to budge. When he resisted, he was threatened. Having left with no other option, he was forced to commit suicide by jumping in front of a train. Since the CB-CID, which is probing this case cannot bring the real culprits to book, this case should be handed over to CBI,” she said, adding that the DMK, if voted to power, would do so as promised in the case of police officer Vishnupriya, who also committed suicide.", 
    "section": "national", 
    "title": "DMK will create de-addiction centres, says Kanimozhi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}