{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In its attempt to ensure smooth, effective and transparent election process in all poll-bound States, the Election Commission has taken to technology big time, as it would be using new and upgraded tools for monitoring the election process.\n\n“The ambit of IT application associates itself with national level data compilation of electors, functioning at polling stations, work allocation of officers on duty, use of mobile application and technology, GIS technology, etc.,” an official press note of the Election Commission stated.\n\nSystems and apps\n\nThe Commission has also named several systems it plans to employ during the poll process. While Samadhan is a public grievance redressal system conceptualised as a comprehensive system with multiple modes for receiving complaints such as online, SMS, email, mobile, fax and post, Suvidha is a single window system for candidates and political parties to apply for various permissions. The EC has issued directions to give permissions within 24 hours.\n\nLikewise, Sugam is a vehicle management system with the facility of issuance of requisition letters for vehicles, capturing of vehicle details with address, mobile number of owners and drivers.\n\nA bouquet of android applications has been developed by the Election Commission which it intends to use in the forthcoming polls.\n\nMatdata – android app for voters’ facilitation for search in electoral roll and location of polling station, Matdaan – android app for poll day monitoring at polling stations, Elecom – android app for releasing election news are some of them.\n\nBesides the android applications, there are applications for SMS poll monitoring to be used by presiding officers, e-counting - android app for viewing counting trends/result, Genesys & EVM randomisation for pre-counting applications, expenditure monitoring and candidates.\n\nAll-party meeting\n\nThe Commission held at all-party meeting in Delhi on Saturday with regards to the Assembly polls in four States and Puducherry.", 
    "section": "national", 
    "title": "EC to employ several IT initiatives, apps", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}