{
    "author": [
        "Dennis S"
    ], 
    "text": "It is not possible as it is against the law, says Rajesh Lakhoni\n\nThe representations by private companies and the Information Technology Department seeking to exempt them from declaring a holiday on the day of the elections (May 16) cannot be accepted, Chief Electoral Officer Rajesh Lakhoni on Saturday clarified and said that it would not be possible, as it was against the law.\n\nMr. Lakhoni said, “The IT Department has received representations seeking an exemption. It is not possible and cannot be accepted, as it is against the law governing elections.”\n\nElaborating on the plea of these companies, he said, “They have claimed that they were running three shifts within 24 hours and hence if they declare a holiday for the entire day, all three shifts would be affected. They asked if there could be a partial holiday. But, going by the rule, the entire day of polling should be declared a holiday.”\n\nEven in a meme tweet posted in its official twitter handle @TNelectionsCEO, to a query posed by a person, “Sir, last time many corporate companies didn’t announce holiday on election day. What abt this time..?”, the reply given by the CEO was, “It will definitely be done this time.”\n\nIt may be recalled that the National Association of Software and Services Companies (NASSCOM), the apex body for Information Technology and Information Technology Enabled Services industry, too had sent a letter to the Election Commission, requesting an exemption from full holiday on May 16.\n\n28,000 polling booths\n\nAccording to the Election Commission, around 28,000 polling booths would be web streaming and another 10,000 of them would be video recorded during the May 16 polls.\n\nThere are a total of 65,616 polling booths across the State.", 
    "section": "national", 
    "title": "Exemption from mandatory holiday not possible: CEO", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}