{
    "author": [], 
    "text": "In the last five years Rs. 1.8 crore has been paid to farmers across State\n\nThe State government has informed the Madras High Court that in the last five years Rs. 1.8 crore has been paid as compensation to farmers, whose crops were destroyed by wild boars.\n\nThe government made the submission before the First Bench headed by Chief Justice S.K. Kaul on a Public Interest Litigation (PIL) petition moved by A.R. Gokulakrishnan, a resident of Kodaikanal, Dindigul district, seeking for a direction to take remedial measures to prevent the menace of wild boars, which are allegedly destroying crops.\n\nAccording to the petitioner, wild boars are a major problem for farmers across the State, particularly in areas bordering forests and hill stations like Kodaikanal. “Farmers in these areas are spending sleepless nights guarding their crops from being destroyed by the wild boars,” he said. When the PIL came up for hearing, V.K. Melkani, Principal Chief Conservator of Forests and Chief Wildlife Warden of Tamil Nadu, admitting that population of wild boars has abundantly increased, said, “The human being-wild pig conflict is a serious concern for wildlife managers and conservationist. Overabundance of wild pig population, scarcity of food and shrinking natural habitats have compelled the boars to intrude the forest fringe villages and farms. The farmers in such areas are facing considerable economic loss.” Noting that crop damaged by wild pigs were being compensated by granting a maximum of Rs. 25000 per acre, the officer said, “During the last five years Rs. 1.8 crore has been paid to the affected farmers in Tamil Nadu.”\n\nRecording the submission, the Bench said, “This is a man-animal conflict arising from the man spreading into areas which are the habitats of the animal. This increase is also a result of the predators of the boar being destroyed in the man-animal conflict affecting the very cycle of the ratios of the population of different kinds of animals.”\n\nAs the petitioner expressed his satisfaction over the measures taken by officials to curb the menace, the Bench closed the petition accordingly.\n\nPIL plea sought a direction to take steps to prevent menace of wild boars in Kodaikanal", 
    "section": "national", 
    "title": "Farmers affected by wild boar menace paid compensation: State", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}