{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In a bid to promote stakeholders relying on Small and Medium Enterprises (SME) in Thoothukudi, the Confederation of Indian Industry (CII) has introduced CII-SME finance facilitation centre here on Saturday. At a programme organised by the CII in Thoothukudi on empowering SME’s through addressing their financing needs, Amit Kumar Tripathi, Deputy Director, CII, released the facilitation centre’s brochure. This centre would help the SMEs in the process of mobilising funds in a professional manner. Initially, the CII launched a facilitation centre in New Delhi in June, 2014 and signed memoranda of understandings with 17 banks and non banking financial companies.\n\nSince the setting up of these facilitation centres, credit facilities to the tune of Rs.650 crore had been sanctioned to the SME sector. Once a stakeholder applied for credit requirements through www.mycii.in , he would get his primary sanction within 15 days.\n\nHe also explained the participants about the role of the facilitation centre, which works towards creating awareness amongst the SME members about various financing options and schemes. The centre would operate as a one-stop-shop, aggregating financing options from multiple, large financial institutions to match SMEs demands.\n\nMeanwhile, he said new services such as SME insurance, complaints and advisory services would be posted on the centre’s portal. Similarly, programmes involving SME stakeholders and partner banks were organised in Tiruchi, Karur, Erode and Tirupur over the last week.\n\nD.R. Kodeeswaran, Secretary, Indian Chamber of Commerce and Industry, (ICCI) Thoothukudi said timely and adequate financial support is the need of the hour for SME’s. He said “the MSME sector is the second largest employer next to agriculture sector and the MSME sector contributes to 40 percent of total exports and to around 45 percent of manufacturing output of India.”\n\nThe ICCI of Thoothukudi would soon launch the ‘Angel Investors Forum,” he said. D. Senthilkannan, Chairman, CII, Thoothukudi and P. Mayilvel, Vice Chairman of CII also spoke.", 
    "section": "national", 
    "title": "Finance facilitation centre to help SMEs in Thoothukudi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}