{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They secured loans to buy costly cell phones by submitting fake documents\n\nThe Chennai City police have arrested five persons who attempted to defraud a financial firm by trying to purchase costly mobile phones by submitting fake documents.\n\nAttempt to buy mobile\n\nA senior official of the City police said K. Ranjith (23) and Sivanesan (25) had visited a mobile phone showroom on Anna Salai and attempted to purchase a costly mobile phone through interest-free loan by submitting fake a Permanent Account Number (PAN) card and driver’s licence on March 14.\n\nHowever, following verification, the officials of the financial firm found out that the documents were false.\n\nSpecial team formed\n\nBased on a complaint filed by the manager of the showroom at the Anna Salai police station, a special team was formed to apprehend the culprits.\n\nThe team arrested the gang involved in the purchase of costly mobile phones and electronic goods using fake documents.\n\nThe police arrested five persons — Ranjith, A. Vijayadurai, C. Bharathidasan, G. Venkatesan and R. Jagadeeshbabu. They are searching for Sivanesan, who is absconding.\n\nShowrooms cheated\n\nOn investigation, the police officials found out that the gang had cheated several mobile phone showrooms and financial firms by purchasing mobile phones, laptops and other electronic items by submitting fake documents and not paying back the loan amount.\n\nThe police also seized laptops, iPhones, false PAN cards and drivers’ licences.\n\nThe five arrested persons were produced before the Judicial Magistrate and they were remanded in the Puzhal prison.\n\nEOM\n\nIn November 2012 the Central Crime Branch arrested Muthuvel, a resident of Nandanam, for cheating a bank of Rs. 75 lakh by producing fake PAN card and ration card to secure housing loan.\n\nSpecial police\n\nteam seize laptops, iPhones, false\n\nPAN cards and drivers’ licences", 
    "section": "national", 
    "title": "Five of a gang that cheated financial firms arrested", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}