{
    "author": [
        "Special Correspondent"
    ], 
    "text": "N. Seshadri,Director, Distance Education, SASTRA University, speaking at 'Teachers education meet' at the Bharathidasan University Department of Educational Technology in Tiruchi on Saturday.— PHOTO: B. VELANKANNI RAJ\n\nStudents aspiring to become teachers should focus on innovation and updating their teaching skills taking advantage of the present-day information and communication technology (ICT) said speakers at a “Teacher Education Meet 2016” organised by the Department of Educational Technology of Bharathidasan University here on Saturday. They said the teachers would be isolated if they failed to utilise the applications of ICT.\n\nN. Seshadri, Director of Distance Education, SASTRA University, said that teaching required innovative skills. He suggested that the B. Ed. students should adopt humour as a strategy while handling classes.\n\nMaximum utilisation of information, communication and technology gadgets would go a long way in achieving the desired goal of achieving a participatory approach in classrooms.\n\nE. Ramganesh, Professor and Head, Department of Educational Technology, said the Bharathidasan University had evolved a series of innovative techniques which were web-based utilising e-resources. Mobile-based strategy, i-pad based approach, virtual content had been evolved. The objective of the meet was to create awareness among the B. Ed students about the application of the e-content in lesson plan and micro teaching.\n\nStudents from 20 educational colleges across eight districts in the jurisdiction of the university participated in the meet. A competition was organised on the topics “Lesson Plan writing” and “Micro Teaching” for the B. Ed students.\n\nC. Thiruchelvam, Registrar of the university, gave away the certificates and cash awards to winners in the competition.\n\nR. Vinija and A. Priyadarshini won the first and second prize in “Lesson Plan writing”.\n\nA. Mohamad Ismail and S. Sindhu won the first and second prize in “Teaching skill”.\n\nAn interaction was held and the discussions were based on papers submitted by the students.", 
    "section": "national", 
    "title": "‘Focus on innovation in teaching and adopt ICT’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}