{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Circular sent to heads of departments\n\nThe election authority has warned of strict action against government servants who indulge in political work during forthcoming elections.\n\nThe Department of Personnel and Administrative Reforms, District Election Officers and Regional Administrators have sent a circular to heads of departments in the Union Territory.\n\nIn a circular, District Election Officer S.Sundaravadivelu said that following the announcement of the election schedule on March 4 by the Election Commission of India (ECI), the Model Code of Conduct had come into effect from the date of announcement. The Election Commission had received complaints earlier that some Central/ State government servants were actively participating or associating in the work of political parties and candidates, which is contrary to Rule 5 of Central Civil Services(Conduct) Rules 1964 and such acts also warrant disciplinary action.\n\nAs per the said Rule, “No government servant shall be a member of, or be otherwise associated with, any political party or any organisation which takes part in politics nor shall he take part in, subscribe in aid of, or assist in any other manner, any political movement or activity.”\n\nSection 129 of Representation of People (RP) Act 1951 bars government servants from acting for candidates or influencing voting during election and contravention of this provision penalises the offender with imprisonment which may extend to six months or fine or both.\n\nUnder the RP Act, penalty can be imposed on government servants for acting as polling agent, election agent or counting agent. Any person in government service indulging in such activities shall be punishable with imprisonment for a term which may extend to three months or with fine or with both.\n\nDr.Sundaravadivelu said all secretaries to government and heads of departments/ offices of Central and State governments functioning in the Union Territory were being requested to instruct the government officers / servants subordinate to them to follow the guidelines.\n\n“Any violations of the directions of the Election Commission by any government will be viewed very seriously and penal action will be taken against the offenders as per the relevant Acts and Rules,” he also added.\n\nUnder the RP Act, penalty can be imposed on government servants", 
    "section": "national", 
    "title": "Govt. servants warned against political work", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}