{
    "author": [], 
    "text": "Manimaran’s Pugazh gets off to a shaky start. After a brief prologue hinting at dangers in the present, we slip into the past, into cliché. The hero – Pugazh (Jai, in his comfort zone) – heads to Puducherry with friends in order to drink and ogle at pretty blondes. Then, on to the heroine, Bhuvana (Surabhi, yet another of those heroines who, in this milieu, looks like a model for the ‘after’ half of a Fair & Lovely commercial, who strayed into the audition room for the ‘before’ half). Her one character trait – she stands up for her beliefs – is hammered home till the home is in splinters. She won’t stand for someone dumping garbage in front of her house. She won’t stand for a fish seller charging extra. After a few scenes, she forgets she has this trait. She slips into regular heroine duties, making moony eyes at the hero, sulking when their engagement is called off instead of giving him a piece of her mind. I mean, if she could get so worked up about fish...\n\nPugazh is ostensibly about a playground in Walajapet, Vellore, that’s being eyed by a greedy (and well-connected) developer – but this playground is a MacGuffin. It only seems important. The meat of the film is a character study about Pugazh’s friend Venkat and a small-time politician named Das (Marimuthu, who’s become a specialist in playing casually understated evil). But here’s the thing. Das isn’t the one-note bad guy we know from the movies. When Pugazh first locks horns with Das, the latter shoots him a look that says, “I’m going to be your sworn enemy till the end credits roll.” But unlike villains in most other films of this nature, it isn’t personal for Das. It’s business. He doesn’t really care about settling scores with Pugazh. He just wants to do his job, without anyone coming between him and the money he badly wants to make, something his disgruntled wife keeps pointing out.\n\nAnd so we inch into the film’s most interesting aspect, the reminder that politics, for some, is a job – only, the salary comes in briefcases instead of a bank deposit at the beginning of the month. In many ways, Pugazh is Venkat’s story. He’s unemployed. He’s neck-deep in debt. He needs a job. Hence, politics. Pugazh is the latest in a line of films – Poriyaalan, Madras – where a hackneyed angry-young-man plot is livened up by grit, texture. It’s fiction with the journalistic underpinnings of non-fiction. We are privy to the inner workings of a caste-based party that’s fighting elections against a secular party, and we see the hierarchies. Venkat looks up to Das. Das looks up to the minister, whose son-in-law wants that playground. (Like the playground, the son-in-law only seems important – he’s a MacGuffin villain.)\n\nThe people seem down-sized, real – even the sidekicks (a flirty friend, a wisecracking friend played by RJ Balaji). They contain contradictions. Pugazh’s brother Arasu (Karunas, very effective in a rare dramatic role) rails at Das for his part in the death of an old man – the preachy mouthpiece for the director’s messages; mercifully, he comes under a truck – but after Das drives off, he turns to Pugazh and vents a ton of frustration, born of the middle-class instinct to stay out of others’ affairs, especially when those others are powerful people. Pugazh himself is no saint. He sees Venkat’s soul corroding before his eyes, and when he asks Venkat to quit politics, we brace ourselves for a high-minded speech about values and integrity, seasoned with a splash of indignation. But Pugazh has a (relatively) selfish motive as well. When people cannot find Venkat, they land up at Pugazh’s doorstep with their complaints, saying that they voted for Venkat because Pugazh asked them to. (He even asks Bhuvana to cast an illegal vote, under someone else’s name.) Pugazh is a collection of good bits of writing, good intentions, but they don’t add up to a consistently good film because it wants to be both a rooted ensemble drama and a masala-style solo-hero narrative.\n\nWe get neither. Venkat’s arc needs closure. His character, after a point, feels as if there are parts the editor forgot to splice in. (These missing parts must exist alongside the scene that tells us what happened to Bhuvana’s job offer, in Hyderabad. It’s brought up once, then everyone forgets about it.)\n\nbaradwaj rangan\n\nPugazh\n\nGenre: Action\n\nDirector: Manimaran\n\nCast: Jai, Surabhi\n\nStoryline: Yet another angry young man fights the system\n\nBottomline: A middling drama somewhat redeemed by grit, texture", 
    "section": "national", 
    "title": "Ground realities", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}