{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Sri Ramakrishna Hospital on Saturday broke the Guinness World Record for ‘Most people to sign up as organ donors in eight hours’. The hospital had enlisted the support of 13,459 persons in the eight hours that ended at 4.05 p.m. The supporters had pledged to be organ donors.\n\nBut well before the deadline, the hospital, with help from the student volunteers of the SNR Sons College, had managed to take the pledge from more than 13,000 persons, said K. Karunakaran, principal. As of 3.55 p.m., the number of people who had passed the entry point had touched 13,206.\n\nThe Official Adjudicator from Guinness World Records Sofia Greenacre said that the college had broken the record set on December 1, 2013 by Indian National Students Organisation at Sir Chhotu Ram Stadium in Rothak, Haryana, wherein 10,451 people had pledged their organs. The college had sent invite to 35 institutions in and around Coimbatore, including polytechnic colleges, to send their students above 18 years of age to the record breaking attempt and also pledge to donate organs after death. Twenty of the institutions responded, Mr. Karunakaran said.\n\nAside from inviting institutions, the college students reached out to various sections of society so that members of the public could also pledge to donate their organs, said Sri Jayalakshmi Suresh, a second year biotechnology student.\n\nIt was she and her friends who initiated organ donation in the organ donation drive in the college last year, he added. Ms. Jayalakshmi said that she and 34 of her friends first pledged to donate organs on August 6, 2015, which was World Organ Donation Day. Their act caught the imagination of other students, who too jumped in.\n\nQuickly, it became a movement and turned into an effort to break the Guinness World Record.The students of her college reached out to those in sister institutions and also others in the district. They also created awareness among the public through street plays, she added.\n\nAt the SNR Sons College, volunteers gave organ donation forms to visitors, who filled the same and presented it at the registration counters, where volunteers stuck bar coded stickers on the forms and wrapped bar-coded bands on the visitors’ wrists.\n\nThe visitors then walked in queues to enclosures of 50 seats each. After every enclosure was filled, the volunteers collected their forms and led them to the exit. The forms collected were counted to verify if the number matched the reading at the registration counter. Ms. Greenacre said that the auditors verified the forms to ensure that invalid forms were not counted and the number of invalid forms did not exceed 10 per cent. If it had exceeded, then the record attempt would be declared unsuccessful. But the number of invalid forms was fewer than 200, said V. Ramakrishna, chief operating officer, SNR Sons Charitable Trust.", 
    "section": "national", 
    "title": "Guinness World Record in organ donation pledging", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}