{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has begun to receive complaints of the crucial post of Presiding Officer of Debts Recovery Tribunal (DRT) here lying vacant since the tenure of K. Harinarayana came to an end on August 9 last year.\n\nDuring the hearing of a writ petition filed by a loan defaulter challenging a private bank’s move to sell his properties, the petitioner’s lawyer told a Division Bench of Justices S. Manikumar and C.T. Selvam that he could not move the DRT due to the absence of Presiding Officer.\n\nHe also brought to the notice of the court that cases pertaining to DRT-Madurai were now being heard by DRT-Coimbatore, which hears Madurai cases only on specific days thereby making it virtually impossible to move urgent petitions seeking interim orders.\n\nConfirming the hardships faced by litigants and lawyers due to absence of Presiding Officer, advocate V. Karthikeyan said it had led to backlog of huge number of cases under the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest (SARFAESI) Act, 2002.\n\nHe pointed out that DRT-Madurai, established in January 2007, exercised jurisdiction over Dindigul, Erode, Kanyakumari, Karur, Madurai, Namakkal, Theni, Ramanathapuram, Salem, Sivaganga, Tiruchi, Thoothukudi, Tirunelveli and Virudhunagar districts.\n\n“The DRTs were established across the country with the specific objective of providing expeditious adjudication and recovery of debts due to banks and financial institutions and like all other tribunals in the country, the Madurai DRT was doing a good job until the vacancy arose,” he added.\n\nSources in the tribunal said that the Union Ministry of Finance had issued a notification in March 2015, much before the tenure of Mr. Harinarayana came to an end, calling for applications from eligible candidates in the cadre of District Judge to be appointed as the Presiding Officer.\n\nIn pursuance of the notification, the Selection Committee too met here in October last.\n\nHowever, it could not find a suitable candidate for the post and so the appointment remained inconclusive. Apart from the Presiding Officer, other posts such as Recovery Inspector and Stenographer are also lying vacant in the tribunal here.", 
    "section": "national", 
    "title": "HC receives complaints of DRT-Madurai remaining headless", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}