{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Holds that encroachers are also entitled to power supply since it was a basic human right\n\nEncroachment of government lands per se cannot become a ground for others to file cases in courts seeking a direction to evict the encroachers since it is common for the landless poor in the country to encroach on public properties and get it regularised by the State after a few years, the Madras High Court Bench here has said.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam made the observation while dismissing a public interest litigation petition filed by Raja Mohan alias Mohan, a former ward member of Manachanallur Panchayat Union in Tiruchi district, accusing a group of people of having encroached on Government Tharisu (fallow) land in Sanamangalam village.\n\nWriting the judgement for the Bench, Mr. Justice Manikumar said: “In a country like India, poor and landless people, some times encroach upon government ‘Poromboke’ (waste) lands. Encroachments made over a period of time have also been recognised by the government so as to enable them to seek patta (land ownership document) if such lands are not required by the government.\n\n“Unless and until public at large are affected by causing obstruction either to a pathway or rearing of cattle or any other genuine public purpose, eviction cannot be sought on the sole ground that there are encroachments. In so far as removal of encroachments is concerned, it is for the authority concerned to decide whether the land allegedly encroached is required by the government or not.”\n\nFurther, rejecting the petitioner’s plea to restrain Tamil Nadu Generation and Distribution Corporation (Tangedco) officials from providing power supply to the houses of the encroachers, Mr. Justice Manikumar said such a direction could not be issued since access to electricity should be considered as a basic human right besides being part of the fundamental right to life guaranteed under the Constitution.\n\n“Electricity is an implicit component and facet of human right. Lack of electricity supply is one of the determinative factors affecting education and health. It causes economic disparity and inequality in society. Since electricity aids in accessing information and gaining knowledge, children without electricity supply at their homes cannot even imagine of competing with those who enjoy power supply.\n\n“Lack of electricity denies equal opportunities in the matter of education and consequently in employment, health, sanitation and other socio-economic rights. Without providing the same, the Constitutional goals, like justice, liberty, equality and fraternity cannot be achieved. The weaker sections do not crave for power in hierarchical positions, they crave only for electric power,” the judge observed.\n\nHe also pointed out that the Tamil Nadu Electricity Distribution Code uses the expression ‘occupier’ and not ‘land owner’ to refer to an applicant with the intent of providing power supply even to encroachers of government lands on submission of written undertakings that provision of service connection would not confer a right on them to claim ownership over the land.", 
    "section": "national", 
    "title": "HC says it cannot order eviction of landless poor from government lands", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}