{
    "author": [
        "Special Correspondent"
    ], 
    "text": "National Commission on Farmers recommendations reviewed\n\nProf. M.S. Swaminathan (seated), Chairman, M.S. Swamination Research Foundation (MSSRF) launching the `New Website' at a function held in Chennai. Others from left are V.K. Ramachandran, managing trustee, Foundation for Agrarian Studies, and Hannan Mollah, general secretary, All India Kisan Sabha.Photo: M. Vedhan\n\nFarmer incomes were in focus on Saturday when National Commission on Farmers chairman M.S. Swaminathan reviewed the implementation of the recommendations that were submitted nearly 10 years ago.\n\nProf. Swaminathan said technology could only increase yield; it takes public policy to take care of the economics of agriculture.\n\n“If you want to make farming viable and retain young people, your first goal is to improve the economic viability of farming and substantially increase the net income for farmers,” he said, recalling a central concern of the NCF as it went about its work during 2004-2006.\n\nHis talk, delivered at the M.S. Swaminathan Research Foundation, was at an event that saw the launch of the website of the Foundation for Agrarian Studies, a Bangalore-based charitable trust.\n\nN. Ram, publisher of The Hindu , chaired the panel, which included Hannan Mollah, general secretary of the All India Kisan Sabha.\n\nMr. Ram prefaced the session by saying, “The NCF recommendations are perhaps the most important intervention in the thinking about Indian agriculture in several decades.”\n\nIn the light of Finance Minister Arun Jaitley’s Budget promise to double farmers’ income in five years, the NCF proposal on fixing minimum support price (MSP) of a crop at the cost of production of that crop plus 50 percent came to be discussed the most.\n\n“It can be done, but requires a lot of work and action,” said Prof. Swaminathan on the possibility of doubling farmer incomes. On his Commission’s MSP recommendation, he said, “If this single step is accepted, it will make a lot of difference.”\n\nMr. Mollah was, however, sceptical of the success of the income objective. “Prof. [Swaminathan] mentioned that income will be doubled. How we can we believe it? We have calculated it – for doubling farmer incomes in five years, 14 percent growth is required. With the (current) one-and-a-half percent growth, how will we do it,” he asked at a presentation during which he said that it was pre-election propaganda that led to the last Budget adopting a pro-farmer tone.\n\nHe also talked of how the MSP recommendations of the NCF had led to a nationwide demand by farmers for implementation of the report.\n\nHe pointed out that there remained a yawning gap between what the NCF set out to achieve and the current status of agriculture in the country. “[It] recommended (loans at) four per cent, but actual farmers are taking loans for between 30 and 120 per cent,” he said\n\nProf. Swaminathan said, “The latest Budget takes some of our recommendations forward. For example, Agriculture and Farmers’ Welfare: we recommended that the name of the ministry should be changed; the Prime Minister announced this in his August 15 speech. The reason is, we should not focus on productivity alone, but the well-being of the farmer,” he said.\n\nProf. Swaminathan dwelt in detail on the pressures of land and income on agriculture. “Punjab farmers, at the heartland of the Green Revolution, with an average farm size of 3.79 hectares, growing wheat and rice get an income which is less than the starting salary of a Class Four employee…. That is the crisis in Indian agriculture,” he added.", 
    "section": "national", 
    "title": "Income of farmers under focus", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}