{
    "author": [
        "Staff Reporter"
    ], 
    "text": "S.C. Parija, the institute’s director, received the ‘Kayakalp’ award from Union Minister for Health\n\nJawaharlal Institute of Postgraduate Medical Education and Research (Jipmer) has been adjudged as “hospital with best hygiene” under the Union Government’s Kayakalp Award under the Swachh Bharat campaign.\n\nAccording to a release, the “Kayakalp” award instituted by the Union Ministry of Health is to encourage every public health facility in the country to work towards standards of excellence to help the facilities stay clean and hygienic.\n\nThis does not apply only to physical cleanliness, but to develop and put in place systems and procedures for activities such as bio-waste disposal or protocols.\n\nThe initiative towards total “Swacchta” in public health facilities is aimed towards building confidence of the users in public health facilities, provide quality service and encourage team work.\n\nS.C. Parija, Director of Jipmer, received the award from Union Health Minister J.P. Nadda at a function in New Delhi on Wednesday. The award was given to Jipmer based on the overall performance on various parameters such as cleanliness in hospitals, sanitation and hygiene, infection control, hospital upkeep, waste management and community participation assessment.\n\nJipmer is always keen about cleanliness and hygiene, and follows a comprehensive system in achieving the best results, Dr. Parija said.\n\nA well-qualified sanitary inspection team constantly checks the campus’ cleanliness and ensures the Quality and Standards.\n\nThis special award is a significant recognition for Jipmer for its keen focus in maintaining a healthy and hygienic hospital environment, Dr. Parija added.\n\nA well-qualified sanitary inspection team constantly checks the campus’ cleanliness", 
    "section": "national", 
    "title": "Jipmer in Puducherry adjudged ‘hospital with best hygiene’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}