{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "It’s been three months since Balakrishnan* had a good night’s sleep. The 50-year-old Chennaiite manages to sleep for about two to three hours, he said, and then wakes up. And this goes on throughout the night. “It has become very difficult for me. I’m tired in the mornings and tired at night too, but cannot sleep. I’m not as brisk as I used to be. Sometimes, I get so tired that it feels like I can’t even walk. My mental health too, has been affected,” he said.\n\nOn World Sleep Day marked on Friday this year, experts say that lack of sleep or disturbed sleep on a regular basis may lead to mental health issues.\n\n“Lack of sleep or disturbed sleep reduces the percentage of both Rapid Eye Movement (REM) and non-REM sleep. REM sleep is important to re-energise the brain and the muscles of the body. If this is reduced, the next day, the individual’s thought processes and concentration can be affected. Over a period of time, this can lead to neuronal changes, leading to memory loss, irritability, anxiety and even depression,” said Vijaya Krishnan, head of the department of snoring and sleep disorders, Madras ENT Research Foundation.\n\nDr. Krishnan said he sees at least 30 patients a month, many of whom are depressed. “It can cause a host of problems — I have patients who can’t go out of town with friends or on work trips, some have resigned their jobs and others have been pushed out. Their disturbed sleep can also affect their partners,” he said.\n\nIn an article on health issues among call centre employees published in 2014, the authors said surveys had shown that sleep disorders were high among these workers, with chronic fatigue, insomnia, and altered biological rhythm commonly observed.\n\n“Sleep deprivation can further complicate their health as it can result in fatigue, mood changes like depression, decreased cognitive functioning, poor executive functioning, impaired vigilance, and a predisposition to infections” it said.\n\nAnother study said call centre employees reported sleep disturbances, high levels of anxiety and mental stress.\n\nBPO employees with regular shift changes were also found to have performed comparatively poorly on cognitive function tests in one study.\n\nDr. Suresh Kumar, senior consultant neurologist and sleep specialist at Vijaya Health Centre and Fortis Malar Hospital, said that historically, disturbed sleep had been considered a symptom of a depressed mood – however, this view has shifted – sleep disturbances can precede, follow or co-occur with depression.\n\nSymptoms of depression\n\nStudies have shown that about 20 per cent of patients with insomnia exhibit some symptoms of depression; in patients with obstructive sleep apnea, depression rates range from 24 per cent to 45 per cent and 40 per cent of patients with restless leg syndrome also report depression symptoms, he said.\n\n“The brain needs to shut down for a few hours every day. This does not mean that it stops functioning when we are asleep, but there are not external inputs for it to be continually stimulated,” said R. Thara, director Schizophrenia Research Foundation.\n\nWhen a person’s sleep is disturbed on a regular basis, it leads to reduced functioning during the day, and this could trigger or worsen a mild psychiatric problem, she said.\n\n“One of the earliest symptoms people with mental health issues complain of is disturbed sleep or lack of sleep, an early indicator of a relapse,” she said.\n\nStudies have shown that depression symptoms are reduced after successfully treating the co-occurring sleep disorder, said Dr. Kumar.\n\n* (Name changed)\n\nI have patients who can’t go out of town with friends or on work trips. Their disturbed sleep can also affect their partners.\n\nVijaya Krishnan\n\nHoD snoring and sleep disorders, Madras ENT Research Foundation\n\nOver a period of time, it can lead to memory loss, anxiety and even depression", 
    "section": "national", 
    "title": "‘Lack of sleep can affect mental health’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}