{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A total of 407 railway stations were taken up for a survey on cleanliness\n\nMadurai Railway station has been ranked among the top 10 cleanest railway stations under A-1 category all over the country, according to a preliminary report on assessment of cleanliness standards at major railway stations. The report, released by Union Railway Minister Suresh Prabhu, also has put Kovilpatti and Virudhunagar railway stations under Madurai Railway Division among the top 20 railway stations under ‘A’ category of stations.\n\nAccording to a statement, a total of 407 railway stations — 75 A1 category and 332 A category stations — were taken up for a survey on cleanliness of stations based on passenger feedback conducted by Indian Railway Catering and Tourism Corporation. The survey was conducted through interviews with respondents on the questionnaire on cleanliness indicators. The passengers were asked to rate the cleanliness on 40 different parameters. On an average, Madurai railway station handles around 20,000 passengers, who come to the station to board trains on different routes, according to the Station Manager, N.D. Prem Kumar.\n\nHowever, all efforts are being made to keep the platforms, the concourse hall and the aprons clean round the clock with the help of outsourced agency in the railway station. More employees are deployed during the day time for the sweeping, mopping and other cleaning activities.\n\nResponding to the top ranking, the Chief Medical Superintendent of Madurai Railway Hospital G. Sahoo said that 75 workers were employed in three shifts at the Madurai railway junction. Not only the platforms, but also the waiting hall, office buildings are cleaned every day.\n\n“With so many trains departing the railway station every day, the employees have been taking care of the apron (the concrete flooring under the tracks in the station) in periodically removing human soil, thanks to the water gun used for the purpose,” he said.\n\nBesides, the employees were also involved in rag-picking on 500 metres of the tracks outside the railway station (on both sides) periodically.", 
    "section": "national", 
    "title": "Madurai among top 10 cleanest railway stations in India", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}