{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Pradosha puja, 4.30 p.m.; Kaala Bhairavar puja, Railway Colony, 5 p.m.\n\nKallazhagar Temple: Sundararaja Perumal tirukkalyanam festival; procession of deities, Alagarkoil, 6 p.m.\n\nDandayuthapaniswamy Temple: Panguni Uthiram festival; Skanda homam, 5 a.m.; Rudra japam, 7 a.m.; pookoodaram, 4 p.m.; alankaram, Netaji Road, 5 p.m.\n\nMuneeswarar Temple: Masi festival; Bharatanatyam by students of Nardhana Natyalaya, Munsif Court Road, Tirumangalam, 8 p.m.\n\nPanniru Tirumurai Mandram: Pannisai, Adi Streets, Meenakshi Sundareswarar Temple, 7 a.m.\n\nRamakrishna Mutt: Discourse on ‘Tirumandiram’ by A. Angayarkanni, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nSri Sringeri Sankaracharya Mahasamasthanam: Pradosha puja, 88 Amman Sannidhi Street, 6 p.m.\n\nChinmaya Mission: Discourse on ‘Bhagavad Gita’ by Sivayogananda, Kanchi Kamakoti Mutt, Besant Road, Chokkikulam, 6.45 p.m.\n\nSivananda Tapovanam: Spiritual retreat, Sivananda Sundarananda presides, Sivananda Nagar, Thoppur, 10 a.m.\n\nArsha Parampara: Discourse on ‘Lalithasahasranamam’ and spiritual heritage class by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Sundareswarar Temple, 10 a.m.; on ‘Mundakopanishad,’ 7 a.m.; ‘Bhaja Govindanm,’ Vasudhara, Andalpuram, 6.30 p.m.\n\nSri Aurobindo Study Forum: Discourse on Sri Aurobindo’s ‘Life Divine’ by Subramany, Nithyatha, Auro Lab, Veerapanjan, 10 a.m.\n\nSwami Tatwananda Ashram: Samananda conducts ‘Mandukya Upanishad’ class, Swami Tatwananda Ashram, P and T Nagar, 6.45 p.m.\n\nOur Lady of Lourdes Church: Palm Sunday service, 5.30 a.m. and 6.30 p.m.; Holy Week meditation, K. Pudur, 10 a.m. and 6 p.m.\n\nCSI Holy Emmanuel Church: Palm Sunday; church service, Rajendran delivers message, Holy Rosary Church, Town Hall Road, 7.30 a.m.; procession, Town Hall Road, 7.45 p.m.; service, John Britto Backiyaraj delivers message, CSI Holy Emmanuel Church, Tirupparankundram Road, 8 a.m.; procession TPK Road, 8.15 a.m.; service, W. Samuel Soundrapandian delivers message, TELC Holy Redeemers’ Church 8.30 a.m.; procession, Netaji Road, 8.45 a.m.\n\nPassion Song Service: G.S. Savarirayan preaches, S. Wellington leads, Jubilee Chapel, American College, 6 p.m.\n\nChurch of Christ: Sunday service; Deva Manickam delivers message, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nCULTURE\n\nTiruvalluvar Kazhagam: G. Gnanasambandan speaks on ‘Valluvar Kanda Ulagam,’ North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nUniversal Peace Sanctuary: Sundaramoorthi Sachidananda conducts free meditation class, 138 Kamarajar Road, 7 p.m.\n\nMadurai Philatelists and Numismatists Association: T. Mathan speaks on “Special covers for Tamil Nadu,” Victoria Edward Hall, West Veli Street, 10 a.m.\n\nGENERAL\n\nAnna University: Graduation Day; M. Rajaram, Vice-Chancellor, presides; R. S. Sundar, Site Director, Kudankulam Nuclear Power Project, addresses, Keezhakuyilkudi, 4 p.m.\n\nSaraswathi Narayanan College: M. Nallakaman, NSS Coordinator, Madurai Kamaraj University, inaugurates NSS camp; M. Kannan, Principal, presides, Kombadi, 10 a.m.\n\nNadar Mahajana Sangam Sermathai Vasan College for Women: Alumnae meeting, G. Midhu Bala of Mangayarkarasi College of Arts and Science for Women addresses, 10 a.m.; 19{+t}{+h}Graduation Day; V. M. Velumani, Judge, Madras High Court, addresses, Avaniapuram, 10.30 a.m.\n\nTime Kids: Fifth Annual Day, Agarwal sabha, 1 BB Road, Balarengapuram, 10.30 a.m.\n\nTamil Nadu Association of Non-Teaching Staff of Aided Colleges: General body meeting, 6 Kakka Thoppu Street, 10 a.m.\n\nVidiyal: Training in Juvenile Justice (Care and Protection of Children) Act, 21 Kennet Nagar, Muthupatti, 9.30 a.m.\n\nMeeting on Water Protection: Seminar and Vaigai walk, Madurai Meenakshi Higher Secondary School, Pechiamman Padithurai, 8 a.m.\n\nRagapriya: Annual general body meeting, Setupathi Higher Secondary School, North Veli Street, 11 a.m.\n\nJanseva: Conference on “A march towards interest-free Tamil Nadu;” Rahmathullah Abdul Ahad, Chairman, Janseva Cooperative Credit Society, presides, Star Park, 41 Anna Nagar, 9 a.m.\n\nRamakrishna Mutt: Free acupuncture camp, 9 a.m.; free eye camp, New Natham Road, 9.30 a.m.\n\nVivekananda College and Arist Speciality Hospital: Free medical camp, Akilandeswari Temple, Thenkarai, 9 a.m.\n\nAlcoholics Anonymous: Meeting; UC Higher Secondary School, 11 a.m.; RC School, Sivaganga Road, Melur, 6.30 p.m.; Justice V. R. Krishna Iyer Community Hall, Lake View Road, K. K. Nagar, and Railway Institute, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}