{
    "author": [
        "D Madhavan"
    ], 
    "text": "Dearth of experts, including manusciptologists, trained archivists and librarians who could work on the documentation of these manuscripts.\n\nRare manuscripts in all its forms, including palm leaves, birch bark and copper plates, are said to be under threat due to a dearth of experts, including manusciptologists, trained archivists and librarians who could work on the documentation of these manuscripts.\n\nThese manuscripts have been collected by the National Mission for Manuscripts (NMM) from various sources, including Oriental Manuscripts and Research Institute (OMRI) — which is located at the University of Madras at Chepauk — of the Tamil Nadu State Archaeology Department.\n\nOfficials with the New Delhi-based NMM said that apart from Sanskrit, a good portion of Tamil literature was found documented in manuscripts. In fact, unlike many other languages, Tamil had a unique distinction of having manuscripts that have in-depth details about traditional medicine, including Ayurveda, and some martial art forms, they said.\n\nPalm leaves\n\nMost of the manuscripts on medicine and martial art forms were found on palm leaves.\n\nIn coastal areas of Tamil Nadu, which include Tuticorin and Kanyakumari, such texts were written on country palm leaves, which have a shorter life span due their brittleness.\n\n“Lack of qualified manuscript experts has delayed their documentation. Only if the manuscripts are documented can the content be digitised. So, slow progress in documentation also affected digitisation work,” N.C. Kar, coordinator, Post-Survey, National Mission for Manuscripts (NMM), New Delhi, told The Hindu .\n\nMr. Kar is in Chennai to attend a three-day national seminar on Folk Ballads in Indian Languages Available in Palm Leaf and other Manuscripts, which is being jointly organised by the Chennai-based Institute of Asian Studies and NMM, starting from Saturday.\n\nFormed in 2003 as an autonomous organisation under the Union Ministry of Tourism and Culture, the NMM has been mandated to survey, locate, and conserve Indian manuscripts, and carry out their documentation and digitalisation.\n\nIn this effort, the Mission allots funds to universities, colleges, and research centres to organise seminars, workshops, and training programmes to discuss steps for the preservation of manuscripts.\n\nSpecial training programmes are being conducted on reading inscriptions and ancient letter forms.\n\n34.94 lakh documented\n\nUnfortunately, of one crore collections of manuscripts, mainly in the form of palm leaves, birch barks and copper plates, with the NMM, only 34.94 lakh have been documented by NMM since its inception in 2003.\n\nWorse still, only around two lakh documented manuscripts have been digitalised so far by the national manuscripts conservation agency.\n\nManuscripts experts said that the need for devoting many years of learning and of specialising in specific languages made the profession of manuscripts-reading less attractive among students.\n\nThis is one of the major reasons for the lack of talent pool in the study of manuscripts.\n\nShort shelf life\n\n“Unlike inscriptions, manuscripts have a short shelf life. In other words, the life span of a manuscript, especially palm leaf, is around 350 years. Most of the content in these manuscripts have been passed on from generation to generation. Conservation of such rare treasures should be given priority,” said G. John Samuel, Founder Director & Secretary, Institute of Asian Studies.", 
    "section": "national", 
    "title": "Manuscripts await expert eyes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}