{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Tamil Nadu bags Krishi Karman award for the third time\n\nTamil Nadu will soon receive the Krishi Karman award from the Union Government for its achievement in agriculture. This will be third time the State will get the award.\n\nThis time it is for increased food grain production, particularly millet production, says Tamil Nadu Agricultural University Vice-Chancellor K. Ramasamy. The food grain production went up from 110 lakh tonne to 128 lakh tonne.\n\nThe millet production went up from nine lakh tonne to 29 lakh tonne.\n\nIn fact, the millet production is more. According to sources, the State has crossed 35 lakh tonne.\n\nMr. Ramasamy attributes the increased millet production to distribution of quality seeds, assistance from the university and Agriculture Department and favourable market conditions that helped farmers sow millets. In distributing millet seeds, the university decided to give location-specific millets to various parts of the State.\n\nFor instance, it gave Kuthiraivali (barnyard millet) to farmers in Srivilliputhur and Aruppukottai, cumbu (pearl millet) to farmers in Villupuram, samai (little millet) and thinai (foxtail millet) to farmers in Tiruvannamali and varahu (kodo millet) to farmers in Dharmapuri and Krishnagiri districts. The millets suited the agro-climatic conditions there and farmers there traditionally cultivated those.\n\nRavi Kesavan, Professor-Millets, TNAU, says that the university engaged farmers in producing quality seeds for distribution.\n\nIn the last four years alone, the two had organised over 1,600 frontline demonstrations. And in the last two years they had trained over 1,602 farmers. In the harvest stage, the major challenge the farmers faced was the poor grain conversion ratio. For every 100 kg grain sent for removing shells the farmers got only 65 – 70 per cent. The university developed a new shelling machine that helped improve the recovery rate to about 80 per cent. It then distributed the machine to self-help groups in villages and that did the job.\n\nThe third aspect that worked in farmers favour was that increased paddy production led to increase in price of millets because of fall in production.\n\nThat coupled with increase in the nutrient aspect of the millets, encouraged farmers to take up millet cultivation.\n\nToday, the price of a kg of millet, depending on the variety, ranges from Rs. 60 to Rs. 120.\n\nAnd then there are other advantages like that millet is a short-duration crop and drought resistant as well. If the rain fails, the farmers will still use the half-grown crop as fodder, as done traditionally in the State, this also helped, he adds.", 
    "section": "national", 
    "title": "Millet production in State up", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}