{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Periyar University on Tuesday launched Global Document Authentication System for online certificate genuineness verification and online transcripts application.\n\nWith this paperless document authentication technology, Periyar University has gone one step ahead towards e-governance and sharing the fine vision of Digital India.\n\nA press release of the University issued here on Tuesday said that the system will be of great advantage to the students and global alumni of the institution in the following areas: to check genuineness of certificates and transcript application; cost effective, transparent and efficient service; checks document fraud; facilitates a single platform for multiple authentication requests; executes paperless verification of degrees / mark sheets online; helps online application of transcript from anywhere in the world; one-time verification option, multiple usage, and highly secure data privacy. The system is a secure, paperless, online document authentication technology developed by Myeasydocs, an IIT Madras Incubated company.\n\nIn order to verify Periyar University-issued certificates or mark lists, alumni or any other document user has to upload the said documents at www.periyaruniversity.directverify.in and make an online payment.\n\nThe University will verify the credentials of the uploaded certificate or mark list with its records.\n\nOn completion of the verification, an email with a link of the verified document will be sent to the requesting party.\n\nOn the other hand, transcript application and submission process will be made simple through the adoption of new technology. Students and alumni can apply the transcript online at www.periyaruniversity.\n\nitranscript.in.\n\nTo ensure high security, they system uses internationally approved system data privacy encryption technologies and reliability processes – these include logins, access tokens such as one time passwords, automatic embedding of verifier credentials and verification result onto the certificate or mark list to leave an audit trail.\n\nThe paperless authentication mechanism will curtail the fake document menace and most importantly, ensure credibility of the institution’s certificates and mark lists.\n\nThe system will also facilitate the interlinking of various institutions and universities enabling expeditious admissions of student from different institutions, the release added.", 
    "section": "national", 
    "title": "Periyar University implements document authentication system", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}