{
    "author": [
        "S Prasad"
    ], 
    "text": "Orientation training programme conducted for police officials in Puducherry\n\nThe Election Department has urged all police officers engaged in election duty to maintain neutrality in their acts and conduct and take prompt action according to law in respect of matters brought to their notice.\n\nSpeaking at an orientation training programme for police officials in the rank of Senior Superintendents of Police (SSPs), Superintendents of Police (SPs), Inspectors and Station House Officers here on Saturday, Chief Electoral Officer V. Candavelou said that the entire police machinery associated with elections were now under the superintendence, direction and control of the Election Commission of India by virtue of Section 28-A of Representation of People Act, 1951.\n\nPolice officers were also apprised on the enforcement of the Model Code of Conduct, the legal aspects and provisions that could be invoked to take precautionary measures and to check corrupt practices and electoral offences, preventive measures, vulnerability mapping, maintenance of law and order and other election management issues.\n\nMr. Candavelou said that police officers should maintain complete neutrality in their acts and at the same time must be firm and prompt in taking action according to law in respect of matters brought to their notice by various stakeholders.\n\nHe also requested the police officers to coordinate with the District Election Officer/Returning Officers to ensure that police personnel on election duty exercise their franchise without fail through postal ballots. Necessary arrangements for postal ballots would be made by the District Election Officer concerned, he said.\n\nAccording to a senior police official, the Election Department had identified 140 booths as “vulnerable”. The Police Department has drawn up elaborate plans to strengthen security at these booths.\n\nThe police will be intensifying the drive against history-sheeters and anti-social elements. The police personnel were advised to execute pending bailable and non-bailable warrants.\n\nApart from their responsibility of maintaining proper law and order during the entire period starting with the announcement of elections and till the completion of elections, the necessity of ensuring the strict implementation of the various standing and specific orders, directions and instructions of the Commission aimed at enabling a peaceful, free and fair election were also emphasised, the official said.", 
    "section": "national", 
    "title": "Police officers told to be neutral", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}