{
    "author": [
        "S Prasad"
    ], 
    "text": "For the first time after the formation of the All India NR Congress in 2011, a regional level committee of the party has been formed in Yanam, an enclave of the Union Territory in Andhra Pradesh.\n\nThe move is a clear indication that the AINRC is keen about developing its roots in Yanam which is considered to be a traditional Congress stronghold and has been seen direct contests between the Congress and regional parties.\n\nThe regional level committee has been formed with the approval of Chief Minister N. Rangasamy who is the founder of the AINRC, said V. Bhalan, general secretary of the party.\n\nNow the AINRC is apparently widening its base and is keen to project an image that it will be a strong force in a distant segment such as Yanam.\n\nPresident appointed\n\nVelaga Rajeswara Rao, a former Congress Legislator has been appointed the president of the regional committee in Yanam.\n\nHe has also been made the competent authority to clear all matters relating to poll expenditure of the party.\n\nFormer police officer Tirukoti Bhairavasamy who is tipped to be the candidate for the ruling All India NR Congress in Yanam constituency in the forthcoming Assembly Elections has been appointed as the vice-president of the committee.\n\nThe AINRC fancies its chances this time and will also play up local development issues in a bid to capitalise on any anti-incumbency factor.\n\nThe Puducherry Pradesh Congress Committee (PPCC) had recently appointed Yanam MLA Malladi Krishna Rao as ‘constituency in-charge’ drawing the battle lines in Yanam.\n\nAppeal to extend cooperation\n\nThe deft move is seen by political observers as an attempt to buy truce with Mr. Rao who has been estranged from the party. PPCC president A. Namassivayam had appealed to party cadres to extend their cooperation to him.\n\nCommittee was formed with approval of N. Rangasamy, the founder of AINRC", 
    "section": "national", 
    "title": "Regional committee of AINRC formed in Yanam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}