{
    "author": [
        "S Senthalir"
    ], 
    "text": "Four restaurants in Puducherry to serve special cuisine\n\nThis year, the number of restaurants in India participating in the Good France event has doubled to 50. A file photo of a restaurant serving French food in Puducherry.\n\nThe time of the year to wish ‘Bon Appétit’ has arrived. Get ready to savour the taste of France in Puducherry.\n\nOn March 21, the restaurants across the world will serve special menu of recipes inspired by French expertise. At least 1,500 chefs, 1,500 menus, 150 embassies in five continents will serve one dinner to celebrate French cuisine worldwide as part of the Good France project.\n\nOn Monday, four restaurants including Le Boulevard, Mango Hill, Satsanga and La Villa will serve the special French cuisine in Puducherry. Five restaurants in Chennai and one in Thiruvananthapuram will participate in the Goût de France (Good France). This is an initiative of celebrated chef Alain Ducasse and the French Ministry of Foreign Affairs and International Development to showcase French way of life, regional products, and promote France as a tourist destination. Joining the celebrations, French Embassies will also host Good France dinners on Monday.\n\nLaurent Fabius, Minister of Foreign Affairs and International Development (France), views this event that unites chefs from all horizons and around the world on the same evening, with one shared goal of celebrating the excellence and creativity of French gastronomy.\n\nIn this second edition of Good France, regional prefects like Reunion Island have been asked to take part in the event. This is an initiative to promote French chefs working in our regions to showcase regional culinary traditions.\n\nUNESCO in 2010 incorporated the “gastronomic meal of the French” into the intangible cultural heritage and humanity. The event recreates the Epicurean Dinners initiative in 1912 (the same menu, on the same day, in several world cities, for as many guests as possible) launched by Auguste Escoffier.\n\nThe participants are expected to design the menu based on the following sequence: aperitif and canapés, starter, main course, cheese, dessert, French wines and champagnes.\n\nIn this event, each recipe will be based on cuisine that uses less fat, sugar and salt and shows concern for good food and environment. The price will be fixed at the restaurant’s discretion and each participant will commit to donating 5 per cent of the proceeds to a local NGO promoting health and environment.\n\nThis year, the number of restaurants in India participating in the event has doubled to 50.\n\nFrench consulate too hosted a dinner prior to this event on Friday night. To everyone’s surprise French Consul General Philippe Janvier-Kamiyama hosted a dinner with a complete vegetarian menu. “This is to show that French cuisine is not only for non-vegetarians but there are many varieties for the vegetarians too,” he said.\n\nThe menu on Friday night included iced cucumber soup with green apple and coriander, zucchini mille feuiffes, broccoli gratin, stuffed peppers with rice and spices, cheese platter, green salad, strawberry sorbet and caramelized pears and coffee.", 
    "section": "national", 
    "title": "Relish regional recipes of France tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}