{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A sum of Rs 18.10 lakh was seized from a sport utility vehicle from Andhra Pradesh when it was intercepted near New Jail Road in the city on Saturday.\n\nWith the model code of conduct in vogue, the district administration formed as many as 30 teams, including flying squads and static squads, from the day the Election Commission of India announced general elections scheduled for May 16.\n\nThe Election Commission of India, in a bid to prevent cash distribution to voters, had issued stern warnings to people to carry adequate documents, when they carried huge cash. In the event of non-disclosure of any valid certificate or document, the officials had been given powers to seize the money and deposit with the treasury. The police too had been authorised to interrogate and submit their findings to the appropriate authorities such as Income Tax.\n\nAlready, close to Rs.15 lakh had been seized in the city/district for the last 10 days, officials said and added that whenever cash was seized and in a few instances, after the holder gave proper explanations, it was duly returned.\n\nIn the case of the New Jail Road seizure, a team from Madurai Central Assembly constituency intercepted the SUV and a physical check revealed that the passengers – all from Andhra Pradesh Kunthangi in Krishna district had a little over Rs.18.10 lakh in cash.\n\nPreliminary inquiries indicated that they were businessmen and had come here to purchase earthmover equipment. “An agent had asked us to come here with cash and since the equipment was not satisfactory, we planned to proceed to Coimbatore to have a look at another equipment,” one of the businessmen had confessed to the police, an official in the squad told reporters.\n\nAt a time, when the trade and industry in the city were demanding the Election Commission of India authorities to consider their plea to allow up to Rs.two lakh, the seizure of Rs 18.10 lakh cash stunned the officials. Police officers were interrogating the businessmen from Andhra Pradesh.", 
    "section": "national", 
    "title": "Rs.18.10 lakh cash seized; four being questioned", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}