{
    "author": [
        "R Srikanth"
    ], 
    "text": "Along MRTS tracks near Taramani railway station\n\nThe road is proposed to be linked to the southern arm of the Inner Ring Road extension —Photo: M. Karunakaran\n\nThe service road project along the tracks of the Mass Rapid Transit System (MRTS), which was stalled a few years ago, has resumed.\n\nWork on paving a four-lane road has begun at the Taramani railway station.\n\nA senior official of Southern Railway confirmed that work was in progress at the Taramani railway station and the four-km road project would be completed in five to six months.\n\nSouthern Railway had proposed to enhance road connectivity along the elevated track of the MRTS beween Velachery and Taramani railway stations in 2009.\n\nAlso the service road, which would run parallel to the elevated track, was proposed to be linked to the southern arm of the Inner Ring Road extension.\n\nBut work on the service road was stopped after residents of the locality raised concerns of flooding, citing that the alignment of the service road would block the flow of rainwater into the Pallikaranai marsh.\n\nThe residents, in turn, wanted culverts to be constructed on the service road so that rainwater would not stagnate in residential areas and would easily flow into the marshland. In the meantime, the Chennai Corporation proposed to restart the stalled service road project, and a request was made for land to be handed over from Railways for the purpose.\n\nOfficials of Southern Railway said the Metropolitan Transport Project, the construction wing of Southern Railway, planned to restart the stalled service road project as there were difficulties in transferring the land.\n\nThe alignment of the service road starting adjacent to the parking lot of the Velachery railway station would be connected with the Taramani station through a road overbridge near the Perungudi station.\n\nThe service road would help ease traffic congestion on Taramani Link Road and Velachery Junction.", 
    "section": "national", 
    "title": "Service road work restarted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}