{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Manufacturing industries and industrial associations can highlight issues they face’\n\nMicro, small and medium-scale enterprises in Coimbatore can now improve competitiveness by adding value to the products through technology.\n\nNASSCOM’s Centre of Excellence for Internet of Things partnered with TCS, Intel, Amazon Web Services and Forge Accelerator and organised the first edition of CoE-IoT connect programme here on Saturday.\n\nK.S. Viswanathan, vice-president of NASSCOM, told presspersons that manufacturing industries and industrial associations can highlight the issues they face and the solutions they need to make the products better. This will be the facilitators and will provide the enabling environment for the start-ups and entrepreneurs. If the manufacturing units are satisfied with the solution, it can be developed into a commercial solution.\n\nCoimbatore is traditionally strong in manufacturing sector. There are several technology changes that are happening and “we need to see how we can enable industries to be successful using technology,” he said.\n\nThe Centre of Excellence is located in Bangalore and this is the first such initiative in another city. “If the model succeeds here, it can be replicated in cities such as Pune and Baroda,” he said.\n\nThe main focus areas for the Centre of Excellence are water, agriculture, energy, transportation, education, and healthcare. In Coimbatore, the focus is on the manufacturing sector.\n\nFor instance, the Southern India Engineering Manufacturers’ Association has said that they need a solution to monitor the pumpsets that are installed for the first one year, without deputing personnel to visit the field. Similar, there is a need for smart control panels and energy grids, he said.\n\nFORGE has 10,000 sq.ft space at the KCT Tech Park, according to Vishwanath, its vice-president. It plans to launch FORGE fellowship soon.\n\nThe objective of the facility is to encourage more graduates to take up innovation and entrepreneurship. Any manufacturing segment can bring to the Centre the solution required for a product and industry-specific solutions will be developed.", 
    "section": "national", 
    "title": "Smart solutions for Coimbatore MSMEs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}