{
    "author": [
        "Staff Reporter"
    ], 
    "text": "MoU signed for achieving academic excellence, leadership in Health Professions Education\n\nM.K. Rajagopalan, chairman, Sri Balaji Educational and Charitable Public Trust, signing an MoU on academic partnership with Gilbert H. Mudge, M.D., CEO and president of Partners Medical International in Puducherry on Saturday.— Photo: T. Singaravelou\n\nIn view of achieving academic excellence, quality, innovation and leadership in Health Professions Education (HPE) and comprehensive health care system, Sri Balaji Vidyapeeth (SBV) University signed an Memorandum of Understanding with Partners Medical International (PMI) on Saturday. This collaboration will focus on development of an innovative SBV curriculum for the UG medical education within the guidelines of the Medical Council of India and faculty development to provide leadership.\n\nGilbert H. Mudge, M.D., CEO and president of Partners Medical International (PMI) said that Partners HealthCare (Partners) was one of the largest academic medical systems in the United States. “The five-year agreement will concentrate on leadership development, faculty development and evolution of research mechanism,” he said.\n\nAddressing the reporters after the signing of MoU, Prof. Gilbert said that for a comprehensive health care, development of nursing education in India was important. “Training the physicians for health care needs and upgrading nursing training from primary to specialty would be the focus on this collaboration,” he said.\n\nN. Ananthakrishnan, dean-research and allied health sciences, SBV, said that this will help to identify and intervene to help students at high risk, develop a competency based curriculum for post-graduate education with continuous monitoring with an e-portfolio and early exposure to the community for the medical students. He added that they would conduct research on the interface between complementary and allopathic medicine. The plan is to embed exposure to simulated patients and the skill lab as part of the education process, develop a modern and comprehensive learning management system (LMS) with the help of PMI. The SBV will also benefit from the working relationships with clinical institutions.\n\nM.K. Rajagopalan, chairman, Sri Balaji Educational and Charitable Public Trust, underlined a super specialty block with 20,000 sq ft would be built soon. Prof. Gilbert unveiled the foundation for the super specialty block.\n\nThis block would provide space for cardiology, cardiothoracic surgery, neurology, neurosurgery, nephrology, urology, plastic surgery and paediatric surgery. New department including oncology, radiotherapy and palliative care will be started to meet the needs of the community for effective cancer treatment, besides facilities for kidney, liver transplantations.", 
    "section": "national", 
    "title": "Sri Balaji Vidyapeeth to collaborate with Partners Medical International", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}