{
    "author": [
        "K Lakshmi"
    ], 
    "text": "A check dam is being built near Putlur in Tiruvallur district to prevent wastage of floodwater\n\nTo save resources in the unpolluted stretch of the Cooum river, the Water Resources Department (WRD) is building a check dam near Putlur, located nearly 25 km upstream of Maduravoyal.\n\nThe river, which originates in Tiruvallur district, runs for a total distance of 65 km. Of this, a stretch of 40 km still remains unpolluted and the water from there is used for drinking and irrigation. To save more floodwater that would otherwise drain into the sea, the WRD is constructing the check dam, a structure built across the river bed to break the flow of the river and store it.\n\nAbout 10 per cent of the work on the construction of the 180-metre-long and 2.7-metre-high check dam at Putlur, Tiruvallur district has been completed. This is two km from Manavala Nagar, Tiruvallur district.\n\nOfficials of the WRD said: “We will be able to store nearly 300-400 million cubic feet of water for about six months. This is equal to nearly half a month of the city’s drinking water supply. It was decided to build a check dam on the site following a long-pending demand from the residents. The structure will store water for one km upstream in the river. This will mean recharge of groundwater in surrounding villages, including Vengathur, Thiruvoor and Sevvapet.” At present, residents are supplied with 810 million litres of water every day. Once the check dam is constructed, nearly 400 borewells around the riverbed will have better groundwater recharge. The Rs. 6.5-crore project is expected to be completed before the onset of the northeast monsoon, said an official.\n\nMeanwhile, Chennai Rivers Restoration Trust is also reviewing the possibility of building more check dams across the river to save resources. At present, there are only four or five check dams across the waterway and they are in a dilapidated condition following the deluge in November and December last year. While welcoming the move to build the check dam in Putlur, residents want more such structures to be constructed to cater to the drinking water needs of residents living along the river.\n\nMugundhan. K., coordinator of Unpolluted Cooum River Protection Committee, said: “It is essential to build at an interval of every few km in the river.\n\nSeveral people in villages like Anaikattuchery and Soranchery located upstream of Avadi still drink water from the Cooum river. If more resources are stored, it can be supplied to Chennai residents.” Pointing out that the check dams in Kannapalayam and Paruthipattu are in dire need of attention, he said: “We lost much floodwater because the Paruthipattu check dam was not maintained properly.”", 
    "section": "national", 
    "title": "Tapping into the unpolluted Cooum", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}