{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Experts suggest innovative models of rainwater harvesting\n\nResidents can harvest a significant quantity of rainwater even during brief spells of rain —Photo: K.V. Srinivasan\n\nummer is the best time to prepare for the rains as rainwater harvesting systems can be easily set up. As a result, experts are busy promoting innovative models for residents to upgrade their rainwater harvesting systems this summer.\n\nSome of the models are said to be capable of storing water that would otherwise drain into the sea. Residents largely harness rooftop water and construct structures to facilitate groundwater recharge. But, the entire amount of rainwater often cannot be harnessed due to the soil reaching saturation limit despite the provision of recharge wells.\n\nN. Seshadri Kumar, founder director of Water and Food Equitable Distribution Organisation, a non-profit organisation, has come up with a proposal for residents to save rainwater and also cut down on water expenditure.\n\n“Rainwater harnessed into ground turns into hard water after a few months and would need treatment. Residents may construct an additional underground sump of a minimum capacity of 15,000 litres to collect rainwater from the rooftop. This could be constructed under the car park area and even under the kitchen,” he said.\n\nA shallow tank needs to be constructed and filled with layers of materials like pebbles and sand to filter rainwater. Without light and air, bacterial growth will be minimal and this natural soft water can be directly put to use.\n\nFor instance, given the 140 cm of annual rainfall in the city, nearly one lakh litres of rainwater falls over 1,000 sq.ft. of roof. If this can be stored in an underground sump, residents may use water several months as there won’t be water loss due to evaporation.\n\nWith this system, Mr. Kumar said people need not rely on water tankers during times of water scarcity.\n\nCooking with soft water can save cooking gas by 20 per cent and reduce 50 per cent of detergent use and also save energy during use of water heaters.\n\nThe Government could also build rainwater collectors and link them into nearby waterbodies or create new ones in parks instead of draining rainwater to sea.\n\nMr. Kumar recently submitted his proposal to the Chief Minister’s Special Cell and he will be building a pilot project model to create awareness about its benefits.", 
    "section": "national", 
    "title": "This summer, get your homes rain-ready", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}