{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal reaching Woraiyur Kamalavalli Nachiyar Temple Mahajana Mandapam, 11 a.m.; Organising Committee: Sri Renganathar Thiruvizha, nadaswaram by N. Rajendran and party 5 p.m.; nadha sangamam by R.Ganesan and party, 6 p.m.\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Nandikeswarar-Simam vahanams, 7 p.m.\n\nArulmigu Mariamman Temple, Keezha Anbil: Poochorithal, 9 a.m.\n\nSrimad Ubhaya Vedantacharya Peetam: “Bhagavata Dasamaskandam” by R. Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Srinivasa Perumal Temple, Indira Nagar: Sri Alamermelmangai Thayar Brahmotsavam, homam, thirumanjanam, 8 a.m.; serthi sevai in Garuda vaganam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Nachiyar Kovil, Woraiyur, 5 p.m.; Kattazhagiasingar Sannidhi, Thiruvanaikovil, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 50-A, Balamurugan Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary programmes, namasangeerthanam by Anantha Narayana Bhagavathar, Mahatma Gandhi Centenary Vidyalaya, Thennur, 6.30 p.m.\n\nGENERAL\n\nThe Hindu Young World Painting Competition: Finals, Cauvery College for Women, 9 a.m.; prize distribution by M. Vasuki, Deputy Director General (Engineering), All India Radio, Tiruchi, 1 p.m.\n\nIndian Medical Association: Continuing medical education programme, Sundar Narayanan, Consultant, Laparoscopic surgery and reproductive medicine, speak on ‘An overview of infertility,’ IMA Hall, 5.30 p.m.\n\nDravidar Kazhagam: State conference, Siruganur, 9 a.m.; M.K. Stalin, DMK Treasurer, E.V.K.S. Elangovan, TNCC president, and K.Veeramani, DK president, speak, 4 p.m.\n\nJ.J. College of Engineering and Technology: Graduation Day, P. Pandiyarajan, Dean, Anbil Dharmalingam Agricultural College and Research Institute, delivers graduation day address, 10.45 a.m.\n\nKauvery Hospital: World Kidney Day, organ donors meet, Visu, director, chief guest, Hotel Sangam, 6 p.m.\n\nSharon, St.Sebastian Youth Movement, Lions Club of Tiruchi Metropolitan and Friends Blood Bank: Blood donation camp, St. Sebastian Church, Somarasampettai, 10.30 a.m.\n\nDepressed People’s Welfare Association: Renovation of community hall, Raphaelpuram, 6 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}