{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector M. Karunakaran on Saturday inspected the functioning of VVPAT (Voter Verifiable Paper Auditor Trail) system, which will be used in the Tirunelveli Assembly constituency in the May 16 polls on ‘pilot basis’ to tell the voter as to whom he or she had voted for.\n\nThe VVPAT units were brought to Tirunelveli from Bihar recently to serve as an independent verification system for voting machines. Led by Ravi Ranjan, Deputy Manager, Bharat Electronics Limited, technicians calibrating the EVMs and VVPAT explained in detail its functioning to the Collector and the officials underwent training on Saturday.\n\nThe VVPAT units, along with the EVMs received so far, have been kept at Tamil Nadu Civil Supplies Corporation’s godown at Sripuram. The VVPAT will be connected to the EVM and will generate slips. Once the voter presses the button of his or her choice, a slip will be generated to indicate the vote that has been actually cast by the voter in the EVM at the press of the button.\n\nThe slip, which cannot be touched by the voter, will be displayed behind a glass case for seven seconds, during which the voter will be able to confirm if the vote has been cast in support of the candidate of his choice. After seven seconds, the slip will automatically fall into a sealed chamber.\n\nIn case, the voter alleges that the vote had not been cast in favour of his candidate, he can register a complaint to the presiding officer, who in the presence of others in the particular booth, will cast three trial votes of a particular choice to verify the allegation. If the complaint is genuine, the EVM concerned will be sealed and seized immediately. If the complaint is found to be false, criminal complaint will be registered immediately against the complainant.\n\nDr. Karunakaran said the VVPAT system would be used in 306 polling stations in Tirunelveli Assembly segment.\n\nDistrict Revenue Officer M.G. Kulandaivel, Revenue Divisional Officer P. Fermi Vidhya and senior officials were present.\n\nMeanwhile, the Collector chaired a meeting held at the Collectorate to train the officials on calculating the election expenditure, auditing the accounts to be submitted by the candidates everyday, calculating the expenditure on vehicles being used by the candidates and his supporters, public meetings, posters etc.\n\n“If any violation is identified, proper complaint should be registered immediately,” Dr. Karunakaran noted.", 
    "section": "national", 
    "title": "Tirunelveli Collector inspects functioning of VVPAT system", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}