{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A vehicle modified for election campaign getting ready in Coimbatore.– Photo: M. PeriasamyThe Nilgiris District Election Officer, P. Shankar, pasting stickers on buses in Udhagamandalam on Saturday.Artistes create awareness on voting in Coimbatore on Saturday.– Photo: S. Siva Saravanan\n\nA vehicle modified for election campaign getting ready in Coimbatore.– Photo: M. PeriasamyThe Nilgiris District Election Officer, P. Shankar, pasting stickers on buses in Udhagamandalam on Saturday.Artistes create awareness on voting in Coimbatore on Saturday.– Photo: S. Siva Saravanan\n\nA vehicle modified for election campaign getting ready in Coimbatore.– Photo: M. PeriasamyThe Nilgiris District Election Officer, P. Shankar, pasting stickers on buses in Udhagamandalam on Saturday.Artistes create awareness on voting in Coimbatore on Saturday.– Photo: S. Siva Saravanan\n\nCoimbatore Consumer Cause has asked the Chief Electoral Officer to order checking of all government vehicles during the election period.\n\nIn a letter, the consumer body’s secretary K. Kathirmathiyon said that such scrutiny was necessary because the vehicles that government sold or auctioned continued to carry the ‘G’ on the number plate.\n\nThose vehicles could be misused by unscrupulous elements.\n\nThe consumer body said that there were possibilities that such vehicles could be misused by the buyers.\n\nThere had been instances of such misuse. This was because the government vehicles very easily identifiable by the ‘G.’ Those using the vehicles easily crossed the check posts without verification.\n\nMr. Kathirmathiyon said that after the sale of the vehicles, the name transfer could be done anywhere in the State without any problem and that the original registering authority might not even be aware of it.\n\nThis meant that even after the sale of the vehicle and name transfer, the details if checked with the original registering authority would indicate that the owner was the government.\n\nComplaint against AIADMK\n\nThe DMK R.S. Puram secretary V.P. Selvaraj on Saturday lodged a complaint with the District Election Officer against the AIADMK for distributing dhoti, and sari to voters.\n\nMr. Selvaraj said that on Friday evening, AIADMK members inaugurated an election office in Telugupalayam and began distributing sari and dhoti.\n\nOn seeing DMK activists, the AIADMK workers fled the scene.\n\nThough the incident was brought to the notice of election official for Thondamuthur Aseembly constituency, he did not respond, said Mr. Selvaraj.\n\nCode violation\n\nThe police have registered cases against party workers from the AIADMK, CPI, and the CPI(M) for not removing flag posts on Sanganoor Road. The police had registered the case based on complaints from V. Mallika, Commercial Tax Officer, R.S. Puram East Division.\n\nThe police have registered a case against the Samathuva Makkal Katchi for not removing flag posts in Tiruvalluvar Nagar.\n\nCase has been registered against DMK too for not removing flag poles on the 80 Feet Road, Ramanathapuram.\n\nSteel pots seized\n\nPoll officials on Saturday seized 32 stainless steel pots kept ready for distribution at the house of B. Venugopal (AIADMK), a Councillor.\n\nA release from the district administration said that the officials have so far seized Rs. 20.98 lakh, and have returned Rs. 6.43 lakh after proper documents were furnished.\n\nThe officials have registered around 200 cases of poll violations, said the release.\n\nAwareness drive\n\nTo encourage voters to exercise their franchise, the Nilgiris district administration led by Collector P. Shankar on Saturday pasted stickers on buses and tourist vehicles in Udhagamandalam.\n\nPoll officials pasted stickers on seats for bus passengers too. Stickers were pasted on tourist vehicles, and four-wheelers too.\n\nThe objective was to ensure 100 per cent polling.\n\nThe officials pasted the stickers in shops, temples, hospitals, and government offices as well.\n\nOfficials at the Coimbatore South Assembly constituency on Saturday conducted a voter awareness programme in VOC Park by roping in ‘Karagattam’ and ‘Thappattam’ troupes.\n\nThey rendered folk songs containing messages on the importance of voting.\n\nA western dance event too was held.\n\nThe troupe would perform in various parts of the constituency in the coming days. On Sunday, the corporation staff would take out a rally from VOC Park.\n\nSeized\n\nOfficials have seized Rs. 5.90 lakh from four persons at three places in the Udhagamandalam, Coonoor, and Gudalur Assembly constituencies.\n\nPostal ballot\n\nIn Coimbatore, District Election Officer Archana Patnaik asked police personnel to exercise their franchise through postal ballots.\n\nA release here said that she addressed the police personnel in this regard at a function held in the city on Saturday. She told them that the number of postal ballots in the district in the last election was high. Senior district administration officials accompanied her.", 
    "section": "national", 
    "title": "Why not check government vehicles?", 
    "subsection": "tamilnadu", 
    "date": "2016-03-20"
}