{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "In 1957 when the DMK first entered the electoral fray, 15 of its candidates including party founder C.N. Annadurai and M. Karunanidhi entered the Legislative Assembly. However, just five years later, barring Mr. Karunanidhi all the DMK’s sitting MLAs were defeated thanks to a strategy devised by then Chief Minister K. Kamaraj.\n\nHistorians recall that between 1957 and 1962, the DMK MLAs, including Annadurai and Mr. Karunanidhi proved a veritable thorn in the flesh of the Congress Government led by Kamaraj.\n\nThey gave a tough time to the government both inside and outside the House\n\nKamaraj wanted to nip in bud the growth of DMK and hence adopted the strategy of nominating powerful party men as candidates against the 15 DMK sitting MLAs who were re-nominated. A private fleet operator S. V. Natesa Mudaliar was pitted against Annadurai in Kancheepuram, and top industrialist A. Y. S. Parisutha Nadar was fielded in Thanjavur constituency to oppose Mr. Karunanidhi (he had shifted from the Kulithalai constituency).\n\nUnder the directions of Kamaraj, Central Ministers and senior Congress leaders camped in the constituencies of the sitting DMK MLAs for days together to give them a tough fight. Senior Congress leaders such as T. T. Krishnamachari, then Union Minister, and C. Subramaniam camped in Kancheepuram and campaigned for the Congress candidate.\n\nKamaraj’s plan did click as 14 of the 15 sitting MLAs, including Annadurai (Kancheepuram); K. Anbazhagan (Egmore); N. V. Natarajan (Basin Bridge); Sathivanimuthu (Perambur); A. Govindasamy (Valavanur); P. U. Shanmugam (Tiruvannamalai) suffered defeats. Annadurai lost in Kancheepuram by 9,190 votes. Only Mr. Karunanidhi scraped through with a victory margin of 1,928 votes in Thanjavur constituency to return to the Assembly.\n\nHowever, a larger disappointment was in store for the Congress since, due to the concentrated attention on the 15 constituencies, the DMK candidates emerged victorious in a total of 50 seats, increasing their tally by 35 over the previous election.\n\nLater addressing a public meeting immediately after the elections, Annadurai said that by concentrating in the constituencies of 15 sitting MLAs, the Congress ensured the victory of 50 DMK MLAs.\n\nIn the next elections, the Congress will concentrate on these 50 MLAs and will ensure the victory of DMK in 75 more constituencies. Five years later, as predicted by Annadurai, the DMK captured power in the 1967 elections, handing out a humiliating defeat to the Congress, from which it never recovered.", 
    "section": "national", 
    "title": "A K-Plan that led to Annadurai’s defeat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}