{
    "author": [
        "M K"
    ], 
    "text": "Two women, who left their homes a few months ago following mental disturbance, were reunited with their families on Saturday.\n\nShuba (20) of Coimbatore and Nagammal (36) of Tirupattur were among the 38 mentally disturbed persons found straying on the city’s streets. They were rescued by the police and public and lodged at the Coimbatore Corporation’s night shelter. On an order from the Corporation on July 10, 2015, that such persons should not be lodged in the shelter as they required special care, they were moved out.\n\nWith the help of city-based NGO Eera Nanjam that works for mentally affected and abandoned persons, they were taken to RVM Hospital at Bengaluru in July. They were offered free treatment and lodging there.\n\nEleven of them have recovered so far. The managing trustee of Eera Nenjam, P. Mahendiran, said that they have so far successfully united eight of them with their families.\n\nShuba lived with her mother Savithri in a home for destitute at Singanallur. “She grew violent and left the home early last year. With the clues given by Shuba after recovery, we traced her mother,” Mr. Mahendiran said.\n\nNagammal, a mother of three, left her house at Tirupattur in Vellore District. Based on a complaint lodged by her father Murugan, police registered a case and search for her did not yield results. After recovery, she had told Eera Nenjam about her family. The volunteers of the trust traced her parents, who took her back home with tears of joy.\n\nMr. Mahendiran said that so far they have united eight such persons with their families. This included Yadav (52) from Bihar. There were no takers for a 38-year-old man from Chennai, and 45-year-old man from Kovilpatti. “A woman from Palakkad has also recovered and we are trying to trace her family,” he added.", 
    "section": "national", 
    "title": "After care, they reunite with family members", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}