{
    "author": [
        "Special Correspondent"
    ], 
    "text": "OPS says Goyal’s allegation that he could not meet CM aimed at achieving political gains\n\nFacing heat from the Opposition over Union Power Minister Piyush Goyal’s critical remarks about inaccessibility of Chief Minister Jayalalithaa, the ruling AIADMK on Monday issued a counter statement through Finance Minister O. Panneerselvam.\n\nIn a statement, the senior leader said there was no truth in Mr. Goyal’s statement that he could not meet Ms. Jayalalithaa. It was a baseless allegation aimed at making political gains ahead of the elections.\n\nListing out the number of times the Union Ministers, including Prime Minister Narendra Modi, had met Ms. Jayalalithaa, Mr. Panneerselvam condemned the statement of Mr. Goyal and a similar statement by Union Minister of Roads and Shipping Pon. Radhakrishnan.\n\n“Such allegations are being made for political gains as it has become clear that the AIADMK could not be defeated in the Assembly elections,” he said.\n\nIncidentally, Mr. Panneerselvam, who is said to have been sidelined in the party, issued the statement on behalf of the party supremo after DMK president M. Karunanidhi sought a response from Ms. Jayalalithaa on Sunday.\n\n“People know well that ‘Amma’ has been meeting Union Ministers in person and has been writing letters,” he said, listing out the details of each meeting, including those she had with Mr. Modi.\n\nIn December 2015 alone, she had met Mr. Modi, Union Finance Minister Arun Jaitley, Urban Development Minister Venkaiah Naidu and Civil Aviation Minister Ashok Gajapathy Raju.\n\n‘MPs denied appointment’\n\nOn the contrary, the Centre was not granting appointment to AIADMK MPs with the Prime Minister on the Tamil Nadu fishermen issue and GAIL pipeline issue, Mr. Panneerselvam charged.\n\nBJP’s poll plank\n\nMeanwhile, addressing a press conference here, BJP national general secretary P. Muralidhar Rao said the failures of the AIADMK government would be the main poll plank of the BJP.\n\nSince access to the Chief Minister had become difficult, there was stagnation in implementation of schemes, Mr. Rao alleged.\n\n“If there is no development, peace cannot prevail,” he said, adding that in the last five years, attacks on members of Hindu organisations had gone up.", 
    "section": "national", 
    "title": "AIADMK hits back at BJP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}