{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Though for the record, the DMK had downplayed the recent meeting between the expelled Madurai strongman M.K. Alagiri and his father-cum-party president M. Karunanidhi, it is reliably learnt that on the occasion the former had shared his inputs on facing the ensuing Assembly election.\n\nA source close to Mr. Alagiri told The Hindu on Monday that the former Union Minister had discussed certain political issues, particularly those pertaining to the southern districts, the choice of potential candidates and spending money for electioneering.\n\n“He had suggested fielding new faces, preferably youngsters and women candidates. If the party carried the right propaganda, the DMK has bright chances of winning a majority of seats from Theni to Kanyakumari,” the source said. Instead of fielding former ministers, women candidates who have served the party for long number of years should be given preference. Likewise, Mr. Alagiri is learnt to have suggested certain “strategies” to be adopted in spending money for the election.\n\nHe had also said that booth-level committee cadres should be motivated to reach out to the voters as early as possible.\n\nMr Alagiri was apparently of the view that the DMK’s fulfilled promises during its last regime for the people of south should be recalled, including the major infrastructural facilities like setting up the Madurai Bench of the Madras High Court.\n\nOn candidate selection, Mr. Alagiri is believed to have spoken at length with Mr. Karunanidhi and even cautioned how a wrong choice might spoil the chances of victory for the DMK and had reportedly shared his “wish list” of candidates.\n\nHe had also shared with his father that there was no threat from the MDMK leader Vaiko, who had helped form the alliance with Vijayakant. The former DMK south zone organising secretary felt that the third front may face a washout in the polls.\n\nIn the absence of an anti-incumbency wave, the DMK has to fight harder to win the confidence of voters. The only solace for the DMK is the rise in infighting in AIADMK functionaries in southern districts like Theni, Madurai, Thoothukudi, Sivaganga among others, where there were many power centres.\n\nThe sources said Mr Alagiri insisted that the DMK should also give representation to Dalits in the party to contest as the community was in a state of shock and anger with the AIADMK after numerous honour killings and abuses by caste Hindus in southern districts had not seen any tangible action by police.\n\nWhen Mr. Alagiri was then in the party and was the south zone organising secretary, he had steered the DMK to victory in all the by-polls held in Madurai Central, Madurai West, Tirumangalam and Tiruchendur, defeating its arch rival AIADMK. Nonetheless, the party was humbled in the 2011 Assembly polls.", 
    "section": "national", 
    "title": "Alagiri submits ‘wish list’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}