{
    "author": [
        "R Sivaraman"
    ], 
    "text": "AINRC loses majority with his resignation in the 30-member Assembly\n\nThe All India NR Congress (AINRC) led by N. Rangasamy has lost its majority with sitting MLA P. Angalane, who recently joined the Congress, on Monday tendering his resignation as legislator to the Speaker V. Sabapathy.\n\nAs a result, the strength of the AINRC was reduced to 14 MLAs in the Puducherry Legislative Assembly.\n\nThe AINRC which bagged 15 seats in the 30-member House formed the government with the support of an independent MLA, V.M.C. Sivakumar.\n\nMr. Angalane had on March 15 resigned from the party primary membership, alleging that the party president and Chief Minister N. Rangasamy deliberately ignored his constituency. Without resigning the MLA post, he joined Congress in the presence of senior Congress leaders last week.\n\nApprehending that he would be disqualified from the post on defection to the Congress, Mr. Angalane on Monday met the Assembly Speaker and tendered his resignation from the MLA post.\n\nLater talking to The Hindu , Mr. Sabapathy said, “The resignation of Mr. Angalane was accepted and forwarded to the Assembly Secretary for further proceedings such as publication in the gazette.”\n\nAfter resigning the post, Mr. Angalane alleged that politics was at play and that he was, as chairman of the Puducherry Investment Development Corporation, put under pressure to give jobs to persons recommended by the Chief Minister.\n\n“I was sacked when I refused to obey his order,” he claimed.\n\nWith his resignation, the strength of the AINRC in the Assembly has come down to 14 from 15.\n\nThere are three nominated MLAs who do not have voting rights in the event of any motion against the ruling government.\n\nThe other day, the People’s Welfare Front led by CPI leader R. Viswanathan urged the Chief Minister to resign owning moral responsibility in view of the government losing its majority status.\n\nBut it remains to be seen if Opposition parties would push the government for a test of strength on the floor of the House now that Assembly elections have been announced.\n\nAlthough the House has seven Congress MLAs, two of them are tilting towards the AINRC and Nandha T. Saravanan, one of two DMK MLAs has switched his loyalty to the AINRC while the AIADMK which has five MLAs is not keen on bringing a no-trust motion against the AINRC.\n\nThere are three nominated MLAs to the Assembly\n\nwho do not have voting rights", 
    "section": "national", 
    "title": "Angalane resigns from MLA post", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}