{
    "author": [], 
    "text": "Christ College of Engineering and Technology celebrated its annual day 'CETAFEST’ 16 recently. —Photo: Special Arrangement\n\nChrist College of Engineering and Technology celebrated its annual day ‘CETAFEST’16’ last Wednesday with dance, skit and mimicry programmes. The students who topped the 2015-2016 academic year were given prizes with certificates.\n\nManaging Director S.R.S.Paul, in his presidential address, stated that Christ College has always performed well in academics and set a stage to showcase the students’ talents.\n\nFilm actor Ma.Ka.Pa.Anand was the chief guest.\n\nSethu, a mimicry artist, expressed his pleasure to see a college that excelled in both academics and co-curricular activities. Actress Gayathri Raguraman who was also a chief guest had a friendly interaction with the students.\n\nPradeep Devaneyan, Dean School of Mechanical and Building Sciences, delivered the welcome address. Director-cum-principal of the college A. Ravichandran read out the annual report. L. J. Soundarajan Dean School of Management Studies delivered the felicitation address.\n\nGraduation Day\n\nV.R.S. College of Engineering and Technology conducted their 18{+t}{+h}Graduation Day on the college premises on March 3. N. Muthuvannan, Director, delivered the welcome address and N.Anbazhaghan, principal of the college, presented the annual report of the college activities during the academic year 2014-2015.\n\nVijaya Muthuvannan, Chairperson, delivered the presidential address to the graduates.\n\nM. Balaji, Senior Associate Vice President, EID Parry (India) Limited, Nellikuppam, Cuddalore District distributed 374 degree certificates. M. Gopalakrishnan, received a gold ring for securing the first rank in Anna University in M.E. (Product Design and Development).\n\nK. Dharani and M. Sathya received a gold ring each for securing 15{+t}{+h}and 25{+t}{+h}ranks respectively in M.E. in Embedded System Technology.\n\nAwareness programme on suicide prevention\n\nThe National Service Scheme (NSS) cell of Priyadarshini Engineering College, Vaniyambadi, organised an awareness programme on suicide prevention recently. Volunteers from Sneha, a suicide prevention centre in Chennai, interacted with students.\n\nVoter awareness programme held\n\nA voters’ awareness programme was organised at Marudhar Kesari Jain College for Women, Vaniyambadi recently.\n\nBhagyalakshmi, tahsildar of Vaniyambadi administered a pledge to students and spoke on the importance of exercising one’s right to vote.\n\n(Reporting by S. Senthalir and Serene Josephine. M )", 
    "section": "national", 
    "title": "Annual day at Christ College", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}