{
    "author": [
        "Atul Swaminathan", 
        "T S"
    ], 
    "text": "Permanent museum-cum-exhibition named after Indologist E. Hultzsch\n\nLovers of heritage and students of history can now head to Fort St. George and visit a newly-created centre that has impressions of inscriptions from all over India on display.\n\nEstampages, as these impressions of inscriptions are called, are displayed at the newly-created Eugen Julius Theodor Hultzsch Memorial Museum-cum-Epigraphical Photo Exhibition at the historic fort. The permanent museum-cum-exhibition has been named after E. Hultzsch, a German Indologist and epigraphist, known for his work in deciphering the inscriptions of Ashoka, officials said.\n\nThe museum has been created by the Epigraphy branch of Archaeological Survey of India (ASI), Southern Zone, as part of its cultural awareness programmes on the occasion of the 159th birth anniversary celebrations of Dr. Hultzsch and also the silver jubilee year (1990-2015) celebrations of ASI, Southern Zone.\n\n“We have displayed the estampages of Tamil-Brahmi inscriptions from across the nation,” K. Karuppiah, Deputy Superintending Epigraphist, ASI, told The Hindu . The inscriptions are from the period between the third century B.C. and second century A.D. “They are in Tamil, Telugu, Malayalam, Kannada, Sanskrit, and Prakrit. The nature of these inscriptions is donative records and hero worship. The staff of the Epigraphy branch visit villages across India, copy the inscriptions and decipher them. The most important deciphered inscriptions are highlighted in Epigraphia Indica, a quarterly journal of the ASI,” he said.\n\nThrough Tamil-Brahmi inscriptions, ASI gets a lot of information about Chera, Chola, and Pandya kings, he added.\n\nThe exhibition will be formally inaugurated at the ASI Office, Clive Building, Fort St. George, on Tuesday.\n\nIt will remain open on all working days and entry is free. For details, contact the ASI on Ph: 25675783.", 
    "section": "national", 
    "title": "ASI opens museum of estampages from across India", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}