{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Kanchi acharya Jayendra Saraswati arrives at the I Additional Session Court in Chennai on Monday.— Photo: K.V. Srinivasan\n\nThe 80-year-old Kanchi acharya, Jayendra Saraswati, who was present before a sessions judge here on Monday, submitted that all the charges framed against him in connection with the decade-old auditor Radhakrishnan assault case were false.\n\nRecently, the I Additional Sessions Court, Chennai, summoned Jayendra Saraswati and eight others to appear before it in connection with the case.\n\nThe acharya, who appeared before the court accompanied by a posse of lawyers and his disciples, was allowed to sit and answer over 90 questions that ran to over 63 pages. He took about an hour to answer the questions. He responded with a “no” or “I do not know” to most of the questions.\n\nOther accused, including Sundaresa Iyer and Raghu, also submitted that the charges against them were false.\n\nOn September 20, 2002, Mr. Radhakrishnan, a former associate of the Kanchi Mutt in Kancheepuram, was attacked with deadly weapons in which he and his wife were seriously injured.\n\nThe Foreshore Estate police registered case against Jayendra Saraswati and 11 others in connection with the attack.\n\nThe charge sheet was filed in 2006 for offences including criminal conspiracy and attempt to murder.\n\nAccording to prosecution, the gang had attacked Mr. Radhakrishnan assuming that he was writing letters in the name of ‘Somasekhara Ganapadigal’ highlighting irregularities in the Kanchi Mutt. During the pendency of trial, one of the accused, Ravi Subramaniam, turned hostile while Appu and Kathiravan died. Sessions Judge P. Rajamanikam posted the case to April 1.\n\nOther accused, including Sundaresa Iyer and Raghu, said charges against them were false", 
    "section": "national", 
    "title": "Auditor assault case: Kanchi acharya denies charges", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}