{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It is easy for some to preach but not practise. But, leading by example is Tamil Nadu’s Chief Electoral Officer Rajesh Lakhoni, who allowed an election squad to check his car on Sunday at Ashok Nagar here.\n\n“I don’t use a revolving siren (blue light) atop my car, so they stopped it. They recognised me and saluted me. But since the purpose of stopping the vehicle was to check it, I asked them to carry on with their work,” he said.\n\n“People should cooperate with the checking teams. There is nothing wrong in the checks,” Mr. Lakhoni added.\n\nEver since the Model Code of Conduct for the Assembly election on May 16 came into force, special checks are being conducted by teams consisting of Revenue Department officials and police personnel. Flying Squads and Static Surveillance Teams have been carrying out checks looking for unaccounted cash or things meant for distribution. The exercise is often videographed.\n\n“Even last night I was checked at three points within a distance of four km. And even though I told them my vehicle had been subjected to a check a few minutes ago, the team members continued with their work,” said Deepak, a resident of Kilpauk.\n\nMany motorists grumble when their vehicles are stopped. One motorist complained that the teams were not checking cars that carry party flags.\n\nMeanwhile, on a complaint pertaining to a dhoti advertisement that is related to the elections, Mr. Lakhoni said the local Revenue Officer has been asked to check if the company had taken prior permission. “If there is any advertisement that is election-related they should take permission. As long as the content of the ad is not objectionable, they can canvass for anyone,” he said.\n\nLakhoni sends out a message to those who complain about vehicle checks", 
    "section": "national", 
    "title": "CEO leads by example, allows flying squad to check his car", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}