{
    "author": [
        "D Madhavan"
    ], 
    "text": "Other amenities will be provided at Ambattur Old Town bus terminus after Assembly elections\n\nThe renovation project at the Ambattur Old Town (OT) bus terminus was sanctioned prior to the enforcement of the model code of conduct. —Photo: M. Vedhan\n\nCommuters at the bus terminus in Ambattur Old Town (OT) on the Chennai-Tiruvallur High (CTH) Road are happy that one of their long-pending demands is now being met.\n\nFor close to a fortnight, construction of a modern swanky green bus shelter with a dozen supportive iron beams is going on.\n\n“The new bus shelter at the terminus came as a pleasant surprise for us, as we have been demanding the facility for many years now,” said K. Mahalakshmi, a commuter in Ambattur.\n\nConsidered to be one of the oldest bus termini on the western outskirts, the Ambuttur OT terminus operates more than 200 services every day catering to commuters from Cholembedu, Sholapuram, Mounaswami Madan, Oragadam, Old Township Road, Venketapuram, Krishnapuram and K.K. Road.\n\nMTC officials told The Hindu that the work, being executed by the Public Works Department (PWD), was restricted only to the construction of a bus shelter at the terminus and the rest of the amenities, including seating, water taps, digital timing boards and toilets, would be provided after the elections as these works needed more funds. However, officials were quick to add that the renovation project at the terminus was sanctioned early this month prior to the enforcement of the Model Code of Conduct.\n\nLikewise, the civic officials of the Zone-7 (Ambattur) of the Chennai Corporation have been busy installing street lights between the Ambattur Industrial Estate bus terminus junction and Rail Over Bridge (ROB) near TI Cycles company in Ambattur OT on the CTH Road.\n\nIn fact, residents and activists in the neighbourhood have been demanding lighting between these points for many years as goods-laden lorries from neighbouring States like Andhra Pradesh use the stretch to reach industrial units in Ambattur. On an average, at least two accidents occur between these two points every week.Traffic creates hindrance\n\nCorporation officials said that under the Corporation’s general funds with special grant, 111 LED lamps, with each pole having two lights, will be installed between Ambattur Industrial Estate bus terminus junction and ROB near TI Cycles on the stretch, a distance of around three km. We were planning to complete the work soon but the continuous traffic on the CTH Road, a State highway, slows down our work,” said a Corporation official.", 
    "section": "national", 
    "title": "Commuters elated over new bus shelter", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}