{
    "author": [
        "Pon Vasanth Arunachalam R Rajaram"
    ], 
    "text": "T. Balaji, a Dalit youth, along with his mother T. Selvi at the office of Madurai-based NGO, Evidence. The family from Kolakudi in Tiruchi district is allegedly subjected to harassment by the family of a caste Hindu girl, with whom Balaji had fallen in love.— Photo: G. Moorthy\n\nA Dalit youth from Kolakudi village in Tiruchi district has alleged that he and his family are being subjected to continuous harassment and violence by the family of a caste Hindu girl, whom he reportedly married last December but were immediately separated and the girl was married off to another person.\n\nThe youth, T Balaji (29), the first graduate from his family working as a teacher in a private school near Namakkal for two years, claimed that the girl’s family had also taken away his educational certificates.\n\nSpeaking to The Hindu at the office of Madurai-based NGO Evidence, which is presently assisting him, Mr. Balaji alleged that no action had been taken despite repeated complaints made at Thathaiyengarpettai police station, Musiri Deputy Superintendent of Police office and with the Tiruchi District Collector.\n\nAccording to Mr. Balaji, he and a 19-year-old girl from neighbouring Valasiramani village belonging to an intermediate caste were in love. Though the girl’s family rebuked her many times, their relationship continued as the school, where Mr. Balaji worked, and the college where the girl studied were close by.\n\nMeanwhile, as the girl became pregnant, Mr. Balaji said that they decided to get married on December 6, 2015. “We met the night before near a temple outside Valasiramani. I knew that her family and their men were searching for us. So I tied the thali immediately,” he said.\n\nHowever, according to him, the couple was caught and beaten up by the girl’s family, who allegedly removed her thali and made one of their relatives tie the knot on the same night. “They beat me up severely,” he alleged.\n\nThe family also took away the couple’s educational certificates and some cash, which they had with them while eloping.\n\nWhile the girl had now separated from her relative, Mr. Balaji claimed that the girl’s family was hounding him and his family for the past three months. “They want us to leave the village,” he said.\n\nShowing medical records, Mr. Balaji said he was beaten up by her family on March 15 after which he underwent treatment at the Mahatma Gandhi Memorial Government Hospital in Tiruchi for 12 days.\n\n“Even then police did not take action,” he alleged.\n\nHowever, police sources in Tiruchi claimed a CSR (community service register) had been issued on the complaint from the youth. But when enquiries were conducted with the girl, she had given a written statement stating that she did not know the youth and his claims were false, a police officer of the Musiri sub-division said.", 
    "section": "national", 
    "title": "Dalit youth harassed for falling in love with caste Hindu girl", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}