{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Monday allowed a plea for a fresh autopsy moved by the son of a 50-year-old Dalit agricultural labourer, who was found dead under suspicious circumstances in a farm well near Erode.\n\nJustice R. Mala passed the direction considering the circumstances that lead to the death of Chinnasamy . According to the direction, a team of doctors constituted by the Coimbatore Medical College and Hospital along with a doctor of petitioner’s choice are to conduct a fresh post-mortem examination, which shall be video graphed.\n\nThe petitioner, C. Balasubramanian, submitted that his father was working as an agricultural labourer in Perunthurai, Erode. He had recently opposed an atrocity committed against a Dalit in the area by the dominant community and organised a series of protests. He was also instrumental in registering cases against the offenders under provisions of SC/ ST (Prevention of atrocities) Act, 1989.\n\nTo settle the issue, the local administration along with the police arranged a peace talk on March 18. It was alleged that the victim was asked to withdraw charges under the SC/ ST Act against persons belonging to the dominant community, which he refused.\n\nMr. Balasubramanian submitted that on the very next day, his father was found dead in a well in the farm where he works.\n\n“The authorities did not even allow my family members to see his body. Without any inquiry, they sent the body to the Coimbatore Government Hospital, though there is a government hospital in Erode,” he said.\n\n“Our demand to register a case under Section 302 of the IPC and Sections under SC/ ST (Prevention of Atrocities) Act, 1989 was not accepted by the police,” he added. On Thursday, the High Court adjourned the plea for the government to submit its stand, with a direction to preserve the body in a cold storage facility till then.\n\nWhen the petition came up for hearing on Monday, the court allowed the plea and directed the authorities to file a compliance report by April 4.\n\n“The authorities did not even allow my family members to see his body”", 
    "section": "national", 
    "title": "Dalit death: HC allows plea seeking fresh autopsy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}