{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The members of Tamil Nadu Foodgrains Merchants Association have appealed to the Chief Electoral Officer to give relief as the trade and industry suffered at the hands of ‘flying squads’ which seized cash under the pretext of “unaccounted currency” being taken when model code of conduct was in force in view of the general elections.\n\nSubmitting a memorandum to Rajesh Lakhoni, CEO in Chennai, a copy of which was released here on Monday, the members led by association president S.P. Jeyapragasam said that till date, the seized cash didn’t belong to anyone with political background, but to innocent traders. In the interest of trade and industry, the Election Commission should permit the traders to carry cash on production of the photocopy of TIN certificate issued by the Commercial Taxes Department.\n\nLikewise, for those without TIN number, the traders shall have a copy of the DNO license or professional tax paid by him to the local authorities. While a majority of the industries were located in the outskirts, the employer or any authorised representative should be permitted to carry cash for disbursal of wages to the employees.\n\nAuthentic document\n\nFor this purpose, a detailed break-up of the cash being transported and authorisation in the company’s letterhead should be treated as authentic.\n\nThe traders who carried cash for remitting in the banks with duly-filled challans should also be permitted and cash should not be seized.\n\nLarger interest\n\nIn the larger interest, the Election Commission should reconsider its decision and allow the traders to carry cash as business had come to a standstill already during the last three weeks.\n\nIf the trend of seizure continued for another two months, the industry may collapse, Mr. Jeyapragasam said in the memorandum.\n\n“A detailed break-up of cash being transported and authorisation in the firm’s letterhead should be treated as authentic”", 
    "section": "national", 
    "title": "Foodgrain merchants’ plea", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}