{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "In rural areas, administration will paste stickers on ration cards\n\nTo improve the poll percentage, the district administration is doing all it can to encourage voters to go to polling booths to exercise their franchise on May 16. One of the measures is identification of low-voter-turnout pockets to conduct awareness among voters there. The district administration has identified pockets coming under 100 polling booths in the 10 Assembly constituencies in the district that recorded low voter turnout in the 2014 General Election, say senior officials.\n\nThere are six such booths in the Mettupalayam Assembly constituency, 13 in Sulur, 12 each in Kavundampalayam and Coimbatore North, eight in Thondamuthur 10 in Coimbatore North, 11 in Singanallur, 14 in Kinathukadavu and seven each in Pollachi and Valparai.\n\nThe officers say the administration will try various ways to reach out to the voters aside from conducting door-to-door campaign in the pockets. It was thinking of pasting stickers on milk packets, LPG cylinders and other ways like street plays to send out messages to voters to perform the duty cast upon them.\n\nIn rural areas, the administration will paste stickers on ration cards to convey the message to voters, they add.\n\nIn the last couple of days, the administration had reached out to voters coming out of mosques and churches after prayers.\n\nThe administration does not want to leave any opportunity missed. Of the pockets with low voter turnout, Saibaba Colony in the Coimbatore South Assembly constituency stands out for having recorded the lowest voter turnout in the 2014 election.\n\nThe voters there might have been distraught at the political developments; that could be the reason they did not vote. If that be the case, then they must go out in large numbers to choose the right candidate, says former Member of Parliament P.R. Natarajan.\n\nThey must shed the sense of despair and vote this time, for the area (Saibaba Colony) is packed with high net worth individuals and well-educated people.\n\nReason\n\nMohan Sankar, a resident of Bharathi Park, says that the residents’ lack of confidence on political parties that have failed to fulfil promises could be the reason for the voters in Saibaba Colony not going to the polling booths.\n\nBut then as they have duty to cast their vote, a few residents have come forward to mobilise the voters to exercise their franchise, he adds.\n\nMeanwhile, the election managers for the Coimbatore South segment are planning to float a Helium balloon with ‘voter awareness’ messages.", 
    "section": "national", 
    "title": "Going an extra mile to improve voter turnout", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}