{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Participants at seminar on 'Harmony in Management' hosted by the Sri Aurobindo Centre for Advanced Research. —Photo: Special Arrangement\n\nDoes harmony at the workplace have a bearing on the productivity of an enterprise or on the attainment of team goals by its various units?\n\nAt a recent one-day seminar on “Harmony in Management” organised by Sri Aurobindo Centre for Advanced Research (SACAR), speakers from a wide spectrum of managerial expertise addressed the participants on the need for, and the ways to achieve, harmony in operations.\n\nFor SACAR, the importance of the theme derived from the Indian view of the discipline of management which espoused harmony, along with the other pillars of wisdom, power and perfection, as a key enabler for business leaders to achieve their goals.\n\nWhile at the individual level, a manager can improve his/her effectiveness by ensuring harmony and balance within oneself – between his/her inner thoughts and outer actions and between the mind and soul, large corporations or owners of family businesses need to ensure that harmony prevails within the various arms of the organisation and that there is a clear succession plan in place, so that no disharmony is created at any stage.\n\nAccording to Dr. Ananda Reddy, the Director of SACAR, the four essential components of harmony ¯ collaboration, goodwill, benevolence and tolerance---alone enable organisations to work and progress smoothly.\n\n‘Revamp management education in India’\n\nManagement education in India needs to be re-engineered to impart training in these components as well, so as to make it more holistic and in tune with the times, he said.\n\nAshok Kumar Bhatia, Management Consultant, Member of Integral Management Group of SACAR, touched upon the manner in which challenges faced by managers from customers, suppliers, personnel, superiors, peers and subordinates could be successfully dealt with. “Much like musicians in an orchestra, managers have to move in tandem with each other so as to create a symphony. A harmonious working inevitably leads to ‘synergy’, a term often used in the realm of management,” he said.\n\nDr. G. Natchiar, co-founder, Emeritus, Director Aravind Eye Hospital, Madurai, who was the chief guest, stressed upon the importance of the Vision and Mission of an organisation. Explaining the core aspects of the “Aravind Eye Model”, Dr. Natchiar also shared with participants the innovative HR policies of the institution.\n\nShe highlighted the frugal aspect of her organisation which enables it to continue to offer affordable eye care to people of India and bring about harmony in its operations, and how measures to improve the productivity of doctors made the operations cost-effective and a role model for similar healthcare providers in other parts of the world.\n\nB. R. Babu, Secretary Welfare, Government of Puducherry, shared with the participants his experiences of bringing about industrial harmony in public sector undertakings.\n\nUma Prajapati, Director of Upasana: Integral Design, spoke of the inner call of a professional designer and the satisfaction gained when serving the community around a business. She highlighted her singular achievement of creating Tsunamika, a tiny doll, which brought about a positive change in the lives of women affected by the 2004 tsunami.\n\nProf. Sibnath Deb, Prof. of Psychology and Director-in-charge of the Directorate of Distance Education, Pondicherry University, focused on the psychological aspects of inter-personal relationships, while Ganesh Babu, Director of “Winning Minds”, emphasised the importance of harmonising oneself first.", 
    "section": "national", 
    "title": "‘Harmony in management builds a successful team’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}