{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has quashed an order passed by Musiri Revenue Divisional Officer on March 11, 2013, to demolish a 200-year-old house at Thuraiyur in Tiruchi district owing to non-compliance of procedures prescribed under Section 133 of Code of Criminal Procedure that could be invoked by executive magistrates to avoid a mishap.\n\nAllowing a writ appeal filed by the house owner, a Division Bench of Justices S. Manikumar and C.T. Selvam held that the RDO had not followed the procedure of passing a preliminary conditional order requiring the appellant to either repair or demolish the reportedly dilapidated building and then seeking an explanation for non-compliance of the preliminary order before passing final orders on the issue.\n\n“To embark upon a proceeding under Section 133 Cr.P.C., the Magistrate concerned must be primarily of the view that the existence of the building poses a danger to persons residing therein or passers-by. On being of such view, the Magistrate initially is required to pass a conditional order, requiring removal, repair or support of such building and by the persons in possession thereof.”\n\n“The preliminary conditional order shall also inform the right of the person in possession, if such person has any objection, to appear before the Executive Magistrate or some other Magistrate subordinate to him and show cause why the order should not be made absolute. The person against whom such an order is made may either comply with the requirements thereof or show cause there against,” the judges said.\n\nObserving further that the Magistrate should thereafter take evidence in the matter as in a summons case (a criminal case attracting a sentence of less than two years) when a person shows cause against the conditional order, the Bench said that in the instant case the RDO had directly passed final orders on the basis of a PWD engineer’s report to the effect that the residential house was 200 years old.", 
    "section": "national", 
    "title": "HC quashes RDO’s order to demolish 200-year-old house", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}