{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Monday directed the Chennai Central Crime Branch (CCB) to consider the statement recorded from witnesses along with the documents and register a case if any cognisable offence is made out on a complaint of alleged job racket.\n\nAccording to the petitioner, J. Sridharan, an Assistant Manager in Tamil Nadu State Transport Department, on March 7 he had filed a complaint against Thennarasu who was alleged to be a friend of an associate of former State Transport Minister V. Senthil Balaji, for allegedly cheating him to the tune of Rs 1.14 crores, assuring jobs for aspiring candidates in the State Transport Corporation (TNSTC). The petitioner, who claimed that he got the acquaintance of Thennarasu through a conductor of TNSTC, submitted that Thennarasu promised to secure jobs in TNSTC for candidates who have received interview letters from the Corporation.\n\n“Believing his words, I paid a total amount of Rs 1.86 crore to secure employment for people known to me who have applied for jobs in TNSTC,” Sridharan said.\n\nAs the promise made by Thennarasu did not materialise and after repeated requests to return back the money, he gave Rs 66.50 lakh on various dates and issued two cheques for Rs 1.14 crore, the petitioner added.\n\nSince the cheques were dishonoured due to insufficient balance, Sridharan lodged a complaint with the Commissioner of Police which was subsequently forwarded to the Central Crime Branch for investigation.\n\nAlleging that so far no fruitful action has been taken on his complaint, the petitioner moved the high court to depute an officer in the rank of Assistant Commissioner of Police to register a case on the complaint and investigate the issue. When the plea came up for hearing, Justice R. Mala directed the Inspector of Police, Vepery, CCB to register a case if prima facie offence is made out.", 
    "section": "national", 
    "title": "High Court directs CCB to probe complaint of job racket", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}