{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Electors’ Photo Identity Card will be issued to them, says Collector\n\nA total of 515 inmates from 15 homes for the aged and orphanages in Dindigul district will be enrolled in electoral rolls this week, according to Collector T.N. Hariharan.\n\nInteracting with the inmates of a home for the aged near GTN Arts College here on Monday, he said that the election officials had already identified the inmates in all the homes and they would enrol their names in the voter list as quickly as possible. Electors’ Photo Identity Card would also be issued to them immediately, he said.\n\nInmates, who were from other districts and staying in homes in Dindigul district would also be enrolled after getting their names deleted in the rolls of their respective Assembly constituencies, the Collector added.\n\nElection officials had identified 515 inmates in 15 homes — four in Dindigul, two in Athoor, one in Thoppampatti, two in Oddanchatram, three in Nilakottai, one in Kodaikanal, and two in Palani – for enrolment. Besides, four persons aged 18 years and above were also identified for poll roll enrolment from orphanages in the district.\n\nVirudhunagar\n\nThe “inclusive participation” initiative of the Election Commission of India has fructified in the case of 61 inmates of three old age homes in the district when Collector V. Rajaraman inspected the homes on Sunday.\n\nThe District Election Officer found that 61 of the 93 inmates of the homes either did not have their names enrolled in the voter list or had migrated from one constituency to another on being admitted to the home. “The names could have been deleted after they migrated from their place of dwelling to the old age homes. For six of them, their names were enrolled elsewhere. We identified such people and our officials gave them relevant forms for inclusion or change of address, so that we can achieve 100 per cent polling in the Assembly election,” the Collector said.\n\nOut of the four old age homes in the district registered with the Department of Social Welfare, the officials had undertaken the enrolment activity in January.", 
    "section": "national", 
    "title": "Inmates of old age homes to be enrolled in poll roll", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}