{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A group of 13 Sri Lankan Tamils housed in the Special Camp here went on an indefinite fast on Monday demanding their release. Another inmate R. Mahendran is on fast from March 26 on the camp situated a few metres from the Central Prison in support of the same demand.\n\nPolice sources told The Hindu that the 13 Lankan Tamils against whom cases were pending launched the indefinite fast in the morning. Three among them - T. Jayadharan, A. Anandhan and A. Kumaraguru – were shifted to the Tiruchi Special Camp from Cheyyar Special Camp recently. The other fasting inmates include N. Bhageedharan, P. Ilangainathan, S. Vijayakumar, G. Rajendran, R. Pradeepan, S. Sireeswaraja, and M. Pradeep.\n\nThe inmates were facing cases under the Passport Act, the Foreigners Act, and the Unlawful Activities (Prevention) Act and others at different places in the State. All the cases were said to be under investigation. The cases against the inmates were booked by the Ramanathapuram ‘Q’ Branch CID, Kanyakumari ‘Q’ Branch CID, and Tiruchi ‘Q’ Branch CID units besides Chennai City Crime Branch.\n\nThe Tiruchi camp accommodates 16 Sri Lankan Tamils and a Nigerian. The sources said barring two Lankan Tamil inmates Dhayabararaj and Yugapriyan, the remaining were on fast.\n\nConfirming that the inmates were on fast, Regional Special Deputy Collector (Refugee Camps) S. Natarajan said the inmates demanded their release and if that was not possible at least their family members should be allowed to stay with them in the camp.\n\nMr. Natarajan said the demands of the fasting inmates would be conveyed to the State government through the district Collector, he said adding that it was the government that could only take a decision on their release.\n\nThis is not the first time that Sri Lankan Tamils housed in the Tiruchi Special Camp had resorted to fast demanding their release. In October last year, a group of 10 Lankan Tamils observed fast demanding their release. Prior to that, some Lankan Tamil inmates went on fast demanding early disposal of cases booked against them.", 
    "section": "national", 
    "title": "Lankan Tamils in Tiruchi camp begin indefinite fast", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}