{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu National Domestic Workers Union affiliated to AITUC urged the Centre to frame national level policy for domestic workers as per its assurance given to the International labour Organisation (ILO).\n\nSpeaking to reporters on the sidelines of a training programme for the domestic workers here on Sunday, Wahida Nizam, general secretary of the Union, urged the Centre to implement the recommendations adopted at the ILO convention.\n\nIndia was a signatory to the convention. The ILO convention’s recommendation on decent work for domestic workers aimed at protecting and improving the working conditions of domestic workers worldwide.\n\nShe said that the country accounted for about 50 lakh domestic workers. They were not entitled for benefits such as weekly off, festival leave, medical facility and bonus.\n\nThey do not enjoy any legal protection and are also not covered by the Minimum Wages Act. The government has also not done any survey about them. The governments of Kerala and Gujarat have fixed minimum wages for domestic workers. No minimum wages have been fixed for domestic workers in Tamil Nadu, she said and called upon the state government to fix a minimum wage of Rs. 15,000 per month and maternity assistance of Rs. 60,000 to them.\n\nThe government also take care of the education expenses of the domestic workers. The government should create a fund for extending these benefits and earmark one per cent of the house tax to this fund. Referring to the complaints of sexual harassment on women at workplaces, Ms. Wahida Nizam favoured formation of district level local groups to enquire into such matters.\n\nA. Vimalan, district secretary, AITUC, and Munusamy, district secretary of the Construction Workers’ Welfare Association, spoke.\n\nThe government also urged to take care of the education expenses of the domestic workers", 
    "section": "national", 
    "title": "Minimum wage of Rs. 15,000 per month sought for domestic workers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}