{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "As Tamil Nadu heads to poll on May 16, the AIADMK is banking big on its “achievement” on the power front\n\nAhead of the 2011 Assembly elections when the DMK was the incumbent, power cuts were rampant across the State and in some rural pockets, load shedding was up to 12 hours a day.\n\nApart from the alliance arithmetic that worked in favour of the AIADMK that won with an absolute majority, the DMK also suffered the wrath of voters for the long hours of power cuts.\n\nAnalysts later pointed out that the major reason for the DMK's defeat was load shedding. Officials estimated that the State was short of over 4,000 MW.\n\nFive years on, the fruits of starting several power initiatives have finally borne fruit. Now, Tangedco officials state their belief that the power position is comfortable. Chief Minister Jayalalithaa knows this well and has frequently taken credit for the turnaround in power situation.\n\nIn the past five years, the State has added over 3,000 MW in thermal power generation alone.\n\nTo be factual about this, technically, all the projects that have helped improve the power situation now, were launched during the previous DMK regime in 2007 to 2009 .\n\nThe AIADMK can certainly claim that the MoUs for some of the plants like in Vallur were signed in 2002 itself but the fact is that the units were completed only in 2012 and later. A decade had passed in between. And, meanwhile, Tamil Nadu had lost out on its power surplus status, and probably on thousands of crores in investments. While the AIADMK and the DMK blame each other, as alternate rulers of the State, it is fair that both share the blame.\n\nIn fact, the genesis of the crisis dates back to the 1990s. During 1991-96, Jayalalithaa, in her first term, signed agreements with a number of private producers. Only a few took off. The DMK government that succeeded it cancelled the agreement for the Jayamkondam project with a consortium and changed the bidding process but nothing came out of it.\n\nThen the DMK government invited bids for 20 fuel power projects following the Central policy on using liquid fuel for power plants to provide immediate relief to power shortage. Only a handful joined and the power purchase agreement from these independent power producers at “high cost” was embroiled in controversy till last year as both the AIADMK and the DMK continued with the purchase citing the 15-year contract and power shortage scenario.\n\nThe present AIADMK government, which boasts of the turnaround over the past five years, has struggled hard to launch thermal power projects though, mainly due to the legal battles it had to wage in the Madras High Court. In 2014, the first supercritical thermal power plant at Ennore was launched which could take two more years to be commissioned. In between the legal battle forced it to change the bidding process. Now, the AIADMK government, at the fag end of the term, has launched two more supercritical plants that could take four years to complete, going solely by the historical delay in commissioning of every plant in the past decade.\n\nTo bridge the gap between demand and supply, the State also went in for long-term power purchase that has helped. With the State already a pioneer in wind energy, Ms. Jayalalithaa came up with a solar mission. Despite the initial controversy surrounding the price (Rs 7.01 per unit for companies supplying to the grid by March 31), the State will benefit in the long run, Tangedco officials say assuring that the power situation is quite comfortable. As Tamil Nadu heads to another poll on May 16, the AIADMK is banking big on its “achievement” on the power front.\n\nIn the past five years, the State has added over 3,000 MW in thermal power generation alone", 
    "section": "national", 
    "title": "Power politics: from darkness to light", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}