{
    "author": [
        "S Prasad"
    ], 
    "text": "Parties play it safe, as always, when it comes to the serious issue\n\nPolitical parties in Puducherry can be expected, as always, to play it safe when it comes to advocacy of prohibition, while preparing their election manifesto for the May 16 Assembly elections. While most of the topics projected by their respective high commands either in Tamil Nadu or Delhi would be replicated in the manifesto one subject that has been judiciously avoided as far as Puducherry is concerned is that of prohibition.\n\nPuducherry is known as tipplers paradise and any attempt on the part of political parties to clamp prohibition risks a severe setback in the electoral prospects.\n\nFor instance, when Morarji Desai was Prime Minister, an attempt was made to bring in prohibition in the Union Territory in 1979 together with the Janata Party’s then ally the AIADMK. It lasted barely a couple of months in the face of strong and sustained protests. Though prohibition was lifted this was one electorate that did not forget or forgive easily. When the 1980 Assembly elections came around, both the AIADMK and its ally the Janata Dal suffered a severe drubbing for what is held to be their experiment with prohibition. The AIADMK which contested in 17 constituencies drew a blank while its ally, the JD, managed to win in three constituencies and that too because of personal goodwill of the contestants. Since then, none of the mainstream parties have dared to toy with the idea of prohibition.\n\nAmong the main reasons that make prohibition advocacy taboo is that from a cultural perspective too, liquor consumption has never suffered social stigma in this former French outpost, and remains a strong USP in Puducherry’s branding as a tourist destination.\n\nThe city attracts over a million footfalls annually, which includes a good proportion of visitors from European destinations. In these circumstances, any move towards restrictions on liquor, leave alone total prohibition, could be disastrous for its tourism prospects. The Puducherry Government’s finances are also overly dependent on revenue from excise duty on liquor, as it is more of a service economy with no manufacturing base to boast of.\n\nAlso, as observers point out, most of the candidates of various political parties are themselves running arrack shops and it is presumed that their campaigns are financed largely with money from sale of arrack. This is why even when mainstream parties in Tamil Nadu make open declarations about bringing in total prohibition, their affiliates in Puducherry dare not toe the line of the high command on this issue.\n\nIn the 2016 elections, although the People’s Welfare Front has claimed it would ensure prohibition in a phased manner it would not seriously go about it.\n\nAccording to a senior Congress leader, “No candidate or political party even if they are not in the fray will be able to take a bold stand on prohibition as it is a different scenario in the Union Territory. Prohibition is a policy decision and given the complexities involved no party is ready to rake up the issue as they fear it would jeopardise their prospects during the elections.”\n\nR. Viswanathan, former MLA and secretary of CPI said the government should not consider the revenue alone. The health of the people, particularly the poor and the youth should gain precedence over any other thing. There should be restrictions in working hours of liquor shops, wider publicity highlighting serious implications of liquor consumption and reduction in number of shops in a phased manner, he said.\n\nAccording to a DMK leader, the scenario in Puducherry is different from neighbouring Tamil Nadu and implementation of total prohibition is not possible in the UT. The government could implement prohibition in a gradual manner as consumption of liquor was telling upon the lives of youth.", 
    "section": "national", 
    "title": "Prohibition a taboo in political debate of Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}