{
    "author": [], 
    "text": "Errors in\n\nration card\n\nThis refers to Mr. Anantha Padmanabhan’s letter about errors in his newly obtained ration card. Details in the ration cards are never checked before being printed. I found similar errors when I got my ration card in November 2007. I live in a flat on Veereswaram Approach Road, Srirangam, but my ration card shows my address as Veereswaram Harijan Street, Srirangam. I have an LPG connection but my ration card does not show it. I had to write to the Special Tahsildar (civil supplies) to rectify the mistake. With the issue of smart cards round the corner, I hope the authorities concerned do something to avert errors while issuing such vital documents?\n\nR. Meenakshi Sundaram,\n\nSrirangam\n\nChaos on\n\nVayalur Road\n\nDue to ever increasing population and the proportionate number of vehicles, the traffic is becoming chaotic, especially along the Vayalur Road. Motorists find it very difficult to reach the Vayalur Main Road from the 1st, 2nd, 3rd, 4th, 5th, 6th, 7th, and 8th main roads of Srinivasanagar. Pedestrians face find it nearly impossible to cross the road. I request the authorities concerned to install traffic signals near Arasan bakery at Kumaran Nagar and near the State Bank of India at Srinivasa Nagar to solve this problem.\n\nV. Sundararaju,\n\nSrinivasa Nagar South\n\nBuses skip\n\nNochiyam stop\n\nA number of mofussil buses operate from Tiruchi to Thuraiyur but many skip Nochiyam bus stop. Senior citizens, people with disabilities, and women and children suffer much. I appeal to the authorities concerned to instruct all bus drivers to halt at Nochiyam bus stop.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nDirty coaches\n\nAs a commuter between Tiruchi and Chennai, I am disgusted to see the dirty upper berths of the coaches of Mangalore Express and Rockfort Express. Recently, I boarded the train with my daughter and called the cleaning staff through the helpline. By the time, he came for cleaning, the train started. The TTE promised us that it would be cleaned in the next station. When the train reached Srirangam, the staff came late again. By the time he cleaned two berths, the train started. Even when the infuriated passengers demanded that the berth be cleaned immediately by pulling the chain, the TTE said that the berth would be cleaned only when the train reaches Virudhachalam.\n\nThulasidharan,\n\nAnnanagar\n\nStop harassing\n\ninnocent people\n\nThe model code of conduct has made it difficult to conduct normal business. The worst affected are farmers. This is the season of sale of agricultural produce and cattle. The Election Commission should be lenient with such people who carry hard earned money with them. Yes, bribing voters and circulation of ill-gotten wealth must be curbed. But the mission should not end up in harassment of innocent people.\n\nA. Prabaharan,\n\nPuthanampatti\n\nNo coordination\n\nThe multi-level bridge started in mid 2013 near the Aristo Hotel is getting delayed. Just for the sake of it, they have opened one arm of the bridge connecting the Railway junction with the Dindugal Road without even laying proper approach road and colour washing the parapet which is a must for safety. This goes to prove how poorly the government departments are planning and coordinating, leading to cost overrun. The Highways Department has started the construction work without getting prior approval from the Railways and the Defence department for the lands required which is the sole reason for this project getting delayed inordinately.\n\nThirumeni J.,\n\nCantonment\n\nShooting on\n\nCauvery bridge\n\nRecently, we travelled by car to Tiruchi and on reaching the Cauvery bridge, vehicles were jostling for space towards the city. It took half an hour to cross the bridge and humid atmosphere. We saw six or seven film company caravans, vans, and cargo vehicles occupying the left side of the bridge. The traffic constable said that shooting for a television serial was in progress. Already, the slow repair work on this bridge has tested our limits of patience and this group only added to our misery. Why should the authorities permit such events?\n\nT.M. Ranganathan,\n\nSrirangam\n\nBanking on\n\ncustomer service\n\nThis refers to the letter from a reader on customer service deficiencies in banks. Too much emphasis on technology enabled products and services have cast a shadow over customer service. But it is not the clerks and cashiers who refuse to pay attention towards customer service. With no recruitment of staff for several years, the hapless staff who interact with customers bear the brunt of manpower shortage. Machines can only be additional points of service and cannot be replacement for the staff. It is not fair to expect people to do self-banking. There is definitely scope for banks to improve on the customer service front.\n\nJ. Anantha Padmanabhan,\n\nSrirangam\n\nGarbage not\n\ncleared\n\nThe garbage accumulation at SBI Colony, Crawford, is a regular feature. It is cleared even after 10 days. I request the civic authorities to remove garbage frequently, at least once in two days.\n\nM. Nagarajan,\n\nCrawford\n\nAsphalt road,\n\nsave fuel\n\nI request the authorities to take action to asphalt the road that connects Puthur to Kumaran Nagar, west of Ramalinga Nagar, so that the motorists and two-wheelers would be able to conserve time and money avoiding a circuitous route to reach the destination. As any government that assumes office at the Centre is not able to reduce the cost of living for consumer goods, especially petrol, this road if made available to road users, would be of immense help to them.\n\nS. Sridhar,\n\nWoraiyur\n\nWiden road to\n\nbutterfly park\n\nThe plants at the butterfly park, near Srirangam, are maintained well and visitors often compare it with the Brindavan Gardens of Krishnaraja Sagar near Mysuru. The butterfly park is a good picnic spot but the road leading to it is too narrow. At one place, residents have encroached on both sides of the road, reducing the width of the road considerably. The frequency of local transport to this park has to be increased to enable every one to plan a visit.\n\nKanagaraj Arthur,\n\nRamalinganagar South Extension\n\nSTC bus ran\n\nout of diesel\n\nRecently, I travelled from Salem to Dharmapuri in a State transport corporation bus of Salem division from Dharmapuri depot. The bus stopped on the Thoppur Ghat Road as it ran out of diesel. Fortunately there were no women passengers. The situation would have been bad if this had happened at night. Will the authorities and the crew take measures to avoid such callous attitude?\n\nSankar Venkatesh,\n\nSrinivasa Nagar\n\nBanned tablets\n\nare still sold\n\nThe ban on 300 drugs by the Health Ministry is a welcome move. But still some of those tablets are sold in petty shops. People out of ignorance and with a mindset of saving some penny, opt for self-medication for common ailments such as headaches and cold. Strict enforcement and mass awareness on these banned medicines is the need of the hour.\n\nAravind K. Rao,\n\nSrirangam\n\nRestore Kollam-\n\nNagore train\n\nBefore the gauge conversion between Tiruchi and Nagore, a pair of passenger trains were running between Nagore and Kollam. But after the gauge conversion, the train services were not resumed. Today, the road between Thanjavur and Nagappatinam is congested. The vehicles are not able to run at normal speed. The holy shrines of Velankanni and Nagore dargah attract a large number of visitors. I appeal to the southern railway authorities to reintroduce the Kollam passenger train for the benefit of the people.\n\nR. Sivakumar,\n\nPoondi\n\nFalling interest\n\nrate hits elders\n\nThe cut in interest rates on deposits is posing a great challenger to senior citizens. The plight of elders who lost a big chunk of their hard earned money to dubious financial companies is pathetic. Senior citizens should be given more economic concessions under social security scheme as followed in the West. With the cost of living galloping, the minimum rate of interest offered by the banks and post offices will not meet the day-to-day needs of the senior citizens. The rate of interest should be fixed at 10 per cent for senior citizens.\n\nR. Pichumani,\n\nThippirajapuram,", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}