{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Actor Dhanush, who co- produced the national-award winner, describes the honour as ‘triple joy’\n\nDirector Vetrimaaran, whose ‘Visaranai’ bagged three national awards, including the Best Feature Film in Tamil, said the recognition would only give them strength to undergo more hardships to make films that are as challenging his recent film Late Kishore won the national award for best editing and actor Samuthirakani bagged the best supporting actor award for the film.\n\nTwo other Tamil films bagged honours: music maestro Ilayaraaja for best background score for ‘Thaarai Thappattai’’, directed by Bala. Actress Ritika Singh, who made her debut with ‘Irudhi Suttru’, got a ‘Special Mention’ for her performance as the feisty fisherwoman turning a kick boxer.\n\nMr. Vetrimaaran said, “We are the happiest with the award given to Kishore as this was the film that he was working on before he passed away and hope that this will bring some solace to his family,” he said. Vetrimaaran’s last film ‘Aadukalam’, won six national awards at the 58{+t}{+h}National Film Awards.\n\nMr. Samuthirakani said working on the movie was psychologically upsetting and it took a while for him to come out of the experience of acting in the film, which dealt with a disturbing and sensitive subject. “I dedicate my win to Vetrimaaran who was able to mould and guide me as well as encourage spontaneity on the sets,” he said. His character, of a police officer trying to stand up for the right, was described as ‘tricky’ to pull off by Vetrimaaran.\n\nIn a statement, actor Dhanush, who co- produced Visaranai described the wins as a ‘triple joy’ and said that he was encouraged to support more such creations which would be accepted by the Tamil audience.\n\nThe movie, partly based on the novel ‘Lock Up’ by M. Chandrakumar, focuses on the lives of four Tamil labourers in Andhra Pradesh who become a victim of police brutality and end up as scapegoats of a corrupt system.\n\nThe movie was premiered at several international film festivals, including the 72{+n}{+d}Venice Film Festival, before its theatrical release.", 
    "section": "national", 
    "title": "Recognition for ‘Visaranai’ an inspiration, says Vetrimaran", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}