{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "It’s not just the human residents of Chennai who are feeling the heat this summer. Pets too are reeling under the rising temperature.\n\nVeterinarians in the city say pet owners should ensure animals stay well-hydrated through the next few months.\n\n“Try and feed dogs early in the morning and late in the evening. Give them plenty of water and avoid taking them out for walks in the daytime when it is very hot. Do not take them in closed vehicles,” said A. P. Nambi, professor of clinical medicine at Tamil Nadu Veterinary and Animal Sciences University.\n\nNose bleeds and bacterial skin infections are common, said Dr. Nambi, and precautions can be taken to avoid them. “Keep humidity levels high by putting a bowl of water in an air-conditioned room. This helps to ensure the mucous membrane does not become dry,” he said.\n\nLarge breed dogs are also prone to heat strokes Dr. Nambi said. “Laboured breathing, an increased heart rate, no response to external stimuli and vomiting and diarrhoea are some of the symptoms. In this case, rush your pet immediately to a critical care facility,” he said.\n\nKarishma Rajaratnam, co-founder of ‘The Pound’, a Facebook page dedicated to animal adoptions, rescue and care, cautions owners of pedigree dogs about the weather.\n\n“It is best that they are given a bald cut by a trained person adept at handling them, as the heat in Chennai is unbearable for most dogs with long hair or fur. Pet owners should also watch out for signs of exhaustion and dehydration and can sponge down their dogs with a wet cloth during the day, if needed, in addition to their regular baths,” she said.\n\nCat owners should ensure their pets are de-wormed regularly as they can be carriers of infections this season, said R. Sokkalingam, veterinary officer, Madras Society for the Prevention of Cruelty to Animals. This apart, managing ticks is essential, he said.\n\n“We are seeing a lot of cases of pets with ticks. If not managed, the pets can become anaemic and their platelet levels can drop, leading to a nostril bleed. Every time you come back from a walk, check your pet’s feet for ticks and if necessary, medically manage them,” he said.", 
    "section": "national", 
    "title": "Simple steps to save pets from the searing heat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}