{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Film artistes Prasanna and Sneha interacting with parents at 'Keep pace with future learning-4' programme got up by Akara Foundation in Tiruchi. P.N. Ramani, Akara Foundation general manager, is at left.— PHOTO: A. MURALITHARAN\n\nActors and real-life couple Prasanna and Sneha were among the parents wishing to know more about the best form of early learning and formal education at a panel discussion hosted by Akara World Schools in the city on Sunday.\n\nRecalling his own days as a student in Tiruchi, Mr. Prasanna, who is an alumnus of BHEL Matriculation Higher Secondary School and graduated in Electrical and Electronic Engineering from Saranathan College, said the education system that he had grown up with was vastly different from the one his son Vihan (now an eight-month infant) would be facing.\n\n“When we shared the news of our son’s birth with our friends, besides the congratulations, we also received queries about which school we would be sending him to,” said Mr. Prasanna.\n\n“Why has it become so important to choose one school over the other, when the system is more or less the same?”\n\nMs. Sneha shared her views as a new mother, and how it had become essential for parents to be equipped with ideas to explore with their child at home until the school took over.\n\nThe panel discussion, titled “Future Learning – 4” was moderated by P.N. Ramani, director and head - academics, Akara Education, with inputs from Palani Rathinam, chairman, Akara Foundation for Education and Research and Akara World Schools.\n\nBoth educationists spoke about the importance of immersive learning for toddlers, and the need for school curricula to be sensitive to their students’ academic and linguistic needs.\n\n“Marks are an index of your academic work, but education should not stop at that,” said Dr. Rathinam.\n\n“Information has to become knowledge and then intelligence, for education to be truly successful.”\n\nParents whose children (studying in Classes 3 to 8) had attempted the Maths and Science skills assessment tests conducted by Akara earlier in the week participated in the discussion.\n\nCash prizes worth Rs. 1.5 lakh were given to the top scorers of these tests, open to students from all schools in the city.\n\nThe event saw the launch of International Preschool Curriculum (IPC), licensed from the U.S., by the celebrity couple.\n\nAkara is the first school to introduce IPC in Tamil Nadu.", 
    "section": "national", 
    "title": "Sneha, Prasanna discuss ‘Future Learning-4’ with new parents", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}