{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Motorists continue to grapple with traffic congestion on Anna Salai despite 8-month halt in project\n\nFor several months, lakhs of road users have been grappling with traffic congestion on the section of Anna Salai between May Day Park and AG-DMS, Teynampet. However, there has been no work here for about eight months now.\n\nOfficial sources said work on this stretch had come to a standstill after its contractor abandoned the project. S. Ravichandran, a doctor at the Tamil Nadu Government Multi Super Speciality Hospital, travels from his home in Chromepet to Anna Salai every day and says the journey is long and frustrating.\n\n“I spend an extra half-an-hour on the road due to the traffic. There is no work happening at all, yet we suffer every day,” he said.\n\nDr. Ravichandran said the pedestrian space had shrunk to a great extent along this stretch, making it difficult for people to walk. Chennai Metro Rail Limited (CMRL) has received flak from motorists for not being able to lessen inconvenience caused to motorists and prolonged delays in every segment of the massive project.\n\nCMRL sources said, five years ago, they had awarded a contract worth Rs. 1,947 crore to Gammon India and Russian firm Mosmetrostroy for constructing seven underground stations along Anna Salai.\n\nBut in May last year, Mosmetrostroy deserted the project citing severe financial crunch and in July, the CMRL terminated the contract of Gammon India too for their failure to complete work on time, officials recalled.\n\nAfter this crisis, Chennai Metro Rail divided the Anna Salai work into two stretches — between AG-DMS and Saidapet and May Day Park and AG-DMS and then called for tenders.\n\nDespite disruptions, tunnelling work was completed and the construction of stations started between AG-DMS and Saidapet, but work on the other stretch between May Day Park and AG-DMS remains incomplete, officials said.\n\nThey said this is because the contract has not been awarded to any new contractor after the crisis due to various reasons. Even the tunnelling work has been done only up to 50 per cent in this stretch.\n\nAccording to CMRL officials, they may finalise the new contractor next month. Though the final deadline for the entire phase I project covering 45 km is December next, CMRL sources said it was not clear if it would be possible as this stretch had a lot of work left to be completed.", 
    "section": "national", 
    "title": "Stalled metro work a major hassle", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}