{
    "author": [
        "S Senthalir"
    ], 
    "text": "Teacher initiates project to encourage children to develop critical thinking skills\n\nStudents looking at the exhibits on gender equality by 12th grade students at Lycee Francaise International School in Puducherry. —Photo: S.S. Kumar\n\nStudents of Lycee Francaise International School in Puducherry learnt a different kind of lesson that is not available in textbooks. Lessons on feminism and gender equality.\n\n‘Feminism is the radical notion that women are people,’ read a poster along the corridor. It was one among many such posters prepared by the 12th grade students of the school.\n\nThere were also other posters with quotes such as ‘Remember no one can make you feel inferior without your consent’, and ‘Gender equality is not only a women’s issue, it is a human issue. It affects us all.’\n\nWith help from their English language teacher Nathalie Mercier, the students chose to exhibit the prevalence of gender inequality in society across cultures. “The students selected the content from the internet. Some even wrote the statements themselves for the posters,” said Ms. Mercier.\n\nThe students are also preparing to perform a skit on the subject. One of the students, Sheila Dayal said it was a programme to create awareness on gender inequality. Her classmate, Calaimady explained how they were going to take a plot and show how different it would be in a discriminatory and non-discriminatory circumstance.\n\nNathalie had initiated the project on ‘gender inequality’ for the 12th grade students in January. “This topic is part of our curriculum and discussing about gender equality with students is of personal importance to me,” she said.\n\nProject aims to increase awareness of subject\n\nIn a classroom of students from diverse cultural backgrounds, the idea to work on a project that would create awareness on unequal treatment of women was interesting.\n\n“We brainstormed on different activities that could be conducted within the school premises,” she said. The discussions evolved into two skits, production of a video and an exhibition of posters on gender inequality.\n\nShe added that the majority of students are from Puducherry while there are also a few Europeans. The students from different cultural backgrounds shared their experiences in the classroom. “Once I started talking about this topic, the students began sharing their everyday experiences. The reality outside is different that in school. We are encouraging the children to develop critical thinking skills. We also compared the statistics and data about female infanticide to get a better understanding of the issue,” she said.\n\nThe video was broadcast to the students of other classes. “This project is not confined to the 12th grade students alone and this will not end here. It will be taken up to the students in lower grades too,” said Ms. Mercier.\n\nThe 12th grade students are also preparing to perform a skit on gender inequality", 
    "section": "national", 
    "title": "Students pitch for gender equality", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}