{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a bid to achieve 100 per cent polling in Assembly elections\n\nsensitising people:Collector S. Natarajan obtaining signatures from cardholders in a ration shop at Pattinamkathan in Ramanathapuram on Monday.— Photo: L. Balachandar\n\nDistrict Election Officer and Collector S. Natarajan has introduced SVEEP (Systematic Voters’ Education and Electoral Participation) activity in fair price shops to sensitise cardholders in a bid to achieve 100 per cent polling in the May 16 Assembly elections.\n\nThe Collector, accompanied by Election Officer and Revenue Divisional Officer Rampradeepan, visited some of the fair price shops in Ramanathapuram and Thiruvadanai Assembly segments on Monday and obtained signatures from cardholders, who visited the shops, pledging to cast their votes.\n\nThe Collector, who ordered keeping of voter awareness registers in all fair price shops in the district and instructed the salesmen to obtain signatures from the cardholders, to pledge to cast their votes, inspected the arrangements by visiting some of the fair price shops.\n\nHe also distributed pamphlets to those who visited the shops and urged them to exercise their franchise without fail.\n\nSivaganga\n\nIn Sivaganga, District Election Officer and Collector S. Malarvizhi held a meeting with election officers on Monday and reviewed the arrangements for a free and fair polling.\n\nAfter reviewing the functioning of the election officials and flying squads, the Collector instructed the officials to complete the enrolment of new voters, deletion and correction by April 15.\n\nShe also directed the flying squads, static surveillance teams and video recording teams to submit their reports by April 15, an official release said. The officials should visit all the polling stations and review the arrangements and the facilities made for the differently abled people to cast their votes without any problem, it said.\n\nThe officials should also visit all the low-polled areas during the previous elections and step up the SVEEP activities, which aimed at achieving 100 per cent polling.", 
    "section": "national", 
    "title": "SVEEP activity introduced in fair price shops", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}