{
    "author": [], 
    "text": "RELIGION\n\nSri Pundarikasha Perumal Temple, Thiruvellarai: Ratha utsavam, Perumal purappadu from Kannadi arai, 4.30 a.m.; reaching Vahana Mandapam, 5 a.m.; purappadu in Hamsa vaganam, 5.30 a.m.; reaching Asthana Mandapam, 10.30 a.m.; purappadu in Sesha vahanam, 7 p.m.; reaching vahana mandapam, 8 p.m.; purappadu, 9 p.m.; reaching kannadi arai, 10 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Odathurai Narasimhar Sannidhi, Chinthamani, 6.15 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 80 II Main Street, SMESC Colony, 6 p.m.\n\nGENERAL\n\nThe Institution of Engineers and Indian Institution of Industrial Engineering: Mohamed Wasim, assistant professor, M.A.M. College of Engineering and Technology, speaks on “Advance antenna for automation,” Institution building, BHEL Township, 5.15 p.m.\n\nM.A.M. College of Engineering: National conference on “Design, analysis, simulation and manufacturing of mechanical systems”, P. Kothandaraman, engineering and management consultant, speaks, 9.30 a.m.\n\nM.A.M.B School: Programme on “Financial planning for young investors” by N. Shunmuga Rajan, 10 a.m.\n\nRotaract Club of Mahalakshmi Engineering College: Blood donation camp, 10.30 a.m.\n\nSociety for Advancement of Electrochemical Science and Technology, CSIR-Central Electrochemical Research Institute and National Institute of Technology: Valediction of National Convention of Electrochemists, G.A. Pathanjali, Managing Director, High Energy Batteries Ltd., distributes awards, 4.45 p.m.\n\nSt. Joseph’s College Department of English: Institution of Dr. Vadivu Thangavel Endowment, Rev. Paul C. Jesuraja, former Rector, inaugurates, 11 a.m.\n\nCauvery College for Women: Valediction of Wings 2016, Madhan Bob, actor, chief guest, 10 a.m.\n\nShrimati Indira Gandhi College: Hostel Day, K. Meena, former vice-chancellor, Bharathidasan University, chief guest, 6 p.m.\n\nSri Angalamman College of Engineering and Technology: Valediction of Mechanical Engineering Association, Franklin Antony Raja, chief guest, 3 p.m.\n\nM.A.M. College of Engineering: Inauguration of entrepreneurship awareness camp, G. Ravi Kumar, Director (in-charge), Centre for Entrepreneurship Development, Anna University-Chennai, chief guest, 9.30 a.m.\n\nRotary Club of Tiruchi Midtown: Rotaractors Day, V. Sujatha, Principal, Cauvery College for Women, and Pon Ilango, Director, Jenney’s Academy of Hotel Management, speak, Hotel Sangam, 7 p.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram: Inauguration of Business Students Association, A. Akhilan Arunkumar, Administrator (Operations and Quality Coordinator), Joseph Eye Hospital, inaugurates, 10 a.m.\n\nBishop Heber College: Valediction of History Association, P. Rajakumar, vice principal, Holy Cross College, chief guest, 11.30 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}