{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They will now be able to search for their names, apply for new EPICs from the college website itself\n\nA first-time voter registers for voter identity card online at Thanthai Periyar Government Institute of Technology on its website. Collector R. Nanthagopal launched the service in Vellore on Monday.— Photo: C. Venkatachalapathy\n\nStudents of Thanthai Periyar Government Institute of Technology (TPGIT) can now easily access various electoral services on their college website.\n\nIn a bid to encourage first time voters and young voters to exercise their voting rights, the college has provided links to a number of electoral services on its website – tpgit.edu.in.\n\nThe college has brought the Tamil Nadu Electoral Services, National Voters Services Portal and guidelines for voters under one umbrella for its students. College authorities said the students will now be able to search for their names in the voters’ list, register themselves, apply for corrections, apply for new Electors’ Photo Identity Cards and register their mobile number.\n\nM. Arularasu, principal of the institute, said they wanted to do something innovative to create awareness on voting among students and draw their attention.\n\nHence, they went the electronic way. “We wanted to create awareness among students. As many will not search for electoral services on the Internet, we decided to give quick links to these services on our website. Students visit the college website for various updates such as exam schedule and results. This way, we can reach them easily,” he said.\n\nThe college authorities hoped this initiative would encourage young voters to fulfill their democratic right to vote.\n\nInformation\n\nThe students can also access general information for voters through links on their website.\n\nThey can get information on how to register in the electoral roll, documents required, what to do if one shifts houses, how to make modifications in electoral roll, casting vote on polling day, helpline for information related to enrolment and voting and many more.\n\nThere are a total of 1,584 students in undergraduate and postgraduate courses in the college. College authorities said they were taking the list of students, who possessed EPIC.\n\nP. Naveen, a student of first year Mechanical Engineering, said, he had already applied for voter’s identity card.\n\n“I am waiting to get my card. I will definitely vote in the forthcoming Assembly polls. Casting vote gives the identity that you are a citizen of the country. Voting is our right, and this is reinforced once in five years during elections,” he said.\n\nIn fact, this young student said that voting is the only decision that is in the hands of citizens.\n\nA resident of Thanjavur, Naveen said he will definitely travel home to cast his vote, if he gets the card by then.\n\nThe college has also come up with a CD on voters’ awareness. All students have been given a CD.\n\nCollector R. Nanthagopal launched the online service on Monday and also administered a pledge to the students.", 
    "section": "national", 
    "title": "TPGIT links students with electoral services online", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}