{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Trade and industry here have appealed to the State Government to postpone implementation of mandatory online filing of documents and e-payment for Value Added Tax (VAT).\n\nThe Total Solution Project of the Commercial Taxes department should be postponed till the elections get over. “We will be able to explain our problems to the newly-elected Government and the project can be implemented then,” said D. Nandakumar, president of the Indian Chamber of Commerce and Industry, Coimbatore.\n\nAccording to an official of the department, the solution will be implemented from April 1 and all transactions will have to be online for movement of goods. The department has been conducting awareness programmes for the members of various industrial associations in the district. For movement of goods, raw materials to finished products, even if it is from one street to another, there should be an online entry for it. Similarly, payment of VAT will go online. This is applicable to all VAT assessees. In case of any problem in registration or uploading of information, the assessees can contact the helpdesk or the officials concerned in the department.\n\n“Only when we attended the training programmes on the Total Solution Project did we realise the difficulties in adopting it. The associations have submitted their demands to the Commercial Taxes Department several times in this regard,” said Mr. Nandakumar. For instance, heavy vehicles have time restrictions for movement within the city. Industries and dealers will have to file the documents when the vehicle leaves their premises. There are micro units that do job work. They do not have a computer and might buy some products from another job-working unit. They will also have to file the documents online. Further, almost 60 per cent of the existing assessees have registered but they have not received any acknowledgement, he says.\n\nAs many as 38 trade and industry associations have joined hands now to press their demands. There are a lot of anomalies in the system and these should be set right before implementation, he adds.", 
    "section": "national", 
    "title": "Traders seek postponement of online filing of VAT details", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}