{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Mobile service centre to be pressed into service soon, says K.S. Palanisamy\n\nDistrict Election Officer and Collector K.S. Palanisamy handing over prize to a folk aritiste for performing during an awareness programme on higher voter turnout in Tiruchi on Monday.PHOTO: B. VELANKANNI RAJ\n\nVoters services centres have been opened at all Revenue Divisional Offices, taluk and corporation offices, District Collector K.S. Palanisamy said here on Monday.\n\nSpeaking to reporters after felicitating a group of college students who had undertaken a bicycle rally across the district to raise awareness on the #TN 100 per cent campaign to maximise voter turn out, Mr. Palanisamy said eligible voters could check whether their names had been included in the voters list and other election-related services. They can get new EPIC cards for damaged ones on payment of Rs. 25, he said.\n\nMr. Palanisamy said that a mobile voter service centre would be pressed into service in the district within the next few days. Steps were being taken to enrol all eligible voters, especially young voters, in the electoral rolls.\n\nThe collector said that so far six cases had been registered for violation of mode code of conduct in the district and most of them pertained to defacement of public places. The district administration had completed the process of removing all unauthorised wall writings and hoardings.\n\nOf the Rs. 3.93 crore cash seized in the district so far by election authorities, Rs. 3.55 crore had been returned to the persons concerned on production of valid documents. About 1,041 grams of gold had been seized in the district and of this 298 grams had been returned to the owners.\n\nAll the 1,007 persons, except for 101 exempted licence holders, holding weapons with licences had surrendered their weapons in the district.\n\nMr. Palanisamy said 10,834 entries of dead persons, 13,159 cases of multiple entries, and 3,325 EPIC multiple entries were to be removed from the electoral rolls in the district. Intimation about this had been given to the kin of the dead persons and persons concerned in cases of multiple entries.\n\nPolitical parties had been provided the list.\n\nThe removal of names would be reflected in the supplementary rolls to be released in the run up to the election.\n\nNearly 270 polling stations had been identified as vulnerable in the district and micro observers posted for monitoring the polling process at these stations, he said.\n\nEarlier, Mr. Palanisamy commended the 60 college students who had undertaken a bicycle rally across the nine constituencies in the district highlighting the importance of voters to exercise their franchise without fail.\n\nA cultural team sought to spread the message through folk dance and music. The Collector said the team members had covered over 250 km during their seven-day awareness campaign.", 
    "section": "national", 
    "title": "Voter service centres up and running", 
    "subsection": "tamilnadu", 
    "date": "2016-03-29"
}