{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "K. Kamaraj started it in 1965\n\nForty-nine year old V. Revathy, dressed in a bright pink sari, has taken time out to celebrate the 50{+t}{+h}anniversary of Chennai Corporation Middle School in Aminjikarai.\n\nThis school means the world to her and she takes pride about being associated with it. After all, it was the school the towering leader K. Kamaraj had started in 1965 and the one that had Tamil Poet Bharathiar’s granddaughter as one of its Tamil teachers.\n\nRevathy stepped into the campus as a class VI student in 1982 and studied for four years. Sixteen years later, she returned, but this time to be a teacher at the school.\n\n“At that point in time, we had one building that was for higher secondary students. I, as a class VI student sat under the tree and studied. There was no electricity, but I would say the atmosphere was great,” she says. What she holds even dear here is having learnt lessons under Bharathiar’s granddaughter Lalitha Bharati. “I started loving the language because of her; the passion she had for Tamil was infectious,” she adds.\n\nNow, with funds from the government, two more buildings have been established on the campus. The school now has 265 students, from kindergarten to class VIII. Headmistress S. Muthamizh Selvi who came here four years ago, says, “We have no complaints; we have had everything we wanted for the school. Some of our students are getting admissions in top colleges now making us proud,” she says.\n\nD. Manimekalai, another old student, now works as an auditor with the Central Government and she doesn’t miss a single function at the school. “I’m always happy to be here,” she says with a beaming smile.\n\nInitially, the school had a huge strength with classes till higher secondary and later it was split and students beyond class V were admitted to a nearby government school for administrative convenience, the teachers recollected.\n\nAgain, beginning from the late 1990s, the school has started having classes till VIII, they say. V. Revathy reveals a little wish she has. “My life revolved around this school. I want to continue working here and retire from here,” she says.", 
    "section": "national", 
    "title": "50 years and still going strong", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}