{
    "author": [
        "Sankhayan Ghosh"
    ], 
    "text": "There is a sense of wonder in the way the vast, virgin and treacherous Dakota terrain unravels in Alejandro G Inarritu’s The Revenant . Cinematographer Emmanuel Lubezki’s filming of frosted leaves, a gushing mountainous river or a herd of bison on a snowfield feels like a child experiencing the world for the first time. This is, after all, mountain men in 1823, travelling in territories where no humans—or rather civilisation—have set foot on.\n\nThe film follows Hugh Glass, an American explorer, who, during his expedition with his band of fur hunters, gets mauled by a grizzly bear. He is severely wounded, and as the weather conditions worsen, is abandoned by his own men. The story is about his survival.\n\nHugh is an American folklore legend, and besides the bear incident, being abandoned by his own men, and his eventual survival, the other things are fictional. Inarritu — like Tarantino, who made the other wintry Western this year ( The Hateful Eight ), other than his two earlier films, Django Unchained and Inglourious Basterds — uses historical fiction to make a political statement. He picks up the first chapter in American history, of the European immigrants’ clash with native Indians, which resulted in wiping off of indigenous people — the first assault of capitalism on nature.\n\nAnother film that comes to mind is James Cameron’s visually path-breaking Avatar , which was an allegory to the American settlers’ wars with the Indians. The message in the latest film by Inarritu, the Mexican auteur who has successfully made a transition to making Oscar-worthy blockbusters, is almost the same.\n\nBut in terms of filmmaking, they are vastly different. Unlike Avatar , or for that matter most of the CGI-heavy stuff we consume today, The Revenant goes to the other extreme, in order to achieve uncompromising realism: be it its lead actor eating raw bison liver or the decision to shoot in under -25 degrees in real locations, such as the snowy terrains of Argentina and Canada, which resulted in a part of the crew leaving the film, unable to work in the harsh weather conditions. Avatar , itself, used the American-imperialist-going-native trope, as in Dances with Wolves (1990). While Avatar was evidently conceived from an American point of view that exoticises natives and their land, Inarritu’s film is far more complex in terms of plot and characterisation.\n\nIt is a Man vs. Wild survival drama, a revenge saga and an existential journey, besides its artistic politicking. And at times, you feel it is too much to meld into a coherent film. Viewers looking for an overall emotional impact may be disappointed. It works not so much as a movie with a message, but as a pure, visceral experience.\n\nDiCaprio’s daredevilry as an actor, and the extreme conditions in which the film has been made has made The Revenant this year’s biggest Oscar special movie event. That may have irked the inner cynics within fans of Inarritu, who is somewhat an iconoclast. But these scenes really are groundbreaking, each beat and nuance executed with supreme cinematic control—the scene where Hugh escapes from the French and falls off a cliff with his horse is a heart stopper.\n\nThe Revenant is a very visual film, a technical marvel and a feast to the senses. Inarritu’s long-time collaborator, Lubezki, has always brought out the holistic, spiritual soul of his films. Here he meditates on the wilderness, filming in natural light and giving us some of the most stunning images we have seen in the movies in the recent past. Come February 28, Lubezki may just become the first cinematographer in film history to win three consecutive Academy awards—he won the last two for Birdman and Gravity .\n\nAnd DiCaprio does his best to make us keep watching—this is probably the closest he has come to delivering an “Oscar-worthy” performance. But in terms of the character minus the physical hardship he had to endure, this isn’t a new zone for the actor. It is a classic DiCaprio role. Like some of his previous roles, Hugh is a man with a troubled past: a noir, Western hero. He is an outsider amongst his men. He isn’t with the natives either. He is somewhere in between. He has hallucinatory fever-dream visions of his dead wife—think Inception , Shutter Island . The word ‘revenant’, which means one who is back from the dead, now makes sense.\n\nsankhayan ghosh\n\nThe Revenant\n\nGenre: Drama\n\nDirector:Alejandro G Inarritu\n\nCast:Leonardo DiCaprio, Tom Hardy, Domhnall Gleeson, Paul Anderson, Will Poulter, Forrest Goodluck\n\nStoryline:A frontiersman, on a fur-trading expedition in 1823, fights for survival", 
    "section": "national", 
    "title": "A pure, visceral experience", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}