{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Minister for Tourism S. P. Shunmuganathan inaugurated the newly-built, air-conditioned fish stall, established on the premises of the State-owned farm fresh vegetable outlet in the presence of Collector M. Ravikumar.\n\nFresh and good quality seafood could be bought at reasonable prices and consumers should avail this opportunity, the Minister said after inaugurating the outlet near Thoothukudi new bus stand. Tamil Nadu Fisheries Development Corporation has established the facility at a cost of Rs. 5 lakh. One more fish stall was opened on Harbour Road near Muthaiyapuram. This fish stall was established under the Fisheries Management and Sustainable Livelihood (FIMSUL) scheme. The fish stall set up with 100 per cent subsidy was handed over to fisher widows, who would run it. Much to the delight of consumers, a mutton stall has also been established on the outlet’s premises. The facility came into existence at a cost of Rs.10 lakh under Pudhu Vazhvu Thittam. Now, the meat consumers could get mutton at reasonable prices. Goats reared by women self group members would be slaughtered for meat and sold, thereby providing livelihood support to them, the Minister said.\n\nEarlier, at a programme organised in the Collectorate, the Minister gave work orders to construct solar-powered green houses to benefit 45 households at a cost of Rs.95 lakh, housing for 534 beneficiaries under Indira Awaz Yojana at a cost of Rs.6.40 crore. Besides, family cards to 3,436 people, old age pension to 79 beneficiaries and Rs. 1.59 crore to poverty eradication societies in panchayats were given. As per the directive of Chief Minister Jayalalithaa, a series of programmes were organised to benefit people through various welfare schemes, Mr. Shunmuganathan said.\n\nMayor of Thoothukudi Corporation A.P.R. Anthony Grace, Director of District Rural Development Agency V. Pitchai, Project Officer of Mahalir Thittam Indu Bala, Joint Director of Fisheries R. Amal Xavier, Assistant Director of Fisheries P. Isaac, District Supply Officer R. Chezhiyan were present.", 
    "section": "national", 
    "title": "Air-conditioned fish stall inaugurated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}