{
    "author": [
        "S Prasad"
    ], 
    "text": "(Above) The stone idol of Pratyankara which has surfaced at the National Gallery of Australia. (Below) The bronze idol of Sivakami Sundari which is in the Asian Civilisation Museum in Singapore.— Photos: Special Arrangement\n\nFive idols, mostly stolen from temples in Tamil Nadu, have surfaced in museums, art galleries\n\nThe Archaeological Survey of India (ASI) has sought help from the French Institute of Pondicherry (IFP) to verify the provenance of five idols stolen from temples in Tamil Nadu that have surfaced in different museums and art galleries all around in the world. Of the five idols, four are made of bronze and one is crafted out of stone.\n\nWritten to IFP recently\n\nThe ASI had written to the IFP recently to verify the provenance of several idols, mostly stolen from temples in Tamil Nadu.\n\nAn ASI team led by Sunanda Srivastava, Superintending Archaeologist (Antiquities) visited the National Gallery of Australia and the Asian Civilisation Museum in Singapore and shared the images of idols they had spotted in the galleries with IFP.\n\nThe ASI shared them with IFP by running a match against the IFP’s vast photo-library of religious art and architecture of south India.\n\nResearchers at the IFP cross-checked the samples with the photo archive containing 1.35 lakh images on south Indian iconography, temple architecture and rituals, to verify the provenance of the smuggled idols and correlate them with the temples of their origin.\n\n“The samples provided by the ASI included the photographs of idols of Pratyankara, Sivakami Sundari, Astradeva, Amman and Sambandar. After examining the samples with the photo archives, we confirmed that the idol of Pratyankara was stolen from Virddhagesevarar temple in Cuddalore district while the bronze idol of Sivakami Sundari was stolen from Sripuranthan temple.\n\nTemples\n\nThe idols of Astradeva and Amman were stolen from Suttamalli temple while the idol of Sambandar was stolen from Sri Sayavaneswarar temple in Sirkazhi, N. Murugesan, senior researcher of IFP told The Hindu .\n\nSources said the idols of Pratyankara and Sambandar had surfaced at the National Gallery in Australia while the idol of Sivakami Sundari was spotted at the Asian Civilisation Museum.\n\nTwo other bronze idols of Astradeva and Amman are still in the custody of U.S. Department of Homeland Security Investigations.\n\nCopies of digital images collected\n\nThe ASI team collected copies of digital images of the five idols from IFP and has initiated steps to retrieve them from the National Gallery of Australia and Asian Civilisation Museum in Singapore.\n\nIn the past too, a number of dilapidated temples have been restored and the stolen bronze idols have been identified using the photographic collection.\n\nThe photographs archived at the institute, which has been documenting temples, have helped the investigators trace a smuggled stone idol of Lord Arthanareeswarar and a bronze idol of Lord Nataraja to the National Gallery of Australia.\n\nBoth were later handed over by former Australian Prime Minister Tony Abbott to his Indian counterpart Narendra Modi.\n\nASI has furnished samples to French Institute of Pondicherry for verification", 
    "section": "national", 
    "title": "ASI seeks info on provenance of idols", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}