{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "A 15-year-old Dalit boy, on whom boiling oil was poured while being kept as a bonded labourer in a snack company in Mumbai, was prematurely discharged from Government Rajaji Hospital (GRH) here on Friday without adequate treatment, the boy’s family alleged.\n\nThe boy’s aunt V. Kuruvammal raised suspicion that the boy was discharged hurriedly to downplay the severity of injuries so that it would be easier for the person accused in the case to obtain anticipatory bail.\n\nWhen The Hindu visited the boy at a private hospital, where he was now admitted with financial assistance from Madurai-based NGO Evidence, it was found that both the thighs of the boy had severe burns, which he incurred in Mumbai a few weeks ago.\n\nThe discharge summary showed that GRH doctors had asked for a wound (pus) culture to assess the infection. However, the boy, who was at the casualty department, was discharged even before the test report was received. “When we admitted him a week ago, GRH doctors said he may even need plastic surgery,” Ms. Kuruvammal said. For the boy, who was residing with his parents and two younger brothers at Manjal Metu Colony here, the ordeal started four months ago as his mother P. Perumal could not repay Rs. 15,000 borrowed at a high interest rate from a caste Hindu family. The caste Hindu family instead offered to send the boy to work at a snack company run by their son D. Ranjith in suburban Mumbai.\n\nSpeaking to The Hindu , the boy said that he worked from 6 a.m. to 9 p.m. daily without any leave. The boy was not even sent back home when his mother expired in December 2015-end. “One day, I took a long break as I was not well. That was when he (Ranjith) poured boiling oil over me,” the boy said. With no one to help, the boy said he initially applied gram flour over the burns. “The next day a doctor came to dress the wound,” he said.\n\nManaging there for more than a week, he made an escape on a night when others were asleep. “I boarded a train without ticket and slept in a corner of the coach throughout,” he said.", 
    "section": "national", 
    "title": "Boy with burns discharged in a hurry by GRH, says family", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}