{
    "author": [
        "Afshan Yasmeen"
    ], 
    "text": "While the government is dragging its feet on setting up a centralised ventilator helpline in the State, which could go a long way in improving chances of survival in critical cases, the Indira Gandhi Institute of Child Health has set an example for others to follow.\n\nIt has set up its own helpline to provide information on availability of beds and ventilators in the hospital. Hospital Director Asha Benekappa said people could call 9448313821 to find out the availability of beds and ventilator.\n\nThe need for a helpline had been underlined after Gagana, a two-year-old girl who had fallen from the terrace of a building in October last, was made to shuttle between three hospitals before succumbing. The helpline at IGICH, which will start functioning from Saturday, will be handled by a nurse round the clock. “The common complaint that people have is that none receive the landline after working hours. To address this, the helpline cell phone will be with a nurse who will receive calls and help the caller with the availability,” she said.\n\nMeanwhile, Jennifer Sokol, a neonatologist and an expert in child critical care from Australia, who has come to the city to conduct simulation workshops and training of trainers, visited the institute and sensitised the staff on pre-transport stabilisation and retrieval of a sick child before it is referred to another hospital.\n\nSpeaking to The Hindu , she said that a centralised call centre would help improve the chances of survival of a sick child during transfer from a one hospital to another. “There is a need to have an electronic database of hospitals with details on the availability of beds in the Intensive Care Unit (ICU) and ventilators,” she said explaining the functioning of a similar system - Paediatric, Infant, and Perinatal Emergency Retrieval (PIPER) - in Melbourne, Australia. The neonatologist, who is the Director of PIPER at Royal Children’s Hospital in Melbourne, said she had also agreed to help IGICH develop as a nodal Perinatal Emergency Retrieval centre.\n\nPeople can call 9448313821 to find out the availability of beds and ventilators", 
    "section": "national", 
    "title": "Children’s hospital sets up ventilator helpline", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}