{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Co-Optex, which is marketing the products of weavers attached to various cooperative societies under its brand name, has introduced tag system to the Manamedu cotton saris, which is known for its simple designs, comfortable wear, and contemporary outlook.\n\nUnder the initiative, all saris, woven by the handloom weavers of six cooperative societies, will be tagged with the details of the weaver, his or her age, experience, number of hours that took to weave it, the place where the sari was woven and so on. They will have a photograph of the weaver.\n\nThe move is aimed at winning the confidence of varied customers, who have been flooded with various options in the open market and e-commerce. It is serving the purpose of keeping the heritage of Co-optex intact.\n\nT.N. Venkatesh, Managing Director, Co-Optex, Chennai, who visited Manamedu village near Musiri a few days ago, told The Hindu that there were 287 handlooms in Manamedu. The cotton saris produced by the weavers attached to six societies had been receiving good patronage among the customers across the State and several cities in the country. Hence, it had been decided to tag all saris produced by the weavers of Manamedu with all details about the weavers.\n\nHe said sari tagging concept was introduced recently in the State. It had been received well among customers and weavers. About 60,000 weavers across the State had been given identity cards. The saris woven by them would have tag. The tag system was serving the purpose of recognising the weavers.\n\nK. Kamaraj, a weaver in Manamedu, said he was happy to see his photo and relevant information in a tag attached with the saris woven by him. He had to work for about 16 hours to weave a sari. He would move his hands and legs for about 16,000 times for producing a sari. The tag would enlighten the customers about the hard work put in by the weavers.", 
    "section": "national", 
    "title": "Co-Optex tags Manamedu saris with details of weavers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}