{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Companies need to focus on innovation and should develop a strategic and long-term approach to innovation, Sanjay Kirloskar, Chairman and Managing Director of Kirloskar Brothers, said here on Friday.\n\nSpeaking on “Innovation and Entrepreneurship” at the annual day event of Confederation of Indian Industry (CII) – Coimbatore Zone, he said the average life of a company now is short and businesses are like economic battles between companies and even between countries. Competition is intense and victories are short. The ones who are able to sustain are those that are able to constantly focus on research and innovation. These companies develop new products and make the old products obsolete before competition does so.\n\nCompanies need to innovate in sourcing, procurement, human resource management, etc and leverage on skills and talent in the organisation. Innovation is a key tool to success, he said.\n\nMr. Kirloskar pointed out that in Coimbatore, the Kirloskar plant has 100 per cent women. The plant has the highest productivity within the company and inspired it to have as many women as possible at Sanand plant and it now has 34 per cent women.\n\nThe company also makes motors in two locations. There are several women who have completed electronic, electrical engineering. The company is looking at having flexible hours for them to come to these plants. Companies need to understand customers, collaborate with partners, see areas where innovations will benefit and ensure that organisations are ready for innovation.\n\nNew office-bearers\n\nThe newly-elected office-bearers of CII – Coimbatore Zone for 2016-2017 are: chairperson - Nethra J.S. Kumar, Chairman and Managing Director of Lakshmi Electrical Control Systems and vice-chairman – S. Narayanan, whole-time director of Bimetal Bearings.\n\nCompanies need\n\nto innovate in\n\nsourcing, procurement, human resource management", 
    "section": "national", 
    "title": "Companies urged to focus on innovation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}