{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Lt. Gen. Ajay Kumar Singh praises NIT for adopting five villages\n\nStudents of higher learning such as those of National Institute of Technology (NIT) should work hard for the economic uplift of the rural masses, said Lt. Gen. Ajay Kumar Singh, Lieutenant Governor of Puducherry.\n\nDelivering the second convocation address of the NIT–Puducherry (NITPY) in Karaikal here on Saturday, the Lieutenant Governor said a majority of country’s population resided in villages. The students of technical institutes should design changes which can uplift the rural scenario and contribute towards rural development, he said.\n\nIn this context, he appreciated the efforts by NIT-PY at Karaikal, which had adopted five villages under the Unnat Bharat Abhiyan scheme. He urged the outgoing students to ensure innovation, taking due advantage of various Central schemes. Lt. Gen. Singh said that the Union Territory of Puducherry accorded priority for imparting quality education, attracting students from different parts of the country. He said the Union Territory government has constituted a high-level committee for evolving “Union Territory Higher Education Plan” with a focus on augmenting the quality of education and for achieving excellence in the area of higher education. The committee had been constituted under the Rashtriya Uchchatar Shiksha Abhiyan, he added.\n\nNITPY in Karaikal had brought a national recognition for Karaikal and the institute had carved a niche in the short span of just six years. From three departments, the institute had registered a growth and now offered additional undergraduate and post-graduate programmes and doctorates in various disciplines. The NITPY had bagged CCI Technology Education Excellence Award for two consecutive terms for ‘Excellence in Engineering and Technological Aspect 2014’ and for ‘Best Institute for Value-based education 2015’.\n\nThe Lieutenant Governor said a good percentage of the students of NITPY had been selected by reputed firms at the campus interview and about 20 students had cleared the GATE aspiring for higher education.\n\nShashi Krishna Pandey, Director and officiating Chairperson, Board of Governors, NITPY, presided over the convocation.\n\nLt. Gen. Singh conferred degree on 108 students.", 
    "section": "national", 
    "title": "“Design changes that can uplift the masses”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}