{
    "author": [
        "L Renganathan"
    ], 
    "text": "Thousands of devotees continued to throng Mahamaham spots here on Saturday five days after the rituals concluded. Though officials handled the situation remarkably well during the peak period, with all police and bureaucratic assistance standing withdrawn, some chinks in their armour are being exposed now putting devotees to trouble.\n\nBeing weekend, thousands of devotees congregated in the Mahamaham tank since early morning on Saturday and the numbers swelled as the day progressed. By evening, an estimated 75,000 people would have taken a holy dip according to those present in the vicinity of the sacred tank.\n\n“Pilgrims from all over the State, and mostly from Chennai, are visiting the tank and temples as could be gauged from the numerous maxi cabs, vans and tourist buses that are lined up in the near by lanes and streets,” points out S. Harikrishnan of Gandhi Adigal Salai just off the tank and a trader. Though weekend visitors were expected, I’m really surprised by such a strong crowd after Mahamaham was over, he adds.\n\nDuring Mahamaham, devotees were allowed to enter the tank from the eastern bund and after having a dip were directed to get out from the western side while the other two sides were blocked entirely. Now with the easing of regulations, devotees are getting into the tank and exiting through all sides as the crowd has thinned. However, the congestion on the banks has increased as the outstation pilgrims are allowed to drive right up to the bank and park their vehicles there before entering the tank.\n\nThe meagre number of police personnel to regulate the crowd in the tank needs to be attended during holidays and sacred days for at least till March 13 as the visitors strength indicates, says Coordinator of the Kumbakonam All Traders’ Federations V. Sathyaranarayan.\n\nThe administration would do well to deploy more traffic constables to regulate the vehicular movement in the main thoroughfares and in particular the Kasi Viswanathar Koil North Street and Nageswaran Koil South Street, he adds.\n\nAnother major issue is the unkempt temporary toilets that trouble devotees in many places. The temporary toilets in important locations near the Mahamaham spots such as Portramarai tank and the Chakra Padithurai could be maintained by the Kumbakonam Municipality itself for the benefit if the devotees. Something could be done to have a separate closure for facilitating dress change for women, feel the visiting devotees.\n\nA job well done needs to extended a bit more so that the whole exercise could be considered well completed.", 
    "section": "national", 
    "title": "Devotees continue to throng Mahamaham tank", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}