{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Afew minutes into Kanithan , directed by T.N. Santhosh, I was ready to check out. We are at the Sky TV office, and Manobala plays the CEO. That says it all. This isn’t about the actor. This is about what he’s asked to do, almost always—you could call it “the Manobala part,” the efficacy of which peaked some 283 movies ago. He makes a joke about the channel being in the No. 48 position, and he predicts that in a year it will be (drumroll)... No. 46.\n\nAnd soon we realise that jokes can get worse. Because Gowtham (Atharvaa), who’s in a bar with a friend (Sunder Ramu), gets all love-at-first-sight with Anu (Catherine Tresa), and when she orders a tequila, the friend orders a... Shakila.\n\nAnd then Gowtham gets slapped across the face, and everything changes. Till the slap, we’re still wondering if it wouldn’t be easier to stay at home and roll around in a bed of nails. You’d get the same effect – without the cost of a ticket. Gowtham is explaining to Anu something about why good-looking girls always fall for mokka men, and... SLAP! Out of nowhere, a cop’s palm crashes into his face. And the film takes off.\n\nGowtham and his friends are picked up for questioning because they’re believed to be part of a ring that forges degree certificates.\n\nThis is a solid angle for a film with a young hero. It hints at undeserving people with money buying an education they did not work towards, and becoming unqualified professionals – more fish in the sea of mediocrity that is India. And this makes Gowtham very, very angry.\n\nHe’s angrier because one of the co-arrestees has a father—in Tiruchi—who needs a bypass surgery. The mother is waiting (and wailing) at the hospital, hoping he’ll get the money and shut up the heartless hospital attendant, who yells that if the fees aren’t paid the next day, the father will be discharged without surgery—he’ll have to be taken to the government hospital. The son commits suicide, and this is no spoiler. For we are in a Shankar movie—but without the vigilante justice. Translation: the villain Thura Sarkar (Tarun Arora) doesn’t end up screaming in a vat of boiling oil.\n\nAs in Thani Oruvan , we see an increasingly tense cat-and-mouse game between well-matched (and brainy) adversaries. Kanithan is a two-sided procedural, with both Gowtham and Thura Sarkar putting together the pieces that will lead them to each other. There are some tense moments. The editor (Bhuvan Srinivasan) really goes for the jugular.\n\nFor a change, the media aren’t painted as sensation-mongering opportunists.\n\nI wish the cop played by K. Bhagyaraj had been given more to do. I wish I hadn’t been able to predict the death of a major character. And I wish the director hadn’t chickened out in the second half and felt the need to alleviate the grimness with a mood-killing song.\n\nBut even this is a sign that the movie is working—for when the song ends, the film tautens again. The messagey portions, thankfully, are kept to a minimum, but we do get this line: ‘ Indha kaalathula thappu pannravangala kooda vittuduvaanga. Aana thatti kekkaravangala kandippa nasukkiduvaanga.. ” (These days, they’ll even forgive sinners. But if you raise your voice against injustice, they’ll crush you.) Sounds like the headlines, no?\n\nbaradwaj rangan\n\nKanithan\n\nGenre:Thriller\n\nDirector:T.N. Santhosh\n\nCast:Atharvaa Murali, Catherine Tresa, K. Bhagyaraj, Tarun Arora, Sunder Ramu\n\nStoryline:An investigative reporter brings down a ring that forges degree certificates", 
    "section": "national", 
    "title": "For the most part, a punchy thriller", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}