{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Rigour, relevance and research are the three factors that should drive education today, Prabir K. Bagchi, Vice-Chancellor of the SRM University said here on Saturday, addressing The Hindu In School’s Principals Conclave, which was attended by over 100 principals from schools across Chennai.\n\nThe conclave was organised with the aim of promoting and celebrating the spirit of education and share knowledge on education in the new age. Speaking about how schooling played a vital role in shaping the youth, Prof. Bagchi said that while the foundation for the students to become successful was laid at schools, colleges help build on this. “With academic rigour in place, we hope to steer them in the right direction while emphasising research, which is something that our country needs,” he said.\n\nSpeaking about the challenges that the education system currently faces, Prof. Bagchi pointed out that there was a need to revamp it with an emphasis on succeeding in innovation. “It is also necessary that students are aware of the skills that are in demand in the marketplace and equip themselves accordingly,” he said. He said that we needed to have a system in place where students were encouraged to start new ventures and come up with products of distinction.\n\nSchool principals present spoke about a range of topics from the need for colleges to have a holistic admission process to how involved parents should be in school education. Sridhar Krishnaswami, Head of Media Studies at SRM University, spoke about the diversity, infrastructure and holistic education that the college offered.\n\nAs part of the admissions this year, the University has extended to the five top scorers from each school there an application to write the SRMJEE B. Tech entrance exam.", 
    "section": "national", 
    "title": "‘Get students to innovate’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}