{
    "author": [
        "Special Correspondent"
    ], 
    "text": "K.M.S. Rajesh Kumar (left), Chairman, CII Salem, handing over the ‘Salem CII Innovative Business Award’ toR. Sundaram (second right), CEO, Aerospace Engineers, at the MSME Summit held in Salem on Saturday.- Photo: E. Lakshmi Narayanan\n\nThe Indo-American Chamber of Commerce (IACC) has taken effective steps to increase trade volume between India and the United States, in the overall interest of the Indian trade community, said N. V. Srinivasan, Regional president for South, IACC, here, on Saturday.\n\nHe was delivering his inaugural address at the day-long ‘Salem MSME summit on growth and prospects of MSME sector in the emerging scenario’ organised by the Confederation of Indian Industry, Salem, in association with the IACC.\n\nMr. Srinivasan said that when Joe Biden, Vice President of the United States, visited India last year, he favoured increasing trade between both the countries from the present 110 billion U.S. dollars to 500 billion dollars.\n\nThe U.S. President Obama, while addressing the Indian Parliament, underlined the importance of both the countries strengthening their partnership in the industrial and business front. He favoured creation of opportunities for trading community of both the countries.\n\nMr. Srinivasan said that the IACC has been holding consultative meetings in various parts of the country to discuss and provide suggestions to the Indian industries for increasing their trade with the U.S.\n\nThe objective of the exercise is to increase the trade between both the countries from the present 110 billion U.S. dollars to 500 billion dollars by 2018.\n\nThe IACC had already held the meetings in Mumbai, New Delhi, Bengaluru, which evoked good response. The respective governments in these States too have evinced lot of interest.\n\nMr. Srinivasan said that IACC has planned a similar meeting in Chennai by May. Similar meetings are on the anvil in Hyderabad and Cochin shortly. He said that small and medium enterprises (SME) played a crucial role in the overall development of countries. IACC has facilitated the visit of many US delegations to India. Since all the SMEs cannot meet such delegations that visit major cities, the chamber arranges discussion through video conferencing, he said.\n\nReferring to the importance attached to SMEs world over, he said that representatives of American Airlines preferred to make presentation in the SME conference held in New York recently. He strongly advocated establishment of a support system for the SMEs and also increasing the benchmark from the present Rs. 5 crore to more than Rs. 25 crore.\n\nK.M.S. Rajesh Kumar, President, CII Salem district, said that MSMEs have been recognised as one of the key sector for employment generation and overall development of the country. The summit has been organised with the objective of providing opportunity to share concepts, approaches and best practices that can be adapted or adopted by the MSMEs.\n\nP. Vimalan, vice president, CII Salem district, said that Salem district could achieve much more in the MSME sector. The district has immense scope and the entrepreneurs should take advantage of the same, he said.\n\nWalid Zafar, Vice Consul, American Consulate, S. S. Yuvaraj, convener, MSME and Manufacturing Panel, CII Salem were among those present.\n\nAward\n\nThe CII Salem district has instituted ‘Salem CII Innovative Business Award’ to motivate and honour industrialists and entrepreneurs in recognition of their outstanding achievements.\n\nThe maiden award was bagged by Aerospace Engineers, Mallur, Salem district, an eminent aerospace parts manufacturing industry with the prestigious AS 9100 certification.\n\nR. Sundaram, CEO, Aerospace Engineers, received the award from K. M. S. Rajesh Kumar, Chairman, CII Salem district.", 
    "section": "national", 
    "title": "‘IACC keen to boost trade volume between India and the U.S.’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}