{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Unauthorised parking of two-wheelers continues for which the private contractor collects parking fee on New Bus Stand premises in Salem. —Photo: E. Lakshmi Narayanan\n\nSpace crunch at the corporation-owned and private-run parking stand on the Dr. MGR Integrated Bus Terminus (New Bus Stand) premises continue to be a worrisome factor for motorists who are forced to park their vehicles in the open space without protection. However, the private contractor continues to collect parking fee from the motorists for many years now as the corporation failed to initiate action.\n\nThe corporation had permitted the private contactor to maintain the 23,700 sq.ft parking area that has roof shelters and collect Rs. 5 as parking fee from motorists for 24 hours.\n\nWith more motorists thronging the stand, the available space was inadequate. Hence, the contractor started utilising the space outside the allotted area.\n\nThe contractor collects the parking fee for the unauthorised use of space for over two years now. “We have to park in the open space that has no light or protection. The corporation could utilise the space so that it gets revenue and also benefit the motorists”, said P. Kadiresan.\n\nThe agreement with the contractor for the parking stand clearly states that vehicles should only be parked in the allotted space. However, corporation officials are not concerned about the violations that continue for over two years now. “More motorists prefer parking in the stand as the fee is less than other parking stand. The parking stand should be expanded to meet the growing needs”, said Ramadurai, a motorist.\n\nMotorists also said that there are no basic amenities in the stand like drinking water or toilet provisions. They also said that there are no fire safety precautionary measures in the stand where over 1,500 vehicles are parked at any given time.", 
    "section": "national", 
    "title": "Illegal collection of parking fee continues in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}