{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "Indian tennis stars (L-R) Saketh Myneni, Vignesh, Sriram Balaji and Vijay Sundar Prashanth, who enthralled the crowd during the Ethirajulu Naidu memorial cup tennis exhibition match at the Cosmopolitan Club Courts in Coimbatore on Saturday.\n\nFour of India’s top tennis stars unleashed their racquet power in an exhibition match played to remember the 85th birth anniversary of Ethirajulu Naidu at the Coimbatore Cosmopolitan Club courts here on Saturday.\n\nSaketh Myneni, Vijay Sundar Prashanth, Sriram Balaji and V. Vignesh have all played their part for the country. They have sweated it out in the past for top honours in big tournaments but this time around they served and volleyed, lobbed and dropped, smashed at will and even enjoyed some lighter moments for the benefit of the tennis lovers in the city.\n\nThe players were too happy to play in Coimbatore. “I hope we delighted you all with our brand of tennis,” Balaji told the crowd.\n\n“We wanted to make everyone happy and that’s why we travelled this far,” said the Vishakapatnam-based Myneni.\n\n“I am pleased to have brought these stars to Coimbatore as my father [Ethirajulu Naidu] was a great lover of the game. He played regularly at the Cosmopolitan Club courts. You could set the time on your watch when he leaves home with his racquet everyday at 4 p.m. Nothing in this world could stop him from playing a few sets. Such was his love for the game,” said Silesh Ethiraj.\n\nMr. Ethirajulu, who donned the role of the President of the Coimbatore District Tennis Association and Secretary of the Cosmopolitan Club, contributed in his own way for the development of the game in this part of the region. He had brought the likes of Ramanathan Krishnan, Ion Tiriac, Illie Nastase, Bob Hewitt and many others to play exhibition matches here.\n\n“He always encouraged young players and did his best for their career growth,” said Silesh.\n\nMr. Ethirajulu not only spent precious time channelising players but also made it a point to travel with his friends to watch the ATP matches in Chennai. “I enjoyed watching a couple of Grand Slam events too with him,” added Silesh.\n\nMr. Silesh wants to keep his father’s memories alive. He has been organising tournaments every year. Few years ago, he brought in the Coimbatore tennis stars, namely K.G.Ramesh, Balaji, Vignesh and Ramanand. “I am conducting these events for the respect that I have for my dad and for the love he had towards this sport.”", 
    "section": "national", 
    "title": "Indian tennis stars charm Coimbatore crowd", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}