{
    "author": [
        "Mini Anthikad-chhibber"
    ], 
    "text": "It is the awards season, and amidst all the Academy darlings, you usually have Nicholas Cage zooming around with his skull on fire. The next best thing to Cage driving down the road to hell is a sword-and-sandal saga, featuring Gerard Butler with his shapely legs.\n\nAlex Proyas, who made the mind-bending Dark City , takes a jolly plunge into ancient Egypt. There are the gods, the ladies with their bosoms heaving, special effects, cheesy dialogue, loads of glitter, gold and CGI. Gods of Egypt is that slightly skewed summer blockbuster. Maybe it is ancient Egypt according to John Murdoch (remember him from Dark City ?).\n\nSet, the God of Darkness, kills his brother, Osiris, blinds and banishes his nephew, Horus, and takes over the throne of Egypt. He also kills his father, Ra, and unleashes the serpent of chaos, Apophis, on the unsuspecting masses—all in a day’s work for the bad boy. (Oh, and he also takes Osiris’ girlfriend, Hathor, the goddess of love, to bed.)\n\nHorus, with help from Bek, a mortal and thief, has to sets things right, which he does in spectacular style, tempered with bad jokes.\n\nThe world of ancient Egyptian gods is rather familiar, thanks to guilty perusal of Rick Riordan’s The Kane Chronicles . The filmmakers came under a lot of flak for casting Caucasians as Egyptians, for which Proyas and the producers apologised.\n\nGerard Butler, after playing the king of Sparta in 300 , plays Set with teeth-gnashing villainy—he has the legs and shoulders to carry off little skirts. Geoffrey Rush is the venerable Ra, flying in his sun chariot and sending lightning bolts to quell the serpent of chaos. Chadwick Boseman plays the god of wisdom, Thoth, while Rufus Sewell (Murdoch from Dark City ) is Urshu.\n\nBrenton Thwaites is Bek and also provides the voice over, while Nikolaj Coster-Waldau is Horus. Proyas has done some cool stuff, like have the gods taller than humans, to give that weird perspective. The ladies, Elodie Yung (Hathor) and Courtney Eaton (Zaya), Bek’s love are comely.\n\nAll in all, a fun way to pass the evening, if Leo’s consumption of raw bison liver gets a bit too much.\n\nmini anthikad-chhibber\n\nGods of Egypt\n\nGenre:Drama\n\nDirector:Alex Proyas\n\nCast:Nikolaj Coster-Waldau, Brenton Thwaites, Chadwick Boseman, Elodie Yung, Courtney Eaton, Rufus Sewell, Gerard Butler, Geoffrey Rush\n\nStoryline: As the Egyptian god of darkness takes over the throne of the Egyptian empire, a mortal hero must save the world", 
    "section": "national", 
    "title": "Innocuous big-budget fun", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}