{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Former Union Finance Minister P. Chidambaram at a panel discussion with Raghuttama Rao, Managing Director, ICRA Management Consulting, G.C. Shekar, Associate Editor, The Telegraph , Mukund Padmanabhan, Editor, The Hindu Business Line, and T. Shivaraman, president of MMA, at the launch of his book, Standing Guard , in Chennai on Saturday.— Photo: M. Moorthy\n\nFormer Finance Minister and senior leader of the Congress, P. Chidambaram, said the privileged may not think of ‘intolerance’ as a major issue, but it affects millions of people in India.\n\nHe was speaking at the launch function of his book ‘Standing Guard: A year in Opposition’ that took place in an uptown hotel on Cathedral Road in Chennai on Saturday.\n\n“It is an elitist view that intolerance is not a real issue. It affects at least 600 million people in India. Minority communities are feeling insecure. In States such as U.P., the Muslims are wondering when the next riot will happen,” he said.\n\nIn conversation with Mukund Padmanabhan, Editor, The Hindu Business Line , G.C. Shekar, Associate Editor, ‘The Telegraph’, and Raghuttama Rao, MD, ICRA Management Consulting, Mr. Chidambaram weighed in on a number of topics including the fiasco in JNU, the reasons for Congress party’s rout in the last Lok Sabha elections and Afzal Guru.\n\nClarifying again on what he said about Afzal Guru’s hanging when the Congress government was in power in a recent interview, Mr. Chidambaram said that ‘in a democracy, an independent person holding an honest opinion on a judgment shouldn’t be seen as anti-national’. Asked if he would extend the same courtesy with regard to those convicted in the assassination of Congress leader Rajiv Gandhi, he said: “The facts of the case are conclusive. But the point is not about whether the judgment is right. The point is whether someone can have an opinion on a case. How can someone be called anti-national for expressing opinion on a judgment?”\n\nHe added, “If you hear different voices in universities, it means that people who have been neglected have found their way. They are willing to stand up and speak. You cannot make them anti-national. Dissent is the essence of democracy.”\n\nTo a question as to whether the issue of intolerance was being blown out of proportion, he urged that everyone must make friends with people who are not like us. “How many of us meet people of another kind? Please make friends among Muslims, Dalits or North East or tribals. Most of us don’t understand how they relate to India,” he said.\n\nAllegations of corruption\n\nStating that Congress pulled economy back in the last 20 months of their term, Mr. Chidambaram opined that it still wasn’t enough to prevent a defeat.\n\n“It is true that we pulled things back, but allegations of corruption overwhelmed the party. The people had already decided. May be, if we had one more year, we could have turned things around,” he said.\n\nHe also refused to criticise the ‘subsidy’ in general. “Subsidising educational loans and providing free cycles to girls have resulted in boys and girls from families who cannot afford to provide good education getting educated. There is an ‘externality’ in these cases. Good economics is good politics,” he said.\n\nSpeaking about what India needs to do for economic growth, he said that he prefers a combination of open economy and polity. “Countries such as South Korea, China, Singapore and Malaysia were poorer than India, but they have now become middle and rich income group countries. We need a sustained economic growth of 8-9 per cent for the next 30 years. We need to create wealth,” he said, insisting, “countries like China didn’t grow because it has a single party system. They have lively debates within the party. It is just another form of democracy, which is different from us.”\n\nCriticising the Bharatiya Janata Party’s view that they are unable to pass legislation because they don’t have the strength in the Rajya Sabha, he said, “It is sad that they want to pass legislation not on the strength of the law but on the strength of the numbers.”\n\nFormer Union Minister speaks on a number of issues, including his stand on Afzal Guru", 
    "section": "national", 
    "title": "‘Intolerance affects millions in India’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}