{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Ponraj to declare the name of new party today at Rameswaram\n\nBowing to pressure from a section of youth, mostly students from various districts, V. Ponraj, scientific adviser to former President APJ Abdul Kalam, on Saturday announced his entry into politics. He said he would declare the name of the new party and hoist its flag after paying tributes at Kalam's memorial in Rameswaram on Sunday.\n\nAddressing a huge gathering of youth that camped at his native Thonugal village in Virudhunagar district since Friday to persuade him to launch a political party, Mr. Ponraj said he was not merely for a change but for the transformation of Tamil Nadu into a developed State. Thanking the youth for the trust and confidence they had reposed in him, he promised to give his best for establishing a corruption-free society. He made an appeal to the people to support him in his endeavour to establish the rule of Abdul Kalam in Tamil Nadu.\n\nMr. Ponraj said the issues that prompted ‘Lok Nayak’ Jayaprakash Narayanan to lead a students’ movement in Bihar 40 years ago were very much prevalent in Tamil Nadu today. “There is rampant corruption, poverty, oppression and steep increase in prices. I do not want to blame any political party. We are all collectively responsible for allowing this miserable situation to take shape over the years.”\n\nStating that he resigned his scientist job in Aeronautical Development Agency with a plan to take up farming, Mr. Ponraj expressed concern that agricultural activity and productivity were suffering a steady decline in the State. “Even after 69 years of independence, there is atrocity against Dalits, tribals and minorities. Basic amenities such as quality and affordable health care, education, electricity, road and drinking water remain a distant dream.”\n\nEvery party that came to power promised to do good, but it could not. Political parties that were in power know that they stand exposed at the end of every tenure. They tried to make people temporarily happy by offering freebies. But that is not a solution to the unprecedented damage done to the society.\n\n“After my interaction with thousands of students in the last six months, I have realised that there is a serious problem in the system of politics and administration in Tamil Nadu. Student representatives who met me today and in recent weeks are eager for a change in Tamil Nadu, a change that guarantees sustainable growth, equal opportunity and efficient administration. I am so proud that students have realised the importance of agriculture and want farmers to be recognised, promoted and protected,” he said.\n\nLater talking to reporters, Mr. Ponraj said the party would soon launch a website and commence the process of enrolling cadres online. However, district-wise units would be started to reach out to the people in the rural areas and enrol them. “We want to choose candidates from each constituency and impart training that will enrich them intellectually and politically to face the election. There will be 60:40 ratio of youth and others in selection of candidates… All are welcome to join us...men, women and transgenders.”\n\nMr. Ponraj said his party would not be keen to contest and form the government immediately. “The priority now is to identify potential candidates and train them. We lack the financial resources, manpower and infrastructure to function in a big way. We are making a humble beginning with a vision to realise the dream of Abdul Kalam for a developed society.”\n\nStudents' representatives are eager for a change in Tamil Nadu,\n\nhe says", 
    "section": "national", 
    "title": "Kalam’s adviser plunges into politics", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}