{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The final leg of Mass Rapid Transit System for a distance of 500 metres is not likely to be completed in the near future.\n\nSouthern Railway General Manager Vashishta Johri on Friday said they will need at least 18 months from the date of receiving land needed to complete the project. “The (MRTS) project is not with us. We paid whatever amount was to be paid, but the families went to the court again seeking higher compensation.”\n\n“We are prepared to pay that amount too. The State government had some reluctance and they too have now agreed,” the official told reporters during a post-Budget interaction.\n\nOnce the amount is paid by the State government (to the affected families) and the land is handed over to Southern Railway, the project would be completed in 18 months, Mr. Johri said.\n\n(The project, officials pointed out, had to be completed for a distance of 500 metres in the final stretch between Velachery and St. Thomas Mount. Work on Puzhuthivakkam station on this segment is on.)\n\nDoubling of\n\nMadurai route\n\nHe said work on 375 kilometres will be taken during 2016-2017, against 240 km completed in the current financial year.\n\nThis will include work on doubling 110 km on the Chennai–Madurai route. The single line stretches are between Villupuram and Tiruvanainallur, Vridhachalam and Mathur, Tamaraipadi and Manaparai and Tiruchi and Valadi, officials said.\n\nCoaching terminal\n\nThe Tambaram coaching terminal project will be made operational by June for which a substantial allocation of Rs. 10 crore was made in the budget, Mr. Johri said.\n\nAmong the new announcements in the budget was a survey for a new line from Dindigul to connect Sabarimala – a 201-km line. Further, Rs. 134 crore were allotted for commencing new work between Morappur and Dharmapuri for a distance of 36 kilometres.\n\nLand owners have gone to court seeking higher compensation", 
    "section": "national", 
    "title": "MRTS final phase will take at least 18 more months: Johri", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}