{
    "author": [], 
    "text": "Accused use fraudulent certificates to escape the law\n\nAppalled by the fact that over 4.13 lakh cases for registration of births/ deaths have been ordered by Magistrates in a “cavalier manner” throughout the State in 21 months, which were used by accused persons to claim juvenility in criminal cases and land sharks to obtain fraudulent death certificates of living persons to effect illegal transfers of lands, the Madras High Court has appointed a retired District Judge to probe the issue.\n\nThe issue came to light when a Division Bench of Justices R. Sudhakar and P.N. Prakash was hearing a habeas corpus plea moved by the father of Anbu, who was convicted for committing dacoity by a sessions court in Tindivanam. The petitioner claimed that his son was a minor at the time of committing the offence and hence he was entitled to relief under the Juvenile Justice (Care and Protection of Children) Act, 2000.\n\nHe made the plea relying upon the birth certificate of his son. On perusal of the certificate, it was found that the petitioner has secured the document recently based on an order from a Magistrate Court. “We were shocked to know that while Anbu was in jail, his father had obtained the birth certificate through a magistrate court,” the Bench said.\n\nAlarmed by the manner the magistrate had dealt the case, the Bench directed the Registrar Judicial to collect statistics from all the judicial magistrates in the State on the number of applications filed and ordered under the Registration of Births and Deaths Act from January 1, 2014 to September 30, 2015.\n\nRecording the report field by the Registrar informing the court that over 4.13 lakh applications were ordered by various magistrates across State, the Bench observed that the numbers were indeed enormous and appalling. “Apart from setting up a claim of juvenility in criminal cases, it is not uncommon for litigants to claim alteration of their date of retirement from service, based on such birth certificates. Such claims by government servants nag the State and foment litigation on the service side,” the Bench said.\n\nAccused use fraudulent certificates issued by magistrates to escape law", 
    "section": "national", 
    "title": "Probe ordered into misuse of birth, death certificates", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}