{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The ‘blue and pink’ AstroTurf hockey stadium, a first of its kind facility in south India established at the Sethupathi Sports Stadium complex here, was inaugurated on Saturday much to the joy of hockey lovers in the district.\n\nFour months after the facility, matching the international standards was completed in October last, Chief Minister Jayalalithaa declared open the stadium through video conferencing in the presence of Minister for Sports and Youth Welfare S. Sundararaj, Collector S. Natarajan and president of Hockey unit of Tamil Nadu A. Chelladurai Abdullah.\n\n“We are happy we have created the facility in this backward district,” Mr. Abdullah, who is the secretary of the district hockey association, said. It was a matter of pride that the new stadium had won the International Hockey Federation (FIH) accreditation for hosting international tournaments, he said. After the France-based laboratory, one of FIH’s accredited laboratories, inspected the stadium in October last and submitted its report, the FIH issued the certification in November last, he said.\n\nTo begin with, the Tamil Nadu senior Inter-district hockey tournament, scheduled to be held in the first week of March would be hosted in the new stadium, he said. The stadium had been established at a cost of Rs. 5.94 crore. Velu Manickam Group contributed Rs. 50 lakh, the Syed Ammal Trust Rs. 35 lakh and Dr. Arvind Raj Rs. 10 lakh, he said.\n\nBesdides, the association, in coordination with former Collector K. Nanthakumar, had collected Rs. 28.50 lakh from the general public, including Rs. 5 lakh chipped in by Chennaiyin Football Club, he said. The remainder contributed by the district administration under the ‘Namakku Name’ scheme, Mr. Abdullah said.\n\nHe said the AstroTurf with 15 mm shock pad underneath was laid by Delhi-based Shiv Naresh Sports, a kit partner of Hockey India. The sprinklers, imported from Italy, could wet the entire ground with 50,000 litters of water in less than 12 minutes, he said. The stadium had two galleries with facilities to accommodate about 1,000 spectators, he said.\n\nShiv Jagday, Hockey Academy Coach, FIH and former Olympian V J Phillip who visited the stadium in November last were impressed by the facility. “The stadium brought back memories of the matches I had played in Holland and Germany,” Mr. Phillip, who had played for the country for 12 years, had said.", 
    "section": "national", 
    "title": "Ramanathapuram gets modern hockey stadium", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}