{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seven advocates who completed 50 years of practice felicitated\n\nR. Mahadevan, Judge, Madras High Court, speaking at a function organised to felicitate advocates in Thoothukudi on Saturday.— Photo: N. Rajesh\n\nRendering justice to the needy through the judicial system is a divine service to the society and medical professionals are also playing a dignified role in saving the lives of patients, according to R. Mahadevan, Judge, Madras High Court.\n\nAfter felicitating seven advocates, who have completed 50 years of practice from Thoothukudi Bar Association, Justice Mahadevan said he felt happy participating in this felicitation function and that Thoothukudi had its own historical significance in the freedom movement.\n\nHe also said he was happy for the Thoothukudi Bar Association, which saw the legendary freedom fighter, V.O. Chidambaram Pillai, as a member during the days of yore.\n\nHe recalled the maritime trade links established during the Pandya period at the ancient port in Korkai and also the gallant deeds of the courageous freedom fighter, Veerapandiya Kattabomman.\n\nMeanwhile, the Judge said people should know how to lead their own lives and contribute to the society in a meaningful manner.\n\nThe members of legal fraternity recalled the contributions made by these advocates and their skills in the court of law.\n\nEarlier, the advocates including K. Sankarappa, P.S. Sundaram, A. Mariappasamy, V. Sorimuthu, A.W.D. Tilak, D. Thompsun Duraipandian and S. Ramanujam were felicitated by the Judge in the presence of Principal District Judge of Thoothukudi N. Rajasekar.\n\nPostal stamps were released and mementos handed over to them.\n\nBesides, a new website on Thoothukudi Bar Association was also launched by Justice Mahadevan.\n\nT.Michael Stanis Prabhu, President of Bar Association, P.G. Subramanian Muthusamy, Secretary, S.S.P. Ashok, Vice President, T. Gopinath Prabhu, Joint Secretary and V. Subachini Wilson, Treasurer attended.", 
    "section": "national", 
    "title": "“Rendering justice to the needy is a divine service”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}