{
    "author": [
        "S Ganesan"
    ], 
    "text": "The project taken up at a cost of Rs.1.50 crore; the bridge was built in 1976\n\nThe Highways Department would complete the repair and renovation of the Cauvery bridge in the city by the end of April, sources in the department said.\n\nThe department has resumed the rehabilitation-cum-beautification of the Cauvery bridge taken up a few months back as portions of the bridge, especially its parapet and pedestrian pathway, had suffered damages.\n\nThe work commenced in November and is scheduled to be completed within six months. But the work was suspended briefly as the Highways Department was awaiting the opening of the Odathurai bridge for diverting heavy vehicular traffic so that the volume of vehicles on the bridge could be brought down to facilitate the repair works.\n\nThe department had taken up the project at a cost of Rs.1.50 crore sanctioned under the Comprehensive Road Infrastructure Development Programme. Although construction of parapets on either side has been completed, the riding surface on the bridge is yet to be blacktopped. The bridge caters to a huge volume of traffic, and execution of the work in a staggered manner has been causing much hardship to road users as it is a vital link connecting the city with the Srirangam island and beyond.\n\nAccording to sources, the riding surface on the bridge carriageways had suffered some damage at the joints. The bridge constructed in 1976 has 15 spans and runs for a length of about 550 metres.\n\nCurrently, work on fixing strip seals on the spans has been taken up on one half of the bridge over the past few days.\n\nHeavy vehicles going towards Srirangam have been diverted via the newly opened Odathurai bridge. Once the strip seals are fixed, the road would be blacktopped. The work would be completed by April end, an official of the department said.", 
    "section": "national", 
    "title": "Repair and renovation of Cauvery bridge to be completed by April", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}