{
    "author": [
        "S Senthalir"
    ], 
    "text": "A rider on the move at the Pondicherry Equestrian Challenge 2016 at Auroville near Puducherry on Saturday. Jacqueline, founder of the Red Earth Riding School, seen with her horses.— Photos: S.S. Kumar\n\nAbout 60 steeds participate in jumping and dressage competitions\n\nHorses paced about their paddocks at the Red Earth Riding School (RERS) in Auroville on Saturday afternoon and strode in a measured manner across the lawns. They were getting ready to jump over obstacles placed at a height of 100 cm in a pattern on the second day of Equestrian Challenge 2016.\n\n“They have to walk about the paddocks to memorise how much distance they have to cover before every jump,” says Jacqueline, founder of RERS, one of the organisers of the Pondicherry Equestrian Challenge.\n\nOrganised by RERS and Equestrian Promotion Private Limited (EPP), the Pondicherry Equestrian Challenge will take place over two weekends.\n\nAbout 60 steeds were at the Red Earth Riding School to participate in the jumping and dressage competitions. Nearly 80 per cent of them were imported horses. These white, brown and black horses had travelled from Spain, Germany, Netherlands and France and trained in India for this sport.\n\nTo help them acclimatise to the new environment, the riders have to use fans, bathe them everyday and not take them out in the sun. In places like Mumbai, Kolkata and Chennai, they even use water coolers. “But, fans are enough for Puducherry because of humidity,” says Jacqueline.\n\nShe will participate in the dressage competition scheduled next Wednesday with Campera, a Pure Spanish Horse or PRE, who arrived at the Red Earth Riding School last year. Twenty-seven year old Guillanme Marcotte, a rider from France, who is now in Bangalore, had come to the Pondicherry Equestrian Challenge with his horses. “My clients have three horses – Ricarido imported from Holland and Cessi and Connor from Germany,” says Guillanme, who started riding when he was 16 years old.\n\nJacqueline adds: “Native breeds are not trained for sports. They can walk long distances but cannot jump or perform dressage. Imported horses are bred for certain sports. Some are trained for jumping, dressage and some for race. For instance, Spanish breeds cannot participate in race.”\n\nRed Earth Riding School in Auroville has 30 horses. Some are old, retired, pony and race horses. They are not just kept in the stable but left to move around in the 12 acres of land.\n\nThis sport is a journey that a rider and horse travel together. “One has to understand the different characters of the horses. They have different moods and cannot tell us what they are feeling. One has to feel their moods to work with them,” she says.", 
    "section": "national", 
    "title": "Riders and horses work on the tandem quotient", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}