{
    "author": [
        "Staff Reporter"
    ], 
    "text": "India accounts for the highest number of suicide rates in the world: report\n\nLakshmi Vijayakumar, founder, Sneha, with Shekhar Saxena, Director of the Department of Mental Health and Substance Abuse (MSD) at WHO, at Sneha Suicide Update Programme held in Chennai. -Photo: M.Vedhan\n\nEvery 40 seconds, a person dies by suicide somewhere in the world, said Shekhar Saxena, Director of the Department of Mental Health and Substance Abuse (MSD) at WHO.\n\nHe was addressing a gathering at the Sneha - Suicide Update 2016 conference here on Saturday.\n\nAccording to a report by the WHO, an estimated 8,04,000 suicides occurred worldwide in 2012.\n\nIt is reported to be high among youths between 15-29 years of age.\n\n“Suicide is illegal in many countries, however it continues to be underreported and sidelined as low-priority by governments,” Mr. Saxena said.\n\nIndia accounts for the highest number of suicide rates in the world -- 258,075 people committed suicide in the country in 2012, which includes 99,977 women and 158,098 men.\n\n“Suicides happen mainly due to impulsiveness, social, psychological and other factors. But the stigma attached to mental disorders and suicide deters those in need from seeking help,” said Lakshmi Vijayakumar, Organising Secretary of SNEHA.\n\nN. Ram, Chairman, Kasturi & Sons Ltd, who presided over the conference, pointed to Simon Cross’s report on why the ‘copycat’ theory on suicide coverage is a ‘conceptual red herring’.\n\n“A single suicide leaves behind a long trail of tragedy, affecting families and others around, as it more or less reflects copycat actions. Journalists must be very careful in publishing suicide cases, and in cases of negligence, they must be chastised. It is extremely important to exercise sensitivity, empathy and send out a powerful message to bring down the numbers,” he said.\n\n“In most cases, people who talk about suicide may be reaching out for help. Communities play a critical role in suicide prevention by providing social support to such people, fighting stigma and supporting those bereaved by suicide,” said Mr. Saxena.\n\n“Stigma attached to mental disorders and suicide deters those in need from seeking help”", 
    "section": "national", 
    "title": "‘Scribes must be careful in publishing suicide cases’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}