{
    "author": [
        "M Balaganessin"
    ], 
    "text": "The new method simplifies feeding of the cocoons\n\nAn improvised technique in sericulture introduced by the Department of Sericulture has started paying dividends, with farmers earning profits. Farmers earn an assured profit that ranged between Rs. 60,000 and Rs. 75,000 — every 45 days, right from the initial period.\n\nIn course of time, as the mulberry crop — the main feed for the silk worms — develops, the profit is likely to rise as high as Rs.1 lakh.\n\nThe new method involves infection-free growth of the eggs under hygienic environment. It simplifies the process of feeding the cocoons. It has given way to the old and conventional method of rearing the cocoons in the trays. “I could not get adequate returns from sericulture farming because of the contamination caused to the silk worms,” said V. Ganesh, a sericulture farmer of Samuthiram village near Manapparai, who had earlier adopted the conventional method of rearing of silk worms in trays which was not hygienic. Further, the old technique was labour intensive, as mulberry had to be fed leaf by leaf, he said.\n\nAfter having given up sericulture farming about a decade ago, he has now returned to rearing silk worms under the Tamil Nadu Sericulture Development Programme. “The shoot rearing technique has facilitated me to ensure hygienic and fast growth of silk worms.\n\n“The rearing shed is well protected from pollution, infection and contamination. One has to enter barefoot after cleaning the feet with running water at the entrance to the rearing shed,” says D. Natarajan, Technical Assistant of Sericulture Department which has been releasing subsidy to the sericulture farmers.\n\nMr. Ganesh said he had set up 32 beds each measuring 10 feet by five feet. He could harvest one lakh cocoons weighing about 100 kg to 120 kg which will be readily marketed within a couple of days at Rs. 350 a kg.\n\n“Thus, I could earn a profit of Rs. 60,000 every 45 days,” he says with a sense of confidence, indicating the scope for prospects.", 
    "section": "national", 
    "title": "Shoot rearing optimises profit for sericulture farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}