{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Vikarm Patel (second form left), professor of International Mental Health, London School of Hygiene and Tropical Medicine, being felicitated by R. Seshasayee, chairman, Board of Directors, Infosys, on Friday. Helen Herrman, president elect, World Psychiatric Association; Lakshmi Vijayakumar, founder, Sneha; Dinesh Bhugra, president, World Psychiatric Association, and Prasad Rao, President, Indian Psychiatric Society, are seen —Photo: M. Vedhan\n\nIn the past three decades, volunteers of Sneha suicide prevention centre have reached out to nearly 3 lakh distressed people with emotional support and timely intervention to cope up with difficult situations.\n\nLauding Sneha’s pioneering efforts to prevent suicides, speakers called for more such initiatives to take forward the social cause on the occasion of its 30th anniversary celebrations on Friday.\n\nCiting the recent cases of suicides among students, R. Seshasayee, chairman of the Board of Directors, Infosys, said it was essential to understand the social context in which such situation arises.\n\nThere is a collective responsibility to take forward Sneha’s efforts in preventing suicides and build an egalitarian society.\n\nMr. Seshasayee said critical leadership like Sneha is required to mobilise volunteers and funds now.\n\nHe also felicitated Vikram Patel, Professor of International Mental Health, London School of Hygiene and Tropical Medicine, for his contributions.\n\nSneha’s founder Lakshmi Vijayakumar said there were challenges to be addressed such as intervention at community level.\n\n“We need to enhance work among youngsters who fall under high risk category and also start more centres and even a short stay facility to rehabilitate acutely suicidal persons,” she said.\n\nDinesh Bhugra, president World Psychiatric Association, released a book on Sneha. Helen Herrman, president elect, World Psychiatric Association and Prasad Rao, President, Indian Psychiatric Society were present.", 
    "section": "national", 
    "title": "Sneha turns thirty", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}