{
    "author": [
        "Special Correspondent"
    ], 
    "text": "His contributions to the development of the city hailed\n\nDescribing late P.T.R. Palanivel Rajan as a multifaceted personality, speakers showered encomiums and recalled his contributions to the development of the Temple City on Saturday.\n\nFriends and well wishers of the former Speaker of the Legislative Assembly paid rich tributes to the late senior DMK leader at a meeting organised here.\n\nSpeaking on the occasion, former Supreme Court Judge AR. Lakshmanan said Palanivel Rajan, who was fondly called as \"Panbalar\" (a cultured person), was not only successful in his profession as a lawyer but also as politician and academician and was a protector of Tamil culture.\n\nAs the Speaker, he set very many examples on the conduct of Assembly proceedings, which were praised even by his political opponents. He ensured that there was an opportunity to every member of the House to speak.\n\nWishing him good luck, Mr. Lakshmanan hoped that Palanivel Rajan's son P.T.R.P. Thiagarajan too would step into politics and serve the society.\n\nIn his presidential address, World Thirukkural Peravai general secretary N. Manimozhian said the very fact that friends of Palanivel Rajan had gathered to recall his contributions after a decade of his demise reflected his yeomen services, which, the people of Madurai, would not forget.\n\nTown Kazi Hajee Mir Mohammed Kadri said that Palanivel Rajan had proved long back that decent politics was possible and a politician could remain clean in public life. \"He may have died 10 years ago, but the ideals left behind by him stand tall among us even today and would continue to live long,\" he noted.\n\nTamil Nationalist leader P. Nedumaran said that Palanivel Rajan was a symbol of magnanimity. Though they were affiliated to different political ideologies and fought elections, they continued to remain friends.\n\nNoted ‘pattimandram’ moderator Solomon Pappiah, V.S.P. Karmegam Mani and others offered felicitations.\n\nMr. Thiagarajan said that he was willing to follow his father’s footsteps in politics and serve the people of Madurai.", 
    "section": "national", 
    "title": "Speakers shower encomiums on Palanivel Rajan", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}