{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Experts skeptical about new projects if TNERC adopts Rs. 5.0132 per unit tariff\n\nDespite the unveiling of the Solar Energy Policy in 2012 that set a target of generating 3,000 mega watt (MW) of clean energy at a competitive rate of Rs. 7.01 per unit, generation in the State failed to take off in a big way. However, the Tamil Nadu Generation and Distribution Corporation (Tangedco) is hopeful of adding 1,250 MW of solar power by the end of this year, taking the total solar energy to 1,500 MW.\n\nA senior Tangedco official said currently the total connected load of solar power in the State stood at only 250 MW, comprising small players having a maximum capacity of 30-40 MW. But the coming year would see capacity addition to the tune of 1,250 MW. Apart from big players like Adani, SunEdison and Welspun, small players with capacity ranging from 5 MW to 50 MW are also expected to complete their projects.\n\nThe official said of the 1,250 MW, three projects would account for the lion’s share of almost 1,000 MW.\n\nThe three big projects are: the 648-MW Adani plant at Kamudhi in Ramanathapuram district, Welspun’s 200 MW (100 MW x 2) plants in Tiruchi and Karur districts, and SunEdison’s 150 MW project comprising three 50 MW plants in Virudhunagar district. However, power managers are pessimistic about any new projects taking off in the future in the event of Tamil Nadu Electricity Regulatory Commission (TNERC) adopting a tariff of Rs. 5.0132 per unit from March 31. Even the ongoing projects for which agreements were signed with Tangedco at the TNERC fixed rate of Rs. 7.01 are expected to be delayed.\n\nA senior official of Tangedco giving an update on the status of the project said SunEidson has commissioned 100 MW against the planned 150 MW and Adani has commissioned 72 MW until the first week of February.\n\nA senior official of Tamilnadu Transmission Corporation (Tantransco) said the 400 kilo volt (KV) transmission line work for evacuating solar power from Kamudhi is progressing well and is expected to be completed by March-end.\n\nThe official also said a green corridor of 400 KV capacity funded by the Ministry of New and Renewable Energy is being executed in the Western Ghats through Thapukkundu, Anikkadavu, Rasipalayam and Palavadi.\n\nA green corridor of 400 KV capacity is being executed in the Western Ghats", 
    "section": "national", 
    "title": "Tangedco hopeful of adding 1,250 MW of solar power", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}