{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Lyca Productions is already producing big-ticket films and has tied up with biggest of stars such as actors Rajinikanth, Chiranjeevi and Akshay Kumar\n\nDespite being a successful telecom company in the United Kingdom with a presence in over 20 countries, Subaskaran Allirajah, chairman and founder of €1 billion worth Lyca group, seems to have made a mark as a producer in such a short time.\n\nLyca Productions, a subsidiary of the Lyca group, is already producing big-ticket films in Tamil, Hindi and Telugu and has tied up with biggest of stars such as actors Rajinikanth, Chiranjeevi and Akshay Kumar.\n\nMr. Allirajah, who hails from the Northern Sri Lanka, admits to growing up with a love for movies starring actors M.G. Ramachandran and Rajinikanth.\n\n“We are into telecom and that will be our primary business. Making movies is my passion. Sri Lankan Tamils are big fans of Tamil films. It been my desire to produce movies,” says Mr. Allirajah who was in Chennai to meet actor Rajinikanth who is playing the lead in 2.0 , a sequel to the actor’s earlier smash hit, Enthiran .\n\nHe says his group is waiting for the government to liberalise the telecom market in India. “The MVNO (Mobile phone Virtual Network) market is yet to open up in India and we will definitely enter the Indian market,” Mr. Allirajah says.\n\nAsked if he thought he could make inroads in a country where there are big telecom majors, he says, “The Indian market is big enough to accommodate everyone.”\n\nAt a time when the Tamil film industry is going through a rough patch, Lyca Productions has plans to invest Rs. 350 crore for Enthiran’s sequel, 2.0 .\n\n“We are here to produce great movies. All our films will be director-driven. For the right project, we will replenish the yearly budget to Rs. 1,000 crore if needed,” he says, adding, “I hope these investments will take Tamil and Indian cinema to world-class standards.”\n\nRough ride\n\nThe ride has not been smooth for Subaskaran in Tamil Nadu. Lyca Productions’ maiden venture Kaththi , featuring actor Vijay in the lead role, faced severe protests from several small and influential political parties on the grounds that he had business links with former SL president Mahinda Rajapakse.\n\nWhile the production house recently distributed two well-known movies, Naanum Rowdy Dhaan and Visaranai , without any hiccups, Subaskaran explains away the incidents to ‘miscommunication’. “A lot was miscommunicated and misunderstood. I also think the protests could have been encouraged by some vested interests,” he says.\n\nAsked if his group would be picking up stakes in traditional media houses, Subaskaran insists that the group has no such plans. He says, “I am a businessman. Getting into media business would mean being on the wrong side politically. I want to remain politically neutral at all times,” he says firmly.\n\nLyca Productions is already producing big-ticket films and has tied up with biggest of stars", 
    "section": "national", 
    "title": "‘Telecom our primary business, making movies my passion'", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}