{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram : Car festival, ther vadam pidithal, 9 a.m.\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur : Theppam festival, Thayar purappadu from sanctum sanctorum, 6 p.m.; reaching theppam mandapam, 6.15 p.m.; purappadu from the mandapam, 8 p.m.; reaching sanctum sanctorum, 8.15 p.m.\n\nOrganising Committee : Sriman Alluri Venkatadhri Swamy’s 139{+t}{+h}theertha mahotsavam, Uncha vruthi bhajan, Sri Nammazhvar Ramanuja Koodam, East Chithirai Street, Srirangam, 6 a.m.; book release, P.Jayaraman, Executive Officer, Srirangam Sri Ranganathaswamy Temple, presides, discourse by Sri Ranga Narayana Jeer Swamigal, Sri Ranga Vilasa Mandapam, 10 a.m.; Veda parayanam, Sri Diyva Prabhanda Seva and bhajans, Alavanthar Padithurai, 3 p.m.\n\nSrimad Ubhaya Vedantacharya Peetam : Discourse on Bhagavata Dasamaskandam by R.Anantharaman, 294, Sathara Street, Srirangam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Garuda Mandapam, Srirangam Sri Ranganathaswamy Temple, 5 p.m.; Sri Lakshmi Narasimha Swamy Sannidhi, 197, Sri Ahobila Mutt, East Uthira Street, 5.45 p.m.; Amrutha Kalasa Garudan Sannidhi, Ranga Vilasa Mandapam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, Siddhi Vinayagar Temple, SMESC Colony, 6 p.m.\n\nCULTURE\n\nOrganising Committee : Sri Thyagabrahma aradhana mahotsavam, veena concert by disciples of Srirangam R.Srinivasan, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; flute concert by Ajith Rangarajan and party, 7.30 p.m.\n\nRasika Ranjana Sabha and R.Radhakrishnan Memorial Trust : Kamban Vizha, pattimandram, R.Shanmugavadivelu, moderates, FGN Hall, W.B.Road, 6 p.m.\n\nKalai Kaviri College of Fine Arts : Graduation day of bharathanatyam and music certificate courses, Andal Priyadarshini, Director, Doordarshan, Coimbatore, presides, 5.30 p.m.\n\nThe Aura : India Art Festival, Nrithyam Marudham – dance tribute to M.S.Subbulakshmi by Radhika Shurajit and troupe, Hotel Femina, 6 p.m.\n\nThennaga Kalai Ilakkiya Valarchikuzhu: Pavendar Bharathidasan vizha – seminar, Vairamalai Antonysamy, presides, Ramyas Hotel, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology : Pragyan – techno management meet, lectures by Abhas Mitra, astrophysicist, 11.30 a.m.; Archana Sharma, senior scientist, CERN, 2.30 p.m.; Cross fire, 4 p.m.; valediction, Sathish Kumar, DS and Director and General, Missiles and Strategic Systems, DRDO, chief guest, 5 p.m.\n\nBharathidasan University Centre for Study of Social Exclusive and Inclusive Policy : National seminar on Inclusive policies in higher education in India, N.Rajendran, Head, Department of History, Bharathidasan University, inaugurates, Khajamalai campus, 10 a.m.\n\nDiabetes Club of Tiruchi: Annual professional conference, Hotel Sangam, 8.20 a.m.; valediction 3.30 p.m.; joint meeting with Indian Medical Association, 4.30 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Graduation Day, H.Devaraj, Vice Chairman, University Grants Commissioner, delivers the graduation day address, 10.30 a.m.\n\nTamil Nadu PWD Senior Engineers Association : Meeting, Dr.G.Vignesh, consultant diabetologist, speaks on ‘Sugar, thyroid, hormone problems and body weight,’ Hotel Ajantha, 5 p.m.\n\nDepressed People’s Welfare Association : Inauguration of deep borewells and hand pumps and water tanks, Suriyur, 11.5 a.m.\n\nMuslim organization of India and Sunnath Jama’th Students’ Federation : State delegates camp and Thowheed protection conference, Golden Mahal, Singarathope, 9 a.m.\n\nSharon, Iyyamperumal and Dakshinamurthy Trust, JCI Tiruchi Excel and GVN Hospital : Free medical camp, Lakshmi Aided Elementary School, Sunnambukaranpati, 10.30 a.m.\n\nHindu Mission Hospital and Rotary Club of Tiruchi Midtown : Distribution of free artificial limbs and registration of new beneficiaries, hospital premises, Anna Nagar, Thennur, 9 a.m.\n\nTiruchi Regional Roller Skating Association and RVS School : Tamil Nadu Open State Roller Skating championship, RVS School campus, 9 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}