{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Residents move out with belongings from their homes along Perumpallam irrigation canal after their eviction from encroached structures in Erode on Saturday.—PHOTO: M. GOVARTHAN\n\nEviction of unauthorised structures along the Perumpallam irrigation canal to a length of six km from the Anicut began on Saturday amidst heavy police presence.\n\nThe occupants relented and started cooperating with the police after realising the inevitability of moving out, Superintendent of Police M.R. Sibi Chakravarthy said.\n\nNearly 250 policemen, including personnel drawn from Armed Reserve and Home Guards, were deployed during the eviction operations.\n\nThe eviction was carried out based on a court order on clearing water bodies of encroachments.\n\nThe Public Works Department is required to convey the action taken to the Court.\n\nAbout 570 unauthorised houses will be demolished during the next two to three days using earthmovers. The action comes after a spate of notices issued to the occupants who had been residing in the structures for a few decades now.\n\nThe district administration could not accommodate the request of the residents for postponing the eviction operation till the completion of the academic year since the High Court order had to be complied with within the stipulated time.\n\nA last-minute effort by the residents on Friday to persuade the District Collector S. Prabakar to consider their request did not fructify.\n\nThe Collector, however, assured them that title deeds have been allotted for 331 of the displaced residents at Palathozhuvu, and that land would be provided to the rest in other places in subsequent phases.\n\nThe canal’s original shape has been restored by Olirum Erodu Foundation through dredging.\n\nAccording to farmers’ organisations, the revival of the irrigation canal being made possible through the eviction would enable agricultural cultivation in over 2,000 acres that would have otherwise remained fallow.", 
    "section": "national", 
    "title": "Unauthorised structures along Perumpallam irrigation canal removed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-28"
}