{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Driver of truck at fault, say police; Chief Minister announces solatium\n\nThe remains of the TNSTC bus which collided with a truck near T. Kallupatti on Saturday.\n\nFifteen people, including five women and a boy aged about 7 were killed and around 40 others injured when a Tamil Nadu State Transport Corporation (TNSTC) bus and a cement-laden truck collided head on near M. Subbulapuram village, around 50 kilometres south-west of Madurai, on Saturday afternoon.\n\nThe impact was so severe that the front portion of both the vehicles were damaged beyond recognition . Police said the TNSTC bus was on its way from Tirunelveli to Kumili, while the truck was proceeding towards Ariyankaavu from Karur. The incident occurred near Gopalasamy hills located close to M. Subbulapuram.\n\nTen persons, including bus driver R. Murugesan (35) from Veerapandi in Theni district, and the truck driver identified as K. Muthukumaran (35) from Kadayanallur in Tirunelveli district, were killed on the spot.\n\nFour others succumbed to the injuries at the government hospital in Tirumangalam and the Government Rajaji Hospital (GRH) in Madurai.\n\nSix deceased have been identified as V. Selvaraj (61) from Valliyur in Tirunelveli district, Surulirajan (45) from Chinnamanur, V. Koodalingam (40) and Govindaraj from Krishnankoil in Virudhunagar district, Balan (60) from Uthamapalayam and M. Sooriyalingam from Valayapatti. Police are yet to identify other deceased passengers.\n\n35 people injured\n\nAt least 35 persons, including 20 women and four children, who sustained injuries have been admitted at GRH while four others are recuperating at the government hospital in Peraiyur.\n\nThough the exact cause is yet to be ascertained, police officials, quoting bus conductor N. Rathinasamy who was also injured, said the truck driver was at fault as he came on the wrong side of the curved, rather narrow road.\n\nTN Governor K Rosaiah and Chief Minister Jayalalithaa condoled the deaths. The Chief Minister has announced a solatium of Rs one lakh to the family members of those who have died in the accident. TN Cooperation Minister Sellur K. Raju visited the accident spot. Senior officials, including Madurai District Collector K. Veera Raghava Rao, visited the injured at the hospital. SP Vijayendra S. Bidari supervised the rescue operations. at the spot.", 
    "section": "national", 
    "title": "15 killed as bus, truck collide", 
    "subsection": "general", 
    "date": "2016-02-07"
}