{
    "author": [], 
    "text": "An Arjuna awardee Assistant Commandant of the India Reserve Battalion, who was under suspension, allegedly committed suicide by hanging from a ceiling fan here, police said on Saturday.\n\nNarinder Singh, 45, who had been under suspension for the past two years, allegedly committed suicide on Friday night at his official residence in the Punjab Armed Police headquarters, upset over an ongoing criminal case against him, Additional Deputy Commissioner (City I), Jalandhar, J. Ellenchejian said.\n\n“The deceased was a part of the fifth India Reserve Battalion as an Assistant Commandant and was under suspension. It seems as if he has taken this step under depression,” Mr. Ellenchejian said.\n\nThe police sent the body for post-mortem on Saturday morning. They also recovered the wire with which the officer hanged himself. A case has been registered.\n\n‘Case of suicide’\n\n“Preliminary investigation suggests that this is a case of suicide. However, it cannot be confirmed until the post-mortem report comes out. Further investigation will proceed on that basis,” Mr. Ellenchejian said.\n\nThe incident came to light when Narinder’s wife discovered his body hanging from the ceiling fan upon entering his room on Friday night, they said.\n\nSenior police sources said a case was pending against Narinder for allegedly killing a man when he was posted at Punjab Bhawan in New Delhi.\n\nThe sources said Narinder shot at a man, who had asked him the way, killing him.\n\nNarinder was transferred to the India Reserve Battalion and later suspended, the source said.\n\nAnother official said there were allegations of eve-teasing levelled against Narender by women police officers. At that time, he was posted as the DCP.\n\nThe official said since a criminal case was pending against Narinder, his suspension was not revoked, which might have prompted him to take the drastic step.\n\nNarendra was a Judo champion and was awarded the Arjuna award in 1998 for his commendable performances in the Commonwealth and Asian games, police said. — PTI\n\nThe Assistant Commandant of the India Reserve Battalion was\n\nunder suspension", 
    "section": "national", 
    "title": "Arjuna awardee found dead", 
    "subsection": "general", 
    "date": "2016-02-07"
}