{
    "author": [
        "Mohit M"
    ], 
    "text": "Two years after a Wikipedia entry was found in a scientific paper in a peer-reviewed journal, the Indian Journal of Psychiatry has cracked the whip and retracted the article. The incident affirms what many in the scientific community believe is an increasing trend in plagiarism.\n\nNearly two months ago, the IJP formally retracted the article “The mystery of reincarnation,” published in early 2013 by researchers A.K. Nagaraj, R.B. Nanjegowda and S.M. Purushothama, from the Department of Psychiatry, Mysore Medical College and Research Institute. “It has been reported and found that the article contains overlapping text sections from Wikipedia. Therefore, on the grounds of duplicity of text, the article in concern is being retracted,” says the retraction notice published by editor of the journal, T.S. Sathyanarayana Rao.\n\nLarge chunks of the study were found to have been lifted from an older version of a Wikipedia entry on reincarnation.\n\nWhile Retraction Watch — an online portal that keeps an eye on plagiarism in scientific journals — cites two large paragraphs that have been taken from the Wikipedia page, a simple online plagiarism tool shows that at least one-fourth of the study matches with the entry. The authors of the study did not respond to numerous calls made by The Hindu .\n\n“Our journal is audited by Medknow (among the largest medical open access publishers) and they pointed out the plagiarism. This process takes two years, and we took serious action once it was known … we allow for language matching of around 5 per cent, but in this case, it has exceeded that,” says Mr. Rao.\n\nAsked how the article was published without checks, the editor says: “This was a supplement and did not go through the process of being reviewed by at least three peers. This is a learning process and we have strengthened our checks.”\n\nHe believes that with “increasing pressure” on researchers to produce studies for promotions and better opportunities, incidents of plagiarism have become “rabid” in journals.\n\nThose in the scientific community agree, believing that Indian journals have a reputation for accepting “inferior, often plagiarised” material.\n\nP. Balram, former director of Indian Institute of Science, who was the editor of Current Science for nearly two decades, believes the blame lies in the quantity-over-quality approach of the University Grants Commission. “Plagiarism has been slowly increasing for some years now. Instead of evaluating teachers, we judge them through API (Academic Performance Indicators). By making everything into a number, there is no evaluation of quality. Many then plagiarise thinking they can get away with it,” he said.\n\nResearchers from the Department of Psychiatry, Mysore Medical College, had submitted it", 
    "section": "national", 
    "title": "Article retracted after ‘overlapping text’ from Wikipedia found", 
    "subsection": "general", 
    "date": "2016-02-07"
}