{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Retired Supreme Court Judge and former chairperson of the West Bengal Human Rights Commission (WBHRC) Justice (retd) Asok Kumar Ganguly has become the rallying point for the Opposition in Bengal for having “larger alliance” against the Trinamool Congress.\n\nSenior leaders of the Opposition, including Leader of Opposition and Communist Party of India (Marxist) State Secretary Surjya Kanta Mishra, and senior Congress leaders of the State are making a beeline to meet him over the past few weeks.\n\nSpeaking to The Hindu on Saturday, Justice (retd) Ganguly said that he is working on a citizen’s charter, which will highlight certain basic fundamental rights that are being violated by the political parties in power.\n\n“Right to the Freedom of Expression has been shunted. The charter will also raise issues like police should work without the influence of political party,” the former WBHRC chairperson said.\n\nDuring his tenure at WBHRC he had directed awarding compensation to Jadavpur University professor Ambikesh Mahapatra and farmer Shiladitya Chowdhury raising questions on their arrest.\n\nWhile Mr. Mahaptara had to spend a night in police custody for forwarding an e-mail containing graphics of Chief Minister Mamata Banerjee, Mr. Chowdhury was arrested for asking questions at a public rally of Ms. Banerjee.\n\nAfter he submitted his resignation as chairperson WBHRC in January 2014 over allegations of sexual harassment by an intern, Justice Ganguly had became one of the key faces of civil society in the State heading a forum called Save Democracy Forum. Most of his remarks since then have been directed against the ruling Trinamool Congress.\n\nThe political circles are also rife with speculation that he may be a candidate against the ruling party in the upcoming polls. Mr. Ganguly, however, is awaiting the outcome of talks between the Communist Party of India (Marxist) and the Congress for having an electoral understanding for the upcoming polls.", 
    "section": "national", 
    "title": "Bengal polls: A.K. Ganguly emerges the rallying point for Opposition", 
    "subsection": "general", 
    "date": "2016-02-07"
}