{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A day after the Congress demanded the resignation of Gujarat Chief Minister Anandiben Patel over a land deal involving businessman Dakshesh Shah, a business partner of the Chief Minister’s daughter Anar Patel, the BJP on Saturday came out in defence of the Chief Minister, describing allegations of favouritism and nepotism as baseless.\n\n“The Congress is a history-sheeter in making false charges as it has a policy of ‘shoot and scoot’ and has not been able to prove any charges against this government,” BJP national secretary Shrikant Sharma said, adding, “Land allotments done in Gujarat during Narendra Modi’s tenure as Chief Minister, over which the Congress is making false and baseless charges, have been made as per law and after following a transparent three-tier evaluation process.”\n\nOn Friday, Congress leaders Anand Sharma in Delhi and Arjun Modhwadia in Ahmedabad had accused the Prime Minister Narendra Modi and Anandiben Patel of allotting government land to Mr. Shah near the Gir sanctuary.\n\n“Prime Minister Narendra Modi, when he was Chief Minister of Gujarat, allowed nepotism, conflict of interest and brazen plundering of public land to promote the commercial and business interests of entities closely connected to the kin of the then Revenue Minister and present Chief Minister of Gujarat, Anandiben Patel,” the Congress leaders alleged.\n\nThe party demanded a probe by a special investigation team to be monitored by either the Gujarat High Court or the Supreme Court. “The special investigation team monitored by the Supreme Court should cover all the allotments and grants of public land when Anandiben was the Revenue Minister and Mr.Modi was the Chief Minister,” Congress spokesperson Anand Sharma told reporters in New Delhi.\n\nNear the sanctuary\n\nThe allegation is that in 2010, the Gujarat government allotted 250 acres of land next to the Gir Lion Sanctuary in Patla village, Amreli district, to Wildwoods Resorts & Realties Private Limited (WWR) for setting up a resort. The WWR is promoted by Dakshesh Shah.\n\nOn Saturday, the Gujarat government, the promoters of Wildwood Resorts and Ms.Anar Patel came out with details dismissing all allegations of wrongdoing by them.\n\n“I am neither a director nor a share holder in Wildwood Resorts, Anil Infraplus and Parshva Texchem. I don’t have anything to do with any entity and anybody can check with government authorities. Indeed, Daksheshbhai is my business partner, but that doesn’t mean that I am there in all his companies. He is a self-made businessman and is in business since the last 22 years,” Ms.Anar Patel posted on Facebook.\n\n“The land was allotted to Sanjay Dhanak in 2010. Mr.Dhanak is a son of Vrajlal Dhanak, former MLA of Janata Dal, which was a breakaway group of the Congress,” Mr.Shah said in a statement, giving details of the land allotment that, according to him, was done prior to his entry into the entity.\n\nThe Gujarat government also issued a statement providing chronological details of the land allotment.", 
    "section": "national", 
    "title": "Cong. targets PM in Gujarat land case", 
    "subsection": "general", 
    "date": "2016-02-07"
}