{
    "author": [
        "Kritika Sharma Sebastian Shiv Sunny"
    ], 
    "text": "Father of six-year-old Divyansh, who was found dead in a water tank at Ryan International School, has alleged that his son might have been subjected to sexual assault before his death.\n\nAccording to him, there were injury marks on Divyansh’s private parts, which made him suspect foul play.\n\n“When I first saw my child after his death at the hospital, he had cotton on his private parts while the rest of his body was bare. If he was dead, the hospital should have covered his nose and ears also with cotton. Is there something that the school wanted the hospital to hide?” asked Divyansh’s father Ramheet Meena.\n\n“We fear that Divyansh was subjected to sexual assault and the school is trying to hide this fact,” he added.\n\nDeputy Chief Minister Manish Sisodia also echoed the parent’s view and demanded that there should be a fair probe into the matter.\n\n“The observation of the parents are being ignored that the private parts of the child had cotton on them. The SDM report is indicating towards a heinous crime. And saying that he had a disorder amounts to running away from responsibilities,” Mr. Sisodia told reporters here.\n\nMr. Sisodia had two days ago met the parents and assured them of co-operation in the investigation.\n\nThe aggrieved father also demanded that the licence or registration of the school be cancelled. “We are demanding a CBI probe to know how my child was able to reach that unapproachable place which is often locked and why would he crawl to reach that place,” Mr. Meena added.\n\nMeanwhile, police said they were not ruling out any possibility of sexual assault even as their investigation so far had not pointed towards it.\n\nDeputy Chief Minister Manish Sisodia says\n\nthere should be\n\na fair probe", 
    "section": "national", 
    "title": "Death of Delhi school student: father alleges sexual assault", 
    "subsection": "general", 
    "date": "2016-02-07"
}