{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Rekha Munda (name changed) was rescued from Faridabad in Haryana in April 2015.\n\nA resident of Banarhat in West Bengal’s Jalpaiguri district, she was lured by a youth on the promise of marriage and through a network of touts and landed up as a domestic help in Haryana.\n\nThe 16-year-old complained that she was not fed properly and not allowed to go out of house. She managed to get hold of a mobile hone and call her brother in Jalpaiguri which led to her rescue.\n\nThe story of Anila Rajkumrai (name changed) is also not very different. Trafficked from Jalpaiguri, the 20-year-old was rescued from Vasant Kunj in Delhi in September, 2014. When she was rescued, she had marks of injuries on her back, arms, face and neck. There was also a fracture in her finger, which was inflicted allegedly by her employer. Such stories of Rekha and Anila are becoming more frequent as distress stalks tea gardens of north Bengal. While there are reports of deaths in tea gardens due to malnourishment and diseases, the issue of forced migration and trafficking from the tea gardens does not come to fore.\n\n“Only in the first ten months of 2015 nearly 2,837 victims of trafficking [1129 minors and 1708 women] from West Bengal were rescued from different parts of the country. Among the areas in West Bengal which are most vulnerable to region where the teagardens are located, says Rishi Kant an activist with Shakti Vahini. Jalpaiguri and the adjoining Alipur Duar District have taken massive awareness campaign targeting the interior areas where focus on education of girls, he added.\n\n“The wages in the tea garden stand at about Rs. 122. This is also irregular in certain tea gardens. Don’t you think that under such situation the women and girls would be more vulnerable to trafficking,” Debjit Datta, a prominent trade union leader said.", 
    "section": "national", 
    "title": "Distress brewing in tea gardens of north Bengal triggers trafficking", 
    "subsection": "general", 
    "date": "2016-02-07"
}