{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A Parliamentary Standing Committee on Science and Technology, Environment and Forests on Saturday blamed the BJP-led Goa government for its “tardy implementation of environmental laws and regulations.”\n\nThe committee, headed by Rajya Sabha member Ashwini Kumar, also slammed the State government for its recent amendment to the Preservation of Trees Act de-recognising the coconut palm as a tree and had recommended a review of the controversial amendment.\n\nMr. Kumar addressed presspersons in south Goa on Saturday after day-long discussions with State officials, tourism and mining industry stakeholders and civil society groups.\n\n“This issue of the definition of forests in which a coconut tree in Goa is not regarded as a tree, which we found extremely unusual and we have recommended that a review of the definition of tree under the Tree Protection Act be undertaken,” Mr. Kumar said.\n\nThe Opposition and sections of civil society have accused the government of amending the Goa Daman and Diu Preservation of Trees Act, 1984 at the behest of real estate and industrial development lobby at the cost of environment. Many said coconut tree was part of coastal State’s culture.\n\nRed tape\n\nForest Minister Rajendra Arlekar, however, defended the amendment saying a coconut palm did not fit into the definition of a tree and that the amendment was aimed at resolving the hassles of red tape faced by farmers and others while doing away with unproductive or dangerous coconut trees.\n\nMr. Kumar also found fault with the Goa government’s track record in implementation of green laws. He said the committee had directed that a representative of the Union Ministry of Environment and Forests should engage with the State government authority with a view to “finding mechanisms to implement in letter and in spirit all laws intended to protect the environment.”\n\nThe committee had put on record its displeasure over the tardy implementation of environmental laws and regulations.\n\nOn the issue of Goa government’s Investment Promotion Board (IPB), set up to facilitate speedy clearances, Mr. Kumar said they discussed the single window clearances accorded by the IPB whereby a general exemption was given in terms of obtaining of various clearances.\n\n“It is not the right way to go about it. We believe that in non-notified industrial areas also, the requirement of obtaining all necessary clearances was necessary,” Mr. Kumar said.\n\nIt calls for review of controversial amendment to preservation of trees Act", 
    "section": "national", 
    "title": "House panel slams Goa for tardy implementation of environmental laws", 
    "subsection": "general", 
    "date": "2016-02-07"
}