{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Both nations are worried over human trafficking by terror operators\n\nWorried over the possible proxy use of narcotics and human trafficking networks by terror operators, India and Thailand have started talks on exchanging prisoners that are of mutual interest, diplomatic sources told The Hindu .\n\nA round of discussion, in this regard was held in Bangkok between senior officials of the Ministry of External Affairs and Thai representatives, during the latest visit to Thailand by Vice President Hamid Ansari.\n\nOne of the first cases that both sides have begun to look into involves a Kindergarten teacher, Mitu Mandal, who has been in Thai custody since May, 2014, when she was arrested in Bangkok’s Suvarnabhumi Airport with 1.62 kilogram of “Ya Ice” (methamphetamine). Ms. Mandal reportedly confessed to Thai authorities that she was used by a narcotics network covering Thailand, India and Nigeria.\n\n“Thailand’s judiciary has taken up the case of Mitu Mandal. We have sought support of Thai officials so that she can be brought back to India at the earliest,” a diplomatic source told The Hindu highlighting the relevance of such cross border cases for more effective law enforcement.\n\nPrisoners exchange is one of the steps being planned in bilateral legal collaboration following two major extraditions from Thailand since January 2015.\n\nIn January 2015, Thailand handed over Jagtar Singh of Babbar Khalsa International (BKI) and followed it up with the handing over of Thai gunrunner “Willy Naru”, Wuthikorn Naruenartwanich in December 2015.\n\nIndian officials familiar with the case said that Thailand’s deportation of “Willy Naru” was a big confidence building step since Thailand’s government led by Gen. Prayut Chan-o-cha was not moved by Willy’s Thai nationality and deported him to India on charges of selling arms to northeast insurgent groups.\n\nExtradition treaty\n\nThe latest plan to fast track prisoners exchange is based on the bilateral extradition treaty, 2013, and the Mutual Legal Assistance Treaty, 2004, which provide the legal basis for negotiation to both sides. Thailand Defence Minister Gen Prawit Wongsuwan is expected to visit India shortly to take forward the negotiations regarding the relevant cases.\n\nSources revealed that the prisoner-swap mechanism will also be a humane step and help in returning several Thai victims of human trafficking who are in various prisons of India.", 
    "section": "national", 
    "title": "India, Thailand in talks for exchange of prisoners", 
    "subsection": "general", 
    "date": "2016-02-07"
}