{
    "author": [], 
    "text": "One of the unanimous demands made by the States was that the Centre release the compensation for the phasing out of the Central Sales Tax.\n\n“The Union Government has finally released a portion of the long-pending Central Sales Tax (CST) compensation. Even after this, Rs. 7,471 crore is yet to be reimbursed by the Government of India for the period up to March 31, 2013. I request the Union Finance Minister to make adequate provision for CST compensation either in the Supplementary Estimates for 2015-16 or in the forthcoming budget,” Tamil Nadu Minister for Finance and Public Works O. Panneerselvam said in his speech.\n\nThis plea was echoed by Odisha, Punjab, Uttar Pradesh, Assam, Telangana and West Bengal among others.\n\n“In the last budget, the devolution to the States was increased to 42 per cent. However, when that was done, the Centre’s share in 58 social development programmes was reduced, including the important schemes like Sarva Shiksha Abhiyan and the Integrated Child Development Services (ICDS),” West Bengal Finance Minister Amit Mitra told reporters.\n\n“The 14th Finance Commission had recommended that the States that have maintained financial discipline be allowed to borrow 3.5 per cent [of their GDP], up from 3 per cent. Since we have maintained financial discipline, the government should allow us this increment in borrowing. This will allow us to raise Rs. 3,000 crore more for FY2016,” Madhya Pradesh Finance Minister Jayant Kumar Malaiya said.\n\nAmong the other recommendations made by the States was that the Centre account for one-fourth of the GST Council and the States three-fourths, against the current composition of one-third of the Centre and two-thirds of the States.\n\n“Around 39 schemes were eliminated in the last budget such as those for model schools and for modernisation of the police force. These schemes need to be carried out, with the States bearing the burden. So, the result is that the States do not end up gaining. We have requested that the Centre to rethink the devolution process and revive some of the important projects that have been dropped,” Mr. Mitra said.\n\nSeveral Finance Ministers made demands for their own States. For example, Bihar asked for special category status and for the allocation under the Rs.1,25,000-crore package for FY17… Tamil Nadu asked for a special allocation to compensate it for the loss it had suffered because of the changes in the devolution pattern.\n\nOdisha wanted the mineral-producing States to be allowed to levy their own cess, and tobacco on the State list.\n\nStates urge the Centre to release the compensation for phasing out of Central Sales Tax", 
    "section": "national", 
    "title": "Jaitley wants States to spend more on infra projects", 
    "subsection": "general", 
    "date": "2016-02-07"
}