{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Stirring a fresh controversy, Samajwadi Party leader and Uttar Pradesh Urban Development Minister Azam Khan on Saturday alleged that Prime Minister Narendra Modi met underworld don Dawood Ibrahim during his recent visit to Pakistan. Mr. Khan claimed that he had evidence to prove that Dawood was present at Pakistan Prime Minister Nawaz Sharif’s residence in Lahore when he met Mr. Modi last year.\n\n“The Prime Minister of the largest democracy went to his enemy nation without telling anyone. He violated all international laws and went to Pakistan. Along with Nawaz Sharif, his wife and their daughters and Dawood were present at the meeting,” Mr. Khan said in an explosive allegation. “Let him [Mr. Modi] deny. I will give evidence,” Mr. Khan said.\n\nMr. Khan made the comments in Ghazipur district in eastern Uttar Pradesh. Mr. Khan also asked Mr. Modi to clarify “Who are all were present in theclosed door meeting?” in Pakistan.\n\nGovernment of India spokesperson Frank Noronha told ANI Mr. Khan’s accusation was “totally unfounded, baseless & false.”\n\nBJP national secretary Srikanth Sharma termed Mr. Khan’s allegations “baseless and senseless” and even accused the Akhilesh Yadav government of acting on a “strategic conspiracy” to defame Mr. Modi. Many social media users urged Mr. Khan to produce evidence to prove his allegation or refrain from comment.\n\nPTI reports:\n\nBJP’s Sudhanshu Mittal asked Mr. Yadav to “immediately” dismiss the Minister. “If Akhilesh means business, he should immediately dismiss him for disturbing communal harmony and bringing shame to the nation,” he said. Congress spokesperson Tom Vadakkan said Mr. Khan had been in public life for a long time and he should not have made the statement without substantiating it.\n\nCentre terms Samajwadi Party leader's accusation totally unfounded, baseless and false", 
    "section": "national", 
    "title": "Modi met Dawood in Pak.: Azam Khan", 
    "subsection": "general", 
    "date": "2016-02-07"
}