{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Steeped in saffron:Kapil Dev, BJP candidate for the Muzaffarnagar Assembly byelection, has been invoking ‘love jihad’ and woman’s honour during the campaign.\n\nIn an indication of its agenda for the 2017 Uttar Pradesh Assembly elections, the BJP has brought up Ram temple, Muzaffarnagar riots and “love jihad” as top campaign issues for the Muzaffarnagar Assembly by-election to be held on February 13.\n\nParty leaders have been invoking the VHP’s “international convention” for the Ram temple in 1982 in Muzaffarnagar and the 2013 riots to reason that these had led to the formation of the Modi government at the Centre.\n\nThe grave agrarian crisis facing this rich sugarcane belt figures nowhere in the campaign. But the Ram temple finds a mention even in meetings held on the theme of rights of the backward castes. At a meeting on Friday, when several backward caste youths gave extensive speeches demanding their rights, Satyapal Singh, BJP district president, appealed to them to talk like “Kawad [worshippers of Lord Shiva] who do not talk about caste.”. When S.P. Singh Baghel, BJP’s backward morcha president, spoke about the reasons for which the BJP got 73 Lok Sabha seats in U.P., without naming Muslims, he mentioned “people’s expectation from him [Narendra Modi] that he would fix a particular community and group” to loud cheers from the audience of largely backward groups.The campaign slogan of Kapil Dev, BJP candidate, raises the bogey of “love jihad” and its perceived theory of “sexual onslaught of Muslim men on Hindu women.”\n\n“ Bahu beti ke samman me/Kapil dev maidan me [for the sake of the honour of our daughters and daughters-in-law, Kapil Dev is contesting polls],” is the campaign slogan of the BJP.\n\nMr. Dev told The Hindu that “development comes later, first comes the honour of our women which is facing the onslaught of a particular community.”", 
    "section": "national", 
    "title": "Saffron hue to BJP’s Muzaffarnagar campaign", 
    "subsection": "general", 
    "date": "2016-02-07"
}