{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Women activists and temple trustees agree to abide by Maharashtra Chief Minister’s decision\n\nLocals are opposed to women’s entry in the sanctum sanctorum of the Shani Shingnapur temple in Ahmednagar district of Maharashstra.— Photo: Special Arrangement.\n\nIt is now up to Maharashtra Chief Minister Devendra Fadnavis to resolve the impasse over women’s entry in the inner sanctum of the famous Shani Shingnapur temple in Ahmednagar district, as the contending parties have agreed to abide by his decision on the issue.\n\nIn a bid to hammer out a resolution, the Ranragini Bhumata Brigade, led by its leader Trupti Desai, talked to the temple’s trustees in the presence of the Ahmednagar District Collector and the Superintendent of Police on Saturday.\n\nAiming to do away with a centuries-old patriarchal tradition, the brigade grabbed the headlines by attempting to storm the temple premises on Republic Day. Its activists were halted by security personnel well before they could reach the temple town.\n\nSpeaking to The Hindu , Ms. Desai said discussions with the temple’s trustees were “fruitful.”\n\n“The trustees were insistent that even men had been prohibited from entering the inner sanctum after 2004. But we silenced them after furnishing proof that there had been several recent instances in which men were permitted to enter the restricted area and offer worship after donating Rs. 11,111 towards temple funds,” said Ms. Desai.\n\nShe said the final decision on the matter now rested on Mr. Fadnavis and that both parties would agree to the verdict given by the Chief Minister.\n\n“We eagerly hope that he [Mr. Fadnavis] will end the centuries-old discrimination,” said Ms. Desai. The RBB had earlier submitted a memorandum on the issue to the Chief Minister in Pune.\n\nHowever, villagers of Shani Shingnapur are opposed to the brigade’s attempts to do away with the centuries-old tradition with sarpanch Balasaheb Bankar rebuffing its argument on ‘paid aarti.’\n\nMr. Bankar and a majority of the villagers have been resolutely opposed to the idea of women entering the inner sanctum to offer worship in what they call a “flagrant violation of tradition.”\n\nThe brigade’s aim of doing away with the 400-year-old practice has drawn the battle lines with the locals, joined by activists of rightwing groups represented by the women’s wing of the ruling Shiv Sena and other outfits on the fringe-right, represented by the Sanatan Sanstha, the Hindu Janjagruti Samiti (HJS) and its women’s wing, the Ranragini Shakha, opposing it.", 
    "section": "national", 
    "title": "Shani temple issue: it’s over to Fadnavis", 
    "subsection": "general", 
    "date": "2016-02-07"
}