{
    "author": [
        "Josy Joseph"
    ], 
    "text": "‘Intense Army deployment should be replaced with verifiable technological solutions’\n\nThe latest tragedy in Siachen could be an excuse for an all-out effort by both India and Pakistan to demilitarise the inhospitable glacier where India and Pakistan have sacrificed hundreds of soldiers over the last three decades.\n\nIn fact, some in the military establishment believe the death of 10 soldiers of Madras Regiment could be a trigger for New Delhi to convince Islamabad to go back to the negotiation tables, where a roadmap for demilitarising Siachen is already available.\n\nOne senior Army officer pointed out that the Pakistan too has a compelling reason to consider the demilitarisation of the glacier, where over 2,000 soldiers of both nations have died since 1984. He pointed out that after 140 Pakistani soldiers were killed in an avalanche in April 2012, the then Pakistan Army Chief, General Parvez Kayani, issued a statement favouring demilitarisation of the region. “The intense military deployment should be replaced with technological solutions that are verifiable,” the senior officer said. It is an opinion echoed in private by many within the security establishment, given the harsh realities of the glacier and the growing challenges of frequent avalanches.\n\n“We have often come so close to finding a solution to the troop deployment, but somehow we never clinched it,” he added.\n\nIn June 1989, both sides announced that “there was agreement by both sides to work towards a comprehensive settlement, based on redeployment of forces to reduce the chance of conflict, avoidance of the use of force and the determination of future positions on the ground so as to conform with the Simla Agreement and to ensure durable peace in the Siachen area.”\n\nEndorsed by Prime Ministers Benazir Bhutto and Rajiv Gandhi in Islamabad, the declaration has been the basic spirit of the bilateral approach towards the Siachen conflict. But no government has shown the political courage to clinch the deal.\n\nIn 1992, the two sides held discussions that narrowed down differences. Since then, India has had an almost consistent set of proposals. The contours of the Indian proposal include delineation of the Line of Control north of NJ 9842, redeployment of troops on both sides to agreed positions after demarcating their existing positions, a zone of disengagement and a monitoring mechanism to maintain the peace.\n\nOver the years, Pakistan has suggested that troops on both sides should withdraw to a point south of NJ 9842, to the pre-1972 Simla Agreement positions. However, it has been reluctant to authenticate ground positions.\n\nMany reports have suggested that in 1992 the two sides had agreed on the Indian points but a final agreement was not signed.\n\nPrime Minister Manmohan Singh in 2005 suggested that the world’s highest battlefield be converted into a “peace mountain” without the redrawing of boundaries. For the Narendra Modi government, in its effort to bring a new vigour to its engagement with Pakistan, demilitarisation of Siachen could be one of the low-hanging fruits to pluck. Otherwise, more soldiers will be killed by avalanches as the world battles rising temperatures and glaciers become more unpredictable.", 
    "section": "national", 
    "title": "Tragedy could trigger demilitarisation", 
    "subsection": "general", 
    "date": "2016-02-07"
}