{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "The project has been stalled for over a decade for a range of reasons\n\nThe Maharashtra government on Thursday cleared the decks for the redevelopment of the 100-year-old Bombay Development Directorate (BDD) chawls in south Mumbai. The project had been stalled for over a decade for a range of reasons, a crucial one being the size of tenements the residents would get after the redevelopment.\n\nOfficials on Thursday changed the 33 (9) clause of the Development Control rules for uniform tenement size and said the tendering process for the redevelopment can begin by end of February, 2016.\n\nThe decision to change the clause came after the Maharashtra Housing and Area Development Authority (MHADA) presented a revised master plan to the State government under the new guidelines of regulation 33 (9) of the Development Control Rules (DCR). Sambhaji Zende-Patil, vice-president, Mhada, proposed three different sizes for rehabilitation tenements for the chawl’s residents — 405 square feet tenements at Naigaon, 502 sq ft at Parel and 511 sq ft at Worli. But the housing department disagreed and, instead, tweaked the 33 (9) clause making the rehabilitation tenement size uniform for all.\n\nThe MHADA has estimated a net profit of Rs 2,791 crore in the redevelopment of 16,203 galas in the 207 BDD chawls sprawled over prime areas of Worli, Parel and Naigaon.\n\nThe total cost of the project has also been scaled to Rs 10,825 crore from its earlier estimate of around Rs 2,000 crore over a decade ago.\n\n“A proposal under the earlier rules of the 33(9) had already been presented to the government but no decision was taken on it, so a new proposal was presented under the DCR 33(9) revised on September 1, 2014,” said an official.\n\nState officials said the changes were made to the master plan by Mhada and now a fresh proposal will be presented to the State cabinet by the Housing Department this month.\n\nCurrently, under clause 33, there are 25 sub-schemes to facilitate redevelopment of old properties and other structures by way of additional floor space index (FSI), such as additional FSI for construction of luxury hotels and construction of multi-level parking spaces. The newly approved proposal will create a 26th sub-clause under DCR 33. The redevelopment plan of chawls spread over 93 acres of land was first mooted by the Mhada in 2004, but it has been stuck at the proposal stage for various reasons.", 
    "section": "national", 
    "title": "100-year-old south Mumbai chawls to get a New Deal", 
    "subsection": "general", 
    "date": "2016-01-08"
}