{
    "author": [
        "M L", 
        "Melly Maitreyi"
    ], 
    "text": "A social enterprise in A.P., Telangana and Uttarakhand strives for the empowerment of marginalised sections\n\nIt’s a welcome break from the monotony of classroom teaching for a bunch of cheerful, sharp-witted adolescent girls engrossed in making a presentation as part of their activity-based special camp.\n\nTasked with presenting the rights they want in their ‘ideal’ country, girls animatedly discuss their ideas in groups. As the gong strikes, team leaders sum up and make crisp presentations in English, at times pausing for the right word but never losing their nerve. Their list includes the right to education, safety, ban on child marriage, gender equality, clean environment, health, et al .\n\nIn the next room, another activity class is on. The topic: ‘My body, My Choice.’ Girls speak on the consequences of early marriage and adolescent pregnancy. Elsewhere, a young counsellor helps the girls see the difference between ‘good touch’ and ‘bad touch’ and the need to overcome teenage temptations.\n\nA 13-year-old says, “In a healthy relationship, there is equality and respect and none should force you to do anything against your wish. Yielding to temptations can mar goals and bring in unwanted consequences”. The above activity classes at Kasturba Gandhi Balika Vidyalaya, Jinnaram and Social Welfare Residential School at Zaheerabad in Medak are part of winter special camps conducted by ‘Voice 4 Girls’ for students of social welfare schools across Telangana. A social enterprise working in three States — Andhra Pradesh, Telangana and Uttarakhand in partnership with Government departments and NGOs — ‘Voice 4 Girls’ has been striving for the empowerment of marginalised adolescent girls since 2012 in Telangana. What is striking is the clarity with which the participants talk about their aspirations, career choices, rights and even what they expect in a democracy. There is nary a giggle when they hear the word ‘sex’ nor when biological changes that occur during puberty are discussed.\n\n‘Parichay’ and ‘Disha’ are special ‘Her Voice’ camps organised twice annually to impart critical knowledge, spoken English, life and problem-solving skills and leadership qualities to help the girls grow up with awareness and confidence, and re-imagine their social roles and future. The USP is that Specially-trained college student counsellors act as mentors and role models at the camps and bond with them. The goal is to reach out to enough girls across India and touch national level indicators — retention in school, child marriage and health, says Anusha Bharadwaj, Executive Director, Voice Team, adding that the girls eventually become peer leaders as ‘Sakhis’ in their schools to train others.\n\nSecretary, Telangana State Social Welfare Residential Institutions Society R.S. Praveen Kumar, who partnered with Voice 4 Girls, is happy with the impact.\n\n“Voice camps liberate students from typical classroom teacher dominance and help them learn from young counsellors in an interactive mode. They help in putting the right ideas at the right time in the young minds, igniting their aspirations and strive to realise them. The outstanding girls in our schools are invariably those who attended these camps.”\n\n“Our idea is to see that each camper evolves into a ‘sakhi’ and a counsellor herself. We are encouraging united Voice Camps since last year to help boys understand their aspirations and help them deal with boys as their equals,” he adds.\n\nClose to 10,000 students of social welfare schools went through the training in Voice Camps in Telangana while Voice overall trained over 25,000 students of marginalised sections.", 
    "section": "national", 
    "title": "A lesson on life for young girls", 
    "subsection": "general", 
    "date": "2016-01-08"
}