{
    "author": [
        "National Bureau"
    ], 
    "text": "The Appointments Committee of the Cabinet chaired by Prime Minister Narendra Modi has appointed Amitabh Kant as the chief executive officer of NITI Aayog. The appointment will take effect after Mr.Kant retires from service in March.\n\nA 1980 batch Kerala cadre IAS officer, Mr.Kant is currently serving as the Secretary in the Department of Industrial Policy and Promotion in the Ministry of Commerce and Industry.\n\nLast Monday, the Cabinet’s Appointments Committee had given Mr.Kant additional charge of the NITI Aayog CEO from January 1, with the extended tenure of the previous CEO Sindhushree Khullar coming to an end on December 31.\n\nIn a fresh order issued on Thursday evening, the Ministry of Personnel said that the competent authority had approved the appointment of Mr.Kant as CEO, NITI Aayog, after his superannuation.\n\n“The terms and conditions of his appointment as CEO, NITI Aayog, will be conveyed in due course,” the ministry said.\n\nMr.Kant, who was earlier the CEO of India’s largest industrial infrastructure project - the Delhi-Mumbai Industrial Corridor Development Corporation – has been the Industry Secretary since March 2014. He has been steering the government’s two major campaigns to attract investments and create jobs – Make In India, which was launched in September 2014, and Start Up India that would be unveiled by Mr.Modi next Saturday Mr.Kant was said to be in the reckoning for a couple of other post-retirement roles, including the chairperson of the Competition Commission of India, whose current chief, Ashok Chawla, retired on Thursday, and a possible role in the proposed National Industrial Corridor Development Authority.\n\nThe IAS officer has been steering the government’s two major campaigns to attract investments and create jobs.", 
    "section": "national", 
    "title": "Amitabh Kant to take over as NITI Aayog CEO", 
    "subsection": "general", 
    "date": "2016-01-08"
}