{
    "author": [
        "P Sujatha Varma"
    ], 
    "text": "Expressing serious concern over what they call growing fundamentalism, violence, religious obscurantism and marginalisation of communities, atheists, humanists, rationalists and freethinkers from across the world raised a collective voice in the valedictory session of the ninth World Atheist Conference here on Thursday.\n\nHosted by the Atheist Centre, Vijayawada, the conference saw participation of activists drawn from across the country besides those coming from nations like Germany, Norway and the U.S. Recognising that scientific outlook and secularism are the need of the hour, they reiterated their demand for a secular state in letter and in spirit, wherein the voice of non-believers is recognised.\n\nAdopting a declaration to this effect, the members said they were concerned about the growing religious indoctrination, poverty, stigma and absence of development that led to ills like extremism and superstition.\n\nThe members also resolved to press for an effective mechanism to challenge claims of miracles as they were against the spirit of modern scientific temper and knowledge.\n\nTheir other demands include quality and ‘secular’ education, steps to encourage exogamous marriages as a way to promote a rational and casteless society. They also vowed to uphold the universal rights of children, women and the marginalised communities.\n\nEarlier, two group discussions running concurrently in the auditorium saw participants deliberating on ‘Youth and Extremism’ and ‘Women and Social Change’.\n\nModerating the debate on the first topic, Vikas Gora, Rotary World Peace Fellow and co-convenor of the conference, said many youngsters who joined the support movements had borne the brunt of decades of state corruption, poor governance, repressive regimes and poor development policies.\n\n“Although they come from various socio-economic classes, they have witnessed or even experienced rising inequality and absence of opportunity to live a life of dignity. From Pakistan to Yemen, violence has worsened this structural injustice and military actions have further fuelled a sense of outrage,” he pointed out.\n\nUrging the need for holistic economic development and psychological counselling of youth on positive and critical thinking, he said they are resorting to violence because they are deliberately not shown a constructive alternative by vested interests.\n\nNau Gora, who facilitated the other session, said religion had always subdued women’s capacities. “Women should be given more economic opportunities and space to voice their concerns,” she demanded.\n\nActivists from across the world come together in a conference hosted by Atheist Centre", 
    "section": "national", 
    "title": "Atheists & freethinkers unite in their call for rationalism", 
    "subsection": "general", 
    "date": "2016-01-08"
}