{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Commissioner says NGO failed to remove ‘anti-corruption’ tag from its name\n\nAnti-corruption activist Anna Hazare received a setback on Thursday after the Pune Joint Charity Commissioner issued an order suspending the Board of Mr. Hazare’s anti-corruption NGO, Bhrashtachar Virodhi Jan Andolan Nyas (BVJAN).\n\nHowever, the septuagenarian crusader’s office in Ralegan Siddhi in Maharashtra’s Ahmednagar district said the Commissioner had leaked the news to sections of the media instead of informing the BVJAN about the directive first.\n\n“It appears to be a stunt … we are yet to receive the formal order. We will definitely contest the matter in the Bombay High Court,” said Mr. Hazare’s lawyer, Milind Pawar.\n\nMr. Hazare said the government should not harass NGOs like the BVJAN with a proven track record for fighting corruption.\n\n‘Government’s job’\n\nEarlier in June, Mr. Hazare opposed the Maharashtra government’s directive prohibiting non-governmental organisations from using the words ‘anti-corruption’ or ‘corruption eradication’ in their names following allegations of “dubious activities” by such NGOs.\n\nJoint Charity Commissioner (Pune) Shivkumar Dighe had issued notice to 15 NGOs to strike off references to the word ‘corruption,’ the ‘anti’ prefix to corruption and affixes signifying the weeding out of corruption from their names.\n\nThe order had said that rooting out corruption “was the government’s job” and “not the business of so-called anti-corruption NGOs.” It further directed the NGOs to rename themselves.\n\n“The BVJAN had been issued with a notice to rename itself in June last year, but they have not done so. Hence, we have issued the order to disband the trust’s Board,” Mr. Dighe said.\n\nDubbing the diktat permitting only official bodies and not NGOs to use the ‘anti-corruption’ tag “ludicrous,” Mr. Hazare had said that the move was utterly unjust to those NGOs who had been doing exemplary work in tackling corruption, especially in areas where the government had failed to do so.", 
    "section": "national", 
    "title": "Board of Hazare’s NGO suspended", 
    "subsection": "general", 
    "date": "2016-01-08"
}