{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Central Bureau of Investigation has filed a charge sheet against 11 former officials of UCO Bank and two directors of a private firm for allegedly cheating the bank of Rs.36 crore by sanctioning a loan through fraudulent means.\n\nThe agency alleges that Ashok Kumar Rathi and Kishore Rathi, directors of the Nagpur-based Maven Industries Limited, entered into a conspiracy with the accused officials holding key posts in UCO Bank, to get the loan sanctioned.\n\nThe accused were then also running a company named Maven Fats and Proteins Private Limited.\n\n“Among those accused were two UCO executive directors, Bijay Kumar Dutta and Virendra Dhingra, and nine other officials of the general manager, deputy general manager and assistant general manager ranks,” said a CBI official.\n\nIt is alleged that the officials wilfully overlooked the procedures and safeguards to favour the private company and sanctioned the loan of Rs.36 crore. “The firm siphoned off the money, resulting in huge losses to the nationalised bank,” said the official.\n\nThe CBI has invoked various provisions of the Prevention of Corruption Act and the Indian Penal Code against the accused persons.\n\nAs part of its campaign against wilful default of loan sanctioned by nationalised banks, the agency has registered over 30 cases.\n\nA large number of cases of misuse of the corporate debt restructuring scheme have also come to light. According to government statistics, about 33 per cent of the restructured debt worth Rs.67,000 crore till June last year had failed.\n\nTill March last year, the total outgo of nationalised bank loans stood at Rs.70 lakh crore, while 11 per cent of it — amounting to Rs 7.7 lakh crore — is believed to have been classified as “stressed assets”.\n\nThe total estimated non-performing assets were about Rs.2.67 lakh crore and 22 per cent of the amount involved wilful default.", 
    "section": "national", 
    "title": "CBI chargesheets 11 former officials of UCO Bank", 
    "subsection": "general", 
    "date": "2016-01-08"
}