{
    "author": [], 
    "text": "Joint team of forces aims to ensure that no terrorists are hiding in the area\n\nThe operation to fully sanitise the Pathankot airbase, which was attacked by six terrorists last Saturday, is “close to completion” on Thursday with personnel of the National Security Guard, the Army and the Garud force of the Air Force undertaking the task on the sprawling complex.\n\nMeanwhile, the National Investigation Agency has recorded the statements of Superintendent of Police Salwinder Singh, whose role is under the scanner, and his friend Rajesh Verma, officials said adding investigations were under progress.\n\nThe 20-member NIA team is being assisted by a team of the Central Forensic Science Laboratory which is camping here.\n\nThe sanitisation operation, which has been going on for the last two days ever since the six terrorists were gunned down, is in the last leg now.\n\n“For the last two days, the Army, the NSG and the Garuds have been sanitising the whole station and the process is close to completion,” Air Officer Commanding, Pathankot IAF Station, Air commodore J.S. Damoon told reporters here on Thursday.\n\n“The combing operation is aimed at ensuring that no terrorists are still hiding and there are no booby traps. Looking back at the events of the last six days,” he said “a few things stand out.”\n\nAmong them, he said, was the use of air assets for surveillance to ensure early detection, isolation and subsequent engagement of the terrorists. “The timely and precise intelligence inputs and positioning of the NSG troops in real quick time in domestic area, where our families reside which is akin to urban environment, ensured that the station was able to organise its defences before the terrorists could strike,” said the officer in charge of the airbase. — PTI", 
    "section": "national", 
    "title": "Combing operations reach last lap", 
    "subsection": "general", 
    "date": "2016-01-08"
}