{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "There is no concrete material evidence to prove direct involvement of accused\n\nAkhlaq, a resident of Bishahra village in Dadri, was lynched on September 28, 2015, allegedly due to rumours about him having killed a cow and eaten beef.— FILE Photo: Prashant Nakwe\n\nThe charge sheet of the Dadri lynching case mentions 15 accused who allegedly lynched Mohammad Akhlaq on suspicion of killing a cow, but there is no concrete material evidence which could prove their direct involvement, shows the case diary, a copy of which is with The Hindu .\n\nInterestingly, the case diary does not have statement of any witness outside the family of Akhlaq, the resident of Bishahra village in Dadri who was lynched on September 28, 2015, allegedly by his own neighbours due to rumours about him having killed a cow and eaten beef.\n\nThe priest of the village temple, Sukhdas Mahatma, who allegedly announced from the temple loudspeaker about cow slaughter by Akhlaq, has not been made a witness.\n\nMahatma is the only key witness who is not Akhlaq’s family member. He had later told the media that two youths had on the night of September 28, 2015, pressured him to announce from the loudspeaker of the village temple that Akhlaq had slaughtered a cow, asking the villagers to gather outside Akhlaq’s house.\n\nThe priest later mysteriously disappeared. While some said he left for his village in Saharanpur, police personnel who visited his village, failed to trace him.\n\nAkhlaq’s lawyer, Yusuf Saifi, plans to file an application in the Greater Noida court, where the case is under trial, to request the Chief Judicial Magistrate to call the priest, as an accused in the case.\n\nThe charge sheet lists Akhlaq’s wife, mother, daughter and son as primary witnesses. The other 21 witnesses include police officials and medical staff. It was on the identification by Akhlaq’s family members that the police listed 19 accused in the case.\n\nThe only material evidence mentioned in the charge sheet are the weapons recovered by the police in the aftermath of the lynching. As per the recovery memo, weapons allegedly used by the accused Rupinder, Om, Sandeep, Saurav and Gaurav, include five sticks, of which three are smeared with blood. Two iron rods with blood stains are also recovered. But these weapons did not go through forensic tests.\n\nThe case diary quotes Akhlaq’s neighbours as telling the police that they were sleeping while he was lynched.\n\nThe investigation, as it is mentioned in the case diary, declares the lynching case to be a case of spontaneous reaction of people when the rumour about cow slaughter spread in the village.", 
    "section": "national", 
    "title": "Dadri lynching case diary reveals shoddy probe", 
    "subsection": "general", 
    "date": "2016-01-08"
}