{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "West Bengal has surpassed rest of the country in elector-population ratio. The updated voter list for the year 2016 published by the Election Commission of India earlier this week, points that the elector-population ratio stands at 0.68.\n\nThe same ratio in 2011, when the State went to Assembly polls, was 0.63. Thus when compared to the 2011 Assembly polls, five more voters in a population of every 100 citizens will be eligible to cast votes when the State goes to polls this year.\n\nSaibal Barman, Joint Chief Electoral Officer, West Bengal said: “In 2009-2010, the elector-population ration in the State was 0.56. The State has surpassed the national average of .66.”\n\nBiswnath Chakraborty, professor of Political Science at Rabindra Bharati University, who is also a psephologist, pointed out that one of the reasons why such a high elector-population ratio has been achieved was good representation of voters who are in the age group of 18-19 years. The percentage of voters in this category comprises of 3.17 per cent of the overall voter list.\n\nNew voters\n\nIn terms of absolute numbers, the new or first time voters in the electoral rolls stands at 20.4 lakhs. “More than the new voters of the cities, it is the new voters from the rural areas who have featured prominently in the updated voter list,” he added.\n\nAnother rise for the high elector-population ratio is because of addition of more female voters in the electoral rolls.\n\nThe final electoral roll for 2016 with 6.55 crore voters has 3.39 crore male and 3.16 crore female voters. The gender ratio of electors stands at 933 women for 100 male voters. Officials of the ECI said that the number of female voters in 2012 was 905 for every 1,000 male voters.\n\nThe figures indicate that during the upcoming Assembly polls, more female voters and new electorate will cast their vote.", 
    "section": "national", 
    "title": "Elector-population ratio: West Bengal tops the list", 
    "subsection": "general", 
    "date": "2016-01-08"
}