{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A student group from Harvard College is organising its second annual Harvard U.S.-India Conference here on January 8 and 9. The conference aims at fostering long-term relationships among young leaders around the globe, creating dialogue between students on issues related to India, and providing resources for social entrepreneurship.\n\nThis year, delegates will discuss the Right of Children to Free and Compulsory Education Act, the rise of intolerance in politics and the judiciary’s role in protecting national interest, in addition to a range of other subjects relevant to India’s economic and social development.\n\nWith about 50 members in its organising team, the conference is predominantly managed by students. The team comprises students from Harvard College and other prestigious colleges in both the United States and India, including New York University, Wellesley College, Shri Ram College of Commerce and IIT Kanpur.\n\nSpeakers will include Raghuram Rajan, economist and Governor of the Reserve Bank of India; Shashi Tharoor, MP from Thiruvananthapuram and former Union Minister of State for HRD and External Affairs. Also speaking at the conference are Piyush Goyal, Union Minister of State for Power, and Shaheen Mistri, founder of the Akanksha Foundation and CEO, Teach for India.\n\nThe conference will be attended by over 375 delegates from various walks of life, comprising young professionals in India, undergraduate and graduate students at various colleges in India and the US, as well as a hundred high school students from across the country.\n\nWhile the panels enable students to participate in several discussions on critical issues with some of India’s best minds and leaders, the conference also features essay sessions, photography, case competitions, and networking events.\n\n“The aim is to push students to think bigger, dig deeper, challenge beliefs, and come out of this conference better informed and prepared to tackle India’s problems,” says Disha Verma, a former president of the conference.\n\nThe conference is powered by The Hindu .\n\nDelegates will discuss the Right\n\nof Children to Free and Compulsory Education Act", 
    "section": "national", 
    "title": "Harvard U.S.-India meet in Mumbai this weekend", 
    "subsection": "general", 
    "date": "2016-01-08"
}