{
    "author": [], 
    "text": "Coinciding with the Bengal Global Business Summit, photo and video sharing app Instagram on Thursday started its first-ever photograph exhibition in India that showcases the diversity of West Bengal.\n\nCrowdsourced from a group of 17 active Instagram users who come from various age groups and diverse backgrounds, the photos convey the multiple facets of life unique to the State.\n\nExpansion soon\n\n“This is our first photo exhibition in India. We are starting from Kolkata because of its heritage and culture. We are planning more such community-centric events in other States to actively engage our users,” Ankhi Das, Public Policy Director of Facebook, said.\n\nShe said in Kolkata they have aligned the timing of the three-day exhibition at the ICCR gallery with the business summit so that anyone who comes from outside can get a slice of life in the city just by seeing the Instagram photo gallery.\n\nThe two-day business summit aimed at attracting investments in the State begins on Friday. The visuals are of beautiful landscapes, people, food, festivals, wildlife, architecture among others.\n\nFacebook officials worked with the local community ‘Instagram Calcutta’ (@ig_calcutta) to curate images that reflected the theme of diversity in Bengal.\n\nInstagram, owned by social media giant Facebook, has around 400 million users all over the world and 80 million photos are posted on the app every day.\n\nGrowing market\n\n“Asia is our largest growing market and in India our users have been doubling every month,” Ms. Das said, adding that the increase is due to the rise of the number of smartphones and the awareness on the impact that photos can have.\n\nDescribing Instagram as a photo-sharing platform, the official said, “Everyone can become a photojournalist now by sharing what is happening around them.” — PTI", 
    "section": "national", 
    "title": "Instagram photo exhibition showcases beauty of Bengal", 
    "subsection": "general", 
    "date": "2016-01-08"
}