{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Move aimed to avoid duplication of work, says govt.\n\nA substantial work of MOIA is done through our missions abroad, says Sushma Swaraj.\n\nIn order to avoid duplication of work and to improve efficiency, the government on Thursday merged the Ministry of Overseas Indian Affairs (MOIA) with the Ministry of External Affairs.\n\nAnnouncing the merger, External Affairs Minister Sushma Swaraj tweeted on Thursday, “As Minister of External Affairs and Overseas Indian Affairs, I realised that a substantial work of MOIA is done through our missions abroad. Therefore, I proposed to Hon’ble Prime Minister that MOIA should be merged with the Ministry of External Affairs.”\n\nSources, however, indicated that the decision to merge MOIA with MEA was taken as senior diplomats wanted officials dealing with foreign workers-related issues and emergencies to have better diplomatic back-up and coordination.\n\nExplaining the official line, a spokesperson of MEA said the merger of MOIA was to avoid “duplication” as most of the work of MOIA was done by Indian missions abroad. “Even the information for answering the questions related to MOIA in Parliament used to be provided by the Indian missions,” said the spokesperson. But reportedly, the MEA, which has been short of staff, wanted greater number of officials with diplomatic experience in key positions in MOIA to deal with emergencies involving Indians in various crisis-prone countries in West Asia. The merger is expected to increase efficiency in MEA’s emergency work abroad.\n\nSources told The Hindu that MEA wanted the key operational posts, including that of the Protector General of Emigrants, one of the most important offices in MOIA, to have diplomatic focus.\n\nThe post of Protector General of Emigrants is responsible for issuing registration certificates to recruitment agents who send workers abroad, especially to the Gulf region.", 
    "section": "national", 
    "title": "Ministry of Overseas Indian Affairs merged with MEA", 
    "subsection": "general", 
    "date": "2016-01-08"
}