{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The spirit of reconciliation, of mainstreaming Kashmir’s democratic politics and relentlessly engaging with separatist movements in the State, characterised the long political career of Jammu and Kashmir Chief Minister Mufti Mohammad Sayeed, who passed away here on Thursday. Another highlight was that he joined hands with a spectrum of political forces in that effort.\n\nHis opponent, National Conference leader Farooq Abdullah, termed him the “great manipulator” in an interview to The Hindu in November, while his supporters called it conciliation.\n\nOne of the last speeches that Mr. Sayeed delivered was at the India Ideas Conclave organised by the RSS-backed India Foundation in Goa in November. Departing from the prepared text, Mr. Sayeed, who became the Chief Minister of J&K for the second time with the support of the BJP in March 2015, described the unlikely alliance thus: “There was no comparable template from the past from where lessons could be drawn, where two such different partners had to form a government. When I looked at the mandate, it was clear that reconciliation had to take place.”\n\nBorn on January 12, 1936, in south Kashmir’s Bijbehara town, Mr. Sayeed spent the formative years of his political career in the Congress. He made his debut in 1962 from Bijbehera, after being nominated by the National Conference led by Bakshi Ghulam Muhammad, who enjoyed the patronage of Jawaharlal Nehru.\n\nIn 1967, he was appointed Deputy Minister of Agriculture and Cooperative by Mr. Bakshi’s successor, Ghulam Mohammad Sadiq. The same year people saw the first glimpse of Mr. Sayeed’s political skill — he secretly joined Mr. Sadiq’s main political rival, Syed Mir Qasim, to topple the government. The bid was scuttled by the then Prime Minister Indira Gandhi.\n\nThe following years, Mr. Sayeed spent making his way into the Congress. Makhanlal Fotedar, a senior Congress leader, told The Hindu that he introduced Mr. Sayeed to the Congress high command in New Delhi, which included Indira Gandhi. “He quietly moved to the relevant circles,” he said, adding that Mr. Sayeed became indispensable as Indira Gandhi would consult him on Kashmir affairs.\n\nOver the course of his political career, Mr. Sayeed changed several sides. He joined the Congress in late 1960s, then moved to the Janata Dal in 1988, which chose him as Home Minister after he won the Lok Sabha elections in 1989 from U.P.’s Muzaffarnagar constituency. His tenure was marred by the kidnap of his daughter Rubaiyya Sayeed by militants.", 
    "section": "national", 
    "title": "Mufti’s political nous found expression in conciliation", 
    "subsection": "general", 
    "date": "2016-01-08"
}