{
    "author": [], 
    "text": "The NDA government has not moved fast enough on important reforms and has even failed to deliver on those it had promised, Nobel laureate Amartya Sen said in an interview to TCA Sharad Raghavan , adding that this government has done more than the UPA government in removing unfruitful subsidies.\n\nProfessor Sen also argued that, at a time when around half of India doesn’t have access to schools, focusing on the controversial Free Basics programme by Facebook is a mistake. Excerpts:\n\nDo you approve of the direction economics is headed in? What are the major lessons India needs to learn?\n\nI think there are many changes taking place and a number of them one must approve of. There are a number of changes linking theory with empirical observations, that’s a positive thing. There is much greater interest in not seeing analytical mathematical economics as a separate discipline from normal non-mathematical reasoning because we have to put them together. I am in favour of all of them.\n\nBut I think the important thing to recognise is that there are many lessons from traditional economics which have not been sufficiently well absorbed in policy making, for example, in India.\n\nOne is the lesson that you need a successful market economy for continued fast growth and development. That is being absorbed but even now I have to say that the NDA government has been too slow with the reforms and has not carried out the reforms they promised they will.\n\nSecondly, while the market economy does well for industries and agriculture, by and large, with a few exceptions, it does not do well for education and healthcare. There you need the government to come in in a big way. And that has been neglected and not much has happened on that. The UPA government was an underperformer and the NDA government is even more of a disaster.\n\nThe third point is the issue of asymmetric information: the fact that quite often the buyers don’t know what the seller is selling. This is a very important part in the understanding of any market economy and which is why the idea that you could privatise healthcare at a basic level without first providing public health is something that will not be possible in India.\n\nIndia is the only country which is trying to get universally educated and universal healthcare through the private sector. Japan, U.S., Europe, China, Vietnam, Cuba, Hong Kong, Singapore, whether they are politically right or politically left, they all saw the importance of the state in making education and healthcare widely spread and universal.\n\nDo you still think that the Keynesian approach to economics is still relevant today?\n\nWell, it’s relevant to many countries in the world, if by Keynesian you mean general theory. I think the insights of Keynesian economics were badly neglected in Europe and also somewhat neglected in the Republican-dominated Congress, but not ignored by the Federal Reserve system.\n\nNow, we (India) may have made many mistakes, but neither the UPA government nor the present policies under Raghuram Rajan could be accused of ignoring these facts. I think the insights have been fairly well absorbed in India.\n\nWe’re nearing on two years of the NDA government, with schemes like Skill India, Jan Dhan Yojana and the various insurance schemes already in effect. How would you rate the government’s performance so far?\n\nI thought that the idea that development is only a matter of successful planning of financial investment rather than building up the capability of human beings through education, healthcare and social security, I was grumbling about that. Now, that wasn’t only at the end of the first year, it was also at the beginning of the first year. That was their policy and it still is.\n\nEducation and healthcare were badly neglected by the previous UPA government and they are even more badly neglected by the NDA government now.\n\nThe basic thing that ails the Indian people is lack of education, lack of healthcare and lack of social security. And no matter how extraordinarily innovative-sounding these new schemes may be, it is not going to take away from the fact that with an unhealthy, uneducated labour force, it is very difficult to generate income from them and very difficult for solidly-shared development growth at a high level to continue.\n\nThe government has carried out Direct Benefits Transfers in LPG subsidies and in MGNREGA wages. Do you think that is a system that works and should it be extended to the rest of the PDS?\n\nWell, the LPG subsidy removal is something I have been recommending again and again in my last book, that you should remove all LPG subsidies. They haven’t done that yet. They ought to do all of it. There is still subsidised electricity, where parts of India don’t even have a power connection, but those who have it get it at a subsidised price, which I don’t think is a very good idea. These have to be changed.\n\nBut the NDA government under Jaitley has done more in removing these subsidies than the UPA government did.\n\nMGNREGA is a much more complicated story and they were very critical of it before but they seem to have embraced it now.\n\nBut the direct transfer of subsidies to bank accounts, is that sustainable and workable?\n\nWell, it has some positive things and some negative things. For example, if there is a gender bias. If you send the subsidy to the family, then the people more likely to benefit are the boys rather than the girls. And if you did it with a more on-kind transfer, that’s unlikely to happen.\n\nSo there are positive and negative elements in it. I can see why it is attractive and I also see what the limitations of that are.\n\nAnd what do you think about Facebook’s Free Basics?\n\nYou know, in a country where half the population doesn’t have a school to go to, to concentrate on the Internet is a bit of a mistake.\n\n(For full text of the interview visit:\n\nhttp://bit.ly/1PLPUfs)\n\nIndia is the only country which is trying to get universal healthcare through the\n\nprivate sector\n\n“What ails the people is lack of education, healthcare and social security”", 
    "section": "national", 
    "title": "NDA govt. has been too slow with reforms and has not carried out those it promised", 
    "subsection": "general", 
    "date": "2016-01-08"
}