{
    "author": [
        "Mohit M"
    ], 
    "text": "Karnataka Bird Festival starts in this forest in Uttara Kannada district today\n\nThe second Karnataka Bird Festival starting Friday promises a field day for birdwatchers at the newly named Kali Tiger Reserve in Uttara Kannada district, with over 300 species of birds in its verdant forests.\n\nCeylon frog mouth with its plumage resembling dry leaves, the colourful great hornbill and Malabar pied hornbill — both with distinctive beaks — that have become synonymous with the reserve, the bright-blue verditer flycatcher, the melodious white-rumped shama, and the distinctive white ring around the belly of the Malabar trogon are among the species birdwatchers can look forward to seeing in the sprawling tiger reserve.\n\nThe three-day event, with the Kulgi nature camp as base, will see guided bird walks, documentary screenings, and workshops on bird photography, among others.\n\n“We expect over 170 professional birders and academics over three days. Deliberations will be held on how to plan conservation projects for the bird population in the park,” said Srinivasulu K., Chief Conservator of Forests and Director of the reserve.\n\nC.R. Naik, Deputy Range Forest officer, who since 2007 has been involved in the research on hornbills, said the population has seen a stark increase in the past decade, particularly since the hornbill conservatory was set up in the region.\n\n“In places like Ganeshgudi, it would be easy to spot flocks of more than 100 hornbills. The creation of non-disturbance areas for these birds has had a positive impact,” he said.\n\nThe thriving flora in the forests have set up an ideal nesting ground for these birds — with some hornbills having been recorded to gorge on 168 fruits during a feeding session, he said.\n\nCeylon frog mouth, verditer flycatcher and the Malabar trogon have been spotted here", 
    "section": "national", 
    "title": "Plumes not just stripes in this Reserve", 
    "subsection": "general", 
    "date": "2016-01-08"
}