{
    "author": [], 
    "text": "Lead character in American thriller series receives wide recognition\n\nPriyanka Chopra poses at the People’s Choice Awards ceremony in Los Angeles on Wednesday.— Photo: Reuters\n\nBollywood actress and former Miss World, Priyanka Chopra, has won the ‘Favourite Actress in a New TV series’ award at the People’s Choice Awards 2016 in Los Angeles, for her leading role in American TV thriller series Quantico .\n\nThe 33-year-old, who plays the role of an FBI agent named Alex Parrish in the show, was competing against actresses like Emma Roberts, Jamie Lee Curtis, Lea Michele and Marcia Gay Harden in the category.\n\nHollywood actor Vin Diesel presented her with the award on Wednesday evening. Priyanka is said to be the first South Asian actress to win a People’s Choice award.\n\nQuantico co-writer Sharbari Ahmed posted on Twitter: “Congratulations @priyankachopra! the FIRST South Asian Actress to win a PCA”.\n\nCurrently in its 42nd edition, the popular American awards show recognises the people and the work of popular culture, where votes are given by the general public.\n\nAfter winning the award, Priyanka took to Twitter to thank all for supporting her in her debut TV series. “I am so fortunate! Thank you to everyone who voted for me at the #PCAs! My #PCManiacs — I am nothing without you! Big love,” she tweeted, alongside a photograph of herself with the trophy.\n\nPriyanka donned a glittering gold-and-silver dress, designed by American fashion designer Vera Wang, at the awards gala. Her make-up was done by Stephanie Barnes.\n\nPriyanka will next be seen onscreen in Jai Gangaajal , which is slated to release on March 4.\n\nAfter wining the award, she was flooded with congratulatory messages from the members of Indian film fraternity that included Nimrat Kaur, Anil Kapoor, Anushka Sharma, Huma Qureshi, Prakash Jha and Shekhar Kapur.\n\nNimrat, who played a pivotal role in the American TV series Homeland , tweeted: “Brilliant and so incredibly well deserved! So so proud of this tigress! ”\n\nAnil wrote: “And the People have made their choice! Congrats @priyankachopra on winning”, while Anushka shared: “Hey @priyankachopra congratulations on the win! So proud of you! Keep rocking yaow”. — IANS", 
    "section": "national", 
    "title": "Priyanka Chopra’s Quantico role earns her People’s Choice Award", 
    "subsection": "general", 
    "date": "2016-01-08"
}