{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "BJP leader Shatrughan Sinha’s biography says he had predicted Arvind Kejriwal’s Aam Admi Party winning 63 of the 70 seats in Delhi in 2015. He admires Mr. Kejriwal’s courage in standing against Sheila Dikshit in 2013 and defeating her.\n\n“I would credit Arvind Kejriwal with showing rare courage in fighting only one seat and that too against a heavyweight like Sheila Dikshit,” he says in the book Anything But Khamosh (Anything But Silent).\n\nSignificantly, the reference comes just after his statement that his mentor L.K. Advani’s decision to fight from two Lok Sabha seats in 1991 was perceived as a sign of “weakness.”\n\nHe says people from the AAP had approached him in 2014, a time when there was a long suspense on whether he would get the BJP ticket from Patna Sahib.\n\nIn the chapter on politics, Mr. Sinha is critical of many within his own party, even as he candidly admits he is on friendly terms with leaders like Nitish Kumar of the JD(U) and Lalu Prasad of the RJD. He rues that “Johnnies-come-lately” had become Ministers in the Modi government.\n\nMr. Sinha claims that he first gave the title ‘Namo’ to Mr. Modi and that he always accepted the latter’s “strengths” as a leader.\n\nHe, however, alleges a conspiracy within the party in 2014 to deny him a Lok Sabha ticket from Patna Sahib, which he eventually contested and won by a huge margin. “The dirty tricks department tried to keep me away from the electoral fray.” But he would have stood as an independent, had he not been given a ticket, he says.\n\nMr. Sinha also accuses Bihar BJP leader Sushil Modi of opposing his candidature from his constituency. “Sushil Modi contributed much to the growth of the party in Bihar… But later I learnt about the other side of Sushil Modi. I am told that till the end, he strongly opposed me and fought against my getting the ticket from Patna,” he says. “My popularity and clean image… made him very insecure, although I have always maintained that I am not interested in being Chief Minister of Bihar.” About the 2015 Bihar polls — when he was “sidelined” – he says he had warned that rising food prices would take a toll on the BJP. He also suggests that his sidelining was one of the reasons for the BJP’s dismal loss in Bihar.", 
    "section": "national", 
    "title": "Shatrughan’s book praises Kejriwal", 
    "subsection": "general", 
    "date": "2016-01-08"
}