{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The party won 60 out of 74 districts; embarrassment for BJP in Varanasi\n\nThe ruling Samajwadi Party in Uttar Pradesh thumped all opponents in the zilla panchayat chairman elections to claim 60 out of 74 districts.\n\nThe SP candidates were elected in 24 districts in addition to the 36 districts where its candidates won unopposed.\n\nThe BJP was embarrassed in Varanasi as SP candidate Aparajita Sonkar defeated the BJP-Apna Dal combine candidate Amit Kumar Sonkar in Prime Minister Narendra Modi’s constituency. In Congress vice-president Rahul Gandhi’s constituency, Amethi too, the SP tasted victory. The party’s candidate was elected unopposed after the Congress candidate Krishna Chaurasiya withdrew nomination, embarrassing the party.\n\n“Ignoring the baseless allegations the Opposition levelled against Akhilesh Yadav, the SP’s win displays the faith people have in his leadership. People have given approval to Mr. Yadav’s development agenda,” SP spokesperson and Cabinet Minister Rajendra Chaudhary said.\n\nOut of the 74 districts, 44 were won by women candidates, including Mulayam Singh’s niece Sandhya Yadav, who was elected unopposed from Mainpuri. Mr. Singh’s nephew Abhishek Yadav alias Anshul Yadav was also elected unopposed from Etawah. In Unnao, two candidates secured 26 votes each and the winner was eventually declared by a lottery.\n\nWhile the BJP and its allies claimed victory in five districts, including Muzaffarnagar and Shamli, the BSP claimed four chairman posts and the Congress and the Rashtriya Lok Dal got one each. The Congress’ lone chairman, Avdesh Pratap Singh, was elected in its bastion Rae Bareli.\n\nThe build-up to the elections saw the ruling SP take stern action against dissenters, expelling and suspending several members, including sitting MLAs. The party also replaced candidates frequently. In the end, it faced minor embarrassment in two districts, Sitapur and Bijnore, where SP rebels defeated the party candidates. Jitendra Yadav, son of rebel SP MLA Rampal Yadav, who was suspended recently for anti-party activities, defeated the official SP candidate Seema Gupta. Mr. Jitendra Yadav had been expelled from the SP. In Bijnore, suspended MLA Ruchi Veera’s husband Udhyan Veera defeated the SP candidate Neelam Paras by a single vote. Mr. Veera was supported by the BJP.\n\nThe BJP alleged that the SP misused the State machinery to win the elections. Putting up a brave face, BJP State chief Laxmikant Bajpai said the SP had “crossed all limits of anarchy” to “capture all the seats” but could not prevent the BJP from securing some.", 
    "section": "national", 
    "title": "SP sweeps zilla panchayat chairman polls in U.P.", 
    "subsection": "general", 
    "date": "2016-01-08"
}