{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The papers, published by researchers from Jawaharlal Nehru University, claim that Indian farmers use banned pesticides for crop protection.\n\nThe Crop Care Federation of India (CCFI) and Indian Council of Agricultural Research (ICAR) have raised questions about the authenticity of two research papers published by researchers from Jawaharlal Nehru University, regarding Indian farmers using banned pesticides for crop protection.\n\nAddressing a press conference here on Thursday, CCFI’s chairman Rajju Shroff said: “We have urged the President of India to order an inquiry into the two studies that are a part of a Ph.D. thesis work and have been published abroad. We have asked the university to share the laboratory data under the RTI, but it’s not being shared, raising doubts on the authenticity of these studies.”\n\nThe two studies on which the inquiry is being sought are: “Assessment of the concentration, distribution and health risk of organochlorine pesticide in Momordica charantia grown in Periurban region of Delhi, India” and “Health risk assessment of organochlorine pesticide exposure through dietary intake of vegetables grown in the periurban sites of Delhi, India”.\n\nK.K. Sharma, national co-ordinator, All India Network Monitoring Pesticides Residues, ICAR, said the findings in these studies were in stark contrast to those by laboratories functioning under the ICAR and accredited by the National Accreditation Board for Testing and Calibration Laboratories.\n\n“We (ICAR) have sent three letters to the university demanding raw data. But, the latter is still dodging,” he said.\n\nHe said that the ICAR’s monitoring studies found vegetable samples carrying 2-3 per cent of pesticide residues above the maximum residue limits (MRL) while the university study claimed 100 samples exceeding the MRL.\n\n“Such studies, published outside India, negatively affect the image of the Indian agriculture industry. It is an accepted protocol and mandatory for any laboratory to maintain all laboratory records including gas chromatography readings for challenge inspection and verification post-publication,” he said, adding that the citizens of the country had the right to seek the laboratory data.\n\nFarmer leader Krishenbir Chaudhary said farmers in India adopted best farming practices and it was wrong to say that they used banned pesticides.\n\nFarmer leader\n\nK. Chaudhary said that farmers in India did not use banned pesticides", 
    "section": "national", 
    "title": "Studies on use of banned pesticides questioned", 
    "subsection": "general", 
    "date": "2016-01-08"
}