{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "40 protesters were allegedly manhandled and detained by the Pune police\n\nFTII students raised slogans near the institute entrance, before they were taken away by the police on Thursday.— PHOTO: pti\n\nSeething discontent, frenzied protests and lathicharges marred TV actor Gajendra Chauhan’s first day as Chairman of the prestigious Film and Television Institute of India (FTII) even as 40 student protesters were allegedly manhandled and detained by police.\n\nWith flaming banners proclaiming ‘Chauhan go back’, ‘Silent Emergency’ and ‘Tyranny of the Elected’, the FTII campus, which has seen an ominous lull since the culmination of the 139-day strike by students in late October last year, erupted into a full-blown melee on Thursday morning as city police were seen dragging student agitators into vans. The protesters were being held at the Shivajinagar police station as the first meeting of the new FTII society got under way almost six months after its reconstitution.\n\nStudents claimed that police resorted to violence despite “being fully aware of a silent protest” about to take place against the contentious appointments of Mr. Chauhan and Sangh Parivar propagandists Anagha Ghaisas, Narendra Pathak, Rahul Solapurkar and Shailesh Gupta in the reconstituted FTII Society.\n\nThe Deccan police issued notices to 17 students on Wednesday urging them to refrain from any act of protest, while warning them against attempts to “disrupt the peace on the campus”. Police authorities on the spot justified their actions, stating they were compelled to remand the agitators as they refused to peacefully pave the way for the FTII society members attempting to enter the campus. The agitators were later released .\n\nThe latter part of the day proceeded uneventfully as Mr. Chauhan presided over the first meeting of the newly-constituted Governing Council since his official appointment in June 9 last year.", 
    "section": "national", 
    "title": "Student protests welcome Chauhan as he takes charge as FTII Chairman", 
    "subsection": "general", 
    "date": "2016-01-08"
}