{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "A member of the local government drinking tea from a paper cup while it is served in porcelain cups to Telangana Forest Minister Jogu Ramanna (extreme right) and MP G. Nagesh at a recent meeting in Adilabad.— Photo: Special Arrangement\n\nAlthough the worst forms of discrimination have been jettisoned by society at large, it still exists in many forms in the act of serving tea and snacks during government meetings, for instance.\n\nMinisters, MLAs, Collector and other ‘dignitaries’ who officiate at meetings are served tea in porcelain or ceramic cups while the beverage is handed over to subordinate officials and non-officials in disposable paper cups.\n\n“The VIPs are even served costly dry fruits while we are given plain biscuits for a snack,” pointed out Githe Keshav, Zilla Parishad Territorial Constituency member from Gudihatnoor, who is among those who have taken objection to what they call a discriminatory practice. “We have decided to represent the matter to the authorities,” he said. “It is just to denote heirarchy,” stated R. Aravind Kumar, the Administrative Officer at Adilabad Collectorate whose job it is to organise official meetings of the Revenue Department.\n\n“It is an old practice,” he added of the official position on the issue.\n\nThe Civil Society organisation in Adilabad, however, is in no mood to dismiss the trend lightly. “It may look trivial but the custom has a demoralising effect on subordinate staff,” stated S.P. Pataskar, a retired tahsildar.\n\n“Meetings should be held in an atmosphere wherein subordinate staff are not bogged down psychologically,” Mr. Pataskar said. “Simple things like exhibiting equality, which can be done by doing away with serving tea in different cups, can be a morale boosting exercise.”\n\nAmong the non-officials who regularly face the discrimination are media persons. “It certainly seems unfair to drink tea from paper cups while top officials and leaders enjoy a sip from lovely beakers,” says A. Srinivas Rao, a senior journalist.\n\nTea is served to officials and others in cups of different quality based on their status", 
    "section": "national", 
    "title": "Two-cup system in Adilabad offices to ‘denote hierarchy’", 
    "subsection": "general", 
    "date": "2016-01-08"
}