{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "The Union government reached out to the Congress yet again on Wednesday to get the Goods and Services Tax Bill passed soon, with Union Parliamentary Minister Affairs M. Venkaiah Naidu meeting Congress president Sonia Gandhi and offering to advance the Budget Session of Parliament. He also sought support for passing the Real Estate Bill.\n\nHowever, Congress leader Kapil Sibal dismissed the gesture as “all optics” within hours, and the war of words worsened as BJP secretary Shrikant Sharma retorted that the Congress was more interested in the “protection of its ruling family\" than the GST.\n\nWhen Ms. Gandhi asked Mr. Naidu about the government’s view on the three demands of the Congress with regard to the GST Bill, he said the party leaders had been apprised of it. The Congress chief is believed to have told the Minister that she would get back on it after consulting the leaders.\n\n“What proposal? There is no proposal from the government side. If he had to accept our demands why would Finance Minister Arun Jaitley say that shrinking Congress strength in Rajya Sabha will make GST happen,” Mr. Sibal said.\n\n“This is all optics. Naidu came and met Sonia Gandhi. They have to show all this. Had there been anything substantial, Prime Minister Narendra Modi and Finance Minister Jaitley would have gone on Twitter now.” He rejected suggestions that the government had accepted the demands of Congress and sent a proposal to Gandhi through Naidu.\n\nThe Bill’s fate now hinges on the political line taken by the Congress and some regional parties, which, in principle, support the proposed GST, a key reform legislation that the government is keen on passing at a time when major reform measures, including the Land Acquisition Bill, has been pending.\n\nThe Congress demands a GST rate of 18 per cent included in the Bill; scrapping of an additional one per cent State levy; and a grievance redress mechanism in case of tax disputes between States.\n\nThe government had accommodated these demands only partially.", 
    "section": "national", 
    "title": "Venkaiah meets Sonia on GST, Congress says it is all ‘optics’", 
    "subsection": "general", 
    "date": "2016-01-08"
}