{
    "author": [
        "Ian Sample"
    ], 
    "text": "Scientists find that even amateur telescopes are capable of capturing violent outburst from black holes closest to Earth\n\nMarkarian 231, a binary black hole found in the centre of the nearest quasar host galaxy to Earth, is seen in a NASA illustration.— Photo: NASA/Reuters\n\nAstronomers have discovered that black holes can be observed through a simple optical telescope when material from surrounding space falls into them and releases violent bursts of light.\n\nThe apparent contradiction emerges when a black hole’s gravity pulls in matter from nearby stars, producing light that can be viewed from a modest 20-cm telescope.\n\nJapanese researchers detected light waves from V404 Cygni — an active black hole in the constellation of Cygnus, the Swan — when it awoke from a 26-year-long slumber in June 2015.\n\nWriting in the journal Nature , Mariko Kimura of Kyoto University and others report how telescopes spotted flashes of light coming from the black hole over the two weeks it remained active. The flashes of light lasted from several minutes to a few hours. Some of the telescopes were within reach of amateur astronomers, with lenses as small as 20 cm.\n\n“We now know that we can make observations based on optical rays — visible light, in other words — and that black holes can be observed without high-spec x-ray or gamma-ray telescopes,” Ms. Kimura said.\n\nThe black hole, one of the closest to Earth, has a partner star somewhat smaller than the sun. The two objects circle each other every six-and-a-half days about 8,000 light years from Earth.\n\nBlack holes with nearby stars can burst into life every few decades. In the case of V404 Cygni, the gravitational pull exerted on its partner star was so strong that it stripped matter from the surface. This ultimately spiralled down into the black hole, releasing a burst of radiation. Until now, similar outbursts had only been observed as intense flashes of x-rays and gamma-rays.\n\nAt 18.31 GMT on 15 June 2015, a gamma ray detector on Nasa’s Swift space telescope picked up the first signs of an outburst from V404 Cygni. In the wake of the event, Japanese scientists launched a worldwide effort to turn optical telescopes towards the black hole.\n\nThe flickers of light are produced when x-rays released from matter falling into the black hole heat up the material left behind.\n\nPoshak Gandhi, an astronomer at Southampton University, said the black hole looked extremely bright when matter fell in, despite being veiled by interstellar gas and dust. “In the absence of this veil, V404 Cygni would have been one of the most distant objects in the Milky Way visible in dark skies to the unaided eye in June 2015,” he writes in the journal.\n\nThe discovery comes a day after astronomers reported two massive blasts of gas coming from a supermassive black hole in the heart of a galaxy 26 million light years away. Scientists believe that two arcs of x-rays spotted by Nasa’s Chandra X-ray Observatory at the heart of the spiral galaxy, NGC 5195, are the remnants of huge outbursts of gas from the black hole.\n\n“Astronomers often refer to black holes as eating stars and gas. Apparently, black holes can also burp after their meal,” said Eric Schlegel who led the study at the University of Texas in San Antonio.\n\nChristine Jones, a co-author at the Harvard-Smithsonian Centre for Astrophysics in Cambridge, Massachusetts, said: “We think these arcs represent fossils from two enormous blasts when the black hole expelled material outward into the galaxy. This activity is likely to have had a big effect on the galactic landscape.”\n\nThe eruptions of gas are thought to have been triggered by the smaller galaxy NGC 5195 merging with its larger neighbour, the Whirlpool galaxy. The merging process drove gas towards the black hole and the material released energy as it fell inside. As the hot, X-ray-emitting gas poured outwards, it swept up colder hydrogen from the galaxy’s centre like a snowplough.\n\nThe work was presented at the annual meeting of the American Astronomy Society in Florida. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Visible light from black holes detected for first time", 
    "subsection": "general", 
    "date": "2016-01-08"
}