{
    "author": [], 
    "text": "Udaipur will come alive with the first edition of India’s first World Music Festival. The two-day festival, starting February 13, will bring together over 100 global artistes and ensembles from over 12 countries, including Spain, Ghana, Venezuela, Italy, France as well as India.\n\nPresented by Hindustan Zinc in association with Wonder Cement and Rajasthan Tourism and conceptualised and produced by cultural organisation SEHER, the festival also marks the celebrations of 60 years of the diplomatic relations between Spain and India.\n\nThe aim of the festival is to establish an annual signature event in Rajasthan and at the same time establish Udaipur as a major destination for world music in South Asia.\n\n“A festival of this scale featuring such diverse music from so many different continents and regions coming together in one of the best tourist destinations of India would make Udaipur a culturally vibrant destination. It is an annual event where international and domestic travellers can mark the dates on their yearly travel calendar,” festival director Sanjeev Bhargava, said.\n\nThe festival will feature unparalleled live performances with the city of lakes as a background.\n\nOne of the most popular Fado singers from Portugal, Carminho will be performing for the first time in India at the event. French composer Mathias Duplessy will also perform at the event, where he will collaborate with Rajasthani vocalist Mukhtiyar Ali from the semi-nomadic community called Mirasi from the Thar Desert.\n\nThe evening will come alive with instrumental Spanish Flamenco guitar and dance performance and the unique African beat music by Dobet Gnahore, a Grammy award winner from the Ivory Coast. — IANS\n\nThe event brings together over 100 artists, ensembles from over 12 countries", 
    "section": "national", 
    "title": "World Music Festival to be held in Udaipur in February", 
    "subsection": "general", 
    "date": "2016-01-08"
}