{
    "author": [
        "R Sujatha"
    ], 
    "text": "A post by actor Karthi on social media has upset occupational therapists, who have been trolling him since Monday.\n\nThe post, published on January 8 on Facebook says: “Recently schools have new classes and sessions for kids by the name of occupational therapy and rehabilitation. Please do not leave the children in these classes without your direct supervision or under ur [sic] surveillance through a CCTV. I am hearing shocking news about the treatment of kids in these classes! Please never leave the kids off your eyesight, they are very vulnerable!”\n\nThis has angered occupational therapists, some of whom accused the actor of using his celebrity status to malign a profession. They wanted him to reveal the therapist’s name to initiate action.\n\nMr. Karthi told The Hindu that the post was the result of a complaint from a close family member.\n\n“My caution is to the parents. They are so busy with their laptops and phones that they do not keep a watch on their children,” he said.\n\nOn Tuesday, he responded to the therapists’ criticism saying that he had posted after “a bad experience” in his “close family”.\n\nHe explained: “Dear therapists, I do know the kind of service you all do to help the children. I had a bad experience in my close family and hence my post. I will deal with the rehab centre myself.”\n\nSugumar P. Raj, co-convener of Tamil Nadu branch of the All India Occupational Therapists Association, said he had spoken to the actor. “The child had minimal issues for which he was sent by a school in Mandaveli for assessment to the therapy centre. The child was not hurt but he saw some children being hit and was psychologically affected,” Mr. Sugumar said.\n\nAround 1,500 Occupational Therapists practised in the State with over 530 therapists in the city itself. “Occupational therapy was recognised as a profession in India in 1952 and Tamil Nadu began offering the course in 1969.\n\nThe government has over 30 posts but due to their disinterest, all of them have lapsed. Our support service helps children with autism, ADHD, AHD and learning disabilities,” Mr. Raj said.\n\nKarthi told The Hindu that the post was the result of a complaint from a close family member", 
    "section": "national", 
    "title": "Actor’s post on social media upsets occupational therapists", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}