{
    "author": [
        "S Prasad"
    ], 
    "text": "The Board of Directors of the mill is scheduled to hold a meeting in two days\n\nThe sale proceeds of the property would be utilised to meet the mill’s commitment to its employees. — Photo: S.S. Kumar\n\nDecks have been cleared for Government-run Anglo French Textile (AFT) Mill to dispose of over 55 acre land belonging to the mill in Puducherry and neighbouring Tamil Nadu. The Board of Directors of the mill is scheduled to hold a meeting in two days to decide on the plan involving sale of property for payment of gratuity to retired workers.\n\nTalking to reporters here on Tuesday, V. Balan, Chairman of Puducherry Textile Corporation (PTC) said that the Madras High Court in a writ petition filed by 10 former employees had said that there was no need for the mill management to get permission of the Central Government to dispose of the idle land.\n\nHe said that the High Court in its order on December 21, 2015 had stated that the District Collector was the competent authority for the payment of gratuity under the payment of Gratuity Act and the Puducherry Textile Corporation had the powers to sell the lands under the supervision of the Collector.\n\nAn emergency meeting of the Board of Directors of the mill will be held in the next two days to prepare further course of action on sale of 55 acre land in Pattanur in Villupuram district, quarter of an acre in Thengaithittu and 1.5 acres in Thirubhuvanai in Puducherry, all valued at Rs.73.38 crore.\n\nMr. Balan said that he had requested the Chief Minister N. Rangasamy to intervene and waive interest and penal interest to the tune of Rs.18 crore due from the mill to cooperative banks and various institutions for the loans that the management had borrowed over the years.\n\nThe management is yet to disburse gratuity of Rs.27 crore to employees who had retired from 2009.\n\nThe mill is also yet to pay the EFP dues of Rs.29 crore into the accounts of employees.\n\nThe financial burden due to interest and penal interest was heavy and hence waiver was necessary, he said.\n\nThe sale proceeds of the immovable property would be utilised to meet the mill’s commitment to settle payment of gratuity, Employees Provident Fund to around 1,076 workers in the mill.\n\nThe Government had earlier approached the Union Home Ministry to get the permission for the disposal of the land as was advised by the Law department.\n\nHowever, the Union Home Ministry had been keeping quiet without giving its clearance.\n\nBut with the Madras High Court allowing the sale of land, the mill would be able to clear all its dues at the earliest, he said.", 
    "section": "national", 
    "title": "AFT board to decide on sale of land", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}