{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Zone chairman K. Rajapandian interacting with Mayor V.V. Rajan Chellappa at the Corporation council meeting in the city on Tuesday.— Photo: S. James\n\nIn a jolt to the ruling party, a majority of AIADMK councillors blamed the Corporation officials for poor upkeep of the city at the council meeting held here on Tuesday.\n\nComplaints rained from the start of the meeting, chaired by Mayor V.V. Rajan Chellappa. As the meeting began, the members — all from the ruling AIADMK — were up on their feet. They charged that the roads were bad. Potable water was a problem in their wards. Street lights were not functioning. Delay in underground drainage works had led to congestion around Meenakshi Temple…. And they continued their woes.\n\nSurprised by the remarks from his own party members, the Mayor tried to pacify them, but they were not convinced as the response from officials was sceptical. However, in an assertive tone, he urged the members to be specific on their grievance and instructed the officials to set them right soon.\n\nWith the election fast approaching, a majority of the councillors expressed apprehension over facing the voters since the basic amenities were far from satisfaction.\n\nWhen the ruling party members complained to the Mayor about the problems in their wards in the absence of DMK councillors, the officials were taken aback. “Due to the “lethargy” of some officials, we (councillors) are in trouble,” they said unanimously.\n\nThe Mayor said that the Corporation had taken up road laying works at a cost of Rs. 26 crore. In phases, road were being laid and badly damaged stretches, which had not been taken into account, might be brought to the notice of officials. He appealed to the officials to cooperate with the members.\n\nDuring the question hour, zone chairman K. Rajapandian said that dog menace was high in the city.\n\nThe officials claimed to be serious in their work, but there seemed to be no relief.\n\nAnother zone chairman, Shanmugavalli (AIADMK), said that four years had gone by and one particular stretch had been left uncared for by the officials without laying road till date. Salaimuthu, also a zone chairman, said that pig menace was there in his ward.\n\nMr. Rajan Chellappa intervened and said that the Corporation had been chosen as less polluted city by the World Health Organisation.\n\nNot in a mood to listen, CPI (M) councillor Chellam said that underground drainage works had been completed in her ward, but the officials had not laid roads.\n\nKannagi Baskaran (AIADMK) asked the reasons for employing officials from other departments for projects like JNNURM, when the Corporation had trained personnel.", 
    "section": "national", 
    "title": "AIADMK councillors blame officials for poor upkeep of city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}