{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pleasure trips, especially on two-wheelers, may be tiresome and dangerous\n\nThose who are planning pleasure trips to picnic spots on ‘Kanum Pongal’, particularly on two-wheelers, may have to think twice as all roads leading to these places are in bad shape.\n\nAs Papanasam and Manimuthar dams attract thousands of visitors on ‘Kanum Pongal’ every year, hundreds of vans, cars and bikes will use Palayamkottai– Papanasam highway. But this stretch is full of uneven surface and potholes.\n\nThough Highways Department has filled up huge pits on the road at Melapalayam, road-users, especially two-wheeler riders, cannot enjoy a safe riding owing to the uneven surface. The ‘huge’ speed-breakers at Karungulam Munneerpallam and Tharuvai also cause accidents every day.\n\nThe stretch between Gopalasamudram intersection and Cheranmahadevi is without upper layer.\n\nFilling up\n\nFollowing repeated complaints from the public and adverse reports in newspapers about the condition of roads, the officials are filling up potholes between Cheranmahadevi and Veeravanallur. While this repair work somewhat facilitates safe riding of four-wheelers and commercial vehicles, the road still poses threat to the two-wheeler riders.\n\n“Though the Highways Department has repaired the road for about 2 km near Kallidaikurichi, you’ll have to apply all your driving skills to avoid craters along the stretch between Ambasamudram and Papanasam. Several accidents happened on this road due to these potholes,” said Shaik Abdul Khader of Ambasamudram.\n\nAs the department has decided to convert Tirunelveli– Tenkasi highway into a four-lane stretch – land acquisition process has already commenced – relaying of the existing stretch has been ruled out.\n\nWith huge pits, the stretches between Old Pettai and Manonmaniam Sundaranar University; Vellalankulam intersection and Seethaparpanallur; and Maranthai and Alangulam are unsafe for the bike riders.\n\n“Barring a few stretches like Alangulam– Adaikkalapattinam, all other areas continue to threat the road-users,” says Murugaiah of Muthukrishnaperi.\n\nThe roads under the control of the Highways Department within Tirunelveli and Palayamkottai such as North and South Bypass Roads and Thiruvananthapuram High Road are in the worst shape.\n\nNo action\n\n“The trenches dug in front of ARR Hotel and Unlimited Showroom and huge pits near NGO Colony intersection cause accidents every day. Though we’ve told the highways officials to take steps for repairing this stretch, no action has been taken,” said a traffic police officer.", 
    "section": "national", 
    "title": "Bad roads may affect flow of visitors to picnic spots", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}