{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "With better connectivity, banks may soon set up branches in the area\n\nith a new bridge connecting Cochrane Basin Road and Kathivakkam High Road just days from being inaugurated, poor connectivity may soon be a thing of the past for a section of residents in Korukkupet.\n\nThe residents, whose houses are located close to the railway station, have been facing accessibility issues, as the they seem to have been hedged in by the railway tracks. Many of them have to take railway level crossings to head out of the neighbourhood every day.\n\nThe new bridge — which will replace LC IA, one of the level crossings — is a joint project of the Southern Railway and the Chennai Corporation and is set to be inaugurated next week.\n\n“Banks were unwilling to set up branches in Korukkupet citing safety concerns. Most residents and traders have visit Washermanpet for banking services,” said Kandasamy, a trader with a business on Korukkupet High Road. Presently, pensioners from the area flock to Indian Overseas Bank on Tiruvottiyur High Road near Maharani Theatre.\n\n“We were in talks with a bank a few years ago to set up a branch in our building. However, the proposal was shelved citing security concerns and lack of connectivity,” he said. Once the bridge is inaugurated next week, banks are expected to set up branches, said a Corporation councillor. A large number of residents and over 1,000 traders of iron and steel and wooden materials are likely to benefit if new bank branches come up in the Korrukkupet neighbourhood.\n\nThe Rs.16.6-crore structure, which is 531 metres long and 8.5 metres wide, is expected to check traffic congestion along Tiruvottiyur High Road. Buses plying between Broadway and areas such as Manali will take the new bridge. Vehicles are expected to reduce on Tiruvottiyur High Road.", 
    "section": "national", 
    "title": "Bridge to improve quality of life for Korukkupet residents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}