{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "A couple of decades ago, doctors in the city saw very few cases of childhood obesity. But in the last few years, there has been a dramatic increase.\n\n“A survey we conducted on 25,000 government and private school children in Chennai a few years ago, revealed that 8 to 10 per cent of children in government schools and 25 to 30 per cent of children in private schools were either overweight or obese. This is definitely an epidemic and will only get worse unless something is done,” said V. Mohan, chairman, Dr. V. Mohan’s Diabetes Specialties Centre.\n\nObesity is a disease that affects virtually every organ, said K.R. Palaniswamy, consultant gastroenterologist at Apollo Hospitals. “It can have huge, long-term impacts on the health of children,” he said.\n\nAn increase in the intake of junk food, a decrease in physical activity and uncontrolled eating are mostly to blame, say doctors, stressing on the need for schools, teachers and parents to work together to control obesity.\n\n“I used to see maybe one child in 10 who was overweight 20 years ago. Now, it is about 2 or 3 of every 10 children,” said Padma Appaji, consultant paediatrician, Vijaya Group of Hospitals. Both boys and girls are affected, she said, and the problem, while still mostly seen among the affluent sections of society was slowly creeping into the less affluent sections too, she said.\n\nThe health complications can be immense and scary: “We have found that 12 per cent of girls above the age of 12 who are overweight, and who have a family history of diabetes, are pre-diabetic,” said Dr. Mohan, adding that he was even beginning to see cases of type 2 diabetes in children below the age of 10. “Type 2 diabetes is now common among 12 to 16 year olds,” he said.\n\nThis apart, obesity could cause hormonal problems including polycystic ovarian syndrome, lower tolerance to respiratory problems and an increased risk of cardiovascular and orthopaedic problems, said Dr. Appaji. “We have found that 7 to 10 per cent of obese children that we see have elevated blood pressure levels,” she added.\n\nSo what can parents do? Dietary changes are a must, as is physical activity, say doctors. Counselling could also help tackle the problem, they said.", 
    "section": "national", 
    "title": "‘Childhood obesity is on the rise’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}