{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The mini-lorry with 224 bags of ration rice was seized by Civil Supplies CID wing personnel near Krishnagiri- Thiruvannamalai junction on Tuesday.- N. Bashkaran\n\nA quality control inspector and a billing clerk of Krishnagiri Civil Supplies godown were arrested along with three others for colluding in the smuggling of PDS rice from the godown to Karnataka.\n\nBased on a tip-off that rice was being smuggled, Civil Supplies CID wing sleuths intercepted a mini-lorry near Krishnagiri- Thiruvannamalai junction here. The lorry was found stacked with 224 gunny bags of 50 kilograms of rice each. Lorry driver Suyal (24), a resident of Ramnagar in Hosur, load-man at Hosur Civil Supplies godown Munichandran (40), and a middleman Babu (32) were secured and interrogated.\n\nThe men had produced a bill claiming that the gunny bags were being transported to the Civil Supplies godown in Hosur. However, suspicious of the claim, the police alerted the District Civil Supplies Officer Rajendran. The bill was found to be fake after the DSO’s verification. Further inquiries revealed that the rice was being smuggled across the border to Athibelli, to be sold to a private rice merchant Jagan at a price of Rs.10 per kilogram.\n\nThe smuggling was carried out in collusion with the quality inspector of Krishnagiri Civil Supplies godown Venkatesan(57) and billing clerk of the godown Raman (46).\n\nVenkatesan, hailing from Katpadi in Vellore, was working as the quality inspector of the godown for the last two years.\n\nFollowing this, Civil Supplies staff Venkatesan and Raman, load-man Munichandran, contact of the private rice merchant Babu, and driver Suyal were arrested. The police are on lookout for rice merchant Jagan and the owner of the lorry. Any complaints regarding civil supplies and tip offs may be shared over phone to Civil Supplies CID wing 94981 72882, 04343-231835.", 
    "section": "national", 
    "title": "Civil supplies staff among five held for smuggling PDS rice", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}