{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chief Minister Jayalalithaa and DMK president M. Karunanidhi on Tuesday urged the Centre to promulgate an ordinance to lift the Supreme Court’s stay on jallikattu and ensure the conduct of the sport this year.\n\n“Considering the urgency of the issue, I strongly reiterate my earlier request to the government of India to promulgate an ordinance forthwith to enable the conduct of jallikattu,” Ms. Jayalalithaa said in her letter to Prime Minister Narendra Modi.\n\n“With the Pongal festivities commencing from January 14, 2016, the public in the rural areas of Tamil Nadu have made all arrangements and preparations and are eagerly looking forward to the conduct of jallikattu as part of the traditional festivities ingrained in the hoary cultural heritage of Tamil Nadu,” she added.\n\nSpeaking to reporters here, DMK president M. Karunanidhi said considering the sentiments of the people, Mr. Modi should immediately work towards promulgating an ordinance to amend the Prevention of Cruelty to Animals Act and ensure jallikattu this year.\n\nMeanwhile, other parties slammed the State and the Centre for their slack on the issue.\n\nIn a statement, PMK founder S. Ramadoss alleged that the Tamil Nadu government did not follow up on its review petition in the jallikattu case for 18 months. Despite many calls for an ordinance, the Centre took the route of an executive order to lift the ban, making it easier for the Supreme Court to issue the interim stay.\n\n“The Centre and the State should take responsibility for this stay,” he added.\n\nDouble standards\n\nTamil Nadu Congress Committee president E.V.K.S. Elangovan said the development exposed the double standards of the BJP.“It seems that some among the BJP leadership are not all right with supporting both a ban on cow slaughter and support for jallikattu,” he alleged.\n\nVCK leader Thol. Tirumavalavan said that the Centre went ahead with the executive order despite warnings from several political leaders and legal experts.\n\nMDMK general secretary Vaiko charged that while Union Minister Pon. Radhakrishnan initiated efforts to lift the ban, the Centre did not show full commitment and took an eyewash of a decision at the last moment, which has now been stayed by the apex court.\n\nSpecial Correspondent writes from Nagercoil\n\nMr. Radhakrishnan has said the Centre, after studying the interim stay on conducting jallikattu, would take appropriate steps for conducting the sport this year.\n\nSpeaking to reporters here before leaving for New Delhi on Tuesday evening, Mr. Radhakrishnan said the interim stay granted by the Supreme Court had disappointed Tamils. “Those who have brought in the legal impediment against conducting Tamils’ traditional sport, should also stop the trucks carrying bulls to other States for slaughter and stage an intense struggle in front of beef stalls and tanneries to ensure their permanent closure,” Mr. Radhakrishnan said.\n\nCentre and\n\nthe State should take responsibility for the stay, says Ramadoss", 
    "section": "national", 
    "title": "CM, Karunanidhi want ordinance to clear jallikattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}