{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here was informed on Tuesday that certain crucial documents containing details of parentage of 89 inmates of a private home for girls run by Mose Ministries in Tiruchi went missing after the court on Monday directed the District Social Welfare Officer (DSWO) to take possession of the documents.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran were informed of the development by Additional Advocate General K. Chellapandian who said that the officials had taken a look at the documents a few days ago and also took photographs of them on a mobile phone before the inmates took them back and locked them up in an almirah .\n\nHowever, those documents were found missing when the DSWO attempted to take possession of them as per court orders on Monday. Expressing their displeasure over the issue, the judges asked the counsel for Pastor Gideon Jacob, the administrator of the home, to make sure that those documents surface back before they could pass orders on Monday.\n\n“Initially, your stand was that details of parentage were not known to you and that the children were left at your doorsteps by their parents in Usilampatti. But now these documents seem to be containing details of the parents. Therefore, you better instruct your client to make sure that the documents are given to the officials,” Mr. Justice Ramasubramanian said.\n\nThe Division Bench had been monitoring the functioning of the home and passing interim orders on the issue ever since it overthrew the management headed by the pastor and appointed a committee led by Tiruchi Collector on December 9 last year to manage the unauthorised home.\n\nThe decision was taken on a public interest litigation petition filed by a non-governmental organisation.", 
    "section": "national", 
    "title": "Crucial documents go missing from Tiruchi home", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}