{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "In the wake of the attack in Pathankot air base by terrorists dressed like Army personnel, the issue of easy availability of uniforms of the Defence forces and law enforcement agencies has come into focus.\n\nOne of the locations where official uniforms are available with ease is Periamet close to the Central station in Chennai. From badges of different services to uniform, shoes and holsters, everything is available at nearly 20 outlets on the stretch.\n\n“The shops were first located in Moore Market. During the British rule, the shopkeepers used to provide the uniforms to the armed force personnel and police. After a fire gutted the building, some shifted to Periamet. Then slowly their relatives also started outlets selling the uniforms,” a shop owner who sells the uniforms said.\n\nDefence personnel purchase goods from them if there is an emergency, he said.\n\n“We can easily differentiate between Defence personnel and civilians. However, we insist on seeing the identity cards if they want the uniforms,” another shop owner said.\n\nMany feel that it is not easy to keep a check on the sale of uniforms. Their argument is that the cloth is easily available. Anyone can buy and stitch it.\n\nHowever, senior police personnel felt that the government should restrict the sale of such products. “Certain items such as badges and uniforms should be provided only through the respective department. Otherwise it will lead to security issues,” an officer said.\n\nAn Army officer, who did not want to be named, said possession of uniform meant for the Army personnel was wrong.\n\n“Security of the country is paramount and if the uniform primarily meant for the Army and other Defence personnel is used by unauthorised persons, it should be checked. Incidents in the past have indicated that it could be misused,” he said.", 
    "section": "national", 
    "title": "Defence forces uniform easily available for sale", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}