{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Tuesday criticised the Central Bureau of Investigation (CBI) for not taking effective steps in the last five years to proceed with an appeal preferred by it against the acquittal of all 17 accused, including V.P. Pandi alias ‘Attack’ Pandi, from the 2007 Dinakaran newspaper office attack case in Madurai. Three employees of the newspapers had suffocated to death after the office was set on fire by miscreants.\n\nA Division Bench of Justices P.R. Shivakumar and V.S. Ravi asked Special Public Prosecutor (SPP) for CBI cases S. Jeyakumar why the investigating agency had not filed a petition seeking arrest warrant against a majority of the accused who had been “playing hide and seek” with the court ever since the appeal was filed in 2010 and got numbered in 2011.\n\nThe judges got irked when advocate R. Venkateswaran stated that he had been engaged by ‘Attack’ Pandi only to conduct the appeal preferred by the CBI and not a revision case preferred against the acquittal of accused by Poongodi, mother of one of the three newspaper employees who were charred to death when a mob hurled petrol bombs on their office here on May 9, 2007.\n\nStating that almost all the accused had been adopting one or the other tactics to evade from conducting the case, Mr. Justice Shivakumar said: “This is nothing but challenging the authority of the court.” He also began dictating an order in the open court directing the Registry to issue warrants to arrest against 13 accused who had not entered appearance either in person or through their counsel.\n\nDenying the charge, the SPP sought time to get instructions from CBI officers on filing such an application. Hence, the judge ordered adjournment of the case to Tuesday and said: “We want to test your bona fide. For last four years, no attempt has been made to serve the court notice on the accused or to secure their presence. Are we living in a State where the rule of law prevails?”", 
    "section": "national", 
    "title": "Dinakaran attack case: CBI draws flak in HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}