{
    "author": [
        "Dennis S"
    ], 
    "text": "Gearing up for the Assembly polls, the Election Commission (EC) is in the process of consolidating all its efforts to address the woes of voters by increasing the size of the help desk that handles calls through the toll-free number 1950.\n\n“There are 10 persons who are handling the calls now in the call centre functioning in the Chief Electoral Officer’s office in the Secretariat. We are planning to get 20 more and make a team with 30 of them. We expect more calls from voters once the latest electoral rolls are released on January 20,” sources said.\n\nThe EC is also taking efforts to make ‘1950’ receive not only calls but also SMSs.\n\n“1950 was started only to receive calls and 9444123456 was announced to receive text messages. As the number is long and difficult to remember, we are in the process of making the 1950 receive SMSs too. Once we channelise the process, instead of getting messages from BT-CEOTNL, voters would get messages from ECI-SMS.”\n\nTimings of call centre\n\nThe call centre that functions between 6 a.m. and 10 p.m. on all days of the week will have two persons working between 6 a.m. and 10 a.m., 10 persons between 10 a.m. and 6 p.m. and two persons between 6 p.m. and 10 p.m.\n\nThe call centre, which receives about 800 calls a day, helps the voters to rectify discrepancies in the Electoral Photo Identity Cards (EPIC) and electoral rolls.\n\nNumber of calls\n\nSince January 1, the centre has received a total of 8,260 calls as on Tuesday.\n\nOctober, November and December received 10,818 calls, 8,932 calls and 17,820 calls.\n\nThe surge noticed in calls during December was primarily due to the floods and voters calling to find out how they can apply for new cards.\n\n‘1950’ helps voters get their issues sorted out by speaking to the call centre employees, and help them avoid waiting in long queues.", 
    "section": "national", 
    "title": "EC to expand its ‘1950’ call centre to help voters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}