{
    "author": [
        "L Srikrishna"
    ], 
    "text": "The underground drainage facility, built by British engineers, is still in a good condition but the residents upset over high pollution\n\nAt a time when many residents are asking for underground drainage system in their locality, here is a ward where the existing facility is intact. Surprising, but the people say it is perfect since the day it was laid by British engineers in and around the world famous Thirumalai Naick Palace.\n\nDuring a visit to the ward, The Hindu team found that the councillor is accessible and familiar among the public. A first timer to the council, J.N. Jeyageetha from the AIADMK said that her ward (74) in the Madurai Corporation comprises the Mahal (in local parlance) or the Palace (to tourists) streets 1 to 6, Krishnapuram, Vadampokki Street, East Veli Street, South Masi Street, Manjanakkara Street and Panthadi streets 1 to 4.\n\nBy taking care of the basic needs — potable water, waste disposal, street lights — she said, half the problems had been redressed.\n\nUnlike in other wards, where there were a plenty of complaints on UGD, there was not a single complaint, said many residents of Mahal Third Street.\n\nMotilal Babu, a resident of Mahal Second Street, who runs a small textile retail shop on East Veli Street, said that everything — good and bad — was there in this ward.\n\n“All kinds of pollution are abundant here. As it is thickly populated, the narrow lanes and by-lanes are always crowded.”\n\nFor a sample, crossing South Marret Street from Mahal to Nelpettai is a Herculean task.\n\nThe haphazard parking of lorries and trucks at the Onion Market spoke the rest of the tale, he noted.\n\nLikewise, almost all the stretches have similar woes in the ward.\n\nAs it is located close to the Meenakshi Temple and Thirumalai Naick Palace, the authorities should improve the infrastructure. Many visiting tourists experience difficulties in reaching these two famous landmarks for very many reasons.\n\n“The concept of Swachh Bharat may at least be given some thought at these two landmarks of Madurai,” Bhanumathi, a senior citizen, who retired as a lecturer and is now a resident of Krishnapuram, said.\n\nThe district administration and Corporation of Madurai should think of ways to reduce pollution and decongest traffic movement, said T.M. Sureshkumar, a resident.\n\nSince many were taken for a ride, for the benefit of visiting tourists, the officials could think of conducting daily trips as packages by appointing approved guides.\n\nThe vehicles in which they travelled could also be easily identified with some exclusive colour, so that traffic police could also be of help. By doing so, the image of the city would improve among the visitors, she noted.\n\nThe park named after L. K. Thulasirama Iyer inside the Thirumalai Naick Palace should not only be cleaned up but also given a facelift.\n\nPlastic cups and left-out food packets were seen strewn all over.\n\nOpen defecation along the compound wall should be discouraged and violators penalised, said residents of Mahal area.\n\nThe pedestrian pathway is either encroached by roadside vendors or share auto drivers, thus forcing people to walk on the road along the Palace Road.\n\nMany tourists at the Palace said that the park was in bad shape and could be made more colourful.\n\nMosquito menace chased away tourists from visiting the monument beyond 6 p.m.\n\nThough out of five schools run by the Corporation in the ward, three have been closed due to declining student strength, two schools (NMS Girls School and Thiruvalluvar Boys School) are functioning with a meagre strength of about 150.\n\n“By introducing a couple of new courses and appointing more teachers in the vacancies, things may change for the better at least in these two institutions,” a teacher said.\n\nYet another major problem experienced in the ward is frequent traffic jams as vehicles move at a snail’s pace during peak hours.\n\nThe authorities should take steps to vacate encroachers and ensure carriage space.\n\nFor example, the pedestrian pathways in most stretches were either used for parking two-wheelers or occupied by vendors. Vadambokki Street and Vilakuthoon areas were classic examples.\n\nSimilarly, lorry parking along Onion Market on South Marret and along East Veli Street choked traffic movement, a resident complained.\n\nWith both good and bad, the councillor is, however, confident of facing the people in the ensuing polls since she said that Chief Minister’s welfare schemes had reached all the needy.\n\nThe promises made by her to the residents too had been fulfilled.", 
    "section": "national", 
    "title": "Encroachments, haphazard parking are nightmares", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}