{
    "author": [
        "Staff Reporter"
    ], 
    "text": "P.R. Natarajan, general secretary of the Tamil Nadu Freedom Fighters and Legal Heirs Samithi, said that freedom fighters and their heirs would stay away from the function to be organised by district administration on Republic Day to honour them.\n\n“The decision is a mark of our protest over the repeated neglects and disrespect shown by the authorities concerned when it comes to treating the freedom fighters, their kin and legal heirs during many functions held over the recent years,” Mr. Natarajan told reporters here.\n\nThe latest of the incidents cited by them happened on Monday when the Samithi members came to garland the statue of freedom fighter Tirupur Kumaran on his death anniversary only to see that the entrance gate was locked.\n\nGarbage\n\n“Even after we contacted authorities concerned, the door was not opened. The stone kept at the exact spot where Kumaran died fighting the British was found to be unclean on the day. Garbage was heaped on the stone,” he said.\n\nThe Samithi members said that the situation was no different when Tirupur Kumaran's birth anniversary was observed recently.\n\n“Officials and elected representatives neglected heirs of Tirupur Kumaran for whom the function was primarily held,” they said.\n\nSimilarly, the honouring of freedom fighters and their heirs during Republic Day and Independence Day by the district administration had already come under severe criticism.\n\nOn the last Independence Day, S. Somasundaram, the 95-year-old freedom fighter, was seen walking away alone after been honoured with a shawl in a hurry by officials. No arrangement was made to take him back home. The incident drew criticism. “Many of those participated in the function was not even provided chairs to sit,” said Mr. Natarajan.", 
    "section": "national", 
    "title": "Freedom fighters, kin to boycott function to honour them", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}