{
    "author": [
        "R Sujatha"
    ], 
    "text": "The Madras University Teachers’ Association (MUTA) has written to Governor-Chancellor K. Rosaiah claiming that Vice Chancellor R. Thandavan, who would be demitting office in a few days, had proposed to appoint 70 non-teaching staff on Wednesday.\n\nThe association has requested Mr. Rosaiah “to intervene immediately and direct the administration of the University of Madras not to make any appointment during the last few days” of the present V-C’s term and thus safeguard the financial and academic health of the university.\n\nMUTA has alleged that the financial health of the university is poor owing to growing salary bills and depleting/diverted source of finance.\n\nMUTA members charge that it was proposed to appoint 32 security guards, 15 office attendants and 25 attendants . The last working day for the University before Pongal holidays is Thursday. It is also the V-C’s last day in office.\n\nOn Tuesday, students staged a demonstration outside the Chepauk campus demanding that the suspension of four students of the Department of Political Science and Public Administration be revoked. The four were suspended six months ago for participating in protests, including a stir staged demanding better amenities in the university.\n\nThe students had complained against the V-C to the University Grants Commission in October last. Four of the 10 students who approached the UGC were subsequently suspended and the M Phil programme was also suspended for a few weeks.\n\nRegistrar David P. Jawahar said if the students withdrew their case in the Madras High Court, they would be taken back. “We did not go to court. The matter is now sub judice and we can’t do much.” As for the MUTA’s claim that the V-C had proposed to appoint staff, he said, “I have not received any instructions to that effect.”\n\nProf. Thandavan, however, said he was currently in Delhi, adding “There is no truth in the statement made by MUTA”", 
    "section": "national", 
    "title": "Madras varsity teachers petition Governor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}