{
    "author": [], 
    "text": "RELIGION\n\nSri Meenakshi Sundareswarar Temple: Teppa thiruvizha, 10.05, holy flag hoisting, deity procession, 7 p.m.\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nSaiva Sithandha Sabai: Discourse on ‘Thiruvasagam’ by Prof. Yazh S. Chandra, South Adi Street, Meenakshi Amman Temple, 7 p.m.\n\nPaneeru Thirumurai Mandram: Thiruvasagam Mutrodal by M. Balasubramanian, 7 a.m., Thirupugazh Isai, Adi Street 6 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Sekkilar Pillai Tamil’ by T. Arunachalam, S.S. Colony, 5 p.m.\n\nBhajanashramam: Dhanurmadha puja, Nehru Nagar, 5.30 a.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85{+t}{+h}year Sreemath Gita Siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal 6{+t}{+h}Street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs 6 a.m., Paavai songs and devotional songs, Adi Street 6 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 64{+t}{+h}music and arts festival, vocal by Sandeep Narayan, Lakshmi Sundaram Hall, 6 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nKLN Polytechnic College: Blood donation camp in association with Lions Club of Madurai City and Meenakshi Mission Hospital, Ln T. Thanikodi, deputy governor, inaugurates, Viraganoor, 9.30 a.m.\n\nVaigai College of Engineering: Pongal festival celebration, R. Saravana Kumar, president, Therkutheru village panchayat, chief guest, college campus, 2.30 p.m.\n\nTVS Community College: Pongal celebrations, No. 8 Goods Shed Street, 12 noon.\n\nSermathai Vasan College for Women: Pongal vizha, college campus, 10 a.m.\n\nThiagarajar College: Awareness programme on eye donation in association with Aravind Eye Hospitals, D. Saravan, Manager, Eye Bank, Aravind Eye Hospital, speaks, Diamond Jubilee Hall, 12.30 p.m.\n\nSri Aurobindo Mira Matric Higher Secondary School: Pongal celebration, school premises, 9 a.m.\n\nAmerican College: Pongal competitions; M. Davamani Christober, Principal, distributes prizes, 12 noon.\n\nMeenakshi Mission Hospital: Pongal celebrations, N. Sethuraman, founder, presides, 3.30 p.m.; ‘patti mandram,’ G. Gnanasambandan presides, Melur Road, 4.35 p.m.\n\nAlcoholics Anonymous: Meeting, Dheep Hospital, K. Pudur, 7 p.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, A.G. Church, near State Bank, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}