{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Researcher and activist N. Nandhivarman hands over a rare collection of William Shakespeare plays published in the 17th century to M. Murugesan, Archivist, National Archives, Puducherry (extreme left), on Tuesday. Ananda Ranga Ravichander (centre), the grandson of the legendary historian is in the picture. (Below) One of the illustrations in the rare collection.— Photos: T. Singaravelou\n\nN. Nandhivarman, litterateur and activist claimed that the work was published in 1623\n\nA rare collection of William Shakespeare’s plays claimed to have been published in 1623 was handed over to the treasure trove of the National Archives of India, Record Centre, Puducherry by N. Nandhivarman, Tamil researcher, litterateur and activist.\n\nThe uniqueness of the collection relates to its age and the set of illustrations not common in other Shakespeare editions.\n\nThe National Archives of India, Puducherry, will house this rare edition for the researchers to peruse the collection.\n\nMr. Nandhivarman said, “Three volumes of the plays have no mention of the year of publication as the front pages were attacked by termites. Later, the books were repaired and rebound. Originally it was presented to me by M.T. Black, president of Mann Marbles Limited, Isles of Man in 1988. I was a granite exporter at that time and was his representative in India to certify the quality of other exporter’s products. He entrusted the literary treasure with me fearing that after his time, there would be none in the family to preserve it. He told me that it was a 1623 edition, I remember.”\n\nAfter receiving the rare collection, Archivist M. Murugesan said, “We will preserve the collection for posterity to conduct research. First, we will give fumigation treatment and keep it in our collection. Anyone can access the archives from National Archives of India.”\n\nAccording to Mr. Nandhivarman, there was a Great Fire in London of 1666 and unknown number of copies got destroyed in the fire. But in 1664 through the third folio edition, the second enlarged issue of Shakespeare’s plays, generally regarded as the rarest of 17{+t}{+h}century folio editions was published by the same publishers and same company as shown in the book given to the National Archives of Puducherry.\n\nIsle of Man in London had preserved the older versions that escaped the Great Fire of London in 1666, Mr. Nandhivarman said.\n\nHe also handed over the letters which formed part of 45 years correspondences with various political leaders and activists.", 
    "section": "national", 
    "title": "National Archives gets rare edition of Shakespearean plays", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}