{
    "author": [
        "S Senthalir"
    ], 
    "text": "Farmers wait for customers ahead of Pongal festival at Big Market; (below) workers unload sugarcane for distribution in Muthialpet constituency arranged by a political party in Puducherry on Tuesday.— Photos: S.S. Kumar\n\nRains had dampened sugarcane and mud pots sale in Puducherry\n\nThe festival of harvest is round the corner but the festivities are yet to catch up in Puducherry.\n\nThe incessant rains that lashed in November end and December 2015 have dampened the festival spirit this year.\n\nSale of sugarcane, earthenware and even clothes has come down drastically when compared to last year.\n\nFarmers coming to Puducherry to sell sugarcane are in for a ssurprise. There are not many buyers and it has affected their business badly. Farmers from Sirkazhi in Chidambaram are hoping that the sale would increase by Thursday or Friday.\n\n“We reached Puducherry on Monday night. We have not been able to sell sugarcane since morning. If people do not buy, we will suffer huge loss. We have to stay in Puducherry till Saturday and our meals are dependent on the sale of sugarcane. If we do not sell any, we will go hungry,” said Vishwanathan, a farmer from Sirkazhi.\n\nHowever, political parties are doling out freebies before the pongal celebrations in their constituencies. Each household in Muthialpet received two sugarcane free of cost. Congress State secretary P.M. Saravanan is distributing sugarcane to every household in Muthialpet at his own cost. “We have purchased 25,000 sugarcane to distribute to every household,” he said.\n\nOn the other hand, mud pots which were once essential elements in Pongal festival celebration are slowly losing shine. On the day of Pongal, mud pots are used to boil rice with milk outside the house thanking the Sun God. A turmeric plant is usually tied around the pot and sugarcanes are offered.\n\nBut, these traditional practices are slowly fading away. People no more use mud pots to boil rice and milk. The changing lifestyle and less interest in following traditional practices have led to huge loss for potters.\n\nThe pots which were made for Pongal were destroyed during the rains. The government has not compensated them for the losses.\n\nEarthenware are bought from neighbouring villages of Cuddalore, Marakkanam and Villupuram and sold in Puducherry. There are four to five varieties of pots available at the market. Due to rains, the price of the pots has doubled. “The pots which cost Rs. 15 are now sold at Rs. 40. We will not be able to sell the pots if they are so expensive, says Lakshmi, who sells earthenware at Kosakadai Street.\n\nSeventy-six-year-old Saraswathi, who has been selling pots for the past 45 years, complained that the sales have come down drastically over the past 10 years. “I don’t see any improvement this year,” she says.\n\nFive to six generations of her family have been selling pots at Kosakadai Street.\n\nThe Goubert Market always bustling with activity does not reflect the festive mood. The cloth merchants are disappointed.\n\n“Every year, the sale for the festival starts from January 1. This year it is very disappointing. We hope that it would get better by Thursday,” said Ramanathan, a cloth merchant in Goubert Market.", 
    "section": "national", 
    "title": "Pongal festivities yet to catch up", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}