{
    "author": [
        "A D"
    ], 
    "text": "Seek regularisation of services by the government\n\nEmployees of Pudu Vazhvu Thittam observe a fast in front of Tiruvannamalai taluk office to draw the attention of the government towards their demands.\n\nEmployees of the Pudu Vazhvu Thittam (PVT), a pioneer livelihood mission of Tamil Nadu, who are working as contract labourers for about a decade demanded that their services be regularised by the government.\n\nThe district unit of Pudu Vazhvu Thittam Employees Welfare Association observed a fast to draw the attention of the state towards their demand, here on Tuesday.\n\nIn front of taluk office\n\nThe fasting was held in front of the Taluk Office. G. Perlina, State Vice President of the association who led the fasting and District President N. Gopi said that 1,500 employees work for the project on contract in the state.\n\n“Now we face threat of losing our job as the government is all set to wind up the project in September. It would launch the Tamil Nadu Rural Transformation Project (TNRTP) in its place.\n\nPVT worked well with the society and it received accolades even from the World Bank.\n\nBut we, the employees of the project, are to be sent home. Most of us are above 40 years of age and it would be difficult for us to take up new careers.\n\nOf course it has been promised that there will be age relaxation and weightage marks for the PVT employees while recruiting people for the new TNRTP.\n\nBut again that would be on a contract basis. We are tired of this and insecurity would continue to haunt us. Hence we demand confirmation of our services,” they added.\n\nCompletion of service\n\nThe protesters also said that though the law stipulates that service of a worker should be regularized if they completed 240 days of contract work, the PVT employees could not get regularisation though they had completed several years of service.", 
    "section": "national", 
    "title": "Pudu Vazhvu Thittam staff go on fast", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}