{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Government has sought Rs.309.45 crore in addition to the previous amount of Rs.185.45 crore\n\nChief Minister N. Rangasamy on Tuesday expressed hope that the Centre would release additional relief assistance to the Union Territory of Puducherry soon.\n\nAfter the high-level inter-ministerial central team visited Puducherry last November, there was another spell of heavy rain from December 1 to 5 with 836 mm of precipitation in just 5 days, which was more than the normal average annual rainfall.\n\nThough the government initially sought the interim relief assistance of Rs.185.45 crore which was sought on November 26, the Centre had released only Rs. 50 crore.\n\nAfter assessing the damages that had occurred due to second spell of rains, the request prepared by the government includes the present supplementary/ additional claim of Rs.309.45 crore in addition to the previous one.\n\nChief Minister N. Rangasamy last month had sought additional relief assistance of Rs.309.45 crore from the Centre to meet expenses towards relief and restoration works in view of massive damage that were caused due to the recent rains. The central team also visited Puducherry for second time to assess the damages last week.\n\nTalking to reporters here on Tuesday, the Chief Minister pointed out that his government sought Rs.500 crore from the Centre and subsequently, the central team also visited the UT for assessing the damages.\n\n“We also submitted a detailed report to the team. I am hopeful of getting additional relief assistance from the Centre.”\n\nHe added that he would personally meet Prime Minister Narendra Modi and Home Minister Rajnath Singh to impress upon them the need for a higher relief assistance.\n\nMr. Rangasamy said he had also written letters to the Prime Minister and Union Minister of External Affairs for the speedy release of Karaikal fishermen who were captured by Sri Lankan Navy. He added that his government would demand the release of their boats as well from the custody of Sri Lanka.\n\nMr. Rangasamy said there should be permanent solution to the problems of fishermen.\n\nMeanwhile, the Chief Minister on Monday had announced a Rs. 29.09 crore relief package for farmers who suffered crop loss in the rains last year. A total of 15,200 farmers in Puducherry, Karaikal and Yanam regions of the Union Territory would benefit from the package, he said after handing over cash to some farmers at a function in Puducherry. Three regions had together lost crops of different varieties on an extent of 11,331 hectares, according to a press release.", 
    "section": "national", 
    "title": "Rangasamy hopes for additional aid", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}