{
    "author": [
        "Deepa H"
    ], 
    "text": "Many residents, who haven’t received compensation towards flood relief from the government, are worried if they will ever get it. Almost religiously customers have been visiting their banks for updating passbooks since many of them do not have online banking facilities.\n\nOfficial sources said there was no need for panic and that until Tuesday, 94.47 per cent of enumerated residents had received the compensation. “The delay in crediting the money was due to a bank strike. By Wednesday the fund transfer is likely to be completed,” said the source.\n\n“The two nationalised bank branches in Bharathi Nagar in Vyasarpadi have been witnessing long lines every day. People wait endlessly with their passbooks only to be told to come back later. At a time when we have lost everything we had, this assistance will help us tide over these difficult times,” said N. Thangaraj, a resident of Udayasuryan Nagar.\n\nChief Minister Jayalalithaa had announced that 30.42 lakh residents would get compensation. In the first phase 14 lakh homes had been enumerated and funds were released on January 4. The remaining families would get the financial relief on January 11, she had said. Those with partially or fully damaged huts/pucca houses were to be paid a compensation of Rs. 10,000 and houses that were water-logged for over 48 hours are being provided Rs. 5,000.\n\nAs the days pass and with January 11 too gone, people are worried that they would never get the money. “I have been asking neighbours if they have received the money. But none of them has. A few of them were not in their homes when the enumerators came. They don’t know where to go. Also, since we had water-logging we are worried that if we don’t get the money we don’t know what to do. Some officials were saying that it is not necessary if our homes were visited by enumerators, which is worrisome,” said B. Kannan, a resident of Thoraipakkam that falls under Kancheepuram district.\n\n‘The delay in crediting\n\nthe money\n\nwas due to a bank strike’", 
    "section": "national", 
    "title": "Residents worried they may not get compensation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}