{
    "author": [
        "K Manikandan"
    ], 
    "text": "Chennai Central station, used by nearly four lakh people every day, is among the biggest railway terminals in the country. Given this, the lack of sanitary conditions around it is keenly felt.\n\nThe pavement at V.O.C. Road (Walltax Road) has become almost out of bounds for pedestrians as it is being used as an open toilet during day and night.\n\nThe stretch from Poonamallee High Road intersection to V.O.C. Nagar bus stop is simply unusable, pedestrians and traders say. Passengers and railway staff on platform No.1 of Central station find the stench unbearable.\n\nS. Ganapathy, who has been running a mobile book store on Walltax Road for nearly 30 years, said the situation had been worsening by the day.\n\n“There is a public toilet on the opposite side, but people waiting for buses towards Washermanpet cannot walk across the road in the narrow space through the median,” he pointed out.\n\n“People new to the city come here by mistake to board buses to north Chennai. Waiting on the stretch is a big problem for all,” said R. Santhi of Poonamallee. Traders here said that small towns had taken novel initiatives to create enough public toilets around bus stops and railway stations, but the condition around Chennai Central was pathetic.\n\nMr. Ganapathy pointed to mobile toilets that were placed on the pavement many months ago. But they were just gathering dust and yet to be commissioned.\n\nCorporation staff said they sprayed disinfectant powder on the pavement frequently, but it was impossible to prevent people from soiling it.\n\nThe staff at Zone V of Corporation said the public toilet near Southern Railway head office was well-maintained, but people waiting for buses towards Washermanpet did not use the facility. The road was maintained by the State Highways Department and they were yet to give the nod for commissioning the mobile toilets. Once they get it, they would provide the units with water and make them operational immediately.", 
    "section": "national", 
    "title": "Sanitation around Chennai Central takes a beating", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}