{
    "author": [
        "L Renganathan"
    ], 
    "text": "Government has fixed it at Rs. 2850 per tonne; farmers want Rs. 3,600\n\nTerming the State Government’s State Advised Price of Rs. 2,850 per tonne too meagre, sugarcane growers have urged Chief Minister Jayalalithaa to review the pricing taking into account the cost of cultivation. They want Rs. 3,600 a tonne. However, a section of growers are happy that the State Government had announced the SAP without succumbing to the pressure tactics of sugar mills.\n\nThe Centre had fixed the Fair and Remunerative Price for cane procured during the 2015-16 season at Rs. 2,300 a tonne. The State Government declared an incentive of Rs. 550 including transportation charges of Rs. 100 a tonne, for a total State Advised price of Rs. 2,850.\n\n“Though all public sector and most of the cooperative sector sugar mills had paid money for suppliers last year, private mills had piled up arrears on incentive to farmers for the cane supplied over the past two years. It is close to Rs. 950 crore. Under these circumstances, the Chief Minister has announced the SAP. We wonder whether the growers will get any benefit. We look up to her to ensure that,’’ says president of the Pettaivaithalai Cane Growers’ Association, Tiruchi, K. Anbalagan.\n\nAdverse market conditions have forced the sugar mills to default on payment to suppliers. Though the SAP announcement is welcome, only removal of Value Added Tax on sugar and reduction of VAT on its by products will help mills turn profitable and facilitate payment to farmers. The Chief Minister must help growers in asking the mills to pay the current dues and arrears in one go for the growers to really benefit from her decision, according to the State technical secretary, Consortium of Indian Farmers’ Associations, G. Ajeethan of Namakkal.\n\nClaiming that the cost of cultivation has gone up and the SAP did not meet the demands of growers, general secretary of the Federation of Farmers’ Associations in Delta Districts Arupathy P. Kalyanam opines that the thrust of the State Government must be on ensuring that the private sugar mills and some cooperative mills that have defaulted on payments pay the arrears to the growers in one settlement. The State Government must have declared Rs. 3,600 per tonne for the sugarcane purchased from farmers, he adds.\n\nInquiries in the sugar industry circles indicated that there was a concerted attempt to delay the SAP announcement and even if it were to be done a hiked incentive was sought to be avoided. Ms. Jayalalithaa announced a hiked SAP perhaps with an eye on the Assembly elections, they aver.\n\nSugar mills want the State Government to waive the five per cent VAT on sugar besides reducing the VAT tariff of 14.5 per cent for molasses and 30 per cent for ethanol. That move will enable the mills to pay the arrears and dues to cane growers, they claim.\n\nNow, their imports from Maharashtra and Karnataka are cheaper crippling the mills here. Also, the TANGEDCO is yet to pay amount for the power purchased from sugar mills with co generation facility.", 
    "section": "national", 
    "title": "SAP not enough: cane growers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}