{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The short supply of LPG cooking gas refills, reportedly due to the impact of Chennai flood and recent strike of LPG tankers, has hit the customers in delta districts including Tiruchi and Thanjavur.\n\nMany consumers in Tiruchi complain that they have to wait for at least 20 to 30 days to receive refills since the day of registration. The situation seems to be worse in flood hit districts including Cuddalore, Nagapattinam and Tiruvarur districts.\n\nThe waiting period about two months ago was just 7 to 10 days from the date of booking. The problem that began to surface since the first week of December, particularly after the Chennai flood, is still continuing. The LPG gas dealers, who continue to get pressure from customers, find it hard to clear the backlog.\n\nUntil the Interactive Voice Response System (IVRS) was introduced, customers had to make phone calls to their respective dealers, who would in turn book for refills and inform the possible date of delivery. Though customers feel convenient in booking for refills through IVRS, they say they do not know when the refills will be delivered at the time of booking through IVRS.\n\n“I booked for cooking gas refill about a month ago. I have received it only after 29 days on Monday. I had to make frequent visits to the distributor for speedy supply. Since the gas exhausted, I was forced to manage the situation with the help of my neighbour,” said a consumer of Cantonment attached to the Chinthamani dealer.\n\nAdmitting short supply of gas cylinders, a LPG gas dealer in Tiruchi said the dealers had not been receiving enough loads for the last few weeks. It had ultimately created backlog ranging from 2 to 4 weeks. The issue had been taken to the notice of concerned officials of Indian Oil Corporation, BBCL and HPCL.\n\nWhen contacted, a senior official of IOC said that backlog was mainly due to diversion of loads to Chennai city, which was severely affected by the recent floods. The diversion had been stopped now. The bottling plants had been asked to refill gas on Sundays and holidays until the backlog was cleared.\n\nThere was an improvement in narrowing down the backlog. The issue would be sorted out within 15 days, he said.", 
    "section": "national", 
    "title": "Short supply of LPG refills continues", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}