{
    "author": [
        "C Jaisankar"
    ], 
    "text": "It will visit residential areas, bus stands, railway stations to gauge cleanliness\n\nA three-member team belonging to a private quality certification firm is in Tiruchi to study the progress in implementing various components of Swachh Bharat Mission, the Centre’s flagship programme.\n\nSimilar survey is in progress in Chennai, Coimbatore and Madurai in the State. These cities have more than one million people.\n\n'The survey will cover capitals of all State and Union Territories. Besides collecting data, the team will make direct observation and collect citizens’ feedback.\n\nThe assessors will visit residential colonies, public toilets, community toilets, bus stands, railway stations and thickly populated areas to gauge the cleanliness.\n\nThe door-to-door garbage collection and disposal of solid waste, open defecation, solid waste management, transportation of garbage, behaviour of residents in using public and community toilets and keeping the environment clean and coverage of individual toilets in the city will also be analysed.\n\nThe team took photo and video records of the areas visited by them.\n\nThe team has visited Central Bus Stand, Chathram Bus Stand, Srirangam, Amma Mandapam, Gandhi Market and others.\n\nFocus on Gandhi Market\n\nThey spent considerable time at Gandhi Market that generates about 10 metric tonnes of garbage daily to study the efficiency of garbage collection method.\n\nCommissioner of Tiruchi Corporation M. Vijayalakshmi told The Hindu that the team had visited several locations in the city to get first hand inputs on solid waste management, functioning of public and community toilets, cleanliness and other aspects of Swachh Bharath Mission.\n\nTiruchi, which was recently adjudged the second cleanest city in the country by the Ministry of Urban Development, could rank among top cities in the implementation of Swachh Bharat Mission, officials said.", 
    "section": "national", 
    "title": "Swachh Bharat Mission: Central team begins survey", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}