{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "One at Basin Bridge; the other two will be set up near Chennai Central\n\nA watchtower that is fitted with searchlights and manned jointly by the Government Railway Police (GRP), the Railway Protection Force (RPF) and the City police will start functioning near the Basin Bridge station from next week.\n\nThe watchtower is one of the three that are being set up to enhance security along the railway tracks, close to stations, and to prevent bag-lifting and chain-snatching incidents, where passengers on trains that slow down are targeted.\n\n“Until a few months ago, around 10 incidents were reported every month. The thieves get into the trains when they slow down or halt for a signal, snatch the chain or bag and flee. During night, some children climb onto the signals and snatch the phones of unsuspecting passengers,” said a GRP officer.\n\nOnce the watchtower is inaugurated, personnel from the three departments will keep a vigil, in shifts. “The searchlights will be useful to check the movement of people at night. The shrubs along the tracks will also be cleared,” added the officer.\n\nMeanwhile, the watchtowers, each of which is expected to be 12-ft high, will also be coming up at two entry points to the Chennai Central railway station. One of them will be set up near the entry point on Wall Tax Road, and the other near the entry point near Moore Market Complex. The railway officials have already inspected the sites,” said the officer.\n\nThe personnel manning the towers will be armed. “Having guns will serve as a deterrent. It will also create a sense of security for the passengers. There are also plans to have a watchtower at Egmore,” added the officer.\n\nPassengers too felt that watchtowers would be very useful.\n\n“More CCTV cameras should also be fixed on the station premises and monitored continuously. It is high time unobtrusive technology was adopted by law enforcement agencies,” said K.S. Moideen, a frequent traveller.", 
    "section": "national", 
    "title": "Three watchtowers to keep an eye on miscreants", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}