{
    "author": [], 
    "text": "RELIGION\n\nSri Andavan Ashram, Srirangam : Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam : Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Krishnar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 41, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nKarivarthan Kainkarya Sabha and Srirangam Educational Society: Painting exhibition on Sri Ramanujar, V.S.Mahal, Keezha Adayavalanjan Street, Srirangam, 10 a.m. to 7 p.m.\n\nSt.Joseph’s College: Indep 2015-16 – inter-departmental cultural extravaganza, 9 a.m.; valediction, Ilavarasu, film actor, chief guest, 2 p.m.\n\nGENERAL\n\nJamal Mohamed College : National seminar on Practical application of interest-free financing for economic development, M. Abdul Rahman, former MP, inaugurates, H.Abdur Raqeeb, convenor, National Committee on Islamic Banking, delivers key note address, 9.30 a.m.\n\nSeethalakshmi Ramaswami College Students Exnora : Awareness programme on Smokeless bhogi, 9.30 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.\n\nHallmark Business School : Pongal celebration, 9 a.m.\n\nChristuraj College: Pongal celebration, 12.30 p.m.\n\nSri Sivananda Balalaya : Inter-school CBSE district kho-kho tournament, Adavathur campus, 9.30 a.m.; prize distribution 5 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}