{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "A pall of gloom descended on rural Koolamedu village, near Attur here, on Wednesday evening, when television channels broke the news of Supreme Court staying the Centre’s notification lifting ban on controversial bull taming sport jallikattu during the Pongal festival season in the State.\n\nOn January 8, Koolamedu, one of the famous centres for holding jallikattu in the western districts, celebrated the announcement on Centre’s notification allowing this sport, thus bringing an end to four-year-old ban.\n\nThe people of Koolamedu and the surrounding villages erupted in joy and celebrated the announcement by firing crackers and distributing sweets. The organisers of the event rushed to the district headquarters to submit an application to hold the event on January 18.\n\nThe preparations for readying the ground commenced the same day.\n\nThe district authorities too swung into action. S. Jayachandran, Revenue Divisional Officer, Attur, visited the village to monitor the arrangements and inspect the facilities.\n\nThe bull owners started preparing the bulls for the event, so too the bull tamers. When the people were eagerly waiting for the big event, the Supreme Court’s directive came as a big shock to the organisers, and the common people alike.\n\nThey gathered in strength on the Perumal Temple ground, the venue for the jallikattu, and staged a black-flag agitation. With their eyes covered using black ribbon, they raised slogans demanding that the government should enact a special legislation ensuring holding of Jallikattu. Women too participated in the agitation.\n\nA. Kandasamy, a former Koolamedu panchayat president and convener of the jallikattu, told The Hindu that the Supreme Court’s directive had shocked the people of the whole western region.\n\nHe said that the rural people who were bent on protecting the traditional culture and heritage of the State were being repeatedly harassed by the Centre since 2009. The innocent rural people have to wage a lonely grim battle against the people in power for upholding the traditional practice of the State.\n\nThe villagers found fault with the Centre for allowing a petition to be filed in the court. The Centre should have persuaded and convinced them to delay the filing of applications, which would have paved way for conducting the jallikattu.\n\nThe residents of Thammampatti town, another noted centre for hosting jallikattu till 2009, too staged a black-flag demonstration in front of the bus stand. They took out a rally in the town too.\n\n‘The Supreme Court’s directive has shocked the people of the whole western region’", 
    "section": "national", 
    "title": "Villagers at Koolamedu express their anger", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}