{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The police have arrested N. Manikandan (27) of V.N.R. Nagar on charges of raping a 16-year-old girl, who delivered a baby at the Coimbatore Medical College Hospital on Monday.\n\nThe police said that the accused, an autorickshaw driver, and the girl were neighbours in the area.\n\nHe fell in love with the girl two years ago and had repeatedly raped the girl, who was a Standard X student of a private school in the area.\n\nThe incident came to light only when the girl delivered the child.\n\nWoman set on fire\n\nKumar of Kullakkapalayam in Pollachi has set wife Uma Maheswari (34) ablaze on Monday while she was sleeping.\n\nThe police said that they had picked up a quarrel over a trip to a relative’s house during Pongal holidays.\n\nHearing Uma Maheswari’s cry for help, neighbours took her to the Coimbatore Medical College Hospital.\n\nHer condition was said to be critical.\n\nKumar is absconding. The couple has two sons – Maruthapandi (13) and Veerapandi (11).\n\nChain snatched\n\nUnidentified persons snatched a gold chain weighing about 16 gm from N. Velumani (68) when she was walking near her house in Lakshmipuram in Singanallur on Monday evening.\n\nChit firm duped\n\nThe police, based on a court directive, have registered a case against L. Jeyaprakash Kumaresan of G.N. Mills on charges of cheating a chit fund company of Rs. 8 lakh. The police said that while working in the company between July 2011 and May 2015, Kumaresan had forged signatures on cheques to defraud the company.\n\nWorkers arrested\n\nThe police have arrested factory workers N. Mahendran of Uthupalayam, and K. Karthik Raja of Arasur on the charge of stealing four copper rods from a factory premises on Monday.\n\nThe police said that the factory security guards caught them while they tried to exit the premises after work.\n\nMan held\n\nThe police have arrested Rajkumar of Veerakeralam on the charge of assaulting a bus conductor and driver on Monday.\n\nThe police said that when the conductor wanted Rajkumar to buy fare, he refused and instead assaulted him.\n\nStudents protest\n\nStudents of Government Law College here staged a protest in front of the principal’s room on Tuesday following difference of opinion with the management on conducting Pongal celebrations.", 
    "section": "national", 
    "title": "Youth held for raping minor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-13"
}