{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "The man who has had an invincible run in electoral battles, M. Karunanidhi is as confident as ever\n\nWhen Dravida Munnetra Kazhagam president M. Karunanidhi was first elected to the Tamil Nadu Assembly in 1957, from the Kulithalai Assembly constituency in the composite Thanjavur district as an Independent candidate (the DMK was then not a recognised party), Jawaharlal Nehru was India’s Prime Minister.\n\nNow, when the fourth generation of the Nehru family is in politics, the nonagenarian from the Dravidian heartland is still hungry for success in the electoral battlefield. His electoral contemporary since 1957, K. Anbazhagan, DMK general secretary, has retired, paving the way for a possible political baptism of a grandson.\n\nThe DMK warhorse’s electoral winning record is perhaps unmatched in the country.\n\nMr. Karunanidhi had been successful in each of the 12 Assembly elections he had contested. While he represented the rural constituencies of Kulithalai (1957), Thanjavur (1962) and Thiruvarur (2011) for a term each in the Assembly, he was twice elected from Saidapet (1967 & 1971), Anna Nagar (1977 & 1980) and Harbour (1989 & 1991) in Chennai. Voters in Chepauk in the State capital elected him in 1996, 2001 and 2006.\n\nHis winning streak would have been another notch higher had he contested in 1984, when his friend-turned-foe and AIADMK founder M.G. Ramachandran, or MGR, famously won lying in a hospital bed in Brooklyn, U.S. Mr. Karunanidhi chose to stay away as he had been elected to the then Legislative Council after resigning as an MLA in 1983 in protest against the attack on ethnic Tamils in Sri Lanka.\n\nMr. Karunanidhi managed to enter the Assembly even while his party lost on five occasions. Two such victories would stand out. In 1980, when MGR fielded H.V. Hande, a medical practitioner in Anna Nagar, against Mr. Karunanidhi, the DMK president faced his toughest electoral battle. He scraped through by a margin of 699 votes.\n\nThe next close call was in 1991 when he was the lone DMK candidate to win, but by a thin margin of 890 votes in Harbour (another candidate won in a by-election), as the AIADMK-Congress combine swept to power on the sympathy wave generated by the assassination of the former Prime Minister Rajiv Gandhi in Sriperumbudur. But he resigned his membership.", 
    "section": "national", 
    "title": "An unmatched appetite for winning elections", 
    "subsection": "general", 
    "date": "2016-03-21"
}