{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "Stir against adoption of Venkatappa Art Gallery in Bengaluru by corporate entity gathers steam\n\nHundreds of artists blowing whistles and holding black umbrellas gathered outside Town Hall on Sunday morning and had one strong point to make — “Venkatappa Art Gallery (VAG) is ours; VAG is not an orphan; stop adoption”.\n\nThey were backed by several writers, theatre personalities, film-makers and other cultural icons as they sent out a message that they were all together to ensure that the lone State-run art gallery is not given to private players as envisaged by the Karnataka Tourism Vision Group.\n\nThe whistling protest was envisaged by the Venkatappa Art Gallery (VAG) Forum to send a “strong message” to the government, said the forum head and former president of the Karnataka Lalitkala Academy Chi.Su. Krishna Shetty.\n\nThe State government has signed MoUs with corporate companies for adoption of tourism destinations, including the VAG.\n\nRecalling Tourism Minister R.V. Deshpande’s decision against going back on the MoU, Mr. Shetty said that attempts by the forum, including representation made to Minister of State for Kannada and Culture Umashree failed to yield any result. “To draw the attention, we have opted for this artistic mode of black umbrella and whistling protest,” he said.\n\nOn March 6, the forum came out in public for the first time and staged ‘Occupy Venkatappa Art Gallery’ protest, as part of which many of them sent out photographs of themselves hugging landmarks on the gallery premises.\n\nSome legal experts, who participated in the protest, even suggested to explore legal options to get the MoU nullified.\n\nConsidering the response for the black umbrella protest, the VAG Forum has decided to intensify the agitation to save the city’s famous landmark. Artists’ groups have started protesting in various cities across the State.\n\n“An online petition campaign has already commenced. Signatures collected will be submitted to Chief Minister Siddaramaiah,” Surekha, coordinator VAG Forum, said.\n\nActor Tara, MLC, who had raised the issue in the Legislative Council, said she would raise the artists’ concern in the budget session through a call-attention motion.", 
    "section": "national", 
    "title": "Art lovers unite to ‘save’ a gallery", 
    "subsection": "general", 
    "date": "2016-03-21"
}