{
    "author": [
        "Maria Akram"
    ], 
    "text": "When former Delhi University lecturer Syed Abdul Rahman Geelani was granted bail by a sessions court on Saturday afternoon, his family residing on the fourth floor of a residential building in Zakir Nagar here were awake all night. The house was being cleaned and lot of food was cooked. Many boxes of sweets were bought and friends and relatives had come over to congratulate the family.\n\n“After Kanhaiya Kumar [JNUSU president] got bail on March 3, we were also hopeful as my father was also facing the similar charges. It took two more weeks for his bail to be granted. But finally there is some relief in the family,” his 23-year-old daughter, Nusrat, a law student, said on Saturday evening.\n\nHowever, the family kept waiting the whole day. Mr. Geelani’s release orders were to come by 1 p.m. on Sunday and the family was expecting him home by 5 p.m. But there was disappointment in store for them. They were told that he won’t be released as the duty magistrate has asked the police to verify both the addresses — his local residential address in Zakir Nagar, Delhi, and his permanent address in Baramullah, Kashmir — that Mr. Geelani has mentioned in his bail bond. The police have asked for “at least” four days to complete the verification process.\n\n“We have been getting calls since Saturday and people are at our home since morning. Food is being cooked and sweets are still packed. It is all so disappointing,” Ms. Nusrat said.\n\nA senior police officer handling Mr. Geelani’s case said a policeman from Delhi would have to be sent to Baramullah for physical verification of the address. “Delhi is his temporary residence. We will have to send a policeman to his hometown. The Kashmiri identity, as you know, raises a needle of suspicion. His address verification is very much needed. We will inform the local police and then send an officer from Delhi. It will take at least 3-4 days,” said the police official (who didn’t wish to be named).\n\nMr. Geelani was arrested on charges of sedition for organising a controversial event at the Press Club of India on February 10. He was arrested on February 16 and has been in jail since then.\n\nMr. Geelani’s lawyer Satish Tamta said it was up to the duty magistrate on how much importance he gave to physical verification of addresses furnished by the accused in bail bond. “To satisfy the bail bond, a surety has to be given. Address verification at times is needed,” he said. The DU professor will have to surrender his passport, and furnish a bail bond of Rs. 50,000 and wait.", 
    "section": "national", 
    "title": "Bail, yet no relief for Geelani", 
    "subsection": "general", 
    "date": "2016-03-21"
}