{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Ahead of the Punjab Assembly elections due in 2017, the Congress and the Shiromani Akali Dal (SAD) are all set to corner the Aam Aadmi Party (AAP) — the new entrant in State politics — on the emotive issue of the Sutlej-Yamuna Link (SYL) Canal, accusing its convener and Delhi Chief Minister Arvind Kejriwal of doublespeak on the water-sharing issue.\n\nLast week, Mr. Kejriwal said he was against the construction of the SYL Canal as Punjab did not have enough water to share with other States. This had irked the Haryana government, which felt the AAP chief was siding with Punjab for political gains. However, changing his tone on Friday, Mr. Kejriwal said there should be “no politics on water and everyone, whether Punjab, Haryana or Delhi, should get water.”\n\nSwaraj Abhiyan, the group formed by ousted AAP leaders Mr. Yadav and Prashant Bhushan — which has been quietly working across Punjab to strengthen their outfit — too criticised Mr. Kejriwal.\n\n“AAP stand on SYL confirms my worst fears — This party is now an election machine. Can do anything for votes!,” Swaraj Abhiyan leader Yogender Yadav said in a tweet.\n\nSwaraj Abhiyan has asked the national units of the Congress, the BJP and the AAP to clarify their stand on the SYL canal issue.\n\nTaking a jibe at Mr. Kejriwal, Yogender Yadav tweeted: “SYL double-speak Haryana Cong vs Punjab Cong Haryana BJP vs Punjab BJP. But AAP is different It’s Arvind vs Arvind.”\n\nThe Punjab Congress and the SAD have accused him of a ‘U-turn’ on the issue of SYL canal, which is at the centre of water-sharing dispute between Punjab and Haryana.\n\nTaking exception to Mr. Kejriwal’s latest neutral stand on water sharing, Punjab Congress chief Capt Amarinder Singh reminded Mr. Kejriwal that only a few days ago he had supported Punjab’s case.\n\n“But the moment Haryana government showed you the mirror, you took a U-turn,” said Capt. Amarinder, cautioning Mr. Kejriwal that politics was not a game of ambiguities, not at least in Punjab where people “will ask you straight questions whether you are with us or against us.”\n\nThe ruling SAD has, on other hand, criticised Mr. Kejriwal of adopting an anti-Punjab stance on the SYL Canal after favouring it initially.\n\nPunjab Revenue Minister and SAD general secretary Bikram Singh Majithia said it proved that Mr. Kejriwal had no serious intention of taking a stand in favour of Punjab.\n\nPolitics not a game of ambiguities, Amarinder tells Delhi CM", 
    "section": "national", 
    "title": "Cong., Akali Dal attack Kejriwal on SYL canal", 
    "subsection": "general", 
    "date": "2016-03-21"
}