{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Owners said though they had complied with the conditions to hold dance performances on the bar premises, the State government was adding to the conditions.— File photo\n\nThe Dance Bar Association said here on Sunday that it is set to move the Supreme Court on March 28 if the Maharashtra government fails to issue them licences, as directed by the apex court, until then. Owners said they had complied with the conditions to hold dance performances on the premises of their bars, and the State government was adding to the conditions and making the process longer.\n\nThe Supreme Court on March 2 asked the State government to start issuing licences to dance bars by March 15. It had ordered that CCTV cameras be installed at the entrance of bars and not in the restaurant or the permit area or the performance area, which was requested by the State government. Following the order, 150 bars sought a licence to hold live dance performances. Key among the 26 conditions is the rule on maintaining distance between dancers and customers.\n\nBharat Thakur, president of the association and owner of three bars that got a licence on March 15 to hold dance performances, told The Hindu that bar owners had complied with all the 26 conditions. He said a meeting for the no objection certificate from the Rangbhumi Prayog Parinirikshan Mandal — one of the 26 conditions — was scheduled to be held on March 18, following which the certificates would have been issued and dancing could have started after that. But the meeting has now been rescheduled to March 26.\n\nBar owners said they will wait until March 26 for the certificate, but complained that the process was getting longer. Owners like Mr. Thakur have applied for fresh no objection certificates from the fire department — which was among the reasons cited by the government for suspending their licences. Following an inspection, government officials had also asked for CCTVs in other parts of the bar, such as the kitchen door as well as the back entrance, and more ‘no-smoking’ signboards — a move Mr. Thakur said was not justified. He said he was fulfilling these conditions nonetheless, but rued that the wait was getting longer. “A fire NOC will not come before seven to eight days.”\n\n“The ban on dance bars was lifted after the Supreme Court’s order. But they (the State government) are not allowing us to open it. We will move the court on March 28 if we don’t get the licence until then,” Mr Thakur said.\n\nThe delay has already caused concern among bar dancers who were hoping to bag jobs once bars reopened. “The girls are worried that the matter will go to court again,” said Varsha Kale, honorary president of the Bar Dancers’ Union.", 
    "section": "national", 
    "title": "Dance bar owners to move Supreme Court against Maharashtra government", 
    "subsection": "general", 
    "date": "2016-03-21"
}