{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a move to encourage biotechnology start-ups as well as tackle the threat faced by India from resistance to antimicrobial drugs, the Department of Biotechnology (DBT) — through the Biotechnology Industry Research Assistance Council (BIRAC) — has invested an initial $1,00,000 to start an India-focussed seed fund to help groups in India compete for the Longitude Prize. This is a £ 10 million prize offered by Nesta, a U.K. charity, to any individual group anywhere in the world that develops an affordable, effective diagnostic test to detect resistance to microbes.\n\nRenu Swarup, Managing Director, BIRAC, said the collaborations were to encourage more biotechnology start-ups out of India. “BIRAC, since its inception, has supported several social entrepreneurs and we are committed to creating an atmosphere where innovation is encouraged and nurtured,” she said. BIRAC is supported by the DBT.\n\nIndia faces increasing instances of tuberculosis patients being resistant to front line drugs. Experts say this is due to lax monitoring and profligate prescription by medical authorities that allow these drugs to be easily available. Indiscriminate usage means that bugs are, overtime, able to resist these medicines. The World Health Organisation statistics for 2014 give an estimated incidence figure of 2.2 million cases of TB for India out of a global incidence of 9 million, with instances of drug-resistant TB rapidly rising.\n\nAlongside Nesta, BIRAC also inked collaboration with Tekes, the Finnish funding agency, to improve competitiveness of Indian and Finnish industries through promoting collaboration in different phases of the knowledge innovation chain and it is teaming up with Horticulture Innovation Australia (HIA) for a joint funding programme to support innovative technologies for sustainable horticulture at a global level.\n\nLast December, the DBT laid out a strategy whereby biotechnology would be at the foundation of a $100-billion industry by 2025, rising from the current $7-$10 billion.\n\nFour missions\n\nThe National Biotechnology Development Strategy, as it is called, expects to launch four missions in healthcare, food and nutrition, clean energy and education; create a technology development and translation network across India with global partnership.", 
    "section": "national", 
    "title": "Dept. of Biotechnology launches fund to tackle anti-microbial resistance", 
    "subsection": "general", 
    "date": "2016-03-21"
}