{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Chief Minister Devendra Fadnavis has sent a legal notice to Congress leader and Rajya Sabha MP Digvijaya Singh seeking his unconditional apology within two weeks.\n\nThis is over latter’s allegations of ‘nepotism’ in the government’s decision to ask developers under the Slum Rehabilitation Authority (SRA) to open bank accounts at the Worli branch of Axis Bank since CM’s wife Amruta is an employee at the bank.\n\nMr Singh in a series of tweets on Friday alleged that the SRA headed by Mr Fadnavis has officially asked all developers to open accounts only at the Worli branch of Axis Bank. “Do you know why? Mrs Fadnavis is the vice president of Axis bank! A windfall for the Axis Bank a private bank. Height of Nepotism!” In his third tweet, Mr Singh said, “Any comments Mr Modi?”\n\nThe notice sent by the CM’s lawyer, Ganesh Sovni, said the tweets are false and defamatory with a view to tarnish the image of Mr Fadnavis not only in the country, but across the world at a time when he has successfully organised the ‘Make In India’ event.\n\n“You have not taken the bare and basic minimum care of verifying the facts or of understanding the rationale behind the decision,” said the notice, adding that the zero-balance accounts are for the benefits of slum dwellers as there have been complaints of non-repayment of rents.\n\n“Axis Bank is providing monthly information on the special accounts and is also ready to provide the details of the activities relating to the special accounts.\n\nFurther, due to core banking, the account can be operated from any branch. Thus, the Worli Branch of Axis Bank is acting as a nodal point to provide monthly information on the payment of rent of all schemes without any cost.”\n\nIt said the Chief Minister’s wife had no role in the SRA’s decision, since in her capacity as the deputy vice-president, transaction banking, she does not engage and/or interact with any government agency and there are no targets sought to be achieved. “Your statements are therefore in absolute disregard of matters of fact and therefore irresponsible.”\n\nThe notice has stated that failure to extend unconditional apology from the same Twitter handle shall be left with no option but to initiate appropriate civil and/or criminal proceedings against Mr Singh.\n\nThe notice said the tweets are false and defamatory with a view to tarnish CM’s image", 
    "section": "national", 
    "title": "Fadnavis sends legal notice to Digvijaya", 
    "subsection": "general", 
    "date": "2016-03-21"
}