{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Residents fear such incidents will become more frequent with the onset of summer\n\nThe sun was a faint speck in the afternoon sky on Sunday as plumes of smoke from the Deonar dumping ground enveloped the entire area from Chembur to up to Navi Mumbai. Locals said the fire on Sunday was worse than it was in January-end, when it had taken the State machinery over four days to douse it. The city’s air quality worsened once again.\n\nThe smoke from the dumping ground on Sunday was visible from as far as the Vashi creek bridge. A thick layer of smoke covered the area starting from the bridge till the end of the Ghatkopar-Mankhurd Link Road.\n\nLocals said the fire episodes at the dumping ground will only get more frequent in the days to come. “This is a continuing process. The area is always on fire during summer, and we fear that the instances may increase as it will start to get warmer,” said Ehsan Ahmed Sheikh, a resident of Rafique Nagar, which is located at the boundary of the dumping ground.\n\nLocal residents said the pile of garbage is always on fire, just that it gets noticed only when there is heavy smoke. “One realises it especially during summer season. If you dig a few feet, you will see fumes coming out. The whole place is always on fire,” said Mr. Sheikh, adding similar fire had broken out two day ago as well.\n\nThe fresh fire and the thick cloud of smoke worsened the air quality, which had improved early this month. On March 4, the air quality index in Chembur had improved to moderate levels, after a long spell of ‘very poor’ pollution levels. However, on Sunday, it slipped to ‘poor’ category recording PM10 and PM2.5 levels at 128 and 221 respectively.\n\nOther parts of Mumbai also witnessed declining air quality. Besides Deonar, fire was reported at the Mulund dumping ground on Saturday night. It was a minor fire and one fire engine was rushed to the spot. However, residents here too said dumping ground fires were a regular phenomenon and no amount of pursuit with the BMC to implement simple solutions. “Fire is nothing new to us. They are a pain in our backyard. We have enough space to set up garbage segregation points, but everything gets mixed up in the BMC trucks anyways,” said Prakash Padikkal, convenor of the Hill Side Resident Welfare Association in Mulund.\n\nIn Bhandup, the air quality index worsened to ‘poor’ on Sunday from ‘moderate’ levels recorded early this month. Other parts of Mumbai also saw similar worsening of air quality. The index for PM2.5 in Borivali was in the ‘good’ category on March 4, but on Sunday, the AQI for PM2.5 slipped in the ‘moderate’ category. Air quality in Malad worsened similarly.", 
    "section": "national", 
    "title": "Fire breaks out at Mumbai dump again", 
    "subsection": "general", 
    "date": "2016-03-21"
}