{
    "author": [
        "Steven Morris"
    ], 
    "text": "Jack Richardson asked Toni Osborne for help but ended up giving her 50p for electricity, starting an unlikely romance\n\nToni Osborne and Jack Richardson after their marriage at theSt. Paul’s church in Clifton, Bristol. Friends and well-wishers donated the wedding rings, as well as clothes, wine and a cake.— Photo: Judith Parkyn\n\nA romance began when a homeless man gave a passerby 50p for her electricity meter — now the couple have pledged to spend the rest of their lives together.\n\nJack Richardson met Toni Osborne two and a half years ago. She said she did not have any spare change and explained her own parlous situation, and Richardson gave her money for electricity so she would not have to spend Christmas in the dark.\n\nOver the next year Osborne regularly walked past Richardson and they became friends. When the squat he was living in was boarded up, Osborne put him up.\n\nTheir friendship developed into love and Richardson, 37, now a Big Issue seller , proposed to her on the spot where he had given her the 50p. The pair married at St Paul’s church in Clifton, Bristol. Friends and well-wishers donated the wedding rings, as well as clothes, wine and a cake.\n\nRichardson said: “I’m 10 miles high. I’m the proudest man on the planet. I’ve been humbled by people’s generosity. I wanted to give my beloved the wedding she deserved and I just wasn’t able to. Because of the kindness of everybody it’s made it real. I feel like I’m living in a fairytale.”\n\nOsborne, 47, said she was “fit to burst”. She said: “I love how it’s touched people’s hearts. We’ve had people say: ‘I never thought I’d fall in love but I heard your story and now it gives me hope for the future.’” They cannot afford a honeymoon but guests have donated money so Richardson can take time off selling the Big Issue to be with his wife.\n\nHe said: “I was in a really bad place when I met Toni. I was having to beg every day just to get enough money for a night in a bed and breakfast.\n\n“It was coming up to Christmas 2013 and I wandered up to this woman to ask her for money and she just burst into tears. She had bought everything ready for Christmas and thought she had saved enough money for the meter, but when she put it in it wasn’t enough.\n\n“She was a couple of pennies away from spending Christmas in the dark.\n\nEven though I was begging, I gave her the 50p to put her lights back on. “We began talking to each other every few weeks as she walked by. At first it was trivial stuff, but then we began sharing a lot and becoming quite close. When I went to stay with her we fell for each other.” He added: “Every day used to be a struggle. I had considered ending my own life. I couldn’t see any way out of the situation and it just seemed to keep getting harder. I couldn’t see any future. But now I have someone stable who I love and who loves me. I’m able to look to the future.” Osborne, who is unable to work due to health issues, added: “Jack has always said that I saw through the homeless person and saw the person underneath. I have had people ask me for money before, and when I couldn’t afford to give them any I would get upset. But Jack went into his pocket and gave me what I needed. Someone without a roof over his head had enough money to help me. He had dignity. It just really blew me away. I was so thrown, I gave him a hug. The next time I bumped into him, he had his Big Issue badge. I kept seeing him, and the more I did, the more I liked him. Before, I was bumbling around on my own. He has changed my outlook on everything completely. It has been one mad love story.” — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Homeless man marries woman he met when asking for change", 
    "subsection": "general", 
    "date": "2016-03-21"
}