{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "At he Kawal Tiger Reserve (KTR) in Adilabad district of Telangana, conservation efforts seem to be moving a step ahead only to slide back by two. Thanks to increasing incidences of man-animal conflict, wild fauna are regularly being killed, defeating the very purpose for which the park came into existence.\n\nIllegal electric wiring put around fences of agriculture fields is emerging as the biggest threat to the wild animals, and many incidents of animals getting electrocuted go unnoticed and unreported. One of the main reasons for farmers discarding other methods of keeping marauding wild pigs at bay in favour of the killer wires is the 24-hour supply of power in villages.\n\nTwo blackbuck were found dead after they came in contact with a live wire, along with a domestic buffalo, at a field at Munial village in Kadem mandal five days ago, apparently because the animals had strayed into the fields in search of water.\n\nThe incident has defeated the efforts of the Forest Department in providing water to the fauna so that they do not stray too far.\n\nEarlier, a nilgai was electrocuted in Tapalpur as it had strayed in search of water. The Forest department did book cases in both the incidents, but it may not serve as a deterrent given the level the man-animal conflict has reached.\n\nThe incidence of electrifying fencing can be seen more in the villages which lie along the Godavari river.\n\nAs villagers draw water for their fields, the wild animals are attracted towards the green stretches.\n\nThe forest department has dug numerous saucer pits for holding water for the animals in the jungles. For example, in Jannaram division alone, there are 32 such pits maintained by the department.\n\n“We are insisting for relocation of villages from the core area only to decrease this phenomenon,” said Imran Siddiqui of the Hyderabad Tiger Conservation Society working on tiger conservation in the area.\n\n“We have collaborated with the Forest Department in launching a poster campaign to make villagers aware of the need for protecting wild animals and the penalty in case they violate laws,\" he said of the effort being made to safeguard the lives of wild fauna.", 
    "section": "national", 
    "title": "Illegal electric fences pose a threat to wildlife in Telangana", 
    "subsection": "general", 
    "date": "2016-03-21"
}