{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Days before Prime Minister Narendra Modi’s visit to Washington DC for the Nuclear Security Summit, a senior Japanese diplomat told The Hindu that India had committed to adhere to the “control of nuclear material, traceability [of nuclear fuel] and consequence in case of a nuclear accident” under the memorandum of understanding (MoU) on civil nuclear cooperation with Japan signed during Prime Minister Shinzo Abe’s visit to India in 2015.\n\nIntrusive, feel experts\n\nThough the bilateral agreement leaves out India’s military nuclear programme, experts warn that the agreed principles impinge on India’s independent nuclear programme as they imply intrusive inspection of civilian nuclear reactors as warranted under the Nuclear Non-proliferation Treaty (NPT).\n\nThe Japanese diplomat pointed out that so far, the world had to rely on India’s verbal commitments on nuclear non-proliferation, but the India-Japan MoU marked the first occasion when India came under legal obligation to uphold non-proliferation concerns.\n\n“There were no tools to bind India, only India’s voluntary self-claimed policy existed, but now there is legally binding measures by the agreement between India and Japan,” said the diplomat, explaining that the commitments were proof of India’s peaceful and transparent intentions in using nuclear reactors solely for energy generation. He said India will be financially accountable if it is found to be violating the principles.\n\nAn Indian official who has been associated with the negotiations said the principles being cited by the Japanese were nothing extraordinary and were part of the “standard template for civil nuclear deal” that India had signed with several countries. However, he refused to address the Japanese assertion that India would have to financially compensate Japan if it violated the principles.\n\nTop experts on nuclear affairs, however, describe the MoU as a “backdoor attempt to draw India into the NPT”.\n\n“The principles of traceability and control over nuclear material are highly intrusive measures that will be used by the Japanese to trace the nuclear fuel that Japanese-origin reactors sold to India will contain,” says Ashok Parthasarathi, former Scientific Adviser to Prime Minister Indira Gandhi. The MoU may destabilise India’s established nuclear deals with Russia and France as they too may demand similar commitments previously denied to them, he said.\n\nA. Gopalakrishnan, former Chairman of the Atomic Energy Regulatory Board, points out that conditions on “traceability of nuclear fuel and safety of nuclear material” do not figure in the deals India concluded with the U.S., France and Russia.\n\n“The government should not accept such intrusive provisions as these are demeaning for a country of India’s stature,” Dr. Gopalakrishnan told The Hindu . Refuting the government’s claim on the “template of civil nuclear deal”, he said: “The official template of nuclear deal did not contain provisions that might empower outside powers to carry out inspection to trace nuclear fuel in India.”\n\nNuclear experts describe the MoU as a backdoor attempt to draw India into the NPT", 
    "section": "national", 
    "title": "Japan says India’s nuclear MoU “legally binding”", 
    "subsection": "general", 
    "date": "2016-03-21"
}