{
    "author": [], 
    "text": "From ready-to-wear knits manufactured instantly to customised dresses produced on inkjet printers, Japan’s apparel industry is turning to state-of-the-art technology in a bold bid to cut labour costs and secure its future.\n\nAt manufacturing giant Shima Seiki’s factory in western Japan, garments materialise in minutes, thanks to digitally-programmed automated machines that can turn out a sample seam-free pullover in half an hour with a push of a button.\n\nThe WholeGarment system patented by the Japanese manufacturer and sold to knitwear companies like Italian luxury brand Max Mara includes a digital design system that allows users to choose patterns, colours and cuts.\n\nOriginally known for glove-making machinery, Shima Seiki took a technological leap in the 1990s in an effort to revive the flagging fortunes of Japanese apparel manufacturers. “Everyone was going overseas to cheaper destinations for manufacturing and we wanted to stop that from happening,” said Kenji Iwamoto of Shima Seiki.\n\nThe WholeGarment system allows one worker to operate 10 machines — thereby lowering labour costs — and uses limited raw material to create seam-free garments that generate no waste, since they require no cutting or sewing.\n\nAfter a slow start that saw around a dozen brands from Japan and Italy sign up the first year, today some 800 companies — nearly half of them Japanese — have jumped on board, contributing to Shima Seiki’s 60 per cent share of the global market for knitting machines.\n\nThe initiative is part of a push by Japan’s knitwear industry to capitalise on its technical know-how to create garments that cannot be replicated elsewhere at a lower cost.\n\nFor young knitwear designers like Motohiro Tanji and Ken Oe, manufacturing outside of Japan isn’t an option.\n\n“It’s easier for me to work with Japanese manufacturers,” Tanji told AFP after his show at Tokyo Fashion Week.\n\n“My designs are complicated and demand a high level of technical skill which I can find here,” said Tanji, who relies on Japanese factories to produce his sculptural, sophisticated knits.\n\nDesigner Oe’s label Coohem emerged out of a push to save his grandfather’s textile company, Yonetomi, which had been in the throes of a decline since the 1990s recession.\n\nOe joined the company six years ago and introduced an emphasis on using digital tools to create intricate high-fashion tweed suits that are now stocked at leading stores, including New York-based Jeffrey and Harvey Nichols in Hong Kong.\n\n“We use about five yarns at a time to design original textiles... [which] other brands cannot copy,” Oe told AFP.\n\nOne of a kind\n\nThe focus on technique and technology has already paid off, with Japan’s knitwear sector registering a 40 per cent increase in exports over a 10-year period beginning in 2006, a rare bright spot in an otherwise dismal picture for textile and apparel exports from the country.\n\nRecognising the need for reinvention in the apparel sector, Japanese textile company Seiren, known more for manufacturing curtains and car interiors, is now fusing fashion and digital know-how to launch a customised clothing line for the masses. — AFP\n\nIt is fusing fashion and digital know-how to launch customised clothing line for the masses", 
    "section": "national", 
    "title": "Japan’s apparel industry in a hi-tech bid to secure its future", 
    "subsection": "general", 
    "date": "2016-03-21"
}