{
    "author": [], 
    "text": "NASA scientists associated with interplanetary space probe New Horizons have revealed the former “astronomer’s planet” and its “intriguing system of small moons” in a comprehensive set of papers describing results from last summer’s Pluto system flyby.\n\n“These five detailed papers completely transform our view of Pluto — revealing the former ‘astronomer’s planet’ to be a real world with diverse and active geology, exotic surface chemistry, a complex atmosphere, puzzling interaction with the Sun and an intriguing system of small moons,” said New Horizons principal investigator Alan Stern.\n\nAfter a 9.5-year, three-billion-mile journey — launching faster and travelling farther than any spacecraft to reach its primary target — New Horizons zipped by Pluto on July 14 last year.\n\nNew Horizons’ seven science instruments collected about 50 gigabits of data on the spacecraft’s digital recorders, most of it coming over nine busy days surrounding the encounter, NASA said in a statement.\n\nThe first close-up pictures revealed a large heart-shaped feature carved into Pluto’s surface, telling scientists that this “new” type of planetary world — the largest, brightest and first-explored in the mysterious, distant “third zone” of our solar system known as the Kuiper Belt —would be even more interesting and puzzling than models predicted.\n\n“Observing Pluto and Charon up close has caused us to completely reassess thinking on what sort of geological activity can be sustained on isolated planetary bodies in this distant region of the solar system, worlds that formerly had been thought to be relics little changed since the Kuiper Belt’s formation,” said Jeff Moore, lead author of the geology paper on Pluto. — IANS\n\nThey have published results from last summer’s Pluto system flyby", 
    "section": "national", 
    "title": "NASA scientists reveal Pluto and its moons", 
    "subsection": "general", 
    "date": "2016-03-21"
}