{
    "author": [
        "K A"
    ], 
    "text": "The much-hyped Palakkad Gap eco-system restoration efforts initiated by the Kerala State Biodiversity Board last year with the active involvement of 17 local bodies and the Social Forestry wing of the Forest Department continues to remain a non-starter in spite of the claims that it would help address escalating heat in the region in the coming years. Though a number of tree saplings were planted with much fanfare in five grama panchayats marking the commencement of the initiative, all of them failed to withstand the challenges of hostile climate in the absence of follow-up initiatives. No steps were taken for safe protection and watering of the saplings even during the hot summer months.\n\nThe 45-km Palakkad gap in the Western Ghats is facing serious environmental destruction largely owing to indiscriminate sand and granite mining. Massive deforestation is killing the Bharathapuzha and its tributaries, which flow through the area, and its highly fragile eco-systems. The Biodiversity Board initiative was aimed at rejuvenating the river eco-system by restoring the green cover.\n\nIt was also perceived as a step to counter the challenges posed by global warming, destruction of wildlife habitats and adverse changes in land use pattern. There were even assurances of ensuring participation of various bio-diversity youth clubs in the district to make the project a participatory one. Efforts were also on to link the NREGA programme with the initiative. The pilot project was planned in Vadakarapathi, Pattanchery, Kozhinjampara, Puthussery and Peruvembu panchayats. The gala inaugural event was held in Peruvembu in February last.\n\nWhen contacted, Biodiversity Board officials blamed the local bodies for completely neglecting the project. Panchayat bodies clarify that the board had done no follow-up action.\n\n“It was a long-awaited initiative addressing the importance of restoring greenery of the gap, which is under destruction. The board has the responsibility to coordinate with panchayats and find resources for implementing it. Only by increasing the green cover of the gap, we can withstand escalating heat in Palakkad during summer. The heat is already unbearable,’’ said Kalloor Balan, environmnal activist.\n\n“It needs not much additional funds. Better coordination with local bodies and channelising resources like NREGA would help implement it easily. Schools and colleges in the region can also contribute,” said Shyam Kumar, environmentalist.\n\nNo steps taken for safe protection and watering of the planted saplings even during the hot summer months", 
    "section": "national", 
    "title": "Palakkad Gap eco-restoration drive a non-starter", 
    "subsection": "general", 
    "date": "2016-03-21"
}