{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "While Congress vice president Rahul Gandhi blamed the BJP government at the Centre for the crisis in Uttarakhand, Union Finance minister Arun Jaitley said the Congress was responsible for its own troubles. “The Congress, be it in Bihar or West Bengal has lowered its sights to play second fiddle to other parties, and now blames the BJP when its own partymen turn against it,” he said.\n\nOn March 12, senior Congress leader Ambika Soni, who oversees Uttarakhand as party general secretary, had a two hour meeting with Mr. Bahuguna. “The meeting ended on a positive note,” said Kishore Upadhyay, Congress president in Uttarakhand. “We never thought he (Bahuguna) would stoop so low.”\n\nAt the meeting, Ms. Soni had assured Mr. Bahuguna that one of the vacant ministerial berths would be filled according to his choice and the issue of ejecting the PDF ministers would be sorted once the assembly session is over.\n\n“It’s hard to believe that he turned his back on those terms and betrayed us,” said Mr. Kishore, who was present at the meeting.\n\nAccording to Mr Kishore, a week ago, the State leadership again spoke to Mr. Bahuguna and three other leaders, who later rebelled, to make sure there were no hard feelings among the party ranks.\n\n“They assured us that everything was fine,” Mr. Kishore said. “Even the day they created ruckus in the Assembly, three of them [rebels] had lunch with me. There was no sign of resentment on their face.”\n\nSince the open rebellion and the floor test scheduled for March 28 that will decide the fate of the Harish Rawat government the party high command has decided to stay away from the crisis.\n\n“I think Harish Rawat is very equipped to deal with this matter,” said Ms. Soni. “The entire leadership supports him and we are very sure that he has a majority in the house.”\n\n(With inputs from PTI)", 
    "section": "national", 
    "title": "Rahul blames BJP for Uttarakhand crisis", 
    "subsection": "general", 
    "date": "2016-03-21"
}