{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "M. Veerappa Moily says the Lokayukta and ACB will complement each other while B. Janardhana Poojarywants the notification withdrawn.— File Photo\n\nLeaders accuse Chief Minister Siddaramaiah of taking a ‘unilateral decision’\n\nSharp differences have emerged in the Karnataka Congress over creation of an Anti-Corruption Bureau (ACB) as a section of the leaders have questioned why the party was not consulted and accused Chief Minister Siddaramaiah of taking a “unilateral decision”.\n\nSenior Congress leaders S.M. Krishna, B. Janardhana Poojary and B.K. Hariprasad have taken exception to the Chief Minister’s decision and said the ACB dealt a big blow to the Karnataka Lokayukta. They viewed that the ACB would weaken the Lokayukta and damage the party’s fight against corruption.\n\nSpeaking to The Hindu on Sunday, Mr. Hariprasad said: “Instead of giving more powers to the Lokayukta to crackdown corruption, the government has diluted its powers by creating the ACB.”\n\nMr. Poojary, former MP, registered his strong opposition to the formation of the ACB and demanded withdrawal of the notification.\n\nAn office-bearers’ meeting of the Karnataka Pradesh Congress Committee held last week too had expressed reservations on the ACB. It is learnt that some of the office-bearers had questioned the necessity of the ACB in the current circumstances when the Lokayukta itself was embroiled in controversy over alleged extortion of money.\n\nSources said a section of leaders, who have expressed resentment against the ACB, have complained to the party high command against the Chief Minister for his unilateral decision.\n\nHowever, Digvijaya Singh, AICC General Secretary in charge of the party’s affairs in Karnataka, said he was not aware of the issue. Congress Leader in the Lok Sabha Mallikarjun Kharge, too, said he was unaware of the details of the ACB.\n\nMeanwhile, former Union Minister and MP M. Veerappa Moily said the ACB would reduce the burden on the Lokayukta and both institutions would complement each other. The Opposition BJP and Janata Dal (Secular) are likely to take on the government on the issue of formation of ACB in the State legislature on Monday.", 
    "section": "national", 
    "title": "Rift to the fore in Karnataka Cong.", 
    "subsection": "general", 
    "date": "2016-03-21"
}