{
    "author": [
        "Devesh K"
    ], 
    "text": "Apex court also slapped Rs 10 lakh fine for repeatedly evading ED summons in 2015\n\nBusinessman Vijay Mallya, under investigation for suspected money-laundering in the Rs. 900 crore IDBI Bank loan case, was indicted last July by the Supreme Court for alleged non-compliance of the Enforcement Directorate summons under the now-repealed Foreign Exchange Regulation Act .\n\nAwarding exemplary costs of Rs. 10 lakh to be paid to the Supreme Court Legal Service Authority, the two-judge Bench dismissed Mr. Mallya’s appeal on July 13, 2015, observing: “The entire approach of the appellant is a sheer abuse of the process of law.”\n\nThe judgment said exonerating such an accused, who successfully evades the process of law and thereby commits an independent offence on the ground that he is found to be not guilty of the substantive offence would be destructive of law and order.\n\n“It is also possible, in certain cases that the time gained by such evasive tactics adopted by a person summoned itself would result in the destruction of the material which might otherwise constitute valuable evidence,” observed the court.\n\nQuoting Mr. Mallya’s response to one summons, which expressed willingness to fix a mutually convenient date of appearance, the court observed: “Such a stand by a person facing allegation of serious nature could hardly be appreciated. Obviously, the enormous money power makes him believe that the state should adjust its affairs to suit his convenience.”\n\nIncidentally, on March 18, the businessman did not appear before the ED in response to the summons in the money-laundering case registered earlier this month. He is learnt to have requested that the date of his questioning be put off to April. The charge against Mr. Mallya in the case under the FERA was that he failed to appear on four occasions from September 1999 to January 2000.", 
    "section": "national", 
    "title": "SC rapped Mallya for ‘sheer abuse of law’", 
    "subsection": "general", 
    "date": "2016-03-21"
}