{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "But the cylinder bombs they made were defective and exploded in a house in Uttar Pradesh\n\nFour alleged members of the banned Students Islamic Movement of India (SIMI), who had jumped prison and were arrested in February after a long chase, planned to attack a Rashtriya Swayamsevak Sangh (RSS) congregation to avenge the Muzaffarnagar riots of 2013, their interrogators say.\n\nThese officials say the “cylinder bombs” devised by them to be set off at the venue turned out to be faulty and exploded in a house they had rented at Bijnore in Uttar Pradesh in September 2014, a year after they escaped from the Khandwa prison in Madhya Pradesh.\n\nAmjad Khan, Zakir Hussein, Mehboob Guddu and Salik, alias Sallu, had allegedly learnt to make the cylinder bombs — a first of its kind in India — from Inspire , an Al-Qaeda magazine. Since these men never used phones and the Internet for fear of being tracked, Inspire came in handy to them as it was the only jihadi literature to have been translated into Hindi, an official says.\n\nIn May 2014, they allegedly planted an IED (improvised explosive device) aboard the Bengaluru-Guwahati express in May 2014 to avenge the 2014 riots in Lower Assam, where 32 migrant Muslims were killed by suspected Bodo militants, and the blast killed a woman software engineer at the Chennai Central station. They planted another IED outside a police station in Pune in July 2014 to avenge the death of one of their accomplices in an encounter with the anti-terrorism squad in the city a few years ago.\n\nAmjad Khan, Zakir Hussein and Mehboob Guddu jumped jail, along with their leader Abu Faisal and two others. Salik joined them later on.\n\nFaisal was re-arrested the same year and the two others, Mohammad Ejazuddin and Mohammad Aslam, were killed in an encounter with the Telangana police in Nalgonda in April 2015. Amjad Khan, Zakir Hussein, Mehboob Guddu and Salik were arrested from a house in Rourkela in Odisha after a three-hour operation involving an exchange of fire. Najma Bee, the mother of Mehboob Guddu, was also arrested from the house.\n\nWanted in 17 cases\n\nThe four men had been on the radar of the agencies for their alleged role in at least 17 incidents of blasts, explosions and robberies across the country.\n\nIn the custody of the Madhya Pradesh Police at present, they reportedly told interrogators that they had come to know of an RSS congregation to be held in Muzaffarnagar in September 2014 and wanted to avenge the killings of Muslims killed in the riots.\n\n“The accused wanted to make a strong pressure group to avenge the persecution of Muslims and decided to go for selective killings. To fund themselves, they looted banks and committed robberies,” alleged an interrogator from Madhya Pradesh.\n\nOn the move\n\nThe accused had also planted an IED outside Farashkhana police station in Pune in July 2014, in which blast five persons were injured. “One of their accomplices was killed in an encounter with the Pune Anti Terrorism Squad (ATS).\n\nTo avenge his death they wanted to kill policemen. The IED turned out to be faulty again,” said another official from the Telangana police. Since the MP ATS was hot on their trail, the accused kept moving in areas bordering the State.\n\nBank robberies too\n\nThey allegedly robbed a bank in Karimnagar (Telangana) on February 1, 2014. Telangana Police set out on a hunt and they were cornered in Nalgonda district last year when two of them were killed.\n\nAlmost 100 men were deployed on the ground to track the men and on February 16 this year, they were traced to the house at Rourkela in Odisha, from where they were arrested.\n\n“One of the accused, Mehboob, had suffered severes during the Bijnore blast. When his condition started worsening, the accused approached his mother. Najma Bee joined the men and took care of the son.\n\n“Since they were wanted, the group never stayed at the same place for more than three-four months. They were cautious enough not to use phone or any other communication device,” said a senior National Investigation Agency (NIA) official.", 
    "section": "national", 
    "title": "SIMI men wanted to bomb RSS meet", 
    "subsection": "general", 
    "date": "2016-03-21"
}