{
    "author": [
        "T V"
    ], 
    "text": "Goats quenching their thirst at Balewad village, near Honna Kiranagi, in Kalaburagi district; (right) the two springs discovered in the village.— Photos: Arun kulkarni\n\nThe first was discovered by a farmer at Balewad village while digging a pond\n\nIt was like finding an oasis in a desert.\n\nThe people of the Honna Kiranagi village in Kalaburagi district, which is facing severe water shortage, were thrilled to find natural water springs jetting out of arid land in at least four spots.\n\nThe first spring was discovered by chance in the field of farmer Thippanna at Balewad village while digging a pond.\n\nSadashiva Haralayya, who volunteers as Kshetra Sahayaka and liaises between officials and workers for jobs under MNREGA, spotted it first. “When a stone slab was removed to clear the debris, water began gushing out and within hours the entire pond filled up with water. This is an unexpected bonanza, and if a borewell is drilled here, we may get enough water to quench the thirst of Honna Kiranagi and surrounding villages,” a beaming Mr. Haralayya said.\n\nA few meters away, on a kutcha road where bullock carts ply, two other springs were spotted. “This may be a potential spot for water. Geologists should be called to take a decision on drilling borewells here,” said Shambulinga Doddamani, a Tilagol local.\n\nAt least two more springs appeared in the dried up Honna Kiranagi stream in the adjoining Saradagi village. It sprung from a bed of limestone slabs and soon a large pool of water had collected, and the livestock began to drink from it.\n\nMr. Haralayya said this phenomenon was surprising as all other sources, including the open well in Honna Kiranagi had dried up. Even drilling borewells up to 450 ft had not produced water.\n\nMr. Thippanna is now willing to donate a piece of his land to the government to drill a borewell near the Krishi Honda so that there will be drinking water for the village.\n\nAll he asks in return is for the government to drill a borewell for him in his field.", 
    "section": "national", 
    "title": "Springs a surprise in arid Kalaburagi", 
    "subsection": "general", 
    "date": "2016-03-21"
}