{
    "author": [
        "Sathish G T"
    ], 
    "text": "Opposed to Dalits demanding entry into the village temple, the ‘upper caste’ residents of Arakere village in Arsikere taluk of Hassan district have decided to cancel a car festival scheduled for April 1.\n\nRepresentatives of the ‘upper caste’ groups in the village announced this decision after a meeting convened by the taluk administration here on Sunday.\n\nArsikere taluk administration convened the meeting following Dalits’ complaint that they were being discriminated in the festival, besides demanding entry into Kariyamma Temple.\n\nA few representatives of the Dalit community had met Additional Deputy Commissioner K.M. Janaki in Hassan on Saturday and complained that untouchability was still being perpetuated in the village.\n\nThey were denied entry into the temple and were forced to continue with traditional customs, which include cleaning the village roads. The Additional Deputy Commissioner had ordered the officers concerned to hold a meeting and resolve the matter.\n\nIn the village of 1,400 houses, Dalits have a minority presence with just over 100 families. During the annual Kariyamma Jatra Mahotsav, village residents of all castes participate.\n\nThe Dalits demanded that the music band, which visits colonies of the ‘upper castes’ as part of the festival, visit their colony too. This was not accepted by the ‘upper castes’, who also opposed their temple entry.\n\nVijay Kumar, district president of Madiga Dandora Horata Samiti, said: “During the meeting, the ‘upper caste’ people said they would not oppose entry of Dalits into the temple and assured the officers that the community would not be discriminated against. But, they changed their stand as the meeting ended. They announced that the festival would be cancelled. This is only to avoid Dalits from entering the temple.” The samiti has decided to hold a protest in Hassan.\n\nDasharatha Murthy, Arsikere DySP, who attended the meeting on Sunday, told The Hindu: “Initially, everybody agreed to resolve the differences and hold the festival as per schedule. However, later they changed. Whether they conduct the festival or not, we will ensure law and order is in the place.”\n\nThe annual Kariyamma Jatra Mahotsav was scheduled\n\nfor April 1", 
    "section": "national", 
    "title": "To deny Dalits entry, ‘upper castes’ cancel temple fest in Hassan", 
    "subsection": "general", 
    "date": "2016-03-21"
}