{
    "author": [], 
    "text": "U.K.’s Isle of Man, located in the Irish Sea, is a biologically diverse marine environment. It is among 20 sites added to UNESCO’s network of protected biosphere reserves.— Photo: UNESCO\n\nThe United Nation’s cultural body UNESCO has added 20 new sites to its network of protected biosphere nature reserves, including two in Canada and two in Portugal.\n\nThe status was conferred during a two-day meeting in Lima that ended on Saturday, which brought the total number of biosphere reserves to 669 across 120 countries.\n\nIn Canada, the Tsa Tue area in the country’s Northwest Territories that includes the last pristine arctic lake was added to the list, as was the Beaver Hills region of Alberta, which has a landscape formed by a retreating glacier.\n\nBritain’s Isle of Man, located in the Irish Sea in a biologically diverse marine environment, and Mexico’s Isla Cozumel were also selected for the network.\n\nAnd in Portugal, the entire Island of Sao Jorge, the fourth largest in the Azores Archipelago, was designated a reserve in addition to the Tajo River region between Portugal and Spain.\n\nThe list of new UNESCO biosphere reserves also includes sites in Algeria, Ghana, Haiti, India, Indonesia, Iran, Italy, Kazakhstan, Madagascar, Morocco, Peru, the Philippines and Tanzania.\n\nOf the hundreds of locations on the list, 16 are sites that stretch across more than one country. Spain is the country with the largest number of registered reserves.\n\nDuring the meeting, nine extensions to existing biosphere reserves were also approved.\n\nMeanwhile, the Australia ended its push to log World Heritage-listed forests on the island State of Tasmania on Sunday, after UNESCO issued a report calling for the area to remain protected from logging. — AFP & Reuters\n\nNow, there are 669 protected biosphere nature reserves, spread across\n\n120 countries", 
    "section": "national", 
    "title": "UNESCO updates protected biosphere reserves list", 
    "subsection": "general", 
    "date": "2016-03-21"
}