{
    "author": [
        "R Sivaraman"
    ], 
    "text": "B.A.LLB included among list of professional courses\n\nCENTAC has proposed to publish results of all selected candidates with photographs from the 2016-17 academic year.File photo\n\nThe Centralised Admission Committee (CENTAC) has set in motion the admission process for professional courses for the academic year 2016-17 and issued a notification inviting applications from candidates seeking admission.\n\nMonths ahead of the admissions for next academic year, the government last month passed an order entrusting the task of admissions to various professional courses for 2016-17 to the newly constituted CENTAC.\n\nThe Education Secretary is the chairman of the committee and 11 others, including the Health Secretary, are members.\n\nIn order to coordinate and regulate various activities connected to admission , V. Govindaraj, Director (In-charge), Indira Gandhi Medical College and Research Institute, Puducherry, was made the convener of CENTAC 2016-17.\n\nEducation Secretary G.Rakesh Chandra told The Hindu , “This year, we have included B.A.LLB five year- integrated course into the list of professional degree courses for the academic year 2016-17 under the purview of CENTAC.”\n\nMr. Chandra said, “From the academic year (2016-17), CENTAC has proposed to publish results of all selected candidates with photographs for all categories. Necessary software for this would be developed and the application format modified accordingly. It would also be programmed to give the Admit Card with photograph of the selected candidate for easy identification.”\n\nNew rules\n\nA continuous period of service for a minimum of three years in Puducherry is now mandatory for Central Government employees to get their children admitted to professional courses in the Union Territory, according to new norms introduced by Government.\n\nThe rule change also insists upon children of Central Government employees having studied in the Higher Secondary Course of two years in any of the schools in Puducherry and should have also passed the Higher Secondary Examination from the same school.\n\nThe online application forms for admission along with information bulletin for 2016-17 can be downloaded from the CENTAC website, www.centaconline.in from May 9. The last date for applying online is May 25.\n\nThe printout of online application should be sent by post or courier to the Convener, CENTAC on or before May 30.", 
    "section": "national", 
    "title": "Admission to professional courses under CENTAC on", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}