{
    "author": [
        "R Srikanth"
    ], 
    "text": "Pension and other retirement benefits due to over 8,000 employees pending for several months\n\nThousands of former employees of the eight transport corporations in the State no longer have the pleasure of a ‘happy’ retired life, as they are staring at an uncertain financial future. The reason is delayed payment of pension and other retirement benefits.\n\nThe delayed payment of commuted pension, dearness allowance arrears and in certain cases the pension amount itself is driving employees to take desperate measures.\n\nMore than 8,000 retired employees are running from pillar to post to get their pension benefits.\n\nM. Natarajan, who worked as a driver for Tirunelveli Transport Corporation at Kovilpatti depot, distressed at having to wait for several months to get the commuted pension amount, committed suicide.\n\nThe family members of R. Jayaraman, who worked as a driver in the Metropolitan Transport Corporation (MTC) at Basin Bridge depot, were not able to save him, because of lack of funds. P. Balakrishnan, secretary, State Transport Employees Union, said the deceased driver retired on July 31, 2015, but got pension cheques in two instalments dated September 30 and October 31. In the meantime he had developed major health complications and died on September 6, because he did not have funds to finance his treatment.\n\nMr. Balakrishnan said except for employees of MTC and State Express Transport Corporation (SETC) the other six transport corporations — Madurai, Villupuram, Kumbakkonam, Salem, Tirunelveli and Coimbatore — have been defaulting on various retirement benefits. He listed out those defaulting on payment of DA arrears (pending for more than 20 months), commutation of pension amount, gratuity, provident fund and leave salary encashment.\n\nArumugam Nainar, secretary, Tamil Nadu State Transport Employees Federation, said what was disheartening was the manner in which the commuted pension (one-third amount of the total pension amount paid in advance) entitled to an employee at the time of retirement was yet to be paid, but that ‘recovery’ was being carried out. At present the commuted pension has been proposed to be paid in 24 monthly instalments, literally making a mockery of the commutation of pension system, he added.\n\nThe office-bearers of the State Transport Employees Union brought complained of non-payment of any amount to retiring employees under the Social Security scheme, though money was deducted from their salaries. Similarly, the transport union members highlighted the failure of the transport corporations to ‘pay back’ the contribution made at the time of joining to Indian Road Transport (IRT) retired employees, as it is mostly being treated as ‘donations’.", 
    "section": "national", 
    "title": "Agonising wait for retired transport staff", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}