{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Both the AIADMK and DMK are indulging in vote bank politics in the caste-based ‘honour’ killing of Dalit youth Sankar in Udumalpet recently, said U. Vasuki, National vice-president of the All India Democratic Women’s Association (AIDWA), here on Tuesday.\n\nThe State Government did not react to this gory incident. The DMK almost took three days to come out with a statement on this incident. This only showed that both the Dravidian parties are sailing in the same boat on such crucial issues and this is totally unacceptable, Ms. Vasuki said at a seminar on ‘humanism’ in the city on Tuesday.\n\nThe event was organised jointly by the AIDWA, Democratic Youth Federation of India (DYFI), Tamil Nadu Progressive Writers and Artistes Association, and a few other organisations.\n\nMs. Vasuki said that Chief Minister Jayalalithaa’s silence was crueller than the murder of Sankar.\n\nExpressing serious concern at the increase of ‘honour’ killings in the State, the AIDWA leader said that as many as 81 Dalit-based ‘honour’ killings have been reported in Tamil Nadu in the last three years. It is unfortunate that honour killings of Dalits are not being considered as a heinous crime by the society.\n\nThe People’s Welfare Front is involved in identifying the attacks on Dalits and in activities to bring recourse to the affected people.\n\nK. Jothilakshmi, State Secretary of AIDWA, N. Praveenkumar, Salem district secretary of the DYFI, Niraimathi, district secretary of Tamil Nadu Progressive Writers and Artistes Association, and others spoke.\n\nMs. Vasuki felicitated A. Kaliaperumal, general secretary of the association, and M.K. Kalaiselvi, an office-bearer.\n\nThe seminar commended the All India Insurance Employees Association for coming forward to bear the educational expenses of Sankar’s widow Kausalya.\n\nF. M. Roobini Sundar, coordinator of the Samam Kudimakkal Iyakkam, administered a pledge against casteism to the participants.", 
    "section": "national", 
    "title": "AIADMK, DMK indulging in vote-bank politics, says Vasuki", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}