{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Braving sweltering heat, hundreds of students made a beeline to Aranmanai to take a glimpse of various facets of Museum as the Tamil Nadu Department of Museums moved in the ‘Museo’ Bus,’ carrying the message of museum to the doorsteps of the students in the districts.\n\nAs part of the “Education with Entertainment” project, the Department of Museum brought the ‘Museum on Wheels’ here on Tuesday to create awareness on arts, history, culture, heritage and civilisation after stationing the ‘Museo’ Bus in Paramakudi on Monday.\n\n“This is part of our moto to take museum to students and general public, who could not afford to visit museums,” V. Sivakumar, District curator, Department of Museum said adding this time, the department focused on the theme, ‘Education with Entertainment’.\n\nThe bus with about 50 windows, showcasing archaeology, numismatics, art, culture, history, heritage, anthropology, botany and geology was a virtual treasure trove for the students as they lined up in batches to take a glimpse.\n\nEach window depicting various events such as Indus-Valley civilisation, Egyptian civilisation, Science and Technology and Arms and Weapons had brief descriptions in both Tamil and English for easy understanding of students. Besides, two staff members of the Department of Museum were deployed to explain the features.\n\nAround 4,000 school and college students visited the bus at four different locations in Paramakudi on Monday and an equal number of students here on Tuesday, Mr. Sivakumar said. A window on numismatics displayed replicas of coins of Gupta and Mogul periods. The bus would be parked in Sethupathy Government Arts College on Wednesday before it moved to Virudhunagar district, he said.", 
    "section": "national", 
    "title": "All for a peek into ‘Museo’ bus", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}