{
    "author": [
        "R Sujatha"
    ], 
    "text": "For engineering admissions only online applications will be accepted this year\n\nAnna University on Tuesday announced that the online registration for application forms under the Tamil Nadu Engineering Admissions (TNEA) for the academic year 2016-17 will begin on April 15.\n\nA notification to this effect will be issued on April 14. This year applications can be made only through online, the university officials said.\n\n“TNEA has proposed to operate facilitation centres (TFC),” registrar S. Ganesan said. The last date for application is seven days from the date of the publication of the higher secondary results and the last date for the receipt of filled-in applications is 10 days from the date of the publication of class XII results, according to a release issued by the University.\n\nHowever, the University's decision to receive applications online only, for Tamil Nadu Engineering Admission is bound to cause consternation among students of government schools, teachers say.\n\nAccording to teachers of government schools, the decision will cause confusion among students since they are not quite conversant with filling in applications online.\n\nStudents will be pushed into a situation of depending on their respective schools for filling in the applications. But, there is no certainty that there will receive the requisite support during the vacation time, according to Palanichamy, a school teacher.\n\nBut, another section of teachers is hopeful that the students will take Anna University's decision in their stride since they would have gained the expertise in making online entries using the free laptops supplied to them under the government scheme.\n\nTeachers say the university could go ahead with the online application process if the facilitation centres are established in sufficient numbers. The nodal centres are necessary to ensure that no mistakes are made while entering particulars and must guide the students until they receive the acknowledgement from the university, an official of Education Department opined.", 
    "section": "national", 
    "title": "Anna varsity to start online registration from April 15", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}