{
    "author": [
        "R Sujatha"
    ], 
    "text": "Anna University on Tuesday announced that the online registration for application forms under the Tamil Nadu Engineering Admissions for the academic year 2016-17 will begin on April 15.\n\nA notification to this effect will be issued on April 14. This year, applications can be made only through online, university officials said. “The TNEA has proposed to operate facilitation centres (TFC) for aspirants who have difficulty in registering for the forms ,” Registrar S. Ganesan said. Applications forms will have to be downloaded within seven days of publication of the higher secondary results and they should be submitted within 10 days of the publication of class XII results, according to a release issued by the University.\n\nHowever, the university’s decision to receive applications online only for Tamil Nadu Engineering Admission is bound to cause consternation among students of government schools, say teachers. According to teachers of government schools, the decision will cause confusion as students are not conversant with filling in applications online. They will be forced to depend on their schools. But, there is no certainty that they will receive the support during the vacation time, according to Palanichamy, a schoolteacher.\n\nBut, another section of teachers is hopeful that students will take be able to file applications since they would have gained the expertise in making online entries using free laptops supplied to them under the government scheme. Teachers say the university could go ahead with the online application process, if the facilitation centres are established in sufficient numbers.\n\nS. Murugan, district secretary of Tamil Nadu Graduate Teachers’ Association who works in a government school in Karupatti village in Madurai district, said that the move will be a hindrance for aspiring students. “For instance, students from my area have to go to Vadipatti or Sholavandan where there are only a few browsing centres. But even those in the browsing centres in such places will not be aware of how to file applications and make payments online,” he said.\n\nHe added that since the students had to rely on the browsing centres which may lead to mistakes occurring in the details furnished in the application.\n\nWhile welcoming a gradual move to online, P. Saravana Murugan, who works at Government Girls’ Higher Secondary School in Othakadai, said that the students will have to shell out more money. “Browsing centres nowadays charge about Rs. 50 or Rs. 100 for simple online transactions. This can be a huge amount for students from poor rural families,” he said.\n\nV. Sukumar, a Class 12 student in Madurai, said he may have to get assistance from a centre run by an NGO near his home.\n\nThe decision to allow filing of applications only through online draws flak", 
    "section": "national", 
    "title": "Anna varsity online registration for application forms from April 15", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}