{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "A pall of gloom descends as relatives, friends and neighbours grieve\n\nRaghavendran Ganesan was scheduled to return to India during the last week of May. He planned to settle his wife Vaishali and his two-month-old son Arjun in Pune. But life had other cruel plans for him: Ganesan’s body was brought to Chennai on Tuesday and was received by inconsolable relatives, friends and neighbours.\n\n“Who knew that he wouldn’t survive to live in a house that he bought just recently?” P. Balasubramanian, his brother-in-law says.\n\nGanesan' parents — Annapoorni, C. Ganesan — and his brother Chandrasekar Ganesan accompanied the body and reached the city around 2 p.m. on Tuesday on a Jet Airways flight. Even before the body of Ganesan returned to his residence in Sithalapakkam (about 20 km from Chennai airport), hundreds of his relatives, friends and acquaintances had gathered there to pay their last respects. So much so that, the rather compact house could not accommodate too many, and police had to persuade visitors to form a queue and pay their last respects. Among those who came to pay their last respects were BJP chief Tamilisai Soundararajan and Social Welfare Minister B. Valarmathi.\n\nIn a few hours, his body was taken to a crematorium in Mahalakshmi Nagar. “He had visited the city just two months ago for the naming ceremony of his son, all hopeful to start a new life in Pune,” recollected one of his relatives.\n\nMessage from NRN\n\n“Today, I learnt of the heart-breaking reality of Raghavendra's demise in Brussels. Raghavendra — a young Indian, a father, a husband, a son, a brother, and an Infoscion — was a victim of senseless violence. Nobody anywhere in the world deserves to be cut down with such violence. I join many others in mourning his loss and pray for his child, wife, brother and parents.”", 
    "section": "national", 
    "title": "Body of Infosys employee arrives", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}