{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Tourism Department to spend Rs. 3.37 cr. on additional facilities at the park\n\nClose on the efforts of the Forest Department in having established the butterfly conservatory near Srirangam, the Tourism Department has taken up a special scheme for providing additional infrastructure with an eye on tapping the tourism potential of the conservatory.\n\nEstablished by the Forest Department at an estimate of Rs. 8.5 crore on an area of 25 acres, the conservatory aims to foster conservation of butterfly species and educate public about how butterflies help maintain ecological balance.\n\nThe conservatory will house 40 species of butterflies, including crimson rose, common mormon, lime butterfly, pansy, blue tiger, common jezebel, and striped tiger. The conservatory is open to visitors from 9 a.m. to 6 p.m. and is closed on Tuesdays for maintenance. It was declared open in November last year.\n\nIn all, the Tourism Department has taken up 16 packages at an estimate of Rs. 3.37 crore that include a wide range of infrastructure from walkway to parking lot, fountains to butterfly museum, an official source told The Hindu here on Monday.\n\nThe infrastructure aims at strengthening the facilities for the conservation of butterflies besides developing the peripheral areas by promoting economic growth.\n\nFormation of walkways at select places will be taken up at Rs. 54 lakh. The width of the pathway will be three metres on the pathway and about six metres at congested places.\n\nParking facility will be provided on an area of 5,000 square metres with ramp and cross-drain facility at an expenditure of Rs. 12 lakh.\n\nConstruction of amphitheatre with seating, projection, and display of butterflies in the butterfly museum along the outer periphery in an air-conditioned chamber will be taken up at an estimate of Rs. 48 lakh. Butterflies cannot withstand heat and need a specific weather condition. A climate controller device will be set up at an expenditure of Rs. 29 lakh. It will regulate the temperature at the conservatory with regard to humidity. A special passive and active cooling controller will be installed at this unit.\n\nA weather station will be set up at an estimate of Rs. 7 lakh. It would monitor rainfall, temperature and humidity, sunshine hours in a day, speed, and direction of wind. A sum of Rs. 30 lakh has been allotted for setting up mini fountain, cascade, water bodies, and solar walkway lighting. A disabled-friendly modern toilet would also be constructed at an expenditure of Rs. 30 lakh.\n\nThe conservatory accounts for a variety of butterfly-friendly plants which are watered manually. The Tourism Department has provided special PVC pipelines for irrigating these species. Drains and cross drains would be set up with pipe culverts at an estimate of Rs. 49.50 lakh.\n\nSurveillance cameras at entry and exit points besides vantage areas at the conservatory with facility for recording and retrieving footages, parking area outside the premises would be set up at an expenditure of Rs. 9 lakh.\n\n“All these facilities aim at providing basic amenities to the visiting tourists and nature-lovers. The infrastructure will extend the process of bio-diversity in the area,” the official told The Hindu on Monday.\n\nFacilities proposed\n\nImprovement to geyser jet humidifier with lining Rs. 7.50 lakh\n\nWalkways to be set up at Rs. 54 lakh\n\nButterfly museum Rs. 48 lakh", 
    "section": "national", 
    "title": "Butterfly conservatory getting spruced up", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}