{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Navalpakkam Narasimhan, Visranthi Mudhiyor Illam, M.G.R. Rd., Palavakkam, 3-30 p.m.\n\nAmudhar Amudham: Venu Raza Narayanan, Sri Santhana Venugopal Perumal Thirukoil, 115, Pedariyar Koil St., Broadway, 6 p.m.\n\nPanchadasi: Satyavratananda Saraswati, Mylapore Club, Luz Church Rd., Mylapore, 11 a.m.\n\nGENERAL\n\nSRM University – Ramapuram Campus: Conference on ‘Advances in Civil Engineering and Sustainable Construction – ACESC ‘1’, Ramapuram, 10 a.m.\n\nPan IIT Leadership Series and IIT Alumni Industry Interaction Center, Chennai: Pals Summit, IC and SR Auditorium, IIT Madras, 10 a.m.\n\nMadras School of Social Work: 21st Mary Clubwala Jadhav endowment lecture on ‘Social Crossroads and Leadership Today’ and presentation of Mary Clubwala Jadhav award for Humanitarian Service 2016, Casa Major Rd., Egmore, 10 a.m.\n\nD.G. Vaishnav College: College day, Arumbakkam, 4 p.m.\n\nAlpha School – Porur: Annual day, Thandalam, Porur, 5 p.m.\n\nAlpha School – West C.I.T. Nagar: Annual day, Narada Gana Sabha, T.T.K. Rd., 5 p.m.\n\nYMCA Kilpauk Toastmasters Club: Meeting, Halls Rd., Kilpauk, 6-30 p.m.\n\nNarcotics Anonymous: Meeting, Staying Clean Group, St. Lourdes Church, Don Bosco School, Perambur, 7 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Kondithope, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Manram, Ashok Nagar; The Lady of the Light Church, Luz; Jacob MHSS., Judges Colony, Periakuppam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Loyola MHSS., United India Colony, Kodambakkam; St. Lukes Church, Anna Nagar; Anglo Indian Association, Ponniyamman Koil St., Egmore; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Rd., Velachery; Kondithope Community Centre, Police Quarters, Waltax Rd.; St. Mathias Church, Kamarajar Salai, K.K. Nagar; C.S.I. Church, Moolakadai; and The Lady of the Light Church, Luz Church Rd., Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}