{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "February 4, 2011 was when the first sparks of the multi-crore granite scam in Madurai district began showing up with Justice K. Chandru of the Madras High Court ordering a detailed enquiry into allegations of suppression of commercial transactions and tax evasion by PRP Exports, a premier granite export firm based here.\n\nAllowing a writ petition pending since 2009, the judge quashed an order passed by former Madurai Collector N. Mathivanan on July 2, 2009 giving a clean chit to the granite firm and directed the Commissioner of Geology and Mines to conduct a personal inspection of the quarries taken on lease by the private firm and complete the enquiry within three months.\n\nEven as the granite exporting firm took the matter on appeal and pursued other legal remedies, other granite barons in the district also faced a huge blow on May 19, 2012 when the then Collector U. Sagayam wrote to the Industries Secretary apprehending that the granite loot in the district could have caused a loss of over Rs.16,338 crore to the public exchequer.\n\nSagayam’s transfer\n\nWithin days of writing the letter, Mr. Sagayam was transferred to Chennai as Managing Director of Handloom Weavers’ Cooperative Society. However, his successor Anshul Mishra continued the crackdown leading to a number of private complaints lodged before a Judicial Magistrate in Melur near here apart from First Information Reports booked by police since August 2012.\n\nSince there was a lull after the transfer of Mr. Mishra on July 7, 2013, social activist ‘Traffic’ K.R. Ramasamy moved a public interest litigation petition before the Principal Seat of the Madras High Court in Chennai and the First Division Bench led by Chief Justice Sanjay Kishan Kaul appointed Mr. Sagayam as Legal Commissioner to ascertain whether sufficient action had been initiated on the issue.\n\nThe Supreme Court too confirmed the appointment of the Legal Commissioner dismissing an appeal preferred by the State Government. After a thorough enquiry, Mr. Sagayam submitted his report before the High Court on November 23, 2015and the case stood adjourned for the State to file its response to the report.\n\nIn the meantime, Justice P.N. Prakash of the Madras High Court Bench here on Thursday last “smelled a rat” in the way K.V. Mahendra Boopathy, the Judicial Magistrate at Melur, was handling the illegal granite cases pending before him and recommended either contempt proceedings or disciplinary action against him.\n\nMr. Boopathy on Tuesday passed a judicial order accusing the prosecution of having brought disrepute to him by suppressing crucial facts before the High Court Bench. He also ordered criminal prosecution of two Special Public Prosecutors and Mr. Mishra for having filed two private complaints in his capacity as Madurai Collector on July 18, 2013 though he was transferred much before that.", 
    "section": "national", 
    "title": "Chipping away at the granite loot and the loss to exchequer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}