{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Dalits in Rice Mill Pudur colony in Nallampatti Town Panchayat say that they live in constant fear of retaliation after the issue of the death of a community member, allegedly at the hands of caste Hindus, came to limelight 10 days ago.\n\nThe dominant caste Hindus in the area are learnt to be enraged over the members of Arundathiyar community, who are mostly agricultural labourers under their employment, approaching the High Court and securing an order for a second autopsy on the body of Chinnasamy who was found dead in a well.\n\nThe Dalits in the village had refused to accept the body with a demand for second autopsy alleging that Chinnasamy, who was vehement in questioning acts of subjugation, was done to death by the caste Hindus before being thrown into a well.\n\nAfter a case preferred under PCR Act was registered in the Thingalur Police Station, Chinnasamy was among those who had questioned the investigators for what they considered as tardy handling of the case. Instead of providing protection to the affected people, the police were siding with the caste Hindus , Chinnasamy had complained.\n\nRelatives of Chinnasamy assert that he was drowned in the well. “There is certainly something fishy about the death since Chinnasamy knew to swim. Moreover, the well had water only to the hip level. How then could Chinnasamy have fallen into the deep well without sustaining any external injury,” a relative said. The body of Chinnasamy is expected to be handed over to family members after second autopsy at the Government Hospital, Coimbatore, on Wednesday or Thursday.\n\nDalits in Rice Mill Pudur locality fear that they would be subjected to harassment by the caste Hindus in future. According to Senthamilan, a resident of Rice Mill Pudur colony, the Arundathiyar community also feel intimidated by the police.\n\nThere are about 125 families dependent on employment in fields owned by the dominant caste Hindus .\n\nOrganisations working for Dalit welfare complain that the district administration has not responded appropriately to the incident, as per the provisions of The Scheduled Castes and the Scheduled Tribes (Prevention of Atrocities) Rules 1995.\n\nRelief\n\n“The rules mandate the police to provide security to the people and the district magistrate or sub-divisional magistrate to arrange for providing immediate relief in cash or in kind or both to the victims of atrocity, their family members and dependents. The relief includes food, water, clothing, shelter, medical aid, transport facilities and other essential items,” Abirami, National Programme Coordinator of New Delhi-based National Dalit Movement for Justice, said.\n\nAccording to official sources, the situation at Nallampatti was well under control and there was no ground for responding with such measures.\n\nThere are 125 families dependent on employment in fields owned by caste Hindus", 
    "section": "national", 
    "title": "Dalits of Nallampatti fear retaliation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}