{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Post offices witness technical glitches in core banking solutions network\n\nFor the past few days, customers at many post offices have been waiting in queues for long hours to make deposits in their savings scheme accounts.\n\nBut, many of them have had to return disappointed, owing to glitches in the core banking solutions (CBS) network.\n\nMore customers opted to invest in postal saving schemes after the Postal Department announced that until March 31, depositors could avail themselves of the existing interest rate even if the rates would be revised in April. However, several post offices in the city did not have the capacity to handle the sudden rush of investors and the CBS system had collapsed in many places.\n\nMany customers visiting the T. Nagar head post office on Tuesday complained that they waited in queues for over two hours, to be informed that transactions could not be carried out as the system was not functional. Some of them alleged that depositors were turned down as postal investments before the month-end would attract higher interest rates.\n\nA resident of Anna Nagar said that those who wanted to withdraw cash or close the accounts after maturity were the worst-affected and long waits often led to frayed tempers among customers.\n\nDeivanai Pandian, a resident of Anna Nagar, said: “Some customers wait for over four hours to check if transactions can be carried out. I visit once in two days to check whether the situation has improved. There are instances when even the staff members begin their day before 10 a.m. but are unable to carry out operations because the CBS system is not working.”\n\nCustomers demanded that the technical glitches in the software of the CBS be resolved and the bandwidth be increased to address such issues.\n\nOfficials of the Department said more customers chose to invest in senior citizens’ savings scheme, recurring deposits and time deposits.\n\nOn Sunday alone, 6,300 accounts were opened in the Chennai city region and deposits were accepted in post offices through manual system as in Anna Nagar. However, withdrawals cannot be made till the problem is set right and customers may have to opt for cash from postal ATMs.\n\nAdmitting that there had been a problem in CBS-enabled post offices, Mervin Alexander, Postmaster General (Chennai City Region), said overloading the system due to a large number of transactions in a short span had led to the problem and the technical team was involved in resolving it.\n\n“We have a contingency plan to prevent inconvenience to customers. We have instructed post offices to accept deposits and provide manual receipts so that people need not wait for long hours,” he said. He added that nearly 25,000 saving accounts were opened in the past one week.\n\nPostal staff members had been instructed to accept deposits and make entry online later to help customers get the benefits of higher interest rate.", 
    "section": "national", 
    "title": "Depositors irked by delays", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}