{
    "author": [
        "M K"
    ], 
    "text": "The city police have bought three puppies last week in the place of three dogs that retired from the squad on turning eight years old. The dog squad here has a sanctioned strength of seven sniffers. It includes three trained in sniffing explosives and three crime dogs and one for detecting narcotics substances.\n\nIn September last year, crime detection sniffer Sithra was the first among the three to retire from service. This sniffer helped the police crack a few crime cases including a detection in 2014, at Kuniyamuthur, where it tracked a murder accused all the way to his house – about half-a-km from the scene of crime – and caught him by his hand.\n\nAppreciated by top police officers for her detection skills, the Labrador has also brought laurels to the city by winning medals at State level police duty meets in 2013 and 2014 and representing the State at the 58{+t}{+h}All India duty meet at Punjab in 2015. Two other German Shepherd females that retired last month were Ammu (crime tracker) and Charu (explosives sniffer) have showcased their skills in detections and events.\n\nLast week, the police bought three-and-a-half-month-old German Shepherd Wilma in the place of Sithra, and a Labrador of the same age Sarah in the place of Ammu and 65-day-old Golden Retriever puppy Likah, in the place of Charu. They were named by City Police Commissioner A. Amalraj and Deputy Commissioner (Crime) Nisha Parthiban.\n\nSpecial Sub Inspector in-charge of the dog squad A. Soundararajan said that the puppies were now taken out for walking. This would continue till training commenced when they turned six-months-old.\n\nInterestingly, the three dogs that retired recently and the newly inducted dogs are females, as they seem to have an edge over males. Dog handlers said that female sniffers were more obedient and not aggressive as the males. “Males also face difficulty in staying focused during the mating season. This is not the case with females,” they added.", 
    "section": "national", 
    "title": "Dog squad gets three new pups", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}