{
    "author": [
        "T K Rohit"
    ], 
    "text": "Move aimed at spreading voter awareness; prizes too up for grabs\n\n“In which year was the voting age reduced from 21 to 18 years and how?” the State Election Commission asked in a Twitter post.\n\nWhat would have passed as a routine quiz competition gained a special allure for two reasons. One, it was the Election Commission conducting the quiz. And two, not to compromise on the excitement quotient, the Commission was, perhaps for the first time, giving away goodies that are nothing to scoff at. Three people who got it right won a T-shirt each.\n\n“For a government organisation to run such a campaign is a novel idea. I got to know about the EC’s twitter account from a friend and have been following them. Social media is the best platform to take messages to people nowadays,” Vigneshwar M.P., who goes by the Twitter handle @paalpaayasam told The Hindu.\n\nVigneshwar, who is a student at IIM-Lucknow, said he keeps looking out for campaigns on social media. “The Election Commission is trying to reach out to everyone and campaigning for 100 per cent turnout is something to be really appreciated. Narendra Modi used the power of social media two years back and now we see other politicians take to it. Omar Abdullah and Sushma Swaraj are really good on the platform. But I have seen that the latter seems to be resolving a number of issues,” he said.\n\n“This is another initiative to engage people in elections and it also indirectly creates awareness about voting. We are trying to do interesting things…otherwise people will lose interest. Initiatives such as quizzes also creates intellectual interest,” Rajesh Lakhoni, State Chief Electoral Officer told The Hindu. The T-shirt will have a map of Tamil Nadu and some message.\n\n“This will create some excitement to the winners. They will ensure that they vote in the elections and also get their peer group to vote,” he said.", 
    "section": "national", 
    "title": "EC quiz on polls a hit on Twitter", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}