{
    "author": [
        "Staff Reporter"
    ], 
    "text": "V. Sethuraman, former Director (Power), NLC, addressing a seminar on ‘Energy conservation in industries’ at NTPL in Thoothukudi on Tuesday.— Photo: N. RAJESH\n\nA seminar on ‘Energy conservation in industries’ was organised by the Institution of Engineers (India), Tuticorin Local Centre, in association with NLC Tamil Nadu Power Limited (NTPL), on NTPL premises here on Tuesday.\n\nV. Sethuraman, former Director (Power), Neyveli Lignite Corporation Limited, and chief guest, in his inaugural address said that energy efficiency was the key to sustainability. Nowadays, green gas emission was the biggest threat and engineers got a responsibility to save the atmosphere by adopting energy-efficient methods.\n\nIndia had a total installed power generation capacity of 2.80 lakh mw, and Tamil Nadu 28,000 mw. On an average, 1.30 lakh mw to 1.34 lakh mw was being consumed by consumers across India every day.\n\nIn Tamil Nadu, the daily average electricity consumption was 13,500 mw to 14,500 mw. Only around 50 per cent of the total installed capacity was being consumed, but still there was power shortage. . There were some transmission constraints and such problems should be rectified, he said. Mr. Sethuraman said that around two lakh mw was produced through coal-based thermal power plants in India, and the remaining from water resource, renewable energy and other small resources. Now concentration was on solar power plants. Wind energy production touched 25,000 mw in India. Tamil Nadu was the largest wind energy producer in the country with a production of 7,500 mw.\n\nStates such as Maharashtra, Gujarat, Rajasthan and Karnataka stood next to Tamil Nadu in wind power generation.\n\nHe said that Tangedco was not able to meet the growing electricity demands during summers. Over the last two months, the demand for electricity in the State was 13,000 mw, and now it had gone up to 14,000 mw. It would rise to 15,000 mw by April and May, Mr. Sethuraman added.\n\nS. Sathiyanarayanan, Executive Director and CEO, NTPL, Thoothukudi, in his keynote address, elaborated on the need for energy efficiency in industries, commercial buildings, residential buildings.\n\nEarlier, S.T. Mathew, Chairman, Institution of Engineers (India), Tuticorin Local Centre, welcomed. I. Maria Michael Raj, convened the programme. S. Gurusamynathan, General Manager, (Human Resources), NTPL, proposed a vote of thanks.", 
    "section": "national", 
    "title": "Energy conservation is the key to sustainability, say experts", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}