{
    "author": [], 
    "text": "SALEM\n\nSchool of Mathematics and Department of Library and Information Science, workshop on ‘analysis of data using SPSS package’, 9.45 a.m; Department of History, national seminar on ‘recent trends in South Indian Historiography’, 10.30 a.m.; Department of Sociology and Centre for Village Adoption Scheme: national seminar on ‘role of villages in the development of processes issues and strategies’,\n\n10.30 a.m.\n\nKnowledge Institute of Technology and Knowledge Business School: Annual Day, 10 a.m.\n\nSona College of Technology: Department of Civil Engineering, lecture on ‘quantitative techniques in management’, 10 a.m.\n\nCommissioinerate of Central Excise: Tax Payers Day, Foulks Compound, Anal Medu, 9 a.m. to 1 p.m.\n\nMuslim Youth Federation: Zikr majlis, Mettu street, 4 p.m.\n\nNAMAKKAL\n\nKrishi Vigya Kendra: Training on roof top gardening, Veterinary College and Research Institute premises, 10 a.m.\n\nTIRUCHENGODE\n\nVivekanandha Institute of Engineering and Technology for Women: NSS special camp, Panchayat Union School, Kosavampalayam, 10.30 a.m.\n\nKOMARAPALAYAM\n\nExcel Engineering College: Department of Computer Science and Engineering and Information Technology, national conference on ‘networking and communication systems’,\n\n9.30 a.m.\n\nErode\n\nM.P.Nachimuthu M. Jaganathan Engineering College: VARFENZ '16 - State-level Technical Meet, 9.30 a.m.\n\nVelalar College of Engineering and Technology: Inauguration of NSS Special Camp, 3.30 p.m.\n\nKongu Engineering College: Valediction of Tamil Mandram, 10 a.m.\n\nNandha Engineering College: National-level seminar on ‘Latest Phase Change Materials For Sustainable Solar Enrgy Production: Trends and Opportunity with Thermal Systems Perspective’, 10 a.m.\n\nBannari Amman Institute of Technology: National-level conference on ‘Intelligent Automation in Science, Engineering and Technology’,\n\n10.30 a.m.\n\nErode Sengunthar Engineering College: Sessions on Custom Cloud, Evils of Internet and 3-D Printing,\n\n4 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}