{
    "author": [
        "Staff Reporter"
    ], 
    "text": "‘EC officials have not objected to the practice of painting horns in political colours so far’\n\nIn Vellore, even bulls have not been spared from sporting political colours. In a way to display their political affiliations, a number of bull owners have coloured the horns of the animals with party flag colours across the district.\n\nWhile officials engaged in election work have been removing political party flags, graffiti, posters and banners to fall in line with the model code of conduct, these animals continue to sport the flag colours on their horns.\n\nA bull owner said the horns of the animals are usually painted in different colours during Pongal. “Bull owners, who have some kind of political affiliations, prefer to paint the flag colours on the horns during the festive season. The flag colours of AIADMK, DMK, VCK, Congress and PMK can be seen painted on the horns of many bulls in the district.” He added that some of the owners remove the colours from the bulls’ horns during summer.\n\nSome paint the flag colours to express their loyalty to the party leaders. As a bull owner pointed out that some are in the practice of painting the flag colours on the horns during the birthdays of their party leaders.\n\n“This is done as part of the birthday celebrations to show their love for the party leaders. Some had painted the horns of the bulls in flag colours during the birthday celebrations of the Chief Minister and DMK treasurer M.K. Stalin,” he added.\n\nThere are around 800 bulls involved in transporting sand mined from the government quarries in carts. Another 2,000 bulls are exclusively reared for bull race in the district.\n\nThe bull owners said no official has so far objected to the bulls continuing to sport the flag colours with the election model code of conduct in force.", 
    "section": "national", 
    "title": "Feeling ‘bullish’ during election season", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}