{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Training programme held to enable police officers to adapt to new system\n\nPolice personnel attend a training session on online registration of FIRs in Vellore on Tuesday.— Photo: C. Venkatachalapathy\n\nFrom April 15, the Police Department will do away with registering First Information Report (FIR) on paper, and will go the digital way. In a bid to computerise the department, an online system for registration of FIRs is being implemented.\n\nAs part of this shift from papers to computers, a training programme to enable police officers to adapt to the online system was conducted on Tuesday. Till now, the police, on receiving complaints, register cases, and file FIRs in writing.\n\nFrom April 15, they will enter the details of cases and file FIR through software, thereby doing away with the FIR books. The uploaded report will also be sent to courts, and print outs of the FIRs can also be taken.\n\n“The online FIR system is part of an integrated criminal justice system that is being implemented nation-wide. Once a FIR is uploaded, it can be viewed by courts and prison authorities. We can take print outs and send the copies to respective officers,” said P. Pakalavan, Superintendent of Police, Vellore.\n\nThe Union Ministry of Home Affairs had brought in the Crime and Criminals Tracking Network and Systems (CCTNS) to interconnect police stations. FIRs are being entered through the CCTNS software, officials said.\n\nIn fact, all details concerning a case will be entered through the software. This will include investigation details too, the SP added.\n\n“If an accused is arrested, the date of arrest, details of bail granted, date of release and all details about him/her will be entered. The purpose is to upload the complete details of cases. Details of cases and investigations can be accessed by police officers from any part of the State,” he added. He pointed out that this digitisation initiative was aimed at integrating the whole country.\n\nInspectors of police, sub-inspectors, head constables and writers took part in the training programme.\n\nThe online FIR system is part of an integrated criminal justice system", 
    "section": "national", 
    "title": "Gearing up for digitisation of FIRs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}