{
    "author": [], 
    "text": "He neither had any motive nor aware of consequences, says HC\n\nAn engineer who poisoned his five-year-old son to death out of “severe depression” developed after a road accident in which he lost his pregnant wife has been acquitted by the Madras High Court.\n\nIn its order acquitting the young engineer – A. Steepen – who was convicted and sentenced to life by a Sessions Court, a Division Bench of Justices M. Jaichandren and S. Nagamuthu said, “It is not every homicide which is made is punishable under the Indian Penal Code. It is only a culpable homicide which is punishable.”\n\nDelivering the order, Justice Nagamuthu said the “unblessed son of a poor family, educated by his poor parents, on becoming an engineer, secured a decent job and lived a life with full of joy and jubilation,” (he) would not have imagined that a “severe blow to his life was fast approaching to make a complete topsy-turvy.”\n\nSteepen was living with his wife and a five-year-old son at West Mambalam, Chennai. On October 20, 2008 he visited his ailing father in a village near Vellore. On his way back to Chennai the next day, Steepen’s car met with an accident in which his wife, then pregnant, died on the spot. Steepen and his son sustained serious injuries and were admitted in a private hospital. The entire medical expenses was taken care by his friends and his landlord, as none of his relatives including in-laws offered any help. Subsequently, his wife’s body was cremated by her parents in the absence of Steepen.\n\nThereafter, the life of Steepen became difficult. “Everyday went on with extreme grief and agonies; he struggled to make the ends meet and manage the medical expenses as he lost his job due to complete immobility.” Due to this, he developed a “kind of depression”.\n\nOn July 8, 2009 Steepen lost his mind “out of depression” and gave sleeping pills to his son, took him to his father-in-law’s house and hanged himself. leaving behind a suicide note. However, he was rescued and admitted to a hospital. Steepen was treated for “severe mental depression” in the Government Royapettah Hospital in the convict ward for about a month and was discharged on August 1, 2009. Meanwhile, a charge-sheet was filed against Steepen on October 10, 2009 and he was later convicted for murder. The Additional Sessions Judge, Fast Track Court IV, Chennai sentenced him to life imprisonment based on the evidence of 19 witnesses, 27 documents and 12 material evidences. Steepen preferred an appeal against the conviction.\n\nPerusing the records, the Bench observed that the culpability as defined under Section 299 of IPC should be established by the prosecution. “A person, who is of unsound mind, cannot have any intention or knowledge in terms of IPC … a person who does not know the consequences of the act that he does, cannot be attributed either with intention or knowledge as is required by IPC,” the judges said.\n\nHence the court acquitted him of all charges.", 
    "section": "national", 
    "title": "High Court acquits ‘depressed’ engineer who killed his son", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}