{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "The Tamil Nadu Information Commission has asked the State Home Secretary to probe how documents officially dispatched to A.G. Perarivalan alias Arivu, one of the convicts in the Rajiv Gandhi assassination case, on December 26, 2013 did not reach him in the Vellore Central Prison.\n\nThe matter pertains to a plea of Perarivalan under the Right to Information (RTI) Act seeking to know the basis of conducting in-camera proceedings as part of the Multi Disciplinary Monitoring Agency (MDMA) investigation. The MDMA, comprising officials of the Central Bureau of Investigation (CBI), Intelligence Bureau (IB), Research and Analysis Wing (R&AW) and other agencies, is probing larger conspiracy in the Rajiv Gandhi assassination case and issues arising out of the Jain Commission of Inquiry.\n\nThe convict, whose death penalty in the main case was commuted to life imprisonment, had also sought a copy of the MDMA proceedings so far. While declining to provide copy of proceedings since the case was under further investigation, the PIO of the designated TADA court said the basis of in-camera hearing was “enclosed”. However, Perarivalan claimed that there was no such enclosure.\n\nHe filed an appeal with the Registrar, Madras High Court, reiterating his earlier plea and contended that open court hearing was the backbone of fair hearing because the accepted legal principle in justice delivery system was that “justice should not only be done but also seemingly be done”. The appellate authority replied to him that the trial court had furnished the information sought by him on December 26, 2013 and that there was nothing left for consideration in the appeal petition.\n\nAggrieved over this, Perarivalan moved the Tamil Nadu Information Commission. When a notice was served on the TADA court on the issue of in-camera proceedings, the Principal Information Officer replied to the commission that “in-camera proceedings were conducted by adopting the procedure of closing the doors of the court hall to keep the identity and address of the witness secret…under Section 16 of the TADA Act, 1987, the proceedings in this case relating to the assassination of Thiru Rajiv Gandhi were held in-camera.”\n\nPointing out that the appellant expressed grievance that a copy of the order that enabled in-camera trial was not received by him, the commission requested the PIO to send the copy to the appellant.\n\nIn his order, State Chief Information Commission K. Ramanujam asked the Home Secretary to find out how the communication dated December 26, 2013, sent by the designated TADA court did not reach Perarivalan.\n\nWhen contacted S. Prabu Ramasubramanian, counsel for the convict, alleged that the very purpose of in-camera proceedings was to suppress flaws in the investigation. There was no reason to conduct the proceedings in-camera since there was no threat whatsoever. “All the three accused in the case – Prabhakaran, Pottu Amman and Akila – are presumed dead. The Liberation Tigers of Tamil Eelam is completely eliminated as claimed by Sri Lanka. The information sought by the convict is crucial...we suspect that there is a hidden agenda in not furnishing it,” he said.", 
    "section": "national", 
    "title": "Home Secretary to probe how Rajiv case documents vanished", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}