{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "All Women Police at Tallakulam here have booked the pastor of a church, a man and four of his family members for harassment and abuse of a woman, who was married off to the man by hiding his sexual orientation.\n\nThe police have arrested the husband, J. Joseph Anand (35).\n\nAccording to the complainant, S. Latha (29) (name changed) , a teacher in a private school here, a pastor named Edwin Karunakaran from a church in Koodal Nagar approached her family with the marriage proposal last year after seeing her details on a matrimony site.\n\nShe said that she and Anand, also a schoolteacher, got married in May 2015 after her family offered a dowry of 27 sovereigns of gold jewellery and about Rs. 2 lakh.\n\nWhen Ms. Latha questioned her husband on his refusal to consummate the marriage, he reportedly told her that he was a homosexual and his family and the pastor were aware of it.\n\n“I am a pious person. At that time, I believed that his problem was curable through prayer and medication. But his family kept blaming me instead and my husband also harassed me,” she said.\n\nAs the harassment continued, Ms. Latha said, she informed her family about the situation a few months later and decided to move for divorce. She said while refusing to agree for divorce both her father in-law and Mr. Karunakaran intended to exploit the situation and sexually misbehave with her.\n\n“We did not want to approach the police and tried to negotiate. But they were adamant and even threatened us,” she said. Later, Ms. Latha approached Madurai-based human rights NGO People’s Watch, with whose help a police case was registered.\n\nThe police booked Karunakaran, Anand, his parents, his sister and brother in-law under various sections of the Indian Penal Code, including for cheating, and also under the Tamil Nadu Prohibition of Harassment of Women Act.", 
    "section": "national", 
    "title": "Husband arrested, pastor booked for harassing woman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}