{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "S. Kausalya (19), wife of Dalit youth Shankar, who was murdered by a gang at Udumalpet on March 13, wants to see all the accused involved in the brutal killing of her spouse get ‘maximum punishment’. “It includes my parents, other relatives and the gang members deployed for the execution of the crime,” she said.\n\nMs. Kausalya, though discharged from Coimbatore Medical College and Hospital after the treatment for injuries sustained in the attack, is yet to recover fully from the shock. Shankar’s family received a message that the National Commission for Scheduled Caste had made a recommendation to the government to give Ms. Kausalya a job. She had asked for a job that would match her current qualifications.\n\nMs. Kausalya wants to continue her engineering course, which she had discontinued after her marriage. “I hope to get a job first, and then will continue with my studies through a part-time course. I even need to take care of his two brothers,” she said.\n\nThe Udumalpet police on Tuesday arrested K. Dhanraj (25) from Dindigul for his alleged involvement in the murder of Shankar.\n\nHe was produced before Judicial Magistrate Srividhya in Udumalpet and remanded to judicial custody. Meanwhile, a judicial magistrate court at Udumalpet granted three-day police custody to four other accused – M. Manikandan, P. Selvakumar, M. Madan and P. Jegadeesan, who were arrested on March 15. The police had recovered weapons reportedly used for the attack and two motorbikes from them.\n\nMother surrenders\n\nMeanwhile, the mother-in-law of Dalit youth Shankar, C.Anna Lakshmi, a native of Palani, surrendered before the judicial magistrate court in Theni on Tuesday, in connection with his murder.\n\nHer husband had already surrendered in court.\n\nJudicial Magistrate A. Sundari remanded her to judicial custody till March 31 and directed the police to produce her before the Udumalpet Court. Later, she was lodged in Madurai central prison.", 
    "section": "national", 
    "title": "Kausalya seeks severe punishment for husband’s killers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}