{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P.A. Ponniah, Railway Colony, 7.30 p.m.\n\nMadanagopalaswamy Temple: Discourse on ‘Mahabharatham’ by Vasudeva Govindarajan, West Masi Street, 7 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nGita Bhavanam: Discourse on ‘Kothaiyum Geethaiyum’ by T.K. Subramanian, 3 Kamarajar Salai, 6.30 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: M. Ramakrishnan, member, Convenor Committee, inaugurates national seminar on ‘New dimensions of management in globalised era,’ B.T. Bangera, Managing Director, Hi-Tech Arai, addresses; A. Muthumanickam, Registrar (in-charge), presides, Preview Theatre, 10.30 a.m.; national seminar on ‘Society, language and culture,’ V. Thiruvalluvan, Dean, Annamalai University, delivers valedictory address, K. Ravichandran, Special Officer, presides, School of Tamil Studies, 3.30 p.m.; national seminar on ‘Historiography of religious saints and giants,’ M.P. Gurusamy, secretary, Gandhi Museum, delivers valedictory address, School of Religions, Philosophy and Humanist Thought, 3.45 p.m.\n\nThe American College: Fourth Wall Theatre presents William Shakespeare’s The Taming of the Shrew , Open Air Theatre, 6.30 p.m.\n\nThiagarajar College: Mathematics Association meeting; T. Asir of MK University speaks on ‘Introduction to graphs from rings,’ Smart Classroom, 12 noon.\n\nYadava College: Department of Mathematics Awards Ceremony; K. Nagendran, CEO, GBS System and Services, addresses, Nagendran Yadav Auditorium, 10 a.m.; C.M. Ramakritinan of MK University speaks on ‘Coral reef ecosystems: present status and conservation,’ S. Dhanasekaran, Principal (in-charge), presides, Rajendran Auditorium, 10.30 a.m.\n\nMSS Wakf Board College: NSS camp, Odaipatti, 10 a.m.\n\nNadar Mahajana Sangam Sermathai Vasan College for Women: Staff development programme, Avaniapuram, 3.45 p.m.\n\nDistrict Legal Services Authority: A.M. Basheer Ahamed, Principal District and Sessions Judge, inaugurates workshop for para-legal volunteers, District Court, 10 a.m.\n\nThiagarajar College of Preceptors: Inter-collegiate competitions, Teppakulam, 10 a.m.\n\nYadava College: Einstein Day; G. Balasubramanian addresses, Department of Physics, 10 a.m.\n\nA.M. Jeyabalan Memorial Trust: Programme on ‘Dental needs and treatment modalities for aged people’ and free dental consultation, Nala Dental Hospital, Vallabhai Road, Chokkikulam, 11 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Dheep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}