{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The mobile voters' facilitation centre that was inaugurated in Namakkal on Tuesday and (right) V. Sampath (right), District Collector, inaugurating the sale of Aavin milk packets with slogans on voter awareness at the Aavin booth in Salem New Bus Stand on Tuesday.- Photo: E. Lakshmi Narayanan\n\nThe mobile voters' facilitation centre that was inaugurated in Namakkal on Tuesday and (right) V. Sampath (right), District Collector, inaugurating the sale of Aavin milk packets with slogans on voter awareness at the Aavin booth in Salem New Bus Stand on Tuesday.- Photo: E. Lakshmi Narayanan\n\nMobile voters’ facilitation centre inaugurated at Namakkal\n\nTo enable electors verify their name and carryout corrections and deletions in the electoral rolls, a mobile voters’ facilitation centre equipped with laptops was flagged off in Kathapalli village in Namakkal Assembly Constituency here on Tuesday.\n\nDistrict Election Officer and Collector V. Dakshinamoorthy flagged off the service in the presence of Returning Officer for Namakkal Assembly constituency and Revenue Divisional Officer M. Kannan, Tahsildar Subramani, and other officials.\n\nAddressing media persons, Mr. Dakshinamoorthy said that to ensure 100 per cent polling, voter’s facilitation centres were started in many places across the district.\n\nHe said that 2,980 people have submitted forms for obtaining EPIC, 1,082 submitted forms to verify their names in the electoral roll and 402 submitted forms for corrections. The Collector asked the electors to utilise the service offered at their doorsteps.\n\nJewellery returned\n\nMembers of the flying squad seized 16 kg gold jewellery worth Rs. 8 crore from two private security agency vehicles in Mudalaipatti on the Bengaluru – Madurai National Highway here on Tuesday. However, the officials returned the jewellery after the company produced documents.\n\nA squad led by Senthamangalam Taluk Supply Officer Selvaraj was involved in a vehicle check at Mudalaipatti. They intercepted the two vehicles and found jewellery in it. Inquires with the three persons in the vehicles revealed that the jewellery was manufactured at private companies unit in Hosur and was being transported to the company showrooms in Thanjavur, Tiruvarur and Kanyakumari areas. Since the three persons could not produce any documents, the jewellery was taken to Revenue Divisional Office.\n\nReturning Officer for Namakkal Assembly constituency and RDO M. Kannan held inquiries with the three employees.\n\nLater, documents were obtained from the company through email and after verification, the jewellery was returned.\n\nSpecial Correspondent from Salem adds\n\nSlogans on milk packets\n\nThe Salem District Cooperative Milk Producers Union (Aavin) launched a special campaign to motivate people to vote without fail by displaying slogans in Tamil and English on milk packets.\n\nV. Sampath, District Collector and District Election Officer, inaugurated the sale of the milk packets with election slogans at Aavin booth in new bus stand in the city on Tuesday evening. K. Santhi, General Manager, Aavin and other senior officials were present.\n\nThe Aavin has launched the campaign under the Systematic Voters’ Education and Electoral Participation programme of the Election Commission.\n\nMrs. Santhi said that Aavin marketed 4.8 lakh half litre milk packets every day through its marketing network. The slogans will be printed on all these packets daily.\n\nSensitive booths\n\nA total of 832 polling booths at present have been identified as sensitive in the 11 constituencies in the district, said V. Sampath, District Collector and District Election Officer.\n\nSpeaking at a joint meeting of the poll and police officials here on Tuesday, Mr. Sampath said that the Election Commission has sought details of the sensitive polling booths.\n\nThe returning officers should hold discussion with the tahsildars, block development officers, police inspectors, revenue inspectors, VAOs to prepare a final list of polling booths where peaceful polling will be hampered, he said. G.Subbulakshmi, Superintendent of Police, R. Sukumar, District Revenue Officer, returning officers of all the eleven constituencies were present.\n\nThe Election Control Room functioning at the Collectorate has so far received 4,924 complaints of poll code violations, the Collector said.", 
    "section": "national", 
    "title": "Make changes in electoral rolls at your doorsteps", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}