{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Online mode of conducting examinations for postgraduate courses offered by Directorate of Distance Education (DDE) of Madurai Kamaraj University, introduced in late 2014 during the tenure of former Vice-Chancellor Kalyani Mathivanan, has been scrapped.\n\nThe decision taken at the Syndicate meeting held last week in Chennai was conveyed to the members of Academic Council at its meeting here on Monday.\n\nIt was noteworthy that the introduction of online examinations faced fierce criticism as many alleged that it was brought in a hurry and the pros and cons were not well thought out.\n\nAccording to the system, online exams would be in the form of multiple choice questions for 40 marks. A candidate had to sit for a regular written examination for another 30 marks while the remaining 30 marks would be based on the evaluation of assignments. Examinations were conducted twice in this format.\n\nThe conduct of online examinations had been outsourced to another company at a premium price, university sources said.\n\nThe DDE would now revert to the older system of written examinations for all 100 marks.\n\nWhile the difficulties faced by students who were not tech-savvy and the volume of assignments to be evaluated were cited as reasons for scrapping it, sources said that an important reason was that the University Grants Commission (UGC) had not recognised online exams.\n\nThere were also many other practical difficulties in the conduct and evaluation of the examinations, sources added. “For instance, there was no way to ensure that all the examination centres across the country had adequate number of computers and uninterrupted power supply.”\n\nThe announcement of the decision also provided opportunity for many members to point to the absence of dissent from Syndicate and Academic Council members when the online system was brought in. “The initiative was brought in a hurry in a very undemocratic manner. But those who should have raised their voice remained silent,” said S. Nehru, Principal of Mannar Tirumalai Naicker College.", 
    "section": "national", 
    "title": "MK University scraps online exams", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}