{
    "author": [
        "Staff Reporter"
    ], 
    "text": "R. Manikandan (18) of Kalappanaickenpalayam here who suffered a head injury while intervening to stop a quarrel between his friend and a fellow villager on Sunday evening died at the Coimbatore Medical College Hospital (CMCH) on Tuesday.\n\nThe police have arrested R. Subramani with whom Manikandan’s friend Daniel picked up a quarrel over parking his vehicle. Manikandan and Daniel were construction workers and Subramani a cattle trader.\n\nSubramani Daniel to move his two-wheeler to park his goods carrier. When a quarrel erupted between them, Manikandan intervened. Subramani threw an empty bottle at them.\n\nLater, at about 4.45 p.m. he attacked Manikandan and Daniel at Kulathumedu using a log.\n\nHalf-an-hour later Subramani hit his goods carrier on Daniel’s motor bike. He tried to run the vehicle over Daniel, said N. Ravikumar, a cousin of Manikandan who was a witness to the incident. Daniel suffered a fracture on his hip and injuries on his shoulder and head.\n\nManikandan and Daniel were taken to a private hospital. Later, Manikandan was referred to the CMCH. The police said that though he underwent a surgery on his head, he died early on Tuesday. Subramani was booked under sections 302 (murder) 307 (attempt to murder), 324 (voluntarily causing hurt by dangerous weapons or means) and 294(B) (using abusive language) of the Indian Penal Code. Vadavalli Inspector S. Saravanan said that he was yet to be arrested. The weapon and the vehicle used by him have been recovered, he said.\n\nTensed moments prevailed at the CMCH on Tuesday as friends, and relatives of Manikandan staged a protest demanding that Subramani be arrested.The police said that action would be taken against the private hospital at KNG Pudur where the boys were first admitted, as the hospital authorities did not inform the police about the incident.", 
    "section": "national", 
    "title": "Parking row: youth killed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}