{
    "author": [
        "R Sivaraman"
    ], 
    "text": "It may take another week to get a clear picture of the political strategies\n\nAs there are still 25 days more before commencement of filing of nominations for the Assembly polls in the Union Territory, major political parties including the ruling All India NR Congress, Congress, AIADMK and DMK are in no hurry to plunge into election mode.\n\nOver three weeks have gone by since the Election Commission of India (ECI) announced the dates of Assembly polls in Assam, Kerala, Tamil Nadu, West Bengal and Union Territory of Puducherry.\n\nHowever, the ruling AINRC has neither commenced talks with any of political parties on forging alliance nor revealed indications of contesting alone.\n\nP. Angalane, who resigned from the AINRC and MLA post and joined Congress a few days ago, protesting the functioning of the party, indicated that there would be more rift in the party. In yet another setback to the party, K.S.P. Ramesh former chairman of Puducherry Planning Authority and a key functionary quit the party and declared that he would contest the election in Kadirkamam constituency irrespective of whoever is fielded there. Expressing unhappiness over the delay in taking decision by the party, another ruling party MLA M. Vaithianathan also convened a meeting of supporters and asserted that he would certainly contest in Lawspet constituency. There are murmurs in political circles of more AINRC functionaries moving out of the party.\n\nAINRC president and Chief Minister N. Rangasamy had deferred decisions until he completes his pilgrimage to various temples.\n\nAgainst this backdrop of fluidity in the political landscape, Mr. Rangasamy on Tuesday said his party’s strategy would be unveiled soon.\n\nAddressing reporters here at his chamber in the Assembly Complex, Mr. Rangasamy said, “We have not held any discussion with anybody so far. There is plenty of time for filing nomination which commences from April 22. We are only in March. Let us wait for some more days.”\n\nTo repeated queries on poll strategy, Mr. Rangasamy said, “We will announce our strategy soon on whether we would be contesting alone or face election by forging alliance. We are ready to face elections.”\n\nOn whether his party would have an alliance with the AIADMK or BJP, he said, “All your queries will be answered later at appropriate time,” he said.\n\nThe AINRC’s ally, the BJP is looking up to its national leadership to take a call on alliance and candidates’ list. Recently, BJP’s Puducherry unit president V. Saminathan called on Prime Minister Narendra Modi, party chief Amit Shah and members of the national election committee to discuss the poll strategy and preparation of a preliminary list of candidates for the May 16 polls. At a time when the Congress and the DMK have decided to revive the alliance between them, the ruling AINRC and AIADMK will face elections on their own if they avoid an alliance. Meanwhile, Tamil Nadu Chief Minister and AIADMK general secretary Jayalalithaa held two rounds of discussion with Puducherry unit secretary P. Purushothaman and election in-charge P. Kannan to decide the poll strategy.\n\nStill the party has not spelt out its strategy vis-à-vis Union Territory of Puducherry. However a senior leader maintained, “the party leader will take appropriate decision at right time.”\n\nThings are also not clear on seat sharing formula in the Congress- DMK formation as well. Though an alliance between these two parties was firmed up following the meeting with former Union Minister and Congress leader Ghulam Nabi Azad and DMK president M. Karunanidhi in mid February, the seat sharing talks still continue.\n\nWith the entry of Vijayakant-led Desiya Murpokku Dravidar Kazhagam (DMDK) into People’s Welfare Front (PWF) in Tamil Nadu, VCK chief Thol.Thirumavalavan reportedly said Mr. Rangasamy-led AINRC was likely to come into the front.\n\nHowever, PWF Puducherry convener and CPI secretary was quick to deny such reports. Though PWF started seat-sharing talks much ahead in Puducherry, there is no conclusion so far and its leaders stated that it may take another week.", 
    "section": "national", 
    "title": "Parties in no hurry to plunge into poll mode", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}