{
    "author": [
        "R Rajaram"
    ], 
    "text": "Four Inspectors drafted to verify amenities available in booths\n\nThe city police have set out on the job of inspecting polling booths under its jurisdiction from security point of view and verify basic facilities there.\n\nTowards this direction, four field-level police officers in the rank of Inspector have been entrusted with the task of physically verifying booths and submit reports to the authorities. The four have been nominated as ‘Segment Inspector’ with each one of them earmarked specific assembly constituency and instructed to inspect the booths falling under their respective segment limits.\n\nOf the nine assembly constituencies in the district, the City Police have only Tiruchi East, Tiruchi West, part of Srirangam and part of Tiruverambur constituencies under its jurisdiction.\n\nThe remaining six constituencies fall under the limits of Tiruchi rural police. The city police have over 700 polling stations situated in different locations.\n\nSources said the Cantonment (Crime) Inspector has been entrusted with the task of physically inspecting all polling booths falling under the Tiruchi West assembly segment. The Tiruchi Fort (Crime) Inspector has been directed to verify booths coming under the Tiruchi East assembly constituency.\n\nThe Srirangam Inspector (Crime) would inspect certain polling booths coming under the Srirangam assembly constituency, while the Golden Rock All Women Police Inspector would check some booths falling under the Tiruverumbur assembly constituency.\n\nThe field-level officers were on the job of inspecting every booth in the respective assembly constituency earmarked for each one of them to ascertain a host of aspects. Every Segment Inspector has been provided with a list of polling booths in their respective constituencies to carry out the task. The Segment Inspector have been instructed to verify basic amenities such as electricity, water supply, stability of the building, provision of ramp, if any, type of roofing and entry and exit points in the booths.\n\nAfter inspection, he has been asked to submit a report to the City Police mentioning the deficiencies he had noted down in the polling booths for rectifying them. The sources said the Inspectors would submit the report shortly. The reports would in turn be forwarded to the Collectorate through the City Police Office.\n\nThe Segment Inspectors have been specifically instructed to ensure that there was no stone heap near the polling booths before the day of polling. The exercise has been set in motion well in advance of the assembly election which is scheduled on May 16 so as to rectify the deficiencies. In addition to local police, personnel from the central para-military forces are expected to be deployed on the day of polling in Tiruchi district.", 
    "section": "national", 
    "title": "Police inspect polling booths", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}