{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Vaiko promises to scrap contributory pension scheme, if the combine comes to power\n\n‘SYMBOLIC’ GIFT:DMDK-PWF alliance coordinator Vaiko presenting a gold ring to Viduthalai Chiruthaigal Katchi president Thol. Thirumavalavan at an election campaign meeting in Palayamkottai on Tuesday.— Photo: A. Shaikmohideen\n\nTamil Nadu, which has witnessed a corrupt administration over the past four decades owing to single-party rule, will soon be liberated by the Desiya Murpokku Dravida Kazhagam– People’s Welfare Front, which will provide a transparent and corruption-free administration through a coalition government, leaders of constituent parties have said.\n\nAddressing a public meeting in Palayamkottai on Tuesday, DMDK’s Whip V.C. Chandrakumar said successive Dravida Munnetra Kazhagam and All India Anna Dravida Munnetra Kazagam governments had made corruption a part of their administration.\n\n. Mr. Chandrakumar accused the DMK and the AIADMK governments of ignoring the development of southern districts by allowing more than 75 per cent of industrial investments only in and around Chennai.\n\nDMDK-PWF coordinator Vaiko said corrupt governance of the DMK and the AIADMK would become a thing of the past as both the parties would get uprooted in the May 16 polls.\n\nMr. Vaiko said that their government would scrap the contributory pension scheme for government employees and teachers.\n\nViduthalai Chiruthaigal Katchi president Thol. Thirumavalavan said the PWF-DMDK, by guaranteeing clean administration, had become a thorn in the flesh of the DMK, AIADMK, Congress, Pattali Makkal Katchi and Bharatiya Janata Party.\n\n“Like late MGR, who had to face harsh criticism from his opponents when he entered politics, Mr. Vijayakanth is also facing sharp reactions from a few quarters. The DMDK founder will also soon prove his mettle,” he said.\n\nCPI (M) secretary G. Ramakrishnan said the DMK and the AIADMK had never worried about the standard of education. Consequently, the number of Tamil Nadu students getting admission to prestigious institutions through all-India entrance examinations had come down alarmingly.\n\nCPI secretary R. Mutharasan said the State would get an efficient and corruption-free coalition administration after the May 16 polls.\n\nA gold ring\n\nEven though his party cadres had presented him with ‘golden gifts’ in the form of bracelets, rings and chains, totally weighing about 24.50 kg, during his year-long 50th birthday celebrations, VCK president Thol. Thirumavalavan does not wear gold ornaments. When the Election Commission’s announcement on the allotment of ‘Ring’ to Viduthalai Chiruthaigal Katchi as symbol broke out on Tuesday morning, Mr. Vaiko presented him with a ring, weighing about two sovereigns, and appealed to him to wear it always. “When my parents presented me with rings on two occasions, I politely refused to wear them. The gold ornaments presented by the ‘Chiruthaigal’ during the golden jubilee celebrations are going to be used to start a satellite television channel for the party. Now, I have been compelled to wear a ‘kanaiyaazhi’ due to the immense love and affection shown by my Annan (Mr. Vaiko),” Mr. Thirumavalavan said.", 
    "section": "national", 
    "title": "‘PWF-DMDK will offer corruption-free administration’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}