{
    "author": [
        "S Prasad"
    ], 
    "text": "She returned home soon only to come back in 1920 and settle down\n\nDevotees offer floral tribute to the portrait of Sri Aurobindo and Mother in Puducherry Railway Station on Tuesday. —Photo: S.S. Kumar\n\nThe 102nd anniversary of the visit of Mirra Alfassa, or The Mother, to the city was celebrated with a session of meditation and silent prayer on Tuesday.\n\nA special commemoration was held at the Puducherry Railway station by The World Peace Trust of Pondicherry and the Bangavani Trust of Nabadwip Dham West Bengal.\n\nIt was in 1914, at the age of 36, that Mirra, accompanied by her spouse Paul Richard, embarked on two different journeys; one an exacting trip stretching over three weeks by ship, boat and train to this city, the other one of life-changing self-discovery and enlightenment that would follow her momentous meeting with Sri Aurobindo in this city.\n\n“The Mother arrived at Puducherry Railway station on the morning of March 29, 1914. While approaching Puducherry, the Mother had a vision of a huge column of light and the intensity of the light became greater when she arrived in the city. She met Sri Aurobindo at his Ashram and recognised him as her guru or Krishna,” Dibyendu Goswami, convenor of the Bangavani Trust told The Hindu.\n\nThough The Mother returned home after her first arrival in 1914 she came back to settle here permanently in 1920 and took charge of the Ashram, Mr. Goswami said.\n\nWhile the centenaries of both the events were celebrated on a grand scale in 2010 and 2014, the World Peace Trust here and the Bangavani Trust based in Nabadwip Dham, West Bengal, have been celebrating the anniversaries of both events with various programmes since 2002.\n\nAt Sri Aurobindo Ashram, a large number of devotees and followers of The Mother and Sri Aurobindo thronged the premises to commemorate the occasion of The Mother’s first arrival in Puducherry.\n\nCultural events\n\nVarious cultural and spiritual activities were also held at the Ashram school to celebrate the occasion.", 
    "section": "national", 
    "title": "Remembering Mother’s first visit to Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}