{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Attack couple with sickles; take away gold, silver articles, cash and car\n\nIn yet another incident of robbery in the district, an eight-member masked gang struck at the house of Chozhapuram village panchayat president M. Lakshmi (35), and attacked her and her husband with sickles after holding their children at knifepoint on Monday night.\n\nPolice said that Lakshmi and her husband Mari (40) were sleeping on the first floor of the house with their two sons, aged 7 and 5 years, when the gang members, armed with deadly weapons, reached the terrace after scaling the compound wall from the rear side. The robbers knocked on the door at the terrace and when Mr. Mari opened it, they assaulted him and gained entry into the house.\n\nThey also attacked Ms. Lakshmi and when they held the two children at knifepoint, Ms. Lakshmi handed over her Thali chain, ear studs and bangles, totally weighing 13 sovereigns, to the robbers, the police said.\n\nShe also handed them over keys of four almirahs and the car, and the robbers escaped after taking away Rs. 20,000, one and a half kg of silver articles and some documents related to immovable property.\n\nThe gang members escaped in an SUV parked in the house, and the police later found the vehicle abandoned near Usilampatti crematorium. The robbers attacked Mr. Mari when he resisted. He suffered six cuts in his hands, face and stomach. The couple were admitted to a private hospital in Madurai.\n\nSP Ziaul Haque visited the house, and pressed into service fingerprint experts and sniffer dogs. He formed three special teams to crack the case. The police suspected a personal motive, police sources said.\n\nEarly this month, burglars struck at the police quarters in Karaikudi and decamped with 29 sovereigns of gold jewellery and Rs. 85,000 from the house of a Special Sub-Inspector of Police. No breakthrough had been achieved in the case. Last week, robbers robbed a woman of twelve and a half sovereigns of jewellery at knifepoint in the same area. Two days ago robbers struck at two houses, a clinic and school near Taluk Office.", 
    "section": "national", 
    "title": "Robbers target panchayat president’s house", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}