{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Several representations to the authorities concerned go unheeded\n\nThe tank in Thuraiyur remains neglected. It needs to be dredged and maintained properly.— Photo: B.Velankanni Raj\n\nAny visitor to Thuraiyur will never miss to have a glimpse of Chinna Eri near the bus stand and its continued neglect.\n\nIt is hard to believe that this tank had once remained the perennial source for meeting the drinking water needs of the residents of Thuraiyur municipality.\n\nBut, today, the water body had been posing a health hazard for the residents. Huge volume of solid waste was deposited into it daily making it a breeding ground for mosquitoes. It has no bunds and a row of vans and taxis forms the boundary in front of the bus stand.\n\nMany commercial establishments situated around the tank dump their waste in it, regret local residents. The problem gets aggravated during the monsoon, when the waters gush into the Tiruchi-Thuraiyur highway, due to overflowing in the tank. A group of residents said that although several representations had been made to the authorities by members of the public, nothing had materialised.\n\nApart from meeting the drinking water needs, the water could be utilised for irrigating fields, says R. Arunachalam, one of the leading farmers of Thuraiyur.\n\nR. Kiruba, joint director of Tiruchi District Farmer Producer Company, Thuraiyur, says that immediate action should be taken for the preservation of the water body. There are two tanks — “Periya Eri” and “Chinna Eri” in the town.\n\nThe surplus from the first tank entered into the second one during monsoon. The supply channel should be cleared of plastic and solid wastes. In fact, a comprehensive plan should be evolved and implemented for preserving the massive water body.", 
    "section": "national", 
    "title": "Thuraiyur’s Chinna Eri has become a garbage dump", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}