{
    "author": [], 
    "text": "RELIGION\n\nSri Pundarikasha Perumal Temple, Thiruvellarai : Ratha utsavam, Perumal purappadu from Kannadi arai, 4.30 a.m.; reaching Vagana Mandapam, 5 a.m.; purappadu in Simha vaganam, 5.30 a.m.; reaching vagana mandapam, 6.30 a.m.; purappadu in tholukiniyan, 10.45 a.m.; reaching Yanai vagana asthana mandapam, 11 a.m.; purappadu in yanai vaganam, 8 p.m.; reaching kannadi arai, 10 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, Varasiddhi Sri Anjaneyar Sannidhi, South Chithra Street, Srirangam, 6 p.m.; Veera Sanjeevi Anjaneyar Sannidhi, West Gate, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 54 I Main Street, SMESC Colony, 6 p.m.\n\nGENERAL\n\nShri Angalamman College of Engineering and Technology : Telefest 2016 – valediction of ECE Association, R.Saranya, senior device associate, Amazon Development Centre, distributes prizes, 4 p.m.; Valediction of Computer Science and Engineering and Information Technology association, Bharath Mohan Rajendran, senior interactive developer, SapientNitro, chief guest, 10.45 a.m.\n\nM.A.M.College of Engineering : Lectures on entrepreneurship development by K.Balasubramaniyan and M.Rajamaheswari, entrepreneurs, 9.30 a.m.\n\nM.A.M.B School: Lecture on Neuro linguistic programming by S.Shanmugam, associate professor, M.A.M.College of Engineering and Technology, 10 a.m.\n\nEcole de Bambino : Annual day, Kingsley Jebakumar, paediatrician, chief guest, Hotel Sangam, 6 p.m.\n\nTiruchi District Kiddees Sports Development Association and VEPSA of St.John’s Vestry Anglo Indian Higher Secondary School: Inauguration of sports fest and inter-school sports meet, M.Asok, correspondent, SBIOA Schools, chief guest, Anna Stadium, 10 a.m.\n\nBharathidasan University Department of Women’s Studies and Department of Educational Technology : Lecture on ‘Education - an instrument for Promoting Gender equality,’ by V. BharathiHarishankar of University of Madras, Khajamalai Campus, 2.30 p.m.\n\nTiruchi District Tiny and Small Scale Industries Association: Facilitation programme on online vendor registration with Railways and Defence, Pathanjali, MD, High Energy Batteries Ltd., inaugurates, TIDITSSIA office, Ariyamangalam,10 a.m.\n\nSaranathan College of Engineering, Department of Electronics and Communication Engineering : National conference on ‘Advanced Communication Systems and Signal Processing,’ 10 a.m.\n\nK.Ramakrishnan College of Engineering Department of Mechanical Engineering : National conference on Latest techniques in mechanical engineering, 10 a.m.\n\nSouthern Railway Mazdoor Union : Annual conference of SRMU supervisor council, G.Eswarlal and S.Veerasekaran, speak, BTC New Auditorium, Golden Rock, 2.30 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}