{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu has not signed the Ujwal Discom Assurance Yojana (UDAY) scheme as it is not people-friendly, State Power Minister Natham R. Viswanathan said.\n\nNeither the State nor the people will benefit from the UDAY scheme. Only private power producers and banks that gave them loans would benefit, he said in a statement on Tuesday.\n\nUnion Power Minister Piyush Goyal had said that he could make any significant impact (on power reforms) only if there was a government change in Tamil Nadu as it was a “State within State” with Chief Minister Jayalalaithaa “inaccessible”.\n\nPointing out a clause in the scheme mandates tariff restructuring every three months, Mr. Viswanathan wondered how a scheme that hiked power tariff every three months could be called people-friendly. The scheme was to cheat people in the name of power reforms, he alleged. Opposition parties in Tamil Nadu, including the DMK, should clarify their stand on frequent power tariff hikes, he said.\n\nRecalling that a team led by him had met the Union Power Minister on October 9, 2015, he said Tamil Nadu did not reject the scheme outright but asked for modifications and concessions to make the scheme useful.\n\nThe Centre did not accept any of the suggestions or give reasons for rejecting them. The Chief Minister had also written a letter to the Prime Minister on October 23, 2015 detailing the changes required in the scheme to benefit everyone. Instead of giving a proper reply, Mr. Goyal has spoken in an uncivilised manner for political gains, Mr. Viswanathan charged.\n\nRecalling the Union Power Minister’s praise for Ms. Jayalalithaa in the Lok Sabha on March 19, 2015, he said if the Centre was keen to help the Discoms, it should have reduced the price of coal and its transportation cost.\n\n‘A clause in the scheme mandates tariff restructuring every three months’", 
    "section": "national", 
    "title": "UDAY scheme not people-friendly, says Power Minister", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}