{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "ATMs situated next to each other along Union Mill Road in Tirupur.– Photo: R. VIMAL KUMAR\n\nWhen Reserve Bank of India recently observed about the inadequate number of ATMs in the country vis-a-vis growth in cards in its concept paper on card acceptance infrastructure, the situation in Tirupur pose an interesting picture with a difference.\n\nThere has been an exponential increase in the ATMs in the industrially buzzing Tirupur district during the recent years but at the same time its non-uniform distribution geographically is thwarting its full benefits from reaching the consumers.\n\nAccording to Lead District Manager V. Ganesan, the district has around 420 ATMs of 42 commercial banks with about 20 more to come up very shortly.\n\n“Of the ATMs, about 100 have come up during this fiscal itself which is a stupendous growth,” he told The Hindu .\n\nHowever, the consumers concern comes with the fact that about 80 per cent of the ATMs in the district are placed in urban localities and a good chunk among them are congregated in confined localities.\n\n“In Tirupur city, one can see large numbers of ATM kiosks situated within a span of 100 me in various stretches and among them, many of the ATMs of different banks are situated next to each other along arterial roads like P.N. Road, Uthukuli Road, and Union Mill Road. But, some areas did not have any ATMs,” said P. Somasundaram, secretary of Tirupur Consumer Voice.\n\nConsumers are of the opinion that the ATMs need to be widely spread considering that more people in villages have opened bank accounts in the recent times as part of financial inclusion project.\n\nWhen contacted, bank sources cited the economical viability of running ATMs as the prime reason for it being placed mostly in prime commercial areas. “Unless there are more hits, the maintenance of ATMs will be tough.\n\nAt present, transaction charges are levied for all withdrawals from other bank ATMs in the case of current accounts and for more than five withdrawals in other bank ATMs a month in the case of savings bank accounts,” said bank officials.\n\nBut consumers are of the opinion that at least public sector banks should not look at the operational costs rather serve the common man.", 
    "section": "national", 
    "title": "Uneven distribution of bank ATMs not helping consumers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-30"
}