{
    "author": [
        "National Bureau"
    ], 
    "text": "A day after it took a tough stance on discriminatory pricing for data services, effectively blocking Facebook’s Free Basics from India, the telecom regulator on Tuesday hinted that technology-driven connectivity ventures such as the ones being pursued by Google and Facebook would be acceptable only if they followed an open source framework.\n\nWhile Facebook is working on a venture that deploys drones in remote and rural areas to provide Internet connectivity, Google’s Project Loon envisages the use of helium-filled balloons to provide data connectivity in remote regions.\n\nThe two are trying these approaches as alternative models to reach data connectivity aerially to users instead of the traditional route of installing towers and optic fibre cable networks.\n\n“I don’t like to comment on a specific product. But India has adopted an open source policy and open API [application program interface] policy. The whole objective is that there should not be a situation of a vendor lock-in,” Ram Sewak Sharma, chairman of TRAI, said in response to a query about Project Loon’s prospects at the India Digital summit. “This is because any service cannot be held hostage to a technology,” Mr. Sharma told the summit, hosted by the Internet and Mobile Association of India.\n\n“Any technology that is deployed for connectivity must be interoperable and broadly, the open standards framework and the principles it entails are extremely important,” he explained.\n\nGoogle hopes to launch the Loon project in India and wants to start testing for it soon, but the government has flagged some concerns such as possible interference with cellular network transmissions due to the frequency band it seeks to use.\n\nIn a visit to India in December 2015, Google CEO Sundar Pichai had said the company had ‘tonnes of data’ from its tests in Sri Lanka and Indonesia to demonstrate that Project Loon created no such interference and would be sharing it with the government.\n\nGoogle is keen on working with telecom operators in the 700 Mhz-900 MHz spectrum band for Project Loon.\n\nAccording to Google, each balloon can provide connectivity to a ground area about 40 km in diameter using a wireless communications technology called 4G.", 
    "section": "national", 
    "title": "‘Adopt open source for connectivity’", 
    "subsection": "general", 
    "date": "2016-02-10"
}