{
    "author": [
        "National Bureau"
    ], 
    "text": "Mass of snow could have acted as insulator for trapped jawan\n\nScience doesn’t usually like the word “miracle,” but few other words can describe the recovery of Lance Naik Hanumanthappa Koppad’s still-breathing body after being buried in an avalanche in the Siachen Glacier. Were one to be trapped in an avalanche and rescued within the first 15 minutes, there is a 92 per cent chance of survival. However, just 15 minutes more, and those odds drop to 35 per cent and to 1 per cent in 130 minutes, according to a study of ski-accident survivors by biostatistician Markus Falk of the University of Innsbruck, Austria, and his colleagues.\n\nKoppad, were he to recover at the hospital, would have beaten those odds many times over. What makes his survival more astounding is that most of these calculations are on people buried no more than 10 feet, and Koppad was reportedly buried 25 feet below. Though the sub-zero temperatures can rapidly — and critically — damage the body, a mass of snow can act as an insulator for those trapped. This is because of air pockets that trap air and body heat which can raise temperatures to about -7C; grossly uncomfortable but slightly more likely to prolong one’s chances of being conscious and being discovered by a rescue team.\n\nAssuming that those trapped in an avalanche weren’t critically injured by trees or boulders, asphyxiation and hypothermia (when the body loses heat faster than it produces) are what eventually kill.\n\nResearchers at the University of Utah have tried to simulate the conditions of hypothermia by having volunteers buried in “snow-like” conditions. In general, they found that the body loses 30 degrees C per hour when trapped, which is alarming, given the average body temperature of 37 degrees C. Also, when snowed in, the body inspires more carbon dioxide and that accelerates the rate at which the body loses its core temperature.\n\nThere are reports of people surviving two months with minimal food in a snow-pit or caves, but avalanches are different. Snow can pile up like concrete and will not allow even wriggle-room. Hypothermia can affect the nerves and cause disorientation, and various organs to clamp up, before causing cardiac failure.\n\nResearchers say that body loses\n\n30 degrees C per hour when trapped, which is alarming", 
    "section": "national", 
    "title": "Air pockets may have kept him alive", 
    "subsection": "general", 
    "date": "2016-02-10"
}