{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The BJP and the Akali Dal have decided to face the Assembly elections in Punjab in 2017 jointly, and as a sign of good faith, the Akali Dal will help get BJP vice-president and Rajya Sabha member, Avinash Rai Khanna, re-elected to the Upper House.\n\nPunjab Deputy Chief Minister Sukhbir Badal met BJP president Amit Shah on Tuesday evening, and in the background of an NDA meeting where almost all constituents of the alliance had complained of being taken for granted, the decision to stay together was endorsed.\n\n“The BJP will fight 23 seats, the Shiromani Akali Dal will fight 91 seats, and a decision is pending on the rest of the three seats in the Assembly,” said Mr. Badal after the meeting. The Punjab Assembly has 117 seats.\n\n“The only thing is that cricketer and former MP, Navjot Singh Siddhu, who is distinctly anti-Akali Dal, be reined in,” said a source in the party. “We will need 21 votes or Assembly seats to get a member elected to the Rajya Sabha from Punjab. The Akalis with 58 seats can get two members re-elected rather cleanly. We have only 12 Assembly member votes, and therefore, we will have to take the rest from the Akalis,” said a source from the BJP.\n\nThe BJP’s recent moves to be conciliatory to its allies comes on the back of a series of controversies in the past few Parliament sessions that have seen an index of Opposition unity rise. Mr. Badal had been one of the most vocal critics of the BJP’s neglect of its allies, followed by the Shiv Sena. Many of the parties had been part of the NDA government headed by former Prime Minister Atal Behari Vajpayee and compared their rather more gentle treatment then with the neglect now.\n\nThe Akali Dal is one of the oldest allies of the BJP, and recent problems between the two pertaining to heavy anti-incumbency against the NDA government in the State and Mr.Siddhu’s pronouncements against that government had created some fissures. Mr.Badal had met Finance Minister Arun Jaitley on Monday morning, and the terms or rapprochement had been more or less finalised then.", 
    "section": "national", 
    "title": "BJP, Akali Dal decide to contest polls together", 
    "subsection": "general", 
    "date": "2016-02-10"
}