{
    "author": [], 
    "text": "They can be used in search-and-rescue operations in future\n\nThree cockroaches slide through a 3-mm crevice under a door. Scientists have developed a robot that simulates their flexibility.— Photo: Reuters/UC Berkeley\n\nInspired by cockroaches that can squeeze through tiny spaces, U.S. scientists have designed a small robot that may one day help locate people in the rubble of earthquakes, tornadoes or explosions.\n\nThe technology by the University of California, Berkeley was unveiled on Monday in the Proceedings of the National Academy of Sciences . “What’s impressive about these cockroaches is that they can run as fast through a quarter-inch gap as a half-inch gap, by reorienting their legs completely out to the side,” said lead researcher Kaushik Jayaram, who is now a postdoctoral fellow at Harvard University. “They’re about half an inch tall when they run freely, but can squish their bodies to one-tenth of an inch — the height of two stacked pennies.”\n\nThe palm-sized robot, known as CRAM — for compressible robot with articulated mechanisms — is capped with a plastic shield, much like the wings on the back of a cockroach.\n\nUsing a specially built obstacle course, the researchers observed how cockroaches scurried in less than a second through crevices smaller than a quarter of their height by compressing their jointed exoskeletons in half.\n\nOnce inside the crevice, the cockroaches managed to move rapidly, at nearly 20 body lengths per second, with their legs splayed completely out to their sides.\n\n“If you scale it up to the size of a human, it would be equivalent to about 70 miles per hour (113 kph), over twice the speed of the fastest sprinter,” Mr. Jayaram said.\n\n“In the event of an earthquake, first responders need to know if an area of rubble is stable and safe, but the challenge is, most robots can’t get into rubble,” said Robert Full, a professor of integrative biology at UC Berkeley.\n\n“But if there are lots of cracks and vents and conduits, you can imagine just throwing a swarm of these robots in to locate survivors and safe entry points for first responders.”\n\nResearchers say their robots are inexpensive to make, and they are working on various versions for real-world testing.\n\nFunding for the research has come from the U.S. Army Research Laboratory, as part of a collaboration between industry and university partners. — AFP/ Reuters\n\nNature has a library of design ideas. ...The most important discoveries are often from the most unexpected creatures, some of which are disgusting.", 
    "section": "national", 
    "title": "Cockroach-inspired robots can squeeze through cracks", 
    "subsection": "general", 
    "date": "2016-02-10"
}