{
    "author": [
        "Smita Gupta"
    ], 
    "text": "M.B. Rajesh, MP from Kerala, says the Left Democratic Front is already in the middle of a campaign against the Congress in the State.\n\nCongress leaders from Kerala have conveyed to party vice-president Rahul Gandhi their discomfort with the possibility of an electoral understanding with the Left Front in West Bengal, a Central party functionary told The Hindu .\n\nWith both West Bengal and Kerala, where the Left parties and the Congress have been principal adversaries for decades, going to the polls around the same time, a tie-up between the two in one State could change the political optics in the other, he said.\n\n“The Left Democratic Front (LDF),” he continued, “is our main opponent in Kerala. So, a Congress-Left alliance in Bengal may not just benefit the BJP that is trying hard to open its account in Kerala — our fight against the LDF will simply not carry the same conviction, the sharpness will be lost. It will demoralise our cadres. For over three decades, we have taken an anti-Marxist position, while the LDF has preached anti-Congressism.”\n\nThis debate within the Congress comes in the wake of its leaders from West Bengal officially declaring earlier this month, shortly after they met Mr. Gandhi here, that the only way to remain politically relevant was to forge an alliance with the Left in the State.\n\nMr. Gandhi, party sources said, then called up his colleagues in Kerala to try and gauge whether this would impact the polls in their State. Apparently, pointing out that this would place them at a disadvantage in Kerala, they told Mr. Gandhi that the last time a faction of the Congress had formed a government with the Left in 1970, it had not lasted long and the party had to pay for it.\n\nMeanwhile, there is a similar ambivalence in the Left as well.\n\nFor the Left that has held sway in West Bengal from 1977 to 2011, these last four-and-a-half years have been difficult, with only marginal signs of recovery. So, the State unit has been giving due consideration to this proposal, with the CPI(M) leadership, addressing a rally at Kolkata’s Brigade Parade Grounds on December 27, highlighting the twin threats to democracy and secularism.\n\nHowever, their counterparts in Kerala are very clear: they feel such an alliance in Bengal will put an end to their chances of defeating the UDF in their State. In response to a question, CPI(M) Member of Parliament M.B. Rajesh told The Hindu , “I don’t think an alliance with the Congress is likely in West Bengal, if we read the message of the Visakhapatnam conference correctly, a line reiterated at the Kolkata Plenum.” He also stressed, “We are fighting the Congress-led UDF government and are already in the middle of our campaign. Some pro-UDF papers in Kerala are writing about the possibility of such an alliance to create confusion in our ranks.”\n\nIf the Congress is yet to take a final view on whether or not to have an alliance with the Left in West Bengal, CPI(M) Politburo member Mohammad Salim said that the State committees in the two States would meet shortly to take their individual views that would then be discussed at the Central Committee and Politburo.\n\nTop Congress sources, acknowledging that an alliance with the Left in Bengal would pose problems for it in Kerala, where as the head of the coalition that rules the State, its stakes are much higher. Therefore, these sources said, in the end, the arrangement – if it takes place – might be of an informal, undeclared nature.\n\nEssentially, for both the Left and the Congress – both of which performed very poorly in the 2014 Lok Sabha polls — the choice is between conceding ground to a secular party to make some short term electoral gains or taking the longer, tougher path to rebuilding their respective party organisations.", 
    "section": "national", 
    "title": "Congress, Left in dilemma over poll tie-up", 
    "subsection": "general", 
    "date": "2016-02-10"
}