{
    "author": [], 
    "text": "Taking a cue from cotton candy machines, scientists have developed a 3D artificial capillary system that can keep living cells viable and functional for more than a week, thus paving the way for making life-size artificial livers, kidneys, bones and other essential organs.\n\nLeon Bellan, Assistant Professor of mechanical engineering at Tennessee-based Vanderbilt University, has been tinkering with cotton candy machines for years.\n\nHis goal is to make fibre networks that can be used as templates to produce the cell capillary systems required to create full-scale artificial organs.\n\nMicrofluidic networks\n\n“People think this approach is crazy, but now we have shown we can use this technique to make microfluidic networks that mimic the 3D capillary system in the human body in a cell-friendly fashion,” Prof. Bellan noted in a paper in Advanced Healthcare Materials . Prof. Bellan is currently focusing on water-based gels called hydrogels, for using them as scaffolds to support cells within 3D artificial organs.\n\nTo engineer tissues that have the thickness of real organs and keep cells alive throughout the entire scaffold, researchers must build in a network of channels that allow fluids to flow through the system, mimicking the natural capillary system.\n\nAccording to Prof. Bellan, his cotton-candy spinning method can produce channels ranging from three to 55 microns, with a mean diameter of 35 microns.\n\nSo far, the other approaches have only managed to create networks with microchannels larger than 100 microns, about ten times the size of capillaries.\n\n“Our experiments show that after seven days, 90 per cent of the cells in a scaffold with perfused microchannels remained alive and functional, compared to only 60 to 70 per cent in scaffolds that were not perfused or did not have microchannels,” Prof. Bellan wrote.\n\n“Our goal is to create a basic ‘toolbox’ that will allow other researchers to use this simple, low-cost approach to create the artificial vasculature needed to sustain artificial livers, kidneys, bone and other organs,” he explained. — IANS", 
    "section": "national", 
    "title": "Cotton candy machine holds secret of making artificial organs", 
    "subsection": "general", 
    "date": "2016-02-10"
}