{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "The Indian government will closely scrutinise the Bill & Melinda Gates Foundation’s (BMGF) methods of donations in India after an international report accused the world’s biggest philanthropist of influencing government policies in favour of multinational pharmaceutical companies.\n\nUnlike other international donors, the BMGF is not registered under the Foreign Contribution Regulation Act (FCRA), leaving its funding out of the ambit of the Ministry of Home Affairs (MHA), which is the regulatory authority for NGOs and associations who receive foreign funds.\n\nThe foundation instead operates as a “Liaison Office” under the Foreign Exchange Management Act (FEMA) as approved by the Reserve Bank of India (RBI). In June last year, the Modi government cracked down on NGOs receiving foreign funds, cancelling licences of over 10,000 organisations. The Gates Foundation was not affected as it is not registered under the FCRA, which in itself is a violation, say experts.\n\nA senior MHA official says, “We have not thought of any action yet, but the BMGF will have to abide by rules and register itself under the FCRA.”\n\n“Since it is not registered under the FCRA, the funding of NGOs doesn’t come under the government’s watch list. It is not clear where and what they are funding. It is a loophole and it can open gates for other NGOs as well to use this route to escape scrutiny,” said a senior government official.\n\nThe official says the RBI allows “liaison offices” to operate in India and the central bank does not want to give up this power. This is being exploited by many foreign associations and organisations to route undetected foreign funds.\n\n“Though the RBI gives LO permits, it does not regulate them as there are no such rules. No inspections can take place and thus no taxes are paid. The BMGF works as a marketing office for U.S. pharmaceutical vaccines pushing only WHO pre-approved manufacturers, all of whom are either USA or EU based,” says the official.\n\nIn Ford Foundation’s case, MHA first put it under a “watch-list” category as it funded Gujarat-based activist Teesta Setalvad’s NGOs. Ford was neither registered as a society nor under FCRA. After the government’s crackdown, Ford registered itself under FEMA last month. Officials say the international NGO will soon be taken off the watch-list.\n\nThe Centre’s move on BMGF comes after a 54-page report by Global Justice Now, a U.K.-based organisation, stated that the foundation’s policies are, “directly benefitting big business by using their influence to push industry friendly policies, particularly in the health and agriculture sector.”\n\nIn response to a query from The Hindu , the foundation’s spokesperson Archna Vyas says, “We were one of the first foundations to join the International Aid Transparency Initiative (IATI), and all [details of] our grants are available on our website for anyone to review. We apply a rigorous approach to funding our partners, monitoring and evaluating the effectiveness of the work and ensuring compliance and require all partners and grantees to adhere to international and any additional national standards.”\n\nIn the health sector, the BMGF is accused of altering aid priorities by ‘legitimizing the role of multinational pharmaceutical companies’ by pushing for public-private-partnerships (PPPs). According to Global Justice Now, both the BMGF-funded Global Fund to Fight AIDS, Tuberculosis and Malaria (GFATM) and the GAVI Alliance, are PPPs and have questionable associations with the pharmaceutical industry.\n\n“Merck currently sits on the board of the Global Fund while members of the GAVI board always include companies in the International Federation of Pharmaceutical Manufacturers, which involves GlaxoSmithKline, Merck, Novartis, and Pfizer, among others. Global Health Watch notes that private sector influence on the Global Fund’s Board is disproportionately large,” states the report.", 
    "section": "national", 
    "title": "Gates Foundation on Centre’s radar", 
    "subsection": "general", 
    "date": "2016-02-10"
}