{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The Sony Ericsson handset (model SEK 7701), with which David Coleman Headley videographed key targets a few months before the 26/11 Mumbai terror attacks, was given to the Lashkar-e-Taiba operative by his handler Major Iqbal, an official of Pakistan’s Inter-Services Intelligence (ISI).\n\nAccording to NIA officials, this phone was used by Headley when he visited India during April-June 2008. It was Major Iqbal who taught Headley how to operate the instrument. The three phone numbers used by Headley in India were 9819829221, 9820910814 and 39920280935.\n\nAccording to the charge sheet filed by the NIA, “Before a crucial meeting in Rawalpindi (December 2007), Major Iqbal had given Headley a Sony Ericsson mobile phone with camera for carrying out clandestine photography/videography in India for future attacks.”\n\nThe handset was in the custody of the Federal Bureau of Investigation (FBI). It was seized when Headley was arrested at the Chicago airport in November 2009.\n\nThe U.S authorities have shared with the NIA the International Mobile Subscriber Identity (IMSI), the International Mobile Equipment Identity (IMEI) and the network code of the phone, said a senior government official.\n\nThe reply from the U.S. comes after the NIA first made a request five years ago. “It is a crucial piece of evidence and will help bolster our case. We will try to extract details about the movement of Headley with the help of his phone details,” said the official.\n\nWith this phone, Headley had filmed the residential areas around the Bhabha Atomic Research Centre (BARC), Taj Hotel, the Naval Air Station, the Police Headquarters, the State Assembly, Siddhi Vinayak Temple, Chabad House and Mumbai Stock Exchange, Leopold restaurant and Trident Hotel. Headley has also said he used to get calls from Major Iqbal on this number, and the calls were masked to have generated from New York.\n\nAccording to the NIA, during his previous visits to India, Headley carried a camera which he had taken from his mother-in-law in Pakistan.", 
    "section": "national", 
    "title": "Handset was given by ISI handler", 
    "subsection": "general", 
    "date": "2016-02-10"
}