{
    "author": [
        "G V R Subba Rao"
    ], 
    "text": "After nearly six decades of sailing across the oceans, the Indian Navy’s warhorse aircraft carrier, the INS Viraat, is all set to start a new voyage by this year-end.\n\nThe warship will be used to promote tourism in the State soon after its decommissioning. The government is contemplating developing it as a hotel in the sea, or it may even become a museum depending on logistics. The Visakhapatnam Urban Development Authority (VUDA), Indian Navy, and a private firm (yet to be identified) would float a joint venture shortly. The commercial operations would be done through private firm. The aircraft carrier would be re-jigged to promote tourism. The 1,500 rooms available on the aircraft carrier would be used as tourist destination in Visakhapatnam. About 500 people can be accommodated at board room there. “It looks like a hotel in a sea. You can pay around Rs. 1 lakh to Rs. 2 lakh and stay put in Commander Suit of INS Viraat,” said Chief Minister N. Chandrababu Naidu. The government also asked the Centre to foot the budget to station and maintain the ship and make it as a tourist spot. Defence Minister Manohar Parrikar has agreed to hand over the decrepit warhorse to Andhra Pradesh, he said. For the record, the Centre had asked the governments of maritime states, including Andhra Pradesh, whether they were interested in taking the custody of the decommissioned ship. The Centre has offered the States to buy the warship at just Re. 1. It was reported that the refurbishing of warship would approximately cost Rs.300 crore, apart from the annual maintenance expenditure.\n\nVisakha Veterans’ plea\n\nVisakha Veterans, an NGO for ensuring safety and security for the next generation and beyond, has appealed to the State government and Naval authorities to take timely decision to convert the soon-to-be decommissioned INS Viraat into a maritime museum.", 
    "section": "national", 
    "title": "INS Viraat to start new voyage as a hotel at sea!", 
    "subsection": "general", 
    "date": "2016-02-10"
}