{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Lance Naik Hanumanthappa Koppad, who miraculously survived for five days under several feet of snow in the Siachen glacier, was on Tuesday flown out in a helicopter to the Siachen base camp, from where he was brought to the Thois airbase. Within hours, he was transported on an Indian Air Force aircraft, accompanied by critical care specialists, to New Delhi.\n\nPrime Minister Narendra Modi, who visited the hospital on Tuesday, praised “the endurance & indomitable spirit of Lance Naik Hanumanthappa”, and called him “an outstanding soldier.”\n\nDefence Minister Manohar Parrikar extended prayers to “Naik Hanamanthappa who miraculously survived the avalanche at Siachen”.\n\nArmy Chief General Dalbir Singh spoke of the soldier’s indomitable mental robustness and his refusal to give in to the harsh elements.\n\nThe appreciation of the fighting spirit shown by Hanamanthappa came even as several military sources criticised the way the entire top brass rushed in to condole the death of all those who were hit by the avalanche.\n\nAbout 150 soldiers, two rescue dogs — Dot and Misha — and some sophisticated radars all were part of the heroic rescue efforts at Siachen since February 3, when an ice wall broke off and fell on the Army post located at 19,500 feet in northern glacier. The debris covered an area of 800 x 1000 metres with a depth of 25 to 30 feet, some of the boulders as big as a small room.\n\nOver 150 soldiers, including specialised rescue teams, began round-the-clock search operation in Siachen, where the day temperature was an average of -30 degrees Celsius and night temperature fell to around -55 degrees Celsius. A medical aid post was also set up.\n\nThe military airlifted rock drills and electrical saws to break the blue ice that is harder than concrete.", 
    "section": "national", 
    "title": "Modi lauds Koppad’s indomitable spirit", 
    "subsection": "general", 
    "date": "2016-02-10"
}