{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "A jawan checks the identity card of a person in Srinagar on Tuesday, following restrictions imposed by authorities after separatist groups called for a general strike on the third anniversary of execution of Parliament attack convict Afzal Guru.— PHOTO: PTI\n\nWhile Parliament attack convict Afzal Guru’s third death anniversary disrupted normal life in Kashmir on Tuesday, a cartoonist accused social networking site Facebook of striking down his work on Guru, evoking sharp reaction from netizens in the State.\n\nAll shops, business establishments, banks and petrol pumps remained closed, while very few vehicles plied.\n\nAuthorities placed several separatists under house arrest and detained many others to “maintain law and order.” At least five police stations in Srinagar’s old areas were placed under curfew-like restrictions since morning.\n\nA cartoon depicting roots from Guru’s grave connecting itself beneath the ground to a tree symbolising Kashmir was allegedly stopped from circulation from cartoonist Mir Suhail’s account. However, several supporters of Guru reposted the drawing in protest.\n\n“It [the cartoon] got deleted from Facebook on Tuesday morning with a message ‘We removed something you posted’ with the image of the post with the Guru cartoon. FB has also blocked me from posting new cartoons on the page,” said Mr. Suhail, a cartoonist with the daily newspaper Rising Kashmir .\n\nWhile Facebook said “it was looking into the matter”, netizens trolled the social networking site.\n\n“The cartoon by Mir Suhail was removed by Facebook just after an hour of publishing it on his official Facebook page. This time to satisfy the ‘collective conscience’ of a certain class or community of netizens. Share it, make it #ýViral (sic),” so went a post.\n\nOn February 9, 2013, Guru was hanged in Tihar Jail for his role in the Parliament attack. His son, Ghalib Guru, reiterated his plea, requesting authorities in New Delhi “to return the belongings of Guru.”", 
    "section": "national", 
    "title": "Netizens upset over removal of cartoon", 
    "subsection": "general", 
    "date": "2016-02-10"
}