{
    "author": [
        "Michael Cieply"
    ], 
    "text": "Nominees’ luncheon showed ceremony remains intact despite #OscarSoWhite controversy\n\nAcademy of Motion Picture Arts and Sciences CEO Dawn Hudson (left) and its President Cheryl Boone Isaacs at the Academy Awards nominee luncheon on Monday.— Photo: Getty Images/AFP\n\n“This year, we all know there’s an elephant in the room,” said Cheryl Boone Isaacs, the president of the Academy of Motion Picture Arts and Sciences, as she officially opened the annual Oscar nominees luncheon on Monday.\n\n“I have asked the elephant to leave,” Ms. Isaacs added.\n\nAnd with that, the academy’s diversity controversy — which began last month when its actors branch nominated only white performers for the second year in a row, and continued when Ms. Isaacs and her fellow governors announced steps to broaden the group’s membership and choices — was taken off the table for the afternoon.\n\n“There’s your story,” Charlie Kaufman, co-director of Anomalisa , said with a laugh. Minutes before, Mr. Kaufman, at Table 19, had been puzzling over the problem of reporting news from an event that, by design, generates so little.\n\nMs. Isaacs’ message, firmly and briefly delivered, was simply that the Oscar rituals — including its awards ceremony, set for broadcast on February 28 — will proceed as planned, no matter the debate about their validity or racial balance.\n\nLuscious menu\n\nWhat was on the table? Chilled beet salad with wild arugula, cedar-planked arctic char, and something called chocolate royaltine crunch. With berries. And Chantilly cream. And mango coulis. Plus assorted truffles.\n\nThese nominees, most of them, are show business troupers, and most have learned to make the most of their Chantilly cream-covered ride.\n\n“I’m trying to enjoy it, because it is pretty wonderful,” said best supporting actress nominee Alicia Vikander, swathed in bright red, as she answered questions in the luncheon’s pre-show interview room.\n\nShe had learned that lesson, Ms. Vikander said, from Eddie Redmayne, her co-star in The Danish Girl , and another of this year’s nominees, for best actor. Mr. Redmayne was on hand, looking dapper in a sharp gray suit.\n\nBy Ms. Isaacs’ count, about 150 nominees showed up. Whether or not viewers tune into the show on ABC in 20 days, those honoured clearly intend to be there.\n\nMatt Damon, nominated for best actor for The Martian , was at the luncheon, talking to Hollywood executives and Oscar voters during the noontime cocktail hour. — New York Times News Service", 
    "section": "national", 
    "title": "Oscars to banish ‘the elephant in the room’", 
    "subsection": "general", 
    "date": "2016-02-10"
}