{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Anguished and disappointed over R.K. Pachauri’s appointment as Executive Vice-Chairman of The Energy and Resources Institute (TERI), the woman who accused him of sexual harassment said the decision makes her “flesh crawl”.\n\nAn open letter written by the woman, a former employee at the TERI, was released to the media on Tuesday. In the letter she mentions her resolve to take the case to a logical conclusion. She slammed the organisation’s governing council for creating the new post and appointing Mr. Pachauri with executive powers to run the body, despite “grave criminal charges” against him.\n\n“Shamelessness abounds! The news of promotion of a man who stands booked on charges of sexual harassment at workplace, stalking and criminal intimidation by country’s who’s who makes my flesh crawl,” the complainant said.\n\nMr. Pachauri was on Monday promoted from Director General to Executive Vice-Chairman of TERI, which is a post created for him, though judicial proceedings against the scientist are on for alleged sexual harassment. Ajay Mathur is the new Director General of the organisation.\n\nThe complainant said she had heard that Mr. Pachauri was trying to get a foothold in TERI but she did not believe it. “It was around 3 Oct, 2015 that I first heard of this from some current and former colleagues. I was sceptical in thinking that the organisation would not pour cheap, third rated oil to the existing smouldering fire. I was so wrong,” she said. She also mentioned how the organisation tried to ask her colleagues to have her agree on reconciliation. “For a research organisation, priority was given to meetings held by Senior Directors and Area Convenors to corner my colleagues, to get them to have me agree on reconciliation. Not a day passed without a message like this showing up on my mobile phone — ‘Ask your lady friend to settle out of court. That would be best for her as she has nothing more left to achieve’,” she added. She also expressed her disappointment about the fact that the organisation has always given prominence to Mr. Pachauri.\n\nShe concludes her letter by explaining the reason behind quitting the job. “I spoke up and was quarantined from work. Not allowed to resume work and no earnings for a long time. No money and tainted curriculum vitae gave me sleepless nights.”", 
    "section": "national", 
    "title": "Pachauri’s promotion: former TERI employee ‘disappointed’", 
    "subsection": "general", 
    "date": "2016-02-10"
}