{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Students disrupt Iffat Fatima’s Khoon Diy Baarav, calling it ‘anti-national’\n\nFor the last six months, research scholars associated with the Centre of Social Sciences and Humanities at the Indian Institute of Technology, Delhi (IIT-D), watched films, a routine event on weekends at 5 p.m., which was followed inevitably by discussions, sometimes in the presence of the director.\n\nA process, the faculty and students looked forward to. On January 29, when the Film Society, brainchild of the centre, screened Iffat Fatima’s Khoon Diy Baarav (On a Trail of Vanished Blood), a film on Kashmir, not only were the proceedings disrupted, the viewers were asked to explain whether the screening was tantamount to being “anti-national.”\n\nWhen the film was screened on January 29, a couple of students from the Applied Mechanics department sought to disrupt the screening, calling it anti-national.\n\nThese students wrote to the officiating director, Professor K. Thyagarajan, who has forwarded the mail to the centre, seeking a detailed discussion from the department for screening the film.\n\nEven as attempts were made to downplay the exchange of mails between the authorities in the IIT, what has upset the centre is the reaction the film has evoked in some students who were not present for the screening and their attempt to disrupt it.\n\n“There was a heated exchange between those who watched and those who protested the screening,” said those who watched the film. The Film Society was meant to encourage students’ engagement with meaningful cinema. The head of the centre, Ravinder Kaur, said: “We should have the freedom to discuss a whole range of opinions, and centres such as IITs, should retain the right to discuss sensitive issues that cinema often raises in its audience.”\n\nMs. Kaur said she was hopeful the centre would continue to show films to its students. It is also learnt that the centre will be discussing the matter with Mr. Thyagarajan on Wednesday.\n\nWhile sources in the department said those students who disrupted the screening had complained to the director, and not those whose viewing was marred by the act, the behaviour of the disruptive students was unacceptable.\n\nThe society which is six-months-old, showcases contemporary, meaningful cinema often resulting in lengthy discussions. Mr. Thyagarajan was unavailable for comments though an email was sent to him.\n\nIIT Delhi has been in the news for high-profile visits of Baba Ramdev, Sri Sri Ravi Shankar and the Brahmakumaris in the recent past.", 
    "section": "national", 
    "title": "Screening of film on Kashmir triggers row in IIT-Delhi", 
    "subsection": "general", 
    "date": "2016-02-10"
}