{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Proceedings adjourned after stand-off between the ruling UDF and the Opposition\n\nOommen Chandy said the Opposition was relying on an incomplete statement of Saritha S. Nair for moving the adjournment motion.— FILE Photo: H. Vibhu\n\n: Kerala Assembly proceedings were adjourned on Tuesday following a stand-off between the ruling United Democratic Front government and the Opposition over the solar scam.\n\nProceedings were suspended at 11 a.m. following an altercation between the UDF and Opposition Left Democratic Front (LDF) members over Leader of the Opposition V.S. Achuthanandan’s observation about Chief Minister Oommen Chandy while addressing the House. This was before a walkout for denying leave for an adjournment motion moved by Deputy Leader of the Opposition Kodiyeri Balakrishnan.\n\nMr. Kodiyeri sought the resignation of Power Minister Aryadan Mohammed and Mr. Chandy who, he alleged, misled the House on the solar issue. Mr. Achuthanandan stopped his speech following the din.\n\nSpeaker N. Sakthan’s parleys with party leaders did not bear fruit. On resuming business at 11.45 a.m., the Opposition insisted on discussing the motion, but Mr. Sakthan turned down the demand. The Opposition then squatted in the well of the House and shouted slogans. Mr. Sakthan completed the day’s business in haste and adjourned the House for the day.\n\nEarlier, replying to the notice, Home Minister Ramesh Chennithala said when the scam erupted, the government appointed a commission. The commission was functioning in a dispassionate manner and would submit its report on April 27. The Opposition should wait till the submission of the report.\n\nMr. Balakrishnan alleged that no Chief Minister had to face such graft charges earlier. Mr. Chandy had misled the House by making contrary statements regarding his meeting with Saritha S. Nair and industrialist Sreedharan Nair before the commission.\n\nMr. Chandy said that the Opposition was relying on an incomplete statement of Saritha for moving the notice. He was examined for 12 hours, but neither Saritha’s lawyer nor anyone else raised any such questions at the commission. He had been a member of the House for 46 years.\n\nEarlier, members had mutual trust and camaraderie, which were missing now. The allegations raised by the accused had not hurt him, but he was really pained by the way the Opposition targeted him for political gains, he said.\n\nMr. Mohammed too denied the charges and said that the accused had not got any benefit from him.", 
    "section": "national", 
    "title": "Storm in Kerala Assembly", 
    "subsection": "general", 
    "date": "2016-02-10"
}