{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "Is the famous annual ‘darbar’ or court at Keslapur’s Nagoba jatara, to be held today, still relevant? This unique and special exercise by the governments of the day to address problems of the Adivasis in Adilabad district in Telanagana does not seem to have yielded the desired results, which is evident from the increasing disgruntlement among them.\n\nThe origins of the ‘darbar’ are not known. But, as per the earliest account given by legendary Austrian Anthropologist Christopher von Furer-Haimendorf, the Atram Raj Gond Raja of Utnoor used to preside over the ‘darbar,’ adjudicating disputes which remained unsettled during the previous year at the level of the village Patla, or the Patel headman. The Andhra Pradesh government started organising the darbar from 1963 though the accession of Nizam’s Hyderabad with India took place in 1948.\n\nIn his book, Tribes of India, Struggle for Survival , Professor Haimendorf notes that the repeal of the Hyderabad Tribal Areas Regulation Act in 1963 terminated the functioning of tribal panchayats. This, among other things, resulted in the government, instead of the Atram Rajas of Utnoor, organising the darbars. The darbar is held on the third day of Nagoba jatara which, in essence, is the cultural festival of the Buigoita branch of the Mesram clan of Gonds. Gonds of other denominations, nevertheless, used to flock to the darbar for dispute resolution.\n\n“Unlike kings, the government officials cannot offer instant dispute resolution in a democracy. Only petitions are accepted. Grievances are addressed during the course of the year,” an official of the Integrated Tribal Development Agency (ITDA), Utnoor, said. In 1982, during one of his annual visits to Keslapur jatara, Haimendorf observed the darbar as being a huge pandal where on one of the days of the jatara, district officials and local politicians address a crowd of tribesmen, often promising benefits which everybody knows are unrealistic and will never be delivered. The scenario is much the same even 34 years after Haimendorf visited the jatara.\n\nThe unique exercise to address the problems of Adivasis in Adilabad has not yielded the desired result", 
    "section": "national", 
    "title": "Thanks to unsettled disputes, this annual ‘darbar’ is losing sheen", 
    "subsection": "general", 
    "date": "2016-02-10"
}