{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Now, surgeons at Jipmer can actually prepare three-dimensional replicas of human body parts to analyse and plan before they schedule a patient for reconstruction surgery, thanks to the marvels of 3-D printing technology.\n\nJipmer Director S. C. Parija on Thursday launched the 3-D Printer Technology at the hospital’s department of plastic surgery.\n\nThe Plastic Surgery Department had, shortly before commissioning the equipment, successfully recreated a human hand and demonstrated the potential of the technology.\n\n3-D printing, also known as additive manufacturing (AM), refers to various processes used to synthesize a three-dimensional body parts. In 3-D printing, successive layers of material are formed under computer control to create any body parts. These body parts can be of almost any shape and are produced from a 3-D model or other electronic data source.\n\nThese 3-D printable models can be created with a computer aided design (CAD) package, via a 3-D scanner or by a plain digital camera and photogrammetry software.\n\nDr. Parija noted that with the help of this technology---which he said is a first for Government sector hospitals in south India--doctors would be able to prepare replicas various body parts in the laboratory to study and plan surgeries.\n\nIn the clinical realm, 3-D printing has been used to print patient specific implant and device for medical use. The hearing aid and dental models are also area of application using the custom 3-D printing Technology.\n\nDoctors said new research is focused on methods to bio-print replacements for lost tissue due to arthritis and Cancer. The technology can now be used to make exact replicas of organs.\n\nThe printer uses images from patients MRI or CT scan images as a template and lays down layers of rubber or plastic. With this process, doctors can bio-print a prosthetic hand or a precisely calibrated replica of any other body part using inkjet techniques. Layers of living cells are deposited onto a gel medium or sugar matrix and slowly built up to form three-dimensional structures including vascular systems.\n\n“Even medical pills can be manufactured for delivering large amount of medicine using this technology,” said Dr Ashok Badhe, Jipmer Deputy Director.\n\nAccording to him, patients with respiratory problems can also be helped by developing accurate size and shape of tracheal splint.\n\nThis technology is particularly useful for Plastic Surgeons for reconstructing damaged, mutilated and lost body part. Dr. Ravi Kumar Chittoria, Head of Department of Plastic Surgery, underscored the contribution of Dr. Dinesh Kumar S, Associate Professor of Plastic Surgery who has a special interest in 3-D Printer Technology and has started a research project on this technology.\n\nDoctors would be able to prepare replicas of body parts and plan surgeries", 
    "section": "national", 
    "title": "3-D printing to give Jipmer’s plastic surgery department a leg up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}