{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Observing that an abetment to suicide-cum-corruption case filed against former Agriculture Minister ‘Agri’ S.S. Krishnamoorthy has been complicated, the Madras High Court Bench here on Thursday called for original records from a Judicial Magistrate in Tirunelveli to find out a solution to legal impediments in proceeding with the case.\n\nPassing interim orders on an application filed by Mr.Krishnamoorthy to quash the proceedings pending before the Magistrate, Justice V.S. Ravi said the issue had been so complicated that it was necessary to send for the records from the lower court by March 1 to help the High Court to take a decision on the issue one way or the other.\n\nEarlier, the petitioner’s counsel pointed out that Crime Branch Criminal Investigation Department (CBCID) had booked his client under Section 306 (abetment of suicide) of Indian Penal Code and Section 7 of Prevention of Corruption Act (PCA) after an Assistant Executive Engineer Muthukumarasamy of Agricultural Engineering Department committed suicide on February 20 last.\n\nAccording to the prosecution, the victim had jumped before a speeding train since he was allegedly unable to bear pressure exerted on him by his superiors to pay Rs.12.25 lakh to the petitioner for having appointed seven drivers in the department.\n\nHowever, the police filed a charge sheet before the Judicial Magistrate who had no jurisdiction to take cognisance of an offence booked under the PCA, the counsel said.\n\nThe Magistrate too did not return the charge sheet. Instead, after the filing of the present quash petition in the High Court, the Magistrate forwarded the case to a Special Court designated for hearing corruption cases.\n\n“The Special Court, in turn, refused to accept the case since it was legally not bound to accept a case transferred by a Magistrate. Ideally, when a case is booked for offences under the IPC as well as PCA, Section 4 of PCA empowers the Special Court to take cognisance of offences under both the laws and try them together. However, a regular criminal court cannot try a charge under the PCA,” the counsel said.\n\nCourt calls for original records from Judicial Magistrate", 
    "section": "national", 
    "title": "‘Agri’ Krishnamoorthy case has been complicated: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}