{
    "author": [
        "T K"
    ], 
    "text": "Now complaints against officials have to be cleared by dept. concerned\n\nA State government order that makes it mandatory for complaints of corruption against all public servants, regardless of their rank, to be referred to the government for its opinion before an inquiry can be held drew flak from political parties and anti-corruption crusaders on Thursday.\n\nThe implication of the order, issued on February 2, is that any inquiry on complaints against even clerks or subordinate staff will have to be first cleared by the department.\n\nThe G.O., signed by the Chief Secretary K. Gnanadesikan, is aimed at bringing about uniformity in treatment of complaints against government servants of all ranks. The G.O. says in case of any complaint against government servants “irrespective of the rank or group of the public servants complained against, the Directorate of Vigilance and Anti-Corruption shall forward the complaints to the Vigilance Commission, and the commission in turn shall seek and consider the remarks of the Government before ordering appropriate enquiry” by the DVAC.\n\nThe government cited a May 2014 Supreme Court verdict that struck down Section 6-A of the Delhi Special Police Establishment Act on the ground that it violated the equality principle as the basis for the G.O. The impugned section required special permission from the government to conduct an inquiry or investigation into allegations against officers of the rank of Joint Secretary and above. The Madras High Court had earlier asked the State government to evolve a “non-discriminatory policy” towards all public servants.\n\nOrder slammed\n\nSlamming the order, DMK chief M Karunanidhi said his government in 1973 had introduced a law that acted as a deterrent against corruption by higher officials including the Chief Minister. “It was to prevent public officials from becoming corrupt. If you compare that with this order, you will understand how the AIADMK wants to protect lower-rung officials in a discriminatory manner,” he said in a statement. TNCC president E V K S Elangovan said the order was a shield to protect “corrupt officials”.\n\n‘Contravenes SC order’\n\nHe contended that the G.O. contravened the Supreme Court verdict that no prior permission was necessary to initiate inquiry against any official. Activists alleged that the State government was trying to stifle a public crusade against corruption.\n\n‘Bring in Lokayukta’\n\n“We want the government to bring in a Lokayukta and disband the DVAC. This order also seems to have been brought in with an eye on the elections so that officials indulging in electoral malpractices may be spared. We will write to the Chief Secretary to reconsider the order or will approach the courts,” Siva Elango, President, Satta Panchayat Iyakkam, told The Hindu .", 
    "section": "national", 
    "title": "Anti-graft activists slam G.O.", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}