{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Senior official reviews NABARD projects\n\nA senior official of the National Bank for Agriculture and Rural Development (NABARD) is on a three-day review of the projects funded by the bank, including artificial recharge structures executed under the Rural Infrastructure Development Fund in the district.\n\nV. R. Ravindranath, General Manager, NABARD, Chennai, accompanied by S. Suresh Kumar, Assistant General Manager, commenced his review on Wednesday when he inspected the artificial recharge structures such as check dams constructed at Ammapettai and Chithambur.\n\nCheck dams were built at 10 places in the district under RIDF-20 and these are said to have been effective in harnessing the rain flows during the monsoon.\n\nCheck dams are structures at the ground-level which seek to harness the rain flows. The new structures are being built across various jungle streams.\n\nFourteen more check dams have been sanctioned in the district at an estimate of Rs. 20.73 crore under RIDF-21.\n\nSome of the tanks such as Alathaduiyanpatti Chinna and Periya Eris and Jamberi have filled up during the monsoon following the construction of the check dams, officials said.\n\nAccompanied by S.Suresh Kumar, Assistant General Manager, NABARD, Tiruchi, V.Selvaraj, Executive Engineer, Public Works Department, Ariyar Division, and other officials, Mr.Ravindranath visited Ammapettai and Chithambur check dams. Mr.Selvaraj explained to him the technical details of the check dam, which would directly benefit about 217.21 acres and another 217.21 acres indirectly in and around Ammapettai.\n\nThe check dam at Chithambur directly benefits about 273.30 acres and another 110 acres in the vicinity indirectly through recharge of wells and borewells. The check dams have contributed to an improvement in ground water table in a radius of one kilometre around them. Mr.Ravindranath, who also interacted with farmers, expressed satisfaction over the progress of the projects, according officials who accompanied him.\n\nOn Thursday, Mr. Ravindranath inspected the progress of work on the construction of the Central Vegetable Market at Kallikudi, which is also funded by NABARD. He later conducted a review of other projects.\n\nOn Friday, he would visit Pachamalai where the NABARD is financing a tribal development project.\n\ncheck dams have contributed to an improvement in groundwater\n\ntable", 
    "section": "national", 
    "title": "Artificial recharge structures inspected", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}