{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The view of the Viduthalai Chiruthaigal Katchi (VCK) that a Dalit should be the Chief Minister has now received support from Arunthathiyars, a community considered the most backward among Scheduled Castes in Tamil Nadu.\n\nProminent Arunthathiyar leaders state that if VCK leader Thol. Thirumavalavan is made the chief ministerial candidate of the People’s Welfare Alliance (PWA); they would welcome the historic decision. But they would expect the VCK to give more representation to the Arunthathiyars in the party organisation and during election ticket distribution.\n\nRecently, while the demand to project a Dalit as a chief ministerial candidate was being discussed, it was countered by a prominent Dravidian ideologue who wanted to know how many Arunthathiyars were given VCK tickets to contest elections so far, insinuating that the Dalit party had neglected a sub-sect of its own.\n\nCore demand\n\nAthiyamaan, founder of the Athi Tamizhar Peravai, one of the largest Arunthathiyar outfits, says the demand of the VCK that a Dalit should guide the administration of the State was a core demand of the community for two decades. Naturally, it would have been difficult to insist on this demand as part of an alliance headed by DMK or AIADMK since these parties have a larger base and act as the leaders of the alliance.\n\n“There is a widespread feeling that the VCK is the largest constituent of the PWA. So maybe, this is the most opportune time to make this demand. If Mr. Thirumavalavan is made the chief ministerial candidate, there is no reason to oppose it,” he says.\n\nWhile welcoming the VCK’s demand, Madurai-based Arunthathiyar leader Jakkaian says a Dalit becoming a Chief Minister does not mean that the oppression against the community would vanish overnight. In Uttar Pradesh, Dalit leadership did not annihilate caste\n\n“Diversionary tactics”\n\nMr. Thirumavalavan said the demand for a Dalit Chief Minister was not an attempt at projecting him for the post. According to him, when the VCK contested its first Assembly election in 2001, it battled hard to get the Avinashi seat in the DMK front, specifically to field an Arunthathiyar. But subsequently, the party was not able to get seats in the Western region, the Arunthathiyar belt, as the dominant Dravidian partners always sought to restrict the party to the Northern districts.\n\n“When we ask Dravidian parties why they won’t give proper representation to a community that constitutes 21 per cent of the population, we are immediately charged with ignoring Arunthathiyars. How many Dalits hold important positions in AIADMK and DMK? They should first introspect,” he adds.", 
    "section": "national", 
    "title": "Arunthathiyars hail idea of Dalit as CM candidate", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}