{
    "author": [
        "S Ganesan"
    ], 
    "text": "ith the rehabilitation-cum-beautification of the Cauvery bridge in the city still under way, residents are irked over the frequent traffic snarls on the vital link between the City and Srirangam.\n\nThe Highways Department had taken up the project at a cost of Rs.1.50 crore sanctioned under the Comprehensive Road Infrastructure Development Programme. Although construction of parapets on either side has been completed, the riding surface on the bridge is yet to be blacktopped. The bridge caters to a huge volume of traffic, and execution of the work in a staggered manner has been causing much hardship to road users, complain residents.\n\nOver the years, parts of the bridge, especially its parapet walls and pedestrian pathway, had suffered damages.\n\nThe riding surface on the bridge carriageways had suffered some damage at the joints. The bridge constructed in 1976 has 15 spans and runs for a length of about 550 metres.\n\nThe bridge has a width of 15 metres (including the footpath) to comfortably accommodate four lane traffic. The re-construction of the parapet too had run into controversy with sections of city residents raising apprehensions over the solid structure that has replaced the earlier perforated concrete structure. However, the Department had allayed the fears.\n\nCurrently, work is under way on fixing decorative tiles. The riding surface is yet to be blacktopped.\n\nAlthough the work, which commenced in November, is scheduled to be completed within six months, residents demand that the project should be expedited given the importance of the bridge in the city’s road network.\n\n“The work was started before Vaikunda Ekadasi but has not been completed yet. Traffic chaos is a daily phenomenon. The work should be completed on priority basis,” said S.R.Dasarathan, a city resident.\n\nSources in the Highways Department said that the work on fixing strip seals on the spans has to be taken up and only after this the blacktopping could be taken up. The department is waiting for the opening of the Odathurai bridge, expected shortly, so that the volume of traffic come down to take up the blacktopping work, the sources said.", 
    "section": "national", 
    "title": "Bumpy ride on a bruised bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}