{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Is Erode turning out to be the cancer capital of the State?\n\nGoing by the statistics generated by the medical fraternity here, 20 to 25 new cancer cases are getting added every day to the list of sufferers of the dreaded disease.\n\nThe World Cancer Day observed on Thursday not only threw substantial light on how cancer could be prevented at the initial stages but also the initiatives being spearheaded by Erodai, a social organisation backed effectively by the doctor community, for analysing the cause for the higher incidence of cancer in Erode district.\n\nPlaces such as Tirupur, Vellore, Ranipet, and other industrialised places are as much polluted, but the cancer occurrence is the highest in Erode.\n\nErodai was currently analysing the reasons by testing the water in the two main canals -- Perumpallam and Pitchakaranpallam odai.\n\nDrinking water is pumped for supply to city residents from the collection point where the water mixed with untreated industrial effluent empties into the Cauvery river.\n\nThe water samples have been sent for testing to determine the presence of cancer-causing carcinogens, said Sudhakar, project coordinator of Erodai and managing director of Sudha Hospitals.\n\nHe was addressing a seminar on cancer at the Velalar Group of Institutions organised by Selva Charitable Trust as part of the World Cancer Day programmes.\n\nThe removal of plastic wastes that had accumulated for decades from the Perumpallam Odai would pave way for reducing the scope for serious ailments, Dr. Sudhakar said.\n\nSuperintendent of Police Sibi Chakravarthy, the chief guest at the programme, called for lifestyle modifications to deal with cancer. The food habits must change. Use of chemical-mixed cosmetic items, aerated drinks, edible oil, and fast food must necessarily be avoided to maintain proper health, he said.\n\nHe honoured Siragugal, an organisation working for improving green cover, with ‘Iyarkai Padhukavalar’ Award.\n\nStalin Gunasekaran, president of Makkal Sinthanai Peravai, was present.\n\nK. Velavan, managing director, Erode Cancer Centre, elaborated on the rate of cancer-affliction among Erode residents.\n\nEarlier in the day, a rally taken out by college students was flagged-off by Additional Superintendent of Police A. Mohan Navas, and former honorary secretary of Indian Medical Association C.N. Raja.", 
    "section": "national", 
    "title": "Cancer incidence higher in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}