{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Condemning non-implementation of time-bound promotions since 2013, Tamil Nadu Government Doctors’ Association (TNGDA) has decided to boycott Medical Council of India inspections in government-run medical colleges from Friday.\n\nSpeaking to the media after its general body meeting at Government Rajaji Hospital (GRH) here on Thursday, its State president K. Senthil said that the office-bearers would observe a fast in Chennai on February 9, if their demands were not fulfilled.\n\nAccording to the association, government order (GO) 354 of Health and Family Welfare Department issued in 2009 enabled time-bound promotions for doctors in several ranks working with the Directorate of Medical and Rural Health Services (DMRH), Directorate of Public Health and Preventive Medicine (DPHPM), and Directorate of Medical Education (DME).\n\nDr. Senthil said that promotions that began with GO 354 in 2009 were stopped in 2013 only for the rank of Associate Professors to Professors for doctors attached to the DME. “During the first review of GO 354’s implementation in 2013, doubts were raised on whether excessive number of promotions had been provided compared to Professor positions available. So promotions were temporarily stopped.”\n\nHowever, the review completed by the end of 2013 apparently revealed that the number of promotions provided were much less compared to available positions. Only around 550 had been promoted as Professors between 2009 and 2013 while the available positions stood at 1,511. Until now, about 400 Associate Professors, who had become eligible, were waiting for promotions.\n\n“Though the government is responsive to our demands, we want them to immediately promote all those who had become eligible under GO 354,” Dr. Senthil said.\n\nTheir other demands included conduct of transfer counselling, which had been delayed for more than a year, for non-teaching staff in the DME, Chief Civil Surgeons and Senior Civil Surgeons in the DMS and staff in all ranks in the DPHPM.", 
    "section": "national", 
    "title": "Doctors’ association to boycott MCI inspections", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}