{
    "author": [
        "M K"
    ], 
    "text": "The Faculty of Disability Management and Special Education at Ramakrishna Mission Vivekananda University has come out with a bilingual sign language dictionary for English and Hindi. Titled Indian Sign Language (ISL) Bi-lingual (English-Hindi) Dictionary, the 525-page book has 1,500 commonly used words.\n\nIt will be released at the national conference on ‘Practices and Challenges Encountered in Implementing Policies Related to Special Education, Sports and Adapted Games’ on Friday.\n\nThe dictionary can be used by school children and has been designed to practice sign language without much help.\n\nIt is also aimed at promoting sign language among normal persons and to help them mingle with persons with hearing impairment.\n\nAssistant professor for Special Education (Hearing Impairment) in the university P. Ramakrishnan said that the dictionary was prepared with commonly used signs. Signs in the previous dictionaries that had become outdated had been updated.\n\nHe said that the dictionary also had signs and description on how to show the signs and symbols.\n\nThe dictionary is part of the ISL series dictionaries prepared by the university here from 2001. With support from CBM India Trust, Bengaluru, the university has also released a technical dictionary for students pursuing higher education in 2004 and a dictionary of banking terminologies (in collaboration with the All India Deaf Bank Employee Association) in 2004 and Physics terminologies in 2009.\n\nLast year, they released a bi-lingual English-Tamil sign language dictionary. But it is learnt that the dictionary had a lesser reach and did not get the response it got for the earlier dictionaries. However, the university got requests from institutions for hearing impaired persons in North India, asking for an ISL dictionary in English and Hindi.\n\nSara Varughese, managing trustee of CBM India Trust, said that academic institutions should work with NGOs to develop solutions for people with disability and help them to participate in society. She was confident that this dictionary would address the gap in availability of resources on sign language and also translations in regional languages.\n\nAdding words\n\n“The new dictionary priced at Rs. 600, but will be distributed free of cost to deserving institutions,” said Ms. Sara Varughese. She added depending on need CBM is planning to add words in the revised editions of the dictionary after discussion with the university. “We are also collaborating with institutions to bring dictionaries in other languages,” she said.", 
    "section": "national", 
    "title": "English, Hindi sign language dictionary to be released today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}