{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers take part in the capacity building programme organised by Veterinary College and Research Institute and NABARD at Ramayanpatti in Tirunelveli.\n\nThe Veterinary College and Research Institute here, in association with National Bank for Agricultural and Rural Development (NABARD), organised a capacity building programme on ‘Adoption of innovative technologies for small ruminants production system’ recently.\n\nDepartment of Veterinary and Animal Husbandry Extension Education of VC and RI organised this training programme on its premises at Ramaiyanpatti, in which 30 farmers participated.\n\nThe programme included nine lectures and exposure visit.\n\nLectures on present status and future prospects of sheep and goat farming, innovative techniques in sheep and goat breeding, improved sheep and goat rearing methods, housing management and bio-security measures, techniques in feeding management to augment sheep and goat productivity, health management techniques in sheep and goat and economics of sheep and goat farming were delivered in Tamil for the benefit of the participants.\n\nThe participants were taken to a commercial goat farm at Panayangurichi village in Pappakudi block as part of the exposure visit, wherein the trainees were explained about rearing of goats on raised platform system and in integrated farming system.\n\nIn the valedictory session, M. Thirunavukkarasu, Dean, VC and RI, Tirunelveli distributed certificates to the trainees.\n\nIn his valedictory address, Dr. Thirunavukkarasu explained in detail the growing significance of livestock contribution in agriculture sector and emphasised the importance of reducing production cost, preventive measures for disease control and insurance.\n\nProfessor and Head, Department of Veterinary and Animal Husbandry Extension Education C. Manivannan presented a report on the capacity building training programme.\n\nAssistant General Manager of NABARD K. Ramalingam, Assistant Professor, Department of Veterinary and Animal Husbandry Extension Education S. Senthilkumar and Assistant Professor, Department of Veterinary and Animal Husbandry Extension Education M. Vinothini spoke.", 
    "section": "national", 
    "title": "Farmers briefed on innovative technologies in goat, sheep farming", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}