{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Thanks to surplus rainfall of 98.38 mm in Virudhunagar\n\nThanks to a surplus rainfall of 98.38 mm, the Department of Agriculture is hopeful that farmers of Virudhunagar district will register a higher foodgrain production this year. Like in 2010 and 2011, when there was surplus rainfall, farmers are raising a second crop in paddy, pulses, millets and cotton this year too.\n\nAccording to Collector V. Rajaraman, support services for farmers have been functioning well to aid the second crop.\n\nSeed farms and seed processing units have been providing quality seeds to farmers.\n\nSo far, 13.6 tonnes of millet seeds, 46.2 tonnes of seeds of pulses, 16.2 tonnes of cotton seeds and 23.5 tonnes of groundnut seeds have been procured from seed farms. By the end of this month, 400 tonnes of paddy seeds and 60 tonnes of millets, pulses and oilseeds are expected to arrive.\n\nSeeds procured from all over the district are processed at the seed processing units in Virudhunagar, Sattur, Aruppukottai, Devadhanam and Narikudi.\n\nEnrolled for competitions\n\nOfficials of the Department of Agriculture said that farmers had already been enrolled for State-level crop competitions in pearl millet, maize, red gram, cotton and groundnut.\n\nAs harvest of some crops was in progress, district-level crop competitions would be held in paddy, pearl millet, maize, red gram and cotton soon.\n\nIntegrated farming\n\nIntegrated farming was being popularised among farmers through the implementation of State Balanced Growth Fund Scheme on an outlay of Rs. 1.36 crore in Sattur, Watrap, Vembakottai, Narikudi and Kariapatti blocks, said Mr. Rajaraman.\n\nUnder the scheme, land farmers adopted goat rearing and poultry farming, created farm ponds and vermicompost yards, besides involving in dry land farming.\n\nGarden land farmers were involved in goat rearing, poultry farming, honey production and vermi composting.\n\nThere was efficient use of farm resources and effective recycling of farm waste in integrated farming, agriculture officials pointed out.\n\nThere was efficient use of farm resources and effective recycling of farm waste in integrated farming, point out agriculture officials", 
    "section": "national", 
    "title": "Foodgrain production likely to go up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}