{
    "author": [
        "Special Correspondent"
    ], 
    "text": "My son was my only hope, says victim’s father\n\nEven as the city traffic police claim to book at least 200 cases of drunk driving every day, some activists working on road safety allege that the intensity of the campaign against drunk driving has come down.\n\nIn the early hours of Thursday, I. Kevin Raj, who was riding back home after work, was killed when an SUV, whose driver was allegedly drunk, rammed his motorcycle.\n\nTraffic police sources said that over 60 teams were conducting checks across the city on weekdays and 120 teams on weekends.\n\nPolice personnel claim that compared to previous years, traffic accidents have dropped by over 30 per cent.\n\n“There is a sense of fear among motorists as they do not know where and when checks will be conducted,” added the officer.\n\nHowever M. Radhakrishnan, organiser, Thozhan, an NGO working towards road safety, said that the drive against drunk driving had slowed down after the floods.\n\n“Earlier, it used to be done across the city. Now, I find it being carried out only in a few places. Though they claim that drunk driving has come down, many still continue riding vehicles in an inebriated condition,” he said.\n\nMeanwhile, at the Royapettah mortuary, some of the friends of the victim questioned why no policemen were found on the arterial Anna Salai.\n\n“It is surprising that there were no policemen. Had there been at least a few, the driver would not have driven the car at such a high speed and we would not have lost our friend” he said.\n\nR. Irudayaraj, Kevin’s father, said that his son was his only hope. “I work as a lab assistant in a private diabeties clinic in Royapuram. My son wanted to go abroad and work. He was a very ambitious kid,” he said.", 
    "section": "national", 
    "title": "Has anti-drunk driving campaign lost steam?", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}