{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here on Thursday pulled up Central Bureau of Investigation for not having executed warrants issued by the court on January 27 for arresting 12 of the 17 accused in the 2007 Dinakaran newspaper office attack case since they were “playing hide and seek” with the court and not cooperating in disposing of an appeal preferred against their acquittal in 2009.\n\nWhen the matter came up for hearing before a Division Bench of Justices A. Selvam and G. Chockalingam, the senior judge expressed displeasure over the CBI not having arrested even a single accused despite receiving the warrant from the High Court Registry on January 28. The Bench refused to accept the submission of CBI counsel that the whereabouts of the accused could not be traced despite efforts.\n\n“If their whereabouts are not traceable, then how did some of them file applications here for recalling the warrants issued against them. How did they meet their counsel and gave instructions for filing these applications?” the judge asked and directed the CBI to return the warrants to the Registry since they were valid only until Thursday and file another application seeking fresh warrants, if necessary.\n\nEarlier, CBI counsel filed a status report on steps taken by the sleuths to execute the warrant and stated that the investigating officers visited the residences of the accused and also sought help from the local police in locating them. Irked over such submissions, Mr. Justice Selvam said: “Do you expect the accused to sit in the verandah of their houses and await the visit of police officers to arrest them?\n\n“Also I don’t understand how you can file status report when arrest warrants had been issued against the accused. This is a very bad practice followed in this High Court.” He also refused to entertain applications filed by three accused M. Thiruchelvam, M. Murugan alias Sori Murugan and V. Sudhakar to recall the warrants against them. Later, the matter was adjourned to Friday for further hearing. Three employees of the newspaper office near the High Court Bench campus here had died when a mob hurled petrol bombs on May 9, 2007 objecting to publication of the results of survey in which Dravida Munnetra Kazhagam (DMK) president’s younger M.K. Stalin was reportedly found to be his preferred political successor than the elder son M.K. Alagiri.\n\nAfter investigation, the CBI filed a charge sheet against as many as 17 accused including V.P. Pandi alias ‘Attack’ Pandi, once a close aide of Mr. Alagiri, and a Deputy Superintendent of Police V. Rajaram who was accused of failing to prevent the mob from attacking the office. However, the Principal District and Sessions Court here acquitted all the 17 accused on December 9, 2009.\n\nCourt refuses to accept CBI submission that accused could not be traced", 
    "section": "national", 
    "title": "HC pulls up CBI for not executing warrants in Dinakaran attack case", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}