{
    "author": [
        "S Senthalir"
    ], 
    "text": "Documentary theatre by Swiss director Corinne Maier will explore the concept of family in the era of globalisation\n\nWe always carry our past with us. It is the past family experiences that shape our present behaviour.\n\n‘Past is Present,’ a documentary theatre by Basel-based Swiss director Corinne Maier will explore this theme when the play is staged at Auroville on Friday.\n\nThis documentary theatre explores the concept of family in the era of globalisation. “In the globalised world, many of us work abroad and away from our families. We travel a lot. This has changed the old concept of family where everyone had a common language and culture,” says Ms. Maier.\n\nBut, what happens when family members live in different continents, speaking different language and following different culture? Globalisation tears apart this old notion of family. How does this change occur? Does it give rise to conflicts or bring the family members closer?\n\n“I wanted to have a closer look on this,” adds Ms. Maier.\n\nHer lecture performance on German philosophers and her work with documentary film-maker Shaheen Dill-Riaz evolved into the documentary theatre ‘Past is Present’.\n\nMs. Maier portrays this through personal video footage, photos of protagonist Shaheen Dill-Riaz. “He had begun shooting the situations in his family life but the film did not work out. I had already worked with him in writing the film treatment. I knew it did not go further and I wanted to do a play on about family. Even he was interested so we started working on this concept,” she says.\n\nIt took almost a year after the conceptualisation to stage the play. “We rehearsed for eight weeks and the first show was staged in Switzerland in January 2013,” Ms. Maier says.\n\nHaving studied Cultural Science and Aesthetic Practice at the University of Hildesheim in Germany, her familiarity with documentary theatre form allowed her to use this medium to direct the play. Documentary theatre uses video footage, photos, diaries, newspaper clippings. “This is a familiar medium. I always develop texts related to real life and do not fall back upon fictional drama. I like to connect what happens on stage with my observations of life and other people’s world,” she said.\n\nThe documentary film maker Shaheen Dill-Riaz has been living in Berlin for nearly two decades. His parents live in their home country, Bangladesh, his brother in New York, sister in Sydney and son in Warsaw. After having made several documentary films about country-specific topics in Bangladesh, he now focuses on his family. Together with the actress Anne Haug, Shaheen himself is on stage, dissecting himself: “What is my relationship to my family that is dispersed over four continents and five countries? Am I there for them when they need me? And if so, where would there be?” This documentary theatre has travelled across many cities in Switzerland, France, Berlin, Serbia and many places in Europe. This is the first show outside Europe. “We are staging in India for the first time and it is our first inter-continental show. This is a global family story which everyone can relate to,” she says.\n\nThis play is a Pro Helvetia - Swiss Arts Council presentation in partnership with Goethe-Institut / Max Mueller Bhavan Bangalore, National Centre for the Performing Arts Mumbai and Adishakti. Bengaluru’s Sandbox Collective is the executive producer for India tour.\n\nThe play will be staged on February 5 and 6 at Adishakti in Auroville at 7 p.m. and is open to all.\n\n‘We are staging in India for the first time and it is our first inter-continental show’", 
    "section": "national", 
    "title": "How the past plays on the present", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}