{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nShri Bhandarakeri Mutt: Lecture on “Sri Vyasarajara songs”, Sri Raghavendra Swami Temple, 6 p.m.\n\nCULTURE\n\nPoompuhar: Crafts Mela, Meenakshi hall, Lakshmi Mills, 6 p.m.\n\nGENERAL\n\nKPR Institute of Engineering and Technology: State level Science Fest 2016, 11.30 a.m.\n\nCoimbatore Management Association: Brands of Coimbatore, PSG College of Technology, 2 p.m.\n\nBombay Chartered Accountants Society: Workshop on “Internal financial controls IND AS and Refresher on Companies Act 2013”, The Residency Towers, 8.30 a.m.\n\nSaraswathi Ramachandran Vidyalaya Matric. Hr. Sec. School: Award Ceremony and Silver Jubilee Celebrations, 5 p.m.\n\nC.M.S. Matriculation Higher Secondary School: Annual Day Celebrations, 4 p.m.\n\nICICI Foundation: Media visit to showcase ICICI Academy for skills, Sundarapuram, 11 a.m.\n\nGRD Institute of Management: Management development program on “Triangle of leadership, change and strategy”, 9.30 a.m.\n\nDr. N.G.P. Arts and Science College: State level quiz competition- Brain Beats 2016, 9.15 a.m.\n\nHindusthan College of Arts and Science: International conference on “Blue sky thinking on B3 (Business Big Bang, Banc assurance, Blended Networking”, 9 a.m.\n\nDr. G.R. Damodaran College of Science : State level seminar on “Micro Level Women Entrepreneurship in Biotechnology Applications”, 10 a.m.\n\nRVS College of Engineering and Technology: Guest lecture on “Job opportunities in solar sector”, 10 a.m.\n\nKrishna College of Arts and Science: Estilo Vaggio presents Le Talento Invencible, Fashion show, 6 p.m.\n\nSNS College of Engineering: Entrepreneurship Summit 2016, 9.30 a.m.\n\nCODISSIA: Entrepreneur Development Programme, Conference hall,\n\n3 p.m.\n\nSri Jayendra Saraswathy Maha Vidyalaya College of Arts and Science: Inter College Technical Symposium- SYSPARADISE ‘16, Seminar hall, 10.30 a.m.\n\nCMS College of Science and Commerce: Workshop on “Bar tending”, 9 a.m.\n\nSNMV College of Arts and Science: Workshop on “TALLY”, Computer lab, 8.30 a.m.\n\nNehru Arts and Science College: Exhibition on “FENIX EXPO ‘16”, 10.30 a.m.\n\nShri Nehru Vidyalaya Matriculation Higher Secondary School : Annual Day Celebrations, 5 p.m.\n\nSNMV College of Arts and Science: State level Inter-Collegiate Students Meet, Mahaveers Auditorium, 10 a.m.\n\nProfessional Group of Institutions: Professional Job Fair for Polytechnic students, 9 a.m.\n\nDr. G.R. Damodaran College of Science: Advertising Campaign based on Social Awareness, 10 a.m.\n\nMnemonics Learning Centre: Learning strategies for students, R.S. Puram, 10 a.m.\n\nCoimbatore Management Association: CMA Student chapter programme brands Coimbatore, PSG College of Technology, 2 p.m.\n\nAvinashilingam Institute for Home Science and Higher Education for Women University: National conference on “Transition of financial sector for sustainable development”, Hi tech seminar hall, 9 a.m.\n\nSri Venkateswara College of Computer Applications and Management : National level Technical Symposium- VALORIZE ’16, 9 a.m.\n\nAvinashilingam Institute for Home Science and Higher Education for Women University: National conference on “Recent trends in Adolescent Nutrition and Reproductive Health care”, 10 a.m.\n\nSree Narayana Guru College: International conference on “Research avenues in Social Science”, seminar hall, 9.30 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}