{
    "author": [
        "S Prasad"
    ], 
    "text": "A view of the tenements of the Puducherry Slum Clearance Board at Lambert Saravanan Nagar in Reddiyarpalayam.(Below) Each floor in the complex has four houses having a plinth area of 273 square feet.— Photos: T.Singaravelou\n\nIt is 6 years since the govt. laid foundation at Lambert Saravanan Nagar in Reddiyarpalayam\n\nMore than six years after the Government laid the foundation stone for the construction of tenements for slum dwellers at Lambert Saravanan Nagar in Reddiyarpalayam, the project has been plagued with delays and allegations of favoritism in selection of beneficiaries for allotment of houses.\n\nThe project which costs around Rs.41.35 crore was commissioned under the Jawaharlal Nehru National Urban Renewal Mission (JNNRUM) Basic Service to the Urban Poor (BSUP) in 2009.\n\nInitially, the Government had proposed to construct 1136 dwelling units in an apartment complex with three floors in each building. Each tenement with two rooms, a kitchen and a balcony with a total floor area of 241 square feet and plinth area of 273 square feet was sanctioned. However, the number of tenements was subsequently reduced to 796.\n\nOut of 796 houses as many as 300 houses have been completed while the remaining are in various stages of construction at Lambert Saravanan Nagar. There has been an inordinate delay in construction of the tenements over the last six years.\n\nFamilies evicted\n\nAs many as 110 families from Kolathamedu and Sonampalayam were evicted and relocated to temporary shelters in Lambert Saravanan Nagar in 2004 as part of rehabilitation. Most of the families were evicted after officials assured to accord priority in the allotment of houses in the proposed new complex.\n\n“The slum clearance board has started the process of allotment and officials took photos of the families accommodated in the temporary shelters. We expected our names to be on the list. But a majority of the families have been excluded in the new complex,” said Murali, a resident.\n\nA. Devasagayam, CPI functionary alleged that there was no transparency in the selection procedure and houses were allotted based on recommendations. The Government has failed to accord priority to those who were evicted from pavements and the list includes persons who are recipients of house site pattas and have been allotted houses in other complexes of the Board.\n\nThe process of identification of beneficiaries has been taken up carefully in order to ensure allotment of flats to all eligible beneficiaries and prevent duplication.\n\nThe provisional list of the first batch of 54 beneficiaries has been uploaded on the website inviting complaints and objections.\n\nThis would prevent the practice of sale of flats that are meant for rehabilitation, said P. Karthikeyan, MLA and Chairman of the Puducherry Slum Clearance Board.\n\nThe project, which costs around Rs.41.35 crore, was commissioned under JNNRUM", 
    "section": "national", 
    "title": "Inordinate delay in completing slum tenements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}