{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Only then people will get confidence in latest treatment, says Dr. Muralidharan\n\nM.K. Muralidharan, Dean of KAP Viswanatham Government Medical College and Hospital, giving away prizes to quiz contest winners on 'World Cancer Day/’ in Tiruchi on Thursday. Z. Anne Vijaya, Superintendent of Police, Government Railway Police, is at left.— PHOTO: A. MURALITHARAN\n\nA sustained campaign against the fear about cancer should be taken up by volunteers and institutions so that the people will gain confidence about the latest and modern medical facility available in the current-day scenario, said M.K. Muralidharan, Dean of K.A.P. Viswanatham Government Medical College and Hospital.\n\nSpeaking at a function to mark the World Cancer Day 2016 organised jointly by Tiruchi Harshamitra Super Speciality Cancer Centre and Research Institute and Rose Garden Charitable Trust here on Thursday, Dr. Muralidharan spoke on the efficacy of the latest treatment, including radiotherapy and chemotherapy which neutralised the adverse impact of cancer on one’s health.\n\nExplaining this year’s slogan for the observance “we can – I can”, he classified the responsibilities of each and every individual and the group in overcoming superstitious or outdated beliefs about cancer.\n\nAppreciating the effort by G. Govindaraj, managing director of Institute, and P. Sasipriya Govindaraj, Radiation Oncologist of Institute, Dr. Muralidharan said that people should be motivated to overcome the fear about the disease.\n\nDr. Muralidharan said that a concerted effort should be taken to sensitise the masses about the modern-day facilities and a lot more institutions should take part in the campaign. Above all, preventive measures would go a long way particularly in controlling cervical cancer among women, he added.\n\nZ. Anne Vijaya, Superintendent of Police, Southern Railway, in her address, said that the awareness programme would go a long way in eliminating the phobia among relatives of persons afflicted with the disease.\n\nSherin G. Edwin, Principal of Indira Nursing College, said that a variety of entertainment programmes organised as part of awareness campaign, would go a long way in clearing the fear about the disease.\n\nDr. Govindaraj said that the fourth annual awareness programme comprised “patti mandram” and quiz contest aimed at sensitising the younger generation towards preventing cancer.\n\nLater, Dr. Muralidharan gave away prizes to winners in the quiz contest.", 
    "section": "national", 
    "title": "‘Let us first banish fear of cancer’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}