{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Miraya Vadra was the cynosure of all eyes at the sub-junior basketball national competition at the Rajiv Gandhi indoor stadium in Puducherry on Thursday.— Photo : T.Singaravelou\n\nThe Haryana girls’ team featuring Miraya Vadra, daughter of Priyanka Gandhi, now faces an uphill task to stay in contention after losing to defending champion Kerala on Thursday at the 42{+n}{+d}Sub-Junior National Basketball Championship.\n\nAs the league stage of the Arise Steel 42{+n}{+d}Sub-Junior National Basketball Championship entered its third day here in Puducherry, the morning session saw the Kerala girls defeat Haryana 63-45. Krisha Priya once again top scored for Kerala with the team scoring 22 points.\n\nMiraya and her team mates had filed into the Rajiv Gandhi Indoor Stadium well ahead of the commencement of the match for warm-up routines. The team coach gave tips to them on how to tackle the opponents.\n\nIn the first quarter of the match, Haryana was in the lead with 14 points against Kerala’s 10. Miraya entered the court in the second quarter and had a shot at the basket four times in vain.\n\nAs the match progressed, Kerala girls began to build their lead winning in comprehensive fashion at the end. Dalbir Singh Kharab, secretary-general of Haryana Basketball Association, told The Hindu , “We will try our best and are still hopeful of getting into quarterfinals since we have one more league match to play for tomorrow.”\n\nMiraya, a Standard VIII student, was playing for first time sub-junior level basketball championship. Her school team came second at the State-level competitions.\n\nMr. Kharab said, “Miraya is a good player. Being tall and possessing talent and a passion for the game, she has it in her to emerge as an ace player.”", 
    "section": "national", 
    "title": "Miraya Vadra’s team loses to Kerala", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}