{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Permits Swamy to approach court if Centre ‘touches’ mythological bridge\n\nThe Supreme Court on Thursday declined a request for urgent hearing made by BJP leader Dr. Subramanian Swamy to verify whether a Cabinet decision has been taken to “not touch” the ancient Ram Sethu or the Adam’s Bridge in the implementation of the Sethusamudram Ship Channel Project.\n\nA Bench led by Chief Justice of India T.S. Thakur, however, granted him liberty to approach the court if the Centre as much as “touches” the mythological Ram Sethu during the project implementation.\n\n“There is no need for urgent hearing. If they do not touch the Ram Sethu, you need not worry,” Chief Justice Thakur told Mr. Swamy during the urgent mentioning.\n\nIt was Mr. Swamy who had moved the Supreme Court seeking the project to be scrapped as the original route was to cut across the Ram Sethu.\n\nHe had requested the court for mandamus to direct the government “to follow any other alternative route or alignment without affecting or destroying or demolishing the historic and sacred place Rama Sethu”.\n\nAlternative route\n\nActing on the suggestions of the Supreme Court, the government appointed a high-powered committee under Dr. R.K. Pachauri to study whether an alternative route to Alignment 6 (cutting through Ram Sethu) was feasible.\n\nThe committee was to consider if construction of the project was viable along Alignment 4A, an alternative route running on land north of Dhanushkodi, thereby avoiding any chances of affecting Ram Sethu,\n\nThe court had then reserved its judgment until such time the government got Alignment 4A evaluated and a report submitted to it.\n\nThe committee had referred the question of Alignment 4A to the Goa-based National Institute of Oceanography (NIO).\n\nIn 2009, Mr. Swamy moved the Supreme Court alleging that the NIO had completed the study and handed over the report to the Government in March 2009.\n\nApprehension\n\nHe had voiced apprehensions that the report may never be submitted in the Supreme Court as the consequences may be to the scrap the project itself.\n\nThe Supreme Court in 2012 asked the government to make its stand clear on whether the ancient Ram Sethu could be declared a national monument.", 
    "section": "national", 
    "title": "No need for urgent hearing in Ram Sethu case, says Supreme Court", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}