{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Guest lecturers posted in government colleges in the district staged a demonstration here on Thursday, pressing a charter of demands, including regularisation of their services.\n\nLed by G. Rajam, a guest lecturer (English) from Sethupathy Government Arts College, guest lecturers from the college and from Government Arts College for Women here and Paramakudi staged the protest in front of Aranmanai. S. Ramamurthy and T. Magendira Kumar, office bearers of the association of guest lecturers, said they were appointed in 2004, 2009 and 2011 and have been drawing a monthly salary of Rs. 10,000 for more than 10 years. They said when a labourer earned Rs. 20,000 a month, they were paid a paltry amount and that too for only 10 months a year. The AIADMK, which had promised to regularise the services of 3,445 guest lecturers in its election manifesto, failed to fulfil the promise after coming to power, they said. Now the government has taken a stand that they should obtain Ph.D. degrees or clear National Eligibility Test (NET) or State Level Eligibility Test (SLET) to get their services regularised, they said. The Kerala, Karnataka, Odisha and Manipur governments had regularised the services of their counterparts without insisting on additional qualifications, they said.\n\nAdding to their woes, the Annamalai University has deputed Assistant Professors on two years ‘deputation’ in all government colleges, Mr. Kumar said. Eight such assistant professors joined the Sethupathy Government Arts College on Wednesday, he said. They were part of the 339 Assistant professors deputed in the first phase all over the State, he said. “This will affect the prospects of not only the guest lecturers but the serving lecturers, assistant professors and professors in all the colleges,” he apprehended. They served as bonded labourers and faced a bleak future, he added. Professors from various government colleges and members of the CITU joined the stir and expressed solidarity with the agitating guest lecturers.", 
    "section": "national", 
    "title": "“Regularise services of guest lecturers”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}