{
    "author": [
        "S P"
    ], 
    "text": "With Plus Two examinations fast approaching, mounting pressure on students creates stress and affects their health and performance. Now schools are working on ways and means of reducing this stress and keeping the children confident and healthy. The district has become an educational hub in the State with students of many reputed schools securing State ranks every year. A total of 28,727 students from 180 schools, including 11,600 students from government schools in the district, are appearing for Plus Two examinations in March this year.\n\nLike private schools that conduct counselling sessions with the help of experts, the Education Department in the district is also conducting motivational and stress relieving programmes for Plus Two students in government schools.\n\nChief Educational Officer S. Gobidoss told The Hindu that programmes were already conducted for students in five unions and the rest of the students would be covered in the coming weeks. He said that teachers were asked to concentrate more on motivating them so that they appear for examinations without fear.\n\n“Experts make the students feel that they can write the exams well and score higher marks”, he added.\n\nMany students in government schools face the added pressure of poverty and the need to earn a livelihood. Special counselling is provided for them to withstand the pressure and come out successfully.\n\nStress levels in students have reached worrisome proportion as in the recent years a few of them, unable to handle the pressure, committed suicide. Burden of expectations from parents about rank, marks, the college they should go to, the course they should study, etc. puts tremendous pressure on students. Academicians said that over eight lakh students compete for mere 3000-odd medical seats in the State. Parents’ expectations should be based on the potential of their wards and not be unrealistic, they said. S.P.N. Sharavanan, Correspondent of Green Park Matriculation Higher Secondary School, said that many parents barely acknowledged their wards’ own interest. Andif the students had to reach their potential they had to have an environment where they could focus on studies and work hard in a relaxed manner. He gave an example of how students who appeared for a science exam for 100 marks in class X had to appear for 600 marks in the Plus Two exam. There is too much pressure on students to score high marks, he added. The correspondent said that special sessions are conducted to train students to focus on examinations without fear.\n\nThere are no helpline numbers to help combat exam related stress. A few of the schools provide counselling by psychiatrists to nervous students. Since many of the leading schools here are residential ones, parents are allowed to take their wards home for a day or two before examinations so that they can rejuvenate them and perform well in the exams.", 
    "section": "national", 
    "title": "Schools counsel students to reduce stress before exams", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}