{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal Chief Conservator of Forests N. Krishnakumar speaking at the national workshop on capacity building for combating wildlife crime in India, in Coimbatore on Thursday.— Photo: M. Periasamy\n\nIncreasing per capita income due to the growing global economy could be a reason for demand for wildlife dead or alive as people like to find out more avenues for spending their additional income in a luxurious manner, said V.K. Melkani, Principal Chief Conservator of Forests (PCCF) for Wildlife and Chief Wildlife Warden.\n\nHe was addressing bureaucrats at the inaugural of the three-day national workshop on ‘Capacity Building for Combating Wildlife Crime in India’, on Thursday by TRAFFIC - India. Around 100 officers in the rank of District Forest Officers, Conservator of Forests and Chief Conservator of Forests from 18 States and personnel from six border security forces and other departments took part in the event at the Tamil Nadu Forest Academy.\n\nMr. Melkani said that wildlife crimes were among the three major crimes worldwide, next only to illegal arms and drug trades.\n\n“Removing a species from the flora and fauna will have an impact not only on the forest, but also on us,” he added.\n\nAdmitting that protecting the forest was the mandate of the Forest Department, he expressed the need to network with the police, border security, coast guard, customs and defence personnel as it would be instrumental to check poaching and smuggling wildlife and related products.\n\nPCCF and Head of the Forest Department, N. Krishnakumar, said that poaching had taken a different form over the years. Recalling that about three decades ago poaching was done for meat and a matter of pride, he said that now it was done for its international commercial value.\n\n“There is a need for a conservation war to combat wildlife crimes, as offenders are using arms and ammunition,” he said. He pointed out at statistics from that illegal wildlife trading was a 150 billion dollar industry in 2014. “The illegal trade going online poses a greater threat to wildlife,” Mr. Krishnakumar added. He also expressed the need for better surveillance.\n\nAdditional Director, Wildlife Crime Control Bureau, Tilotama Varma dwelt in detail on the wildlife resources of India, its valuable share in the global wildlife and forest scenario. She also elaborated on the demand for various animals, reptiles, birds and amphibians from India in various countries and the routes through which they were smuggled.\n\nDirector of Tamil Nadu Forest Academy in Coimbatore Rajeev K. Srivastava said that smuggling butterflies and insects went unnoticed and there was need to check it as well.\n\nHe also said that a series of programmes should be organised for personnel in the lower ranks as they were unaware of the mode of the trade and their role in preventing it.\n\nShekhar Kumar Niraj, Head of TRAFFIC India, said that a series of technical sessions, panel discussion and practical sessions on the aspects of detecting and preventing crimes, gathering evidence and strengthening the investigation and wildlife laws would be part of the programme.", 
    "section": "national", 
    "title": "Strong measures needed to combat wildlife crimes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}