{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram : Radha kalyana mahotsavam, Ganapathy homam, BHEL Township, 5 a.m.; sampradaya bhajan, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Varasidhi Sri Anjaneyar Sannidhi, South Chithra Street, Srirangam, 6.30 p.m.; Veera Sanjeevi Anjaneyar Sannidhi, West Gate, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 28, II Street, SMESC Colony North East Extension, 6 p.m.\n\nCULTURE\n\nSri Ranga Vittala Bhajan Mandali : Sri Purandaradasar aradhana, vocal concert by Kashyap Mahesh and party, Sri Vyasaraja Mutt, Srirangam, 6.30 p.m.\n\nGENERAL\n\nNational Association of Geographers, India and Bharathidasan University Department of Geography: International conference on Future earth perspectives in South Asia, V.K.Srivastava, president, NAGI, inaugurates, V.M.Muthukumar, Vice Chancellor, presides, university campus, 10.30 a.m.\n\nBharathidasan University Constituent Arts and Science College and Institute of Entrepreneurship and Career Development, Bharathidasan University: Motivational campaign on promotion of youth entrepreneurship, S.Neelakanda Sharma, branch head, UCO Bank, TN Law School campus, inaugurates, college campus, Navalurkuttapattu, 10 a.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram: Inauguration of Mechanical Engineering Students Technical Association, P.R.Ramanathan, chief guest, 9.30 a.m.\n\nBharathidasan University Department of Social Work, Shrimati Indira Gandhi College and Srimad Andavan Arts and Science College: International seminar on’At risk sections of society,’ A.Chockanathan, former professor, Sri Ramakrishna Mission Vidhyalaya, inaugurates, university Khajamalai campus, 10 a.m.\n\nSeethalakshmi Ramaswami College Department of Commerce: B.Komala, Head, Department of Economics, SRC, speaks on Communication revolution, 2 p.m.\n\nSt. Joseph’s College School of Management Studies and Department of Economics : Seminar on Foreign direct investment and its impact on Indian economy, K.Parthasarathy, Director, Institute of Entrepreneurship and Career Development, Bharathidasan University, inaugurates, 9.30 a.m.; Centre for Christian Research: Launching of website, annual day, book release and presentation of award, Rev.S.John Britto, Rector, presides, 11.30 a.m.\n\nJamal Mohamed College : Graduation Day of aided courses for men, A.K.Khaja Nazeemudeen, college correspondent, delivers graduation day address, 3 p.m.\n\nShrimati Indira Gandhi College : Release of ‘mega garment,’ 10 a.m.\n\nMIET Arts and Science College : MIETY Expo – district level science exhibition, 10 a.m.; prize distribution, 4 p.m.\n\nNational Institute of Technology Department of Instrumentation and Control Engineering : ACODS - international conference on Advances in control and optimisation of dynamical systems, 9 a.m.\n\nBishop Heber College Department of English and South Asian English Language and Literature Teachers Association: International conference on English Language and Literature: Retrospects and Prospects, 9.30 a.m.\n\nTamil Nadu Handicrafts Development Corporation : Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m. to 8 p.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation : North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m. to 9 p.m.\n\nSri Vignesh Public School: Annual day, A.Kaliyamurthy, former Superintendent of police, chief guest, 4.30 p.m.\n\nM.A.M.Group of School: Annual day, M.K.Muralitharan, Dean, K.A.P.Viswanatham Government Medical College, chief guest, 5 p.m.\n\nSanthanam Vidyalaya : School day, S.Muthusamy, former principal, National College, chief guest, 5 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}