{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A toll free helpline number 1800-2706-626 to help people get their doubts on 11 common types of cancer was launched by Sri Ramakrishna Institute of Oncology and Research on World Cancer Day at the hospital.\n\nOn dialling the number, one could listen to the recordings in English or Tamil.\n\nThe caller could choose the type of cancer about which they want information and details such as reasons, symptoms, diagnostic tests, side effects, and treatment modes.\n\nDirector of the institution P. Guhan said that this was the third toll free helpline number to be launched after the successful launch of one on tobacco in 2013 and another on breast cancer in October last.\n\nLaunch of the helpline on Thursday followed the overwhelming response for the breast cancer helpline 1800-2700-703.\n\nThe new helpline has pre recorded messages for six hours -- three each in English and Tamil.\n\n“We are planning to have the contents in Hindi as well,” he said.\n\nDr. Guhan said that every year around eight to nine lakh Indian are detected with cancer. He said that more than 25 lakh people in the country are living with cancer and around 5.5 lakh of them die ever year.\n\n“While these are reported cases, there are a few lakh persons who are undiagnosed or unable to get treatment,” he said.\n\nAccording to him more than 60 per cent of cancer patients are diagnosed with the growth at an advanced stage, which reflects with poor rate of cure.\n\nHe said that this month the hospital is conducting free screening for gastric and oesophageal cancer as the symptoms for these cancers are internal and get notice only at an advanced stage.\n\nCoimbatore Medical College Hospital (CMCH) Dean A. Edwin Joe launched the helpline number.\n\nManaging trustee of SNR Sons Charitable Trust R. Vijayakumhar, dean of Sri Ramakrishna Hospital P. Sukumar and surgical oncologist K. Karthikesh were present at the event.", 
    "section": "national", 
    "title": "Toll free helpline launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}