{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "The incident of three class VIII students of the Kendra Vidyalaya at Indian Institute of Technology–Madras, leaving on a leisure trip to Goa through Bengaluru on a bus points to a failure of the government mechanism meant for the protection of children.\n\nThe students stole over Rs. 50,000 from their parents and left home on Monday. The anxious parents lodged a complaint with the Kotturpuram police at night. The police registered a case and sub-inspector K. Pushparani started an investigation.\n\n“I found that the boys were very intelligent and their friends told me that they had wanted to travel to Goa and have fun. They had travelled to different destinations during their NCC camp and it had kindled an interest in travelling,” she told The Hindu.\n\nThe three managed to find the route with the help of the internet and mobile applications.\n\n“They took a bus to Bengaluru from Chennai Mofussil Bus Terminus (CMBT) and they travelled in a private bus from Bengaluru to Goa,” she said.\n\nThey returned to Chennai on Wednesday. “I spoke to them and found that they had a deep interest in travelling. After it was suspected that the children had gone to Goa, I instructed the parents not to scold them when they returned, but take a week’s leave and take them on a vacation to the spots where they wanted to go,” added Pushparani.\n\nUnanswered questions\n\nHowever, the matter is far from settled. Some questions remain, which include ‘How did the staff of the bus to Bengaluru or the police men at CMBT fail to notice that four children were travelling alone?’\n\n“This shows the failure of the system,” said a retired police officer.\n\nMeanwhile, Child Line officials said that they provide training to bus drivers, conductors and policemen on identifying runaway children and rescuing them.\n\n“But the personnel keep changing. However, very rarely do runaway children go undetected as our volunteers are there at railway stations and bus stands. We have rescued many children,” said an official.\n\nExperts say the incident points to flaws in mechanism meant for protecting children", 
    "section": "national", 
    "title": "Unaccompanied trip by boys should have raised red flags", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}