{
    "author": [
        "M Balaganessin"
    ], 
    "text": "It was previously renovated a decade ago\n\nThe Hindu Religious and Charitable Endowment Department has planned to renovate the Sri Subramanyaswamy temple at Kumaravayalur, known as ‘Vayalur Murugan temple’ near Tiruchi.\n\nThe renovation would, among other things, include maintenance and upkeep of the rajagopuram, painting of the vimanams of sub-shrines, besides clearing the stone walls and ‘prakaram’ of oil, dust and soot. The works would be executed through donor and the HR and CE would contribute its part, an official of HR and CE told The Hindu at the temple on Thursday. The temple was last renovated in February 3, 2006 at an expenditure of Rs.50 lakh.\n\nA preliminary estimate for renovation of temple is being prepared and a final report would be arrived at in course of time, the official said.\n\nMeanwhile, the HR and CE, utilising its own funds, had given a facelift to the old buildings belonging to the temple and located at various places in front of the temple.\n\n“More important among the utilisation plan was giving a facelift to the old building constructed in 1969 and which was in disuse,” said K. Karthiresan, Executive Officer of the temple.\n\nThe old building which housed a Siddha unit on the first floor and eight cottages (yatri nivas) for the devotees was not only in disuse but also located among unhygienic environment due to open defecation.\n\n“We fenced the entire area and prevented the entry of trespassers into the building. We had given a total facelift to the structure. While the first floor is being used as ‘Annadhana koodam’ with a seating capacity for 100 devotees a day, the eight cottages on the ground floor have also been put to use,” he said.\n\nThe HR and CE has renovated two marriage halls near the temple. A toilet block and ‘mudi mandapam’ have been maintained. “A large number of devotees who visit the temple are often surprised over the maintenance work and maximum utilisation of the available buildings,” he said.\n\nThe temple tank has been cleared of its silt and sports a new look.\n\nWith a good part of these works having been completed, the HR and CE plans to renovate the temple, he added.", 
    "section": "national", 
    "title": "Vayalur Murugan temple to be renovated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}