{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Cricketer Ravichandran Ashwin, VIT Chancellor G.Viswanathan, vice presidents Sankar Viswanathan, Sekar Viswanathan and G.V.Selvam release balloons to mark the inauguration of Riviera 2016 at the VIT campus in Vellore on Thursday. -Photo: C. Venkatachalapathy\n\nPaintings including murals of popular comic book characters such as Batman and colourful installations of masks were seen in every corner of the Vellore Institute of Technology campus on Thursday, the first day of Riviera 2016.\n\n“We want people to have no inhibitions, fear or hesitancy when they come here to showcase their talent as we want to provide a platform for everyone,” Abhyuday Chaudhary, one of the student organisers said, explaining the theme and objective of the university’s sports and cultural festival.\n\nTrue to the theme, the day dawned early for more than 7,500 runners who put their best foot forward and participated in a 9.9-km marathon for ‘Stand up India’ – in a bid to awareness about entrepreneurship for women in the country.\n\nCricketer Ravichandran Ashwin, who arrived to inaugurate Riviera 2016, was greeted with a large number of enthusiastic and cheering students who had queued up to see him.\n\n“This brings back memories of my college days and the fun I used to have. The one thing I would ask of the students here is to make use of every opportunity they get to the fullest, as many a time we are unaware of how good they are,” he said. Responding to the chants from the crowd about the upcoming T 20 world cup, he said they were looking forward to do their best.\n\nChancellor G. Viswanathan said while over 30,000 students from across 60 colleges were expected to participate in the four-day fest, he was heartened at the diversity of students who had come together. “We hope to be better than last year and offer an exciting fest for every participant,” he said.\n\nEvents for everyone\n\nThrough the day, students battled it out in various competitions that spanned many languages. The diversity of contests included ‘Barfi’, a dumb charades contest in Hindi, a Telugu antakshari and essay and elocution competitions in Tamil.\n\n“The students are required to comb through the campus for clues across two days; only that they are given these clues in the form of cyphers which will help them decode a mystery,” said Vedant Jain, who was organising ‘Prison Break’, one of the many challenging events taking place at the festival.\n\nAt the VIT Talent hunt, students from the college put up performances ranging from beatboxing to using nunchaks when blindfolded.\n\nThe day ended on a high note with a scintillating performance by Sunidhi Chauhan, who belted out her most popular chartbuster songs to a packed audience.\n\nMarathon for ‘Stand up India’ marks beginning of sports and cultural festival", 
    "section": "national", 
    "title": "VIT Riviera off to a scintillating start", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}