{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Even as cases of abandoned elderly people is on the rise in the city, volunteers complain that lack of a working helpline and inadequate support from government authorities are making it difficult for them to extend a helping hand.\n\nA volunteer working closely with old age homes said that he had to pester Red Cross Society (RCS) for two days to rescue an elderly person near Kalavasal signal two weeks ago. He said that he came across 13 cases of such abandoned people since December.\n\nVolunteers said that unlike ‘1098’ Childline helpline number, there was no dedicated working helpline for elderly people. “Volunteers have to call either Social Welfare Department officials or the RCS. But public are not aware of their phone numbers,” said G. Edison, Founder and Managing Trustee of Hands of Compassion Home in Alagarkoil.\n\nHe said that the situation was worse in the case of abandoned people who were ill. “Sometimes, bystanders call‘108’ ambulance and send them to government hospital. However, the rescued person receives scant attention after that. Many a time, we had gone through great trouble in getting the person shifted to a home,” Mr. Edison said.\n\nP. Ramar, Managing Trustee of Mother Teresa Trust, which is managing the Corporation Home for Urban Homeless Poor, said that volunteers also had to tackle procedural issues. “Even if a volunteer wants to help in admitting an elderly person to a home, he is asked to take the responsibility for cremation, if the person dies.”\n\nMr. Ramar said that though the RCS should ideally take the responsibility of rescuing elderly persons, rarely any support was received from it. RCS volunteers were not available for comment when contacted by The Hindu .\n\nDistrict Social Welfare Officer R. Anandavalli, however, denied the allegations that the RCS was not responding on time. She, however, acknowledged that there were issues with rescuing elderly persons with illness as only homes for elderly women and an integrated home for women and children were available in Thenur and Palamedu respectively. “But we are doing everything we could to accommodate the ill in private homes,” she said.", 
    "section": "national", 
    "title": "Volunteers find it tough to help abandoned elders", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}