{
    "author": [
        "P Sudhakar"
    ], 
    "text": "25 gypsy families can’t get welfare assistance for want of address proof\n\nTwenty-five gypsy families, which are living in small tents pitched near the new bus-stand under rain and shine for the past 40 years cannot get any welfare measure or freebies being extended by the State and the Central Governments to the below poverty line families as the official machinery adamantly refuses to give them any document proving their identity or locality.\n\nThe gypsy families, which initially settled down near Korampallam 40 years ago, were chased away by the villagers and they moved their ‘colony’ to a vacant plot near the Rajaji Park with the hope of permanently settling down there.\n\nHowever, their hopes were once again dashed within 10 years as the local residents’ pressure and constant threatening forced them to move to the ground covered by thorns and debris near the new bus-stand.\n\n“Our families, having more than 50 children, are selling artificial ornaments to make some insignificant income with which we feed the children. The sale would go up during the festival seasons, especially during Dussehra and the ‘Sabarimala season’ while the revenue would be very thin during other seasons. So we’re struggling to feed our children properly,” 45-year-old A. Maheshwari said.\n\nWhen the gypsies applied for community certificates for their children, income certificate, ration card, electors’ photo identity card and aadhaar card – the vital documents needed for getting any official assistance and welfare measures, the officials refused to consider any of their appeal saying nomads could not be given any assistance.\n\nAs the gypsies’ children are yet to be given community certificate, they cannot be admitted in schools and hence are either begging or selling products made by their parents.\n\nNo relief\n\nWhen the recent flood submerged their tents, the gypsies, after shifting their families to nearby areas, struggled a lot to protect their children from anti-social elements, especially drunkards after dusk. As they have no permanent residence, they did not get any floor relief materials from the administration.\n\n“We came to know that the gypsies of Valliyoor in neighbouring Tirunelveli district have received a range of welfare measures including free housing plots with concrete houses, ration cards, EPIC, driving licence, old age pension, monthly assistance for the physically challenged etc. We want to give proper education to our children for which we need some documents usually issued by the official machinery. Hence, the Collector should consider our plea and recognise us as citizens of this country,” said N. Kumar, another gypsy.", 
    "section": "national", 
    "title": "With no scope to go to school, gypsy children take to begging", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}