{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "An awareness rally to mark the World Cancer Day organised at Palayamkottai on Thursday.— Photo: M. Lakshmi Arun\n\nAwareness rally, lecture and human chains marked the World Cancer Day observed here on Thursday.\n\nThe Tirunelveli Medical College Hospital organised a rally at Palayamkottai to create awareness among the public on the need for undergoing voluntary screening to detect cancer at an early stage for complete cure and practicing healthy lifestyle and food habits.\n\nOn behalf of ‘Udhavum Ullangal,’ a non-governmental organisation, an awareness human chain was formed in Palayamkottai and students, along with Mayor E. Bhuvaneshwari formed a human chain along the North Bypass Road.\n\nThe Government Siddha Medical College Hospital hosted a lecture on cancer.\n\nNagercoil\n\nOver 1.8 million people die every year around the world due to cancer caused by the use of tobacco products. A majority of tobacco-related cancer deaths occur in less developed nations like India and hence there is a need to stop using tobacco products. This was the message conveyed to the public in Nagercoil by the students and doctors during an awareness programme organised to mark the World Cancer Day here on Thursday.\n\nMore than 500 students from various institutions, nurses, members of the Indian Medical Association (IMA), doctors and paramedical personnel took out awareness rallies on cancer and leprosy.\n\nThe rallies were flagged off by Kanyakumari Government Medical College Hospital (KGMCH) Dean S. Vadivel Murugan in the presence of Medical Superintendent M. Radhakrishnan and Resident Medical Officer Mary Vijaya.\n\nFollowed by the rallies, a Continuous Medical Education programme for the doctors was held at KGMCH. Speakers at the CME programme said the cancer deaths would increase by 45 percent in 2030 according to a study conducted by World Health Organisation. A healthy lifestyle could reduce the risks of cancers, they said.\n\nThe theme of this year’s World Cancer Day is “We can, I can.” The aim is to prove that every single person can make a difference in the fight against cancer. Many think all types of cancer are not curable. But the truth is that most types of cancers can be cured if diagnosed well in advance, doctors said.\n\nBut awareness about various types of cancer remains very low among people despite it being one of the major causes of deaths in the country. Most of the cancer patients seek treatment at advanced stages because of lack of awareness. Early detection is the key to cure, doctors pointed out.\n\nMembers of Indian Medical Association, paramedical personnel and students participated.\n\nFree medical camp\n\nMeanwhile, the Mega Trust in association with Uga Seva Hospital conducted a free cancer screening camp at Edalakudi near Nagercoil. Over five hundred women participated in the camp.\n\nEarlier, the two organisations conducted a mega medical camp at the same venue for over three days.", 
    "section": "national", 
    "title": "World Cancer Day observed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-05"
}