{
    "author": [], 
    "text": "An 11,000-year old rare engraved shale pendant, discovered in north Yorkshire, is the earliest known Mesolithic art piece in Britain, archaeologists have determined.\n\nThe artefact, discovered at the Early Mesolithic site at Star Carr, contains a series of lines that the archaeologists believe may represent a tree, a map, and a leaf or even tally marks.\n\nCrafted from a single piece of shale, the sub-triangular three-millimetre thick jewellery measures 31mm by 35mm. “It was incredibly exciting to discover such a rare object. It is unlike anything we have found in Britain from this period. We can only imagine who owned it, how they wore it and what the engravings actually meant to them,” said lead researcher Nicky Milner, professor at the University of York.\n\nExperts suggested that the Mesolithic age pendant may have even been worn by a shaman — someone regarded as having access to and influence in the world of spirits and practice spiritual healing. Using a range of digital microscopy techniques, the researchers generated high-resolution images to help determine the style and order of engraving.\n\nThe tiny fragile pendant is something that a person wore and was of significance for the people who lived in Yorkshire 11,000 years ago. The artefact reveals the rituals, beliefs and cultural values that were part of the lives of people of that era, the researchers explained in the study.\n\n“This exciting find tells us about the art of the first permanent settlers of Britain after the last Ice Age. This was a time when sea level was much lower than today,” Chantal Conneller from University of Manchester noted.\n\nThe designs on the pendant found are similar to those found in southern Scandinavia and other areas bordering the North Sea, showing a close cultural connection between northern European groups at this time, she added. The pendant is to be showcased to the public for the first time in a display at the Yorkshire Museum in York from February 27 till May 5. — IANS", 
    "section": "national", 
    "title": "11,000-year-old pendant uncovered in U.K.", 
    "subsection": "general", 
    "date": "2016-02-27"
}