{
    "author": [], 
    "text": "World food stocks in danger from decline in pollinator population\n\nMany species of wild bees, butterflies and other insects that pollinate plants are shrinking toward extinction, and the world needs to do something about it before our food supply suffers, a new United Nations scientific mega-report warns.\n\nThe 20,000 or so species of pollinators are key to growing fruits, vegetables and cash crops. Yet two out of five species of invertebrate pollinators, such as bees and butterflies, are on the path toward extinction, said the first-of-its-kind report. Pollinators with backbones, such as hummingbirds and bats, are only slightly better off, with 1 in 6 species facing extinction.\n\n“We are in a period of decline and there are going to be increasing consequences,” said report lead author Simon Potts, director of the Centre for Agri-Environmental Research at the University of Reading in England.\n\nThe trouble is the report can’t point to a single villain. Among the culprits — the way farming has changed so there’s not enough diversity and wild flowers for pollinators to use as food; pesticide use, habitat loss to cities; disease, parasites and pathogens; and global warming.\n\nThe report is the result of more than two years of work by scientists across the globe who got together under several different U.N. agencies to come up with an assessment of Earth’s biodiversity, starting with the pollinators.\n\n“The variety and multiplicity of threats to pollinators and pollination generate risks to people and livelihoods,” the report stated.\n\n“These risks are largely driven by changes in land cover and agricultural management systems, including pesticide use.”\n\nDennis vanEngelsdorp, a University of Maryland bee expert, said, “Everything falls apart if you take pollinators out of the game. If we want to say we can feed the world in 2050, pollinators are going to be part of that.” — AP", 
    "section": "national", 
    "title": "Bees are vanishing: U.N. report", 
    "subsection": "general", 
    "date": "2016-02-27"
}