{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Congress on Friday demanded the sacking of Maharashtra Education Minister Vinod Tawde for the “Tarun Bharat Mumbai scam.”\n\nArmed with documents, Leader of the Opposition in the Rajya Sabha Ghulam Nabi Azad and Congress chief spokesperson Randeep Surjewala told journalists that Mr. Tawde was guilty of violating the Code of Conduct for Ministers as he ran two offices — one as a director at Shree Multimedia Vision Ltd. (SMVL), a “for-profit” company that publishes Tarun Bharat , and the other as a Cabinet Minister in Maharashtra government.\n\nMr. Surjewala said the alleged scam raised serious questions of flagrant violation of law.\n\n“There is blatant conflict of interest, negation of ‘Code of Conduct for Ministers’, non-disclosure of mandatory information in election affidavits by Union and State Ministers and murky dealings,” said Mr. Surjewala.\n\nHe alleged that Mr. Tawde had not disclosed his links with the SMVL in the election affidavit. Seeking an explanation from the BJP, Mr. Surjewala said that as per the SMVL’s annual return for 2012-13 the company had taken a loan of Rs. 25 lakh from the BJP.\n\nThe Congress leaders also saw financial links between the SMVL and “Keshav Kunj,” which is the RSS headquarters at Jhandewalan, New Delhi.\n\nMr. Surjewala cast further doubts on the funding of the SMVL by naming a builder Vlayati Ram Mittal, who is being investigated by the Anti-Corruption Bureau, and has extended a loan of Rs.15 lakh to the SMVL.\n\nIn the winter session of Parliament, the Congress faced serious allegations from a senior BJP leader Subramanian Swamy, who accused its senior leadership of financial misconduct in the National Herald controversy. And this time it’s the ruling Bharatiya Janata Party that has come under fire over “Tarun Bharat Mumbai scam.”", 
    "section": "national", 
    "title": "Cong. cites conflict of interest in Tarun Bharat controversy", 
    "subsection": "general", 
    "date": "2016-02-27"
}