{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "The project, which would have cut costs and treatment time, is in the ICU, says an officer\n\nThree years after the Council of Scientific and Industrial Research (CSIR) said it would conduct a drug trial to test a novel drug-regimen for tuberculosis (TB), lack of funds is throttling the project, several officials involved with the project told The Hindu on condition of anonymity.\n\n“The project is in the ICU (intensive care unit),” said an officer , “and unless the CSIR takes a decision it is likely to die.”\n\nIn January 2014, the Drug Controller General of India — the referee for drug trials in the country — approved a phase 2b trial (a limited test of a prospective drug in humans to prove its potency) to test a combination of three TB drugs to treat multi-drug-resistant tuberculosis (MDR-TB).\n\nThe promise of this combination — called PaMZ (PA-824 + moxifloxacin + pyrazinamide) — is to cut treatment time by at least a third. Moreover, it was purportedly effective even when tested on HIV patients.\n\nThe drug, developed in collaboration with the international Global Alliance on Tuberculosis, was to enter phase 3, or large-scale trials last year in South Africa. However, there are reviews that are reconsidering these trials on the grounds that it hasn’t worked as well as it was supposed to in HIV patients.\n\nAccording to the World Health Organisation, TB kills an estimated 1.5 million people annually, and is one of the world’s deadliest diseases. There were also approximately 190,000 deaths from MDR-TB in 2014 and more than half of these patients were in India, China and the Russian Federation. Currently, people with MDR-TB require 18 to 24 months of treatment, with several pills and daily injections for at least six months. Apart from the health benefits, the drug trial would have been the first such attempt by the CSIR-led Open Source Drug Development (OSDD) consortium — an initiative to discover and test new drugs for infectious diseases that are widespread in poor countries by using expertise outside the confines of traditional pharmaceutical companies — to test a new drug in India.\n\nMost drugs that are available in India are reverse-engineered versions of drugs developed in Europe or the United States. Since 2015, however, the OSDD has been shut down as a CSIR project. A senior doctor involved with the PaMZ trial said it was “uncertain” whether funds would be available next year. “There have been some concerns internationally over the efficacy of this regimen… the trial is still on but I’m not sure of the future,” he said.\n\nCSIR Director-General, Girish Sahni, didn’t respond to calls or text messages.", 
    "section": "national", 
    "title": "Fund crunch hits Indian drug trial", 
    "subsection": "general", 
    "date": "2016-02-27"
}