{
    "author": [], 
    "text": "Super slim yet strong, Graphene is set to revolutionise the electronics world\n\nBendable mobile phones, quick-charge batteries and unbreakable touch screens…technology firms are racing to harness the potential of graphene, a wonder material which scientists say could transform consumer electronics.\n\nA fine sheet of pure carbon, graphene is as thin as an atom, making it the skinniest material known.\n\nAt the same time though, it is 100 times stronger than steel, hugely pliable and can conduct electricity and heat better than anything else.\n\n“There are other materials which do have one of those properties each,” physicist Kostya Novoselov, who first isolated graphene in 2004, said at the Mobile World Congress, the sector's biggest trade fair, in Barcelona.\n\n“What is amazing here is that all those qualities are combined in one simple crystal. Of course that immediately leaves us with a number of possible applications.”\n\nGraphene is so pliable scientists predict it will one day make flexible phones possible.Graphene is so strong and thin that researchers believe they will one day be able to use it to make unbreakable screens for mobile devices.\n\n“With just a few kilos you can replace all the touchscreens in the word. With just a few layers on top of each other you can support an elephant,\" said Vittorio Pellegrini, director of the Italian Institute of Technology's Graphene Labs. “Graphene is a material that allows our imagination to fly. There is no limit to what you can do,” he added. Samsung, the world’s number one smartphone maker, has taken out the most graphene patents — over 490 — followed by China’s Ocean’s King Lighting and IBM.\n\nThe trade fair in Barcelona for the first time had a pavilion dedicated to graphene research centres and start-ups, a sign of the growing importance of the material to the mobile industry. — AFP", 
    "section": "national", 
    "title": "Graphene set to revolutionise electronics", 
    "subsection": "general", 
    "date": "2016-02-27"
}