{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Radhika Vemula, mother of Hyderabad University research scholar Rohith Vemula, on Friday sharpened her attack on Union Ministers Smriti Irani and Bandaru Dattatreya and others for branding her son an anti-national and extremist.\n\nAt a press conference at the Indian Women’s Press Corps here, Ms. Vemula asked Ms. Irani to shed her soap opera persona and accused her of blatantly lying in Parliament on Wednesday about the circumstances surrounding the death of her son. She warned Prime Minister Narendra Modi that the BJP would be “decimated” if he did not act against Ms. Irani, Mr. Dattatreya and others “responsible” for the death.\n\nRohith’s friend Dontha Prasanth said Ms. Irani had used “cinematic expressions” to spread falsehoods about the suicide and the events preceding it. Rohith’s friends and family rebutted Ms. Irani’s claims point by point. “I had arrived at the suicide spot soon after Rohith’s death came to light. The police and doctors were very much in the room where the body was lying,” said Rohith’s brother Raja Chaitanya. The Minister had said in Parliament that no attempt was made to revive Rohith and no doctor was allowed near the body, which was instead used as a political tool. The duty doctor at the university on Thursday contradicted the claim that no doctor was allowed near the body to revive Rohith. Mr. Prasanth criticised Ms. Irani for concealing from the country the letter that had hinted at a possible suicide.\n\nOn December 18, Rohith had reportedly written to the Vice-Chancellor, expressing his anguish at the “personal interest” shown by him [the V-C] in the “social boycott” of Dalit research scholars. “In the letter, Rohith asked the Vice-Chancellor to provide all Dalit students with 10 milligrams of sodium azide and a rope at the time of admission. Why did not Ms. Irani mention this letter in Parliament,” Prasanth asked. Ms. Vemula urged Mr. Modi to act as the “nation’s Prime Minister” and not just of “the BJP and his own caste.”", 
    "section": "national", 
    "title": "It’s all blatant lies: Rohith’s mother", 
    "subsection": "general", 
    "date": "2016-02-27"
}