{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "People blame both ruling BJP and Opposition Congress\n\nPeople are blaming both the BJP and the Opposition Congress for the worst caste violence in recent times.— File photo: PTI\n\nPost-Jat quota stir, life is limping back to normality in Haryana — but the agitation pushing for reservation in jobs and education has pitted Jats against non-Jats and embittered social ties which could take years to heal.\n\nPeople are furious and have been blaming both the ruling BJP and the Opposition Congress for apparently the worst caste violence in recent times.\n\nAfter a peaceful start the Jat agitation took a violent caste turn, in which the non-Jats, mostly the OBCs had to face the fury of angry protesters. Soon after, the non-Jat communities united together under the banner of “35 Biradari” (35 castes). In Haryana, where 36 castes make its social mosaic, grouping of non-Jats against the Jats points to the clear division between Jats and other communities, which mainly comprise Sainis, Banias, Brahmins, Yadavs, Punjabis, and Nais.\n\nInter-community relations are severely strained and possibly might never be the same again even as many people across the State feel that political parties were only playing petty politics during the stir.\n\n“We were friends a few days ago, but now things have changed. They [Jat protesters] burned our houses, shops,” a dejected Hari Kesh, whose sweet shop was set ablaze in Kaithal told The Hindu , adding that he would never forgive the people who looted and torched his shop.\n\nShouting a slogan “35 biradari zindabad”, Mr. Kesh said it was on the intervening night of February 21 that a mob of around 20,000 protesters struck his shop, set it ablaze and looted all cash. “They were targeting us [non-Jats]. Even the police didn’t come to our help” he alleged.\n\nIn Haryana, Jats account for around 29 per cent of the population and are politically influential but until now, caste differences never led to such acute conflict.\n\nA Municipal Council ward member of Kaithal, Prem Chand, said as protesters went on a destruction spree, the Jat-dominated police were mute spectators.", 
    "section": "national", 
    "title": "Jat quota stir erases bonhomie among communities in Haryana", 
    "subsection": "general", 
    "date": "2016-02-27"
}