{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The voice of the youth is stifled by unleashing a reign of terror, says Chairman of All Party Hurriyat Conference, Mirwaiz Umar Farooq.- PHOTO: NISSAR AHMAD\n\nThe controversy sparked by slogans raised at the Jawaharlal Nehru University (JNU) over the hanging of Parliament attack convict Afzal Guru earlier this month, has revived the debate in the Kashmir valley, with several street protests, larger-than-life banners of Guru, new videos and pro-Afzal graffiti on the city’s walls.\n\nA day-long shutdown has been called on Saturday by separatists in solidarity with the detained JNU students.\n\nA senior police officer admitted to The Hindu that pro-Afzal protests were fast spreading across the valley. “The first and second death anniversary of Guru saw just a daylong shutdown on February 9 (the day Guru was executed). This year, for the fourth week now, we are keeping a constant eye on separatists,” he said.\n\nPro-Guru protests were held in several parts on Friday. Activists of Syed Ali Geelani’s Tehreek-e-Hurriyat and Mirwaiz Umar Farooq’s All Parties Hurriyat Conference hit the streets in several areas of Srinagar and Budgam.\n\nBesides banners with Guru’s photograph, protesters were seen carrying posters of incarcerated JNUSU president Kanhaiya Kumar, JNU scholar Umar Khalid and rights activist S.A.R. Geelani, demanding their “unconditional release”.\n\nSeparatist Zamrooda Habib, chairperson of Muslim Khawateen Markaz, said, “New Delhi is intimidating Kashmiris in one or the other way. We are not going to tolerate this. Delhi should realize ground realities in Kashmir… Slapping sedition charges against Prof. Geelani, Kanhaiya Kumar and other students has no moral justification. If they are not released soon, whole Kashmir will come on streets and will start protests,” she warned. Several protests in Srinagar saw a repetition of slogans raised in JNU on February 9, including ‘BJP sun ley Azadi’. Pro-Guru graffiti and his picture in a kafiya (Arabic head scarf) have appeared on several walls across the old city uptown areas. Several videos, praising Guru in songs in Kashmiri, have surfaced online.\n\nSpeaking after the Friday prayers in the old city, the Mirwaiz said, “We hope educated youth of India now understand that Kashmiris were being victimised by the Government of India and its policies. When things are pointed out by persons like Gautam Navlakha, Arundhati Roy or Prashant Bhushan, they are not only harassed but also targeted with violence.”\n\nThe Mirwaiz alleged the youth were being pushed to the wall and “their voice stifled by unleashing reign of terror”. “The law of nature is that the more the government tries to crush the voice, the more vociferously these voices reverberate,” he said.", 
    "section": "national", 
    "title": "JNU row revives J&K debate on Afzal hanging", 
    "subsection": "general", 
    "date": "2016-02-27"
}