{
    "author": [], 
    "text": "Even 10 minutes of activity every day makes a huge difference\n\nReplacing 30 minutes of sedentary time with physical activity, light to vigorous, produced even better results.— File photo: K. Gopinathan\n\nEven if you do not sweat it out in the gym every morning, swapping out just a few minutes of sedentary time with some sort of movement can help you live longer, suggests a new research.\n\nIn the study involving over 3,000 people aged 50 to 79, researchers found that the least active people were five times more likely to die during the study period than the most active people, and three times more likely than those in the middle range for activity.\n\n“You did not have to even get a good sweat to experience the reduced likelihood of mortality,” said study lead author Ezra Fishman from the University of Pennsylvania.\n\n“Activity doesn’t have to be especially vigorous to be beneficial. That’s the public health message,” MR. Fishman noted.\n\nThe findings were published in the journal Medicine & Science in Sports & Exercise . For the study, the participants wore ultra-sensitive activity trackers – called accelerometers – for seven days, generating data compiled by the U.S. Centers for Disease Control and Prevention (CDC). For these same people, the agency then tracked mortality for the next eight years.\n\n“When we compare people who exercise the same amount, those who sit less and move around more tend to live longer,” Mr. Fishman said.\n\n“The folks who were walking around, washing the dishes, sweeping the floor tended to live longer than the people who were sitting at a desk,” Mr. Fishman noted.\n\nThough the scientists did not discover any magic threshold for the amount a person needs to move to improve mortality, they did learn that even adding just 10 minutes per day of light activity could make a difference.\n\nReplacing 30 minutes of sedentary time with light or moderate-to-vigorous physical activity produced even better results. — IANS", 
    "section": "national", 
    "title": "Just walking around helps prolong life, shows research", 
    "subsection": "general", 
    "date": "2016-02-27"
}