{
    "author": [], 
    "text": "The new study gives credence to the #OscarSoWhite controversy that has surrounded this year’s awards ceremony.— Photo: AFP\n\nReflecting a persistent lack of diversity in the genre and the global film industry, a new study has claimed that best documentary feature category in the Oscars consistently favours white, male documentary directors.\n\nReleased just days before the 88th Academy Awards 2016, which are set to be organised on February 28, the findings showed that 89 per cent of film directors shortlisted for the Academy Awards for Best Documentary Feature have been white, and 77 per cent have been male, over the past three years.\n\nThe researchers systematically gathered, archived, categorised and coded data for 45 films across 2014, 2015 and 2016 along the road to the Academy Awards.\n\nA total of 56 formally-credited directors were examined for this analysis, as several films had more than one credited director.\n\n“It’s an amazing moment to make, watch and celebrate documentary films, which are such an important part of our cultural landscape, reflecting stories crucial to our democracy and entertaining us at the same time,” said lead researcher Caty Borum Chattoo from American University’s centre for Media and social impact.\n\nWith close investigation of the Oscar-shortlisted documentary films, the study brings to light what it takes to reach the highest level of achievement. “There may be a myth that the diversity challenges facing other Academy Awards categories – and the entertainment business in general – are not observed in independent documentary films, but based on our research there is clearly a long way to go,” Ms. Chattoo added.\n\nThe findings titled ‘Journey to the Academy Awards: An investigation of Oscar-shortlisted and nominated documentaries (2014—2016)” showed that Academy Awards recognition of female documentary makers remain consistently rare. — IANS\n\nData for 45 films shortlisted for the Oscars in 2014, 2015 and 2016 were analsyed", 
    "section": "national", 
    "title": "Male, white documentary directors dominate Academy Awards: study", 
    "subsection": "general", 
    "date": "2016-02-27"
}