{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Probe begins after report by municipal corporation points out several instances of negligence\n\nThe police have not named any specific person in the FIR, registered against ‘officials concerned’ of Wizcraft, for the fire.— File photo: AFP\n\nThe Mumbai Police on Friday registered an FIR against Wizcraft International Entertainment in connection with the fire that broke out at the venue of a Make in India event at the Girgaum sea face earlier this month.\n\nWizcraft was given the contract of organising a cultural and entertainment programme on February 14, in which film personalities were performing, and which was attended by top politicians from the Centre and the State.\n\nThe fire broke out during a lavani performance and engulfed the stage within minutes, after which the entire venue had to be evacuated and a probe was initiated.\n\n“An FIR has been registered against Wizcraft at the DB Marg police station for endangering life and safety of others and negligent conduct with respect to fire or combustible matter under the Indian Penal Code,” Mumbai Police spokesperson DCP Dhananjay Kulkarni said.\n\nOfficials said the FIR was based on the report submitted by the Brihanmumbai Municipal Corporation earlier this week, which pointed out several instances of negligence. The report, which was prepared by fire brigade officials, said that the fire, which is believed to have been triggered by a short circuit, was aggravated by the presence of prohibited combustible materials placed under the stage, pointing to negligence on part of the organisers.\n\nThe police have, for the moment, not named any specific person in the FIR, which is registered against ‘officials concerned’ of Wizcraft.\n\n“Inquiries are under way with officials and employees of Wizcraft who were responsible for organising the event, as well as the people who were present at the venue on the night of the incident. After completing inquiries with them, and after conducting corroborative inquiries and getting reports from the Forensic Sciences Laboratory, we will be able to pinpoint exact responsibility and take action accordingly,” Mr. Kulkarni said.", 
    "section": "national", 
    "title": "Mumbai police file FIR against Wizcraft", 
    "subsection": "general", 
    "date": "2016-02-27"
}