{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "An anguished Supreme Court told the Centre on Friday to take steps and frame rules to stop access to websites featuring child pornography, classifying them as “obscene” and a threat to social morality.\n\nA Bench of Justices Dipak Misra and S.K. Singh was reacting to a submission made by the Supreme Court Women Lawyers Association that there were instances where school bus drivers and conductors forced children under their care to watch porn and sexually assaulted them owing to easy and free access to porn, including child pornography, in the country.\n\nHearing this, Justice Misra said, “freedom of speech is not absolute, liberty is not absolute” when such rights were misused to subject innocent children to such sexual perversions.\n\nThe court said technical glitches and jurisdictional niggles were not excuses for the Centre’s inaction in this regard.\n\n“Innocent children cannot be made prey to this kind of painful situations and a nation cannot afford to carry on any kind of experiment with its children in the name of liberty,” the Supreme Court said, drawing the line on where rights ended and criminality began.\n\nThe Bench quoted senior advocate Mahalakshmi Pavani, appearing for the association, to say that child pornography was spreading like moral cancer and “freedom of speech cannot create a dent in the national character or moral dent.”\n\n“The Centre is required to make certain rules and regulations to initially stop child pornography,” Justice Misra said, adding that this genre was “sheer obscenity.”\n\nReferring to the exposure of children to pornographic material owing to free access to it on the Internet, the court said: “these moral assaults may bring physical disasters with them.”\n\nThe court directed the Centre to file an affidavit on ways and means to curb free access to child pornography on the Internet and asked the government to reply whether there could be a ban on watching porn “of any form” in public places.\n\nThe hearing was based on petitions filed to curb free access to porn, especially child pornography, and their ban.\n\nThe Supreme Court, however, said a clear distinction had to be made between art and obscenity.\n\n“There are those who feel that even Mona Lisa [painting] is pornography. A distinction has to be drawn between art and obscenity. You have a tough job to do,” Justice Singh told the Centre.\n\nThe Supreme Court draws the line\n\non where rights\n\nend and\n\ncriminality begins", 
    "section": "national", 
    "title": "Prevent access to child pornography, Centre told", 
    "subsection": "general", 
    "date": "2016-02-27"
}