{
    "author": [
        "National Bureau"
    ], 
    "text": "The Economic Survey finds that India will find it hard to meet its variety of obligations to tackle climate change without substantial help from the private sector.\n\n“Successful implementation of the Paris Agreement, the Sustainable Development Goals (SDGs) and the ambitious targets set out in the Intended Nationally Determined Contributions (INDCs) will require huge financial resources which cannot be met through budgetary sources alone. Leveraging private finance along with public finance, both international and national, will be critical,” says the chapter on climate change and sustainable development in the Survey.\n\nThe SDGs set by the United Nations last September lay the onus on countries to make significant progress on a wide range of goals including ending poverty and hunger and combating climate change. The INDCs are plans by governments communicated to the United Nations climate change council regarding the steps they will take to address climate change domestically.\n\nGreen technology\n\nIndia, the Survey adds, could benefit from the renewed global focus on adopting and developing green technology but there could be international “pressure” to commit to a date beyond which its emissions wouldn’t increase. This is one of the sticking points between the U.S. and India and China on doing more to contain their greenhouse gas emissions. As part of its domestic climate commitments, India has said it would source nearly 60,000 MW of its energy by wind-power and 1,00,000 MW megawatts via solar power by 2022. The latter is extremely ambitious considering that as of today only 5% of this proposed solar capacity has been installed. The Survey also notes that a mission on Climate Change and Health — mooted since early 2015 — is being developed and a National Expert Group on Climate Change and Health has been constituted.", 
    "section": "national", 
    "title": "Private finance vital for India to reach climate goals: Survey", 
    "subsection": "general", 
    "date": "2016-02-27"
}