{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Bench allows Swamy to intervene in a batch of pending civil appeals\n\nThe court has allowed Subramanian Swamy to intervene in a batch of pending civil appeals.\n\nThe Supreme Court on Friday agreed to hear a plea by BJP leader Subramanian Swamy to “rebuild” Ram temple at the Babri Masjid-Ramjanmabhoomi site along with pending appeals challenging a lower court decision fixing the exact birthplace of Lord Ram at the disputed Ayodhya site.\n\nA Bench of Justices Gopala Gowda and Arun Mishra allowed Dr. Swamy to intervene in a batch of pending civil appeals challenging the September 2010 judgment of the Allahabad High Court, which not only held that the exact birthplace of Lord Ram was under the central dome of the masjid destroyed by kar sevaks in 1992, but also took upon itself to partition the Ramjanmabhoomi-Babri Masjid site, leaving a one-third slice for Ram Lalla.\n\n‘Leap of faith’\n\nStaying this judgment in 2011, the apex court had termed the High Court’s decision a sheer “leap of faith.”\n\nIt had further found the High Court’s decision to partition the disputed site into three portions as “strange and surprising,” especially when no such prayer was made in the civil suits for land title.\n\nIn his petition filed under Article 32 of the Constitution, Dr. Swamy submitted that this pendency of the appeals had restricted his right to worship and dignity of life under the Constitution.\n\nHe asked the court to intervene with the government to “allow the Hindus to rebuild the Ram temple at the Ram Janmabhoomi site in Ayodhya, Uttar Pradesh.”\n\n“A masjid is not an essential part of Islam religion, according to the above majority judgment of a Constitution Bench of the Supreme Court. According to the House of Lords, U.K., the temple is always a temple even if in disuse,” the petition said.", 
    "section": "national", 
    "title": "SC links plea for Ram temple to Ramjanmabhoomi appeals", 
    "subsection": "general", 
    "date": "2016-02-27"
}