{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Home Ministry to fix responsibility for “mishandling” of the situation\n\nUnder fire from the Opposition and civil society for its handling of the Jawaharlal Nehru University (JNU) incident, the government is making efforts to “retrieve” the situation now.\n\nTop sources in the Home Ministry said that last week, just before the Parliament session was to commence, they had asked the Delhi Police for a report on the JNU row. They were also planning to send them another missive, asking why the police relied on video footage provided by a private news channel to register an FIR regarding the pro-Afzal Guru event organised there.\n\nAs reported by The Hindu earlier, though a police team was present when two groups of students were leading a march in JNU on February 9, an FIR of sedition was registered two days later when Zee News aired the show where some people allegedly raised anti-India slogans. As per the standard operating procedure (SOP), it is mandatory for the police to carry their own recording device whenever they have gone to attend a protest or gathering.\n\nWhen contacted, Police Commissioner B.S. Bassi confirmed that they had sent a report to the MHA. He told The Hindu , “the video recording was only incidental, we have other evidence to prove the case.”\n\nWhen asked why wasn’t the Delhi Police carrying their own camera and relied on the footage provided by Zee News, Mr. Bassi said, “the cameras Delhi Police have are amateurish. The video footage shot by you [news channels] people are done in a professional manner and they are of high quality. As I said earlier, video footage is only one of the evidence we have.”\n\nOfficials in the Home Ministry said they would do a “course-correction” on the JNU matter and would try to fix responsibility for “mishandling” the entire situation. They added that the violence at Patiala House was completely avoidable and it unnecessarily embarrassed the government.\n\n“The Delhi Police are doing their investigation but we will be asking them some tough questions on the way they mishandled the entire episode. We have asked them for a report on the entire episode and will be seeking further clarifications on the conduct of the policemen on the court premises,” said a senior Home Ministry official.\n\nMr. Bassi said they had sent a factual report to the MHA. He said, “It was a factual report and we have told the government that everything is fine at our end.”\n\nHe said the forensic report of the Zee News footage had not arrived yet. The police had sent the video footage for examination amid allegations that a doctored version was aired.\n\nVishwa Deepak, a news producer associated with the channel, had resigned as a mark of protest against the “biased coverage” of the incident.\n\nIn his resignation letter posted on his Facebook page, Mr. Deepak said, “A video which did not even have the slogan of ‘Pakistan zindabad’ was still aired continuously. How did we blindly believe that these voices which came in the dark were of Kanhaiya or his friends? Instead of ‘Bhartiya Court zindabad,’ they heard Pakistan zindabad and spoilt some people’s career, hopes and led their families to destruction.”", 
    "section": "national", 
    "title": "Stung by criticism, govt. swings into damage control mode", 
    "subsection": "general", 
    "date": "2016-02-27"
}