{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Lawyers clash at the Patiala House court when JNUSU president Kanhaiya Kumar was produced recently.— Photo: PTI\n\nA seemingly reluctant Supreme Court on Friday took on board a petition for contempt action against three lawyers who had allegedly led the mob violence on February 15 and 17 in the Patiala House courts complex and went on to brag on TV about bashing up JNUSU president Kanhaiya Kumar, journalists, JNU students and staffers on the court premises.\n\nA Bench of Justices J. Chelameswar and A.M. Sapre initially told advocate Prashant Bhushan, appearing for senior lawyer Kamini Jaiswal, that the petition was a mere add-on to an earlier one filed by JNU alumnus N.D. Jayaprakash over the February 15 violence.\n\nMr. Jayaprakash’s petition will be heard on March 10.\n\n“What is the harm in hearing this petition, too? The earlier petition [Mr. Jayaprakash’s] was filed on February 16 and is only concerned with the February 15 violence at the Patiala House court. This one is comprehensive. Violence happened on February 17 despite your orders. That is gross contempt. There is an NHRC report. Please take up this matter,” Mr. Bhushan said.\n\nJustice Chelameswar replied: “I’ll tell you what the harm is... The simple harm is it will add to the docket of the Supreme Court.” The court then went on to issue notice.\n\nMs. Jaiswal has also sought a Special Investigation Team to be set up by the Supreme Court to probe the violence.\n\nObjections were raised in the courtroom by several lawyers against Mr. Bhushan appearing in the contempt petition. They said he himself was facing contempt for comments allegedly made against the former judges of the Supreme Court.\n\nBut the Bench asked them to formally apply if they wanted to intervene.\n\nMr. Bhushan said the violence caused “international alarm” even as the Delhi Police Commissioner described it as a “minor scuffle.”\n\nThe petition by Ms. Jaiswal has arraigned the Ministry of Home Affairs, the Delhi Police and the three lawyers — Vikram Singh Chauhan, Yashpal Singh and Om Sharma — as parties.\n\nThe Supreme Court has served notice on the lawyers through the Bar Council of India.", 
    "section": "national", 
    "title": "Supreme Court notice to lawyers accused of attack", 
    "subsection": "general", 
    "date": "2016-02-27"
}