{
    "author": [
        "T C A Ramanujam T C A Sangeetha"
    ], 
    "text": "Who are the most disappointed hearing the Budget speech? The answer is ready — the salaried tax payer and the middle class. There was expectation that the tax slab will be revised to benefit these classes. This did not happen. Instead, the rebate on income tax for those earning below Rs. 5 lakh has been increased from Rs. 2000 to Rs. 5000 — a paltry relief of Rs.3000. Can there be more miserliness? The disposable income available after tax will not be higher as you see from the rest of the tax proposals. And this at a time of admitted inflation in the country.\n\nUnexpected amnesty scheme\n\nWho are the happiest people after the presentation of the Budget? The black money hoarders. The government proposes to introduce an amnesty scheme which will help declarers of black money to get away with 45% tax on the disclosed amount.\n\nThis amnesty scheme flies in the face of the repeated assurances given by the Central government before the Supreme Court. Every amnesty scheme, said Palkhivala, results in transfer of resources from the honest rich to the dishonest rich.\n\nThe present amnesty amounts to an admission that the government is not able to unearth black money in India on a significant scale, despite the huge powers it has assumed under the Indian Income Tax Act 1961.\n\nDouble taxation\n\nOne welcome feature is the increase in surcharge on the super rich, with incomes of Rs. 1 crore and more, from 12% to 15%. Dividends received by individuals and Hindu Undivided Families (HUFs) will be taxed at 10% if the amount exceeds Rs. 10 lakh. The snag in the scheme is that the additional dividend distribution tax is retained. Will it amount to double taxation of the same income? Jurists must ponder.\n\nWho benefits? Small corporate houses will have to pay only 29% as corporate tax hereafter. The Finance Minister had promised to bring down the effective rate of tax. Nothing significant has happened in this direction. Why not extend the same benefit to non-corporate entities and individuals who have to shell out more than 30% plus surcharge on their incomes exceeding Rs.10 lakh?\n\nService tax has been raised by 0.5% to 15%. This will mean all services will prove costlier hereafter. Indirect tax proposals are set to yield Rs.20,670 crore, while the revenue loss by way of direct taxes announced amounts to Rs.1060 crore.\n\nIt is axiomatic that indirect taxes are regressive and can be passed on to the common man as the ultimate consumer.\n\nDuty on tobacco is raised but not on beedis. This is an attempt to increase the price of cigarettes consumed by the rich. There is no tax on polluting companies. Pollution is known to bring in the risk of cancer. One wishes that the concern shown to prevent the rich from the risk of cancer is extended to the poor also by way of taxing the polluting companies.\n\nLobbying\n\nUnlisted companies get the benefit of deduction in holding period from three years to two years for paying long term capital gains tax. What is the provocation? Who lobbied for this relief?\n\nA cursory perusal of the Finance Bill will show its complexities verging on incomprehensibility. There is absolute uncertainty with regard to tax laws and rates of tax. What will be the tax rate next year? We don’t know.\n\nThe middle class will be left wondering if the Modi magic has deserted the FM.\n\nT.C.A.Ramanujam is a former Chief Commissioner of Income Tax and T.C.A.Sangeetha is an advocate\n\nService tax has been raised by 0.5% to 15%. Indirect taxes are regressive and can be passed on to the common man", 
    "section": "national", 
    "title": "‘A disappointing Budget’", 
    "subsection": "general", 
    "date": "2016-03-01"
}