{
    "author": [
        "T C A Sharad Raghavan"
    ], 
    "text": "Now, 60 per cent of savings under the Employees’ Provident Fund will be taxed at the time of withdrawal\n\nFinance Minister Arun Jaitley raised the tax surcharge on the super-rich, but used a googly to sneak in an unkind cut for the salaried class, whose retirement savings are parked in the Employees’ Provident Fund (EPF).\n\n“I propose to make withdrawal up to 40 per cent of the corpus at the time of retirement tax exempt in the case of the National Pension Scheme. In case of superannuation funds and recognised provident funds, including EPF, the same norm of 40 per cent of corpus to be tax free will apply in respect of corpus created out of contributions made after April 1, 2016,” Mr. Jaitley said, during his Budget speech on Monday.\n\nIn other words, accumulated savings under the National Pension Scheme (NPS) that were fully taxable at the time of retirement would now be taxable only for 60 per cent of the retirement corpus. The same logic has been extended to the EPF making 60 per cent of savings taxable at the time of withdrawal. EPF contributions, income as well as the final corpus at retirement were tax-free till now.\n\nThe Finance Ministry, with this move, has sought to bring parity between the Labour Ministry-run EPF, the NPS and the superannuation pension funds in terms of their tax treatment. EPFO manages around Rs. 10 lakh crore of retirement savings from 8.5 crore members, while NPS accounts number 1.15 crore with savings totalling Rs. 1.1 lakh crore.\n\nAlong with this, the Finance Minister proposed a one-time exemption from any tax liability on those looking to switch their retirement savings from a recognised provident fund or superannuation fund to the National Pension System.\n\nHe also proposed tax incentives for the Sovereign Gold Bond Scheme and the Gold Monetisation Scheme.\n\n“Earlier, contributions to PF up to 12 per cent of the base salary were exempt from tax. Now, contributions above Rs. 1.5 lakh will be taxed. Along with this, on withdrawal, 60 per cent of the amount will be taxed except in case of excluded employees [those earning a monthly salary not exceeding a yet to be specified amount],” Kuldip Kumar, Partner and Leader Personal Tax PwC India told The Hindu .\n\nLevel field\n\n“This will mean that you will no longer find tax arbitrage in these pension products. Earlier, people were choosing one product or the other on the basis of the tax they would have to pay. Now, that has gone. By making all the schemes at par, employees will choose between them on the basis of their efficiency and returns,” Amit Gopal, Senior Vice President at India Life Capital said.\n\nHowever, the impact of this will be felt by the higher income groups, according to Mr. Kumar, because their contributions will be taxed at the time they are made as well as when they are withdrawn. “This will impact everybody who is not an excluded employee and makes a withdrawal from these schemes, but will doubly impact higher income groups who contribute more than Rs. 1.5 lakh to PF and/or superannuation,” he said.\n\nThe proposed exemption for a one-time portability from a recognised provident fund or superannuation fund to the National Pension System will greatly benefit employees, according to Mr. Gopal. “This is a great move and will help all employees. At the moment, employees have their savings in several different pots. This allowance of portability of funds from one scheme to another will mean that employees can have all their funds in a single scheme,” Mr. Gopal told The Hindu , adding that this would mean that the rate of return could then be applied to a much larger corpus of funds.\n\nGold bonds\n\n“It is proposed to provide that redemption by an individual of Sovereign Gold Bond issued by RBI under Sovereign Gold Bond Scheme, 2015 shall not be charged to capital gains tax. It is also proposed to provide that long term capital gains arising to any person on transfer of Sovereign Gold Bond shall be eligible for indexation benefits,” Mr. Jaitley said. Along with this, he proposed that the interest and capital gains earned on the deposits under the Gold Monetisation Scheme also be made exempt from tax.\n\nMr. Jaitley has also proposed to raise the surcharge levied on individuals earning above Rs. 1 crore a year from 12 per cent to 15 per cent. He also proposed a 10 per cent tax to be levied on individuals or companies earning dividends more than Rs. 10 lakh.\n\nThose earning less than Rs. 5 lakh a year will now receive a tax rebate of Rs. 5,000 under section 87A, up from a rebate of Rs. 2,000 earlier.\n\n“There are two crore tax payers in this category who will get a relief of Rs. 3,000 in their tax liability,” Mr. Jaitley said. At the moment, people who do not own a house and do not get house rent allowance receive a tax deduction of Rs. 24,000 per year from their income. He has proposed that this limit be increased to Rs. 60,000 per year, aimed at providing relief to those living in rented accommodations.\n\n‘No longer can one find tax arbitrage in the pension products’", 
    "section": "national", 
    "title": "A googly that could stump the salaried class", 
    "subsection": "general", 
    "date": "2016-03-01"
}