{
    "author": [], 
    "text": "It would be fair to describe the Budget presented by Finance Minister Arun Jaitley as a pragmatic budget. With its ‘nine pillar’ theme, it aims to boost economic growth while at the same time ensuring inclusive growth of the Indian economy.\n\nWhat can be appreciated is that Mr. Jaitley gave equal importance to all sectors of the economy — for example, the Budget emphasised on investments in the social and rural sectors through focus on infrastructure investments, health insurance, farmer income schemes as well as education and skills development. What was important was that he also focused on much-needed fiscal and regulatory measures such as financial reforms, policy changes to improve the ease of doing business, fiscal discipline and tax reforms.\n\nIn the area of financial sector reforms, particularly welcome is the government’s move to come out with a comprehensive bankruptcy code. His assurance that the government would not resort to retrospective taxation in the future is also a welcome gesture, which would restore the faith of global investors in the country’s tax regime. Combined with his statements on the need for tax reforms and for improving the ease of doing business in India, it looks like a move to support industry not necessarily through tax breaks but by making it easier to do business. This should fuel the Make in India and Start Up India vision that is shared by all who work for India’s growth.\n\nFrom an economic perspective, it’s a good sign that while huge amounts were allocated for social welfare schemes, the government has continued to keep an eye on the fiscal deficit.\n\nFiscal prudence has reigned with the current FY16 fiscal deficit targeted at 3.9 per cent and next year’s target projected at 3.5 per cent.\n\nWhat we look forward to is the possible positive outcomes from the huge allocation of nearly Rs.1 trillion on building new roads and highways. We hope this will trigger off economic growth, both in urban and rural areas, thereby boosting consumer demand across sectors.\n\nSimilarly, the decision to invest up to Rs.1 billion each in about 160 airports and airstrips in tier-II cities should work to accelerating all-round development. At the very least, it will provide much-needed connectivity to smaller towns in the country.\n\nIt is indeed heartening that at a time when there is economic turmoil around the globe, the Indian economy – the fastest growing in the world today – has stood its ground and is resilient.\n\nIt looks like Mr. Jaitley’s budget proposals aim to ensure that India will remain “a bright spot” in a world beset by economic slowdown.\n\nWhat can be appreciated is that Mr. Jaitley gave equal importance to all sectors of the economy", 
    "section": "national", 
    "title": "A pragmatic budget", 
    "subsection": "general", 
    "date": "2016-03-01"
}