{
    "author": [
        "National Bureau"
    ], 
    "text": "Move will help empower women, and create employment for rural youth\n\nIn his third Union Budget, Finance Minister Arun Jaitley announced cooking gas subsidy for women members of 5 crore poor households, giving a legal backing to Aadhaar numbers and launching direct benefit transfer for fertilizers to help farmers.\n\nThe government will provide LPG connections to women members of a below poverty line household. It has earmarked Rs. 2,000 crore to help meet the initial cost of providing the cooking gas connections to 1.50 crore poor households in 2016-17.\n\n“In our country, cooking gas cylinders were considered an upper middle class luxury. Gradually it spread to the middle class. But the poor do not have access to cooking gas. Women of India have faced the curse of smoke during the process of cooking. According to experts having an open fire in the kitchen is like burning 400 cigarettes an hour,” Mr. Jaitley said.\n\nThe government said the move will help empower women, protect their health and create employment for rural youth in the supply chain of cooking gas. The scheme, which will be continued at least for two more years, will cover five crore below poverty line households.\n\nIn a bid to ensure that the benefits of various government subsidies reach the people “who deserve it,” the government plans to give statutory backing to the Aadhar platform. It will soon introduce a Bill in Parliament linking various financial inclusion schemes with Aadhaar numbers.\n\nThe move will help streamline delivery of government subsidies to the poor and the government plans to bring all the benefits and subsidies funded from the Consolidated Fund of India on the Aadhaar platform.\n\n“First, we will introduce a Bill for Targeted Delivery of Financial and Other Subsidies, Benefits and Services by using the Aadhaar framework. The Bill will be introduced in the current Budget Session of Parliament,” Mr. Jaitley said. He, however, added that the Aadhaar number will not confer any right of citizenship or domicile.\n\nTerming it as a “transformative piece of legislation”, Mr. Jaitley said a social security platform will be developed using Aadhaar to accurately target beneficiaries.\n\nAs of now, around 98 crore Aadhaar numbers have been generated and Aadhaar numbers have been seeded in 11.19 crore direct benefit transfer of LPG accounts out of a total 16.5 crore beneficiaries.", 
    "section": "national", 
    "title": "Aadhaar to get legal backing", 
    "subsection": "general", 
    "date": "2016-03-01"
}