{
    "author": [
        "Piyush Pandey"
    ], 
    "text": "Government to initiate steps to phase out corporate tax exemptions\n\nThe big boys of India Inc. are not happy with Union Budget 2016 as Finance Minister Arun Jaitley on Monday did not reduce tax rates for them and started the process of phasing out corporate tax exemptions.\n\nOn the much anticipated corporate tax front, Mr. Jaitley restricted himself to a marginal 1 per cent reduction in corporate taxes for existing small firms.\n\n“I propose to lower the corporate income tax rate for next financial year for relatively small enterprise companies, with a turnover not exceeding Rs.5 crore, to 29 per cent plus surcharge plus cess,” the Finance Minister announced.\n\nHowever, he lowered the corporate tax to 25 per cent for all new manufacturing companies incorporated from April 1, provided they do not claim any exemptions to promoting industrial activity and generate jobs.\n\nRiaz Thingna, Director, Grant Thornton Advisory Private Limited, said not implementing the corporate tax rate reduction across the board as promised was an area of disappointment on the Direct tax front.\n\nIn last year’s budget, Mr. Jaitley had announced the government’s intention to phase out corporate tax exemptions gradually while simultaneously bringing down corporate tax to 25 per cent from the prevalent 30 per cent over four years.\n\nJustifying not lowering the tax rates for big companies this year, the Minister said the benefits of phasing out corporate tax exemptions would be available to the government only gradually. The exemptions that are proposed to be phased out include accelerated depreciation and benefits available to special economic zones.\n\nNo push for Make in India\n\n“There are no special incentives for the Make in India initiative. Incentives like accelerated depreciation and R&D have been capped. On the positive side, the postponement of Place of Effective Management (POEM), the promised General Anti-avoidance Rule (GAAR) implementation on schedule, the doing away of the retrospective tax and measures to reduce litigation are welcome,” said Mr. Thingna.\n\nPhasing out of exemptions will reduce litigation and make Indian companies more competitive globally, while taking up government revenues over the years as effective tax rates go up.\n\nT.V. Narendran, Managing Director, Tata Steel India and SEA, said that the Budget has placed special emphasis on tax reforms and dispute resolution which should go a long way in creating a facilitating environment for conducting business in India.\n\nAt present, the effective tax rate is only around 23 per cent as against the statutory rate of 32-33 per cent, resulting in revenues worth over Rs. 62,000 crore being foregone as a result of exemptions according to the budget documents.\n\nGautam Mehra, Leader- Tax, PwC India, said the Budget 2016 proposed a reduction of 1 per cent for relatively small enterprises with turnover not exceeding Rs. 5 crore and a reduction of 5 per cent for new manufacturing companies not claiming any incentives. Howeverincentives such as accelerated depreciation and weighted deductions have been reduced for all eligible taxpayers.\n\n“Overall, India Inc needs to wait and watch to really witness the true tangibility of economic benefits as the FM continues to tweak away the current indirect tax structure,” said Amit Kumar Sarkar, Partner, Grant Thornton India.\n\nFewer exemptions will reduce litigation, make companies more competitive", 
    "section": "national", 
    "title": "Big boys of India Inc. unhappy", 
    "subsection": "general", 
    "date": "2016-03-01"
}