{
    "author": [
        "Arun S"
    ], 
    "text": "Centre-State pacts proposed tohonour Bilateral Investment Treaties\n\nTo facilitate ease of doing business for foreign investors and their domestic recipients, the Union Budget 2016-17 has proposed liberalisation of foreign direct investment (FDI) norms in a host of sectors.\n\nThese include insurance, pension, Asset Reconstruction Companies (ARC), stock exchanges, marketing of food products, listed Central Public Sector Enterprises (CPSE) except banks and areas governed by financial sector regulators, falling beyond the 18 specified NBFC activities.\n\nThis the second time such ‘big bang’ FDI reforms are being announced by the government under Prime Minister Narendra Modi. In November last year, just after the BJP-led National Democratic Alliance (NDA) suffered a huge defeat in the Bihar Assembly Elections, the Centre had similarly eased norms across 15 sectors, including defence, private sector banking, construction, single brand retail, broadcasting and civil aviation to boost investment sentiment and attract more foreign capital into the country. Following these reforms and the Make in India initiative, FDI during April-December 2015 in FY’16 was up 40 per cent year-on-year to $29.5 billion.\n\nSignificantly, in a move that is in line with the union government’s policy of ‘cooperative and competitive federalism’ as well as to ensure effective implementation of Bilateral Investment Treaties (BIT) signed by India with other countries, the government proposed in the FY’17 Budget to introduce a Centre-State Investment Agreement.\n\nStates opting to ink these pacts with the Centre will be seen as more attractive destinations by foreign investors, according to the annexure to the finance minister’s Budget speech.\n\nThe finance ministry had in December last year brought out India’s Model BIT Text that will be used as a basic template during treaty negotiations with other countries. With several instances of investors suing governments under different BITs and claiming huge compensation for their ‘losses,’ these initiatives are aimed at protecting the government’s interests and securing their policy space. India has BITs with 83 countries of which 72 are operational.\n\nRegarding insurance and the pension sectors, the FY’17 Budget has proposed to allow foreign investment in the automatic route up to 49 per cent, subject to the extant guidelines on Indian management and control to be verified by the sectoral regulators.\n\nIn the FY’15 Budget, the government had increased the composite cap (including FDI and foreign institutional investment) in the insurance sector (and automatically in the pension sector as well) to 49 per cent from the 26 per cent but with full Indian management and control and through the government approval (through Foreign Investment Promotion Board or FIPB) route. Investors had delayed new investments in the sectors citing ambiguity regarding the rider specifying that management and control should be in Indian hands.\n\nTo help banks and financial institutions (FI) address the problem of huge bad loans, the FY’17 Budget has proposed 100 per cent FDI in ARCs through automatic route. ARCs play a crucial role in resolution of non-performing assets by acquiring them from banks and FIs. The FY’17 Budget also proposed that foreign portfolio investors will be allowed up to 100 per cent of each tranche in securities receipts issued by ARCs subject to sectoral caps.\n\nThe government has also proposed to allow 100 per cent FDI through FIPB route in marketing of food products produced and manufactured in India.\n\nWhile trade bodies including have opposed the move saying it amounts to partially opening up foreign investment in multi-brand retail trade and allowing multi-nationals in the sector through the backdoor, Finance Minister Arun Jaitley justified the decision saying: “A lot of fruits and vegetables grown by our farmers either do not fetch the right prices or fail to reach the markets. Food processing industry and trade should be more efficient. This move will benefit farmers, give impetus to food processing industry and create vast employment opportunities.”\n\nThe FY’17 Budget has also proposed to hike the investment limit for foreign entities in Indian stock exchanges from five per cent to 15 per cent on par with domestic institutions. This move is aimed at enhancing global competitiveness of Indian stock exchanges and accelerating adoption of best-in-class technology and global market practices, the government said.\n\nAlso, the existing 24 per cent limit for investment by foreign portfolio investors (FPI) in CPSEs other than banks, listed in stock exchanges, will be increased to 49 per cent. The move is to obviate the need for prior approval of government for increasing the FPI investment, the government said.\n\nBudget has also proposed to hike the investment limit for foreign entities in Indian stock exchanges\n\nThis is the second time such reforms are being announced by the government", 
    "section": "national", 
    "title": "Big bang reforms in FDI guidelines", 
    "subsection": "general", 
    "date": "2016-03-01"
}