{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Party leaders support farmer-friendly measures\n\nThe tilt towards rural India in the Union Budget was considered a given, after Prime Minister Narendra Modi unrolled the Pradhan Mantri Fasal Bima Yojana and started his rallies of farmers nationwide.\n\nEven so, as BJP spokespersons crowded around the parliamentary office of Union Finance Minister Arun Jaitley after his budget speech for their customary briefing, there was a palpable sense of relief in the ranks. With one eye on TV screens showing market reactions (which remained in the red), the spokespersons highlighted the push towards rural India, the boost to infrastructure, the allocation for irrigation and the tax relief for first-time homeowners as issues at various TV debates to follow. By afternoon, BJP president Amit Shah, too, hailed the budget. “The 2016 budget has done the job of taking us towards Gaon [village], Kisan [farmer] and gareeb [poor],” he said. Power Minister Piyush Goyal went a bit further. He said the budget “touched the lives of 1.25 billion Indians”.\n\nSenior BJP leaders told The Hindu that the budget was “political and necessary at this time” when the government had found itself under fire from the Opposition for being anti-farmer.\n\n“The only problem in the budget and the push for infrastructure is that the States will have to meet 40 per cent of the funding because they have received more funds from the Finance Commission’s payout. That will work only if the political priorities of the State and the Union government match; in the States not under the BJP’s rule, that may be a problem,” said a senior Minister dealing with an infrastructure Ministry.\n\n“There are reforms in the budget, but the emphasis on rural roads and irrigation and tax exemption to the neo-middle class are important indicators,” said another senior Minister.\n\nA scheme to be launched on B.R. Ambedkar’s birth anniversary to start a unified agricultural e-market and a Rs.500-crore corpus to finance entrepreneurs of the Scheduled Castes and Scheduled Tribes is meant to handle the fall-out of the suicide of Rohith Vemula. The BJP feel that the budget could be “sold” not just in the coming Assembly polls, but also in the U.P. elections in 2017.\n\n“It has done the job of taking us towards Gaon [village], Kisan [farmer] and gareeb [poor]”", 
    "section": "national", 
    "title": "BJP elated at ‘rural emphasis’", 
    "subsection": "general", 
    "date": "2016-03-01"
}