{
    "author": [
        "G Balachandar"
    ], 
    "text": "New tax measures disappoint sector, which is in the midst of fragmented recovery\n\nThe price increase for a sub-10 lakh car would be in the range of Rs. 3,000 to Rs. 45,000. —Photo: Shanker Chakravarty\n\nPrices of cars and utility vehicles will see an increase with the imposition of tax-related measures announced in the Union Budget for 2016-17.\n\nWhile companies are working on details to signal the likely hike in prices, estimates indicate that the price increase for sub-10 lakh cars would be from Rs. 3,000 to Rs. 45,000 per car.\n\nIn the case of luxury cars, it could be a few lakhs.\n\nAccording to the budget speech, there will be a levy of one per cent infrastructure cess on petrol/LPG/CNG-driven motor vehicles of length not exceeding 4 metres and engine capacity not exceeding 1200cc; 2.5 per cent cess on diesel-driven motor vehicles of length not exceeding 4 metres and engine capacity not exceeding 1500cc; and four per cent for other big sedans and SUVs.\n\nAlso, there will be an additional one per cent ‘luxury tax’ on all the cars priced above Rs. 10 lakh and increase in service tax by addition of 0.5 per cent Krishi Kalyan cess.\n\nThe new tax measures come as disappointment for the sector, which has been battling with fragmented recovery.\n\n“The infrastructure cess of one per cent on small petrol/CNG/LPG cars, 2.5 per cent on diesel cars and 4 per cent on higher engine capacity cars will affect the consumption in the already-stressed environment,” said Ajay Seth, Chief Financial Officer, Maruti Suzuki India.\n\n“New tax measures could create higher costs and compliance burden for an otherwise highly taxed sector and be counterproductive to the positive measures in the budget,” said Gaurav Karnik, Tax Partner - Automotive Practice, Ernst and Young.\n\nSeveral industry representatives and analysts argued that the government should have taken progressive steps such as introducing a ‘scrappage incentive scheme’, to keep older cars off the road.\n\n“Such a policy will benefit the environment, reduce fuel consumption and propel further demand for greener and efficient vehicles,” said Sumit Sawhney, Country CEO & Managing Director, Renault India.\n\nFor the luxury car segment, the new taxes are yet another disappointment after the Supreme Court ban on diesel-powered luxury vehicles in the Delhi region.\n\nJoe King, Head, Audi India, said the budget measures would have a negative impact on the automobile industry. “We are disappointed that the industry’s demand on reducing excise duty has not been addressed. On the contrary, infra cess has been added which will further affect the price and consequently demand. Also, we need to evaluate the impact of extra tax levy on purchase of cars above Rs. 10 lakh,” he added.", 
    "section": "national", 
    "title": "Car prices will go up with the levy of infra cess, luxury tax", 
    "subsection": "general", 
    "date": "2016-03-01"
}