{
    "author": [
        "National Bureau"
    ], 
    "text": "G.K. Pillai has said that the affidavit citing Ishrat Jahan’s allegiance to LeT was changed at the political level.\n\nThe Ministry of Home Affairs (MHA) has decided to re-examine the Ishrat Jahan files, amid allegations by the former Home Secretary G.K. Pillai that the affidavit citing the Mumbra woman’s allegiance to terrorist outfit Lashkar-e-Taiba (LeT) was changed at the political level.\n\nA senior Home Ministry official said they were digging out the files to analyse the circumstances that forced alterations in the affidavit filed by the MHA in the Gujarat High Court. “We are yet to get all the files. Some are yet to be traced.”\n\nThe official said a re-look at the Ishrat Jahan files was necessitated by the former Home Secretary’s statement that the affidavit was changed at the instance of the former Home Minister P. Chidambaram.\n\n“We are looking at the files keeping in view the new facts that have come to light,” he said.\n\nMr. Chidambaram said on Monday that he “accepted responsibility for the affidavit” and “it is disappointing that the Home Secretary who was equally responsible wanted to distance himself today.”\n\nMr. Pillai had claimed that Mr. Chidambaram, as Home Minister in the UPA government, recalled the file a month after the original affidavit, which described Ishrat and her slain aides as LeT operatives, was filed in the Supreme Court.\n\n“Only after the affidavit was revised, as directed by the Minister, did the file come to me,” Mr. Pillai is quoted as saying.\n\nThe then UPA government had submitted two affidavits — one claiming that the four who were killed in an alleged fake encounter were terrorists and the second saying there was no conclusive evidence to prove they were — within two months in 2009.\n\n‘Pillai was consulted’\n\nMr. Chidambaram said Mr. Pillai was consulted when the affidavit was changed. “Why do they point fingers? I am saying so… that as Minister, when it was brought to my notice that the first affidavit, which was filed without my approval, was ambiguous and that it was being misinterpreted, it was my duty to correct it. So we filed a supplementary affidavit after consulting the Home Secretary, the Director of Intelligence Bureau and other officers.\n\nThat second affidavit clarified what the real intention was.\n\nThe second affidavit says that the Central government did not address any issue relating to the merits or otherwise of the police action. It essentially concerned itself with dealing with the allegations relating to intelligence inputs which were available with the Central government and which are shared on a regular basis with State governments.\n\n“The primary concern of the Central government is to see that inputs gathered by the security agencies and the references are credible,” said Mr. Chidambaram.\n\n“It should be clear to all that such inputs do not constitute conclusive proof and it is for the State government and the State police to act on such inputs. The Central government is in no way concerned with such action and neither does it condone or endorse any unjustified or excessive action. If, on proper consideration of facts, it is found that an independent enquiry has to be carried out, the Union of India will have no objection to such a course and would abide by any order the court may deem fit to pass.\n\n“Which part of the second affidavit is wrong? It is an absolutely correct affidavit and I, as a Minister, accept responsibility for this affidavit. It is disappointing that the Home Secretary who was equally responsible wants to distance himself from that today.”", 
    "section": "national", 
    "title": "Centre to re-examine Ishrat files", 
    "subsection": "general", 
    "date": "2016-03-01"
}