{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Govt. hopes that companies will take advantage of the proposed dispute resolution scheme\n\nFinance Minister Arun Jaitley clarified in a post-budget select press briefing that the compliance window proposed in the Union Budget 2016 was not an amnesty scheme and remedies the flaws in the Voluntary Disclosure of Income Scheme that former Finance Minister P. Chidambaram had provided in 1997.\n\nUnder the scheme, domestic tax payers will be able to declare undisclosed income or assets by paying tax at 30 per cent and surcharge at 7.5 per cent as well as a penalty of a similar amount. “Declarants will have to pay up 45 per cent of the undisclosed income to avail of this compliance scheme so it is not unfair to the honest tax payer… Mr. Chidambaram’s scheme didn’t include a penalty…it only collected the tax due.”\n\nThe 1997 VDIS is among the most successful such schemes as it garnered over Rs. 9,000 crore in taxes. Mr. Jaitley also said that unlike the VDIS, the tax, penalty and surcharge will be payable on the current value of the asset income being declared.\n\nThe window will be provided from June 1 to September 30.\n\nMr. Jaitley also said the government was hopeful that companies would take full advantage of the dispute resolution scheme which the budget proposed to resolve cases emanating from retrospective amendment of tax laws made in 2012. The one-time Direct Tax Dispute Resolution Scheme is aimed at resolving cases pending in any Court or Tribunal, Arbitration or mediation under the Bilateral Investment Protection Agreement (BIPA). It will provide a stable and predictable taxation regime, said Mr. Jaitley.\n\n“As per the existing law, these companies are liable to pay everything, including principal tax, interest and penalty… now they can simply pay off principal amount and entire interest and penalty can be waived off,” Mr. Jaitley told reporters. The government expects that the scheme will help to hasten the resolution of the outstanding issues between the tax department and companies such as Vodafone and Cairn following notices for multi-billion dollar tax liabilities.", 
    "section": "national", 
    "title": "‘Compliance window remedies flaws in 1997 scheme’", 
    "subsection": "general", 
    "date": "2016-03-01"
}