{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "Police contend the two accused are required for further probe to unearth the ‘larger conspiracy’\n\nThe remand proceedings of JNU students Umar Khalid and Anirban Bhattacharya were conducted at an undisclosed placein New Delhi.— FIle photo: AFP\n\nThe police custody of JNU students Umar Khalid and Anirban Bhattacharya, facing sedition charges in connection with a controversial event organised on the university campus, was extended by one more day on Monday after the police contended that they were required for further investigation to unearth a “larger conspiracy”.\n\nThe remand proceedings were conducted at an undisclosed place, where the two students were produced before a Metropolitan Magistrate on the expiry of their earlier police remand. The prosecution said the Special Cell of Delhi Police, to which the case has been transferred, required some time to interrogate the students.\n\nUmar and Anirban, who have been in police remand since they surrendered on February 24, were interrogated in the presence of JNU Students’ Union president Kanhaiya Kumar, who was arrested earlier, to obtain the details of the February 9 event organised against the hanging of Parliament attack convict Afzal Guru.\n\nThe police custody of JNU students Umar Khalid and Anirban Bhattacharya, facing sedition charges in connection with a controversial event organised on the university campus, was extended by one more day on Monday after the police contended that they were required for further probe in order to earth the “larger conspiracy”.\n\nThe remand proceedings were conducted at an undisclosed place, where the two students were produced before a Metropolitan Magistrate on the expiry of their earlier police remand.\n\nThe prosecution said the Special Cell of Delhi Police, to which the case has been transferred, needed some time to interrogate the two students. Umar and Anirban, who have been in police remand since they surrendered on February 24, were interrogated in the presence of Kanhaiya, who was arrested earlier, to get the details of the February 9 event.\n\nPTI reports:\n\nMeanwhile, another JNU student, Ashutosh Kumar, was on Monday questioned in connection with the sedition case for the second time, with investigators, including sleuths of the Delhi Police’s Special Cell, interrogating him together with Umar Khalid and Anirban Bhattacharya in a south Delhi police station.", 
    "section": "national", 
    "title": "Custody of students extended by a day", 
    "subsection": "general", 
    "date": "2016-03-01"
}