{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The government on Monday allocated Rs. 2,49,099 crore for the defence sector for the year 2016-17, which is 11 per cent more than the revised estimates of last year. The allocation does not include defence pensions as well as certain civil expenses of the Defence Ministry.\n\nWith inflation pegged at 4.8 per cent, the real increase in budget over the revised estimates of last year will be 6.2 per cent.\n\nThe capital allocation for the Defence Ministry is Rs. 86,340 crore, of which Rs. 78,587 crore capital allocation is for the three services for procuring new weapons systems and Rs. 7,753 crore is for other agencies. The Ministry returned Rs. 13,188 crore from its allocated budget last year because contracts could not be concluded in time.\n\nFor the three services, the capital allocation has gone up only marginally from Rs. 74,300 crore spent last year to Rs. 78,587 crore allocated this year. In fact, it is less than the budget estimates of last year which was Rs. 85,894 crore.\n\nThe budget document states that the demands for grants of the Defence Ministry have been rationalised in budget 2016-17 for a clear and consolidated depiction of defence expenditures. For this, a two-fold action has been taken.\n\nIt includes reducing the number of demands for grants and shifting certain provisions on non-core activities to defence (civil) demand. “The revenue component of defence (services) is estimated at Rs. 1,62,759 crore in Budget Estimate 2016-17,” the document said.\n\nAmit Cowshish, former Financial Advisor (Acquisition) in the Defence Ministry and Distinguished Fellow at Institute for Defence Studies & Analysis, explained that the entire defence budget usually has eight demands under which allocation is made, which has now been merged under four heads.\n\nMost of the increase in the budget allocation is in the revenue stream to cater to the impending implementation of the 7th Pay Commission.\n\nDefence pensions saw a huge jump of about Rs. 12,000 crore from last year to Rs. 82,332 crore due to the implementation of One Rank One Pension.", 
    "section": "national", 
    "title": "Defence allocation marginally up", 
    "subsection": "general", 
    "date": "2016-03-01"
}