{
    "author": [], 
    "text": "The budget should release robust development forces all round to push growth beyond the 7-7.75 per cent anticipated by the Economic Survey. It has been carefully crafted initially to meet the aspirations of the weaker sections and indirectly to enable industry to return to growth and profitability.\n\nThe Union Budget has given close attention to improvement in the quality of jobs by providing for education, skill development and health, to resolving actual problems of the farmers and to the needs of transportation which can ease and lower costs. Education and health are the software of development and most countries that have developed fast have prioritized these two sectors. With education and health people can go in for better quality jobs with higher incomes.\n\nAgriculture has received Mr. Jaitley’s special attention. That is because in the past two years monsoon was deficient and production declined. Apart from the agricultural credit which is targeted at Rs.9 lakh crore, investment will be made in irrigation which should cover 28.5 lakh hectares, and the provision for MNREGA, will double farmers’ income. Similarly, big investment has been planned for transportation.\n\nTotal outlay on roads and rails will be Rs.2.8 lakh crore. Additionally, 160 airports and air strips will be revived to smoothen travel to smaller cities.\n\nIt is undoubtedly encouraging that 100 per cent electrification of villages will be achieved by 2018. This will improve productivity and incomes in the farming community.\n\nWhile these investments are desirable and necessary by themselves, they will have a very favourable secondary effect. Surely, the investment will create demand for a variety of goods and services and the income in the hands of workers and farmers generate consumer demand for industry as well.\n\nThis will help industry to utilize capacities better and induce private sector investment.\n\nProposed investment in the public and private sectors was over Rs.17 lakh crore five years back. It has crawled down to Rs.4 lakh crore now.\n\nWhat is more, private investment which usually exceeded public sector investment had fallen because of shortage of demand which resulted in excess capacities in industry. Mr. Jaitley’s budget is designed to generate that demand from different sectors and enable industry to grow faster.\n\nThe finance minister has reduced the rate of corporate taxation to 25 per cent for new companies without any change in the taxation of existing companies. The facilities provided for ‘Make in India’ will increase the share of Industry in GDP and generate 100 million jobs.\n\nThis year’s Union Budget is bound to have a very favourable impact on the economy", 
    "section": "national", 
    "title": "Demand-side growth", 
    "subsection": "general", 
    "date": "2016-03-01"
}