{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Hindu joins campaign for road safety through students\n\n(From right) Dr. S. Rajasekaran, Chairman, Department of Orthopaedics and Director of Ganga Hospitals, Inspector-General of Police C. Sridhar, and Chairman of Kasturi and Sons Limited N. Ram interacting with a student at a road safety programme in Coimbatore on Monday.— Photo: S. Siva Saravanan\n\nThe Hindu on Monday joined hands with the organisers of the Road Safety Project — ‘Let the Change Begin in Schools’ campaign here to take the message across Tamil Nadu and other States in a phased manner. The initiative is meant to turn children into ‘policemen’ and get their family members to abide by road rules.\n\nThe announcement was made by N. Ram, Chairman, Kasturi and Sons Limited, at a road safety programme organised at the Stanes Higher Secondary School here on Monday. The road safety project was launched earlier this year by Round Table India, Ganga Hospital, Coimbatore City Police and the Ladies Circle, to reduce road accidents by educating parents through their children.\n\nExpressing confidence that education and awareness could bring down more than 50 per cent of road accidents, Mr. Ram spoke on the important role played by the media to take the message to the masses.\n\nHe said the campaign would be initially taken to Chennai, Madurai and Tiruchi. He stressed on the need to prepare a training module to make children powerful tools for the campaign by becoming policemen at home. Mr. Ram also asked organisers to highlight road safety at the ‘Car Free Sundays’ initiative of The Hindu on N.S.R. Road here.\n\nInspector General of Police (West Zone) C. Sridhar said Tamil Nadu recorded the most number of road accidents in India. Stating that an average of 66,000 accidents were reported in the State annually, he added that 18,000 lives were claimed in accidents.\n\nAccording to him, 90 per cent of the accidents were due to the fault of the driver — driving while using mobile phones and drunken driving.\n\nEarlier, in an interactive session, S. Rajasekaran, Chairman, Department of Orthopaedics and Director of Ganga Hospitals, made a video presentation on accidents, their causes and how they could be prevented. He said by avoiding signal-jumping, over-speeding and mobile phones while driving, and by wearing seatbelts and helmets, deaths caused by accidents could be avoided.\n\nAdministering an oath, asking students to take this message to their parents and other vehicle users, he also answered queries raised by the students. Around 2,500 students of the school participated in the programme.\n\nChairman of the school James J. Gnanadoss, Correspondent Mercy Oommen and Honorary Secretary A. Ebenezer Jeyakumar, and representatives of Round Table and Ladies Circle were present at the event. National Secretary of Round Table India Christopher Arvinth also spoke.\n\nThe Hindu joins campaign for road safety through students", 
    "section": "national", 
    "title": "Education, awareness can bring down over 50 per cent of accidents: N. Ram", 
    "subsection": "general", 
    "date": "2016-03-01"
}