{
    "author": [], 
    "text": "Atacama Desert, the driest place on the planet will gives clue to life on the Red Planet\n\nA Mars-like laboratory in the “driest place on Earth” is helping NASA scientists study the limits of life and test drilling and life-detection technologies that might be sent to Red Planet in the future.\n\nIn a harsh environment with very little water and intense ultraviolet radiation, most life in the extreme Atacama Desert in Chile exists as microbial colonies underground or inside rocks.\n\nAccording to researchers at NASA, the same may be true if life exists on Mars.\n\nThe Atacama Rover Astrobiology Drilling Studies (ARADS) project has just completed its first deployment after one month of fieldwork in the hyperarid core of the Atacama Desert.\n\nThe extreme dryness the soil in this region is remarkably similar to that of the Red Planet.\n\nDr Brian Glass, NASA space scientist and principal investigator of the ARADS project, “Having both subsurface reach and surface mobility should greatly increase the number of biomarker and life—target sites we can sample in the Atacama.”\n\nBiomarkers\n\nThe cold and dry conditions on Mars open the possibility that evidence for life may be found below the surface where negative effects of radiation are mitigated — in the form of organic molecules known as biomarkers.\n\nBut until humans set foot on the Red Planet, obtaining samples from below the surface of Mars will require the ability to identify a location of high probability for current or ancient life, place a drill, and control the operation robotically.\n\nMore than 20 scientists from US, Chile, Spain and France worked in dry conditions with high winds during the first ARADS field deployment.\n\nTheir work was primarily conducted at Yungay Station, a mining ghost town in Atacama, owned by Antofagasta University in Chile. — IANS\n\nThe Atacama Desert is helping scientists find out if it is possible to live on the Red Planet", 
    "section": "national", 
    "title": "Exploring a Mars-like place on Earth", 
    "subsection": "general", 
    "date": "2016-03-01"
}