{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "Union Finance Minister Arun Jaitley introduced a Rs. 2,000-crore scheme for providing cooking gas cylinder connections to poor households.\n\nIn his budget speech, he said that using an open fire in the house was akin to smoking 400 cigarettes and was one of the biggest causes of poor health in families below the poverty line.\n\nHe announced a scheme to protect the poor from high healthcare costs with a cover of Rs. 1 lakh and an additional cover of Rs. 30,000 for senior citizens.\n\nHe also announced a plan to list public sector general insurance companies and a new policy for strategic sales as well as making public sector enterprises take up fresh investments. While he promised to raise outlays for social sector schemes, he also said the government would introduce a Bill to give legislative backing to the Aadhaar scheme for identifying residents on the basis of their biometrics.\n\nGiving the Unique Identification programme legal teeth would help the government expand its ambit and possibly, make it mandatory for delivering benefits under various social welfare programmes and schemes. This would facilitate better targeting of subsidies over time. The Supreme Court had earlier asked the government not to make Aadhaar mandatory for such benefits.\n\n“The FM has missed a significant opportunity to present a breakthrough budget. It is essentially an incremental budget with marginal adjustments in expenditure provisions and revenue estimates,” said D.K. Srivastava, chief policy adviser at EY, adding that the decision to stick to fiscal consolidation appears laudable, but is dependent more on optimistic assumptions regarding nominal GDP growth and reduction in capital expenditure relative to GDP.\n\n“This implies that the government is not actively pursuing any significant fiscal stimulus through public investment. A substantial reduction in the subsidy provisions would have spelt the government’s resolve to create fiscal space for augmenting capital expenditure… The political cycle and proximity of State and General Elections may not present such an opportunity again,” he said.\n\n‘Fiscal consolidation planned will not divert from the aggregate demand in the economy’", 
    "section": "national", 
    "title": "Finance Minister has done magic, says CEA", 
    "subsection": "general", 
    "date": "2016-03-01"
}