{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Only two of them had defensive wounds, others got no chance as he went from room to room’\n\nWorking through the maze of 14 murders to find a motive, the Thane police have reconstructed Sunday’s sequence of events in Warekar Manzil. The accused Hasnain Warekar walked from room to room slitting throats in a single swipe of the dagger while his family slept, the police said.\n\nHasnain is accused of killing 14 members of his family before killing himself in the early hours of Sunday. Only his younger sister Subiya survived the massacre, and is in hospital in a state of severe shock.\n\nPolice said they tried to reconstruct the incident, based on the injuries on the bodies of the victims and on Hasnain’s experience with the ‘qurbani’ dagger.\n\n“With the exception of Hasnain’s father Anwar, all other victims died from a single, deep cut in their throats. Only Anwar and Subiya had defensive wounds on their fingers, which show that the others did not get a chance to even defend themselves. The state of the bodies also indicates that Hasnain started from the first floor and then came to the ground floor, killing each of his victims as he advanced,” said Joint Commissioner of Police Ashutosh Dumbare, Thane police.\n\nInquiries among Hasnain’s friends and neighbours have revealed that Hasnain was well experienced in the use of the ‘qurbani’ dagger. He would slaughter goats during Eid, and would also help others whenever they needed it done.\n\nInvestigations revealed that he had not been going to work for the last two to three months. “Hasnain used to work in a private firm in Mulund earlier, and then in a company in Navi Mumbai. However, for the last two to three months, he was either unemployed or working from home. We are trying to find out more about this,” Mr. Dumbare said.\n\nThe police are making inquiries at the Pardesi Baba dargah in Thane where Hasnain was a regular visitor, and his father was a trustee, finding out who he met regularly during his visits there.\n\nOfficials added that the incident had left everyone who knew Hasnain shocked. “His former employers told us that he wouldn’t hurt even a fly. No one in the locality has anything to say that indicates otherwise,” said Mr Dumbare.\n\nThe police have sent samples of left-over food taken from the house as well as samples from the viscera of the victims for chemical analysis. Hasnain’s laptop and cell phone have also been sent for scrutiny.", 
    "section": "national", 
    "title": "Hasnain slit his victims’ throats in one swipe of ‘qurbani’ dagger: police", 
    "subsection": "general", 
    "date": "2016-03-01"
}