{
    "author": [
        "Gautam S"
    ], 
    "text": "Altaf Warekar, cousin of Thane mass murder accused Hasnain Warekar, is struggling to come to terms with Sunday’s turn of events. Altaf (36), who stays close to where Hasnain lived, was one of the first to reach the spot after Subiya, the sole survivor of the massacre, started screaming for help. Altaf’s shock is rooted in the fact that he had met Hasnain only hours earlier, and he had seemed perfectly normal.\n\n“I met Hasnain around 11.30 pm on Saturday, when I was on my way to meet some friends. He was walking towards his house with a plastic bag. He said he had bought soft drinks as there was a daavat under way. His daavats were well known … he would call his sisters home on most weekends,” Altaf told The Hindu .\n\nIn the early hours of Sunday, Altaf was one of the few to wake up after Subiya started screaming for help through the ground floor window. Alarmed, he ran to the window to check what was happening. Subiya told me: “Bhaijaan ne sabko maar diya, woh mujhko bhi maar denge (brother has killed everyone, he will kill me too). I immediately thought of the calm, silent person I had met only hours earlier. I told her to come out and she said she was afraid to move as Hasnain was standing near the front door with the qurbani dagger in his hand,” Altaf said. For nearly half-an-hour, Altaf and his friends pulled a part of the window grille loose, while two others sped to the Kasar Wadavli police station on a motorbike. Subiya was pulled out of the window in a near unconscious state, while the police sent armed personnel to the spot in case Hasnain tried to attack anyone who tried to enter. Hasnain, however, had killed himself by then.\n\nHasnain never\n\ngot into a fight\n\nall his life, says\n\nAltaf Warekar,\n\nhis cousin", 
    "section": "national", 
    "title": "‘He looked normal hours before incident’", 
    "subsection": "general", 
    "date": "2016-03-01"
}