{
    "author": [
        "Piyush Pandey"
    ], 
    "text": "Move to revive investments with the participation of private sector\n\nFinance Minister Arun Jaitley on Monday announced a record budgetary allocation of Rs. 2.21 lakh crore for infrastructure sector, in a crucial move to revive investments in the sector with the participation of the private players.\n\nThe roads sector alone has been allocated Rs. 97,000 crore as the government plans to award 10,000 kilometres of new road projects in FY17, including Rs. 19,000 crore earmarked for rural roads under the Pradhanmantri Gram Sadak Yojna.\n\nEnthused with the budget, Adani Group Chairman Gautam Adani said, “The focus on improved infrastructure through network of roads, rail, ports and airports will provide impetus for enhanced growth and in turn, generate employment. Targeted focus on affordable housing with tax exemptions for developers and individuals will auger well for the sector,”\n\nElaborating on the legacy problem in the roads sector that his government had inherited, Mr. Jaitley said about Rs.1 lakh crore worth road projects had got stalled.\n\n“I am happy to announce that our efforts have put back on track 85 per cent of these stalled road projects,” said Mr.Jaitley announcing upgradation of 50,000 kms of state highways in the next fiscal.\n\nManish Agarwal, Partner and Leader - Infrastructure, PwC India feels that several more initiatives were expected for infrastructure, particularly on implementation of Kelkar Committee recommendations to revive private investment.\n\n“The inability of the government to continue large scale financing of infrastructure is visible in the Budget and hence expect more announcements outside the Budget,” said Mr. Agarwal.\n\nThe finance minister announced a series of measures for modernising existing ports and building new ports along India’s east and west coasts. He said that initiatives are being introduced to reinvigorate infrastructure sector through Public-Private Partnership (PPP).\n\nC. Sasidhar – Managing Director, Krishnapatnam Port Company Limited, believes that the Budget reflects a very promising infrastructure and investment push with increased budgetary allocation for key infrastructure areas such as roads, railways and ports.\n\nThe initiatives are being introduced to reinvigorate the sector through\n\nPPP model", 
    "section": "national", 
    "title": "Infrastructure gets the much needed push", 
    "subsection": "general", 
    "date": "2016-03-01"
}