{
    "author": [
        "Manojit Saha"
    ], 
    "text": "‘The banks are putting in special efforts to effect recoveries with a focus on reviving stalled projects’\n\nThe government will infuse a capital of Rs.25,000 crore this financial year into state-owned banks, which are reeling under the burden of bad loans, and Finance Minister Arun Jaitley said additional funds, if needed, would be made available to overcome the stress of non-performing assets on their balance sheets.\n\n“We stand solidly behind these banks,” Mr. Jaitley said in the Parliament while presenting the Budget.\n\n“We are now confronted with the problem of stressed assets in public sector banks, which is a legacy from the past. Several steps have already been taken in this regard. We are not interfering in lending and personnel matters of the banks. Structural issues have been addressed in various sectors like power, coal, highways, sugar and steel.\n\nThe banks are putting in special efforts to effect recoveries with a focus on reviving stalled projects.”\n\nFor speedier resolution of stressed assets, the Debt Recovery Tribunals will be strengthened with focus on improving the existing infrastructure, including computerised processing of court cases, to support reduction in the number of hearings and faster disposal of cases, he said.\n\nMr Jaitley said the state-owned banks should be “strong and competitive.” “The Bank Board Bureau will be operationalised during 2016-17 and a roadmap for consolidation of public sector banks will be spelt out. “The process of transformation of IDBI Bank has already started. Government will take it forward and also consider the option of reducing its stake to below 50 per cent.”\n\nOn Sunday, the government had announced the setting up of Bank Board Bureau, headed by former comptroller general of accounts, Vinod Rai. The four-member BBB is independent of government and Reserve Bank of India.\n\nThe BBB is a crucial step because once it becomes operational, the government can distance itself from the process of appointments of chief executives and board members in this bank. Such a move was originally proposed by the P.J. Nayak Committee which was set up by RBI governor.\n\nAnalysts were disappointed that the government had not increased the amount for capital infusion in public sector banks.\n\nCapital infusion in public sector banks was kept unchanged at Rs 25,000 crore. Since bad loans have increased substantially in Oct-Dec quarter, following the Asset Quality Review of RBI, and expected to go up further, bankers expected between Rs.10,000 crore to Rs.15,000 crore additional capital infusion in 2016-17.\n\n“Although the FM did reiterate the Government’s commitment to the PSU Banks, the Budget has restricted the allocation for Bank recapitalization at the Rs. 25,000 crore that was announced in the Indradhanush, despite the rise in provisioning post Banks’ Q3FY16 results,” said Naresh Takkar, MD & Group CEO, ICRA Ltd.\n\n“The limited focus on the National Investment and Infrastructure Fund for funding investments is another key disappointment,” he added.\n\nFor speedier resolution of stressed assets, the Debt Recovery Tribunals will be strengthened", 
    "section": "national", 
    "title": "Infusion for state-owned banks falls short", 
    "subsection": "general", 
    "date": "2016-03-01"
}