{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The government on Monday defended India’s democratic institutions and diversity, in response to a February 26 letter that 34 US Congressmen had written to Prime Minister Narendra Modi, expressing “grave concern” about the threats to religious minorities in India.\n\n“It is unfortunate that these Members of Congress while applauding India as a pluralistic society with a longstanding commitment to inclusion and tolerance have chosen to focus on just a few incidents,” the Ministry of External Affairs said in a statement, explaining that incidents of intolerance in India are “aberrations”.\n\nThe Ministry of External Affairs had however, refused to comment on the Congressional Report on International Religious Freedom (USCIRF) in 2015 terming it an “internal” report.\n\nIn view of similar past examples, Monday’s detailed response from the MEA was noted by veteran diplomats who pointed out that the MEA had the option of ignoring the criticism as it was not made by a government body in the United States.\n\n“There have been stronger criticism of India in the past by the American caucuses and lobby groups. But we preferred not to respond unless the criticism reflected the opinion of the government of the United States,” said former Indian ambassador to the U.S., Lalit Mansingh, who pointed out that several lobbies are apparently at work in the American power corridors trying to highlight certain recent developments in India.\n\nEarlier, the MEA had downplayed the comments by the U.S. ambassador Richard Verma when the envoy had spoken about “freedom on campuses” indirectly supporting the agitating students of Jawaharlal Nehru University.\n\nHowever, in response to the letter from the 34 Congressmen, the MEA drew attention to the vibrant civil society, media, and other institutions that uphold and protect constitutional values of India.\n\n“India is proud of its status as the world’s largest democracy. The Indian Constitution guarantees fundamental rights to all its citizens,” said the Ministry of External Affairs.\n\nMEA downplays U.S. envoy’s comments on freedom on campuses", 
    "section": "national", 
    "title": "Intolerance an ‘aberration’, India tells the U.S.", 
    "subsection": "general", 
    "date": "2016-03-01"
}