{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Delhi Chief Minister Arvind Kejriwal’s car which was damaged after an attack in Ludhiana on Monday.— Photo: PTI\n\nDelhi Chief Minister and Aam Aadmi Party (AAP) convener Arvind Kejriwal’s car was pelted with stones by protesters in Ludhiana, Punjab, on Monday. Its windshield was broken.\n\nMr. Kejriwal, who escaped unhurt, said later that the ruling Akali Dal and the Congress were nervous. “My car attacked with sticks and stones in Ludhiana. Front glass pane broken. Badals n congress nervous? They can’t break my spirits,” Mr. Kejriwal tweeted soon after the attack.\n\nMr. Kejriwal was in Ludhiana on the last day of his five-day tour of Punjab to reach out to the State’s people ahead of the Assembly polls due in 2017.\n\nAAP blamed the ruling Akali Dal government in Punjab. “The police allowed the attackers to reach the security area from where the cavalcade of Delhi Chief Minister was to leave under a pre-planned conspiracy,” AAP’s Ludhiana zone coordinator Col. C.M Lakhanpal said. The SAD-BJP combine was frustrated with the public response to Kejriwal’s visits in all parts of Punjab, he said.\n\nMeanwhile, Punjab Congress chief Capt. Amarinder Singh lashed out at Mr. Kejriwal for trying to link Congress party workers with the attack. “Let me make it categorically clear that Congress has nothing to do with the attack.” The attack was condemnable, irrespective of who sponsored it. But AAP should desist from linking the Congress with the Akalis.\n\nCapt. Amarinder said given Mr. Kejriwal’s reputation of sponsoring attacks on himself for publicity, it was important to independently probe who was behind the incident in Ludhiana.\n\nThe Delhi CM\n\nsaid the ruling\n\nAkali Dal and\n\nthe Congress\n\nwere nervous", 
    "section": "national", 
    "title": "Kejriwal’s car pelted with stones in Punjab", 
    "subsection": "general", 
    "date": "2016-03-01"
}