{
    "author": [
        "Arun S"
    ], 
    "text": "Centre has decided to pay Employee Pension Scheme contribution of 8.33 per cent for all new employees\n\nFinance Minister Arun Jaitley announced several proposals in the Union Budget 2016-17 to boost the government’s Make in India (MII) initiative.\n\nTo help start-ups innovate, generate employment and be key partners in the MII programme, Mr.Jaitley proposed to back them through 100 per cent deduction of profits for three out of five years for start-ups set up during April 2016 to March 2019. He said Minimum Alternate Tax will apply in such cases.\n\nIn another initiative, Mr. Jaitley chose to follow advanced nations and proposed to grant foreign investors ‘Residency Status’ subject to certain riders. Currently, these investors are granted business visa only up to five years at a time, he pointed out.\n\nTo strengthen the MII initiative, there was an allocation of Rs.1,804 crore towards the scheme for Investment Promotion and Amended Technology Upgradation Fund.\n\nHe also proposed modification in Customs and Excise Duty structure to incentivise domestic value addition and push the MII campaign.\n\nChanges were proposed in Customs and Excise Duty rates on certain inputs, raw materials, intermediaries/components and other goods while several procedures were simplified.\n\nThis was done to bring down costs and improve competitiveness of the domestic industry in sectors like information technology hardware, capital goods, defence production, textiles, mineral fuels and mineral oils, chemicals and petrochemicals, paper, paperboard and newsprint as well as in Maintenance Repair and Overhauling (MRO) of aircraft and ship repair, Mr.Jaitley said. Also, to incentivise the employers to recruit unemployed persons and bring into the books the informal employees and in turn, ensure new jobs are created in the formal sector, the Centre has decided to pay the Employee Pension Scheme contribution of 8.33 per cent for all new employees enrolling in EPFO for the first three years of their employment.\n\nTo channelise this intervention towards the target group of semi-skilled and unskilled workers, the scheme will be applicable to those with salary up to Rs. 15,000 per month, Mr.Jaitley said. He said a budget provision of Rs. 1,000 crore had been made for this scheme. M.S. Mani, Senior Director, Deloitte in India, said while the government is yet to ensure the passage of the Goods and Services Tax Bill in Parliament, which is crucial for the success of MII, it has marginally increased Customs Duty on finished goods in some cases while reducing the duty on raw materials/components to push local manufacturing.\n\nAlso, maintaining Excise Duties has given a fillip to manufacturing in India as a move to increase such duties would have increased manufacturing costs.\n\nMr.Mani said a move which would indirectly push the MII initiative is the restoration of the benefit of service tax exemption, which was removed last year in several cases. This will help reduce the costs of building canals, dams, hospitals, educational institutes, airports and ports.\n\nChanges have been proposed in Customs and Excise Duty rates on certain inputs", 
    "section": "national", 
    "title": "Make In India initiative gets a leg up", 
    "subsection": "general", 
    "date": "2016-03-01"
}