{
    "author": [
        "Jessica Aldred"
    ], 
    "text": "The Black Mambas, an all-female award-winning patrol, has managed to achieve a reduction in rhino poaching in South Africa\n\nRhinos are at risk from being poached for their horns.— File photo: Reuters\n\n“The Black Mambas are winning the war on poaching,” insists Siphiwe Sithole. “We have absolutely zero tolerance for rhino poaching and the illegal wildlife trade. The poachers will fall — but it will not be with guns and bullets.”\n\nSithole and Felicia Mogakane are members of South Africa’s Black Mambas, the world’s first all-female anti-poaching unit that has captured the public’s imagination.\n\nBut it’s their success in reducing rhino deaths and breaking down the barriers between poor communities and elite wildlife reserves that is their most powerful weapon in the war on poaching, and has seen them pick up their second international conservation award from UK charity Helping Rhinos. The award recognises projects “with an inspiring and innovative approach” that have shown positive results in protecting rhino populations.\n\nSince forming in 2013, the Black Mambas have seen a 76 per cent reduction in snaring and poaching incidents within their area of operation in Balule nature reserve in the country’s north-east.\n\nAs well as the famous big five of rhino, lion, elephant, buffalo and leopard, the 40,000-hectare private reserve is home to zebra, antelope, wildebeest, cheetah, giraffe, hippos, crocodiles and hundreds of species of trees and birds.\n\nThousands of snares to catch animals for bushmeat have been removed, 10 poacher camps destroyed, three bushmeat kitchens put out of action and six poachers arrested.\n\nSuch is their success that South Africa’s national parks authority is looking at replicating the model, with plans for another team of six female rangers.\n\nLast year the Mambas won the Champions of the Earth prize, the UN’s highest environmental honour, awarded to those showing outstanding courage in fighting the illegal wildlife trade at community level.\n\nEncouragement\n\n“Winning these awards are good because it’s about knowing that people from South Africa love and appreciate what we are doing and they are so happy that there are Mambas,” says Mogakane, 28, who has been with the team from the start. “Unlike some years ago, when they used to say this job is for men, now there are women who are working to protect the wildlife. It means a lot to us and makes us continue to do our job because we know that people are behind us, supporting us.”\n\nThe Mambas were founded by Craig Spencer, head warden of Balule, to act as an unarmed but visible frontline presence in the ongoing battle against the poaching of rhino and other endangered species — like the idea of “bobbies on the beat”.\n\nThe 26 Mambas, all from disadvantaged communities on the border of the park, have been given six weeks of paramilitary training and wildlife education and work alongside 29 armed guards and an intelligence team that seeks to stop the poachers before they can kill. People come for rhinos, because they want to get rich, drive some fancy cars and build a nice house.”\n\nSouth Africa has the largest population of rhinos in the world, estimated at 19,000. The country has seen a huge spike in the rate of rhino poaching in recent years, with many of these incidents taking place in protected national parks like Kruger.\n\nLast year 1,175 rhinos were poached — the first year that numbers had not risen since the alarming trend began after 2007, when just 13 were killed.\n\nRhino horn has become so valuable that conservationists warn the species could become extinct in 10 years. — © Guardian Newspapers Limited, 2016\n\nBeing role models for “social upliftment”, and educating the local community is how the war on poaching will be won — not with guns and bullets, they say.", 
    "section": "national", 
    "title": "Mambas with a sharp bite!", 
    "subsection": "general", 
    "date": "2016-03-01"
}