{
    "author": [
        "Manojit Saha"
    ], 
    "text": "Six member committee proposed; RBI governor to have casting vote\n\nBond prices rallied after the government showed its resolve to maintain fiscal discipline as it retained the fiscal deficit target of 3.5 per cent for 2016-17. The yield on the 10 year benchmark government bond closed 15 bps lower at 7.62 per cent while the rupee appreciated 21 paisa to end the day at 68.42 per dollar.\n\n“The government posted a pleasant surprise by sticking to the pre-announced fiscal deficit target of 3.5% of GDP. This move is likely to have a far reaching impact on the macro-economy by preserving stability. More importantly, today's show of fiscal discipline makes it easier for the RBI to continue with its accommodative stance,” according to a report by HSBC which added that it expects a 25 bps repo rate cut.\n\nThe government has pegged its net borrowing for the next financial year at Rs.4.25 lakh crore, which also cheered the bond market.\n\nAfter cutting interest rates by 125 bps to 6.75 per cent between January 2015 and September 2015, the central bank paused for two consecutive policies. During the last policy review on 2 February, RBI had said controlling spending along with structural reform would open up further room for monetary accom- modation.\n\nMarket participants expect RBI will not wait for the next policy review in April for the rate action and it should happen any time soon.\n\n“As the government remains on the fiscal consolidation path, RBI may cut interest rates. However, it will likely be the last cut in this easing cycle and investors may be keen to reduce long exposure as the end of easing cycle approaches,” according to Citigroup statement.\n\nRBI which met its inflation target of six per cent of January 2016, has set five per cent as the target for March 2017.\n\nThe other important announcement that will be liked by RBI governor Raghuram Rajan is the formation of monetary policy committee.\n\n“The RBI Act 1934, is being amended to provide statutory basis for a Monetary Policy Framework and a Monetary Policy Committee through the Finance Bill 2016. A committee-based approach will add lot of value and transparency to monetary policy decisions,” Finance Minister Arun Jaitley said. A six-member monetary policy committee has been proposed in the Finance Bill, with three members from RBI, including the governor and the deputy governor in-charge of monetary policy framework.", 
    "section": "national", 
    "title": "Market expects 25 basis points cut", 
    "subsection": "general", 
    "date": "2016-03-01"
}