{
    "author": [
        "Lalatendu Mishra"
    ], 
    "text": "Eating out will be more expensive\n\nEven while playing Santa to the low income groups and farmers in Union Budget 2016-17, Finance Minister Arun Jaitley has increased indirect taxes, thus putting an additional financial burden on the middle class and consumers in general. The extent of the burden depends on what the individual consumer buys, both in terms of goods and services.\n\nAccording to experts, the indirect taxes will put an additional burden of Rs. 20,600 crore on consumers in the coming financial year.\n\nPrices of tobacco products, including cigarettes, will go up due to the increase in excise duties on tobacco products other than beedi from 10 to 15 per cent. Power tariff may also go up as the government has increased the ‘Clean Environmental Cess’ on coal, lignite and peat from Rs. 200 per tonne to Rs. 400 per tonne.\n\nThough the Finance Minister has not increased the service tax rate, which is 14.5 per cent in 2015-16 compared to 12.36 per cent last year, he has introduced a few new cesses such as Krishi Kalyan Cess of 0.5 per cent on all taxable services. This will make eating out expensive as the service tax will now be levied at 15 per cent from June onwards.\n\nCostlier phone bills\n\nConsumers will also have to spend more on telephone bills, air tickets, insurance premium and buying property, to name a few. “The introduction of new cesses, in addition to those introduced in the previous year, runs contrary to expectations and appears regressive,” said Rajeev Dimri, Leader, Indirect Tax, BMR & Associates LLP.\n\nMobile phones manufactured in India are set to become costlier as customs and excise duty exemptions are withdrawn on accessories such as charger/ adapters, battery and wired headsets/ speakers. They should, however, continue to be cheaper than imported phones.\n\nConsumer premises equipment, including routers, modems, set-top boxes and CCTV cameras, manufactured in India are set to become cheaper. The decrease in input cost should reduce the prices of footwear, paper, sanitary towels, tampons, napkins, diapers and microwave oven, Mr. Dimri said.\n\n“No major tinkering has been done as can be observed from the unchanged tax structure for consumer related sectors such as consumer durables. Customs duty on input materials like mineral fuels and certain chemicals has been reduced,” said Rajesh Mokashi, deputy managing director, CARE Ratings.\n\nExcise duty on jewellery\n\nIn line with the Make in India initiative, the Finance Minister has made changes in customs and excise duty rates on certain inputs to reduce costs and improve competitiveness of some domestic industries. “Jewellery and branded garments will be subjected to Central Excise Duty of 1 per cent and 2 per cent respectively (without availing of the CENVAT Credit) ,” said Dinesh Agrawal, Executive Director, Khaitan & Co.\n\n“We are apprehensive about the introduction of excise duty on jewellery products,” said Praveenshankar Pandya, chairman, Gem & Jewellery Export Promotion Council. “In India, jewellery is largely produced by the SMEs and they are not equipped to follow the rigid excise norms,” he said.\n\nWe are apprehensive about the introduction of excise duty on jewellery products\n\nIndirect taxes will put an additional burden of Rs. 20,600 crore on consumers", 
    "section": "national", 
    "title": "More agony for the middle class", 
    "subsection": "general", 
    "date": "2016-03-01"
}