{
    "author": [
        "Damini Nath"
    ], 
    "text": ": It may be too late to do anything about the current water crisis now, but Delhi can prevent a repeat by reviving its neglected lakes, strictly implementing rainwater harvesting and recycling water.\n\nWith the main sources of Delhi's water — the Yamuna and the Munak Canal — being polluted and damaged respectively, about 35 per cent of the water supply has been hit. Environmentalists say that the water shortage currently being faced by the Capital could have been prevented, or at least reduced in intensity, had the government acted earlier.\n\nVinod Jain, a water conservation activist, says the Central Ground Water Authority had said in 1998 that 200 million gallons per day (MGD) of water could be saved in the floodplains around Delhi.\n\n“But the government did not act then. They allowed construction in the floodplains. They never thought that such a crisis would happen. They did not value the floodplains,” said Mr. Jain.\n\nBut, there is still time. Mr. Jain says if reservoirs are made along the floodplains, they can be used to store the heavy flows in the Yamuna in the monsoon season. About 35 MGD can be added to Delhi’s supply, which on an average is 890 MGD.\n\nManoj Misra, the convenor of the Yamuna Jiye Abhiyaan, says Delhi needs to break its dependence on Haryana when it comes to raw water supply.\n\n“Delhi must ensure that it takes its share of Yamuna water through the river, not the canal. The river cannot be damaged, like the Munak Canal has been,” said Mr. Misra.\n\nApart from that, he reiterated the need for off-rover reservoirs to store water.\n\n“There is land for reservoirs at Palla and both upstream and downstream of Wazirabad. These should be used to store Delhi's own share of water during the monsoon. The areas can be developed as recreational hubs, and the water can be used in emergencies,” said Mr. Misra.\n\nDelhi also had about 800 natural water bodies that have been forgotten over the years. Mr. Misra says the water bodies should be revived naturally, without any concretisation, so that the water holding area as well as the catchment is secured.\n\nIn addition, there are 201 natural drains that can be revived in order to recharge groundwater.\n\nMr. Jain said one of the biggest flaws in Delhi's water management has been the lax implementation of the rainwater harvesting guidelines in place since 2000.\n\n“There is no agency seriously implementing the rules. The municipal corporations are supposed to c check as rainwater harvesting is mandatory in the building bye-laws don't bother and the State government doesn't have the machinery to enforce the rules,” said Mr. Jain.", 
    "section": "national", 
    "title": "Natural water bodies, rainwater harvesting could prevent crisis", 
    "subsection": "general", 
    "date": "2016-03-01"
}