{
    "author": [
        "Sidhartha Roy"
    ], 
    "text": "A total of 46 vending machines are going to be installed at nine railway stations in Delhi.Photo: Special Arrangement\n\nSoon, train passengers will be able to get safe drinking for Rs. 1 to Rs. 5 from water vending machines being installed at the New Delhi railway station.\n\nA few of these ‘Water Points’ have already been installed at the station where passengers will be able to access safe, non-packaged drinking water as per the World Health Organisation (WHO) standards.\n\nThe water vending machines, being installed by the Indian Railway Catering and Tourism Corporation (IRCTC), will dispense drinking water that will be purified by Reverse Osmosis, UV Sterilised and a seven stage filtration process. LED display screens on the machine will show the cost and quality of the water to customers.\n\n“A couple of these water vending machines have come up at the New Delhi railway station and will become operational very soon,” IRCTC spokesperson Sandip Dutta told The Hindu .\n\nRail passengers can get 300 ml drinking water for Re. 1, 500 ml for Rs. 3, 1 litre for Rs. 5, 2 litre for Rs. 8 and 5 litre for Rs. 20. Passengers can also get pet jars on some extra payment.\n\nA total of 46 water vending machines are going to be installed at nine different railway stations of the Delhi Division of Northern Railway.\n\nThe division had sent its plan on the location where these machines would be installed to the IRCTC.\n\nThe stations in Delhi are part of the nearly 1,200 railway stations across the country where around 5,000 water vending machines would be set up.\n\nThe Delhi Main or Old Delhi railway station would get the maximum number of these machines – 12 – followed by nine at New Delhi railway station, eight at Hazrat Nizamuddin, four at Sarai Rohilla, and three at the Anand Vihar railway station.\n\nSimilar machines would also be installed at railway stations in Gurgaon, Ghaziabad and Rohtak.\n\nThe Railway Ministry is planning to select franchisees for installation of machines and the tendering process is on. The Railways would also ensure that the minimum amount of water is wasted in the reverse osmosis process and the waste would be used in toilets or for other non-potable purposes.", 
    "section": "national", 
    "title": "New Delhi railway station gets water vending machines", 
    "subsection": "general", 
    "date": "2016-03-01"
}