{
    "author": [
        "Ashish Rukhaiyar"
    ], 
    "text": "Participants keen for new index trading options\n\nUnion Finance Minister Arun Jaitley has indicated that the Securities and Exchange Board of India (SEBI) will soon introduce new products in the commodity derivatives segment, which was brought under the Board’s regulatory purview in September last year.\n\nCommodity market participants say that the government statement will only increase the pace at which SEBI will work toward introducing new products that may include options contracts, index-based products and also weather derivatives. Participants have been demanding more products to further deepen the segment that currently has only future contracts for trading.\n\n“I think options contract is the most immediate product that SEBI could look at allowing. The regulator could start with a plain vanilla options contract. Thereafter, it could look at trading in commodity indices as well,” said Girish Dev, managing director and chief executive officer, Geofin Comtrade Ltd.Given SEBI’s track record, it will be safe to introduce products like options, weather derivatives and index-based trading products,” said Naveen Mathur, associate director with Angel Broking Ltd.P.K. Singhal, joint managing director, MCX, said he was hopeful that in the next financial year, SEBI will allow products such as options and trading in indices and intangibles.\n\nSamir Shah, managing director and chief executive officer, NCDEX says that introduction of new derivative products is a positive step for the development of the commodity markets that will help expand the product basket and make it attractive for new participants.\n\nMr Singhal, however, added that he was disappointed that the government did not accede to the industry’s long pending request for reduction, if not the elimination, of commodity transaction tax (CTT), which is levied on all non-agricultural commodities. The CTT has increased the cost of trading in India , he said.", 
    "section": "national", 
    "title": "New commodity derivative options likely from SEBI", 
    "subsection": "general", 
    "date": "2016-03-01"
}