{
    "author": [
        "Vikram Doshi"
    ], 
    "text": "The Finance Minister presented this year’s Budget in the backdrop of a healthy growth rate, significant bounty from oil price reduction and a general perception of a stable India in a sea of global economic uncertainty. Given this, the aam aadmi was hoping that the Minister would add firepower to his pocket through tax benefits.\n\nFrom an individual standpoint, there are some giveaways and reliefs. For taxpayers having an income up to Rs. 5 lakh, there is more money in the pocket in the form of an additional tax rebate of Rs. 3,000 under Section 87A.\n\nFor self-employed individuals who generally don’t have the option to claim a house rent allowance like salaried individuals, the limit of deduction available for rent paid under Section 80GG has been increased to Rs. 60,000 from Rs. 24,000 per annum, provided they do not own a house. With expanding housing being an important agenda for the government, there is some cheer for first-time house buyers.\n\nThere is an additional tax deduction of Rs. 50,000 available annually on account of interest paid on housing loans, subject to the condition that the amount of loan should not exceed Rs. 35 lakh and the house should not cost more than Rs. 50 lakh. This is in addition to the Rs. 2 lakh deduction already available.\n\nRetirement funds\n\nThe treatment of retirement sums continues to go through tweaking and adjustment. Now withdrawals from the National Pension Scheme will have some benefit with 40 per cent being tax exempt. On the other hand, fresh contributions to Employee Provident Fund will be subject to the exempt-exempt-taxable model with 60 per cent being taxable at the time of withdrawal.\n\nAlso, the employer portion of contribution, which was exempt till now, will be exempt only to the extent of Rs. 1.5 lakh per annum.\n\nThe above will provide some cheer to individuals having a particular level of income. The superrich unfortunately do not have much to cheer. The surcharge for individuals earning more than Rs. 1 crore has been increased from 12 per cent to 15 per cent. Therefore, on a broad principle basis in some cases, a company earning the same income as such an individual will be subject to a lower rate of 33.22 per cent as compared to 35.54 per cent for such an individual.\n\nIn addition, if someone receives dividends in excess of Rs. 10 lakh, such dividends will now be subject to an additional tax rate of 10 per cent on a gross basis. They were exempt till now!\n\nThe government is once again trying to address unaccounted-for income in the hands of individuals and others by providing a scheme for voluntary disclosure. This scheme provides for a tax of just 30 per cent with 7.5 per cent surcharge and 7.5 per cent penalty, leading to effective tax of 45 per cent. This is a much attractive proposition since there is protection from prosecution and virtually no interest payment involved. This might also be almost the last time the government introduces such a scheme.\n\nOne of the most expected tax relief was the increase in income limits and allowance limits in line with inflation. Thus there was an expectation of much lesser taxation. In contrast, the above measures are stark appearing to provide marginal relief, if any.\n\nViews expressed are personal. Chartered accountants Sumit Gupta and Vivek Gupta contributed to the article.\n\nThe government is once again trying to address unaccounted-for income in the hands of individuals", 
    "section": "national", 
    "title": "Only some relief for the common man, amidst a lot of expectations", 
    "subsection": "general", 
    "date": "2016-03-01"
}