{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court on Monday did not grant any interim relief to suspended Delhi University professor and paraplegic, Professor G.N. Saibaba, lodged as an undertrial in Nagpur jail for alleged links with Naxalites.\n\nA Bench of Justices J.S. Khehar and C. Nagappan said it would consider the case of releasing Saibaba on bail on April 4 after Maharashtra completed the examination of eight material witnesses in the trial.\n\nThe Bench has, for the time being, agreed with the State’s plea not to release the wheel-chair bound Prof. Saibaba, who suffers from 90 per cent disability, till the trial court completes recording the testimony of the witnesses.\n\nThe apex court ordered that the trial should continue on a day-to-day basis from March 4 and asked the State to provide it a list containing the names of the eight witnesses.\n\nThe Bench was hearing a plea by Prof. Saibaba, seeking bail on the ground that he is lodged in the notorious Anda Isolation Cell Jail and is in a “precarious state of health and is now only able to crawl.”\n\nIn the previous hearing, the Bench questioned the need to keep him in solitary confinement.\n\nThe Maharashtra government had said Prof. Saibaba's trial had already commenced in Gadchiroli and grant of bail now would result in his going “underground”. Last time, the Bench had even considered placing Prof. Saibaba in house custody, where he could neither go out nor have visitors. But the State had insisted that the trial would be over in two months and read out a medical report from the jail denying that Prof. Saibaba was in solitary confinement.\n\nMeanwhile, the Bench posted a petition filed by Booker Prize winning author Arundhati Roy, against whom contempt proceedings were initiated for publishing an article on Prof. Saibaba, on July 12, 2015.", 
    "section": "national", 
    "title": "SC denies interim relief to Saibaba", 
    "subsection": "general", 
    "date": "2016-03-01"
}