{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "In a novel idea, the Supreme Court on Monday asked Kerala whether measures can be taken to collect stray dogs in one place and sterilise them as per the law.\n\nA three-judge Bench, led by Chief Justice of India T.S. Thakur, expressed concern over children and innocent pedestrians becoming victims of brutal attacks by stray dogs even as the State authorities seemed caught between animal rights and rising stray dog menace.\n\nAppearing for Janaseva Sisubhavan, a Kerala-based organisation working for the rehabilitation of street children, advocate V.K. Biju submitted that children were easy targets for stray dog attacks in the State.\n\nThe counsel illustrated the case of Dolly, an MNREGA worker who died last year, as one of the several cases in which dog bites turned fatal due to lack of sufficient health care at both government and private hospitals.\n\n“Kerala is changing from ‘God’s own country’ to ‘dogs’ own country’,” Mr. Biju said, invoking the State’s tourism logo to explain the extent of danger caused by stray dogs.\n\nThe Bench directed the State to reply within a week on the compensation fixed in Dolly’s case.\n\nAppearing for the Centre, Additional Solicitor General P.S. Narasimha said it was essentially the job of a State government to protect and rehabilitate victims of dog bites.\n\nThe Union Ministry of Women and Child Development urged the court to “give directions to the Kerala government to take immediate steps to protect children from the dangerous attacks of stray dogs.”\n\nIt asked the apex court to order Kerala to direct its local municipal bodies to quell the danger as per the provisions of the Prevention of Cruelty to Animals Act, 1960. This may mean even culling stray dogs which are a danger to society and life.\n\n“Children are the fundamental embodiment of human race and they deserve protection from any kind of attack by stray dogs,” the apex court had observed in a previous hearing.\n\nThe next hearing is scheduled on March 9.\n\nKerala is changing from ‘God’s own country’ to ‘dogs’ own country’, says rights activist", 
    "section": "national", 
    "title": "SC expresses concern over rising stray dog menace in Kerala", 
    "subsection": "general", 
    "date": "2016-03-01"
}