{
    "author": [
        "Peerzada Abrar"
    ], 
    "text": "Entrepreneurs say that there is a lot more that could be done to incentivise innovation\n\nThe start-up industry has provided a mixed response to Finance Minister Arun Jaitley's budget.\n\nTop tech entrepreneurs and industry experts said the budget has addressed few issues including 'ease of doing business' in India. However, they are also disappointed that taxation norms for software companies were not relaxed.\n\nProblem solvers\n\n“I am glad that the government clearly recognizes that start-ups can be powerful problem solvers for the myriad issues facing the country and in turn generate employment as well,” said Mohandas Pai, chairman, Aarin Capital and a top angel investor. He said the government’s decision to allow for 100 per cent deduction of profits for three out of five years between April 2016 and March 2019 is certainly “a welcome step that will boost start-ups.”\n\nSoftware product think-tank iSPIRT, which works closely with over 900 product firms, said 'ease of doing business' in India has been positively impacted by the Union budget.\n\nThe budget has announced incentive for companies to 'Stay-In-India'. There will be no capital gains tax applicable if the funds so received are invested in a notified fund of funds by individuals in specific start-ups. The other major step is the decision to tax the royalty income from patents developed and filed in India at only 10 percent.\n\nExperts said this will certainly encourage companies to develop and file more intellectual property rights in the country.\n\niSPIRT welcomed the move of Mr.Jaitley’s to boost the digital infrastructure in the country with specific reference to the Aadhaar. The Aadhaar powered by India Stack will help Indian start-ups and innovators to offer presence less, cashless paperless service delivery to millions. Also digital literacy will provide a big impetus in the rural areas.\n\n“This can certainly transform the way in which digitally-focused companies can reach the masses quicker and more effectively,” said Sharad Sharma, cofounder of iSPIRT. He also said that the young ventures in the country will certainly benefit from the budget announcement of amending the Companies Act, for easier and swifter registration of companies.\n\nHowever iSPIRT said that it is disappointed that no attention is being given to easing taxation norms of software product companies where there is significant friction. There is confusion on “goods” versus “service” tax on online downloads and tax deducted at source (TDS) on sale of software products.\n\n“There is need for a clearer and unambiguous definition of digital goods and digital services from a taxation point of view,” said Jay Pullur, founder of Hyderabad-based Pramati Technologies. Also competition from foreign companies selling business to consumer products without any tax in India is another big challenge for India’s new-age firms.\n\nEntrepreneur Vishnu R. Dusad, chief executive of Nucleus Software, said there were no major sops announced for the software product industry.\n\nHe said the government must understand that incentives to this segment of the industry will result in an exponential leap in exports. “It will place India in an unshakable position on the world software product stage,” said Mr. Dusad. Experts said the Union Budget has made the announcements which were already a part of Prime Minister Narendra Modi's 'Startup India' vision. But it has announced no fresh sops for the start-up industry. Entrepreneurs say that there is a lot more that could be done to incentivize innovation. They specifically mentioned easing of the TDS conundrum which start-up and product companies find themselves adversely caught in.", 
    "section": "national", 
    "title": "Start-up industry rues lack of tax incentives", 
    "subsection": "general", 
    "date": "2016-03-01"
}