{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Tension has been running high in Agra after Arun Mahaur, a Dalit businessman and local VHP office-bearer, was shot dead in the city last Thursday. Though the police arrested five suspects belonging to the minority community on charges of murder and rioting, the VHP and the BJP have accused the Samajwadi Party government of “appeasing” the Muslims.\n\nOn Sunday, at a condolence meeting attended by senior VHP and BJP leaders, including Surendra Jain and Ram Shankar Katheria (Minister of State in the Modi government), offensive references were allegedly made to the minority community. Mr. Katheria, Agra MP, reportedly urged Hindus to make themselves “powerful” and “launch a struggle”.\n\nThough Mr. Katheria was not available for comment when contacted, Chaudhary Babulal, BJP MP from Fatehpur Sikri, who was one of the speakers at the meeting, said: “There will be aaar paar ki ladai (final battle) in 2017.”\n\nThe VHP has alleged that Mahaul was killed for his work against cow slaughter.\n\nThe Agra MLA of the BJP, Jagan Prasad Garg, reportedly urged the crowd to “begin showing your strength” as the 2017 elections approach and made references to firing bullets and wielding knives. However, he later clarified, “All I said was that there would be no need to use bullets and guns, if they vote for the BJP in 2017”. He demanded that the accused be booked under the National Security Act.\n\nThe police claimed that the speeches made by the VHP and BJP leaders “had no adverse impact” on the people, even as activist and Congress supporter Shehzad Poonawalla submitted a complaint to the Home Ministry and Chief Minister Akhilesh Yadav against the alleged hate speech.\n\nVHP and BJP leaders allegedly made offensive references to the minority community", 
    "section": "national", 
    "title": "Tension in Agra after VHP leader’s murder", 
    "subsection": "general", 
    "date": "2016-03-01"
}