{
    "author": [
        "Jaideep Deo Bhanj"
    ], 
    "text": ": The weekend saw many wedding take place at function halls across the city and the coming week has a number of auspicious days.\n\nThough months of planning goes into a wedding, the lack of water is something not even the most detailed planners brace for. For many such families who even have guests coming to the city for ‘the day’, their own memorable life-events are turning out to be a nightmare – thanks to the Jat quota stir which has completely disrupted Delhi’s water network.\n\nThe situation couldn’t be worse for those tying the knot in Dwarka where there has been no piped water supply for a week. Arani Chaudhuri, who is getting married next week in Dwarka says, “I have been crossing my fingers hoping that the problem gets resolved. We have so many guests coming .”\n\nVenues in Dwarka have been facing a major shortage of water and event organisers have been left stumped as even those willing to pay for water tankers are not able to get one.\n\nA wary bride-to-be, Ms. Chaudhuri, added: “All efforts to be the perfect host will go in vain if the taps remain dry. We may have to shift the venue to another part of town, which will increase costs.”\n\nSimilar stories are emerging from banquet halls and ‘party lawns’ in North and parts of West Delhi. Sanju Bhatti, manager of a banquet hall in Rohini, insisted his hall had no problem of water. “It is true that we do not have water supply in our taps, but there is nothing to worry about. We have tie-ups with private water tankers who provide water whenever there is a function,” he said.\n\nMeanwhile, residents, especially in Dwarka, Central and North Delhi continue to face a harrowing time.\n\n“The water crisis is unfathomable. While everywhere else people are at least getting water at low pressure or for lesser time, Dwarka is a major exception. Even tankers are giving up on us,” said Rachna Kumar, a resident of Dwarka Sector 21.", 
    "section": "national", 
    "title": "Weddings left high & dry", 
    "subsection": "general", 
    "date": "2016-03-01"
}