{
    "author": [], 
    "text": "Delhi Jal Board chairperson Kapil Mishra speaks to Damini Nath about some initiatives that the Delhi government is contemplating in case the Capital faces a water crisis again.\n\nYou've said earlier that Delhi depends on the Yamuna for water, not Haryana. But, the recent agitation in Haryana hit Delhi's water supply. Doesn't this show the dependence on Haryana?\n\nThe river does not belong to Haryana. The river is for all of us. And Haryana too gets water from Punjab.\n\nThe water that Delhi gets from Haryana is as per certain guidelines, treaties and even a Supreme Court order. Haryana is bound by the guidelines to share water with Delhi.\n\nGiven how the Jat protests led to a shutdown of seven DJB plants, are you planning on any emergency measures in the future so the crisis is not repeated?\n\nWe cannot replace the river. Delhi is the Capital of the country because the Yamuna flows through it. We need the Yamuna, but we should also have a week to 10 days’ worth of water supply of our own in case of emergencies.\n\nThe Delhi Jal Board (DJB) is working on a plan that will be ready soon. We are looking at using the water bodies in Delhi for storage.\n\nWe are looking at interlinking our treatment plants as well. What happened this time was that two of our plants, Sonia Vihar and Bhagirathi, were working at full capacity, but we couldn't share the water to other parts of the city apart from filling up tankers. We are looking at laying an alternative pipeline to link the plants so that in emergencies we can get water to the affected areas faster.\n\nDelhi's water bodies have been neglected over the years. How do you plan on reviving them?\n\nYes, the water bodies have been neglected. The Revenue Department's records show that there are about 600 water bodies in Delhi, but you can barely see four or five. But we plan on cleaning up the lakes, including the Bhalswa lake and Sanjay lake, and reviving them to store water.\n\nSince Delhi relies on the Yamuna, how far have your initiatives to clean the river gone? Last year you had said you would take a dip in the river in 36 months.\n\nWe know that the Najafgarh and supplementary drains are the primary sources of pollution into the Yamuna, downstream of Wazirabad. The river needs the water from these drains otherwise it would not exist after Wazirabad. So, we are working on a plan to divert the water from the drains into a large pond, treat it and then release it into the river. Various agencies are giving their presentations of the technologies available. In two or three months, we will be launching the project. Apart from that, the Interceptor Sewer project is also underway. It will be completed by March 2017, and will make a big difference by diverting sewage from the river.\n\nThere is an event being organised by the Art of Living Foundation in the Yamuna floodplains. The National Green Tribunal is hearing a case against it filed by an environmentalist. Where do you stand on it?\n\nI have supported the event. It is a good idea that will see lakhs of people come to the Yamuna and build a connection with the river.\n\nThey will see its condition, and that will put pressure on officials and us politicians to make sure we clean and revive the river. The construction at the site is temporary, and the event will not damage the river. As the Tourism Minister, it is a matter of pride that people and artistes from all over the world will be coming to my city.", 
    "section": "national", 
    "title": "‘Yamuna does not belong to Haryana... we’re working on contingencies’", 
    "subsection": "general", 
    "date": "2016-03-01"
}