{
    "author": [
        "Annie Philip"
    ], 
    "text": "Rs.165.30 crore disbursed under the Centre’s programme since its launch in April last\n\nPuducherry District Collector D. Manikandan distributes a cheque under the MUDRA loan scheme to a beneficiary at the Government Industrial Training Institute for Women, Vambakeerapalayam on Thursday —Photo: Special Arrangement\n\nSince the launch of the Central government’s Pradhan Mantri MUDRA (Micro Units Development and Refinance Agency) Yojana in April last year, loans worth Rs.165.30 crore has been disbursed in the Union Territory of Puducherry.\n\nThe MUDRA loans target non-corporate small businesses and aims to encourage entrepreneurship.\n\nA total of 30,768 people have availed themselves of loans under the MUDRA scheme, said Anbu Kamal Raj, Lead District Bank Manager, Indian Bank. Recently, Puducherry District Collector D. Manikandan distributed cheques to eight alumni of Industrial Training Institutes (ITI) in Puducherry under the scheme, at the Government Industrial Training Institute for Women, Vambakeerapalayam. A MUDRA awareness programme was also held at the ITI for students and alumni.\n\n‘More awareness needed’\n\nHowever, Mr. Raj said that more awareness had to be created about the scheme. “Under MUDRA, loans from Rs.5,000 to Rs.10 lakh can be disbursed. Small-scale entrepreneurs are not aware of this, and many have doubts about taking loans for smaller amounts,” he said.\n\nWith ITIs coming into focus under the Skill India mission and the National Skills Qualification Framework (a nationally integrated education and competency-based skill framework), the government is now taking steps to extend the MUDRA loans to students of these institutes as well. “The ITI students come under the skilled labour category. We are thus targeting all the ITIs and the vocational training institutes in Puducherry. We want to create awareness about MUDRA loans through the alumni,” said Mr. Raj.\n\nAmong those who have availed themselves of MUDRA loans in Puducherry are retail traders, petty shop owners, vegetable vendors, civil works sub-contractors, small shop owners, tailors and electricians. The money has gone into purchasing materials and as working capital, said Mr. Raj.\n\nThe Puduvai Bharathiar Grama Bank (regional rural bank) has also been working in the last few months to enlist beneficiaries of the UT in the scheme. The categories under MUDRA loan include the Shishu category (covering loans up to Rs. 50,000), Kishor category (loans above 50,000, up to Rs. 5 lakh), and the Tarun category (loans above Rs. 5 lakh up to Rs. 10 lakh).\n\nThe MUDRA scheme received further boost this week after the Union Cabinet approved the setting up of credit guarantee funds to facilitate the loans under the scheme. Around 1.73 crore persons in the country are said to have benefitted from the scheme so far.", 
    "section": "national", 
    "title": "30,768 people given loans under MUDRA scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}