{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Main accused, an associate of former Minister Kalimuthu, was charged with cheating banks\n\nMore than three decades after the infamous ‘Robin Mayne’ scam was exposed, a special court for Central Bureau of Investigation (CBI) cases here on Friday convicted and sentenced five persons to various terms of imprisonment and slapped a total fine of Rs. 1.65 crore.\n\nThe case relates to Robin Mayne, who claimed to be a close associate of former AIADMK Agriculture Minister Kalimuthu, and his accomplices conspiring to cheat nationalised banks by securing vehicle loans after producing fictitious persons and fake documents.\n\nThe accused cheated eight banks to the tune of Rs. 56 lakh in 1983.\n\nPronouncing the judgment XI Additional Special Judge for CBI cases K. Venkatasamy described the offence as a mega scam and said the accused were not ordinary people.\n\nHe said the former Minister (since dead) had abetted the crime by placing resources of his department at the disposal of the accused persons.\n\n“Those entrusted with the task of apprehending thieves had themselves conspired to cheat banks and steal public money,” the judge said in his order.\n\nAccording to the prosecution, Robin Mayne had approached the Chennai branches of eight banks in 1983 and offered to invest funds of the State Agriculture Department as fixed deposits. He used to travel in cars with State emblem, national flag and beacon light.\n\nAfter arranging fixed deposits from the Tamil Nadu Agricultural Marketing Board, he used the then Minister’s name to persuade bank managers to lend vehicle loans to some people who, he claimed, were awarded contracts and needed to buy cars, motorcycles and lorries.\n\nSince the fixed deposits were made, the bank officials, some of whom claimed that the then Minister himself spoke to them, agreed to sanction loans.\n\nRobin Mayne and his associates furnished fake documents of vehicles as if they were registered in other States and obtained loans to purchase used vehicles in the names of fictitious persons. Neither the vehicles nor the applicants actually existed. They even managed to open bank accounts in those fictitious names. Some Motor Vehicle Inspectors connived with the suspects.\n\nSoon after withdrawing the loan amount, Robin Mayne closed the fixed deposits in all the banks.\n\nSince the equated monthly instalments were not paid, the bank official conducted an enquiry and realised that the accused had cheated them. They lodged individual complaints and the case was registered by the CBI.\n\nReading out the judgment, Mr. Venkatasamy said the punishment should just not be customary but instead compensate the loss of public money incurred by the nationalised banks.\n\n11 acquitted\n\nEleven accused were acquitted since the prosecution could not prove the charges against them beyond reasonable doubt. A few others accused in the case either retired from service or passed away during the course of trial that lasted more than 30 years.\n\nRobin Mayne was convicted and sentenced to seven years Rigorous Imprisonment and imposed a fine of Rs. 1.08 crore.\n\nR.D Surya Kumar was sentenced to four years in prison with a fine of Rs. 29.5 lakh. Three others Sahul Hameed, Fazil Sam and Somasundaram were sentenced to various terms of imprisonment and slapped with penalty.\n\nThough the accused were found guilty on various counts, the judge, considering their age and health condition, said that the sentences would run concurrently.\n\nCharges against Kalimuthu\n\nabated after his death in\n\nNovember 2006", 
    "section": "national", 
    "title": "5 sent to jail in 33-year-old Robin Mayne case", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}