{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Foundation stone laid for seven more projects with an investment of Rs. 6,418 crore\n\nChief Minister Jayalalithaa with industrialists, who invested in the State during the Global Investors Meet, at a meeting on Friday.PHoto: Special Arrangement\n\nWith barely few months left for the Assembly elections, Chief Minister Jayalalithaa is wrapping up the investments that were proposed during the Global Investors Meet (GIM) 2015.\n\nOn Friday, she inaugurated seven projects with investments of Rs 3, 636 crore, providing employment to 10,000 workers and laid the foundation stone for another seven projects involving an investment of Rs 6,418 crore and providing employment to around 15,000 persons.\n\nThe projects include Rs. 1,200-crore expansion of tyremaker MRF in Permabalur. The firm will manufacture truck and car tyres.\n\nWelspun Energy and Sun Edison are pumping in Rs 975 crore and Rs 300 crore in the solar power space. While the former will have its address at Tiruchi, the latter would be at Virudhunagar.\n\nSamsung India has expanded its Sriperumbudur plant by adding CapEx of Rs 450 crore.\n\nOther firms that were inaugurated were a Rs. 300-crore glass manufacturing unit and Rs. 250-crore R&D facilities of Saint Gobain India Ltd, Rs. 61 crore fragrance and flavours project of Takasago International (India) and Rs 100-crore footwear facility expansion project of Growth Link Overseas at Tiruvannamalai.\n\nMicrosoft India and Zoho, who signed a deal during GIM, have already commenced their operations.\n\nAmway has started production and KEF Industrial Park at Krishnagiri is functional. Misuho Bank and Bank of Tokyo have also begun their operations here, sources said.\n\n“The other projects are being followed up. Land has been allocated to many of them and they are waiting for some clearances now,” said an official.\n\nGIM 2015 attracted investments to the tune of Rs 2.42 lakh crore. The foundation stone was laid for Rs. 2,700-crore expansion project of Apollo Tyres at Oragadam, Rs. 360 crore worth footwear project of Lotus Footwear Enterprises at Krishnagiri district, Rs. 677 crore goods processing project of ITC at Pudukkottai district and Rs. 350-crore expansion project of TVS Motors at Hosur.", 
    "section": "national", 
    "title": "7 projects worth Rs. 3,636 cr. launched", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}