{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "The Robin Mayne case will be remembered not just for the number of decades the accused managed to escape being punished, but also the political dissent it fuelled within the AIADMK, rattling the then Chief Minister and party founder M G Ramachandran (MGR).\n\nIn October 1985, soon after the CBI arrested Robin Mayne, who was an associate of then Agriculture Minister K Kalimuthu, some senior leaders in the AIADMK who did not take kindly to MGR re-appointing Jayalalithaa as the party’s propaganda secretary used Kalimuthu to launch an open attack against her. For the first time, MGR, who miraculously recovered from the death bed a year earlier, faced open dissent with Kalimuthu questioning her appointment.\n\nKalimuthu went on to accuse Jayalalithaa of conspiring to end the Dravidian rule in Tamil Nadu, and towards this end he claimed that she was instrumental in colluding with the Centre to get the CBI to “falsely implicate” him in the Robin Mayne case.\n\n“A CBI officer who interrogated my personal assistant Manickam told him that the Congress (I) would capture power (in Tamil Nadu) within three months, and Jayalalithaa would become the Chief Minister,” he had charged.\n\nJayalalithaa countered it saying the charge was the product of Kalimuthu’s “fertile imagination”. Kalimuthu had responded saying Jayalalithaa was keen on fixing him as she found him an obstruction to her political ambitions. To this, Jayalalithaa had said, “I cannot be made a scapegoat for a fraud committed by someone else.”\n\nAs the war of words escalated, MGR at a Cabinet meeting held on October 28, 1985, dramatically announced that he was resigning as Chief Minister.\n\nIt had the desired effect, with all Ministers not just falling in line but also submitting their resignations to MGR giving him the choice of dropping anyone from the Cabinet.\n\nCuriously, at one stage when Kalimuthu complained to MGR that the CBI was seeking to extract a confession from Robin Mayne (then in the agency’s custody) implicating him, MGR and then Law Minister C Ponnaiyan visited a few police stations “to inspect the conditions in police lock-ups”.\n\nOne of the stations they visited was Egmore, where Mayne was reportedly being interrogated by the CBI.\n\nThe war between Kalimuthu and Jayalalithaa did not last long. Soon after MGR’s death in December 1987, when the party split, he joined the Jayalalithaa faction and became the party’s deputy general secretary and later MP. But in 1990, he rejoined his parent party, the DMK only to return to the AIADMK fold some years later.\n\nSignificantly in 2001, Jayalalithaa got him elected as the Speaker of the Legislative Assembly. Not just that in April 2005 a few days after the Supreme Court directed Kalimuthu to face trial in the Robin Mayne case, Jayalalithaa defended him strongly in the Assembly saying there was no need for him to resign.\n\nA year later in November 2006, Kalimuthu died of heart attack following which the charges against him abated.", 
    "section": "national", 
    "title": "A case that rattled MGR and fuelled dissent", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}