{
    "author": [], 
    "text": "Ways and means to STAY SAFE on the road\n\nSome tourist vehicles and school transport vehicles have a mobile number for other road users to call to if the vehicle bearing it was found driving in a rash and negligent manner.\n\nIn most instances, the calls are answered by the owners of the vehicles, or in the worst case by the person who is driving the vehicle. It is more becoming a style statement.\n\nBut even such an effort is not taken up by leading call taxi fleets, whose drivers are found rushing into available gaps to drop their customer and go for the next pickup. These fleets have their call centre numbers affixed on all sides of the vehicle. The manager of a call taxi fleet said that people could report such violations by calling their call centre. Motorists, however, say that there was no assurance that action has been taken on their complaint.\n\nMotorists feel that the government should make it mandatory for all the public transport vehicles and institution vehicles to have the contact numbers of the police station under whose jurisdiction the vehicle is registered and the transport authorities concerned as well to report such violations.\n\nTo avoid being hit by rash and negligent motorists on the city roads where the vehicle population is steadily increasing every day, some vehicle users are trying their best to come out with novel ways to avoid getting hit.\n\nPopular among them are the ‘Baby on board’ stickers affixed to the rear glass panels of cars and catchy statements such as ‘Don’t kiss me’. Some people even after obtaining a licence prefer not to remove the ‘L’ board that they affixed on their vehicles as other motorists are considerate about vehicles driven by learners.\n\nHowever, how others look at vehicles with such stickers vary. When those vehicles are found over-speeding, rash and negligent driving, the drivers face the ire of other road users.\n\n(Reporting by\n\nM.K. Ananth)", 
    "section": "national", 
    "title": "A style statement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}