{
    "author": [
        "Tanvi P S"
    ], 
    "text": "“We are from the Meter Auto Club. We are a group of 55, who charge auto fares as per the government norms. We also collected and delivered relief material to Chennai and Cuddalore during the floods, free of charge for more than 10 days. People from Coimbatore Vizha heard about us from a local radio station and they are honouring us at this function,” said Siva, a member of the Meter Auto Club of Coimbatore.\n\nThe spirit of recognising those who relentlessly serve the society rang in the 8{+t}{+h}edition of the Coimbatore Vizha, held at Brookfields mall.\n\nThe Vizha, which was inaugurated by actor Karthik Sivakumar, honoured 14 people for their service to the society.\n\nGiftAnOrgan – an organ donation awareness initiative by CII-Yi, was re-launched and the book “Birds of Coimbatore” – a document on the winged species of the city from Dr. Pramod, Senior Scientist, SACON (Salim Ali Centre for Ornithology and Natural History), was released. “No Dumping. My Waste! My Responsibility”, a waste management campaign was also announced.\n\nOver the next eight days, more than 50 activities like bird races, kabadi tournament, cyclathon, antique jewellery exhibition,etc will be conducted by different organisations. “Some of the highlights of this year include 20{+t}{+h}century art exhibition organised by Raja Ravi Varma Foundation, Old Coimbatore Heritage Food Walk by The Vanavarayar Foundation & Kovai Foodies and a ‘Coimbatore Through the Ages’ exhibition at Lakshmi Mills,” said Swati Rohit, Chairperson of Yi Coimbatore. The Vizha is on till 4{+t}{+h}February. For details visitwww.coimbatorevizha.com. The Hindu is the media partner for this event.\n\nThe Unsung Heroes of Coimbatore include Dr. P. Kangaraj, who provides free coaching for competitive exams; N. Nithyanandam, founder of Dhiyana Foundation, who spreads awareness on HIV/AIDS in 1200 villages; C. Srinivasan, project director, Indian Green Service; Anjali Ajeeth, a social activist who helped empower and rehabilitate transgenders; Rajasethumurali, who feeds close to 250 people everyday through his Pasiyara Soru movement; N. Umathanu, a social activist who created awareness on the issues of child labour, gender injustice; B. Nagaraj, a corporation sanitary worker, who has become the face of the city’s Zero Waste Management Project; Lt. Esan, who commanded the Rescue Squad- Delta, the first squad to enter the worst flood-hit area in Chennai- Mudichur; M. Jaikumar, who has been instrumental in arranging blood donation; Suraj Kumar, founder of Discover Wild Foundation and Project Coordinator at Swarga Foundation; N. Vivekanandan, a young athlete who is to represent India at the Asian Athletics Championships; Latha of Aram Foundation who collected four tonnes of flood relief materials; Dharanidaran Soundaran, who heralded one of the flood reliefs efforts; and Nadarajan of The Meter Auto Club.", 
    "section": "national", 
    "title": "Actor Karthik launches Coimbatore Vizha", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}