{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The deliberate policy of extreme demand compression that led to the Bengal famine in the 1940s causing over 3 million deaths is being seen in India in the present day in the form of neo-liberal policies which are leading to fall in employment and income and therefore in aggregate demand, Prof. Utsa Patnaik, Professor Emeritus, Jawaharlal Nehru University, said on Friday.\n\nIn the present situation fiscal policy has reduced public spending in developing countries, trade policies have removed protection to petty producers and urge removal of meagre subsidies that developing countries offer for food security, and the financial reform policies withdraw credit on easier terms for small scale producers, she said and added that all these fall in the category of vicious finance.\n\n“They serve the same aim as taxation did under colonial system and as additional taxation and profit inflation during the war,” Prof. Patnaik said.\n\nThe Bengal famine could well have been prevented with an annual tax of as little of 4 pounds per capita from the British population, she told the international seminar on “Agriculture and Rural India after economic reforms” at the MSSRF organised in honour of Prof. Venkatesh Athreya.\n\nSpeakers at the various technical sessions drew attention to the situation of agrarian distress in India where more than 2.5 lakh farmers committed suicides between 1997 and 2012.\n\nDelivering the inaugural address, N. Ram, Chairman, Kasturi & Sons, recalled Prof. Athreya’s contribution to academic scholarship. “He is one of the finest scholars that I have come across. He is always very clear about whether you agree with him on something or not. He can tell you why he has arrived at a conclusion or judgement. He has a quick mind, capacity for enormous work and versatility. Some of his work deserves more recognition than it has got,” Mr. Ram said.\n\nRecalling Prof. Athreya’s contribution to the study of literacy and on issues of educational deprivation, Mr. Ram said it would be interesting to find out if substantial improvements had been made in India, especially in South India, since the time of the publication of a report on the topic. The papers presented at the seminar will be brought out as an edited volume for the sake of policy makers, students, academicians and those interested in rural development, MSSRF said.", 
    "section": "national", 
    "title": "‘Bengal famine could have been avoided’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}