{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Fifteen volunteers from Salem Citizen’s Forum will pedal their way to Chennai and submit a petition to Chief Minister\n\nMembers of the Salem Citizens Forum and other social activists have launched Salem-Chennai bicycle expedition urging the government to remove encroachments from water bodies immediately.- Photo: E. Lakshmi Narayanan\n\nThe members of the Salem Citizens’ Forum along with social activists on Friday commenced a bicycle expedition to Chennai to highlight the need for the removal of encroachments from all water bodies in the State with immediate effect.\n\nThe rally was flagged from near the Salem Collectorate by Balaji Sakthivel, film director, in the presence of a large number of social activists, school and college students.\n\nFifteen volunteers from the Forum, displaying placards explaining the importance of protecting the water bodies by removing the encroachments and retrieving them from the encroachers, will be pedalling via various districts covering a total distance of 410 km.\n\nEn route, they will be creating awareness among the people on conserving the available water for the benefit of the future generation.\n\nPiyush Manush, convener of the Salem Citizens’ Forum, who is leading the bicycle rally, said that the government has been neglecting the water bodies for a long. The recent heavy downpour and the floods claimed lot of human lives and caused extensive damage to the property and crops.\n\nThe government and the people have not a learnt a lesson from the recent disasters.\n\nMr. Piyush said that the residents of Salem urged the district administration to remove all the encroachments immediately, following the floods. Life in Yercaud was crippled for around 10 days. In the city too, many areas were battered by continuous rainfall, as the flood water could not pass through the plastic and building choked channels.\n\nBut to the disappointment of all concerned, the District Administration failed to act. People pleaded, petitioned, made news and also took to protest. We cycled around the Collectorate for five days in a tricycle and yet there was no response. As the next step we now move from Salem to Chennai. The bicycle rally is to seek an audience with the people at the helm of the corridors of power, Mr. Piyush said.\n\nThe rally intends to convey the message of rainfall to all concerned. All are aware that the damage caused due to floods has been due to manmade encroachments. Encroachments of buildings, plastics, solid waste, levelling of land for real estate all have blocked the flow of water.\n\nMr. Piyush expressed the hope that the bicycle expedition will attract the attention of the government and act on this serious subject without any further delay. The expedition team is expected to reach Chennai on February 17, where the activists plan to meet the Chief Minister and present a petition.\n\nSocial activists from the neighbouring districts too were present at the flag-off.", 
    "section": "national", 
    "title": "Bicycle rally calls for removal of encroachments from water bodies", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}