{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Modi to address a mammoth meeting on February 2\n\nThe BJP is getting ready to use the tested template of “corruption-free good governance” as its campaign plank in Tamil Nadu. The theme is likely to dominate the public meeting Prime Minister Narendra Modi will address in Coimbatore on February 2.\n\n“There may not be direct attacks against the Dravidian parties as we have not finalised our alliance yet. But the meeting will certainly see much time spent on corruption and how the State has stagnated on many fronts,” a senior BJP confirmed.\n\nTop guns camping in Coimbatore\n\nIn an indication of how important this rally is for the BJP, many of its top guns are camping in Coimbatore to oversee the preparations.\n\nUnion Environment Minister Prakash Javadekar, who is in-charge of the election work in Tamil Nadu, chaired multiple meetings that involved national organising secretary Ram Lal on Friday.\n\nThe Tamil Nadu RSS was also in full strength at the closed-door meeting with big names such as R.V.S. Marimuthu chipping in with suggestions on crowd mobilisation.\n\n“The instruction is to get at least two lakh people for the public meeting since we are pitching this as our first election rally. We have to showcase the strength of the party since we have claimed that the BJP membership in Tamil Nadu has touched 50 lakh,” a leader said.\n\nHowever, Tamil Nadu BJP is not too confident about achieving the target. Unlike rallies in the run-up to the Lok Sabha polls, the BJP will not have the benefit of alliance partners, who had a larger base.\n\nThough sources said the DMDK and the PMK may be extended invites officially, there is no guarantee that they would ask their cadres to participate without officially sealing the alliance deal.\n\n‘There may not be direct attacks against Dravidian parties as we have not finalised our alliance yet’", 
    "section": "national", 
    "title": "BJP may continue with graft-free governance theme in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}