{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Bio methanation-cum-power generation plant set up in Melapalayam at a cost of Rs. 90 lakh\n\nThe 22-year-old Corporation’s administration is all set to move from the cramped temporary structure to the spacious administrative building as it was inaugurated by Chief Minister Jayalalithaa on Friday through videoconferencing.\n\nAfter the Chief Minister inaugurated the structure, Collector M. Karunakaran lighted the traditional lamp to mark the formal inauguration in the presence of Mayor E. Bhuvaneshwari, Commissioner S. Sivasubramanian and City Engineer V. Narayanan Nair.\n\nMPs S. Muthukaruppan, Vijila Sathyananth, K.R.P. Prabhakaran and Vasanthi Murugesan, senior officials of the Corporation and councillors participated in the inaugural function.\n\nThe Rs. 5-crore two-storey building with a built-up area of 42,646 square feet, which was under construction for the past three years, has been built to house entire administration of the urban civic body including health, engineering, revenue, accounts, legal and audit sections.\n\nMoreover, Ms. Jayalalithaa also inaugurated the apartments, constructed on an outlay of Rs. 2 crore for the families of 261 sanitary workers at Ambedkar Colony and the bio methanation-cum-power generation plant, established at Melapalayam at a cost of Rs. 90 lakh.\n\nThe bio methanation cum power generation plant would use 5 tonnes of degradable waste everyday to generate 400 units of power, which would be utilised for operating the 28 HP motor in the slaughter house, 13.50 HP motor in the plant and the lights in this area.\n\nIn other words, the bio methanation plant will save Rs. 9.14 lakh per year for the Corporation.\n\nNagercoil\n\nThe combined building constructed at an estimated cost of Rs. 95 lakh for Commercial Taxes Department was inaugurated by Chief Minister Jayalalithaa through videoconferencing from the Secretariat in Chennai on Friday.\n\nThe two-storey building was constructed at Vazhvachakoshtam in Kattathurai in Kanyakumari district.\n\nOffice of the Commercial Tax Officer, Thuckalay will function from the ground floor and the CTO, Kuzhuthurai will function from the first floor.\n\nCollector Sajjansingh R. Chavan lit the traditional kuthuvilakku to mark the inauguration of the building in the presence of former Minister N. Thalavai Sundaram and Kanyakumari MLA K.T. Pachaimal. K. Suganthi, Deputy Commissioner of Commercial Taxes, Assistant Commissioner Kayalvizhi and CTOs participated.", 
    "section": "national", 
    "title": "CM inaugurates Corporation’s administrative building", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}