{
    "author": [], 
    "text": "Their tool box:The articles seized by the police from the 'Iridium' selling gang at Usilampatti on Friday.\n\nTricksters capitalise on people’s desire to get rich fast through various means, writes S. Sundar\n\nWhite collar criminals duping the gullible with their vile designs are not new to Madurai. However, two incidents reported in different parts of the district this week reveal that they operate at different levels.\n\nThe first incident, reported on Sunday, was that of a farmer, Saravanan, who was duped of Rs. 2 lakh by a fortune teller. The fortune teller, Komattayan, of Melavalavu, gave a small yellow box for Rs. 2 lakh. He told the farmer that the ‘nagarathina stone’ (a fictitious precious stone) would fetch several lakhs of rupees in the market. However, before leaving the spot at Vellimalaipatti, the accused made a signal following which three persons arrived at the spot and snatched the box and fled away.\n\nBased on Saravanan’s complaint, the police arrested two persons and are on the lookout for two others.\n\nOn Friday, a 12-member gang that tried to dupe Village Administrative Officer Padmanaban with ‘Iridium,’ which is supposed to bring good luck, was arrested at Usilampatti. The gang that assembled at a coconut farm promised to give him the ‘Iridium’ for Rs. 50,000.\n\nHowever, a local man , Ajith Pandi, who arrived a little late, identified the VAO. Threatening him with dire consequences, the gang proceeded with their work. Upon alerted by him, the police arrested the gang.\n\nArticles are concealed\n\nIn both the cases, the accused had concealed the “precious articles” in boxes. In the first incident, the fortune teller warned the farmer that opening the box would make the ‘nagarathina’ stone evaporate in the air. In Usilampatti, the gang that had a larger plan, had kept the ‘iridium’ in a sealed thermo coal box. “The accused had threatened that opening the box would result in radiation emanating from the ‘iridium’ affecting the people around,” Usilampatti Deputy Superintendent of Police S. Ramakrishnan said.\n\nThe accused had brought two huge suitcases in which they had two sets of ‘silver’ suits such as the ones used by firemen. People should use the suits to have a look at ‘iridium’ to avoid radiation, they claimed. They also had two small fire extinguishers to bolster their claim.\n\nThe police arrested 12 persons, including Ajith Pandi, Rajesh of Salem and Amanulllah of Chennai.", 
    "section": "national", 
    "title": "Conmen and their confidence tricks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}