{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A gang of six dacoits looted the Primary Agricultural Cooperative Society office at Venmani village in Nagapattinam district late on Thursday and took away 11 kg gold jewellery worth Rs. three crore after killing the society secretary and assaulting the appraiser.\n\nPolice sources, basing the statement of the appraiser, Ganapathy (45) of Kachanam, said two youths entered the office late on Thursday evening even as Ganapathy and secretary Kamaraj (56) of Irinjiyur were closing shop for the day.\n\nThey told Kamaraj that they had come to set right the alarm bell, but the society secretary said he had not called in anyone to repair it. As he was talking, four persons walked into the building while the youths allegedly sprayed a liquid on the two, leaving them unconscious.\n\nThe gang then killed Kamaraj and left his body hanging from a hook in the ceiling of a room in the building and thrashed Ganapathy before tying him to a chair.\n\nThey reportedly took away gold jewellery mortgaged with the society from the locker and Rs. 2.27 lakh in cash from the chest.\n\nThey switched off the building’s main power supply before leaving.\n\nLate in the night, residents in the neighbourhood who heard some noise emanating from the office found Ganapathy tied to the chair and Kamaraj dead.\n\nPolice were alerted and Ganapathy was rushed to the Tiruvarur Government Medical College Hospital. Kamaraj is survived by wife Chandra, a son and daughter.\n\nNagapattinam Superintendent of Police Abhinav Kumar arrived at the spot and conducted inquiries.\n\nThe alarm bell installed in the office has not been working for the past month and there is no camera surveillance of the premises.\n\nPolice have constituted two special teams to nab the culprits. Inspector General of Police, Central Zone, Senthamaraikannan, DIG, Thanjavur Range, Senthil Kumar, visited the office and conducted inquiries.", 
    "section": "national", 
    "title": "Dacoits loot cooperative society office, kill secretary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}