{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Alleging large scale anomalies in the electoral rolls published on January 20, the DMK has urged the Election Commission (EC) to withdraw the same and sought a direction to the Chief Electoral Officer (CEO) to “re-do” the final electoral rolls in the state.\n\nAsked about the party’s allegations, a senior officer of the EC said the Commission would “certainly look into the specific allegations”. In the memorandum to the Chief Election Commissioner Nasim Zaidi, a copy of which was also submitted to the CEO Rajesh Lakhoni, the DMK’s organising secretary R. S. Bharathi alleged that 2,56,888 “corrections” were wrongly included in the electoral rolls.\n\n“Moreover transposition of entry within Assembly Constituencies is made to the extent of 1,13,095 voters without following due procedures contemplated under proviso to Section 22 of the Representation of People Act, 1960,” the memorandum alleged.\n\nCiting the census data, the DMK said the EC had a duty to explain why there was a sudden spurt in the voting population from 2011 to 2016 when the population census and projected growth rate of the voters showed otherwise.\n\nMismatch\n\n“This mismatch clearly points to large scale inclusions in the electoral rolls to an extent of about 64 lakh voters between 2011 and 2016,” the DMK said.\n\nAnother anomaly, according to the DMK, was that out of total population of 7.66 crore in the year 2015, the final electoral roll declares 5.79 crore as voters which worked out to 75.58 per cent of the total population.\n\n“Such percentage of voting population is quite absurd in number. The reason is that in the year 2011 when there was total population of 7,21,38,958, the eligible voters were only 4,71,15,846, which works out to 65.31 per cent whereas the percentage of voting population suddenly rose to 75.58 per cent of the total population in 2015,” the DMK said.\n\nThe DMK said while revising the final electoral rolls by complying with various directives of the EC and other provisions, the CEO should take into consideration the various objections given by DMK’s Booth Level Agents-2 and by the DMK party.\n\n“The Election Commission should direct the CEO to comply with our request without further delay, before commencement of next Camp scheduled to be held on January 30,” the party said.\n\nAn EC official said that the software used for enrolment and verification was even capable of re-checking photographs.", 
    "section": "national", 
    "title": "DMK petitions EC to withdraw final electoral rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}