{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Thanjavur Mayor refutes charges, says purchase made after following due procedure\n\nAlleging that there were fault lines in the purchase of machineries for compost plant as they contravened rules, the DMK members in the Thanjavur City Corporation raised the issue at the council meet here on Friday.\n\nMayor Savithri Gopal refuted any irregularity in the whole issue.\n\nAfter discussions on civic requirements, drinking water issues and garbage clearances in certain areas of the corporation, DMK councillor T.K.G. Neelamegam drew attention to a subject on the listed agenda that illustrated that a machinery for compost plant near Srinivasapuram was purchased at a cost of Rs. 1.57 crore that was 2.92 per cent above the estimated cost and that too the Mayor had cleared the purchase urgently not following due procedures.\n\nMr. Neelamegam charged that rules for single tender benchmark procedures were flouted by the ruling class. He alleged that the Mayor had agreed to reconsider the subject during the council meet but had reneged on the issue and after the meeting ended had announced that the resolution was passed.\n\nRefuting the allegation Ms. Savithri Gopal claimed that all resolutions were passed in the council before it was adjourned.\n\nHowever, Mr. Neelamegam sought to revive the issue after the meeting formally ended with the passage of resolutions.\n\nAs regards the purchase of machinery for the compost yard, Ms. Savithri Gopal said that all due procedures were followed, work advertised in leading newspapers, tenders called for and when no one came forward even after the third call, single tender system was resorted to as a last resort.\n\nEven with the intended supplier, the price was bargained and finally the supplier agreed to provide the machinery at Rs. 1.57 crore that was 2.92 per cent more than the estimated cost.", 
    "section": "national", 
    "title": "DMK alleges foul play in compost machinery deal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}