{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They also complain about non-availability of harvesters\n\nPaddy farmers have complained that they faced problems in marketing their produce as the direct procurement centres opened in the district failed to procure paddy even as Collector S. Natarajan assured to redress their grievances.\n\nThough the district administration had announced opening of 75 procurement centres, including 68 run by Primary Agriculture Cooperative Credit Societies (PACCS), none functioned, the farmers said at the monthly farmers’ grievance redressal meeting here on Friday.\n\nAs the procurement centres could not come to their rescue, they were forced to sell their produce to traders at the rate of Rs. 700 to Rs. 800 per quintal, they said. The government procured paddy at the rate of Rs. 1,520 for A grade and Rs. 1,460 for B grade, but they could not be benefited, they said.\n\nEver since Minister for Sports and Youth Welfare Sundararaj inaugurated three procurement centres at Selvanayagapuram, Mudukulathur village and Sambakulam on January 18, he had been trying in vain to sell paddy at the Sambakulam centre, a farmer said. “I had visited the centre thrice with 50 bags of paddy, but they refused to procure it,” the farmer said at the meeting, chaired by the Collector.\n\nFormer Collector K. Nanthakumar had announced in the previous grievance redressal meeting that 75 procurement centres would be opened from January 12. As the farmers faced problems last year, the district administration had decided to open 25 more centres this year, he said.\n\nReacting to the complaints by the farmers, Mr. Natarajan said that he had received feedback about the procurement centres and would ensure that they functioned properly and procured paddy from the farmers from Saturday.\n\nThe farmers also complained about non-availability of harvester machines. Nagarathinam, a farmer from Pudukudi, who was invited to share his ‘success story’ on how he had benefited from the cold storage facility for chilli, lamented that he had been waiting for 20 days for a harvester after paying Rs. 50,000.\n\nHe could not harvest paddy cultivated on 20 acres for want of harvester, he said.\n\nOther farmers also complained that they were finding it hard to protect the crops from wild bulls and birds. The agriculture engineering division officials said that the problems arose as all the harvesters were diverted to the delta districts. The Collector, however, assured to help the farmers.", 
    "section": "national", 
    "title": "DPCs do not buy paddy, say farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}