{
    "author": [
        "Annie Philip"
    ], 
    "text": "Kolkata-based author Nidhi Dugar Kundalia chronicles India’s dying professions\n\nThe bhishtiwallah (water-seller), rudaalis (professional women mourners) in Rajasthan, ittarwallah (perfumer) in Hyderabad and the godna (tattoo) artist in Jharkhand are among the fading vocations documented by Kolkata-based author Nidhi Dugar Kundalia in her new book, The Lost Generation: Chronicling India's Dying Professions.\n\nAt a book reading event held here recently under the auspices of People for Pondicherry’s Heritage as part of a series of interactive sessions with authors, Ms. Kundalia said that with many of the professions, she found how they were not just ancestral, but also tied closely to caste, religion and patriarchy.\n\nFor example, the rudaalis who are Dalit women, have to mourn at the death of upper caste people because upper caste women relatives cannot be seen crying in public, and often they also doubled up as mistresses and maids at the houses of upper caste men. Naturally, many are not proud of their professions because of its association, and even the hard nature of the work like in the case of the bhishtiwallah.\n\nIt was an article about a dermatologist who had been removing tattoos made by godna artists because clients did not want this marker of caste which led Ms. Nidhi to include them in the book.\n\nThe author believes that growing up with her grandparents in Hyderabad initiated a fascination for all things from an older time like knick knacks she would find lying around the house, black and white photographs and even lamp lighters when lamps were powered by gas.\n\nIt was, however, in Kolkata that Ms. Nidhi found the divisions between the old and the new blur and ran into people in professions of a different time.\n\nThis initiated the idea for the book, she said.\n\nThe author said she also had to leave out several professions as she was unable to get adequate information on its histories and the families practising them. She found some difficulty with translation, and also grappled with having to ask personal and intrusive questions to her subjects. “The biggest challenge was to dig out the family histories,” she said.\n\nThe book’s strength lies in its ability to present a complete picture of these professions with in-depth interviews backed by considerable research, and not succumbing to nostalgia in the process. While writing about professions like these, it was important to uncover how something like caste played its role, said the author.\n\nOn the other hand, it was also a sorry state where a community of story tellers in Andhra Pradesh considered untouchables and who have memorised epics were facing the extinction of their profession now. “I have been unable to conclude if these professions should remain. It is like trying to make cassettes come back in the time of iPods. It is important to document them, but maybe some of them should be relegated to obscurity,” she said.", 
    "section": "national", 
    "title": "Fading professions and their memories", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}