{
    "author": [
        "T K"
    ], 
    "text": "Despite talk of empowerment, DMK and AIADMK have not fielded more than 12% women candidates in elections since 1991\n\nThe highest per cent of women from a major political party contesting the elections in Tamil Nadu since 1991 is merely 16. This is not even half the percentage of seats that the women's movement has been demanding in the Lok Sabha and State Assemblies (33 %) for over 18 years now.\n\nAn overall analysis of Assembly election statistics since 1991 shows that of the two major political parties in Tamil Nadu, the DMK has not touched the double-digit mark in percentage terms while fielding women candidates.\n\nThe Hindu has taken 1991 as the base year to reflect the re-emergence of the AIADMK as a single entity post the split in 1989, when two factions of the party led by Jayalalithaa and MGR’s wife Janaki fought at the hustings. The data reflect women candidates fielded by individual parties and do not take into account electoral alliances. The data also do not include results of by-elections held in this period.\n\nBetween 1991 and 2011, the DMK fielded 797 candidates with 51 women aspirants. The AIADMK had nominated 830 candidates to the polls – 93 of them women. On an average, across five elections, the DMK fielded merely 6.4 per cent women candidates and the AIADMK 11.2 per cent.\n\nAs for individual elections, the AIADMK had 16 per cent women candidates in 1991, 6 per cent in 1996, 15 per cent in 2001, 12 per cent in 2006 and 7 per cent in 2011. The DMK had 3.4 per cent in 1991, 4 per cent in 1996 and has maintained nearly 9 per cent in 2001, 2006 and 2011.\n\nThe maximum number of women candidates the AIADMK fielded at the hustings was 27 in 1991, when all of them won. The DMK fielded a maximum of 16 in 2001 with none of them winning.\n\nIn fact, women in Tamil Nadu have filed more nominations as independents than as nominees of political parties.\n\n“Politics is still largely a male-dominated bastion. We definitely need more women, especially independent women in politics. When you make policies and laws, women’s points of views should be taken into account. When women have entered other fields, the changes have been dramatic,” DMK MP Kanimozhi told The Hindu .\n\n“It is shameful that even 69 years after Independence, women are still fighting for 33 per cent reservation. Overall, we need more representation from women in politics from all parties. Even in the AIADMK, the fact remains that despite the perception that women get more representation when the party is in power, there are only two Ministers in the government,” actor and national spokesperson of the Congress Khushboo Sundar, said.\n\nMale-centric\n\nBoth the women politicians agreed that the demands on time of a female MP or MLA were huge. “Women feel that there are a lot of responsibilities in politics and they feel that they have to take care of their family and children,” Ms. Khushboo said.\n\n“If you look at Delhi, sometimes meetings stretch till 1 am or 2 am. Even the timings politics demand, it is very male-centric,” Ms. Kanimozhi added.\n\nWhen asked if there could be a change at least at State-level politics this time around with more women representation, both ducked the question with an almost similar answer – “When there are possibilities” and if there were “right and deserving candidates”, they would be accommodated. But both concurred on one point – there is a need for strong political will to have more women representation in politics.", 
    "section": "national", 
    "title": "Fair share a distant dream for women in politics", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}