{
    "author": [
        "Special Correspondent"
    ], 
    "text": "SISMA has said that paying more than FRP will be difficult for mills\n\nAyilai Sivasuriyan, district secretary of the Tamil Nadu Vivasayigal Sangam, raising the issue of employment for local youth in the TNPL at the farmers' grievance day meeting in Tiruchi on Friday.— OTO: B. VELANKANNI RAJ\n\nFarmers’ representatives of the district have urged the State government to ensure that private sugar mills paid the State Advised Price (SAP) for sugarcane this crushing season.\n\nRaising the issue at farmers’ grievances meeting here on Friday, a cross-section of farmers pointed out that the State government had fixed the SAP at Rs. 2,850 a tonne, which is Rs. 550 a tonne more than the statutory Fair and Remunerative Price (FRP) of Rs. 2,300 set by the Centre. The SAP includes Rs. 100 per tonne as cost for transporting sugar.\n\nThe South Indian Sugar Mills Association (SISMA) had said that paying any higher price over FRP would be beyond the means of sugar mills.\n\nThe government should ensure that the State government order should be implemented fully by the private sugar mills, said R. Raja Chidambaram, State secretary, Tamizhaga Vivasayigal Sangam. To a question from P. Ayyakannu, president, Desiya Thennidia Nadigal Inaippu Vivasayigal Sangam, a representative of a private sugar mill said they were paying the FRP as of now and would go by the decision of the SISMA.\n\nN. Veerasekaran, coordinator, Ayyan Vaical Pasanatharar Sangam, demanded the district administration convene a tripartite meet to sort out the issue.\n\nAyilai Sivasuriyan, district secretary of the Tamil Nadu Vivasayigal Sangam, affiliated to the Communist Party of India, urged the State government to ensure that local youths and members of families which have provided lands for the newspaper board manufacturing factory of the Tamil Nadu Newsprint and Papers Ltd at Mondipatti in the district were accorded preference in jobs at the unit.\n\n“Though there was some opposition from farmers for acquisition of land for the factory, we supported the project hoping it will help generate employment for the local people,” he said.\n\nProducing a bottle of brackish water purportedly brought from the Cauvery, Mr. Ayyakannu urged the district administration to take steps to prevent the discharge of municipal sewage into the river at six places in the district. “Water is being let out in the river for people to take a holy dip during mahamaham,” he pointed out.\n\nR. Subramanian, deputy secretary, Cauvery Delta Farmers Welfare Association, called upon the district administration to ensure that the current release of water in the Cauvery benefitted farmers dependent on the 17 irrigation canals between Mettur Dam and Grand Anicut. “Water should be released in these canals,” he said.\n\nP. Viswanathan of the Tamizhaga Eri Mattrum Attru Pasana Vivasayigal Sangam demanded that the government waive all crop loans. A group of members of the Communist Party of India staged a brief demonstration during the meeting urging the district authorities to issue pattas to 300 unorganised sector workers at Manikandam.", 
    "section": "national", 
    "title": "Farmers demand SAP for sugarcane", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}