{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sponsor can have her name displayed on cages\n\nThe civic body spends around Rs. 3.5 lakh a month on the birds, and animals at the zoo.\n\nNow citizens can sponsor the cost of feeding, or maintaining animals, birds in the Coimbatore Corporation zoo, as the civic body on Friday passed a resolution the paving way for such a scheme.\n\nThe resolution said that the civic body spent Rs. 3.25 lakh a month to feed and care for 900 birds and animals.\n\nThe income from the zoo by way of visitors’ entry ticket was just Rs. 2 lakh.\n\nTo bridge the gap, the civic body had decided to tap individuals, companies for funds.\n\nThe sponsors could have their names displayed on the cages/enclosures, the resolution also said.\n\nAside from seeking the sponsor, the civic body, by way of another resolution also decided to spend Rs. 75 lakh to improve amenities and animals’ upkeep in the zoo.\n\nIt would use a part of the money for the VOC Park as well.\n\nIn another resolution, the civic body said that it would soon release animals and birds that were taken to the zoo for treatment of injuries. Continuing to keep them at the zoo led to space constraint for animals, birds that could otherwise be kept only in a zoo.\n\nTo rehabilitate the animals, birds and provide additional space the civic body decided to rehabilitate those, the resolution explained.\n\nThe council approved the proposal by a Hyderabad-based company to dig tunnel in Peria Combai and Kattan hillocks for Rs. 66 lakh for laying additional pipeline to carry Pilloor water.\n\nIt also decided to plan afresh the skywalk project near the Singanallur bus stand, and cancelled a resolution for buying new vehicles.\n\nMayor P. Rajkumar said that like other government departments/organisations the corporation too could go in for hired vehicles to save cost.\n\nEarlier during the meeting, the Councillors sought early execution of works that the council had already approved of, fogging to control mosquitoes, reconstruction of roads damaged during the execution of underground drainage works and rehabilitation of those families living at the Thanneerpandal Road S Bend junction.", 
    "section": "national", 
    "title": "Feed an animal at zoo", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}