{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Wants screening tests, interview for certain posts in Group B and C\n\nThough the decision of the Puducherry Government to conduct direct recruitment on its own without making reference to Union Public Service Commission (UPSC) only through written test to the Non-Gazetted Group B and C posts is by and large a welcome measure, a demand has arisen to conduct screening test and personal interview for certain posts.\n\nFormer Member of Parliament and AIADMK functionary M. Ramadass said, “There are a few positions in Group B category which carry greater responsibilities and stature for the recruitment of which both screening test and personal interview with appropriate weightages as is done by UPSC may be desirable. Therefore, the process of interview may be retained in exceptional cases depending on the nature of post under Group B Category rather than completely discontinuing it. Framing of proper recruitment rules to various posts may solve this issue.”\n\nIn passing, an apparent contradiction to the recent decision of the government may be noted in the proposed appointment of non Gazetted Assistant Professors (20) in the society run Perunthalaivar Kamarajar Institute of Engineering and Technology, Karaikal. This college will recruit not on the basis of merit based written test as decided by the government but only by an interview process.\n\nDr. Ramadass said, “Recruitment only through interview is susceptible to improper selection through various influences and pressures and the merit will be compromised. Therefore it is suggested that the college may be instructed to conduct a screening test followed by academic assessment and interview. Candidates with NET/SLET qualification may be exempted from screening test. However, this suggestion also has administrative difficulty. In case the government opts for only the advertised process of interview, it should be done in the most professional manner as is done in IITs without giving any scope for influence.”\n\nFill teachers’ posts\n\nthrough counselling\n\nMeanwhile, Puducherry UT School Teachers’ Federation urged the UT Government to conduct counselling to fill the vacant posts of lecturers in the schools. It also pointed out that vacant lecturer posts in schools last year had been filled through conducting counselling in transparent manner. Now again another 100 vacant posts are to be filled by the School Education Department.\n\nS. Edward Charles, joint secretary of the federation said, “Following request from our association to Chief Minister and Education Minister, the School Education Department has issued a notification to fill 92 vacant posts but there was no mention of conducting counselling. The filling of the posts without counselling contrary to the transfer policy, is mockery on the credibility of administration.”\n\nThe federation also said the decision to fill the posts without conducting counselling would set bad precedent. The office bearers of the federation also appealed to the authorities to issue fresh notification to fill vacant posts through promotion by conducting counselling only.\n\nRecruitment only through interview is susceptible to improper selection, says Ramadass", 
    "section": "national", 
    "title": "Former MP calls for proper recruitment rules", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}