{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a bid to protect chilli growing farmers, who were forced to sell their produce to commission agents at high commission rates, the government has established four companies with farmers as stake holders to procure and market the produce from this season, commencing in April.\n\nGiving details of the companies at the farmers’ grievance redressal meeting, chaired by Collector S. Natarajan here on Friday, M. Rajagopal, Deputy Director, Agri business said the department of Agriculture Marketing and Agri business has established one company while three other companies have been set up by Non Governmental Organisations (NGOs) with NABARD assistance.\n\nThe Ramnad Chillies Producers Company Limited, established at Mudukulathur by the department has 1,000 farmers as members, each holding a share of Rs. 1,000. The company has elected a Chairman and Board of Directors for the purpose of procuring and marketing their produce, he said.\n\nThe NGOs have established Ramnad Farmer Producers’ Company limited at Perunali in Kamudhi taluk, Ramnad Mundu Chillies Producers’ Company Limited at Paramakudi and Neythal Sustainable Agriculture Producers’ Company Limited at Abiramam, he said.\n\nAll the companies were registered under the Companies Act and they would start functioning from this season, he said adding they would help chilli growing farmers, especially those who cultivated ‘Ramnad mundu,’ the native variety, which commanded good demand in the domestic and foreign markets to get a better price and protect them from commission agents.\n\n‘Defunct’ markets\n\nAs the six regulated markets in the district, which were established to help farmers sell their produce at the highest bid by a trader in auction, virtually became ‘defunct,’ the Companies were expected to make a big difference for the farmers. In the absence of any regulated mechanism, the farmers were forced to sell their produce to commission agents at throw away prices, the farmers said.\n\nLast season, they paid an all time high of 8 per cent commission to the agents, they said.\n\nSeven big trading companies run the market in the district and the 180-odd agents procure the chillies for them on commission basis, they said.\n\nThe farmers should bring their produce to the agents’ premises and sell it at the rate fixed by them, they lamented.", 
    "section": "national", 
    "title": "Four companies set up to help chilli growers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}