{
    "author": [
        "Annie Philip"
    ], 
    "text": "The siren at the Grand Bazaar which stopped working 20 years ago has been reinstalled, reminding vendors and residents of a time gone by.\n\nThe Puducherry Municipality has repaired the siren, and it now rings at 8 a.m., 12 p.m. and 6 p.m. “Many people in the market had told us that it would be nice to have the siren again. At a time when the mills were active, dating back to the French rule here, the sirens could be heard from the Swadeshi, Bharathi and AFT Mills signifying the end of a shift period. The siren in Grand Bazaar is part of the heritage of Puducherry, and we wanted to bring it back,” says Puducherry Municipality Commissioner R. Chandirasekaran.\n\n“The sound of the siren signifies the life and strength of the market. All of us vendors and those working in the market have welcomed the move to bring the siren back,” says Lourde Mary, a vegetable vendor, who has worked in the Grand Bazaar all her life. She adds that earlier, the siren was at the Grand Bazaar clock tower, and that it has gone through several rounds of repair in the past as well. “The siren is like us; the way we age, it also ages,” she says.\n\nEven in this age when people refer to their watches or mobile phones to know the time, having a siren is helpful, says Ms. Mary. “For the illiterate, hearing the siren on time is useful. It helps everyone plan their day. Earlier, the siren from the Roddiar Mill could be heard all through Puducherry town. It has, of course, now fallen silent,” she says.\n\nThe Puducherry Municipality also plans to undertake repairs in the garden near the Kargil memorial, and the statues and fountains inside Bharathi Park. Apart from this, it has repaired the Grand Bazaar clock tower which was lying in a state of disrepair for long. The Puducherry Municipality plans to also repair Petit Bazaar clock tower and the Muthialpet clock tower soon, said Mr. Chandirasekaran.", 
    "section": "national", 
    "title": "Grand Bazaar siren makes a comeback, traders nostalgic", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}