{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Friday sought the response of State Government to a public interest litigation petition seeking appointment of skilled individuals as non official members of Board of Visitors headed by Collectors in every district and entrusted with the responsibility of keeping a check on living conditions in prisons.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran also called for a status report on the issue since the PIL petition filed by People’s Watch, a non-governmental organisation represented by its executive director Henri Tiphagne, had claimed that non-official members were yet to be appointed for most of the prisons in the State in accordance with the Prison Manual.\n\nIn an affidavit, he said: “Prisons have traditionally been and still remain closed institutions. The physical structure of prisons and the archaic rules of management of these punitive institutions endow them with a cover of obscurity in which human rights can be unofficially violated and officially denied.\n\n“Over the years, prisons have become places where cruel conditions prevail. In particular, the conditions in prisons for women have not improved despite directions issued by the High Court… Unfortunately, the State’s supervision over the day to day happenings within such institutions has become a mere formality and the absence of surveillance by society is conspicuous.”\n\nStating that Rule 338 of Tamil Nadu Prison Rules, 1983 and the provisions of the Prison Manual provide for appointing Members of Legislative Assembly, social workers, and those interested in correctional works such as psychiatrists and psychologists as non-official members of Board of Visitors, he said their regular visit to prisons could improve the living conditions to a great extent.\n\nThe conditions in prisons for women have not improved despite directions issued by the HC", 
    "section": "national", 
    "title": "HC seeks status report on appointment of non-official members to inspect prisons", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}