{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Hike unlikely as Assembly and local body polls are scheduled this year\n\nEven though higher taxes and user charges will automatically follow improved services in a Smart City, residents can take comfort in the fact that the State government is unlikely to take any sudden decision to increase taxes and user charges during the election year.\n\nWith the Assembly and local body elections scheduled this year, the State government is unlikely to take any decision to increase revenue receipts, including property tax.\n\nChennai Corporation collects just Rs. 600 crore as property tax every year. The plan is to increase the property tax collection to at least Rs. 2,000 crore.\n\nAs no increase cannot be effected this year, implementation of a few smart proposals may suffer.\n\nPedestrian plaza\n\nThe pedestrian plaza, which has been included in the Smart City proposal for T. Nagar, has also been delayed due to lack of funding for the project.\n\nGiven this, the civic body is expected to borrow heavily from development banks, float municipal bonds and use land-based financing instruments based on the recommendations of the Fourteenth Finance Commission.\n\nThe government is also expected to increase conversion charges collected at the time of change in land use and levy a betterment tax for areas covered under the Smart Cities project.\n\nFinance Commission\n\nSome of the recommendations of the 14th Finance Commission include higher charges for claiming additional Floor Space Index as a right.\n\nThe Corporation could use these instruments, but to do so, they need approval from the State government.\n\nIn addition to the Rs.100-crore funding from the Central government and a matching contribution by the State government, this year at least Rs. 500 crore is expected to be spent on the Smart City proposals.\n\n“We will explore options such as public-private partnerships, land-based instruments, municipal bonds and borrowings. But convergence with other government schemes will hold the key to implementation of some proposals this year,” said an official.\n\nBased on the project by the Department of Economic Affairs for assessing Chennai for credit-worthiness and bond-readiness, work on yet another transaction could also be taken up shortly.\n\nPlan to increase property tax collection to at least Rs. 2,000 crore a year", 
    "section": "national", 
    "title": "Higher taxes will follow, not for now", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}