{
    "author": [
        "M K"
    ], 
    "text": "Forty-five-year-old security guard Ravi, small scale businessman Stephen, and Dinesh who works in employed in a private company are among the 25 home guards who would be playing instruments in the soon to be formed band of home guards.\n\nThe band will be at par with that of the city police. As of now home guard units in Salem, Tirupur, Tiruchy, and Chennai have a band.\n\nCity Police Commissioner A. Amalraj, who is also commander of home guards, said that the band will be used for the official ceremonies of home guards and will also be allowed to play for private events.\n\n“It will help them have an additional source of income,” he said.\n\nArea Commander of the home guards in the city T.K. Dhanashekar said that there are 495 home guards in the city among whom 25, including two women, had evinced interest in joining the band.\n\n“Five of them are playing in small bands and the rest are those who are interested in playing an instrument,” he said.\n\nThey will be trained by the band of the city police to play the instruments, to march, and place the instruments. Uniforms and instruments will be provided to them free of cost.\n\nThe home guards\n\nNinety per cent of the home guards are drivers, electricians, painters, plumbers, security guards, small scale vendors, employees, or students.\n\nAnd the rest are unemployed.\n\nAround 200 of them take turns to regulate traffic during the peak hours in the morning and evening from Monday to Saturday, based on their work timings.\n\nThe police are planning to increase the strength deployed for traffic management to 250 a day in the next few months.\n\nThrice a week around 80 of them are involved in night duty with the law and order police.\n\nIn addition to these primary duties, home guards are also involved in crowd management for temple festivals and during VIP visits.\n\nThey handle road safety classes for school students at the traffic park on the Dr. Balasundaram Road.\n\nIn November and December last year 75 persons were newly inducted into the force in the place of as many home guards who were not regular to duty.\n\nMost of the home guards attend to at least 15 calls (duties) a month for not less than four hours each.\n\nThey are paid Rs. 150 a day and the money is credited to their bank accounts on a monthly basis.", 
    "section": "national", 
    "title": "Home guards to have own band", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}