{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nVikasatarangini : Discourse on Gita, Mani Higher Secondary School, 6:30 p.m.\n\nRathina Vinayakar Temple: Special abishegam, DB Road, 8.30 a.m.\n\nCULTURE\n\nSri Thyaga Brahma Gananjali: Music festival, Sri Venugopalaswamy Temple,\n\n5:30 p.m.\n\nGENERAL\n\nCoimbatore People Welfare Association, Herbal Tree Growers Association and Akshayamani Publishers: Herbal, medical and traditional food exhibition, Government High School, Ganapathy 10 a.m.\n\nShree Coimbatore Gujurati Samaj: Free naturopathy camp, Mettuppalayam Road,\n\n8 .a.m.\n\nKrishna Academy of Human Behavioural Science: Foundation course on hypnotism, Pethi Naidu Auditorium, 10 a.m.\n\nICICI Prudential Mutual Fund and The Hindu BusinessLine: Investor Education initiative, Hotel Taj, Race Course Road,\n\n6 p.m.\n\nSt. Joseph’s Matriculation Higher Secondary School: Celebrating Kalai Sangamam, 5 .p.m.\n\nSri Venkataeswara Group of Institutions: Programme on How to write and publish a research paper.\n\nThe Coimbatore Productivity Council: Programme on APQP implementation and PPAP guidelines for customer delight,\n\n9:30 a.m.\n\nCoimbatore Vizha - Kovai Foodies: Old Coimbatore Heritage –Food walk, Tamil Nadu Mercantile Bank building, Big Bazaar Street, 6 p.m.\n\nGem Hospital & Research Centre: Exhibition on women’s health, 9 a.m.\n\nKarpagam College of Engineering: Conference on ‘Innovations and engineering and technology,’ 10 a.m.\n\nCoimbatore Institute of Management and Technology: Reunion of 2001-03 Batch MBA students, 10 a.m.\n\nKPR Institute of Engineering and Technology: ‘Enthusia 2016,’ 10 a.m.\n\nThe PSBB Millennium School: Annual day, 6:30 p.m.\n\nAngappa College of Arts and Science: Consumer festival, 10.am.\n\nDr. P.G.V. Matriculation Higher Secondary School: Annual day, 5:30 p.m.\n\nTIRUPUR\n\nButterfly Sneeze Media Private LTD: Young Writer’s Literary Awards-2015, results of Tamil Nadu Inter-School Creative Writing Competition, Century Foundation Matriculation Higher Secondary School,\n\n11 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}