{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Muthu Mandapam, a memorial for Sri Vikrama Rajasingha\n\nA rusty signboard marks the lane leading to Muthu Mandapam near the banks of the Palar river, off the busy Katpadi Road. It is the resting place of the last ruler of the Sri Lankan kingdom of Kandy, Sri Vikrama Rajasingha, since 1832.\n\nSaturday (January 30) will mark the death anniversary of this “Tamil-speaking” ruler of Kandy. Though Muthu Mandapam, the memorial built around his tombstone, as a locality is popularly known among Velloreans, the place is not frequented by many.\n\nAs a layer of dust on the floor is swept away by Muniyamma, an elderly woman, the tomb of this king stands tall inside this pearl-shaped structure that was raised in 1990. It also houses tombs of seven of his family members.\n\nKnown as Prince Kannasamy, Sri Vikrama Rajasingha, a king of the Nayaka dynasty, was sworn in during 1798. He ruled Kandy till 1815, after which he was exiled by the British. He, along with a few of his family members, were taken as royal prisoners and imprisoned in Vellore Fort in 1816.\n\nPlaques in Muthu Mandapam hail him Sri Lanka’s last Tamil King, and note that he was housed in a room inside the fort for 16 years. This room later went on to be used as the Registrar’s office of the Vellore district.\n\nHe died on January 30, 1832. Among his family members, who were laid to rest here, are his queen Savithri Devi and other spouses.\n\nThe Tamil Nadu government had constructed pearl-shaped structure over the tombs, which were earlier in the open amid huts in the area, at a cost of Rs. 7 lakh. Former Chief Minister M. Karunanidhi inaugurated Muthu Mandapam on July 1, 1990. The pearl-shaped structure was known to be designed by him.\n\n“The chess board and boomerang used by the king are on display at the museum. While the chess board is made of wood, the chess coins and boomerang are made of ivory,” said K. Saravanan, curator, Government Museum, Vellore.\n\nThe Muthu Mandapam is under the maintenance of the Public Relations Office. Staff said that every year, the descendants of the king living in Madurai and Chennai visited the memorial on his death anniversary.", 
    "section": "national", 
    "title": "Last ruler of Kandy has his resting place in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}