{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Thiruvarutpa,’ by M. Vijayaraman, Railway Colony, 7 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Sundarar Tirupaatu,’ by R. Umarani, S.S. Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse by Kaliyamoorthi on ‘Thirukural’ 5.45 p.m.; Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPanniru Thirumurai Mandram: Tirupugazh Sindanai Vattam, N.S. Sundararaman conducts, Sri Dhandayuthapaniswami Temple, Iravathanallur, 5 p.m.\n\nSt. Lourdes Shrine: 96{+t}{+h}anniversary celebrations, special prayers and songs, K. Pudur, 6 p.m.\n\nCULTURE\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nDeputy Director of Medical Services (Leprosy): Inauguration of fortnight-long leprosy eradication programme, Collector K. Veeraraghav Rao, chief guest, flags off rally, S. Rajamohan, DD (Leprosy), presides, Gandhi Memorial Museum, 8.30 a.m.\n\nVirudhunagar TSM Manickam Nadar-Janaki Ammal Higher Secondary School: 40{+t}{+h}Ruby Fiesta, A.T.B. Bose, secretary, Vellaichamy Nadar College, chief guest, LAMK Natarajan Auditorium, New Ramnad Road, 5 p.m.\n\nPandugudi Sri Lakshmi Narayana Vidyalaya: Fifth Annual Day celebration, S. Narayanan, chairman, presides, R. Srinivasan of Sastra University addresses, A. Valayapatti, Alagarkoil, 3 p.m.\n\nAnanth Memorial Matriculation Higher Secondary School: 48{+t}{+h}Annual Day celebration, K. Velusamy, General Manager, Canara Bank, presides, C. Balasubramanian, chief Manager, distributes prizes, DD Road, Arapalayam, 5 p.m.\n\nSaraswathi Narayanan College: One-day workshop on research methodology for part-time M.Phil. scholars, A. Ponnusami of Madurai Kamaraj University, chief guest, Principal M. Kannan presides, 10 a.m.\n\nYadava College Alumni Association: General body meeting, Nagendranar Auditorium, 10.30 a.m.\n\nSethu Institute of Technology: Women empowerment cell conducts Hajia Mohideen Fathima Memorial inter-school competition for girls, S. Mohamed Jaleel, chairman, presides, S.M. Seeni Mohamed, CEO, addresses, Pavendar Bharatidasan Arangam, 2.30 p.m.\n\nNational Institute of Personnel Management, Madurai Chapter: ‘HR Professionals Day 2016,’ T.K. Srinath, president-Human Resources, TVS Tyres, chief guest, Hotel Rajadhanee, 4 p.m.\n\nBharathi Ilakkiya Peravai: Remembering Mahatma Gandhi, Justice N. Kirubakaran garlands Gandhi statue, Gandhi Memorial Museum, 9 a.m.\n\nTyaga Deepam Peravai: Death anniversary of Mahatma Gandhi, R. Chokkalingam addresses, TPK Road, 8.50 a.m.\n\nJanata Dal: Mahatma Gandhi death anniversary, State general secretary K. John Moses presides, Amman Sannidhi, near Meenakshi Sundareswarar Temple, 10 a.m.\n\nPeople’s Anti-Corruption Movement: Executive committee meeting, Tamil Nadu Sarvodaya Office building, Gandhi Museum premises, 4.45 p.m.\n\nGandhi Memorial Museum: Martyrs Day, M.P. Gurusamy, secretary, Gandhi Museum, presides, 9.30 a.m.; inter-religious prayer, Gandhi Museum, 4.30 p.m.\n\nPress Information Bureau: Public information campaign, third day event, ‘Women empowerment and skill development for neo-entrepreneurs,’ R. Jayaraman, Member Secretary, Centre for Entrepreneurship Development, speaks, 10 a.m.; valedictory function, M.R. Vairamuthu Raju, Dean, Madurai Medical College, chief guest, E. Mariappan Director (News), Pothigai TV, Chennai, presides, Medical College auditorium, 4,30 p.m.\n\nIndian Medical Association: Continuing Medical Education programme, S. Babu, president, presides, paediatrics and neurology specialists speak, IMA Hall, 2 p.m.\n\nRamya Neuro Hospital: Neuro medical exhibition, IMA Hall, Panagal Road, 10 a.m.\n\nSBOA Matriculation Higher Secondary School: Seven-day NSS camp, cleaning school campus, 8 a.m.; talk on yoga and its benefits by C. Napoleon, Melakuyilkudi Community Centre, 2 p.m.\n\nMangayarkarasi College of Arts and Science for Women: National-level conference on ‘Walk on soft computing,’ Dr. A. Rengarajan of Veltech Multitech, Chennai, speaks, 10 a.m.\n\nTOPKIDS: Counselling at Railway Hospital, 10.30 a.m.; workshop on ‘Training the trainers,’ Sacred Heart Nursing College, 9 a.m.\n\nM.S. Chellamuthu Institute of Mental Health and Rehabilitation: One-day programme on ‘Enriching self as a counsellor,’ Dr. Rajaram, psycho-social consultant, Bengalurur, speaks, No. 14 Vythianatha Iyer Street, Shenoy Nagar, 10 a.m.\n\nAlcoholics Anonymous: Meeting, Quality Care Hospital, Ellis Nagar, 7 p.m.", 
    "section": "national", 
    "title": "Madurai today for jan 30 Saturday", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}