{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Media should be prudent about how climate change and environment issues were presented as the way these issues get reported influenced the response of public and authorities, said Radhika Mittal, a media sociologist and public discourse analyst associated with The Energy and Resources Institute (TERI) University in New Delhi.\n\nSpeaking at the three-day training programme for young and aspiring vernacular journalists at Madurai Kamaraj University on Friday, Ms. Radhika said that media should avoid taking extreme standpoints and instead focus on being more analytical.\n\n“If the climate change issues get reported as a looming apocalypse, people may just feel that nothing could be done. It will be better if media focused on how climate change affects local communities and what can be done to mitigate the impact,” she said. “For instance, a series of articles could have been done regarding the recent Chennai floods on the underlying urban planning issues. It is a complex story that needed to be told,” Ms. Radhika added.\n\nAsserting that environmental reporting was not given the needed importance in Indian media, Ms. Radhika said that very few media houses had dedicated journalists covering environmental issues with a broader perspective.\n\nHowever, she pointed out that Indian media, unlike the one in USA, had rightly accepted the credibility of science behind climate change. “It is a good thing that Indian media is not unnecessarily focusing on raising doubts about climate change science,” she said.\n\nThe training programme was organised by the School of Linguistics and Communication (SLC) of the university in collaboration with Earth Journalism Network and Internews.\n\nS. Nagarathinam, Associate Professor and Chairperson in charge of SLC, said that about 50 journalists from various vernacular media participated in the conference. He said that utmost care was taken to ensure that the training programme was organised in a carbon neutral manner. “Even the invitation for the function was printed on paper produced form dried leaves,” he said.", 
    "section": "national", 
    "title": "‘Media must be prudent while presenting environment issues’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}