{
    "author": [
        "Dennis S"
    ], 
    "text": "Southern Bench of Nation Green Tribunal (NGT) here has directed Public Works Department and Madurai Corporation not to allow throwing of garbage or debris in the 83-km-long Kiruthumal channel flowing through four southern districts and to remove existing garbage for a free flow of water.\n\nThe Bench, comprising Justice P. Jyothimani and expert member R. Nagendran, made the observation on an application by N. Alagumuthu Velayudam Pillai of Thiruppalai, who sought a direction to authorities to maintain Kiruthumal channel free from pollution and encroachments, and constitution of a high-level committee to monitor the channel and submit periodical reports.\n\nWhile a 13-km stretch of the channel, a tributary of Gundar river, was within Madurai Corporation limits, the remaining course was going Madurai, Virudhunagar, Sivagangai and Ramanathapuram districts.\n\nMadurai Corporation, in its reply, had stated that a detailed project report (DPR) was to be prepared for desilting and lining the channel within its limits.\n\nThe tribunal was also informed that a similar issue was pending before the Madurai Bench of the Madras High Court in three writ petitions and the High Court had appointed a committee comprising experts to look into the issue.\n\n“We make it clear that based on the said committee report, it will be always open to the Madurai Bench of the Madras High Court to pass orders and we have restricted ourselves only regarding the removal of garbage and debris on the river of Kiruthumal within Madurai city as well as outside the city,” the bench said.\n\nRiver as old as Vaigai\n\nThe applicant claimed that Kiruthumal river was as old as the Vaigai and was referred to in various epics of Hindus.\n\nThe river had been polluted by the unscrupulous conduct of the people and the authorities in allowing waste materials to be dumped in it.\n\n“We make it very clear that the PWD as well as Madurai Corporation shall not allow any garbage and debris to be put in the river and the existing garbage and debris should be removed immediately to see that the free flow of water is maintained within Madurai city. We also direct the PWD to take all appropriate actions for the purpose of removal of encroachments and to see that the free flow of water even outside the city is maintained,” the Bench said in its order.", 
    "section": "national", 
    "title": "NGT orders removal of debris from Kiruthumal flowing through 4 districts", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}