{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Bharatiya Janata Party in Tamil Nadu has no condition for alliance with other parties except that there has to be a commitment to good, corruption-free governance. It is also willing to be a junior partner in an alliance, said Muralidhar Rao, National General Secretary, in an exclusive interview to The Hindu here on Friday.\n\nIt was talking to a few parties, social organisations and forces to forge alliance. In the process of forming an alliance, if the party recognises the strength of the partner, it accepts the same without qualms. It was not keen on chief ministership, either. “In short, there’s no rigidity as far as alliance is concerned,” he said.\n\nHe said that the party would soon decide on its election leadership as it very well understood the need for having one in the State where personalities mattered the most. The decision would form part of the party’s election strategy. The party would decide on its election leadership also factoring in the alliance.\n\nAt present, the party was keen on projecting Prime Minister Narendra Modi’s leadership and achievements. He was not unduly worried as the leadership had given the National Democratic Alliance only two seats in Tamil Nadu in the 2014 General Election. The leadership had worked for Tamil Nadu.\n\nFishermen issues\n\nSince Mr. Modi assumed office, not a Tamil fisherman was killed for reportedly crossing the International Maritime Boundary. In the UPA regime around 550 fishermen were killed. Under Mr. Modi, the fishermen were also getting periodically released from the prisons in the Island nation.\n\nThe Prime Minister had taken an aerial survey of flood-affected areas, disbursed relief and the Central Government’s response to the disaster was far better than the State’s. On the issue of nurturing Tamil identity and culture too, the BJP’s government was far more sensitive than previous ones.\n\nBut has the party successfully carried the Government’s achievements to the public?\n\nThere could be communication gap, but the BJP was trying to overcome those by forming alliance with various social groups. The understanding with the Devendrakula Vellalars was a part of this reach out. It was in talks with other communities, social organisations as well, he said.\n\nAt the same time, Mr. Rao said that BJP was also trying to occupy the vacuum created in Tamil Nadu by what he termed the “disappearance” of the Congress. The vacuum, the public discourse for an alternative beyond the two leading Dravidian parties, and the appeal of the Prime Minister would work in the party’s favour in the coming Assembly election, he added.\n\nIn response to a question from journalists, he replied that Mr. Modi’s February 2 public meeting would have a lasting impact in the State’s electoral politics.", 
    "section": "national", 
    "title": "No rigidity in alliance for State polls: BJP", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}