{
    "author": [
        "K Manikandan"
    ], 
    "text": "The first few months of this year are expected to witness new launches\n\nWhen 2015 was half way through, the realty sector was upbeat and there were signs that the year would draw to a close on a more cheerful note.\n\nBut these expectations were dashed in December, when city’s infrastructure suffered a large-scale damage due to floods.\n\nAnd, for the realty sector, the year ended on a low, its worst in five years.\n\nHowever, the outlook is not entirely gloomy for the industry as the number of unsold stock has reduced significantly.\n\nA good start\n\nThe first few months of this year, which are part of the festival season, might see new launches, in keeping with the annual trend.\n\nThese are some of the findings by Knight Frank India, based on the real estate trends from July to December, 2015.\n\n“There was a supply and demand drop, lowest in the past 5 years, caused primarily due to the floods,” said Kanchana Krishnan, director, Chennai, Knight Frank.\n\n“The new year started on a positive note and already, there have been a few launches of good projects with good responses to them,” said Ajit Chordia, president, Confederation of Real Estate Agents Association of India, Chennai.\n\nHe said the announcement on Thursday to include Chennai and Coimbatore in the first batch of 20 smart cities could not have been made at a more appropriate time, he said.\n\nHe also added that they expected the market to be stable for the first few months of the year, before it picked up speed in the middle of the year.\n\nHe said that even during 2015, the industry had recovered from the setbacks of the previous year and was well poised for positive growth, but the incessant rains in November and the subsequent floods the next month were a setback, Mr. Chordia added.\n\nExperts in the industry also noted that investors had started looking at safe bets on property – either for investment or to move in.\n\n“Investors are exploring options more than before and spend a lot of time online checking for the best offers before finalising the deal,” said a representative of a leading construction company, preferring not to be named.\n\nHe said people also preferred to invest in housing plots as it appreciates faster than apartments.\n\nSo far this year, he added, the investments from NRIs in the realty was encouraging too.\n\nDue to the floods, 2015 ended on a low for the real estate industry, its worst in five years", 
    "section": "national", 
    "title": "Realty sector set for recovery", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}