{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Top bank’s officials hold talks with traders and businessmen in Thanjavur\n\nState Bank of India Chief General Manager B. Rameshbabu giving away loan sanction letter to a beneficiary at a function in Thanjavur on Thursday.— PHOTO: R.M. RAJARATHINAM\n\nThe State Bank of India (SBI), Chennai Circle, has pioneered recovery of dues from defaulting farmers who had failed to repay their farm mechanisation and tractor loans through a special one-time settlement offer.\n\nThe Special SBI OTS for Tractor and Farm Mechanisation Loans 2015-16 gives the farmer a real opportunity to exit the defaulting account without any hassle, SBI Chief General Manager, B. Ramesh Babu said here on Friday.\n\nStating that the SBI was intent on ushering in technology driven initiatives, Mr. Ramesh Babu pointed out he had visited Thethuvasalpatti near Kumbakonam, which had several tractor loan borrowers, and sensitised them to the advantages of the OTS and called upon them to utilise the scheme.\n\nBesides, the CGM along with General Manager, Chennai, G. Ravindranath, held discussions with the business and traders in Thanjavur and Kumbakonam on the issues pertaining to the SME sector. They promised to ease any difficulty in processing schemes or projects.\n\nMr. Ramesh Babu wanted more steps taken to disburse credits under the Pradhan Mantri Mudra Yojana to benefit traders and small business persons.\n\nThe scheme would help manufacturing, trading and services sectors in the non-farm sector with credit limits of up to Rs. 10 lakh, the CGM said.\n\nMr. Ramesh Babu said that the first mobile ATM in the Tiruchi Zone was launched in Thanjavur on Friday by the Bishop of Thanjavur Diocese, Rev. M. Devadass Ambrose, marking the intensification of technology driven initiatives by the bank in the zone.\n\nOn Thursday, Mr. Ramesh Babu inaugurated the new Swamimalai branch premises near Kumbakonam and handed over Mudra loans to identified beneficiaries. After inaugurating an e-corner at the Kumbakonam Bazar Branch, the CGM donated wheelchairs and stretchers to hospitals with funding under the Corporate Social Responsibility head.\n\nIn Thanjavur, Mr. Ramesh Babu launched a car and home loan mela and said that the bank was the leading lender in housing loan and car loan sectors.", 
    "section": "national", 
    "title": "SBI offers special settlement for farmers struggling with tractor loan", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}