{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Senior Tamil Maanila Congress (TMC) leader B. S. Gnanadesikan said that the party, entering its maiden electoral arena after its re-launch last year, has decided to adopt a wait and watch approach before finalising its alliance strategy for the coming Assembly elections.\n\nAddressing a party function here on Thursday night, he said party leader G. K. Vasan, who has been holding discussions with office bearers at various levels, was not in a hurry to finalise the electoral strategy when major political parties were playing it safe, keeping the cards close to their chests.\n\n“The party leadership is very clear that it should not take a decision contrary to the wishes of the people and repeat the mistake of 1996,” he said in an obvious reference to party’s alliance with the DMK after late leader G. K. Moopanar floated the party, breaking away from the Congress. “This time we will take a decision after gauging the pulse of the people,” the senior leader said but refused to throw any indication.\n\nHe said Mr. Vasan has clarified that he was not a Chief Ministerial candidate, but has asserted that the TMC-backed alliance would capture power in the State. The party was open on the alliance issue and there were no underground dealings, Mr. Gnanadesikan said.\n\nDismissing as totally incongruous, the survey conducted by the People Studies, he said after Mr. Vasan re-launched the TMC, walking out from the Congress, more than 80 per cent of the Congress men, including former MPs and MLAs threw their lot with him but the survey projected less than one per cent vote share for the party. The survey lacked credence, he said.\n\nOn the vexatious fishermen issue, he said a solution could be found if the authorities paved way for the fishermen to take up tuna long liner fishing in the Indian Ocean by dredging the sea for two kilometres near Danushkodi and appealed to the Modi government to consider the view.\n\nWelfare assistance\n\nMr. Gnanadesikan distributed welfare assistance to the poor at the function, organised by party east district president A. Ravichandra Ramavanni. Former MP Suba Udayappan, former MLAs K. S. K. Rajendran, Ram Prabu and office bearers Gunasekaran, Kannan Babu, Muniasamy, Murugavel Rajan, Ranganathan and Sethuraan were present.", 
    "section": "national", 
    "title": "“TMC to wait and watch before finalising alliance”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}