{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu Public Service Commission will conduct exams to fill around 10,026 posts notified by the government for 2016-2017. These include 4,513 posts for which exams were not conducted last year due to rains and floods.\n\nAwaiting notification\n\nThe TNPSC is awaiting the notification for as many as 5,513 vacancies in various categories.\n\nAround 4,931 vacancies in various departments are expected to be notified beginning February first week, said its chairman K. Arulmozhi, who released the recruitment plan report on Friday.\n\nThe vacancies are in Group IV services and for posts including block health statistician, jailor and assistant jailor, librarian and research officer and assistants in various departments.\n\nVacancies for CCSE (Group II services - interview posts), VAO vacancies and CCSE II (Group IIA services non-interview post) are also expected. Exams would be conducted to fill 29 deputy collector posts, 122 vacancies for block health statistician, 65 assistant jailor posts and seven jailor posts.\n\nFor the first time this year, it will conduct exams for the posts of tourist officer (five) and deputy manager (12) for ELCOT following a request from the government.\n\nExam for VAOs\n\nThe results of the examinations are expected to be released between the fourth week of February and the fourth week of June.\n\nThe exam for VAOs will be held on February 28 and for research assistant in evaluation for which there are 14 vacancies, the exam will be held on March 6.\n\nSince October 14 last, the results for exams conducted to fill 6,054 vacancies had been released.\n\nThese include assistant medical officers for Siddha, Ayurveda, Unani, Homoeopathy, 4,963 posts in group IV services and 203 vacancies in the Highways department, Dr. Arulmozhi said.\n\nDetails available online\n\nThe details of the posts and the date of exam and results are available on the commission’s website.\n\nFor the first time, exams will be conducted for the posts of tourist officer and deputy manager for ELCOT", 
    "section": "national", 
    "title": "TNPSC to fill 10,026 vacancies this year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}