{
    "author": [
        "S Prasad"
    ], 
    "text": "It is built at a cost of Rs 5.32 crore and is expected to benefit skilled artisans across the country\n\nThe much awaited Arts and Crafts village located on the backwaters of the Ariyankuppam River in Murungapakkam is expected to be inaugurated on Monday.\n\nModelled on the lines of the Dilli Haat, the Arts and Crafts village was designed by the Indian National Trust for Art and Cultural Heritage (INTACH) and the Puducherry Tourism Development Corporation (PTDC) at a cost of Rs.5.32 crore.\n\n4.1 acre expanse\n\nThe village located in an expanse of 4.1 acres was conceived to reinvigorate manufacture and sale of handicraft indigenous to various regions and is expected to benefit skilled artisans across the country.\n\nThe village will be inaugurated by Union Minister for Urban Development M. Venkaiah Naidu.\n\n“The project is envisioned as a centre showcasing the rich heritage of South India through its traditional arts, craft and textile industries. At the same time, the village also aims to promote local economic development by creating jobs in the rural eco-tourism sector. The intention is to get visitors to experience and engage with the different states of the south through the richness of their textiles and the intricacies of their craft,” A. Arul, senior architect of INTACH told The Hindu .\n\nThe crafts village has accommodation for more than 50 artisans to stay and work at a time.\n\nIt has 24 permanent stalls for artisans, a demonstration and exhibition block to showcase the masterpieces of various artisans, an open-air theatre and a conference hall and a workshop and training centre.\n\nPuducherry, being one of the popular tourist destinations in South India is well placed to promote this responsible tourism initiative.\n\nCapitalising upon Puducherry’s rich cultural and spiritual heritage, the goal of the village is to enable the city to serve as a complete tourist destination offering a myriad of facilities and activities, Mr. Arul said.\n\nPermanent facility\n\nThe village will produce, display and sell art and handicraft items. It will be a permanent facility functioning round the year. The idea is for tourists to be able to see artisans work in their natural environment.\n\nThey will be able to get a glimpse into the life of an artisan as well as purchase handicraft items directly. The Ministry of Handlooms and Textiles has promised to mobilise artisans and bring them to the village throughout the year.\n\nOpportunity for all\n\nMr. Arul said that the basic idea is that different craftsmen from all over the country should be given an opportunity to display their products.\n\nThis would also pave for a cultural exchange among the artisans. The stalls have no doors and will also be used for holding handicrafts exhibitions and melas round the year.\n\nAccording to a Tourism Department official, the richness of crafts from various states like terracotta, hand made paper, antiques, studio pottery and hand made goods will be presented in the village empowering the artisans towards a sustainable livelihood.\n\nHandicrafts of artisans from the village will be displayed at the crafts bazaar on the Beach Promenade here providing inter-connectivity between the bazaar and village and a fillip to tourism in the city.\n\nThe village can become self-sustaining model in the next three to five years.\n\nPlans are to construct a jetty and provide connectivity from the village to the archaeological site of Arikamedu and Chunnambar boat house in the second phase.\n\nThe crafts village can accommodate more than 50 artisans at a time", 
    "section": "national", 
    "title": "Venkaiah to inaugurate Arts and Crafts village", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}