{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Reckless vehicle users move in the narrow stretch at high speed\n\nAbsence of policemen and one-way traffic regulation on Rose Mary Higher Secondary School Road in Palayamkottai causes freequent accidents and poses a serious threat to the lives of children every day.— Photo: A. Shaikmohideen\n\nAbsence of police personnel and traffic regulation on a busy road housing four higher secondary schools at Palayamkottai poses a serious threat to children as uncontrolled rash driving and traffic violations cause frequent accidents.\n\nThough over 5,000 students are using the narrow Punithavathiyar Street connecting BSNL Office and Thiruvananthapuram High Road via Rose Mary Matriculation Higher Secondary School every day, no proper traffic regulation is in force. This often results in traffic congestions and heated altercations among irate road users.\n\nIf ‘one-way’ traffic system was enforced on this small road, vehicles dropping and taking the students would not take more than a minute before moving, felt the public.\n\n“One-way traffic system and deployment of a couple of police constables between 8.30 a.m. and 9.30 a.m. and between 3.30 p.m. and 5.15 p.m. on this road will ensure some kind of orderliness and curb reckless driving. Above all, they will ensure our children’s safety,” said a teacher working at one of the schools.\n\nWhen their repeated plea with the police went in vain, the schools deployed their Scout students to regulate traffic, but only less than half of the road-users were seen abiding by their instructions.\n\nThough speed-breakers have been erected near almost all schools here, the absence of police personnel encourages teens and a few others to scorch this narrow road with their speeding bikes and cars almost every day even as the children are either entering or leaving the school premises in fear.\n\nWhen the children were leaving their institutions on Thursday evening, a recklessly driven flashy multipurpose vehicle knocked down two bikes and an autorickshaw before coming to a halt after hitting a compound wall. A 12-year-old boy, Ramkumar, was injured in the mishap and was taken to hospital. His condition was stable, the doctors said.\n\n“The latest mishap has proved our worst fear… The police, besides enforcing one-way traffic system on this road, should deploy at least two constables here during the busy hours to ensure the children’s safety,” said S. Ramachandran, an autorickshaw driver who regularly drop children in one of the schools.", 
    "section": "national", 
    "title": "With no traffic policemen around, schoolchildren at risk", 
    "subsection": "tamilnadu", 
    "date": "2016-01-30"
}