{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A total of 490 wheelchairs will be used to enable differently abled persons to reach polling booths comfortably to cast their votes in the district, according to Collector T.N. Hariharan.\n\nAddressing a meeting of election officials here on Saturday, he said that ramps were constructed in all the 2,039 polling stations – 2,022 regular polling stations and 17 auxiliary polling stations – in the seven Assembly segments in the district.\n\nSpecial attention was paid to polling stations that had sizable number of differently abled persons. Wheelchairs would be provided to these stations for their convenience. Volunteers would also be deputed to these polling stations to help differently abled persons, he added.\n\nThe Department of Welfare of Differently Abled Persons and non-governmental organisations offered wheelchairs. The district administration too procured more than 300 wheelchairs for this purpose.\n\nMembers of the NGOs who did not have any political links or support would be roped in to help these persons.\n\nSmoking-free zones\n\nAll polling stations had been declared ‘no-smoking zones’. “We will intensify awareness to urge all sections of people, including members of political parties and polling officials, not to smoke during the polling process. The Election Commission of India had already issued a directive to all district-level electoral officers in this connection. Smoking was totally banned in all the polling stations,” he noted.\n\nAll efforts were on to achieve cent per cent polling in the district. Effective awareness was created among voters in rural and urban areas. Voters in remote villages too were covered, he added.\n\nTheni\n\nThe district election officials had intensified campaign through street plays, awareness rallies, distribution of pamphlets and door-to-door campaign in areas with polling stations that had witnessed low voter turnout in Theni district. Folk artistes were engaged in creating awareness at Jangalpatti village in Bodi segment as voter turnout was very low there in the last Lok Sabha polls, said Collector N. Venkatachalam.", 
    "section": "national", 
    "title": "490 wheelchairs for differently abled persons to cast votes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}