{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Coming down heavily on the governments headed by the Dravida Munnetra Kazhagam and the All India Anna Dravida Munnetra Kazhagam in Tamil Nadu for the past 50 years, Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan blamed the present AIADMK government, in particular, for being unresponsive to development proposals made by the Centre.\n\nAddressing a public gathering here on Sunday, Mr. Radhakrishnan said that his Ministry made a proposal to develop East Coast Road into a National Highway with a proposed budget of Rs. 10,000 crore about eight months ago, but the State government had not shown any interest.\n\n“Similarly, the construction of bridge at Maduravoyal in Chennai providing crucial connectivity to the port there has been stopped for long. We provided many alternatives to sort out the issues with the project. But nothing has been done yet,” he said.\n\nHe also cited the example of the long-pending project of a port at Colachel where State government had failed to cooperate well with the centre.\n\nStating that the situation was no different when the DMK was in power, Mr. Radhakrishnan alleged that whenever DMK seniors visited Delhi, it was not for the welfare of the State but for themselves.\n\nClaiming that 60 per cent of the voters in Tamil Nadu wanted change from the rule of Dravidian parties, he said that the people knew that the BJP could deliver because of the achievements already shown by Prime Minister Narendra Modi-led government at the Centre.\n\nMr. Radhakrishnan introduced Mr. Suseendiran, the BJP candidate for Madurai East constituency, and sought votes for him during the meeting.\n\nEarlier talking to reporters after introducing six BJP candidates of Kanyakumari district in Nagercoil, Mr. Radhakrishnan said that the BJP would not support any front or party to form government in the event of no one getting a simple majority in the Assembly election.\n\nDMK president Karunanidhi had opened toddy shops in the State and then allowed liquor shops. The distilleries owned by the bigwigs of the DMK and the AIADMK should be closed down, and then only they would have the right to speak about total prohibition in the State, Mr. Radhakrishnan said.\n\nHe also said that crores of rupees were being circulated illegally in the State, and it should be curtailed by the Election Commission of India.\n\nThe efforts taken by the Union government to solve the problems faced by the fishermen of Tamil Nadu evoked only a lukewarm response from the State government, he added.", 
    "section": "national", 
    "title": "“AIADMK govt. unresponsive to proposals made by Centre”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}