{
    "author": [
        "Renganathan In Thanjavur", 
        "Contributed L"
    ], 
    "text": "A candidate gets her certificate at the Graduation Day at M.A.M. College of Engineering and Technology, M.A.M. School of Architecture, and M.A.M. School of Business in Tiruchi.\n\nEntrepreneur\n\nmotivation campaign\n\nThe Annai Vailankanni Arts and Science College, Thanjavur, organised a one-day youth entrepreneur motivation campaign in which speakers exhorted the students to become job providers rather than job seekers.\n\nAt a time when the nation is seeking to strengthen its manufacturing sector and the Union and the State governments setting store by micro, small, and medium industries sector, it was essential for the graduates to equip themselves with the set of skills required to meet the modern day demands of the world. Those skills would not only make the students job-eligible but going beyond that, they must transform the enterprising youth to take up entrepreneurial ventures, Correspondent Rev. U. John Joseph Sundaram said.\n\nStating that taking calculated risk was part of any entrepreneurial venture, Principal P. Devanesan noted that once a person gets adequately qualified to undertake jobs in a particular sector, it was better for him to venture into a business of his or hers own for a bright career. Entrepreneurs would form the bedrock of the nation's economic development and progress, he opined.\n\nChief guests M. Rajamaheswari Kamaraj and A. Arcokiasamy emphasised the importance of entrepreneurship in business for the economic development of India. They called upon the enterprising youth to venture into viable business options rather than awaiting suitable jobs even after getting some hands on training and gathering adequate experience. That would solve the unemployment problem, they noted.\n\nPep talk for\n\nfresh graduates\n\nGrowing by learning, persevering to chase dreams through hard work and being a good human being with a great attitude are important characteristics that youth should imbibe to thrive in the extremely competitive environment, said P.B. Madhavan, Purchasing Director (Asia Pacific & Africa), Ford India Private Limited, while speaking at the Graduation Day of M.A.M. College of Engineering and Technology, M.A.M. School of Architecture, and M.A.M. School of Business. B.V. Ramanan, CMD, Livia Polymer Bottles Pvt. Ltd., congratulated the students and exhorted them to be responsible citizens. M. Abdul Majedu, Chairman, M.A.M Group of Institutions presided.\n\n649 students get\n\ndegrees at Saranathan\n\nSix hundred and forty nine graduates and post-graduates received their degrees at the Graduation Day of Saranathan College of Engineering. Thothathri Visvanathan, vice-president, Head - Chennai Development Centre, Infosys Limited, was the chief guest. S. Ravindran, secretary of the college, V. Nagarajan, Director, and D. Valavan, Principal, were present.\n\nCommon eye ailments\n\ncan be cured easily\n\n“Given the technological advancements and use of gadgets people must be extra cautious to prevent eye diseases. Regular checkups by the doctors can prevent most of the eye diseases,” Vinod Nathaniel, ophthalmologist, said in his inaugural address at a citizenship training camp organised by Nehru Memorial College of Education. Many people think that common diseases like cataract and glaucoma cannot be cured easily. On the contrary, these two diseases occur commonly and can be treated, he said. Pon. Balasubramanian, president of the college, and A. Prabaharan, Dean, were present.\n\nCampus should be\n\nfree from prejudice\n\nEducational institutions are sacred institutions which provide knowledge and wisdom to the youth. They should be free from prejudices of caste, religion, and politics, said S. Gopinath, Executive Director, BHEL, Tiruchi, speaking at the 97th College Day of National College. He stressed the importance of ethics and values and sacrificing values will not yield positive results in life. He advised students to be fearless and strive tirelessly towards perfection. BHEL strongly believes in education as a tool to create a better society and directs its CSR initiatives towards improving the infrastructure in schools and colleges, he said. K. Raghunathan, secretary of the college, and K. Anbarasu, Principal, spoke. Mr. Gopinath gave away prizes to the rank holders.\n\nCHAMFEST-16\n\nCauvery College for Women emerged overall winners of “CHAMFEST-16,” organised by St. Joseph’s College for NSS students. Various competitions such as essay writing, Tamil elocution, and drama were conducted. Students from around 10 colleges took part. R. Murugan, president, college governing council, V. Ramanathan, secretary, R. Gobinathan, treasurer, and V. Sujatha, Principal, felicitated the students.\n\nContributed by L. Renganathan in Thanjavur\n\nand G. Prasad in Tiruchi", 
    "section": "national", 
    "title": "CAMPUS CONNECT", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}