{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMDK will allow freebies only in education and health sectors: Premalatha\n\nConfusion prevails over the choice of Chief Ministerial candidate in both the All India Anna Dravida Munnetra Kazhagam and the Dravida Munnetra Kazhagam, said Desiya Murpokku Dravida Kazhagam women’s wing leader Premalatha Vijayakant.\n\nAddressing a public meeting to explain the party’s manifesto for the Assembly election here on Sunday, she said that the sword of Damocles hung over the head of AIADMK general secretary Jayalalithaa in the form of Supreme Court verdict in the disproportionate assets case against her, and the AIADMK was yet to announce its Chief Ministerial candidate.\n\nSimilarly, there were issues between the father and the son (DMK president M. Karunanidhi and party treasurer M.K. Stalin) as to who should be the Chief Ministerial candidate in their party.\n\n“It is only the DMDK-People’s Welfare Front alliance that has announced its Chief Ministerial candidate and the DMDK released its election manifesto.\n\n“Why is Ms. Jayalalithaa, known for hurriedly releasing names of the candidates, not doing it now? It is because, Captain (Vijayakant) is not in her alliance. She is maintaining a stoic silence,” she said.\n\n“The myth called Jayalalithaa will be exposed in 2016 Assembly election. But, the DMK will end up daydreaming that Ms. Jayalalithaa’s failure will benefit it. The people will no more decide to prefer the deep sea to the devil,” she said. When milk, cooking gas cylinders and newspapers could be delivered at home, why could not the PDS goods be issued at people’s doorsteps, she asked.\n\nExplaining the party manifesto, she said that freebies would be promoted only in education and health sectors.\n\nA specialised team to fight corruption would be formed under the DMDK-led government. People could mail their problems, which would be looked into immediately. None of the leaders in the five parties in the DMDK-PWF alliance faced any corruption charge or any criminal case, unlike the leaders of the rival Dravidian parties, she noted. “Only ours can be the alternative to both the corrupt parties,” she said.\n\nLocal leaders of the alliance parties took part.", 
    "section": "national", 
    "title": "“Confusion in AIADMK, DMK over choice of CM candidate”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}