{
    "author": [
        "S Senthalir"
    ], 
    "text": "(From left) P. Suresh, Assistant Professor in art of Bharatiar Palkalaikoodam; S. Maran, founder-MD of Jeno Maran Builders, Puducherry, with the winners in senior category. (Right) The winners of junior category at the The Hindu Young World 2016 painting competiton in Puducherry on Sunday.— Photos: S.S. Kumar\n\n250 students participate in The Hindu-Young World Painting Competition 2016\n\nThe Hindu-Young World Painting Competition 2016 at Puducherry provided a common platform for children from varied backgrounds to set free their creativity.\n\nOf the 20 children who received prizes, four girls were from Dr. Ambedkar Government Higher Secondary School. Two of them bagged the first place in the junior and senior category, one won the third place in the senior category and one received a consolation prize.\n\nNearly 250 children participated in the inter-school painting competition held at Sri Sankara Vidyalaya Matriculation Higher Secondary School on Sunday.\n\nThe competition, being organised in association with Thyrocare, was held for two categories – juniors (Classes IV to VI) and seniors (Classes VII to IX). Among the 250 participants, 131 participated in junior category and 119 in the seniors.\n\nStudents from 45 schools in Puducherry, Cuddalore and Villupuram participated in the competition.\n\nSri Sankara Vidyalaya MHSS was the venue partner and Triumphant Institute of Management Education Private Ltd (T.I.M.E) the snack partner.\n\nChildren took up the challenge to paint their imagination when they were given on-the-spot topics. Three different topics were given to the junior and senior categories separately. While the juniors choose to paint a greener India, mobile mania or my dream; the seniors sketched their favourite sport, summer holidays with family or underwater scenery.\n\nS. Maran, founder-managing director of Jeno Maran Builders, Puducherry, was the chief guest for the event. Assistant professors in art Kalaimamani P. Suresh and N. Seshadri of Bharatiar Palkalaikoodam selected 20 students for the prizes. The chief guest said that The Hindu newspaper has provided an opportunity for the children to go beyond the school subjects. “They have provided the space to draw, paint and play. It is the duty of the parents to encourage children to become an artist or sportsperson,” he said.\n\nSpeaking at the event, N. Seshadri said that it was tough to select the winners.\n\n“Colouring is a way of relaxing. Parents should allow their children to engage in art. This will help the children concentrate well in their studies,” he said.\n\nD. Rajkumar, head -school vertical – (south and east India), The Hindu , Chennai, said: “To cheer and encourage the children, The Hindu Young World chess championship will be held in June. The painting competitions hosted in 25 centres will be completed before April 30.”", 
    "section": "national", 
    "title": "Creativity of children to the fore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}