{
    "author": [
        "Staff Reporter"
    ], 
    "text": "‘Hearing-impaired women become more dependent on others’\n\nWomen cutting the cake to mark the International Women’s Day function organised by The Deaf EnAbled Foundation in Tiruchi on Sunday.— PHOTO: M. SRINATH\n\nThe message of empowerment for hearing impaired women was conveyed through dance, drama, and an awareness talk as part of a celebration of International Women’s Day organised jointly by the Deaf Enabled Foundation’s Tiruchi and Thanjavur centres on Sunday.\n\nHeld at the Tamil Sangam Hall in Tiruchi, the programme was attended by around 50 hearing impaired women.\n\n“We are trying to bring out the talents of the deaf women, to make them feel at ease socially,” Suganya, an instructor and leadership programme speaker at DEF Thanjavur, who has speech disability, told The Hindu , with the help of sign language interpreter Habila.\n\n“While hearing impaired boys are able to cope somehow in adulthood, girls are confined to their homes by their parents and become over-reliant on others throughout their life.” she added.\n\nCultural programmes presented by the students included solo and group dance performances, a skit on Savitri Bai, a comedy item, and a talk by Aarthy Rajesh, administrator, HR/DHS, Joseph Eye Hospital, on eye health, which was followed by an interactive question and answer session with the audience.\n\nDeaf Enabled Foundation was started in 1991 by J.S.K. Rao in Andhra Pradesh, as an advocacy group for the rights and social inclusion of the hearing impaired.\n\nIn Tiruchi, DEF offers free courses in computer literacy and English at its Karumandapam centre for the hearing impaired, in addition to training sign language interpreters.\n\nHowever, said Ms. Suganya, parents in Tiruchi were reluctant to send their daughters to get trained. “There are five schools for the deaf and dumb in the city, but all of them are teaching just the basics,” she said. “DEF focuses on everyday issues such as banking, ATM usage, making one’s travel arrangements online, and so on. Becoming proficient in these matters makes women more self-confident,,\" she said,.", 
    "section": "national", 
    "title": "Empowerment through dance and songs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}