{
    "author": [], 
    "text": "An international conference on ‘A new horizon in materials’ was organized by the Department of Physics of Sarah Tucker College, Palayamkottai recently. R. Suganthi Christina, Head, Department of Physics and Convener of the event, delivered the keynote address. Dr. Usha Godwin, Principal (In-charge) of the college delivered presidential address. Dr. B. Sundarakannan, Associate Professor of Physics, Manonmaniam Sundaranar University, spoke on ‘Environmental-friendly Piezo electric Materials’. Dr. Mubarak Ali Davood Basha , Research Professor, Incheon University, South Korea, spoke on ‘Utilization of solution plasma in material synthesis’. Dr. M. Melvin David Kumar gave an invited lecture on “Nanostructured transparent conductive oxides in photovoltaics and sensors’. A total of 35 research papers were presented. Dr. M. Daniel Sweetlin, Associate Professor and Head of the Department of Physics, St. John’s College, Palayamkottai, delivered the valedictory address. Faculty, research scholars and students from various colleges and universities attended and benefited from this international conference.S.G. Pushpalatha Gracelin, Organizing Secretary, of the event proposed the vote of thanks.\n\nTwo-day programme\n\nThe Department of English, Manonmaniam Sundaranar University, Tirunelveli, organised a two-day programme on ‘Contemporary literary theories’ recently. The speaker was Dr. P. Marudanayagam, Fellow, Centre for Classical Tamil, Chennai.\n\nWith his versatility in both English and Tamil literary fields he kept the audience spellbound. The programme targeted the postgraduate and the pre-doctoral as well as doctoral students to drive home the fact that research not grounded in theory would be unscientific. Prof. Marudanayagam spoke on the functions of criticism, the responsibilities of the critic and the various classifications of literary criticism.\n\nHis sessions focused on various types of literary criticism starting with ‘New criticism’ that was set into motion as a reaction to traditional criticism. He went on to discuss the primary features of ‘Myth criticism’, ‘Psychological criticism’, ‘Sociological criticism’, ‘Deconstruction’, ‘Structuralism’, ‘New historicism and ‘Intertextuality’.\n\nProf. Marudanayagam discussed the prominent and seminal critics like T.S. Eliot, F.R. Leavis, I.A. Richards, Adam, Chicago critics, Freud, Jung, Northrop Frye, Derrida, Paul de Man, Greenblatt and Harold Bloom, drawing comparisons and contrasts with the prominent and significant Tamil critics. The highlight of the programme was his suggestions on how to identify fruitful research topics in the foreground of various theories. The programme was organised by Prof. Kalyani, Head of the Department of English, Manonmaniam Sundaranar University.\n\nAssociation set up\n\nFrancis Xavier Engineering College, Palayamkottai, has established prestigious association with ‘EMC2 , USA’ as ‘Academic Alliance Partner’. EMC2 has confirmed FXEC as their academy alliance partner in the field of Cloud computing and Big Data analysis. In this holistic initiative , EMC2 would provide sufficient support in terms of training the faculties and providing international certification for the students who are opting to achieve great heights in this niche field to get a notable competency skills to edge over in the global market. In this regard, Abijith Srinivas, Principal Head for Marketing and Products, Pune, launched and inaugurated the Centre of Excellence, EMC2Academy at FXEC. He explained the alliance advantage and the benefits of acquiring the international certification from EMC2.\n\nThe proposed EMC Alliance Academy Programme will commence from April. Since, FXEC has been confirmed as a nodal centre, students from other engineering colleges can also participate and get benefited.\n\nGraduation day\n\nV.V. College of Engineering, Thisaiyanvilai, celebrated the second graduation day recently in which 308 students from various departments received their degrees from S. Rakesh, distinguished scientist of ISRO and Director of ISRO Propulsion Complex, Mahendragiri, who was the chief guest. Chairman of the college S. Vaikundarajan and secretary S. Jegatheesan presided over the function. The chief guest also gave away gold coins to the university rank holders. He spoke on the recent trends in rocket technology and the scope for engineers in the contemporary society. Delivering the presidential address, Dr. P. Chellathurai, former Registrar of Manonmaniam Sundaranar University, Tirunelveli, highlighted the fundamental keys of success and also the problems faced by the humanity.", 
    "section": "national", 
    "title": "International conference", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}