{
    "author": [
        "A D Balasubramaniyan"
    ], 
    "text": "Alcoholism not only killed many youths but also their skills, she said\n\nDMK women’s wing secretary and MP Kanimozhi reiterated the party’s commitment to close Tasmac liquor shops and implement prohibition. She was addressing a joint consultative meeting of DMK district women’s wing here on Sunday.\n\nMs. Kanimozhi said, “Tamil Nadu has become a State with most number of young widows in India because of alcoholism. It not only killed many youths but it also killed skills of several youngsters and rendered them unsuitable for any job. Seventy-five per cent of revenue of the families of alcoholic men goes to liquor shop. That’s why people like Sasi Perumal and women’s organisations struggled for closure of liquor shops and imposition of prohibition.” She alleged that the AIADMK government was unwilling to close Tasmac shops because “the liquor manufacturing company run by Jayalalithaa’s proxies would lose revenue.” Once DMK comes back to power, party chief Karunanidhi would put down his first signature to reintroduce prohibition in the State, she said.\n\nShe said that Women Self Help Groups (SHGs) introduced by DMK government helped women gain economical empowerment. It was only the DMK that gave equal rights for women in ancestral properties for the first time in the nation. Apart from providing marriage assistance to women who had completed eighth standard, the party encouraged the girls’ education. Later the assistance was increased for those who had completed Plus Two and degree. Instead of speaking these facts in stages, the women’s wing members should go and speak with women at their places, she insisted.\n\nFormer Minister and Tiruvannamalai south district secretary E.V. Velu, north district secretary R. Sivanandham, former Minister K. Pichandi, district presidium chairman D. Venugopal, State Secretariat member R. Sridharan, town secretary Karthi Velmaran participated. South District Women’s wing secretary Vijayalakshmi Ramesh presided.", 
    "section": "national", 
    "title": "Kanimozhi reiterates DMK’s commitment on prohibition", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}