{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Representatives of various political parties offer their views at programme held at varsity\n\nRepresentatives of various political parties in Tamil Nadu on Sunday assailed this year’s Union Budget contending that it did not focus on certain areas that would directly benefit the poor. At a panel discussion on the Union Budget organised by the VIT University here, a few representatives, however, hailed it.\n\nC.H. Venkatachalam, national executive member, CPI, called for a separate budget for agriculture on the lines of the Railway budget as agriculture was in crisis and farmers continued to commit suicide in the country. He said the present budget would merely increase the disparity between the rich and the poor because the measures spelt out in it would benefit only the “top people, the big people, in the country”.\n\nFarmers’ concerns have not been addressed by any government and the NDA dispensation had not kept its promise of providing a minimum support price of 50 per cent of the cost of agricultural production, S.S. Balaji, deputy general secretary, VCK said.\n\n“I am pretty happy with the emphasis on the rural sector. This is a budget driven by compulsions to drop interest rates, capping the fiscal deficit, spending on the rural economy, simply so that the saturated goods and services can find an outlet in the form of rural demand,” felt S. Subramaniam, business advisor.\n\nCongress spokesperson ‘Americai’ Narayanan faulted the government for allocating just Rs. 3 crore for strategic reserves and a mere three per cent allocation for primary and secondary education.\n\nVIT University chancellor G.Viswanathan requested the Centre to address the shortage in medical seats. “Five lakh medical seats is the requirement in India, but there are only 50,000 seats. On the other hand, we have 17 lakh engineering seats. Of these 50,000 medical seats, 4,500 were struck down by the MCI, whereas 75 per cent of students studying medicine in China are Indians. Our students need to study medicine in India,” he said.\n\nPolitical and economic commentator S. Gurumurthy, who moderated the session, said, “The budget always looks outside. There is a gradual shift in the last few years including in the UPA budget in its last two years, the focus is on India, Indian efforts, Indian entrepreneurship that has benefited the country and this budget has taken it forward.”\n\nCPI-M MP T.K. Rangarajan, former MPs Peter Alphonse and Era Sezhiyan, C Rajashekaran, deputy secretary, MDMK, and N.Ramasubramanyan, spokesperson, Tamil Nadu BJP, participated.", 
    "section": "national", 
    "title": "Mixed reaction to union budget at panel discussion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}