{
    "author": [], 
    "text": "Report on M.K. Alagiri meeting his father recentlydoes not figure in the party organ\n\nDMK leader M. Karunanidhi always sees to it that party organ ‘Murasoli’ carries every single event he participates in and the photographs of prominent faces and party leaders who make a courtesy call. But the visit of his elder son and former Union Minister M.K. Alagiri did not find a place in the newspaper even though all other newspapers and satellite channels went to the town with the news. As party treasurer M.K. Stalin controls the Murasoli Trust, the elder son of Madurai failed to figure in the party organ.\n\nAs vehicles zoom past the Anna flyover in Chennai, a few police constables stand under temporary shelters braving the sweltering heat. Their primary responsibility is to prevent any attack on the US Consulate.\n\nPolice personnel were deployed on the flyover soon after the September 2012 attack on the US Consulate by a section of Muslims who condemned the controversial film ‘Innocence of Muslims’.\n\nThe guards take turns to stand under the scorching sun for hours with the temporary shelter sponsored by a private firm not providing much of relief.\n\nFormer Additional Commissioner of Police V.A Ravikumar agrees that the deployment of policemen along the flyover serves no purpose. The guards are not armed with weapons to avert a terror attack. There was a proposal to put up an 8-foot iron mesh over the parapet wall to prevent miscreants from throwing anything on the consulate premises, he said.\n\nDuring the day, the constables wear face masks to protect themselves from high levels of pollution on the busy flyover.\n\nAs the Model Code of Conduct is in place, everything is quiet at the Secretariat. At the entrance lobby of the old building, photo frames that usually carry pictures of Chief Minister Jayalalithaa and her Cabinet colleagues have been removed.\n\nOn the first floor, the walls along the corridor leading to the Chief Electoral Officer’s room are lined up with posters promoting hundred percent vote campaign. On the large TV screens, videos of actor Suriya and cricketer Ravichandran Ashwin urge people to find out if their names are on the list and to cast their votes.\n\nThe Chennai Corporation’s project to plant banyan trees to mark the birthday celebrations of Chief Minister Jayalalithaa reportedly hit a roadblock near the residences of a few Ministers.\n\nFollowing a resolution passed by the Corporation Council, a few civic officials visited the residence of Minister O. Panneerselvam last month to plant the saplings on a vacant piece of land in the vicinity.\n\nAccording to sources, the Minister’s assistants asked officials the reason for planting banyan trees. When civic officials mentioned the reason, they were asked to plant peepal saplings. So, the officials had to replace banyan with peepal saplings. While councillors at the council meeting claimed that planting banyan trees across the city would be astrologically favourable for the Chief Minister, Mr. Panneerselvam considers it inauspicious.\n\n(Reporting by B. Kolappan, S. Vijay Kumar, Deepa H. Ramakrishnan and Aloysius Xavier Lopez)", 
    "section": "national", 
    "title": "Murasoli doesn’t find it newsworthy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}