{
    "author": [
        "R Srikanth"
    ], 
    "text": "Motorists enjoy smooth ride on re-laid stretches ravaged by floods last year\n\nResidens of a number of pockets in North Chennai, who complain that their localities have always been neglected compared to the rest of the city, now welcome the importance attached to road improvement works in their area.\n\nSeveral roads, both interior and arterial, have been re-laid on a mass scale after the heavy floods that ravaged roads and streets in these places. Motorists confess that travel has improved on a number of black-topped roads that have been provided with a fresh coat of white paint on margins along with reflectors.\n\nChennai Corporation officials said many roads were re-laid in three months in north Chennai covering Tiruvottiyur, Manali, Madhavaram, Tondiarpet and Royapuram.\n\nThey said some of the key stretches that served as a link from these places to the rest of Chennai were severely damaged during the rain. They include Tiruvottiyur High Road, Tondiarpet High Road, Paper Mills Road and Surya Narayana Road in Royapuram, Karthikeyan Salai in Jawahar Nagar and B.B. Road in Perambur.\n\nThe road improvement works have been carried out in North Chennai at a total cost of Rs. 300 crore in the past three months, officials told The Hindu . They include interior roads in residential colonies and bus route roads. Interior roads included 36 in Manali zone, 47 in Madhavaram zone and more than 100 roads in Tondiarpet zone.\n\nResidents like J. Balaji of Thiru. Vi. Ka. Nagar, said usually arterial roads in parts of north Chennai were re-laid in bits and pieces, but this year there was a visible change. They also pointed out that unauthorised road cuts by various government agencies and digging up by workers for election-related meetings had to be prevented for better maintenance of roads on which a massive sum was spent on re-laying them.", 
    "section": "national", 
    "title": "North Chennai gets better roads", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}