{
    "author": [], 
    "text": "Justifying the decision of the People’s Welfare Front (PWF) to declare DMDK leader Vijaya-kant as the Chief Ministerial candidate of the Third Front, Viduthalai Chiruthaigal Katchi (VCK) Thol. Thirumavalavan says the actor-turned politician shares the ideals of the leaders of the PWF’s constituent parties. In an interview with B. Kolappan , he dismisses the criticism that the Third Front that now encompasses the DMDK and PWF is the creation of the ruling AIADMK.\n\nThe PWF had earlier unanimously decided not to project anyone as the Chief Ministerial candidate, even a Dalit. Have you not compromised your stand by supporting Mr. Vijayakant for the post now?\n\nYou can point an accusing finger at us only if we had announced either Messrs Vaiko (MDMK leader) or G. Ramakrishnan (CPI–M State secretary) or R. Mutharasan (CPI State secretary) or me as the Chief Ministerial candidate of our alliance. We have entered into a pact with the DMDK that had already declared Mr. Vijayakant as the candidate for the post. The DMDK fully agrees with us on the issues of total prohibition, eradication of corruption and a coalition government. So, we have no problem in supporting his candidature for the post of Chief Minister.\n\nThe DMDK’s poll manifesto lays stress on private sector, while the constituents of the PWF are strong proponents of promoting public sector. Don’t you see a contradiction there?\n\nLike I said, we have come together on the above common issues. The DMDK has already released its manifesto and we, the four parties, have our Common Minimum Programme (CMP) and it will form the base for our manifesto to be released soon. We do not have time to make alterations or corrections now. If elected to power, the five parties will evolve a CMP for the government to remove all the points of disagreement.\n\nMr. Vaiko had alleged that the DMK came forward to offer Rs. 500 crore to the DMDK to join its alliance. What is your comment?\n\nI do not like to express my opinion on the issue as the DMK has issued a legal notice. Mr. Vaiko will face it legally.\n\nThere is a repeated allegation that the PWF is a benami of the ruling AIADMK…\n\nThe allegation itself is a proof that the PWF has emerged as a force to reckon with in Tamil Nadu politics and would dent other alliances. We are in the fray as an alternative to both the DMK and the AIADMK and we want to become a ruling coalition. If our intention, as some people have alleged, is to help the AIADMK, why should we join hands with Mr. Vijayakant, an arch rival of the ruling AIADMK?\n\nMr. Vaiko walked out of a television interview when asked about the claim that he had received Rs. 1,500 crore from the AIADMK…\n\nWe deem it as an allegation levelled against each one of us in the PWF and not just against Mr. Vaiko. The media should support us since we are providing the much-needed alternative. Instead, it is propagating a baseless allegation. Who is behind this campaign?\n\nThe VCK has worked with the DMK and the AIADMK in the past. What is your experience with the PWF?\n\nWhether it is DMK leader M. Karunanidhi or Chief Minister Jayalalithaa, we (VCK) had to maintain a distance from them (their cadre). But in the PWF there is a bonding among leaders and the friendly feeling has percolated down to the cadres at grass roots level.", 
    "section": "national", 
    "title": "Nothing wrong in projecting Vijayakant as Chief Minister", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}