{
    "author": [
        "C Jaisankar"
    ], 
    "text": "In the absence of a public toilet, men seem to be left with no choice but pee in the public on the Goodshed Road along the compound wall of Holy Cross College for women in Tiruchi.— PHOTO: M. SRINATH\n\niruchi may be one of the best managed cities in terms of better sanitation practices. But there are some eyesores to indicate that the city has still a long way to go in eradicating the disgusting menace of men taking a pee in the public.\n\nThe busy Old Goodshed Road in Singarathope is dotted with spots where men empty their bladder in the open. The lane that leads to Tiruchi Fort Railway Station from Madurai Road has now become busy since the opening of a shopping mall about two years ago. Moreover, an outlet of the State owned Amaravathi Cooperative Super Market functions in the area. Similarly, a number of shops have come up in addition to a couple of Tamil Nadu State Marketing Corporation (Tasmac) liquor outlets. More than other shops and business establishments, it is Tasmac shops that attract a large crowd to the area. It swells in the evening.\n\nIn the absence of a public toilet in the area, men pee on the pavements along the compound wall of Holy Cross College for women. That it is a women’s college seems to make no difference to these men.\n\nBesides them, a section of shopkeepers, autorickshaw drivers and cab drivers use the pavement as a urinal without any inhibitions.\n\nLocal residents and shopkeepers complain that the pavement has become an unofficial public toilet. The authorities apparently have not been able to find ways to prevent this. The stinking pavement makes it a hell for passersby and those waiting for buses at the bus stop. “We find extremely difficult to park our autorickshaws due to the stench from the pavement. Though we have brought it to the attention to the corporation authorities, action has not been taken to solve the issue,” said an auto rikshaw driver.", 
    "section": "national", 
    "title": "Pissing away the Swachch Bharat ranking", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}