{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Wordy duel between students threatened to snowball into a serious clash\n\nA wordy duel between two sections of school students, allegedly over a love affair, during a school annual day celebration at Kunjaravalasai near here on Thursday threatened to snowball into a clash between two communities on Saturday night. However, police made a timely intervention to thwart a flare-up.\n\nThe police said that on Saturday evening, two teens from a particular community, waylaid a 16-year-old boy near the railway gate area and questioned him over the incident at the school.\n\nThe boy inflicted injuries on them with a blade-like weapon. The teens also attacked the boy with a knife, inflicting injuries on him.\n\nThe 16-year-old boy was admitted to a private nursing home on Railway Feeder Road here and the two teens were admitted to the Government District Headquarters Hospital in Ramanathapuram.\n\nImmediately, rumour spread that the two teens were in a serious condition after they were stabbed by a member of the other community.\n\nSoon a group of about 150 people barged into the private nursing home and tried to assault the boy after breaking the glass panes and furniture, when a police team, which visited the hospital to interrogate the boy, chased them away. As they feared that the incident could snowball into a clash between the two communities, the police swung into action and deployed Armed Reserve Police and Striking Force personnel here.\n\nSuperintendent of Police N. Manivannan, who visited the trouble-torn area on Saturday night and camped there on Sunday, said that the situation was under control. “Normalcy was restored on Saturday night itself and police picketing has been posted to prevent any untoward incident,” he told The Hindu .\n\nThe police have filed cases against the 16-year-old boy and the two teens under Sections 294 (b) (use of obscene words), 324 (causing hurt by dangerous weapons) and 506(ii) (criminal intimidation) of the Indian Penal Code.\n\nBased on a complaint filed by the grandmother of the 16-year-old boy, the police have also filed a First Information Report against more than 100 people, who ransacked the private nursing home, the police said.", 
    "section": "national", 
    "title": "Police action averts clash between communities", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}