{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Even as new political parties emerge, it is interesting to look at how some parties have vanished from the electoral scene in Tamil Nadu. The Congress and the CPI are the only two parties that have been in the fray since the first Assembly election in 1951.\n\nThe Bharatiya Jan Sangh, which was later rechristened Bharatiya Janata Party (BJP), missed two elections in 1957 and 1977. In 1977, the Jan Sangh was part of the Janata Party.\n\nIn the maiden elections to the then Madras State, 11 national parties, four state parties and two registered parties tried their luck. These included the Congress, the CPI, Bharatiya Jan Sangh, the Kisan Mazdoor Party, the Krishikar Lok Party, the Kisan Mazdoor Praja Party, the Socialist Party, the All India Republican Party, the Forward Block and the Common Weal Party.\n\nThe DMK, which was launched in 1949, boycotted the poll to protest against the drafting of the Constitution without ascertaining the views of the ‘Dravidians’.\n\nIn the next Assembly polls in 1957, the number of national parties in the fray came down to three — Congress, the CPI and the Praja Socialist Party. In 1962, the Swatantra Party launched by C. Rajagoplachari (Rajaji) and Tamil Desiya Katchi founded by E.V.K. Sampath made a debut.\n\nThe CPI (M), which came into being following the split in the CPI, was a new entrant in the 1967 elections. In the next elections in 1971, the Congress (headed by Indira Gandhi) stayed away, while the Congress (Organisation) led by K. Kamaraj fielded candidates. The AIADMK founded by M.G. Ramachandran made its debut in the 1977 elections. BJP contested the 1980 Assembly elections.\n\nThe 1989 Assembly elections saw participation from AIADMK (Janaki), AIADMK (Jayalalithaa) and Tamizhaga Munnetra Munnani launched by matinee idol Sivaji Ganesan. The PMK debuted in 1991; the MDMK, TMC (Moopanar) and the Puthiya Tamilagam in 1996; the VCK in 2001; and the DMDK in 2006.\n\nIn maiden elections, 11 national parties, 4 state parties and 2 registered parties took part", 
    "section": "national", 
    "title": "Poll race and participants over the years", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}