{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Leaders of People’s Welfare Front (Makkal Nala Kootani) have sacrificed people’s interest by aligning with Vijayakant’s Desiya Murpokku Dravida Kazhagam (DMDK) as the Front’s name had changed, National Executive Member of the Bharatiya Janata Party L. Ganesan said here on Sunday.\n\nHe told presspersons that the change in name was the first casualty – the front was now ‘Captain Vijayakant Front’. The Left party leaders, who were part of the Front, should explain why they agreed to project a leader – Mr. Vijayakant – when their parties’ position was to not project any leader. For, when the BJP forged alliance for the National Democratic Alliance it did not rechristen the coalition as the Narendra Modi front. Likewise, the DMK had never named its alliance the Karunanidhi Front or Kalaignar Front.\n\nWhat the People’s Welfare Front leaders had done was strange and therefore they must explain their stand, he asked.\n\nThe BJP was not worried about Mr. Vijayakant’s decision as the party banked on its strength to contest the election. It had commenced its preparatory works a few months ago by constituting booth committees and was now engaged in mobilising workers and deciding on election strategy.\n\nHe dismissed criticisms that the BJP tried to forge an alliance with Mr. Vijayakant by offering money and Rajya Sabha seats. Why would his party give money to make the DMDK leader the chief minister; there was no logic to it. If at least the allegation was that the DMDK offered to money to the BJP to back his candidature for the chief ministership, then it made sense.\n\nNot projecting a chief ministerial candidate would not impact the BJP, he said in response to a question that it was the only party that did not project a leader for the election.\n\nThe party would meet the voters by explaining the Narendra Modi’s government’s achievements, how it was corruption-free and how the AIDADMK and DMK had misruled the states. Its target would be the two big Dravidian parties and their failure in governing the State.\n\nMr. Ganesan said that the party would come out with its second list of candidates for the Assembly election after concluding talks with parties that were looking for an alliance. It would be in the first week of April.", 
    "section": "national", 
    "title": "‘PWF leaders sacrificed people’s welfare by aligning with Vijayakant’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}