{
    "author": [], 
    "text": "Show respect to\n\nthe elderly\n\nRecently, I boarded an MTC bus ‘266’ at Pammal to reach Tambaram and from there to Skandasramam. I showed the free ticket to the conductor, who demanded that I produce an identity card. I have used free tickets for the past ten days to go to Broadway and return to visit temples but no conductor has asked for my identity card and so I was not carrying it. The conductor asked me to get down or purchase a ticket. I got down at Krishnanagar bus stop and took a ‘566.’ I am 82 years old and was asked to get down. It is requested to treat the elderly with respect.\n\nK.S. Pattabiraman\n\nPammal\n\nLong-pending demand for stormwater drain\n\nThe need for providing stormwater drainage on 3rd Cross Street, 3rd Main Road of AG’s Colony (Phase II), Mugalivakkam, was highlighted and the same appeared in these columns of The Hindu on 17 June, 2013. Although nearly three years have elapsed, there is no follow-up action. During the December floods, rain water almost entered the houses here. Had there been a stormwater drain on the street, rain would not have caused such anxiety among residents.\n\nDespite the fact that the residents are law-abiding and pay all taxes due to the government, this street is being discriminated against in all respects.\n\nIt is sad that the street has not witnessed any development even after the area was brought under the Corporation. I request the authorities to do the needful at the earliest.\n\nA. Rathinam\n\nMugalivakkam\n\nAuto drivers fleecing passengers\n\nMy friend came from Tiruvarur last week to take his wife for treatment to Adyar Cancer Institute. The auto driver demanded Rs.300 from Egmore to Adyar. My friend was not aware about auto meter.\n\nAuto drivers should show some kindness to patients who travel to such institutions.\n\nMTC should arrange small buses from the Egmore station and the Chennai Central station to Adyar for the economically backward.\n\nV. Dharman\n\nTeynampet\n\nConstruct bus bay\n\nat Perambur\n\nWith reference to your articles regarding bus bays at Guindy railway station, Marina and Alandur, I wish to inform that a bus bay is required urgently at the Perambur railway station. It is a key station where many long-distance trains and suburban trains halt. When commuters come out of the station, share-auto drivers crowd around them. Due to this, it is difficult for buses and other vehicles to ply. The road is narrow and hence there is always a traffic jam. Opposite the railway station, there are many hotels and people park their vehicles on the road. The parking lot is in a pathetic condition. I request that the existing two-wheeler parking lot be shifted to the huge vacant place near Railway Kalyana Mandapam. It will provide a huge income to Railways. The Corporation of Chennai may purchase the existing parking area from Railways and build a fresh road. The MTC authorities may create a bus bay there.\n\nS. Mohamed Shafi\n\nPerambur\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu@ gmail.com)", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}