{
    "author": [
        "Contributed P"
    ], 
    "text": "Voter awareness programmes are being conducted intensively in Tirunelveli district as both available men and materials are being utilised to the maximum possible extent to achieve the goal of cent per cent electorate turnout on May 16 Assembly elections.\n\nBesides convening a meeting every 48 hours to review the progress made in this connection, Collector M. Karunakaran is also participating in the voter awareness programmes being organized by various organisations and also in schools and colleges.\n\nOn its part, ‘Vanchi Iyakkam’, having its headquarters at Thirumalaiyappapuram near Kadayam in the district, decided to give cash awards to ensure the highest poll percentage in this small hamlet.\n\n“Voters exercising their franchise at Thirumalaiyappapuram polling station will be selected through a luck draw. Five fortunate voters will be selected immediately after the end of the polling at 6 p.m. through lucky draw and cash awards of Rs.1,000, Rs. 750, Rs. 500, Rs. 250 and Rs. 100 will be given to the selected voters. If this model is replicated in every area possibly with the help of sponsors, it’ll be so nice,” says P. Ramanathan, founder, Vanchi Iyakkam.\n\nWhen signal upgrading at Shencottah railway station was taken up recently, train services operated from various destinations to Shencottah were terminated at Tenkasi.\n\nTo enable the Shencottah passengers to reach their actual destinations without any difficulty, free special buses were operated from Tenkasi Railway Junction to Shencottah.\n\nAs the Shencottah-bound trains were stopped on the fourth platform of Tenkasi Railway Junction, the buses were also parked along the nearby Goods Shed Road so that the passengers could take the buses to Shencottah so easily on producing the train tickets. Really a passenger-friendly arrangement by the railway officials.\n\n(Contributed by P. Sudhakar)", 
    "section": "national", 
    "title": "Reporter's diary", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}