{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mettupalayam people blame the Tangedco barrage, used for hydro power generation, for poor quality water.\n\nThe water the Mettupalayam Municipality supplies has suffered a steady deterioration in taste, complains N. Suseela Nachimuthu, a resident of L.S. Puram. This has happened in the past three months.\n\nShe does not have a problem with the duration of supply, though, which is every alternate day.\n\nIn the nearby Chikkadasampalayam Panchayat, the water quality is bad. And so is the quantity. The village panchayat supplies water once in 10 days or so and it is muddy, complains resident N. Venkataraman. The quality deteriorates in the days after supply.\n\nBoth the Mettupalayam Municipality and the Chikkadasampalayam Panchayat tap the River Bhavani water.\n\nThe former draws 11 million litres a day and the latter a couple of million litres a day.\n\nThe two local bodies and a host of others including the Tirupur Corporation tap the water in Chennamalai Karadu in Oompalayam, where the Tangedco has constructed a barrage to store water and generate hydro-electric power.\n\nThe barrage stores not the river water, but the water that is contaminated with domestic and industrial sewage and the Mettupalayam Municipality lets out untreated sewage just ahead of the barrage.\n\nThe barrage is the second of the two barrages the Tangedco had constructed to generate hydro-electric power. The first barrage is near the Bhadrakaliamman Kovil.\n\nBy storing the water released from the Pilloor Reservoir in the first barrage, generating power and then releasing the water to the second barrage, the Tangedco is stopping the free flow of water in the River.\n\nAs a result of this, the sewage gets stagnated near the second barrage and that is the reason for the deterioration in water quality, complains T.T. Rangasamy, president, Bhavani River Water and Ground Water Protection Committee.\n\nThe Tangedco had constructed the first barrage in March 2016 and the second in December 2013 to generate 5 mw power each.\n\nThe Mettupalayam Municipality too has taken up the issue with the State Government.\n\nMunicipal chairman D. Satheesh Kumar says that though the Municipality has been discharging sewage into the River, there was no problem because of the undisturbed water flow.\n\nNow with the Tangedco authorities storing up to 30 feet water near the second barrage, the sewage flow is obstructed and that has led to the deterioration.\n\nFree water flow\n\nThe Tangedco officials should allow free flow of the water in the second barrage after storing and generating water in the first barrage until the Mettupalayam Municipality completed the sewage treatment plant work.\n\nThe current status of the sewage treatment plant work is that the civic body has sent a proposal for Rs. 92 crore to the State Government.\n\nTangedco officials were not available for comments.", 
    "section": "national", 
    "title": "Residents complain of poor water quality", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}