{
    "author": [
        "A D"
    ], 
    "text": "The financial services offered by postal department through ‘Core Banking Solution (CBS)’ get caught up in poor connectivity problem.\n\nThe CBS is a system in which account records of customers will be maintained centrally across branches in the nation and accessed through internet whenever there is a transaction or enquiry. This is the system followed in commercial banks.\n\nThe CBS is being introduced in all branch and head post offices of the nation. In Tiruvannamalai division, Tiruvannamalai Head Post Office was the first office to be connected in CBS on 20 October 2014. Then Arani Head Post Office was connected to CBS. Gradually other post offices were also converted as CBS branches. Out of 74 offices in the district including 72 branch post offices and two head post offices 68 are brought into CBS network. The last office to be converted to CBS was Thellaru Branch Office that was in December 2015.\n\nThough almost all but six offices were brought under CBS, the technology that replaced the conventional account maintenance system turned bane instead of a boon. Reason: inconsistent and slow connectivity. Poor processing speed due to low server band width when compared to the volume of data processed, expansion of network and growth of customer base.\n\nAll the financial business done in a CBS branches including savings account, fixed account, recurring deposits, bonds like National Savings Certificate, Kisan Vikas Patra, Sukanya Samriddhi Scheme as well as Postal Life Insurance schemes will have to depend on network.\n\nAn employee said, “for example a customer comes in and wants to deposit some money in his savings account or withdraw money or want to encash his/her NSC bond we need to open their account records using specific software called pinnacle and with the help of the internet. If the record takes time to open or struggles to open customer has to wait. The wait extends from minutes to hours.\n\n“When we say network is down, they ask us when will be it be back. But we are not certain about it ourselves and we are not able to tell them,” a staff said on the condition of anonymity.\n\n“Even when network is ok, it takes much time to process when we enter figures. Some time it takes till late in the night before employees finish with the system. At a time pressure was high from higher ups to start more accounts we feel helpless dealing with poor system,” said another employee.", 
    "section": "national", 
    "title": "Slow servers hamper postal services", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}