{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "A week after resorting to an indefinite fast demanding his release from the special camp in Tiruchi, Sri Lankan Tamil refugee K. Dhayabararaj gave up the agitation late on Friday night following the intervention of senior officials who promised to help.\n\nWhile Dhayabararaj is lodged in the special camp in Tiruchi, his wife Udayakala was detained in the special quarantine camp in Mandapam, Ramanathapuram district.\n\nClaiming that the detention was illegal since there was no case pending against them, the couple launched a fast-unto-death agitation on March 17. Five days later, the State government ordered the release of Udayakala.\n\n“Dhayabararaj has submitted a petition thanking the government for releasing his wife from the special quarantine camp. He is seeking release on the ground that she is unwell and needs his support for treatment. We have forwarded the petition to the authorities concerned for necessary action,” Regional Special Deputy Collector (Refugee Camps) S. Natarajan told The Hindu on Sunday.\n\nUdayakala who is in Chennai to meet the Sri Lankan Deputy High Commissioner said there was no valid reason for the authorities to detain Dhayabararaj in the special camp that lacked basic amenities.\n\n“The living conditions in special camps are worse than in jail. We have been repeatedly asking the government why detain us when there is no case or charge pending. My health condition has deteriorated…I am not even able to stand or walk for a few minutes.”\n\nShe said two of her three children were studying in a school near Madhavaram. Marumalarchi Dravida Munnetra Kazhagam (MDMK) general secretary Vaiko met her on Sunday and presented bicycles for her children. He also gave money for their education.\n\n“We have suffered enough in the last few years. We want to live with dignity and lead a peaceful life,” she said, adding that the family would love to return to Sri Lanka once normalcy returns there.\n\nHis wife says\n\nthat living conditions in special camps are worse than in jail", 
    "section": "national", 
    "title": "Sri Lankan refugee ends indefinite fast", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}