{
    "author": [], 
    "text": "Many Holi revellers seen laced with colours even days after fete\n\nMany teachers who take tuition classes in the city would have answered the doorbell on Friday only to be taken aback at the sight of shabby children waiting to troop in. Long after the Holi celebrations, the colours of the revelry stayed on in many of these children.\n\nThis year, several social service organisations such as Pondicherry Bihar Welfare Association, Pondicherry Round Table 70 and the Jipmer Social Service Committee had invested a lot of resources to make a Holi splash.\n\nPeople cutting across ages had plunged into the celebrations. However, as an organiser of Pondicherry Round Table pointed out, colours laced with chemicals take a long time to wear off. “This is one of the reasons why we sourced organic colours from Chennai for this year’s Holi celebrations,” he said.\n\nThe market is flooded with more of these chemical-laced dyes which could take up to a week to wear off, he said. So, perhaps the next Holi, it would make sense to go organic unless you want to walk around in an unkempt appearance.\n\nWho is the DEO?\n\nA gaffe committed by the Department of Information and Publicity on identification of the District Election Officer led to an embarrassing situation for two senior IAS officers.\n\nThe Department while sending alerts to the media through SMS said that the District Election Officer D. Manikandan will inaugurate the voter awareness programme at Gandhi Thidal on Friday.\n\nThe message took the media persons by surprise as S. Sundaravadivelu is the District Election Officer and Collector. The gaffe left the officials red faced after a few journalists made enquiries with both the officers over the messages.\n\nMr. Sundaravadivelu said that he was very much holding the post of the DEO and there was no change in the programme. Even Mr. Manikandan was at his wits end when reporters asked him whether there was any replacement.\n\nThe message was rectified through a revised message sent by the Department. The faux pas resulted in embarrassment to the department and the officials concerned particularly when elections are round the corner.\n\nBy M. Dinesh Varma and\n\nS. Prasad", 
    "section": "national", 
    "title": "The unfading colours of celebration", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}