{
    "author": [], 
    "text": "International Women’s Day was organised at Fatima Michael College of Engineering and Technology, Madurai, on March 8 with a talk by A. Sendhil Lakshmi, Siddha physician, on “Self-realisation.” M. Stalin Arockiaraj, chairman, St. Michael Group of institutions, presided over the function. J. Bridget Nirmala, Chief Executive Officer, highlighted the importance of women empowerment and the opportunities for women to come up in life.\n\nII\n\nInternational Women’s Day was celebrated at Pandian Saraswathi Yadav Engineering College, Arasanoor, on March 8. V. Dharmalingam, Principal, welcomed the gathering. P. Saraswathi Pandian, chairman, PSY Group of institutions, who presided over the function, highlighted the importance of discipline during the formative years of students’ life. M. Radha Rukmani, secretary, Upahaar, spoke about the need to improve self-confidence. S. Hameetha, Senior Inspector of Co-operative Societies, delivered a talk on perspectives of a working woman. O. Sharmila Begum proposed a vote of thanks.\n\nIII\n\nWomen Empowerment Cell of Madurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College, Poovanthi, organised International Women’s Day celebration on March 8 with a variety of competitions for students. The Principal, C. Ramalakshmi, administered a pledge to students on the occasion. R. Poonguzali, Head, Department of Tamil, recited a poem on the significance of International Women’s Day. M. Priyanka of I M.Com. proposed a vote of thanks.\n\nProgramme\n\nInternal Quality Assurance Cell of N. M.S. Sermathai Vasan College for Women, Madurai, conducted a programme on “Twin heart meditation” on March 11 with Karthiga Karikkolraj and T. Brindha Issac as resource persons. V. Rajarajeswari welcomed the gathering. Principal D. Karthiga Rani offered felicitations. S. Poompavai, Librarian, proposed a vote of thanks.\n\nScience expo\n\nA State-level Science Expo-2016 was organised at E.M. Gopalakrishna Kona Yadava Women’s College, Madurai, by the departments of Chemistry and Information Technology on March 11 and 12. It was inaugurated by N. Kalaiselvi, Senior Principal Scientist, Central Electrochemical Research Institute. E.M.G.S. Indirani, secretary, presided over the inaugural function. Students from 10 colleges and 15 schools visited the exhibition in which over 350 models were on display. Dr. Kalaiselvi also made a technical presentation on the effects of global warming. She reinforced the need to use next generation batteries like bio-carbon batteries from bio-waste, instead of lithium batteries.\n\nCollege Day\n\nQuality and sustainability went hand-in-hand and students learnt more outside the class than inside, said Ravi P. Singh, Secretary General, Quality Council of India, while addressing the 58{+t}{+h}College Day celebration at Thiagarajar College of Engineering, Madurai, on March 10. He wanted the students to go for internship with government agencies and contribute their skill, knowledge and leadership for development of the nation. Karumuthu T. Kannan, chairman and correspondent, in his address, advised the students to adhere to quality in all their activities. He also honoured R. Vasudevan, Dean, and retiring staff of the college on the occasion. K. Arunachalam, Head, Department of Civil Engineering, presented the annual report. M. Palaninatha Raja, Registrar, proposed a vote of thanks.\n\nGraduation Day\n\nThe 4th Graduation Day of Maharishi Vidya Mandir Senior Secondary School, Madurai, was celebrated on March 19. S. Irulappan, Principal, Madurai Kamaraj University College, delivered the key-note address and awarded the Kindergarten Diplomas to 200 children. Correspondent V. Balasubramaniyan and Principal P. Vijayalakshmi offered felicitations. Arockiam, in charge of Upper Kindergarten, presented the annual report.\n\nII\n\nThe 34{+t}{+h}Kindergarten graduation ceremony of SBOA schools was held at SBOA Matriculation and Higher Secondary School, Madurai, on March 19. The correspondent, J. Joseph Stalin, presided over the function.\n\nK. Ravichandran, Special Officer, Madurai Kamaraj University, addressed the gathering and released SBOA’s house magazine “Excelsior” and presented diplomas to the children. R. Gopi, president, Parent-Teacher Association, received the first copy of Excelsior. S. Seethalakshmi, Principal, SBOA Matriculation Higher Secondary School, offered felicitations. The kids of LKG presented a colourful cultural programme.", 
    "section": "national", 
    "title": "Women’s Day", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}