{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Young artists from Cultural Cradle Art Academy display their works at the 'Car-free Sundays', an initiative of The Hindu with Coimbatore Corporation and City Traffic Police on NSR Road in thecity.— Photo: M. Periasamy\n\nOn Sunday morning, Prafulla Thakkar with her sneakers on was shaking her legs to a Hindi number at the Car-free Sundays that The Hindu has been organising with the Coimbatore Corporation and the Coimbatore City Traffic Police on NSR Road, Saibaba Colony.\n\nThe 57-year-old said she had always wanted to dance, but felt shy. At places where she had danced – relatives’ and friends’ weddings and Navarathri – it had always been under compulsion. “But today, I’m myself. After the initial hesitation, I told myself to get out of the fear and dance. I did it and now am feeling happy and energetic.” She was dancing to numbers rendered by a group of youngsters.\n\nAt the other end of the Car-free Sunday stretch was G. Nelish Darshan of KG Layout. The third standard student with a chalk in hand drew shark and dolphin on the road that was all his. “I’m drawing because I know drawing and enjoy it,” pat came the reply.\n\nA little away from him were brothers, Suraj S. and Sanjay S., walking with rolled papers on their hands. They were just returning from a sitting with artist V. Chandrasekar, who had caricatured them. “Last Sunday, I was here to see what’s going on. This week, I got caricatured,” Suraj said.\n\nIn another part of the road was P. Jagannatha Reddiar of Bhadrasamy Street. With his head and neck to the ground, he had raised his torso for an asana. “I’m 81 years old and enjoy what I do,” he said and wanted people to practice yoga.\n\nThere were hundreds like the aforementioned who had thronged NSR Road to enjoy aerobic sessions by Bethovan, watch street play by students of CMS College, solo dance performances, listen to karaoke sessions with Radio City and watch zumba, Bharatnatyam and skit by AJK College students.\n\nRadio City (91.1) was the Radio partner and Mark 1 Events was the events manager. The three-hour-long event recorded by Radio City will be aired on Friday as a prelude for the next Sunday. Those who want to have events at Car-free Sundays can contact Madhan (9715063000) of Mark 1 Events.", 
    "section": "national", 
    "title": "Young and old make the most of Car-free Sundays", 
    "subsection": "tamilnadu", 
    "date": "2016-03-28"
}