{
    "author": [
        "S Prasad"
    ], 
    "text": "It’s not against development, says Navin Piplani of INTACH Heritage Academy\n\nHeritage regulation for a city like Puducherry is very important and will make sure that all development required is in tandem with the character of the building, said Navin Piplani, Principal Director of INTACH Heritage Academy.\n\nSpeaking on the sidelines of a workshop on Adaptive Reuse of Historic buildings organised by INTACH, he said that contrary to misconception, heritage regulation is not against development and whatever development Puducherry needs will be regulated to make sure that it is in tandem with the listed buildings. The Government should also play a more proactive role and introduce heritage regulation and guidelines to ensure buildings that are over 100 to 150 years old are not demolished.\n\n“Though Puducherry does not have iconic monuments like Taj Mahal, Qutub Minar and the Meenakshi Temple, tourists still visit the city to see the streetscapes, the French and Tamil quarters, the layout, grid plan, seashore and the peaceful life all of which together make Puducherry a heritage place,” Mr. Piplani said.\n\n“We can only improve on this by conducting heritage walks, training programmes and workshops for private homeowners like what incentives can be given to them to showcase Puducherry as a heritage town,” he said.\n\nMr. Piplani said that the use of non-conventional materials like Reinforced Cement Concrete (RCC) for reconstruction of heritage buildings in Puducherry will set a precedent and completely wipe out the historic layers “Everyone who is either for the reconstruction of the Marie or against reconstruction should make their opinion heard or arrive at a consensus. Neither the experts nor the government decides but it is the people of Puducherry who ultimately decide,” he said.\n\n“Govt. should ensure that buildings that are over 100 to 150 years old are not demolished”", 
    "section": "national", 
    "title": "Accent on regulation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}