{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu Chamber of Commerce and Industry has appealed to the Chief Minister, Jayalalithaa, to withdraw the amendments to Tamil Nadu Value Added Tax Act and Rules, which came into effect from January 29.\n\nIn a statement issued here on Friday, the senior president of the chamber, S. Rethinavelu, and president N. Jegatheesan claimed that the amendments notified by the State government would “paralyse trade and industrial activities in Tamil Nadu.” The definition of ‘input tax’ under Section 2 (24) of the Act, the chamber said, had been amended by substituting “tax paid or payable” with “tax paid.” This was a severe blow to the prevailing credit purchase practice as the purchasing dealer could not avail himself of input tax benefit till he made payment to the seller. This was also contrary to Section 2 (23), which included both cash payment and deferred payment in the definition of “sales.”\n\nReferring to another amendment to Section 19 (1), which said that a registered dealer could avail himself of input tax credit only after establishing that the tax due on purchase of goods had actually been paid by the seller, the chamber wanted to know whether there was any foolproof mechanism for buyers to ensure payment of tax by sellers.\n\nThis was also contrary to the provision in the Act that gave time for the seller till 20{+t}{+h}of every month to pay tax. If the amendment was implemented, the buyer could neither sell the goods nor use them as raw materials till the seller paid the tax.\n\nThe chamber also pointed out that the fee for inclusion of a branch or godown in the existing Registration Certificate under VAT had been increased 20 times from Rs 50 to Rs 1000. The penalty for wrongly availing input tax had also been increased from 50 per cent of the tax due to 300 per cent. The amendments, the chamber said, would cause extreme hardship to dealers and trigger migration of trade and industry to neighbouring States.", 
    "section": "national", 
    "title": "‘Amendments to Tamil Nadu Value Added Tax Act and Rules will impact trade’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}