{
    "author": [
        "Pankaja Srinivasan"
    ], 
    "text": "Birders in and around The Nilgiris gear up for the Big Bird Day (BBD) on February 7, for a dawn-to-dusk bird count. Sitting in another country, Jamuna Raju who could not make it to the count, is nevertheless busy organising the logistics. “I am a native of Ooty. Jungles are my second home,” she says.\n\nWhen BBD was started in 2004 by Bikram Grewal, it was only for Delhi. Some 236 birds were recorded across the city. “But slowly, the movement grew to include states such as Haryana, Mizoram and the Andamans joined in,” says Mr. Grewal. Now, it is pan Indian. “I would love it if we had one Big Bird Day throughout the country, but I am also fine if people had their own BBDs,” he says. Local involvement is the key. “I have been singularly lucky to have someone like Jamuna in your part of the world who has done so much. I am really pleased that it has taken off in The Nilgiris and the surrounding areas.”\n\nDharuman Nanjan, from Kotagiri, is known better as the ‘Birdman of The Nilgiris’.\n\nLast year, he spent six months documenting the Shaheen Falcon and has shot thousands of photographs of it. While this is the third year of BBD for the inhabitants of The Nilgiris (Ooty, Gudalur, Coonoor, and Kotagiri), Sathyamangalam and Coimbatore are the new members with people such as Ravindran Kamatchi from Tirupur also joining Mr. Nanjan.\n\n“It is serious business as we identify and record wetland birds, migratory birds, resident and grassland and shola birds and the endemic birds,” says Mr. Nanjan. About 200 species can be documented in a day around lakes, damns, forests, grasslands, etc. This becomes significant when collected over several seasons.\n\nThe information from the various birders is collated and then uploaded.\n\nFor more information visit http://www.\n\nbirdcount.in", 
    "section": "national", 
    "title": "Birders gear up for Big Bird Day", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}