{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Rural outreach was accorded a thrust by Bannari Amman Institute of Technology at Sathyamangalam on Friday through commissioning of Community Radio with a reach of a radius of up to 20 sq km.\n\nFor four hours in the morning from 6 a.m., and five hours in the evening from 5 p.m. the FM station operating at 90.4 MH will broadcast awareness programmes in the areas of education, health and hygiene, agriculture, women’s development, community service, self-employment, and other aspects fostering their overall development in a jurisdiction covering Sathyamangalam, Gobichettipalayam, Puliampatti, Kodiveri, Bangalapudur, Bannari, K.N. Palayam, and T.N.Palayam.\n\nVital information on government schemes will be provided through the Community Radio.\n\nThe institution has vested its students with the responsibility of conceiving and producing programmes with a creative approach at the Rs. 60 lakh facility.\n\nThe radio station would serve as a platform for students to develop a versatile outlook, and for local residents in various walks of life to share their expertise with the targeted sections of society, said BIT chairman S.V. Balasubramaniam.\n\nEven in the backdrop of digital era, radio programmes directed at the rural community will continue to hold relevance.\n\nInaugurating the Community Radio, Andal Priyadarshini, Station Director, Doordarshan Kendra, Coimbatore and Madurai, said that information and education ought to gain precedence over entertainment in radio programmes.\n\nHuman interest programmes depicting exchange of views will have more acceptability than mere statistics while delivering information, said Ms. Andal adding that radios have a vital role in making the community realise cultural richness.\n\nChief executive of Bannari Institute of Technology A.M. Natarajan said that the FM station programmes will be accessible to eight lakh people in the surrounding areas.\n\nMember of the trust that runs BIT, M.P. Vijayakumar, said that programmes would be broadcast based on research on public needs.\n\nA.M. Chinnarajan, executive president, Bannari Rural Foundation, Sathyamangalam; P. Thangavelu, chairman, Amutha Hospitals, Sathyamangalam; and Thilagavathi Thirumoorthy, president, Makkinankombai Panchayat, offered their felicitations.", 
    "section": "national", 
    "title": "BIT extends reach to rural populace", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}