{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: R. Rangan, Sri Arunagirinathar Arangam, Kumaran Kundram, Chromepet, 6.30 p.m.\n\nKoorathazhwan Vaibhavam: Kidambi Narayanan, Sri Andalammal Matam, Sanjeevaroyan Koil St., Old Washermenpet, 6.45 p.m.\n\nManisha Panchagam: R. Rajagopal, PS HSS., Mylapore, 6 p.m.\n\nPerumai Mikka Pen Adiyargal: Sudha seshayyan, Asthika Samajam, Venus Colony 1{+s}{+t}St., Alwarpet, 6.30 p.m.\n\nKandhan Karunai: Madhivannan, Sanskrit College, Mylapore, 6.15 p.m.\n\nAdi Sankara: Satyavratananda Saraswati, Kesari HSS., Pondy Bazaar Extn., T. Nagar, 5.30 p.m.\n\nCULTURE\n\nSri Ramakrishna Math: Inauguration of ‘Vivekananda Navaratri and Divine Book Festival’, Vivekananda House, Kamarajar Salai, 5 p.m.\n\nSriram Bharathi Kalai Illakkiya Kazhagam: Mahakavi Bharathiyar 134{+t}{+h}birth anniversary celebrations, Sri Krishna Gana Sabha, T. Nagar, 5.15 p.m.\n\nVel’s Ragas and Vel’s Natyalaya: Vel’s Maha Utsav 2016, Mogappair, 6 p.m.\n\nGENERAL\n\nAuuro Educational Services: Convention on Education as ‘Empowering India through quality early years education’, Governor K. Rosaiah participates, Hotel ITC Grand Chola, 10.30 a.m.\n\nMadras Diabetes Research Foundation and University of Alabama Birmingham, USA: Inauguration of seminar on ‘Prevention and control of non-communicable diseases’, Conran Smith Rd., 11 a.m.\n\nSruti Foundation: Distribution of awards, Sri Sankara Vidyashramam MHSS., South Avenue, Kamaraj Nagar, Thiruvanmiyur, 6 p.m.\n\nMadras School of Social Work: HR Symphony on ‘HR Analytics’, Casa Major Rd., Egmore, 9 a.m.\n\nCREDAI: Inauguration of Home Loan mela, Vijaya Mahal, T. Nagar, 10.30 a.m.\n\nThe Institution of Engineers: Inauguration of workshop on ‘Construction failures cause remedies’, Swami Sivananda Salai, Chepauk, 10 a.m.\n\nVelammal Institute of Technology: Project competition on ‘Go Green 2016’, Panchetti, 9.30 a.m.\n\nThe Hindu Higher Secondary School Alumni Association: Alumni meeting, Big Street., Triplicane, 4 p.m.\n\nBharath SSS.: Annual day celebration, Adyar, 5.30 p.m.\n\nC.S.I. St. Pauls HSS.: Beautification of Marina on the occasion of 300{+t}{+h}anniversary of school, Marina, 9.30 a.m.\n\nLittle Drops Hygiese for Health Trust: Interschool competition on science of hygiene, Sri Kailash Mahal, Ambattur, 9 a.m.\n\nTheosophical Society (Kilpauk Lodge): Talk on ‘How to overcome worries’, Dr. Alagappa School, G.K.Rd., Purasawalkam, 6 p.m.\n\nPeriyar Library Reader’s Circle: Meeting, Periyar Thidal, Vepery, 6.30 p.m.\n\nNarcotics Anonymous: Meetings, Turning Point Group, Arul Kadal Aikiya Aalayam, Santhome High Rd.; and New Attitude Group, St. Andrew’s Church, Choolai, 7 p.m.\n\nAl-Anon: Meetings, Community Service Centre, Balfour Rd., Kilpauk; Alagu Andavar Temple, Korukkupet; TPI Kalyana Mandapam, Avadi; and Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; and Iraivan Thantha Vaippu Kuzhu, Thiruvottiyur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Community Service Centre, Balfour Rd., Kilpauk; PS HSS., Mylapore; Advent Christian Middle School, Velachery Rd., Sembakkam; Risen Christ Church, Paper Mills Rd., Peravallur; Alagu Muthu Mariyamman Tirumana Mandapam, Periyar Salai; St. Teresa Church, Nungambakkam High Rd.; E.C.I. Zion School, 100 ft. Rd., Ekkatuthangal; Our Lady of Perpetual Help Church, Manali Town; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Karthikeyan MHSS., Saligramam; D.B.I. Colony, C.T.H. Rd., Avadi; St. Vincent School, Assumption Church, Railway Colony, Choolaimedu; and C.S.I. Church, Arcot Rd., Virugambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}