{
    "author": [], 
    "text": "Religion\n\nShri Bhandarakeri Mutt: Discourse on “Sri Vyasarajara songs”, Sri Raghavendra Swami Temple, 6 p.m.\n\nGeneral\n\nBharatiya Vidya Bhavan: Golden Jubilee celebrations, R. Seshasayee, chairman, Infosys, chief guest, Sanjay Jayavathanavelu, CMD, Lakshmi Machine Works, guest of honour, Bhavan’s premises, 5.30 p.m.\n\nSNS College of Engineering: Project contest and workshop, 8.30 a.m.\n\nSaraswathi Ramachandran Vidyalaya Matric. Hr. Sec. School: Award Ceremony and Silver Jubilee celebrations, 5 p.m.\n\nBombay Chartered Accountants Society: Workshop on “Internal financial controls IND AS and Refresher on Companies Act 2013”, The Residency Towers, 9 a.m.\n\nKPR Institute of Engineering and Technology: State-level Science Fest 2016, 10 a.m.\n\nPoompuhar: Crafts mela, Meenakshi hall, 10 a.m.\n\nAvinashilingam University: Conference on “Transition of financial sector for sustainable development”, 10 a.m.\n\nVIVRO Finance Services and JMACS Associates: Programme on capital mobilisation for SMEs, The Grand Regent, 10 a.m.\n\nShree Sarasswathi Vidhyaah Mandheer: Annual Day celebration, 4.30 p.m.\n\nUMS Technologies Ltd: Product launch event of “UMS GT Lab”, Gopal Bagh, 2 p.m.\n\nT.V. Sekharan Memorial Matriculation Hr. Sec. School: Annual Day, 4.30 p.m.\n\nMurugappa Group: Murugappa Kovai Quotient Quiz 2016, PSG Auditorium, 2 p.m.\n\nSri Sowdeswarri Vidyalaya Model Matric. Hr. Sec. School: Annual Day celebrations, 5.30 p.m.\n\nKarpagam College of Engineering: Inauguration of IEEE and Workshop on “Latex for Research Publications”, Lab VIEW Academy, 9 a.m.\n\nCoimbatore Institute of Management and Technology: Guest lecture on capital market awareness,\n\n10 a.m.\n\nDhaanish Ahmed Institute of Technology: Annual Day and Sports Day function, 9 a.m.\n\nShri Nehru Vidyalaya Matric. Hr. Sec. School: KG Graduation Day,\n\n5 p.m.\n\nTamizhaga Vivasayigal Sangam: Meeting, Tamizhaga Vivasiygal Sangam, Vayyampalayam, 10 a.m.\n\nNehru Institute of Technology: National Level Technical Symposium for school students, Seminar Hall,\n\n10 a.m.\n\nPPG Institute of Technology: Workshop on “Wordpress”, Seminar Hall, 9.30 a.m.\n\nV.L.B. Janakiammal College of Arts and Science: Faculty Development Program 10 a.m.; Teenz Karnival 2k16, 10 a.m.\n\nNehru Institute of Technology: Aspire 2016, 10 a.m.\n\nAgro Forestry News Letter: meeting, Office of the Conservator of Forests, 10 a.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}