{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "S. Chandran, who along with his wife C. Mariammal, were drugged and robbed in the Mumbai CST - Nagercoil Express on Thursday.\n\nA 59-year-old man and his wife travelling from Mumbai to Madurai in the Mumbai CST –Nagercoil Express were drugged and four sovereigns of gold jewellery and Rs. 10,000 in cash stolen from them in the train on Thursday afternoon.\n\nThe victim S. Chandran, a native of Madurai district, who is running an automobile repair workshop in Mumbai, was coming to Thachampathu here to attend a family function.\n\nMr. Chandran told The Hindu that he suspected the role of a pantry car employee as it was after sipping the tea bought from the man that he and his wife C. Mariammal (49) became unconscious.\n\n“The tea tasted odd. When I asked the employee, he said everything was alright. That was the last thing I remember,” said Mr. Chandran who was recuperating at Government Rajaji Hospital here on Friday.\n\nDifferent version\n\nHowever, in the complaint lodged with the Government Railway Police (GRP), Mr. Chandran told a different version.\n\n“He told us that the lunch delivered by the pantry car caterer was received by a co-passenger as he and his wife were asleep in the afternoon when the train was crossing Krishnarajapuram in Karnataka. Later, on consuming the lunch, they fell unconscious,” an official from GRP said.\n\nChandran’s relatives and his daughter, who reside in Mumbai, kept calling him to check whether the two had reached Madurai but their calls went unanswered.\n\n“When the train was crossing Madurai, a fellow passenger picked up the call and informed Chandran’s daughter that the two were lying unconscious,” said S. Murugan, a relative.\n\nChandran’s relatives in Virudhunagar, who were immediately alerted, rushed to the railway station to rescue them.\n\nChandran and Mariammal were taken to the government hospital in Virudhunagar with the help of GRP and later referred to GRH.\n\nGRP Superintendent of Police (Tiruchi) Dr. Z. Annie Vijaya conducted enquiries with the two at GRH.", 
    "section": "national", 
    "title": "Couple drugged and robbed in train", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}