{
    "author": [
        "Aditi R"
    ], 
    "text": "There are 1,000 students at Ambattur ITI and the problems they have to endure are endless\n\nCrumbling basic amenities is robbing the sheen of the State government-run Institute of Industrial Training (ITI) in Ambattur.\n\nA dense overgrowth of vegetation, broken toilets and damaged furniture greet students of this 54-year-old institution, which once saw youth from places as far as Cambodia receiving training here. Students have been going through an ordeal for many years. “A year ago, when I was new to the institution, I was searching for a washroom. But what I found was broken toilets, there was no other place for students to use and it is still the same,” said S. Logesh, a final-year mechanical engineering student.\n\nThere are 1,000 students at the college and problems they have to endure are endless. The college playground is mostly used by cattle to graze and the overhead water tank has been lying empty and unused for over five years. “We had to cut water supply from the tank as chemicals from the nearby factory polluted the groundwater,” said an official on conditions of anonymity.\n\n“Before applying for admission, I was promised that I will be given hostel accommodation, but it has been over six months since it was shut down. It is extremely difficult but I have no other choice,” said Logesh, who travels everyday from Tiruttani in Tiruvallur district. The hostel, which can accommodate over 200 students, was shut down in August last.\n\nMiscreants manage to break into the institution and ransack property, taking away whatever they can.\n\n“They used to enter hostel rooms and playgrounds and quarrel with hostel residents. We neither have enough manpower nor money to build a compound wall,” said a professor.\n\nThe 20-acre institute, which offers 20 vocational courses, was established in 1962 by the State government. Though there has been an increase in the number of students opting for the popular diploma courses in engineering here, there has been a drastic reduction in basic infrastructure.\n\n“We had students from Andaman and even countries like Cambodia with their government sponsoring their study, but that was decades ago. There is a still a possibility of restoring the institution to its original glory,” the professor said.", 
    "section": "national", 
    "title": "Crumbling amenities plague Ambattur ITI", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}