{
    "author": [
        "Deepa H", 
        "Ramakrishnan Sunitha Sekar"
    ], 
    "text": "Requirement in city is high post-floods, in neighbouring States after bifurcation of A.P.\n\nith thousands of road works progressing in Tamil Nadu, there is a sudden high demand for bitumen.\n\n“After the unprecedented floods in November and December last year, nearly 2,500 km of roads were damaged and many stretches are being re-laid or repaired. We are unable to get enough bitumen for our work since there is demand from neighbouring States as well,” said a source in the Highways Department.\n\nRequirement for bitumen is usually quite high from February to August when roads are laid in Tamil Nadu. This year, after the bifurcation of Andhra Pradesh and formation of Telangana, a lot of roads are being laid in the two States. Demand for bitumen also comes from the Army, National Highways Department of India, local bodies and airports.\n\n“In Tamil Nadu, everybody seems to be in a hurry since the elections are just round the corner and projects have to be begun. They also have to finish up before the end of the financial year,” explained a contractor, who has been waiting for bitumen.\n\nSources in the oil industry explained that the Chennai Petroleum Corporation Ltd (CPCL) refinery at Manali processed around 10 lakh tonnes of crude oil a month and from that, 40,000 tonnes of bitumen were obtained every month.\n\n“The refinery is already working on Sundays due to the peak in demand. It cannot refine more than its capacity. But, that has been fixed based on the requirement of various stakeholders. There is enough bitumen for everyone. It is supplied on first-come-first-served basis,” said a source.\n\nCPCL supplies three categories of bitumen based on the viscosity of the product. It is sent to Indian Oil Corporation Ltd. that markets it. However, a section of the contractors said that even though they paid advance for the bitumen, they were still waiting for their turn.\n\n“We need 2.2 tonnes of bitumen for laying a single lane road of 3.5 metre width.”\n\nChennai Airport director Deepak Shastri said they had been in need of bitumen only for re-laying of the main runway for a while now. For a few months now, the re-laying of the main runway for a length of 3,658 metres – a routine procedure done once in a while – has been carried out. Officials noted they needed about 1,000 tonnes of bitumen for this process that might go on for about ten months. They have completed phase I of the re-laying and the phase II is on.\n\n“The major work starts during phase III. That is when an extensive requirement is likely,” he added.\n\nA lot of bitumen is needed from February to August when roads are laid", 
    "section": "national", 
    "title": "Demand for bitumen shoots up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}