{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Booth-level officers will be present in all polling stations on February 7 and 14\n\nOn the directive of the Election Commission of India, the administration will launch a special campaign in all polling stations of the Union Territory of Puducherry on February 7 and 14 (Sundays) to facilitate the voters to verify their names in the electoral rolls and to enable left out voters to enrol their name so that they could also exercise their franchise in the ensuing Puducherry Legislative Assembly Poll, 2016.\n\nThe exercise is being undertaken for facilitating continuous updation of the Photo Electoral Rolls, 2016, with reference to June 1, 2016 as the qualifying date.\n\nV. Candavelou, Chief Electoral Officer, said here that accordingly, in all the Polling Stations of the UT on these days, the Booth Level officers would be required to be present in their respective polling stations and keep the Electoral Rolls ready with them.\n\nThe public are requested to make a visit on the above date and confirm that their names find a place in the Electoral Rolls.\n\nLeft out voters may file their application form for inclusion to BLOs on that day itself to enrol their names in the electoral roll.\n\nThe left out voters are required to bring the following copy of the documents for inclusion of name in the electoral rolls: Passport size colour photo, Residence proof, age proof and EPIC, if available.\n\nIt has been clarified that the EPIC is only an identification document and does not guarantee franchise, if name of the person is not in the Electoral Roll.\n\nHence, the EPIC holders are also requested to confirm that their names are present in the Electoral Rolls.\n\nPublic are requested to avail this opportunity to enrol as voters and also help the Elections Department to prepare error free Electoral Rolls.\n\nMobile van\n\nMeanwhile, the District Collector D. Manikandan, who is the District Election Officer, announced the schedule of mobile voters’ registration vehicle in Puducherry in February and March.", 
    "section": "national", 
    "title": "EC calls voters to verify names in rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}