{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The Election Commission of India’s campaign on social network, designed to inspire youngsters to register and vote in the coming Tamil Nadu Assembly elections, has caught everyone’s attention. The posters derive its idea from popular culture. For instance, one of the posters urges the youngest voter, ‘You know what you need to do when you turn 18’, a play on the popular movie ’36 Vayadhinile’ starring actor Jyothika.\n\n“Tamil Nadu has 24 lakh voters who are around 18-19 years of age. Of this, around 18 lakh voters are registered, leaving 6 lakh unregistered voters. We want our campaign to speak directly to the youth in their own lingo instead of putting out our usual government ads. So far, the campaign has worked very well,” says Rajesh Lakhoni, Chief Electoral Officer, who is in charge of the State Assembly elections in 2016.\n\nThe advertising company, Opn Advertising, has been roped in to run a campaign that would resonate with the youth of Tamil Nadu. The agency designs posters based on popular trending topics.\n\n“We didn’t want to do the preachy ads. So, we take ideas from what is trending on social media. For instance, we improvised on ‘Be Like Bill’ memes and played around with movie names and popular dialogues. The idea was to recycle popular culture to reiterate our campaign,” says Bala Manian, director (Strategy), Opn Advertising.\n\nMr. Bala says that the Election Commission has been co-operative and willing to do things differently. “They didn’t want to be seen as bureaucratic. They wanted to really reach out to people to get as many people to vote,” she says.\n\n“We have been getting many calls from voters who want to know how to register,” Mr. Lakhoni said.\n\nPosters and memes drive campaign to bring youth to polling booths", 
    "section": "national", 
    "title": "EC taps popular culture to net voters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}