{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A three-day National Technical and Research Symposium on Electrochemical and Chemical Technology 2016 (INTERSECT’16), a national-level technical symposium and cultural event began here on Thursday.\n\nThe event was organised by the Electrochemical Technologists Association (ETA) in the Council of Scientific and Industrial Research-Central Electrochemical Research Institute (CSIR-CECRI) from February 4 to 6. Inaugurating the conference, M. Jayachandran, acting Director, CSIR-CECRI, said that he always felt happy to work with young minds as they came up with fresh ideas. “I believe in old methodologies but with new ideas to guide students,” he said and advised the delegates to interact freely with scientists and take up projects at CECRI. Ramesh Babu, Dean, Centre for Education-CECRI, explained the unique B.Tech. (Chemical and Electrochemical Engineering) programme offered at the institution. V Ramamoorthi, retired Dean and Professor, AC Tech., Anna University, Chennai, emphasised the role of electrochemical engineering in the present era. Electrochemical engineering was the need of the hour, he said and cited various real-life applications.\n\nHe also emphasised the role of ethics in the engineering profession and urged the students to follow 10 principles — Knowledge, Attitude, Skill, Persistence, Hard work, Involvement , Sincerity, Honesty, Humbleness and last but most important Simplicity — to be a successful person.\n\nHe distributed awards to Srinivasan and Shruthi, outstanding students of final-year batch of electrochemical engineering. G. Sreedhar, Scientist, and Sundar Mayavan, Senior Scientist, briefed about the INTERSECT conference.\n\nThe conference was a great opportunity for young minds, they said adding the technical symposium was being conducted with a team of B.Tec.h and research scholars of CSIR-CECRI. It had events such as oral presentation, poster presentation, science quiz, workshops on instrumentation, online competitions and designing competitions, they said.\n\nHe stressed the role of ethics in the engineering profession and urged students to follow 10 principles", 
    "section": "national", 
    "title": "Emphasis on new ideas for old methodologies", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}