{
    "author": [
        "S Senthalir"
    ], 
    "text": "Conservationists liven up Pondicherry Heritage Festival with their experiences\n\nPondicherry Heritage Festival 2016 opened up on Friday with discussions towards finding ways of conserving the built heritage in the city with examples from different parts of the country.\n\nThe conservation experts with their varied experiences from across different regions in India stressed for awareness about our heritage and the need to value it for long-term conservation of our built heritage.\n\nThey emphasised the need for a legislation to preserve the built heritage in Puducherry.\n\nGazette notification\n\nShikha Jain, Director, Preservation and Urban Design, Development and Research Organisation for Nature, Arts and Heritage, Haryana, said that many cities have incorporated bylaws in the city master plans of State Town and Country Planning Act to protect heritage buildings.\n\n“According to the bylaws implemented in other cities like Maharashtra, all the listed buildings have to go through the gazette notification and heritage committee under the ministerial bylaws. The benchmark change is the Supplement Toolkit on City Development Plan with Focus on Heritage under the City Development Plan introduced in 2012-13. This has to be implemented,” she said.\n\nThe experts also discussed the technique that needs to be used in the restoration or reconstruction of built heritage.\n\nNadine Le Prince, Haveli Cultural Centre, Fatehpur, Rajasthan, said: “For restoration of heritage buildings, people have to know the technique of restoration and the craftsmanship is dwindling in many parts. I am keen on bringing together people working in the field of restoration in Jaipur and French for discussion on restoration technique. It will be worst if modern materials like cement are used for restoration.”\n\nShe added that it was important to make people understand what restoration is.\n\nModernity and tradition\n\nRaphael Gastebois, an expert in architecture, attached to the French Cultural Affairs Ministry, emphasised that modernity and tradition should come together in the reconstruction of Mairie building in Puducherry. “Traditional and modernity should come together in the conservation of heritage buildings,” he said.\n\nPhilippee Toussaint, president, Vieilles Maisons Françaises (VMF), a French-government recognised association involved in heritage preservation, said that every heritage has a story and its story is written in its walls. “There are many heritage buildings which the government can protect like the temples. Even the houses could be protected. People should learn to respect the architecture and keep its character of the street even if they want to modernise,” he said.\n\nHe added that in France there is a law which enables people to have five rooms of their house open to tourists. “We have to adapt the strategies depending on the type of people a city has. Interactive websites should be used to involve people. The heritage conservation should not be against the people but for the people. People have to be convinced that their buildings need to be preserved. First we need advisors. he said.\n\nTeaching younger generation\n\nNadine Le Prince – Haveli Cultural Centre, Fatehpur and Philippe Toussaint, president of Vieilles Maisons Françaises (VMF), a French-government recognised association involved in heritage preservation, stressed the need to work with schools to cultivate an attitude for conservation of heritage beginning with children.\n\nHaving worked with schoolchildren in erstwhile Chandernagore in West Bengal, a lesser known French colony, Philippee said that if children are taught about conserving built heritage, they would teach their parents too.\n\n“We invite teachers and students to visit the restored heritage buildings in Rajasthan. Through this, we tell them that heritage buildings can not only be museum or heritage sites but also houses. Small houses can be heritage too,” added Nadine.\n\nFirst, people should understand their treasure. They have to understand the good technique and find ways to conserve the built heritage — Nadine Le Prince\n\nPuducherry is a small city and has a specific character. I think that is why education about heritage is important for the young generation — Philippee Toussaint", 
    "section": "national", 
    "title": "Experts discuss ways to protect heritage buildings", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}