{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "SMOOTH RIDE:The City Corporation has re-laid the stretch between Muthampalayam and Rangampalayam in Erode, with special funds provided by the State Government.- Photo: M. Govarthan\n\nResidents in Erode city could heave a sigh of relief as the Corporation is now in a position to re-lay to a considerable length the roads that were dug up for laying underground drainage pipes, in the wake of the State Government’s allocation of Rs. 86 crore.\n\nThe sanction was accorded a few days back based on a proposal for Rs. 98 crore funding submitted by the civic body. There was anxiety among administrative and political circles alike whether the sanction would be made with a sense of urgency in view of the elections to the State Assembly in the coming months.\n\nThe apprehension arose since once the Election Commission of India announces the date of elections, major financial allocations for developmental works, even if they are pending ones, cannot be made by the State Government.\n\nThe first-phase works are already in progress over the last month or so with Rs. 25 crore provided by the State Government late last year. The first-phase covers roads that were dug up years ago when the UGD project was initiated. Re-laying work has just been completed in the stretch between Muthampalayam and Rangampalayam. The City Corporation had to wait for the completion of rainy season to relay the dug-up roads.\n\nUnder the second phase, the Rs. 86 crore funding has been provided out of Rs. 1,000 crore earmarked by the Municipal Administration and Water Supply Department for restoration of roads in urban local bodies.\n\nMeanwhile, the Erode Tax Payers People’s Welfare Trust has sought Rs. 200 crore from the Central and State governments for re-laying all roads dug up for underground drainage works. Roads in the erstwhile Erode Municipality area where there are numerous textile units, temples, and schools must be prioritised for relaying, the Trust said, urging the City Corporation to be objective in utilising the funds allotted by the State Government for relaying roads.", 
    "section": "national", 
    "title": "Fund allocated for re-laying damaged roads in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}