{
    "author": [
        "R Sujatha"
    ], 
    "text": "A cross-section of “guest lecturers” in the State are upset with a circular issued by the Directorate of Collegiate Education that around 370 ‘surplus teachers’ from Annamalai University will be transferred to other government colleges in the State where vacancies exist.\n\n“It is unfair that we who have been working as guest lecturers have been overlooked for these positions. We have the required qualifications and have served the government for over a decade. Some of us have been on contract since 1996 and yet we have not been absorbed,” said B. Senthil Kumar, vice president of Guest Lecturers’ Welfare Association.\n\nGuest lecturers are paid Rs. 10,000 as salary, which is denied during the vacation period. They are on contract with the government, which is renewed every year. Guest lecturers say if they were moved to private colleges the salary would be much lower.\n\nMahesh (name changed), who has been a guest lecturer for the last 17 years in the Nilgiris district, says he lives a hand-to-mouth existence.\n\n“There are not many colleges here and I cannot relocate as I have to consider my family and care for my elderly parents. I cannot leave them to fend for themselves, so I have stayed put here,” he said. Some of his students have got permanent jobs in government colleges, thanks to the 10 marks allotted for interview.\n\nIn the past two elections, the AIADMK and the DMK had listed in their manifestoes the guest lecturers’ demand to be regularised. Yet neither party made any effort.\n\n“In 2005, when we protested DMK leader M. Karunanidhi promised that he would give us job security. The AIADMK also assured us that we would be regularised. In 2011, the political parties again promised us but some of us have been guest lecturers since 1996,” Mr. Senthil Kumar said.\n\nAccording to the association, other States had periodically regularised guest lecturers through special recruitment drives.\n\nP. Sivaraman, general secretary of Government College Teachers Manram, said given that the vacancies in government colleges have not been filled yet, the Higher Education department should consider regularisation of guest lecturers. “We have been asking that they be paid salaries as per UGC guidelines. Even that has been ignored,” he said.\n\nExpress reservation over transfer to private colleges", 
    "section": "national", 
    "title": "‘Guest lecturers’ await regularisation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}