{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has come to the rescue of a seven-year-old boy whose father died in a road accident in 2009 without marrying his mother legally and just months before a DNA test had been scheduled to prove the paternity.\n\nPassing interim orders on a civil appeal filed by the minor boy, represented by his mother, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran permitted him to withdraw Rs.4 lakh out of Rs.16 lakh awarded by a motor accident claims tribunal in 2012.\n\nThe judges agreed with the petitioner’s counsel G. Prabhu Rajadurai and I. Robert Chandrakumar that a complaint of rape lodged by the child’s mother with the State women’s commission and consequent registration of a FIR, even before the child’s birth, were enough to presume paternity.\n\nAccording to the child’s mother, the deceased, being her neighbour, had had sexual intercourse with her on several occasions on the promise of marrying her.\n\nComplaint\n\nHowever, when she became pregnant, he turned a volte face forcing her to lodge a complaint with the women’s commission.\n\nThe commission forwarded the complaint to the Thoothukudi police and it led to registration of a case under Sections 376 (rape) and 420 (cheating) of the Indian Penal Code and Section 4 of Tamil Nadu Prohibition of Harassment of Women Act, 1998 just a month before the child was born.\n\nSubsequently, a lower court directed the accused to undergo DNA test at a Forensic Sciences Laboratory in Chennai on July 24, 2009.\n\nIn the meantime, he met with a road accident and died on April 19, 2009 and a tribunal in Tirunelveli awarded Rs.16 lakh as compensation to his mother.\n\nThe child’s plea for compensation was rejected for want of evidence to prove legal heirship.\n\nHowever, the insurance company appealed against the award after depositing the entire amount in a bank and the mother of the deceased succeeded in withdrawing 50 per cent of it through court orders.\n\n‘Use interest’\n\nNow disposing of an application filed by the child, the Division Bench directed his mother to withdraw Rs.4 lakh, deposit it in another bank account and use the interest for his expenses without prejudice to the claim of the motor accident victim’s mother and until the disposal of the appeal.", 
    "section": "national", 
    "title": "HC comes to rescue of boy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}