{
    "author": [
        "Staff Reporter"
    ], 
    "text": "When the word Gethu – the title of Udhayanidhi-starrer – finds a place in Tamil dictionaries, spelling it as Gethu in English and not as Kethu (as contended by the State) has no relevance for the grant of exemption from entertainment tax, the Madras High Court held on Friday and directed the State government to grant exemption to the film from the date of its release. The film was released on January 14 to coincide with Pongal.\n\nPassing the order on a plea moved by the producer of the film Red Giant Movies, Justice M. Duraiswamy directed the Government to refund the tax collected from January 14 to the petitioner.\n\nPointing out the Government Order (GO) dated July 21, 2011 and a subsequent proceeding dated January 9, 2012 through which the government laid down the criteria that a movie has to satisfy for claiming exemption form entertainment tax, the judge said, “The six-member viewing committee has given a finding in favour of the petitioner with regard to all the four conditions. However, erroneously, without any basis, came to the conclusion that the word ‘ Gethu ’ is not a Tamil word.”\n\nThe judge set aside the impugned order of the Principal Secretary, Commercial Taxes and Registration department dated January 14.\n\nWhile initially the Government had argued that the title of the film was not a Tamil word, during a subsequent hearing, it submitted that though the word existed in Tamil dictionaries, in English the word was spelt as ‘ Gethu ’ and not ‘ Kethu ’ and hence the petitioner was ineligible to seek exemption.\n\nThe Government had contended that according to Tamil grammar, there is only one letter in Tamil with the phonetic expression “ka”. No letter with phonetic expression ‘ga’ is used in Tamil to begin a word.\n\nTherefore, any word starting with phonetic expression ‘ga’ or ‘ge’ cannot be a Tamil word.", 
    "section": "national", 
    "title": "HC directs government to extend tax exemption for Gethu", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}