{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Pradosha puja, Railway Colony, 4.30 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh study circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Mahaangalin Varalaaru’ by K. R. Natesan, New Natham Road, 5.45 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nOur Lady of Lourdes Church: 96{+t}{+h}annual festival; holy mass, Rev. Fr. Madurai Anand leads, 7 a.m.; Rev. Fr. Chinnappa, former Archbishop, leads, 6.15 p.m.; car festival, K. Pudur, 8 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nSri Sathguru Sangeetha Samajam: Laya nadha sangamam, Lakshmi Sundaram Hall, 6.30 p.m.\n\nTHE HINDU and Velammal Medical College: Sangeetha mahotsavam; saxophone concert by Kadri Gopalnath, Velammal College of Engineering and Technology, Viraganur, 6 p.m.\n\nGandhi Museum: R. Devadoss reviews D. G. Tendulkar’s book, ‘Mahatma: Life of Mohandas Karamchand Gandhi,’ Library, 5.30 p.m.\n\nKadambavanam: Tamil value camp, Parali, 9 a.m.\n\nSmall Industries Product Promotion Organisation: Pongal Utsav, exhibition, Madurai District Tiny and Small Scale Industries Association, Dr. Ambedkar Road, 10.30 a.m.\n\nGENERAL\n\nThe American College: Centenary celebrations of Daniel Poor Memorial Library; national conference on ‘Digitization of library: enhancing reading culture,’ 9.30 a.m.; valedictory session, Seminar Hall, 4 p.m.\n\nSethurajan Padma Matriculation Higher Secondary School: 19{+t}{+h}Annual Day celebration; V. Ponraj presides, J. Angelo Iruthayasamy, Chief Educational Officer, distributes prizes, Jaihindpuram, 6 p.m.\n\nICICI Prudential Mutual Fund: Investor education camp, Hotel Sangam, 6 p.m.\n\nLions Club of Madurai City: Visit of District Governor S. Ramasubbu, Hotel Rajadhanee, Lake View Road, K. K. Nagar, 7.15 p.m.\n\nLady Doak College: K. Veera Raghava Rao, Collector, declares 68th annual sports meet open, 8 a.m.; Bala and Kang Chan Deok distribute prizes, 10 a.m.\n\nMannar Thirumalai Naicker College: Mannar Fest, State-level inter-collegiate meet on ‘Literary nonsense;’ M. Lawrence of American College speaks, S. Nehru, Principal, presides, Andalammal-Moorthy Naidu Seminar Hall, 9.30 a.m.\n\nSourashtra College for Women: Placement drive by Infosys BPO, New Auditorium, 8.30 a.m.\n\nSri Aurobindo Mira Matriculation Higher Secondary School: Bandi Gangadhar, Deputy Commissioner of Police, declares 19{+t}{+h}annual sports meet open; S. Murugan, District Sports and Youth Welfare Officer, distributes prizes; C. Chandran, chairman, presides, MGR Stadium, Race Course, 9 a.m.\n\nVidiyal: Science forum, 6 AA Road, Rathinapuram, 10 a.m.\n\nUzhavar Uzhaippalar Sangam: Meeting of farmers; Pongalur R. Manikandan presides, Madurai Reporters’ Guild, Mattuthavani, 3 p.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar,; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}