{
    "author": [
        "K C"
    ], 
    "text": "Trust coming out with manual that aims to push civic bodies to make play spaces more inclusive\n\nThe city has close to 1,000 parks, but only three are disabled-friendly. Ten years after throwing its gates open to what was hailed as India’s first inclusive public play space — Coles Park — the Bruhat Bengaluru Mahanagara Palike (BBMP) cannot brag about having too many of these.\n\nHowever, Kilikili, the Trust formed by parents of children with special needs, which collaborated with the BBMP on the three disabled-friendly parks in the city, is now coming out with a manual that aims to push municipal corporations to make play spaces more inclusive.\n\nThe manual, while being targeted at local corporations and urban development departments, also aims to act as guides to resident welfare associations, non-governmental organisations, disability groups, clubs and parents, egging them to demand inclusive spaces.\n\n“It would be ideal if there is one inclusive park in each ward; it would mean at least 198 disabled-friendly parks. The model of the three disabled-friendly parks was not replicated in parks that were developed subsequently. The manual has specifications, with technical drawings, and we don’t need to exist after it is out,” said Kavitha Krishnamoorthy from Kilikili. Terming a majority of the parks disabled-unfriendly, she said they lacked basic infrastructure such as a ramp at the gate; pathways to facilitate wheelchair access; and signage in Braille.\n\n“Play spaces need to be designed with elements, such as sand and texture. Modification to existing play equipment is also required. Take a slide for example; tubular slides would give children a sense of security while sliding down. Children with visual impairment have also spoken about how the steps with gaps are dangerous, and how covered staircases could be built instead,” Ms. Krishnamoorthy explained.\n\nNot just children, accessibility is an issue even for the elderly, said Albina Shankar, Director of Mobility India.", 
    "section": "national", 
    "title": "Making parks fun for the disabled", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}