{
    "author": [
        "K Manikandan"
    ], 
    "text": "Hundreds of commuters at Chennai Central had to make alternative plans to reach Bengaluru following the derailment of Kanyakumari – Bengaluru Island Express (Train No. 16525) near Jolarpettai in Vellore district early on Friday.\n\nSouthern Railway cancelled the Double Decker, Lalbagh and Bangalore Expresses, while Brindavan Express was operated till Jolarpettai. “If the Brindavan Express could be operated till Jolarpettai, why not our train too,” asked M.Kesavan, who had a confirmed ticket in the Double Decker. He was postponing his trip to Bengaluru, he said.\n\nMany other passengers, after they were informed that all Bengaluru-bound trains were cancelled, either postponed their plans or hired cabs and autos and rushed to Koyambedu to board government buses from Chennai Mofussil Bus Terminus or omni buses from the private bus terminus, commercial staff at the helpline said.\n\nHelpline\n\nSouthern Railway’s helpline at Chennai Central station received plenty of calls from passengers checking the status of departure of trains from Chennai towards Coimbatore via Jolarpettai and Salem. They were informed that all trains on that route were being operated as schedule. K.P.Gurunath, who travelled on the Chennai – Bengaluru – Mysuru Shatabdi Express, thanked Southern Railway and the State Transport Department for arranging buses at Jolarpettai. “The train, scheduled to leave at 6 a.m., left after a delay of 40 minutes. We were initially told that an engine snag was the reason. But during the journey, we received SMS from friends and relatives about the derailment of Island Express,” he said. At Jolarpettai, they were informed that their train was terminated there. “We were relieved that there were no major casualties. We were also pleasantly surprised when we saw buses arranged for taking us to Bengaluru without any halt in between,” Mr. Gurunathan told The Hindu.\n\nSouthern Railway officials in Chennai said the Vellore district administration had arranged for 15 buses to pick up the stranded passengers at Jolarpettai. They said the entire fare will be refunded to passengers who had booked tickets in trains that were cancelled. They said the restoration works were being carried out by Southern Western Railway as the incident took place in their jurisdiction.", 
    "section": "national", 
    "title": "Many trains cancelled; commuters stranded", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}