{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It paves way for bringing down expenditure incurred on electricity consumption\n\nIn a first among the Corporations in Tamil Nadu, the Corporation of Madurai has installed solar panels at the ‘Anna Maaligai’, at a cost of Rs 55.83 lakh, which is expected to produce 44-kw power and thus pave way for bringing down the expenditure incurred on electricity consumption.\n\nDedicating the new facility, Mayor V. V. Rajan Chellappa told reporters that this was a new and novel initiative implemented in the Corporation.\n\nWith the Chief Minister’s objective being a State with surplus power, the Corporation was moving towards the goal and hoped the rooftop solar panels installed at the Anna Maaligai would go a long way in bringing down the cost of electricity bills to the TANGEDCO.\n\nOfficials said that the solar panels, which were installed three months ago, had started benefitting by way of reduction in electricity consumption to the tune of about 40 per cent.\n\nOn an average, the monthly electricity bill for the Corporation was around Rs.1.75 lakh.\n\nAfter the installation of solar panels, the subsequent bills in the last two months were Rs.1.13 lakh and Rs.96,000 per month, they added.\n\nCommissioner (in-charge) S. Shanthi, City Engineer Mathuram, Assistant Executive Engineer Senthil and others participated in the inaugural function.\n\nHigh-mast lamps\n\nLater in the evening, Mr. Rajan Chellappa switched on four newly installed high-mast lamps at Chokkanathar Temple (Yanaikal) intersection, at Thiruparankundram (at the bridge near Mannar Thirumalai Naicker College), at Tiruparankundram girivalam pathai and at Mandela Nagar intersection all at a cost of Rs.19.60 lakh, from the general fund of the Corporation.\n\nTraffic police said that the high-mast lamps at the four-intersections would pave way for better visibility during night and road accidents could be prevented.", 
    "section": "national", 
    "title": "Mayor launches solar power at ‘Anna Maaligai’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}