{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Seven months since the first service between Koyambedu and Alandur was made operational, Chennai Metro Rail has started installing food joints at some the stations on this line in an attempt to attract more passengers.\n\nStations like Alandur and Vadapalani have eateries in the non-paid area of the station (from the entrance to the baggage-scanning area).\n\nAccording to officials of Chennai Metro Rail Limited (CMRL), commercial exploitation of space in stations is mandatory for not just additional revenue but also to bring in more commuters.\n\n“If shops are put up, we expect some increase in ridership. Commuters will also feel more secure and safe in stations. The number of shops will eventually increase in stations,” an official said.\n\nBut commuters cannot bring in food items beyond the non-paid area, the official said.\n\n“They can carry packed items in their bags. But they cannot eat in the paid area or on board trains,” he added.\n\nLakshmi Ram, a commuter, said such facilities made for better travel, atmosphere and safety.\n\n“This is one of the lessons MRTS has to learn; I dread travelling through MRTS stations like Indira Nagar after 7 p.m. because we feel so unsafe. Had there been a few shops and better atmosphere, we wouldn’t hesitate to travel. I travel by the Metro Rail now and it would be great if they added more such shops on this stretch, besides the ones that would come up soon,” she added.\n\nGitakrishnan Ramadurai of IIT-Madras said commercial exploitation of space in a mass rapid transit also helped reduce the number of trips.\n\n“For instance, if a passenger uses the Metro Rail for getting home from his workplace, it will help if he finds a grocery store or an ATM or eatery in one of the stations.\n\nSuch an effort will urge people to use this mass rapid transit facility,” he added.\n\n“If shops are put up, we expect some increase in ridership. Commuters will also feel more secure,”say officials", 
    "section": "national", 
    "title": "Metro Rail opens food joints", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}