{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A strange sound is all that Abdul Rahman Sait heard, before realising that the S5 coach in which he was travelling from Thiruvananthapuram was sliding down in the midst of darkness. The coach, he recalled, was filled with screams and cries of passengers. Many passengers and railway staff travelling in the Island Expressconsider themselves it fortunate to have survived the derailment of this magnitude. Some of the coaches stood still atop the railway bridge. “Many passengers in the coach woke up to a huge the noise. We felt the coach sliding away from the track. I thought the train was falling into a lake as the noise of rubbles scraping against on the coach sounded like splashing of water. Many started to yell and cry and the luggage fell on many passengers,” said Mr. Sait, a passenger who himself sustained bruises. As the slide came to a standstill halt, passengers panicked and hunted for the door and emergency window, leading to a stampede-like situation in some of the coaches. “For five minutes, we had no idea of what was happening. We made our way out through the emergency window. We helped women and children to get out of the train first,” said Pradeep, another passenger hailing from Thrissur, Kerala. He was asleep on the upper berth and fell down in the impact.\n\nMr. Sait added “Not to exaggerate, but we heard abnormal sounds and the coach was shaking ever since the train picked up momentum. I was discussing this with my friend at midnight as the sound was scary.”\n\nSome passengers had volunteered to get back into the derailed coaches to bring the luggage out but panicked as the coaches continued to slide. “The train was moving slowly as I got up to put on my sweater. There was a small sound, and then I realised that the train has derailed. It is a miraculous escape for all of us, as I thought this was the end,” said a railway staff travelling in S9 coach.", 
    "section": "national", 
    "title": "Miraculous escape: passengers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}