{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The newly constructed Corporation Fish Market in Junction area in the city is expected to start functioning shortly.\n\nThe spacious new fish market has come up in the busy Dharma nagar first cross, adjacent to the existing fish market, at an outlay of Rs. One crore. The major advantage of the new fish market is that it is situated just a stone’s throw away from the Suramangalam Uzhavar Santhai, which attracts hundreds of farmers and consumers every day.\n\nIn the absence of a fish market in the city, the Corporation converted the site allotted for a park in Dharma nagar into a temporary fish market few years ago. This temporary fish market soon became a major fish market of the district.\n\nHowever, the fishermen were demanding a permanent fish market, as the temporary one was lacking in infrastructure. The residents of Dharma nagar and the surrounding areas too made repeated representations for the construction of a permanent fish market, so that a park could be set up in site originally earmarked for the purpose.\n\nThe new fish market has all the needed facilities, much to the delight of the fish traders. The new market accounts for 18 pucca permanent shops, separate space for cutting, cleaning and packing the fish with water facility, cold storage facility, waste water treatment plant, hot water connection, separate toilets for men and women, proper drainage system and vehicle parking space. The work on the construction of the fish market was completed a few months ago, and the Chief Minister Jayalalithaa declared the market open through video conferencing on December 28 last year.\n\nThe fish traders are eagerly waiting for the market to be opened.\n\nWhen contacted, Corporation sources said that the work of allotting the shops to the traders through tenders is in progress. The market will be thrown open for public, once this procedure is completed.\n\nThe Corporation should open the market soon, so that the people of this area could get back the land allotted for park, says K. Ravukumar, a consumer activist.", 
    "section": "national", 
    "title": "New fish market in Salem to become operational soon", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}