{
    "author": [
        "Tamil Nadu Bureau"
    ], 
    "text": "Ramakrishna Gowda, the president of Chinnaranthotti Panchayat, in which Kudisaadhanppli village falls, said his family had not yet received communication from the district administration about the death of Ramamoorthy. “Nobody has called us yet, except the media,” he said.\n\nIn Theni, locals congregated before the house of S Kumar in the remote Kumanan Thozhu village on Varushanadu hill soon after they received the message of his death from the soldier’s friend. His family saw the news on television, but did not receive any official information till late night.\n\nMr. Kumar joined the service while he was doing his higher secondary course. He came to his village four months ago. Last week, he told his wife that he planned to come home this month. Actually, he reportedly completed his service two months ago but he extended his service for two more years, the family members added.\n\nThey also got information that the trapped soldiers spoke to the rescue team to expedite the rescue operation as they were suffocating. But later, their contact was snapped.\n\nHis father Srinivasan is a small farmer and mother Panjammal works in farm. His wife Kavitha is working in a private school at Mayiladumparai. His six-year-old only son Vyas is studying in first standard at his village.\n\nVillage in shock\n\nAs the news spread about the tragedy, the usually calm hamlet was in a state of shock. Sepoy G. Ganesan, son of Ganapathi of Chokkathevanpatti village, near Usilampatti in Madurai district was attached to the Madras Regiment. He was one among the 10 soldiers killed after an avalanche in the Siachen early on Wednesday. According to his friends, he had planned to visit sometime before March and a relative Ramalingam said that Ganesan had spoken last week conveying that he lived in a coldest spot in the country. “But we never thought he would have ended his life in such tragic circumstances,” he added.\n\nDistrict officials said on Friday that they were expecting official information in this regard. Meanwhile, the Usilampatti Tahsildar was in the process of collecting details about the legal heirs of the jawan.\n\nThe family of M. Elumalai (38), a resident of Mullai Nagar, Otteri, told officials that they received a call two days ago that he was trapped in an avalanche and rescue operations were on. They have not received any official intimation on his condition.\n\n(With inputs from P. V. Srividya in Krishnagiri, L. Srikrishna in Madurai, K. Raju in Theni and Serena M. Josephine in Vellore)", 
    "section": "national", 
    "title": "No official communication yet, say soldiers’ families", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}