{
    "author": [
        "K Manikandan"
    ], 
    "text": "Kiosk supplying reverse osmosis-treated water shut down\n\nThe facility has been shut down as the operator has not cleared dues —Photo: V. Ganesan\n\nSeveral thousand commuters using Chennai Park suburban railway station have been deprived of safe and protected water supply for the past three months.\n\nA kiosk dispending low-cost, reverse osmosis-treated water near the ticket counter has been shut down. Further, there is no supply of water from the taps on the platforms either, leaving commuters with no option but to purchase bottled water from the shops on the platforms. Enquiries revealed that the Zero B kiosk at Park suburban station had been shut down along with five other kiosks at Chennai Beach, Central and Egmore stations as the firm had to clear dues of Rs. 3.75 lakh.\n\nWhile the shutting down of these kiosks at Beach, Central and Egmore does not cause a problem to passengers as Southern Railway has enough water taps, which include provision of chilled water from coolers, it is at Park suburban station that commuters suffer.\n\nNot just commuters, even southern railway staff and policemen on duty, suffer due to the lack of drinking water. Around one lakh people board trains at the suburban station.\n\n“There are pavement shops selling water sachets, but the Railway administration should make drinking water available till the last train leaves the station,” said J. Harikrishnan, a commuter from Perungalathur.\n\nOfficials of Indian Railway Catering and Tourism Corporation said a contract for installing 190 RO units in city and suburban stations and the rest of Chennai Division was issued. The process of identifying 120 stations where they would be installed, is under way. More than one unit will be installed at major stations such as Chennai Central, Egmore and Tambaram among others.\n\nThese stations will get a unit with a capacity to treat 500 litres per hour, while smaller stations will get a unit to treat 50 litres per hour. In stations where long-distance trains halt, the units will be placed at the front and rear end of platforms for the benefit of people travelling in unreserved compartments. The water will be sold at Rs. 2 for 300 ml and Rs. 5 for a litre. Each machine costs around Rs. 3.5 lakh, officials added.", 
    "section": "national", 
    "title": "Not a drop of safe water at Park Town station", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}