{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A Plus Two girl student studying in Mangayarkarasi Higher Secondary School here has been admitted at Government Rajaji Hospital after she allegedly attempted suicide on Friday morning at her home.\n\nWhile the girl’s grandmother T. Janaki claimed that the girl attempted suicide due to harassment by the school teachers, the school authorities denied the allegations.\n\nFamily members said that the girl’s father passed away in June 2014 and her mother had separated.\n\nThe girl and her younger sister, also studying plus one in the same school, were under the care of Ms. Janaki.\n\nAccording to Ms. Janaki, the girl was sent back from school a week ago as she had symptoms of small pox. When she went back to school on Friday, her class teacher and headmaster allegedly scolded her for not being regular and raising allegations against the school to higher authorities.\n\n“I had petitioned the District Collector before against the school for demanding more than the prescribed fee,” Ms. Janaki said.\n\nShe said that her granddaughter was sent back from school on Friday. “She came back and consumed pills when I was away form home,” Janaki said. She added that the girl’s condition was critical and the doctors had suggested that she be kept under observation for two days.\n\nRefuting the allegations, P. Purushothaman, Headmaster of the school, said, “The girl had not come to school for many days.\n\nIt was we who asked her sister this morning to call her grandmother and ask her to come to school so that we can enquire about the girl,” he said.\n\nOn the allegations of charging additional fee, Mr. Purushothaman said that, considering the family situation of the girls, both were given complete relaxation from paying any fee. “Even their uniforms were provided from school,” he claimed.\n\nWhen contacted, Chief Educational Officer of Madurai district, J. Angelo Irudayasamy, said that he was yet to ascertain the facts about the incident and an inquiry will be conducted soon.", 
    "section": "national", 
    "title": "Plus Two girl attempts suicide; hospitalised", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}