{
    "author": [
        "S Prasad"
    ], 
    "text": "Chief Minister N. Rangasamy inaugurates the renovated Mahakavi Bharatiar Memorial Museum cum Research Centre on Friday. (From left) Chief Secretary Manoj Parida, Assembly Speaker V. Sabapathy,School Education MinisterT. Thiagarajan and N. Gokula Krishnan, MP, are in the picture; an illuminated viewof the Grade I heritage structure at EswaranKovil Street in Puducherry.— Photos: S.S. Kumar\n\nGovernment keen on preserving heritage buildings, says Chief Minister\n\nChief Minister N. Rangasamy on Friday said that the government was keen that all heritage buildings in Puducherry should be preserved and maintained without disturbing their original plan.\n\nInaugurating the renovated Mahakavi Bharatiyar Museum-cum-Research Centre at Eswaran Kovil Street here, he said that the government will spare no efforts to preserve the unique character of the heritage buildings.\n\nThe heritage structures are one of the major attractions for tourists visiting the city and it is our duty to retain what is left, he added.\n\nThe government on its part provides an incentive of Rs.1 lakh for those who want to renovate buildings without disturbing the heritage character. But a number of heritage buildings in the town have become dilapidated over time and are in a bad shape. The government will initiate steps to preserve and maintain these buildings.\n\nMr. Rangasamy said that Puducherry owes its fame to Bharati and some of his greatest works and songs were penned during his stay here.\n\nThe government has preserved and maintained all his works in the Museum cum Research centre. Steps will be initiated to beautify the Bharatiyar Manimandapam at Ariyankuppam.\n\nThe government has been implementing several schemes to poets who had brought fame to Puducherry. The government will also take steps to distribute Kalaimamani awards on the birth anniversary of Puducherry born poet Bharathidasan.\n\nThe Mahakavi Bharatiyar Museum-cum-Research Centre, a Grade I heritage structure has been given a facelift at a cost of Rs.1 crore. A Grade I heritage structure is a synthesis of French colonial and traditional Tamil style architecture. The façade is in vernacular architectural style with Thinnai and Thazhvaram.\n\nThe building has been renovated using traditional materials like Madras Terrace roofing with rafter and beams. The building located in the Tamil precinct has been identified as a special zone owing to its high concentration of listed heritage buildings.", 
    "section": "national", 
    "title": "Renovated Bharati house open to public", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}