{
    "author": [
        "T Madhavan"
    ], 
    "text": "Not many people have turned up for biometric enumeration of encroaching residents —Photo: G. Krishnaswamy\n\nBiometric enumeration of people, who have encroached upon spaces along the Adyar canal, has begun in Varadharajapuram village under Sriperumbudur taluk of Kancheepuram district.\n\nHowever, encroachers have been asked to move out of the locations identified by the revenue department, but there has not been a positive response to the call.\n\nIn the area, which was heavily affected by flooding during the northeast monsoon in November-December 2015, many encroachments along water channels connecting Mudihcur-Manimangalam lakes with Adyar river have been reported.\n\nFollowing initial eviction drives carried out by special disaster management team, the Revenue Department has been entrusted with the job of enumeration of encroachments along the canal connecting the lakes with Adyar river.\n\nThe canal runs across Ashtalakshmi Nagar, Bhuvaneswari Nagar, Mahalakshmi Nagar, Shantiniketan and Sriram Nagar extension in Varadharajapuram before reaching Adyar river in Tiruneermalai.\n\nAccording to sources in Revenue Department, 186 encroachments have been identified on the canal in Varadharajapuram village. The district administration has allocated alternative accommodation for those who would be displaced as a result of the drive.\n\nThey said that residents were informed about the special enumeration drive via public address system, but they were not willing to move out.\n\nOnly 20 people staying in encroached structures have turned up so far for the bio-metric enumeration, the officials said.\n\nThe revenue officials’ team at the village administrative officer’s office in Varadharajapuram received a few regular visitors, apart from a few curious politicians.\n\nA section of people, who gathered in front of the VAO’s office, said it was imperative for the government to ensure accommodation in the respective villages/ towns for those who have to move out, as many of them had been staying there for more than two decades.\n\nHowever, revenue officials maintained that as per the Supreme Court directives, they were providing alternative accommodation offered by Tamil Nadu Slum Clearance Board (TNSCB). Once the bio-metric enumeration of beneficiaries was over, they would be shifted to a place where TNSCB had already built apartments for them, they said.", 
    "section": "national", 
    "title": "Residents along Adyar unwilling to shift", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}