{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "River Vashishta has turned into a small channel in Salem, thanks to the encroachments and indiscriminate growth of seemai karuvelam trees.- Photo: E. Lakshmi Narayanan\n\nhe elease of water from Kariakoyil and Aanaimaduvu dams on January 8 brought much cheer to the farming community of the two major blocks of Pethanayakkanpalayam and Vazhappadi.\n\nThe farmers’ joy was well-founded, as both the dams had remained dry for the last few years due to recurring drought. The water release from the dams was to undertake farm activities on more than 11,000 acres in the canal irrigation system in both the blocks.\n\nAs per the PWD proposals, about 108 cusecs of water was initially released from Kariyakoyil dam situated in Pappanayakkanpatti village into River Vashishta for the initial 10 days and another 40 cusecs into the canal for about a month for farm activities in 5,716 acres in turn system.\n\nWater was released from the Aanaimaduvu dam in Puzhuthikuttai village for raising crops in 5,528 acres. About 90 cusecs was let out into River Vashishta for 11 days and another 60 cusecs into the canal for 18 more days.\n\nHowever, the joy of farmers of both the blocks was short-lived, as the water did not reach the tail-end areas. The major reasons attributed by the farming community was the encroachments on the riverbed and banks all along, and indiscriminate growth of seemai karuvelam trees.\n\nC. Vaiyapuri, president of the United Farmers Association – Tamil Nadu, says that River Vashishta had remained dry in the last four years. Water released into the river from the dams did not flow beyond Pethanayakkanpalayam town, leave alone reaching the tail-end areas situated more than 50 km away. The Periyeri, Aragalur and Thiyaganur, the three major tanks in the tail-end areas, continue to remain dry this year too, despite the release of water in the river.\n\nHe alleged that many influential people of villages situated on the river bank near Attur and Vazhappadi had encroached into the riverbed and were illegally tapping water using pump sets for their farms situated more than one km away.\n\nThis issue was brought to the notice of the authorities time and again. The action of effecting the seizure of motor pumps and registering cases against the violators did not deter them.\n\nMr. Vaiyapuri said that the Supreme Court and the High Court have issued strict orders for the removal of encroachments.\n\nHe pleaded for special surveys jointly by the revenue and PWD authorities and removal of the encroachments without any fear or favour.\n\nThe influential farmers who had raised crops with the help of illegal tapping of water should be forced to give an undertaking that they will never indulge in such illegal activities.\n\nThe release of water into River Vashishta after a gap of four years however was expected to improve groundwater level to a considerable extent in the villages.", 
    "section": "national", 
    "title": "River Vashishta awaits revival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}