{
    "author": [
        "D J Walter Scott"
    ], 
    "text": "Official says it has a good market in Europe and many countries\n\n‘Senna’ (Cassia angustifolia), a highly valued medicinal plant, could be an ideal alternative crop for paddy farmers in the arid district, said S. Tamil Vendhan, Deputy Director of Horticulture, here on Friday.\n\nAs the leafy tropical plant required less water and no application of fertilizers, farmers could take up its cultivation whenever there was uncertainty on the prospects of paddy crop.\n\nFarmers in drought-prone Kamudhi, Mudukulathur, Kadaladi and Paramakudi areas could cultivate ‘senna’ as a late crop in the event of losing their paddy crop due to water scarcity during drought.\n\nThe plant, used as a natural laxative to treat constipation, had a good market in Europe, Australia, New Zealand and other cold countries, Mr. Tamil Vendhan said.\n\nAs almost all parts of the plant — leaves, flowers, branches and roots — could be used as laxative, farmers could benefit to the maximum extent, he said. Marketing would never be a problem as representatives of companies and exporters would directly visit the field and procure the produce, he added.\n\nThe leaves and other parts were processed as powder and granules and capsules with ‘sennoside-B’ extracted from the leaves, he said. Farmers could harvest about 500 kg of leaves from one acre and sell them at Rs. 60 a kg with less input cost, he said.\n\nAs the plant was first introduced in Tirunelveli district from the European countries in the mid 18th century, it was popularly known as ‘Tinnevelley senna’ and widely cultivated in Tirunelveli, Thoothukudi and Virudhunagar districts. Farmers in Kamudhi and parts of Kadaladi and Sayalkudi areas had also started cultivating the medicinal plant, Mr. Tamil Vendhan said.\n\nInstead of burning their fingers by repeatedly cultivating traditional crops, farmers could try cultivation of ‘Periwinkle’ (nithyakalyani) and dragon fruit cactus, both having varied medicinal benefits, he said.", 
    "section": "national", 
    "title": "Senna, an apt alternative for arid areas", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}