{
    "author": [
        "S Ganesan"
    ], 
    "text": "Steps have been taken to check the electoral rolls for multiple entries and removal of deceased persons and specific objections with respect to entries in the electoral rolls would be acted upon, said Chief Electoral Officer Rajesh Lakhoni here on Friday.\n\nResponding to allegations, especially from the Dravida Munnetra Kazhagam that a large number of bogus voters have been included in the electoral rolls, Mr.Lakhoni said the electoral rolls were being checked in two or three stages.\n\n“We are verifying whether the names of deceased persons have been removed from the list. We are also checking for possible multiple entries within a part and those voters who have shifted. Objections with respect to entries can be made through Form 7. Specific complaints can also be submitted to district election officers and marked to the CEO and we will definitely act on them,” he said speaking to reporters after chairing a regional training for district election officer and senior police officers from nine districts here. Objections can be submitted at the special camps to be held on Saturday. They can also be filed online or even over telephone by dialling 1950, he said.\n\nEVMs to arrive in 2-3 days\n\nMr.Lakhoni disclosed that all the 75,000 electronic voting machines allotted to Tamil Nadu from other States would arrive within the next two or three days. Their functional readiness would be checked by engineers. Electors Photo Identity Cards (EPIC) to new voters would be distributed soon through Booth Level Officers.\n\nHe parried a question on the possibility of clamping prohibitory orders under Sec.144 of Code of Criminal Procedure during the Assembly election stating actions that are to be taken after the announcement of election will come later.\n\nAnswering a query, he said about three lakh polling personnel would be deployed for conducting the election and basic amenities such as water supply, toilets and covered shelters would be ensured at the polling stations for them.\n\nDuring Friday’s training, Mr.Lakhoni said the DEOs, Additional DEOs and police officers were briefed about the arrangements to be made for the polls, the requirement of polling personnel, distribution of postal ballots, amenities to be made for differently abled persons at polling stations and the information technology tools to be used for the election.\n\nElectoral rolls being checked in two or three stages,\n\nsays Chief\n\nElectoral Officer", 
    "section": "national", 
    "title": "Steps taken to check multiple entries: Lakhoni", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}