{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "In what seems to be one of the breathers for the natural stone industry, the Environmental Clearances for quarry owners could soon be realised by committees to be formed at the district, State and Central level.\n\nAt the inaugural function of the 12{+t}{+h}International Granites and Stone Fair 2016, ‘STONA 2016’, at BIEC on Tumakuru Road, Bengaluru, Balvinder Kumar, Secretary, Ministry of Mines announced that Environmental Clearances are mandatory and the Ministry has issued a notification to bring in district, State and Central level Environmental Committees to make the process simpler.\n\n“A granite and marble quarry of up to 5 hectares can avail an environmental clearance by the district committee, from 5 to 50 hectares from a State-level Committee, and above that from the Central committee,” he explained.\n\nThe Federation of Indian Granite and Stone Industry (FIGSI) has welcomed the development saying the district-level committees could help small quarry holders get environmental clearances.\n\n“India’s granite and marble resources stand at 4,600 million cubic metres. What is rescued for operations is hardly five per cent of the availability. We need to address the situation with care to raise our export market to Rs. 1 lakh crore in the next three years, from the present Rs. 15,000 crore,” said Mr. Balvinder Kumar.\n\nThe fair brings the choicest stones slabs, machinery tools and art decoratives from across the world. The event is on till February 6.\n\nThe towering 8 feet statue of former President (late) Dr. A.P.J. Abdul Kalam by Kani Granites of Coimbatore is a crowd puller. “I have sourced jet-black granite from Chamarajanagar near Mysuru to make his replica,” informs V.S.S. Pillai of Kani Granites.\n\nIt took 45 days of meticulous work for 10 people to complete this statue.", 
    "section": "national", 
    "title": "Stone comes alive in all forms", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}