{
    "author": [
        "Aditi R"
    ], 
    "text": "Better implementation of street children intervention programme can ensure rehabilitation of more youngsters\n\nIt was around 5 in the evening on a Sunday when *Mani was walking in a daze. The boy was not merely struck by hunger and fatigue that result from living on the streets, malnourished.\n\nHe was clutching protectively onto a bottle of ink whitener wrapped in a rag.\n\nThe ten-year-old barely missed being hit by oncoming cars and two-wheelers.\n\nBlank smile\n\nAsked why he was using the substance to get a high, Mani just had a blank smile on his face as he trotted away, still clutching onto his rag.\n\n“This is the state of many of our invisible street children,” said Virgil D’Sami, executive director of Arunodhaya Centre for Street and Working Children, who has been holding vocational training for street children in the Kodungaiyur night shelter for the past 10 years.\n\n“In the last one year alone, we have rehabilitated around 108 children, 30 of whom were addicted to narcotic substances. There are still many children who have to be rehabilitated and, shockingly, many start the habit from the age of six,” she said.\n\nChild Protection Scheme\n\nBetter implementation of the street children intervention programme, which forms a key component in the centrally sponsored Integrated Child Protection Scheme (ICPS), could have ensured rehabilitation of more youngsters.\n\n“Seven years ago, there was a high-level meeting on implementation of the Street Children Project in the city and on the vocational training that needs to be offered. But it soon became defunct,” said Andrew Sesuraj of Tamil Nadu Child Rights Observatory (TNCRO). Glue, petrol, whitener and paint thinners are the most commonly abused substances by street children.\n\nHunger\n\n“They use it as it satisfies hunger, they have absolutely no other help,” said A. Narayanan, researcher-activist and Director of CHANGEindia.\n\nMany of them, who make a living by picking rags or begging, end up as victims of physical, sexual and emotional exploitation thereby turning into lawbreakers and exploiters themselves.\n\n“Street children are of two types, the ones who live on the street and others who live off the street, as in slums. The ones who have absolutely no one to take care of are the most vulnerable, they are exposed to all kinds of anti-social elements and atrocities, but nothing is done about it,” R. Vidyasagar, former Child Protection Specialist, UNICEF, said.\n\nThere are around eight open shelters and one residential school, all run by the Greater Chennai Corporation, which accommodate homeless and street children.\n\nAnd there are two other shelters, run by the Corporation, for women and children.\n\nWhat is lacking is counselling for these children.\n\nNot enough NGOs\n\n“Not only that, there aren’t enough NGOs coming forward to assist in running of these shelters. Only a handful of them, around five or six, help run these shelters and provide vocational training,” said Mr. Narayanan.\n\nSeized of the seriousness of the issue, the Department of Social Defence has undertaken a survey to identify these vulnerable children. “We are working in teams, with civil societies and organisations. The work is under way and we will be releasing the report by the end of this year. We are doing all that we can to help these children,” said a senior official from the department.\n\nMany children end up as victims of physical, sexual and emotional exploitation", 
    "section": "national", 
    "title": "Street children victims of substance abuse", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}