{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "From balloon marches and walks to workshops for volunteers, the city went all out for an important cause: to raise awareness about cancer and its causes and to promote healthy living. The theme this year for World Cancer Day is ‘We Can. I Can’ to explore how everyone – collectives and individuals – can do their part to reduce the burden of cancer.\n\nAt Stella Maris College, the department of public relations conducted a cancer awareness campaign ‘Sthree’, in association with Global Hospitals. Students held events at women’s colleges, campaigned at the trade fair on Island grounds and the college also hosted a cancer screening camp. Posters were displayed and presentations made on the myths surrounding cancer and the facts about the disease, said Keerthana Devabalan, a final-year student of the college.\n\nThe Department of Medical Oncology at Rajiv Gandhi Government General Hospital also held an awareness event. Students of Loyola College performed a street demonstration and doctors from the department then interacted with members of the public explaining to them the importance of early detection, the availability of free treatment at all government hospitals and the necessity of completing treatment and regular follow-ups. Pamphlets were also distributed. “Queries were also answered and we stressed that habits such as smoking and drinking should be avoided, diets must be healthy and residents should come in for regular screening,” said K. Kalaichelvi, Head of the department.\n\nOne resident of Chennai donated his blood stem cells on Thursday. M. Haribabu, a resident of Old Washermanpet, who works with a BPO in Ambattur, underwent the procedure at Apollo Hospitals. His blood stem cells will be used to treat a patient from Kolkata, who has blood cancer, said Revathy Raj, paediatric haemato-oncologist at the hospital. DATRI, a blood stem cell registry, facilitated the donation.\n\n“DATRI came to my company a few months ago and spoke to us about the importance of blood stem cell donation. I, along with some of my colleagues, registered. A few weeks ago, I got a call from them saying I was a match, and asking if I was ready to donate. I was,” said the 28-year-old. After undergoing a number of tests and a series of injections to boost his stem cells production, Mr. Haribabu made the donation on Thursday. “It was completely painless – just like donating blood. It took two hours and 10 minutes. There was no disruption to my schedule at all,” he said. Mr. Haribabu is back at work for a night shift on Friday.\n\n“If it was someone in my family, I would donate without even thinking about it. So why not for someone else, who can live if I help out,” he asked.\n\nOther events scheduled in the city for Wednesday included a cancer awareness programme at Dr. MGR Janaki College, and an event by Unity of World Peace at Marina Beach.\n\nEvents, including seminars, were held in colleges, pamphlets were distributed", 
    "section": "national", 
    "title": "The battle against cancer: facets and faces", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}