{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram: Radha kalyana mahotsavam, Gita Govindam, ashtapathi bhajan, BHEL Township, 8 a.m.; divyanama bhajan bby Udayalur Sri K.Kalyanarama Bhagavathar, 8 p.m.\n\nSri Maruthi Vinayagar Temple: Sri Radha Madhava vivaha mahotsavam, Gita Govindam ashtapathi bhajan, CKVI Apartments, Thiruvanaikovil, 7.30 a.m.; discourse on Sri Maha Periyavar Mahimai by Sri Ganesa Sarma, 6.30 p.m.; divyanamam, dolothsavam, 8.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Kattazhagiasingar Sannidhi, Thiruvanaikovil, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, Srinivasa Perumal Temple, Indira Nagar, 6 p.m.\n\nCULTURE\n\nSri Ranga Vittala Bhajan Mandali: Sri Purandaradasar aradhana, music concert by Bengaluru Venugopal and party, Sri Vyasaraja Mutt, Srirangam, 6.30 p.m.\n\nRasavelar Shenbaga Tamil Arangu: Kadavur Manimaran speaks on “Tholkappiyam”, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology Department of Electronics and Communication Engineering: Inauguration of PROBE – annual technical symposium, Girish Kumar, professor, IIT, Bombay, and cell phone and tower radiation hazard research expert, speaks, 10 a.m.\n\nKalai Kaviri College of Fine Arts: College annual day, H. Devaraj, Vice- Chairman, University Grants Commission, presides, Rev. ntony Devotta, Bishop of Tiruchi, distributes Kalai Kaviri awards, 5.30 p.m.\n\nNational Association of Geographers, India and Bharathidasan University Department of Geography: International conference on “future earth perspectives in South Asia”, university campus, 10.30 a.m.\n\nShrimati Indira Gandhi College CSI Women Students Branch and Department of Computer Science: Poster competition on e-waste management, 2 p.m.; computer training programme for arts students, 9 a.m.;; Department of Chemistry: Valediction of Chem Fair – inter –collegiate exhibition, S.Kunjithapatham, college secretary, distributes prizes, 12.30 p.m.\n\nJamal Mohamed College: Graduation Day of self-financing courses for men, K.A. Khaleel Ahamed, college treasurer, delivers graduation day address, 3 p.m.; Department of Tamil: Meenakshi Vairavan endowment lecture by T.Karuppiah, 11 a.m.\n\nMontfort School, Kattur: Parents day, T. Raja, Judge, Madras High Court, presides, R.A. Krishnakumar, Executive Director, Dalmia Cement Ltd., chief guest, 5.30 p.m.\n\nChidambaram Pillai College for Women: NSS special camp, A. Lakshmi Prabha, NSS Coordinator (in-charge), Bharathidasan University, inaugurates, college campus, Manachanallur, 10 a.m.\n\nTamil Nadu Handicrafts Development Corporation: Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation: Northeast crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m.\n\nCREA Children’s Academy Matric Higher Secondary School: Annual day, 1.30 p.m.\n\nOrchard Schools: ‘Feel Asia’ - annual concert, P.Vijayaraghavan, former TTK Chair Professor, IIT, Madras, chief guest, K.K. Nagar, 5.30 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}