{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Environmentalist raises issue at fishermen grievance day meeting\n\nThough there were several issues raised by fishermen at the grievance day meeting convened here on Friday, issues concerning coastal regulation zone (CRZ) violations put forth by environmentalist M. Krishnamurthy hogged the attention.\n\nThe Tamil Nadu Pollution Control Board officials had ignored violations of CRZ norms as municipal waste and untreated sewage were being let into the sea through Buckle Canal in the Threspuram coast, he alleged. To aggravate the situation, marine water was exposed to industrial effluents, which were also let into the sea. But the district administration had not taken any action to prevent the violations, Mr. Krishnamurthy said.\n\nA TNPCB official said satellite mapping was done as per guidelines and it would be implemented after obtaining the nod from authorities. Joint Director of Fisheries R.Amal Xavier, who presided over the meeting, said that necessary action would be taken after discussing the issue with other officials.\n\nM. Mohammed Mydheen, president, Modern Chank Divers’ Association, said that fishermen were not allowing chank divers in some locations and sought action against them. Responding to him, the Joint Director said that even with a licence prior permission for diving in other locations at sea was mandatory from the Fisheries department. If any diver was denied permission, the issue should be brought to the notice of officials, he said.\n\nE. Thennavan, a fisherman from Punnaikayal, alleged that due to the lethargic attitude of officials around 80 whales that were stranded at Manapad coast died last month. Had the authorities taken the help of local fishermen, the whales could have been pushed into deep sea by boats and saved. Oil spillage from ships often caused marine pollution resulting in such deaths. Water should be let out from every ship into the sea after separating the oil from it. But the procedures were not followed he alleged and wanted the port authorities to monitor vessel condition. Assistant Director of Fisheries P. Isaac Jeyakumar denied those allegations saying that adequate efforts were taken by authorities and eight out of 81 stranded whales were saved.\n\nSanthya Pacheik, a fisherman, said groynes had to be constructed to protect boats from damages. During An official said that an estimate for construction of an 1000-metre-long groyne at a cost of Rs.25 crore had been prepared. S. Maharajan, president, Tharuvaikulam panchayat, demanded a shed at the fish landing centre and house site pattas.", 
    "section": "national", 
    "title": "Violations in Coastal Regulation Zone alleged", 
    "subsection": "tamilnadu", 
    "date": "2016-02-06"
}