{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The police on Friday night nabbed two persons, S. Singaravelan (27) and Madhi Ayigan (30) of Vellore district at Gudipala mandal in Chittoor district, bordering Katpadi in Tamil Nadu, for their alleged involvement in several murder cases, vehicle-lifting and cheating cases.\n\nThe two were also involved in red sanders smuggling, hijacking of vehicles and assault on highway riders.\n\nAddressing a press conference here, Chittoor SP Ghattamaneni Srinivas said Singaravelan of Tiruvallam, a taxi driver, and Madhi Ayigan of Sambaranallu, a hatchery worker, of Vellore have been involved in killings, kidnapping and hijacking of vehicles since 2011.\n\nThat year, Siva Kanchi police in Tamil Nadu booked the duo for the murder of a father and son. In 2014, they killed a taxi driver Suleman in Chennai over a dispute pertaining to transport of red sanders logs. The Tambaram police registered a case against them.\n\nHired killings\n\nIn the last four years, the two were involved in hired killings, physical assault on staff of petrol bunks before looting them; lifting of four-wheelers for smuggling of red sanders. Six months ago, they took Rs. 5 lakh for executing a murder. Intimidating the target, the duo collected another Rs 5 lakhs from him. Then they executed a fake murder and sent the photographs as proof to his rivals.\n\nOn January 21, the duo attacked an SUV and took away the vehicle after assaulting its driver near Gudipala. Early in March, they took away a parked vehicle at Kanipakam, 10 km from Chittoor.\n\nLast week, they gave the police at Yadamarri in the district slip before the police seized red sanders logs.\n\nBased on preliminary investigation, the Chittoor rural west police seized five SUVs at different places in Vellore and Chittoor outskirts.\n\nA toy pistol, used by the duo for intimidating and a specially designed footwear with nails attached to bottom, were also seized.\n\nThey were involved in hired killings, assault on and looting of staff of petrol bunks; lifting of four-wheelers", 
    "section": "national", 
    "title": "2 notorious criminals from Vellore arrested in Chittoor", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}