{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "A small-scale industry at Kurichi, which purchased land from Tamil Nadu Small Industries Development Corporation over three decades ago, now finds the value of that land to be zero. “We have been running from pillar to post for the last seven months but there is no relief,” says M.V. Loganathan, president of Coimbatore SIDCO Industrial Estate Manufacturers’ Welfare Association.\n\nAbout 20 units at SIDCO Industrial Estate at Kurichi have been hit as the land that was purchased from SIDCO is Bhoodan land.\n\nThe estate has over 300 units, spread over 70 acres. In the 1960s, a private industrial estate (Coimbatore Private Industrial Estate) was proposed at Kurichi. But, the project did not take off.\n\nThe SIDCO got part of this land and sold it to the micro, small and medium-scale enterprises since 1976.\n\nOf this, 27 acres which were sold to four larger industries and 15 small-scale units and also 20 shops are in trouble as these are Bhoodan (land gift) areas. According to a Government Order issued last April, the value of the land has been revised to zero, Mr. Loganathan says.\n\n“We came to know about the problem when some of the units went to the sub-registrar office at Madukkarai for mortgage of documents last year. The officials say the value of land is now zero and have refused to register it for mortgage. Even our association building is located on two plots – 26 cents and 30 cents - at the estate. It was built in 2004 with a bank loan. Then too, we went for mortgage of documents and later renewed it. There was no problem then,” Mr. Loganathan says.\n\nValue\n\nThe value of these plots (total 27 acres) is approximately Rs. 16 crore now, and the total investment by these units is nearly Rs. 50 crore.\n\nAccording to Mr. Loganathan, “We were not aware till now that it is Bhoodan land. Hence, SIDCO should find a solution to the issue. Banks are asking the units to submit any other document for collateral. We have asked time from the banks.”", 
    "section": "national", 
    "title": "20 Sidco units find their land value to be zero in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}