{
    "author": [], 
    "text": "Students from over 120 schools in Tiruvallur, Kancheepuram and Chennai participated in the event —Photo: K.V. Srinivasan\n\nThe Hindu Young World Painting Competition held in Chennai saw talent at its best.\n\nMore than 450 eager participants turned up to compete in The Hindu Young World Painting Competition that was held at SBOA School and Junior College here on Saturday.\n\nOut of the 2,000 entries that had been sent for the preliminary round, 255 juniors and 240 seniors turned up for the finals. Students from over 120 schools in Tiruvallur, Kancheepuram and Chennai participated in the event.\n\nThe topics were provided on the spot and the two hours allotted for the participants witnessed imagination at its best. The topics ranged from annual day at school and favourite fairy tale to ‘keep your city clean’, for the juniors and various phases of life, new-age India and terrorism, for the seniors. Jebaselvi U. and Santhanalakshmi, who judged the event, said the youngsters were judged on their choice of colours and the manner in which they put across their ideas in the given time.\n\nChief Guest, renowned artist Srinivasan Natarajan gave away the prizes . “In a world where math and science are stressed upon, not much of art can be seen. You are immensely talented. Use your abilities and pursue art as a career, as it is extremely rewarding,” he added.\n\nV. Vijay, a class IV student of Montfort Matriculation Higher Secondary School, won the first prize followed by Yashwant. V, a Std. VI student of The Schram Academy and Shreenidhi. R, a Std. VI student of PSBB K.K. Nagar. In the senior category, P. Andro Joswa, a class IX student of Dr. Vimala Convent Matriculation HSS bagged the first prize followed by K. M. Vinisha, a class VII student of SBOA School and Junior College and Akash B.J, a class IX student of G.K. Shetty Hindu Vidyalaya.\n\nConsolation prizes were also awarded to seven students in both categories.\n\nSponsors\n\nThe Presenting sponsor was Thyrocare and the Regional Partner was The Children’s Place. The Venue partner was SBOA School and Junior College and the snack partner was TTK Fryums.", 
    "section": "national", 
    "title": "A pageant of talent at painting competition", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}