{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Periyar Maniyammai University Chancellor K. Veeramani giving away degree certificate to gold medal winner Anuja Kannan, a student of Aero Space department, at the 23rd convocation in Thanjavur on Saturday. Vice-Chancellor N. Ramachandran is with them.\n\nSocial empowerment for women can be achieved only by making them more aware of the issues that surround them and by providing them access to a variety of information to suit their needs, said Supreme Court Judge V. Gopala Gowda here on Saturday.\n\nDelivering the convocation address at the 23rd convocation of the Periyar Maniammai University, Mr. Gopala Gowda pointed out that the deployment of information and communication technology, besides reducing distances, had provided a veritable ease in advertisement of business, procuring raw material, delivering finished goods, and even transacting money.\n\nWomen entrepreneurs must be trained to adopt various information and communication technologies to support and boost their business plans. ICTs were triggering entrepreneurial ventures, especially among the poor women altering their life’s path and increase their social status.\n\nNoting that the students who leave the university would carry the noble social ideals of Thanthai Periyar and his spouse Maniammai, Mr. Gowda said the students could play a role in eradicating unemployment, superstitions and dogmatic beliefs. Not just literacy, they must inculcate an active scientific temper among the people, he said.\n\nPointing out that the nation was not facing shortage of human resources, Mr. Gopala Gowda said the problem lay in quality of available manpower. “Virtually every industry from information technology, retail, finance, telecommunication, manufacturing, and biotechnology are struggling to find skilled workers and managers as they expand,” he said.\n\nKeeping that in mind young Indians must augment their skills and sharpen their acumen, he said.\n\nCounselling the students to avoid negative approach to issues in life, Mr. Gopala Gowda asked them to face the challenges that come their way with absolute resolve and positivity and take every challenge as a lesson. Pay back the debt you owe to society that has contributed to your betterment, he said.\n\nRuing that society had become self-centred, Mr. Gowda said that moral progress was often clouded by the shadows of personal gains but the students had the ability in them to change that by creating a future that had equality of opportunity in all spheres.\n\nThe young generation must make use of technological advancements to develop a scientific temper driven by the indomitable force to question and innovate without damaging the physical environment.\n\n“Environmentally and socially conscious innovators will be the future the world needs,” the Supreme Court Judge said.\n\nChancellor K. Veeramani, Pro-Chancellor V.K.N. Kannappan, and Vice-Chancellor N. Ramachandran were present.\n\nKumararani of Chettinad Meena Muthiah was conferred the Degree of Doctor of Letters (Honoris Causa) on the occasion.", 
    "section": "national", 
    "title": "‘Achieve social empowerment of women through technology’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}