{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Wife says it is the handiwork of youths who were earlier harassing their daughter\n\nIt was a miraculous escape for the family of Sadiq Pasha, a businessman, who woke up in the wee hours of Friday to find his house on fire.\n\nHe woke up his family members, who rushed out of the house.\n\nThis is the second such incident in two days. On Wednesday, three two-wheelers parked in front of his house at Balaji Layout in MICO Layout were set on fire. Mr. Pasha had filed a complaint in this regard.\n\nThe MICO Layout police said that some persons poured kerosene on the main door and set the house on fire.\n\nThe police accompanied the fire tenders to the spot. It is said that furniture and household articles were gutted.\n\nAccording to Mr. Pasha's neighbours, the fire was the handiwork of ‘a few unruly youths in the area’.\n\nThey said that the youths would sit in front of Mr. Pasha’s house, consume alcohol and create a ruckus. Mr. Pasha had complained about the same.\n\nOn Friday, anxious neighbours demanded strict action against the perpetrators.\n\nMessages\n\nYasmen Khanum, wife of Sadiq Pasha, said, “Our problems started a few months ago when my daughter, who is pursuing her II pre university, started getting prank calls and messages on her mobile. We also noticed a group of boys loitering around the house and passing comments about her.\n\n“She informed my husband, who not only chased the boys away but also complained to the police.\n\n“It appears that the boys are taking revenge. First, they set fire to three vehicles parked in front of our house on the night of March 21. Now, they have the audacity to set fire to the house. My daughter, who is appearing for her exams, is scared. They have ruined our lives. Where should we go? The police are doing little to help us out.”\n\nThe MICO Layout police are examining CCTV footage from in and around the area to identify the culprits. They have taken a few youths into custody for questioning.\n\nWife says it is the handiwork of youths who were earlier harassing their daughter", 
    "section": "national", 
    "title": "Businessman’s house set on fire", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}