{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Photographs of candidates contesting the ensuing Assembly election in the State will be on the Electronic Voting Machine alongside their names and party symbols. This follows an Election Commission order issued last year, said Chief Electoral Officer Rajesh Lakhoni on Saturday.\n\nDuring last year’s by-election held in five States, including R.K. Nagar constituency in Chennai, photographs of candidates were used on the EVM. This will be the first time in Tamil Nadu that photographs are to be used for the entire State during Assembly elections.\n\n“Candidates have been asked to submit passport-sized photographs. The balloting unit of the EVM will carry the picture of the candidate along with their name and party symbol,” Mr. Lakhoni said.\n\nSpeaking to reporters after an all-party meeting on Saturday, Mr. Lakhoni said that recent photographs must be submitted and caps or hats and dark glasses should be avoided. This is being done to avoid confusion among voters in constituencies where namesakes are contesting. The photograph will appear between the name of the candidate and his or her election symbol.\n\nEarlier, during the all-party meeting, representatives of nine recognised political parties, including AIADMK, DMK, BJP, Congress, CPI, CPI (M), DMDK, BSP and Desiya Vaadha Congress participated. They were explained how expenditure of candidates would be calculated, about the conduct of election rules, various online facilities and apps, election observers and do’s and don’ts on polling day.\n\nAdditional Chief Electoral Officer R. Kirlosh Kumar and Joint Chief Electoral Officer of the State Election Commission A. Sivagnanam were present. Party representatives met the press after the meeting.\n\nDMK’s T.K.S. Elangovan said that steps must be taken to ensure 100 per cent voting through postal ballots. He also alleged that last week flood relief was transferred to bank accounts of residents in Kancheepuram district, which was a model code of conduct violation.\n\nBJP’s K.T. Raghavan said that advertisements by political parties on the TV channels they own must be looked into. He alleged that during the Lok Sabha elections, there were many irregularities during the distribution of booth slips by parties.", 
    "section": "national", 
    "title": "Candidates’ photo to be printed on voting machines", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}