{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector launches signature campaign\n\nParamakudi police have registered a case against 10 office-bearers of the All India Anna Dravida Munnetra Kazhagam (AIADMK) on charges of violating the Model Code of Conduct (MCC) for the May 16 Assembly elections.\n\nActing on a complaint lodged by T. Balaguru, Village Administrative Officer (VAO), Venthoni Group, Paramakudi Town police registered a First Information Report (FIR) against the AIADMK office-bearers for installing flex boards for the marriage of the son of Nagarajan, the AIADMK branch secretary, one of the accused in the case, scheduled for Sunday.\n\nThe police booked them as their names were designed in AIADMK’s party colours in the flex boards. They were charged under Section 4 (A) 1 (a) and (b) of the Tamil Nadu Open Places Prevention of Disfigurement Act, 1959. No one was, however, arrested, the police said.\n\nMeanwhile, District Election Officer and Collector S. Natarajan said the Model Code of Conduct was being strictly implemented in the four Assembly segments in the district, and there had been only a few cases of MCC violations so far.\n\nThe flying squads had so far seized about Rs. 7.8 lakh at three places, he added.\n\nWhile addressing an all-party meeting, he advised representatives of all political parties to remove party flags in their cars and warned that the vehicles would be seized if they failed to remove the flags on their own.\n\nThey were asked to obtain prior permission from the election authorities to fly flags in the cars as expenses for running such cars would be included in the election expenses.\n\nOn Saturday, Mr. Natarajan launched a signature campaign as part of Systematic Voters’ Education and Electoral Participation (SVEEP) activity in Rameswaram island.\n\nDevotees, domestic tourists, autorickshaw drivers and guides signed and pledged to cast their votes.\n\nThe Collector also distributed forms to the students of Vivekananda Matriculation Higher Secondary School to obtain signatures from their parents, pledging to cast their votes.\n\nThe students formed ‘Vote 100 per cent’ model and cooking gas cylinders were formed to read “May 16” as part of the election awareness campaign.\n\nPledge administered\n\nIn Sivaganga, District Election Officer and Collector S. Malarvizhi administered the pledge to the students of KLN College of Engineering during the convocation ceremony.\n\nThe Collector stressed 100 per cent polling in the elections.\n\nThe flying squads have seized about\n\nRs. 7.8 lakh at three places,\n\nsays Collector", 
    "section": "national", 
    "title": "Case against 10 AIADMK men for MCC violation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}