{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Ramasami Thamizkanthan, Seetha Rama Bavanam, 7, Hariharan Hospital Rd., Nanganallur, 6-50 p.m.\n\nGita: R. Aravindan, Andhra Mahila Sabha, Luz, Mylapore, 7-30 a.m., Satyavratananda Saraswati, Samskrit Bharati, 7th St., Radhakrishnan Salai, Mylapore, 8-30 a.m.; Sargunananda, Divine Life Society, AJ Block, 7/100, Anna Nagar, 5 p.m.; Satyaprabhananda, Ramakrishna Mission Ashrama, M.S. Salai, T.Nagar, 5-30 p.m.; Omkarananda, Narada Gana Sabha, Alwarpet, 6-30 p.m.\n\nNarayaneeyam: Damodhara Dikshithar, Asthika Samajam, Venus Colony, Alwarpet, 6-30 p.m.\n\nThiruppugazh: Ma. Ki. Ramanan, Sri Balasubramaniar Thiruppugazh Bhaktha Jana Sabha, 39/25, Grama St., Thiruvottiyur, 10 a.m.\n\nRadhamadhava Thirukalyanam: Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 8-30 a.m.\n\nJesus Christ: T.G. Narayanaswamy, 273-B, 2nd Main Rd., Natesa Nagar, Virugambakkam, 7 p.m.\n\nCULTURE\n\nAanmajothi and Bharatiya Vidya Bhavan: Valedictory function of the D.K. Pattammal 97th Birth Anniversary commemoration and conferment of titles to musician, East Mada St., Mylapore, 6-30 p.m.\n\nVarthamanan Pathippagam: Launch of publication ‘Thirameiyin Thiravukol’, Rani Seethai Hall, Anna Salai, 10 a.m.\n\nCaricature India: Inauguration of 3rd Cartoonist Interactive workshop, Rajan Eye Care Hospital, Vidyodaya East 2nd St., T.Nagar, 9 a.m.\n\nGENERAL\n\nInternational Educational and Charitable Society: Presentation of ‘Dr. A.P.J. Abdul Kalam excellence award’, Governor K. Rosaiah participates, Hotel Savera, 6 p.m.\n\nMadras Development Studies and World Tamils Economic Foundation: Inauguration of 3rd World Tamils Economic Conference and launch of book Tamils – Tamil Nadu Socio-Economic Development, Hotel New Woodlands, 5 p.m.\n\nSCARF- Mental Health Café: An open forum on Mental Health, EC café, Rutland Gate, Nungambakkam, 5 p.m.\n\nVIT University: Discussion on Union Budget 2016-17, Music Academy, T.T.K. Rd., Royapettah, 10 a.m.\n\nR.M.D. Engineering College: Graduation day, Kavaraipettai, 10-30 a.m.\n\nAalim Muhammed Salegh College of Engineering: Alumni get-together 2016, Hotel Radha Regent, 10-30 a.m.\n\nM.N.M. Jain Engineering College: Graduation day, Thoraipakkam, 3 p.m.\n\nAdhi College of Engineering and Technology: Graduation day, Mudichur Rd., West Tambaram, Noon\n\nPrince Shri Venkateshwara Arts and Science College: Graduation day, 9-30 a.m. and College day, Gowrivakkam, 3 p.m.\n\nTamil Nadu Thiruvalluvar Thamizhkalai Ilakkiya Sangam: Meeting, Siri Sathya MHSS, Poonamallee, 10 a.m.\n\nBharathiyar Vision: Programme on ‘Bharathiyar Kaviarangam and Karutharangam’, Sivan Park, Yoga Mandapam, K.K. Nagar, 6 p.m.\n\nDr. Achanta Lakshmipathi Research Centre For Ayurveda: Medical camp, Peeliamman Koil, Pallipattu, Taramani, 9 a.m.\n\nSankara Eye Hospital: Eye camp, Sri Sathya Sai Seva Samithi Hall, Municipal Colony, Chengalpattu, and Krishna Nursing Home, Thachar Rd., Ponneri, 9 a.m.\n\nAll India Minorities Party: Easter celebrations, Dharma Palace, T.Nagar, 9 a.m.\n\nNarcotics Anonymous: Meetings, Good Company Group, St. Teresa Church, Nungambakkam, 11 a.m.; Miracle of Marina Group, Chennai School, Venkatarangam Pillai St., T.Nagar; and Circle of Life Group, Annai Velankannai Church, Besant Nagar, 7 p.m.\n\nAl-Anon: Meetings, Holy Angels Convent, T.Nagar, 11 a.m.; Rise and Redeemers Church, United India Colony, Kodambakkam, 4 p.m.; St. Francis Xavier Church, Broadway; and ‘Sri Sathya Sai HSS., Theradi, 6 p.m.; Kesari HSS. T.Nagar; and CSI Wesley Church, Poonamallee, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Assemption School, St. Teresa Church, Nungambakkam, 10-30 a.m.; St. Mathias Church, Kamarajar Salai,, K.K. Nagar; ECI Church, Dr. Ambedkar St., Arumbakkam; and C.S.I. School, Gandhi Main Rd., Oragadam, Ambattur, 11 a.m.; Dr. Boaz Memorial Hospital, Velachery Rd., Selaiyur; Infant Jesus church, Manali New Nagar, Manali; C.S.I. Peters Church, Vyasarpadi, 11-30 a.m.; St. Francis Xavier Church, Broadway, 6 p.m. Kesari HSS, T.Nagar; Police Boys Club, Chinmaya Nagar; Sri Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Singaram Pillai Boys HSS., Villivakkam; Arul Kadal, Santhome High Rd.; and St. Infant Teresa Church, K.K. R. Avenue, Sembium, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}