{
    "author": [], 
    "text": "When Christopher Nolan rebooted Batman with Batman Begins (2005), it marked an important moment in the superhero genre. It not only removed terrible memories of the campy Batman movies from the late 90s, it shattered the fantastical aloofness that we attach to superheroes. Nolan’s Batman Begins , that was followed by the brilliant The Dark Knight and the underwhelming but still pretty good The Dark Knight Rises , gave us a grey, humane character fighting post-modern battles.\n\nWe rooted for Nolan’s Batman, played by Christian Bale, because we connected to the conflicts of his human heart and not because we were enamoured by the shine of the bat-suit.\n\nOn the flipside, ‘dark superhero’ became the new formula for studios, especially in the DC universe, paving way for movies such as Watchmen , Man of Steel , both directed by Zack Snyder. In Snyder’s latest superhero juggernaut, we’ve got Batman taking on Superman. Two of the greatest heroes of the DC universe: the last beacons of hope in a rotten world nearing its end, pitted against each other. It doesn’t get darker than that, does it?\n\nThe problem with Batman v Superman: Dawn of Justice is not that it’s too dark. It’s not even one of the common complaints against DC Comics, of ‘taking itself too seriously’. It’s simply creatively bankrupt, gimmicky and quite boring.\n\nIt isn’t thematically as interesting as you would expect it to be – there could have been perhaps an ideological battle of the two: the morally ambiguous vigilantism versus the old-fashioned gallantry. Or the heroes’ fall from grace. Dawn of Justice dwells somewhere in the latter zone, but not quite.\n\nThis is a movie whose priorities aren’t as much to do with giving us solid, simple reasons to empathise with its characters, as creating an event-movie out of ‘The Greatest Gladiator Match in the History of the World’. It drudges on for about two hours—or what feels like two hours—till it unleashes its USP.\n\nDespite such a build-up, the reason for the battle comes off as almost laughable: the film talks about things like ‘democracy’ and ‘dialogue between citizens’, but these qualities seem to elude Batman and Superman. They seem to be in a Cold War with each other.\n\nAnd yet, it never really adds up—the rest of the world is burning and needs its superheroes, who seem preoccupied otherwise. Sharing the plot points would be giving out spoilers, but it is really easy to see how stupid the film’s central conceit is. And even the event itself isn’t worth the money and time. Snyder, who is known for his penchant for a distinct, if a tad overwrought, visual aesthetic, fails to create anything special in this department either. Barring a few scenes, such as Superman’s lone fight with a Kryptonite weapon with Doomsday, Dawn of Justice doesn’t look and feel much different from your average CGI-heavy, visually cluttered Hollywood disaster movie.\n\nMuch has been made of Ben Affleck playing Batman, after Bale’s winning act in Nolan’s series. Affleck’s Batman is geared-up for more movies in the series. But his performance in this one is uninspired—his perpetual smug face making it hard to connect to him emotionally. Where he adds heft, literally, is in the physicality. This is an older, greyer Bruce Wayne, and a more physically imposing Batman, his stocky build fitting into the heavily armoured bat-suit (CGI, apparently)—this one takes reference from the comic series, The Dark Knight Returns . I haven’t seen Man of Steel , but I liked Henry Cavill’s Superman far more. Superman is an alien, and may have powers that equal God, but his relationships make him as vulnerable as the man he saves on the street — the film tries to tap into this side of Superman, but doesn’t quite explore it. Jesse Eisenberg’s Lex Luthor seems interesting initially — the business magnate whose megalomania masquerades as young, restless science-geekiness. But unlike great superheroes such as The Joker, he fails to make a case for himself. One of the few scenes that work—shown in the trailers—involve Luthor, Bruce Wayne and Clark Kent bumping into each other at a press conference. The casualness of the moment comes as a relief, amidst all the manufactured sombreness. But lighter touches such as this are few and far between.\n\nMarvel’s Deadpool , which released almost a month ago, was lauded for its irreverence and self-aware humour. But Batman v Superman: Dawn of Justice is the worst thing that could have happened to the genre.\n\nAt least there was a sinister surrealism in Tim Burton’s Batman movies or a camp value to the ones starring George Clooney. This one is just annoyingly mediocre.sankhayan\n\nghosh\n\nBatman v Superman: Dawn of Justice\n\nGenre:Action\n\nDirector:Zack Snyder\n\nCast:Ben Affleck, Henry Cavill, Jesse Eisenberg, Amy Adams, Diane Lane, Gal Gadot\n\nStoryline:Superman and Batman have to set aside their differences, and along with Wonder Woman, stop Lex Luthor and Doomsday from destroying Metropolis.\n\nBottomline:Creatively bankrupt, gimmicky and boring", 
    "section": "national", 
    "title": "Clash of the titans", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}