{
    "author": [
        "Special Correspondent"
    ], 
    "text": "600 fingerlings from Thanjavur being reared in ponds near Top Sengattupatti\n\nA forest official in Pachamalai at a patch of land where a coffee plantation is being raised.— PHOTO: B. VELANKANNI RAJ\n\nAs part of livelihood support initiative for tribal men and women of Pachamalai, a series of innovative income-generating activities have been taken up under the Integrated Tribal Development Programme being implemented by the National Bank for Agricultural and Rural Development through Hand-in-Hand, a non-governmental organisation.\n\nCoffee plantation has been taken up on an area of 100 acres of land and the plants have been registering an appreciable growth in the last six months.\n\n“Being a shade-loving plantation crop, coffee plants should be raised on areas with adequate shade,” said Kannan, coordinator of the Hand-in-Hand.\n\nHe said that the coffee plants of ‘Selection’ variety had been brought from Kolli Hills and had been given to tribal farmers after an initial exposure visit to the plantations there.\n\nBased on the success of growth of coffee plants in Pachamalai, the Coffee Board had come forward to extend its support.\n\n“In fact, the Board had gathered the details of tribal farmers cultivating coffee in the villages on the hills,” he added. Maximum advantage of shady areas at Pachamalai had been taken.\n\nFish ponds\n\nFor the first time, two fish ponds had been set up to benefit the tribal farmers.\n\nA total of 600 fingerlings of katla, rohu, and mirgal varieties had been brought from Thanjavur and is reared at a couple of ponds set up at Puthur village near Top Sengattupatti.\n\nThe fishes which were let out in the pond two months ago, now weighed 200 grams. “The weight will increase up to one kg in four months or so, indicating an attractive revenue for the tribal farmers,” he said.\n\nDesi bird rearing has been another innovative vocation in which six women had been imparted special training.\n\n“With the desi birds being reared in the open at the backyard, as against the use of cages, the birds will fetch attractive returns,” Mr. Kannan said.\n\nThe women have been rearing ‘Asil 1’ and ‘Asil 2’ variety of birds which will fetch a monthly revenue ranging between Rs.1,000 and Rs.1,500.\n\nAll these vocations have been introduced to diversify the economic activities of tribal farmers who have been largely depending on the cultivation of tapioca and castor.", 
    "section": "national", 
    "title": "Coffee plantation being tried at Pachamalai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}