{
    "author": [
        "S Senthalir"
    ], 
    "text": "Rescue operations on to remove the toppled crane from a canal on the Villupuram Road. (Right) A 110-tonne crane from Kalpakkam lifts the 50-tonne vehicle out on Saturday.— Photos: T. Singaravelou\n\nThe 50-tonne vehicle was engaged in placing a 20-tonne precast block in a canal on Villupuram Road\n\nThe traffic flow on National Highways 45 (Villupuram Road) came to a halt on Saturday after a 50-tonne crane toppled while placing a precast concrete block in a canal.\n\nThe crane was moving a 20-tonne precast concrete block into a canal as part of a culvert project taken up by the Public Works Department (PWD). Unable to balance the weight of the block the crane toppled cutting the High Tension (HT) line at 2.30 a.m. on Saturday.\n\nThe driver jumped off the crane immediately. He was admitted to the Kathirkamam Hospital with a leg injury.\n\nResidents of nearly 10 streets surrounding the area on NH45 had to suffer without power for nearly half a day. Some of these areas include Mariyal Nagar, Deva Nagar, Chella Babu Nagar, Kaveri Nagar, Perumal Raja Nagar, Moogambigai Nagar and many surrounding areas.\n\nTraffic flow between Villupuram and Puducherry was diverted. People travelling from Villupuram had to pass through Valudhavur Road to reach Puducherry and those travelling from Puducherry to Villupuram had to take a diversion on Jayanagar.\n\nThe road between Indira Gandhi Statue to Moozhikulam Road was completely cut off for public.\n\nTough task\n\nD. Ravivarman, Additional Sub Inspector of Police, who was on night duty, said: “The crane toppled at 2.30 a.m. and we immediately stopped the traffic. A crane with a capacity to lift 110 tonne had to be brought from Kalpakkam to lift this one,” he said.\n\nThe crane from Kalpakkam arrived only at 4 p.m. on Saturday and took nearly two hours to lift the toppled vehicle. Tamizh, a crane driver, said that the crane from Kalpakkam left at 8 a.m. and it took nearly eight hours for it to arrive here.\n\nPeople thronged the area to watch the work, giving a hard time to the police. Residents from neighbouring areas came out to photograph and record the entire operation. They savoured tea on the street watching the crane movers in action. Police had to constantly drive out the onlookers from the scene in order to make way for the cranes to move around.\n\nWith no power supply in their houses, children and elderly were out on the streets watching all the action and egging on the workers. Even passers-by stopped by to take a glance at the work. When the operation was complete, crowds let out loud cheers and whistles to appreciate the effort.", 
    "section": "national", 
    "title": "Crane topples, snaps power line and mars traffic", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}