{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Diversifying tuber utilisation in the form of value addition and developing quality seed enterprises are two key avenues for protecting farmers from price fluctuation, said James George, Director of ICAR – Central Tuber Crops Institute (ICAR-CTCRI), Tiruvananthapuram.\n\nThe soaring tuber prices at the lower range in the last few years was adding to the woes of the farmers who invested a hefty amount in cultivating the crop and the above two methods would help in bailing them out, he said at the inaugural of “entrepreneurship orientation programme on promoting tuber crops seed enterprises for sustainable seed security” at the Krishi Vigyan Kendra, Sandhiyur, near here recently.\n\nMr. George indicated that the tapioca planting materials used by the farmers gradually lost their yield potential owing to genetic degradation and build up of diseases.\n\nWith the seed replacement with new varieties was inevitable, Mr. George called for creating new seed oriented enterprises for multiplying and distributing several high yielding and high starch varieties developed at ICAR-CTCRI. He advocated a unified action by farmers to organise themselves into groups for developing small-scale tuber crops seed enterprises and assured continuous supply of nuclear seeds from CTCRI to the needy producers.\n\nHe urged the State Government to create block level tuber crops techno-incubation centres to convert the excess tapioca tubers into value added products like chips, mixture, pasta, and noodles.\n\nS. Manickam, Head of Tapioca and Castor Research Station, Yethapur, pointed out that soil fertility issues and micronutrient deficiencies were adversely affecting tapioca yield.\n\nV. Ravi, Head, Crop Production Division of ICAR-CTCRI, urged tapioca farmers to get the soil health cards scheme to profitably utilise the soil resources without amounting to environmental degradation.\n\nAt the interaction session, Abdul Nabeel, a tuber crops seed entrepreneur from Kozhikode, clarified the doubts of the farmers on the mechanics of seed business.\n\nR. Muthuraj, Senior Scientist from ICAR-CTCRI, explained various high-yielding and high starch tapioca varieties released by CTCRI and demonstrated cost-saving seed multiplication methods to the farmers.", 
    "section": "national", 
    "title": "‘Diversifying tuber utilisation will protect farmers from price fluctuation’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}