{
    "author": [
        "Special Correspondent"
    ], 
    "text": "She asks Karunanidhi to withdraw legal notice sent to Vaiko\n\nDesiya Murpokku Dravida Kazhagam founder Vijayakant’s wife and party women’s wing leader Premalatha said that the party would provide a clean, transparent and accessible administration if voted to power.\n\nAddressing a public meeting here on Friday night, Ms. Premalatha termed the Dravida Munnetra Kazhagam and the All India Anna Dravida Munnetra Kazhagam ‘sources of all sorts of corruption’.\n\nMs. Premalata said the DMK, which had introduced corruption at all levels of administration in the government departments ever since it came to power under the leadership of M. Karunanidhi, had scaled new heights when the 2G spectrum scam unfolded.\n\nOn its part, the AIADMK further enriched the corrupt activities over the past five years as the public had to pay a hefty price for availing themselves of any service from the government departments.\n\n“With the ill-gotten money they have amassed, these parties will certainly try to purchase your votes by giving a few thousand rupees. If at all you have to take money for selling your votes, these two parties should give every voter at least Rs. 1 lakh, as every voter has suffered huge loss during the past 10 years as their governments had increased the price of milk, power tariff, bus fare and imposed a range of undue taxes,” she noted.\n\nMs. Premalata rubbished all announcements made by Chief Minister Jayalalithaa in the Assembly under Rule 110, saying that none of these announcements translated into action. “It’s nothing but cheating the voters, who backed her in the previous polls,” she added .\n\nWhile urging DMK president M. Karunanidhi to withdraw the legal notice he had served on Marumalarchi Dravida Munnetra Kazhagam general secretary Vaiko for his statement on a “secret deal” the DMK was trying to strike in its bid to bring the DMDK into its combine, Ms. Premalatha exuded confidence that Mr. Vaiko would face it legally. She explained in detail the salient features of DMDK’s manifesto and assured the voters that the party would execute every promise made by the party if it is voted to power.", 
    "section": "national", 
    "title": "“DMDK will give clean, transparent administration”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}