{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The encouragement provided to the writers will go a long way in the development of Tamil language and literature, said Justice V. Ramasubramanian, Judge of the Madras High Court.\n\nThe importance of Tamil language and literature was being highlighted in conferences and seminars. However, nothing was said on such occasions on the steps for the future development of the language. Encouraging writers would do a lot of good in promoting the language, Justice Ramasubramanian said at a function to distribute cash awards to outstanding Tamil works, and Literary Festival organised by the Salem Tamil Sangam here on Friday.\n\nResearch on languages had time and again proved that the languages whose writers were provided the right kind of encouragement and motivation had always flourished.\n\nThe authors and scholars should be honoured in their lifetime itself. Even top awards such as ‘Gnanapeet’ would be of no use for the next generation if the writers and scholars were not honoured at the right time.\n\nSeeni Duraisamy, president of Salem Tamil Sangam, presided over the function. Varadha Jayakumar, secretary, M. G. Rajan, treasurer, and K. Rajamohan, vice-president, spoke.\n\nJustice Ramasubramanian distributed K. Rajaram Literary awards to the following works: Poem category: ‘Navakavi 1000’ authored by Navakavi, ‘Paesum Theru’ by Krishna Prasad, ‘Oru Adukku Maadi Kudiyiruppin Yezhavadu Thalam’ by Valangaiman Nooruddin.\n\nNovel category: ‘Samrat Asokan’ by Sidharthan, ‘Annam, Kanagam and Naan’ by Vanaja David and ‘Neerkolam’ by Ulaganathan.\n\nBooks on research articles: ‘Kumari Mavatta Tamizh Vazhakku’ by Sujatha, ‘Bharathi Pathinaru’ by P. Marudanayagam and Tamizhar Valartha Tathuvangal’ by Devaperinbam.\n\nTranslation works: ‘Basan Nadakam’ by A. Revathi, ‘Kaanaga Palli Kadithangal’ by A. S. Ilangovan and ‘Kalaiyin Avasiyam’ by Military Ponnusamy.\n\nSpecial prize:\n\n‘Penniyam Agalamum Aazhamum’ by Prof. Prema and ‘Nadalumanrathin Kathai’ by Arunagiri.", 
    "section": "national", 
    "title": "‘Encourage writers to promote Tamil language and literature’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}