{
    "author": [], 
    "text": "SALEM\n\nSri Dasarathi Kaingarya Kaingarya Trust and Kinjitkaram Trust : ISKCON bhajan, 5 p.m.; Upanyasam by Velukkudi U. V. Krishnan Swami, Sumangali marriage hall, opposite Gandhi Stadium, 6 p.m.\n\nRamakrishna Mission Ashrama: Spiritual retreat, Sri Ramakrishna’s spiritual sadhana discourse by Swami Tyagarajananda, 9 a.m.; Arjuna Vishada Yoga discourse by N. Uma Maheswari, 5 p.m.\n\nSri Skandashraman Trust: Srimad Sadguru Sanathananda Swamigal’s jayanthi festival, Ganapathi homam, navagraha homam, aavahanthi homam, 5 a.m.; poornahudi, 9 a.m.\n\nThe Hindu, the Indian Public School and The Hindu-Tamil Pen Indru: Heels on Wheels — an all-women four-wheel treasure hunt, Thiagarajar Polytechnic College, 7 a.m.; valediction, Reliance mega hall, 6 p.m.\n\nIndian Medical Association and College of General Practitioners-Salem sub-faculty : Continuing medical education programme, Hari Janakiraman, Salem Gopi Hospitals Limited, speaks on ‘brain death and organ donation current scenario’, M. Muthukumaran, presides, Dr. Sundaravaracachariar memorial hall, 6 p.m.\n\nSalem Consumer Voice: World Consumer Day, T. S. Krishnamoorthy, former Chief Election Commissioner, chief guest, T. Anuradha, Designated Officer, Tamil Nadu Food Safety and Drug Administration Department, and others speak, J. M. Boopathi, presides, Shanmuga Hospital auditorium, Hasthampatti, 9.50 a.m.\n\nIMA-Salem branch: Mahadevan of Salem Gopi Hospitals speaks on ‘death vigil’, 7.30 p.m.\n\nIMA Salem Ladies Club: International Women’s Day celebrations, Vanavan Madevi and Iyal Isai Vallabi of Adav Trust, speak, Senthamarai Muthukumaran, presides, open park, 7 p.m.\n\nSona College of Technology: Graduation Day, A. Ravindra, former Chief Secretary, Government of Karnataka, chief guest, C. Valliappa, chairman, presides, 10.30 a.m.\n\nKnowledge institute of Technology and Knowledge Business School: Graduation Day, S. Ganesan, Registrar, Anna University, Chennai, chief guest, Tram Venkatraman, president, Scope e-Knowledge Centre, Chennia, delivers special address, R. Kumarasamy, president, presides,\n\n2 p.m.\n\nSona College of Technology: Graduation Day, C. Valliappan, Chairman, presides, 10.30 a.m.\n\nPaalam: Readers Circle meeting, P. Sahasranamam reviews the book Manitha Udalin Kathai authored by Daniel E. Liberman, Advaitha Asrama road, 11 a.m.\n\nNAMAKKAL\n\nPaavai Educational Institutions: Graduation Day, S. K. Patnaik, Director, AICTE, New Delhi, chief guest, N. V. Natarajan, chairman, presides, Anandha Arangam, Paavai East campus, 10 a.m.\n\nTIRUCHENGODE\n\nVivekanandha Institute of Engineering and Technology for Women : NSS special camp, Panchayat Union School, Kosavampalayam, 10.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}