{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In an attempt to spread awareness about environmental degradation of Ennore creek, the Public Forum for Water, a voluntary organisation, is documenting the threat to the estuary through a film.\n\nThe 45-minute film will depict the various issues plaguing the Ennore creek, a sensitive eco-system where Buckingham canal and Kosasthalaiyar river join the sea.\n\nIn Ennore, one can find three kinds of water — sea water, brackish water and freshwater. Residents of several fishing hamlets depend on Ennore creek for their livelihood. However, of late, the estuary is facing a serious threat owing to industrialisation.\n\nMembers of the Forum noted that the coal ash and industrial effluent from the plants in the neighbourhood, including Ennore thermal power station and NTPC Tamil Nadu Energy company, are dumped into Buckingham canal.\n\nMoreover, sand dredged for port expansion is also dumped into the creek.\n\nArun Nedunchezian of the Public Forum for Water recalled that the Forum comprising 25 like-minded organisations was established to create awareness that water was a people’s right and cannot be sold as a commodity.Rich flora and fauna\n\n“We are now also focussing on the need to safeguard primary sources of water like lakes and raise awareness against encroachments and misuse. Ennore creek with its rich flora and fauna and mangroves is slowly getting destroyed in the name of development,” he said.\n\nThe film, directed by Dayalan Shanmugam, will focus on the need to protect the creek and the threat to livelihood of fishermen.\n\nAlong with Natarajan of Chembarambakkam reservoir protection committee, the Forum is also in the process of documenting facts about waterbodies and water courses that drain into Chembarambakkam reservoir.\n\nIllegal sand mining in Nemam lake, located upstream of Chembarambakkam, is alleged to be one of the reasons for the breaching of the bund and greater inflow into the reservoir.\n\nMr. Nedunchezian said: “We are documenting various environmental issues in different forms and will release them next month. We plan to screen the documentaries about the impact of illegal sand mining over waterbodies and how it will affect people by May.”\n\nResidents of several fishing hamlets depend on Ennore creek for their livelihood", 
    "section": "national", 
    "title": "Film to highlight issues plaguing creek", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}