{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "The title Thozha , I must admit, gave me a slight case of the shivers. Given the cast—the fifty-something Nagarjuna as quadriplegic billionaire Vikram; the thirty-something Karthi as his 180-degree opposite, a very local all-in-all-azhagu-raja named Seenu, who becomes Vikram’s caretaker —I expected May-December variations on the perennial Kollywood theme of natpu .\n\nBut Vamsi Paidipally’s film is cut from a different cloth. It opens with a sad-looking Vikram and a pensive Seenu in a car.\n\nThey seem to be in the midst of a lover’s tiff—or whatever the bromantic equivalent is. But soon, the tone changes. We get a chase.\n\nWe get hammy comedy. The film’s strength is that it never gets too heavy. (And there are heavy themes. Face your fears. Search for happiness at the place you lost it. Motivational poster companies will be taking furious notes). Every time we think something serious lies ahead, there’s a nifty U-turn. Thozha works... despite itself.\n\nI say this because as cinema, there’s nothing here. The staging is broad, as are the performances. The storytelling has no finesse. What we’re seeing on screen are basically pages of the script. With pigeon metaphors. (Before Vikram meets the free-spirited Seenu, we see a bird struggling to take off. Later, it soars.)\n\nThe melodrama is laughable. There’s actually a scene where Seenu goes to a rich man’s bungalow (Seenu’s sister is in love with the man’s son), and the man, looking down from his room, instructs his servant, “ Avana lawn-leye nikka sollu .” I kept waiting for the follow-up, where the man talks to Seenu while tossing biscuits at his Alsatian. What we get is close enough—cut-aways to a barking dog. There’s some alarmingly crude comedy, especially in a bit involving a gay character.\n\nAnd the super-aggressive score is essentially Gopi Sunder holding a gun to your temple and screaming: “Laugh.” “Cry.” “Feel warm-fuzzy.”\n\nBut here’s the thing. We laugh. We cry. We feel warm-fuzzy. Thozha is a remake of the French dramedy The Intouchables , and while the class issues aren’t as incisively (or delicately) dealt with, the bonding between the men comes through beautifully. That much-abused term “onscreen chemistry” – that’s what the thing between Karthi and Nagarjuna is. Raja Murugan writes some lovely lines for Seenu (during a drunken night, during his interview with Vikram)—we wished there’d been more.\n\nBut he also knows when to write less. When Seenu, after a jail term, returns to a family that seems to despise him, his mother (Jayasudha) simply says, “ Edhukku vandhe ?”\n\nThese emotional beats are, strictly speaking, excess baggage—the film runs for nearly three hours, and there’s enough emotion in the Seenu-Vikram stretches—but if you have to have amma -sentiment, thamb i-sentiment, thangachi -sentiment, then this is probably the way to do it, with minimal fuss.\n\nBut despite these nods to Kollywood tradition, Thozha is different. It’s heavy-handed, yet light. It’s... pleasant. It’s like Bangalore Days . There are no external villains to punch into orbit—the conflicts are all internal. And everyone’s fundamentally nice.\n\nWhen Vikram ends up hospitalised due to a lapse on Seenu’s part, I thought there’d be a showdown, with Vikram’s friend (Prakash Raj) blaming Seenu—but the scene that follows is a surprise, building on an amusing running gag about abstract art. Even the women around Vikram (they’re played by Anushka and an astonishingly pretty Shriya Saran) have mini-arcs that are utterly unexpected.\n\n“Closure” isn’t something we see in Kollywood films every day. Neither is the dignified first date. Throughout Thozha , we get the sense of a certain sensibility being respected, even as certain concessions to local audiences are being made.\n\nThozha may be Karthi’s most important film since Paruthiveeran . That was an incandescent debut, but he seemed to have given so much of himself to that film that it appeared there was nothing left, nothing new.\n\nHe seemed to be coasting along on a set of Karthi-isms (even in interesting and varied films like Madras and Aayirathil Oruvan ).\n\nAs an actor, Thozha is no breakthrough—performance-wise, we still get the same -isms. (It will be interesting to see what Mani Ratnam does with the actor in the film they’re reportedly making together.) But as a star, this is a welcome move.\n\nAt a time when every leading man (including Karthi) seems to be participating in a game-show titled Who Wants To Be The Next Rajinikanth ?, here’s a simple “buddy movie” (in the Hollywoodian sense), with no punch dialogues, no action sequences, with just one duet (with Tamannaah, who plays Vikram’s secretary; her romance with Seenu is strangely unresolved). We see, all the time, character actors striving to become larger-than-life heroes. For a change, here’s a hero scaling himself down to play a life-sized character.\n\nbaradwaj rangan\n\nThozha\n\nGenre:Drama\n\nDirector:Vamsi Paidipally\n\nCast:Nagarjuna, Karthi, Tamannaah, Prakash Raj\n\nStoryline:A bromance between a fifty-something billionaire and his thirty-something caretaker\n\nBottomline:Not great cinema, but an entertaining film", 
    "section": "national", 
    "title": "Friends forever", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}