{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has criticised an advocate practising in the Bench for attempting to get his personal grievances redressed by filing a public interest litigation (PIL) petition, seeking a series of directions to 24 government officials, including the Chief Secretary, Revenue Secretary, Collectors of three districts and three Superintendents of Police.\n\nDismissing the case, Justices S. Manikumar and C.T. Selvam said: “Averments made in the supporting affidavit purely vindicate personal and private interest over the properties of trusts under which the petitioner (R. Prakash) claims to have derived benefit. There is no public interest involved… The writ petition is liable to be dismissed with exemplary costs. However, we refrain from doing so.”\n\nThe judges pointed out that the petitioner, who argued the case on his own as a party-in-person, had claimed to be one of the beneficiaries of several trusts founded by his forefathers K.R. Raghunatha Rao and K.R. Ramachandra Rao who had bequeathed a large extent of their immovable properties now situated within the revenue jurisdiction of Thanjavur, Tiruvarur and Nagapattinam districts.\n\nAlleging that those properties had been alienated illegally, he sought a direction to revenue and registration department officials to refrain from allowing mutation of records in third party’s name in respect of those properties. He also sought a consequential direction to municipal authorities and Tangedco to desist from granting building plan approvals and electricity connection respectively.\n\nThe other prayers of the petitioner included a direction to the police officials to prosecute those who had alienated the properties, a direction to the State government to form a special team to protect the heritage buildings, pay compensation for financial loss caused to the properties of the trusts and introduce a computerised foolproof system to keep a check over illegal mutation of revenue records.", 
    "section": "national", 
    "title": "HC criticises advocate", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}