{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Sankatahara Chathurthi puja, Railway Colony, 6.30 p.m.\n\nSaiva Siddantha Sabai: 59{+t}{+h}anniversary celebrations, seminar on ‘Women empowerment’, Prof. Gnanapoongothai, South Adi Street, Meenakshi Temple, 9 a.m.\n\nPanniru Tirumurai Mandram: Pannisai, Adi Streets, Meenakshi Sundareswarar Temple, 7 a.m.’\n\nRamakrishna Mutt: Discourse on ‘Swami Vivekanandarin Vaalvum Vaakum’ by Swami Guruvarananda, 5.45 p.m.; aarathi, Reserve Line New Natham Road, 6.30 p.m.\n\nSivananda Tapovanam: 502{+n}{+d}Sivananda free medical camp, J. Suresh presides, T.S. Bhaskaran of National Trust, Chennai, inaugurates, Dr. S. Vadivelmurugan conducts, Thoppur, 11 a.m.\n\nArsha Parampara: Discourse on ‘Lalitha Sahasranamam’ and spiritual heritage class by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Sundareswarar Temple, 10 a.m.; on ‘Mundakopanishad’, Sudhara, Andalpuram, 6.30 p.m.\n\nSri Madanagopala Swami Temple: Discourse on ‘Sri Mahabharatam’ by V.Govindaraja Battachariyar, West Masi Street, 7 p.m.\n\nSri Aurobindo Study Forum: Discourse on ‘Sri Aurobindo’s Life Divine,’ by Subramany, Nithyatha, Auro Lab, Veerapanchan, 10 a.m.\n\nSwami Tatwananda Ashram: Samananda conducts ‘Mandukya Upanishad’ class, Swami Tatwananda Ashram, P and T Nagar, 6.45 p.m.\n\nChurch of Christ: Sunday service, Deva Manickam delivers message, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nOur Lady of Lourdes Church: Sunday prayer, K. Pudur, 8 a.m.\n\nCULTURE\n\nGita Bhavanam: 117{+t}{+h}jayanthi celebrations, Geetha Bhavanam Lane, Kamarajar Salai, 6 p.m.\n\nPuratchi Kavingnar Mandram: Discourse on ‘Unave Marunthu’ by R. Illankumaran and Dr. Jagannathan, Maniammai Elementary School campus, North Masi Street, 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nUniversal Peace Sanctuary: Sundaramoorthi Sachidananda conducts free meditation class, 138 Kamarajar Salai, 7 p.m.\n\nArulgnana Sabai: 193{+r}{+d}meeting, Dr. S. Neelakandan speaks on ‘Vadaloor Vazhi’, Thiagarajar College of Engineering, 6.30 p.m.\n\nGENERAL\n\nMadurai District Jankalyan Trust: Mupperum vizha, Ananda T. Amirtham, president, Jankalyan, S. Sankaralingam, former Chief Commissioner Income Tax, S. Mohan Gandhi, vice-president, Jankalyan, Dr. C. E. Suriyamoorthi of MKU address, Vasudara Complex, Andalpuram, 10 a.m.\n\nVidiyal: Mentors’ meet, Rathinapuram, 11 a.m.\n\nHemophilia Society (Madurai Chapter): Counselling session, UC Higher Secondary School campus, Periyar bus stand, 11 a.m.\n\nJunior Chamber, Madurai Central: Effective public speaking by JCI National Trainer M. Chandrachoodeshwaran, A. Goutham inaugurates, 9.30 a.m.; valedictory function, G. Muhil addresses, Hotel Arasan Sapthagiri, 4.30 p.m.\n\nMadurai Sivakasi Nadars Pioneer Meenakshi Women’s College: NSS camp, Poovanthi, 9.30 a.m.\n\nMSS Wakf Board College: NSS camp, Odaipatti, 9.30 a.m.\n\nYadava College: NSS camp, Alagarkoil, 7 a.m.\n\nSubitcham: Monthly meeting of parents/guardians on maintenance of mentally ill children at home, Ramiah Street, Shenoy Nagar, 10.30 a.m.\n\nInnovative Trade Fairs: Constructive 2016 national exhibition of building and construction materials, Tamukkum Grounds, 10 a.m.\n\nAlcoholics Anonymous: Meeting, UC Higher Secondary School, 11 a.m.; RC School, Sivaganga Road, Melur, 6.30 p.m.; Justice V.R. Krishna Iyer Community Hall, Lake View Road, K.K. Nagar and Railway Institute, 7 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}