{
    "author": [
        "S Ganesan"
    ], 
    "text": "A customer (left) gets a shopping bag that has a message for voters on one side in Tiruchi on Saturday.— PHOTO: M. SRINATH\n\nAfter LPG refills, conductor bags and tax receipts, shopping bags of popular outlets would seek to reinforce the Election Commission’s #TN100 per cent campaign that seeks to maximise voter turnout in the May 16 Assembly election.\n\nElection authorities have now roped in two popular retail outlets in the city to support the initiative. Shopping bags of retail majors, Mangal & Mangal, and Sarathas will carry the Election Commission’s messages asking voters to exercise their franchise without fail.\n\nThe two outlets have agreed to carry the messages on one side of their shopping bags issued to customers. The bags will prominently carry a logo indicating, ‘May 16,’ a reminder on the polling day, along with a pointer urging people to get ready to vote on the day.\n\n“Commencing today, we will distribute about two lakh shopping bags with the message till the election. When we were approached by the district authorities, we readily agreed to the request as we felt it is also our responsibility (to raise awareness),” said P. Mookapillai, Managing Director, Mangal & Mangal.\n\nAt present, the polling percentage is only around 65 to 70.\n\n“It is our democratic duty to maximise the polling percentage,” he said.\n\nEchoing his sentiments, Roshan, Managing Director, Sarathas, said: “It is a social duty and responsibility of every citizen who desire to be part of this democracy. When we perform our primary duty of voting, we can fight for our rights,” he said.\n\nDistrict Collector K.S. Palanisamy formally inaugurated the distribution of bags at the Collector’s Office in the city on Saturday.\n\nIn a release later, Mr. Palanisamy said four lakh bags with the messages would be issued by the two outlets.\n\nTwo leading outlets in Tiruchi will distribute bags with a message on the need to vote", 
    "section": "national", 
    "title": "Message in a bag for voters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}