{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Integrated teams’ care will work in patients’ favour: V. Shanta\n\nV. Shanta, chairperson, Adyar Cancer Institute, Chennai, speaking at the inauguration of the integrated cancer care centre at Vadamalayan Hospitals in the city on Saturday.— Photo: S. James\n\nOncologic care was a coordinated effort of a team and not just physician-centric, said V. Shanta, chairperson, Adyar Cancer Institute, Chennai, here on Saturday.\n\nSpeaking at the inaugural function of the integrated cancer care centre at Vadamalayan Hospitals, she said that multi-disciplinary care had, indeed, been responsible for bringing down many advanced cancers within the scope of curability.\n\nThe dawn of chemotherapy era, advances in radiation technology, transition from conventional to precision radio therapy and the advent of molecular diagnostics had laid the foundation for multi-disciplinary approach in oncologic care.\n\nPhenomenal advances in diagnostic and therapeutic capability had facilitated change from an era of fatality and incurability to an era of curability. Today, not only survival was achievable, but the quality of life too could be improved among survivors, she said. She said that a good team effort had made organ conservation possible in breast cancer, limb salvage in osteosarcomas, sphincter preservation in rectal cancers and many more. In fact, paediatric cancer had become a success story today, Dr. Shanta said and stressed that integrated teams’ care would work in patients’ favour.\n\nShowering encomiums on the founder of Vadamalayan Hospitals, the late Dr Vadamalayan, she lauded Pugalagiri, Managing Director of the Hospitals, for establishing an integrated cancer care centre in memory of his father.\n\nVelammal group of institutions chairman M.V. Muthuramalingam said that a tier-II city like Madurai should have more such hospitals with state-of-the-art equipment. This would enable patients to avoid long distance travel to big cities like Chennai, where the queue was long.\n\nFurther, delivering quality service and competitive pricing would draw more patients to come to small cities, which would, in turn, help other industry like tourism thrive.\n\nCoimbatore K.G. Hospital Chairman K.G. Bakthavathchalam said that cancer population was on the rise.\n\nThe only solution was to get early diagnosis. Tamil Nadu Dr. MGR Medical University former Vice-Chancellor Mayilvahanan Natarajan lauded Vadamalayan Hospitals management for rendering quality service at a moderate cost.\n\nDr. Senthil, president Tamil Nadu Government Doctors’ Association, offered felicitation.\n\nVadamalayan Hospitals chief cardiologist M. Srinivasan welcomed, while Dr. V. Pugalagiri proposed a vote of thanks.", 
    "section": "national", 
    "title": "“Multi-disciplinary care helps in advanced cancer treatment”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}