{
    "author": [
        "S Ganesan"
    ], 
    "text": "The objective behind building new link roadat Anna Nagar defeated\n\nWith the civic authorities reluctant to relocate M.G.R. statue in Cantonment in Tiruchi, trafic management is becoming problematic.PHOTO: A. MURALITHARAN\n\nThe new traffic roundabout created at the MGR Statue junction consequent to the opening of the Anna Nagar link road does not appear to have helped smooth flow of traffic around the vital junction in the city. The temporary roundabout created by the corporation is yet to be completed, much to the consternation of motorists.\n\nThe roundabout was created after a public outcry over the Anna Nagar Link Road remaining without access to the Lawsons Road. The junction improvement work near the MGR statue, planned as part of the Anna Nagar Link Road project, entailed the shifting of the statue.\n\nThis was an important component of the project as vehicles coming from Anna Nagar could not take a right turn to enter Lawsons Road.\n\nBut as the shifting of the MGR statue was considered a sensitive issue, the corporation authorities in consultation with highways and other agencies decided to go for an alternative, creating a new roundabout adjacent to the existing small traffic island housing the statue.\n\nThe junction has been witnessing heavy congestion and also turned an accident prone zone.\n\nA separate lane, leading towards the Lawsons Road, has been blocked by the police, apparently to avert congestion at the MGR Statue Junction.\n\nCorporation sources this was unavoidable and vehicles coming from Anna Nagar Link road have to take a left towards the court complex and then take a U-turn. But many motorists could be seen going around the barricades heading in the wrong direction towards the junction.\n\nMotorists heading towards Anna Nagar Link Road from Lawsons Road find it difficult to cut across vehicles heading straight from the Puthur Road towards the District Court.\n\nCorporation officials say the existing arrangement would continue and the temporary round about would be made permanent.\n\nWork on establishing the pucca roundabout would be taken up soon, a senior official said.\n\nHowever, civic activists say the traffic flow has to be streamlined at the junction with the establishment of a proper roundabout by shifting the MGR statue.\n\n“The statue could be slightly shifted to a right location and the roundabout could be beautified,” says M. Sekaran, president, Federation of Consumer and Service Organisations, and member of the District Road Safety Council.\n\nAlthough the officials claims the new roundabout was intended to bring about self-regulated flow of vehicles, it has not served the purpose as expected due to the heavy traffic flow from all four directions, he points out and suggests that an automatic traffic signal be installed to overcome the problem.", 
    "section": "national", 
    "title": "New roundabout fails to end congestion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}