{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Social activist Anna Hazare and actor Suriya at the launch of Noyyalai Nokki , an initiative to restore the Noyyal, in Coimbatore on Saturday.— Photo: S. Siva Saravanan\n\nIt was a festive occasion at Kooduthurai (Alandurai) near the foothills of the Western Ghats, here on Saturday evening.\n\nHundreds gathered for the launch of Noyyalai Nokki , a people’s initiative to restore the 160-km long river.\n\nThe river originates in the Western Ghats and passes through Coimbatore, Tirupur, Erode, and Karur districts to join the Cauvery at Noyyal village.\n\n“I want to come after two years to see the Noyyal restored,” said social activist Anna Hazare at the launch function. It is important to focus on conservation of land and water resources for development, he said.\n\nEarlier, he told reporters that linking of rivers was good if it was done scientifically. It was important to plan water management, conserve natural resources, take up rainwater harvesting and restore rivers.\n\nActor Suriya, who participated at the inaugural of Noyyalai Nokki , said the confidence of the people gathered in restoring the river gave hope for restoration of more rivers across the State. It was necessary to take up such projects and conserve water bodies for the benefit of the future generations.\n\nAccording to Vanitha Mohan, Managing Trustee of Siruthuli, it was a joint project by the public to restore the river.\n\nC.R. Swaminathan, chairman of Noyyal River Restoration Federation, said the project would be implemented on divide-distribute-develop model by forming committees for every 500 metres of the river. Volunteers, educational institutions, non-governmental organisations and the government will be involved. To begin with, a survey of the river would be taken up and an estimate of the project would be prepared. Steps would be taken to install sewage treatment plants to prevent waste water from entering the river, said S.V. Balasubramaniam, chairman of Siruthuli.", 
    "section": "national", 
    "title": "Noyyal restoration begins", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}