{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Analysis shows only 41 women contested in all the 10 constituencies for the past 50 years\n\nAn analysis of the data available since 1967 reveals that the participation of women in the State Assembly elections is inadequately low in Madurai district.\n\nThough the district managed to perform marginally better than the State average in terms of the percentage of women candidates, at least in the last four general elections, the analysis shows that only 41 women had contested in the Assembly elections in all the 10 constituencies in the district in the last 50 years. This is only 3.9 percentage of the total of 1,049 candidates who had contested from the district in the last 11 Assembly elections since 1967.\n\nSurprisingly, the data also showed that at least 19 of the 41 candidates, roughly 50 per cent, contested as independent candidates indicating the poor representation given to women by major political parties. For instance, the AIADMK gave an opportunity to only four women candidates and the DMK to three women in the past 11 Assembly elections. While the CPI (M) had given chances twice, both were for renowned freedom fighter and party stalwart K.P. Janaki Ammal in 1967 and 1971.\n\nWhile the DMDK, which came into existence in the 2006 Assembly elections, gave an opportunity to a woman candidate in the same year, other smaller political parties like Janata Dal (United), Janata Party (non-existent now) and Indhiya Jananayaga Katchi fielded women candidates once or twice in the past.\n\nOnly five of the 41 women went on to become MLAs in the past 50 years.\n\nWhile all those contested as independent candidates invariably failed, three AIADMK candidates became MLAs in 1977, 1991 and 2001. Women candidates fielded by CPI (M) and DMK won in 1967 and 2006 respectively.\n\nThough comprehensive data was not available for 1957 and 1962 elections, it should be noted that P.K.R. Lakshmi Kantham from the Indian National Congress won as MLA from Madurai district.\n\nClaiming that increasing violence and muscle power in politics was deterring women, S.K. Ponnuthayi, State secretary of All India Democratic Women’s Association (AIDWA), said that the data clearly showed the need for implementing 33 per cent reservation in Assembly and Parliamentary elections.\n\nA.R. Mahalakshmi, BJP State secretary, said that her party had already implemented reservation in the appointment of office-bearers.\n\n“The party is also determined to field more women candidates in the elections,” she said.", 
    "section": "national", 
    "title": "Participation of women in Assembly elections low in Madurai district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}