{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With only six days left for the collection window to close, officials are going the extra mile\n\nWith the deadline for property tax collection drawing near, Greater Chennai Corporation has intensified its drive against property tax defaulters.\n\nThe civic body has collected Rs. 520 crore as property tax in the 426 sq. km. of the city. Corporation officials said the property tax collection per day had increased from Rs. 2 crore to Rs. 6 crore in the past few days.\n\n“We have identified those who have tax arrears above Rs.10 lakh. Town criers, notices and pamphlets are being used to create awareness,” said an official.\n\nThe civic body has also decided to focus on assessees with arrears over Rs. 5 lakh next week. Many of the 11 lakh assessees have not paid property tax following the floods.\n\nApartment complexes\n\nCivic body officials will visit all apartment complexes on Sunday to collect property tax through residents’ associations.\n\nIn a bid to match last year’s collection of Rs.581 crore, a total of 218 tax collectors will visit all residential neighbourhoods and commercial areas for the remaining six days of the month.\n\nAt least 70 per cent of the property tax collection is being made through tax collectors, sources said.\n\n“We will have to collect Rs. 60 crore in six days. It will be possible if residents and traders cooperate with tax collectors,” said an official. The civic body had set a target of collecting Rs. 650 crore as property tax in 2015-2016.\n\nTACTV counters\n\nMany assessees have also started paying tax through TACTV counters, bank counters and online modes.\n\n“More than three lakh assessees are likely to use the e-payment gateways, which were introduced a few months ago. Traders have also been motivated to use e-payment as it is free-of-cost. But traders pay only after a tax collector visits their premises. Multiple payment gateways by banks such as ICICI and HDFC are expected to improve tax collection,” said an official.", 
    "section": "national", 
    "title": "Property tax collection drive intensified", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}