{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Ruling parties using it to settle scores with leaders opposed to them’\n\nThe People Welfare Front (PWF) on Saturday urged the Centre to repeal Section 124 A, pertaining to sedition, of the Indian Penal Code to ensure freedom of speech guaranteed by the Constitution to people.\n\nIn a resolution adopted at the PWF lawyers’ conference held here, it said the sedition provision was enacted by the British rulers, who wanted to suppress the Indian freedom struggle. However, it had been misused by the ruling parties against the political opponents, who were highlighting the anti-democratic policies and programmes of rulers.\n\nThey had also using it to settle score with those opposed to them.\n\nThrough another resolution, the PWF wanted the State government to form the ‘Lokayukta’ to probe into the allegations against the elected representatives including Chief Minister and Ministers.\n\nA resolution said the retirement age of High Court and Supreme Court judges should be increased to 65 and 68 from 62 and 65 respectively so as to use the vast experience and knowledge gained by them for discharging duties and responsibilities.\n\nThe current system of retirement had prevented several judges to be in the office for ample period.\n\nReiterating the demand for changing the name of Madras High Court as the High Court of Tamil Nadu, a resolution said the name of Madras Presidency was changed as Tamil Nadu about five decades ago by the then Chief Minister C.N. Annadurai. Similarly, the name of Madras city was changed to Chennai in 1996.\n\nThe conference wanted Tamil made official language of Madras High Court.\n\nVaiko, MDMK general secretary; D. Pandian, senior leader, CPI, G. Ramakrishnan, CPI (M) State secretary; M. Mutharasan, CPI State secretary; Thol. Thirumavalavan, VCK founder spoke.\n\nLawyers of MDMK, DMDK, CPI, CPI (M) and VCK participated in it.", 
    "section": "national", 
    "title": "PWF seeks scrapping of sedition provision", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}