{
    "author": [
        "S Senthalir"
    ], 
    "text": "Hotels in Union Territory join the world in offering French menu to celebrate event\n\nDiners at a hotel in Puducherry. As part of the Good France project, restaurants across the world serve a special menu of recipes inspired by French cuisinePhoto:T. Singaravelou\n\nIn the dimly lit garden of a 19{+t}{+h}century manor on Surcouf Street, customers of La Villa hotel relished the French menu specially prepared for them.\n\nIt was a day to celebrate French cuisine on Monday night in Puducherry. Four upscale hotels — La Villa, Atithi, Satsanga and Mango Hill — in Puducherry joined the world in serving French menu to their customers at a Good France event recently.\n\nStarting with spinach and feta cheese ravioli and mushroom purée and citronella herbs juice, pumpkin and turmeric risotto and crispy and tender chicken with gnocchi and onion petals, the menu at La Villa ended with variation around coconut and chocolate moelleux desserts. “This menu was specially prepared for Good France event. Hence, only those who had made reservations earlier were allowed,” said Kavitha, operations executive of La Villa properties.\n\nSéléne Lebédel, an international student from France, was with her friends to savour the French cuisine. “It is my last day in India and we decided to enjoy the elaborate French dinner here,” she said.\n\nWriter Andrew Harris from London reserved a table for the dinner with his partner Kelly Francis. “I am a Francophile and I love this small corner of Puducherry,” he said.\n\nIn Atithi hotel, separate tables were arranged for the guests who preferred a taste of Good France. Didier Lemoine, Secretary General at the French Institute of Puducherry, arrived with his family. “We made the reservation for this special dinner in the afternoon,” he said.\n\nThey were served Bouchees a la Reine, a classic French starter, puff pastry filled with chicken, mushrooms and onion in a white wine cream sauce, Crème d’asperges, an elaborate main course of wild catch tiger prawns simmered in a mild coconut curry with green mangoes, turmeric, green chillies and ginger, herb rice, garden fresh vegetable and roasted chicken with mushroom sauce, mustard, Brussels sprout, carrot cardamom puree, dauphinois potato, cheese and a dessert of crème brulee with berry compote.\n\nOn March 21, restaurants across the world served special menu of recipes inspired by French cuisine At least 1,500 chefs, 1,500 menus, 150 embassies in five continents served one dinner to celebrate French cuisine worldwide as part of the Good France project.\n\nThe participants were designed the menu based on the following sequence: aperitif and canapés, starter, main course, cheese, dessert, French wines and champagnes.", 
    "section": "national", 
    "title": "Raising a toast to ‘Good France’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}