{
    "author": [], 
    "text": "All receipts issued by the Tiruchirapalli City Corporation will carry the message of #TN100 per cent campaign to maximise voter turnout in the Assembly election. Corporation commissioner N.S. Prema, in a release, said messages urging voters to exercise their franchise without fail will be stamped on the receipts issued by the corporation till the election. The corporation, she said, had organised street plays and cultural programmes to sensitise people on the importance of voting. The plays and cultural events will be held in all the 65 wards in the city. On Saturday, the events were held at Chathram Bus Stand, Gandhi Market, and TVS Tollgate areas.\n\nWomen’s Day by Ladies' Club\n\nThe BHEL Community Centre Ladies Club and Kailasapuram Club Ladies Club celebrated International Women’s Day recently and distributed sewing machines and a bicycle to beneficiaries from underprivileged families. S. Gopinath, Executive Director, BHEL, Tiruchi, presided over and Geetha Gopinath, Patron, KC and CC Ladies Clubs, gave the assistance. Mr. Gopinath distributed prizes among winners of various competitions held as part of the International Women’s Day Celebrations. G. Sivagurunathan, Secretary, Tiruchi Humor Club, highlighted the achievements of women in various fields. A seminar on women’s health was conducted by Dr.S.Uma Shankari of Kauvery Hospital.\n\n‘Enhance Family\n\nSecurity Fund’\n\nThe Tiruchi District Pensioners’ Association has appealed to the State government to enhance the Family Security Fund for pensioners from Rs. 50,000 to Rs. 1.50 lakh.\n\nA resolution to this effect was adopted at a meeting of the executive committee of the association held here recently with K. Palaniyandi, president in the chair.\n\nThe association, through another resolution, appealed to the State government to review the new medical insurance scheme for pensioners as a majority of the pensioners were not avail its benefits.\n\nThe scheme should be restructured to benefit all, the resolution said.", 
    "section": "national", 
    "title": "Receipts to carry slogans", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}