{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Work on renovation of Basilica of Our Lady of Health in Velankanni shrine has been in full swing and is expected to be completed by the end of this year. The renovation was necessitated to protect the ancient structure from the influence of sea breeze.\n\nThe work on the church located on the shores of Bay of Bengal was taken up last year. Apart from conservation, it will ensure extension of structural stability of the church for many more years, the Church authorities said.\n\nGundu Rao, a noted architect from Mysuru, has been executing the work, using the building materials which were used during the construction of the church. The materials for plastering include grounded lime mortar and gallnut.\n\nThe use of conventional raw materials restores the original beauty and strength of the structure.\n\nThe stain glasses were being renovated. “For an ancient shrine such as the one in Velankanni, it is these stain glasses that add to the beauty of the structure,” the sources said. The stain glasses which were damaged from time to time were replaced with glasses of differing colours.\n\nThe renovation work now focuses on replacing these glasses of different colours with uniformly coloured stain glasses so that the structure could regain its original grandeur.\n\nWork on the northern and southern wings of the main shrine had been completed and re-plastering work on the central wing was on say church sources.\n\nRev. Fr. A.M.A. Prabakar, Rectar, says that the shrine, located on one of the cyclone-prone regions of the country, had withstood ravages of time.\n\nThe work is expected to be completed within six months. Currently, the work on the main shrine dedicated to Our Lady of Good Health has been taken up. The ancient wood at the area has been in tact and does not need any replacement.\n\n“We just clean the area as part of maintenance and there is no need for replacing wooden craftsmanship,” say the source.", 
    "section": "national", 
    "title": "Renovation of Velankanni shrine in full swing", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}