{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Senate of the University of Madras on Saturday unanimously adopted two resolutions demanding a judicial probe into alleged diversification of funds over a period of six years, including Rs. 16 crore from the Nanoscience Department recently.\n\nSome members of the Senate alleged that funds from the Pension Fund were routinely diverted to meet non-plan expenditure during the tenure of two Vice Chancellors – Prof. R Thandavan and his predecessor Prof. G. Thiruvasagam. This did not have the approval of the appropriate statutory bodies.\n\nAccording to members, who raised the issue at the Senate’s budget meeting, the Union Ministry of Human Resource Department had in 2007 announced a special grant of Rs. 100 crore for setting up the Department of Nanoscience at the University of Madras in its sesquicentennial year. Similar grants were given to the other two oldest universities in the country – the University of Calcutta and the University of Bombay. Of this, Rs 70 crore was released.\n\n“The University Grants Commission and the Department of Nanoscience had jointly evolved guidelines for use of these funds for the intended purpose. However, the university recently withdrew Rs. 16 crore from these funds to pay a building contractor, who had executed some work for the university in the past,” charged a Senate member.\n\nSenate members said the diversion of funds could not be defended.\n\n“The university’s current administrators had drawn Rs. 16 crore from the funds of the Nanoscience Department to pay a building a contractor. Incidentally, the contractor had originally quoted Rs. 11 crore, but later revised his bill to Rs 16 crore,” said a Senate member.\n\nUniversity officials said that the amount was sanctioned by a bureaucrat after the contractor had approached the court for non-payment of dues. The court had suggested the university to go in for arbitration. Senate members alleged that the bill was settled without arbitration. “It is unclear why the university paid up the additional Rs 5 crore charged by the contractor,” a member said.\n\n“Such transfer of funds would cause problems when the HRD Ministry seeks details on the utilisation of funds. It will not harm the Registrar or the bureaucrat who sanctioned the payment as they are not permanent officials of the university. We are worried that any negative fallout would bring disrepute to the institution,” said Senate member S.S. Sundaram, who had initially raised the issue.\n\nAnother member, G. Ravindran, said funds had been diverted from pension and plan funds to the tune of Rs. 80 crore and Rs. 60 crore to other accounts when Messrs. Thandavan and Thiruvasagam were Vice Chancellors. “The student amenity centre has not been functioning for a long time. A person has been awarded a rental contract for setting up canteen on 5,000 sq feet area without authorisation from the senate or syndicate,” he charged. Alleging large scale irregularities including in the maintenance of the Senate House, he called for a thorough investigation into the way the university utilised funds in the last six years.\n\nMisuse of funds happened during tenure of two Madras University Vice-Chancellors", 
    "section": "national", 
    "title": "Senate demands judicial probe into funds diversion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}