{
    "author": [
        "Sudhir Srinivasan"
    ], 
    "text": "I’ve always been awed by laughter yoga practitioners, by how they will themselves into voluntary laughter, and sustain it for so long. But they have a new challenge in town in the form of Valeba Raja , which has finally released after threatening to for the last two years.\n\nTry laughing now. The film is full of ineffective gags and impotent punchlines. Somewhere over the last couple of years, it appears that the Santhanam brand of comedy has ceased to entertain. His insults aren’t as inventive as they once were, his repartees not as intelligent.\n\nHere, he plays a lengthy cameo as Valeba Raja, a supposedly successful psychiatrist, but more likely the sort of quack that the likes of Dawkins and Hitchens have spent their lives denouncing. Mr. Raja picks one patient, “patient of the day”, and spends the whole day listening to their woes. For the purposes of our film, it is the film’s hero, Karthik (Sethu), who seeks professional help for being caught in a love triangle. That’s the film’s excuse, its cue, for the incoming generic love scenes, and the excruciating duets. Meanwhile, Sethu doesn’t look and act so much like the hero; he seems like the sort of actor who’d be perfect as a foil to the hero instead. Remember the guy Sonia Agarwal’s character is in love with in Kadhal Konden ?\n\nKarthik’s family is supposed to be quirky and adorable. His father (Jayaprakash) is a lawyer, who is shown to be absentminded, in his introduction scene. But it has no bearing on the story, and you never see this trait reappearing. His mother’s adorable quirk is that she takes films too seriously. When she sees Rajinikanth being tied to a pole in Baashha , she can’t stop crying and urges her husband to file a case against actor Anandaraj. Honestly, I would’ve found a punch to my gut funnier.\n\nMeanwhile, his sister (Devadarshini) cleans a lot when she’s stressed. In one scene, she is cleaning something so vigorously that she fails to notice that her hand has slipped, causing her to wipe her husband’s face instead. Her husband (Subbu Panchu), meanwhile, has always wanted to be a cricketer (“ Coach run edukka sonnaaru ; Lingusamy thaan erkanave eduthutaare nu sonnen ”). The film, eventually, meanders on to Karthik’s love triangle with Sweety (Nushrat Bharucha), a Marwari girl, and Shaalu (Vishakha Singh), a girl he’s engaged to. Sweety’s idea of romance is to desist from communicating her feelings until it is too late. Shaalu’s idea of romance, meanwhile, is to ask the guy she is in love with, to marry somebody else, though she knows he is in love with her. All of this is so uninspired that even Valeba Raja knows this. In one scene, he actually tells Karthik that the love story sucks. Why inflict it on us then?\n\nThe only idea I found funny was VTV Ganesh playing a Marwari dad. Just the idea was enough. But there isn’t much of him unfortunately. And before long, you’re again subjected to painful one-liners like, “If I get tension, I’ll beat you so much that it will hurt you till you get pension.” It is jokes like these, I suspect, that turn placid men into serial killers.\n\nsudhir srinivasan\n\nValeba Raja\n\nGenre:Comedy\n\nDirector:Sai Gokul Ramanath\n\nCast:Santhanam, Sethu, Nushrat Bharucha, Vishakha Singh\n\nStoryline:A guy caught in a love triangle seeks professional help\n\nBottomline:So many jokes, so few laughs", 
    "section": "national", 
    "title": "Shrink-wrapped", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}