{
    "author": [
        "S Poorvaja"
    ], 
    "text": "It was a nightmare, says Anand Aravindakshan.He denies hiding his professional experience\n\nWhile brickbats continue to pour online for Anand Aravindakshan, who won the ninth season of Super Singer on Vijay TV following accusations that he and the channel hid information about his songs rendered for films, he took to his social media page to clarify his stand on the issue.\n\nTerming the last few days as a ‘nightmare’, he said the information about his singing for films had been available online and that he had not made any attempts to hide or misrepresent the information.\n\nDescribing his struggle, he stated that he participated in the event to gain confidence and give a new lease of life to his career.\n\n“Extremely worrying, depressing and negative I feel, after putting in so much for my own career through this show,” his statement said.\n\nHis post has since got over 20,000 likes and over 3,000 shares with many users online voicing their support for him. While many maintain that the show should only have people who have not sung professionally as their contestants to give a fair chance to everyone, the TV Channel has gone on record to state that their rules have not specified the same in the recent seasons of the show which had enabled him to participate.\n\n“As he says, the information was always there online and the channel probably could have explicitly stated it in order to be fair. The amount of memes and posts going around spreading negativity will not help,” said T. Namratha, a viewer of the show.\n\nLakshmy is back\n\nActor-director Lakshmy Ramakrishnan will make a comeback in the popular talk show ‘Solvathellam Unmai’ on Zee Tamil from April 4. After hosting nearly 700 episodes of the show, which deals with interpersonal problems and social issues, she took a break in May last.\n\n“I wanted to travel abroad and hence, took a break. But I realised that the show was etched in people’s mind. I was surprised when people spoke about the show even when I was abroad,” said Ms. Ramakrishnan, hinting at the episode in which her oft-repeated catchphrase became the subject of parody in another channel’s show and in a film song.\n\nShe will replace actor Sudha Chandran in the show. “I admire Ms. Chandran for what she has achieved and she was a good choice as an anchor for the show,” said Ms. Ramakrishnan.\n\nShe said this show had brought her closer to people with whom she wanted to communicate through her films.\n\n“I have a sense of responsibility now in the new episodes as I understand how much it has influenced people. As a team, we will try our best to change the lives of participants,” she said. The show will be aired from Monday to Friday at 8 p.m.\n\n(Reporting by S. Poorvaja and K. Lakshmi)", 
    "section": "national", 
    "title": "Super Singer winner refutes criticism", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}