{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The city police on Saturday secured two persons for alleged theft of more than 40 sovereigns of jewellery and cash from houses of two landlords.\n\nThe arrest of the two for theft of 36 sovereigns gold jewellery from the house of Gowri (60) at Jothi Nagar in Podanur on March 17 also resulted in cracking a similar offence they committed in a nearby area in November last year.\n\nThe accused were identified as Devika (22), who was pursing her degree via distance education, and her friend Samayathullah Javed (22), a bodybuilder and short film actor, of the same locality. According to police Devika was a tenant at Gowri’s house for nearly four months and vacated itonly a week before the robbery.\n\nDevika’s family then rented a portion of a house adjoining Gowri’s house.\n\nThe police said the robbery took place when Gowri was alone in her house.\n\nHer husband Nataraj had gone to his home town Karakudi when the incident happened.\n\nPolice said that Devika and her male friend Javed plugged Gowri’s mouth and decamped with the jewellery.\n\nThree special teams were formed under Assistant Commissioner P. Gopi to nab the accused.\n\nThe teams narrowed down on Devika and Javed, who confessed the crime at her previous landlord’s place in November– two streets away from Gowri’s house – when the landlord and his wife were fast asleep.\n\nIn connection with the theft in November the two were booked under sections 457 (house trespass or house-breaking at night to commit an offence) and 380 (theft) of the Indian Penal Code (IPC). For the theft at Gowri’s house they were booked under section 394 (voluntarily causing hurt to commit a robbery) of IPC.\n\nThe police recovered a major share of the loot from Javed’s house and were trying to recover the rest, which he had reportedly sold.", 
    "section": "national", 
    "title": "Tenant held for theft at landlords’ houses", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}