{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Due to track doubling work between Manapparai and Tiruchi , the railways have effected the following changes in the train operations in the section from March 28 to April 1.\n\nChange in train operations\n\nThe train No. 16128/16127 Chennai Egmore-Guruvayur Express will be diverted via Tiruchi-Karur-Dindigul with stoppages at Madurai, Sholavandan and Dindigul. The train will not stop at Manapparai and will reach Dindigul at 5.20 p.m. as against the existing 3.21 p.m. from March 28 – 31. The train No. 16532 Nagercoil – Mumbai CST Express on Thursday (March 31) will be diverted to run via Tiruchi-Karur-Dindigul and will reach Tiruchi at 2.45 p.m. as against scheduled time of 12.30 p.m.\n\nThe train No. 16129 Vanchi Maniyachi-Tirunelveli Link Express will have a late start from Vanchi Maniyachi from March 28 to April 1.\n\nThe train No. 16354 Nagercoil - Kacheguda Express on Tuesday (March 29) will be diverted to run via Dindigul and Karur.\n\nThe train No. 16788 Sri Mata Vaishnodevi Katra - Tirunelveli Express and train No. 16353 Kacheguda – Nagercoil Express on Thursday (March 31) will run on diverted route via Karur-Dindigul.\n\nPartial cancellation\n\nTrain Nos. 56712 / 56713 Palakkad Town-Tiruchi-Palakkad Town) passengers will be partially cancelled between Tiruchi and Tiruchi Fort on April 1. So, the train will start and terminate at Tiruchi Fort.\n\nTrain Nos. 12084/12083 Coimbatore-Mayiladuthurai Jan Shatabdi Express will be partially cancelled between Tiruchi Fort and Mayiladuthurai on April 1. On that day, the train will terminate at Tiruchi Fort.\n\nTrain No. 56844 Tiruchi-Erode Passenger will be partially cancelled between Karur and Tiruchi on April 1. This train will be operated between Erode and Karur on that day.\n\nFull cancellation\n\nTrain No. 76833 Tiruchi-Karur Passenger (DEMU) will be cancelled fully on April 1.", 
    "section": "national", 
    "title": "Trains rescheduled due to track doubling", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}