{
    "author": [
        "K Raju"
    ], 
    "text": "“Visitors experience the craftsmanship of the weavers”\n\nA team of consumers from Bangalore, Chennai and Coimbatore landed in Chinnalapatti, not just to buy exquisitely designed mercerised tie and dye saris but also to know how they are designed and woven and understand and appreciate the efforts taken by weavers.\n\nCotton Trail, a new initiative of Co-optex to promote handlooms, has provided an opportunity to these women to meet weavers in remote villages in Chinnalapatti area on Friday and know the nuances of handloom weaving.\n\nThe tie and dye that came from Pochampalli in Andhra Pradesh had become a popular variety in Tamil Nadu, said team member Shreemathy Mohan, an employee of an IT major. With direct purchase, weavers got a major share and customers got satisfaction for the money spent.\n\n“We have come here to understand the tie and dye and craftsmanship in weaving Paramakudi cotton saris,” said other members.\n\nCotton Trail not only popularised textiles of each region of the State but also helped the urban consumers shop smarter and know the right place to get the best buy, said T.N. Venkatesh, Managing Director, Co-optex, who led the team.\n\nThe move also helped get due recognition to each region that produced exclusive cotton varieties, he added.\n\nThe visitors would experience the craftsmanship of weavers and realise the value of the products.\n\n“Our Pandian Cotton Trail is to popularise weaving centres in Karaikudi, know the nuances of weaving Chettinad cotton saris and technicalities of Sungadi saris in Madurai. Saris account for 50 per cent of the total sale of Co-optex. We have seen tremendous growth in cotton sari sales. Our previous successful Kora Trails in Sirumugai and Vadambacheri in Coimbatore have motivated us to organise more such trails. Now, textile trail has become very popular among consumers in southern States,” he added.\n\nAbout 20 clusters in Dindigul, Paramakudi, Karaikudi and Madurai produce exclusive sari varieties. Weavers in Chinnalapatti have mastered the art of weaving Kora Silk in warp with mercerised cotton in weft, with tie and dye pattern in both body and pallu. Tie and dye experts from Madathukulam in Udumalpet narrated its technicalities to the members.", 
    "section": "national", 
    "title": "Urban customers on a ‘Cotton Trail’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}