{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "The uplifting power of music was on display at the International Day of Happiness celebrations at the MGMCRI.Photo: Special Arrangement\n\nSometimes, a hospital might need to look or feel less like a place of illness and suffering to help the healing process of patients.\n\nThe other day, the Mahatma Gandhi Medical College & Research Institute (MGMCRI) premises featured an impromptu music square where therapists sang songs in Tamil and English and a Tree of Happiness where patients and well-wishers wrote down what brought them happiness on a string.\n\nThese were among the events that marked International Day of Happiness hosted by the Centre for Music Therapy Education and Research (CMTER) of the MGMCRI administrated by Sri Balaji Vidyapeeth.\n\nSince 2013, the United Nations has celebrated International Day of Happiness as a way to recognise the importance of happiness in the lives of people around the world. The U.N. just launched 17 Sustainable Development Goals that seek to end poverty, reduce inequality, and protect our planet — three key aspects that lead to well-being and happiness.\n\n“Among the many aspects of happiness we talked about with patients was the role of health in promoting well-being and how music therapy comes into this picture,” said Dr. Sumathy Sundar, Director, CMTER.\n\nAddressing patients, Dr. Sundar spoke about happiness being a fundamental birth right of all individuals and the need to take care of health which is the complete state of physical, mental and social wellbeing.\n\nMusic therapists of the CMTER rendered songs to demonstrate the power of music to complement treatment.\n\nProf. S. Ravichandran, Additional Director, inaugurated the Tree of Happiness and the Line of Hope created by the faculty and the students of CMTER.\n\nPointing to the stressful lives of modern age, he outlined how the music therapy services started by the hospital as a complementary therapy was making a difference to the treatment outcomes.\n\nProf. Krishnan, Head of Dermatology; Prof. B Amirtha Ganesh, Head of Cardiology and Prof. Easwaran S, Head of Psychiatry; and Kala Varadan, Tutor, CMTER, also addressed patients on the aspects of the link between happiness and health.\n\nDuring the events, patients wrote their wishes, hopes, desires and dreams on the Line of Hope. Most of the messages resonated with optimism with patients stating that in spite of the health issues that they were facing, they remained cheerful and hopeful of the future.", 
    "section": "national", 
    "title": "When music is just what the doctor ordered", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}