{
    "author": [
        "B Kolappan"
    ], 
    "text": "In a State where cinema and politics enjoy a clearly symbiotic relationship, election campaigns are incomplete without the participation of film stars. However, post elections, their return to stardom hinges on the fortunes of the party they had campaigned for.\n\nFor instance, Vadivelu and Manorama, two rather high-profile stars, witnessed a dip in their career after an active political campaign. On the other hand, the onscreen fortunes of Superstar Rajnikant who had also taken sides in a political battle were not affected.\n\nWhile Manorama went back to essaying roles in films after about a year, in the case of comedian Vadivelu, life did not return to normal. He paid a heavy price for taking on the AIADMK-DMDK combine that captured power in Tamil Nadu in the 2011 Assembly elections. While his career touched a nadir as producers were wary of using him in their films, the DMK for whom he had campaigned for had moved forward and extended an olive branch to DMDK leader Vijayakant, whom he had attacked virulently.\n\n“Mr. Vadivelu lost his credibility and popularity because he chose to campaign for a government caught in the wave of anti-incumbency while Rajnikant [in 1996] had extended support to the opposition seeking to remove an unpopular government,” explains Venkatesh Chakravarthy, director of L.V. Prasad Film and TV Academy. Rajnikant lent his support to the DMK and the newly formed Tamil Maanila Congress (TMC) in the 1996 election, which emerged with a thumping majority.\n\nHowever, his message in favour of the same alliance was rejected by the people of Tamil Nadu in the subsequent 1998 Lok Sabha polls as he chose to swim against the popular current and tried to give a clean chit to the DMK government at a time when bomb blasts rocked Coimbatore. His subsequent tryst with election campaigns failed to leave any impact on the political arena. His screen presence, however, remained unscathed.\n\nThis was not the case with Vadivelu. Sashi Kumar, Chairman, Media Development Foundation, says Vadivelu had crossed the limit by mounting personal attack against another film personality and it was not taken kindly by others in the industry. Late Manorama took the side of the AIADMK during the 1996 assembly polls, again the side that lost that particular battle. Subsequently, she was hardly seen on screen, and nearly a year later, Rajnikanth stepped in to offer her a role in his film and set her back on track. While Mr Venkatesh Chakaravarthy saw loss of a great talent in the fall of Mr. Vadivelu, Mr. Sashi Kumar’s perception of the comedian chimes in with the entry of a new crop of actors waiting in the wings.\n\nThe bitter lessons that Vadivelu learnt is unlikely to stop film stars from campaigning for one political party or another, and actor Singamuthu, a friend-turned-foe of Vadivelu, has already begun mimicking Mr. Vijaykant in a segment on Jaya TV; and these clips have turned out to be hugely popular on social media.\n\n“There are no holds barred in an election and comedians provide a raunchy element to election campaign,” said Mr. Sashi Kumar. Mr. Chakravarthy, however, felt that film personalities were unlikely to make the kind of impact they used to as “other elements” have come to play a key role.", 
    "section": "national", 
    "title": "When film stars burn out campaigning", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}