{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a sign that the Left in the country is undergoing a re-learning of identity politics, CPI (M) general secretary Sitaram Yechury on Saturday proposed a rainbow coalition of Communist parties and Ambedkarite groups.\n\nMr. Yechury made the pitch at an event organised here by the Tamil Nadu Teendamai Ozhippu Munnani to celebrate the 125th birth anniversary of Dr. B.R. Ambedkar.\n\nHe insisted that Communism is essential to realising Dr. Ambedkar’s idea of India. “The red flag will always be a red flag because as long as human beings exist, blood will always be red and we will continue to fight. The blue flag is the other end of the spectrum of the rainbow: Vibgyor, starting from violet of the blue family and ending with the red family. Between blue and red are the entire colours of the universe. That is the rainbow; the CPI (M), I can assure you, is committed to building a rainbow coalition and that is the only way we can defend India today and create a better India tomorrow,” he said.\n\n“That is why the CPI (M) says that in India, we must understand this reality: all of us who want to change India for a better India stands on two legs. One leg is economic exploitation and the other leg is social oppression. Unless both these legs start moving, we cannot walk – forget running,” he said\n\nMr. Yechury sought to bury the hatchet when it came to his ideological differences with Dr. Ambedkar and sought out commonalities. “ This is not the time to recollect what was said 70 years ago, 80 years ago. Today, India itself is under attack. So, today what is the commonality between Ambedkar, the Communists and the Indian patriots? That commonality is to create a better India, an India where there is no social oppression,” he said.\n\nHowever, the gulf in understanding was inadvertently on show on Saturday. At one point during his speech while listing Dalit icons, Mr. Yechury said, “….Mahatma Gandhi, who coined the term Harijan, that Dalits are children of God…” Ambedkar had rejected Mr. Gandhi’s coinage, saying he preferred the term Dalit instead.\n\nEven as elections are due in West Bengal and Kerala, Mr. Yechury’s gaze remained firmly on the campuses that have been sites of student agitation. More than offering leadership, he offered to stand alongside students – “support” was a term he used repeatedly. Mr. Yechury recalled an argument he had with Rohith Vemula at the Hyderabad Central University and said that the Ambedkarite slogan of ‘Jai Bhim’ was as nationalist as any other. “I’ll shout Jai Bhim, I’ll shout Lal Salam and all the slogans will converge into one slogan that Bhagat Singh gave – that the Communists give today – and that is, Inquilab Zindabad! Because we want an India where our political independence is transformed into the economic independence of all our people. It is possible only through Inquilab Zindabad. That is the new India; that is the convergence of Ambedkar and today’s Communist parties, we work for that objective. For that, we have to close ranks and face the common enemy who wants to destroy the social unity and integrity of our country,” he said.", 
    "section": "national", 
    "title": "Yechury proposes rainbow coalition of Communists, Ambedkarites", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}