{
    "author": [
        "Vishal Menon"
    ], 
    "text": "Shiv Mohaa, the debutant director of Zero , isn’t someone who, I assume, would have drawn pictures of fruit bowls and sunsets in art class. His drawings must have been so out of the world that they likely stumped the entire classroom. His latest portrait, too, isn’t something we see often taped over the refrigerator we call Tamil cinema. If imagination were the only criterion for judging Zero , Shiv would get an A plus.\n\nThe beginning of Zero is the beginning of the universe itself, narrated by Gautham Menon no less. How often do you see a small film beginning so ambitiously? We’re shown the birth of light and darkness, heaven and earth, and, on the sixth day, the creation of man and woman. We’re shown Adam and Eve in the Garden of Eden, living in bliss until the Serpent causes the original sin.\n\nThousands of years and millions of sins later, we cut to a world that has become, in Gautham Menon’s words, “an emotionless, concrete jungle”.\n\nIt is here that we see Bala (Ashwin) and Priya (Sshivada) getting married. Bala is a social worker, and all Priya wants to do is take care of him, despite being a university topper. They live in their own little Garden of Eden, with hopes, joys and worries... that is, until the Serpent decides to make its entry, here too. Bala’s father (Ravi Raghavendra), we’re told, was against their marriage. It wasn’t just Priya’s infertility, but also his suspicion that she could inherit her mother’s mental illness. So, when Priya is caught shoplifting, and reacts with exaggerated rage, we feel Bala’s father had a point. And when she wakes up at night and starts sleepwalking, we’re slowly seeing her descend into darkness. She starts seeing visions in which her dead mother lures her to a magical place – a fantastical new universe inhabited by “foreign women”, who walk around lush meadows that surround a lake and a tree of life. Priya’s mother promises her perennial happiness here, suspended in a state of bliss, and a promise to be by her side forever. Why, then, should Priya return to reality?\n\nHer suffering, back in reality, seems to be worsening. She imagines a never-ending piercing noise that pushes her to risk puncturing her eardrums. When it does stop, her vision begins to deceive her. She sees several versions of her husband, and doesn’t know which one is real.\n\nBala, in his helplessness, approaches Solomon (J. D. Chakravarthy), a sunglass-wearing wizard who can see spirits, and see through ‘phoney’ rationalists. In other words, he’s the man you turn to when medical science fails you. But just as you think the film’s getting primed for a thrilling third act, it takes an unfortunate turn to the predictable.\n\nWhatever happened to Bala’s father? Where’s the friendly neighbour lady who’s so fond of Priya? From a thrilling tale about a woman battling mental illness, the film, for all its signs of promise, reduces itself to another exorcism story.\n\nvishal menon\n\nZero\n\nGenre:Fantasy\n\nDirector:Shiv Mohaa\n\nCast:Ashwin K, Sshivada, J.D. Chakravarthy\n\nStoryline:Strange events start happening to a woman after marriage\n\nBottomline:An ambitious film that starts promisingly, but falters towards the end", 
    "section": "national", 
    "title": "Zero worship", 
    "subsection": "tamilnadu", 
    "date": "2016-03-27"
}