{
    "author": [
        "S Senthalir"
    ], 
    "text": "People from all walks of life participated in the ninth Auroville Marathon 2016 race, held at Auroville in Puducherry, on Sunday —Photo: S.S. Kumar\n\nPeople from all walks of life participated in the ninth Auroville Marathon 2016 race, held at Auroville in Puducherry, on Sunday —Photo: S.S. Kumar\n\nPeople from all walks of life participated in the ninth Auroville Marathon 2016 race, held at Auroville in Puducherry, on Sunday —Photo: S.S. Kumar\n\nNinth edition of the Auroville Marathon sees participation of more than 2,500 people inspired by the joy of running, travelling and making new friends\n\nEven before dawn broke on Sunday, taxis and two-wheelers rolled into Auroville. People from across the country were all set for the 9th edition of the Auroville Marathon and gathered at the International de France in the City of Dawn.\n\nAuroville’s international zone wore a festive look minutes before the marathon was flagged off. The participants posed for selfies with their friends, as they were warming up for the run while family and friends were present to cheer the runners.\n\nIn batches\n\nThe first batch of runners for the full marathon of 42 km started at 5 a.m., the second batch of runners covering the half marathon started at 6.15 a.m., followed by the 747 runners who were set to cover 10 km distance at 7 a.m. and the last batch of 300 registered runners along with the enthusiasts joined the 5 km run at 7.30 a.m.\n\nFrom children aged 10 years to those above 50 years old participated in the marathon. The Auroville Marathon that started in 2008 with just 250 participants now pulls nearly 3,000 runners from across the country.\n\nFifty-five year old Chandramouli, an HR professional from Bengaluru, was participating for the fifth time. “I am a runner and I love running,” he said.\n\nMitali Patil, a software professional from Mumbai said: “Runners find their way to marathons wherever they are organised. We browse through the internet and get the details of marathon events during the year and decide on the place. It is very addictive. Everyone should run just for the joy of it.”\n\nJoy of running\n\nIt was the joy of running, travelling and making new friends that entice many to marathons.\n\nHenna, who finished first in half marathon (21km), said: “Running helps bring discipline in life. We run twice or thrice in a week. I like to travel and meet new people. The marathon gives me an opportunity to soak in the culture of the new place,” he said.\n\nFifteen-year old Babu.S, a student of Snehagram from Bengaluru, finished first in the 10 km run in 40 minutes 21 seconds. Medical aid was made available at every 3km and hundreds of volunteers managed the registration, route markings, market marathon displaying Auroville products along the way and medical emergencies.\n\nBenefits of running\n\nChandresh Patel, one of the coordinators of the event, said: “There are at least 400 to 500 volunteers. Running gives endurance, improves focus as you complete the long distance.”\n\nJothi Govindaraj, another coordinator, said: “The event is organised by Auroville Runners in association with Auroville community since 2008. More than 2,500 people participated in the marathon.”\n\nThe event was first organised to celebrate 40 years of Auroville and based on the overwhelming response from runners from across the country, it was made an annual event. This event considers all the finishers as winners and do not award any prize money.", 
    "section": "national", 
    "title": "A mass run that sees people from across ages, regions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}