{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Puthiya Tamizhagam president K. Krishnasamy on Sunday said his party would announce its stand on joining an alliance after the Election Commission issued the poll notification for Tamil Nadu.\n\nAddressing reporters after a closed-door meeting with party office-bearers and booth-level agents here on Sunday, the Dalit leader, when asked about Chief Minister Jayalalithaa detailing the five-year achievements of the AIADMK government on the floor of the Assembly, said the AIADMK leader who was one of the very efficient leaders, could have concentrated on setting up industries and creating employment opportunities during the tenure.\n\nThe distribution of freebies such as mixies, grinders, goats and milch animals did not help to raise the basic standard of living of the poor people, he said. The government could have functioned more effectively, if Ms Jayalalithaa, instead of acting ‘solo’, utilised the services of second and third rung leaders in the party, he said.\n\nThe flood relief works in the worst affected Chennai and Cuddalore could have been more effective if the AIADMK had involved the services of the alliance parties, said Mr. Krishnasamy, whose party fought the 2011 assembly elections in alliance with the AIADMK but strained its relations later with the Dalit leader turning one of her acerbic critics.\n\nThe party had forged ties with the AIADMK in the 2011 assembly elections on conditions that on coming to power, it should issue a Government Order to recognise the six sub sects of scheduled castes under one common name, ‘Devendra Kula Vellalars’ and organise the death anniversary of Dalit leader Immanual Sekaran as an official event, but it failed to fulfil the promises, he said but refused to rule out an alliance with the AIADMK.\n\nHe evaded a direct reply when asked about the prospects of party forging ties with the DMK.\n\n“We will consult the district office-bearers, weigh the pros and cons of the then prevailing political situation and take a decision,” he said. He refused to comment on the People Welfare Front, saying “they are my friends and I do not want to comment.”", 
    "section": "national", 
    "title": "Announcement on joining alliance after poll notification: PT", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}