{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "On June 24, 2013, Bharathiar University had conducted a Syndicate meeting. The Syndicate is a 20-member-strong, highest decision-making body. After the conduct of the meeting, the then Bharathiar University administration under Vice-Chancellor James Pitchai submitted a food bill for Rs. 1.41 lakh.\n\nThe bill dated July 11, 2013 says that the University gave the money to Selvamoorthy Canteen in the University. The money spent works to Rs. 7,080 a Syndicate member, assuming that all the 20 attended the meeting.\n\nThis bill has come under the adverse notice of the audit team which had audited the expenditure for 2013-14.\n\nCommenting on the expenditure, the auditors say that the University has said that 350 members participated in the Syndicate meeting, but it has not furnished the list of participants. Assuming that it is true, the bill works out to Rs. 405 a person, which is “abnormal”.\n\nThe auditors’ finding came up for discussion in the recent Syndicate meeting, wherein the members wanted to know how did the University spend Rs. 1.41 lakh on food that too for 20 members, says a Syndicate member. But this is only one of the adverse findings, he adds.\n\nThe auditors have raised objections to payments made to temporary staff at the University arts and science college in Gudalur, stationery purchased for Rs. 61 lakh, abnormal incidental expenditure incurred by the then VC Mr. Pitchai, his mobile phone bills among others.\n\nThe Syndicate member says that for many high-value purchases, the then administration did not follow the rule and refers to purchasing a car for the VC in Chennai based on just a quotation from a car dealer.\n\nWithout calling for tender, the University had obtained only one tender and bought the car based on the tender for Rs. 9.17 lakh, the auditors have observed.\n\nThe auditors have flagged the Rs. 20.94 lakh spent on sending letters favouring private couriers against India Posts.\n\nThe University has not given the reasons for preferring the private couriers. There are 81 objections the auditors have raised and the value is Rs. 14.66 crore.\n\nThe Syndicate member says that the present University administration or the Government should recover the money from those found guilty.\n\nN. Pasupathy, general secretary, Association of University Teachers, says that Syndicate ratification of the objectionable transactions should not be done as it will lead to more such irregularities.\n\nThe next Syndicate should pass resolutions to recover the money as that will send a strong signal to the guilty, he adds.", 
    "section": "national", 
    "title": "Audit report finds fault with Bharathiar University expenditure", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}