{
    "author": [
        "M K"
    ], 
    "text": "Police officers in West Zone said that cases had been registered more than nine months after the arrest of the five Maoists and their sympathisers and seizure of materials from them as they had to get the contact details of persons whose identity proof was used to buy the SIM cards.\n\nHowever, some of the persons here, who lodged complaints against the Maoists, said they were inquired by the police about four months ago.\n\nA senior police officer said that they had to trace the service provider and then get copies of the forged documents that were used as proof to get the SIM cards. Seized SIM cards belonged to various telecom service providers in Tamil Nadu, Kerala and in Karnataka.\n\nThe Kerala Police have already registered cases in this connection and Shyna has obtained bail in one of them in the Palakkad court. “The Karnataka Police are in the process of registering such cases,” said a ‘Q’ Branch officer. The police hinted that persons, who helped the Maoists, got the SIM cards and mobile phones would also be booked and arrested.\n\nMeanwhile, counsel of the Maoists and sympathisers and State general secretary of the People’ Union for Civil Liberties, S. Balamurugan, told The Hindu that the cases were false and baseless. “Fresh cases are being registered against them to thwart their release on bail and o keep them in jail and for mentally harassing them,” he said.\n\nMr. Balamurugan recalled that the cases had been registered in less than a month after the Madras High Court granted bail for the Maoists and sympathisers, as the police had not filed the charge sheet against them for over three months after their arrest.\n\nReiterating that charges against his clients were not true, he said that fresh charges should have been added to the earlier case and not as fresh cases.\n\n“We will legally challenge the new cases in court,” he concluded.", 
    "section": "national", 
    "title": "‘Cases booked late against Maoists due to procedural delay’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}