{
    "author": [], 
    "text": "RELIGION:\n\nRamayanam: R. Krishnamurthy; Sri Sankara Gurukulam, C.P. Ramaswamy Street, Abhiramapuram, 6-45 p.m.\n\nSrimad Bhagavatham: Sundara Kumar, Harihara Dhyana Nilayam, Chimaya Mission Yoga Center II, Chinmaya Nagar, 6-45 p.m.\n\nVivekachoodamani: R. Rajapogal, Sri Sankara Gurukulam, C.P. Ramaswamy Street, Abhiramapuram, 4-30 p.m.\n\nAitareya Upanishad: Satyavratananda Saraswati, Shiridi Sai temple, Shenoy Nagar, 5-30 p.m.\n\nThirumurai: E. Chokalingam, 9/5, T.T.K. Salai, Royapettah, 6. 30 p.m.\n\nSri Thyagaraja Kirthigal: Ganesh, Sitadevi Garodia Hindu Vidyalaya, 2, Kalamegam Street, East Tambaram, 6-45 p.m.\n\nSamboth Foundation: Spiritual lecture by Swamini Bodhananda, Bharatiya Vidya Bhavan, Mylapore, 6-15 p.m.\n\nGENERAL:\n\nDepartment of Journalism and Communication, University of Madras: Seminar on Radio in Times of Disaster, AV Studio, Tower Clock Building, 11 a.m.\n\nDr. MGR University: Academic staff college – faculty empowerment programme, Maduravoyal, 10 a.m.\n\nVancouver Film School: Workshop on Writing for film and television, M.O.P. Vaishnav College for Women, Nungambakkam, 9 p.m.\n\nMaruppakam: “Velutha Rathirikal” film screening, MM Preview Theatre, T. Nagar, 5 p.m.\n\nEthiraj College for Women: Ed-Bazaar’ 16, Ethiraj College for Women, Egmore, 9 a.m.\n\nAnna University: Tamil Nadu level placement programme, DMI College of Engineering, Palanchur, Kancheepuram, 9 a.m.\n\nMadras Institute of Development Studies: Talk on Elemental India: India’s natural world at a time of crisis and opportunity, MIDS, Gandhi Nagar, Adyar, 3 p.m.\n\nChettinad Vidyashram: 6th Math Club Anniversary, Chettinad Vidyashram, Rajah Annamalaipuram, 10 a.m.\n\nPalaniappa Brothers Publication: Founder’s Day celebrations, Indian Officers’ Association, Thiru-Vi-Ka High Road, Royapettah, 6-30 p.m.\n\nNarcotics Anonymous: Meetings, Grace of the Millennium group, CSI Zion Church, Chintadripet; Reality Group, CSI Good Shepherd Church, Taramani 100 feet Road, Velachery, 7 p.m.\n\nAl-Anon: Meetings, SOS Al Anon Group, Meston College of Education, Royapettah; Madipakkam Al-Anon Family Group, Moovarasampettai; Al-Anon Group, CSI Church, Padikuppam Road, Anna Nagar; Blossom Buds Group, The Lady of the Light Church, Mylapore; Anmeega Asthivara Group, Tiruvottiyur; Ebenezer MM School, Thirumullavoyal, 7 p.m.\n\nAlcohlolics Anonymous: Meetings, Meston College, Royapettah; Chennai Corporation Public Health Centre, Adambakkam; Risen Redeemers Church, Kodambakkam; ECI Church, Padikuppam Road, Anna Nagar; Annai Velankanni Church, Luz; St. Johns Catholic Church, Tondiarpet; Ebenezr School, Thirumullavoyal; St. Josephs School, 18th West Cross Street, M.K.B. Nagar; C.S.I Church, Dasarapuram, Thiruninravur; English Language Meeting, P.S. Higher Secondary School, R.K. Mutt road, Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}