{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The narrow steel bridge may be retained and not dismantled\n\nA view of the bridge across the Coleroon at Srirangam in Tiruchi on Sunday.— Photo: M. Srinath\n\nA new bridge across the Coleroon, resembling the Napier Bridge in Chennai with bowstring arches, was declared open for public use on Sunday.\n\nThe vital bridge connecting the island of Srirangam wedged between the Coleroon and Cauvery with the rest of the State on the northern side was declared open by Chief Minister Jayalalithaa through video conference from Chennai.\n\nIt was one of the important projects announced by the Chief Minister in the Assembly after being elected from the Srirangam constituency in 2011.\n\nThe State government decided to build a new bridge across the river to fulfil the long-pending demand of residents, and the Highways Department commenced construction work in November 2013.\n\nThe bridge would replace the British-built steel girder bridge, which has outlived its utility.\n\nThe narrow steel bridge of just 5.6 metres width was declared a weak structure in 2005. Since then only light vehicles were allowed to go through the bridge and heavy vehicles have to go via the bridge on Tiruchi-Chennai Bypass Road.\n\nMotorists travelling between Srirangam and the No.1 tollgate were often caught in traffic snarls on the bridge, running for over 800 metres, in peak hours.\n\nThe new bridge, built adjacent to the existing steel bridge built in 1928, would run for a length of 792 metres with 24 spans of 33 metres each. The bridge sports bowstring arches instead of the conventional parapet as the span length is as long as 33 meters. The bridge has been designed with four lanes with centre median.\n\nThe carriage ways are of 7.5 metres width on each side. Pedestrian foot paths of 1.5 metres width have been provided on each side. The new bridge, along with a minor bridge across the adjoining Ayyan Vaical, has been sanctioned at a cost of Rs. 75.47 crore.\n\nA traffic junction has been developed at No.1 Tollgate to facilitate smooth traffic flow towards Samayapuram, Lalgudi, Manachanallur and Tiruchi city.\n\nCollector K.S.Palanisamy, T. Rathinavel, P. Kumar and R.P. Marutharaja, MPs, A.Jaya, Mayor, M.Villalan, Superintending Engineer, T.Sathyamurthy, Divisional Engineer, Highways, and other officials were present at the site when the bridge was opened by the Chief Minister on Sunday.\n\nAccording to sources in the Highways Department, the steel bridge would be retained and not dismantled. There have been calls from conservationists to preserve the bridge as a heritage structure.", 
    "section": "national", 
    "title": "CM declares open Coleroon bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}