{
    "author": [
        "Mobile Numbers Of Officers Who Got Transferred Are Still Mentioned In The Contact List"
    ], 
    "text": "Towards the end of 2015 an instruction was sent to all the city and district police units across the state from the office of the Director General of Police to close down individual websites maintained by them. The order stated that the official website of the department www.tnpolice.gov.in or eservices.tnpolice.gov.in will be the only social medium of communication.\n\nPravesh Kumar, who served as the Deputy Commissioner of Police, here and who got transferred to Chennai as Deputy Commissioner for Kilpauk in the first week of May 2015, is still the Deputy Commissioner in Coimbatore, according to the police website.\n\nInterestingly, the names of the present Deputy Commissioners for law and order and traffic and their contact numbers are not available in the website.\n\nSimilarly, the mobile numbers of many inspectors who got transferred more than six months ago are still mentioned in the contact list.\n\nThe email address of the city Police Commissioner, the email address of the other police stations and officers are missing.\n\nThe change in nomenclature of the police stations (i.e., the numbers assigned to police stations for quick and easy identification) that came to effect about three months ago are yet to be updated.\n\nThe names and contact numbers Assistant Commissioners of Police (law and order) that earlier featured in the website have also been removed recently, for reasons not known.\n\nPolice officers here said that the website is maintained by a dedicated team based in Chennai. The public feel that the police should have a coordinator who updates the team in Chennai with vital information and to ensure that they are updated.\n\nWhile there is a dedicated page where people could at least find the names and landline numbers of police stations in Coimbatore city, a resident of Tirupur city, which has a Commissionerate, would be shocked to know that the contact details of that city have not found a place in the official police website.\n\nThe Commissionerate came into existence on September 15, 2013. According to police website, Tirupur Police Commissionerate is yet to come into being.\n\nWhereas the contact details of police officers and stations under the jurisdiction of Tirupur District are available in that website.\n\n(Reporting by\n\nM.K. Ananth)", 
    "section": "national", 
    "title": "Confusions galore in police website", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}