{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Swarga Foundation, in association with Coimbatore Corporation and SNS Institutions on Sunday organised a “Save a Drop Cyclothon’ at Singanallur Boat Club.\n\nThe ride began at 6 a.m. with more than 100 participants and the youngest participant was four years old. K Vijay Karthikeyan, Corporation Commissioner, took part in the cyclathon. Swarnalatha J, Managing Trustee of Swarga Foundation, and Balasubramanian, PRO of SNS Institutions, flagged off the ride.\n\nThe ride started from Singanallur Boat Club covering the tank bund area amidst the picturesque view of the lake.\n\nUpon completion of the ride, a puppet show was performed by members of Swarga Foundation to highlight the need for water conservation. The witty conversations of the puppeteers kept the children spellbound.\n\nDr. Karthikeyan stressed the need for judicious use of this precious resource.\n\nNine-year-old Naman Agarwal, an enthusiastic cyclist, said that he understood the importance of conserving water. Guruprasad, Trustee, said that lakes and wetlands need to be preserved for our wellbeing. “The essential resource for all life is fresh water. With rains playing truant or being erratic most of the time, it is highly important that each household conserves it. Every drop of water saved ensures that we are able to tide over the water crisis that hits us during summer. Hence, the title ‘Save A Drop’ for the cyclothon.” Our wetlands form a key part of the ecosystem and help in regulating the microclimate of the region. They Sewage has to be treated before it is allowed to flow to the wetlands to prevent waterborne diseases. Little Egret, Intermediate Egret, Large Egret, Grey Heron, Pond Heron, Black-crowned Night Heron, Purple Swamphen, Black-Winged Stilts, Open-billed Stork, Painted Stork, and Little Cormorant were a few of the wetland birds that were sighted during the ride, Ms. Swarnalatha added.", 
    "section": "national", 
    "title": "Cyclothon to spread awareness on need to conserve water", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}