{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The district administration, as per the orders of the Election Commission, will conduct an electoral roll purification drive from February 15 to 29.\n\nA release issued in this regard says that in continuation with the final publication of electoral roll, an updating exercise is under way.\n\nAs part of the updating exercise, repeat or multiple entries or EPIC numbers and entries of deceased voters will be removed from the roll.\n\nDe-duplication software\n\nA de-duplication software developed by the Commission will delete the repeat entries. But before that voter may come forward to disclose such repetition, the release says.\n\nThe administration will hold the exercise in the following places: Mettupalayam assembly constituency: Mettupalayam thasildar office and Mettupalayam Municipality. Sulur: thasildar’s office; Kavundampalayam and Coimbatore North: North thasildar office; Thondamuthur: Coimbatore South and Perur taluk offices; Kinathukadavu: Kinathukadavu, Madukkarai and Perur taluk offices; Coimbatore South: Central Zone office; Singanallur assembly constituency: East Zone office of the Corporation; Pollachi: Pollachi taluk office and Pollachi Municipality and for Valparai: Valparai thasildar office and Valparai Municipality. Alternatively, voters may furnish the details to the officials at the District Election Office by post or email (deocoimbatore2016@gmail.\n\ncom) or to the complaint cell on 0422 - 2303786.\n\nVerification\n\nA field level verification of the entries in the list of multiple, repeat entries identified by the de-duplication software will be carried on at the field level from February 15.\n\nThe officials will share the details with the booth level agents of recognised political parties and thereafter the proposed list for deletion will be placed before gram sabha meetings and in council meetings of local bodies.\n\nMeeting\n\nAs part of the exercise, the administration will also hold a meeting with political party representatives at the collectorate at 5.30 p.m. on February 15, the release adds.", 
    "section": "national", 
    "title": "Electoral roll purification drive from today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}