{
    "author": [
        "M K"
    ], 
    "text": "Sadham Hussain blowing balloon as part of his record attempt at the VOC Park in Coimbatore on Sunday. —Photo: M. Periasamy\n\nCheered by his relatives, friends and visitors at the VOC Park in Coimbatore, 21-year-old engineering graduate N. Sadham Hussain of Podanur blew 1,000 balloons in two hours, 26 minutes and 58 seconds, in a bid to enter the Golden Book of World Records and Limca book of Records.\n\nFour years ago it was not even his wildest dream that his part-time job of blowing balloons to support his education and family would one day bring him fame. Despite suffering from stammering since birth, the ECE graduate who still blows balloons for functions alongside hunting for a suitable job is determined to be an achiever.\n\nHe already entered Limca Book of Records twice by blowing balloons. On November 13, 2014, he blew 486 balloons in an hour. On October 13, last year, he and his friend Vasanth Kumar had blown 947 balloons in an hour.\n\nDue to poverty Sadham, his friend Vasanth (now a final year engineering student) and their elder brothers went for a part-time job for a caterer for Rs. 200 a day. “We made candies and distributed ice creams and beeda. We also dressed like cartoon characters and entertained the people,” he said.\n\nOn one such occasion, a balloon decorator at functions offered them a part-time job. “I had difficulty blowing balloons and assisted my employer who blew them. In second year, we started blowing balloons for him and also took up orders in our locality,” he said.\n\nThe two blew 500 to 1,500 small balloons a day at Rs. 4 a balloon and made arches and other decorative forms. “I was in third year in college in 2014 when a faculty who knew that I was doing this part-time job asked me to blow balloons for an event in the college,” he said.\n\nSeeing him very fast at it, his friends motivated him and asked him ‘why don’t you try creating a record?’ This was the spark behind his first successful record attempt at his college in 2014.\n\nDuring his record attempt on Sunday, he sat on a table below a shady tree and started blowing the balloons around 10.30 a.m. Each balloon should have a diameter not less than 20 cm. Proceedings of the record attempt was video recorded in the presence of two witnesses and will be sent to the record houses for approval.\n\n“It was good to see many new friends standing close to me and cheering me till I completed my record attempt,” Mr. Hussain said.", 
    "section": "national", 
    "title": "Engineering graduate blows 1,000 balloons in 147 minutes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}