{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan paying floral tribute to victims at the 18th serial bomb blasts remembrance in Coimbatore on Sunday.— Photo: S. Siva Saravanan.\n\nUnion Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan said that extremism and extremists had no religion. He was addressing party cadre at R.S. Puram on Sunday on the 18{+t}{+h}observance of the serial bomb blasts in Coimbatore, in 1998 that claimed more than 50 lives and left hundreds badly injured.\n\nHe also recalled the chain of events that took place on that day and paid a floral tribute to the victims.\n\nThe Minister said that the government at the Centre was dealing with extremism with an iron hand and that it would strive hard till it was wiped out of the country.\n\nMr. Radhakrishnan also said that terror attacks including the one on Parliament were remembered every year. “It is sad that the police deny permission to remember blasts victims in Coimbatore,” he said.\n\nHe added that a memorial should be set up for them and that the government should come forward to organise the remembrance annually.\n\nAlliance\n\nThe Minister told reporters said that the BJP would come out with a strong alliance in the coming Assembly elections and emerge successful.\n\nAnswering a query in a lighter moment, he blamed the media for spinning stories about alliance.\n\nArrested\n\nMeanwhile, the police removed 1,850 persons (including 52 women) - attached to the BJP, Indu Makkal Katchi - Tamilagam, Akhila Bharata Hanuman Sena, Siva Sena, Tamil Nadu Ramar Sena, Bharat Sena, Bharat Sena Tamil Nadu and Rashtriya Hindu Parishad - as they attempted to pay tribute to the blasts victims despite denial of permission for the same at R.S. Puram.\n\nAround 50 persons from Vishva Hindu Parishad offered ‘thithi’ (rites for the deceased) for the victims at Perur on Sunday.", 
    "section": "national", 
    "title": "‘Extremism and extremists have no religion’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}