{
    "author": [
        "M K"
    ], 
    "text": "Roopesh, his wife Shyna and three others allegedly forged SIM cards\n\nAs many as 20 new cases have been registered against Kerala-based Maoist leader Roopesh, his wife Shyna and three others by the Tamil Nadu Police over the last few days. The cases this time are for forging documents to buy SIM cards, which were said to be seized from them at the time of their arrest in May, 2015.\n\nThree such cases were registered on Saturday night. A senior ‘Q’ Branch officer said 43 SIM cards were seized from the couple and their three accomplices Anoop, Kannan and Veeramani at the time of their arrest during the search of their house in Tirupur.\n\nThey were booked under Unlawful Assemblies (Prevention) Act by the ‘Q’ Branch Police here and remanded. On July 18, they were detained under National Security Act. More cases were booked against them by the Kerala and Karnataka Police as well.\n\nOn Saturday, the Kottur police, based on a complaint from S. Dhanalakshmi (35), Avilchinnampalayam, registered a case against Shyna, for misusing documents of her husband to buy a SIM card. On a complaint from G. Velumani (36), T.Nalli Goundampalayam, Anup was booked by the Pollachi Taluk Police for misusing the complainant’s voter’s ID card to buy a SIM card.\n\nSimilarly, on a complaint from C. Panjalingam (47), of R.Ponnavaram, the Pollachi Taluk Police registered a case against Roopesh for misusing Panjalingam’s ration card to buy a SIM card.\n\nThe trio was booked under sections 419 (punishment for cheating by personation), 420 (cheating and dishonestly inducing delivery of property), 468 (forgery for the purpose of cheating) and 471 (using as genuine a forged document or an electronic record) of the Indian Penal Code (IPC).\n\nShyna has also been booked under section 469 (Forgery for purpose of harming reputation) of the IPC.\n\nThe complainants told The Hindu that they came to know about the misuse of their documents when the police inquired them and informed them about it a few months ago.\n\nThey forged documents to procure SIM cards", 
    "section": "national", 
    "title": "Forgery case against Maoists", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}