{
    "author": [
        "Special Correspondent"
    ], 
    "text": "As many as 68 lakh saplings will be planted before the end of the year\n\nChief Minister Jayalalithaa inaugurates the massive tree planting programme on the Greater Chennai Police Commissioner Office premises in Chennai on Sunday.-Photo: R. Ragu\n\nChief Minister Jayalalithaa launched a massive tree plantation drive by planting a banyan sapling on the Chennai Police Commissioner’s office campus here on Sunday.\n\nAn official release said as part of Ms. Jayalalithaa’s 68th birthday celebrations, 68 lakh saplings would to be planted under the ‘Massive Tree Planting Programme’ across the State before the end of this year.\n\nThe trees would be planted in forest areas, schools, colleges, government and private office campuses, alongside roads, parks and maintained.\n\nSpecies to be planted\n\nBanyan (Ficus benghalensis), iluppai (Madhuca longifolia), punnai (Calophyllum inophyllum), mandharai (Bauhinia purpurea), pungan (Millettia pinnata), magizham (Mimusops elengi), poovarasan (Thespesia populnea) and vembu (Azadirachta indica) are some of the saplings that would be planted. An official release stated that 64 lakh, 65 lakh, 66 lakh and 67 lakh saplings were planted during 2012, 2013, 2014 and last year respectively.\n\nAddressing the gathering at the event, Forests and Environment Secretary Hans Raj Verma said as a result of the massive tree plantation programme, the forest cover in the State had increased considerably.\n\nIncrease in forest cover\n\nAs per the latest report of the Forest Survey of India (FSI), the forest cover in Tamil Nadu increased by 2,500 sq.km, the highest rate of growth in the country.\n\n“So far over 2.62 crore saplings were planted and this year 68 lakh saplings would be planted at a cost of Rs. 61.68 crore,” he said.\n\nForest Minister M.S.M. Anandhan, Environment Minister Thoppu N.D. Venkatachalam, Chief Secretary K. Gnanadesikan, advisor to government Sheela Balakrishnan, Home Secretary Apurva Varma, Director-General of Police Ashok Kumar, Chennai Police Commissioner T.K. Rajendran, Principal Chief Conservator of Forests N. Krishnakumar were present during the function.", 
    "section": "national", 
    "title": "Green cover in TN to get fillip", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}