{
    "author": [], 
    "text": "Hundreds of children and college students in Kannagi Nagar danced as part of ‘One Billion Rising’ campaign\n\nOn a day when Valentine’s Day seemed to be on the minds of many people, some others decided to shift their focus on the need to fight violence against women. Hundreds of children and college students in Kannagi Nagar formed a human chain and danced as part of the ‘One Billion Rising’ campaign here on Sunday.\n\nK.R. Renuka of Centre for Women’s Development and Research said they focussed on Kannagi Nagar this time as hundreds of evicted families lived here and several women and children faced some form of violence on a daily basis. “During the campaign, we noticed that men were curious to know about what was happening and why we were doing it. That, at least, is a start for some people. We realised this area had many who faced violence in some form or other, especially children,” she said.\n\nOnce during a workshop for 30 children, Ms. Renuka said she was shocked to find that about 18 of them had been sexually assaulted at homes. “We think home is a secure place, but even there children are not spared,” she says.\n\nAfter years of dealing with these issues, they decided a year and half ago on raising awareness among men about this issue. “Women in several households began to find a difference in them after the workshop. Perhaps, that’s the need of the hour now,” she added.\n\nUsing technology to fight child abuse\n\nIn a move to combat child abuse across the State, activists have designed a new android application that will provide users a platform to report on such cases they come across. The application, named Child Rights Monitor (CRM), will have around ten different icons, each giving a brief explanation about the different Acts to protect child rights, such as Juvenile Justice Act, Child Labour(Prohibition and Regulation) Act, Prohibition of Child Marriage Act, Right To Education and Protection of Children from Sexual Offences Act. It will also have a provision to directly connect to the 1098 Childline service, child welfare committee, Labour Department and also the District Child Protection Officer. “All they need to do is click on the icon and they will get the contact details of all of them,” says Cyril Alexander of Mary Anne Charity Trust, an NGO that designed the software.\n\nThe application will be launched on Tuesday, after which the software will be available for free download at Playstore. The initiative is supported by the UNICEF. “The issue these days is lack of knowledge. When a person witnesses any crime against children, he does not know where to go even if he wants to complain. This application will provide all the knowledge and resources,” says Job Zachariah, Chief of UNICEF, Tamil Nadu and Kerala.\n\n“We have also been working on launching the second version of CRM, which should be out by this year-end,” says Mr. Cyril.\n\n(Reporting by Sunitha Sekar and Aditi R.)", 
    "section": "national", 
    "title": "Highlighting violence against women", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}