{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "The Indian Medical Association has decided to hold awareness programmes about the health consequences of noise pollution among public and students.\n\nAgainst the backdrop of India being the noisiest place in the world due to noise pollution generated by the vehicular traffic, unnecessary use of air horns, sound generated by industries (powerlooms, spinning mills and foundries), crackers, loud speakers, and excessive use of mobile phones, walkman, ear phone and other such gadgets, the IMA would sensitise the public to the dangers caused not only to ears but also the entire body due to noise above 80 decibels.\n\nExcessive noise increases heart rate, blood pressure and leads to endocrinal changes, C.N. Raja, Secretary IMA - Nursing Home Board, told The Hindu .\n\nNoise at night causes sleep disturbances, especially for elders and young ones. Hearing sound above permissible level produces personality changes, affecting human productivity and also increases the formation of free radicals in the human body. All these are proved by various scientific studies, Dr. Raja said, calling for implementation of rules and regulations and restrictions against noise pollution during the conduct of political meetings and festivals.\n\nEarlier this month, the IMA formed a Working Group to fight against noise pollution and decided to have its sitting at New Delhi shortly.\n\nThe Working Group was formed along with the Association of Otolaryngologists of India (AOI) during the National Initiative for Safe Sound Leadership Meet and Workshop at Chennai recently.\n\nAt the meeting chaired by A. Marthanda Pillai, Immediate Past National President of IMA, the first-ever collective attempt to fight noise pollution was formed with K.A. Seethi, Past President of AOI, Kerala as the Chairman, John Panicker, Past President of AOI – Kerala as Coordinator, and Dr. Raja, Past President of AOI – Tamil Nadu and Past State Secretary of IMA as Convenor.\n\nProminent personalities in the group include Padmasri Mohan Kameswaran; Padmasri Santosh Kakkar, Former Director of AIIMS; Yeshwant Oke and Sujata Rao of Mumbai; Ajay Lekhe – President of IMA – Delhi; and Social Activist Sumaira Abdulali, Convenor, Awaaz Foundation, Mumbai.\n\nThe meeting adopted resolutions calling for correction of noise to safe level at industries and residential areas; evolving corrective plans to wean away youngsters from abnormal use of electronic gadgets and loud music using devices that pose threat to human ears and affect cognitive activities of brain; seeking a government policy on safe noise level in future for implementation by industries and other institutions; and implementation of the same in metropolitan and other major cities.", 
    "section": "national", 
    "title": "IMA to create awareness on effects of noise pollution", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}