{
    "author": [
        "Dennis S"
    ], 
    "text": "The judges of the Madras High Court seem to have had enough of the non-compliant ways of Corporation of Chennai officials while dealing with civic issues. Tired of supervising these officials’ actions, the judges have virtually given up on them, evident in their recent order on a petition.\n\nThe First Bench comprising Chief Justice S.K. Kaul and Justice M.M. Sundresh expressed their frustration elaborately in the order delivered on a plea by S. Asad of Thayar Sahib Street.\n\n“One more case of municipal chaos! We wonder at times as to how much of municipal governance supervision, which we are called upon to do, when the authorities concerned do not act despite representations and even if some action is taken, conveniently the original position comes back in a couple of days,” the judges said.\n\nThe petitioner had sought directions for action against traffic violations by lorries removing garbage and to remove a garden garbage shed and encroachments on Thayar Sahib Street on Anna Salai, by making way for footpath for pedestrians.\n\n“We do not propose to guide the police and the Corporation as to how they have to perform their duties, as that is their job. It is for them to see that there are proper arrangements,” the Bench said and granted 15 days time to the authorities to remedy the position and to continue to monitor the situation.\n\nThe judges directed authorities to file a compliance report on the steps taken on the complaint and measures being taken to ensure that the situation is maintained.\n\nThe officer concerned should also look into as to why no remedial measures were taken on the various representations of the petitioner and to fix the responsibility. The matter has been posted for April 1.\n\nCorporation given 15 days time to remedy the situation", 
    "section": "national", 
    "title": "Judges express helplessness over municipal chaos", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}