{
    "author": [], 
    "text": "The 25th annual sports meet of S.E.V. Matriculation Higher Secondary School, Madurai. (Right) Students at the annual sports meetof Sri Aurobindo Mira Matriculation Higher Secondary School.\n\nA lecture programme on ‘solar energy’ was conducted at Vivekananda College, Tiruvedakam West, on January 28. R. V. Jeba Rajasekar of Government Arts College, Melur, explained the major components of solar materials and highlighted the advantages and disadvantages of different methods of tapping solar energy. K. Uma Maheswari of V. V. V. College for Women, Virudhunagar, explained the fundamental properties of nanostructured materials. Swami Niyamananda, secretary, inaugurated the programme. The Principal (in charge), M. Ganesan, delivered the presidential address. P. Jeyasankar, Head, Department of Physics, welcomed the gathering and S. Ganeshan, Assistant Professor, proposed a vote of thanks.\n\nWorkshop organised\n\nThe Department of Youth Welfare of Saraswathi Narayanan College, Madurai, organised a workshop on drug abuse in which J. Dhanraj, Intelligence Officer, Narcotic Control Bureau, explained the ill-effects of drug abuse. He advised the youth to keep away from all kinds of drugs and alcohol. M. Kannan, Principal, presided over the workshop. K. Jeyakodi, Coordinator of the forum, welcomed the participants. D. Muneesvaran, NSS Programme Officer, proposed a vote of thanks.\n\nMeet on cancer\n\nThe Department of Zoology of Yadava College, Madurai, organised a lecture on cancer by P. Saravanan, Chairman, Saravana Multispecialty Hospital, on February 2. Dr. Saravanan explained the causes, symptoms and impact of cancer and its treatment in his lecture. K. Neethirajan welcomed the gathering and Principal S. Dhanasekaran, presided over the meeting.\n\nInter-collegiate meet\n\nThe Department of Computer Science of N.M.S.S. Vellaichamy Nadar College, Madurai, organised an inter-collegiate meet, LOGIX 2016 on February 3, featuring competitions in software development, debugging, paper presentation, quiz, Rangoli and dance.\n\nOne hundred and eighty two students from 15 colleges in and around Madurai participated in the event.\n\nPrincipal S. Alagarnathan presided over the inaugural session.\n\nP. Amutharani, Head (in charge), Department of Computer Science, welcomed the gathering. V. Thilagarajan, Director, offered felicitations. Dr. Alagarnathan distributed prizes to the winners in the valedictory session.\n\nThe overall shield was won by the Department of Information Technology, Ayya Nadar Janaki Ammal College, Sivakasi. K. Suganthi proposed a vote of thanks.\n\nBlood donated\n\nNSS units of E.M. Gopalakrishna Kone Yadava Women’s College and Lions’ Club Madurai jointly organised a blood donation camp on February 2.\n\nStudents and staff members donated 45 units of blood at the camp, which was inaugurated by E.M.G.S. Indirani, secretary.\n\nDengue awareness\n\nDepartments of Commerce and English and Red Ribbon Club of N.M.S. Sermathai Vasan College for Women, Madurai, conducted a dengue awareness programme at Samanatham on January 29. P. Pandi, Medical Officer, Primary Health Centre, Tirupparankundram, and P. Thangasamy, Supervisor, spoke about preventive measures against dengue. Students distributed Nilavembu kudineer and dengue awareness pamphlets to villagers. Principal D. Karthiga Rani presided over the awareness programme. Head, Department of English, K.P. Bakhya Seema welcomed the gathering. S. Hemalatha, Assistant Professor, proposed a vote of thanks.\n\nVoter’s Day celebrated\n\nC.S.I. Jeyaraj Annapackiam College of Nursing and Allied Sciences, Madurai, celebrated National Voter’s Day on January 25, highlighting the need to make universal adult franchise a complete reality and thereby enhance the quality of Indian democracy. C. Jothi Sophia, Principal, presided over the event. D. Edwin Rajakumar explained the importance of democracy, secularism, republic and socialism. Y. John Sam Arum Prabu, Head, Department of Community Health Nursing, welcomed the gathering.\n\nThe students were administered a pledge to uphold democratic traditions on the occasion.\n\nThere was also a discussion on democratic election and role of citizens in conducting peaceful elections. Merlin Jeyapal, Vice-Principal, proposed a vote of thanks.\n\nAnnual Day\n\nThe 121{+s}{+t}Annual Day of Southern Railway Mixed Higher Secondary School, Madurai, was celebrated on February 3, with Sunil Kumar Garg, Divisional Railway Manager, as the chief guest. R.V.B. Babu, Additional Divisional Railway Manager, presided over the function. Prizes and endowment awards for academic brilliance and extra-curricular activities were distributed by Mr. Garg, Mr. Babu, Kavita Garg, president, Vandana Babu, vice-president, and Geetha Sahoo of Southern Railway Women’s Welfare Organisation.\n\nPrizes were awarded to toppers in public examinations, R. Shanmuga Nambu Rajan and G. Kavya.\n\nS. Ramya was honoured as the best sportsperson.\n\nP. Rajesh Pon Kumar, Headmaster, welcomed the gathering. D. Kiruba Latha, teacher, presented the annual report. R. Kannan, Divisional Personnel Officer, proposed a vote of thanks.\n\nThe celebration ended with a cultural programme presented by students.\n\nCamp organised\n\nThe NSS unit of SBOA Matriculation School, Madurai, conducted a seven-day camp at Melakuyikudi village from January 27 in which 25 volunteers participated.\n\nThe camp was inaugurated by Principal S. Seethalakshmi. Activities of students included AIDS, anti-tobacco and drug addiction awareness rally, a sports meet and planting of saplings.\n\nA free medical camp was also conducted for the villagers. B. Jayanthi delivered a talk on the importance of first aid, C. Napoleon on yoga and S. Balakrishnan on mental health.\n\nAnnual sports meet\n\nThe 25th annual sports meet of S.E.V. Matriculation Higher Secondary School, Madurai, was declared open by Bandi Gangadhar, Deputy Commissioner of Police, on January 30.\n\nYoga, karate and silambam performances were presented by students.\n\nThis was followed by a human pyramid and mass drill.\n\nPrizes were distributed by Mr. Gangadhar to the winners of various events.\n\nII\n\nThe annual sports meet of Sri Aurobindo Mira Matriculation Higher Secondary School, Madurai, was declared open by K. Devaki, Director, Devaki Speciality Hospital, on January 30. Students presented a colourful march past on the occasion.\n\nThe Principal, Meenakumari, welcomed the gathering.\n\nM. C. Abilash, Director, presented the annual sports report. Students performed classical dance, aerobics, karate, yoga and silambam.\n\nAngelin Precilla proposed a vote of thanks.", 
    "section": "national", 
    "title": "Lecture delivered", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}