{
    "author": [
        "Special Correspondent"
    ], 
    "text": ": In the next 15 years the burden of Alzheimer’s disease is expected to double in India, with an estimated 70 lakh people being diagnosed with it. Currently around 35 lakh people have the disease, which is around 11 per cent of the total population in the world which suffers from it.\n\nWhile the disease burden is worrisome, Ronald C. Petersen, Cora Kanow Professor of Alzheimer’s disease Research, Mayo Clinic College of Medicine, Rochester, who delivered the 36th T.S. Srinivasan Endowment Oration on Sunday, said in India the condition could still be modified as more people here suffer from vascular dementia. With better clinical diagnosis the progression of the disease could be checked, he said.\n\nLifestyle modifications, including moderate exercise of 150 minutes per week had shown to improve cognitive function, Dr. Petersen said. “Ageing need not be a passive process. We can forestall cognitive dysfunction,” he explained. Staying intellectually active, being involved in social work would prevent ageing of the brain, he said.\n\nDr. Petersen, who spoke on ‘The Forgetful Brain’, said based on brain function ageing could be classified as successful, one with mild cognitive impairment or dementia. Though people could forget names of people of places doctors would watch out for markers that could indicate otherwise.\n\nStudies of brain scans had shown how the brain cells decay and die. “We now know that Alzheimer’s disease is defined by plaques and tangles in the brain. We are now able to determine whether people are predestined to develop Alzheimer’s disease much earlier in life as we pick up patterns and signals of plaques and tangles through techniques such as imaging, CAT scans and spinal taps,” Prof. Petersen said.\n\nHe narrated the case history of two of his patients, one who was diagnosed with the disease despite no family history and another older patient, who suffered from other conditions leading to mild cognitive impairment.\n\nTimely and accurate diagnosis not only helps doctors manage the symptoms but also slows the decline of memory and other cognitive impairments. Risk factors such as obesity, smoking, high blood pressure and diabetes should be controlled between the ages of 40 and 50 years rather than wait for the onset of the disease.\n\nVenu Srinivasan, chairman of TVS Motor Company, said neurologist E.S. Srinivasan was the architect of the programme. He said the memorandum signed with the National Institute of Mental Health and Neuro Sciences was only a minimum support but he hoped to take it forward.\n\nNIMHANS director B.N. Gangadhar and senior professor P. Satishchandra spoke.", 
    "section": "national", 
    "title": "Lifestyle modifications could prevent vascular dementia", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}