{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple : Karthiga puja, Railway Colony, 5 p.m.\n\nPanniru Tirumurai Mandram : Discourse on ‘Sivagnana Botham’ by N.S. Sundararaman, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nBharathi Yuva Kendra Trust : Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSri Swami Tatwananda Ashram : Gita class by Swami Samanandar, Ayiram Vysyar Primary School, South Avani Moola Street, 9.30 a.m.\n\nTiruvalluvar Mandram : Discourse on ‘Kanthapuranam’ by A. Arumugam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre : Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya : Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nN.M.S. Sermathai Vasan College for Women : Faculty development programme, Conference Hall, 3:45 p.m.\n\nThiagarajar College of Preceptors : Five-day citizenship training camp, Talk on Consumer Awareness by S.V. Pathy, general secretary, Consumer Rights Organisation, 10 a.m.\n\nMadurai Productivity Council : Productivity Week celebration; discussion on “Customer satisfaction is prime concern for higher productivity and sustainable growth in service industry,” G. Manickam, legal and management consultant, chief guest, S. Gurushankar, vice-chairman, Meenakshi Mission Hospital and Research Centre, guest of honour, Conference Hall, MMHRC, 3.30 p.m.\n\nAlcoholics Anonymous : Meeting, Holy Redeemers Church, near Periyar bus stand, 7 a.m.; Quality Care Hospital, Ellis Nagar, 7 p.m.; A.G. Church, Gomathipuram, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today for 15 Feb Monday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}