{
    "author": [], 
    "text": "Tourists clicking a selfie with Chief Minister N. Rangasamy at the Kashmir cultural festival at Gandhi Thidal in Puducherry on Saturday —Photo: T. Singaravelou\n\nPuducherry administration effects transfers of officials inview of the forthcoming Assembly polls\n\nIt was a surprise for many when the government transferred officials who have not completed three years.\n\nThe Puducherry administration has effected mass transfers of officials in view of the forthcoming Assembly elections.\n\nPuducherry and Karaikal District Collectors were transferred. Puducherry District Collector D. Manikandan was transferred posted as Secretary Information Technology, Economics and Statistics while Karaikal Collector E. Vallavan was transferred and posted as Labour Commissioner.\n\nDr. Sundaravadivelu was posted as Puducherry District Collector and Higher Education Director T. Karikalan as Karaikal District Collector.\n\nHowever, the transfer of Puducherry Collector is attracting some attention. A public interest litigation has been filed in the Madras High Court questioning the transfers, including that of Mr. Manikandan. While sources in the Secretariat justified the Collector’s transfer, claiming that this followed a complaint against him to the Chief Secretary who is the cadre control authority. Moreover, the officer was not performing his duties in sync with the Election Commission. The sources added that all those things led to his transfer.\n\nPeople’s Chief Minister\n\nThe accessible nature of Chief Minister N. Rangasamy is a source of delight for not only the residents of Puducherry but tourists as well.\n\nA few months ago, youth who turned up at his house on Vazhudavur Road in Thattanchavadi, when he celebrated his 65th birthday, not only got to share a few moments with him, but also took a few selfies on their smartphones with the man who is called ‘Makkal Muthalvar,’ or People’s Chief Minister.\n\nOn Saturday too, his popularity was abundantly in evidence at the ‘Jashm-e-Kashmir’ cultural festival organised by the Department of Art and Culture at Gandhi Thidal on Sunday.\n\nA few of the tourists at the venue were seen taking a selfie with Mr. Rangasamy.\n\nMr. Rangasamy had no security personnel around him and made himself available posing for photos for the tourists and members of the dance troupes from Kashmir.\n\nOrganising events\n\nin a haste\n\nIn Puducherry, it is an accepted norm for people and journalists to wait long hours for the Ministers to arrive and inaugurate a programme. This is in contrast to the haste with which the government organises events to launch more and more projects.\n\nEven before a houseboat was ready for public use, the Tourism Department seemed to have organised its launch in a hurry.\n\nChief Minister N. Rangasamy arrived about two and half hours behind schedule to flag off the houseboat. No sooner had he finished the formalities and left, the crowds that had gathered saw that the houseboat could hardly sail some distance and had to be pulled back with ropes. Many works, including the setting up of a kitchen in the lower deck, were still pending, it later transpired. The organisers said it would take at least a week to complete the work for the tourists to start using the houseboat.\n\n(Reporting by S. Prasad,\n\nR. Sivaraman and S. Senthalir)", 
    "section": "national", 
    "title": "Mass transfers take many bureaucrats by surprise", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}