{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Drinking water ranging between 2.73 crore litres and 3.64 crore litres is going waste due to leakages in distribution system in Salem city every day, according to a recent survey taken by a non-government organisation.\n\nSurvey report\n\nThe Salem Corporation is supplying about 9.12 crore litres of drinking water to the residents of the city every day, of which about 30 to 40 per cent of water is going waste due to leakages in distribution system, according to a report of the Zero Social Welfare Trust.\n\nThe report titled ‘Every Drop Counts’ was released by Corporation Commissioner K. R. Selvaraj at a meeting held on Friday. The first copy was received by G. Kamaraj, Executive Engineer of the Corporation.\n\nMembers of the trust were involved in various social and environmental projects including lake rejuvenation, tree plantation, awareness programmes etc. Special teams of the Trust surveyed about 75 tanks, of the 2,077 tanks, across the four zones of the Corporation and identified various types of water leakages. Of the 110 taps that were surveyed, 91 were either leaky or broken.\n\nLeaky taps\n\nThe surveyors have also recorded that a majority of the taps installed under the ‘mini pump scheme’ were either leaky or broken; several tanks installed under this scheme were not functional and a few of them have also become dumping spots.\n\nThe main reason for the leakages in taps was poor quality of PVC ball valves used. In places where brass ball valves were used, there were issues concerning its theft.\n\nThe report said only a small part of the drinking water leakages could be measured because most of the drinking water pipelines were underground and only those leakages visible on the ground could be detected.\n\nMany leaks were observed in newly-laid roads. Valve leaks were detected in most of the junctions.\n\nContinuous leakages of water on roads resulted in the damage of the roads. At several places, due to leakages on road, it was observed that there were high possibilities of sewage mixing with drinking water .\n\nFinancial loss\n\nThe financial implications of these leakages result in an estimated loss ranging between Rs. 4.49 crore to Rs. 5.99 crore per annum.\n\nThe report suggested replacement of all leaky taps and periodic maintenance of all tanks.\n\nScientific study\n\nThe report also favoured a detailed scientific study to be carried out by the government to monitor the leak and take steps to reduce it.", 
    "section": "national", 
    "title": "‘More than 3 crore litres of water goes waste every day in Salem city’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}