{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "India's ace F-1 driver Narain Karthikeyan and former national rally and race driver Arjun Balu enjoying their moment while trying the GT On-Road RC car at the GEDEE Driving Institute in Eachnari, Coimbatore, on Saturday.\n\nIndia’s ace F-1 driver Narain Karthikeyan came in early to the GEDEE Driving Institute in Eachanari to get a feel of the GT On-Road Radio Controlled (RC) car before inaugurating the first of its kind race in this part of the region here on Saturday.\n\nJointly organised by the Coimbatore Radio Controllers Association and the Kovai Modellers Club, this two-day event has attracted a sizeable number of entries.\n\n“This form of racing is popular in Japan. I have never had my hands on a RC car but I must say this sport gives a lot of insight to budding engineers,” said Narain.\n\nHe was happy with the newly-laid On-Road RC car facility at the institute. “I did not expect such a nice one. Everything is proper here. It is my kind of tarmac too. So, I am really interested to see what happens.”\n\nHandling the RC car was not an easy task for Narain. He took some time to understand it. “After watching it for a few minutes, I can say it is not going to be easy. One needs lots of practise,” he said.\n\n“You may also get a bit disoriented standing in one place and handling the race situation,” he added.\n\nHe said these cars are really sharp. “It is so sensitive. The sensitivity and the agility are so different than the other cars. But, I will to stick to my car,” he quickly added\n\nNarain tested the mini RC wonders time and again. He was not the quickest as he normally is on his car, but he enjoyed every moment of it. And, his smile said it all.\n\nThe racing was good and there was lots of fun but the ‘wow’ factor was missing as the sport is yet to catch popularity like in the west.\n\nG.D. Rajkumar, the brain behind the project, said the sport is very useful but the parents are not willing to spend for their children.\n\n“They buy I-pads and smart phones instead they can get an on-road GT kit or an off-road buggy for them. It can help them understand the sport better.”\n\nFormer national race and rally driver Arjun Balu said he had tried this many years ago. “It is very different to actual racing. This form of sport has got all the mechanicals in place. They are fast and precise as well but there is no regular racing. The big question mark is the affordability.", 
    "section": "national", 
    "title": "Narain tries his hand on GT On-Road RC car", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}