{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Having ensured visible improvements in the water bodies and outlook of Government Headquarters Hospital, Railway Junction and other landmarks during the last couple of years, Olirum Erodu Foundation has devised a plan of action to further intensify the beautification initiatives involving its contribution to the tune of Rs. 1.5 crore.\n\nDuring this year, the OEF intends to deslit and clean up Chinthan Kuttai and give it a makeover with walk paths and lawns, similar to the transformation of Sadayampalayam tank. The aquifer, according to OEF Chairman M. Chinnasamy, will be recharged in the process.\n\nThe OEF also has plans to take up maintenance of Sadayampalayam tank with the City Corporation's concurrence, and has sought the permission of Public Works Department to beautify Perumpallam Anicut with walk paths. The Foundation has already forwarded a suggestion to the authorities for construction of a Check Dam across the canal at Nalliyampalayam.\n\nThe Foundation has evinced interest in reviving utility of the water treatment unit at Pitchakaranpallam Odai with government support. By this year-end, the OEF looks forward to construction of traffic island at the GH Junction and plant saplings along an 8-km stretch of the ring road traversing through the city limits.\n\nSo far, the OEF has spent Rs. 25 lakh for cleaning the water bodies, including the 18-km Perumpallam irrigation canal passing through Kasipalayam, 46 Pudur, Lakhapuram, Muthukavundanpalayam, and Nanjai Uthukuli villages. The canal that has an ayacut of 2,550 acres, and enables irrigation in another 1,500 acres owing to enhancement in groundwater level had gone defunct since no desilting had been undertaken for the last 25 years. According to OEF functionaries, the increase in water table will be of help to one lakh people.\n\nOEF has already provided Rs. 7 lakh to organisations such as Erodai for remediation of Pitchakaranpallam and Sunnambu Odais, and intends to provide Rs. 8 lakh more for the purpose.\n\nThe OEF has already spent Rs. 60 lakh for sprucing up the external appearance of the Government Headquarters Hospital and strengthening the capacity of the dialysis and endoscopy unit. Teaming up with JCI Green City, the OEF has planted 5,500 saplings and has plans to plant 10,000 more saplings during the year.", 
    "section": "national", 
    "title": "Olirum Erodu Foundation to intensify its welfare activities", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}