{
    "author": [
        "Aditi R"
    ], 
    "text": "Volunteers clean up bus terminus in Tambaram while others replace grime on a wall with paintings\n\nWalls in public places, foot overbridges, pavements and bus stops in the city are all getting a facelift, thanks to generous doses of help from volunteers. On Sunday, a group of such volunteers woke up well ahead of dawn and assembled at Tambaram, where they took part in a massive cleanup of the bus terminus.\n\nAbout 30 volunteers from The Crew, a not-for-profit organisation, reached the bus stop with brooms, buckets and disinfectants to clean up a 150-metre stretch which was very dirty. “The entire platform was piled up with dust and gravel. It seemed like it had been left unused for many days,” said Joshua Daniel, environmental head of the organisation.\n\nThe cleanup was held as part of their ‘I Love Chennai campaign,’ a spot-cleaning initiative.\n\nThe volunteers used large quantities of water, brought in a tanker, to clean the spot first.\n\n“We have seen and heard about this bus stop from many people who claimed that despite several complaints, very little was done to improve its condition. So, we decided to take this up on our own,” said Mr. Joshua, who along with other members, have taken part in similar campaigns in bus stops, subways in Pallavaram and other places.\n\nFinally, after around three hours of hard labour, the volunteers left the spot after making it bright and clean. In a similar move, to spruce up surroundings in Tambaram, volunteers from Paintbox have started painting a wall along Madras Export Processing Zone – Special Economic Zone. “We started the work two weeks ago and are yet to finish,” said Namrata Ratnam, founder of Paintbox, who along with her team will be removing grime from the wall and replacing it with graffiti and colourful artwork. “We will be painting a story on the theme of environment preservation. The municipality is also helping us in completing the project,” she said.\n\nOfficials at Tambaram Municipality too claimed that they have been doing all that they can to keep the surroundings clean.\n\n“The issue is no matter how much we do, it remains poorly maintained. We are doing our best and we expect cooperation from the public too,” the official said.", 
    "section": "national", 
    "title": "On Valentine’s Day, a labour of love", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}