{
    "author": [
        "L Renganathan"
    ], 
    "text": "The Mahamaham resembled the Maha Kumbh Mela of Allahabad where lakhs of devotees take a holy dipin the sacred water.\n\nlders relished their yet another visit to the Mahamaham tank, the children frolicked in the water front and most of the parents waived the customary chiding while playing in muddled water that had turned red after being pounded by more than a lakh pair of feet on Sunday.\n\nSelfie clamour engulfed devotees too as they froze a frame of themselves for eternity in the middle of their bath at the tank. Devotees found even the muddy water sanctified as those who could not go near the sacred wells in the tank satisfied themselves by pouring tank water from near the wells on themselves.\n\nThere was trouble for devotees early in the morning as the gates remained shut till 6 a.m. even as the restive crowd demanded access to the tank. They were in a hurry to complete the bath at sunrise on the Ratha Sapthami day but the police would not let them have that.\n\nHowever, the authorities learnt that it would be prudent to throw open the tank round-the-clock for devotees to take bath and went ahead with their plan.\n\nIt was a good sight to see many police personnel, youngsters in particular, helping the devotees by pouring sacred well water on them, aiding the elderly in ascending the flight of stairs and guiding the outstation devotees to the tank area.\n\nThere was a marked orderliness in crowd movement and though there was a steady flow of devotees into the tank and out of it throughout the day, there was hardly any rush or hard pushing around anywhere in the tank vicinity as also near the Portramarai tank or the Chakra Padithurai.\n\nBJP MP Tarun Vijay visited Mahamaham tank on Sunday and took part in the rituals by sprinkling water from the tank on himself. Speaking after inspecting the pilgrims flow, Mr. Tarun Vijay said that the Mahamaham resembled the Maha Kumbh Mela of Allahabad where lakhs of devotees take a holy dip in the sacred water. Noting that it was heartening to see thousands of devotees thronging the Mahamaham tank , he expressed the hope that many more thousands from the north would attend the Mahamaham rituals in future.\n\nEfforts would be made to get Kumbakonam designated as National Pilgrimage Centre by the Centre, allocate adequate funds for its overall development and ensure that they were spent usefully, Mr. Tarun Vijay said.\n\nThe Mahamaham resembled the Maha Kumbh Mela of Allahabad where lakhs of devotees take a holy dip\n\nin the sacred water.", 
    "section": "national", 
    "title": "Orderliness in crowd movement", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}