{
    "author": [], 
    "text": "Road Maintenance\n\nThe roads from Vriddhachalam to Neyveli and Vriddhachalam to Kammapuram are badly damaged.\n\nIn fact, the roads are in such bad shape that they cannot be termed as asphalted roads and are just mud tracts. Hundreds of heavy commercial, agricultural vehicles and buses use them.\n\nThe bad condition of the road is a cause for frequent breakdown of vehicles and accidents.\n\nIn the past four years no repairs have been carried out on these roads. Both the roads have been taken over by the National Highway Authority of India (NHAI) as a part of Vriddhachalam to Cuddalore and Chidambaram to Salem highway projects. Huge sums have been allotted to widen and relay the roads. However, the work is moving at a snail’s pace due to issues related to land acquisition, widening of existing bridges, removal of roadside trees, shifting of electrical poles, etc. The completion of the projects may even take two to three years.\n\nMeanwhile, to address the difficulties of the road users, NHAI should urgently relay the roads from Vriddhachalam to Neyveli and Vriddhachalam to Kammapuram.\n\nP.Ezhilarasu\n\nVriddhachalam\n\nTrains for Puducherry\n\nPuducherry city has developed in terms of trade and tourism.\n\nBut the train services are inadequate. The railway budget is to be tabled in Parliament on February 25. In this connection, I place the following suggestions for the attention of R. Radhakrishnan, MP, from Puducherry.\n\nThe Circar Express which runs from Kakinada to Chennai Egmore should be extended to Puducherry. Secondly, a weekly superfast express should be introduced between Puducherry and Hyderabad, two long distance trains which presently runs connecting Villupuram with Purulia and Kharakpur as weekly and biweekly should be extended to Puducherry.\n\nThere should be a stop at Samarkot station which is nearest to Yanam, an enclave of Puducherry in Andhra Pradesh for the present Puducherry-Howrah weekly train.\n\nMahaboob Alikhan\n\nRainbow Nagar, Puducherry\n\nMention blood group in driving licence\n\nThe Puducherry government issues driving licence and renews it for drivers of various vehicles as per the Government of India guidelines mentioned in Rule 16 (2) of Form 7.\n\nBut accidents occur, the victims are generally rushed to the nearby hospitals.\n\nBut the hospitals spend more time during the golden hours to analyse the blood group of the donors and the recipients.\n\nThere are cases where the condition of the patients worsens due to delay in treatment.\n\nThe Puducherry government is particular that applicants should furnish a medical certificate from Competent Authority for fitness.\n\nThe doctors too issue a fitness certificate in the form prescribed by the Central Government.\n\nBut the blood group along with Rh factor is not mentioned. This results in delayed treatment in many accident cases.\n\nThe Government of Puducherry should therefore instruct the Licence Issuing Authority to make it mandatory to mention the blood group and its Rh factor to save the people during golden hours.\n\nV. Ramalingam\n\nThattanchavady Post, Puducherry\n\nReaders can send their mails to pondy.thehindu@\n\ngmail.com and The Hindu , No. 135 Mission Street, I Floor, Puducherry – 605001.", 
    "section": "national", 
    "title": "Page 3 14FEBPYSSM02 READERS’ MAIL", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}