{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The highlight of the awards function organised by the Department of Art and Culture and the Iyal Isai Nataka Manram in the city recently was the staging of the famous Tamil drama ‘Pavalakodi’ authored by the legendary Sankaradas Swamigal, father of Tamil drama.\n\nThe drama was staged by a group of about 50 youths who underwent two-month training in music drama (opera) conducted by the Department of Art and Culture from December 4 to February 3.\n\nThe highlight of the drama is that none of the trainees had ever seen ‘Pavalakodi’ earlier.\n\nThe Tamil plays in the 18th and 19th centuries were only in the form of ‘Therukoothu’, which comprised out and out songs. Even the dialogues were delivered in the form of songs.\n\nLater stalwarts such as Sankaradas Swamigal and Pammal Sambanda Mudaliar brought a big change to the theatre scenario by introducing dialogues and songs in the dramas. They themselves authored and directed many dramas in the new format.\n\nSankaradas Swamigal alone authored more than 60 dramas, which brought him name and fame across the globe. ‘Pavalakodi’ was a famous drama authored by Swamigal and the department picked up this particular drama for imparting training to the budding artistes.\n\nThe drama explained the various sequences involving Arjuna after the Mahabaratha war. As it had a large number of characters, all the participants were given one role or the other.\n\nThe drama had many songs, and those who had talent in both singing and acting got plump roles.\n\nSwamigal gave many important and progressive messages through the drama to the whole society even many decades ago. The drama had the message of how male domination will play havoc to the society. It also explained the ill-effects of man marrying many women.\n\nFor the people who love comedy, it had a lot of comedy scenes.\n\nMany famous troupes never evinced interest in staging ‘Pavalakodi’ as they had to spend a lot for costume, settings, lighting arrangements. The department managed the same thanks to the patronage of the State Government.\n\nWhat brought delight to the old timers was the use of all the lyrics penned by Swamigal himself such as “Manthiri Pavala Sena...”; “Paandiya Kumariyana Paavai Alliye...”; “Azhagiya Mathimugane, Yen Aruginil Vaa Magale...”; “Ilavarasaragiya Beemane, Namathi Raajiyangal Sugama.....” in the drama staged here.\n\nSwami used Western, Hindustani, Carnatic, and classical musical forms for the songs. The drama also had Thevaram and folk songs.\n\nRaja Mohammad, a renowned theatre personality from Madurai, imparted specialised training in singing and C.S. Muthukrishnan in delivering dialogues.\n\nSampathkumar of Dindigul, a drama artiste and harmonium player, imparted training in rendering the lyrics.\n\nIt was the comedy scenes which stole the limelight. Devi, who did the role of ‘Alli’, Mathappan who acted as ‘Arjuna’, Pazhanisami who brought the character of ‘Krishna’ alive, and Kalaivani in the role of ‘Subathrai’ excelled among the actors.", 
    "section": "national", 
    "title": "‘Pavalakodi’ hogs limelight at awards function", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}