{
    "author": [], 
    "text": "There will be no power supply from 9.45 a.m. to 2 p.m. in the city and its suburbs on Tuesday owing to maintenance works to be taken up by the Tangedco at the Kambarasampettai sub-station: Karur Bypass, Old Karur Road, V.N. Nagar, Mathulankollai, S.S. Kovil, Chidambaram Mahal, Poosari Street, Chathiram Bus Stand, Joseph College Road, Chinthamani, Chinthamani Bazaar, Andal Street, Super Bazaar, Fort Station Road, Salai Road, Vathukara Street, Woraiyur Housing Unit, Keeraikollai Street, Nawab Thottam, Weavers Colony, T.T. Road, PVS Kovil, Kandan Street, Minnappan Street, Cholarajapuram, Kambarasampettai, Cauvery Nagar, Murungapettai, Mutharasanallur, Pazhur, Gudalur, Allur, Jeeyapuram, Thiruchendurai, Collector Wells of Golden Rock, Pudukottai, Jeeyapuram, Ramanathapuram and HAPP drinking water schemes.\n\nSpecial campaign\n\nA special campaign to remove names of deceased voters and double entries in the electoral rolls would be taken up from February 15 to 29, Collector K.S.Palanisamy said in a press release. Voters with double entries in the rolls can submit their applications in Form 7 or in plain paper to the Corporation or municipal commissioners, Revenue Divisional Officers or tahsildars concerned. Complaints in respect of such entries can be lodged with officials by contacting the control room by dialling 0431-2410605 or 2419105, the release added.\n\nAwareness run\n\nAbout 740 runners participated in the glaucoma awareness run conducted by the Gift of Sight Eye Care Hospital in the city in memory of Dr. Rajasekaran, a pioneer in eye care, on Sunday. The run was held to raise awareness on glaucoma. The run was conducted in different categories – 10 km run for men and women, five km run for men and women, a three km walk for visually challenged persons (with attendants), a three km run boys and girls and a one km run for children below six years of age. Medals were awarded to the top six in each category while all the visually challenged persons were given medals. Trophies were awarded to the top three in each category, according to a press release.\n\nSpecial camps to recover arrears\n\nSpecial camps to recover arrears in stamp duty under the Revenue Recovery Act would be held at the following sub-registrar’s office as per the following schedule this month: February 17 – Tiruchi III; February 19 – Manachanallur; February 23 – Srirangam and February 24 – Tiruverumbur.\n\nThe camps would be held at 11 a.m. on all these days, an official press release said.", 
    "section": "national", 
    "title": "Power shutdown tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}