{
    "author": [], 
    "text": "After defending the State's liquor policy, Natham R. Viswanathan flagged off an anti-liquor awareness rally\n\nFor Natham R Viswanathan, Minister for Power, Prohibition and Excise R Viswanathan, who has vociferously defended the State Government’s liquor policy, it was a role reversal of sorts on Saturday in Dindigul when he flagged off an anti-liquor awareness rally.\n\nJust a fortnight ago, Mr. Viswanathan had rejected the demand of opposition parties in the Assembly to introduce prohibition and argued that if liquor sale was banned, Rs. 15,000 crore of revenue would reach the hands of anti-social elements.\n\nWhile his Ministry has been annually reeling out statistics on how TASMAC revenue had improved, he was happily in the midst of anti-liquor campaigners. Quite curiously, the campaign was sponsored by the TASMAC and the participants raised slogans on the ill-effects of alcohol. Onlookers pointed out that recently law college student Nandhini, who was arrested for fasting demanding prohibition, had fervently appealed to the government to at least create awareness among the people on the dangers of drinking.\n\nThe DMK appears to be using multiple emissaries to convince the DMDK, led by actor Vijayakant, to join its front for the Assembly elections. A direct invitation from DMK leader M Karunanidhi apart, sources state that a very prominent businessman from Tamil Nadu who is considered close to the DMK leadership and has a passion for cricket, also tried to convince Mr. Vijayakant to decide in favour of an alliance. To the surprise of many, this businessman met the Leader of the Opposition last week at the DMDK’s headquarters in Chennai and the party chose not to publicise it.\n\nThe visit of the Chief Election Commissioner Nasim Zaidi and the two Election Commissioners to Puducherry recently was not without its share of controversy. The top poll officials drew criticism from a section of politicians for conducting its consultative meetings at a private beach resort far away from the city. Mr Zaidi pulled up officials for allowing a batter of mediapersons in the lobby of the resort.\n\nThough it is customary practice to allow photographers and videographers to cover the initial moments of the meeting, the Commission held its first meeting with the Puducherry Chief Electoral Officer V.Candavelou and DIG K.Jagadesan late in the evening after the police had cleared out the journalists. The CPI (M) Puducherry unit secretary R Rajangam and State Committee member V Perumal made public their resentment over the Election Commission’s choice of venue. “When there are so many Government guest houses and conference halls in the town, they chose to stay at the resort,” commented Rajangam. Nonetheless, there is no hard and fast rule as to where the Election Commission officials must conduct their meetings.\n\nThe State government has been time and again writing to the Central government on various issues and seeking funds for implementing certain schemes. However, it appears that not all the funds that are sanctioned are utilised optimally. Tamil Nadu, the largest beneficiary of the Dam Rehabilitation and Improvement Project (DRIP) of the Union Ministry of Water Resources funded by the World Bank, is reportedly “holding down the overall DRIP progress.” At a recent meeting to review the progress of DRIP in Delhi, the Secretary of the Ministry of Water Resources observed that the implementing agencies of Tamil Nadu “need to improve their performance.” Of the 225 dams located across seven States, 107 dams are in Tamil Nadu. Also, of the total Rs. 2,100 crore budget for the project, over Rs. 745 crore has been earmarked for dams in the State. Tamil Nadu Water Resources Department and Tamil Nadu Generation and Distribution Corporation Limited (TANGEDCO) are the implementing agencies under the State government for this project.\n\n(Contributions from\n\nK Raju, Sruthisagar\n\nYamunan,\n\nR Sivaraman and\n\nDennis S Jesudasan)", 
    "section": "national", 
    "title": "Role reversal for Minister", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}