{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Showcasing the planetarium alone would not be sufficient for the students to have a sense of fulfilment of the educational tour\n\nlmost three months have passed since the end of monsoon season, and the residents of the city have already started experiencing sweltering heat. But, the rainwater collected during monsoon season is yet to be cleared on the surroundings of the Anna Science Centre (Anna planetarium) on Tiruchi-Pudukottai road here.\n\nThe planetarium is the source of information for the students, who visit in groups from Tiruchi, Pudukottai, Thanjavur, Perambalur and Ariyalur. Schools from Madurai, Karur, Dindigul and Nagapattinam also visit the planetarium to understand concepts of Nature, earth, planets, environment, ecosystems and others. On an average, it gets 600 students a day.\n\nBesides the buildings that house scientific instruments and exhibition, the park situated around the main buildings attract students as they have many equipment. But, the park has almost become disuse thanks to the stagnation of rainwater mixed with sewage for one to three feet. Many play equipment, which are supposed to engage students till they get their turn for watching the show at the planetarium, are submerged in the water. The water is stagnant on entire 10 acres of land owned by the planetarium, which was built in 1999 on a piece of land carved out of a lake. The workers have to wade through knee deep water for operating motor to pump water for the planetarium.\n\nThe problem has been recurring whenever the city receives good rain. Water stagnated for months together in 2005 and few other years that saw good rain. The stagnant water has to naturally evaporate as the outlet points of the adjoining pond have been plugged by the residents, who have built houses, so as to prevent water entering their premises.\n\nThough the officials of Public Works Department, Tiruchi City Corporation and others visited the planetarium recently to study the issue, it is said that no solution has been found.\n\nSchools teachers, who visit the planetarium regularly with students, said that it was a high time to find a permanent solution to the long pending issue. Showcasing the planetarium alone would not be sufficient for the students to have a sense of fulfilment of the educational tour. If the stagnant water was cleared, it would enable the children to spend quality time by playing in the park.\n\nShowcasing the planetarium alone would not be sufficient for the students to have a sense of fulfilment of the educational tour", 
    "section": "national", 
    "title": "Stagnant rainwater, bane of Anna Science Centre", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}