{
    "author": [
        "T Madhavan"
    ], 
    "text": "In a bid to reach out to more people about the ‘Selvamagal Semippu Thittam’, one of its popular savings schemes, the Department of Posts recently sought the support of the Rural Development and Panchayat Raj Department to create awareness in local bodies.\n\nThe scheme meant for girl children provides a high interest rate of 9.2 per cent.\n\nIn the last one year, Tambaram division has opened the highest number of accounts at over one lakh since its launch in Chennai city region. Officials of the postal department said the city region has over 4.11 lakh savings accounts opened for girl children with deposits touching Rs. 142 crore in one year.\n\nTambaram region, which has three head post offices and 96 sub-post offices under its jurisdiction, accounts for a sizeable number of accounts.\n\nOfficials of the postal department said this could probably be due to better awareness among residents and also the large number of post offices. In Tambaram, the total collection of deposits for this fiscal alone has crossed Rs. 76.10 crore.\n\nOfficials attribute the growing patronage of the scheme to the attractive interest rate and the flexibility of deposit amount — from Rs. 100 to Rs. 1.5 lakh in a year.\n\n“We plan to open a minimum of 100 Selvamagal Semippu postal accounts in each post office. Those in Avadi sub-division have already achieved the target,” said an official.\n\nIn a bid to reach out to the rural areas about the benefits of the scheme, the department has written to the Rural Development department to hold awareness camps through local bodies about the scheme for girl children aged up to 10 years.\n\nPostal savings schemes contribute a lot to the annual revenue. In Chennai City region, there are over 60 lakh savings deposit holders.\n\nThe department also plans to popularise the public provident fund scheme that also provides high interest.\n\nSimplifying procedure\n\nHowever, customers want the department to simplify the process to withdraw cash after the maturity period as many of them have to make multiple visits to the post offices to close the account.\n\nThe division has opened the highest number of Selvamagal Semippu Thittam accounts in Chennai", 
    "section": "national", 
    "title": "Tambaram surges in postal scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}