{
    "author": [
        "B Kolappan"
    ], 
    "text": "Experts blame climatic changes for the emergence of the bug\n\nTrees, particularly neem, guava, cashew-nut, drumstick and cocoa, are under attack from Heloteltis antonii, an alien species known as tea mosquito, across the State. Thousands of trees have already fallen prey to the bug and there are warnings that the attack will be severe in summer.\n\n“The leaves of the neem trees affected by the bug wither away and fruits get a warty appearance. It substantially reduces their market value as consumers are wary of buying these fruits,” said M. Kalyanasundaram, professor and head of the department of entomology, Agriculture College and Research Centre, Madurai.\n\nDo not panic: expert\n\nMr. Kalyanasundaram, who visited the fields affected by the insect, advised the farmers not to panic as adult trees would fully recover in the wake of monsoon. But protective measures, such as spraying of thiamethoxam, are essential for plants less than one year old to survive.\n\n“But we should avoid widespread spraying of insecticides as they will only aggravate the situation. They will destroy bio-pest control agents and enemies of the tea mosquito bug, particularly telenomus, an egg parasitoid, that lays its larvae in the egg of tea mosquito,” said Mr. Kalyanasundaram, who has done extensive study on the insect.\n\nFifteen years ago tea mosquito posed no threat. But climatic changes and weather conditions led to its emergence as a major threat to plants. “It is a mirid bug, piercing and sucking the sap of the plants. It injects toxins into the plant, leading to the destruction of plant cells. Both the male and female mosquitoes attack the plants and the female ones lay egg in the tender part of the leaves,” he said.\n\n‘No health hazard’\n\nMr. Kalyanasundaram clarified fruits with warty appearance were eatable and would not pose any health hazards. “If the consumers reject the fruits it will encourage farmers to resort to pesticides and that, in turn, will create harmful effects,” he said.", 
    "section": "national", 
    "title": "Tea mosquito attack takes a toll on trees", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}