{
    "author": [], 
    "text": "(Clockwise from top left) A national workshop-cum-training programme at Bharathidasan University in Tiruchi; Graduation Day at Jamal Mohamed College in Tiruchi; T. Nallathambi, Principal, Sudarshan College of Arts and Science, giving away degree certificate to a student of Naina Mohamed College of Arts and Science at Rajendrapupram near Aranthangi; Ammangi Balaji, (third from right), secretary of Srimad Andavan Arts and Science College, giving away certificates to winners of “Inspire 2016” contest.\n\n(Clockwise from top left) A national workshop-cum-training programme at Bharathidasan University in Tiruchi; Graduation Day at Jamal Mohamed College in Tiruchi; T. Nallathambi, Principal, Sudarshan College of Arts and Science, giving away degree certificate to a student of Naina Mohamed College of Arts and Science at Rajendrapupram near Aranthangi; Ammangi Balaji, (third from right), secretary of Srimad Andavan Arts and Science College, giving away certificates to winners of “Inspire 2016” contest.\n\nResearch scholars and students got hands-on training on how to estimate toxicity of heavy metals in marine water, sea food and coastal sand and remedial measures to be taken to protect the marine environment from becoming toxic by heavy metals at a three day national workshop-cum-training programme on “Estimation of toxic Heavy Metals in Environmental and Sea food samples using AAS” organised by the Department of Marine Science, Bharathidasan University. C. Thiruchelvam, Registrar, Bharathidasan University, released the e-manual of the workshop and S. Palanichamy, Senior Scientist of OPMEC-CECRI, Tuticorin, received the first copy. A total of 26 faculty members, research scholars and students from various parts of Tamil Nadu took part.\n\nGraduation Day\n\nOver 2,400 candidates got their degrees during the Graduation Day ceremonies for the aided and self-financing streams of Jamal Mohamed College held recently. A.K. Khaja Nazeemudeen, secretary and correspondent, distributed degrees to 610 candidates of aided stream. K.A. Khaleel Ahamed, treasurer, distributed degrees to 816 candidates of self-financing courses for men. M.J. Jamal Mohamed, Assistant Secretary, distributed degrees to 1071 candidates of self-financing courses for women.\n\n‘Inspire 2016’\n\nLectures on chemistry, mathematics and life cycle of animals formed part of the training programme on ‘Inspire 2016’ organised by the Bio-chemistry Department of Srimad Andavan College of Arts and Science in coordination with the Department of Science and Technology, New Delhi. Sindhu Radhakrishna, Indian Institute of Science, Bangalore, delivered a lecture on the life cycle of animals. Sethuraman from Gandhigram Deemed University explained the importance of chemistry and research and its applications. Vijayakumar, another resource person, spoke on magic of mathematics. Baskaran from Madurai Kamaraj University, explained the importance of technology. Brinda from SASTRA University spoke on medicinal value of plants. Senthilkumar, a scientist, spoke on Solar system and Lakshmanan from Bharathidasan University delivered a lecture on physics. Ammangi Balaji, secretary of the college, delivered valedictory address and gave certificates to participants.\n\nConvocation\n\nStudents should follow the ideals of late President Abdul Kalam and enhance their employability skills, said T. Nallathambi, Principal of Sudarshan College of Arts and Science, delivering the convocation address at the 14th convocation of Naina Mohamed College of Arts and Science at Rajendrapuram near Aranthangi recently. In all 166 students -- 142 under-graduate courses and 24 from post-graduate courses, received their degrees. He also gave away special prizes to toppers in various subjects. N. Mohamad Farook, Correspondent, presided over the convocation.\n\nConference\n\nThe English Department of Bishop Heber College and South-Asian English Language and Literature Teachers Association (SELLTA) conducted an international conference on ‘English and Language: Literature Retrospect and Prospects.’ Sigma Ankrava, Dean of South Asian Studies, University of Latvia, inaugurated the conference. Shamala, Faculty of Modern Languages and Communication, University Putra Malaysia, M.F. Karunakaran, president, and D. Paul Dhayabaran, Principal of the college, were present. About 420 research articles on a wide array of topics pertaining to language and literature were presented during the conference.\n\nPolytechnic education\n\nRane Polytechnic College organised a conference on the theme “Role of polytechnic education in bridging the skill gap between industry requirements and institutional rigor.” Eminent speakers from corporate, academia and government provided perspectives on the theme. A panel discussion on the topic, “building vocational skill base to strengthen manufacturing in India” formed part of the event.\n\nThe panel discussion focussed on a two-way dialogue between industry and the institute to identify industry expectations and incorporate them in the curriculum. This will enhance the employability of the polytechnic students and support skill development.\n\nEndowment lectures\n\nA. Ponnuswamy, Professor of Organic Chemistry, School of Chemistry, Madurai Kamaraj University, and S. Velmathi, Associate Professor, Department of Chemistry, National Institute of Technology, Tiruchi, delivered the Dr. V. Meenakshi and Dr. T.S. Jani Bai endowment lectures at Seethalakshmi Ramaswami College. Mr. Ponnuswamy delivered lectures on ‘Conventional and Greener protocols in organic synthetic synthesis – Advantages and Disadvantages’ and ‘A Deeper Look on the components and Mechanism in Developing Greener Protocols.’ Ms. Velmathi spoke on ‘Development of chemosensors for fluoride and cyanide ions in water.’\n\nWorkshop\n\nA workshop on CNC was organised by the Department of Mechanical Engineering of K. Ramakrishnan College of Engineering. D. Srinivasan, Principal, inaugurated the workshop. A team from PRIM Institute of Technology conducted the technical sessions. Over 50 students of the department participated.\n\nSeminar\n\nHuman resource management is a basic requirement for any organisation especially banks. The essence of HRM is providing knowledge, training, coaching and talent management, J. Natarajan, General Manger (HRM), KVB, said at the inauguration of a seminar on “HRM in Banking – Changes and challenges” organised by National College in association with Karur Vysya Bank. Building customer relationship becomes a challenge especially with customer visits to the bank becoming fewer. The staff should be trained in reaching out to customers and build a long term mutually beneficial relationship. To overcome the challenges, banks devise strategies such as multidimensional training covering induction, skill enrichment and mentoring as well as meeting the aspirations of new generation of employees, he said. N. Srinivasaraghavan, Vice President, Royal Bank of Scotland, and R. Vasudevan, Founder and MD of Hot Chips Restaurant, Chennai, were the resource persons for the technical sessions.\n\nDegrees distributed\n\nS. Subbiah, Vice-Chancellor, Alagappa University, distributed degrees to 998 candidates and awarded medals to rank holders at the Graduation Day of J.J. College of Arts and Science, Pudukottai. Kavitha Subramanian, trustee, Karpaga Vinayaga Educational Group, and J. Parasuraman, Principal of the college, were present.\n\nCompiled by\n\nM. Balaganessin\n\nand G. Prasad", 
    "section": "national", 
    "title": "Training programme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-15"
}