{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "It is nearly a month since four persons died while cleaning a septic tank at a restaurant in Okkiyam Thoraipakkam on Old Mahabalipuram Road.\n\nM. Viji, the lone survivor, is still haunted by the memories of that fateful day. He was pulled out of the septic tank and saved. Following the incident, Viji was admitted to the Government Royapettah Hospital, from where he was discharged only a few days ago.\n\nWith tear-filled eyes, Viji narrates how his family, living in Kannagi Nagar, is now struggling for three square meals a day. They fervently hope for some help from the government.\n\n“I lost the fingers of my right hand nearly 20 years ago when I was operating a machine. The year after the accident, I got married to Ammu and we have two children — Pavithra who is in class IX and Surya, who is in class VIII. Later, I started working as a cleaner, as I was able to earn Rs. 600 per day” says Viji, speaking to The Hindu .\n\nRecalling the incident, he said he was the first to get into the septic tank.\n\n“Using a rope, I slithered down, followed by Velmurugan (29) and Kumar (48). The tank was 10 feet deep. We were scrubbing the wall and after I finished the work, Kumar asked me to stir the sewage with my leg. Once I did this, the fumes rose and I became unconscious and was pulled out,” Viji recollects.\n\nAs there was no sound of Kumar and Velmurugan, Saravanan and Rajesh got inside and all four died due to asphyxiation.\n\n“I regained consciousness in the hospital. However, whenever I close my eyes, the images of the accident flashes before my eyes,” he adds.\n\nAmmu, who used to work as a domestic help, lost her job as she had to take leave for taking care of her husband.\n\n“My children study in Corporation-run schools. I am finding it difficult to earn money for feeding the family. As of now, my sister Amudha is providing raw rice, but she is also poor and can’t help us for long,” explains Ammu who is now desperately looking for some work to run the family.\n\nS. K. Siva, general secretary, Tamil Nadu Odhukapattor Vazhvu Urimai Iyakkam, said that the family was yet to get any help from the government. “Many people like him who were shifted to Kannagi Nagar from different parts of the city are struggling to get jobs,” he said.", 
    "section": "national", 
    "title": "A close shave for septic tank cleaner", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}