{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Ramanathapuram district Private Institutes Association has clarified that private health care and technical institutes in the district offered skill development courses after securing due recognition to help the educated unemployed youths to seek employment in the private sector.\n\nThe association offered the clarification in the wake of a demonstration staged by the Tamil National Movement (TNM) here on February 13, alleging that fake health care and technical institutes had a free run in the district and urging the district administration to initiate action against them.\n\nAs the Tamil National Movement and a section of the media made a sweeping charge, giving the impression that all private institutes in the district were fake, they were forced to offer the clarification and give details about the recognitions secured by them, B. Easwaran, President of the Association said.\n\n‘Call attention meeting’\n\nAt a ‘call attention meeting’ here on Tuesday, he said 11 private institutes including nine health care institutes and two institutes offering technical and skill development courses functioned genuinely and collected fee as prescribed by the universities, which recognised the courses.\n\nAs they faced the onslaught especially after the mysterious death of three students of SVS Medical College Of Yoga and Naturopathy and Research Institute triggered a controversy, they formed the association a fortnight ago to protect themselves, Mr. Easwaran, proprietor of Safety Institute of Technology (SIT) said.\n\nHis Institute, which offered courses such as health care assistants, hotel management and catering technology and fire safety was recognised by Bharat Sena Samaj (BSS), he said.\n\nSome of the other institutes were recognised by Alagappa University, Mother Teresa University and Tamil Nadu Directorate of Employment and Training, he said.\n\nThey collected a maximum of Rs. 12,000 to Rs. 15,000 for a one year course and about double the amount for two year courses in addition to fees prescribed for specific projects, he said.\n\n“We have been functioning for about 10 years providing skill development courses,” he said.\n\nK. Thirumurugan, State youth wing secretary of the TNM said none of the private institutes in the district had the necessary infrastructure facilities to offer the courses.\n\n‘Only for money’\n\nThey were running the institutes only to mint money, he alleged.\n\nSources in the Health Department said only the Government district headquarters hospital and a private hospital were authorised to run nursing colleges.", 
    "section": "national", 
    "title": "Association clarifies on recognition and fee structure", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}