{
    "author": [
        "Petlee Peter"
    ], 
    "text": "City lad covers more than 6,700 km across three countries in 25 days on his 'office bike'\n\nArunabh Majumdar, who rode from Bengaluru to Bangkok via Myanmar in 25 days on his TVS City Star Plus 110 cc motorcycle.\n\nWith the tri-nation highway connecting India with Thailand through Myanmar, which opened last September, emerging as the latest test of endurance and grit, a 28-year-old Bengaluru-based IIT graduate recently took up this arduous challenge to complete the solo journey across 6,786 km in 25 days.\n\nQuitting his lucrative job at Cognizant here, Arunabh Majumdar also chose an unconventional TVS Star City Plus, a 110 cc motorcycle associated with an office ride.\n\n“I got all the paperwork ready and on last Christmas day, I throttled on into my biggest road trip from Bengaluru,” said the youngster, who rode through Tirupati, Visakhapatnam, Konark and reached Kolkata for his first rest period of the trip.\n\n“During the second part, I passed through Guwahati, Silchar and Imphal to reach Moreh,” said Mr. Majumdar, who crossed the iconic white and yellow bridge (yellow falls on Myanmar side) from Moreh to enter the Burmese territory and encounter his first border check at Tamu town.\n\nHowever, Mr. Majumdar’s journey to the border was not easy. A minor collision with a car at Raiganj, West Bengal, forced him on detour to Darjeeling, where he fixed his motorcycle before starting up again.\n\n“I always had a passion for long rides on any vehicle I could get my hands on. During my IIT-Bombay days, I just took off one day on my mother’s Honda Activa through the scenic Western Ghats to reach home at BEL Circle in Bengaluru,” he told The Hindu .\n\nFor the diehard biker, Myanmar was a surprising paradise with good roads, welcoming people and pristine locations. “I had a guide and an agent from the Tourism Department who escorted me for nine days of riding through the country where I visited many spots, including the historically significant city of Bagan,” he said.\n\nMr. Majumdar crossed into Thailand on January 16 through the last Burmese town of Myawaddy and entered the Thai district of Mae Sot.\n\nHe rode on for another 600 km to reach Bangkok and end his expedition on January 18. “It was one hell of a ride and I think every biker must take that route and go through the experience,” said the Bengaluru youth, who has shipped his bike.\n\nIt was one hell of a ride and I think every biker must take that route and go through the experience.\n\nArunabh Majumdar", 
    "section": "national", 
    "title": "Bengaluru to Bangkok on a 110cc ride", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}