{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: R. Krishnamurthy, Sri Sankara Gurukulam, New No. 8, Old No. 20, C.P. Ramaswamy St., Abhiramapuram, 6-45 p.m.; Kidaamby Narayanan, Gamgai Kondan Mantapam, Triplicane, 7 p.m.\n\nSrimad Bhagavatam: Paramasukhananda, Sri Ramakrishna Math, Mylapore, 5-30 p.m.; B. Sundar Kumar, Sanskrit College, Mylapore, 6-30 p.m.\n\nJeevan Mukti Vivekam: K.S. Maheswaran, Sri Sankara Gurukulam, New No. 8, Old No. 20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nVinayagar Agaval: Chinmaya Yoga Center, Stage I, Harrington Road, Chetpet, 7 p.m. to 8 p.m.\n\nMaha Periyava Mahimai: P. Swaminathan, Sri Kapaleeswarar Temple, Mylapore, 5-30 p.m.\n\nSankar Uvaacha-Vishnu Sahasranamam: Sudha Seshayyan, Sri Krishna Gana Sabha, T.Nagar, 6-30 p.m.\n\nRamanuja Nooru Anthathi: Venu Raza Narayanan, Sri Santhana Venugopal Swamy Temple, Pedariyar Koil St., Broadway, 6 p.m.\n\nGENERAL\n\nSchool of Management Studies-Vels University: Entrepreneurship orientation programme, Pallavaram, 10 a.m.\n\nSai Ram Engineering College: Workshop on ‘Robotic applications in automation’, Sai Leo Nagar, West Tambaram, 11-30 a.m.\n\nMEASI Institute of Management: ‘NEWANCE 2k 16’, Peters Rd., Royapettah, 9-30 a.m.\n\nVedanta Institute: Vedanta Treatise, ‘C’ Flat, Harmony (2nd floor), 20/39, Venkatarathinam Nagar, Adyar, 6-45 p.m. to 8 p.m.\n\nKola Perumal Chetty Vaishnav Senior Secondary School: Founder’s Day and Valedictory Function of Literary Associations, Smt. Lakshmi Srinivasan presides, Periyar E.V.R. Salai, Arumbakkam, 10 a.m.\n\nMadras Institute of Development Studies: Talk on ‘Explaining Syria’s conflict trap’, Adiseshiah Auditorium, MIDS, Second Main Rd., Gandhi Nagar, Adyar, 3-30 p.m.\n\nSt. Peter’s College of Engineering and Technology: Workshop on ‘Industrial Automation using PLC’ for diploma students, College Rd., Avadi, 9-30 a.m.\n\nITC Grand Chola: Conferment of the Order of Leopold II to Dr. A.C. Muthiah, Chairman of SPIC India in the presence of H.E. Pieter De Crem, Secretary of State for Foreign Trade of Belgium and H.E. Jan Luykx, Ambassador of Belgium to India, The Rajendra Hall, Guindy, 7-30 p.m.\n\nM.N.M. Jain Engineering College: Entrepreneurship awareness camp, Thoraipakkam, 10-30 a.m.\n\nNarcotics Anonymous: Meeting, Staying Clean Group, St. Lourdes Church, Don Bosco School, Perambur, 7 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Kondithope, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Manram, Ashok Nagar; The Lady of the Light Church, Luz, Mylapore; Jacob MHSS., Judges Colony, Periakuppam, Tiruvallur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Loyola MHSS., United India Colony, Kodambakkam; St. Lukes Church, Anna Nagar; Anglo Indian Association, Ponniyamman Koil St., Egmore; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Rd., Velachery; Kondithope Community Centre, Police Quarters, Walltax Rd.; St. Mathias Church, Kamarajar Salai, K.K. Nagar; C.S.I. Church, Moolakadai; and The Lady of the Light Church, Luz Church Rd., Mylapore, 7 p.m.\n\nView full list at thne.ws/ChennaiEng", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}