{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "They seek more time to get passports for sail masters, crew members\n\nNOT A SMOOTH SAILING:A sail vessel at Old Harbour in Thoothukudi on Tuesday.— Photo: N. Rajesh\n\nNow, coastal sail vessel operators are in a spot of bother as it has been made mandatory for sail masters and crew to have valid Indian passports even while in domestic waters.\n\nWith this new regulation, this traditional industry has suffered a blow, according to S. Lasington Fernando, secretary, Thoothukudi Coastal Mechanized Sail Vessel Owners’ Association.\n\nWhile the port authorities gave clearance for vessels laden with vegetables and other cargoes to sail from Beypore Port, Calicut, a week ago, an official from Immigration Department was reluctant to give a go-ahead signal, insisting that the operators should make sure that the crew members were in possession of passports.\n\nIt would be difficult to obtain passports for the entire crew of all sail vessels by February 29, Mr. Fernando told The Hindu here on Tuesday.\n\nHe said that only when sail vessel operations were suspended, the required procedures could be completed to obtain passports for all crew members.\n\nAlready this industry had been affected and if sail vessel operations came to a standstill, this ancient means of trade would suffer yet another blow, he noted.\n\nThe authorities concerned should provide a minimum of two months to obtain passports for all. During the period from May 15 to September 15, the sail vessel operations would be interrupted due to foul weather. Passport seekers could utilise this period to get passport, Mr. Fernando said.\n\nA statement, issued by the Ministry of External Affairs on March 16 last year, clearly stated that the masters and the crew of sail vessels should obtain passports only to undertake international voyages.\n\nLakshadweep Islands had been largely relying on sail vessel operations to haul essential commodities, including vegetables. The normal life of the people there would be affected if the sail vessel operations came to a grinding halt.\n\nRepresentations were made to M.K. Raghavan, Calicut MP, and the Lakshadweep Islands MP, to get extension of time for obtaining passports, he added.", 
    "section": "national", 
    "title": "Coastal vessel operators in troubled waters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}