{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "It is the second cleanest city after Tiruchi in Tamil Nadu; scores 1,361 marks out of 2,000\n\nIt is a big leap for a city that is already selected for Smart Cities project. Coimbatore is ranked 18th in the list of 73 cities that the Central Government surveyed to identify the level of cleanliness.\n\nThe city’s Swachh Bharat ranking for 2015 is a marked improvement over the 2014 rankings though the two could not be compared, says a Coimbatore Corporation officer. In 2015, the Government had surveyed cities with over 10 lakh population and State capitals. In 2014 it had surveyed 476 cities with over one lakh population and awarded the 169th rank to the city.\n\nIn Tamil Nadu, Coimbatore with 1,361 marks out of 2,000 is the second cleanest city after Tiruchi, which with 1,715 is all-India third. Mysuru with 1,749 tops the list.\n\nThe Government has awarded the marks based on the inputs from the Coimbatore Corporation, audit of the submitted information, facilities available on the ground and residents’ feed back. It divided the 2,000 marks into three – awarding 1,000 for service-level status, 500 for independent observation and another 500 for citizen’s feedback.\n\nThe officer says that in the run up to the independent observation for 2015, the Coimbatore Corporation had carried out most of the works that would count in the awarding of marks.\n\nIt had placed hoardings, cleaned toilets and improved waste collection and processing drive.\n\nThe detailed study of Coimbatore’s performance in Swachh Bharat reveals that in the independent observation category the city had scored the 19th rank. To arrive at the ranking, members of the Quality Council of India went around the city recording hygiene condition on their mobile phones.\n\nThe members had recorded their observation at 43 locations on January 5 and 6 this year.\n\nIn the citizen’s feedback section, only 16 per cent have said that the city is always clean; 37 per cent have said that they were able to find dust bin, 30 per cent have said that there is door-to-door collection and 23 per cent have said that basic amenities are available at public convenience facilities.\n\nThe reason for the poor performance in 2014 was that the Corporation did not furnish all the details the Government wanted. This time the Corporation provided all the information the Government had asked for.\n\nThis ranking will further improve the city’s efforts to improve its waste collection and processing drive, Commissioner K. Vijayakarthikeyan says. The 18th rank puts Coimbatore in the list of ‘aspiring leaders’ as it is in the 11t{+h}to 20{+t}{+h}rank bracket. The Government has categorised the first 10 cities as ‘leaders’.\n\nThe Central Government had surveyed cities with over 10 lakh population and State capitals", 
    "section": "national", 
    "title": "Coimbatore 18th clean city in country", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}