{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Infrastructure needs, supply chain management, food safety and standards, export prospects, branding and exploration of new markets were discussed at a seminar on ‘Challenges and opportunities in food processing industry today,’ jointly organised by the Southern India Chamber of Commerce and Industry (SICCI) and Tamil Nadu Chamber of Commerce and Industry, here on Tuesday.\n\nSpeakers at the seminar pointed out that though India had the highest milk production and livestock in the world, occupied the second position in production of fruits and vegetables and third spot in fish production, it lagged far behind in processed food production.\n\nAccording to a chamber press release, they insisted that it was critical to employ the latest technology in food processing sector to considerably reduce food wastage and make employment in the industry more lucrative.\n\nIntroduction of proper technology and change in food habits were bound to increase processed food production in the country.\n\nThe SICCI president, Palani G. Periasamy, presided over the seminar. N. Jegatheesan, president, Tamil Nadu Chamber of Commerce and Industry, welcomed the participants.\n\nSenior president S. Rethinavelu addressed the gathering.\n\nThe technical sessions were chaired by Ram Rajasekaran, Director, CFTRI, Mysuru, and Srinivas B. Garudachar, Principal Adviser, e-agriculture, UN-IFAD, Bengaluru.\n\nV.R. Muthu, chairman, Idhayam group of companies, spoke on infrastructure and supply chain management related to food processing sector.\n\nA. Savithri of Britannia Industries explained the provisions of the Food Safety and Standards Act. T. Thanushkaran, chairman, Kannan Departmental Stores, dwelt on the opportunities for startups in food processing industry. Rajaraman of Ernst & Young elaborated the implications of GST on food processing industry and Anil Kumar Singh of the Department of Agri Marketing delivered a talk on indentifying new markets.", 
    "section": "national", 
    "title": "‘Employ technology to reduce food wastage’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}