{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "The Kari Motor Speedway circuit in Chettipalayam here is usually frequented by race drivers. They get behind the wheel and fight hard to be the best. And, when they do that, tyres squeal, engines rev and the smell of burning rubber fills the air. But last week, the Kari circuit saw a different kind of challenge – a Go Kart Design Challenge for students. Initiated by the Indian Society of New Era Engineers, the four-day event pulled in a big crowd. About 2200 students from 106 engineering colleges across the country were busy working in teams on their ‘Go Karts’. They had to design and fabricate Go Karts.\n\nOnce the karts were ready, they would be put throughvarious tests. The teams’ continuing in the event depends on the performance of their karts. “There have been various challenges but this is the first of its kind for Go Karts. They are much simpler than other cars. Also, it is a lot more feasible to start up with. It is an ideal stepping stone for engineers,” said J. Balamurugan, Director, Spitfire Motorsports, Coimbatore.\n\nA technically sound man in the motorsport arena, Balamurugan, who did the local logistics for ISNEE, was pleased to see so many teams. “Students have huge enthusiasm to do things on their own. The only thing lacking is the guidance. And Spitfire would like to get involved and guide them through.”\n\nThe karts that had lined up at the Kari Ciruit were designed entirely by the students. A rule book with clear guidelines and specifications are given to them well in advance and they simply follow it. “They had worked for over six months in building their karts. We had supplied the engines but the rest they had to do on their own,” said Umesh Kumar, Convener of the Challenge.\n\nHe said experts in the trade had come in to do the technical inspection and evaluation to pick the best. The students were also asked to dismantle and assemble the different parts of the karts. Overall, it was a great experience for them. Mr. Umesh said ISNEE works as a bridge to connect the imagination of students to real engineering. “When a team works for any project, it learns to research, develop and manage various things related to the project. It also prepares the members to join the industry as complete professionals.”", 
    "section": "national", 
    "title": "Engineering students show some drive", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}