{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The police on Tuesday arrested around 1,300 government employees when they picketed the District Collectorate, and blocked the State Bank Road. The protestors – including 1,100 women – blocked the road as part of their indefinite State wide strike. Traffic was affected on the Trichy Road, Race Course and Arts College Road till afternoon.\n\nPicketted\n\nMembers of The State Transport and Transport Corporation Retired Employees Welfare Association on Tuesday picketed the Tamil Nadu State Transport Corporation’s (TNSTC) Coimbatore Divisional Office on Mettupalayam Road seeking retirement benefits. Though they were entitled to many benefits, nothing had been given to them, they said.\n\nEven dependents of late pensioners were not getting their due.\n\n‘Declare results’\n\nStudents of NGM College, Pollachi, on Tuesday staged a protest in front of the Sub Collector’s office demanding that results of the ‘Ancillary Mathematics’ paper be declared.\n\nThe students said that the college management had not declared the results for the last one-and-a-half years.\n\nSources familiar with the issue said that at the core of the problem was the inclusion of five marks for 100 per cent attendance in the internal marks to be awarded to the students. Teachers had been demanding that the system be scrapped, as students who did not write any examination could still walk away with five marks.\n\nIn awarding the five marks too there were differences between the teachers and college management.\n\nThe teachers mark attendance for students who are present in their classes.\n\nThe management record attendance only if the students were present for the entire session.\n\nThis had led to a conflicting situation where teachers would have marked ‘present’ for students, and the management marking ‘absent’ as the same students had skipped a few other classes.\n\nLater, the college authorities said that the results would be declared on February 22 after taking necessary steps.\n\nCondemned\n\nProtests were organised in the city on Tuesday condemning the arrest of the students’ union leader of Jawaharlal Nehru University Kanhaiya Kumar, last week.\n\nProtestors also sought withdrawal of sedition charge against him.Lawyers and political parties took part in the protest that was organised by the All India Lawyers Union in front of the Coimbatore Combined Court. They raised slogans seeking release of Kumar. They held BJP responsible for such acts to crush dissent.\n\nThe State general secretary of the People’s Union for Civil Liberties (PUCL) S. Balamurugan said that section 124(A) was a colonial way of silencing opposition.\n\n“The BJP is using the same weapon to silence those who oppose them for their alleged anti-democratic activities,” he said.\n\nLawyers condemned the attack at the Patiala Court and sought stringent action against the attackers.\n\nThe Tamil Nadu Government College Teachers’ Association on Tuesday staged a protest in front of the college extending support to State Government employees who were on an indefinite strike.\n\nThe association members said that they supported the employees who want the government to scrap the contributory pension scheme.\n\nThe government should go back to the old pension scheme.\n\nStudents of the Government Law College boycotted classes demanding that Kumar, and other students be released.", 
    "section": "national", 
    "title": "Government staff block road", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}