{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Government employees blocking AMC Road in Dindigul as part their strike; courting arrest after staging picketing agitation in Ramanathapuram on Tuesday.— Photo: L. Balachandar\n\nOver 3,500 employees, including women, court arrest in Ramanathapuram, Sivaganga districts\n\nContinuing their picketing and road roko agitations, more than 3,500 government employees, including large number of women courted arrest in Ramanathapuram and Sivaganga districts on Tuesday, pressing their 20-point charter of demands.\n\nAfter launching an indefinite strike on February 10 as part of the State-wide stir, the government employees staged protest demonstrations for the first few days and resorted to picketing and road roko agitations during the last three days.\n\nA total of 1,658 government employees from various departments, including large number of women employees squatted on the roads in six different places in the district, defying police orders and courted arrest.\n\nS. Ganesamoorthy, District president of the Tamil Nadu Government Employees Association, who led the protest here, expressed disappointment that the government has not made any announcement while presenting the interim budget on Tuesday.\n\nTeachers and other government staff were expected to join the strike in the coming days, he said.\n\nThe road roko agitations were held in Paramakudi, Mudukulathur, Kadaladi, Kamudhi and Thiruvadanai, he said. They were pressing for scrapping of the new pension scheme and bringing the non standard time pay scale employees to time pay scale among other demands, he added.\n\nSivaganga\n\nIn Sivaganga district, more than 2,000 employees staged picketing agitations in front of government offices and blocked roads in Sivaganga, Manamadurai, Ilayankudi, Kalayarkoil and Thirupattur and courted arrest, S. Kumaresan, district vice president of the association and district president of the Tamil Nadu Rural Development Officers’ Association said. The arrested employees were detained in community and marriage halls and were released in the evening, police said.\n\nDindigul\n\nMore than 1,500 government employees including noon meal workers and primary school teachers were arrested when they picketed AMC Road before the Kamarajar Central Bus Stand here on Tuesday pressing 20-point demands.\n\nEarlier, they took out a procession from Dindigul panchayat union office to central bus stand.\n\nNoon meal worker Palaniammal swooned suddenly.\n\nHeavy police posse was deployed at the spot to prevent them from entering the bus stand.\n\nThey raised slogans against the State government and appealed to the authorities to convene a meeting to settle their grievances.\n\nTheni\n\nThousands of government employees took out a procession from Krishna Theatre on Cumbum Road to Nehru statue junction.\n\nThey picketed the prime roads at this junction.\n\nThe police arrested the government employees and released them later in the evening.", 
    "section": "national", 
    "title": "Government staff stage road roko", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}