{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "In a rare admission, the Madras High Court Bench here conceded that it has over a period of years developed a jurisprudence, unknown to law, of directing police officers ‘not to harass’ litigants who approach the court with such a plea though the Code of Criminal Procedure (Cr.P.C.) nowhere contemplates grant of such a remedy.\n\nDismissing one such petition, Justice P.N. Prakash pointed out that the ‘not to harass’ jurisprudence was developed by the High Court to give minimum protection to people against high handedness of police officers who frequently summon people to police stations in the guise of inquiry without even registering a First Information Report (FIR).\n\n“Even though I have my own reservations on the legality of passing an order of ‘not to harass,’ I do not want to upset the apple cart now. The matter requires to be dealt with authoritatively by not less than a Division Bench in an appropriate case,” the judge said.\n\nHe made it clear that such a direction could never be issued by the court after the registration of FIR.\n\nHe disagreed with the petitioner’s counsel that such a direction could be issued even after registration of FIR since the Supreme Court in Arnesh Kumar’s case (July 2014) as well as in Hema Mishra’s case (January 2014) had directed the police to issue written summons to the accused and not to arrest them as a matter of course.\n\nObserving that the two Supreme Court judgments had been misunderstood by lawyers as well as lower courts, Mr. Justice Prakash pointed out that a Judicial Magistrate here had last year cited one of those decisions while refusing to remand a person who used a woman’s mobile phone to issue a hoax bomb threat to the District Court campus here because she ignored his overtures.\n\n“The intention appears to be an impish prank. This court has not lost sight of the inconvenience the general public, police, litigants and judicial officers were put to. However, that cannot be a reason to incarcerate the accused who is otherwise protected by Arnesh Kumar versus State of Bihar,” the judicial magistrate had said while rejecting a plea made by the police to remand him to prison.", 
    "section": "national", 
    "title": "HC fiat to police not to harass litigants ‘unknown to law’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}