{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Inspector of Police Gopinatha Pandian was arrested on the charges of intimidating and waylaying a businessman near Kodai Road toll gate on Tuesday.\n\nAmmayanaickanur police arrested and produced him before Judicial Magistrate III M. Seyadhu Sulaiman Ussain at his residence here around 9 p.m. He was remanded in 15 days’ judicial custody.\n\nIn a complaint, businessman Siva Perumal of Thathaneri in Madurai said that the Inspector intercepted his car, and demanded documents and bills for the products he was carrying in his car on January 27. He threatened Mr. Siva Perumal that he would file a case against him. Later, the Inspector collected Rs. 1 lakh from him and allowed him to go, he claimed.\n\nMr. Siva Perumal lodged a complaint against the Inspector at Ammayanaickanur police station.\n\nOn February 12, three persons – all in a police uniform – intercepted Mr. Siva Perumal’s car on NH-7 and robbed him of cigarette bundles and Rs. 2.5 lakh. They abducted him and the driver in another car and took them to Nilakottai.\n\nThen the gang fled the spot leaving them and the car at Nilakottai. Mr. Siva Perumal filed another complaint at Nilakottai police station. The complaint was transferred to Thadikombu police station.\n\nAfter preliminary investigation, the police found that the Inspector’s car was involved in the second incident.\n\nSources said that the Inspector did not cooperate with the police during questioning and refused to answer to many questions. He informed them that he gave his car to one of his friends for personal use. He did not know anything else, he claimed.\n\nThadikombu police were in search of nine accused in connection with the highway robbery case.\n\nInspector Gopinatha Pandian, who belonged to the 1996 batch and a native of Usilampatti, served in many police stations in Theni and Dindigul districts.\n\nIn Dindigul district, he served as Inspector in Dindigul and Keeranur, and also in the PEW.\n\nHe was recently transferred to the control room in Dindigul. Currently, he is on medical leave.", 
    "section": "national", 
    "title": "Inspector arrested for waylaying, intimidating businessman", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}