{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Social work stint is modelled along mandatory practice in the West\n\nJipmer recently introduced a mandatory social work component in the curriculum that provides students credit points for completing a week of voluntary duty in various clinical units.— Photo : Special Arrangement\n\nMBBS students at Jipmer will soon double up as volunteers during busy out-patient hours in the casualty and other crowded departments to guide visitors to the right consultation clinic or the investigation room or retrieve a diagnostic report from the laboratory.\n\nThis follows Jipmer recently introducing a mandatory social work component in the curriculum that will provide students credit points for completing a week of voluntary duty in various clinical units.\n\n“We have recently constituted a patient help group and our students will join the volunteer pool that is being formed,” said S. C. Parija, Jipmer director.\n\nThe social work stint is modelled on the mandatory practice in many medical universities in the West, he added. The first batches of MBBS students have undergone the day-long orientation before they are put on the voluntary duty rosters. It is proposed to train batches of 20 volunteers initially and to scale up the numbers later according to the demand. The posting will be from 8 a.m. to 3.30 p.m. and the hospital will provide volunteers complimentary breakfast as a goodwill gesture.\n\n“We are rolling out this patient support service in the Women and Children’s Health unit and later the Casualty and the Super Specialty Blocks. In about two months, we hope to gradually extend the service across the hospital,” said Dr. Parija.\n\nThe Jipmer administration sees manifold benefits of enrolling the MBBS student fraternity in their pre-final year for patient assistance services. These stints can offer a learning curve, bring about a sense of orderliness in the hospital premises as well as provide early exposure to medical students to the spectrum of disorders and the common problems of patients/bystanders.\n\n“By mandate, Jipmer serves the poor as it provides care free of cost. A stint in voluntary work can reinforce the hospital’s philosophy and a sense of social commitment among students,” Dr. Parija said. Jipmer is also posting students of nursing and paramedical courses as volunteers in its patient support service programme.\n\nBesides, Jipmer is also expecting enrolments for the Patient Support Group from individuals, group of volunteers of NGOs, clubs, educational institutions, and industries. This group of volunteers will be posted in various prominent places of Jipmer Hospital and will guide patients and public for their various needs. Invitations to join the help group is now open on the Jipmer portal (http://Jipmer.edu.in/\n\nonline-application-for-\n\nvolunteers-may-i-\n\nhelp-desk/)\n\nThe forms are also available in the “Help Desk” at the Women & Children Hospital and Super Specialty Block.\n\nAdministrators expect to make these patient support services sustainable as there will always be a desperate need for a helping hand for patients, many of them first-time visitors from rural areas or from northern States, at the first point of contact inside a huge hospital such as Jipmer.\n\nThe patient support service is connected to a set of other measures under way to improve the patient experience at Jipmer such as installation of tri-lingual (Tamil, English and Hindi) signages on the campus.", 
    "section": "national", 
    "title": "Jipmer students to guide patients", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}