{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Juveniles apprehending arrest in criminal cases cannot approach the High Court and seek a direction to Juvenile Justice Boards to dispose of their bail applications right on the day of surrender without lodging them in observation homes, the Madras High Court Bench here has held.\n\nJustice P.N. Prakash passed the ruling after differing with a number of orders passed by other High Court judges who had issued such directions to the JJBs. The judge said he himself had issued such a direction in one of the orders passed by him on May 8, 2014 but had now decided to take a contrary view.\n\n“Though I had granted the relief as prayed for in Karkuvel Mani’s case, in retrospect I am of the opinion that the view taken by me requires reconsideration. After all, we become wiser day by day,” the judge said while dismissing a batch of five petitions filed by juveniles from Madurai, Tuticorin and Sivaganga districts.\n\nSection 12 of Juvenile Justice (Care and Protection of Children) Act, 2015 which came into force on January 15 this year, the judge said provided for granting bail to juveniles even if they were involved in non-bailable offences.\n\nHowever, the Section states that JJBs could refuse bail and order a juvenile in conflict with law to be lodged either in an observation home or any other place of safety if they felt that the juvenile’s release would expose him/her to moral, physical or psychological danger. “Whether in a given case, the juvenile in conflict with law will be exposed to such a danger is a fact that can be assessed only by the JJB where members are trained to gauge a situation. Therefore, this court should not give a blanket order in all the cases,” the judge said.\n\nPointing out that one of the juveniles in the present batch of cases had been accused of making derogatory remarks against women belonging to another community on Facebook, Mr. Justice Prakash said his release on the day of surrender itself might lead to communal violence in the village. “Further, the petitioner also requires counselling so that he does not make such inflammatory statements and post them on his Facebook account. He must be taught to first respect women and also members of other communities,” the judge concluded.", 
    "section": "national", 
    "title": "Juveniles cannot seek immunity, says HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}