{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kudankulam Nuclear Power Project Site Director R.S. Sundar handing over hand-pedalled tricycle to a benificiary at Chettikulam in Tirunelveli district on Tuesday.\n\nThe spent fuel removed from the first reactor of Kudankulam Nuclear Power Project (KKNPP) during the recent annual outage has been kept under water as per the stipulations with all safety measures, Site Director R.S. Sundar has said.\n\nDuring an informal chat with reporters at Anu Vijay Township at Chettikulam on Tuesday, Mr. Sundar, after distributing welfare measures to the physically challenged people, said 55 spent fuel assemblies removed from KKNPP’s first reactor during the annual outage had been preserved under water inside the reactor as mandated by international norms. Since the spent fuel was not buried within the KKNPP premises, as being maliciously campaigned, there was no need for fear among the public, he said.\n\nHe informed that the KKNPP, under its Corporate Social Responsibility programme, had spent Rs. 9 crore towards distributing welfare assistance to the public and schools in nearby villages.\n\n“Moreover, Rs. 500 crore has been earmarked under the neighbourhood development programme and 5,000 concrete houses are being built for the poor under this scheme in the first phase. Hospitals, groynes etc. are also being created,” Mr. Sundar said.\n\nJoining hands with Artificial Limbs Manufacturing Corporation of India, the KKNPP organised the special camp on Tuesday for distribution of Rs. 7.42 lakh-worth rehabilitation devices like artificial limbs, legs, artificial hands and mobility devices like wheel-chairs, multi-utility tricycles and walking sticks to 73 orthopaedically impaired persons from villages around the project site.\n\nGarbage Collection Autos, each costing about Rs. 3.90 lakh, under Swachh Bharat Mission, were also provided by the KKNPP’s CSR team to Chettikulam, Irukkanthurai, Karungulam (South), Aavaraikulam, Levinjipuram, Thannakarkulam, Adangarkulam, Chithambarapuram-Yakkobupuram and Pazhavur village panchayats.\n\nP. A. Pillai, Project Director (KKNPP 3rd and 4th units) and M. S. Suresh, chairman, KKNPP-CSR Committee were present.\n\n‘Since the spent fuel was not buried within the KKNPP premises there was no need for fear’", 
    "section": "national", 
    "title": "“Kudankulam reactor’s spent fuel safe under water”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}