{
    "author": [
        "Aditi R"
    ], 
    "text": "Twenty-seven-year-old Kaveri says her life has been a struggle ever since she shifted from Saidapet to the government housing colony in Perumbakkam. Her children have had to drop out of school as she became unemployed and poor connectivity ruled out any possibility of travelling to her old workplace.\n\nShe is not the only sufferer. Many of the 1,700 families that have been relocated to Perumbakkam from different parts of the city following the floods say there are problems to deal with.\n\nThey have been allotted houses but life is far from easy, they claim. They complain about the lack of streetlights, poor infrastructure, lack of proper schools, inadequate exit options, especially in case of an emergency, and, most importantly, loss of livelihood. “I am a single mother of two. I moved here after my house in Saidapet was washed away in the recent floods. It’s a lot tougher living here,” said Kaveri, who used to work as a domestic help in five houses near her home.\n\nLiving 25 km away from the city forced her children to drop out of school.\n\n“They are too young to travel on their own. Besides, only a few buses are available. A temporary school with poor facilities is set up in two houses on the ground floor. Parents don’t send their children there,” she said.\n\nResidents are also frightened to move around in the area after sunset. “We always roam in groups as there are no lights. We were better off living in our old homes. At least, we didn’t live in fear,” said Sumathi.\n\nResidents also complain of inadequate transport arrangements as they all have to rely on the infrastructure in Semmanchery including hospitals. “There are only four buses that come in a day. The first one comes at 6 a.m., in which we send our children to school, and the next comes after hours,” said Mani Kumaresan, a daily wage labourer.\n\nFact-finding reports by Information and Resource Centre for the Deprived Urban Communities (IRCDUC) have also highlighted the poor quality of life in these resettlement colonies.\n\n“The houses constructed in Perumbakkam reiterate the fact that services for the poor are often dismal,” said Vanessa Peter, Policy Researcher at the centre. “We fear what happened in Kannagi Nagar and Semmencherry would be repeated in Perumbakkam as well,” she added.\n\nHowever, officials from the Tamil Nadu Slum Clearance Board claim that they have made all arrangements to ensure a hassle free-life for the residents.\n\n“We have introduced 10 new bus routes that connect to Saidapet, Guindy, Tambaram and other places. 344 children were immediately transferred to their old schools, 759 people have received their transferred ration cards,” said a senior official.", 
    "section": "national", 
    "title": "Life not easy for flood-hit residents in new area", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}