{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P. A. Ponniah, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: V. Malaimozhi speaks on ‘Socio-linguistic study of fishermen dialect in Tamil Nadu;’ A. Munian presides, Seminar Hall, Department of Linguistics, 2.15 p.m.\n\nLady Doak College: S. A. Perumal, Editor, Semmalar , delivers 13{+t}{+h}Graham Staines Endowment lecture on ‘Fundamentalism and responsibility of people;’ S. Selva Gomathi of Society for Community Organisation Trust presides, Multimedia Theatre, 11 a.m.\n\nThiagarajar College: L. Senthil Lakshmi of Tandem Informatics speaks on ‘Android apps development;’ M. Eyini, Principal, presides, Computer Science Lab, 2.15 p.m.\n\nThiagarajar College of Preceptors: Citizenship training camp; Karpagam and Sivakumar of Thiagarajar College speak on ‘Indian culture,’ Teppakulam, 10 a.m.\n\nFatima College: K. K. John of Saintgits College of Applied Sciences inaugurates international conference on ‘Changing urban scenario: opportunities and challenges;’ T. Nagarajan of Peking University addresses; Rev. Sr. K. Fatima Mary, Principal, presides, Jubilee Hall, 9.30 a.m.\n\nMannar Thirumalai Naicker College: Orientation programme on ‘Fire and safety management,’ Moorthy Naidu-Andal Ammal Hall, 12 noon.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, Kallampatti, 2.30 p.m.\n\nMangayarkarasi College of Arts and Science for Women: Entrepreneurship development programme, Lakshmi speaks, Paravai, 10 a.m.\n\nMadurai Productivity Council: Productivity Week celebration; paper presentation contests, B. Balakrishnan, vice-president, Quality Circle Forum of India, speaks, TB Road, Mahaboobpalayam, 9.30 a.m.\n\nNehru Yuva Kendra: District sports tournament to celebrate 125{+t}{+h}birth anniversary of B. R. Ambedkar, MGR Stadium, Race Course, 8 a.m.\n\nNala Dental Hospital and A. M. Jeyabalan Memorial Trust: Programme on ‘Modern day dental implants and fixed teeth for everyone’ and free dental consultation, Chokkikulam, 11 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Deep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}