{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bioinformatics, a knowledge-based area, would be challenging and highly competitive for the present generation, T.P. Singh, Department of Biophysics, All India Institute of Medical Sciences, Delhi, has said and wished that “there could be a society developed for bioinformatics and drug discovery”.\n\nAddressing the eighth national symposium-cum-workshop on ‘Recent trends in structural bioinformatics and computer-aided drug design (SBCADD – 2016)’ here on Tuesday, he said that “challenging prospects from microbes and drug resistance are two areas where the youngsters would bestow their knowledge and provide breakthrough contributions”.\n\nIndia had the second highest downloads of databases and the prospects of development of science in the country were bright, he said, and congratulated the Department of Bioinformatics, Alagappa University, for organising the symposium for the eight successive years.\n\nProf. N. Srinivasan, Molecular Biophysics Unit, Indian Institute of Science, Bangalore, urged the students to rely on their instincts in analysing biological data rather than complying on software and tools.\n\nS. Subbiah, Vice-Chancellor, Alagappa University, said that one third of the world’s population was infected with mycobacterium tuberculosis (Mtb), cancer, alzheimer disease, chikungunya, dengue, swine flu or zika virus, and appealed to the scientific community to focus on these diseases.\n\nK. Ramasamy, Vice-Chancellor, Tamil Nadu Agricultural University, said that the need of the hour was that the present generation should make the best use of natural products and provide a new avenue in drug discovery. “Bioinformatics is becoming one of the best opportunistic fields in an application-oriented aspect, and India should become the uploading country in the near future,” he said.\n\nMore than 15 eminent scientists from various prestigious institutions would be delivering lectures on computation methods, which could play a major role in developing drugs for the human kind in the four-day symposium, J. Jeyakanthan, Head of the Department of Bioinformatics, said.\n\nMore than 250 participants from across the country would focus on the importance of bioinformatics tools in health care. The aim of the symposium was to provide adequate knowledge through interaction with the best ‘in silico’ drug design phenomenon which would open up new and powerful insights into treating diseases from killer cancers to common cold, he added.", 
    "section": "national", 
    "title": "National symposium begins", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}