{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Director of Crystal Growth Centre, Anna University, Chennai, Krishnan Baskar (54), assumed office as the new Vice-Chancellor of Manonmaniam Sundaranar University here on Tuesday.\n\nHailing from an agricultural family at Kottaikuppam village in Tiruvallur district, Prof. Baskar obtained his M.Sc. in Physics from Madras University and Ph.D. from Anna University. He joined Anna University, Chennai in 1991.\n\nWith 25 years of teaching experience besides a research experience of 30 years, he did four years of postdoctoral studies at Nagoya Institute of Technology and Electrotechnical Laboratory, Tsukuba, Japan, during 1995 - 1999 with Monbusho Fellowship through Government of India and Science and Technology Agency Fellowship of Japanese Government.\n\nHe worked three years as a ‘Visiting Researcher’ at Royal Institute of Technology, Stockholm, Sweden, during 2001 - 2004. The Royal Institute of Technology (KTH) in Stockholm, Sweden, awarded him the title of ‘Docent’ for his research accomplishments in semiconductor materials technology in 2001.\n\nHe is responsible for the creation of the International Division and the introduction of Japanese language at Anna University.\n\nHe was formerly the Director of Centre for International Affairs, Anna University during 2008 - 2012 and the Director, Crystal Growth Centre (UGC - National facility) during 2012 - 2016.\n\nHis research areas of interest are compound semiconductors, particularly nitride-based materials for high electron mobility transistors, UV (260-360nm) and visible light emitting diodes, semiconductor nanostructures, sensors and solar cells, photoluminescence and fabrication of optoelectronic semiconductor devices.\n\nHe has generated research grant to the tune of about Rs. 11 crore through competitive funded projects and has established the sophisticated class 10000 clean room, MOCVD, first of its kind in a university system in the country, HXRD and PL with Raman facilities at Crystal Growth Centre.\n\nHe has published over 120 research papers in peer reviewed international journals and conference proceedings. He has guided 14 Ph.D. students and currently 9 students are pursuing Ph.D. under his supervision. He has organized 28 national / international conferences / workshops. Prof. Baskar is a member of several scientific societies. He has travelled over 25 countries and visited several top ranking educational institutions in the developed countries including long years of stay abroad.\n\nHe is a recipient of ‘Active Researcher Award’ in 2011 from Anna University and ‘Youngsters Attractive Research Paper Award’ (1,40,000 Yen) from Japan in 1989 as a Ph.D. student. He is a member of many committees in DRDO, UGC, DST, IITs and universities and is proficient in Tamil, English, Japanese and Telugu languages.\n\nThe Vice-Chancellor said he, through the proposed reforms in administration and curriculum and collaborations with internationally reputed institutions, would strive hard to attract international students and international projects for generating hefty revenue for MSU.\n\n“My goal is to bring the university as one of the top ranking universities in the world, at least within the top 200 universities,” Professor Baskar said.", 
    "section": "national", 
    "title": "New V-C for MSU assumes office", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}