{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMK, MDMK councillors stage sit-in, asked to leave hall by Mayor\n\nDISORDERLINESS:DMK and MDMK councillors involved in a heated argument with Mayor E. Bhuvaneshwari during Tirunelveli corporation council meeting on Tuesday.— Photo: A. Shaikmohideen\n\nThe corporation council meeting held here on Tuesday witnessed noisy scenes and sit-in dharna by Dravida Munnetra Kazhagam and Marumalarchi Dravida Munnetra Kazhagam councillors after they alleged that no development work was taken up in the corporation since 2011.\n\nWhen Mayor E. Bhuvaneshwari started reading resolutions hailing Chief Minister Jayalalithaa for her recent announcements on developmental works proposed elsewhere in Tamil Nadu, DMK councillor Kittu alias Ramakrishnan urged her to give details of the works carried out in the corporation limits. “Since no development has been carried out in the corporation, you cannot pinpoint anything,” Mr. Ramakrishnan said.\n\nBefore Mr. Ramakrishnan completed his speech, independent member Subramanian alias ‘Kopparai’ Subramanian reiterated the charges which triggered heated argument between him and All India Anna Dravida Munnetra Kazhagam councillor ‘Kurichi’ Sekar.\n\nDMK and MDMK councillors supported Mr. Ramakrishnan and Mr. Subramanian, who were engaged in a heated argument with the Mayor.\n\n“We (AIADMK members) are prepared for a discussion on the baseless charges… We’ll prove that we’d executed the development works the city is in need of… If you are still keen on disturbing the proceedings… better stage a walkout, as Mr. Stalin and your party MLAs do from the Assembly every time,” Ms. Bhuvaneshwari said.\n\nAt one point, the DMK and MDMK members sat on the floor in front of the Mayor’s chair, raising slogans against her.\n\nNone of the AIADMK members came to her rescue. Meanwhile, Ms. Bhuvaneshwari said that all but one resolution placed before the council had been passed and left the hall.\n\nMs. Bhuvaneshwari, after returning to her chamber from the council meeting that commenced 45 minutes late due to lack of quorum, told reporters that development works to the tune of Rs. 24.71 crore had been completed in Tirunelveli Zone over the past four and a half years.\n\nBasic infrastructure had been either created or strengthened in Thatchanallur (at a cost of Rs. 20.85 crore), Melapalayam (Rs. 29. 45 crore) and Palayamkottai Zones (Rs. 23 crore).\n\n“Administrative sanction has been given for constructing elevated parking facility at Tirunelveli Junction bus stand on an outlay of Rs. 25 crore and renovating parks and creating new parks at a cost of Rs. 20 crore,” she said.", 
    "section": "national", 
    "title": "Noisy arguments mar council meet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}