{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Coimbatore District Small Industries Association has launched a virtual platform to promote innovation in micro, small and medium-scale enterprises (MSMEs).\n\nAssociation president E.K. Ponnuswamy told The Hindu that Indian Open Technology Alliance (www.iotaplatform.org) has mentors, knowledge partners, and industries.\n\nThe Make in India campaign will benefit the manufacturing sector only when there is focus on new designs and innovation. Large-scale companies have resources to invest in in-house research and development projects. The MSMEs need incremental innovation. But they are unable to invest in it.\n\n“Hence, we have created a digital platform. Industries can post their problems. Here, we are promoting open source for hardware. We want to bring revolution in hardware,” he said.\n\nThe association has tied up with incubation centres and Indian Society for Technical Education. It also has mentors to guide the industries. The association signed an agreement with Indian Society for Technical Education here recently.\n\nAnyone can develop drawings, new designs, and submit it on the platform and initiate discussions. These can be adopted by industries, modified and upgraded. The engineering units and bio-technology sector here will benefit from this initiative, he said.\n\nOpen source hardware, also known as open hardware, is hardware built from design information that could be copyrighted or licensed. But, it is made available at no charge, according to a press release from the association. It empowers youth, helps them get hands-on experience, develops skill sets and promotes innovation. The association is looking at having a network on international experts too as part of the programme.\n\nAnyone can develop drawings, designs, and submit it on the platform and initiate discussions", 
    "section": "national", 
    "title": "Open source platform to promote innovation in MSMEs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}