{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Anna Nagar merchants say there has been a huge drop in footfall, seek speeding up of project\n\nThe Second Avenue, where work began in 2010, is among the heavily affected areas —Photo: M. Vedhan\n\nntil a few years ago, R. Bhaskar, a textile merchant at Anna Nagar, used to be busy attending to customers even during weekdays. Now, many traders get only half the number of customers as quite a few stretches have been turned into one-ways to facilitate the ongoing Metro Rail work.\n\nWhile welcoming the project, many traders in the city complained that the delay in executing the project had affected their business. Merchants along the alignment of the Metro Rail project in Anna Nagar said the work was started in 2010 on Second Avenue and there has been a significant drop in footfall at several shops on either side of the road.\n\nEarlier this week, members of the Anna Nagar Merchants Welfare Association submitted a memorandum to various government departments and the Mayor.\n\n“We supported the project in spite of losing customers as it will benefit people and help reduce traffic congestion. But, of late, work on Second Avenue is progressing at a slow pace and only 40 per cent of the workforce is engaged in the project,” said R. Arokyam, the association’s president.\n\nThe number of shops has come down by 25 per cent on Second Avenue in Anna Nagar alone as many merchants have lost business due to lack of proper access. Mr. Bhaskar said that as the median separated long stretches of Second Avenue and Shanthi Colony Road, customers were unable to cross the stretch to reach the shops on the other side of the roads where traffic has been made one-way.\n\nMerchants also noted that sewer blocks had increased after the project started on the arterial roads of Anna Nagar. Anbumani, a merchant in Anna Nagar, said sales have declined by 50 per cent in the past few years. “Some stretches of arterial roads must be opened for two-way traffic wherever work to construct underground stations has been completed,” he said.\n\nChennai Metro Rail Limited officials have given an assurance that the project would be completed early.\n\nThe Mayor has also promised to look into the issue.\n\nMerchants also noted that sewer blocks had increased after the project started on the arterial roads", 
    "section": "national", 
    "title": "Pace of Metro work hits traders’ fortunes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}