{
    "author": [
        "Staff Reporter"
    ], 
    "text": "An acutely underweight male infant, born in a risky 29 weeks premature delivery to a young mother, has been saved without any complications at a private hospital here.\n\nS. Shanthi (26), wife of a daily wager from Narasingam near Othakadai, got herself admitted to Devadoss Multispecialty Hospital when she was about seven months pregnant.\n\nHeera Banu, gynaecologist at the hospital, said that Shanthi had high blood pressure due to pregnancy-induced hypertension (PIH) and swelling and inflammation near her throat due to viral infection in parotid glands. “Importantly, inquiry with the patient revealed that she had similar problems in two pregnancies before and the newborns did not survive in both the cases,” Dr. Banu said. She added that the doctors decided to immediately perform a C-Section to take the baby out as the survival chances were extremely low otherwise.\n\nV. Theivendiran, neonatologist, said that the baby was weighing only 800 grams at the time of delivery and was kept in ventilator support for around a month. “In most of such cases, the newborn will develop brain or heart-related complications. However, in this case we managed to avoid any such complications,” he said, adding that providing appropriate flow of oxygen was crucial.\n\n“There was a problem in the heart. As it is a newborn, we could address it through medicine itself instead of a surgery,” Dr. Theivendiran said. Doctors at the hospital said that the newborn, presently weighing one kilogram, was discharged recently.\n\nDr. Banu said that women who faced complications in their first pregnancy, particularly PIH, should be extremely careful and take adequate precautions.\n\nDurai Kumar Rajagopal, General Manager, said that as Shanthi hailed from a poor family her medical expenses were taken care of by V.A. Annamalai and Padmavathi Trust run by the hospital.", 
    "section": "national", 
    "title": "Preterm baby saved", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}