{
    "author": [
        "S P"
    ], 
    "text": "Rare birds such as Yellow Bittern, Cinnamon Bittern, Red Avadavat, Baillon’s Crake and Ruddy-breasted Crake were recorded during the fourth edition of the Great Backyard Bird Count held between February 12 and 15 in Salem.\n\nAs many as 120 species of birds belonging to 50 families, including 23 species of both migrants and partial migrants were recorded during the four day count. The event, coordinated by Bird Count India and Tamil Birders Network, was led by birder S.V. Ganeshwar, a member of Tamil Nadu Science Forum, and photographers J. Arun Prakash, K. Jagadeesan, D. Vijay, along with their friends.\n\nOn the first day of the count, a sea bird named Brown-headed Gull, which breeds in Central Asia, was recorded for the first time in Salem at Kannankurichi Lake, to the surprise of the birders. It was an adult bird in non-breeding plumage and the best feature for identification is the conspicuous white ‘mirrors’ in the black primary feathers. They also recorded near-threatened birds such as Oriental Darter and River Tern.\n\nIn Shevaroyan Hills, the team recorded elusive resident birds like Indian Scimitar Babbler, White-rumped Shama, Grey-bellied Cuckoo and migratory birds such as Blue-throated Flycatcher, Blue-capped Rock Thrush, Chestnut-tailed Starling, Forest Wagtail and Ashy Drongo. The Nilgiri Flowerpecker which is endemic to Western Ghats was recorded from Yercaud and this is the first photographic record of the bird to confirm its occurrence in Salem.\n\nBird watching for public people was conducted at Kannankurichi Lake and at Maramangalathupatti in Steel Plant area by T. Jayamurugan and these were the only two public events in the whole of the State in which 55 students enthusiastically participated.\n\nMr. Ganeshwar said that spending at least 15 minutes in any place will give a better sense of which birds were present in a particular location. This will help us to understand the complex distribution and movements of so many species in a short span of time, he added. Bird watchers said that public participation in such citizen-science projects is highly essential in conservation of nature. Counting birds is fun, free, family-friendly way to discover and help the birds in your community, they added.", 
    "section": "national", 
    "title": "Rare birds sighted in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}