{
    "author": [
        "S Ganesan"
    ], 
    "text": "The possibility of a head on collision between heavy vehicles looms over the service road near Sanjeevinagar on Chennai Bypass in Tiruchi.— PHOTO: M. SRINATH\n\nith the opening of the new bridge on the Odathurai Road along the Cauvery banks in the city, civic activists have expressed concern over the traffic bottleneck caused because of the narrow minor bridges along the service lane on the Tiruchi-Chennai Bypass.\n\nAlthough work on four-lane of the bypass, forming part of the Tiruchi-Padalur section of the Tiruchi-Chennai National Highway was completed nearly five years ago, the NHAI had failed to connect the service lanes across several minor bridges along the city stretch of the bypass, much to the consternation of motorists. The service lanes on the city stretch lay in bits and pieces. This forces motorists to ride on the wrong side of the lane, exposing themselves to the grave threat of being hit by vehicles.\n\nThe situation is bad near the Sanjeevi Nagar and immediately after the Kumbakonathan Salai intersection on the Chennai Bypass intersection.\n\nMany vehicles coming from the Odathurai Road have to go via the service lane to cross the highway and proceed towards Ariyamangalam.\n\nOften, vehicles have to sneak across the narrow two-lane bridge, across a canal between the Odathurai Road intersection and Sanjeevi Nagar, against the speeding traffic towards Chennai.\n\n“In the absence of the minor bridge, vehicles are forced to go via the main carriageway in the wrong direction posing a great safety threat. The NHAI has to build the minor bridge immediately to prevent accidents. Normally, a large number of vehicles prefer this road to reach Chennai Bypass from the city,” said M. Sekaran, president, Federation of Consumer and Service Organisations, who had sent a representation to the Chairman of NHAI in this regard.\n\nHe pointed out that traffic on the Odathurai Road is expected to increase when the State Highways Department begins construction of the Periyar Nagar Road bridge at Thiruvanaikovil. Besides, blacktopping on the Cauvery bridge in the city is expected to be taken up shortly by closing one carriageway and this would require some traffic diversion, he said. .\n\nA sub-committee, comprising NHAI and police officials, formed by the District Traffic Advisory Council after inspecting the spot had emphasised that a bridge across the canal had to be built to provide the missing link on the service lane, pointed out Mr. Sekaran, who was part of the sub-committee.\n\nAccording to NHAI sources, a proposal had been sent to their headquarters for construction of seven minor bridges, including the one near the Sanjeevi Nagar at a cost of Rs. 12 crore. But this had to be done urgently, said motorists.\n\nThe NHAI has to build the minor bridge immediately\n\nto prevent accidents.", 
    "section": "national", 
    "title": "Service road along NH turns into accident zone", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}