{
    "author": [
        "P V"
    ], 
    "text": "Amidst the click-clack of the rifle stock and the barrel, and the three-shot volley, the mortal remains of Sepoy N. Ramamoorthy of Madras Regiment were laid to rest with full military honours here in his village of Gudisaadhanapalli on Tuesday. After close to a fortnight-long wait by the family, the coffin bearing the mortal remains of 28-year-old Ramamoorthy arrived at Gudisaadhanapalli at 10.45 p.m. on Monday from the Bengaluru airport.\n\nLess than 12 hours later, the cortege–flanked by the Madras Regiment, the parent regiment of Sepoy Ramamoorthy and the Army Supply Corps, Bengaluru–was slowly led to the family’s own agricultural plot for a burial. The coffin draped in the tri-colour was opened briefly for the sepoys of the Madras Regiment to have a final glimpse of the martyr\n\nSunitha, the 22-year-old wife of Ramamoorthy was inconsolable as the coffin was lowered into the six-feet deep grave pit, while the father Nanje Gowdu, clenched the neatly folded tricolour that until minutes ago had adorned his son’s coffin tightly. The solemn funeral, well attended by the entire village, was punctuated by heart wrenching moments. Words failed a uniformed soldier of the Madras Regiment after he lost his composure and broke down into sobs as he embraced the grief-stricken mother of Ramamoorthy. The state government had handed over a solatium of Rs. 10 lakh to the family on Monday.\n\nLike father, like son\n\nA narrow lane off Arni Road twists and turns to end at a single-storey house that has been waiting for its owner’s return. It is from this house that 38-year-old M. Elumalai’s final journey began on Tuesday morning.\n\nThe mortal remains of the soldier reached his home at Adukkamparai, nearly 10 km away from the Fort City, during the early hours of the day. Relatives and villagers poured in to have a final glimpse of Havildar Elumalai and pay their respects. Havildar Elumalai was laid to rest at Adukkamparai close to 10.30 a.m. with full State and military honours.\n\nThe youngest of seven children, Elumalai was just seven years old when his father Muthu, an ex-serviceman, died. This was more than enough to inspire Elumalai to join the Army at the age of 18 years.\n\n“He had completed Class X and wanted to join the Army like our father. He was passionate about working for the country, and at the same time, wanted to support the family,” his eldest brother M. Rajendran said.\n\nThe family hails from Melanur near Arni in Tiruvannamalai district, and Elumalai had moved to Vellore after getting married to Jamuna Rani. He had constructed a house at Adukkamparai before marriage. The couple has two sons – Kaviarasu (6) and Sri Priyadarshan (4).\n\nHavildar Elumalai was a “highly intelligent” Non-Commissioned Officer, who had high level of initiative and was always willing to carry out any task assigned to him, a note about the Siachen martyrs from the Press Information Bureau (Defence Wing) said.\n\nHe joined the 19th Battalion of the Madras Regiment on October 28, 1996. He had displayed high degree of courage and was part of several successful small team operations against terrorists in Jammu and Kashmir and North East during nine years of field service. His ability to motivate his juniors and lead them earned him a place at the Sonam Post that required men with nerves of steel and high level of physical fitness.\n\nHe went on to obtain instructor grading in Weapon Course at Infantry School, Mhow and was posted as instructor at The Madras Regimental Centre, Wellington. Here, he trained several recruits. Prior to induction of the unit to Siachen Glacier, he was also part of the Unit Training Team. In fact, he had passed his promotion tests and was about to pick up the rank of Junior Commissioned Officer. School Education Minister K.C. Veeramani along with Collector R. Nanthagopal paid homage to the soldier. The Minister handed over the State government’s solatium of Rs. 10 lakh to his wife. Army officers and personnel were present during the soldier’s final journey.\n\nSchoolchildren join final march\n\nThe body of Lance Havildar S. Kumar (38) was laid to rest at Kumananthozhu, his native village, with full military and state honours here on Tuesday.\n\nThe coffin was kept on the campus of government higher secondary school at the village to enable family members, relatives and villagers to pay homage. Collector N. Venkatachalam, Superintendent of Police J. Mahesh, and officers from the Army, Madras Regiment and NCC paid their respects. Director General Recruitment Brigadier Sangram Dalvi, Coimbatore Station Commander Col. Sandeep Saxena Satpathy, 44-Field Commander Lt. Col Ravichandran, Lt. Col Thomas Mathew of MRC Wellington and 11 joint commissioned officers and 60 Jawans conducted the funeral parade.\n\nAfter rituals, the army men carried the body to the burial ground. School children and local people took part in the funeral procession. He was laid to rest around 10.45 a.m\n\nwith a 21-gun salute and full state and military honours. Later, the collector handed over a cheque for Rs.10 lakh to his family members. Ex-Servicemen appealed to the Centre to honour all 10 deceased army men with highest military award.\n\nEarlier, the body was flown to Madurai from New Delhi and brought to Theni on road around 2.30 a.m. It was kept in Theni Government Medical College Hospital near Gandamanur pass till this morning as per request of the family members. Hundreds of youth, mostly friends, thronged the hospital late night to see the body. The handful of policemen at the GH struggled to control them. Doctors in the GH too paid homage to him.\n\nMr. Kumar joined the service while he was doing his higher secondary course. He is survived by his father Srinivasan, a small farmer, and mother Panjammal.\n\nHis wife Kavitha is working in a private school at Mayiladumparai. He has a six-year-old son Riyas.\n\nVillagers honour their hero\n\nThe body of Lance Havildar G. Ganesan (25) was cremated with full military honours at his native village Chokkathevanpatti near Usilampatti here on Tuesday morning.\n\nGanesan’s body was kept near his house briefly on Tuesday morning for the local people to pay homage. Later, the body was taken by military personnel to the cremation ground in a procession in which District Collector K. Veera Raghava Rao, Superintendent of Police Vijayendra S. Bidari, senior army officials and hundreds of people from Chokkathevanpatti and nearby villages joined. At the cremation ground, army personnel gave a 21-gun salute. Students from Valandur Panchayat Union Middle School, who had come for the cremation, sang a patriotic song as homage to the martyr. The villagers handed over Rs. 65,000, which they had collected, to Ganesan’s family. Similarly, the army personnel, who had collected Rs. 1.3 lakh, also handed over the money to the family.\n\nEarlier on Thursday night, state Minister for Coperation Sellur K. Raju handed over Rs. 10 lakh to Ganesan’s family.", 
    "section": "national", 
    "title": "Siachen heroes laid to rest, residents pay moving tribute", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}