{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Postgraduate doctors in government service launched a protest on Tuesday by wearing their demands on their sleeves.\n\nAs many as 18,000 doctors working in primary health centres, taluk, district headquarters and government medical colleges are on four-day protest listing four demands. These include implementation of the Seventh Pay Commission; scrapping of the contributory pension scheme and return to the old pension scheme; two years’ child care leave for woman doctors and creation of a corpus fund for the benefit of doctors who die in service.\n\n“Government doctors are stressed out as they are overworked. Our work schedule is heavy with weekly visits to villages to check the progress of immunisations whereas Central government doctors work only in hospitals.\n\nAs we are in-charge of the Muthulakshmi Reddy benefit scheme for pregnant women, we must check if the woman has undergone antenatal check-up, ensure immunisation is complete before preparing the bills and finally ensure that the mother gets the money,” said P. Saminathan, secretary of the Service Doctors and Post Graduates Association.\n\nGovernment doctors say they are not being paid the basic pay on a par with doctors under the Central government health scheme.\n\nThe CGHS doctors are entitled to an emolument of more than Rs. 1 lakh after completing 13 years of service but in Tamil Nadu a doctor can expect such a salary only after 20 years’ service.\n\n24-hour duty\n\n“We do 24-hour duty once a week and are entitled to only one day off. We are stressed out and many of us succumb early to disorders,” he added.\n\nThe CGHS and the governments of West Bengal and Tripura had implemented the two year’s child care leave for women doctors.\n\nSince the State government had given a major thrust to maternal and child health, it is only fair that the government recognise the work is done by woman doctors, Dr. Saminathan pointed out.\n\nTheir demands include implementation of Seventh Pay Commission", 
    "section": "national", 
    "title": "State govt. doctors begin 4-day strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}