{
    "author": [
        "Special Correspondent"
    ], 
    "text": "District Collector V. Sampath (third left) displaying the electoral rolls at an all party meeting held at the collectorate in Salem on Monday. —Photo: E. Lakshmi Narayanan\n\nThe district administration has taken all effective steps for the preparation of a cent per cent genuine voters list in all the 11 Assembly constituencies in the district, said V. Sampath, District Collector.\n\nSpeaking at a meeting of the representatives of the political parties to discuss the preparation of a 100 per cent genuine voters list here on Monday, Mr. Sampath said that the Election Commission has issued directive to conduct special campaign to enrol all the eligible voters and delete the names of the bogus voters from February 15 – 29.\n\nAs such the entire official machinery has been geared up in the preparation of fool-proof final poll rolls. The officials have called for the names of the persons who passed away in the recent past from the records of the corporations, municipalities, town panchayats and revenue departments.\n\nThe list of the voters who have multiple entries and the voters who possessed more EPICs with the same number will also be prepared.\n\nThese lists will be sent to the officials in charge of polling booths and also to the booth agents. Steps have been taken to create awareness among the public to provide information on the voters who are no more and those who have made multiple entries etc to the concerned officials for removing such names. Mr. Sampath said that the district administration has proposed to convene special grama sabha meetings to inform the list of names prepared booth wise for deletion.\n\nThe suggestions given by the representatives of political parties will be discussed properly and the action taken will be informed to them without any delay.\n\nThe representatives of AIADMK, DMK, Congress, BJP, DMDK and other participated in the meeting.", 
    "section": "national", 
    "title": "Steps being taken for 100 per cent genuine voters list", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}