{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Government employees observing a fast in front of Commercial Tax Office in Palayamkottai; (below) members of Tamil Nadu Government Employees Association staging a road roko in Thoothukudi.— Photos: A. Shaikmohideen and N. Rajesh\n\nDemand scrapping of contributory pension scheme, filling up of vacancies\n\nOver 2,000 government employees including good number of women were arrested when they attempted to stage a road roko at four places in the district on Tuesday.\n\nAs the government employees’ indefinite strike continued on Tuesday also, the striking workers staged road roko at Tirunelveli, Sankarankovil, Tenkasi and Ambasamudram, where the police arrested 2,425 protestors including 2,199 women. All of them were released in the evening.\n\nMeanwhile, employees of Department of Commercial Taxes observed fast in front of their office on Tuesday also.\n\nThoothukudi\n\nAs many as 1,285 employees working in various government departments courted arrest in Thoothukudi and other parts of the district on Tuesday while staging road roko in support of their demands to be fulfilled by the government. The agitating employees had been demanding the government to scrap the existing contributory pension scheme, fill up vacancies in government offices. In Thoothukudi, a total of 291 employees including 234 women were held while staging a road blockade opposite the old bus stand here. Similar agitations were organised at Udangudi, Ottapidaram and Vilathikulam, sources said.\n\nDindigul\n\nMore than 1,500 government employees including noon meal workers and primary school teachers were arrested when they picketed AMC Road before the Kamarajar Central Bus Stand here on Tuesday pressing 20-point demands. Earlier, they took out a procession from Dindigul panchayat union office to central bus stand. Noon meal worker Palaniammal swooned suddenly. Heavy police posse was deployed at the spot.", 
    "section": "national", 
    "title": "Striking government staff block roads, arrested", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}