{
    "author": [], 
    "text": "Sri Manakula Vinayagar Engineering College, Madagadipet, celebrated college day recently. Film-maker Gautham Vasudev Menon was invited as the chief guest.\n\nV.S.K. Venkatachalapathy, director and principal, welcomed the gathering and presented the annual report. He said that students of the college won almost all gold medals given by Pondicherry University in the past seven years. During 2013-14, students of SMVEC secured a total of 48 top ranks of the Pondicherry University.\n\nMr. Menon later distributed prizes to students who secured first and second places in Pondicherry University exams. Teachers were awarded cash prizes of Rs. 2,000 for producing 100 per cent results in 130 subjects for the 2011 – 2015 batches.\n\nHe urged students to live each and every moment of their life purposefully. He also requested them to understand the importance of friendship and urged them to develop good communication skills for a successful career.\n\nAlumni re-unite\n\nThe 1965 Engineering Technology alumni of Annamalai University once again re-united on January 22 and 23 at their alma mater and celebrated their 50{+t}{+h}anniversary of graduation.\n\nAn endowment fund for a sum of Rs 2.5 lakh was instituted to honour the final year students who produce remarkable project reports.\n\nThe celebration commenced on January 22 evening.\n\nA PowerPoint presentation was made with the photographs of the alumni with spouse and a write-up on their endeavours after graduation. They exchanged fond memories.\n\nThe family members also participated in the event.\n\nOn he evening of January 23, a meeting with dignitaries was organised. Registrar K. Arumugam, dean faculty of E&T C Antony Jeyasekar, and head of Departments of Enginerring participated. The following morning, the alumni were at Pitchavaram for boating in the mangrove estuary.\n\nProfessors A.N. Andiappan, Sathik, P.V. Vaithiyanathan, R. Selvaraj and S. Govindarajan were honoured. Retired professor R. Selvaraj donated a sum of Rs. 1,00,000 to the university for purchase o f equipment.\n\nScholarship programme\n\nDr. Paul’s Engineering College organised the 6{+t}{+h}year scholarship programme on February 5 at Pullichapallam Adidravidar Higher Secondary School to honour the school and subject wise toppers of 2015 Standard X and XII board examinations with a cash prize of Rs.1,35,000.\n\nY.R.M. Rao, principal of the institution, congratulated the students and distributed the amount. Dean E. Marriappane felicitated the students. Headmaster of Pullichapallam Higher Secondary School Mohandass, HOD and staff of Dr. Paul’s Engineering College were present.\n\nBlood donated\n\nThe National Service Scheme (NSS) cell, Youth Red Cross of Priyadarshini Engineering College, Vaniyambadi, along with Rotary Club of Vaniyambadi, Government Hospital, Vaniyambadi, and Rotary Club Mid Town, Vaniyambadi, organised a blood donation camp on February 9. As many as 50 students and staff donated blood. P. Natarajan, college principal, was present.\n\n140 selected at job fair\n\nSri Venkateswara Polytechnic College, Vellore, and TVS Lucas Ltd, Puducherry, jointly organised a special job fair for women candidates on February 12. A total of 283 candidates from 15 polytechnic institutions from Vellore and Tiruvannamalai districts participated. Of this, 140 candidates were selected after preliminary, secondary and final round of tests.\n\nN. Ramesh, chairman of the college, was present.\n\nNational conference on language, literature\n\nBosLit’16, a national conference on “Language, Literature: Newer Perspectives” was organised by the Department of English and Communication, Don Bosco College, Yelagiri Hills, on February 4 and 5.\n\nBhaskaran Nair, professor of English, Hindustan University, and Visaki Devi, assistant professor of English, Pondicherry University, were present. Participants presented research papers.\n\nA collection of research articles, including papers presented during the conference, was released.\n\nC.M. Varghese, principal of the college, was present.\n\nCultural fest held\n\nMarudhar Kesari Jain College for Women organised “Art Smart,” an inter-collegiate cultural meet, on February 13. Events such as singing, dancing, fashion parade, comedy skit, mimicry and mime show were conducted. Competitions including poem writing and painting were also held.\n\nTelevision anchor and film artist Ma.Ka. Pa. Anand was the chief guest. D. Karunakaran, college director, was present.\n\n(Reporting by S.Senthalir and Serena Josephine M)", 
    "section": "national", 
    "title": "Students urged to realise value of friendship", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}