{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Road show to be held in Mumbai to showcase advantages of manufacturing sector\n\n: A delegation from Tamil Nadu will participate in the Make in India week in Mumbai and the State would be projecting its skills in the manufacturing and electronics sector.\n\nA team from the Industries department and the Guidance Bureau will be a part of this venture. “We will be conducting a road show where we will showcase the advantages in the manufacturing sector in Tamil Nadu. There is a major thrust given to the automobile sector in the Make in India week and we are confident of capitalising on it,” said a senior government official who would be part of the team.\n\nTamil Nadu is the third largest manufacturer of electronic hardware in India and the State accounts for 18 per cent of the nation’s electronic output. In the automobile sector, the State is the largest contributor in terms of industrial output and has about 20 per cent of India’s total installed capacity of vehicle production. It aims to reach 5 million units production by 2020.\n\nGlobal Investors Meet\n\nAsked whether the State government had set any target for attracting investments through the programme, the official said, “Like in the Global Investors Meet, we will make a presentation on why one should invest in Tamil Nadu, including the strengths and opportunities. Let the participants take a call.”\n\nThe Global Investors Meetthat was held in September 2015 attracted investments to the tune of Rs 2.42 lakh crore from various sectors, including Information Technology, Manufacturing and Food Processing.\n\nThe Make in India initiative was launched globally in September 2014, as part of the Government of India’s renewed focus on invigorating the country’s manufacturing sector. According to the Make in India website, since its launch, the Government of India has taken several reform initiatives to create an enabling environment that has provided a push to manufacturing, design, innovation and entrepreneurship.", 
    "section": "national", 
    "title": "Tamil Nadu to take part in Make in India week", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}