{
    "author": [
        "R Rajaram"
    ], 
    "text": "Commissioner of Railway Safety gives clearance for the line\n\nThe newly laid double line in the stretch from Tiruchi to Manapparai is likely to be commissioned soon.\n\nThe Commissioner of Railway Safety (CRS),who carried out a detailed inspection in the 37-kilometre electrified section last month, has given his mandatory safety clearance for operation of traffic.\n\nRailway sources told The Hindu that the CRS had given his clearance for operation of rail services in the Tiruchi–Manapparai double line with a maximum speed limit of 90 kmph. The stretch would be thrown open to rail traffic next month.\n\nTwo-day inspection\n\nAccompanied by top officials of the Southern Railway and the Rail Vikas Nigam Limited (RVNL), the CRS conducted a two-day inspection on the newly laid double track from Tiruchi to Manapparai in January last week. This included a high-speed trial run using a special train formation. The new double line would now be connected to the existing single broad gauge line at station yards in this section, the sources said. The existing points and crossings at Samudram railway station falling between Tiruchi and Manapparai would now be removed and it would be converted into a non-crossing station.\n\nThe new second railway track laid in the Tiruchi–Manapparai section is part of the Villupuram–Dindigul doubling project that is being executed by the RVNL, a Government of India enterprise.\n\nThe Rs. 1,000-crore doubling project is being executed in various portions on the 273–km stretch from Villupuram to Dindigul via Tiruchi. Two stretches under the doubling project have already been thrown open to rail traffic.\n\nThe first double line portion opened for rail traffic was from Valadi to Ariyalur (50 km) and the second one was between Vriddhachalam to Tiruvennainallur (40 km).\n\nThe Tiruchi–Manapparai segment will be the third portion to be thrown open for rail traffic under the doubling project.\n\nSources said doubling works in the nearly 45-km Manapparai-Tamaraipadi stretch was likely to be completed in the next financial year.\n\nThe double line in the 8-km stretch from Tamaraipadi to Dindigul Junction had been completed and was ready for safety inspection.\n\nBLOCK BY BLOCK\n\nThis new double line is part of the Rs. 1,000-crore Villupuram-Dindigul line doubling project\n\nThe Manapparai-Tamaraipadi line likely to be doubled in the next financial year", 
    "section": "national", 
    "title": "Tiruchi–Manapparai double line gets safety clearance", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}