{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, theppam, Namperumal purappadu from Sandhanu Mandapam, 3.15 p.m.; reaching Theppakula asthana amndapam, 4.30 p.m.; purappadu from the mandapam, 7 p.m.; theppam, 7.30 p.m.; reaching maiya mandapam, 9.15 p.m.; purappadu, 9.45 p.m.; reaching sanctum sanctorum, 11.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sandhanamedu Sri Anjaneyar Sannidhi, West Gate, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 50-A, Balamurgan Street, Amman Nagar, 6 p.m.\n\nGENERAL\n\nTiruchi Corporation : Council meeting, A.Jaya, Mayor, presides, Corporation office, 11 a.m.\n\nSrimad Andavan Arts and Science College : Graduation Day, V.M.Muthukumar, Vice Chancellor, Bharathidasan University, delivers the graduation day address, 10.30 a.m.\n\nBharathidasan University Department of Environmental Management : Lecture on ‘Earthship,’ by G.R.K. Raju, 2.30 p.m.\n\nNational College Department of History : Awareness lecture on UPSC civil service examination by A. Rajendran, Head, Department of History, Bishop Heber College, 12.30 p.m.\n\nSt.Joseph’s College : Book review, Rev.R.John Martin Sahajanandha, delivers key note address, 4.45 p.m.\n\nBishop Heber College Department of Social Work : Awareness programme on stress management, Holy Cross College of Education, 3 p.m.\n\nJamal Mohamed College : National conference on Myths and realities of business in the digital era,G.Purantran, Director, BATS Business School, inaugurates, 9.30 a.m.\n\nMIET Engineering College Department of Management Studies : Meet on Corporate expectations, M.Sivakumar, General Manager (operations), Rane Pvt.Ltd., chief guest, 10 a.m.\n\nM.A.M.College of Engineering: Guidance on career development, M.A.Mohamed Nizam, College Secretary, inaugurates, Kadar Allaudin, resource person, 2.30 p.m. Hallmark Business School: Training programme on Banking and finance, 10 a.m.\n\nKongunadu College of Engineering and Technology : Seminar on Search engine optimisation by D.Felix Xavier Dhas, 5.30 p.m.\n\nSt.Joseph’s College Department of Physical Education : Centenary tournaments – football, prize distribution by Rev.S.Sebastian, secretary, and Rev.F.Andrew, Principal, St.Joseph’s College, 7 a.m.\n\nJamal Mohamed College Civil Services Examination Study Centre and S-IAS Academy: Seminar on ‘How to prepare for civil service examination, K.Allaudin, Director, S-IAS Academy, Semumu Mohamad Ali and Mathuram Selva Raja of the academy, speak, 10.30 a.m.\n\nHallmark Business School : Student conference on Contemporary issues and innovations in business and management, P.Arangasamy, Director, CEPT, Periyar Maniammai University, speaks, 10 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}