{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Antisocials use them for illegal activities; there is no basic infrastructure\n\n“If public toilets are not clean, they are a public waste…” is how environment-conscious citizens respond to the present condition of public toilets.\n\nWhen a team from Quality Council of India conducted a survey as part of Swachh Bharat initiative in Madurai recently, at least 80 per cent of the respondents said that there was no basic infrastructure in public toilets and their upkeep was far from satisfactory.\n\nThe city, which has 100 wards, has as many toilets in public places. Be it in bus stand or government hospitals or near parks, the toilets are in bad shape. Negligence on one hand and misuse on the other come in handy for antisocials, who use these toilets for all illegal activities.\n\nIt is an unpleasant experience to step into toilets at bus stands, especially those at Mattuthavani integrated bus stand, which is visited by close to 40,000 people round the clock. The stench is unpleasant and unbearable. If Mattuthavani toilets are classic examples for poor upkeep, those in public parks are even worse.\n\nA toilet in the park near Meenakshi Sundareswarar Temple, thronged by pilgrims and tourists, is unclean and unhygienic. Either there is no water or there is abundant water flowing on the road, says Murugesan, a shopkeeper in the area.\n\nWhen The Hindu team visited a few public toilets, based on the survey released by the Ministry of Urban Development, in Vandiyur, Avaniapuram, north bank of the Vaigai (near Sri Meenakshi Government College for Women), Meenakshi Park (near Meenakshi Temple), BB Kulam, Thirumalai Naick Mahal and near Thathaneri burial ground, they were far from satisfactory. Similarly, the community toilets in Anaiyur, Vaithianathapuram, Melathope, Anna Nagar and Sellur too were more (mis)used for illegal purposes as many among them were abandoned. The ‘green’ toilet concept launched in R.R. Mandapam by the Corporation too remained a non-starter, thus forcing public to the use road for urination.\n\nWho manages these toilets?\n\nThough, for official record, Corporation authorities said that toilets — public and community managed ones — were entrusted to eligible self-help groups, actually, it is not so. The toilets are managed by people close to those in power.\n\nA bidder, participating in the tender, can succeed only when the ruling party councillor from the ward or zone approves the name, admit Health Department officials. “Though running a toilet is seen as highly lucrative, it stands only second in line since operating a liquor bar attached to a Tasmac outlet is considered the number one business in the city,” the officials confide.\n\nHowever, commuters at Mattuthavani bus stand unanimously say that collecting Rs two or five for using the toilet is not an issue.\n\n“We are equally concerned about the environment. But what prevents the contractors from not maintaining them well? The Corporation should keep a close watch and impose fines or blacklist the agency for poor upkeep. Passengers, especially devotees on pilgrimage, face difficulties in using public toilets,” they say.\n\nAlagiri’s idea buried\n\nInspired by the public toilets in New Delhi, former Union Minister M.K. Alagiri roped in a few corporate houses and trade/industry associations to construct toilets on the lines of the ones in the national capital. Soon, the idea was executed in 10 locations. As part of their CSR activity, corporate houses were made to maintain the toilets and allow public to use them free of cost.\n\nHowever, after the DMK lost and the AIADMK came to power, the free-to-use toilets were converted into pay-and-use but are not maintained properly. Politics in toilet has stalled a public utility from being put to good use.\n\nThe Centre for Environmental Services, an NGO, which sprinkled the idea of clean and green society at micro level in the city two decades ago, has now taken up sanitary cleaning in a big way in Central government offices, universities and educational institutions and many private establishments by engaging a whopping 2,000 conservancy workers.\n\nCENS founder S.V. Pathy says that there are a plenty of machines available in the market, with which toilets can be cleaned in a better and hygienic way without using hands.\n\nAt least, in the next round of Swachh Bharat survey, Madurai should figure in Smart Cities Mission and scale to the top from the present 26{+t}{+h}position.\n\nFor now, the good news is that new Corporation Commissioner Sandeep Nanduri has promised to work hard to bring Madurai on top in the next round.", 
    "section": "national", 
    "title": "Toilets turn public inconvenience", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}