{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Crop raised on 300 hectares in Thanthoni block under the new method\n\nAn official (right) and a farmer study the growth of red gram crop which was raised after transplantation at Thamanayakkanpatti in Karur district.— PHOTO: A. MURALITHARAN\n\nCultivation of red gram by transplantation method has gained momentum in Karur district.\n\nThe method was not popular until 2012. Till then farmers were raising red gram by direct sowing, requiring a large quantity of seeds.\n\nAs per the new method, farmers raise red gram nurseries similar to paddy nurseries. It requires just one or two seeds for raising seedling in a polythene cover. The seedlings are then transplanted on field after 20 to 25 days. The crop, after 30 to 35 days old, should be nipped so as to multiply its branches.\n\nStudy undertaken by agricultural officials revealed red gram transplantation method was a better, convenient, high yield, and cost-effective than the traditional method of cultivation.\n\nThe new method requires just 2 kg of seeds as against 12-15 kg seeds sown in the traditional method on a hectare of land.\n\nSince the transplantation was done by giving sufficient space between saplings, the crops grow healthy.\n\nIt reduces the chances of pest attack too.\n\nNot many had shown interest to raise red gram in the district when the method was introduced. However, concerted efforts to create awareness on adapting to new method have started bearing fruit.\n\nAgricultural officials said red gram had been raised on 300 hectares under the new method in Thanthoni block in the district alone.\n\nMore and more farmers were coming forward to follow the method.\n\nS. Shoba, Assistant Director of Agriculture, Thanthoni block, told The Hindu that red gram cultivation, through transplantation method, had made inroads in the district. If the present trend continued, there was a possibility of doubling the red gram area coverage within a few years.\n\nAs many as 6,250 seedlings could be transplanted per hectare with just 2 kg of seeds. The yield would be between 800 and 1,000 kg as against 650 and 700 kg.\n\nAdding value to the method was the adaption of drip irrigation.\n\nA few farmers had installed drip irrigation for raising red gram by availing 25 per cent subsidy from the government under the National Agricultural Development Programme.\n\nS. Sivasamy of Thimma Naickenpatti, who had installed drip irrigation, said that overhead cost such as seeds, water charges, and clearing weeds had come down due to the adaption of red gram transplantation.", 
    "section": "national", 
    "title": "Transplantation proves effective in red gram cultivation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}