{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "There are strong indications that there will be two campuses for the Bharathiar University Constituent College of Arts and Science –at Sivagiri for undergraduate programmes and at Ezhumathur, about 12 km apart, for postgraduate programmes – in Modakurichi Assembly segment in the district.\n\nIn all likelihood, the undergraduate programmes will continue to be offered through a new permanent facility to be created in Sivagiri town itself where the college has been functioning temporarily out of the Government Boy’s Higher Secondary School.\n\nThe foundation stone for the permanent buildings will be laid in due course, local sources said.\n\nThe college started functioning out of the school during 2012 with five courses: BA English Literature, BSc Mathematics, BBA (CA), B.Com (CA) and BSc Computer Science. B.Com was offered as the sixth undergraduate programme from 2014.\n\nThe undergraduate strength witnessed a nearly six-fold increase over four years from just 250 in the first year. Besides, four PG programmes were introduced last year with intake of 50 each: M.Com CA, M.A. English, M.Sc. Computer Science, and M.Sc. Mathematics.\n\nIn undergraduate as well as postgraduate programmes, two-third of the students constitute girls. Students from more than 50 villages in the surroundings benefit from the only arts and science college in Modakurichi Assembly constituency.\n\nAnd most of the students are first generation graduates belonging to SC communities.\n\nLast year, when the foundation was laid for the new campus at Ezhumathur where the State Government allotted 25 acres, the decision on location did not go down well with residents in Sivagiri town and surrounding villages who wanted the new buildings to be constructed in the same town.\n\nThe Town Panchayat had adopted a resolution to provide land in its possession free of cost in its limits for construction of the building. Through sustained demonstrations during the latter part of last year, the residents joined hands rising above political considerations to impress upon the Government the need for retaining the college in Sivagiri considering its easy accessibility from Arachalur, Kodumudi, Modakurichi, Chennimalai, Muthur and other important towns.\n\nMeanwhile, the district administration approached the university seeking permission for start of a second college in Modakurichi segment so that the colleges could function separately in Sivagiri and Ezhumathur.\n\nUltimately, the final decision of the government appears to favour two campuses for the college.", 
    "section": "national", 
    "title": "Two campuses likely for BU arts and science constituent college", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}