{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Though 100 spots were commissioned, only 9 have been identified\n\n‘Amma Kudineer Thittam’, the newly launched scheme to supply 20 litres of purified drinking water to the poor in the city has hit a block. The scheme is expected to be launched in only nine locations in the first phase, because, to make the scheme fully operational, 91 more plots measuring 1,000 sq.ft. have to be identified across the city.\n\nChief Minister Jayalalithaa recently announced this scheme, which was to be commissioned at 100 spots. However, the civic body has identified only nine places where the project could be implemented.\n\nThe officials are finding it difficult to find Corporation land to launch the project in its entirety, since many of the land records that belong to the civic bodies were reportedly not handed over to Ripon Buildings properly after the merger of 42 local bodies with the Greater Chennai Corporation in 2011. Many such plots belonging to the Greater Chennai Corporation have reportedly been encroached upon. The current project requires 1,000 sq.ft. of land in a locality to supply 2,000 litres of water per hour to the residents there, an official said. But most of the vacant lands that are available with the civic body are parks, playgrounds and OSR (Open Space Reserve) lands, which cannot be used for commissioning such plants, due to statutory restrictions. The civic body is planning to expand the capacity of the plants to 4,000 litres per day to increase the number of beneficiaries.\n\nOnce the facilities are commissioned, each of the families would get 20 litres of purified drinking water per day after swiping a card. The design — fabricated or civil structure — will also be modified according to the locality and the space available.\n\nGroundwater is likely to be used for the plants in most of the localities. This is also likely to affect the ground water level in the residential neighbourhood. The civic body is trying to find alternatives to groundwater in neighbourhoods that may face resistance from residents.\n\nThe earlier plan of the Corporation was to offer eight lakh cans of packaged drinking water every day to residents of all the zones in the city.\n\nThe plan was changed after owners of packaged drinking water plants in the city and its outskirts were unable to support the initiative that involved the procurement of empty water cans at Rs.16 crore.\n\nOfficials face difficulties in finding enough Corporation land to launch the scheme", 
    "section": "national", 
    "title": "Unavailability of land may hinder free water scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}