{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Though the garment manufacturers eased their stance a bit, the impasse continues in the wage revision talks between the trade unions and the textile associations to finalise the next wage agreement for workers in the knitwear sector.\n\nOn Tuesday, the six textile associations, which were involved in the talks with the eight trade unions, proposed a 24 per cent increase in the wages from the previous four-year wage pact which expired on January 30.\n\nIn the earlier rounds of talks, the textile associations were adamant that they would give an increase of 19 per cent spread over four years against the trade unions' demand for 100 per cent increase in wages.\n\n“We have now offered 24 per cent increase over a period of four years with an increase of 15 per cent in the first year followed by 3 per cent hike in each of the subsequent three years,” said R. Damodaran, joint secretary of South India Hosiery Manufacturers Association.\n\nThe textile associations taking part in the talks include South India Hosiery Manufacturers Association, Tirupur Exporters Association, Tirupur Exporters and Manufacturers Association, Knit Cloth Manufacturers Association, South India Imported Machine Knitter Association and Tirupur Export Knit Manufacturers Associations.\n\nThe trade unions involved in the wage agreement were CITU, AITUC, INTUC, LPF, MLF, ATP, BMS and HMS.\n\nCITU State secretary M. Chandran told The Hindu that the trade unions would stand by its demand for a 100 per cent increase in wages not from the scales mentioned in the previous pact but from the minimum wages fixed by the State Government for the garment workers in general.\n\n“We will also persist with the demand for introduction of perquisites like house rent allowance and educational assistance for children of knitwear workers,” Mr. Chandran said.", 
    "section": "national", 
    "title": "Wage talks remain inconclusive", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}