{
    "author": [
        "Staff Reporter"
    ], 
    "text": "60 State Transport Corporation staff participated\n\nThe three-hour-long programme dealt with leadership skills, stress management, team work and ways to balance work life.- Photo: C. Venkatachalapathy\n\nAway from the congested city roads, soaring heat and blaring horns, a group of bus drivers and conductors spent three hours in the midst of a serene residential locality learning how to manage their time better and be free from stress.\n\nIn an effort to help their staff cope with workplace stress, the Tamil Nadu State Transport Corporation (Villupuram) Ltd, Vellore region, conducted a refresher training programme for about 60 employees, including bus drivers, conductors and technical staff.\n\nP. Senthil Kumar, corporate trainer, said the three-hour long programme dealt with leadership skills, stress management, team work, time management and ways to balance work life.\n\n“This was more about soft skills training for the employees. Through this refresher programme, we wanted to help them reduce work pressure and find success both in their personal and professional lives. It is important that they are happy at work. That planning is crucial for time management was also highlighted,” he said.\n\nWill help prevent accidents\n\nOfficials said bus drivers and conductors were prone to high stress levels owing to long hours of work. Such refresher training programmes will go a long way in preventing road accidents involving their buses, an officer said.\n\nIn fact, the TNSTC employees were already attending yoga classes in batches from various depots.\n\nP.N.R. Sampath, foreman with 36 years of service, said the training acted as a motivating factor, while another participant remarked that it was a relaxing experience.\n\n“This was an opportunity to learn how to reduce stress in our life. It will be useful if such refresher programmes are organised for us at least once in two or three months,” J. Arul, a TNSTC staff said.\n\nN. Ramesh, general manager, TNSTC, Vellore region, said the feedback from the participants was good. “The objective of the refresher programme was to help them manage stress and time better. As the feedback is good, we are planning to continue to conduct such programmes,” he said.", 
    "section": "national", 
    "title": "Workshop to counsel bus crew on handling stress", 
    "subsection": "tamilnadu", 
    "date": "2016-02-17"
}