{
    "author": [
        "Special Correspondent"
    ], 
    "text": "All efforts will be taken to ensure free and fair elections. Besides, stern action will be taken against those who violate the model code of conduct, Collector M. Mathivanan told the representatives of recognised political parties here on Friday. So far 88 cases of violations have been registered in the district.\n\nAddressing an election preparatory meeting, he said strict rules on movement of cash and conduct of meetings were being enforced. While every effort was being taken to avert discomfiture to the public, vehicle checks would be carried out to check transport of cash and articles.\n\nThere were 1,152 polling stations in Tiruvarur district. Of them, four polling stations in each of the four Assembly constituencies would be established as model stations. In Tiruthuraipoondi (reserved) constituency, one polling station in Kottur, Pallankoil, Tiruthuraipoondi and Edaiyoor would be model station while one each in Nidamangalam, Melanagai, Mannargudi and Ilakkanampettai in Mannargudi constituency, one polling station each in Koradachery, Vijayapuram, Marakkadai, and Pulivalam in Tiruvarur Assembly constituency and similar numbers in Nannilam, Koil Thirumalam, Viruppacchipuram and Kudavasal in Nannilam constitutency would be model polling stations. He said only woman officers would be appointed to conduct and monitor polling in one woman polling station in each of the four constituencies. Even the police personnel present there on duty would be women, he added requesting the representatives of the political parties to nominate only women agents to those polling stations. On cases of violations, he said a total of 88 cases have been registered in Tiruvarur district. Nannilam constituency tops the list with 35 cases, followed by Tiruthuraipoondi 28, Mannargudi 16 and Tiruvarur nine. Action would be taken within 24 hours of the complaint with the special cell in Tiruvarur or in Chennai on cases of violations, the Collector assured.", 
    "section": "national", 
    "title": "88 cases of violations in Tiruvarur district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}