{
    "author": [
        "Deepa H", 
        "R Srikanth"
    ], 
    "text": "The Highways Department is laying a footpath on the southern arm of the Inner Ring Road extension from Velachery railway station to GST Road —Photo: M. Karunakaran\n\nThe southern arm of the Inner Ring Road (IRR) extension between Velachery railway station and GST Road is undergoing some infrastructure changes bringing cheers to the public. The five-kilometre stretch has been attracting a huge number of walkers as there are few disturbances in the form of commercial establishments or vehicular population.\n\nS. Ananthanarayanan, a resident of Balaji Nagar Main Road in Puzhuthivakkam, said the IRR had become a famous place for residents to engage in walking because of lesser pollution and a wide carriageway. However, the walkers have been facing difficulties due to the reduction of the road width for carrying out construction of railway stations at Puzhuthivakkam and Adambakkam.\n\nMoreover, walkers have been complaining about lack of any footpath on the road. But the grievance seems to have been heard by the State Highways department, which is engaged in constructing a footpath.\n\nA senior official of the highways department said infrastructure works totalling Rs. 12 crore had been taken up on the southern sector of IRR. These include laying two-metre wide granite footpaths for a length of three kilometres on both sides of the road. Also, pedestrian facilities in the upcoming railway stations in Puzhuthivakkam and Adambakkam will be taken up after the completion of the station works.\n\nThe official said, “Many residential areas and commercial establishments have come up along the road and the road is also used by pedestrians for fitness purposes. The footpaths will also have properly designed ramps and bollards to prevent vehicles from using the space.”\n\nThe work, which began in the first week of February, is expected to be completed by September. Also included in the work is re-laying of the road and repairs to the Thillai Ganga Nagar subway. After the heavy rains, cracks have developed in the subway leading to leakage of water. Sources said that a crash barrier was also being constructed in the middle of the subway to prevent accidents from taking place.", 
    "section": "national", 
    "title": "A makeover for IRR with footpath, other facilities", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}