{
    "author": [
        "T Madhavan"
    ], 
    "text": "The barricades put up at Ganga Nagar in Moovarasampet to keep heavy vehicles at bay —Photo: G. Krishnaswamy\n\nDriving on the interior roads of Moovarasanpet after dusk is a horrendous experience for motorists, largely due to the barricades that have been erected to restrict heavy vehicular movement.\n\nRavi Balakrishnan, a resident of Old Pallavaram, said that several poorly designed steel barricades had been installed at Ganga Nagar and Raghava Nagar by residents to ‘prevent’ heavy vehicles from using the roads.\n\nBut these barricades have ended up posing a risk to motorcyclists. The one on Yamuna Street in Ganga Nagar and Raghava Nagar Second Main Road lack any indicators to caution the motorists.\n\nBesides Yamuna Street, Vaigai Street, Thungabadra Street and Raghava Nagar 3rd and 2nd Main Roads also have barricades.\n\nAll these roads are important as they lead to interior streets. Several motorists complain that vehicles get damaged due to these barricades.\n\nA traffic police officer in Madipakkam said they had informed the residents’ associations concerned to remove them whereas the residents justified the move by saying it was necessary to curb rash driving by heavy vehicles, especially lorries transporting gravel, from units in Tirusulam.\n\nAnyone who has driven down Velachery Main Road from East Tambaram towards Velachery has to be careful as the police put up barricades in the middle of the road, and they are easily visible at night.\n\nThese steel barricades are dangerous as they lack reflectors. During one of the rides recently, a lorry driver dashed against a barricade, which fell on a two-wheeler rider.\n\n“Though he escaped unhurt, several motorists gathered around blamed the police for using such a ‘poorly-lit place’ for putting up temporary barricades to carry out checks,” said R. Ravi, an auto driver.\n\nWhile the police say that these barricades have reduced the number of accidents on several stretches, road users complain that they are often an inconvenience.\n\nPeople who are new to the area could collide with the barricade.\n\nThe police, however, said these barricades had been installed only in areas that were prone to speeding and accidents, after analysis.\n\nMany road users attempted to circumvent the barricades or travel at high speed, which could displace the barricades, a senior police officer said.", 
    "section": "national", 
    "title": "Barricades pose a risk to motorists", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}