{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "M. Surya Dharshini is working with the twin objectives of playing for the country and becoming an IPS officer.\n\nAs an 11-year-old girl, M. Surya Dharshini watched in awe girls dribble and pass in lightning speed and shoot the ball in style in an inter-district basketball match, little realising that she would play for Tamil Nadu in the Junior Nationals, six years later.\n\nShe was a class VI student of a school in Karaikudi when she witnessed the match between Salem and Erode only to develop an interest in world’s most popular sports and move to Erode to join Bharathiya Vidya Bhavan School to hone her skills in sports.\n\nHer love for the game, hard work and perseverance took her to greater heights and she brought laurels to the district by playing for Tamil Nadu in Junior National Basketball Championship held in Ludhiana in Punjab in October last.\n\nMs. Surya Dharshini became the first player from the district to play for at the national level since 1985, and Collector S. Malarvizhi honoured her with a bouquet, when she called on her at the Collectorate here recently. “The Collector commended my achievements and it was a memorable moment,” the girl told The Hindu .\n\nNow a first-year student of PSGR Krishnammal College for Women in Coimbatore, Ms. Surya Dharshini, trained by Indian coach Surendar, was working with the twin objectives of playing for the country and becoming an IPS officer. A power forward and shooter, she is eyeing the forthcoming Senior Nationals.\n\nShe spends six hours a day in the basketball court and an equal time for her studies. Her father Muthuvel Murugan, Head Constable attached to Karaikudi North police station, has been a great source of inspiration, she says.\n\nMs. Surya Dharshini joined class VII in Bhratiya Vidya Bhavan School in Erode in 2010 after learning that it groomed basketball players. The very next year, she played in the inter-district championship held in Tiruchi and got selected to represent Tamil Nadu in Mini National Basketball Championship held in Himachal Pradesh.\n\nShe has also represented Tamil Nadu in the national-level championship, conducted by School Games Federation of India (SGFI), and as a class IX and X student, played for Tamil Nadu in Panchayat Yuva Krida Aur Khel Abhiyan (PYKKA) games, conducted by the Ministry of Youth Affairs and Sports.", 
    "section": "national", 
    "title": "Basketball star shines from Sivaganga after three decades", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}