{
    "author": [
        "S Ganesan"
    ], 
    "text": "Railways and Highways have differences over valuation of land\n\nWith the land acquisition issue prolonging, the Highways Department has gone ahead with the construction of service road along a section of the Aristo Roundtana bridge in Tiruchi on whatever land was available.— PHOTO: A. MURALITHARAN\n\nImportant components construction of the multi-level bridge near the Railway Junction in the city continues to be hampered as the Railways and Highways Department are yet to reach an agreement on the value of the Railway land to the transferred for the project.\n\nGiven the delay in the transfer of the Railway land, the Highways Department has commenced laying service lane along the Dindigul Highway in the available space so that at least light vehicles could use the section.\n\nLaying of service lane along the Railway Junction-Dindigul highway arm of the bridge and other components of the bridge project have been hampered as an agreement is yet to be reached between the Railways and the Highways Department on the transfer of about 5,100 square metres of Railway land for the project. The highways had sought the transfer of about 2,000 square metres for the first phase.\n\nThough long drawn out parleys have been under way between the Railways over the past few years, a solution still eludes the issue. At the centre of the dispute is the basis for the fixation of the land value.\n\nWhile the Railways is said to have given a draft agreement to be signed by the Highways Department, sources in the latter say the land value fixed by the Railways was too high. According to sources, the Railway authorities had fixed the value of the land taking the 2012 guideline value as the base and claimed value appreciation for each subsequent year. This reportedly works out to nearly Rs. 9 crore for 2,000 square metres which is sought for the first phase.\n\nHowever, Highways Department sources point out that the guideline value fixed in 2012 by the government remains the same till date and the Railways cannot claim annual appreciation. The Railway authorities are said to be maintaining that the value has been fixed as per their norms. Highways Department officials are worried that such high valuation would lead to heavy cost escalation. Besides, the draft agreement has several conditions which are not acceptable to the Highways Department, the sources said. The Chief Engineer (Projects), Highways, made an inspection of the project site recently and is expected to take up the matter with the Chief General Engineer, Railways, in Chennai soon.\n\nMeanwhile, the Federation of Consumer and Service Organisations has taken up the matter again with the Tiruchi MP P. Kumar.\n\nM. Sekaran, president of the federation, said the Railways should come forward to provide land at reasonable price in the interest of the public.\n\n“People should not be made to suffer,” he said.\n\nOver the past few days, the Highways Department has taken up work on laying a service lane along the Dindigul Highway although the space available is of differing width ranging from three to seven metres. But the move was intended to facilitate movement of at least light vehicles and help relieve the congestion to a certain extent, Highways sources said.\n\nThe first stage of the new flyover is scheduled to be completed by February 2017 and the second stage by 2019.", 
    "section": "national", 
    "title": "Bridge construction slows down", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}