{
    "author": [
        "Staff Reporter", 
        "Karthik Madhavan"
    ], 
    "text": "Case against two\n\nThe Perur All Women Police have registered a case against a village administrative officer and his mother based on a complaint from his wife, Punitha. The 29-year-old woman had told the police that her husband, Sivakumar, VAO, Saravanampatti, had abused her using caste name, and tried to take away her monthly salary. The two, who were of different castes, were married around two years ago. The woman worked at a bank in Sivananda Colony.\n\nSecurity at temple\n\nTense moments prevailed at the Koniamman Temple for a while on Friday morning as a few Bharat Sena members wanted to do anga pradakshanam to pray for the defeat of the political parties that worked against the interests of Hindus. The Coimbatore City Police had denied permission for the event but the Sena members said they would go ahead.\n\nWhen they reached the temple, the Police had a tough time denying them permission. After much wrangling, the members left the place by only offering worship.\n\nProperties to be auctioned\n\nThe Economic Offences Wing Police will auction the seized properties of promoters of two firms whose owners are accused of cheating investors. A release from the police said that they would on March 30 auction the properties of the owners of Veltex, a firm based out of Tirupur, and Marudhamalai, a firm based out of Coimbatore. The value of properties that would be auctioned was estimated to be around Rs. 50 lakh, the police said and added that they conducted the auction based on permission given by the authorities concerned. The police had arrested five persons in connection with the case.\n\nConvict dies\n\nPalani (56), a murder case convict who was lodged at the Coimbatore Central Prison, died on the way to Coimbatore Medical College Hospital. The prison authorities were rushing him to the hospital on Thursday after he complained of chest pain. He was a native of Pethiampatti near Tharamangalam in Salem.", 
    "section": "national", 
    "title": "CRIME NOTES", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}