{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Police investigating the attack that left Dalit youth Sankar dead and his wife Kausalya grievously injured at Udumalpet in Tirupur district on March 13 have gathered incriminating proof, including scientific evidence and statement of eyewitnesses, to corroborate the sequence of events, role of the girl’s father and the identity of assailants, police sources said on Friday.\n\nThe investigation was nearing completion in the sensational case that triggered public outrage after visuals of the gruesome killing recorded by a surveillance camera installed in the vicinity of the crime scene went viral in the social media.\n\nBesides recovering the weapons used to commit the offence and some blood-stained clothes from the possession of four suspected assailants held in Dindigul district a couple of days after the incident, investigators found that the conspiracy was chalked out after Chinnasamy, the girl’s father, made a last attempt to bring his daughter back home. The accused discussed the plan in a lodge a day before the attack.\n\nIn an apparent bid not to give caste colour to the murder, the conspirators made sure that the assailants belonged to different communities, including a Dalit. “Chinnasamy was constantly in touch with the assailants. He showed them the house where his daughter lived with Sankar and his family. One of the two motorcycles used in the attack was given by Chinnasamy and the other was a stolen one. He paid Rs. 50,000 to get his own daughter and her husband murdered,” a senior police official said\n\nParrying questions on the outcome of the identification parade in the Coimbatore central prison where Kausalya was taken to identify the assailants early this week, the official who spoke on condition of anonymity, said that there was enough evidence to prove their involvement. “A few eyewitnesses have also come forward to give evidence. Investigation is nearing completion and we hope to file charge sheet in a week or two. Efforts will be made to conduct trial in a fast track court,” he said.", 
    "section": "national", 
    "title": "Dalit murder: police find incriminating evidence", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}