{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "With companies occupying spaces at the major IT parks in the city, is Coimbatore finally seeing the Information Technology sector taking off ?\n\nSome say yes and others say there are issues that still need to be addressed.\n\n“There is actually not much supply of space in Coimbatore now,” says a NASSCOM official.\n\nThe city has its advantages in terms of roads, drinking water supply, educational and healthcare infrastructure and talent availability.\n\nThe main areas of concern here are the need for more job opportunities for the spouses of the IT/ITES employees and connectivity.\n\nHowever, there is a demand here next to Chennai in the State, the official added.\n\nThere are companies that are looking at Coimbatore, especially after the floods in Chennai. Local IT companies have also occupied space in the IT parks.\n\nThis has resulted in Tidel Park now reaching almost full occupancy.\n\nHowever, the growth in requirement is normal and there is no spurt in demand for IT space. In fact, there are several independent buildings that offer smaller spaces for IT/ITES companies outside the special economic zones and are looking out for clients, according to an IT entrepreneur here.\n\n“We are in an interesting transition phase. We still have a long way to go,” says S. Prashanth of Quadra Systems.\n\nAshok Bakthavathsalam, Managing Director of KGiSL, says major companies that took area at Coimbatore Hitech Infrastructure Limited have expanded operations. Awareness is improving on the potential in Coimbatore for IT companies.\n\nThough there are not many large IT companies that have started operations here, mid-sized companies are looking at Coimbatore because of availability of talent and cost advantage compared to the metro cities.\n\nRegarding start-ups, “We need to wait and see if start-ups will create a wave here. We will know in a year or two. The ecosystem for start-ups needs to be carefully nurtured,” he says.", 
    "section": "national", 
    "title": "Demand for IT space rises", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}