{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The alliance plans to highlight unfulfilled promises of the AIADMK government\n\nThe DMDK - People’s Welfare Front (PWF) alliance is planning to meet one lakh voters in each of the 13 constituencies in Vellore district through door-to-door campaign from March 28. They will promote awareness on the alliance’s election manifesto and common minimum programme through this campaign.\n\n“We will reach out to one lakh voters in each of the 13 constituencies by April 2. We will meet them at their doorsteps and distribute pamphlets on the election manifesto and common minimum programme,” A. Narayanan, PWF alliance coordinator for Vellore district told reporters.\n\nA meeting of district secretaries of the DMDK – PWF alliance was held on Friday. The alliance will organise street corner meetings from April 5. They are also forming booth-level committees and vigilance committees, which will monitor and prevent distribution of cash to voters, he added.\n\nThe alliance plans to highlight unfulfilled promises of the AIADMK government in Vellore.\n\n“The Chief Minister had announced that the Vellore New Bus Stand will be expanded and developed like the Koyambedu bus terminus. The plan was to expand the terminus utilising 13.75 acres of land in the adjacent area but nothing has happened till now,” he added.\n\nAnother issue that they plan to highlight is the lack of new industries in the district. “The government said new industries and IT park will be established in Vellore. Both the DMK and AIADMK governments failed to establish industries in the district in the last 10 years,” he said.\n\nMr. Narayanan said old age pension has been stopped for 3.5 lakh beneficiaries in the district without any information, and this too, will be taken up during the campaign. They said that infrastructure of the Vellore Corporation areas has not improved, and the underground sewerage scheme was not implemented properly.\n\nCurbing sand and stone quarrying will also be one of the agendas of the alliance’s campaign in the district.\n\nOn April 4, DMDK leader Vijayakant’s wife Premalatha will address a public meeting in the district. N. Subramanian of the MDMK was present.", 
    "section": "national", 
    "title": "DMDK-PWF to meet 1 lakh voters in each constituency", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}