{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Wants EC to stop all payments till polls are over\n\nThe DMK on Friday petitioned the Election Commission alleging that the State government had distributed flood relief money after the Model Code of Conduct had come into effect.\n\nThe complaint filed by R.S. Bharathi, the organisation secretary of the DMK, alleged that the party had received reports from various parts of Tamil Nadu that banks were crediting flood relief funds to the account holders, “favouring the ruling AIADMK”.\n\nIn his complaint, Mr. Bharathi pointed out the case of one G. Vasanthi, residing in Pallavaram in Chennai, in whose account Rs. 5,000 was credited under the head ‘Flood-Relief-20’.\n\nThis, he said, “clearly shows that the banks are in violation of the Model Code of Conduct, colluding with the ruling AIADMK party people in the area concerned.”\n\n‘Give directions to banks’\n\nMr. Bharathi urged the Election Commission to issue a direction to all banks in the State to not credit any amount either as flood relief or any other government scheme till the code is in force.\n\nState CEO Rajesh Lakhoni said the Commission would look into matter, and if found true, take necessary action.\n\nThe Election Commission will hold an all-party meet on Saturday morning and brief the parties about guidelines on the MCC and expenditure by parties.\n\nNo Smoking Zones\n\nMeanwhile, the Commission, for the first time, has declared all polling stations in Tamil Nadu as ‘No Smoking Zones’. “While voters normally don’t smoke, sometimes the booth agents use the premises to smoke. We have invoked the provisions of the Tobacco Control Act and will be enforcing this,” Mr. Lakhoni said.\n\nEC to hold all-party meet today to brief the parties about guidelines on the MCC, expenditure", 
    "section": "national", 
    "title": "DMK sees flouting of model code in flood relief credit", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}