{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "City roads are all set to get more parking spaces, bus bays and wider carriageway. To create these facilities, Greater Chennai Corporation would use the land it has received from residents through registered gift deeds.\n\nDevelopment regulations stipulate that any resident seeking planning permission should hand over a certain portion of the land along roads as a registered gift deed to the civic bodies concerned for street alignment and road widening.\n\nThe Corporation has planned to retrieve 250 pieces of such land that have already been obtained through registered gift deeds from residents along many of the 471 bus routes in the city.\n\nCurrently, many pieces of such are not being put to optimum civic use.\n\n“Some of these pieces of land are likely to be encroached upon in the long run. All of them will be cleared after the Assembly elections,” said an official.\n\nFor example, more than ten pieces of land along 4 km of Arcot Road have been handed over to the civic body. More than 450 property owners may lose some land during widening of Arcot Road. Ahead of the widening of the road, the civic body will use the land already handed over by residents for developing bus bays or parking lots.\n\nSome of these pieces of land will be used for widening of carriageway. Most of them will be used for developing parking spaces or bus bays.\n\n“We will be able to use such land for creation of a wider carriageway only after other lands are acquired,” said an official.\n\nThe civic body has already identified 24 roads for road widening. After the Greater Chennai Corporation Council passed a resolution, the consultant has completed work on preparation of land plan schedule for ten roads including Sardar Patel Road, Arcot Road, Kaliammankoil Street, Santhome High Road, Velachery Main Road and Strahans Road.\n\nThe survey numbers of the plots, part of which are expected to be taken away, have been identified.\n\nThe government will decide on either issuing Transfer of Development Rights or making land acquisition after the elections.", 
    "section": "national", 
    "title": "Efforts are afoot to widen bus route roads", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}