{
    "author": [], 
    "text": "SALEM\n\nSri Dasarathi Kaingarya Kaingarya Trust and Kinjitkaram Trust: ISKCON bhajan, 5 p.m.; Upanyasam by Velukkudi U.V. Krishnan Swami, Sumangali marriage hall, 6 p.m.\n\nRamakrishna Mission Ashrama: Narai S. Nellaiappan speaks on ‘Swami Akhandanada’s life’, 7 p.m.\n\nSri Skandashraman Trust: Srimad Sadguru Sanathananda Swamigal’s jayanthi festival, Sri Mahanyasa jabam, sri rudra jabam, abishekam, 6.30 am.; deeparadana, 11 a.m.; special poojas and parayanam, 6 p.m.; Veeramani Raju renders devotional songs, 4 p.m.\n\nTamil Nadu Science Forum: Monthly science lecture, Ajith speaks, TNMSRA building, Koranguchavadi, 6 p.m.\n\nSalem Productivity Council: Training programme on ‘Labour laws with recent amendments’, V. Chandrasekaran, industrial law and labour law practitioner, resource person, SPC bhavan, 10 a.m.\n\nSona College of Technology: Graduation Day, Rahul Kadri, Principal architect, I. M. Kadri Architects, chief guest, R. A. Krishnakumar, Executive Director, Dalmia Cement (Bharat) Limited, Dalmiapuram, speaks, C. Valliappan, Chairman, presides, 10.30 a.m.\n\nDistrict Employment Exchange: Training programme for Staff Selection Commission aspirants, 10 a.m.\n\nNAMAKKAL\n\nPGP College of Engineering and Technology: National-level conference on Modern emerging engineering trends, Sriram from National Institute of Technology Tiruchi, resource person, 10 a.m.\n\nPaavai Educational Institutions: Graduation Day, S.K. Patnaik, Director, AICTE, New Delhi, chief guest, N.V. Natarajan, chairman, presides, 2 p.m.\n\nTIRUCHENGODE\n\nVivekanandha Institute of Engineering and Technology for Women: NSS special camp, inauguration, M. Karunanithi, Chairman, presides, Panchayat Union School, Kosavampalayam, 10.30 a.m.\n\nRASIPURAM\n\nMuthayammal College of Arts and Science: Achievers Day, R. Venkatachalapathy, Professor of Geology, Periyar University, speaks, 2 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}