{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has refused to dissolve a marriage after disbelieving the husband’s claim that his wife was suffering from paranoia, suspecting the medical certificate produced by him. The medical certificate was issued by a doctor, who was his long-time acquaintance and his sister’s classmate.\n\nDismissing an appeal filed by the man challenging Tirunelveli Family Court’s refusal to grant divorce, Justices S. Manikumar and C.T. Selvam said that the order under challenge was a well reasoned one which did not call for any interference.\n\nThey also stated that the lower court had rejected the appellant’s plea on a fair appreciation of materials on record.\n\nWriting the judgement for the Bench, Mr. Justice Selvam said that the couple had entered into wedlock in 2004 and gave birth to a baby boy. However, their relationship got strained over the years, making the appellant apply for divorce in 2014 on the ground that his wife suspected him of maintaining an illicit relationship and behaved violently all the time.\n\nHowever, the appellant’s wife stoutly denied the claim of mental disorder and contested the divorce case by stating that she had been bringing up their child, without her husband’s support, by working as a schoolteacher.\n\nShe also accused her husband of remaining away from the family most of the time and not even knowing the class in which their son was studying.\n\nFinding force in her submissions, the Division Bench said that the Family Court had found the appellant to have admitted the allegations levelled against him by his wife. It also held that the appellant had conceded to have obtained medical certificates, relied upon by him to prove that his wife was suffering from a mental disorder, from a doctor who was a long time acquaintance.\n\n“It (Family Court) also found that there was nothing to substantiate the allegation of the respondent (wife) attempting suicide by taking overdose of sleeping pills. Therefore, this appeal stands dismissed,” the Bench also said.", 
    "section": "national", 
    "title": "HC disbelieves husband’s claim of wife suffering from paranoia", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}