{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Seventy-five-year-old P. Venunathan of Madurai is a man of no means. Sporting a white beard and dressed in rags besides being dependant on crutches, he has finally found a messiah in the Madras High Court Bench here, which has succeeded in making him receive Old Age Pension (OAP) with arrears of Rs.80,500 due since he attained 60 years of age.\n\nThe septuagenarian’s legal battle began in 2013 when he filed a writ petition, on his own without engaging a lawyer, seeking a direction to the district administration to grant him pension under Indira Gandhi National Old Age Pension Scheme (IGNOAPS).\n\nEmpathising with him, the court in April 2014 directed the Tahsildar, Social Security Scheme, to consider the plea and pass appropriate orders.\n\nHowever, the Tahsildar turned down the request in July 2014 on the ground that the petitioner’s name did not find a place in the list of people living below the poverty line. The elderly man moved the High Court once again challenging the rejection order.\n\nA single judge allowed his case in September 2014 after observing that the petitioner looked impoverished going by his appearance.\n\nThe issue did not rest at that as the then Madurai Collector went on appeal challenging the single judge’s order.\n\nDismissing the writ appeal on June 4 last, a Division Bench of Justices S. Manikumar and G. Chockalingam directed the Collector to start paying OAP to the petitioner at the rate of Rs.1,000 a month and ordered settlement of arrears within six weeks.\n\nThe Collector filed a review application which was listed before a Division Bench of Mr. Justice Manikumar and Justice C.T. Selvam this week.\n\nTaking serious note of the issue, the senior judge requested Additional Advocate General K. Chellapandian to intervene and ensure that the aged man receives the money. The AAG reported back that the litigant had been issued with a cheque for Rs.80,500 besides being enrolled under IGNOAPS.\n\nAfter recording his submission, the Bench said: “We appreciate the sincere efforts of Additional Advocate General… At this hour, we only state that the septuagenarian has succeeded. In view of the above, without going into the merits, this Review Application is closed.”\n\nAfter a three-year struggle, the beneficiary has also got 15 years of arrears", 
    "section": "national", 
    "title": "High Court helps septuagenarian get pension with arrears", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}