{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Dasavatara Tattuvam’ by M. Vijayaraman, Railway Colony, 7.30 p.m.\n\nSaiva Siddhantha Sabha: 59{+t}{+h}anniversary celebration; discourse by S. Kunjithapatham, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh Study Circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S. S. Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Kambaramayanam’ by R. Chellan, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nChinmaya Mission: Discourse on ‘Bhagavad Gita’ by Swami Sivayogananda, Sri Kanchi Kamakoti Mutt, Besant Road, Chokkikulam, 6.45 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nOur Lady of Lourdes Church: Easter mass, K. Pudur, 11 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGandhi Museum: Book review by V. Alagirisamy, V. Rajaguru presides, Library, 5.30 p.m.\n\nMadurai City Senior Citizens’ Forum: Bharatanatyam by Leelavathi Rajan, 77 Viswanathapuram Main Road, 5 p.m.\n\nGENERAL\n\nSaraswathi Narayanan College: Valediction of NSS camp, M. Kannan, Principal, presides, Kombadi, 10 a.m.\n\nYadava College: NSS camp, Alagarkoil, 10.30 a.m.\n\nMSS Wakf Board College: NSS camp, Odaipatti, 9.30 a.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: NSS camp, Poovanthi, 9.30 a.m.\n\nK. L. N. College of Engineering: 18{+t}{+h}Graduation Day; S. Shyam Sundar, Senior General Manager, Brakes India, addresses, K. N. K. Karthik, president, presides, K. L. N. Krishnan Indoor Stadium, 11 a.m.\n\nRaja College of Engineering and Technology: 17{+t}{+h}Graduation Day; M. Siva Kumar, Chief Executive Officer, ICTACT, addresses, V. S. P. Solaimalai Pitchai, chairman, presides, 10.31 a.m.; 21{+s}{+t}Annual Day; Sheela Ramachandran, former Vice-Chancellor, Avinashilingam University, and A. Rajan, Athletic Coach, SDAT, address, Lakshmi Sundaram Hall, 3 p.m.\n\nLatha Mathavan Engineering College: 9{+t}{+h}Annual Day; Bobby Varghese of TCS addresses; K. Mathavan, chairman, presides, 9.30 a.m.; Hostel Day, M. Muthu, Inspector of Police, addresses, Kidaripatti, 3.30 p.m.\n\nMaharishi Vidyaa Mandir: 22{+n}{+d}Annual Day; K. M. Rajasekaran, Principal, Madura College, addresses, MRF Hall, Tirunagar, 5 p.m.\n\nVadamalayan Hospitals: Inauguration of Integrated Cancer Centre by V. Shanta, Chairperson, Adyar Cancer Institute; of PET and CT scan by Mayilvahanan Natarajan, former Vice-Chancellor, TN Dr. MGR Medical University; of LINAC, HDR Brachytherapy by M. V. Muthuramalingam, chairman, Velammal Medial College, and SPECT by K. G. Bakthavathchalam, Chairman, KG Hosptial, Raja Muthiah Mandram, 4 p.m.\n\nKalaivanar NSK Sindhanai Peravai: News quiz competition, Corporation School, Anna Nagar, 6.30 p.m.\n\nTourism Association: Inauguration by Shoeb Samad, Regional Director, Ministry of Tourism, Hotel Sangam, 5 p.m.\n\nPeople’s Anticorruption Movement: Executive committee meeting, Tamil Nadu Sarvodaya Mandal, Gandhi Museum, 4.45 p.m.\n\nInnovative Trade Fairs: Constructive 2016, national exhibition of building and construction materials, Tamukkam, 10 a.m.\n\nJunior Chamber of Madurai Temple City: Sivarajah Ramanathan, president, Nativelead Foundation, speaks on ‘Nextgen entrepreneur,’ Hotel Poppys, Ring Road, 6.30 p.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar,; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}