{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A major portion of the Rs. 33.04 lakh unaccounted money that was seized from 14 persons in the district so far by flying squads and static surveillance teams has been returned to the owners on production of required documents.\n\nIn a statement, Collector V. Rajaraman said that the cash and gifts worth Rs. 29.03 lakh were returned to the owners on production of necessary documents. Enquiries were being conducted for the remaining Rs. 4.01 lakh that was seized and deposited in the treasury, he said.\n\nA total of 21 flying squads and 21 static surveillance teams and seven video monitoring teams were deployed in the seven Assembly constituencies in the district.\n\nMeanwhile, the number of polling stations in Virudhunagar district has gone up to 1,872 with the Election Commission permitting to set up 15 new auxiliary polling stations in six Assembly constituencies (except for Virudhunagar Assembly segment).\n\nThe number of auxiliary polling stations and the places are: 36 (All Women – AW) at Avarampatti; 131 (AW) on Sankarankoil Road, Rajapalayam, and 252 (AW) at Melavarkunaramapuram in Rajapalayam Assembly constituency; 89 (AW) at Sundarapandiyam and 120 (AW) at Sivanthipatti, Mamsapuram in Srivilliputtur and 2 (AW) at Asilapuram and 124 (AW) at Vijayakarisalkulam under Sattur Assembly constituency.\n\nThe other new auxiliary polling stations are: 35 (AW) at Kathalanpatti and 54 (AW) at Anaiyur under Sivakasi Assembly segment; 172 (AW) at Velayuthapuram and 203 at Kalaperumalpatti under Aruppukottai; and 16 at Pullur, 26 at A. Thottiyankulam, 103 at Valukkalotti and 256 (AW) K. Chettikulam under Tiruchuli Assembly segment.\n\nAll those constituencies that had more than 1,200 voters following continuous revision of voters’ list had been split with the auxiliary polling stations. The final number of Assembly segment-wise polling stations in the district is as follows: Rajapalayam – 260; Srivilliputtur – 283; Sattur – 279; Sivakasi – 276; Aruppukottai 250 and Tiruchuli – 271.", 
    "section": "national", 
    "title": "Major portion of seized unaccounted money returned to owners", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}