{
    "author": [
        "Staff Reporter"
    ], 
    "text": "He had earlier announced his retirement from active politics\n\n: Sitting MLA from the Union Enclave Yanam, Malladi Krishna Rao on Friday announced that he would contest the elections for the Puducherry Assembly as a Congress candidate.\n\nAt a public meeting held near the bus stand here, Mr. Krishna Rao, a four-time MLA who had earlier announced his retirement from active politics, spoke in detail about his latest decision in the presence of a battery of senior leaders from the All India Congress Committee and Puducherry Congress.\n\n“The Congress is the only political party that is committed to retaining the Union Territory status of Pondicherry, whereas the parties like AIADMK and NR Congress are for a separate Puducherry State. What is going to be the fate of towns like Yanam, Mahe and Karaikal if the Puducherry State is formed?” he asked.\n\nMr. Krishna Rao said that the people of Yanam wanted to be the citizens of the Union Enclave, but not that of a State.\n\n“To protect the interests of the people here, I have decided to contest this election as a Congress candidate. It is the responsibility of the people of Yanam to make the Congress candidate win the election to highlight their demand for Union Enclave status to this town,” he said, adding that once the Congress voted to power he would press the party to allocate at least two nominated posts to the town.\n\nAICC general secretary V. Narayana Swamy, in charge of Tamil Nadu and Puducherry Congress G. Chinna Reddy, and Puducherry former Chief Minister V. Vaithiyalingam were present.\n\n‘Attempt to buy truce’\n\nMr. Malladi’s announcement puts to rest all speculation on his future political move.\n\nA three time MLA, Mr. Krishna Rao had been avoiding party platforms for long and had gone to the extent of speaking in support of All India NR Congress president and Chief Minister N. Rangasamy.\n\nThe Puducherry Pradesh Congress Committee (PPCC) had recently appointed Mr. Rao as ‘constituency in-charge’.\n\nThe move was seen by political observers as an attempt to buy truce with Mr. Rao who had been estranged from the party.\n\n( With inputs from S. Prasad )\n\nA three time MLA, Mr. Krishna Rao had been avoiding party platforms for long", 
    "section": "national", 
    "title": "Malladi to contest again from Yanam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}