{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students had now donned the role of opposition in the country to question the policies of the government that did not believe in diversity, said student leaders of Jawaharlal Nehru University (JNU) on Saturday.\n\nAddressing a seminar on ‘Nationalism, patriotism and sedition,’ organised by All India Students’ Association (AISA) here, Shehla Rashid, vice-president, JNU Students’ Union, accused the government of using nationalism as a “blackmail tool” to hide its “inefficiency.” “Its development agenda is hollow and the government wanted only one religion, one language, one leader and one party,” she charged.\n\nIndian nationalism during the freedom movement was anti-imperialistic but BJP’s nationalism was obsessed with ‘Hindu Rashtra.’ Nationalism should be people-centric but the BJP was surviving on “manufacturing hatred” against minorities and marginalised people, she said.\n\nExplaining why students were agitating in several universities, Sucheta De, president, AISA, said that after systematically destroying school education by encouraging private players, the government was now attempting to replicate its act in higher education.\n\n“There is rampant saffronisation of whatever Indian civilisation has gained as knowledge so far,” she said. Patriotism, she said, did not mean a few symbols created by the government but the rights of human beings.\n\nS. Vivekanandan, vice-president, All India Federation of University and College Teachers’ Organisations, said that it was natural for the majority to fight against the policies and principles of the government if they were meant for a section of society. Nationalism propagated in India was moving closer to European nationalism, which was race-based. “Now, those who opposed fascism are branded anti-nationals,” he said. Prof. Vivekanandan charged the government with propagating pseudo-nationalism to divert attention from real issues.\n\nR. Murali, former Principal, The Madura College, said the JNU was a model democratic sphere and the government wanted to strangle democratic voice. “One who uses rationality to define nationalism is considered a terrorist in the current state,” he said.\n\nS. Kumarasamy, secretary, CPI (ML), accused the BJP of trying to equate nation with the Modi government. The seminar called for the repeal of the sedition law, which came into force during the British regime.\n\n“Government is using nationalism as a blackmail tool to hide its inefficiency”", 
    "section": "national", 
    "title": "“Now students don the role of opposition in India”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}