{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The DMK on Friday issued a legal notice to MDMK leader Vaiko hours after he publicly claimed that DMK president M. Karunanidhi had offered Rs. 500 crore and 80 Assembly seats to the DMDK in his bid to rope in actor-turned-politician Vijayakant as an ally for the upcoming elections.\n\nIncidentally, soon after Mr Vaiko made the allegation, DMDK leader Vijayakant’s wife Premalatha, now an ally of the MDMK, hotly denied that the party had ever held any negotiations with the DMK on this score.\n\nLate in the evening, the DMK sent a legal notice to Mr. Vaiko giving him a week’s time to withdraw the unsubstantiated allegation or face legal action.\n\nThe notice said Mr. Karunanidhi was shocked to hear the false and defamatory statement made by him at the Madurai airport before a large contingent of media.\n\nAs the “intention was to defame, bring disrepute and politically damage Mr. Karunanidhi at this crucial time when general elections to the Tamil Nadu Assembly has been announced,” the DMK asked Mr. Vaiko to withdraw the false and defamatory statement within seven days.\n\nThe DMK also pointed out that Mr. Vaiko’s statement was denied by Ms. Premalatha Vijayakant.\n\nMeanwhile in Tirunelveli, Premalatha Vijayakant, when asked about Mr. Vaiko’s charge, said that the media should get clarification from Mr. Vaiko, as it was his assertion.\n\n“Though the DMK was keen on having electoral alliance with the DMDK and extended an open invitation, we thanked the party and never held talks in this connection. There was no question of any haggling or bargaining,” she said.\n\n‘Based on media reports’\n\nLater, when Mr. Vaiko was asked about the legal notice, he claimed that he had based his charge on the strength of some media reports and would not withdraw his remarks.\n\nDMK pointed out that Premalatha Vijayakant\n\nhas denied the charge", 
    "section": "national", 
    "title": "Poll ‘deal’ charge: DMK sends legal notice to Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}