{
    "author": [
        "Staff Reporter"
    ], 
    "text": "When a marriage is dissolved by a decree of divorce, and one of the parties re-marries after four years, can the other party be allowed to challenge the decree condoning the delay in moving the court? The Madras High Court has ruled negative.\n\n“Here is a case, where, for want of care, kingdom of matrimony is lost for the petitioner,” Justice V. Vimala said, dismissing a revision petition moved by a woman who sought the court to set aside a divorce decree passed ex parte in favour of her husband.\n\nA Subordinate Judge, Tambaram, on February 11, 2010 set the wife ex parte as she failed to defend the Hindu Marriage Original Petition moved by her husband seeking divorce. After 24 days of delay, she moved a petition to set aside the order. But, she failed to appear again and defend her case and the court, on June 17, 2010, dismissed her plea.\n\nThe man contracted second marriage on April 6, 2014, which has been duly registered. Meanwhile, the subsequent attempts by the first wife to set aside the divorce decree were also dismissed.\n\nAssailing the dismissal orders, she moved the High Court.\n\n‘Supine indifference’\n\nWhen the plea came up for hearing, Justice Vimala said, “It is evident that at every stage, the wife has exhibited supine indifference. When there is a duty to act with expedition at all stages, and if the petitioner is guilty of inordinate and unwarranted delay, coupled with failure to observe the timeframe, then the liability to suffer the consequences of dismissal, for want of prosecution, is inevitable.”\n\nPointing out the amendment made to the Hindu Marriages Act in 1976, which restrained the parties from re-marrying for one year from the date of the decree, the Judge said, “The reduction of the waiting period for re-marriage by the aforesaid amendment itself suggests that the intention of the legislature is to settle the rights of parties after divorce permanently, at the shortest period of time. Therefore, the intention of the legislature which encompasses public policy and social interest should also be taken into account.”\n\nBy virtue of the remarriage, now the interest of second wife has intervened and the court is expected to take cognisance of subsequent event also in deciding the application for restoration/ setting aside ex parte decree, Justice Vimala observed and dismissed the review application.\n\nShe failed to defend the Hindu Marriage Original Petition moved by her husband", 
    "section": "national", 
    "title": "Revision petition moved by woman against divorce after 4 years dismissed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}