{
    "author": [
        "K Manikandan"
    ], 
    "text": "Fares across classes are many times higherthan those fixed for express trains, they say\n\nPassengers and activists want the Railway Board to make a review of the steep fares fixed for the Suvidha special trains.\n\nPassengers said the fares across classes were many times higher than those fixed for express trains.\n\nThe Southern Railway started operating the special Suvidha trains in July last to clear the extra rush of passengers on routes that witnessed heavy traffic: Chennai-Madurai-Tirunelveli in Tamil Nadu.\n\nWith the concept of dynamic pricing coming into play, the fares are not fixed and keep increasing based on the demand and berth vacancy.\n\nFor instance, a ticket on a Suvidha train from Chennai to Madurai costs more than Rs. 1,000, while it is only a little more than Rs. 300 on a superfast express train.\n\n“Railways’ primary objective is to serve the travelling public and it is not a money-spinning corporate entity. Fares as high as Rs. 4,000 for a berth in a second AC compartment are too high. The Railway Board should review the fares immediately. Passengers should not be exploited,” said V. Rama Rao, an activist of the Traffic and Transportation Forum.\n\nJ.K. Raghunathan, president of Chennai Rail Passengers Association, said Railways could think of other means of augmenting its revenue and put its vast assets and properties to better use.\n\n“The Ministry of Railways should seriously consider slashing the fares for Suvidha trains,” he said.\n\nOccupancy rate\n\nWhile conceding that the fares in upper classes (second and third AC) were high for the Suvidha trains, especially while booking closer to the departure date, officials said the special trains run by Southern Railway had 80 per cent occupancy.\n\nSleeper coaches had 100 per cent occupancy while there were vacant seats in the upper classes owing to the fares.\n\nThey added that Suvidha trains were run only when there was considerable demand from passengers.\n\nA ticket on a Suvidha train from Chennai to Madurai costs more\n\nthan Rs. 1,000", 
    "section": "national", 
    "title": "Review Suvidha fares: passengers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}