{
    "author": [
        "Special Correspondent S Sundar"
    ], 
    "text": "It is a novel move, writes S. Sundar\n\nIncidents of snatching gold chains, especially from lone woman, on road are not new under the city and rural police limits. Of late, the robbers are attacking victims while snatching their valuables.\n\nIn one such incident reported under Vadipatti police station limits on Tuesday, the robbers made the victims riding a motorbike fall into their trap. They threw a plastic bottle on the bike and the angered rider V. Ovireddy stopped the bike while shouting at them.\n\nThe robbers who expected this returned to them and attacked the man with a knife. Threatened by this, his wife O. Thamaraiselvi (46) voluntarily handed over six sovereigns of gold to them. The robbers then fled the scene around 4 p.m. In another incident reported at Subramaniyapuram, two robbers tried to snatch gold from lone woman teacher while she was walking towards her house. When she held on to the gold chain and raised an alarm seeking help, one of them pulled out a knife and made his job easy. Since it happened at an isolated place, they escaped before a passer-by could come to her help.\n\nIn two other recent incidents, robbers chose to attack victims, with stones before snatching valuables in the city. However, both the incidents happened at night. While R. Thavasiraja (25) of Peraiyur sustained bleeding injuries on his head and hip at Arapalayam on Sunday, V. Kandavel (20) of Yagappa Nagar sustained bleeding injuries on his face while he was attacked at Vaigai Colony on Wednesday night. In both the incidents the robbers snatched their mobile phones to prevent them from alerting the police. They lost gold, cash and ATM cards.\n\nThe police said that if Mr. Ovireddy had not stopped his bike, the robbery could have been prevented.\n\n“In the Arapalayam incident, the youth opted to attend nature’s call in the middle of the Vaigai in the dead of the night that came in handy for the robbers,” a police officer said.\n\nA city police officer said that efforts were on to zero in on the suspects.", 
    "section": "national", 
    "title": "Robbers dare to attack victims", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}