{
    "author": [
        "P Sudhakar"
    ], 
    "text": "At a time when demand for chilled beer has increased with the mercury soaring every day to predict the onset of a hot summer, non-availability of cooled alcoholic beverage in Tasmac retail outlets across the district has irked liquor consumers.\n\nSince sale of beer would usually see a sharp increase in the summer, almost all outlets would be stuffed with adequate stock.\n\nHowever, most of the Tasmac retail shops in the district have not been supplied with coolers, forcing the supervisors to sell beer in warm condition, much to the disappointment of customers.\n\n“Tasmac has supplied coolers only to four or five of the 30-odd liquor shops in Tirunelveli and Palayamkottai. Hence, the sale of beer has taken a beating this year though the demand for chilled beer is very high,” said a supervisor.\n\nSeizing this opportunity, the shops which had coolers were selling chilled beer at a premium. “You’ll have to pay Rs. 30 or Rs. 40 in addition to the normal price for chilled beer,” he said.\n\nAt a premium\n\nThough liquor sale in the bars attached to Tasmac outlets has been banned, chilled beer is normally available at a premium.\n\nTo check the sale from dwindling, the ‘neglected shops’ have allowed the bars attached to them to sell beer, and a bottle of chilled beer costs anywhere between Rs. 140 and Rs. 150, against the actual cost of Rs. 110.\n\nWith the Election Model Code of Conduct in force, the officials, who know about the increased sale of liquor in the bars, have started conducting raids on bars, which have completely stopped the sale of chilled beer.\n\n“Chilled beer is now available only in the shops supplied with coolers and bar owners, fearing stringent action, have suspended the sale in the bars,” said the salesman of a Tasmac outlet.\n\nTenders\n\nAdmitting that beer sale would suffer due to the non-availability of coolers in the outlets, a senior Tasmac official said that tenders had been floated for supply of coolers to all the shops and the problem would be sorted out before May.", 
    "section": "national", 
    "title": "Short supply of coolers hits beer sale in Tasmac outlets", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}