{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Christians participating in the Way of Cross conducted at St. Xavier’s Cathedral in Palayamkottai on Friday; Special prayers organised at Our Lady of Snows Basilica in Tuticorin.— Photos: A. Shaikmohideen and N. Rajesh\n\nChristians participating in the Way of Cross conducted at St. Xavier’s Cathedral in Palayamkottai on Friday; Special prayers organised at Our Lady of Snows Basilica in Tuticorin.— Photos: A. Shaikmohideen and N. Rajesh\n\nWith fasting, silent prayers and Way of the Cross, the ‘Good Friday’ was observed in all churches in the district.\n\nAs the silent prayer started in the dawn, small groups of families offered silent prayers since 6 a.m. Following the Way of the Cross in the afternoon that commemorates the crucifixion of Jesus Christ that plays the most important role in Christian faith, special ‘Good Friday’ prayers were conducted in the evening.\n\nFree meal, porridge, buttermilk, money, rice etc. were offered to the poor as part of the observance.\n\nA blood donation camp was organised at Infant Jesus Church in Shanthi Nagar which was inaugurated by Most Rev. A. Jude Paulraj, Bishop of Palayamkottai RC Diocese.\n\nRector of Our Lady of Snows Basilica, Thoothukudi, Rev. Fr. Lerin De Rose led the Way of the Cross and the special prayers in which a few thousand Christians participated.\n\nNagercoil\n\nChristians across Kanyakumari district observed Good Friday with due devotion and fasting to commemorate the passion and crucifixion of Jesus Christ. Services at churches began in the afternoon. Majority of the worshippers took part in the church services dressed in mourning.\n\nIn many churches, the service went on for over two hours. Many organised the ‘way of the cross’ procession, marking the journey made by Christ to Mount Calvary for his crucifixion, in the evening after the mass.\n\nThousands of people from all age groups took part in the ‘way of the cross’ rituals organised by St. Anthonyar Church in Karungal town. The procession began in Thundathuvilai to Mathamalai via Karungal junction, Nirmala Hospital and Chithanvilai.\n\nThe final day of the two-day 59th annual Kurusumalai Thirupayanam witnessed the participation of thousands of Christians. The Thirupayanam was presided over by Vincent K. Samuel.\n\nThe processions were also organised by Deva Sahayam Welfare Centre from Karode to Kunnamparai R.C. Church, from Chruvaloor to Kuttaicode, it was organised by St. Michel Adhi Thoothar Church and from Arumanai to Kuzhichal organised by Esthakkiyar Church.\n\nThe district police had made elaborate arrangements for the processions. Special prayers were held in all churches including St Xavier’s Church at Kottar and Home Church in Vetoornimadam in Nagercoil town.", 
    "section": "national", 
    "title": "Silent prayers, Way of the Cross mark ‘Good Friday’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}