{
    "author": [
        "R Srikanth"
    ], 
    "text": "It will coordinate with State Load Despatch Centre to handle wind energy, solar power\n\nOfficials are hopeful of meeting one-third of the total power demand, which is expected to touch 15,000 MW this year, by tapping renewable energy.— File Photo\n\nThe dependence on coal-fired thermal power stations to meet the huge energy demand despite the State having more than 7,000 mega watt (MW) of installed wind capacity is set to change in the coming days with the Tamil Nadu Generation and Distribution Corporation (Tangedco) planning to optimally use the generated wind energy.\n\nAs part of this, Tangedco has started a Renewable Energy Management Centre (REMC) to handle wind energy and solar power by coordinating with the State Load Despatch Centre (SLDC).\n\nA senior Tangedco official said the REMC’s role will be to forecast and schedule the wind energy patterns, normally treated as ‘infirm’ energy. The immediate effect of the creation of the centre was the absorption of wind power of more than 1,200 MW on March 22. So far more than 90,000 million units of wind energy (see table) have been fed into the grid from an installed capacity of 7,252 MW, he added. The officials at the centre are positive about harnessing wind energy to the maximum, utilising scientific forecasting by the National Institute of Wind Energy (NIWE) and data received from the installation of real-time meters from the 117 pooling substations of the windmill farms.\n\nTill last year, there was the grievance from windmill generators was that they were asked to back down on wind generation. This could be attributed to lack of background data about wind patterns, the inability to immediate shut down or re-start thermal stations given that wind generation is volatile, and the need to safeguard the electricity grid from unpredictable electricity flow. The problem of evacuation of wind energy has also been overcome with the completion of the Green Energy Fund Corridor distributed through German Development Bank to strengthen evacuation of wind energy by installing five 400 kilo volt (KV) substations including at Thappugundu, Anaikadavu and Rasipalayam, and 540 kilometres of transmission lines.\n\nWith more than 1,200 MW of solar power supposed to be added to the State grid by the end of this year, the total installed capacity of renewable energy would tip over 11,000 MW.\n\nHydro energy\n\nWhile hydro energy is not treated as renewable energy, water being a natural source, the State could still well exploit it. Tangedco has a 2,284 MW installed capacity of hydro stations. The officials pointed out that the Tangedco’s hydro stations depend on dams controlled by the Water Resources Department, which gives priority to release water for irrigation. Due to these reasons, power is generated from hydro stations only during peak hours to offset any deficiency of electricity demand.\n\nIn such a situation, REMC officials are hopeful of meeting one-third of the total power demand expected to touch 15,000 MW this year by tapping renewable energy.\n\nA future that bets on renewable energy sources, experts pointed out, would be the path the State should take. Given the immense potential of solar energy generation, and the marginal possibilities of wind and hydro power, Tamil Nadu would do well to look at enhancing its capacity to harness these systems.", 
    "section": "national", 
    "title": "Tangedco sets up centre to tap renewable energy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}