{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal purappadu from sanctum sanctorum, 3 p.m.; reaching Garuda Mandapam, 3.15 p.m.; purappadu from the mandapam, 6.30 p.m.; reaching vahana mandapam, 7 p.m.; purappadu in Alum pallakku, 7.30 p.m.; reaching sanctum sanctorum, 9.30 p.m.\n\nSri Pundarikasha Perumal Temple, Thiruvellarai: Ratha utsavam, Perumal purappadu from kannadi arai, 4.30 a.m.; reaching Anantharayar Mandapam, 5 a.m.; purappadu in Karpaga virutcham, 5.30 a.m.; reaching Anantharayar Mandapam, 6.30 a.m.; purappadu, 8 a.m.; reaching Kalavaipatti Asthana mandapam, 9 a.m.; purappadu in Hanumantha vaganam, 6.30 p.m.; reaching Vagana mandapam, 7.30 p.m.; reaching kannadi arai, 9 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Lakshmi Narasimha Swami Sannidhi, Sri Ahobila Mutt, Srirangam, 5.45 p.m.; Ranga Vilasa Mandapam, Srirangam Sri Ranganathaswamy Temple, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 155, Krishnamurthy Nagar, 6 p.m.\n\nCULTURE\n\nRasavelar Shenbaga Tamil Arangu: Silver jubilee celebration, Melai.Pazhaniappan speaks on Thirukkural, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nDistrict Administration: Systemic Voter Education and Electoral Participation programme, Samayapuram, 10 a.m.; Lalgudi, 11 am.; No.1 Tollgate, noon.\n\nPeople’s Welfare Front: Advocates conference, Hotel Femina, 10 a.m.\n\nShrimati Indira Gandhi College: College Day, D. Valavan, Principal, Saranathan College of Engineering, chief guest, 6 p.m.\n\nVetri Vinayaha College of Engineering and Technology, Tholurpatti: International conference on recent trends in engineering sciences, Kannan Jegathala Krishnan of College of Engineering and Science, Victoria University, Melbourne, chief guest, 10 a.m.\n\nChidambaram Pillai College for Women, Manachanallur: Hostel Day celebration, Senthilkumar Gopalan, founder, Payir Trust, chief guest, 4.30 p.m.\n\nChellammal Vidyalaya, Tiruverumbur: Annual day, A. Kaliyamurthy, former Superintendent of Police, chief guest, 5 p.m.\n\nNewtunkids International Play School: Annual day, 6 p.m.\n\nTamil Nadu PWD Senior Engineers Association: Meeting, Dr.A.Rajendran speaks on Common skin diseases in summer, Hotel Ajantha, 10 a.m.\n\nJamal Mohamed College Department of Tamil: Sirpi Balasubramaniam endowment lecture by U.Alibava, professor, Bharathidasan University, 11 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}