{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu accounts for 11 per cent of medical negligence cases filed in the country, said advocates. The advocates were speaking at the Annual Medico Legal Review 2016, held in the city on Thursday.\n\nThe review, which was an overview of medical negligence cases hear before the National Consumer Commission in 2015, found that while Indian courts continued to be lenient and minimally interfering towards doctors, the average amount of compensation allotted to patients was increasing exponentially.\n\n“The commercialisation of medical services may now being taken into account in granting compensation. Already, the amount of compensation granted is between Rs. 25 to 30 lakh. Commercialisation of medical services was a policy decision taken by the government of India — it has nothing to do with medical negligence. But this is the law,” said advocate Mahendrakumar Bajpai of the Institute of Medicine and Law.\n\nGoing by the decisions made in cases last year, Mr. Bjapai and another advocate gave doctors an idea of what to expect in the coming years.\n\n“Documentation is your friend,” an advocate told the doctors. “Courts generally accept medical records as sacred so ensure every thing is documented,” she said. She added that patients sue hospitals now, not individual doctors, and so the liability of a hospital was changing.\n\nHospitalised patients continue to have the right to buy medicines from outside the hospital, Mr. Bajpai said and doctors cannot insist they buy in-house.\n\n“But record specifically in the medical records that the patient bought medicines or disposables from outside the hospital,” he said.\n\nRavi Shankar of the Indian Medical Association, Tamil Nadu, said specialty organisations in various medical disciplines needed to come out with guidelines for doctors to follow.\n\nTwo doctors spoke on the need for uniform consent forms to be brought into the system. Doctors have to also represent to ensure that The Medical Treatment of Terminally ill Patients (Protection of Patients and Medical Practitioners) Bill, 2006 is passed and brought into force, an expert said.\n\nThe Annual Medico Legal review found that Indian courts are still lenient towards doctors", 
    "section": "national", 
    "title": "‘TN accounts for 11 per cent of medical negligence cases’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}