{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Voter-verified Paper Audit Trial (VVPAT) will be introduced in Karaikal South Assembly constituency. The system will help voters check whether they had cast their votes correctly and the voting process is free from any error or fraud.\n\nT. Karikalan, District Collector, said that 35 VVPAT machines had been received from Puducherry for this purpose.\n\nThe Collector said the Electronic Voting Machines, numbering 159, had been selected on the principle of randomisation for the five Assembly constituencies.\n\nThe allotment of EVMs was effected in the presence of representatives of political parties. The EVMs along with the VVPAT have been kept under the safe custody, he added.\n\nHe has appealed to those possessing pistols and revolvers to deposit their arms with the nearest police station as per the guidelines of the Election Commission.\n\nThe receipt should be produced to the police stations after the elections were completed.\n\nThe Collector has appealed to the people to inform the Additional Director of Income-Tax, Chennai, information, if any, unaccounted money or unusual circulation of cash in any particular area.\n\nIn a release issued here on Friday, he said that the Income Tax Department had set up a toll-free round-the-clock cell in Chennai, to receive information in this regard and the interested persons could contact by dialling 18004256669 or 044-28278799.\n\nARIYALUR: In Ariyalur, E. Saravanavel Raj, District Collector, distributed pamphlets to students on the importance of exercising their franchise.\n\nAddressing students of Government Girls Higher Secondary School in Tirumanur, he said that the district administration had identified six schools and two colleges where the students would be motivated to exercise their franchise without fear or favour.\n\nEarlier, the Collector distributed pamphlets containing slogans on electoral participation in the forthcoming polls.\n\nHe said as many as 3,126 pamphlets had been given to students with a view to motivating the parents.", 
    "section": "national", 
    "title": "VVPAT to be introduced in Karaikal South", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}