{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise) The Holy Cross being carried into the Immaculate Conception Cathedral Church after the procession on Good Friday in Puducherry; people taking part in the ‘Way of the Cross’ procession; Marzipan bunnies made specially for Easter celebrations at the Hot Breads Bakery; cookies and marzipan stars inside an Easter egg on display. —Photos: T. Singaravelou\n\nOver 3,000 people from various parts of Puducherry participated\n\nIn memory of the sacrifice of Jesus Christ, Christians congregated at the Immaculate Conception Cathedral church on Friday morning. They took out the ‘Way of the Cross’ procession holding the cross, commemorating the crucifixion of Christ.\n\n“It is a tradition that, every year the Christians of Puducherry gather at the Immaculate Conception Church for the ‘Way of the Cross’. More than 3,000 people from various parts of Puducherry participated and meditated on the passion of Christ,” said Jayanth Rayan, Curia Secretary, Archdiocese of Pondicherry and Cuddalore.\n\nThe Archbishop of Pondicherry and Cuddalore Diocese Antony Anandarayar led the ceremony.\n\nThe procession, which began from the Immaculate Conception Cathedral church on Mission Street, proceeded towards St Theresa Street, M.G.Road, Nadarajappar Street and reached the Cathedral church. After reading gospel and kissing the holy cross, people adored the holy cross as it was carried into the church. Several churches across the Union Territory, prayers were conducted till late afternoon observing Good Friday.\n\nIn the evening, the celebration of the Passion of the Lord began at 4 p.m. The Archbishop and the priests wearing red vestments went to the altar. People prostrated and prayed in silence. Then the narrative of the Passion of the Lord was read in the form of a dialogue after which, the adoration of the holy cross took place. No holy mass was offered on Good Friday since it was the day Jesus died. The ceremony ended with the distribution of the holy communion.\n\nEaster celebrations\n\nThe ceremony to observe the resurrection of Christ called ‘Easter Vigil’ will begin on Saturday at 11.30 p.m. “This night is called the greatest and noblest of all nights. It is also called as the mother of all celebration took place in the church. The ceremony will be presided over by the Archbishop of Pondicherry and Cuddalore,” added Jayanth Rayan.\n\nAt 11.45 p.m., the lights in the church would be switched off. At 12 a.m., Archbishop Antony Anandarayar will bless the new fire as candles will be lit symbolising the rebirth of Christ. This will be followed by blessing of water and it will be sprinkled on worshippers.\n\nBy Friday evening, bakeries in Puducherry were flocked by people to buy Easter eggs and hot cross buns. This year, Hot Breads not only had Easter eggs and hot cross buns but they displayed a whole range of marshmallow, French meringue, marzipan bunnies, cup cakes decorated with bunnies and eggs made of white chocolate and fresh cream for the customers to choose.\n\n“Our chef Mani has prepared customized cakes with nest and egg decoration and also bunny cakes,” V.J.Dobson, area manager, Hot Breads, Puducherry.\n\nOther bakeries like Grand Bakery and Bon Bakes had Easter eggs and hot cross buns.", 
    "section": "national", 
    "title": "‘Way of the Cross’ procession marks Good Friday", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}