{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Vegetation growing on the walls and weeds in moat are being removed\n\nWork to clean-up the Vellore Fort and its moat is underway. Officials of the Archaeological Survey of India (ASI) have engaged men to remove the vegetative growth on the walls of the 16th century fort and “floating weed” on the water in the moat.\n\nFollowing the rain during the month of November, the water level increased in the fort’s moat. However, soon, the water was covered by a sheet of “weeds”.\n\n“It was literally like a green carpet on the water. Though people say it is “paasi”, this is like some kind of a floating weed. We have engaged men to remove the weeds, and they are carrying out the work for about three to four hours a day. The work began two days ago,” an official said.\n\nThe work is being taken up on the front side of the Fort as the water level is about four to five feet here. “The water level is much higher elsewhere and it will be difficult for the workers to stand in the water to remove the weeds. We have also engaged a boat for the work,” he added.\n\nThis is the first time that such “floating weeds” have formed a sheet on the water, he said, adding that such growth has not been witnessed in previous years. He pointed out that workers were also removing garbage thrown into the moat.\n\nOfficials said people disposed various kinds of garbage into the moat. At least six to seven loads of waste was removed on Thursday alone, he said.\n\nThe fort is spread over 136 acres of area. Of this, the moat accounts for one-fourth of the area, he mentioned.\n\nAs part of the regular maintenance of the archaeological site, the workers are removing vegetative growth from the walls of the fort.\n\n“Already, one round of removing the plants has been completed. We carry out this work at least four to five times a year,” he said.", 
    "section": "national", 
    "title": "Work to clean up fort under way", 
    "subsection": "tamilnadu", 
    "date": "2016-03-26"
}