{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "The RSS and the BJP got into a huddle here on Thursday in the wake of the riots in Malda of West Bengal, and ahead of a series of four rallies to be addressed by senior party leaders and Ministers in the State over the issue.\n\nThe meeting was attended by senior leaders, including RSS joint general secretary Krishna Gopal, who coordinates matters between the Sangh and the party; BJP general secretary (organisation) Ram Lal; his associate Shiv Prakash, who is responsible for the Sangh’s affairs in western Uttar Pradesh; and BJP general secretary in charge of West Bengal Kailash Vijayvargiya.\n\n“The group also included the core group of the RSS and the BJP working in West Bengal,” a party source said.\n\nThe incident in Malda is being viewed as a key campaign issue by the BJP, and the meeting was held to drive home the point. This will mark a departure from the past Assembly campaigns under the leadership of Amit Shah, which kept Prime Minister Narendra Modi front and centre and only trotted out hard Hindutva issues such as the beef ban when the going got tough, as it did in Bihar last year.\n\nAccording to different versions, the Kaliachak police station was torched by a mob on January 3, reportedly incensed about objectionable statements made by Hindu Mahasabha leader Kamlesh Tiwari. Mr. Tiwari had made the remarks after Uttar Pradesh Minister Azam Khan had made an offensive comment about RSS leaders.\n\nThe BJP has maintained, however, that this is not the reason. “There is a communal overtone to the event; the Idar-e-Shari is an Islamic fundamentalist organisation that, in a planned manner, incited this riot when it came to know that smugglers and anti-social elements were being held there,” said BJP national secretary Siddharth Nath Singh, who also looks after West Bengal for the party.\n\nWhile in West Bengal, the cultivation of a minority vote bank or what the BJP calls “appeasement politics” of Trinamool Congress chief Mamta Banerjee will be attacked, in Assam, the visit by Union Home Minister Rajnath Singh to Dhubri, All India United Democratic Front strongman Badruddin Ajmal’s stomping ground, last week, also points to this. “The border between India and Bangladesh along Dhubri is particularly problematic and the party (BJP) wants to put illegal migration by Bangladeshi Muslims front and centre in its campaign,” said a source.\n\nIn Kerala, another State where the BJP is yet to make big inroads, the appointment of State chief Kummanam Rajshekhar, who is considered the RSS’s choice for the post, is significant. One of the first issues he has flagged is state control of Hindu places of worship. “The government runs temples under a secular mask; why don’t they introduce democracy in temple administration, reform the Devaswom Act, and hand over temple administration to devotees,” he said.\n\nHe compared this with the reluctance of both the UDF and the LDF to implement the Church Administrative Board proposal put forward by the late V.R. Krishna Iyer.\n\nThe change in the template and the backgrounding of governance issues in these campaigns is also reflective of the fact that these are States where the BJP does not have much presence and the aggression is being seen as a way of capturing new ground.\n\nIn West Bengal, the party may use the violence in Malda as a key campaign issue", 
    "section": "national", 
    "title": "BJP may take Hindutva line for polls", 
    "subsection": "general", 
    "date": "2016-01-15"
}