{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Govt. thinks too many agencies have already been allowed to eavesdrop\n\nA Border Security Force jawan keeping a watch on the border near Pathankot. The force says it is also looking for technological solutions to contain infiltration.\n\nThe Union Home Ministry is likely to reject a proposal by the Border Security Force (BSF) to grant it technical surveillance powers along the western border with Pakistan, enabling it to pick up “chatter” among drug syndicates and terrorist groups.\n\nThe National Investigation Agency (NIA) has been investigating the probability of drug smugglers arranging logistical support for the terrorists who attacked the Pathankot airbase.\n\nIntelligence officials say mobile-phone signals from Pakistan are available on 33 patches along the Punjab border, making it easier for drug syndicates to communicate with one another through Pakistan-registered SIMs.\n\nThe role of the BSF has come under the scanner after the terror attack as the six armed terrorists are reported to have crossed over to India through a riverine stretch along the Pakistan border in Punjab. Though BSF officials have maintained that the fence had not been breached and thermal image sensors had not picked up any such movement on the borders, there are strong indications that the terrorists came through the riverine stretch near the Bamiyal sector. It is suspected that the same route was used by the terrorists involved in the July 27 attack on the Dinanagar police station.\n\nThe Punjab government has often accused the BSF of not containing the drug-smuggling syndicates in the State. The BSF has denied the allegations.\n\n“There are too many agencies having phone interception powers. We can’t add one more to the list. There is a proper communication channel and synergy, which exists among agencies and a mechanism will be put in place to share intelligence on a real-time basis,” a senior government official said. The Research and Analysis Wing, the Directorate of Revenue Intelligence, the Enforcement Directorate and the State police have been permitted phone-tapping powers by the Union Home Secretary.\n\nBSF officials say that deals between drug syndicates on both sides of the border are struck at short notice because of the mobile-phone connectivity. An official says drug smuggling has become a hereditary occupation for many people in the border villages.\n\n“Drug conduits on both sides of the border use SIMs registered in either country and could communicate with one another,” a BSF official says.\n\nAfter the Pathankot attack, the BSF augmented its manpower along the Punjab border, but says it is also looking for technological solutions.", 
    "section": "national", 
    "title": "BSF wants phone-tapping powers, but Centre reluctant", 
    "subsection": "general", 
    "date": "2016-01-15"
}