{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The battlelines are being drawn along communal lines in West Bengal and Uttar Pradesh where elections are due later this year and in early 2017 respectively.\n\nIn West Bengal, the ruling Trinamool Congress that has lost some ground in urban areas – though it is still way ahead of all other parties – wants to hold on to its Muslim votes; in Uttar Pradesh, the ruling Samajwadi Party, not even sure that it could emerge as the single largest party in next year’s Assembly polls, as the Bahujan Samaj Party has shown some signs of revival, needs to hold on to its M-Y (Muslim-Yadav) combination. Both parties, therefore, need some help, say their political rivals in the two States, from the Bharatiya Janata Party to polarise the votes.\n\nThese comments – from the CPI(M) and the Congress in West Bengal and from the BSP and the Congress in UP — come against similar backdrops: Hindu Mahasabha leader Kamlesh Tiwari, whose objectionable comments about Prophet Mohammad, triggered off protests – and acts of arson and vandalism — by Muslim groups in Bengal’s Malda district, had last month provoked similar, well-attended protests across western U.P.\n\nIndeed, Malda has now become the site of a political battle between the Trinamool and the BJP, the former describing the January 3 incident as a purely criminal episode, the latter saying it is a serious communal incident. CPI(M) leader Nilotpal Basu told The Hindu that he saw it as a case of match-fixing: “The area has been a Congress stronghold and the Trinamool and the BJP are trying to precipitate a situation in which things will get communalised not just here, but spread to other parts of the State.”\n\nReports from Malda suggest that some criminal elements that had infiltrated the groups of Muslim protesters set fire to the police station and destroyed the records. The Trinamool, these reports say, wants to give protection to the vandals – many of whom have criminal records — as they are Muslims, something that has provided the BJP with the argument that West Bengal Chief Minister Mamata Banerjee is appeasing the minority community.", 
    "section": "national", 
    "title": "Communal polarisation in West Bengal and U.P.?", 
    "subsection": "general", 
    "date": "2016-01-15"
}