{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "Only 50% of Rs. 10,000 crore sought for 2012-2017 has been allocated\n\nSoumya Swaminathan, who took over as the Director General of the Indian Council of Medical Research (ICMR) a few months ago, has said that “across the board” research projects run by the institute had suffered owing to lack of funds.\n\nShe said biomedical research projects being conducted in all the 32 scientific organisations of the ICMR spread across the country had been affected owing to the resource crunch.\n\n“We had asked for Rs.10,000 crore for our 12th Five Year Plan from 2012 to 2017 as we had plans to spend that amount and our expenditure has been 100 per cent every year. But, we received only 50 per cent of the budget allocation we requested. Many of our projects are not on track and I am hopeful that the current budget session will address the issue,” she said during a media interaction.\n\nDr. Swaminathan said that scientific organisations needed to be empowered to become globally competitive.\n\n“Resource crunch affects in many different ways. A research institute should always have cutting edge technology. If we are working with outdated equipment and facility, and if things are not available on time, we cannot be globally competitive,” she said.\n\nManagerial delays were affecting scientific innovations and experiments, she alleged.\n\n“It takes six months to get a reagent while in the West, you get it in one day. By the time a scientist starts doing an experiment, it is already done and published somewhere else. We cannot compete with the world unless we change the way in which we use science. Financial and managerial flexibility for research organisations is the need of the hour,” Dr.Swaminathan said.\n\nSpeaking about the lack of credible baseline data informing the vector-borne disease control policy, she said that the institute was working towards an elimination programme that would factor in the discrepancies in data.\n\n“The policy framework is based on the official data, which we admit suffers from under-reporting. But we have to depend on the data available with the programme implementers. However, we are cognizant of the gross under-reporting. The idea is to launch a better surveillance programme as we work towards the target of malaria elimination,” said Neena Valecha, National Institute of Malaria Research.", 
    "section": "national", 
    "title": "Fund crunch has hit research in 32 institutions: ICMR chief", 
    "subsection": "general", 
    "date": "2016-01-15"
}