{
    "author": [], 
    "text": "Veteran British character actor Alan Rickman, known for his memorable portrayal of screen villains, has died at the age of 69 after suffering from cancer, his family said on Thursday.\n\nRickman, who won a Golden Globe and a BAFTA during his career as a film, television and theatre actor, had a rich, smooth voice and brooding delivery that helped make him a sex symbol.\n\n“The actor and director Alan Rickman has died from cancer at the age of 69. He was surrounded by family and friends,” a family statement said.\n\nRickman started out in theatre and shot to international fame in 1988 playing the German terrorist mastermind Hans Gruber, Bruce Willis’s adversary, in Die Hard .\n\nRickman did a memorable turn as the Sheriff of Nottingham in the 1991 blockbuster Robin Hood: Prince of Thieves .\n\nHis performance earned him a BAFTA, Britain's film awards, for best supporting actor. “This will be a healthy reminder to me that subtlety isn’t everything,” he said.\n\nRickman also won a Golden Globe for best actor in a miniseries or television film for the title role in Rasputin: Dark Servant of Destiny (1996).\n\nHe gained legions of younger fans with his portrayal of the largely malicious teacher Severus Snape in all eight Harry Potter films from 2001 to 2011.\n\nIn between, he starred in the Christmas-themed romantic comedy movie Love Actually and voiced Absolem the Caterpillar in Alice in Wonderland .\n\nBorn in Acton, west London, on February 21, 1946, he won a scholarship to the Royal Academy of Dramatic Art at the relatively late age of 26.\n\nIn 1985 he played the lead male role in the Royal Shakespeare Company's version of Les Liaisons Dangereuses , which transferred to Broadway, where he received a Tony Award nomination. He played the romantic leads in the British films Truly, Madly, Deeply (1991) and Sense and Sensibility (1994). — AFP", 
    "section": "national", 
    "title": "Harry Potter star Rickman dies at 69", 
    "subsection": "general", 
    "date": "2016-01-15"
}