{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Has Pakistan registered a criminal case against the perpetrators of the Pathankot attack?\n\nSenior government officials say the Pakistani proposal to send a special investigation team (SIT) to India for investigations can receive legal cooperation here only if it is investigating a criminal case registered under a Pakistani law. The only other option for India to exchange information with the Pakistani SIT in the absence of a case would be informal and would carry no legal sanctity.\n\nFormer Home Secretary R.K Singh said that in the absence of any criminal case, the SIT was just like any other “inquiry committee”, which did not have any prosecution powers.\n\n“If no case has been registered by Pakistan regarding the Pathankot attack, the SIT will have no power to investigate; at best, they can come here to inquire. Based on the information gathered, it will not be possible to prosecute anybody in Pakistan. The information cannot be used to send somebody to jail,” Mr. Singh said.\n\nIndia has welcomed the formation of the SIT, but the terms and conditions are still not clear. Unconfirmed reports from Pakistan say Jaish-e-Mohammad (JeM) chief Maulana Masood Azhar, accused of masterminding the Pathankot terror attack, has been detained, but under what sections of law, it is not clear yet. “Will India give the visiting Pakistani delegation access to the Pathankot airbase, a strategic asset? Are we willing to share investigations details of the NIA,” a government official asked.\n\nAnother official said that Pakistan was yet to take any stringent action against the accused named by India in the 26/11 Mumbai terror attack case, though the Federal Investigation Agency (FIA) registered a case. As reported by The Hindu earlier, the investigation done by the FIA had 22 glaring gaps.\n\nA legal officer who did not wish to be identified said, “Unless a record is created, either in the form of a preliminary inquiry or an FIR, how could an SIT come here and investigate. The ideal situation would be that the accused belonging to the terrorist outfit named by India are extradited and are made to serve the sentence here.” Another government official said, “The other scenario under which a Pakistani investigation team can come here is when India sends a letter rogatory to Pakistan to produce the accused in an Indian court in relation to the ongoing trial. A judicial team from the country can choose to come here, not investigators.”", 
    "section": "national", 
    "title": "Has Pakistan registered an FIR regarding the Pathankot attack?", 
    "subsection": "general", 
    "date": "2016-01-15"
}