{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Indian-origin scientists and engineers in the U.S. grew 85% between 2003 and 2013, says a report by the National Science Foundation, a key funder of research in the United States as well as a monitor of demographic change among scientists and technologists.\n\nThe 950,000 scientists and engineers of Indian origin in 2013—the latest year for which the foundation has data—suggest that India’s rise far outstrips that of the Philippines and China, whose share of immigrants rose 53% and 34% in the same period and contributed 465,000 and 438,000 workers respectively. In 2003, Indian-origin researchers were 2.5% of the U.S. research workforce and as of 2013, made up 3.3%.\n\nImmigrants, according to the report, include naturalised citizens, permanent residents and temporary visa holders.\n\nThe report, “Immigrants’ Growing Presence in the U.S. Science and Engineering Workforce: Education and Employment Characteristics in 2013,” goes on to add that Indians “continue to be the single largest source of such professionals populating the American workforce” even as the number of scientists and engineers residing in the United States rose from 21.6 million to 29 million. The most common fields of study for immigrant scientist and engineers in 2013 were engineering, computer and mathematical sciences and social and related sciences and over 80 per cent of the immigrant scientists and engineers were employed in 2013, the same percentage as their U.S.-born counterparts.\n\nThe rapid rise in the number of expatriate Indian technologists comes in the decade when India—concerned about ‘brain-drain’—has launched a plethora of schemes to attract highly-qualified scientists back to India. According to a report by the U.N., Indians make up the largest diaspora in the world, with 16 million of them scattered across the world. This is partly due to its sizable population of 1.2 billion and a large proportion of youth. Prime Minister Narendra Modi has been seeking to convince this massive diaspora to engage more with India as well as invest in the country. Though several Indian-origin entrepreneurs have left plum positions abroad to start enterprises in India, there hasn’t been a substantial number of scientists and researchers doing the same.", 
    "section": "national", 
    "title": "Indian engineers, scientists in U.S. nearing one million", 
    "subsection": "general", 
    "date": "2016-01-15"
}