{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Punjab’s biggest fair Maghi Mela on Thursday saw the new challenger in State politics, Aam Aadmi Party’s (AAP) national convener and Delhi Chief Minister Arvind Kejriwal, take a dig at the ruling Shiromani Akali Dal-BJP alliance and the Congress by accusing them of being hand in glove in ruining the State.\n\nIn the run-up to the State Assembly elections that are due in early 2017, major political parties held rallies at Muktsar, firing salvoes at one another and hinting that Punjab may well witness a “bitter” election campaign in the days to come.\n\n“The ruling Badal family has ruined Punjab by its misrule and corruption. Farmers are committing suicide in a prosperous State which was known to feed the country,” said Mr.Kejriwal at the AAP rally that is being seen as the beginning of the party’s election campaign in the State.\n\nHe said it was time to uproot the SAD-BJP government and end corruption. “I am not scared of the Badals. Even if I have to lay down my life for the sake of Punjab, I will not step back,” he said, accusing the government of sheltering those who were involved in drug trafficking and corruption.\n\nMr.Kejriwal also accused the SAD-BJP of ignoring the concerns of farmers. “When we (AAP) come to power, we won’t let the farmers end their lives,” he said\n\nWith the AAP jumping into the election fray, the political contest in Punjab is all set to become a three-cornered one, involving the Congress and SAD-BJP alliance.\n\nBadal’s appeal\n\nAt a rally organised by the SAD-BJP combine in Muktsar, Punjab Chief Minister Parkash Singh Badal urged the people to elect the SAD-BJP alliance government for the third consecutive term, based on the development work done during the past 10 years.\n\n“It’s due to the pro-people and development-oriented policies of the State government that Punjab is on the path of progress. And this could be sustained only if the SAD-BJP alliance is voted to power again,” said Mr.Badal, alleging that the AAP was trying to grab power by misleading Punjabis.\n\n“Leaders of the AAP are basically braggers who are trying to divert the attention of the people from basic issues,” he said.\n\nDeputy Chief Minister Sukhbir Badal said the Congress was nowhere in the picture in the upcoming elections and even the elevation of Captain Amarinder Singh to the post of Punjab Pradesh Congress chief would not make a difference.\n\nCongress rally\n\nAt the rally conducted by the Congress, Capt. Singh said it was only the Congress that could provide a stable, clean and efficient government.\n\nHe said: “Punjab needs an efficient and experienced government which can retrieve the State from the social, economic and political mess the Akalis have consigned it to.”\n\nHe cautioned the people against the alluring promises made by the AAP, saying the party had already failed in Delhi and not fulfilled even a single election promise so far.", 
    "section": "national", 
    "title": "Kejriwal makes political foray into Punjab", 
    "subsection": "general", 
    "date": "2016-01-15"
}