{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "Police fear issue may take a communal turn; security in village tightened\n\nMuzaffarnagar is on the boil again and this time because of the alleged rape of an ASHA (Accredited Social Health Activist) worker and the subsequent suicide after her rapist circulated the video of the act.\n\nThe victim, a 40-year-old health worker, committed suicide last week after the “rape” video was circulated on WhatsApp allegedly by her rapist, Shahid, who is also a resident of the same village.\n\nTension prevailed in the village and its vicinity.\n\nThe fact that the accused is a Muslim youth has led to the incident of crime taking a communal spin.\n\nMP visits village\n\nBJP Member of Parliament from Muzaffarnagar Sanjeev Baliyan visited the village and told the agitating crowd that “harassment of our sisters and women won’t be tolerated.”\n\nThough the local administration has deployed heavy security force in the village and in the vicinity, the issue can potentially become a rallying point for communal mobilisation.\n\nBJP MLA from Sardhana in Meerut Sangeet Som, and another BJP MLA Suresh Rana are expected to visit the victim’s family in the next few days.\n\nSenior Superintendent of Police, Muzaffarnagar, K.B. Singh, told The Hindu that the issue was sensitive as it “involved two communities.”\n\n“We have arrested the culprit on Tuesday. During preliminary investigations, he has confessed to raping the victim and circulating the video through WhatsApp,” he said. The accused is in jail after cases of rape and abetment of suicide were registered against him by the victim’s husband.\n\n“Sufficient force has been deployed in the village and its vicinity,” said the SSP.\n\nCall records\n\nMr. Singh said the call records of the victim showed that she and the accused were in touch for over two months.\n\nHe said the victim’s husband registered the FIR against the accused after her suicide and he did not mention the date and place of the crime.\n\nThe victim ended her life after the ‘rape’ video was circulated on WhatsApp", 
    "section": "national", 
    "title": "Muzaffarnagar tense after rape victim commits suicide", 
    "subsection": "general", 
    "date": "2016-01-15"
}