{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Central Bureau of Investigation has alleged that Pearls Group chief Nirmal Singh Bhangoo and his associates, who have been booked in connection with an alleged ponzi scam involving over Rs. 45,000 crore, own 66 office premises at Connaught Place, in the heart of the national capital.\n\nThe accused persons had also allegedly acquired 553 acres of land on the outskirts of Delhi in the name of front companies.\n\n“They ran 44 offices in Gopal Das Bhawan, 11 in Indra Prakash Building, six in Antariksh Bhawan and five in Statesman House located in Connaught Place,” said a CBI official.\n\nThe accused also had plans to develop 482 acres of the 553 acres under the new land-pooling policy in Delhi. “They also owned an 11.5-acre farm land and a farmhouse at Rajokri in south-west Delhi. Investigations are under way to identify the properties acquired by the accused company and its office bearers in other parts of the country,” the official said.\n\nHeld on duping charge\n\nAbout a week ago, the CBI had arrested Bhangoo and his associates: Sukhdev Singh, Gurmeet Singh and Subrata Bhattacharya, for their alleged involvement in duping 5.5 crore investors of Rs.45,000 crore on the promise of allotting agricultural land and phenomenal returns.\n\nThe Supreme Court had last April ordered sale of all the assets of the Pearls Group of companies for paying back the dues to the investors. Accordingly, a special committee was set up to oversee the sale of the immovable assets and liquidation of fixed deposits of the companies for the purpose. In August 2014, the Securities and Exchange Board of India had directed the group companies to return the money to the investors, ordering immediate shutting down of their collective investment schemes.", 
    "section": "national", 
    "title": "Ponzi scam accused acquired vast properties in New Delhi", 
    "subsection": "general", 
    "date": "2016-01-15"
}