{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "In a fillip to the AAP government, the apex court said the pilot project has to be promoted and even judges are doing their bit by carpooling.- File photo: Sushil Kumar Verma\n\nPollution is killing Delhi and everybody has to cooperate with the government’s efforts to help the city breathe easier, the Supreme Court said on Thursday while refusing an urgent hearing of a plea to direct the revocation of the odd-even formula in place in the capital.\n\nIn a fillip to the Arvind Kejriwal-led AAP government, a Bench led by Chief Justice T.S. Thakur said the pilot project had to be promoted and even Supreme Court judges had done their bit by carpooling among themselves.\n\n“We are carpooling... the government is trying to curb pollution. People are dying due to pollution and you are challenging it for publicity.... This is a publicity stunt,” Chief Justice Thakur told B. Badrinath, a lawyer, who had moved the court against the recent Delhi High Court decision not to intervene in the issue. The Bench even threatened to impose heavy costs against such moves.\n\nIt advised citizens that individual concerns and discomforts had to be laid aside for the common good. But the court said the government and the Delhi Metro should act to make commuting easier by increasing the number of public buses and adding more coaches to metro trains in order to help people who leave their cars at home.\n\nThe AAP government’s odd-even project was implemented on January 1 for 15 days.\n\nThe Supreme Court’s observations, on the eve of the last day of the implementation of the policy, are significant as a debate is currently on as to whether the scheme should be repeated or not.\n\nThe High Court recently decided that judicial intervention was unwarranted on the December 28, 2015, notification.\n\nThe High Court had reasoned that the policy was implemented for a limited period and to ascertain if there would be reduction in air pollution by reducing the number of vehicles on the roads. The policy allows odd numbered cars to ply on odd dated days and even numbered ones on even dated days.", 
    "section": "national", 
    "title": "SC backs odd-even formula, warns litigants", 
    "subsection": "general", 
    "date": "2016-01-15"
}