{
    "author": [
        "Kolkata Bureau"
    ], 
    "text": "Party feels a Bihar-type grand alliance can defeat Trinamool\n\nA week that started with a call from the State secretary of the Communist Party of India-Marxist [CPI-M] to “join forces” with the Congress, ended with a letter from the most vocal general secretary of the Congress to the party president Sonia Gandhi to seal a Bihar-style “grand alliance” in Bengal.\n\nCongress general secretary and the party’s media face in the State, Omprakash Mishra, wrote to the high command on Thursday urging it to take an “expeditious decision in favour of a tie-up” with the Left.\n\nMr. Mishra had written to the leadership earlier too, claiming that if the Congress and the Left could come together, the alliance would get more than 150 seats in the coming Assembly elections.\n\nIn his latest communication, Mr. Mishra has said that it would be a “win-win situation” for the Left and the Congress.\n\n“[A] tie-up with the Left Front shall help us [to] post [an] impressive victory, with about 80 per cent success rate. The combine’s victory in West Bengal shall further weaken [the] BJP and it shall have a positive impact on the ongoing revival of the Congress in the country,” the academic-politician said.\n\nEarlier, Mr. Mishra told The Hindu that the Left Front and the Congress “would not face” any problem as far as sharing of seats are concerned.\n\n“They [Left Front] will get two-third and we will get one-third and there is no confusion about that,” he said.\n\nRealising that time is running out for both the Left and the Congress to post a serious challenge to the Trinamool Congress, CPI(M) State secretary Surjya Kanta Mishra had asked during a public rally if the Congress was “willing” to have a tie-up.\n\n“Our stand is clear. Remove Trinamool to save Bengal and BJP to save the country. I am asking the State Congress leadership: Are you willing [to join forces with us]?” Mr. Mishra said on Sunday.\n\nHowever, he also underscored the traditional “problem” of the Congress in his lengthy speech. “I know their [Congress’] problem. They have to wait for the high command’s decision. Talks can be held with everyone but there is not much time left for discussions,” Mr. Mishra warned.\n\nMeanwhile, State Congress president Adhir Ranjan Chowdhury has indicated that he was working overtime for a the alliance.", 
    "section": "national", 
    "title": "State Cong wants tie-up with Left for West Bengal elections", 
    "subsection": "general", 
    "date": "2016-01-15"
}