{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "ICMR, AIIMS and CDC to jointly execute project\n\nThe U.S. government’s Global Health Security Agenda (GHSA), launched two years ago to contain the spread of new and emergent infections following the Ebola outbreak, has pumped in a whopping $ 8 million to map the rising anti-microbial resistance in India and build capacities to tackle it better. The rising anti-microbial resistance is a serious health concern in India, and also figured in Prime Minister Narendra Modi’s meeting with U.S. President Barack Obama in September last year.\n\nWhile Indian hospitals acknowledge a rise in drug-resistant infections, there is no centralised documentation of the infection rates, with hospitals shying away from reporting this data fearing loss of business. This project is aiming, rather ambitiously, at the creation of a national network where hospitals will pool in their data on infection rates, which would then be in the public domain for patients to make an informed choice when they have to select a hospital to undergo treatment.\n\nLarger goal\n\nThe project’s larger goal, however, is containing the spread of infections given the huge volume of traffic between India and the U.S., said observers.\n\nTitled ‘Capacity Building and strengthening of hospital infection control to detect and prevent anti-microbial resistance in India’, the project will be jointly executed by the Indian Council of Medical Research (ICMR), the All India Institute of Medical Sciences (AIIMS) and the India office of Centers for Disease Control and Prevention (CDC).\n\nThe project will start with surveillance, followed by data analysis. Systems will then be put in place to first check infections and eventually bring down resistance rates.\n\n“The project will map surveillance of bloodstream infections, ventilator acquired pneumonia and other hospital-acquired infections,” Dr. Kamini Walia, deputy director, ICMR and also the technical coordinator of the GHSA project, told The Hindu . The ICMR has been on the resistance trail since 2014 when it set up six nodal centres in four hospitals. Dr. Walia said the GHSA grant came to India mainly because of ICMR’s existing surveillance network. This project will build upon this network, before it is expanded to around 15 more hospitals in the country.\n\nWork will start with six major hospitals — PGI in Chandigarh, JIPMER in Pondicherry, AIIMS in Delhi, CMC in Vellore, Hinduja in Mumbai and Assam Medical College in Dibrugarh — handpicked for their robust infection control mechanisms.", 
    "section": "national", 
    "title": "U.S. pumps in $8 million to map drug-resistant infections in India", 
    "subsection": "general", 
    "date": "2016-01-15"
}