{
    "author": [
        "K A"
    ], 
    "text": "Rs.76-crore river revival mission of Rural Development Department remains on paper\n\nThe all-time high coliform count recorded in the Bharathapuzha, which is the major drinking water source for three districts, is evoking widespread concern.— Photo: K.K. Mustafah\n\nThe all-time high coliform count recorded in the once mighty Bharathapuzha, which continues to remain a major drinking water source for Palakkad, Malappuram, and Thrissur districts, has evoked widespread concern. Already facing an imminent death largely because of massive deforestation, encroachments, chemical contamination, dumping of waste, and unscientific sewage disposal, the river is now posing severe health hazard to people living in its basin areas.\n\nAccording to official statistics, the river meets the drinking water needs of a population of over 5.9 lakh in rural areas and 1.73 lakh in urban areas.\n\nIt quenches thirst of 175 grama panchayats and a dozen municipalities spread in the three districts and they include the temple town of Guruvayur.\n\nTests conducted at government labs on water collected from the river from Pattambi have confirmed that the coliform count was above 1,000 per 100 ml water.\n\nThe samples were collected from the close vicinity of the pumping station of the Pavaratty Drinking Water Scheme that distributes drinking water in Guruvayur.\n\n‘Alarming situation’\n\n“The situation is quite alarming. The count is high at a time when the river is reduced to a trickle because of the onset of summer months. The count would increase manifold if allowed unchecked during rainy months. The situation demands better steps to properly treat sewage in areas close to the river,” said Shoranur-based environmental activist Vindo Nambiar.\n\nWhen contacted, Kerala Water Authority division executive engineer R. Jayachandran said the authority was supplying drinking water drawing from the river after proper chlorination. “The situation is the handiwork of the government. The much-trumpeted river revival mission of the Rural Development Department with an initial outlay of Rs.76.79 crore still remains on paper. The river is dying,” said P.S. Panicker, environmentalist.", 
    "section": "national", 
    "title": "Water from Bharathapuzha poses health hazard in Kerala", 
    "subsection": "general", 
    "date": "2016-01-15"
}