{
    "author": [], 
    "text": "The winners’ identities remain a mystery, but they bought tickets in Florida, Tennessee and a Los Angeles suburb.\n\nAn eye-popping and unprecedented Powerball jackpot whose rise to $1.6 billion became a national fascination will be split three ways.\n\nThe identities of the winners remain a mystery, but they bought their tickets in Florida, Tennessee and a Los Angeles suburb.\n\nThe winners of the world-record jackpot overcame odds of 1 in 292.2 million to land on the numbers drawn on Wednesday night, 4-8-19-27-34 and Powerball 10. They can take the winnings in annual payments spread over decades or a smaller amount in a lump sum. The California ticket was sold at a convenience store in Chino Hills, California, lottery spokesman Alex Traverso said.\n\nThe winning ticket in Tennessee was sold in Munford, north of Memphis, according to a news release from lottery officials in that State. Florida lottery officials said the winning ticket for that State was sold at a grocery store in Melbourne Beach.\n\nThe California store immediately became a popular gathering spot. Hundreds of people cheered for TV cameras as if it were New Year’s Eve or a sporting event.\n\nSome took selfies with the store clerk on duty, who became an instant celebrity.\n\n“I’m very proud that the ticket was sold here,” the clerk, M. Faroqui, told the local newspaper, the San Bernardino Sun . “I’m very happy. This is very exciting,” he said.\n\nThe 7-Eleven will get a $1 million bonus for selling the winning ticket, Mr. Traverso said. The estimated jackpot amounts had risen steadily since November 4, when it was reset at $40 million. Texas Lottery executive director Gary Grief said this Powerball offered “absolutely” the world’s biggest jackpot. Powerball tickets are sold in 44 States, as well as the District of Columbia, the U.S. Virgin Islands and Puerto Rico. — AP", 
    "section": "national", 
    "title": "Winning numbers announced for historic $1.6 billion Powerball jackpot", 
    "subsection": "general", 
    "date": "2016-01-15"
}