{
    "author": [], 
    "text": "It was jointly organised by Christ College of Engineering and Technology and Christ Institute of Technology\n\nChrist College of Engineering and Technology and Christ Institute of Technology jointly organised ‘Udyog 16’ a mega job fair. Infosys, Airtel, HCL, Lucas TVS and Axis Bank were among the companies that participated in the job fair. It was organised for the students of engineering, diploma, MBA and MCA disciplines. More than 2,000 students from Puducherry, Cuddalore, Chidambaram, Villupuram, Tindivanam, Madurantakam and Tiruvannamalai participated in the job fair. More than 600 students received offer letters on the spot.\n\nWorkshop held on\n\nlean manufacturing\n\nThe Department of Mechanical Engineering of Manakula Vinayagar Institute of Technology, Puducherry, organised a one-day workshop on ‘Lean Manufacturing’ on March 5. M. Dhanasekaran, chairman and managing director, Sri Manakula Vinayagar Education Trust, presided over the inaugural function.\n\nIn the inaugural function prizes were distributed to the winners by chief guest V. Natarajan, executive director of Bimetal Bearings Limited. He addressed the gathering on ‘Principles of Lean Manufacturing and Waste Elimination.’\n\nA. Gnanavel Babu, associate professor, Department of Industrial Engineering, College of Engineering, Anna University, Chennai, spoke on ‘Value Engineering and Product Development.’ He traced the history of value engineering and explained its steps and applications in industries. He also gave a detailed presentation on the application of value engineering on product development.\n\nK. Padmanaban Panchu, assistant professor, Department of Industrial Engineering, College of Engineering, Anna University from Chennai, explained the importance of value stream mapping to minimise the cycle time reduction of production.\n\nS.V. Sugumaran, Vice Chairman, and K. Narayanasamy, Secretary, of Sri Manakula Vinayagar Education Trust, felicitated. The college principal S. Malarkkan welcomed the gathering.\n\nNational seminar on girl child\n\nAn Indian Council of Social Science Research (ICSSR) sponsored two-day national seminar on ‘Challenges on Girl Child’s Health, Education and Protection – Making the Right a Reality’ was organised by the Political Science and Public Administration wing, DDE, Annamalai University and the inaugural function was held on March 17.\n\nS. Manian, Vice-Chancellor of Annamalai University inaugurated the seminar. In his inaugural address, the Vice-Chancellor stressed the need to provide proper education for the girl child.\n\nS. Pugazhendi, Director, DDE, presided. In his presidential address he emphasised the requirements for the improvement of the health of the girls and upholding the rights of the girl child. Andal Damodaran, president, Indian Council for Child Welfare, Chennai, was the chief guest. In her keynote address, she spoke on the theme of the seminar focusing on the three dimensions of the seminar namely health rights, development rights and survival rights of the girl child. She insisted that all these should be a continuous process without any lacunae.\n\nA book titled ‘Budding Generation – Bridging the Gap – Girl Child,’ a compendium of research articles submitted by the delegates from all over India, was released. In this seminar, nearly 200 participants from various universities and colleges took part.\n\nLifetime achiever\n\nawards presented\n\nEminent persons in different fields were given lifetime achiever awards in view of the Achievers Day celebrated in Arunai Engineering College, Tiruvannamalai.\n\nRecipients of the award this year are Kiran Kumar, Chairman, Indian Space Research Organisation (Science & Technology), Rangaraj Pandey, Chief News Editor, Thanthi TV (Electronic Media), Sarat Kumar Acharya, Chairman and MD, Neyveli Lignite Corporation (Corporate Social Responsibility), C. Thangaraj, former vice chancellor, Anna University of Technology (Technical Education), A. Karunanithi, Chairman KVS Hospital, Tiruvannamalai (Son of the soil), J.D. Jhonson, Senior Principal, Jeeva Velu Residential School, Tiruvannamalai (Education) and Wing Commander G. Elangovel, Indian Air Force (Alumni Award).\n\nJustice T.N. Vallinayagam, former judge of Madras and Karnataka High Courts handed over the awards. In his address Justice Vallinayagam insisted that there was a need to remember our rich traditions and appraise them. Nearly 182 students of the college received placement/offer letters.\n\nBy S. Senthalir and\n\nA.D. Balasubramaniyan", 
    "section": "national", 
    "title": "2,000 students take part in mega job fair", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}