{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "Alliance Francaise deploys cartoonist to draw new students\n\nA Bengaluru-based cartoonist had meticulously drawn cartoons for over a year and offered amusing strips every week to Alliance Francaise that had people hooked week after week in 2015. The cartoonist, Pashupathi Chatterjee, is better known by his pen name Poltu.\n\nHe weaved comic strips to draw people into learning French. His two young characters, Vic and Sid, whose adventure of learning French involves several exciting escapades, were drawing people’s attention. “The sheer popularity of these characters pushed Alliance Francaise into bringing all these strips together for a full-length comic book, for celebration of the Francophonie,” said Mikael de la Fuente, Director, AF, Bengaluru. The book would be released at Alliance Francaise on March 21, at 6.30 p.m. Free comics will be distributed at the event.\n\nIn 2006, Poltu left his IT world to pursue his passion for cartooning and humour writing. “Poltu is adept at French and is a Francophile,” says Mr. Fuente. “After he won an international song writing competition in France, he was in constant interaction with French artists. France has always had a huge tradition with this cartooning gender called the 9th Art. India has a growing market for this sequential art of cartooning that makes sense to us,” he says.\n\nPoltu returned to India last year after his residency at the Alliance française de Lyon in France. “During my stay, I produced funny little stories on my interactions with employees and students of the Alliance. This is what Alliance in Bengaluru wanted to replicate. It’s for creating French language awareness that students and public can relate to. That’s the journey of this comic,” he says.\n\nNearly 100 strips of cartoons make up this comic ‘Ici on parle français.’\n\n“The comic book, mainly in French, has English and Kannada words that should inspire Bengalureans into learning French,” says Mr. Fuente.", 
    "section": "national", 
    "title": "A comic strip that could lead to French classes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}