{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Their demands include common education system and neighbourhood schools\n\nActivists want political parties fighting the Assembly elections to include education in their manifesto and spell out their plans for the sector.\n\nSome of the demands of the activists from various organisations include free education, check on commercialisation of education, a common education system, neighbourhood schools and implementation of the Samacheer Kalvi scheme across the State.\n\nThe activists, who met under the banner of Tamil Nadu Education Development Federation on Monday, said the concept of public neighbourhood schools should return to the State.\n\nThey wanted the government to bring education back into the State list.\n\nFormer Vice Chancellor of Manonmaniam Sundaranar University Vasanthi Devi said while the budget allocation for education in the country stood at three per cent, smaller countries like Cuba had set aside as much as 18 per cent. “What we need is a common education system wherein all children have access to schools and quality education in their native language,” she said.\n\nMatriculation schools\n\nActivists called for closing of the 746 matriculation schools that had violated norms. “Each of these schools must pay a fine of Rs. 1 lakh for the violation and after that for every functioning day the schools should pay Rs. 10,000,” educationist S.S. Rajagopalan said.\n\n“Political parties should demand that the Centre return Education to the State list,” said P. Sivakumar, a former government college principal.\n\nIt was during the Emergency the then Prime Minister Indira Gandhi brought the subject under the concurrent list, he added.\n\nThe activists charged that the School Education department was neglecting inspection of private schools, leading to not just blatant violation of norms but also yielding poor quality education.", 
    "section": "national", 
    "title": "Activists urge parties to include education in manifesto", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}