{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Interviews for applicants from Vellore, Tiruvallur and Kancheepuram today\n\nProspective AIADMK candidates returning after the interview at the Poes Garden residence of Chief Minister Jayalalithaa on Mondayin Chennai. —Photo:Deepa H Ramakrishnan\n\nThe AIADMK on Monday continued interviewing candidates seeking ticket to contest the Assembly election in the State.\n\nOver 60 candidates belonging to Tirunelveli, Ramanathapuram, Kanyakumari and Thoothukudi districts were interviewed at Poes Garden, the official residence of the AIADMK general secretary and Chief Minister Jayalalithaa.\n\nEven though the interviews were slated for 2.30 p.m, the candidates and their supporters began arriving in the morning itself.\n\nAccording to sources, the interview was conducted by Ms. Jayalalithaa, who asked them questions relating to the number of years they had been in the party, in what capacity they had served and who won the last time and the difference in number of votes. Interviews are likely to continue on Tuesday of aspirants from Vellore, Tiruvallur and Kancheepuram districts.\n\nMeanwhile, a group of six senior Ministers – O. Panneerselvam, Natham R. Viswanthan, Edappadi K. Palaniswami, R. Vaithilingam, S. P. Velumani and P. Thangamani – met representatives from 55 organisations, including Anaithu Indhiya Christhava Viduthalai Munnani, All India Viswakarma Makkal Munnetra Kazhagam, Pasumpon Makkal Kazhagam, and Thamizhaga Vivasaayigal Katchi.\n\nMaaveeran Dheeran Chinnamalai Peravai general secretary Kongu M. Rajamani said they would continue to work for the victory of the AIADMK.\n\n“We had supported the AIADMK in the past elections, including local body elections. We want a seat for a representative from our organisation that has been in existence in for the past four years. But our members, who have been part of the Kongu Vellala Gounder Peravai, have been supporting the party since 1991 and our support will continue whether we get a seat or not,” he said.\n\nViswakarma Makkal Munnetra Kazhagam leader K.M.Natarajan wanted the community to be included in MBC list. They are presently in the BC list. “We also want the government to resume procurement of wooden furniture from our members, who are carpenters,” he said.", 
    "section": "national", 
    "title": "Aspirants for AIADMK ticket throng Poes Garden", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}