{
    "author": [
        "R Sivaraman"
    ], 
    "text": "“Congress has failed to develop the UT over the last 40 years”\n\nBharatiya Janata Party (BJP) unit president V. Saminathan’s statement in New Delhi on Sunday that people are expecting a “better alternative” in the Union Territory has created ripples in political circles here as the ruling All India NR Congress and BJP have been allies for more than two years.\n\nAddressing the National Executive Committee meeting in New Delhi in the presence of Prime Minister Narendra Modi and BJP national president Amit Shah, Mr Saminathan highlighted the strength of the party in the Union Territory.\n\nMr. Saminathan said the central party and the Union government should pay more attention towards the growth of Puducherry.\n\n“There was neither agricultural nor industrial growth for the last 50 years. Although growth rate in the education sector has slightly increased, there is zero employment opportunity. Unfortunately, for the last 40 years, the Congress party has not developed the UT. We are still in the under-developed list. But the time has changed under the leadership of Prime Minister Narendra Modi who has a clear vision,” said Mr. Saminathan.\n\nFaith in Modi\n\nStating that people of the Union territory had strong faith that the Prime Minister’s vision would bring economic development and social advancement, Mr. Saminathan said that the educated youth, government servants, students and others had lot of respect for the PM’s administrative capability. “People want a better government in UT under Mr. Modi’s governance,” he added.\n\nHe pointed out that people were well aware of the rising popularity of the party following the massive victory during the last parliamentary elections. He added that BJP vote bank had increased substantially. “There is a favourable situation for the party as youngsters favour the BJP,” said Mr.Saminathan.\n\nTaking schemes to people\n\nMr. Saminathan also pointed out that the BJP unit had taken all the schemes of the central government to the people through meetings, banners and wall posters and pamphlets.\n\n“If the party pays special attention towards Puducherry, it will certainly pave way for a massive victory,” said Mr. Saminathan.\n\nThe ruling AINRC, in alliance with BJP, had fielded R. Radhakrishanan as the candidate for the lone Lok Sabha seat in 2014 and won by a huge margin. Later, the AINRC allotted a nominated MLA post to BJP’s leader M. Visweswaran.\n\nHowever, the AINRC fielded its nominee N. Gokulakrishnan as an AIADMK candidate as part of a deal for Rajya Sabha polls in last October (the seat fell vacant following the expiry of the term of P. Kannan), overlooking the BJP local unit’s plea for the seat.\n\nEven though BJP leaders expressed their desire to ally with AINRC for the Assembly elections, the party president and Chief Minister N. Rangasamy is maintaining silence over the alliance formation.\n\nAsked whether his party would have an alliance with AINRC, Mr. Saminathan said, “A clear picture will emerge after a week.”\n\nSaminathan claimed that the BJP's vote share had increased substantially in the Union Territory", 
    "section": "national", 
    "title": "BJP leader’s statement creates ripples in political circles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}