{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Most of the bounced cheques were from the owners of commercial establishments\n\nThe Coimbatore Corporation that is racing against time to boost property tax collection percentage is also running behind those property tax assesses who paid cheques that bounced. According to sources in the revenue section, the civic body was pursuing 36 cases amounting to Rs. 7.02 lakh.\n\nCentral Zone\n\nCentral Zone that has the maximum commercial establishments in the city compared to other zones topped the list with 24 cases amounting to Rs. 5.55 lakh.\n\nMost of the bounced cheques were from owners of commercial establishments, who did so to prevent the return of bill collectors demanding property tax or issued cheques without maintaining the money required in the account.\n\nAs soon as bankers returned the cheques, the corporation staff served notices on property owners who issued the cheques asking them to clear the property tax dues by paying cash in 24 hours after the receipt of the notices.\n\nThe fine varied depending on the property tax.\n\nFor those with property tax up to Rs. 25,000, the fine is Rs. 1,100. For those with property tax from Rs. 25,001 to Rs. 50,000 the fine is Rs. 2,500.\n\nFor those with property tax from Rs. 50,001 to Rs. 1 lakh the fine is Rs. 3,500 and for those who paid a higher tax, the fine is Rs. 5,500.\n\nIf they did not respond to the notices, the corporation would disconnect water supply.They added that the civic body could, however, do more if only it were to treat those whose cheque bounced like rent defaulters.\n\nThe corporation charged 18 per cent of the rent in penalty for payment after the due date – 10th of every month.\n\nPenalty\n\nLikewise, if it were to slap penalty, the cheque bounce cases would come down, they suggested\n\nAs of March 20, the corporation had collected 86 per cent of its current demand of Rs. 130.83 crore. In the coming days, the corporation hoped to surpass last year’s target of 93 per cent.\n\nTo meet the target, the civic body focussed on those whose property tax outstanding was less than Rs. 5,000.\n\nThere were 48,000-odd tax payers, the sources said and added that the bill collectors were visiting those people to ask them to pay before March 31, 2016.", 
    "section": "national", 
    "title": "Bounced cheques hit tax collection in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}