{
    "author": [
        "Staff Reporter"
    ], 
    "text": "School authorities allege the boy's absenteeism for three months as the reason\n\nB.Lakshmanan, who was denied hall ticket to write his board exam by the Vepanahalli Government Higher Secondary School, at the Krishnagiri Collectorate on Monday.- Photo: N.Bashkaran\n\nA Class X student arrived at the Collectorate here on Monday after he was denied hall ticket for SSLC examination that commenced last week.\n\nThe student, Lakshmanan, had reportedly reached the Vepanahalli Government Higher Secondary School to collect his hall ticket, where the school authorities denied him the hall ticket and the permission to write board examination. The boy apparently had not attended school for three months. Incidentally, Lakshmanan’s twin brother Ram is writing his SSLC exams.\n\nAccording to Lakshmanan, he had missed school for 15 days for personal reasons in November. But when he returned to school, the teachers allegedly asked him not to return to school. Following this, the boy had stopped going to school for three months.\n\nWhen contacted, Chief Education Officer Tamilarasu said that the headmaster of Vepanahalli Government Higher Secondary School was summoned. “Apparently the boy did not attend school for three months and never came to collect his hall ticket. According to the school, the boy’s mother had told the school that the boy was working in a soap factory in Bengaluru.\n\nLakshmanan’s parents Balaji and Parvati are daily wage earners. However, officials were not forthcoming as to why Lakshmanan was denied opportunity to return to school after missing school for two weeks in November. It was only after then that Lakshmanan was forced to miss school for three months and subsequently denied his hall ticket for the first one week of board exams. The nominal rolls for the board exams are drawn up in December. However, the school’s accounts do not add up to their own claims. It is unlikely for the school to draw up the name of a student who was not absent in December.\n\nThis is the second such case of an SSLC student being denied hall ticket in Vepanahalli. Last Wednesday, another girl of Vepanahalli Government Girls’ Higher Secondary school was denied hall ticket. Though the school alleged that the girl had not attended school for three months, the girl’s father insisted that it was he who dropped off his daughter at school every morning. Even if she were to have bunked a few days, it was unlikely that the girl may have missed out on three months, he said.\n\nIncidentally, the nominal roll was followed in one instance and not followed in another case. In the wake of the two instances, sources allege that government schools were resorting to tactics of private schools to secure cent percent results and circumventing rules by denying select students the hall ticket.\n\nMeanwhile, Lakshmanan was hastily issued hall ticket and permitted to take his examination a week after commencement of the exams.\n\nThis is the second such case of an SSLC student being denied hall ticket in Vepanahalli", 
    "section": "national", 
    "title": "Class X student denied hall ticket", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}