{
    "author": [
        "K Manikandan"
    ], 
    "text": "Railway Board wants to do away with the practice of pasting lists on trains as part of green policy\n\nSouthern Railway’s proposal to stop pasting reservation charts on compartments of two trains on a trial basis has been largely criticised by passengers.\n\nSome welcome the move, stating that it was long overdue — but they are clearly in the minority. Many others, especially senior citizens, have said that this move will only end up causing inconvenience to them.\n\nAs part of its ‘Go Green’ policy, the Railway Board wants to do away with pasting of reservation charts and Southern Railway decided to stop pasting the charts on two trains — Chennai Central-Bengaluru Shatabdi and Thiruvananthapuram–Hasrat Nizamuddin Rajdhani Express — for one month, but the waitlisted passengers’ chart will continue to be pasted at the station’s entrance.\n\n“I feel we have not reached the stage where we can do away with the procedure. Many commuters do not own a mobile phone. There are still many senior citizens who are not comfortable receiving and reading messages on their phone,” said V. Rama Rao of Traffic and Transportation Forum.\n\nLike Mr. Rao, office-bearers of other associations too said that it had become a habit for passengers to check their names and the berth allotted to them on the reservation charts. P. Rajagopal, a senior citizen, said that while the effort to cut down on the use of paper was commendable, causing inconvenience to passengers should be avoided. Southern Railway officials said the initiative was being launched purely on a trial basis and both the trains they had selected were fully air-conditioned. Making it clear that the trial period would last a month, the future course of action would be decided after receiving a feedback from passengers, they added.", 
    "section": "national", 
    "title": "Commuters condemn ‘no charts’ move", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}