{
    "author": [
        "R Rajaram"
    ], 
    "text": "Yet another stretch taken up for track doubling in the Villupuram – Dindigul broad gauge section is poised for commissioning soon with the Commissioner of Railway Safety (CRS), Bengaluru S.K. Mittal carrying out mandatory inspection on Monday.\n\nAccompanied by a team of officers, he carried out the detailed inspection on the newly laid double line in the 25-kilometre stretch from Mathur to Ariyalur falling in the Villupuram – Tiruchi chord line section. He began the inspection from Mathur railway station in the morning by travelling on a motor trolley up to Ariyalur. The Chief Administrative Officer, Southern Railway P.K. Mishra, Chief Project Manager, Rail Vikas Nigam Limited (RVNL) Pradeep Gaur, Divisional Railway Manager Tiruchi A.K. Agarwal and senior railway officers accompanied the CRS.\n\nRailway sources told The Hindu that Mr. Mittal inspected the level crossing gates, points and crossings, signalling system, bridges, stations and height of platforms en-route as part of his day-long mission.\n\nThe CRS also inspected the Ottakoil and Sendurai railway stations during the course of the trolley inspection that went on for several hours. Thereafter, he carried out the high speed trial on the newly laid double track travelling in a special train from Ariyalur to Mathur. The high speed trial was conducted at a speed of 110 kilometre per hour to ascertain the stability of the new track, a top official said.\n\nThe CRS would be making his observations upon reaching Bengaluru and communicate them to the Southern Railway authorities. The safety inspection by the CRS was mandatory prior to opening the double track for operation of freight and passenger trains.\n\nOnce the CRS accords safety clearance, it would be the third stretch in Tiruchi Railway Division limits to get commissioned under the doubling project.\n\nThe CRS had already accorded clearances for operation of rail traffic in the double track laid between Valadi and Kallakudi Palanganatham; Kallakudi Palanganatham to Ariyalur and from Vriddhachalam to Tiruvennainallur. The Rs.1,200 crore doubling project is being executed by the RVNL, a Government of India enterprise.", 
    "section": "national", 
    "title": "CRS inspects double line stretch in Tiruchi Division", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}