{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "r. Karunanidhi’s statement that he is still hopeful of the DMDK joining forces with the DMK has surprised partymen on both sides. Though this suggests the two parties were still in talks, sources in the DMDK said this was certainly not the case. “We have no idea why he said that. Our stipulation is we will only include parties that accept our leadership in the alliance. We are pretty sure the DMK won’t accept this demand,” said a senior DMDK leader. The leader added that “malicious rumours” were being spread that party functionaries were unhappy with the decision to go alone. “The decision has enthused our cadres, who think the time has come to come out of the shadows of the AIADMK and the DMK,” the leader asserted.\n\nHighly placed sources in the DMK too said an alliance with the DMDK “was close to impossible” since no talks had taken place between the two parties in the last fortnight.\n\nIn fact, Mr. Karunanidhi’s statement took even DMK district secretaries by surprise. “Nobody made any big remark about an alliance with the DMDK in the district secretaries meeting. The leaders too did not say the talks were on. So we do not know why our leader made this remark,” said a district secretary. Some of the district leaders expressed concern that the DMK was being attacked the same way as the ruling AIADMK by the People’s Welfare Front and the PMK, and wanted a strategy to counter the criticism. Observers feel the Mr. Karunanidhi’s statement portrays the DMK as being weak. “The statement is a double-edged sword. If Mr. Karunanidhi doesn’t succeed in pulling the DMDK in, it will hurt the party’s image. The level to which the DMK has climbed down in seeking the support of the DMDK is, in my view, unprecedented,” said political commentator ‘Azhi’ Senthilnathan.", 
    "section": "national", 
    "title": "District secretaries surprised", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}