{
    "author": [
        "Special Correspondent"
    ], 
    "text": "(Top) A booklet on Braille being released for the benefit of visually challenged voters in Nagapattinam on Monday.(Above) A voter awareness documentary film beingshown in Tiruvarur on Monday.\n\n(Top) A booklet on Braille being released for the benefit of visually challenged voters in Nagapattinam on Monday.(Above) A voter awareness documentary film beingshown in Tiruvarur on Monday.\n\nDocumentary film and handbook for the visually challenged are being used\n\nDistrict administrations in Thanjavur, Tiruvarur and Nagapattinam are putting their best foot forward in following the dictum of the Election Commission in ensuring maximum polling in the coming Assembly elections by taking various measures and reaching out to several sections of voters.\n\nThanjavur Collector N. Subbaiyan on Monday inspected facilities at the computerised Voters Facilitation Centre functioning in the town and told the media that similar centres have been established in all taluk offices in the district. Public could access the centres to know the details of their application for entry or correction in election roll data. He inspected the facilities at the Kundavai Nachiyar Government Arts College for Women, the designated counting centre for Thanjavur, Tiruvaiyaru and Orathanad constituencies and reviewed the progress of work there.\n\nIn Tiruvarur, Collector M. Mathivanan inaugurated a short film documentary on the need for participating in the democratic process at the Rabiyammal Mohammed Moideen Arts College for Women. The awareness video documentary was screened under the aegis of the Department of Information and Public Relations. Later, he called upon the electorate to vote without fear or favour or any monetary expectations in return. District Revenue Officer T. Mohanraj and RDO Muthumeenakshi were present.\n\nIn Nagapattinam, Collector S. Palanisamy distributed voter awareness handbook brought out in Braille for the benefit of visually challenged voters. He asked two such persons to read out from the Braille booklet and sought to know their satisfaction on the preparations. He said that visually challenged eligible voters could exercise their franchise without any trouble. Thirty persons who could read with the aid of Braille have been roped in to help visually challenged voters cast their vote.\n\nDistrict Revenue Officer C. Muthumari and Differently Abled Welfare Officer Chandramohan participated.", 
    "section": "national", 
    "title": "Efforts on for maximum polling", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}