{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To new buildings in the same locations in two constituencies\n\nThe District Election Officer has announced shifting of the locations of 11 polling stations coming under Paramakudi (Reserve) and Mudukulatthur assembly constituencies in the district.\n\nActing on the orders of Election Commission of India, District Election Officer and Collector S. Natarajan, on Monday, announced the relocation of the polling stations to the new buildings in the same locations in the two constituencies.\n\nEight polling stations were relocated in Paramakudi assembly constituency while three polling stations were relocated in Mudukulathur assembly constituency, an official release said.\n\nMeanwhile, the Collector called upon the general public and those eligible to vote in the May 16 assembly elections orates to make use of the Voter Facilitation Centres in the district for enrolling their names in the electoral roll, make corrections and obtain voter identity cards.\n\nHe also launched series of SVEEP (Systematic Voters Education and Electoral Participation) activities for achieving 100 per cent poll per centage in the district. After witnessing the electoral awareness campaign launched by the students of Syed Ammal Engineering College, the Collector administered pledge to them to cast their votes in the elections without fail.\n\nLater, the Collector flagged off a voter awareness rally, taken out by the para-medical staff of the Primary Health Centre in Uchipuli and distributed election awareness pamphlets to the public at the market area. Dr Meenakshi, Deputy Director (health) and Revenue Divisional Officer Rampradeepan were present on the occasion.\n\nEmployees of the revenue department also took out a rally here. They distributed pamphlets to the public, calling upon them to exercise their franchise and not to sell their votes for cash.", 
    "section": "national", 
    "title": "Eleven polling stations shifted in Ramnad district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}