{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Apps offer students systematic method of getting ready\n\nMobile phones are no longer distractions for many students who are preparing for important examinations in Chennai.\n\nThere are a wide range of mobile applications that come free of cost or at a nominal price. Apps which provide material, daily question papers and worksheets have become indispensable to many aspirants for examinations such as the Joint Entrance Examination (JEE) and Union Public Service Commission (UPSC) test.\n\n“The focus of an app which helps aspirants is to ensure that study material is available just a click away and this automatically lessens the time a student is going to take to travel to coaching classes,” explains Balaji Sampath, founder of Ahaguru, a coaching initiative to facilitate students to crack JEE and other competitive examinations.\n\nVideo solutions\n\nHis app gives mathematics and science problems with video solutions for students in classes between VII and XII.\n\n“From the feedback we have received, students prefer a few sums and problems regularly rather than large chunks which is what apps should offer— a few sums on a daily basis which will enhance their understanding,” he said.\n\nWhile the Android platform offers hundreds of apps for school students looking to crack entrance examinations, aspirants looking to write exams at a later level like UGC National Eligibility Test (NET) or even the UPSC too have apps.\n\nCurrent affairs\n\nV. Ramanujam, a civil services aspirant, said that ‘IAS Baba’, an app he has been using for one month to help him with preparations for the upcoming preliminary examination, consolidated topics under current affairs and this made preparations easier for him.\n\n“We all usually sit with the newspaper for about two hours to divide current affairs under various topics and then try to frame possible questions about it. Apps which are regularly updated, however, give us news from the papers under various topics through the same platform and even help us tackle essay questions with links to important articles of various newspapers,” he said.\n\nMaking time useful\n\n“With only a few months left for the exams, the little time that we spend with our mobile phones should be useful and having such material easily accessible is a great thing,” he added.\n\nEven though there are many apps available, K. Devnandan, another civil services aspirant, points out that most apps need a revamp so as to keep up with the latest trends.\n\n“Apps sometimes have outdated questions and material which are of no use for students as they find new information available on websites. It is necessary for the apps to be updated with the current pattern of exams,” he added.\n\nAspirants looking to write exams like UGC NET or even the UPSC too have apps", 
    "section": "national", 
    "title": "Exam preparation at the click of a button", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}