{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Dwelling at length on the rich Indian culture and abundant resources, Meghalaya Governor V. Shanmuganathan exhorted young graduates to achieve high, fight against the evil of corruption and strive to preserve the country’s unity in diversity.\n\nAddressing the convocation ceremony at the Sri Sarada Niketan College for Women here on Monday, he called upon the young women to join the country’s progress and ensure that India, with diversities in caste, creed, religion and language, remained united right from ‘Imayam (The Himalayas) to Kumari (Kanyakumari).’\n\nThe teachings of Mother Sarada Devi, Swami Vivekananda and Ramakrishna Pramahamsa had provided the base for leading peaceful co-existence among our countrymen, he said. “Use one hand for self-service and the other for social service,” he also said.\n\n“As you pass out, set high goals and make the greatest achievements in your career but never forget to serve the society,” he said. While achieving progress in their career, the youth should ensure that the society also registered corresponding progress.\n\n“You may achieve very high degree of progress but it will have no significance if you fail to serve the poor,” he said. About 70 to 80 crore of Indian population was still struggling in poverty and scores of destitute women fighting to make both ends meet, he said and wanted the younger generation to lend them a hand of hope.\n\nLamenting that corruption had emerged as an evil and made India hang her head in shame, he said like corruption, dowry harassment, untouchability and divisions based on caste and religion also posed threats to the country’s progress.\n\nThe younger generation should wage a war against them and ensure that India progressed in all spheres and emerged stronger. Mr. Shanmugananthan advised students to draw inspiration from Indian stalwarts such as Kalpana Chawla, Indira Nooyi, Sundar Pitchai and Satya Nadella, who scaled greater heights in their chosen careers.\n\n“Start up India, Stand up India and Build up India are all for you and the government is willing to help you,” he said. Swami Atmananda , secretary and correspondent, and SelvaRani, Principal, were among those present on the occasion.", 
    "section": "national", 
    "title": "“Fight against corruption, preserve nation’s unity”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}