{
    "author": [
        "Udhav Naig"
    ], 
    "text": "His collection of archival material is invaluable, says Jayalalithaa\n\n‘Film News’ Anandan (P.G. Anandakrishnan), often referred to as a ‘living encyclopaedia on Tamil movies,’ died here on Monday after a brief illness. He was 89 and is survived by wife Sivagami, two sons — ‘Diamond’ Babu (a Public Relations Officer in the film industry) and Ravi — and two daughters, Geetha and Vijaya.\n\nPassionate about photography, Anandan started his career as a freelance photographer with Film News , which gave him the moniker ‘Film News’ Anandan. He slowly slipped into the role of a film historian after he started jotting down salient details of the happenings at a film shoot. Anandan went on to become a colossus in film history.\n\nA lesser-known aspect of his career is that he was also one of the most successful public relations personnel in the film industry when the profession was still at a nascent stage. He worked as a PR person for over 3,000 films. “It was thanks to M.G. Ramachandran that I entered that field. Beginning with Nadodi Mannan , I took care of the public relations of all his films till the very end,” he was quoted as saying in an interview to The Hindu .\n\n‘Film News’ Anandan was a warehouse of memory, says film director and script writer Chithralaya Gopu.\n\n“None of us in our film unit, including director Sridhar, bothered to archive our creations, but Anandan used to do the job, even without our knowledge. I was then driving a Vespa scooter and my house was in Triplicane. Anandan lived on Peters Road in Royapettah and everyday he insisted that I pick him up to the sets and drop him back. He utilised this travel time to raise a volley of questions about our movies and personal lives. I did not realise then that he was recording our lives and then, all of Kollywood looked to him for information. He saved whatever remained, like a treasure hunter, and could provide information about movies, which had been packed away in dusty old boxes for years...” said Mr. Gopu.\n\nNo wonder then that everyone from the Tamil film industry has sent their condolences to his family, including Tamil Nadu Chief Minister Jayalalithaa and DMK chief M. Karunanidhi.\n\nHe recently published a phenomenal and extensive work on film history, a collection of data that he had gathered from over 16,000 feature films in different languages. Anandan provided clarity and perspective for many generations of film journalists until his death.\n\nThrough his long career, Anandan had a ringside view of the evolution of technology in Tamil cinema and how film audiences understand the craft in cinema. “The layman of today knows much more about camera angles, editing and art than he did earlier,” he said in an interview to The Hindu . Those who have had the good fortune of speaking to him attest to his incredible memory and strong sense of humour.\n\nSpecial Correspondent adds:\n\nChief Minister Jayalalithaa on Monday condoled the death of film historian ‘Film News’ Anandan. “When he worked as the PRO of the South Indian Film Chamber of Commerce he began his collection and later that turned into a passion. His collection of archival material was huge. This led to his receiving several awards, including the Kalapeetam, Kalaichelvam and Kalaimamani awards,” Ms. Jayalalithaa said.\n\nIn 2002, her government had provided Rs. 10 lakh to procure and protect the material.", 
    "section": "national", 
    "title": "‘Film News’ Anandan passes away", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}