{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Demand release of 23 country boat fishermen, three ‘vallams’\n\nCONTINUING STIR:Country boat fishermen and family members of the 23 fishermen jailed in Sri Lanka, laying siege to the office of the Assistant Director of Fisheries in Rameswaram on Monday.— Photo: L. Balachandar\n\nStepping up their agitation, country boat fishermen ‘stormed’ the office of the Assistant Director of Fisheries here on Monday, seeking release of the 23 fishermen, arrested by Sri Lankan navy on a charge of poaching, along with their three vessels.\n\nFour days after staging an agitation after opening ‘kanji thotti’ (gruel centre) in Pamban, the fishermen, including the family members of the 23 arrested fishermen, ‘stormed’ the AD’s office and raised slogans, urging the authorities to secure the release of the fishermen.\n\nLed by country boat fishermen association leaders S.P. Royappan and G. Arul and supported by CITU-affiliated Tamil Nadu Meenpidi Thozhirsanga Koottamaippu, the fishermen and the family members, squatted on the stairs, corridors and inside the office as officials were not available in the office to receive their petitions.\n\nAs they continued the protest, Deputy Director of Fisheries M. Kasinathapandian, who was with Additional Director (Marine Fisheries) Mohanasundaram and World Bank officials, visited the AD’s office and received the petitions from the family members of the 23 fishermen.\n\nCondemning the Lankan navy for arresting the fishermen who practised traditional fishing method without causing harm to the marine resources, the fishermen demanded their early release along with their vallams.\n\nThey also demanded the release of 20 Thoothukudi country boat fishermen along with their three vessels.\n\nKoottamaippu district secretary M. Karunamurthy said that the fishermen would continue the stir till the Centre prevailed upon the Sri Lankan government and secured the release of the fishermen. They had decided to lay siege to Indian Navy detachment office here on March 24, he said.\n\nReferring to reports that the Lankan authorities might release all the arrested fishermen ahead of Good Friday, he said that the fishermen would go ahead with the agitation if the country boat fishermen were not released with their vallams.\n\nHe said that the arrested included three juveniles.\n\nThe family members of Amaladoss, one of the arrested fishermen, could not take part in the agitation as his wife was severely depressed, he said.", 
    "section": "national", 
    "title": "Fishermen lay siege to office", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}