{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has disbelieved an advocate’s claim of having been assaulted, at the instance of his enemies, when he was riding a motorcycle, though the police had registered only a simple motor accident case in connection with the incident.\n\nDismissing the lawyer’s plea for a Crime Branch-Criminal Investigation Department (CB-CID) enquiry, Justice P.N. Prakash disagreed with the contention of the petitioner, R. Prakasam, that Dindigul police had intentionally made the assault appear like a road accident case.\n\nArguing the transfer-of-investigation petition in person, the advocate claimed to have been attacked with a stick on his head and shoulder by two unknown motorbike-borne men when he was riding his motorcycle within Natham police station limits on February 7, 2014.\n\nStating that he fell unconscious immediately after the attack, the petitioner said that he found himself to be at Government Rajaji Hospital here when he gained consciousness and was subsequently shifted to a private hospital in the city at the request of his wife.\n\nHowever, the police booked a case against one Vivek under Sections 279 (rash driving) and 338 (causing grievous hurt by act endangering life) of the Indian Penal Code in connection with the incident, and let him off on payment of a fine of Rs. 1,500 after he accepted his guilt, he said.\n\nAfter going through the materials in the case, the judge pointed out that it was not a hit and run case.\n\nOn the other hand, the police had booked the First Information Report only on the basis of a complaint lodged by the petitioner’s wife in which she had mentioned the registration numbers of both vehicles.\n\nFurther, since the petitioner had made the claim of attack only three months after being discharged from the hospital and also because the police had filed a charge sheet in the case only after thorough investigation, the judge said: “It is not a fit case to order further investigation by the CB-CID.”", 
    "section": "national", 
    "title": "HC disbelieves lawyer’s claim of attack by his rivals", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}