{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court Bench here has set aside a charge sheet filed by Madurai City police against a 75-year-old woman on a charge of subjecting her granddaughter-in-law to cruelty and held that further prosecution in the case would amount to abuse of process of law.\n\nAllowing a quash petition filed by the elderly woman as well as the complainant’s married sister-in-law residing in Bangalore, Justice P.N. Prakash said: “Usual allegations of cruelty that are normally levelled against the family members in matrimonial cases, have been made here also.”\n\nHe said that the Supreme Court too had expressed its anguish over Section 498-A (woman being subjected to cruelty by husband or his relatives) of the Indian Penal Code having earned “a dubious place of pride amongst the provisions that are used as weapons rather than shield by disgruntled wives.”\n\nIn a judgement delivered on July 2, 2014, the apex court had said: “The simplest way to harass is to get the husband and his relatives arrested under this provision. In a quite number of cases, bed-ridden grandfathers and grandmothers of the husbands, their sisters living abroad for decades are arrested.” Mr. Justice Prakash pointed out that in the present case too, the Sub-Inspector of All Women Police Station, Madurai South, had registered a case against the grandmother and sister of the complainant’s husband under Sections 498A, 406 (criminal breach of trust) and 506 (criminal intimidation) of the IPC.\n\nAnother case\n\nSimilarly, dealing with another case booked against a family of three by All Women Police at Palayamkottai, the judge quashed the charge sheet in view of a compromise reached between them and the complainant woman.\n\n“Considering the nature of allegations and in view of joint memo of compromise, this court is of the opinion that no useful purpose would be served in keeping the matters pending. Therefore, the entire proceedings pending on the file of the Additional Mahila Judge, Tirunelveli, are hereby quashed,” he said.", 
    "section": "national", 
    "title": "HC quashes charge sheet against septuagenarian woman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}