{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Monday directed the Bar Council of Tamil Nadu and Puducherry (BCT) to revoke the suspension of seven lawyers, who were penalised for disrupting the functioning of the Central Industrial Security Force (CISF) on the court campus.\n\nAt the same time, the court noted that for the first time in the past ten years, all the courts in the State had functioned without a day’s boycott for over six months, thanks to the proactive role played by the Chairmen of the Bar Council of India (BCI) and the BCT.\n\nA Division Bench of Justices V. Ramasubramanian and K. Ravichandrabaabu, while granting relief to K. Sathyabal, R.Y. George Williams, R. Prasadh, U. Rajarajan, L. Infant Dinesh, V. Kayalvizhi, and A. Abdul Rahman, who were barred from practising the profession for over 100 days, rejected the contentions raised by the petitioners. “Neither the initiation of proceedings nor the issue of a propitiatory order preventing the petitioners from practising in any court nor the transfer of the proceedings to the Disciplinary Committee of the Karnataka State Bar Council can be taken exception to,” the judges said.\n\nHolding that extraordinary situations demand extraordinary remedies, the Bench said, “After the BCI and the State Bar Council took action against a number of lawyers, some amount of discipline has been restored. One good thing that has turned out of the entire episode is that the lawyers, who preferred to issue boycott calls at the drop of the hat, have chosen to take recourse to legal remedies when it came to their own suspension from practice.”\n\nDirecting the State Bar Council to pass orders of revocation within one week, the Bench made it clear that this order will cover only the cases of the petitioners before the court and not others who have not chosen to come to the court. On a request made by the petitioners that the Disciplinary Committee of the Karnataka Bar Council may be directed to complete the enquiry and pass final orders within a timeframe, The Bench directed the Karnataka State Bar Council to request the Disciplinary Committee to complete the enquiry within six weeks.\n\nSays initiation of proceedings against them cannot be taken exception to", 
    "section": "national", 
    "title": "HC revokes suspension of seven lawyers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}