{
    "author": [], 
    "text": "The Palayam Irrigation Channel running across Thiruvananthapuram Road below a narrow bridge at Murugankurichi in Palayamkottai is filled with dirt and sewage as there has been no flow of water during this season. As a result, it has become a breeding ground for mosquitoes and emanates a stench, causing health hazard to the public living around. Hospitals and residential houses are situated on its bank. Will the Corporation take measures to put an end to the hazard? The people should also cooperate by not throwing waste into the channel.\n\nJ. Baby Harline,\n\nPalayamkottai.\n\nPrepaid auto\n\nIn Tirunelveli railway station and in the new bus stand, very often, passengers have to pay an exorbitant amount even to travel a short distance in autorickshaws. In the interest of the public, the Corporation authorities may introduce prepaid auto system as in Chennai.\n\nP. Victor Selvaraj,\n\nPalayamkottai.\n\nMobile application\n\nThe mobile application for IRCTC is user friendly. It is very easy to book tickets through this application rather than IRCTC’s website. But there is an unwanted restriction to book tickets between 8 a.m. and 12 noon. Removal of this application will benefit users .Will the IRCTC consider this request?\n\nT. Manoharan,\n\nKovilpatti.\n\nCongested road\n\nThough Nagercoil is a small town, a large number of vehicles ply here. The road between Veppamoodu and Duthie school junction is always busy due to heavy traffic. All buses from various villages go through this road to reach Vadaserry. But one can see a large number of four-wheelers and two wheelers parked on the road side, which is a hindrance to movement of vehicles. Necessary action must be taken to prevent parking of vehicles on the road margins.\n\nK. Ananthanarayanan,\n\nKanyakumari.\n\nRoof for bus stands\n\nIn the absence of shelters, commuters find it difficult to stand in the open to board buses at Nesamony and Christopher bus stands of Nagercoil. The Nagercoil Municipality should put up roof over these bus stands to alleviate sufferings of passengers.\n\nK. Chelliah,\n\nAundivillai.\n\nYouth power\n\nTirunelveli Collector M. Karunakaran, with a view to creating awareness among voters, especially the youth, of the importance of exercising their franchise in the coming Assembly election, has triggered an initiative among students of Rani Anna College for Women at Pettai by administering an oath to cast their votes without fail, as well as by inaugurating a signature campaign and rally (March 12). Now it is the duty of these students to take the message to voters and make them vote on May 16. This is not the duty only of students of a particular college but all colleges in Tirunelveli, Tuticorin and Kanyakumari districts. They should spread the message on voting, especially among upper middle-class and higher income group of people who are said to be reluctant to visit the polling booth, wait in queue and exercise their democratic responsibility. All the arts and science colleges affiliated to Manonmaniyam Sunderanar University have the Red Cross and other youth organisations and if the youth power works with a determination to make all the voters in their area to go to the polling stations, the dream of Election Commission to accomplish 100 per cent voting will be accomplished.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai.\n\nPolice action\n\nI welcome the timely storming operations carried out by the Kanyakumari district police in all the four sub-divisions — Nagercoil, Kanyakumari,Thuckalay and Colachel — on Friday night (March 20). It is matter of concern that 1098 cases have been registered for drunk driving, over speed and absence of valid documents.\n\nI feel happy to know that it has been decided to repeat the storming operations every Friday till the elections are over.\n\nS.J. Sylvestine,\n\nKoottapuly.\n\nPathetic condition of lake\n\nChemmang Kulam, a lake with two-km circumference, is located in Ozhuginasery near the Nagaraja Temple, on the right side of the Avvai Shanmugam Salai. Nagercoil, a town with a number of lakes and ponds in the past, has only a few of them now because of encroachment in the name of urban development. Even the two bus stands were beautiful lakes a few years ago.\n\nOriginally, most of the lakes were made for the purposes of irrigation and fishing and they influenced the climate of the town also.\n\nThe lakes provided water for taking bath and washing clothes, apart from replenishing the ground water in the vicinity. But Chemmaang Kulam filled with garbage, weeds and sewage water is a pathetic sight.\n\nHence the management of this lake, traditionally carried out by the Public Works Department, must be either handed over to the Nagercoil Municipality or to a public–private sector experimentation.\n\nA path for walking around the cleaned up lake will be a great source of delight for people of all ages and abilities.\n\nG. Stanley Jeyasingh,\n\nNagercoil.", 
    "section": "national", 
    "title": "Health hazard", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}