{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "With the sweltering heat showing no signs of abating, doctors in the city say they are seeing a spike in dehydration-related illnesses. Cystitis and viral fevers are pouring in, as are cases of diarrhoea, skin infections, chicken pox as well as hand, foot and mouth disease, they say.\n\n“Summer seems to have set in early this year and we are seeing many cases related to dehydration,” said Padma Appaji, consultant paediatrician, Vijaya Group of Hospitals. “We are telling parents to ensure that their children stay hydrated and maintain good hygiene. Give them plenty of liquids. We recommend that children take the chicken pox vaccine,” she said.\n\nOver the last two weeks, Dr. Appaji said chicken pox and hand, foot and mouth disease cases had come in. A lot of children, especially girls, do not urinate frequently enough, especially while in school, and this can lead to cystitis, which causes a burning sensation and discomfort while urinating, said doctors.\n\n“Also, with viral infections going around, high temperatures in children are causing seizures or fits. Another common infection around this time is staphylococcal scalded skin syndrome. Parents should ensure their children bathe twice a day and avoid too much powder as this can block the sweat glands,” said Janani Sankar, senior consultant paediatrician at Kanchi Kamakoti Childs Trust Hospital.\n\nThe hospital gets at least 10 cases of cystitis a day. Families must avoid using native medications in the case of chicken pox, as this could lead to secondary skin infections, she said.\n\nA few cases of accidental poisoning have also come in, said Dr. Sankar, with children drinking kerosene stored in water bottles at home. Many children eat and drink water outside of the home when it is hot, said K. Jeyachandran, deputy superintendent at the Institute of Child Health, Egmore, and this leads to diarrhoeal diseases.\n\n(Additional reporting by\n\nK. Lakshmi)", 
    "section": "national", 
    "title": "Increase in illnesses caused by dehydration", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}