{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tablets enable interaction between patients and attendants reducing the risk of infections\n\nA first for government hospitals, Jipmer introduces a system to help family members interact with patients in the ICU without entering the room.— Photo: Special Arrangement\n\nIn a move to curb infections, Jipmer has launched ‘tele-barrier nursing’ service in its Intensive Care Units (ICUs) that will facilitate family members to interact with patients without entering the ICU room and aggravating infection risks to those under intensive care.\n\nJipmer is the first government hospital in the country to launch ‘Tele-Barrier Nursing in ICUs’, Dr. S.C. Parija, Director Jipmer, said.\n\nInfection in ICU\n\nWhile introducing the facility, he pointed out that infection in ICUs in Government Hospitals was a common problem due to frequent visits of attendants and relatives of patients in ICUs. The tele-barrier nursing concept was launched to address this problem while at the same time allowing the bystander to interact with a patient without physically entering the ICU and posing an infection risk.\n\nAs part of providing this service, Jipmer has kept a tablet (computer fitted with camera, microphone and speaker) outside the ICU and another tablet is given to the patient inside the ICU. Both patient and bystander can engage in a real-time interaction. The service is provided free to the bystanders of patients of ICUs.\n\nDeputy Director Dr. Ashok Badhe, Dr. Balachander, Medical Superintendent, Dr. Mahadevan, Dean (Academics), Dr. Anita Rustagi, Officer In-Charge of HIS and Dr. Ravi Kumar Chittoria Officer In-Charge of Telemedicine participated.\n\nIn fact, a similar service was successfully tried out for Burn patients at Jipmer’s Tertiary Burn Centre and has now been extended to ICUs in the super specialty block.\n\nDr. Parija stated that in the second phase the service will be provided to other blocks of Jipmer like ‘Women and Children Hospital (WCH) including Labour Room, Regional Cancer Centre (RCC) and Trauma Centre.", 
    "section": "national", 
    "title": "Jipmer launches tele-barrier nursing for ICU patients", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}