{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Examination of the first batch of witnesses completed\n\nOne more witness produced by police in the temple pujari suicide case has turned hostile. Examination of the first batch of eye witnesses continued for the third day at the Principal District and Sessions Court here on Monday.\n\nThenkarai police produced eight of the 22 witnesses for trial in the afternoon. All the accused, except O. Raja, brother of Finance Minister O. Paneerselvam, were present. Defence counsel M. Kannappan submitted a petition on behalf of Mr. Raja and the court admitted it.\n\nReacting to a series of questions raised by Public Prosecutor B. Mohan and the defence counsel, Mani of Kallipatti gave contradictory statements that did not match with the statement recorded by the police. After hearing the statement of Mani, the court accepted him as a hostile witness. Later, another witness, Sethu of Vadakarai in Periyakulam was examined. The prosecution and the defence counsel had examined five witnesses, including the petitioner and the father of the deceased, Subbu Raj and his daughter Pandi Murugu till Monday. With this, the examination of the first batch of witnesses was completed.\n\nTwo more batches of witnesses will be examined in the next three days. The examination of all the witnesses is expected to be completed by Thursday.\n\nLater, Principal District Judge R. Poornima adjourned the case till Tuesday. She had already said the trial would be conducted continuously till March 24. Charges were framed against O. Raja and others on December 15, 2015. The Theni District Court had transferred the case to the Dindigul District Court on November 25 last year on the direction of the Madurai Bench of the Madras High Court. The Bench also directed the subordinate court to complete the case within four months.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam on December 8, 2012, after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "One more witness turns hostile in pujari suicide case", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}