{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Production came to a halt after a boiler tube in the unit developed puncture\n\nPower generation in the fifth unit of Tuticorin Thermal Power Station (TTPS) was suspended after it suffered a breakdown, reliable sources said here on Monday.\n\nProduction came to a halt after a boiler tube in the unit developed a puncture on Sunday evening. A team of technical experts was trying to rectify the problem and production was expected to resume either by Monday night or in the early hours of Tuesday, sources said.\n\nA portion of the coil in the affected boiler tube was weak and hence it could have caused the puncture. During the next phase of overhauling, damaged coils in the boiler tube would probably get replaced. In February, the transformer was replaced in the fifth unit.\n\nThe sources said that deposits of ash content from burnt coal in the boiler tube could also be the reason for the puncture. The boiler tubes at the TTPS were primarily designed to handle domestic coal, which contained 40 to 42 per cent ash compared to imported coal which had an ash content of 8 per cent.\n\nPower generation relied on 25 per cent imported coal and 75 per cent domestic coal, sources said.\n\nReferring to the performance of the unit, which was commissioned in 1991, the sources said that it was functional for 232 consecutive days in 2004 – the best performance on record among the five TTPS units. The fifth unit achieved the highest plant load factor of 104.7 per cent the same year, the sources added. The second unit had also not been functional since March 4 as maintenance works were under way. The transformer in the second unit was being replaced with a new one. Hence, there was a production shortfall of 420 mw. However, power production was in full swing in the other three units which had a capacity to generate 210 mw each.", 
    "section": "national", 
    "title": "Production in fifth TTPS unit suspended after breakdown", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}