{
    "author": [], 
    "text": "Train lacks\n\ntoilet facilities\n\nThe daily evening Bangalore- Dharmapuri passenger train starting at 6.30 p.m. from Bangalore city is quite a convenient except for lack of toilet facilities. With well configured coaches built by ICF in Chennai with toilet facilities also it should be a very passenger friendly train. But no one knows why the toilets on the train are locked up with their door handles welded to the door frame. I wonder which railway official had done this unfriendly act of closing an existing and important facility.\n\nOn the one hand the government decries open defecation and stresses the importance of toilets and on the other hand they are sealed off from the travelling public. Before providing bullet trains and all kinds of luxury trains could the railways address this basic need of passengers? Is there perhaps any perception in the railways that passenger train patrons do not count since the tickets do not burn their pockets?\n\nMatthew Adukanil,\n\nDon Bosco College,\n\nDharmapuri.\n\nCovering the statues\n\nCovering statues during the period of elections does not serve any purpose. Removing banners and wiping out writings on the wall may be alright. Even if the statues are covered, people will know they are there and curious ones will try to find whose statue it is. It is only a waste of time and money to cover the statues. Again someone may uncover them and that will lead to more problems. Of course, the best thing is not to have any statues at all.\n\nV.S. Venkatavaradan,\n\nSalem.\n\nProvide traffic signal\n\nThe Erode Municipality had widened the roads near Government Hospital.But the problem is that there is no traffic signal. Since no signal is there public are moving with vehicles as they like which is resulting for accidents.\n\nIt is high time at least now the Traffic Police Department must provide signal at the GH Rountana to avoid accidents.\n\nM. Sampath Kumar,\n\nManickampalayam Housing Unit,\n\nErode.\n\nSet up police outpost\n\nAnti-social elements are roaming freely in the Ammapettai area.\n\nMany unknown people are also moving freely in the streets such as Gandhi Maidan areas, Ellappan Street, 40 Feet Road, Kuzhanthan Street and New Street.\n\nA large number of women and girls visit the ‘Arivu Tirukoil’ on New Street. The police should take steps to check the activities of the anti-social elements.\n\nThe police should also come forward to set up a police outpost at Ammapettai.\n\nG. Velayutham,\n\nSalem.\n\nWarn hotel owners\n\nThe mutton stalls and the hotels situated in the vicinity of Seelaveri tank at Ammapettai are depositing the wastes in the tank. This polluted the tank water and also posed a health hazard to the people residing in the nearby localities.\n\nThe bad odour emanating from the tank also gives horrible time to the passersby.\n\nThe authorities concerned should give strict warning to the shop and hotel owners against depositing wastes and garbage in the tank.\n\nS. Krishnan,\n\nSalem.\n\nHealth hazard\n\nThe drainage at Alamarakadu street area near the new bus stand in Salem city is not being cleaned regularly. This leads to overflowing of the drainage, which in turn poses a serious health hazard. The Corporation authorities should take steps for cleaning the drainage every day.\n\nR. Kanmani,\n\nSalem.\n\nShift Tasmac shops\n\nThe presence of three Tasmac shops on the road leading to bus stand in Attur town is causing much hardship to the local people and the road users.\n\nA temple, hospital, residential localities, theatre are situated in the vicinity of the shops. A large number of school girls use this road. These Tasmac shops should be shifted immediately.\n\nP. Ramamoorthy,\n\nAttur.\n\nParking of vehicles\n\nThe parking of cars on both sides of the Salem New Bus Stand – Ammapettai main road at the first Agraharam affects free flow of traffic. This road is already very narrow and the parking of vehicles on the road sides, further worsens the situation.\n\nFrequent traffic jams particularly during the week ends and other important festival and marriage days pose much hardship to the vehicle users. I request the police to put an end to the parking of vehicles on the road sides at first Agraharam.\n\nG. Kumar,\n\nSalem.\n\nDrinking water\n\nto tourists\n\nWith summer months ahead, a large number of tourists from different parts of the southern states expected to visit the hill station of Yercaud.\n\nThe Salem district administration should take steps for creating additional facilities in the town. More pay and use toilets should be constructed at important points and steps should be taken to supply protected drinking water to the visiting tourists. The Yercaud Town Panchayat should come forward to set up more parking lots.\n\nB. Samiullah,\n\nSalem.\n\nNoise pollution\n\nThe police grants permission for holding public meetings on Jagir Ammapalayam main road in the city.\n\nThis is a busy road leading to many residential localities. The closing down of this road when public meetings are held poses much difficulty to the local residents.\n\nMoreover, the using of public address system on such occasions also creates noise pollution.\n\nS. Kadiresan,\n\nSalem.\n\nSpeeding lorry drivers\n\nThe lorries proceed at a neck break speed on the main thoroughfares in Namakkal town and the surrounding areas.\n\nThe speeding lorries pose a threat to the life of the other vehicle users. The Namakkal town police should take stringent action against the speeding lorry drivers.\n\nK. Sivaraman,\n\nNamakkal.\n\nProvide basic amenities\n\nRecently I visited Thevoor town panchayat. More than 100 families reside in Pandara street in this town panchayat for more than five decades. The local people are facing much hardship due to the absence of basic infrastructure facilities such as drainage, proper roads etc. In the absence of drainage, the drain water flows on the main road and in the residential colonies.\n\nThe Thevoor panchayat should take steps for creating all basic infrastructure facilities here.\n\nM. Ganesan,\n\nSalem.\n\n(Readers can mail letters to cbereaders@thehindu.\n\nco.in with address and phone numbers)", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}