{
    "author": [], 
    "text": "With the arrival of summer, extra care is required from the Tiruchirapalli City Corporation. Epidemics may occur and spread due to the soaring mercury. Quality drinking water, control of flies, mosquitoes, and cleanliness of public places are going to be the big challenges. Round-the-clock check on packed drinking water, soft drinks, and eateries is a must. Food and Adulteration Department must be on its toes.\n\nPrabaharan A.,\n\nPuthanampatti\n\nCustomer\n\nservice absent\n\nThe customer service in banks has reached a nadir in these days of tech-savvy banking. The clerks and cashiers in charge of banking services barely pay attention towards customer service. Even senior citizens and unlettered account-holders are unceremoniously asked to do their chores in banking. The move by various banks to make the customers do banking services like passbook printing, cash deposits in machines installed on their premises and outside is nothing short of abdication of responsibility. The customers, under duress conditions, are being directed towards these machines which can only be considered as additional service to the people and nothing else. The bank managements should stop expecting people to do self-banking and restore customer service as before.\n\nJ. Suganthi,\n\nLalgudi\n\nRation card\n\nfull of errors\n\nI got my new ration card only a few days ago after much effort. To my shock there were three errors in the card. While my residential address was wrong, my son’s name was misspelt. I have LPG connection but in the card it was shown as “nil” in the column. The errors in the ration card appear deliberate with ulterior motive to cause inconvenience and hardship to the applicants as I had verified all particulars submitted by me with the true copy of the application. I wonder how such errors creep in. Is there not a maker-checker concept in preparation of such vital documents? I appeal to the authorities concerned to look into this.\n\nJ. Anatha Padmanaban,\n\nSrirangam\n\nCurb defacing\n\nof parapet\n\nDefacing of public walls by political parties is a common phenomenon. As the model code of conduct is enforced, the public walls are given a fresh coat of paint covering the writings on the public walls. This is to be preserved and defacing of such public walls to be prevented in future. A few weeks earlier, I was travelling from Tiruchi to Kumbakonam, all along the route all the flyover parapets were painted with government schemes in multiple colours, distracting the drivers. As per Highways department norms, these parapet walls are to be painted in black and white strips. The Cauvery bridge is now provided with a brick parapet in place of the concrete perforated parapet. The new brick parapet will soon become a canvas for parties. If Tiruchi wants to retain its clean city ranking and improve upon it, the corporation authorities need to take steps for preventing defacing of public walls along with other items of interest.\n\nThirumeni J.,\n\nCantonment\n\nTough paper\n\nfor Math exam\n\nCBSE Mathematics paper for class 12 was really tough. Although questions were from syllabus, it has been presented with a twist. The questions were set by the experienced teachers. Teachers should come forward to expose the skills of students and not to show their mastery and knowledge by twisting questions which confuse the children. The authorities should now show leniency in Maths paper evaluation.\n\nDimple R. Mohan,\n\nMahalakshimi Nagar East Extension,\n\nTiruchi\n\nBus connectivity\n\nto Samayapuram\n\nIn Tiruchi district, Uppiliyapuram is located 20 km north of Thuraiyur. It connects with higher population density villages such as Thammampatti, Sentharapatti, Koppampatti, Kottapalayam, Vairichettipalayam, Mettupalayam, and Venkatachala puram. There is no bus connectivity to Samayapuram from these areas. Devotees, public, and students have to catch three buses — first from Uppiliyapuram to Thuraiyur and then from Thuraiyur to No. 1 Tollgate and later from there to Samayapuram. Passengers and elderly persons undergo the ordeals. So, I request the TNSTC transport authorities to sanction a direct bus facility from Uppiliyapuram to Samayapuram via Puthanampatti.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nDog bites\n\nIt is alarming to read that dog bites in Mumbai accounted for more deaths in 20 years than the combined toll in two terror strikes in the Mumbai city — the serial bomb blasts and 26/11 attacks. In these situations, imagine the death toll because of dog bite throughout the nation. Yes, these stray dogs have become a threat to the life and health of the human beings. But the animal lovers are not at all bothered about this aspect and as such the stray dogs were having a field day. Yes, the animal lovers, the Blue Cross, and the SPCA members who are worried about the protection of the lives of the dreaded species are not at all worried about the infants, human beings, and other cattle killed by these stray dogs and try to obstruct the work of civic authorities in capturing these stray dogs.\n\nH. Ghouse Baig,\n\nEdamalaipattipudur\n\nHave a divider\n\nnear the court\n\nOn Bharathidasan Road, divider stretches up to Police Officers Club followed by a gap and the divider starts again from court’s entrance and extents up to traffic circle formed recently. In the absence of a divider near the court, vehicles come from the traffic signal and enter court premises. These vehicles pose a great risk of collision. Vehicles coming from court gate, pass through this gap to proceed to Woraiyur or Sastri Road. In the absence of a road divider up to traffic signal, the stretch witnesses traffic snarls, making the area more accident-prone zone. To avoid all these problems, I suggest the road divider is extended up to traffic signal. The gap should temporarily be closed using makeshift barricades. This will ensure regulation of vehicles through a swift flow.\n\nKanagaraj Arthur,\n\nTiruchi\n\nStrike by\n\njewellers\n\nWhen the Centre is trying to coax citizens to comply with the laws of the land such as Income Tax returns, the stand of the jewellers to bring pressure on the government to drop the proposal for levying 1 per cent cess on purchase of jewellery is puzzling. The consumers want transparency in transactions and ours is the only country where traders bend rules in their favour and successive governments giving in to their demands on political consideration. It is sad that politicians in Tamil Nadu extend support to jewellery traders.\n\nT.M. Ranganathan,\n\nSrirangam", 
    "section": "national", 
    "title": "Threat of epidemics", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}