{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The two allegedly quarrelled while consuming liquor\n\nA wordy duel between two inebriated men resulted in the brutal murder of one of them in a private lodge at Chinthamani area here in the late hours on Sunday.\n\nThe name of the victim was given as Vellaipandi (28). The Fort police arrested Vicky alias Vignesh Kumar (20) on the charge of killing the former.\n\nThe murder took place inside a room of the lodge where Vellaipandi had been staying over the past few days.\n\nThe police said Vellaipandi, a resident of Kadayanallur in Tirunelveli district, checked in a few days ago to meet his father who was in manpower consultancy business in Tiruchi.\n\nVicky, said to be an accused in Madurai district, also checked in at the same lodge and stayed in another room recently. The two reportedly became friends. Vellaipandi got money from his father who asked him to see off his brother who was to fly abroad.\n\nInstead, he used the money to buy alcohol. On Sunday night, Vellaipandi and Vicky went out, bought alcohol and food packets and came back to the former’s room.\n\nDuring drinks Vellaipandi, it is said, received a call on his mobile phone and reportedly chided the person who made the call.\n\nWhen Vicky reportedly enquired about it, Vellaipandi is said to have abused him which sparked a quarrel between the two.\n\nIn a fit of rage, Vellaipandi allegedly slashed Vicky’s chin with a bottle knife.\n\nThis infuriated Vicky, also in an inebriated state, who retaliated by hitting Vellapandi with a beer bottle on his head. Vicky took the knife and slashed Vellapandi’s stomach. Vicky slept in the same room. The room boy who noticed blood inside the room immediately alerted the lodge staff who informed the police.\n\nA police team landed at the scene and arrested Vicky who allegedly tried to assault the police too.\n\nVicky was taken for inquiry and subsequently arrested and the body was sent for a post mortem.\n\nThe police have registered a case of murder.", 
    "section": "national", 
    "title": "Tipsy man murdered during a spat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}