{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam : Panguni car festival, Namperumal purappadu from Kannadi Arai, 6.30 a.m.; reaching Ellaikarai Aasthana Mandapam after vazhi ubayangal kandarulal, 11 a.m.; Kuthirai vagana purappadu, 6 p.m.; reaching kannadi arai, 8.45 p.m.; Chinna Perumal sayanam 9.15 p.m.\n\nRockfort Sri Thayumanaswamy Temple : Theppa Utsavam, Special Abishekam, noon; Swami Purapadu, 5 p.m. ; float festival, 7 p.m.\n\nSri Srinivasa Perumal Temple, Indira Nagar: Sri Alarmelmangai Thayar Brahmotsavam, homam, thirumanjanam, 8 a.m.; serthi sevai in Yanai vaganam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Parayanam, Veli Andal Sannidhi, Sri Ranganathan Swamy Temple, West Adayavalanjan Street, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 8, I street, SMESC Colony, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha : Centenary programmes, violin duet by SA. Raghavasimmhan and SA. Rangappriya, Mahatma Gandhi Centenary Vidyalaya, Thennur, 6.30 p.m.\n\nGENERAL\n\nDistrict Administration : SVEEP programme, R.D.O office, Srirangam, 10 a.m.; Pothamettupatti, noon; Manapparai bus stand, 12.30 p.m.\n\nBharathidasan University, Department of Environmental Management : Lecture by Sadasivam, Thanneer Amaippu, Coimbatore, on “Neer Indri Amaiyadu Ulagu,” 11 a.m.; Shivanathan, water diviner, speaks on “Locating and Assessing Groundwater by Water Divining,” 2.30 p.m.\n\nBharathidasan University Technology Park, University Collaboration Center and Placement Training Cell: Workshop on Android App Development, Gopinath Ganapathy, Director, Bharathidasan University Technology Park, inaugurates, Khajamalai campus, 10.30 a.m.\n\nArignar Anna College of Arts: Yoga training, Sivakumar, NSS Programme Officer, and Kolochi, Principal, speak, Musiri, 10.30 a.m.\n\nThe Institution of Engineers: World Water Day, P. Shahul Hameed, Director, Environmental Research Center, J.J. College of Engineering and Technology, chief guest, 5.15 p.m.\n\nNational College, Department of Computer Science : Workshop on “Big Data Analytics,” Dineshkumar Gandhi, Head, R&D, Innovative Dynamic Technologies, resource person, 10 a.m.; Hostel Day celebrations, Ketan J. Vora, Chief Executive Officer, National Art Diamond Works, delivers special address, 4.30 p.m.\n\nM.A.M. College of Engineering : International conference on “Innovations in Power Electronics Control and Systems,” K. Babu Nizam, Plant Head Operations, Rane Brake Linings, Puducherry, and Shishaj P. Simon, Professor, National Institute of Technology, Tiruchi, resource persons, 9 a.m.; National conference on “Research Advancements in Civil Engineering,” K. Nagamani, Head, Department of Civil Engineering, Anna University, inaugurates, 9.30 a.m.", 
    "section": "national", 
    "title": "Tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}