{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Prisoners should have access to the same healthcare as other people in the community.\n\nThis was one of the fundamental principles laid down in the revised UN Standard Minimum Rules for the Treatment of Prisoners, now called as Nelson Mandela Rules, according to Alison Hannah, executive director of Penal Reform International (PRI), UK. PRI is a NGO working for promoting fair and effective justice system.\n\n“The UN Standard Minimum Rules for the Treatment of Prisoners were adopted in 1955. Over time, the rules became out of date, and did not reflect the current best practices. Four or five years ago, the UN Crime Commission was asked to advise on what was necessary to update the rules,” she said.\n\nNew rules were adopted in December last year, and now, PRI was involved in promoting awareness of the rules through a series of workshops in different nations, she added.Ms. Hannah was here for a two-day round table on the implementation of Nelson Mandela rules organised by the Academy of Prisons and Correctional Administration (APCA), Vellore on Monday.\n\nOne of the main thrust areas in the Nelson Mandela rules is the prisoners’ healthcare. “The new rules say that the principles and ethics of people delivering healthcare in prisons should be the same as that of professionals in hospitals or in the community,” she added.\n\n“Every prisoner will undergo a health screening to assess his/her needs on arrival at a prison, the needs of treatment will be recorded, and the prison administration has the obligation of providing treatment,” she said.\n\nHuman rights of prisoners are another area of importance in the new rules. “The very first principle is to prioritise the prisoners’ right, integrity and respect. They should be treated with dignity and respect to privacy,” she said.\n\nOne aspect that the rules draw attention to is searches. “Prisoners, their visitors, and children are searched. Previously, there were no guidelines about how and who should carry out searches. Now, the rule says that searches should be conducted privately and a member of the same gender should carry out searches,” she explained.\n\nThe rules also underscore the need to keep solitary confinement of the prisoners as the last resort and for a shorter time as this could have an effect on the mental health of inmates. Separate rules for women have also been included in the Nelson Mandela rules.\n\nPrison hospitals\n\nill-equipped\n\nIt is a cause for concern that even basic care is not available in prison hospitals, according to H.N. Sathyanarayana Rao, Director General of Police (Prisons), Karnataka.\n\nWhile speaking at the inaugural session of the conference, he said “The State Human Rights Commission has been asking us about the number of deaths taking place in prisons. Many sick persons come to the prisons. Some convicts, fall into depression in jails and do not recover.” In fact, around 200 prisoners out of 4,000 at the Central Prison, Bengaluru have some kind of mental illness, he added. Mr. Rao, who is also the chairman, Board of Management of APCA, said there was a need for manpower to implement the new rules. “We do not have many competent officers to run the jails,” he said.\n\nPrison officers should be given good training that should be followed up by supervision at the field, he said.\n\n“First, prison officers should improve their self-esteem. As they do not interact with the outside world, and live amidst the high walls of the prison, gradually, their self esteem comes down,” he added.\n\n“They are doing a difficult job in looking after inmates and containing them. Only if they are compensated properly, their self esteem and efficiency will go up. Prison administration, as a whole, will improve,” he said.\n\nHe urged the officers to train other prison staff on the rights of prisoners.\n\nThe participants included deputy inspector general of prisons to superintendent, deputy superintendent of prisons of the southern states.\n\nRules also underscore need\n\nto keep solitary confinement as\n\nthe last resort", 
    "section": "national", 
    "title": "UN revised rules lay stress on prisoners’ healthcare", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}