{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Indo-Australian Award for Meritorious Service conferred on Amitabh Mattoo\n\nSean Kelly, Australian Consul-General to South India presenting the Indo Australian Award for Meritorious Service to Amitabh Mattoo, Honorary Director, Australia India Institute, New Delhi. Susan Marthandan, president, Indo-Australian Association is in the picture.— Photo: K. Pichumani\n\nAmitabh Mattoo, Honorary Director of the Australia India Institute at Delhi, was on Monday conferred the Indo-Australian Award for Meritorious Service by the Indo-Australian Association.\n\nDr. Mattoo was the 17th recipient of the award. The Chennai-based IAA was established in 1984. The award was handed over by Sean Kelly, the Australian Consul-General to South India. In his speech, Mr. Kelly pointed out the significance of the day, celebrated as Harmony Day in Australia. “We seek to celebrate Australia as a multicultural society on this day,” he said.\n\nDr. Mattoo opened his speech by talking about the many connections that exist between Chennai and Australia; he said the award celebrated “this wonderful city.” He went on to say that India and Australia are at a moment never before seen in their histories: “What we have now is a situation where our values and interests converge.”\n\nHe identified 1990 as a critical year, when values began to converge but few interests bound both countries. The end of Cold War helped precipitate this move, but it also helped that Australia change its outlook.\n\n“Australia began to see itself as an Asian power,” said Dr. Mattoo, adding, however, that the decade would come to be seen as one of lost opportunities. It did not help that Australia had the strongest reaction to India’s 1998 nuclear test, “putting relations in cold storage.”\n\nHe said that 2014 would probably be remembered as the most important year in bilateral relations.\n\nIt was marked by a September visit by the then Australian Prime Minister Tony Abbott and a reciprocal visit by Narendra Modi.\n\nDr. Mattoo said that apart from personal camaraderie of both leaders, on display was a never-before, “recognition of the potential of the relationship.”\n\nIndo-Australian Award for Meritorious Service presented to Amitabh Mattoo", 
    "section": "national", 
    "title": "“Values of India, Australia are converging”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}