{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The venues for holding public meetings in the Salem South Assembly constituency were finalised at an all-party meeting held on the Corporation premises here on Monday.\n\nK. R. Selvaraj, Corporation Commissioner and Returning Officer of the Salem South Constituency, presided over the meeting. He said that seven venues – near vegetable market at Karungalpatti; near Tamil Nadu Maaligai; near MGR hospital at Gandhi Mahan street; Kalarapatti auto stand; Gandhi maidan; Kamaraj arch- Nanjapatti junction and Thadagapatti gate had been identified for holding public meetings by the political parties.\n\nHe said that the organisers should ensure that the meetings in no away caused hardship to the local public and vehicle users. Banners, festoons and party flags should not be displayed on the road medians and at the road junctions. Public address system should be used only two hours prior to the commencement of the meetings, he said.\n\nThe political parties should confine to the earmarked venues alone, he said and sought their cooperation in this regard.\n\nRepresentatives of all major political parties participated in the meeting.\n\nEarlier, on Saturday Mr. Selvaraj held discussion with the representatives of all political parties on shifting of a few polling stations in the Salem South constituency. It had been decided to shift about 24 polling stations.\n\nOn the occasion, Mr. Selvaraj said that the polling station No. 135 at Sellakuttikadu accounted for more than 1,400 voters. On the direction of the Election Commission, this polling station had been bifurcated into separate booths for men and women.\n\nIn Sankagiri Assembly constituency, a dozen polling stations had been shifted. C. Paul Princely Rajkumar, Revenue Divisional Officer and Returning Officer of Sankagiri constituency, held discussion with the representatives of all political parties on Sunday.\n\nWhile six polling stations had been shifted in Ezhumathanur panchayat union, a polling station each had been shifted in Unjanoor, Sinnagoundanur and Reddipalayam panchayat unions. Three polling booths functioning in A. Pudur Government Higher Secondary School were also among those shifted.\n\nS. P. Kandasamy, Deputy Superintendent of Police, Sankagiri, and other officials participated in the meeting.", 
    "section": "national", 
    "title": "Venues for public meetings in Salem South finalised", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}