{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Collector M. Karunakaran inaugurated the voters’ service centre on the Collectorate premises on Monday, which will accept applications for issue of new Electors’ Photo Identity Card and addition and deletion of voters in the electoral roll so as to enable the voters to exercise their franchise in the May 16 Assembly poll.\n\nSpeaking to reporters after inaugurating the service centre, Dr. Karunakaran said that the centre had been established in all taluk offices as well, as instructed by the Election Commission of India.\n\nThose who had lost their EPIC could get it from the service centre on payment of Rs. 25 within 15 days from the date of applying for the same.\n\nThose who would pay Rs. 40 for this purpose would get the new EPIC delivered through courier at the address the applicant furnished. Moreover, the public could also submit applications for addition/ deletion of voters in the electoral roll, corrections, if any, and change of address in the service centre.\n\n“Voters can also get information on their booths from the service centre,” the Collector said.\n\nOn the mandatory permission to be obtained from the police for conducting meetings by political parties, he said that permission could be granted if the parties applied well in advance and the expenditure incurred in the meetings would be added to the poll expenditure of the candidate concerned. District Revenue Officer M.G. Kulandaivel was present.\n\nCases registered\n\nA total of 5,841 cases, regarding poll graffiti, posters, banners on government building walls, and other violations, were registered up to March 19 in connection with poll code violation in the district. Action has been taken in 4,347 of the cases either by removing the banners or defacing the poll-related messages.\n\nSimilarly, 692 other cases were registered for spoiling the walls of private properties through wall graffiti, posters, banners, etc.\n\nThoothukudi\n\nThe centre was established in Thoothukudi. Sub Collector and Returning Officer S. Gopala Sundara Raj said here on Monday that eligible voters could access this centre and utilise the services.\n\nToll-free number –‘1950’ had also been introduced for voters, who could dial up and check to ensure whether their names were in the electoral roll. Earlier, a rally was organised to raise awareness about voting in the upcoming assembly polls and also for 100 per cent voting.\n\nThe Returning Officer flagged off the rally participated by students of Chandy Engineering and Polytechnic College.", 
    "section": "national", 
    "title": "Voters’ service centres established", 
    "subsection": "tamilnadu", 
    "date": "2016-03-22"
}