{
    "author": [
        "R Sujatha"
    ], 
    "text": "Not friendly:The Minister has promised more wheelchairs and assistance in railway stations but for a fee –PHOTO: R. RAGU\n\nPersons with disability feel the Railway budget has let them down, as it has not shown any vision to ensure a barrier-free environment.\n\nRailways Minister Suresh Prabhu’s budget speech had only one reference to persons with disability and just one paragraph, which also termed them ‘ divyang ’ (holy limb), a patronising reference to their condition.\n\nOrganisations working with persons with disability are upset that a new word has been coined in a budget document neglecting the interests of the group. If one organisation termed it regressive another wondered which group the word referred to as there were myriad kinds of disability.\n\n“Disability is not a divine gift and a new term does not ensure de-stigmatisation or an end to discrimination,” says Jansi Rani, president of the National Platform for the Rights of the Disabled.\n\nAmba Salelkar of Equals Centre for Promotion of Social Justice adds, “It seems from his speech that a lot of these will be a paid service. I don’t even know how you can make resource allocation and infrastructural changes for a group that does not exist in any of the official documents.”\n\nThe organisations are also disappointed that the Minister had introduced paid wheelchair services such as ‘sarathi/rail mitra seva’.\n\n“In Tamil Nadu the battery go-cart is provided free of charge. Whereas in the Konkan Railway we would be provided wheelchair service for a price,” she points out.\n\nThe budget has not addressed the question of making the overwhelming majority of other stations accessible, feels Ms. Jansi Rani. Not only the platforms but boarding and de-boarding trains are also a Herculean task as the coaches are not disabled-friendly, she adds.\n\nThough the Minister has spoken of introducing Braille-enabled new coaches, the disability rights organisations say he has not mentioned about retrofitting existing coaches with Braille facilities.\n\nThe organisations say their demand was for making transport comfortable not only for the disabled but also for the elderly. But the budget has no provision to ensure travel safe, accessible and affordable.", 
    "section": "national", 
    "title": "‘ Divyang’ tag disappoints persons with disability", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}