{
    "author": [
        "S Prasad"
    ], 
    "text": "Students from class VI to class XII will be imparted computer education\n\nChief Minister N. Rangasamy inaugurates the ICT @ Schools Project at Kadirgamam Government Girls Higher Secondary School in Puducherry on Friday. Also in the picture are (from left) School Education Minister T. Thiagarajan and Collegiate Education Minister P.R. Siva. — Photo: S.S. Kumar\n\nComputer-based education in government schools in the Union Territory will now get a fillip with the Department of School Education launching the ICT@schools project, a Central scheme after a gap of 10 years.\n\nIL&FS Education and Technology Services Limited has been selected for the supply of computers, education software and other management systems.\n\nThis is the second phase of the ICT@schools scheme being implemented by the Centre in partnership with States and Union Territories across the country. The first phase of the scheme was implemented during 2006-07 and covered 25 schools.\n\nNCERT guidelines\n\nA senior official of the education department told The Hindu , “As many as 132 government higher secondary schools (Puducherry – 88, Karaikal – 28, Mahe – 7 and Yanam – 9) would be brought under the computer education programme this year. The major objective of the project was to enable the students to understand the basics of computer programme and its application, enhancing learning levels using multi-media software and introducing the students to world of opportunities through Internet applications.”\n\nStudents from Class VI to Class XII in 132 schools would be imparted computer education based on guidelines of the National Council of Educational Research and Training (NCERT).\n\nIntegrated lab\n\nThe Union government has earmarked Rs.26 crore for the project. Out of the 132 schools, 105 schools will be funded by the Centre while the Puducherry government will fund the remaining 27 schools.\n\nEach of these schools will have an integrated lab that will have 10 computers, an interactive board, a high-end integrated computer with projector system, audio-visual facilities, television and audio-visual facilities. The first ICT lab was inaugurated on Friday.\n\nThe computer labs will be ready and the schools have to make ICT lab as part of their academic calendars and time tables. IL&FS will also be in charge of infrastructure development and will provide maintenance for the first five years, Deepti Lamba, Chief Operating Officer of IL&FS said.\n\nA teacher from each high school will be identified and trained to man the ICT lab equipped with high-end integrated computer, projector, interactive board and audio-visual facilities. The project will enhance the learning process and increase enrolment in government schools, she said.", 
    "section": "national", 
    "title": "132 govt. schools to benefit from Centre’s ICT project", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}