{
    "author": [
        "R Sujatha"
    ], 
    "text": "Want ‘as far as possible’ deleted from clause referring to provision of anti retrovirals\n\nOrganisations working with people living with HIV have threatened to protest if their demands to amend the HIV Bill are not met.\n\nThe groups have been seeking an amendment to 14 (i) clause of the Human Immunodeficiency Virus and Acquired Immune Deficiency Syndrome (Prevention and Control) Bill, 2014 besides inclusion of high risk groups and making available tests for children below 18 years.\n\nAt a State-level consultation meeting facilitated by World Vision here on Friday, representatives from various positive groups said they wanted the phrase ‘as far as possible’ deleted from the clause referring to provision of anti retrovirals.\n\n“We need free and complete medical treatment. With funds drying from global organisations and no prevention programmes happening, the government cannot insist on consent for testing for children.\n\nThere are quite a few children below the age of 18 years, born to positive parents, some of who have died. While for a few children who have been adopted by NGOs, consent can be sought from the organisations, there are orphans and street children. Who will give consent for these children? Should they be denied access to testing knowing fully well that only medication will help them stay alive,” asked P. Kausalya of Positive Women’s Network.\n\nWhile the Bill has included those infected with HIV and their affected families, it has ignored the most-at-risk populations (MRPS) such as homosexuals, sex workers, transgenders and injection drug users.\n\n“We have a high risk group that must be included in the Bill as they need the services,” said R. Selvam, president of Network for Chennai People Living with HIV/AIDS.\n\nRekha Shetty, senior legal officer at Lawyers Collective, which has been conducting consultations with the various groups in different states, said network groups in 28 States had sought the support of Members of Parliament in their respective States but without much success.\n\nAccording to Daisy David, a representative from Tamil Nadu Network of Positive People, around two lakh people who were infected and affected were planning to launch a protest if the demands went unheeded.\n\n“The phrase ‘as far as possible’ deleted from the clause referring to provision of anti retrovirals”", 
    "section": "national", 
    "title": "Activists demand amendment to HIV Bill", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}