{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "The zone has 708 unmanned crossings currently\n\nThe process of eliminating unmanned level crossings includes constructing subways or converting them into manned gates. -picture used for representational purpose\n\nIn a major development that will enhance safety and punctuality of trains in Southern Railways, all the unmanned level crossings in the zone will be closed down in a year or two.\n\nOf the total 708 unmanned level crossings in the zone, sanction has already been obtained for eliminating 625 spread across six divisions. Union Railway Minister Suresh Prabu on Thursday accorded sanction for eliminating the remaining 83. The zone is now poised to eliminate all the unmanned level crossings though the execution may take a couple of years.\n\nAccording to Southern Railway’s Chief Bridge Engineer M. Suyambulingam, the process of eliminating unmanned level crossings included constructing subways or converting them to manned gates. As on April 1, 2015, the zone had 1,834 manned level crossings gates of which 22 were converted to Road Over Bridges with the assistance of the State Government.\n\n“As many as 84 new Road Over Bridges (ROB) and Road Under Bridges (RUB) have been sanctioned this year. The Railway Minister has targeted to eliminate all the 7,539 unmanned level crossings in the country by 2020. We hope to achieve the target in Southern Railways by 2018,” he said.\n\nMr. Suyambulingam said construction of ROBs and RUBs helped in safer and faster movement of trains. “It also helps us to save manpower and cost of maintenance. Each manned gate has an average of four employees. There have been accidents even at manned railway gates.”\n\nThe running track in Southern Railways spans 6,950 km, including 4,943 km in Tamil Nadu, 1,684 km in Kerala and 247 km in Andhra Pradesh.", 
    "section": "national", 
    "title": "All unmanned level crossings in Southern Railway to go", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}