{
    "author": [
        "S Poorvaja"
    ], 
    "text": "A heated exchange between Opposition councillors and the Mayor continued for a long time, interrupting the proceedings —Photo: B. Jothi Ramalingam\n\nDuring the budget proceedings, the Greater Chennai Corporation Council meeting witnessed a verbal altercation as Councillors from the Opposition parties interrupted the Mayor’s speech.\n\nLess than an hour after the meeting, the Opposition councillors evicted from the Council.\n\nHowever, before that, the councillors had torn the budget documents as a mark of protest.\n\nInitially, as Mayor Saidai Duraisamy spoke about the achievements of the Corporation with regard to the schools under the civic body’s control, P.V. Tamilselvan, a Congress councillor, asked why the Corporation had not brought schools in the extended areas that lie in the neighbouring districts of Tiruvallur and Kancheepuram, under its jurisdiction.\n\nControl of schools\n\nDravida Munnetra Kazhagam (DMK) councillors too raised the same question and the Mayor responded by saying that they had constituted a committee to look into the feasibility of bringing schools from extended areas under the Corporation’s education department.\n\nA heated exchange between these councillors and the Mayor continued for a long time, interrupting the proceedings.\n\nEven as the meeting continued, DMK leader in the council Subash Chandra Bose raised an objection to comments passed by the Mayor against DMK councillors.\n\nAfter a lengthy verbal altercation with the AIADMK councillors that led to chaos, the Opposition councillors were evicted from the Council hall.\n\n“The constant interruptions by the Opposition councillors are aimed at preventing me from speaking about the achievements of our Corporation,” said Mr. Duraisamy.\n\nA question relating to schools in extended areas was hotly debated during the meeting", 
    "section": "national", 
    "title": "Budget documents torn as a mark of protest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}