{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers from Vadakarai complained that buildings were being constructed in reserve forest areas beyond Adavinainarkovil dam in Mekkarai, in violation of norms.\n\nZakhir Hussein of Vadakarai told Collector M. Karunakaran, who chaired the farmers’ grievance day meeting at the Collectorate here on Friday, that buildings were being constructed deep inside the forests and beyond the dam. S.T. Shaik Maideen, also from Vadakarai, said a group of people had started constructing a place of worship inside the forest with the backing of forest officials. “The Collector should send a team to visit the spot and ascertain facts pertaining to the ongoing construction work in the reserve forest area,” the two farmers said.\n\nDr. Karunakaran assured them that the construction site would be visited shortly and the structure removed if it was found that norms were flouted.\n\nShortage of harvesters\n\nFarmers also sought the Collector’s intervention to ensure provision of farm implements for harvesting paddy cultivated on more areas this year, thanks to a good northeast monsoon. Only a few harvesters were available, they said. “While the Department of Agricultural Engineering charges Rs. 1,415 for one hour per harvester, the private firms demand Rs. 2,600. Since the department has only three harvesters, we are at the mercy of the private firms,” said T. Velmayil.\n\nThe farmers complained about exorbitant rent being charged for the harvesters and appealed to the Collector to convene a meeting with the farmers, machinery dealers and government authorities to fix standard hiring charges for harvesters. The Collector said asked the officials to bring harvesters from other districts such as neighbouring Virudhunagar to meet the farmers’ needs.\n\nWhen the farmers showed him paddy affected by pest attack in certain areas of the district despite use of pesticides prescribed by the officials, the Collector ordered Agricultural Officers to visit those areas and ascertain the fact.\n\nDr. Karunakaran gave away paddy sapling transplanter, with a subsidy of Rs. 94,000, to a woman farmer, Mariammal, of Tharuvai and mechanical ploughs to nine farmers, with a total subsidy of Rs. 3.15 lakh.", 
    "section": "national", 
    "title": "“Building construction going on inside reserve forest area”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}