{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Nine DMK Councillors suspended for three sittings for ‘unruly behaviour’\n\nAIADMK and DMK councillors engaged in a tussle in the Coimbatore Corporation Council meeting on Friday. —Photo: M. Periasamy\n\nThe Coimbatore Corporation Council on Friday suspended nine Dravida Munnetra Kazhagam councillors for the next three sittings for what the Mayor P. Rajkumar called unruly behaviour.\n\nPassing a resolution in the afternoon session, he said that the councillors’ behaviour soon after the budget presentation was aimed at garnering cheap publicity ahead of the Assembly election. They had attacked AIADMK councillor R. Mylsamy (Ward 19) and damaged Corporation property.\n\nThe Mayor passed the resolution after many an AIADMK councillor sought stringent punishment for the DMK councillors, whom, they alleged, behaved in a manner that was unbecoming of councillors.\n\nEarlier in the morning, during the last budget session of the Coimbatore Corporation Council, councillors from the ruling AIADMK and DMK pulled down the Mayor’s table, hurled abuses and pushed and pulled one another.\n\nThe incident happened soon after the Mayor and Finance and Taxation Committee Chairman R. Prabhakaran finished the budget presentation. DMK members, led by A. Nandhakumar and Meena Loganathan, rushed to the centre of the council hall demanding a white paper on the financial health of the civic body.\n\nAs the media followed them, the AIADMK members rushed to the centre of the hall to prevent the DMK councillors from addressing the media. As they tried to pull them away, the DMK members, caught off balance, gripped the Mayor’s table for support.\n\nAIADMK councillors Senthilkumar, Jayaram, Perumalsamy, and Gunasundari continued to engage the DMK councillors when the latter attempted to present their point of view to the media. The police had to intervene to bring about peace. Mr. Nandhakumar told journalists that the DMK only asked for a white paper. But the AIADMK was keen on disrupting proceedings. AIADMK councillors later alleged that the DMK members attacked Ward 19 councillor R. Mylsamy.\n\nThe DMK councillors countered the charge saying that the AIADMK members attacked councillors P.V. Subramanian and Mr. Nandhakumar.", 
    "section": "national", 
    "title": "Chaos in Coimbatore Corporation Council meet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}