{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Ram Mohandoss, Vazhga Valamudan Arangam, 27{+t}{+h}St., Nanganallur, 4 p.m.; Venu Raza Narayanan, Kulasekara Azhwar Sannidhi, Edward Park St., Kosapet, 6 p.m.\n\nAndal Vaibhavam: Damal Ramakrishnan and Perundevi, Asthika Samajam, Venus Colony, Alwarpet, 6-30 p.m.\n\nSatsang: Vimurtananda, Jayanthi, 668, School Rd., Anna Nagar West Extn., 5-30 p.m.\n\nCULTURE\n\nOrganising Committee: Launch of publications, Rajah Annamalai Mandram, Esplanade, 6-30 p.m.\n\nSamskrta Academy: Discussion on book ‘Chintanai Ondrudaiyal’, Sanskrit College, Royapettah, 6-15 p.m.\n\nGENERAL\n\nTamil Nadu Fisheries University: Convocation, Governor K. Rosaiah participates, Raj Bhavan, 6-45 p.m.\n\nOrganising Committee: Nani Palkhivala memorial lecture on ‘Are we ready for the Fourth Industrial Revolution?’, Narada Gana Sabha, T.T.K. Rd., Alwarpet, 11 a.m.\n\nTamil Nadu Federation of Women Panchayat Presidents: Inauguration of women panchayat presidents convention, World University Centre, Mayor Ramanathan Salai, Chetpet, 10 a.m.\n\nLoyola College: Workshop on ‘Mobile Learning: Communicating, Connecting and Collaborating’, Nungambakkam, 9-15 a.m.\n\nValliammai Engineering College: Lecture on ‘Queuing theory and its applications’, Kattakulathur, 12-30 p.m.\n\nSam Foundation and Exnora Green Pammal: Inauguration of ‘Capacity expansion of demonstration biogas plant’, 19{+t}{+h}Cross St., Sankara Nagar, Pammal, 10 a.m.\n\nTheosophical Society (Kilpauk Lodge): Talk on ‘Living in consciousness’, Dr. Alagappa School, G.K. Rd., Purasawalkam, 6 p.m.\n\nUlaga Thirukkural Meiyam: Meeting, Valluvarkottam, Nungambakkam, 10 a.m.\n\nLions Clubs International: World Disabled day celebration, Dr. M.G.R. Janaki MHSS., Arcot Rd., Saligramam, 5 p.m.\n\nIsha Yoga Centre and Manarkeni: Distribution of books to flood affected government libraries, LLA Library Building Anna Salai, 11 a.m.\n\nAABLA: Silver Jubilee celebrations, A-88, Anna Nagar East, 5-30 p.m.\n\nNarcotics Anonymous: Meetings, Turning Point Group, Arul Kadal Aikiya Aalayam, Santhome High Rd.; and New Attitude Group, St. Andrew’s Church, Choolai, 7 p.m.\n\nAl-Anon: Meetings, Community Service Centre, Balfour Rd., Kilpauk; Alagu Andavar Temple, Korukkupet; TPI Kalyana Mandapam, Avadi; and Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; and Iraivan Thantha Vaippu Kuzhu, Thiruvottiyur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Community Service Centre, Balfour Rd., Kilpauk; PS HSS., Mylapore; Advent Christian Middle School, Velachery Rd., Sembakkam; Risen Christ Church, Paper Mills Rd., Peravallur; Alagu Muthu Mariyamman Tirumana Mandapam, Periyar Salai; St. Teresa Church, Nungambakkam High Rd.; E.C.I. Zion School, 100 ft. Rd., Ekkatuthangal; Our Lady of Perpetual Help Church, Manali Town; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Karthikeyan MHSS., Saligramam; D.B.I. Colony, M.T.H. Rd., Avadi; St. Vincent School, Assumption Church, Railway Colony, Choolaimedu; and C.S.I. Church, Arcot Rd., Virugambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}