{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Institute shortlists high-value marine and shellfishes\n\n: The Central Marine Fisheries Research Institute (CMFRI) has shortlisted high-value marine and shellfishes and embarked on developing seed production technologies for the species in its Mandapam Regional Centre, A. Gopalakrishnan, Director of CMFRI, Kochi said.\n\nTalking to The Hindu on the sidelines of the programme arranged for distribution of hatchery-produced Cobia fingerlings to select fishermen here recently, he said the CMFRI has shortlisted species such as Red Snapper (Vela Meen), Rabbit fish (Ora) and Blue swimmer crab (Olaikal Nandu) based on their high market value and the Mandapam Regional Centre has been entrusted with the job of developing the technologies.\n\nHe said the Research Institute has standardised and achieved 10 per cent survival rate in the hatchery production of blue swimmer crab seeds which was ‘very high percentage’ in crabs due to the cannibalism issues. The technology for seed production was being developed both for ‘sea pen culture’ and sea ranching, he said.\n\nFurther, he said that the Institute has developed seed production technology for commercially important sea cucumber, Holothuria scabra (Vellai attai). The Institute is having plans to produce seeds for sea ranching at selected places to sustain the stock. This would go a long way in augmenting the stock position of sea cucumber and help authorities taka a decision in the interest of the fishermen when the question of lifting ban on fishing sea cucumber comes, he said.\n\nA. K. Abdul Nazar, Scientist in-charge, Mandapam Region, said the Institute initiated trial farming of blue swimmer crab, and also, the baby crabs would be sea ranched in selected locations which would be the biggest contribution to improve the stock of the species.\n\nThe Mandapam Centre was also planning to take up selective breeding programme of green shrimp.", 
    "section": "national", 
    "title": "CMFRI working on seed production technologies", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}