{
    "author": [], 
    "text": "RELIGION\n\nCSI Christ Church: Prayer meeting, Church premises, Trichy Road, 6.30 p.m.\n\nCULTURE\n\nKasthuri Sreenivasan Trust: Artists’ Meet, Gallery, Avanashi Road, 10 a.m.\n\nGENERAL\n\nSNR Sons: Founders day, SNR College Auditorium, 4.30 p.m.\n\nNehru Arts and Science College - Thirumalayampalayam: Herbal Expo 2016, 10.30 a.m.\n\nIndian Chamber of Commerce and Industry: Talk on Workplace Health and Safety – Insights from Singapore by J.C. Sekar, CEO and Co-Founder of AcuiZen Technologies – Singapore, Chamber Towers, 5.30 p.m.\n\nBodhi Academy and National Model Matriculation School: Session on Smart City ideas for students, school premises, Peelamedu, 10 a.m.\n\nIrobochakra: Robofest 2016 – Interschool contest, Chinamaya Vidyalaya, R.S. Puram, 9.30 a.m.\n\nGRG School of Management Studies: Alumni Homecoming, 9 a.m.\n\nSpark Creations: Home Expo, Suguna Hall, Avanashi Road, 10.30 a.m.\n\nTexcity Arts and Science College: Annual Day and Sports Day, college premises, Palathurai Road, 10 a.m.\n\nRathinam College of Arts and Science: Workshop on Ethical Hacking, 10 a.m.\n\nCoimbatore Productivity Council: Training Programme on Time and Methods Study, CPC premises, Race Course, 9.30 a.m.\n\nThe Institution of Engineers: Lecture, F Block, PSG Tech, 6.15 p.m.\n\nSankara College of Science and Commerce: College day, 10 a.m.\n\nAJK Group of Institutions: National-level Intercollegiate Management Meet – Prabhantha Twenty 16, 9.30 a.m.\n\nSNS College of Technology: Awareness programme on good construction practices, 9.30 a.m.\n\nSuguna International School: Annual day, Kalapatti, 5 p.m.\n\nWonder Kids: The Book 2016 celebrations, Kikkani Vidya Mandir, R.S. Puram, 5.30 p.m.\n\nPPG Institute of Technology: Symposium, 9.30 a.m.\n\nPSG Sarvajana School: Vanavil - Lecture, PSG Tech, 5.30 p.m.\n\nSri Ramakrishna Engineering College: National seminar, CSE Seminar Hall, 9.30 a.m.; Entrepreneurship Week, MBA Conference Hall, 1.45 p.m.\n\nPOLLACHI\n\nSree Saraswathi Thygaraja College: Seminar on Emerging Trends in Personal Financial Management, 9.30 a.m.\n\nDr. Mahalingam College of Engineering and Technology: Students Talent Enhancement Programme, 9 a.m.\n\nUDHAGAMANDALAM\n\nICAR – IISWC: Farm Innovators day, Kadasholai village, Kotagiri, 10.30 a.m.\n\nKODUVAI\n\nMerit Matriculation Higher Secondary School: Annual day celebrations,\n\n5 p.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}