{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Idea is to explore using the language to study maths, science: Gopalswami\n\nDisputing allegations that a committee headed by him had recommended making Sanskrit learning compulsory in schools , chairman of the committee and former Chief Election Commissioner N. Gopalaswami said it had only suggested enforcement of the ‘three-language’ formula that had gained acceptance long ago.\n\nMr. Gopalaswami, who is currently the Chancellor of Rashtriya Sanskrit Vidyapeeth in Tirupati, said in this scheme of things, the student would be free to choose any language under the Eighth Schedule of the Constitution as the third language and Sanskrit has not been recommended as the compulsory third language.\n\nThe HRD Ministry formed the committee in November 2015. The 13-member team submitted the report to the Ministry on February 4, following which political parties in Tamil Nadu slammed it for allegedly trying to impose Sanskrit on CBSE students.\n\nAccording to Mr. Gopalaswami, the objective of the committee was to suggest various means through which Sanskrit could be integrated into the current educational system. Specifically, the committee wanted to see how Sanskrit could be put to use in the study of science and subjects like mathematics, law and medicine.\n\n“At the school level, we opined that this could be achieved by enforcing the three-language formula. Now, this does not mean we have recommended that Sanskrit be made compulsory. Rather, it would remain optional but by implementing this, you will provide avenues for willing students to learn the language,” he added.\n\n‘Teach Sanskrit through Sanskrit’\n\nThe former CEC said the current method of teaching Sanskrit was not the most suitable. “We have stressed on the fact that Sanskrit should be taught in Sanskrit. This is not happening currently. Second, we have suggested changes in the way the language is approached and moving away from the method of starting with grammar,” he said, and added that recommendations have also been made for training teachers to reorient their teaching methodology.\n\nMr. Gopalaswami said there were many texts in Sanskrit on subjects like medicine, mathematics, architecture and other sciences. “We would be able to access this knowledge only if we could understand the language. Whatever knowledge comes out of it, if it is for the common good, there is nothing wrong in putting it to use,” he felt.\n\nThe most important area where Sanskrit could be useful is agriculture since we have abundant knowledge in the field.\n\nFor encouraging this, the committee had also recommended setting up of ‘Sanskrit cells’ in higher education institutions such as the IITs.\n\nAsked about the criticism that the recommendations were an indirect way of imposing Hindutva on the education sector, Mr. Gopalaswami said there was no way to wake up people who pretend to be asleep. “We have made it absolutely clear that there should be no compulsion on any student,” he reiterated.\n\nThe HRD Ministry is yet to accept the recommendations.", 
    "section": "national", 
    "title": "‘Didn’t suggest compulsory learning of Sanskrit in schools’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}