{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "The Economic Survey 2015-16, tabled in Parliament by Union Finance Minister Arun Jaitley on Friday, has justified the demands of knitwear industry for monetary interventions to reduce currency volatility, credit at lower interest rates and expeditious implementation of Goods and Services Tax.\n\nThe survey report has pointed out that there were important implications for India due to Chinese slowdown and India’s external competitiveness across-the-board would come under pressure because of the ‘train reactions’ subsequent to weakening of Chinese currency.\n\nFurther, the report had indicated the need for a combination of monetary relaxations and interventions in foreign exchange markets for keeping the rupee’s value at fair levels.\n\n“A steadier rupee is what the industry has been calling for such a long time as wide fluctuations in currency rates can affect the prowess of knitwear export clusters like Tirupur where pricing of the products depends on a host of factors. Here, the exporter of garment also imports accessories for embellishing the final product and also other items like high-end machinery as well as fabric printing ink. So, foreign exchange plays a critical role”, pointed out M. Velusamy, an apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council).\n\nAnother major remark in the report was the decline in the Current Account Deficit (CAD), the fiscal deficit and the inflation during the last one year.\n\nHere too, the knitwear entrepreneurs’ appeals for giving away bank credits at lower interests stand justified.\n\n“The RBI has always been talking of higher inflation and other issues like CADs as excuses for not reducing the repo rates.\n\nBut with all these parameters on a decline, why is the apex bank hesitating to reduce the short-term bank rates”, quipped technocrats.\n\nSimilar to the worries expressed by industrialists in the Tirupur cluster, the survey report had stated that “approval for the game-changing GST Bill has proved elusive so far” as an expression of disappointment over the delay in the passage of the bill.", 
    "section": "national", 
    "title": "Economic Survey report justifies demands of knitwear industry", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}