{
    "author": [], 
    "text": "SALEM\n\nSrimadh Thyagaraja Venkataramana Bhagavath Swamigal Mahotsava Sabha: Annual Aradhana festivalSourashtra Marriage hall, Ammapet main road, 10.45 a.m.; vocal concert by K. T. Sowmya Nandakumar and party, 6 p.m.; by Kumbakonam S. Sankar Raman and party, 7.30 p.m.\n\nRamakrishna Mission Ashrama: Narai S. Nellaiappan speaks on ‘Swami Akhandananda’s life’, 7 p.m.\n\nTamil Nadu Iyal Isai Nataka Manram and Department of Art and Culture: Ramayanam Festival titled ‘Varna Kalanjiyam’, pattimanram, Gana Sirsabesan is moderator, Vijaragavachariar hall, Cherry road, 6.30 p.m.\n\nConfederation of Indian Industry Salem: Salem MSME Summit, inauguration, D. Sridhar, Joint Director General, Directorate General of Foreign Trade and N. V. Srinivasan, Regional President South, Indo-American Chamber of Commerce, chief guests, K. M. S. Rajesh Kumar, Chairman, CII Salem district presides, Hotel Park Plaza, 10 a.m.\n\nTangedco: Salem Electricity Distribution Circle, power consumer grievances day meeting, office of the Executive Engineer, Attur, 11 a.m.\n\nAVS College of Arts and Science: Department of Commerce, International conference on ‘recent trends on innovation in banking sector’, 10 a.m.\n\nHomeocare International: Opening of the Salem branch by Balakumaran, writer, 4.30 p.m.\n\nAVS Engineering College, Ammapet: Department of Science and Humanities, Science project expo, K. Senthil Kumar, Correspondent, presides, 10 a.m.\n\nJairam Schools, Chinnatirupathi: Annual Day, J. Rajendra Prasad, Chairman, Jairam College and Jairam Schools, chief guest, 4 p.m.\n\nNAMAKKAL\n\nGnanamani College of Technology: Department of Electrical and Electronics Engineering, national-level workshop 10.30 a.m.\n\nGnanamani Educational Institutions: Campus recruitment by Sutherland Global Services, Chennai,\n\n10 a.m.\n\nPaavai Institutions: Annual Day, R. Seetharaman, Group Chief Executive Officer, Doha Bank, Qatar, chief guest, Kalpala Chawla Open Theatre, 5 p.m.\n\nSelvam College of Technology: Department of Mechanical Engineering, national level technical symposium “Torque2k16”, 10 a.m.\n\nMahendra Polytechnic College and Indian Society for Technical Education, New Delhi: 15 th ISTE state level students convention for polytechnic colleges, K. Sundaramoorthy, Additional Director, Directorate of Technical Education, Chennai, chief guest, 10 a.m.\n\nTIRUCHENGODE\n\nVivekanandha Institute of Engineering and Technology for Women: Electrical and Electronics Engineering and Placement Cell, ICT Academy of Tamil Nadu and National Instruments, Faculty Development Programmes 10 a.m.\n\nK. S. Rangasamy College of Arts and Science and K. S. R. College of Arts and Science for Women: Graduation Day, Ramki Krishan, head, Competency Function, WIPRO Technologies, Chennai, chief guest, 10.30 a.m.\n\nKOMARAPALAYAM\n\nSSM College of Engineering: Graduation Day, C. Swaminathan, Vice Chancellor, Periyar University, chief guest, M. S. Mathivanan, Chairman, presides, 11 a.m.\n\nExcel Group of Institutions: Placement and Training Cell, Industry – Institutions interaction programme, K. Balasubramanian, MD, Hitech-Concrete Solutions Private Limited, Chennai and D. Sabtharishi, MD, Rishi Associates, Coimbatore, resource persons,\n\n9.30 a.m.\n\nRASIPURAM\n\nMuthayammal Engineering College: Regional festival of National Science Day, S. Ingersol, Scientist G, Indian Space Research Organisation, Mahendragiri, chief guest, 9.30 a.m.\n\nERODE\n\nOlirum Erodu Foundation: Dedication of battery-operated garbage transporters and take-over of Sadayampalayam Tank Maintenance, felicitations by District Collector S. Prabakar and Mayor Malliga Paramasivam, City Corporation premises, 11a.m.\n\nM.P. Nachimuthu M. Jaganathan Engineering College: TRENTECH-2016 Technical Symposium by Civil and Mechanical Engineering Departments, 10 a.m.\n\nEBET Group of Institutions: On-Campus drive by M/s Haritha Techserv, Chennai, for BE-Mechanical Engineering students, 9 a.m.\n\nKongu Arts and Science College: Valedictory function of Students' Association of Department of Computer Science, 10 a.m.\n\nConfederation of Indian Industry - Erode Zone: Annual Day, felicitations by Eisenhower, Director - Operations, Saint Gobain Glass India Ltd; Ramesh Datla, CMD, Elico Ltd; and K. Vinayakam, MD, The Chennai Silks, Hotel Club Melange, 4.30 p.m.\n\nEBET Group of Institutions: Lecture on ‘Power Quality in Day-To-Day Activities’ by U. Periasamy, Deputy General Manager, CNC Maintenance/ Foundry Electrical, Sakthi Auto Component Limited, 2 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}