{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Apprehensions about practicality of Avinashi-Athikadavu scheme were echoed by farmers during the monthly grievances redressal day meeting here on Friday.\n\nFarmers wanted to know if the project was worth implementing since it envisages sourcing water from the Bhavani Sagar Dam which was already facing shortage for maintaining supplies to the ayacuts covered by Lower Bhavani Project canal, Kalingarayan Canal and Thadapalli-Arakankottai canal.\n\nThere was no scope for Bhavani Sagar Dam to have excess water. The Dam had brimmed only thrice in the last 20 years, Suba Thalapathi, president of Thadapallai-Arakankottai Ayacut Farmers' Association said.\n\nDistrict Collector S. Prabakar who chaired the meeting and PWD officials said the farmers could convey their apprehensions to the Committee formed recently by the State Government to study scope for environmental and forest department clearances. Years back, the State Government had forwarded Rs. 1,262 crore scheme for the Athikadavu-Avinashi project, but it was rejected by the Centre during 2011, the farmers were told. As regards GAIL scheme, farmers mooted the idea of the Central Government, the State Government and the company together sharing the additional cost of Rs. 400 crore for re-aligning the pipelines along National Highways. Farmers said it would be unfair to let them suffer due to the draconian provisions of the PMP Act.\n\nFarmers urged the district administration to keep implementation of Mahatma Gandhi National Rural Employment Guarantee Scheme in abeyance so that more farm workers would be available.\n\nOfficials assured to address the demand of the farmers for conduct of indirect auction at the regulated markets in Gobi and Sathy for banana. An assurance was also given that a public hearing will be conducted before finalising the proposed common effluent treatment plant at Kadayampatti in Bhavani town.\n\n‘Bhavani Sagar Dam already facing shortage for maintaining supplies to the ayacuts covered by LBP canal, Kalingarayan canal and Thadapalli-Arakankottai canal’", 
    "section": "national", 
    "title": "Erode farmers sceptical of Avinashi-Athikadavu water project", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}