{
    "author": [
        "Tamil Nadu Bureau"
    ], 
    "text": "Services were affected on Friday at the Employees State Insurance Corporation-run hospital in K.K. Nagar as nurses went on a mass casual leave demanding implementation of Seventh Pay Commission.\n\nThe hospital performs around 30 surgeries a day but on Friday only one Cesearean section was performed and only five patients were admitted, doctors said.\n\nAs many as 200 nurses at the hospital had responded to the call from the All India ESIC Nurses Federation. The 350-bed hospital is in the middle of inspection by the Medical Council of India and the Tamil Nadu Dr. MGR Medical University. Last year, MCI had provided conditional permission to the ESIC College. Construction work is still in progress at the college.\n\nHospital staff said they were instructed to refrain from admitting patients on Friday. Surgeries were suspended for the day. Doctors were asked to do double duty to take care of emergencies. “We did admit a few patients as our conscience did not permit us to send them away,” said a doctor.\n\nThe hospital had made arrangements to shift patients requiring immediate medical care to other hospitals. According to the staff no patient was discharged ahead of the strike.\n\nHowever, in Tirunelveli, the hospital had discharged all 50 patients, a doctor said.\n\nRepresentatives of the nurses association in Chennai said they had served a strike notice to the Prime Minister, the Health Minister and the Labour Minister after the Central government made no move to implement pay commission recommendations.\n\nOn Thursday, the association representatives in New Delhi held talks with the Health Secretary but with their demands remaining unaddressed, the nurses stayed away from work. If the government continued to remain unresponsive, the nurses would go on an indefinite strike from March 15.\n\nThe hospital administration could not be reached for comment.\n\nTirunelveli\n\nNurses of Employees’ State Insurance Corporation Hospital here went on a token strike. The nurses said the starting pay of Rs. 5,400 should be given to them by sorting out the anomalies in the draft recommendation. Incentives withheld by the administration should be released to the beneficiaries.\n\nFollowing the agitation, functioning of the ESI hospital was badly hit while the emergency section functioned as usual.\n\n“If our genuine demands are not met, we’ll commence indefinite strike from March 15,” the nurses said.\n\nPatients requiring immediate\n\nmedical care shifted to\n\nother hospitals", 
    "section": "national", 
    "title": "ESIC hospital nurses go on one-day strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}