{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Be it the textile mills, micro, small and medium-scale enterprises (MSMEs) or the engineering units here, it had been a year of slowdown in the market.\n\nThey are looking for government support to improve their competitiveness. With just two days for the Union Budget, The Hindu looks at some of the demands of these units.\n\nMan made fibre\n\nReduction in duties on manmade fibre is the main demand of the textile industry here.\n\nWith the share of man made fibre just 20 per cent of textile exports, it is imperative to make it price competitive.\n\nWith the tariff protection for imports, local producers are taking advantage of the import parity pricing policy, said chairman of Southern India Mills’ Association M. Senthil Kumar.\n\nThe advantage for the cotton-based industry, which accounts for 80 per cent of the exports, is that cotton being an agricultural commodity, is available at international price.\n\nThe Union Government should consider removal of the 5 per cent import duty, 4 per cent special additional duty, and anti-dumping duty on manmade fibre and filament, and reduce the excise duty from 12.5 per cent to 6 per cent.\n\nThe government should allocate adequate funds for the revised technology upgradation fund scheme it announced recently and also for the arrears pending under the scheme, he said.\n\nEngineering\n\nEngineering companies from developed countries are sourcing components and sub-assemblies from India and Indian companies are directly exporting castings and motor pumps too.\n\nThe demand is more for specialised castings and CNC machining capacities. Hence, the engineering sector requires a Technology Upgradation Fund (TUF) on the lines of the one available for the textile sector.\n\nThis is one of the long-pending demands of the engineering units here, according to president of Southern India Engineering Manufacturers’ Association V. Lakshminarayanaswamy.\n\nWhen GST is implemented, the rate for pumps should be 11 per cent instead of the proposed 23 per cent plus 1 per cent.\n\nWith the Make in India initiative, the government should promote quality and acceptability of engineering products made here in the international market.\n\nAllocations for the Credit Linked Capital Subsidy Scheme should be enhanced for low cost automation and to encourage investments in plant and machinery, including testing equipment, he said.\n\nThe export oriented units now enjoy exemption from Cenvat and VAT. However, it is reported that the exemption will be removed under Goods and Services Tax. The EoUs should be considered mini special economic zones.\n\nMSMEs\n\nThe micro, small and medium-scale enterprises (MSMEs) have sought special treatment in areas such as market assistance, bank finance, working capital, term loans and Government procurement. These units also require support for development of brands.\n\nThe Union Government should establish industrial estates in districts where the concentration of MSMEs is high. MSMEs in the orange category (of Pollution Control Board) should get one-time clearance from the board. It is learnt that several applications for assistance from NABARD for pending for assistance and the Ministry of MSME is verifying these. The delay in receipt of subsidies is affecting the potential of the MSMEs, said Mr. Lakshminarayanaswamy.\n\nAccording to S. Ravi Kumar, president of Coimbatore Tirupur District Micro and Cottage Entrepreneurs’ Association, benefits of MUDRA scheme should be available to micro units and a separate MUDRA Bank should be opened.\n\nThis should service micro units as SIDBI does to small-scale units.", 
    "section": "national", 
    "title": "Expectations fly high", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}