{
    "author": [
        "S Senthalir"
    ], 
    "text": "Photo historian Aditya Arya interacts with participants at the Vintage Photographic Process Workshop held at the French Institute of Pondicherry on Friday. The participants learn about Cyanotype print.— Photos: Special Arrangement\n\nParticipants at Vintage Photographic Process Workshop learn the old nuances\n\nIn a darkroom lit by red Christmas lights in the basement of French Institute of Pondicherry, participants of the Vintage Photographic Process Workshop were busy recreating history.\n\nThey were mixing light-sensitive chemicals, learning to sensitise, expose and process images getting a hands-on experience of the history of process. Outside the dark room, they were making photograms, a silhouette photograph made by placing objects on sensitised paper exposing it to sunlight, and photographic prints from variety of objects and negatives on Friday.\n\n“This is Cyanotype Print, an old photographic printing process dating back to 1840s. Participants are making the paper and learning how photography evolved in the 19{+t}{+h}Century,” exclaims Photo historian Aditya Arya.\n\nStriking blue photographic images were made using light-sensitive salt. He said: “Photography has more to it than its composition, exposure or subject. There is a story embedded in the picture which is in the material of the picture. This generation has no idea how photography was in the 19{+t}{+h}century. People see old pictures but they do not see the material aspect which has a deep story embedded to it. It is interesting if people also start looking into this aspect and connect to it as an art form.”\n\nMr. Aditya says: “It is in this context that history of photography becomes important. How was that material made in the past and which camera was used to capture pictures so it could be embedded in that particular material. This helps to learn and understand the evolution of photography.”\n\nAn autodidactic, Mr. Aditya specialises in the genre of advertising and industrial photography. Having worked for the past 10 years uncovering historic photographic works, poring over thousands of negatives and vintage prints, developing, preserving, restoring and archiving, Mr. Aditya has been instrumental in forming the India Photo Archive Foundation. He is now conducting a three-day Vintage Photographic Process Workshop in Puducherry.\n\nHe prides in having an archive, camera museum with a collection of more than 1000 cameras from 1870s onwards. For him, understanding history is very important and underlines that history of photography is interesting because only then one can understand how things evolved over the period of time to reach this stage of digital photography.\n\n“If you want to be an artist, you need to know about art. He should also know the history of art form. To reach somewhere, you need to know what happened in the past. This makes the process all the more interesting. It is vital to understand the nuances of how photos evolved,” he says. In the next two days the photo historian will teach ‘Salt Print’, a paper-based photographic process for producing positive prints during the period of 1839 through 1890, and ‘Egg Albumen Prints’, first commercial method to produce photographic print.\n\nVintage Photographic Process Workshop is a pre-event to the annual Pondy PHOTO 2016 held from August 27 to September 11 under the auspices of Pondy ART, Pondicherry Science Forum, French Institute of Pondicherry, Toxics Link and Heritage Commons.", 
    "section": "national", 
    "title": "Exposing gen X to art of photo processing", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}