{
    "author": [
        "Special Correspondent"
    ], 
    "text": "No procurement; farmers forced to sell coconuts to agents\n\nA group of farmers breaking the coconuts at the Collectorate in Thanjavur on Friday in protest against the fall in prices.\n\nSteep fall in the purchase price of coconut and the consequent setback to growers echoed at the farmers’ grievances day meet here on Friday.\n\nDistrict Collector N. Subbaiyan presided over the meeting which was attended by officials from various departments.\n\nSamy Natarajan of the Tamilaga Vivasyigal Sangam raised the issue of coconut farmers suffering due to the sharp slide in the procurement price of coconut in recent months. Agitated growers have been forced to throw out the coconuts on the streets to give vent to their pent up anger, he said.\n\nMr. Natarajan alleged that procurement of copra was not in line with rules and regulations as there the procurement of copra itself has fallen. The Union and the State governments must intervene in the issue and provide succour to the growers, he added.\n\nBacking him, another farmer V. Veerasenan of Ponnavarayankottai pointed out that Thanjavur district occupied the second spot in the State in coconut production and more than 40,000 hectares of land had been brought under coconut groves.\n\nThe State government had stopped copra procurement since 2012 and the Centre’s support price and incentive were not adequate to cover the cultivation cost. Unfortunately, the State government did not announce the support price and incentive at all compounding the woes of growers.\n\nThese factors had forced the growers to sell their produce to the private buyers and traders who were fixing atrocious rates. The Central and the State governments must immediately intervene to save the growers, he demanded.\n\nCoconut growers alleged that the unbridled import of coconut oil has adversely impacted on the coconut oil production in the domestic market consequent to which the copra procurement has not happened to the desired extent. They wanted import of coconut oil restricted to ease the situation.\n\nKakkarai Sukumaran wanted the banks and lending institutions to stop auctioning off jewel pledged by farmers with the institutions. He also demanded that the banks waive all loans got availed by the farmers.\n\nLater a section of the agitated farmers walked out of the meet and broke coconuts at the entrance of the Collectorate to highlight their protest. Thanjavur district vice-president of the Tamil Nadu Vivasa Thozhilalar Sangam V. Jeevakumar, Arignar Anna Sugar Mill Cane Suppliers Association secretary Thozhagiripatti Govindaraj and others spoke.", 
    "section": "national", 
    "title": "Falling prices of coconut dominates meet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}