{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Over a thousand people from four hamlets observed a fast at Kalakkad in the district on Friday, protesting against the permission granted for granite quarrying at Kadamboduvazhvu village and demanding permanent closure of the quarry.\n\nAfter permission for granite quarrying at Kadamboduvazhvu was granted, the villagers submitted a petition to the Collector during one of the grievance day meetings usually organised on Mondays.\n\nAs there was no positive step in favour of the villagers, residents of Kadamboduvazhvu, Vadugachimathil, Soorankudi and Puliyoorkurichi observed a fast near Kalakkad new bus stand on Friday.\n\nThe protesting villagers said that an individual, who had purchased 20 acres of land amidst plantain farms in Kadamboduvazhvu panchayat, commenced preliminary works for mining granite in the land without obtaining any permission from the village panchayat.\n\nEven though the rural local body’s permission was not obtained for mining granite from this land, the Department of Mines gave its nod for mining activity.\n\n“If quarrying of granite is started, groundwater table in and around this village will be seriously affected. Moreover, the lands getting water for irrigation from Puliyankulam, Kadamboduvazhvu tank and Alangulam will become barren… Hence, the permission given by the Department of Mines should be withdrawn,” R. Ramakrishnan, president of Kadamboduvazhvu panchayat, said.\n\nThe villagers also charged that the explosives to be used in the quarry would damage the houses in the area badly.\n\n“As the quarrying activities are actively going on amidst plantain farms, it should be stopped immediately. Or else, the farmers’ livelihood will be wiped out completely. If the mining activities are not stopped, all political parties will join hands to put an end to this granite quarry,” K.G. Bhaskaran, district secretary of the Communist Party of India (Marxist), said.\n\nRepresentatives of the Desiya Murpokku Dravida Kazhagam, Marumalarchi Dravida Munnetra Kazhagam, Communist Party of India, Communist Party of India (Marxist), Viduthalai Chiruthaigal Katchi and the Congress participated in the fast.\n\n“Explosives to be used in the quarry will damage the houses in the area badly”", 
    "section": "national", 
    "title": "Fast against quarrying amidst plantain farms", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}