{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "Resolve to lay siege to Sri Lankan Deputy High Commission office in Chennai\n\nAs there are no signs of release of fishermen languishing in Sri Lankan prisons after the were arrested by Sri Lankan navy and their boats were impounded by the island nation, the local fishermen launched an indefinite strike from Friday, and resolved to go ahead with their decision to lay siege to Sri Lankan Deputy High Commission office in Chennai on February 29.\n\nA day after Sri Lankan courts extended the judicial remand of Rameswaram and Pudukottai fishermen by 15 more days, leaders of the fishermen associations met here on Friday and decided to strike work to express their protest against the Centre’s continued “silence” over the issue.\n\nThough they had decided to launch an indefinite strike, the fishermen might resume fishing after a week as they could not afford to prolong the agitation for long, P. Sesu Raja, a fishermen leader, said.\n\nThey had only a few fishing days left in March before the 45-day mandatory ban on fishing came into force in April. The strikes badly affected the livelihood of scores of hapless fishermen but they had no option to draw the attention of the authorities, he said. Leaders of fishermen associations in six coastal districts and Karaikal were in touch and would finalise the strategies for the Chennai agitation. Leaders in Chennai were taking steps to obtain police permission for the agitation, Mr. Sesu Raja said.\n\n“We expect about 200 fishermen from each district to take part in the agitation,” he said, adding the local leaders have arranged four buses for taking 200 fishermen from here. Family members of 27 fishermen, who were languishing in Lankan prisons, and owners of 79 boats impounded in the island nation would also take part in the agitation, he said.\n\nIn a counter move, the Sri Lankan Tamil fishermen had also announced that they would stage a demonstration in front of the office of Consulate General of India in Jaffna, on February 29 itself, to protest against any move to allow the Indian fishermen to fish in Sri Lankan waters, reports received here said.", 
    "section": "national", 
    "title": "Fishermen launch indefinite strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}