{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers representatives have urged the district administration to ensure that all genuine farmers who suffered crop damages during the monsoon rain were given compensation.\n\nRaising the issue at the meeting, P.Viswanathan, president, Tamizhaga Eri Mattrum Attru Pasana Vivasayigal Sangam, said farmers who had raised small onions, cotton and maize suffered losses due to the damage caused by the monsoon rain. Though the government has sanctioned compensation, all those who have suffered damages have not been given the relief. A proper survey of the affected farmers should be conducted in Thuraiyur, Manachanallur and Pullampadi taluks and the relief amount should be given to the omitted farmers, he said.\n\nR.Raja Chidambaram, State Secretary, Tamizhaga Vivasayigal Sangam, said disbursement of relief should be streamlined and all affected farmers should be compensated.\n\nAccording to official sources, about Rs.7.51 crore has been sanctioned as compensation to farmers for crop damages in rainfed cotton in about 10,137 hectares mostly in Pullampadi, Manchanallur, Thuraiyur, Uppilliyapuram and Musiri blocks. Compensation has also been sanctioned for crop damages in small onions and tapioca, official sources said.\n\nMr.Raja Chidambaram said the state government has recently formed a committee under the chairmanship of the district collector to inspect tanks and ponds in the district and allow farmers to collect silt from their beds. The process of granting permission should be simplified, he demanded. He complained that some of the banks were auctioning jewels pledged for crop loans by defaulting farmers much below their market value and urged the Collector to initiate steps to check the practice.\n\nSupporting his complaint, P.Ayyakannnu, state president, Desiya-Thennindia Nadigal Inaippu Vivasayigal Sangam, charged that some cooperative societies were also indulging in such irregularities in auctioning jewels pledged by defaulting farmers.\n\nMr.Viswanathan urged the district administration to take steps to desilt all tanks in the district as the State government has earmarked substantial sum for the exercise. He expressed disappointment over the State government’s failure to announce waiver of crop loans in its interim budget.\n\nAyilai Siva Suriyan, district secretary, Tamil Nadu Vivasayigal Sangam, affiliated to the Communist Party of India, said that the new crop insurance scheme announced by the Centre should be implemented only through the Agriculture Insurance Company of India Ltd.and not through private insurance companies. Branches of the Agriculture Insurance Company of India should be opened in the districts and individual farmers should be compensated for crop losses, he demanded.", 
    "section": "national", 
    "title": "‘Give relief to all affected farmers’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}