{
    "author": [], 
    "text": "A technical officer explaining the working of global positioning system installed in a police patrolvehicle in Madurai.\n\nOnce engine is on, it will be indicated, writes S. Sundar\n\nSoon, movement of all police patrol vehicles of Madurai rural district police on State and National Highways will be monitored ‘live’ from a computer at the district police office, thanks to a State-level project to fit global positioning system in patrol vehicles.\n\nSeven of the 11 patrol vehicles have been fitted with GPS equipment provided by State Traffic Planning Cell (STPC).\n\nThe GPS system will soon be activated after which every movement of the vehicles can be monitored real time without having to ask those manning the patrol vehicles.\n\n“It will be a continuous monitoring system. The daily, weekly and monthly reports on the movement of all the vehicles under the GPS monitoring can be taken easily,” said Superintendent of Police Vijayendra Bidari.\n\nA small GPS equipment along with a speaker has been provided in the dashboard of the vehicles.\n\nOnce the engine is ignited, it will be indicated through the system in the computer screen at the office.\n\nThe new system will reflect whether the vehicles are moving as per the instructions given from the DPO.\n\nThe main purpose of the patrol vehicles is to rush to help at times of accidents on highways and to prevent crime on highways.\n\n“Usually, the patrol team is made to sign on the patta books kept at vantage locations on their beat to track down their movement and make them touch every point. But, since this is manually done, there is chance of failure in proper tracking of the movement, if the patta books are not regularly checked by supervising officers,” Mr. Bidari said.\n\nThough monitoring in the earlier version of the GPS was done only in Chennai, in the present system access to website has been given to the district police too.\n\nThe special branch staff could now monitor the movement of the patrol vehicles, he added.\n\nThe GPS equipment also allowed making calls between the STPC control room and the patrol vehicle.", 
    "section": "national", 
    "title": "GPS to monitor movement of police patrol vehicles", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}