{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Collector askes Tangedco to take immediate action\n\nV. Sampath, District Collector, directed the Tangedco authorities to initiate severe action against those indulging in illicit tapping of water from River Vasishta.\n\nS. Jayaraman, president, Abinavam Uzhavam Mandra Koottamaippu, Yethapur, raised the issue at the farmers’ grievances redressal day meeting held at the District Collectorate here on Friday.\n\nHe alleged that people were indulging in illegal tapping of water from the river, due to which interior villages were reeling under severe drought.\n\nThe groundwater level has gone down in rural pockets, he complained and sought severe action against persons indulging in the illegal activity.\n\nC. Vaiyapuri, president, United Farmers Association – Tamil Nadu and other farmers too demanded the district administration to take effective steps to check this.\n\nV. Sampath, District Collector, directed the Tangedco officials to take a list of the people indulging in illicit tapping of river water using motor pump sets and issue a warning to them to desist from this practice.\n\nThe power connection to them should be severed and the motor should be seized if they continued this practice.\n\nThe Tangedco can even seek the assistance of the police if need arises, Mr. Sampath said.\n\nMr. Jayaraman raised the issue of Kariyakovil and Aanaimaduvu reservoirs constructed 14 years ago and complained that the PWD authorities are refusing to provide the DRA (Dam Regulating Act) to the farmers despite repeated requests.\n\nVegetable market\n\nA group of farmers led by Mr. Jayaraman and Vetrimani of Kottavadi demanded steps for setting up a regulated vegetable market on the lines of the markets functioning in Tiruchi, Odanchathiram in Salem district. He said that the two vegetable markets at present functioning in the district were non-regulated markets.\n\nThey said that Salem is a multi-crop area and setting up of a regulated vegetable market will immensely benefit the entire farming community.\n\nThey suggested that the premises of the Uthamacholapuram regulated market maintained by the Marketing Committee could be utilised for the setting up of the vegetable market.\n\nMarket\n\nState Marketing Committee official explained that the Uthamacholapuram regulated market was only for stocking the agricultural produce.\n\nThe department will be in need of ten acres of land for setting up a full fledged regulated vegetable market. He assured to take steps for the identification of the site.\n\nV. Sampath assured to send a team of officials to study the functioning of the regulated markets in the State and send a proposal to the government.\n\nFinancial loss\n\nK. A. Govindasamy, president, Tamil Nadu Tapioca Farmers Association, complained that the sago unit owners refused to give the price finalised in the tri-partite meeting convened by the district administration for the tapioca crop this season, due to which the farmers had to suffer heavy financial loss. He urged the Collector to ensure the participation of owners of the major sago factories in the tri-partite talks in future.\n\nBalasubramanian of Panamarathupatti complained that a new anganwadi building has come up on the supply canal of Santhiyur-Attayampatti Lake. This will hit the farm activities in about 214 acres. He demanded demolition of the same immediately.", 
    "section": "national", 
    "title": "Illegal water tapping from River Vasishta", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}