{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Jamal Mohamed College volleyball team receiving the trophy from Rt. Rev. G. Paul Vasanthakumar, Bishop and Chairman, CSI Tiruchi-Thanjavur Diocese, in Tiruchi on Thursday.\n\nThe Jamal Mohamed College spikers put behind them the disappointment of losing a tournament on home turf earlier this week and bounced back strongly to clinch The Rev. G.H. Launder Memorial Trophy in the Golden Jubilee State-level inter-collegiate volleyball tournament here on Thursday.\n\n“The boys played with purpose and consistency. They dropped just one set in the tournament,” said B.S. Sha-in-Sha, Director of Physical Education, Jamal Mohamed College, commending the efforts of coach B. Swaminathan.\n\nThe three-day tournament, organised by the Bishop Heber College, was played on a league-cum-knockout basis. The teams were divided into four groups.\n\nThe topper from each group – Jamal Mohamed College, Bishop Heber College, St. Joseph’s College, Tiruchi, and Sri Krishna Arts and Science College, Coimbatore – advanced to the semi-finals.\n\nJamal Mohamed College defeated the host in the final.\n\nSri Krishna Arts and Science College got the better of St. Joseph’s College in the third-place playoff.\n\nR. Prabhu (Jamal Mohamed College) was adjudged the best libero, A. Rajadurai (Jamal Mohamed College) and S. Ajith Kumar (Bishop Heber College) as the best attackers, C. Pavithran (Sri Krishna Arts and Science College) as the best setter, and R. Manimaran (St. Joseph’s College) as the best blocker.\n\nRt. Rev. G. Paul Vasanthakumar, Bishop and Chairman, CSI Tiruchi-Thanjavur Diocese, gave away the prizes in the presence of D. Paul Dhayabaran, Principal, Bishop Heber College, L.C. John, Head, Department of Physical Education, and T. Pichaiappa, Secretary, Tiruchi District Volleyball Association.", 
    "section": "national", 
    "title": "Jamal Mohamed College wins volleyball tournament", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}