{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A lorry driver was given four years’ rigorous imprisonment by the court for fatally injuring two persons while driving under the influence of alcohol.\n\n“This is the first case of its kind booked by the Traffic Police that has culminated in stringent punishment to the driver for causing death under the influence of alcohol,” Inspector General of Police Praveer Ranjan said in a press release.\n\nOn May 19, 2013 at 7.30 p.m, S. Mani (52) of Kangeyam, Tamil Nadu, under the influence of alcohol, drove the lorry in a rash and negligent manner along Pondicherry-Villupuram main road near Thandapani Petrol Bunk, Madagadipet, and hit Velmurugan of Nettapakkam.\n\nContinuing to drive recklessly, he also knocked down one Siva Vadivelu of Nellai district near Madagadipet Roundtana. Both of them died.\n\nGrievous injury\n\nWithout stopping the vehicle, he further drove down and hit one Mangayarkarasi of LR. Palayam near Madagadipet Ezhai Mariamman Temple causing grievous injuries to her.\n\nThe accused Mani was booked under the offence of ‘culpable Homicide’, punishable under section 304 (ii) Indian Penal Code (IPC) for causing death of Velmurugan and Siva Vadivelu and for an offence of ‘attempt to commit culpable homicide not amounting to murder’, punishable under 308 IPC for causing hurt to Mangayarkarasi under the influence of alcohol while driving the vehicle.\n\nThe case was under trial in the Chief Judicial Magistrate court. At the conclusion of trial, Chief Judicial Magistrate V. Padmanabhan held the lorry driver guilty and convicted him for offences.\n\nMani was sentenced to undergo four years’ rigorous imprisonment for culpable homicide and two years rigorous imprisonment for attempt to commit culpable homicide not amounting to murder.", 
    "section": "national", 
    "title": "Lorry driver sentenced to 4 years RI in accident case", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}