{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Out of the 12 Amma Unavagams opened in the city, four obtained ISO certification, the Mayor said. However, the budget tabled in the council hall, a copy of which was issued to all councillors and the media, indicated that the income from Amma Unavagams were Rs. 80.19 lakh, whereas the expenditure stood at Rs. 307.34 lakh, thus marking a net loss to Rs. 227.15 lakh.\n\nThe parks/gardens had earned an income of Rs. 43.72 lakh against an expenditure of Rs. 5.lakh. Similarly, income earned from parking fees (vehicles) was Rs. 204.29 lakh and revenue from pay-and-use toilets stood at Rs. 68.33 lakh.\n\nSenior AIADMK councillor and zone chairman Salaimuthu said that the deficit of Rs. 5.66 crore could have been avoided easily, had the officials been alert.\n\nCiting an example of how an assessee, who was paying Rs. 740 as property tax (per annum) for his old building, continued with the same tax after constructing a new high-rise building in the same plot.\n\nOnly by carrying out door-to-door inspections, such violations could be brought to light, he said.\n\nAnother zone chairman, Rajapandian (AIADMK), said that the Corporation should examine the modalities of enhancing its revenues. Buildings could be constructed in vacant sites belonging to the Corporation and rented out.\n\nThough the Corporation had proposed to use satellite in mapping the city’s properties for tax assessment a couple of years ago, it had not been implemented so far, the AIADMK members said.\n\nAfter the High Court restrained the Corporation from collecting toll fee on the ring road, a sum of Rs. 36 crore remained in the Escrow account.\n\nNow the government had sanctioned the fund to the Corporation. It would be utilised for laying roads in extension areas, and for remaining underground drainage works under JnNURM, he added.", 
    "section": "national", 
    "title": "Loss-making Amma canteens", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}