{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, Railway Colony, 7.30 p.m.\n\nMeenakshi Sundareswarar Temple: Discourse on ‘Tiruvilayadalpuranam’ by M. Gnanapoongothai, Tirukkalyana Mandapam, 6 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh Study Circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Naaladiyar’ by S. Ramachandran, New Natham Road, 5.45 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nTamil Isai Sangam: 41{+s}{+t}Tamil music festival; Bharatanatyam by Madhula Kishorekumar, 5.15 p.m.; Navabharat Theatres’ play, ‘Soppana Kuzhanthai,’ Raja Muthiah Mandram, 6.45 p.m.\n\nSarvodaya Ilakkiya Pannai: V. Ramasubramanian, Judge, Madras High Court, releases M. P. Gurusamy’s book, ‘J. C. Kumarappavin Karuththu Kalanjiyam,’ Library, Gandhi Museum, 5.30 p.m.\n\nGENERAL\n\nVivekananda College: National Science Day celebration; N. Srinivasan of Thiagarajar College addresses, B. Ramamoorthy, Principal, presides, Tiruvedakam West, 9.40 a.m.\n\nFatima College: 40{+t}{+h}graduation ceremony; T. R. A. Deva Kumar, Registrar, Rajiv Gandhi National Institute of Youth Development, addresses, Jubilee Hall, 2 p.m.\n\nYadava College: M. Kumaresavanji of University of Porto speaks on ‘Magnetic refrigeration using nanostructural materials;’ S. Dhanasekaran, Principal, presides, Rajendran Yadav Auditorium, 10 a.m.\n\nSourashtra College: National Science Day celebration; inter-collegiate competitions for life science students, James Chelliah of Jawaharlal Nehru Centre for Advanced Scientific Research addresses, Silver Jubilee Hall, 9 a.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, M. Arunagiri, Principal, presides, Kallampatti, 2.30 p.m.\n\nMadurai Sivakasi Nadars’ Pioneer Meenakshi Women’s College: 17{+t}{+h}annual Sports Day; S. Maniswara Raja, Regional Passport Officer, distributes prizes, Poovanthi, 3 p.m.\n\nVelammal College of Engineering and Technology: Valedictory function of EEE Association; J. Santhosh, Joint Director, Central Power Research Institute, addresses, Viraganoor, 11 a.m.\n\nVaigai College of Engineering: M. Raja Climax, chairman, CEOP Matriculation Higher Secondary School, inaugurates National Science Day celebration; V. Ramanathan of Thiagarajar College of Engineering distributes prizes; P. Sugumaran, Principal, presides, Therkkutheru, 9.30 a.m.\n\nSparks Special School for Autism: Third anniversary celebration; P. Indu speaks on ‘Problems of children with autism,’ Gandhi Museum, 4 p.m.\n\nMeeting: To remember former Assembly Speaker P. T. R. Palanivel Rajan on his birth anniversary; AR. Lakshmanan, former Judge, Supreme Court, presides, Lakshmi Sundaram Hall, 10 a.m.\n\nInstitute of Company Secretaries of India: Seminar on ‘Labour laws and cost auditing,’ Hotel Metropole, Dr. Ambedkar Road, 10 a.m.\n\nIndian Institute of Public Administration: M. G. Mohanakrishnan of All India Radio speaks on ‘Commercial viability of media,’ Madurai Institute of Social Sciences, Alagarkoil Road, 5 p.m.\n\nMadurai Productivity Council: Governing body meeting, 52 TB Road, Mahaboobpalayam, 6.30 p.m.\n\nUzhaikkum Makkal Viduthalai Iyakkam: Silver jubilee conference on working people’s right to livelihood; Arputham, State vice-president, presides, Justice V.R. Krishna Iyer Community Hall, Lake View Road, K. K. Nagar, 10 a.m.\n\nTamil Nadu Senior Citizens and Pensioners’ Welfare Association: State executive committee meeting, Siva Somanathan presides, TNROA Building, Collector’s Office, 10.30 a.m.\n\nGrace Kennett Foundation: Inauguration of new wings by D. V. P. Raja, chairman, Madurai Institute of Social Sciences; Bama Raja and Yvonne Hunger of Switzerland participate, Kennett Road, 5 p.m.\n\nPeople’s Anticorruption Movement: Executive committee meeting, Tamil Nadu Sarvodaya Mandal, Gandhi Museum, 4.45 p.m.\n\nMadurai District Tiny and Small Scale Industries Association: 30{+t}{+h}All India Ideal Home Exhibition, Tamukkam Ground, 11 a.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}