{
    "author": [
        "B Kolappan"
    ], 
    "text": "Statues of deities in various sizes adorn small workshops on either side of the road in Mailadi, a small town near Kanyakumari. The sound of chisels and hammers, power hacksaws and drilling machines fills the air and the dust from the stones envelopes the place. The atmosphere bears a close resemblance to Mamallapuram.\n\nOver 500 sculptors living in Mailadi and the co-operative society for sculptures have a revenue target of Rs 30 lakh. If the revenue of individuals is included, it is easily several crores of rupees a year.\n\nHistorically, the availability of granite gneiss attracted sculptors to Mailadi even though there is a ban on quarrying now.\n\nAccording to Robert Bruce Foote, British geologist and archaeologist, “The predominant character of the gneiss rock is that this quarter is that of well-bedded, massive, quartzo-feldspathic granite gneiss with a very variable quantity of (generally black) mica and very small red or pinkish garnets.”\n\n“Though there are different theories about the migration of sculptors to Mailadi, Edgar Thurston, writer, says the Viswakarmas (artisans) would have arrived with Vellalas from Kaverpoompattinam in 824 AD,” says folklorist A.K. Perumal. The second migration would have happened along with the arrival of Chola army stationed at Kottar known as Mummudicholapuram. The final arrival was probably during the Nayak period in the 16th century.\n\n“The panels on the basement of the Suchindram temple and Siva temple in Thiruvithancode are made by sculptors who migrated from the Pandya kingdom. An inscription in the Madhusoothanaperumal temple talks about the land donated to the sculptor Kommandai Nainan and the title Sirpapuranthiran conferred on him and others,” explains Mr. Perumal.\n\nHistorian K.K. Pillai, who did his doctoral thesis on the Suchindram temple, said the massive Anjaneya, Garuda, Manmath and Rathi were carved out of granite gneiss.\n\nK. Ayyappan, a sculptor, says, “Nothing can match Mailadi granite when it comes to making the statues. Because of the ban we are getting the stones from Karunkulam in Tirunelveli district and Kozhkottupothai in our district.”\n\nThe demand from Kerala and importance gained by folk deities in society have ensured steady business throughout the year. Many old sculptors, Nallathanu Asari and Lakshmana Asari, had their training in Mamallapuram and imparted their knowledge to local sculptors, who are no longer confined to the Viswakarma community.\n\n“I was encouraged by a good sculptor Mahalingam Asari to take up the profession and today I have a workshop on my own,” says S. Vadivelu, adding, “high competition has kept the business going, but has also brought down the price.”", 
    "section": "national", 
    "title": "Mailadi, hub of exquisite granite sculptures", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}