{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two days after the Madras High Court summoned the Tiruvannamalai Superintendent of Police in connection with a case of a missing minor girl, the State police on Friday traced the girl and produced her before the court.\n\nA habeas corpus petition was moved by the 16-year-old girl’s father pleading for a direction to trace his daughter who was missing since December 13, 2015. He alleged that his daughter was abducted by a person who was once his driver.\n\nOn Friday, the SP and the Investigating Officer in the case appeared before the court and submitted that the girl had been traced and produced her before the court.\n\nOn inquiry by the Division Bench of Justices M. Jayachandran and S. Nagamuthu, the girl informed the court that her date of birth is June 9, 2000, confirming that she is still a minor. The girl said she left home on her own accord and married her boyfriend on December 13, 2015 and pleaded the court not to take any action against him.\n\nRejecting her request, the Bench explained to her that the law would take its own course. As the minor expressed her willingness to go with her parents, the court allowed her to go with a clear instruction to her parents not to cause any harm to the girl, mentally or physically.\n\nIn a bid to ensure the safety of the girl, the Bench passed interim directions to the president of the District Child Welfare Committee to make periodic visits to the house of the petitioner to verify whether the minor girl was taken care of properly and submit a report to the court.\n\nThe Superintendent of Police was directed to ensure that a woman inspector and a sub-inspector visited the house of the petitioner every day and make a record of their visit and verify whether the minor girl is maintained safely, without causing any harm to her.\n\nThe Tiruvannamalai Collector was directed to make arrangements for a counsellor/ psychiatrist to visit the girl as and when required and give counselling to her.\n\nThe Bench then posted the matter to March 11 with a direction to produce the girl before the court on that day.\n\nMadras High Court asks police to ensure she is taken care of by her parents", 
    "section": "national", 
    "title": "Missing minor girl traced, says she is married to boyfriend", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}