{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stern action against anti-social elements, compulsory registration of cases and zero prohibition offences are among the key priorities for P. Pakalavan, Superintendent of Police, Vellore.\n\nAssuming charge as Vellore SP on Friday, he told reporters that rowdyism will be curbed in the district.\n\n“My main focus will be on compulsory registration of all cognisable cases once complaints are lodged at the police stations. One of the main grievances of people is that cases are not registered in police stations. A system will be put in place to get cases registered instantly. Once this is done, everything else will fall in place,” he said.\n\nSuch a system was put in place in Cuddalore, and would be implemented in Vellore too. As a statutory provision, FIR will be given free of cost to the complainant, he added.\n\nAs part of crime control measures, steps will be taken to check on serial offenders by way of preventive arrests, he said.\n\nProhibition\n\nProhibition will be another focus area, he said, adding that the department will strive towards complete curb on prohibition offences such as illegal sales of liquor and smuggling of rectified spirit.\n\n“I will also work for the welfare of our men (police personnel). They work day and night, and I will see that their needs such as leave, timely relief, and financial assistance are immediately attended to,” he observed.\n\nWith the traffic turning chaotic in Vellore, Mr. Pakalavan said that he would study the traffic situation. “I will take steps to ease bottlenecks in traffic, if any. A study of accident prone areas will also be done and immediate remedial measures will be taken,” he added.\n\nOn WhatsApp\n\nThe Vellore police will introduce an exclusive facility through which public can provide information to the department. Public can send messages, photographs and videos related to crime, law and order and other grievances through mobile messaging app – WhatsApp.\n\n“A phone number will be launched for the purpose, and a separate team will be engaged in this initiative. The information will be passed on to the respective police stations and steps will be taken to solve the issue immediately,” he said.\n\nThe SP said that the forthcoming Assembly election was one of the main agendas now. “Already, a lot of preparatory works have been done. I will review the works, and start ground-level election work,” he pointed out.", 
    "section": "national", 
    "title": "No place for rowdyism in Vellore: SP", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}