{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The remains of the Tamil Nadu State Transport Corporation that went up in flames after a car rammed into it on Thursday night near Kalathur junction on NH 48.— special arrangement\n\nTraffic on the National Highway 48 came to a standstill on ‘Thursday night after a Tamil Nadu State Transport Corporation bus rammed a stationary van parked on the middle of the road. Passengers in both the vehicle had a miraculous escape.\n\nPolice said the mini-van was stationed close to the median on the NH following a flat tyre. Except for a small branch with leaves on the rear side of the van, the driver did not take any effort to indicate that the vehicle was parked on the NH.\n\nDriver injured\n\n“The driver of the TNSTC air-conditioned bus noticed not see the stationed mini-van as it was dark. By the time he spotted it, the vehicle was too close for comfort and by the time he applied the brake it was too late. As a result the bus rammed into the stationary mini-van. The driver sustained injury in the eyes as the windshield shattered,” a police officer said.\n\nHowever, within seconds, a car that was coming behind rammed into the bus. As the bus engine was on the rear side, the car and bus went up in flames in the impact. The accident occurred at 10.15 p.m.\n\n“The passengers and bus crew had alighted from the vehicle following the first collision. Hence, they escaped unhurt. A mother and son, who were travelling in the car, sustained minor injuries and were treated as out patients,” he said.\n\nThe bus driver was admitted to a private hospital for treatment. Fire and Rescue Services personnel of Kancheepuram were informed. They rushed to the spot and doused the fire. The two vehicles were badly damaged in the fire.\n\nTraffic jam\n\nPolice said following the accident, traffic on the Chennai-Vellore stretch of NH 48 came to a standstill till 4.15 a.m. Traffic was restored after the fire was put off, and the vehicles were moved from the stretch. Avalur police have registered a case.\n\nIn 2011, 21 passengers of a private bus were charred to death after a fire engulfed the vehicle that had capsized and fell into a roadside pit at Avalur on the NH.", 
    "section": "national", 
    "title": "Passengers have a miraculous escape after bus, car go up in flames", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}