{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has criticised School Education Department officials for the pitiable plight of a person who got appointed in government service on compassionate grounds in 1986 and retired in 2015 without even being regularised in service despite sending several reminders to higher officials concerned during his 29-year-long service. Dismissing a State appeal, a Division Bench of Justices S. Manikumar and C.T. Selvam said: “After giving appointment in tune with the scheme for compassionate appointment and after having allowed the individual to work for 29 years, it is not fair on the part of the appellants to deny regularisation and consequential service and monetary benefits including retirement benefits.”\n\nThe judges pointed out that the retired employee P. Rathinakumar’s mother R. Subbammal had died in harness when she was serving as a secondary grade teacher in a government school in Tirunelveli district in 1984. Therefore, he sought for appointment as a Junior Assistant on compassionate grounds since he had studied only up to the level of Secondary School Leaving Certificate.\n\nHis plea was accepted in 1986 and he was appointed as a Record Clerk in a government high school at Karentheneri in Nanguneri Taluk before being shifted to the post of Junior Assistant in the same school in 1991. The District Educational Officer (DEO) forwarded a proposal for regularising his service to Director of School Education but it did not fructify even after he attained the age of superannuation.\n\nIt was only after retirement, Mr. Rathinakumar filed a writ petition in the High Court and obtained an order on November 23 to regularise his services notionally and pay all consequential monetary benefits. Confirming the single judge’s order, the Division Bench directed the School Education Secretary to comply with the order within a month.", 
    "section": "national", 
    "title": "Plight of government staff shocks High Court", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}