{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "A meeting with PMK founder S. Ramadoss could also be on the cards\n\nUnion Environment Minister Prakash Javadekar, who is the party in-charge for the Assembly elections in Tamil Nadu, is likely to meet DMDK leader Vijayakant on Sunday to iron out issues posing hurdles to the formation of an alliance between the two parties.\n\nWhile BJP sources said a meeting with PMK founder S. Ramadoss could also be on cards, party chief ministerial candidate Anbumani Ramadoss said there was no official communication from the BJP side. A source added Mr. Javadekar would reach Chennai on Saturday evening and was likely to hold a meeting with Mr. Vijayakant on Sunday. The development comes at a time when the DMDK continues to play the watching game and has maintained a sort of a stoic silence on possible partners. Last Saturday, Mr. Vijayakant held a massive rally and solicited the views of his party workers, who had wanted him to be the ‘King’ and not the ‘kingmaker’. Mr. Anbumani, however, said that there was, at the moment, no proposal to meet Mr. Javadekar. On Saturday we are busy with our state conference, and on Sunday, I will be in Dharmapuri,” he said.\n\nDMDK unhappy\n\nMeanwhile, the DMDK seems to be unhappy with top BJP leaders, including Prime Minister Narendra Modi, wishing Chief Minister Jayalalithaa on her birthday on Wednesday. A comment made by senior BJP leader L. Ganesan on Friday that the party would initiate talks with the AIADMK, if necessary, had also irked the DMDK leadership, sources added.\n\n“We contacted the Tamil Nadu BJP leaders to understand what was happening. If the BJP had the idea of approaching the AIADMK, there was no point in holding talks with us,” said a senior DMDK MLA. Later, speaking to reporters, BJP State president Tamilisai Soundararajan rejected the idea of talks between the AIADMK and the BJP.", 
    "section": "national", 
    "title": "Prakash Javadekar likely to meet Vijayakant", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}