{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Senior category winners B. Haritha and R. Muthukrishna of St. Patrick School, Puducherry and junior group winners R. Srivats and Srivats Gopal of PSBB, Chennai, with the Chief guests at The Hindu Young World Quiz at Anna Adharsh College in Chennai on Thursday.— Photo: K. Pichumani\n\nBe it history, sports or music, students of St. Patrick School in Puducherry had the answer in the The Hindu Young World Quiz and emerged winners.\n\nB. Haritha and R. Muthukrishna, a class IX and a class VII student of the school, who won the first prize in the seniors category, said they had been looking forward to the quiz for three months.\n\n“We have been learning to quiz for a few years now. So, I guess the credit goes to our master,” said Ms. Haritha, who aims to become a doctor.\n\nIn the juniors category, students of Padma Seshadri Bala Bhavan, T. Nagar, Shri Vats Gopal and Srivats R won the first prize.\n\nAbout 241 teams and 271 teams in the juniors and seniors categories respectively, participated in the quiz.\n\nVarious schools from Chennai, Kancheepuram and Puducherry participated.\n\nIntense competition\n\nV.V. Ramanan, deputy sports editor of The Hindu and quizmaster of the event, said that it had been wonderful conducting the quiz for the last 16 years.\n\nThis time, the intensity was high. The contests were fiercely fought, he added.\n\nPostmaster General Mervin Alexander, who gave away the prizes to the winners, said he was surprised by the enthusiasm and intelligence displayed by the children.\n\n“Curiosity is very important for children. It is the key to learning,” he added. Surabhi Gopal and Dhrish Paresh Vasa of Sishya School in Chennai, who emerged third, said quizzing had always been fun.\n\n“You can never prepare for a quiz. Just reading is all we do,” they said.", 
    "section": "national", 
    "title": "Puducherry school triumphs in The Hindu Young World Quiz", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}