{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mayor P. Rajkumar on Friday presented the Budget for 2016-17 projecting a deficit of Rs. 76.87 crore. Finance and Taxation Committee Chairman R. Prabhakaran, who presented the financial position, said that the civic body would take various revenue augmentation measures to make good the deficit. It would also use the grants from Central and State governments for the purpose.\n\nThe projected revenue for 2016-17 was Rs. 1,101.70 crore and the expenditure Rs. 1,178.57 crore.\n\nMr. Rajkumar said that the Corporation would establish digital libraries or e-libraries in five higher secondary schools at Rs. 75 lakh and another one for public in the heart of the city. It would also set up tab-labs for students at Rs. 50 lakh.\n\nIn addition to that he had proposed setting up a teachers’ education academy to train Corporation school teachers at Rs. 65 lakh.\n\nIn Vellalore to improve the environment, the Corporation would set up a biodiversity park on 50 hectare plot with green circle, herbs, shrubs and a butterfly garden. It would also buy and station a machine with water cannon to immediately attend to fire breakouts. Plus, there would be a waste-to-energy plant to handle 700 to 1,200 metric tonnes a day at Rs. 312 crore.\n\nTo improve drinking water distribution, the Corporation would spend Rs. 7 crore to install a control room at the main storage reservoir in Ganapathy to electronically monitor water flow and also send automated messages to senior officials.\n\nKabadi court\n\nAs part of sports development initiatives, Mr. Rajkumar said that the Corporation would revive the kabadi court in the Nehru Stadium at Rs. 10 lakh, build sports hostels and also encourage those Corporation school students who excel in sports.\n\nHe also announced a mental health centre to enable challenged people to stay and avail of treatment and a canine shelter for stray dogs.", 
    "section": "national", 
    "title": "Rs. 76 crore deficit budget for Coimbatore Corporation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}