{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "A friendly voice in a conversational tone introduced the play ‘Perumale’, saying that the team had a message to convey. It also made a tongue in the cheek comment on how any opinion conveyed through art was liable to misinterpretation these days. The voice also claimed that their artistic attempt was not to hurt anyone but to gently chide the common man for straying away from the path of devotion. Story and scriptwriter G. Radhakrishnan has managed to do that under the able direction of Sureshwar.\n\nAlthough the message was serious, the comic aspects dominated most parts of the script. The title song by Deva, a rehash of the hit movie song, ‘Thirupathi Ezhumala Venkatesa’, the casual inclusion of English words and words related to technology in the chaste Tamil dialogues rendered by MahaVishnu, the innumerable jokes cracked by Gajalakshmi and Narada set the expectations high.\n\nHumans are put to test by Gods in a world where money reigns supreme, and all other values are almost forgotten.\n\nThe second scene in which all the characters are introduced has many funny parts, although it tends to be a bit long. The scene in which a dying woman recognises divinity is well portrayed, and the story picks up pace from there.\n\nMadhuvanthi as Andal, the devotee, and Sureshwar as her irresponsible and irreverent husband performed convincingly, while the actor playing Narayana was a perfect fit. Two other characters who would be hard to forget are the male actor playing the role of the hero’s mother, and the fraudulent siddhar, who dances across the stage. All these characters mouth Tamil words in the slang of slum dwellers in Chennai.\n\nWhile devotees may benefit from prayer, prayer itself should not end up as being a mere bargain. This message conveyed by the play went well with the audience as it was sugar coated with fun and frolic by Magam enterprises.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Serious message conveyed with fun and frolic", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}