{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector S.Palanisamy has directed officials to clear encroachments from the new bus stand up to the Dargah area in Nagore immediately for ensuring smooth conduct of the kanthuri festival to be held from March 10 to 23.\n\nHe said that encroachments posed a hindrance for movement of devotees who will gather in large number. He advised the Revenue and police department officials to work in tandem to clear the encroachments on the streets in and around the New bus stand and also in the processional route of the Sandanakoodu.\n\nHe said the police would set up surveillance cameras at the administrative office of the Dargah. He advised the municipal authorities to ensure proper upkeep and maintenance of toilets.\n\nPriority would be accorded for the supply of drinking water to the pilgrims, he added.\n\nAbhinav Kumar, Superintendent of Police, C. Muthumari, Revenue Divisional Officer and Jayaraj, Revenue Divisional Officer were present.\n\nFlag hoisting on March 10\n\nIn a release, S.A. Shaik Hassan Sahib, Nagore Dargajh Shariff Managing Committee, said that the ‘paimaram’ (kodimaram) hoisting ceremony – a preliminary ritual, would be held at 5. 55 a.m. on March 6 and the holy flag would be hoisted on March 10 marking the commencement of the ‘kanthuri’ festival.\n\nHe urged the government to sanction 40 kg of free sandalwood for the celebrations.\n\nHe urged the Union Ministry of Railway to operate special trains from Mumbai, Sengottai and Nagercoil from Nagore. A canteen should be opened at the Nagore railway station to cater to the needs of the pilgrims visiting Nagore during the kanthuri festival. He also wanted additional lights to be provided at the railway station at Nagore. New train service should be introduced between Nagore and Tirunelveli.", 
    "section": "national", 
    "title": "Stage set for Kanthuri festival", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}