{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ninety-two undergraduate and post-graduate students of the Indian Institute of Information Technology (IIIT), Srirangam, functioning at the Bharathidasan Institute of Technology (BIT) campus of the Anna University-Tiruchi, who have launched a stir seeking change of the mentor institute, continued their dharna in front of the institution on Friday.\n\nThe students had launched a stir expressing dissatisfaction over standard of education and amenities on the campus. They have been demanding that the IIIT be brought under the mentorship of a Central government institution.\n\nThe Anna University-Tiruchi was designated the mentoring institution of the IIIT, which came into existence in 2014. The students have been complaining that the mentor institute had failed to measure up to the standards and was unable to provide the basic amenities and technical environment that a national-level institute required.\n\nThe students went on a strike and abstained from classes a few days ago. On Wednesday, the students, including 18 girls, went on a dharna in front of the institute after the authorities declared an indefinite closure. However, the indefinite closure order was withdrawn on Thursday, but the students have not returned to the classes, an official of the institute told The Hindu .\n\nOn Thursday, S. Madhumathi, Director of Technical Education, and K.S. Palanisamy, Collector, held talks with the agitating students and urged them to withdraw the stir. However, the students insisted that they would withdraw the agitation only if an assurance was given by the Union Ministry of Human Resource Development on the change of mentoring institute. The MHRD had been apprised of the developments, the official who did not want to be identified said.\n\nStudents representatives contended no other IIIT or national-level institute was being mentored by a State-level institution, they contended. The IIIT, they pointed out, admitted candidates from across the country based on the national-level JEE main and GATE exams and it should be mentored by a national-level institute of high standards.\n\nThe students said the syllabus was “not up to the mark and not comparable” with those of other national institutes as NITs and IITs. The institute did not have experienced faculty and adequate infrastructure to match its status as a central government institution, they said.\n\nResponding to the students’ complaints, the official maintained that adequate faculty, some of them doctorates, and infrastructure were available. Adequate amenities had been provided at the institute and the students had been accommodated at the guest house of the institute instead of the hostel so as to ensure quality accommodation. Construction of permanent building for the institute would begin soon, the official added.", 
    "section": "national", 
    "title": "Students continue stir", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}