{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers say huge quantum of water is going waste because of leaks in the sluices\n\nThe Kallanai Kalvai Irrigation Federation has urged the district administration to take steps for the repair and maintenance of sluices of the Kallanai Kalvai for ensuring optimum utilisation of available waters.\n\nInitiating a discussion at the monthly Farmers’ Grievances Day meeting here on Friday, Athani A. Ramasamy, president of the federation, said that a huge quantum of water was being wasted because of weak sluices. He wanted dredging of the irrigation sources for harvesting storm water.\n\nSekar, district president of Tamil Nadu Farmers’ Association, said the failure of monsoon had pushed farmers into deep debt.\n\nThe State government should write off the agricultural loans. He said that farmers had planned to launch a stir in New Delhi on March 15 demanding inter-linking of the Cauvery and Kundaru.\n\nAppavu Balandar pleaded for clearing of encroachments in the tanks and other water bodies.\n\nG.S. Dhanapathy said with the district being more prone for drought conditions, preventive measures, including dredging of tanks and supply channels should be taken. Focus should be on minor tanks under the maintenance of the village panchayats.\n\nChelladurai, district president of Coconut Growers’ Association, said the State government should take action to ensure attractive price for coconut. A copra procurement centre should be opened in Aranthangi.\n\nS. Ganesh, District Collector, who presided over the meeting, promised immediate action for redressing their genuine grievances.\n\nSeed supply\n\nHe said the district administration had made arrangements for the supply of quality seeds and fertiliser.\n\nReferring to complaints on pest attack in coconut, the Collector said that scientists had recommended remedial measures and advised the farmers to apply the same which will be available with subsidy.", 
    "section": "national", 
    "title": "Take up repair of Kallanai sluices, farmers urge officials", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}