{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram: Car festival, abishekam, 6 p.m.; Ambal purappadu in kuthirai vaganam, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Sri Chakarathazhvar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Krishnar Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 20, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nOrganising Committee: Sri Thyagabrahma aradhana mahotsavam, vocal concert by Kashyap Mahesh and party, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; vocal concert by Rithvik Raja and party, 8 p.m.\n\nRasika Ranjana Sabha and R. Radhakrishnan Memorial Trust: Kamban Vizha, S. Sathyaseelan, presides, vazhakadu mandram, Jayaraj, moderates, FGN Hall, W.B. Road, 6 p.m.\n\nKalai Kaviri College of Fine Arts: Graduation day of bharathanatyam, mohiniyattam, music and painting diploma and certificate programmes, S. Ganesh Ram, Principal, S.R. Naidu Memorial College, 5.30 p.m.\n\nShenbaga Tamil Arangu: Rasa. Ilangovan speaks on “Pavendar kanda penmai”, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology: Pragyan – techno management meet, guest lectures by Sudhir Kumar Mishra, CEO and MD, Brahmos Aerospace, 11 a.m.; Gianni Di Caro, senior researcher, IDSIA, Switzerland, 2 p.m.; Varun Agarwal, co-founder of Alma Mater, 4.30 p.m.; and Rene Reinsberg, VP, Emerging Products, Go Daddy, 9 p.m.; panel discussion, 6 p.m.; infotainment, 7.30 p.m.\n\nNational College: Graduation Day, A.P. Dash, Vice-Chancellor, Central University of Tamil Nadu, delivers graduation day address, 11 a.m.\n\nCauvery College for Women: Graduation Day, Latha Pillai, Director, Rajiv Gandhi National Institute of Youth Development, delivers graduation address, 2.30 p.m.\n\nRegional Learning Centre on Deaf Blindness-South, Holy Cross Service Society: State-level training on deaf blindness for medical, paramedical, and health workers, Dr. Shanthi, medical superintendent, Apollo Hospitals, Tiruchi, inaugurates, Ettupattai Compound, Puthur, 9.30 a.m.\n\nSt. Joseph’s College Shepherd Extension Department: Education and cultural festival for poor students of Tiruchi, Rev. S. Aruldas, director, Shepherd, inaugurates, college campus, 9 a.m.\n\nBishop Heber College: National conference on “Issues and challenges in higher education”, M. Krishnan, Chair, School of Environmental Sciences, Bharathidasan University, chief guest, 9.30 a.m.\n\nDiabetes Club of Tiruchi: Annual professional conference, Hotel Sangam, 8.15 a.m.\n\nJamal Institute of Management: International conference on “advanced management challenges in knowledge era”, 9.30 a.m.; valedictory address by A.K. Khaja Nazeemudeen, college secretary, 2.30 p.m.\n\nMIET Polytechnic College: First aid training programme by St. John Ambulance, 10 a.m.\n\nM.A.M. College of Engineering: Workshop on Innovative electronics, K.C. Tamiventhan, Director, LIFT Technologies, resource person, 9.30 a.m.\n\nM.A.M. College of Engineering and Technology: Charter ceremony of MAMCET Toastmaster Club, Sastharam Ravendran, District Director, participate, 9.30 a.m.\n\nImayam Institute of Agriculture and Technology, Kannanur: IIAT science expo, V. Subbaiah, programme coordinator, TREC_STEP, chief guest, 9 a.m.\n\nNehru Yuva Kendra and White Rose Welfare Association: Neighbourhood Youth Parliament, Sri Sruthi Mahal, Sankaran Pillai Road, 10.30 a.m.\n\nMahalakshmi Engineering College, Thudaiyur: Mahatechies 2016 – State-level project competition and exhibition, V.K. Raman, principal, V.J.P. Polytechnic College, chief guest, 10 a.m.\n\nDepressed People’s Welfare Association: Inauguration of deep borewells and hand pumps and water tanks, St. John’s Higher Secondary School, Iruganlur, 9.30 a.m.\n\nShri Angalamman College of Engineering and Technology: Lecture on “Advancement in CNC Machining Techniques” by J. Kannan, senior executive, Prim School of Skill Training, 10.45 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Annual day, M. Ravi, Chief Vigilance Officer, TN Cooperative Milk Producers Federation, chief guest, 5 p.m.\n\nSamooga Makkal Katchi: VOC Makkal Ezhuchi conference, V. Jayapal, presides, Uzhavar Sandhai grounds, Thennur, 5 p.m.\n\nHindu Mission Hospital, Dr. K. Shantha Breast Cancer Foundation and Rotary Club of Tiruchi Midtown: Mammogram screening for women above the age of 30, hospital premises, Anna Nagar, Thennur, 9 a.m.\n\nSesha Iyengar Memorial Higher Secondary School: School and sports day, S. Sekar, principal, Urumu Dhanalakshmi College, chief guest, 8.30 a.m.\n\nTiruchi Regional Roller Skating Association and RVS School: Tamil Nadu Open State Roller Skating championship, RVS School campus, 8 a.m.\n\nChild Jesus Matriculation School, Pullampadi: Annual day, Rev. P. Henry Pushparaj, parish priest, St. Anne’s Church, chief guest, 5.30 p.m.\n\nNational Institute of Technology and Tiruchi District Tiny and Small Scale Industries Association: Valediction of entrepreneurship awareness camp, P.Selvaraj, chairman, Shivani Group of Institutions, distributes certificates, TIDITSSIA office, Ariyamangalam, 4 p.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram : Workshop on Android application development and web development, A.Srinivasan, college chairman, presides, 9.30 a.m.\n\nOxford Engineering College : MBA Alumnus reunion, 10 a.m.\n\nM.A.M.College of Engineering and Technology : Lecture on Applications of digital signal processing by V.Vimalraj, assistant professor, 9 a.m.\n\nSri Ragavenda School, Samayapuram : Annual day, 5 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}