{
    "author": [
        "Tanu Kulkarni"
    ], 
    "text": "Officials say that it will help them communicate effectively\n\nA dozen traffic policemen, attached to the Adugodi Traffic Police Station, were blindfolded as their colleagues led the way and helped them perform various activities.\n\nLater, they were taught sign language so that they could communicate effectively with people having speech or hearing disabilities.\n\nThis was part of a sensitisation programme conducted last weekend by Prarthana Unkalkar Kaul, who founded GiftAbled, a non-governmental organisation that works with people with disabilities.\n\n“Traffic policemen are the ones who always try and help them. And we wanted to teach them the right way to help others,” she said.\n\nAnd what better way to sensitise people than through role play. “I asked a traffic policeman to help me cross the road after blindfolding myself. He took my cane from me, held my hand and made me cross the road. But the cane is supposed to be a visually impaired person’s guide to see if the road has stones or if is muddy. So we asked them to leave the cane with the visually impaired person,” said Ms. Kaul. Ramesh Kumar H.B., Adugodi traffic inspector, said that the sensitisation programme was very useful to the officials, and that it will help them communicate more effectively with people. “It will help us understand simple things such as addressing their query for the right directions, tell them bus numbers and help us understand what they are trying to say,” he said\n\nFor two years, since its inception, GiftAbled has so far trained 800 people on how to communicate effectively and assist people with disabilities.\n\nThese disabilities include speech, hearing, visual, physical and mental impairment. This month, the NGO plans to train people in hospitals.", 
    "section": "national", 
    "title": "Traffic cops sensitised to sign language", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}