{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tribal people living in the forest settlements in Sathyamangalam Tiger Reserve have been in eager anticipation of the day when they will be granted the title deeds since the start of the month when the Supreme Court vacated an interim stay by the Madras High Court on issuing title deeds for the land they have been cultivating for generations. While hoping for the best, P.L. Sundaram, MLA, said that he was not certain about the prospects due to indications that the announcement on Assembly polls would be made by the Election Commission of India in a week’s time.\n\nGround work\n\nThe Forest Department, sources said, has completed all the ground work for issuing the title deeds that would entitle the cultivators for bank loans and government subsidies under welfare schemes.\n\nThe grant of title deeds under the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006 (in short, FRA) signifies that the cultivators can enjoy its benefit for generations down the line for ever, but cannot sell the property.\n\nAbout 411 of the 3,723 title deeds that are ready for distribution in the State pertain to the forest settlements in STR. The department completed measurements for a total of 337.8 hectares in the settlements at Geddaisal near Hassanur, Nagalur, Mavanatham, Uginiyam, Ramaranai, Uppupallam, Nandhipuram, Vilankombai and Kembanur settlements.\n\nThe titles constitute both individual and common properties, said District Forest Officer of Sathyamangalam Division K. Rajkumar.\n\nA State Level Monitoring Committee constituted under the Forest Rights Act will have to see through establishment of Gram Sabhas and constitution of Forest Rights Committees, and determine Community Forest Resources rights by the Gram Sabhas, he added.", 
    "section": "national", 
    "title": "Tribal people await title deeds for land", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}