{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Project proposed in 2005-06 began in 2014\n\nA flyover that is expected to ease traffic congestion at Vadapalani intersection may finally be ready in about three months. According to officials of Chennai Metro Rail Limited (CMRL), the work has been progressing smoothly and they plan to complete the construction soon and hand it over to the Highways Department. “They will have it carry out some portion of work after which it may be open to the public,” an official said.\n\nThis flyover at the intersection of Arcot Road and Inner Ring Road is built at a cost of Rs. 69 crore. Of this, the Highways Department had deposited Rs. 30 crore with Chennai Metro Rail for construction of the flyover. This is located close to the Vadapalani Metro Rail station.\n\nThe idea to build this flyover was mooted way back in 2005-06 and the approval from the State government came but it was not taken up owing to the plans of Chennai Metro Rail construction in the area. The construction of Chennai Metro Rail stretch between Koyambedu and Alandur started in 2011.\n\nSubsequently, in December 2014, the work on the construction of the flyover began and it may be completed in three months. S. Aditya, a software professional living in Koyambedu, says he is often late to his office on Arcot Road due to congestion at this junction. “During the rush hour, sometimes it takes even half an hour to cross Vadapalani and reach Arcot Road. I wonder why it is taking so long to complete such a small project,” he said.\n\nThe first service of Chennai Metro Rail between Koyambedu and Alandur was launched in July last year. Sources said the flyover construction should have been completed even before the commissioning of the first service of Chennai Metro Rail. After the Chennai Metro Rail completes the work, it is not clear how long the Highways Department will take to complete the remaining work.", 
    "section": "national", 
    "title": "Vadapalani flyover may be ready in 3 months", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}