{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The problem of wild animals invading farms along Western Ghats and damaging crop surfaced at the farmers’ grievance day meeting here on Friday.\n\nZakhir Hussein of Vadakarai said wild boars and elephants were causing extensive damage to the crop. While the boars damaged small plants and tubers, the elephants caused damage to even decades-old coconut trees.\n\n“Losses mounting”\n\n“At a time when farmers are getting a sale price of just Rs. 5 per coconut, the damage caused by the animals compounds the problem. The wild elephants crush down solar electric fences, bring down tall coconut trees within minutes and devour the fronds. If this situation of low selling price of coconuts and elephants damaging the crop continues, farmers will be forced to abandon farming and convert their lands into housing plots,” Mr. Zakhir said.\n\nThe farmers also complained that the measures being taken by the forest personnel to chase the animals back into the forest were inadequate.\n\n“We don’t want the compensation of Rs. 500 per damaged coconut tree as we have to run from pillar to post to get certificates from three government departments. We appeal to the forest personnel to ensure a foolproof system to prevent wild animal invasion into the farms,” said S.T. Shaik Maideen, also of Vadakarai.\n\nPlea for more DPCs\n\nWhen farmers wanted more paddy direct procurement centres with adequate personnel, Collector M. Karunakaran said DPCs were functioning at 23 places in the district and two more would start functioning from Friday. He assured the farmers that steps would be taken to give money for the procured paddy on the spot as a section of the agriculturists complained of 48-hour delay in cash disbursement.\n\nDr. Karunakaran said surprise checks were being conducted at shops selling fertilizers, pesticides and other agro inputs and ‘stop sale’ order had been issued against 17 tonnes of fertilizers stocked in two shops in Shencottai taluk and a retail outlet in Maanur area.\n\nCrop damage during northeast monsoon had been estimated at Rs. 4.88 crore and Rs. 2.21 crore was disbursed to farmers who suffered loss, he said.\n\n“Forest personnel must ensure a foolproof system to prevent wild animal invasion into farms”", 
    "section": "national", 
    "title": "Wild animals continue to raid crops: farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-27"
}