{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Farmers demand that a flying squad be formed to conduct surprise checks at the site\n\nFarmers complained that the Mahatma Gandhi National Rural Employment Guarantee Scheme was poorly implemented in the district during the grievance redressal meeting on Friday. —Photo: C. Venkatachalapathy\n\nLast month, the Department of Rural Development and Panchayat Raj dismissed 257 work-site supervisors of the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) for poor implementation of the scheme works in the district, M. Manohar Singh, additional director of the department, Vellore said.\n\nThis was in reply to a number of complaints from farmers during the grievance redressal meet, that the scheme works were poorly executed across the district. The official said that everyday, works under MGNREGA are taken up at 1,227 sites in the district, with each place having a work-site supervisor.\n\n“Last month, we dismissed 257 work-site supervisors, and replaced them with new persons. This is to ensure that the scheme works are carried out efficiently,” he said. Department officials said the work-site supervisors were dismissed for poor gathering of workers on time and delay in executing the work.\n\nAs farmers complained that the scheme works were poorly implemented, and there were instances of work being carried out for only 15 minutes, Mr. Singh observed that instances in which adequate work was not carried out has been brought to notice, and hence, 25 per cent of the supervisors were removed.\n\nK. Loganathan, a farmer, said one supervisor was appointed to manage 200 persons. “Overseers do not visit the work site, and the scheme is going to face complete failure due to poor implementation,” he said. To this, the official said one supervisor was posted for 100 workers, and overseers visited the site once every week.\n\nThe farmer also demanded that a flying squad be formed to conduct surprise checks at the work-site.\n\nMurugesan, another farmer, said that qualified persons with technical knowledge can be appointed as work-site supervisors, to which the official said they were willing to take such persons if they volunteered.\n\nLow compensation irks farmers\n\nMany farmers were irked with the Forest Department’s low compensation for crops damaged by animals. Listing out a number of incidents, R. Subash, a farmer, said the forest department had given a compensation of Rs. 5,000 to a farmer whose sugarcane crop raised on 8.5 acres of land in Keezh Kalathur was damaged by wild boars.\n\n“The farmer has lost about 50 tonnes of sugarcane, and what the department has compensated for is a pittance,” he added. The affected farmer K. Venkatrathinam produced the damaged sugarcane to Collector R. Nanthagopal during the meeting. The Collector directed the Forest Department official to look into the case and submit a report.\n\nPurushotaman, another farmer, said about 200 women have raised vegetables organically in Kaveripakkam and surrounding areas. He requested the district administration to provide a vehicle to transport the produce to Vellore and allot a stall in ‘uzhavar sandhai’ to sell the vegetables. To this, the Collector said the produce can be procured by the recently-established farm fresh outlet at Gandhi Nagar.\n\nFund sanctioned for road\n\nOfficials of the Forest Department informed the farmers that the government has sanctioned funds to lay a three-km long road from Kambikollai to Naickaneri.", 
    "section": "national", 
    "title": "257 supervisors dismissed for poor execution of job scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}