{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Ahead of the DMDK’s crucial ‘Turning Point’ rally in Kancheepuram slated for Saturday, one of its key leaders and the wife of the party founder Vijayakant, Premalatha, did not rule out the possibility of the party springing a surprise by floating a new front for the Assembly election. “Maybe” was her response to a question posed by a journalist on the likelihood of the DMDK setting out on its own to head an alliance.\n\nThe DMK-Congress, People’s Welfare Alliance (PWA) and the BJP, which have extended an invite to the DMDK to join their respective alliances, are keenly looking forward to the party’s rally hoping that it might announce its decision there.\n\nHowever, Ms. Premalatha who had recently criticised the DMK-Congress alliance, said since the election dates were yet to be notified, nothing could be ruled out at this stage. “Each party is engaged in discussions. Hence, nothing can be taken as final. Only after the election schedule is notified a clear picture would emerge on the parties and fronts in the fray,” she said.\n\nMs. Premalatha had arrived at Vedal in Kancheepuram to supervise the arrangements for the party’s conference.\n\nMeanwhile, Mr. Vijayakant is expected to solicit the views of the workers on which electoral alliance to be part of for the coming Assembly polls.\n\nSources in the party said that all district secretaries have been instructed to ensure a huge turnout at the meeting. “A strong crowd is important to show our detractors that the DMDK is a force to reckon with and that our base has not eroded. A huge crowd is crucial to send a signal to our potential allies as well,” a party MLA pointed out.\n\nThough the DMK reiterated its invitation to the DMDK on February 13, there has been no formal interaction between the two parties. The BJP too will keenly watch the rally since a negative response from the DMDK could virtually isolate it in Tamil Nadu. A senior leader said the PMK’s uncompromising position on the chief ministerial candidature of Anbumani Ramadoss has hit the prospects of reviving the NDA. “We are still hopeful. The BJP has improved its presence since Lok Sabha elections. We feel an alliance with the DMDK will have a big impact on the elections,” said a party vice president, adding that the theme of DMDK’s rally with its emphasis on “change” provided some hope.\n\nMeanwhile, the PWA wished the DMDK a successful rally. In a statement, the leaders of the PWA said Tamil Nadu was yearning for the emergence of an alternative to the AIADMK and DMK and Mr. Vijayakant was aware of this.\n\nNothing could be ruled out at this stage, says Vijayakant’s wife Premalatha", 
    "section": "national", 
    "title": "Ahead of DMDK meet, Premalatha hints at surprises", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}