{
    "author": [
        "R Srikanth"
    ], 
    "text": "G.O. says group units and multi-storeyed apartments should fix solar plants for ‘common electricity’\n\nuilders and solar plant installers have said that the recent Government Order (G.O.) making it mandatory for group units and multi-storeyed apartments to install solar plants for ‘common electricity’ lacks clarity. Further, homebuyers fear that the cost of installing the plants will be passed on to them.\n\nAnd then, the G.O. is vague about the technical feasibility of installing a solar plant for ‘common’ electricity purposes like staircase lightings, lifts and pumps, pointed out K.E. Raghunathan, managing director, Solkar Solar Industry. He said that in multi-storeyed apartments, common lighting had single-phase connection, while the elevators and pumps worked on a three-phase connection.\n\n“Will two solar plants have to be installed?” asked Mr. Raghunathan, who is a pioneer in the field of solar technology.\n\nHe said the order lacked clarity on issues like use of terrace area, net metering applicability for off-grid (with battery) system and minimum installed capacity of plant according to the number of flats.\n\nHe feared that with emphasis being placed on the terrace area, instead of the technical points, builders might go in for low-cost and inefficient systems.\n\nSurprised\n\nIndustrial experts are also surprised by the omission of Tamilnadu Energy Development Agency (TEDA) — the nodal agency for implementing renewable energy projects of the Central and State governments — in the G.O. Regarding the pricing system, solar distributors point out that there are solar plants of one-kilowatt (KW) starting at Rs. one lakh for on-grid (without battery) or grid-tied, the price of off-grid (with battery) starts at Rs. 1.50 lakh.\n\nPrices remain high\n\nContrary to general perception and despite technological advances, the price of a complete solar plant has not come down over the years. Though there are vendors who can install plants for less than Rs. 1 lakh a KW, they may not last long or many do not come complete with safety and storage features.\n\nP. Ashok Kumar, president of Tamil Nadu Solar Energy Developers Association, said the move by the State government was a positive one and that it would promote the cause of green energy.", 
    "section": "national", 
    "title": "Clarity on solar plant installation sought", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}