{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They include hike in pension, insurance cover and retirement benefits\n\nChief Minister Jayalalithaa on Friday announced a slew of concessions, including a hike in pension schemes and promotion for government employees. In a suo motu statement in the Assembly, Ms. Jayalalithaa said the assistance given to the legal heir of a government employee in the event of death under the family welfare scheme would be increased from Rs 1.5 lakh to Rs 3 lakh.\n\nAccordingly, the monthly amount deducted from the salary of the government employee would be hiked from Rs. 30 to Rs. 60. It would cost the government an additional Rs. six crore.\n\nShe also hiked the sum assured under the group insurance scheme for employees of government-aided schools, nutritious meal scheme, local bodies and village panchayats from Rs. 1.5 lakh to Rs. 3 lakh.\n\nMs. Jayalalithaa said the government would issue an order for regularising the services of employees appointed on compassionate grounds.\n\n“In normal course, those who are appointed on compassionate grounds are eligible for a pay hike and other benefits only after their services are regularised. Since it required the nod of the Tamil Nadu Public Services Commission (TNPSC), regularisation of their services got delayed. The government will issue an order for regularisation of services of those who do not require relaxation of rules. Till the TNPSC’s nod is obtained, they will be treated as temporary employees,” Ms. Jayalalithaa said.\n\nAs far as the employees of anganwadi and nutritious meal scheme are concerned, their monthly pension will be increased from Rs. 1,000 to Rs. 1,500.\n\nThe assistance given to nutritious meal scheme employees at the time of retirement would be increased from Rs. 50,000 to Rs. 60,000.\n\nCooks will get Rs 25,000 as retirement benefit instead of Rs. 20,000. Cooking assistants will also get similar benefits.\n\nMs Jayalalithaa also announced reduction in the service period for engineers in the Rural Development department for promotion.\n\nIn the case of diploma holders, the period would come down from 10 years to seven years.\n\nFor degree-holders the period will be reduced from five years to four years.", 
    "section": "national", 
    "title": "CM announces a slew of concessions for govt. staff", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}