{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Farmers benefitting from Periyar Vaigai irrigation system, mainly those from Melur region, voiced their concern during the grievance day meeting at the Collectorate here on Friday over non-availability of water to harvest their paddy crop in about a month’s time.\n\nSingle-crop farmers of Melur region said that while they need water for another four or five wettings, officials from Public Works Department (PWD) could assure water for only one or two wettings till the end of this month.\n\n“During the last grievance meeting, PWD officials said that they could provide water for 60 days. Now they say it is not possible,” said N. Palanichamy, State president of Tamil Nadu Sugarcane Farmers’ Association.\n\nThe meeting witnessed some heated exchanges between farmers and PWD officials. While officials said that they were doing their best with the available water at combined Periyar credit, the farmers alleged lack of planning and not carrying out maintenance work in canals.\n\n“The primary reason was the delay in releasing water. While combined Periyar credit touched 6,000 mcft in first week of November 2015, water was released only on November 28,” alleged A.N.M. Tirupathi, a farmer from Kulamangalam.\n\nMr. Palanichami, citing a recent order issued by Madurai Bench of Madras High Court on his petition, said that Rs. 4.15 Crore was allowed to lapse in the last financial year by PWD by not carrying out maintenance work in the canals in tail-end regions surrounding Melur.\n\nResponding to the demands, Collector K. Veera Raghava Rao ordered the PWD officials to host a meeting on Saturday with officials from Agriculture department and farmers’ associations to listen to their area specific demands and arrive at the best possible solution with available water.\n\nA section of farmers also urged that Direct Procurement Centres (DPC) during the harvest be opened at the right time unlike the previous season. Pointing out that there were no restrictions in opening DPCs, Collector assured that adequate DPCs would be opened in the places demanded by the farmers.", 
    "section": "national", 
    "title": "Concern over non-availability of water for paddy crop in Melur region", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}