{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "A member of a disability rights group, who has been part of a protest and was admitted to Government Royapettah Hospital on Thursday, left the hospital on Friday and went back to participate in the protest, saying toilets at the hospital were unfriendly.\n\nPrabhu Lawrence, a member of the December 3 movement, was admitted to the hospital on Thursday afternoon, after he suffered an epileptic fit-like episode, he said. “It was very hot yesterday and there were no drinking water facilities at the stadium where we are. At the hospital, they put me on a drip and took blood tests. They said my blood pressure was high,” said the 33-year-old.\n\nMr. Lawrence said the toilets at the hospital were very unfriendly. “I could not use the toilet there. There was no water in it. There was a toiled marked for the disabled but it was locked. I decided that instead of facing difficulties at the hospital, I may as well face them at the protest venue, and left,” he said.\n\nMr. Lawrence, who said he is part of the Chennai Eagles Wheelchair Basketball group, has a spinal cord injury and uses a wheelchair. The injury occurred when he fell while painting a roof in 2006, he said.\n\nAnother protester Rajaram, is still at Government Royapettah Hospital. A senior official of the hospital said toilets were well-maintained but necessary arrangements would be made to ensure they were disabled-friendly.\n\nProtest continues\n\nDisability rights activists said Rajarathinam stadium, where they are at present, also did not have disabled-friendly toilets. “It has been very difficult for all of us, especially the women,” said T.M.N. Deepak, State president of the December 3 movement, one of the four organisations involved in the protest. “The re-construction of this stadium began only some years ago. Why was it not made disabled-friendly then,” he asked.\n\nS. Nambu Rajan, State general secretary, Tamil Nadu Association for the Rights of All Types of Differently Abled and Caregivers, said another organisation, the College Students and Graduates Association of the Blind was also now supporting the protest.\n\nA police officer at the scene said the protesters were not detained, and had been free to go since Wednesday night.\n\nThe toilet had no water and could not be used, says an activist", 
    "section": "national", 
    "title": "Disabled activist protests unusable toilets at hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}