{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Direct procurement centres (DPCs) for paddy have been opened in Palani and Athoor blocks for the convenience of farmers, according to Collector T.N. Hariharan.\n\nAddressing the farmers’ grievance day meeting held here on Friday, he said that the DPCs had started functioning at Chitharevu, Chithaiyankottai, Athoor, Ayakudi and Chinna Kalayamputhur villages, some of the major paddy producing centres.\n\nSufficient stock of fertilizers was kept at all Primary Agricultural Cooperative Societies and private fertilizer outlets, he added.\n\nPublic Works Department officials said that 30 per cent of the total 91,488 irrigation wells had water that could be pumped for four hours, 40 per cent of wells had water that could be pumped for two to three hours and remaining wells had water that could be pumped for less than two hours.\n\nFifty per cent of irrigation tanks had full storage and 30 per cent of the tanks had water up to half of their total storage capacity and the storage was poor in the remaining wells.\n\nThe farmers said that 100 chaff cutters allotted for Dindigul district were not sufficient to meet the growing demand.\n\nWhen Animal Husbandry Department officials said that preventive medicines would be administered to all cattle in the district, the farmers wanted to know how they would implement the plan with shortage of hands.\n\nThe officials said that Aavin officials would be roped in for this task.\n\nDPCs in Theni\n\nEfforts were on open more procurement centres at Chinamanur and Uthamapalayam.\n\nThe DPCs had already started functioning at Jeyamangalam and Cumbum, said Collector N. Venkatachalam, while addressing the farmers’ grievances day meeting in Theni on Friday. He advised sugarcane growers to cultivate high-yielding varieties. A bridge would be constructed across Vaigai river near Amachiapuram, he said.", 
    "section": "national", 
    "title": "DPCs for paddy in Palani, Athoor blocks", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}