{
    "author": [], 
    "text": "SALEM\n\nThe Hindu Business Line and ICICI Prudential Mutual Fund: Programme on ‘Begin your financial journey with a sound investment in knowledge’, Hotel Cenneys Gateway, 6.30 p.m.\n\nThiagarajar Polytechnic College: NSS Special camp, Sarkar Kollapatti village, 10 a.m.\n\nKnowledge Institute of Technology: Department of EEE conducts 6{+t}{+h}national level technical symposium, ELKRAFT 2K15, R. Ravindran, Assistant Section Manager – HRD, CP Aquaculture (India) Private Limited, Chennai, chief guest, 9.30 a.m.\n\nV.M.K.V. Engineering College: Campus recruitment drive by Agaram Info Tech, Chennai, 9.30 a.m.\n\nAVS College of Technology: Inauguration of Project Expo 2016 by R. Dinesh Kumar, Senior Deputy General Manager, Ramco Cements Limited, K. Rajavinayagam, Secretary of the college presides, 9.30 a.m.\n\nSri Ganesh College of Education: Inauguration of Science Club, 10.30 a.m.\n\nNarasus Sarathy Institute of Technology: State level Inter School-College Chess tournament, 9.30 a.m.\n\nSona College of Technology: Department of MCA conducts national level technical symposium, CYBERTALK 2K16, F. Israel Inbaraj, General Manager – HR, Tata Consultancy Services, Bengaluru, 9.30 a.m.\n\nRamakrishna Mission Ashrama: Discourse, Narai S. Nellaiappan speaks on Swami Akhandananda’s life, Ashrama premises, 7 p.m.\n\nDistrict Employment Exchange: Free coaching camp for the candidates appearing for TNPSC VAO examinations, 10 a.m.\n\nTangedco: Salem Electricity Distribution Circle, power consumers grievances day meeting, R. Manivannan, Superintending Engineer, presides, officer of the Executive Engineer, Vazhapadi, 11 a.m.\n\nNAMAKKAL\n\nMuthayammal Engineering College, Rasipuram: Department of Mechanical Engineering conducts 11{+t}{+h}national level technical symposium, MECHSYM’16, M.V. Ravinder, Associate vice president – Technical Head, Indian Piston Rings, Chennai, chief guest, K. Gunasekaran, Secretary and Managing Trustee, Muthayammal Educational Trust and Research Foundation, presides, 9.30 a.m.\n\nMahendra Arts and Science College and Nehru Yuva Kendra: District Rural Arts Festival, Vijay Krishnaraj, Actor and Director, chief guest, M.G. Bharathkumar, Chairman, Mahendra Institutions, presides, 9.30 a.m.\n\nSengunthar College of Engineering, Tiruchengode: National Science Day celebrations and Inauguration of VINGNANS’ Club, T. Jayamurugan and K.P. Suresh Kumar, State Resource Persons, Tamil Nadu Science Forum, chief guests, A. Baladhandapani, Secretary and Correspondent, Sengunthar Institutions, presides, 10 a.m.\n\nPGP College of Engineering and Technology: Department of Computer Science and Engineering organises seminar on Dot Net, Alagesan, Senior Software Programmer, HCL, Chennai, resource person, 2 p.m.\n\nERODE\n\nKongu Engineering College: Inauguration of Business Cell of MBA Department by R. Rajkumar, Managng Director, Chennai Gate Rice Industries (P) Ltd., 2.00 p.m.; FECTRA 2K16 - National-level Technical Symposium by ECE Department's IETE Student Forum, 9.00 a.m.\n\nM.P. Nachimuthu M. Jaganathan Engineering College: TrenTech 2 K'16, inauguration by B. Somasundaram, Manager - Plant Engineering, 2F Wind Power (P) Ltd., Coimbatore, 9.30 a.m.\n\nShree Venkateshwara Hi Tech Engineering College: 'Vasippom Suvasippom' and Skill Development Programme, 9.30 a.m.\n\nNandha College of Technology: Student Development Programme on ‘Design of Robotics’, 10 a.m.; Students’ Empowerment Programme, 10 a.m.; Hands-on Training on PCB Designing, 10.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}