{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former Tamil Nadu Director-General of Police K. Ramanujam on Friday dismissed reports that he had “tortured” N. Harish, the young IPS officer who was found dead in the police officers mess here on Thursday.\n\nIn a statement issued here, Mr. Ramanujam, who is the Tamil Nadu Chief Information Commissioner, said he remembered Harish as a soft-spoken and timid officer.\n\nDescribing messages being circulated on the social media that he had tortured the officer and was a stumbling block for his promotion as ridiculous, he said Harish was not able to get a promotion because he did not pass the test in Tamil language.\n\n“One has to clear the test for getting senior scale in this cadre. I had nothing against him personally. I retired more than a year back and I do not know whether he cleared the examination or not afterwards. There were some other issues about which I do not want to elaborate as I wish to avoid making him the centre of any unnecessary discussion that will be disrespectful to a departed soul,” he said.\n\n‘Not dealing with\n\nASPs much’\n\nMr. Ramanujam said as DGP of the State he was not dealing with ASPs much.\n\n“There are four layers between an ASP and DGP. And in a big State like Tamil Nadu, daily or weekly or even monthly interactions with ASPs do not take place...And what motive could I have to single out Harish and torture him, denying him promotion while others got it,” he asked\n\nThe former DGP said he was in fact sympathetic to Harish.\n\n“When he was going through some trouble, I did make a senior IPS officer of the cadre hailing from Karnataka to speak to Harish, who is also from the same State. He was escorted home at least once,” he said.\n\nK. Ramanujam said he was in fact sympathetic to Harish when he was in trouble", 
    "section": "national", 
    "title": "Ex-DGP denies torturing young IPS officer", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}