{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Summer is still a few days away, but Chennai is already beginning to feel the heat as day temperature is slowly climbing to above-normal temperature.\n\nFor the past few days, the day temperature has been hovering one or two degrees Celsius above the normal of 30.5 degrees Celsius.\n\nOn Friday, Nungambakkam recorded 31.7 degrees Celsius and the suburbs had warmer weather with the observatory in Meenambakkam registering 32.6 degrees Celsius.\n\nOfficials of the Meteorological Department said the dry weather would continue over the State for the next few days. There may be small variations in temperature level.\n\nThe minimum temperature slowly increases to 22 -24 degrees Celsius during mid-February, heralding summer.\n\nPeople who are outdoors may feel more heat due to the clear skies.\n\nThe city is likely to experience this weather for two to three more days with the day temperature remaining over 32 degrees Celsius. In the past two months, Chennai had more of a warm winter as the minimum temperature did not dip below 20 degrees Celsius.\n\nHowever, Meenambakkam had more chilly days with the night temperature dropping to up to 18.9 degrees Celsius on one or two days.\n\nLast year, the minimum temperature had dipped to 20.8 degrees Celsius on February 25.\n\nThe city experienced the coldest day in February this century on February 12, 1934, with the minimum temperature plummeting to 15 degrees Celsius.\n\nMeanwhile, weather bloggers note that city residents may have to brace for a hot summer as there is the likelihood of both the day and night temperatures hovering above average for many days till May.\n\nK. Srikanth, who blogs with Chennaiyil Oru Mazhaikkalam, says several weather models indicate that the chances of having summer rains are slim.\n\n“There may be many other reasons, including global warming, for the warm weather.\n\n“But, we cannot rule out the El-Nino effect that assisted in increase in temperature by at least two degrees owing to high ocean temperatures,” he said.", 
    "section": "national", 
    "title": "February getting warmer in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}