{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Diabetes centre to tie up with 132 CBSE schools under its ‘Chennai Slim and Fit Programme’\n\nThe M.V. Hospital for Diabetes, Royapuram, is planning to scale up an initiative along with the Central Board of Secondary Education (CBSE), to fight childhood obesity in schools.\n\nVijay Viswanathan, head and chief diabetologist at the hospital, said the ‘Chennai Slim and Fit Programme’ was designed in compliance with the Comprehensive School Health Manuals provided by the CBSE.\n\nIn 2009, a study was conducted by the hospital, funded by the State Bank of India, to evaluate the effectiveness of the implementation of these manuals among schoolchildren by training teachers.\n\nThe study, which looked at 1,193 schoolchildren in seven CBSE schools, revealed that 22 per cent of the girls and 13.5 per cent of the boys were overweight. “But we found that when teachers were trained, the manual’s guidelines were implemented and this led to a reduction in body mass index (BMI), body fat percentage and diastolic blood pressure as well as better eating habits,” he said.\n\nAnd so, over the next two years, the hospital will help 132 CBSE schools in Chennai through a ‘training of trainers’ programme for teachers to be held in four zones: Mylapore, Perambur, Kilpauk and Anna Nagar, said Dr. Viswanathan.\n\n“We will work with the school Principal, the physical training teacher and the science teacher. Through this, we are looking at effective implementation of the health manual. We will also follow up with the schools,” he said.\n\nThe health manual, a CBSE schoolteacher said, was available but was not gone through very regularly. “We are hoping that this manual, which has guidelines for children across all age groups on health, will be taken up across all schools in Tamil Nadu,” said Dr. Viswanathan.\n\nChildhood obesity, Dr. Viswanathan said, could lead to a host of long-term problems, including higher blood pressure and higher cholesterol levels and make children prone to diabetes.\n\n“It used to be a problem in the developed world but now it is increasingly a problem in India,” he said. Genetic, physiological, medical, environmental and dietary factors can all lead to a child becoming overweight or obese, he said. Doctors have long called for dietary changes and increased physical activity to battle obesity.\n\nA 2009 study of 1,193 schoolchildren in classes III, VII and XI of seven CBSE schools found that:\n\n22 per cent of girls were overweight\n\n13.5 per cent of boys were overweight\n\nImplementation of Comprehensive School Health Manual led to:\n\nReduction in body mass index (BMI)\n\nReduction in body fat percentage\n\nReduction in calorie intake\n\nDecrease in diastolic blood pressure", 
    "section": "national", 
    "title": "Fighting obesity among schoolchildren", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}