{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Government employees staging a protest on the Collector's office complex in Dindigul (left) and Ramanathapuram onFriday.— Photos: G. Karthikeyan and L. Balachandar\n\nGovernment employees staging a protest on the Collector's office complex in Dindigul (left) and Ramanathapuram onFriday.— Photos: G. Karthikeyan and L. Balachandar\n\nMembers of Tamil Nadu Government Employees’ Association, including a large number of noon meal and anganwadi workers, continued the sit-in strike for the second day at the Collectorate here on Friday.\n\nA group of employees who stayed overnight left in the morning while another group continued the stir. S. Ganessamoorthy, district secretary of the association, said that they would continue the agitation till the State body announced a decision after a meeting in Chennai on Saturday.\n\nThe state body, which convened an emergency meeting of the executive and struggle committee, would discuss announcements made by Chief Minister Jayalalithaa on the floor of the Assembly with regard to the demands and expected to announce whether to continue the sit-in strike or change the mode of agitation, he said.\n\nSivaganga\n\nMore than 2,500 employees, including a large number of women, continued the protest on the Collectorate complex in Sivaganga. Office-bearers of the association cooked food and served to the striking employees, though most of the women brought lunch from home.\n\nDindigul\n\nState government employees continued their sit-in strike for the second day on the Collecorate premises here on Friday.\n\nThey raised slogans demanding implementation of old pension scheme and ridiculed announcement on constitution of panel to sort out issues faced by them.\n\nTheni\n\nHundreds of employees stayed put on the Collectorate campus on Friday.", 
    "section": "national", 
    "title": "Government staff continue stir", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}