{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "unrelenting:Government employees staging protest on the Collectorate premises in Thoothukudi (left) and under the shade of two-wheeler stand in Nagercoil on Friday.— Photo: A. Shaikmohideen\n\nunrelenting:Government employees staging protest on the Collectorate premises in Thoothukudi (left) and under the shade of two-wheeler stand in Nagercoil on Friday.— Photo: A. Shaikmohideen\n\n“Announcement on contributory pension scheme under Rule 110 an attempt to hoodwink us”\n\nAfter staying put on the Collectorate premises here overnight, government employees and teachers continued their indefinite agitation on Friday.\n\nAmid addresses by office-bearers of associations of government employees, teachers, anganwadi workers and organisers, slogans were raised to highlight their demands.\n\nS. Paulraj, district president, Tamil Nadu Primary School Teachers’ Federation, said that Chief Minister Jayalalithaa’s announcement in the Assembly on contributory pension scheme under Rule 110 on Friday was an attempt to hoodwink the protesters. The government’s announcement on forming an expert committee for reverting to the earlier pension scheme at the fag end of the term was nothing but an attempt to cheat its employees.\n\nIn Tirunelveli Medical College Hospital, nurses staged a demonstration seeking time-bound promotion, abolition of consolidated pay scheme and regularisation of services of those appointed on consolidated pay.\n\nThey discharged their duties by wearing black badges after the demonstration.\n\nThoothukudi\n\nWith the sit-in protest on the Thoothukudi Collectorate premises continuing for the second day, the agitating employees said that the strike would be withdrawn only when the government conceded their demands.\n\nL. Ramamoorthy, district president, Tamil Nadu Government Employees Association, who led the agitation, said that around 800 employees took part in the protest.\n\nAs many as 6,700 State government employees and teachers were on strike across the district, he said.\n\nKanyakumari\n\nOver 500 employees, majority of them women, continued the sit-in strike under the shade of the two-wheeler stand on the Kanyakumari Collectorate campus in Nagercoil.\n\nAs the crowd surged, the TNGEA sought permission to put up a shamiana near the main entrance but it was denied by the police team, led by Deputy Superintendent of Police Khader Basha, which confined them to the two-wheeler stand.\n\nOffice-bearers of the TNGEA had a heated argument with the DSP following which tension prevailed for some time at the main entrance.\n\nThey withdrew their sit-in strike in the evening.\n\nBbut any decision on the withdrawal of the indefinite strike would be taken by the State office-bearers in Chennai on Saturday, said C.R. Jayakumar, district secretary of TNGEA.", 
    "section": "national", 
    "title": "Government staff continue strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}