{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Friday directed the Dindigul Collector to appoint a Special Public Prosecutor as per the choice of the father of a Dalit priest, who ended his life under alleged pressure from political bigwigs.\n\nState Finance Minister O Panneerselvam’s brother O Raja, who is also the Chairman of the Periyakulam Municipality, has been named an accused in the case.\n\nJustice S. Vaidyanathan passed the order while allowing a plea moved by N. Subburaj, father of Nagamuthu the priest.\n\nThe petitioner said Nagamuthu had been performing puja in a temple in Periyakulam for several years, which was objected to by Raja and others on the ground that he belonged to Scheduled Caste community.\n\nAs the legal recourse taken by Nagamuthu failed to save him from the atrocity, he committed suicide on December 7, 2012, leaving a note mentioning seven persons, including Raja, as the cause.\n\nNagamuthu’s father moved the High Court and got the trial in the case transferred from the District Sessions Court, Theni, to Dindigul.\n\nRepresentation to Dindigul Collector\n\nSubsequently, he made a representation to the Dindigul Collector to appoint advocate B.B. Mohan of Erode as a Special Public Prosecutor to conduct his son’s case.\n\nBut the request was rejected by the Collector. Assailing the order, Mr. Subburaj approached the Madurai Bench of the High Court.\n\nOpposing the plea, the authorities contended that the petition could not be allowed as in every trial before a Court of Sessions, the prosecution is conducted by a public prosecutor alone.\n\nRefusing to concur with the submissions, Justice Mr. Vaidyanathan said, “The SC/ ST Act aims at putting to an end to untouchability and therefore, harmonious consideration of the Rule is mandatory. If the contentions of the authorities are accepted, the very purpose of its enactment would get defeated.”\n\nThe judge then directed the Collector to appoint the advocate of the petitioner’s choice as a Special Public Prosecutor in 15 days.\n\nHe then directed the Principal Sessions Judge, Dindigul to conduct the case on day-to-day basis without adjourning the matter beyond two working days.", 
    "section": "national", 
    "title": "HC asks Collector to appoint SPP chosen by priest’s father", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}