{
    "author": [
        "R Sivaraman"
    ], 
    "text": "P. Kannan greeted leaders and MLAs of Puducherry unit\n\nFormer MP P. Kannan and other AIADMK MLAs at the AIADMK party office in Puducherry. - Photo: T. Singaravelou\n\nFormer Member of Parliament P. Kannan, who has recently joined AIADMK stated on Friday that his exit from the Congress was to align with a force that would “relieve the people of Puducherry from sufferings”.\n\nThe veteran leader and former Rajya Sabha MP, Mr. Kannan had joined the AIADMK last Sunday in the presence of Tamil Nadu Chief Minister and AIADMK general secretary Jayalalithaa in Chennai. Having joined the party here, Mr. Kannan came to the party office along with his supporters and greeted leaders and MLAs of Puducherry unit.\n\nThough Mr. Kannan was keen to ensure that he did not leave out anyone while greeting AIADMK leaders , the Puducherry unit secretary and leader of Legislature party P. Purushothaman left the place in a huff.\n\nThanks Jayalalithaa\n\nSpeaking on the occasion, Mr. Kannnan thanked the party general secretary Ms Jayalalithaa for having enrolled him in the party. He said all cadres, functionaries, leaders in unison would strive for the party to blossom in the Union Territory.\n\nHe assured them that he would work hard to establish the AIADMK rule.\n\nLater talking to reporters, he said by the time, the message of Tamil Nadu Chief Minister Ms. Jayalalithaa becoming Chief Minister again in Tamil Nadu would be reaching here, the AIADMK rule would blossom in Puducherry also. “We are hopeful of that. Even people are hopeful that AIADMK will definitely win in UT. It is our duty to tap such a wave,” added Mr. Kannan.\n\nMr. Kannan started his political career as a Youth Congress volunteer and rose to become its president. He was a minister in UT and a Rajya Sabha MP representing the Congress party.\n\nSpelling out the reasons behind joining the AIADMK, the former veteran Congress leader said he made his move following the suggestion of his supporters and people.\n\n“I took the decision with a clear conscience. I am not for any gain. It is my dream of that we should unitedly work to bring AIADMK rule ”, said Mr. Kannan.\n\nHe further added that his role in the party and poll strategy would be decided after his next meeting with the party leader.\n\nEmployment opportunities\n\nMr. Kannan solemnly promised, “We will create employment opportunities to several thousand youth, if the AIADMK comes to power. We promise that women will be protected and given employment opportunities. Criminals almost all educated women will be given employment. Full protection will be given to women and criminals will be handled with an iron hand.", 
    "section": "national", 
    "title": "Joined AIADMK to ‘relieve people of sufferings’: Kannan", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}