{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Pradosha puja, Railway Colony, 4.30 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh Study Circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvadavur Puranam’ by S. Kunjithapatham, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nRamakrishna Mutt: Discourse on ‘Acharyargal Vaibhavam’ by Lavanya Jayaram, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: Discourse on ‘Bhagavad Gita’ by Swami Sivayogananda, 3 American Mission Lane, Kamarajar Salai, 6.45 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nCULTURE\n\nTiruvalluvar Mandram: Talk by Nirmala Mohan, Sakthi Velammal Nagar, S, S, Colony, 4.30 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nKadambavanam: Tamil value camp for students of Kamban Karpagam School, Karaikudi, Parali, 8 a.m..\n\nGENERAL\n\nFatima College: Shailesh Kumar Yadav, Police Commissioner, declares 63{+r}{+d}annual sports meet open, 8.30 a.m.; K. Samidurai, secretary, Indian Association of Lawyers, distributes prizes, Mary Land, 11 a.m.\n\nVelammal College of Engineering and Technology: State-level mathematics model presentation contest for school students, Viraganur, 8.30 a.m.\n\nEmployability Bridge: ‘Flag,’ an initiative to increase job access to non-metro students, Emmanuel Justus, CEO, addresses, Vickram College of Engineering, Enathi, 10.30 a.m.\n\nM.S. Chellamuthu Institute of Mental Health and Rehabilitation: G. Gurubharathy speaks on “Fundamentals of counselling,” 14 Vaidyanatha Iyer Street, Shenoy Nagar, 10 a.m.\n\nMaria Nursery and Primary School: Graduation Day, E. Georgina Jaquline, Principal, Noyes Matriculation Higher Secondary School, addresses; Rani Chakravarthi, child psychologist, declares annual sports meet open, Tamil Nadu Theological Seminary, Arasaradi, 3.30 p.m.\n\nNehru Yuva Kendra: District youth convention for national unity in celebration of 125{+t}{+h}birth anniversary of B.R. Ambedkar, S. Satheese, zonal director, presides; K. Veera Raghava Rao, Collector, releases Dr. Ambedkar handbook and Vijendra Bidari, Superintendent of Police, distributes sports materials, Gandhi Museum, 12 noon.\n\nDalit Liberation Movement: Meeting on Dalit movements’ approach to Assembly election, Tamil Nadu Theological Seminary, 10 a.m.\n\nMadurai Management Association: National Management Day celebration, Hotel Sangam, Alagarkoil Road, 10 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: 30{+t}{+h}All India Ideal Home Exhibition, Tamukkam Ground, 11 a.m.\n\nBell Jumbo Restaurant: Food festival, PP Chavadi, 6 p.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar, 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}