{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Fast Track Mahila Court here convicted a 38-year-old man and sentenced him to undergo life imprisonment for murdering his wife suspecting her fidelity.\n\nHolding that the prosecution proved the case beyond reasonable doubt, Sessions Judge, Mahila Court, M.P. Ram awarded the sentence to Andi alias Ananad and imposed a fine of Rs. 20,000 on him on Thursday. He should serve a jail term for three more years if he failed to pay the fine, the judge said.\n\nIf he had suspected the fidelity of his wife, the accused could have left her, but though she was loyal to him, he had murdered her, a mother of two children. After inflicting cut injuries on both her legs, he had pushed her down with face up, sat on her and strangulated her to death, using a sari, the judge said.\n\nAndi who was present in the court pleaded that he be awarded lesser punishment as he had to take care of his two children, but the judge said that no leniency could be shown to him.\n\nAfter the judge pronounced the sentence, Andi was taken to Madurai Central Prison.\n\nTwo days after the murder on June 16, 2013 at Agasthiayarkoottam, police arrested him and since then he had been incarcerated in the district jail here.\n\nThe prosecution case was that he started suspecting the fidelity of his wife Malairani (30) after she arranged two sureties from the village to secure his release on bail after he was arrested for stabbing a police constable while travelling on a bus a couple of months before the murder. He quarrelled with her frequently and even cut her ear a few weeks before committing the murder, Special Public Prosecutor M. Jayakodi said.\n\nShe said that the prosecution presented 18 witnesses, including the 14-year-old son and 10-year-old daughter of the deceased, and 21 material documents to fortify the case.\n\nThe deposition of the two children, who were witness to their father dragging their mother inside the house before committing the murder, turned out to be crucial in the case, she said.", 
    "section": "national", 
    "title": "Man gets life term for murder of wife", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}