{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Manufacturing units should focus on innovation and on improving the reliability of the products, according to N. Muthukumar, president and whole time director of Automotive Axles.\n\nHe was speaking at a conference on “Pump Industry – Global Perspective” organised here on Friday by Confederation of Indian Industry (CII), Southern India Engineering Manufacturers’ Association (SIEMA), and Indian Pumps Manufacturers’ Association. ppearance of the product, cost, and reliability are important, he said. Several multinational companies have taken “half cost achievement” as a challenge. They innovate and bring down costs in manufacturing.\n\nFurther, companies are able to achieve world class standards by creating a value system for the organisation. Every organisation should have a value system for people, products and the brand, he said. Mr. Muthukumar later told The Hindu that with Government spending on defence increasing every year, opportunities are more for the domestic manufacturing sector. Industries need to focus on quality and reliability. In Mysuru, the CII organised an event with ISRO recently and some micro, small and medium-scale enterprises (MSMEs) bagged orders.\n\nThe cost of spares that are imported is 40 per cent higher than the locally manufactured ones. MSMEs can supply the spares and components.\n\n“Today, quality is must and reliability is an advantage,” he said.\n\nWith the advantage of a huge captive market, Indian manufacturing units should focus internally, cater to the domestic market and look at exporting at least 20 per cent of production. Companies should innovate and look at technologies that are affordable, he said.\n\nAccording to Bharat B Patel, president of IPMA, the demand for domestic pumps has improved slightly.", 
    "section": "national", 
    "title": "Manufacturing units urged to focus on quality", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}