{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Top) A view of the stalls at the ‘Water Sustainability and the Fair Trade Market’ organised by the All for Water for All in association with the Fair Trade Twin Towns at the Gandhi Thidal in Puducherry on Friday. Some of the products on display at the craft bazaar.— Photos: S.S. Kumar\n\nOrganisations engaged in sustainable business practices put up stalls at the Craft Bazaar\n\nBags and clothes made of organic cotton, organic tea products, spices and food grains were exhibited at the Water Sustainability and Fair Trade Market in Puducherry, organised by Fair Trade Twin Towns Puducherry and Auroville, on Friday.\n\nPuducherry and Auroville had signed up the first Fair Trade Twin Towns in the world, joining 1900 other Fair Trade Towns all over the world. “It is about being socially responsible and building the society and business together,” said Uma Prajapati, director, Upasana Design Studio, Auroville.\n\nDevina Singh, campaigns and outreach coordinator, Fairtrade India, added: “The fair trade market is to evolve ethical trade that is non-exploitative. We ensure that the producers’ associations and manufacturers of the products do not engage in child labour practices and not use pesticides or chemicals. The market involves the farmers and they form the board members of the producers association.”\n\n“A Fair Trade Town means that people of these towns would be given the option to make fairer choices in their daily lives, their morning cup of tea would support the tea plantation workers in getting fairer wages and their clothes would support the cotton farmers of our country in getting a fair price for their cotton,” she said.\n\nBesides, the school and universities will teach the future generation how their food and trade systems work and how to incorporate social responsibility in their future professions.\n\nThe event, themed on ‘Water Sustainability and the Fair Trade Market’ was organised by the All for Water for All in association with the Fair Trade Twin Towns.\n\nAll for Water for All is organising the water festival to involve and engage all stakeholders, children, farmers, rural and urban population for integrated water resource management for a sustainable future.\n\nMany sustainable and fair trade organisations from different parts of the country have put up stalls at the Craft Bazaar. A wide range of products from fair trade including tea, spices, clothing, bags, bed sheets are available at this market. “This is to show how profitable self-sustainable businesses could be set up in any sector of trade. Also, to promote ethical trade, transparency and sustainability for people, planet and profit,” said Devina.\n\nAt the stalls, you will findFairtrade India certified products like Oothu tea that supports the fair trade plantation workers in The Nilgiris, and international Pukka tea, along with PDS spices from Kerala. There are stalls with WFTO certified organisations that have products like beautiful block printed bed sheets and bags.\n\nYou can also find Mandala Apparels, which is certified, by both Fairtrade International and World Fair Trade Organisation, offering clothes for small children. The founder of this Pondicherry based organisation, Anjali Schiavina has been fair trade certified since 2008 and employs 220 women and supports 600 farmers through her transparent supply chain.\n\nAll the organisations at this market share a vision to endorse and promote ethical trade, transparency and sustainability for people, planet and profit. They are here to espouse the objective of establishing a conscious and responsible green consumer base for sustainable, organic and fair trade products in the twin towns of Puducherry and Auroville.\n\nIn essence, all participant of the fair trade organisations at the market will have answers to two very important questions Fair Trade Twin Towns has been asking the people of Puducherry and Auroville, ‘Who Grew Your Food?’ and ‘Who Grew Your Clothes?’", 
    "section": "national", 
    "title": "Marrying fair trade and organic ware", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}