{
    "author": [
        "K Raju"
    ], 
    "text": "Pilot project to be implemented in Salem, Dharmapuri districts\n\nNational Bank for Agriculture and Rural Development (NABARD) has plans for digitisation of all self-help groups in two districts as a pilot project for easy access to wide range of financial services and to ensure transparency in the SHGs and their financial transactions, quick credit appraisal and disbursement, according to K. Venkateswara Rao, Chief General Manager, NABARD.\n\nTalking to The Hindu at Dharmathupatti village near here on Thursday, he said that Salem and Dharmapuri were identified for implementing this pilot project. Data of all SHGs and their members in these districts would be created.\n\nIndividual data linking their Aadhar and mobile numbers would also be included. All the data would be available in the mobile sets or tabs of SHG members. The members and groups would update all their transactions periodically.\n\n“Banks would be given viewing rights of their activities. Such measure would help banks view the groups’ activities and sanction loans through their branches quickly,” he added.\n\nDigitisation software would be developed in regional languages. Ultimately it would benefit rural members of the SHGs. In 1993, Tamil Nadu had just 500 groups. Now it had 9.5 lakh groups, he said.\n\nNABARD also planned to launch livelihood entrepreneurship development project in Kanyakumari, Pudukottai and Cuddalore in Tamil Nadu and Puducherry in order to generate better livelihood activities of the poor.\n\nA total of 142 farmer producer organisations (FPOs) had started functioning in the State, of which 45 had registered as companies and the remaining were at various stages. '\n\n“Initially, we had planned to set up 162 FPOs in the State. The FPOs will reduce middlemen in marketing and enhance profit margin of the farmers,” Mr. Rao noted. A special fund would be sanctioned by the Centre to each FPO on a par with their capital amount.\n\nMoreover, the Centre would offer Rs. 1 crore credit guarantee to the FPOs. NABARD had funded four FPOs in Salem, Nagapattinam and Tiruvannamalai districts as pilot projects.\n\nMoreover, NABARD had planned to invest Rs. 1.71 lakh crore in priority sector in the next fiscal.", 
    "section": "national", 
    "title": "Now, NABARD plans digitisation of SHGs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}