{
    "author": [
        "M K"
    ], 
    "text": "Robots clashing for the championship at Anokha 2016 in Coimbatore on Friday.\n\nA clash of metal wrestlers of various shapes and sizes in ‘Robo Warz’ was the crowd-puller on the second day of the three-day technical-fest Anokha 2016 at Amrita University on Friday. This miniature version of the English movie ‘Real Steel’ was organised for the fifth year in succession.\n\nRobots weighing between 3.6 kg and over 40 kg clashed in the league to showcase their muscle and mettle in a metal-fenced arena. Students occupied the veranda of the two-storied building to watch the clash that went on for hours.\n\nWorkshops\n\nA series of workshops and interesting competitions were the highlights of the festival on Friday. Code Wars, an online nationwide contest for techies, Circuit Casino, where circuit designing skills were tested and Grand Design Challenge to evaluate innovative functional and ergonomically designed products were among them.\n\nLe Selfie, a spot competition where participants had to click selfies with nature, Paralanding to make creative models of parachute that can make a slow but safe landing with a given payload and Fix Them Up to assemble over 50 dismantled components of a machine were among the other events.\n\nInspiring talks\n\nOn the non-technical front the most important and interesting event of the day was the ‘Lumiere’ distinguished talk series in which inspirational speeches and success stories were shared by successful persons from different walks of life. This is the second year of the distinguished talk series.\n\nEminent speakers of the event this year were environmentalist Arun Krishnamurthy, open water swimmer Bhakti Sharma, vice president of design at Snapdeal and front man of popular Carnatic Progressive rock band Agam Harish Sivaramakrishnan and Founder and CEO of Banyan Nation Mani Vajepeyajula.\n\nPost-serious stuff, students had fun at the laser tagging event where they could shoot opponents with a laser gun in a dark room, zip line from a building, cross the double rope bridge across a swimming pool and water zorbing, to name a few.\n\nThe second day concluded with a spectacular music performance by Ragasudha club of Amrita University.", 
    "section": "national", 
    "title": "On Day 2, robots, budding techies clash at Anokha", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}