{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a dramatic chase, a police team from Vijayanagar nabbed three thieves from Uttar Pradesh on Wednesday while they were trying to burgle locked houses.\n\nA civilian and a sub-inspector sustained minor injuries in the scuffle.\n\nThe police said the men, who visit the city often, have a dozen criminal cases pending against them in Bengaluru.\n\nThey would drive down in a car from Delhi and move around the city, breaking into and burgling locked houses, before flying back to their native.\n\nHowever, their luck ran out this time around as policemen on patrol duty noticed their car moving suspiciously in Pattegarpalya residential area.\n\nThe policemen alerted Assistant Commissioner of Police S.K. Umesh, who along with the police inspectors of Vijayanagar and Kamakshipalya, rushed to the spot to nab them.\n\nMr. Umesh, who led the team, tried to pull out the driver from the gang’s car but the latter, sensing danger, tried to drive away, dragging the ACP along for several feet.\n\nThe gang then tried to run him over but he jumped sideways in the nick of time. The thieves continued to speed away but were intercepted by a second police team a little later.\n\nAttack on police\n\nThe second team had set up barricades to stop the gang from escaping but the men, who were armed, jumped out of the car and began attacking the policemen.\n\nA few passersby rushed to help the police.\n\nIn the melee, sub-inspector Mohan Krishna and civilian Lohith Kumar were injured.\n\nThe policemen eventually managed to overpower the gang and arrest the three men, identified as Arjun Bala (24), Nakul Sardar (22) and Aravinda Kumar (30).\n\nHowever, the gang leader, Khurshid Khan, managed to escape.\n\nThe police have recovered a car, five mobile phones, eight SIM cards and a bunch of weapons from them.\n\nThe men were allegedly involved in at least a dozen robbery and burglary cases in the city between 2006 and 2007, and have several warrants pending against them, Mr. Umesh said.\n\nMeanwhile, a police team has been sent to New Delhi to arrest Khurshid Khan.", 
    "section": "national", 
    "title": "Police chase, nab gang of thieves from Uttar Pradesh", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}