{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Commissioner of Rail Safety issues clearance for running Linke Hofmann Busch carriages\n\nThe newly designed coaches are considered superior in terms of speed, comfort and safety compared to the conventional ones.— File Photo\n\nWith the Integral Coach Factory rolling out seven power cars required to operate Linke Hofmann Busch (LHB) coaches, Southern Railway will now put to use the German-design coaches that are considered superior in terms of speed, comfort and safety compared to the conventional ones. At least 30 LHB coaches worth several crore of rupees were idling in the railway yards for months for want of security clearance and non-availability of power cars.\n\nAfter The Hindu highlighted the issue on February 7, the Commissioner of Railway Safety issued clearance for running the LHB coaches. A couple of days ago, the ICF rolled out seven power cars enabling the zone to operate the new coaches.\n\nAccording to railway sources, officials were working on a plan to operate full LHB rake in the Chennai-Thiruvananthapuram and Chennai-New Delhi (Duronto Express) route.\n\nIt is a policy decision of the railways to migrate to LHB coaches as the high-level safety review committee, led by Anil Kakodkar, recommended stopping production of conventional coaches since they were unsafe in the event of a collision. “Though the Kakodkar committee recommended stoppage of production of conventional coaches and manufacture LHB coaches, coach factories seem to be working the other way.\n\nAt least, 100 new LHB coaches, each worth about Rs. 2.5 crore, manufactured by the ICF for other railways (zones) are stabled in Chennai yards for several weeks now,” a senior railway official said. The official, requesting anonymity, said thieves were targeting electrical fittings in the new coaches that were were losing sheen.\n\nMany coaches would have to be sent to the ICF again for repairs before operation.\n\n“Other railways are not evincing keen interest to take delivery of these coaches. Since there is a shortage of power cars, they cannot operate them too,” he said.\n\nSenior railway officials could not be reached for their comments on why there is a slowdown in the manufacture and use of LHB coaches in Southern Railway, which is the largest coach-holding zone in the country with over 6,500 conventional coaches.\n\nWith growing demand for better comfort in trains, introducing LHB rakes in revenue-generating routes like the Chennai-Madurai and Chennai-Coimbatore sectors would be a welcome move, says a retired railway official. According to him, the unmet demand – meaning the number of passengers who sought confirmed booking and could not be accommodated – was on the rise.", 
    "section": "national", 
    "title": "Power cars ready to run German coaches", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}