{
    "author": [
        "S Ganesan"
    ], 
    "text": "The civic body gets a Rs. 12.99-crore deficit budget for the next financial year\n\nreation of a “green space” at Anna Nagar, promotion of non-motorised transport by creating bicycle tracks on bus route and other interior roads, extension of underground sewer system to uncovered areas, setting up of a sewage treatment plant at Panchapur, and a bio-methanisation plant to generate energy from organic waste at Karumandapam are among the key proposals of the Tiruchirapalli City Corporation Budget for 2016-17.\n\nAs has been the norm in recent years, the corporation presented a deficit budget for the next financial year. The budget estimates, tabled at an urgent meeting of the corporation council chaired by Mayor A. Jaya here on Friday, put the civic body’s total revenue for the next financial year at Rs. 345.66 crore and expenditure at Rs. 358.65 crore, leaving a deficit of Rs.12.99 crore.\n\nHowever, it hopes to make up for the shortfall by ensuring proper tax assessment of residential buildings used for commercial purposes, expansion of civic services, and increasing the number of drinking water and sewage connections.\n\nThe corporation has managed to reduce a substantial portion of the budgetary deficit for this financial year from the budget estimate of Rs. 13.14 crore to Rs. 1.12 crore, said V. Ayyappan, chairman, Standing Committee on Taxation and Finance, tabling the revised estimates and Budget 2016-17 at the council.\n\nThe civic body will depend heavily on the devolution of funds from the State government and assistance from the Centre as nearly 58 per cent of its revenue receipts going towards salary and pension payments. Property tax will contribute 20 per cent of its revenue.\n\nAMRUT\n\nThe corporation is anticipating substantial funding under the Atal Mission for Rejuvenation and Urban Transformation (AMRUT). After toying with various ideas to develop the corporation grounds at Anna Nagar in Thennur, the civic body has unveiled a plan to set up a “green space” at the ground with children’s amusement area and other leisure amenities at a cost of about Rs. 2.14 crore with funding from the central scheme.\n\nSeeking to give a push for non-motorised transport, the civic body has planned to create bicycle tracks and pedestrian walkways in major bus route and interior roads at an estimate of Rs. 17.76 crore. The corporation is expecting 50 per cent funding for the initiative under AMRUT and 45 per cent from the Infrastructure and Gap Filling Fund.\n\nThe civic body has proposed to seek AMRUT funds for extension of the underground sewer system to the uncovered areas in the city. However, the extent of the area covered or the investment required has not been indicated.\n\nAlternative energy\n\nThe corporation will seek to tap alternative energy sources and another gasifier based crematorium has been planned at Ambedkar Nagar burial ground at a cost of Rs. 1 crore, with 80 per cent grant from the State government. A bio-methanisation plant to generate energy from organic waste would be set up at the Karumandapam gasifier crematorium at a cost of Rs. 45 lakh.\n\nThis apart, bio-digester has planned to be set up at the Integrated Child Development Scheme centre near Woraiyur market at a cost of Rs. 25 lakh.\n\nAnother major initiative would be the move to set up a sewage treatment plant at Panchapur to recycle waste water under private-public partnership mode. A project report is being prepared by a private consultant.\n\nTwo pedestrian sky-walks, one at Chathram Bus Stand and the other at Melapudur, would be established at an estimate of Rs. 1.99 crore. The Parson Garden, Mahalakshmi Nagar, Venkateswara and Visranthi Woods Parks would be taken up for development during the next financial year. The council will take up the budget for discussion on February 23.", 
    "section": "national", 
    "title": "Priority for green space, clean transport", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}