{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Hamlets in Kancheepuram, Cuddalore and Tiruvallur districts hit by lack of connectivity\n\nResidents of Siruvathur in Cuddalore district, a dead-end village, face a lack of connectivity to their agricultural lands and demand a bridge across the Gadilam river.— Photo: T. Singaravelou\n\nResidents of several villages in Cuddalore, Tiruvallur and Kancheepuram districts are demanding bridges across rivers near their habitations. During the December floods, many of these hamlets were cut off from the mainland due to the swirling waters.\n\nResidents of Poovaalai near the Paravanar river and Nallur near the Manimukta river in Cuddalore district have been demanding bridges across the waterways.\n\n“Despite repeated requests to the district administration and the Highways Department, our pleas remain unanswered. We need connectivity to the Cuddalore-Vriddhachalam Road,” said a resident.\n\nSources in the department said proposals were submitted in this regard.\n\nResidents of Siruvathur in Cuddalore district, a dead-end village, face problems such as lack of connectivity to their agricultural lands, bigger schools and a shorter route to Neyveli.\n\n“We have a lone bus every day to reach Anguchettipalayam, which is 3 km away. We need a bridge across the Gadilam river to reach Thazhampattu and Naduthittu, where our lands are located. We are unable to cross the river during rains. There has been no development in the past 30 years,” said Balamurugan, a resident.\n\nIn Kancheepuram district, residents of Edayathur and Irumbulichery, surrounded by the Palar river on both sides, have been asking for connectivity to Thirukazhukundram.\n\nIn Tiruvallur, residents of Uthukottai, Pudhuchathiram and Pinjuvakkam remain cut off from the main road for several days as the waterways overflowed across causeways.\n\nT. Sadagopan, resident of Pattabiram, said a bridge was necessary at Pudhuchathiram where a old vented causeway had been completely damaged. “The Uthukottai-Korattur-Thiruninravur road connects two national highways and traffic flow was disrupted for over 45 days as there was continuous water flow in the Arani river. The Highways department restored traffic temporarily,” he said.\n\nSimilarly, near Kadambathur railway station, residents of Pinjuvakkam village had to use a submersible causeway across the Cooum river during rains.\n\n“A temporary service road has been laid using pipes and gravel. There is a proposal to construct a bridge at the spot,” said a source in the Highways Department.\n\nEdayathur and Irumbulichery are surrounded by Palar river on both sides", 
    "section": "national", 
    "title": "Rain-hit villagers await bridges", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}