{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A seven-tier tower has been planned at the ancient temple\n\nA study by the experts has revealed that the present structure is strong enough to bear additional load of the Rajagopuram at Tiruvellarai temple.— PHOTO: M. SRINATH\n\nPriests performed special poojas and rituals at the ancient Sri Pundaraikakshan temple at Tiruvellarai, 20 km from here, on Friday to mark the commencement of construction for a seven-tier Rajagopuram on the main northern entrance to the temple.\n\nAccompanied by the chants of Vedic hymns and Divyaprabhandam verses, priests performed the poorvanga poojas and special homam at the shrine that is considered older to the famed Srirangam Sri Ranganathar temple.\n\nTwo tiers of an ancient Rajagopuram base have remained a noteworthy feature of the temple and they would be retained over which five new tiers would be built as an exhaustive study by researchers from the Indian Institute of Technology, Madras, revealed that the base structure was strong enough for the proposed load bearing.\n\nAlso, a variety of tests to assess the foundation stability, wind load capability, earthquake capability and others related to structural stability were carried out prior to the finalisation of the construction work.\n\nThe actual construction would take at lest three years. On completion, the Rajagopuram would rise to a height of 120 feet.\n\nJoint Commissioner of Hindu Religious and Charitable Endowments Department and Executive Officer of the Srirangam Ranganatha Swamy temple P. Jayaraman, trustees Dr. K.N. Srinivasan and T. Raghuraman, priests Sundar Bhattar and Murali Bhattar, Tiruvellarai temple Maniyam Sridhar as also donors Dr. S. Velumani and his brother V.S. Jayapal participated in the proceedings.\n\nDr. Velumani and Mr. Jayapal have undertaken extensive renovation work to the Tiruvellarai temple.\n\nThey have given a facelift to the sprawling temple’s fourth prakaram which they paved completely with granite slabs besides the formation of thirunandavanams, the renovation of Sri Manavala Mamunigal Sannidhi and the construction of a massive Sri Ramanuja Kootam for the benefit of visiting devotees at a total cost of more than Rs. 2 crore.", 
    "section": "national", 
    "title": "Rajagopuram to come up at Tiruvellarai temple", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}