{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Now an auto driver, he always switches on the meter; says Rs. 1,000 can be easily earned per day\n\nA policeman, who was part of the team that cracked the spine-chilling ‘pyscho’ murders that happened in and around K.K. Nagar in 2008, is, after retirement, donning the khaki again, but this time as an autorickshaw driver. And he conscientiously charges by the meter.\n\nS. Sekar (60), a retired law and order sub-inspector and a resident of Greenways Road, took to the autorickshaw following his retirement in 2014 from the Chintadripet police station.\n\nDuring his service, he was saving money to buy an autorickshaw and he bought one in his daughter’s name and employed someone to drive it.\n\n“After retirement, I was idle. Eight months ago, my autorickshaw driver took leave one day and I decided to drive the autorickshaw to kill time. I was surprised that I earned Rs. 1,000 by plying by the meter,” he explains.\n\nFollowing this, he purchased an autorickshaw in his name and he promised himself to charge only by the meter.\n\n“On my first ‘savari’, a traffic policeman stopped me near Chennai Central, and when I told him I was a retired sub-inspector, he was surprised. I never haggle with commuters but tell them to insist that drivers ply only by the meter,” says Mr. Sekar.\n\nSekar says drivers can earn up to Rs. 1,000 or more if they work for 12 hours every day.\n\n“They should abstain from vices. I am not part of any autorickshaw stand and I go anywhere my passenger wants me to. Besides, not even a single policeman has harassed me, which proves that if autorickshaw drivers have all the documents and follow the rules of the road, there won’t be any problem,” he says.\n\nDid his family have a problem accepting that he was driving an autorickshaw? They didinitially, but understood that he could not be idle at home, says Mr. Sekar.\n\nInterestingly, Mr. Sekar was an autorickshaw driver before he joined the police force in 1984 as a constable.\n\n“Before taking the police test, I was an autorickshaw driver. I completed my schooling and joined Sathya Studios. When I was working there, my friend Ravi taught me to ride an autorickshaw,” says Mr. Sekar, smiling through his handlebar moustache.\n\n“Those days, we could ply only by the meter. I used to earn around Rs. 100 every day and after all expenses, my profit used to be Rs. 25; this was sufficient for me. Even after getting into the service, I kept renewing my licence,” he explains.\n\nAs a policeman, Mr. Sekar worked with the team dealing with the ‘psycho’ murder case.\n\n“Along with senior officers, I burnt the midnight oil and our efforts paid off after we nabbed an autorickshaw driver and through him the other offenders. It was sad to know that they committed the murders to purchase ganja,” he recalls, adding that the gang had murdered many beggars and homeless people across the city.", 
    "section": "national", 
    "title": "Retired cop drives home a message", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}