{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The AIADMK party office at Uppalam sported a festive look when the other new entrants including former DMK unit convener M.A.S.Subramanian, former AINRC functionary K.Natarajan, Traders’ Federation president M.Sivasankar and general secretary S.Balou arrived here with party supporters to launch their party work formally.\n\nMr. Subramanian started his political career in 1984 with the AIADMK following the demise of his father A.Shanmugam who had been DMK unit convener for long and then defected to AIADMK in 1983. Mr. Subramanian became AIADMK MLA in 1985 after winning from Orleanpet.\n\nAfter a long gap, he became a DMK MLA trouncing the then Congress candidate and the present Speaker V. Sabapathy in Mudaliarpet in 2001 and retained the seat in 2006 defeating Mr. Kannan. However, he lost the 2011 elections to the AIADMK candidate A. Baskar.\n\nMr. Subramanian became DMK unit convener in 2012. Mr. Subramanian who was maintaining a low profile after his removal as convenor of the DMK in Puducherry joined the BJP. Subsequently, he quit the BJP and joined the AIADMK.\n\nMr. Subramanian said, “I have gone back to the original party where I started my political career. Our aim is to bring AIADMK Government through forthcoming Assembly. We will work hard to achieve the goal.\n\nMGR statue garlanded\n\nAll the new entrants garlanded the statue of party founder and former Tamil Nadu Chief Minister M.G.Ramachandran and greeted the senior leaders of local unit.\n\nK. Natarajan, former MLA of the AIADMK, won the Oulgaret seat in the 1991 elections and retained the seat in 1996. However, he quit the AIADMK and joined the DMK and became the Chairman of Villianur Commune Panchayat in 2006.\n\nMr. Natarajan later joined the AINRC and contested the 2011 elections on an AINRC ticket but lost to A. Namassivayam of the Congress.", 
    "section": "national", 
    "title": "Rousing welcome to new entrants at AIADMK office", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}