{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Renewable energy should be harnessed wherever it was possible, said Ramesh Kymal, vice-chairman, Confederation of Indian Industry (CII), Tamil Nadu State Council.\n\nAddressing a conference on power and renewable energy organised by the CII-Thoothukudi here on Friday, he said that over 9,000 mega watts of solar energy and 3,000 mw of wind energy would be generated in the country this year. The Centre had set a target of generating 1.75 lakh mw of solar and wind energy by 2020.\n\nC. Murugeswaran, resource person, said that the State government should encourage private players, who had invested huge sums of money in the power industry in Tamil Nadu, by purchasing power from them rather than drawing power from other States. Besides, the government should permit Tamil Nadu-based generators to sell excess power to other States.\n\nMany private players had been facing hardships as the State government was reluctant to purchase power from them citing high cost. They were also not allowed to sell power to other States under Section 11 of the Electricity Act.\n\nMeanwhile, he said, the price of imported coal had come down. He stressed the need for implementing energy-efficient techniques. Power consumption had come down owing to sluggish industrial growth in Tamil Nadu. Since it took a long time to get approval for starting an industry, many investors got discouraged and hence the government should simplify the approval procedure, Mr. Murugeswaran said.\n\nB. Arun Kumar, Assistant Manager, Wind Division, Gamesa India, said that 300 mw of wind projects would be commissioned in Kayathar in the next one-and-a-half years. Already, a 400 kv wind power substation was commissioned in March last year at Kayathar, he said.\n\nMeenakshi Sundaram, Senior General Manager, DCW, said that about 85 per cent of the world’s commercial energy was generated from fossil fuels. Coal played a vital role in meeting the growing energy needs and among various energy resources, 59 per cent of energy was produced from coal.\n\nEarlier, P. Ramnath, Chairman, CII, Thoothukudi, welcomed the gathering.", 
    "section": "national", 
    "title": "Stress on harnessing renewable energy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}