{
    "author": [], 
    "text": "Kanavu Variyam will receive the Remi Award at the WorldFest Houston International Film Festival\n\nA feature film by a Chennai-based filmmaker is all set to be screened at the 49th WorldFest Houston International Film Festival. The film deals with an unusual theme — electricity and power cuts in villages across Tamil Nadu.\n\nArun Chidambaram’s Kanavu Variyam , which stars newcomers in lead roles, has also bagged the ‘Remi Award’, which will be given at the WorldFest, one of the oldest independent film and video festivals in the world. It will be conducted from April 8 to 17.\n\n“I have always been interested in science and wanted to convey something inspirational through my film as well. Being a debut filmmaker with no background in the industry whatsoever, I went about making my film purely focussing on how someone in the audience would receive it,” explains Mr. Arun.\n\nA song from the film, Kalla manna , has also been selected to be screened at the Bare Bones International Film and Music video festival.\n\nKanavu Variyam had earlier been screened at the National Science Film Festival in India where it bagged the Special Jury Award. The makers are getting ready for a year-end release.\n\n‘Kutty’ Padmini to\n\nreturn to silver screen\n\nActor and television producer ‘Kutty’ Padmini will return to the silver screen after several years. She will act in the upcoming film ‘ Utharavu Maharaja’ . ‘Kutty’ Padmini, who debuted as a child artiste, went on to play many supporting roles in Tamil films and later forayed into television serials.\n\nShe will now be sharing screen space with actors Prabhu, Kovai Sarala, Sriman and Manobala in a movie that will have actor Udhaya, brother of film director Vijay, in the lead, playing three characters.\n\nNearly 16 years after ‘ Tirunelveli’ hit the screens, Udhaya will team up with veteran actor Prabhu for a psycho-thriller. The film will be shot in Coimbatore, Puducherry and Chennai from March onwards after the three female leads are finalised.\n\nAasif Qureshi will debut as director in the film.\n\n(Reporting by S. Poorvaja and K. Lakshmi)", 
    "section": "national", 
    "title": "Tamil film on power cuts in villages goes places", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}