{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "Fund-raising\n\nevent\n\nACME Round Table will be organising a fund raising programme ‘Tiger Run 2016’ around Coimbatore Golf Course in Chettipalayam on February 21 at 6.30 a.m. ACME Round Table is actively involved in conserving tigers by supporting the Forest Department and the community since 2009.\n\nFunds raised at the event will be used for projects to save the tiger. There will be two events - 6 km and 11 km for which the registration fees are Rs. 500 and Rs. 750 per person, respectively. For details, log on to\n\nwww.saveatiger.in\n\nSelected\n\nThe 9th ASSOCHAM (The Associated Chambers of Commerce & Industry of India) Higher Education Summit 2016 was held on February 17 in New Delhi where the national excellence awards were given. There were different categories in which the honours were designated. The selection of the best institution/ university in the nation was done taking into account the innovation, scalability, accomplishments, capacity to overcome challenges and the effect potential in the specific class. Karunya University bagged two National Excellence Awards, the “Best University in Sports” and the “Best University Serving Social Cause” (CSR-Corporate Social Responsibilities). Ram Shankar Katheria, Minister of State for Human Resource Development handed over the awards to the Chancellor Dr. Paul Dhinakaran, trustee Dr. Jeyakumar Daniel and Pro Vice-Chancellor Dr. M.J. Xavier.\n\nCity campus\n\nKarunya University has established a city campus in the heart of Coimbatore (opposite to Airtel office - P.N. Palayam) with state-of-the-art infrastructure including furnished air-conditioned classrooms equipped with modern teaching aid, besides library and modern computer labs with wi-fi facility. The campus would offer MBA, BBA, B.Com, BCA, B.Sc. (IT), B.Sc. (Vis.Com) and part-time B. Tech and M. Tech. Engineering courses. The campus will operate in two shifts.\n\nTalks\n\nWage talks for powerloom job working units in Coimbatore and Tirupur districts will be held at TNAU premises on February 21. Job-working powerloom unit owners and textile manufacturers will take part in the talks that will be held in the presence of Ministers, a release said.\n\nPrizes\n\nWinners of “Thanga Mazhai Thittam” of Co-optex were given gold coins at a function held on Thursday. Customers who purchased goods worth Rs. 2000 or more were given a coupon. “Buy two, get one free” scheme was also launched, a release said.", 
    "section": "national", 
    "title": "Tiger Run on Sunday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}