{
    "author": [], 
    "text": "RELIGION\n\nOrganising Committee: Sri Seetha Kalyanam, thodayamangalam, ashtapathi, Aditya Apartments, North Adayavalanjan Street, Srirangam, 8 a.m.; divyanamam, dolothsavam, bhajans, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam,Kattazhagiasingar Sannidhi, Thiruvanaikovil, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 9/4, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary programmes, ‘Pukai mootam,’ social drama by Sri Sankari Creations, FGN Hall, W.B.Road, 6.30 p.m.\n\nConnoisseurs of Classical Music, Tiruchi and Srirangam: Dr.M.S.Subbulakshmi birth centenary, Alathur Brothers Day and birth centenary of Alathur V.Sivasubramania Iyer, and felicitation to Tiruchi Sankaran on completion of 60 years of service in music, N.Gopalsamy, Director, Dalmia Cements, presides, Sri Nandrudayan Vinayagar Temple, East Boulevard Road, 6.30 p.m.; vocal concert by O.S. Thyagarajan and party, 6.15 p.m.\n\nDepartment of Arts and Culture: Prize distribution of State cultural contest, K.S.Palanisamy, Collector, chief guest, Kalai Kaviri College of Fine Arts campus, 4.30 p.m.\n\nGENERAL\n\nSeethalakshmi Ramaswami College: College Day, Nirmala Sitharaman, Union Minister of State for Commerce and Industry, chief guest, 10.30 a.m.\n\nTN Dr. Ambedkar Law University and Tiruchi Government Law College: Inauguration of debate in Tamil, P. Vanangamudi, Vice-Chancellor, TN Dr. Ambedkar Law University, chief guest, Law College campus, 5 p.m.\n\nShrimati Indira Gandhi College: National seminar on Financial markets, P.Paramashivaiah, professor, Tumkur University, chief guest, 4.45 p.m.\n\nHoly Cross College: Inauguration of NSS special camp, Holy Cross Community College, Ayakudi, 10 a.m.\n\nJamal Mohamed College: Exobiz - inter collegiate management meet, S.Mohammed Yunus, Co -founder of PROPO, 10 a.m.\n\nM.A.M.B. School: Talgen 2016 – intra collegiate management meet, Padmalatha Suresh, adjunct faculty, Indian Institute of Management, Kozhikode, 9 a.m.\n\nK. Ramakrishnan College of Engineering: Talentia 2016 – cultural festival, 10 a.m.\n\nM.A.M. School of Engineering: Lecture on “current trends in power generation” by V. Ramachandran, General Manager (technical), Kothari Sugars and Chemicals Ltd., 10.30 a.m.\n\nHallmark Business School: Lecture on “emotional intelligence” by S.N. Raghavendra, associate professor, Bharathidasan Institute of Management, chief guest, 11.30 a.m.\n\nM.A.M. College of Engineering: Hands-on training on Innovative electronics, K.C. Tamilventhan, Director, and T. Malvino of LIFT Technologies, resource persons, 9.30 a.m.\n\nChidambaram Pillai College for Women: Lecture on short introduction to MAT Lab by A. amesh Babu, assistant professor, Sastra University, 10 a.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram: Inauguration of bio medical engineering department association, K. Vignesh, application engineer, ESAOTE India Ltd., chief guest, 9.30 a.m.\n\nBishop Heber College Department of Social Work: Awareness programme on de-addiction, Panchukitangu, 6 p.m.; awareness programme on career development, college campus, 10 a.m.; general medical camp, Sevai Shanthi Higher Secondary School campus, Pettavaithalai, noon.\n\nHindu Mission Hospital, Sankara Eye Hospital and Rotary Club of Tiruchi Midtown: Free cataract eye screening camp, Hindu Mission Hospital, Anna Nagar, Thennur, 9 a.m.\n\nHoly Cross College: Health carnival – traditional food mela, 10 a.m.\n\nCARE Group of Institutions: Annual intramural sports day, Ganeshan, international kabbadi player, chief guest, 2 p.m.\n\nChinmaya Vidyalaya: Annual sports day, S. Rathamani, chief guest, 3 p.m.\n\nJamal Mohamed College: Inter-collegiate diamond jubilee volleyball tournament for IOB Rolling Trophy, K.A. Khaleel Ahamed, college treasurer, inaugurates, 7 a.m.\n\nJeevan Polytechnic College, Muthapudayanpatti: Annual sports meeting, 10 a.m.\n\nChristhu Raj College: Sports Day, A. Arunachalam, college chairman, distributes prizes, 3 p.m.\n\nEduSports: Inter-school football under-14 tournament, Anna Stadium, 8 a.m.", 
    "section": "national", 
    "title": "TIRUCHI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}