{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The police have so far made no headway, writes S. Sundar\n\nTwo murders in the gap of four days reported in the rural district this week have kept the district police on their toes.\n\nIn the first case reported on February 12, the Austinpatti police registered a case of woman missing. The 21-year-old woman, P. Rajalakshmi, had gone missing the previous day. The daughter of a farmer, Ponraj, rearing some 50 sheep, the woman was last seen by her younger brother in the house on February 11 afternoon.\n\nThe family members searched for her in vain in the cattle enclosure put up some 300 feet away from home on West Street in Uchapatti.\n\nTo her shock, a local woman noticed a gunny bag with two legs protruding near the haystack, some 50 feet away from the house of the deceased.\n\nThe police found the body of Rajalakshmi in a decomposed state with a visible injury on her chin. This, the police said, meant that the girl had died on the very day of missing.\n\n“It is perplexing as to how the body came to the haystack on the third day, when it was not found there when the family members had searched on the previous two days,” a police source said. The police said that the girl was strangulated to death.\n\nAfter having enquired many suspects, including the family members, the police were still to make a breakthrough in the case.\n\nThe other case is that of the murder of an 18-year-old girl in Chokanathanpuram near Panaiyur who was found dead with her throat strangulated with a dupatta on Wednesday (February 17).\n\nGoing by the circumstances in which the body was lying in a thorny bush, the police suspected that the girl was sexually assaulted when she had gone to bring back a herd of goats home from the grazing land in the afternoon.\n\nIn this case too, a local woman had first noticed the body and alerted the family members.\n\nThe victim, a nursing student in a private college in Tirupuvanam, was attending training at a private hospital, the police said. The needle of suspicion points to labourers of local units who used to roam around the area.\n\nDespite having formed special teams, the Austinpatti police and the Silaiman police have so far made no headway in the murders of the two young women.", 
    "section": "national", 
    "title": "Two murders in four days keep police on their toes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-20"
}