{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Indira Gandhi Government Medical College and Research Institute faced obstacles in getting MCI approval\n\nFor the first time in the history of the Union Territory, 131 medical students, most of them Puducherrians, graduated from the lone government-run medical college and were awarded with degrees and medals.\n\nThe medical college-cum-hospital has had a chequered history. When N. Rangasamy was Chief Minister during the Congress regime, an independent society the Puducherry Medical College Society was formed with an intention to establish government medical college with an intake of 150 students; attached to a 750 bedded hospital exclusively for the UT of Puducherry.\n\nUnder the society, the Indira Gandhi Government Medical College and Research Institute (IGGMC&RI) was established by the government in 2010 with the mission of “Health for All.” Initially, approval of the MCI was obtained in 2010 and the college started functioning with effect from September 16, 2010. Then every year, it had faced obstacles in getting approval from the MCI. The final MCI approval for the entire MBBS course was obtained in August 2015. The college is now in its sixth year of the course and the first batch of the students has successfully completed their internship.\n\nMany students expressed happiness over passing out from the college. “Whatever the problems that the administration had been facing, it was never affecting us. I feel happy now. It was my parents’ dream that I should become doctor,” said N. Seshadri Bhargava who became the first doctor in his family.\n\nR. Reshma Devika said, “Though we had Jipmer here, there were not many MBBS options when we passed out from the government college. We feel privileged to be the first batch students of the college.” “Faculty and students have undertaken many research projects, including community-based research activities,’ said V. Govindaraj, Director of IGGMC&RI.\n\nThe college has applied to start MD and MS courses in nearly eight specialities.", 
    "section": "national", 
    "title": "1st batch of doctors pass out of govt. college", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}