{
    "author": [], 
    "text": "GOING UNCHECKED:This school van makes an unauthorised entry into the Kalpalam Road leading to Government Rajaji Hospital at the Palam Station Road-FF Road junction by dangerously crossing one-way traffic coming from Kalpalam Bridge and Palam Station Road.— Photo: G. Moorthy\n\nIt’s a close shave on Palam Station Road, says S. Sundar\n\nOften one could witness a close shave or hear a screeching halt of vehicles on Palam Station Road-FF Road junction near the bridge over Pandalgudi channel off S D H Jain Vidyalaya. Reason: motorcycles, autorickshaws, four-wheelers, including trucks, which come from the Zambropuram side, make an entry prohibited by the police so that they could reach Thevar Statue at Goripalayam on their way to Panagal Road or Albert Victor Bridge.\n\nUnmindful of speeding vehicles zooming in from Kalpalam bridge and from Sellur side, the drivers, risking the lives of their own and others, jump into the junction perpendicular to the main road. While regular road users watch out for such “daredevils,” those who are not used to such “Madurai driving habits” are caught unawares and often scamper to bring their vehicles to a sudden halt.\n\nPolice officials said that they had put up a series of barricades on the junction to prevent the unauthorised crossing. However, many vehicles continue to violate the rule. Those violating the traffic rules at the junction claim that otherwise they would have to take more than three km of circuitous route of going through OCPM School and Gokhale Road junctions and Tallakulam to reach Goripalayam.\n\nHowever, the city police have a plan of diverting vehicles proceeding towards Panagal Road and AV Bridge from FF Road to Pandalgudi Main Road, running parallel to it on the other side of the channel. “There is a bridge connecting the two roads along the channel (some 200 metres away from the junction) near Zambropuram Main Road. If vehicles from FF Road cross over the channel and reach Pandalgudi Main Road, they could reach upstream the busy junction and join the flow of vehicles from Sellur to cut through the junction without much risk,” a police officer said.\n\nAll that is hindering this process is encroachment of the 200-metre-stretch on Pandalgudi Main Road. “If the Corporation clears the encroachment and makes the road motorable for four-wheelers, it will go a long way in ensuring safety of road users at the junction,” the officer said. If the signals are modified, vehicles from Pandalgudi Main Road could be allowed to make a right turn towards Sellur too, the official added.\n\nThe proposal was made at least six years back, but due to some reason or other, it has been put in the backburner. Deputy Commissioner of Police (Traffic) A.G. Babu said that he would study the proposal before acting on it.", 
    "section": "national", 
    "title": "A dangerous shortcut", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}