{
    "author": [
        "S Senthalir"
    ], 
    "text": "Adishakti to stage the play at Auroville on February 16\n\nA scene from the play Ganapati, which Adishakti will stage at Auroville on February 16.— Photo: Special Arrangement\n\nExploring Ganapati as a concept of inclusivity, Adishakti Laboratory for Theatre Arts and Research is staging the play Ganapati at Aurobindo Auditorium in Bharat Nivas, Auroville on Tuesday.\n\nWith minimal verbal texts, the play employs different patterns and textures of rhythms to convey the emotions. It is the rhythms evolved from the drums of Koodiyattam music and Thappattam that translate emotions and sentence to the audience.\n\nThe play begins with the ritual creation of an image of Ganapati for the annual festival by a group of artisans. While creating the sculptor, the artisans look for inspiration at the physical, psychological and intellectual level for creation. They then participate in the festival’s celebrations and its aftermath; when the icon is sent away to be immersed in the sea. It will be recreated again.\n\n“The play is structured as a recurring cycle of creation, celebration, destruction and return, which parallel’s the motif in these birth stories. Ganapati , his elephant head and pot bellied human body epitomizes hybrid concept,” says Vinay Kumar K.J., managing trustee and artistic director, Adishakti.\n\nDealing with multiple aspects of the Ganapati ’s stories in fables, myths and traditions, the stories are told in metaphors in this play.\n\n“There is no linear narrative,” he says.\n\nIn one of the many stories about Ganapati ’s birth, a baby elephant bumps into Siva while he is looking for the head he has chopped off. When the elephant learns that the boy will live only if he gets a head within a specific time, he offers his head to Siva so as to bring Ganapati back to life.\n\n“That act of helping is act of godhood. When we look at our past, we learn how inclusive we need to become,” says Mr. Vinay Kumar.\n\nHe adds that conflict has been a part of tradition. “Tradition is a by product of multiple conflicts and it has never been a singular entity. The play attempts to trace the past with its inclusivity,” he says.\n\nThis production emerged from a grant made by the India Foundation for the Arts to Adishakti on the topic Rhythm as a text in Koodiyattam and Contemporary Theatre.\n\nIt is going to be staged at Bharat Nivas after a gap of 17 years.\n\nAcclaimed theatre personality late Veenapani Chawla’s core team Vinay Kumar, Nimmy Raphel and Arvind Rane along with three others will stage Ganapati at 7 p.m. on February 16 at Bharat Nivas Auditorium in Auroville.", 
    "section": "national", 
    "title": "Adishakti to interpret Ganapati as a concept of inclusivity", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}