{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court has dismissed a criminal appeal preferred by a Central Excise Superintendent challenging three years of rigorous imprisonment and fine of Rs. 2 lakh imposed on him by a sessions court in Chennai in 2009 for having demanded and received a bribe of Rs. 25,000 from a service tax assessee in 2004.\n\nJustice A. Selvam refused to interfere with the conviction as well as punishment imposed on the convict, G. Sivabalan, after observing that the Central Bureau of Investigation, Anti-Corruption Branch, Chennai, had laid a trap to catch him red-handed and clearly established through overwhelming evidence the fact of him having demanded and received the bribe.\n\nAccording to the prosecution, the convict had raised objections to self-assessed tax paid by a private company involved in installing, repairing and maintaining electrical equipment for the year 2003-04 and demanded bribe to clear the assessment.\n\nHence, the CBI had laid a trap on the basis of a complaint lodged by one of the directors of the company.\n\nAs per their plan, the money was paid in a white cover to the convict in his office on August 23, 2004, and the entire conversation between them was recorded secretly.\n\nAfter the convict received the tainted money from the complainant in the presence of a decoy witness, the CBI sleuths arrested him, recovered the material objects and conducted scientific examination.\n\nThough the appellant assailed his conviction on the grounds that the CBI had not produced the white cover before the trial court and the recorded conversation was not played during the course of trial, the judge said that those two grounds were not sufficient to set aside the conviction since the prosecution had proved its case through corroboration of evidence adduced by its witnesses.\n\nThe judgment was reserved in the Principal Seat of the High Court in Chennai and delivered at its Bench here.\n\nThe convict had raised objections to self-assessed tax paid by a private company", 
    "section": "national", 
    "title": "Appeal against conviction of Central Excise official dismissed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}