{
    "author": [
        "Special Correspondent"
    ], 
    "text": "BJP State president Tamilisai Soundararajan extending an invitation to Chief Minister Jayalalithaa for her son's wedding on February 17.Photo: special arrangement\n\nWith DMK treasurer M.K. Stalin ruling out an alliance and the AIADMK not sending any feelers, the BJP seems to have decided to go full throttle against both the Dravidian parties.\n\nSources in the BJP said the high command had instructed the campaign and media committees to gear up for an onslaught against the two parties.\n\n“They have asked us to ready campaign materials to expose the AIADMK and DMK,” said a senior leader.\n\nIn clear signs of this strategy, senior party leaders, including Union Minister Pon. Radhakrishnan, State president Tamilisai Soundararajan, national general secretary Muralidhar Rao and Vanathi Srinivasan blamed both the Dravidian parties for the slump in Tamil Nadu’s growth at a recent public meeting in Chennai.\n\nMr. Rao charged that industries were stagnating in the State and wanted the people to vote for the BJP to bring a Gujarat-like transformation.\n\nMs. Vanathi took pot shots at the DMK, stating how a party that ridiculed spirituality was now trying to embrace Hindus. Director Visu, who recently joined the party, alleged that there was no access to the leadership when he was with the AIADMK.\n\nA senior leader said the last hope was the DMDK. “Since there has been no response from any of these parties, we are gearing up to go it alone,” the leader added.\n\nTamilisai meets Jayalalithaa\n\nMeanwhile, Ms. Tamilisai and her family met Chief Minister Jayalalithaa at the Secretariat here on Friday to extend invitation to her son’s wedding scheduled for February 17.\n\nInteracting with reporters later, she said politics was not discussed.\n\nBJP national president Amit Shah and senior Union Ministers are expected to participate in the wedding.\n\nA fallout of failure to strike alliances for elections", 
    "section": "national", 
    "title": "BJP gearing up to attack main Dravidian parties", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}