{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Residents whose land may be acquired say compensation is inadequate\n\nPublic consultation on land acquisition for Metro Rail project being held at the Chennai Collectorate —Photo: M. Vedhan\n\nOn Friday, retired government employee Kalaimathi was in tears, and fumbling for words as she spoke to land acquisition officials for the Metro Rail extension project from Old Washermenpet to Wimco Nagar.\n\nShe was one of many residents of that region who had gathered at the Chennai Collectorate for a consultation called on by the officials.\n\nThe flat she had bought in Korukkupet with all her savings was set to be demolished for the Metro Rail and she would receive only an estimated 40 per cent of the market value of the property as compensation.\n\nWith that money, she would not be able to buy a similar flat in the same locality. “Officials are reiterating that the project is for us. If we ourselves are all gone, how are we going to reap the benefits of the project?” asked Ms. Kalaimathi.\n\nWhen residents rose to their feet in anger, one official bluntly said: “The government has already marked the land. You have no choice but to cooperate. Receive the money immediately on a private negotiation basis. If not, the government will take over your land.”\n\nAt this point, some residents walked out and a few chose to argue.\n\n“We cannot buy land in the same area using this amount the government offers as compensation. We want a Metro Rail. But we request the government to change the alignment suitably. We have suggested alternative sites already owned by the government,” said K. Rajan, another resident.\n\nWashermenpet resident Ganesh said the alignment would create traffic congestion.\n\n“We request the officials to implement the project along Kannan Street, Ilaya Mudali Street and Sathangadu Road. This would help at least five lakh people,” he said, adding that private land acquisition on these stretches would be minimal.\n\nOfficials at the meeting said land would be acquired for Metro Rail in areas such as Korukkupet, Tondiarpet and Old Washermenpet. Most of the petitions submitted by the affected residents sought the shifting of the station alignment to reduce land acquisition, said an official.\n\nSome affected residents did not have their names on the permanent land register. Some said their original documents were missing. Some demanded more compensation at the meeting.\n\nThe government issued public notices to residents on January 23 and 24 that land acquisition would be carried out by Revenue Department officials in Chennai and Tiruvallur districts.\n\n“The meeting has been convened to give a reply to the residents. We will have another meeting next week,” said an official.\n\nOfficials of Chennai Metro Rail Limited have identified the roads that have to be widened and the land to be acquired for the Washermenpet to Wimco Nagar Phase-I extension, which is estimated at Rs. 3,000 crore.", 
    "section": "national", 
    "title": "‘Change Metro alignment’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}