{
    "author": [], 
    "text": "Religion\n\nBhagavatham: Jaya Srinivasan, Rathnagiriswarar Temple, Besant Nagar, 6-45 p.m.; Sundara Kumar, Harihara Dhyana Nilayam, Chinmaya Mission Yoga Center II, Chinmaya Nagar, 6-45 p.m.\n\nCulture\n\nTamil Nadu Eyal Isai Nataka Mandram: Bharat Ratna M.S.Subbulakshmi Centenary celebrations,\n\nMadras Book Club: Release of publication ‘Samrat Ashoka’, Taj Connemara, 7 p.m.\n\nGeneral\n\nAmarajeevi Potti Sreeramulu Memorial Society: NR Chendur-Jagati award presentation, Supreme Court judge Jasti Chelameswar participates, Luz, Mylapore, 6 p.m.\n\nMadras Management Association: MMA annual convention, Hotel Taj Coromandel, 4 p.m.\n\nWorld Story Telling Institute: Chennai Storytelling Festival, Dr MGR Janaki College, RA Puram, 9-30 a.m.\n\nSt.John’s English School: Annual day, Besant Nagar, 5-30 p.m.\n\nSDNB Vaishnav College: Workshop on how to crack civil service examination, Chromepet, 10-30 a.m.\n\nTambaram Parents’ Association for the Mentally Retarded: National day for the mentally retarded persons, Vels University, Pallavaram, 9-30 a.m.\n\nTheosophical Society: Talk on Saint Ganapathy Dasar life, Dr.Alagappa School, Purasawalkam, 6 p.m.\n\nArappor Iyakkam: Free workshop on “Basic Laws, RTI, Police and Govt office procedures”, ICSA Paripoorna Center, 2/513, Dr. Ambedkar Nagar, Manappakkam, 10 a.m.\n\nAnna Nagar Ladies Club: Carnival, Anna Nagar, 10 a.m.\n\nRotary Club Madras Industrial City: Donation of equipment, Dept. of Plastic Surgery, KMC Hospital, 9-30 a.m.\n\nNarcotics Anonymous: Meetings, Arul Kadal Aikiya Aalayam, Santhome High Rd.; St. Andrew’s Church, Choolai, 7 p.m.\n\nAl-Anon: Meetings, Community Service Centre, Balfour Rd., Kilpauk; Alagu Andavar Temple, Korukkupet; TPI Kalyana Mandapam, Avadi; and Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; and Iraivan Thantha Vaippu Kuzhu, Thiruvottiyur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Community Service Centre, Balfour Rd., Kilpauk; PS HSS., Mylapore; Advent Christian Middle School, Velachery Rd., Sembakkam; Risen Christ Church, Paper Mills Rd., Peravallur; Alagu Muthu Mariyamman Tirumana Mandapam, Periyar Salai; St. Teresa Church, Nungambakkam High Rd.; E.C.I. Zion School, 100 ft. Rd., Ekkatuthangal; Our Lady of Perpetual Help Church, Manali Town; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Karthikeyan MHSS., Saligramam; D.B.I. Colony, C.T.H. Rd., Avadi; St. Vincent School, Assumption Church, Railway Colony, Choolaimedu; and C.S.I. Church, Arcot Rd., Virugambakkam, 7 p.m.\n\nView full list at thne.ws/ChennaiEng", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}