{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students urged to find solutions for utilising solar power round-the-clock\n\nEducation should propel economic growth that respected nature and addressed climate change, said D.J. Pandian, Director General of Pandit Deendayal Petroleum University in Gujarat.\n\nIn his address at the 49th convocation of Madurai Kamaraj University here on Friday, he said that though the present growth rate of India was impressive, sustaining it would be impossible if the growth model was against nature. Stating that institutions of higher learning should contribute towards sustainable growth, Mr. Pandian urged the passing out graduates of the university and researchers to find solutions for utilising solar power round-the-clock. “Presently, solar power can be used only during day. However, viable solutions that can store the solar power generated in daytime and share it to the grid are yet to be found,” he said.\n\nMr. Pandian said that universities should contribute to the growth of local industries. “It is good that most of the youngsters are moving to IT industry. But importance should also be given for farming and other local industries which are crucial and can generate employment,” he said. Pointing out that the world was becoming increasingly globalised, Mr. Pandian said that education should be approached with a global perspective. “Education should be above politics and region,” he said.\n\nTamil Nadu Governor and Chancellor of Madurai Kamaraj University K. Rosaiah presided over the convocation and awarded the degrees.\n\nAs many as 442 candidates were awarded Ph.D. degrees of which majority were from Faculty of Science, and Faculty of Arts. Seventy-two candidates, of whom 50 were female candidates, were prize and medal winners.\n\nUniversity sources said that apart from Ph.D. awardees and medal winners, 64,226 candidates who completed their courses in affiliated colleges and through distance education mode received degrees in absentia.\n\nEarlier, welcoming the guests, Higher Education Secretary Apoorva highlighted the achievements of Tamil Nadu in higher education.\n\nRegistrar in charge A. Muthumanickam and Controller of Examinations P. Vijayan were present.", 
    "section": "national", 
    "title": "“Education must propel right economic growth”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}