{
    "author": [
        "T K"
    ], 
    "text": "Besides R. Ashwin and actor Karthi, squash player Dipika Pallikal and cricketer Dinesh Karthik will be part of the campaign.\n\nBesides R. Ashwin and actor Karthi, squash player Dipika Pallikal and cricketer Dinesh Karthik will be part of the campaign.\n\nBesides R. Ashwin and actor Karthi, squash player Dipika Pallikal and cricketer Dinesh Karthik will be part of the campaign.\n\nPoll panel wants more youngsters to register themselves to cast their votes\n\nThe State Election Commission is roping in celebrities and sportspersons to increase voter awareness and get youngsters to register to vote. Actor Karthi has already shot for an awareness video that will be released in the next 10-15 days, Chief Electoral Officer, Rajesh Lakhoni said.\n\nCricketers R Ashwin, Dinesh Karthik and squash champion Dipika Pallikal will be part of the campaign to get more youngsters to vote.\n\nThe election CEO has also requested celebrities and political parties to follow them on Twitter on the Commission’s handle @TNElectionsCEO and retweet messages to increase user engagement.\n\n“Currently, we are still seeing low registration among the 18-29 age group. We are looking to improve that and we are focussing our campaign towards that direction,” Mr. Lakhoni told The Hindu on Friday . “To keep the youngsters engaged, we are trying to talk to them in their language and not be preachy. We are building momentum and currently our focus is on registration. We will put out specific campaigns to target each age group,” he added. The Election Commission is also crowd sourcing ideas to get more user engagement online and is set to start a competition to popularise its efforts. The Commission has also engaged a creative agency to popularise its efforts. In the past few days, there has been a spate of memes from the EC to target the youngsters.\n\nOn Friday, it put out a video message ahead of Valentines Day. “Showing your loved one how much you care is important, but can you take a minute to show that you care for your country too? Register to Vote”, the message said.", 
    "section": "national", 
    "title": "Election Commission ropes in Karthi, Ashwin", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}