{
    "author": [], 
    "text": "The Tamizhaga Cable Television Operators General Welfare Association has appealed to the government to exempt cable television operators from service tax. A resolution to this effect was adopted at a meeting of the association held here on Friday. The association appealed to the government to exempt cable TV operators from track rent charged by the local bodies. It appealed to the State government to extend support for setting up a cooperative digital control room by cable TV operators if the State government failed to get a digital licence.\n\nNight sky gazing\n\nat planetarium\n\nThe Anna Science Centre Planetarium would organise a sky observation programme at its premises between 7 to 8.30 p.m. on Saturday, subject to clear sky condition, according to a press release from I.K.Lenin Tamil Kovan, project director of the planetarium.\n\nDarwin’s birthday\n\ncelebrated\n\nThe birth anniversary of Charles Robert Darwin, Father of Evolutionary Theory, was celebrated under the auspices of Tamil Nadu Science Forum and the Panchayat Union Middle School at Vaiyampatti near here on Friday. Various competitions on science and practical sessions were held as part of the celebrations. Sky observation programme and “patti mandram” were held in the evening to sensitise the masses to the importance and applications of scientific principles. Prizes were given to winners in various competitions. S. Jesuraj, headmaster of the school, and A. Sakthivel, science teacher, explained the scientific principles to students and villagers.\n\nFootball\n\ntourney\n\nEduSports, a school sports company, will conduct an inter-school football tournament for boys’ under-14 years at Anna Stadium here on February 20. Registration is open for schools across Tiruchi till February 16. For registration, contact Gobi (7845698779) or John Stalin (9843422625).", 
    "section": "national", 
    "title": "‘Exempt cable TV operators from tax’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}