{
    "author": [
        "M K"
    ], 
    "text": "Four accused, including the owner of the unit, were granted bail\n\nFive of the six migrant workers from West Bengal, who suffered 100 per cent burns in the boiler burst at a tyre melting unit at Oratukuppai near Chettipalayam on Thursday morning, died at the Coimbatore Medical College Hospital (CMCH) on Friday .\n\nThe workers at the firm suffered injuries when the boiler burst when they tried to open it.\n\nThe police inquiry revealed that unable to bear the pain the victims had jumped into a water tank, before they were rescued and hospitalised.\n\nA. Gunal (19) of Alipurduar district of West Bengal died around 2.55 p.m., less than half an hour after the four accused including owner of that industrial unit, who were arrested, were released on bail. A. Dharun (20), C. Preetham (25) and D. Bikash (19) died in the evening.\n\nPolice sources said that two other victims J. Saroj (23) and S. Birjun (20) were battling for their lives. Relatives of the victims were expected to reach Coimbatore on Saturday.\n\nThe Chettipalayam Police booked managing director of the industry K.T. Balaguru, his sons B. Senthil and B. Thirumalairajan and the unit supervisors T. Gowtham and Mani as the accused. While Gowtham was secured on Thursday night, Senthil and his brother surrendered at the police station. Balaguru surrendered in court.\n\nThey were booked under Sections 285 (negligent conduct with respect to fire or combustible matter) and 338 (causing grievous hurt by an act endangering life or personal safety of others) of Indian Penal Code (IPC).\n\nThey were produced before Judicial Magistrate-III in Coimbatore and were granted bail as the sections under which they were booked were bailable sections.\n\nFollowing Gunal’s death, the case was also booked under Section 304 (A) (causing death by negligence) of IPC.", 
    "section": "national", 
    "title": "Five boiler blast victims die", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}