{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "The indefinite strike, pressing for implementation of 20-point charter of demands, reached the third day on Friday\n\nA total of 1,308 striking anganwadi workers, nutritious noon meal scheme organisers including 130 men, were arrested when they took out a procession and tried to stage road roko in front of the Collectorate on Friday in support of their demands.\n\nUrging the State Government to withdraw the contributory pension scheme, regularisation of their service as government employees, increased salary and perks for cooking etc., the anganwadi workers and the nutritious meal scheme organisers commenced their indefinite strike on Wednesday last. The protest has badly hit preparation and distribution of food in the anganwadis and nutritious noon meal centres across the district.\n\nAs they, along with the striking government employees, had planned to organise road roko in front of the Collectorate on Friday, a strong police force, led by G.S. Madhavan, Assistant Commissioner of Police, Palayamkottai had been deployed at the Collectorate since Friday morning.\n\nReaching the protest venue in good number of vans, the striking anganwadi workers and nutritious noon meal scheme organisers assembled near the Sub-Registrar’s Office on the Collectorate premises before taking out a rally to stage road roko at the main entrance of the Collectorate. However, they were stopped by the waiting police and arrested. They were taken to a marriage hall and released in the evening.\n\nThoothukudi\n\nAs many as 813 government employees including 627 women staff courted arrest here on Friday while staging a road roko near the traffic signal on Palayamkottai Road in support of their demands to be fulfilled by the government. The agitating employees demanded that the government scrapped the existing contributory pension scheme and restored the old pension scheme. Besides, they also wanted the government to fill the vacancies for various posts in government departments. Prior to the arrest, the employees took out a rally raising slogans and appealed to the government to fulfil their demands.\n\nNagercoil\n\nThe indefinite strike by the government employees intensified on Friday, as the Tamil Nadu Government Employees Association (TNGEA) spearheaded a road roko in front of the Collectorate demanding implementation of 20-point charter of demands including withdrawal of New Pension Scheme (NPS) and pay anomalies etc.\n\nA total of 230 employees including 114 women were arrested for staging road roko on the Nagercoil-Trivandrum National Highway. TNGEA District President S. Leeden Stone presided over the agitation. District Secretary C.R. Rajkumar explained the demands. Ramachandran, Secretary of the Federation of Trade Unions, CITU District Secretary Thanga Mohan offered felicitations. MUTA President Manoharan inaugurated the agitation.\n\nRamanathapuram\n\nMore than 3,000 government employees, including a large number of women, courted arrest in Ramanathapuram and Sivaganga districts on Friday when they staged picketing agitations.\n\nOn the third day of their indefinite strike launched on Wednesday as part of State-wide stir, 962 government employees from various departments, including more than 700 women employees, squatted on the road in front of panchayat union office here, defying police orders and courted arrest.", 
    "section": "national", 
    "title": "Government staff block road, court arrest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}