{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Madras High Court has confirmed the conviction and 28 months of imprisonment imposed by a trial court in 2005 on S. Krishnaraj, former Director of Stationery and Printing, Government Press, Puducherry, on charges of acquiring assets and pecuniary resources, to the tune of Rs.5.65 lakh, disproportionate to his known sources of income between 1985 and 1993.\n\nIn a judgment reserved in the Principal Seat of the High Court in Chennai and delivered at its Bench here, Justice A. Selvam held that the Central Bureau of Investigation (CBI), Anti-Corruption Branch, Chennai had succeeded in establishing the charges levelled against the convict but the latter, in turn, had miserably failed in disproving the charge and adducing satisfactory evidence in his defence.\n\nHe pointed out that the CBI had proved that one of the sons of the accused had pursued MBBS in Raja Muthiah Medical College, Annamalai University and huge amount of money was spent towards his education. A Professor had deposed in court that Rs.10.11 lakh was paid to the college between 1989 and 1991 towards mess and establishment charges alone.\n\nThough the convict had claimed to have sold jewels belonging to his mother and wife to educate his sons and also made the two women depose in his defence before the trial court, no documentary evidence was produced to support the claim. “If really, DW1 and DW2 had sold their jewels, definitely some receipts would have been marked on the side of the accused before the trial court,” the judge said.\n\nFurther, stating that many valuable immovable properties had been purchased in the name of the convict as well as in the name of his wife during the check period, the judge said no trustworthy evidence had been produced to accept the convict’s claim that those properties were purchased with the independent income received by his wife through a cargo boat gifted by her father.", 
    "section": "national", 
    "title": "HC confirms conviction in 22-year-old disproportionate assets case", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}