{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Coming down heavily on the Principal Secretary of Tamil Nadu Municipal Administration and Water Supply Department for seeking more time for implementation of amendment to the Chennai Municipal Corporation Act, 1919, paving way to impose enhanced penalty on illegal sewage connections, the Madras High Court wondered what is the great legislative change required for a simple exercise of increasing the fine.\n\nThe issue pertains to a public interest litigation (PIL) moved by activist A. Narayanan to check manual scavenging in the State. In a recent hearing, the Deputy Commissioner of Corporation, Chennai, in his status report on manual scavenging, submitted that super sucker machines hired from other States are being used round the clock and has already cleared 3,100 tonnes of silt from storm water drains till date.\n\nWith regard to illegal sewer connections, the report said that a penalty between Rs. 100 to Rs. 2000 has been levied on the violators. Observing that the penalty is very less, court said, “The penalty should be graded from Rs. 5,000 to a couple of lakh of rupees, depending on the nature of the buildings.”\n\nWhen the petition came up for hearing before the First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh on Friday, the authorities submitted the draft of amendment proposed.\n\n“We would have required this exercise to be completed at the earliest, but considering the ground reality in view of the Assembly elections, it does not permit this to be done and thus, we call for this exercise to be completed at least by the end of June 2016,” the Bench said.\n\nRecording the submission that in respect of Municipalities and Corporations other than Chennai, the authorities concerned have sent their respective proposals for bringing amendments, the Bench directed that this exercise would also be completed simultaneously with the exercise of the Chennai Corporation by the end of June, 2016.\n\nThe Bench then posted the matter to April 15 for filing status report.", 
    "section": "national", 
    "title": "HC raps Chennai Corporation for delay in increasing fine for illegal sewers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}