{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "RELIGION\n\nMata Amritanandamayi Math: Brahmasthanam Temple festival, Mata Amritananda Mayi takes part, Nallampalayam Math premises, 10:30 a.m.\n\nRathina Vinayakar Temple: Sashti, temple premises, DB Road, R.S. Puram, 8.30 a.m.\n\nJeevajothi: family fellowship, Gujarat Samaj, Near North Coimbatore Chinthamani,\n\n10.30 a.m.\n\nGENERAL\n\nKamban Kazhagam: 44{+t}{+h}anniversary celebrations, Mani High School, Pappanaickenpalayam, 5.45 p.m.\n\nKovai Aram Trust: Release of documentary on self-confidence of Kalaimamani S.R. Krishnamurthy’s achievements, Tamil College, Perur, 10 a.m.\n\nRotary District 3201: Inauguration of the Rotary District Conference, K.V. Chowdary, Chief Vigilance Commissioner, takes part, Hotel Le Meridian, 9 a.m.\n\nBritish Council: Education @ UK Exhibition, The Residency, Avanashi Road, 12 noon.\n\nGRD Institute of Management: Face to face with Dr.Kiran Bedi IPS, college premises, 2 p.m.\n\nSmt.D.Padmavathi Ammal High School: Sports day; Annual prize distribution day,\n\n8:30 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Quiz programme for young minds, Auditorium, 10 a.m.\n\nBishop Ambrose College: Sports day, 2 p.m.\n\nKovai Medical Center and Hospital Limited: Guest lecture on ‘An Introduction to Drug Procurement and Inventory Management’,\n\n11 a.m.\n\nSri Ramakrishna Institute of Technology: Workshop on ‘Disaster Mitigation & Strengthening of Structures using Micro Piling’, Seminar hall, 9 a.m.\n\n5 {+t}{+h} Pillar: Training on ‘Right to Information Act’, T.V. Samy road, R.S. Puram, 4 p.m.\n\nG.R. Damodaran Academy of Management: Entrepreneurship week, valediction, 10 a.m.\n\nNehru Arts and Science College: National Level Technical Symposium “Electroholix”,\n\n10 a.m.\n\nKovai Modelers Club: First On-road GT Race, Gedee Driving Institute, 4:30 p.m.\n\nAngappa CBSE Senior Secondary School: Annual day celebrations, 4:30 p.m.\n\nDakshina: Life Transforming Program, Vennila building, Peelamedu, 6 p.m.\n\nThe Coimbatore Productivity Council: Productivity week celebration, Council conference hall, 5:30 p.m.\n\nKGISL Institute of Management: National conference on ‘Advance Computing and IT Applications’, IIM Auditorium, 10 a.m.\n\nKumaraguru College of technology: Inter- Collegiate Techno Cultural fest, 9:30 a.m.\n\nPSG College of Nursing: Conference on ‘Neonatal Nurses: Champions for Survival of Neonates’, PSG IMS&R Auditorium, 11 a.m.\n\nSankara Institute of Management Science: Workshop on ‘Short Management Lesson’ by Mumbai Dabbawala, 2 p.m.\n\nKovai Kalaimagal Matriculation Higher Secondary School: Annual day celebrations, CIMAT Auditorium, 2 p.m.\n\nPSG Polytechnic College: National Level Technical Symposium ‘Polymeet’, 9 a.m.\n\nRathinam College of Arts and Science: Faculty development programme on ‘E- Resources for Teaching, Learning and Research’, 10 a.m.\n\nCoimbatore Management Association: Student Management Day, GRG School, Peelamedu, 8:30 a.m.\n\nPSG College of Arts and Science: Inter Collegiate meet ‘Cascall 2k16’, GRD Auditorium,\n\n9 a.m.\n\nInner Wheel Clubs: Greener Kovai – Planting of Saplings, Charlottee De Vos, President of Inner Wheel International, Mamta Agarwal – President of Inner Wheel Clubs Association of India, Chitra Vivek – District Chairman of Inner Wheel, near RAF Camp, Vellalore, 11 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Lecture on Wireless and Mobile Communication, 9.30 a.m.\n\nUDHAGAMANDALAM\n\nBird Count India: The great backyard bird count, 8:30 a.m.\n\nNilgiri Natural History Society: Campus bird count, Lawrence School, Lovedale, 3 p.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}