{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Onion and vegetable shops (left) were closed at Gandhi Market in Tiruchi on Friday in response to the strike called by the traders' associations while it was business as usual for the hawkers.— PHOTOS: A. MURALITHARAN\n\nThey were protesting against move to relocate them some of them to Kallikudi\n\nmajority of traders of Gandhi Market downed their shutters on Friday to draw the attention of the government to their concerns over a possible move to shift them to the new Central Market for Vegetables, Fruits and Flowers, coming up at Kallikudi on the outskirts of the city.\n\nThe 24-hour strike commenced at 10 p.m. on Thursday in response to a call given many traders’ associations. While most shops, including wholesale and retail ones dealing in onion, potato, and vegetables, remained closed, some retailers were seen functioning. A few associations such as the platform traders and fruit sellers had announced that they were not participating in the strike.\n\nAlthough there was no indication from any of the government agencies on the possibility of shifting the traders to the new market, the traders organisations had expressed apprehensions that they may be asked to do so.\n\nThe traders contended that the new market at Kallikudi did not have adequate number of shops to accommodate all traders operating out of Gandhi Market now. Besides, the shops built at the new market were small in size and would not meet the requirement of wholesale and retail traders, they contended.\n\nThe strike comes in the context of a long-pending proposal of the Tiruchirapalli City Corporation to shift the market to the outskirts of the city. The Gandhi Market, established in 1940, has over 1,000 permanent and pavement shops on about six acres of land. The new central market is coming up on 10 acres of land at Kallikudi, off the Tiruchi-Madurai National Highway, about 15 km from here.\n\nIn a statement here, Ve. Govindarajalu, State general secretary, Tamil Nadu Vanigar Sangangalin Peramaippu, which called for the strike in coordination with the traders’ associations of the market, said that 27 associations participated in the strike.\n\nIn a representation to the Chief Minister, Mr. Govindarajalu said any move to shift the traders to the new market would pose practical difficulties. There were over 2,500 shops in the Gandhi Market, he said and affirmed that all could not be accommodated at the new market.\n\nBesides, the shops at the new market were located on three floors and unsuitable for traders. The shops, he said, were just 10x10 feet in size. Wholesale traders would require shops of a minimum size of 1,000 square feet and retailers about 500 sq. ft. of space.\n\nMany retailers were women and they would face difficulty in operating from the city outskirts. Besides, it would entail higher transportation costs, he contended. Instead of shifting the market, Mr. Govindarajalu said the Gandhi Market could be expanded if the Women’s Prison, adjacent to the market, was shifted to some other place.\n\nNOT AN EASY TASK\n\nTraders’ associations want all the shops to be shifted to the new place\n\nA majority of retail traders, particularly women, may find it difficult to travel to Kallikudi", 
    "section": "national", 
    "title": "Most traders in Gandhi Market stay shut", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}