{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "A participant demonstrates his skill in kite-boarding and another rides a water scooter (right) at Manapad Classic-2016 event in Thoothukudi district on Friday.— PhotoS: N. Rajesh\n\nIt’s my dream to promote Manapad as the biggest tourist spot: Tourism Commissioner\n\nThe three-day national-level sea sports event, ‘Manapad Classic-2016’, was inaugurated in the shallow waters of Manapad coast on Friday. Inaugurating the event, Tourism Commissioner Har Sahay Meena said that it was his dream to promote Manapad as the best and the biggest tourist spot in south India.\n\nHe said that he would request the government to bring more facilities to Manapad. More such sea sports events should be organised in the State which had a 1,076-kilometre-long coastline. With its pristine coast, Manapad offered a platform to host such adventurous sports.\n\nEndowed with natural beauty, Manapad would emerge as a tourism village with the cooperation of the local people, who would be trained as tourist guides, he said.\n\nTourism would be encouraged in all the 13 coastal districts of the State under Swadesh Dharshan Scheme, and a proposal to this effect was ready at a cost of Rs. 95 crore. Beaches would be provided with sit-out facilities, floating jetty, small cafeterias, better roads and walkers’ paths. Tender for these developments would be called for after a detailed project report was prepared. There were also plans to create a tourism circuit connecting Kanyakumari, Tirunelveli, Thoothukudi and Ramanathapuram, he told The Hindu .\n\nCollector M. Ravikumar said that a proposal had been sent to the government for establishing a water sports academy in the district at a cost of Rs. 7 crore. Sea sports would be introduced on Tharuvaikulam coast which also had ideal weather conditions, he added.\n\nVolunteers of Puthu Vazhvu Thittam and Mahalir Thittam had put up food stalls on the shore.\n\nArun Miranda, programme organiser, said that apart from the scheduled events of sailing, surfing, kite-boarding, kayaking, wind surfing and stand-up-paddle events, slackline, beach volleyball and beach kabbadi events would be organised this time.\n\nTuticorin Sub-Collector S. Gopala Sundara Raj, Tiruchendur Revenue Divisional Officer Thyagarajan, Deputy Superintendent of Police (Coastal Security Group) N.K. Stanley Jones, Joint Director of Fisheries R. Amal Xavier, District Sports Officer L. Theerthose and others were present.", 
    "section": "national", 
    "title": "National-level sea sports event begins at Manapad", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}