{
    "author": [
        "P V"
    ], 
    "text": "The Valentine’s Day falling on the weekend has taken the punch out of exports for rose growers here. There has been a 20 to 50 per cent fall in export of roses this week.\n\nHosur is the largest exporter of roses in the country, followed by Bangalore, which primarily sources them from growers here.\n\nIn the last few years, a mix of global factors has played up to cut through the demand for Indian roses. African roses have found a huge market in Europe. Kenya and Ethiopia have swooped the market with their premium quality roses and competitive pricing. “The prices are not competitive for Indian roses. The weather, water and soil has helped in premium quality rose production in the two counties.\n\nWhile we grow 7.5 lakh flowers per acre, they are able to grow 9.5 lakh flowers, and export them at competitive prices,” says Bala Sivaprasad, president, Hosur Small Farmers Association.\n\nThis year, his exports have fallen by 50 per cent. However, exporters who are also growers had expected this since December and had scaled down their production accordingly. Chinese New Year on February 8 and 9 had given a long holiday week in the countries of the Far East, particularly, Malaysia and Singapore with a significant Chinese population. These are largest importers of Indian roses. “In addition, Valentine’s day has fallen on a weekend, just like last year. So, it was expected,” says Mr. Sivaprasad. A significant area was affected by Downy Mildew disease caused by heavy rains during the preparation period. This year, the total exports are estimated to be between 50 lakh to 60 lakh flowers from Hosur and Bangalore during the Valentine week. The best year was 2013-14, when over 1.5 crore flowers were exported.\n\nMr. Sivaprasad, who usually purchases about 1.5 lakh stems from growers during Valentine season, had scaled it down 25,000 flowers.\n\nThe week running up to Valentine’s day, usually witnesses a full volume production, says M.Sridhar Chowdary, Managing Director, Vinayaka Agrictech, Bagalur. But growers cautiously spread out their production pre-empting a sluggish market. According to Nagesh, a small farmer cultivating on 2 acres in Berigai, no additional production was planned.", 
    "section": "national", 
    "title": "Not a bed of roses for these farmers in Hosur", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}