{
    "author": [
        "S Senthalir"
    ], 
    "text": "The houseboat launched by Chief Minister at Chunnambar Boat House in Puducherry on Friday. (Right) Tourism Minister P. Rajavelu and R. Anu, Director of Mantra House Boat Private Limited, visit the houseboat and (below) the conference hall on the upper deck of the facility.— Photos: S.S. Kumar\n\nThe boat modelled on the lines of those in Kerala will be open to tourists from February 20\n\nThe much-awaited houseboat at Chunnambar Boat House will be open to tourists from February 20.\n\nModelled on the lines of houseboats in Kerala, the hull of the boat is made of wooden planks and covered with bamboo and palm leaves.\n\nThe lower deck of the 99-foot-long and 17-foot-wide houseboat comprises three bedrooms with attached toilets and a kitchen. The bow of the boat serves as a dining hall furnished with table, chairs and a television. All three bedrooms are air-conditioned and furnished. Every room has small window opening to the sea. A narrow wooden stairways leads to the upper deck covered with bamboo and with thatched roof, which serves as a party or meeting hall.\n\nChief Minister N. Rangasamy on Friday inaugurated the houseboat. Tourism Minister P. Rajavelu was present.\n\nHowever, it would take at least a week to be open for public use.\n\nR. Anu, director of Mantra House Boat Pvt. Ltd, said that there were few works pending and it will take at least a week to complete them.\n\n“It is tentatively scheduled to be open for public on February 20,” said R. Mounissamy, Director of Tourism.\n\nPuducherry Tourism Development Corporation Limited had signed a memorandum of understanding (MoU) with the Mantra House Boat Private Limited last year to introduce houseboat at Chunnambar.\n\nThe ticket rates are fixed at Rs. 10,000 per room for two people which includes food and accommodation. For the party or conference hall, Rs. 2000 per person would be charged.\n\nThe conference hall can accommodate up to 50 people. This is similar to the one in Azhapuzha.\n\n“As per the MoU, 10 per cent of the revenue generated would go to the government,” Vaiyapuri Manikandan, chairman, Puducherry Tourism Development Corporation (PTDC) said.\n\nThe houseboat will cover 4 km around Paradise Island. It will start the journey at 11 a.m. from the main land of Chunnambar Boat House. Passengers will be served tea or fruit juice on deck. The houseboat will reach Paradise Island by 12 p.m.\n\nPassengers will either be served vegetarian or non-vegetarian food, depending on their choice. The boat will have chefs to cook and supply food. After lunch, passengers can take a short nap in their room or go to Paradise Island. By 3 p.m., it will continue its journey and it will be anchored at 6 p.m.\n\nThe passengers can spend their night in the houseboat. Next day, breakfast would be served on the deck and the boat will return and reach the alighted point by 10.30 a.m.\n\nThe houseboat will have fire-fighting equipment, sufficient number of life jackets, medical facilities and expert swimmers. This is an effort to promote tourism in Puducherry. The corporation will get a minimum of Rs. 20,000 per month or a maximum of Rs. 45,000 if all the rooms are occupied throughout the month.", 
    "section": "national", 
    "title": "Pack up for houseboat stay at Chunnambar", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}