{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Proliferation of industries around Viralimalai causing their displacement\n\nPeacocks and peahens have found a new home on the campus of the TNAU Agricultural College and Research Institute campus at Navalur Kuttapattu near Tiruchi.— PHOTO: M. SRINATH\n\nThe sprawling campus of the Tamil Nadu Agricultural University Anbil Dharmalingam Agricultural College and Research Institute and the Horticultural College and Research Institute for Women has turned out to be an asylum for peacocks and peahens.\n\nThe “migration” of the national bird from the Viralimalai area to this campus at Navalur Kuttapattu, commenced about two years ago and the count of peacock and peahens has increased to considerable extent on the campus in the last three years.\n\nOfficials say the setting up of industries — on minor and small scale segments in a cluster of villages in and around Viralimalai has been resulted in the displacement of the birds forcing them to migrate to the TNAU college campus. The authorities of the colleges had been facing the problem as the crop on the research plots and students’ trial plots were damaged by peacocks and peahens.\n\nScientists of the college told The Hindu that a wide range of crops were cultivated on the fields, only to be destroyed by peacocks and peahens, particularly during the near-harvest period. “Worst-hit are the research departments which raise various crops for examination and study. The problem has been on the rise for the past three years,” says P. Pandiyarajan, Dean of the Institute.\n\nThese birds feed on green gram and black gram crops.\n\nDocumentary\n\nMr. Pandiyarajan said that his institute was preparing a documentary on the change in the lifestyle of the peacocks and peahens in this part of the region. “The sprawling area has been facilitating breeding of birds.\n\nQuiet ambience free from noise pollution has been the most favouring environment for the birds,” he said.\n\nThe documentary would focus on the behavioural changes in birds. “From the usual shy and frightened behaviour, the birds can be seen moving about freely all around the campus,” he says.\n\nFarmers said poor rainfall in Pudukottai district, especially in the Viralimalai region, resulted in the migration of the birds to adjoining fertile fields in Tiruchi district.", 
    "section": "national", 
    "title": "Peacocks flock agriculture college campus", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}