{
    "author": [
        "B Kolappan"
    ], 
    "text": "DMK treasurer M.K.Stalin addresses journalists after completing his 'Namaku Naame' campaign at T.Nagar in Chennai on Friday. -Photo: B. Jothi Ramalingam\n\nWhile a section of DMK leaders accuse the People’s Welfare Front (PWF) of being a proxy for the ruling AIADMK, party treasurer M.K. Stalin said he did not consider the PWF as a big force in Tamil Nadu politics.\n\n“We are not afraid of the PWF because we don’t consider it as a threat,” Mr. Stalin told reporters after winding up his Namakku Naamey programme on Friday morning.\n\n“We can’t remain silent when our party is subjected to undue criticism by the leaders of the PWF,” he said responding to a question on Mr. Karunanidhi’s reply to CPI (M) leader G. Ramakrishnan.\n\nMr. Stalin said the perception he had gathered during his tour across the State was that people were desperate for a change.\n\n“They feel that the administration has come to a standstill. They are not able to meet the Chief Minister or her Cabinet colleagues to express their grievances,” he said.\n\nReiterating that if elected to power the DMK government’s first order would be for total prohibition as the drinking habit had completely undermined the Tamil culture, Mr Stalin said the order would be issued simultaneously for withdrawing defamation cases against media organisations and journalists.\n\nHe, however, refused to discuss the ways and means the DMK had in mind to overcome the financial loss likely to be caused by closure of the TASMAC-run retail liquor shops.\n\nMr. Stalin also promised to put an end to the culture of erecting vinyl boards and mega cutouts for political leaders, saying that he kept to the minimum the advertisements for his Namakku Naamey programme.\n\n“We will offer a transparent government,” he assured.\n\nThe DMK government would order a judicial inquiry into the sudden release of water from Chembarambakkam lake during the flooding of Chennai.\n\nAsked whether he relied on his son-in-law Sabareesh for taking decisions, Mr. Stalin said “you cannot clap with one hand.”", 
    "section": "national", 
    "title": "PWF not a big force, says Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}