{
    "author": [
        "K Manikandan"
    ], 
    "text": "Railway commuters have welcomed the High Court’s direction to Southern Railway to ensure cleaner toilets. These commuters have specific problems in mind for which they expect a solution.\n\nFor example, commuters who want to use the toilet at the platform on the second floor of the Thiruvanmiyur Mass Rapid Transit System station find themselves in a peculiar situation. If they have to use it, they are required to get the key from the ticket booking office on the ground floor after surrendering a proof of identity and then go back to the second floor.\n\nAfter using it, the commuters have to lock it, surrender the key at the counter, collect their identity card and then resume their journey. The condition of toilets at railway stations on the suburban and MRTS routes across Chennai is a cause for worry. The Southern Railways has continued to ignore it for years, commuters and activists complain. Commuters have also complained that some stations have only a building, but no basic amenities like water supply, while some others have all amenities in place, but no staff or private contractors are present to maintain them.\n\nUnder such circumstances, commuters often soil the approach roads leading to the stations and open spaces near platforms, while women suffer much more in the absence of well-maintained toilets, they said.\n\nOfficials said that in the case of Thiruvanmiyur station, the toilet was kept open at least during the rush hour and they had no other option but to keep it locked during the rest of the day. In many stations, toilets did not have enough patronage and hence when they floated tenders calling for maintenance contractors, private firms or individuals did not turn up, officials said.\n\n“If toilets are well-maintained, we will be more than happy,” said V. Bharathi, a woman commuter who travels from Chintadripet to Tirumayilai regularly.", 
    "section": "national", 
    "title": "Railway users await cleaner toilets", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}