{
    "author": [
        "K Manikandan"
    ], 
    "text": "Impact of building collapse of 2014 and December rains now far behind, say speakers at ‘Resilient Chennai’\n\nNow that the realty sector has recovered from the setback caused by the floods of December, it is time for growth, say builders and analysts.\n\nAll the speakers at a discussion on ‘Resilient Chennai’, organised by the Confederation of Real Estate Developers’ Association of India (CREDAI) Chennai and Jones Lang LaSalle on Friday, struck a positive note, saying that every calamity would cause a setback, and its effect would not be long-lasting.\n\nFor instance, following the tsunami of 2004, there was an impact on property along East Coast Road, but the crisis blew over. Similarly, the impact caused by the building collapse of 2014 and the flood of December last year was now far behind, they said.\n\nReferring to the peak of realty growth achieved some years ago, Ajit Kumar Chordia, president of CREDAI Chennai, said Tamil Nadu could no longer live on the glories of its past.\n\nHe, however, expressed the hope that good times were ahead for the realty sector.\n\nMr. Chordia added that no force could stop the growth once the Assembly elections were over in Tamil Nadu.\n\nStimulus needed\n\nAccording to him, growth has to be achieved quickly. The State government should come up with a stimulus to bolster overall growth in all sectors – be it information technology or manufacturing.\n\nHe said that Outer Ring Road and Metro Rail would fuel growth in Chennai, as was evident from how similar projects in Bengaluru transformed that city.\n\nThe Governments in Andhra Pradesh and Telangana were marketing their State aggressively, and government officials were reaching out to their prospective investors and encouraging them to set up their businesses in their respective States, they said, adding Tamil Nadu should not be left behind in the competition.\n\nMany advantages\n\nTamil Nadu had the potential to be a leader and had many advantages, including many ‘economic growth drivers’ in the form of automobile, manufacturing and IT sectors. Marketing its strengths would lead to an all-round economic development, triggering growth in the realty sector and job creation, said Mathew Joseph, member of executive management, HDFC.", 
    "section": "national", 
    "title": "Realty sector set for growth, says CREDAI", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}