{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "All India Samthuva Makkal Katchi leader R. Sarathkumar on Friday taking a selfie with activists who were on a fast at Avinashi in Tirupur district seeking speedy implementation of Athikadavu - Avinashi Flood Flow Canal scheme.—Photo: R. VIMAL KUMAR\n\nAll India Samathuva Makkal Katchi leader R. Sarathkumar slammed the concept of making political alliances between parties for the mere sake of coming out victorious in an election process, and further termed that almost all the alliances were just ‘alliances of convenience’.\n\n“I feel why political parties cannot fight on their own putting forward their agenda to the people and seek votes instead of forming alliances by roping in parties from here and there at the last moment.\n\nMost of such alliances seem to be falling apart subsequent to the elections,” he told answering queries from The Hindu at Avinashi on Thursday.\n\nAccording to him, if Arvind Kejriwal can post a comprehensive win defeating the bigwigs in Delhi elections by solely relying on his party’s strengths why other parties cannot replicate the same.\n\n“It is possible provided the parties have dynamic/able leadership,” he said.\n\nMr. Sarathkumar was at Avinashi to kick-start the State-wide vehicle campaign of the party ‘Maatrathe noki makkal santhippu’ which was aimed at obtaining the views of voters in person.\n\nHe commenced the campaign by offering prayers at the historic Avinashilingeswara Thirukoil and then extended solidarity to the activists, who were on a fast to get the Athikadavu - Avinashi Flood Flow Canal scheme implemented at Avinashi.\n\nMr. Sarathkumar said his party plans to bring out the election manifesto and announce strategy within the next 10 days after incorporating the suggestions made by the people during the interactions in the campaign.", 
    "section": "national", 
    "title": "Sarathkumar flays ‘alliances of convenience’ for elections", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}