{
    "author": [
        "Special Correspondent"
    ], 
    "text": "As cities like Chennai and Visakhapatnam expand, policymakers must address the growing demands of rapid urbanisation, said United States Department of Commerce Deputy Secretary Bruce Andrews.\n\nSpeaking at a conference on Smart Cities organised by the Indo-American Chamber of Commerce and the US Department of Commerce here on Thursday, Mr. Andrews said that Smart Cities represented the future of urbanisation, technology and sustainability, not just in India, but around the world. He led a trade delegation of officials and 18 tech companies from the United States. “Building the Smart Cities of the future requires all of us to work together and share lessons from around the world, just as we did in Paris during the climate summit,” said Mr. Andrews.\n\n“Three hundred million people are expected to move to India’s cities over the next twenty years, roughly the entire population of the United States. This means that the decisions that India makes today about how to handle that growth will have huge implications for the future of this country, and the world. India has the chance to be a leader in the world’s efforts to address global challenges such as climate change as well as a leader in the competition for capital and top talent,” said Mr. Andrews.\n\nMr. Andrews said, “now is the time to deepen our already strong commercial relationship. But as we explore new ways to collaborate, we will not realise the full potential of our relationship if we do not tackle lingering challenges.”\n\nHe said greater U.S. private sector investment for building Indian Smart Cities would depend on addressing persistent business challenges. For example, capital-intensive projects were often delayed by legal disputes. This could be addressed by improving firms’ access to private capital, including through development of India’s capital markets and improvements in public-private-partnerships.\n\nDecisions that India makes today will have huge implications for future", 
    "section": "national", 
    "title": "Smart Cities represent future of urbanisation: U.S. official", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}