{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ganapathy Venugopal, Chief Executive Officer, Ailor, awarding the winner of a startup contest, Aarambam, organised by Nativelead Foundation in association with Young Indians in Madurai on Friday. To his left is Latha Rajan, Diretor, MaFoi Strategic Consultants. K. Thiagarajan, co-chair, Young Indians, Madurai Chapter, is seen.— Photo: G. Moorthy\n\nThe startup eco system of Madurai took a step forward on Friday with the second edition of business plan contest, Aarambam, organised by Nativelead Foundation and the local chapter of Confederation of Indian Industry-Young Indians.\n\nAmong the 84 entries from students and 33 from mainstream entrepreneurs chosen for the preliminaries held on February 6, three in the first category and two in the second walked away with the prizes. The topper of the event was Sahayak Edusquare team of Indian Institute of Technology-Madras for its project of conversion of academic books into comics for joyful reading. This was followed by Foodly of PSG College of Arts and Science, Coimbatore, for its project to ensure nutritious food for children till nine years of age. The third prize went to the 1 is 10 team of Thiagarajar College of Engineering, Madurai, for its project to maintain two bookstores to collect and lend books.\n\nMainstream event\n\nIn the mainstream event, the first place went to VE Clean, a project of Madurai that offers professional cleaning services, and iEdutopia of Bengaluru, a concept that envisages the creation of a mobile app to connect schools with parents.\n\n“Failure, no bad thing”\n\nDistributing the prizes, Ganapathy Venugopal, Chief Executive Officer, Axilor, and former Head, Strategy and Planning, Infosys, highlighted the opportunities for startups in India, which was considered the third startup eco system in the world, and how the experience of doing something on their own would be unparalleled for students. Though failure was not such a bad thing anymore, entrepreneurs could make their ventures profitable by focusing on diversity, people’s preference and right local investors.\n\nRight idea at the right time\n\nLatha Rajan, Director, MaFoi Strategic Consultants, said that every student in the country should be open to entrepreneurship and they should come up with the right idea at the right time, accompanied by a plan of action. K. Thiagarajan, co-chair, Madurai chapter of Young Indians, while pointing out that a lot of big companies had come out from educational institutions said that one of the Techno Business Incubators allotted for Tamil Nadu would be based at the Thiagarajar College of Engineering.\n\nR. Sivarajah, founder, Nativelead Foundation, explained the objectives of Aarambam. Nagaraja Prakasam, chairman, Native Angels Network, wanted the students to make a difference by converting problems into opportunities. Manjunath of Happy Hens, winner of the first edition of Aarambam, narrated how their startup of providing healthy eggs to consumers had grown into a leader.", 
    "section": "national", 
    "title": "Startup movement in city takes a step forward", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}