{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CECMAR conference on ‘Athenaeum’ gets under way at BIM\n\nManagement students should update their knowledge to meet the emerging challenges, said Sunder Ramaswamy, Officiating Director, Madras School of Economics.\n\nAddressing students of the Bharathidasan Institute of Management at the inaugural of the two-day international conference on “Athenaeum” organised by the Centre for Contemporary Management Research (CECMAR) here on Friday, he explained the impact of globalisation on economic growth and development. He said the young management students had a major role to play in future, in the wake of emerging trends and practices. He expressed the hope that the conference would achieve the objective of promoting research.\n\nKaruthiah Pandian, Director of Bharathidasan Institute of Management, said the CECMAR, started in 2006, had been encouraging scholars, faculty members, and industry across the world to take to research activities. He said CECMAR was at present supporting the initiative to promote research on “The Journal of Contemporary Management Research” carried in the ISSN registration since 2007.\n\nIt had been widely acknowledged as the reputed journal on research works on global standards.\n\nOn the mission of Anthaneum, he said it could change the face of management in future as it had been integrating academics, research scholars, consultants, practitioners, and industry leaders. It had been promoting a network of researchers in Asia-Pacific, West Asia, Europe, and Africa.\n\nThe objective of the conference was to showcase outstanding research contribution from academia and industry providing professional forum for exchange of ideas.\n\nHe said the present-day global trade and management witnessed a new environment and provided opportunities as well as challenges.\n\n“Organisations and markets are in transition towards digital, smart and network age,” he said and added that managers, leaders, and entrepreneurs had a great role in tackling a new wave of transformation.\n\nHence the theme of the conference was “managing transformation”, he said.\n\nApart from sharing research work, delegates would have an opportunity to explore new areas in research, research tools, and would learn the art of publishing their works in leading journals. The two-day conference concludes on Saturday.", 
    "section": "national", 
    "title": "Stay updated on emerging challenges, B-school students told", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}