{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "‘Failure to supply video footage to members violated norms of natural justice’\n\nA Supreme Court Bench of Justices J. Chelameswar and A.M. Sapre on Friday ordered revocation of suspension of six DMDK legislators from the Assembly. The MLAs, who were suspended last March on charges of committing a breach of privilege, had moved the court contending that their suspension was a violation of their right to occupation.\n\nThe Supreme Court said being a legislator was not an “occupation” and his suspension under the procedural rules of the legislative body for misconduct in the House is not a violation of his fundamental right to occupation under Article 19 (1) (g) of the Constitution, the Supreme Court held on Friday.\n\nDisagreeing with the lawmakers, Justice Chelameswar, who wrote the judgment, said the term “occupation” used in Article 19 (1) (g) is “limited by the economic imperative of livelihood generation”. That is, activities which enable a citizen to generate economic benefits and protect the fruits of his labour.\n\nBut the constitutional office of a legislator, on the other hand, was not a paid job. It is a “component in the larger machinery established to make possible for the people of this country to realise the goals indicated in the Preamble of the Constitution”.\n\n“Constitutional offices commencing from the office of the President of India are meant for and established for securing the goals adumbrated in the preamble to the Constitution. Any monetary benefit incidental to the holding of such offices is only to compensate for the time and energy expended by the holder of the office in the service of the nation. It is for this very reason that a member of a legislative assembly cannot be treated as holding office for the purpose of eking out a livelihood,” the Supreme Court held.\n\nThe judgment observed that membership in the Assembly completely depends on choice of the electorate and tenure is limited.\n\nBut, the six legislators’ contention that their suspension amounted to the violation of their fundamental right to free speech under Article 19 (1) (a) of the Constitution was rejected.\n\nOn this, Justice Chelameswar observed that Article 19 (1) (a) does not apply to legislators temporarily disabled from participating in the Assembly by a legislative body as per procedural rules prescribed under Articles 105 and 194 of the Constitution.\n\nThe suspension of MLAs was based on a Privileges Committee report that their alleged misconduct on February 19, 2015 amounted to breach of privilege.\n\nBut the apex court held the committee failed to uphold the basic principles of natural justice by not show them a video recording of the alleged incident.\n\n“It is the legal obligation of the Privileges Committee to ensure that a copy of the video recording is supplied to the petitioners in order to satisfy the requirements of the principles of natural justice The failure to supply a copy of the video recording or affording an opportunity to the petitioners to view the video recording relied upon by the committee in our view clearly resulted in the violation of the principles of natural justice i.e. a denial of a reasonable opportunity to meet the case,” the apex court held.", 
    "section": "national", 
    "title": "Suspension of six DMDK MLAs unlawful, says SC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}