{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple: Thirupallioda thiruvizha, Namperumal purappadu from sanctum sanctorum in pallakku, 6.30 a.m.; reaching Kasukadai Chettiar Asthana Mandapam, noon; purappadu from the mandapam in Velli Garuda vaganam, 6 p.m.; reaching vagana mandapam, 8.30 p.m.; purappadu, 8.45 p.m.; reaching sanctum sanctorum, 9.15 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, No. 41, Thiruvalluvar Street, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, F18, Thilagar Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nAnna Science Centre Planetarium: Workshop for home makers on Organic fertilizer for terrace gardens for home makers, Sultan Ismail, resource person, Planetarium premises, 4 p.m.\n\nBharathidasan Institute of Management: Athenaeum – international conference on management research, Hotel SRM, 9.30 a.m.; valediction, P.Vijayaraghavan, chief guest, 5 p.m.\n\nZamindar Higher Secondary School, Thuraiyur: Platinum jubilee, Kavidasan, Director, Roots Group of Institutions, chief guest, 3 p.m.\n\nM.A.M. College of Engineering: Graduation Day, V. Uma, Controller of Examinations, Anna University, Chennai, delivers graduation day address, 5.30 p.m.\n\nSt. Joseph’s College: Seminar on “Extension activities – challenges and opportunities”, 9.30 a.m.\n\nJamal Mohamed College: Lecture on “Relevance of monetary policies today” by S. Iyyampillai, professor, Department of Economics, Bharathidasan University, 11 a.m.\n\nShrimati Indira Gandhi College Department of Business Administration: Valediction of seminar on “Corporate social responsibility”, S. Gayathri, associate professor, Bharathidasan Government College for Women, chief guest, 4.30 p.m.; Department of Management Studies: Lecture on Negotiation skills by Karthi Kumar, Senior general manager (materials), Dalmia Cements Ltd., 2 p.m.; Departments of Computer Science, MCA and IT Applications: Web based training for BA English students, 9 a.m.\n\nPeriyar School of Pharmaceutical Sciences: Workshop on “Traditional medicines – current approach”, V. Gopal, Principal, Mother Theresa Postgraduate and Research Institute of Health Sciences, inaugurates, 9 a.m.\n\nRane Polytechnic: Panel discussion on “building vocational skill base to strengthen manufacturing in India”, R. Venkatanarayanan, President - Corporate Services, Rane Group, speaks, Fathima Nagar, 10.30 a.m.\n\nSri Sivananda Balalaya: Life skills training programme by S. Kalavathy, former professor, Bishop Heber College, South Ramalinga Nagar campus, 10 a.m.\n\nRotary Club of Tiruchi Sakthi and MAM Group of Institutions: ‘Ezhuchi,’- programme for students of government and government aided schools, 10 a.m.\n\nAIMAN College of Arts and Science for Women: R. Revathi, principal, Shri Krishnaswamy College for Women, speaks on English literature as manifestation of human life, 9.30 a.m.\n\nK. Ramakrishnan College of Engineering: Workshop on “emerging wireless technologies and microwave devices through CAD”, 10 a.m.\n\nCARE School of Architecture and Youth Exnora International: Chithiram 2016 – annual student art contest, CARE campus, 9.30 a.m.\n\nJ.J. College of Engineering and Technology: State-level yoga competitions, S. Sathiyamoorthy, principal, presides, 10 a.m.\n\nShri Angalamman College of Engineering and Technology: Lecture on “Piping technologies” by Antony Joseph, 10.30 a.m.\n\nBishop Heber College Department of Social Work: Awareness programme on mental health, Panchayat Office, Perur, 12.30 p.m.; awareness programme on diabetes, Nachikurichi, 2 p.m.; training on mushroom cultivation and organic farming, Pulivalam, 3 p.m.\n\nChidambaram Pillai College for Women, Manachanallur: Lecture on “fuzzy soft set approach to decision making” by V. Anusuya, associate professor, Seethalakshmi Ramaswami College, 10 a.m.\n\nM.A.M. College of Engineering: Workshop on “Innovative Electronics”, K.C. Tamilventhan, Director, LIFT Technologies, resource person, 9.30 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Workshop on “e-waste management approaches and its impact on environment and health”, 10 a.m.; workshop on practice approaches on RF antenna design, 10 a.m.\n\nM.A.M. School of Engineering: District-level inter-school archery championship, 9 a.m.\n\nSRV Matriculation Higher Secondary School, Samayapuram: Kanavu Meipada - youth development programme, B.Ajitha, advocate, speaks, 5.30 p.m.\n\nCauvery College for Women: Annual sports meet, K. Jeyabarathi, DIG of Prisons, Tiruchi range, distributes prizes, 3 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-13"
}