{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "A seemingly inane exercise of holding meetings with women on health issues brought down neonatal death rates in five remote districts of Jharkhand and Odisha – a success story recorded in 2011 and 2012 that will feature in the February edition of medical journal The Lancet Global Health .\n\nThe model is already being scaled up, with the Union Health Ministry sending a circular to 10 States with a high burden of neonatal and maternal mortality earlier this month to emulate the ‘meeting’ approach to bring down newborn baby deaths. A quarter of world’s neonatal deaths and 15 per cent of maternal deaths are recorded in India.\n\nThe exercise’s appeal lies in its simple, yet effective approach. The trial, led by non-governmental organisation Ekjut that is active in Jharkhand and Odisha over the last decade, was carried out in 30 geographical clusters (each cluster with a population of 5,000 people and covering three to five villages) in five districts.\n\nGovernment accredited social health activists (ASHAs) were asked to spend an additional one hour in their meetings with women in the 15 to 49 age group. During these meetings, they discussed maternal and newborn health issues and possible solutions. They also set the agenda for the next meeting, identifying subjects such as nutrition or hygiene. Health workers made home visits following child birth to counsel families on newborn care and meetings were held with midwives and Anganwadi workers. In the subsequent meetings, women discussed if the solutions had worked practically.\n\nIn all, 4,903 meetings were held. The outcome? The early neonatal death mortality rate dropped from 49.8 to 30.2 in the first year of the research and then to 23 in the next year, much lower than the control clusters where the meetings were not held. A drop was recorded in the late neonatal mortality rate as well — from 13.7 to 3.8 in the first year to 2.8 in the second year. A drop was recorded in maternal mortality ratio as well.\n\nEkjut carried out this trial in collaboration with the Institute for Global Health, University College London (UK). “Communities were able to navigate through health issues better, choose a better midwife, and even choose a better vehicle (to take women for check-ups, delivery), and keep the newborn baby warm,” Dr. Prasanta Tripathy, founder of Ekjut, told The Hindu .", 
    "section": "national", 
    "title": "An exercise to reduce neonatal deaths", 
    "subsection": "general", 
    "date": "2016-01-30"
}