{
    "author": [], 
    "text": "The Chief Minister and the Speaker pitted one particular community against the other tribes and “incited, provoked and funded” communal politics against the Governor, referring to his “Assamese roots.”\n\nAs for claims that the emergency was a conspiracy hatched in New Delhi, the Centre said the loudest support for President’s rule was from within the State itself.\n\nThe MHA highlighted a December 28 memorandum forwarded to it by the President’s Secretariat. This document was individually signed by 34 MLAs of the 60-strong Assembly, all urging for President’s rule. “The memorandum makes it clear that the CM had lost majority in the Assembly and there was serious political instability in the State,” the Centre said.\n\nStating categorically that the imposition of emergency on January 26 is “absolutely legal and valid,” the Centre said Governor J.P. Rajkhowa had been briefing both the President and the Vice-President of the “political developments” throughout the period from October to December, 2015. It said the Governor’s reports showed that the “State was virtually being run by a minority government for several months.”\n\nThe Centre said the reports portrayed a Chief Minister and a Speaker who encouraged “indiscipline, lawlessness, politicking by government officials”, used public platforms and rallies to “condemn” and abuse the Governor and watched on as their supporters laid “siege” to the Raj Bhavan, without enforcing prohibitory orders or making a single arrest. All this while, the reports highlight, Arunachal Pradesh had suffered badly as a State.\n\n“A war-like scenario had been observed wherein the State Cabinet itself was participating in agitations,” the MHA told the court.\n\nThe Centre highlighted how the Speaker had locked out the legislators, preventing them from entering the Assembly Hall between December 15 and 18, in order to conduct a floor test of the Tuki government’s majority. This was done on the basis of a “source information” received by the Speaker that anti-social elements would try to burn down the Assembly building.\n\n“Locking of the Assembly premises amounts to locking of the Constitution of India... not to allow legislators even to visit the Assembly is subversive of the democratic set-up of the Constitution,” the Centre said. The “Assembly Session,” which led to the passing of a no-confidence motion against the CM, was finally held at a karate training hall instead of the Assembly Hall, it said.\n\nThe Centre justified President’s rule, saying the State was anyway heading towards a constitutional crisis.\n\n‘A war-like scenario had been observed wherein State Cabinet itself was part of agitations’", 
    "section": "national", 
    "title": "‘Central rule in Arunachal is in national interest’", 
    "subsection": "general", 
    "date": "2016-01-30"
}