{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Street View allows users to have a panoramic view of places in cities, as they would look in real life.- File Photo: Raghuvir Srinivasan\n\nThe Centre is unlikely to allow Internet giant Google’s Street View service in India amid red flags raised by the Ministry of Defence and security agencies.\n\nThe Ministry of Home Affairs (MHA), which was to take a decision on the matter, has put the ball in the Defence Ministry’s court for now, a senior government official said, speaking on condition of anonymity.\n\nIn April 2015, Google representatives made a presentation on Street View for the MHA. “They told officials that this platform was useful for tourism and disaster management.\n\nThey submitted a formal proposal in July to shoot images through high-end cameras and upload them on ‘Street View’.\n\nAs of now, we can say that intelligence agencies are also stonewalling it,” the official said.\n\nAhead of Prime Minister Narendra Modi’s visit to the Google headquarters in California in September last, it was anticipated that an announcement would be made for giving the plan the green signal. In 2011, Google launched Street View as a pilot project in some of the tourist sites like Qutub Minar, the Thanjavur temple, the Varanasi riverbank, the Taj Mahal, the Red Fort, Nalanda University, Mysore Palace and Chinnaswamy Stadium in partnership with the Tourism Ministry.\n\nPrivacy concern\n\nStreet View allows users to have a panoramic view of places in cities, as they would look in real life. The Internet giant uses cars and bikes fitted with cameras to collect 360-degree images of a place.\n\n“The case of Street View has going back and forth between various departments of Ministries.\n\n“Not all are on the same page when it comes to giving it the go-ahead. We are also looking at the stand taken by countries which have not allowed the platform,” the official said.\n\nThe service was launched in 2007 in the United States, and has since expanded to other parts of the world.\n\nThe Street View imagery has run into trouble in Germany, Greece, Switzerland, Poland and the United Kingdom amid privacy concerns and data protection issues.", 
    "section": "national", 
    "title": "Centre may not allow Google Street View", 
    "subsection": "general", 
    "date": "2016-01-30"
}