{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says she had a ‘business relationship’ with him, and had held talks at the CM’s official residence\n\nPolice caning DYFI activists, who were demanding the resignation of Kerala Chief Minister Oommen Chandy, in Thiruvananthapuram on Friday.— Photo: C. Ratheesh Kumar\n\nImplicating Chandy Oommen, son of Kerala Chief Minister Oommen Chandy, in the solar scam, Saritha S. Nair deposed before the G. Sivarajan Judicial Commission probing the solar scam on Friday that she had a “business relationship” with him, and had held discussions with him at the Chief Minister’s official residence itself about floating a partnership firm.\n\nShe deposed that discussions were held with the Chief Minister too, to form a firm called Kerala Renewable Energy Cooperative Society, in which Mr. Chandy Oommen and she were to be the partners. It was also proposed that a foreign firm, in which Chief Minister’s son was involved, would import solar panels.\n\nMr. Chandy Oommen had confirmed over phone the receipt of the Rs. 80-lakh bribe that had been collected by Chief Minister’s aide Thomas Kuruvila, she said.\n\nRegarding the allegations that she had an illicit relationship with the Chief Minister’s son, Saritha alleged that he had illegitimate relationship with another accused in the scam, and not her. Documentary evidence of foreign trips undertaken together by the duo was in the possession of Minister Thiruvanchoor Radhakrishnan, which he had flaunted during the time of a Cabinet reshuffle, she alleged.\n\nRefuting the Chief Minister’s deposition that the exchequer had incurred no loss in the solar scam, Saritha said a firm, Surana Ventures Limited, had won a bid for setting up street lamps by quoting the lowest rates with the help of Power Minister Aryadan Mohammed.\n\nLater, Mr. Chandy and Mr. Mohammed had intervened to release to the firm an amount of Rs. 35 lakh that was held back by the Agency for Non-Conventional Energy and Rural Technology (ANERT), she said. The Chief Minister, she claimed, had directly contacted ANERT regarding non-payment of funds after she took up the issue with him. She also claimed to have made Mr. Mohammed talk to officials of the agency four times for release of the funds.\n\nShe also offered to provide documentary evidences regarding her meetings with the Chief Minister to the commission. Incidentally, Mr. Chandy had deposed before the panel that he met Saritha only thrice.\n\nShe stated before the panel that the allegations of her illicit relationship with several MLAs and Ministers were raised by some quarters to divert attention from the scam, and to cover up the fraud. Many crucial evidences to prove the corruption and fraud were either tampered with or destroyed, she maintained.\n\nThe Commission will examine her again on Monday and Tuesday.", 
    "section": "national", 
    "title": "Chandy’s son also involved, alleges Saritha", 
    "subsection": "general", 
    "date": "2016-01-30"
}