{
    "author": [], 
    "text": "Amid suspense over next government formation, late Mufti Mohammad Sayeed’s family has vacated the Chief Minister’s official bungalow in Jammu, the winter capital of the State, leading to questions as to what his daughter and expected successor Mehbooba Mufti could be up to.\n\nBegum Gulshan, wife of the late leader and mother of Ms. Mehbooba, visited the bungalow at Wazarat Road in Jammu city on January 18, just 11 days after Mr. Sayeed’s demise, and took away the family belongings.\n\n“Mufti Sahab ceased to be the Chief Minister and on 18th of this month, the family got all of its personal belongings from that house in the best traditions of public conduct,” PDP spokesman and former Minister Naeem Akhtar said.\n\n“There is nothing political about it. This is a normal practice. Mufti Sahab had always batted for this,” he said, adding that “It is the designated house of the Chief Minister. How can someone who is not a Chief Minister stay there?” According to rules, official accommodation can be retained for one month after a person ceases to be the Chief Minister but the family did not wait even for that time limit.\n\nDuring winter months (six months from November to April), the seat of the State government shifts to Jammu and for rest of the six months, it is in Srinagar.\n\nThe step by the family assumes significance as Ms. Mehbooba is expected to be the next Chief Minister since PDP is the largest party in the 87-member Assembly with 27 MLAs and it has an alliance with 25-member BJP.\n\nThe two parties ran a coalition government headed by Mr. Sayeed for 10 months before his demise on January 7. After her father’s death, Ms. Mehbooba has maintained suspense over the issue of government formation in the State, which has been under Governor’s Rule since January 8.\n\nAn official of the Estates Department, which is responsible for allocation of government accommodations, said there was no handover and takeover with the family. — PTI\n\nTagging Instructions: 1. Type the points. 2.Select every point and then apply \"infobox_subhead\" tag.\n\nTagging Instructions: 1. Type the points. 2.Select every point and then apply \"infobox_subhead\" tag.", 
    "section": "national", 
    "title": "CM’s bungalow vacated by Mufti’s family", 
    "subsection": "general", 
    "date": "2016-01-30"
}