{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "I.K. Gujral, along with some Indians from Kuwait, arriving in New Delhi by a special IAF aircraft.- File Photo: The Hindu Archives\n\nVisibly upset with the absence of credit to Indian diplomats in Airlift , a film on evacuation of Indians in Kuwait after Iraq’s invasion in 1990, Vikas Swarup, the spokesperson of the Ministry of External Affairs, said on Friday: “The film has taken artistic liberty. The MEA in fact played an active role in the evacuation. Hope people will read facts.”\n\nDiplomatic sources told The Hindu that the portrayal of diplomats and MEA officials in the film was far from truth.\n\nMisinformation: Fabian\n\nOne of the key officials who directed the large-scale evacuation of Indians trapped in Kuwait and Iraq was K.P. Fabian who described the film as a venture to spread misinformation. “Air India, the Ministry of Civil Aviation, Mr. I.K. Gujral [then External Affairs Minister], and the MEA officials worked in coordination and carried out an extraordinary operation to bring back the Indians,” Mr. Fabian told The Hindu .\n\nThe operation to evacuate Indians from Kuwait following invasion by Saddam Hussein-led Iraq went on to become the biggest crisis-time evacuation in history.\n\nDiplomats tell The Hindu that the crisis also helped India to build stronger ties with the governments of the region, like Jordan, which later on helped India deal with similar crises involving citizens working in the Gulf.\n\nMr. Fabian said the film portrayed the MEA in poor light. “The diplomats did an incredible job. I think, fictionalisation of characters of the MEA and denying them the right of credit for their work is unethical.”\n\nMr. Fabian, who was the Joint Secretary, Gulf division of the MEA, at the time of the first Gulf War, said: “A lot of the viewers of the film were born after the incident. They need to be educated on their genuine inheritance and history from the First Gulf War. For example, the Ambassador of India in Kuwait, Kamal Bakshi, was portrayed in a very poor light. In reality, Ambassador Bakshi accommodated hundreds of Indians in the embassy and in several other buildings.”\n\nMr. Fabian said the film even showed Air India pilots in a demeaning manner. The Air India did a great job, he said.", 
    "section": "national", 
    "title": "‘Diplomats shown in poor light in Airlift’", 
    "subsection": "general", 
    "date": "2016-01-30"
}