{
    "author": [
        "Devesh K"
    ], 
    "text": "He was accused of running an extortion racket targeting public servants\n\nAshwin misused the official position of his father, according to ED— File Photo\n\nThe Enforcement Directorate has provisionally attached assets worth Rs. 5.5 crore of Ashwin Rao, son of the former Karnataka Lokayukta, Justice Y. Bhaskar Rao.\n\nThe State police have filed charge sheets, accusing him of running a racket for extortion from public servants on the threat of a probe by the Lokayukta.\n\nLast July, a Special Investigation Team (SIT) of the State arrested Ashwin and the then Lokayukta Joint Commissioner (Public Relations), Syed Riyazathullah, on a complaint that they had threatened a government official with a raid if he did not pay up protection money. While the SIT has registered five cases and arrested 11 persons, the ED’s Bengaluru unit has launched investigations under the Prevention of Money Laundering Act.\n\nAccording to the ED, Ashwin misused the official position of his father in conspiracy with middlemen V. Bhaskar, Ashok Kumar and Syed Riyazathullah and extorted huge sums of money from several public servants.\n\n“During the relevant period, Rs. 5.92 crore flowed into his bank accounts,” the agency said on Friday. The accused used the money to acquire movable and immovable assets, which have been provisionally attached. In its first charge sheet, the State SIT had named Ashwin and five others, including a journalist and an RTI activist, for allegedly attempting to extort Rs.1 crore from a government engineer.\n\nBhaskar Rao, a former Chief Justice of the Karnataka High Court was appointed Lokayukta in February 2013.\n\nHe proceeded on long leave after Ashwin’s arrest in Hyderabad. He resigned in December last. The SIT listed him as a prosecution witness. Mr. Rao had initially refused to relinquish the post, so the Assembly adopted a motion to remove him.\n\nAditya Bharadwaj reports from Bengaluru:\n\nSenior SIT officers said they had written to the ED seeking attachment of all his properties. “This is a natural follow-up to our probe that revealed large scale corruption and money laundering,” an official said.", 
    "section": "national", 
    "title": "ED attaches assets of former Lokayukta’s son", 
    "subsection": "general", 
    "date": "2016-01-30"
}