{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Experts say no cause for alarm now\n\nWe are taking all necessary steps to ensure that India is well prepared in case of any eventuality, says Health Ministry.\n\nOn the heels of the World Health Organisation's warning on Zika virus, the government said it has constituted a special, technical group to monitor the spread of the virus in other countries.\n\n“We are focusing on especially strengthening the surveillance system,” said J.P. Nadda, Union Minister for Health and Family Welfare in a press statement, “We are closely monitoring the situation and all necessary steps have been initiated to ensure that India is well prepared in case of any eventuality,” he said.\n\nThe statement was the outcome of a meeting that the Minister convened with senior officials from the Ministry and the All India Institute of Medical Sciences.\n\nAedes mosquito which transmits dengue also transmits Zika virus. The government note emphasised an increased focus on prevention to control the spread of the Aedes mosquito that breeds in clean water.\n\n“Community awareness plays an instrumental role in this regard. There is a need for greater awareness amongst community,” said Mr. Nadda.\n\nAccording to Reuters, Director-General Margaret Chan told members of the U.N. health agency's executive board on Thursday that the spread of the mosquito-borne disease had gone from a mild threat to one of alarming proportions.\n\nThe officials in the Health Ministry here said there was no need to worry and there would be guidelines issued later this week marking out a protocol at airports and hospitals to deal with the virus. “I would say no need for alarm or panic now. We had a meeting today...the experts have some recommendations and we will make a public announcement soon,” said C.K. Mishra, Additional Secretary, Ministry of Health and Family Welfare.\n\nThe Zika virus has been associated with inexplicable spike in Brazil, of babies being born with unusually-small heads.\n\nThe virus has been detected in some people in the U.S. and the U.K. who have said they had travelled to South America.\n\nThere have been no reports of outbreaks of Zika in India though there is concern that given the ubiquity of air-travel, carriers of the virus may arrive in India.", 
    "section": "national", 
    "title": "Govt. constitutes technical monitoring cell on Zika virus", 
    "subsection": "general", 
    "date": "2016-01-30"
}