{
    "author": [
        "B S", 
        "Satish Kumar"
    ], 
    "text": "‘We want to create awareness over the alleged failure of Congress, BJP to end the row’\n\nThe ongoing Kalasa–Banduri nala struggle by farmers of north Karnataka is set to gain steam ahead of the zilla and taluk panchayat polls as the three different forums of farmers that were staging these protests are now thinking of joining hands for a focussed approach. The leaders of these three forums are meeting in Hubballi on February 9 to look at ways to carry forward the campaign under a common banner, according to Kalasa-Banduri Nala struggle coordination committee coordinator Vikas Soppin. This may generate political heat and turn out to be a tricky issue for the ruling Congress and the Opposition Bharatiya Janata Party in the ZP/TP polls as the protesters are basically targeting their ire at these two major parties.\n\nMr. Soppin told The Hindu that the farmers’ organisations were keen to create public awareness against the alleged failure by these two parties to find a solution to the inter-State water row when they were in power at the Centre.\n\nHowever, it is still not clear on how the protesters would take their political battle forward during the ZP/TP polls. However, all these issues would be discussed by them at a meeting scheduled for February 9.\n\nThe impact of Kalasa-Banduri nala protest is being felt in Dharwad, Belagavi, Gadag, and Bagalkot districts. Any farmers’ protest in the northern parts of the State on issues related to water is being taken seriously by political parties as the previous instances, especially the Nargund agitation of the 90s, has shown how the farmers got organised on the basis of struggle related to irrigation issues.\n\nThe Kalasa-Banduri nala project is languishing even as the State delegation is waiting for an appointment with the Goa Chief Minister for talks to arrive at a solution to the inter-State water row.\n\n‘We want to create awareness over the failure of Congress, BJP to end the row’", 
    "section": "national", 
    "title": "Kalasa-Banduri: farmers’ forums to put up a united fight", 
    "subsection": "general", 
    "date": "2016-01-30"
}