{
    "author": [
        "National Bureau"
    ], 
    "text": "The NDA government carried out a major reshuffle at the top bureaucratic level on Friday, bringing in new Secretaries to steer the crucial Ministries of Agriculture, Telecom and Micro, Small and Medium Enterprises, indicating a willingness and determination to change course based on performance.\n\nThe Appointments Committee of the Cabinet led by Prime Minister Narendra Modi approved 10 Secretary level shifts, including four appointments made to fill vacancies arising as the incumbents are about to retire.\n\nAmong the most significant changes was the move to replace Telecom Secretary Rakesh Garg with Uttar Pradesh cadre IAS officer J.S. Deepak, who is at present Secretary in the Department of Electronics and Information Technology.\n\nMr.Garg, one of the first few appointees after the NDA government came to power in May 2014, has been moved to the Minority Affairs Ministry, almost 10 months ahead of his retirement. The 1981 batch officer Amarendra Sinha was holding additional charge as Secretary to the Minority Affairs Ministry till now.\n\nMan behind telecom auctions\n\nThe new Telecom Secretary is the man who helped successfully conduct the first ever e-auction of the telecom spectrum in 2010 in the aftermath of the Supreme Court order cancelling previously awarded licences.\n\nThe auctions that Mr.Deepak worked on while he was in the Commerce Ministry fetched the government over Rs1.06 lakh crore. The 57-year-old has previously served as Additional Secretary in the Commerce Ministry, prior to which he was the Joint Secretary at the Department of Telecom.\n\nAn IIM Ahmedabad alumnus, the 1982 batch Indian Administrative Services officer is being replaced by his batchmate from the Madhya Pradesh cadre, Aruna Sharma, who will take charge of the Department of Electronics and Information Technology. Both the departments report to Telecom and IT Minister Ravi Shankar Prasad.\n\nSeparately, Krishan Kumar Jalan, a 1982 batch IAS Haryana cadre officer, who was serving as Central Provident Fund Commissioner for over two and a half years, has been appointed the new Secretary for the Ministry of Micro, Small and Medium Enterprises. The incumbent, Anup Pujari, is about to retire.\n\nShobana K Pattanayak, a 1982 batch Karnataka cadre IAS officer, has been appointed Secretary in the Department of Agriculture on the retirement of the incumbent Siraj Hussain. Special Secretary in the Agriculture Department Avinash Srivastava has been promoted as Secretary in the Food Processing Ministry.", 
    "section": "national", 
    "title": "New Secretaries to steer Telecom, Agriculture", 
    "subsection": "general", 
    "date": "2016-01-30"
}