{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "‘\n\nAhead of the Assembly polls in Punjab due early next year, the release of President Pranab Mukherjee’s book, The Turbulent Years: 1980-96 , has kicked off a flutter in the State politics.\n\nReferring to the book, Dal Khalsa, a radical Sikh outfit, on Friday, raised scepticism over the role of Chief Minister Parkash Singh Badal during Operation Blue Star in 1984.\n\n“We are highly sceptical about the role of the present Chief Minister, Parkash Singh Badal. Whether Mr. Badal acquiesced with the Central government in planning the operation was still under scanner even after 32 years of the painful event,” Kanwar Pal Singh told The Hindu .\n\n“It’s high time Mr. Badal came clean as to why he was called alone and secretively to Delhi on March 28 and what talks did he had with the Indian government.”\n\nMr. Kanwar Pal said Mr. Mukherjee had admitted that the decision to storm Darbar Sahib was of the Cabinet Committee on Political Affairs, including him, and the decision was right.\n\n“The admission of Mr. Mukherjee is an eye-opener for all those including Capt. Amrinder Singh [president of Punjab Congress] who has been advising the Sikh community to forget and forgive the perpetrators,” he said.\n\nNaresh Gujral, Rajya Sabha member from Shiromani Akali Dal, denied that the Akali Dal had been providing political cover to Sikh extremists groups during the 1980s.\n\nMr. Gujral told The Hindu that during the terrorism days in Punjab, terrorist activities were not under the control of anyone.\n\nMr. Gujral was reacting to a mention in Mr. Pranab Mukherjee’s book of the Akali Dal’s position before Operation Blue Star. “It's his [Mr. Mukherjee’s] view, but the fact was we were not providing any sort of political cover to extremist groups or terrorists,” Mr. Gujral said.\n\nMr. Mukherjee in his book mentions, “Each time we came close to a consensus, militant groups seemed to increase their terrorist activities and the Akali Dal would shift its position. It often appeared as thought the movement was not under the control of the Akali Dal but being manipulated by extremist Sikh groups — the Akali Dal was only providing political cover to these groups, or so it seemed.”", 
    "section": "national", 
    "title": "Pranab’s book creates a flutter in Punjab", 
    "subsection": "general", 
    "date": "2016-01-30"
}