{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Soon after Urban Development Minister M. Venkaiah Naidu announced 20 upcoming smart cities on Thursday, criticism poured in from parties such as the Samajwadi Party of Uttar Pradesh.\n\nSince no city of Uttar Pradesh could make it to the top 20 list, the SP accused the BJP government at the Centre of “cheating” the people of the State.\n\nThe opposition BSP also lashed out at the Centre’s process of selecting the cities for developing smart infrastructure in its first phase of funding.\n\nRejecting the criticism that the selection process was politically motivated, Urban Development Ministry spokesperson Aishwar Rao told The Hindu that civil servants or ministers had nothing to do with the selection process.\n\n“Ministry officials were not allowed to go through the proposals. We handed them to evaluation team and we did not let anyone to see them except that team,” Mr. Rao said.\n\nThe evaluation teams, he said, comprised three foreigners and three Indians. The team of foreigners came from the London School of Economics and the World Bank while their Indian counterparts came from independent urban development agencies.\n\nIn its defence, the Urban Development Ministry reached out to several dozen municipal commissioners across the country to clear the misconceptions about the selection process.\n\nCabinet Secretary P.K. Sinha told them that the “inherent and legacy issues like economic backwardness and urban governance proved to be the limitations” for several dozen cities that could not make it to the list of final 20.\n\nMr. Sinha said the winning cities had impressive proposals with strong points such as sustainable urban planning, developing sound economic ecosystem and credible financial planning through city-level infrastructure.\n\nOfficial says\n\ncivil servants or Ministers had nothing to do with selection process", 
    "section": "national", 
    "title": "‘Smart City selection not politically motivated’", 
    "subsection": "general", 
    "date": "2016-01-30"
}