{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The Kerala High Court’s order to stay vigilance proceedings against Kerala Chief Minister Oommen Chandy has brought some relief to the Congress that had already decided to close ranks behind the leader.\n\nThe party high command has, however, launched an unofficial probe to gauge the gravity of the ongoing political unrest.\n\nSoon after the State’s vigilance court authorised the police to lodge an FIR against the Chief Minister, senior Congress leaders in Delhi, A.K. Antony and Mukul Wasnik, who oversee the State, rushed to 10 Janpath to brief party president Sonia Gandhi.\n\nSources said that Ms. Gandhi decided to back Mr. Chandy saying that he’s had a “clean record” and unflinching faith in the Congress ideals. She, however, asked Mr. Wasnik to send someone to Kerala to conduct an internal inquiry.\n\nMr. Wasnik dispatched his assistant, Deepak Babaria, who also serves as the party secretary, to Kochi to meet Congress leaders and the leaders of other political outfits that have extended support to the Congress in government formation.\n\nSpeaking to The Hindu , Mr. Babaria said that from various accounts the controversy seems like a “conspiracy” hatched by the Communist Party of India (Marxist) ahead of the upcoming polls. “The party strongly believes that the Chief Minister is clean,” he said.\n\nAsked if he could share the key points of the report he has been tasked to submit to the high command, he said: “I’m still talking to various people and I haven’t made up my mind yet.”\n\nA senior general secretary of the party also said that the BJP had no right to demand the resignation of Mr. Chandy.\n\n“It is a clear case of political conspiracy. Why should we lose a good leader when Prime Minister Narendra Modi has allowed Ministers such as Nihal Chand to continue and protected Sushma Swaraj and Vasundhara Raje in worse circumstances,” he asked.\n\nThe party was also fuming at the sanction given by Maharashtra Governor C. Vidyasagar Rao for prosecution of former Chief Minister Ashok Chavan by the CBI in the Adrash scam.\n\nThe party felt that the previous governor, Sankaranarayanan, had declined permission after consultation with the Solicitor General, and that reopening the matter was a case of political vendetta.\n\nHigh Court order staying proceedings against Chandy brings relief to Congress camp", 
    "section": "national", 
    "title": "Sonia backs him, but party launches unofficial probe", 
    "subsection": "general", 
    "date": "2016-01-30"
}