{
    "author": [
        "Samarth Bansal"
    ], 
    "text": "The average asset holding of the bottom 10 per cent of urban Indian households is around Rs. 291, new data from the National Sample Survey Office (NSSO) show.\n\nMost households reported owning some kind of physical or financial assets, the survey, conducted in 2012-13 and made public on Friday, shows. On an average, rural and urban households own assets worth Rs.10 lakh and Rs.23 lakh respectively. However, the average hides a wide variation in the distribution of assets.\n\nThe bottom 10 percent (in terms of total assets) of rural households had assets worth Rs.25,071 on an average, largely as a result of the value of land, while the figure for their urban counterparts was just Rs.291, implying that the urban poor hardly own any assets. On the other hand, the top 10 per cent of the rural and urban population had average assets worth Rs.57 lakh and Rs.1.5 crore respectively.\n\nSpeaking with The Hindu , Parth Shah, founder president of the Centre for Civil Society, said, “New migrants to cities leave their assets behind in villages. Hence, the urban poor have negligible household assets.”\n\nHaryana and Punjab had the highest average assets per household in rural areas, while Maharashtra and Kerala were on top in urban areas. Odisha lay at the bottom in both rural and urban India.\n\nLand and buildings held the dominant share in asset holdings, as was the case in the previous decade, comprising more than 90% of all assets in both urban and rural areas. Financial assets that include shares in companies and cooperative societies, national saving certificates, and deposits in companies and banks, were just two per cent of total assets in rural areas, compared with five per cent in urban areas. The share of land as a proportion of total assets has increased with time, possibly due to the escalation of land prices, says the NSSO report. The data also show that 31 per cent of the rural households and 22 per cent of the urban households were under debt.", 
    "section": "national", 
    "title": "‘Urban poor own nominal assets’", 
    "subsection": "general", 
    "date": "2016-01-30"
}