{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The Chennai-based writer was unharmed, but exhausted\n\nShreekumar Varma, a Chennai-based writer, was freed from his captives in Senegal in an operation by the police there late on Thursday, a diplomatic source told The Hindu on Friday.\n\n“He was physically unharmed, but was very tired and traumatised at the time of the police operation, and is undergoing the necessary debriefing with the help of Indian diplomats and Senegalese police. He spent nearly a week in extremely difficult circumstances, and we are yet to form a full impression of the crisis that he underwent,” a member of Mr. Varma’s family said.\n\nFollowing his rescue, Mr. Varma, scion of the erstwhile royal family of Travancore, was brought to the Indian Embassy in Dakar, capital of Senegal, under tight security. He remains in the embassy. The Senegal police and Indian diplomats are investigating how, and under what circumstances, Mr. Varma was abducted.\n\n“The details of the case are still very vague. What is understood is that Mr. Varma was abducted by a group, and high risk was involved. He did not suffer any injuries, but was held under extremely difficult circumstances,” said a family source, who declined to reveal if any ransom was paid.\n\nSale negotiations\n\nMr. Varma was lured to Senegal to negotiate the sale of a work by the legendary 19th century painter Raja Ravi Varma, his great grandfather. The canvas is among the erstwhile royal family’s original collections of the painter’s work. The family declined to reveal if any more of the paintings of Ravi Varma were for sale.\n\nA letter that the Varmas wrote to the External Affairs Ministry, which was accessed by The Hindu , shows that other family members support the sale of the painting.\n\nDuring the trip to Senegal, Mr. Varma was supposed to negotiate the deal with Subramaniam Seshadri, who works in an Indian-owned construction firm in the West African country. But problems began as soon as Mr. Varma landed in Dakar on a commercial flight, via Dubai, on January 18.\n\nHe was received by a Senegalese man, Abdul, who informed him that Mr. Seshadri could not meet him. Mr. Varma contacted his son last on January 23 to inform him of the trouble he was having with the people who had invited him for negotiations. He was taken away by a group soon.\n\nA close relative of Mr. Varma said the family was thankful that the Senegalese police were able to spare personnel for rescuing him, even in the middle of a nationwide anti-insurgency operation. Senegal, which borders Mali, has seen a spurt of violence in recent months.", 
    "section": "national", 
    "title": "Varma freed in police operation", 
    "subsection": "general", 
    "date": "2016-01-30"
}