{
    "author": [], 
    "text": "(Left) Elle King, who is nominated for two Grammy Awards for best rock song and best rock performance, and Florence Welch of Florence + the Machine, who is nominated for several Grammy Awards including best rock song, best rock performance, best pop duo/group performance and best pop vocal album.— File photos: AP\n\nThe Grammy ceremony on February 15 may see newcomers taking over from men and legacy acts\n\nFor years, men and legacy acts have dominated in the rock category at the Grammy Awards, leaving little room for women stars who rock as loud and hard as the guys, and young bands hoping to break through on the music scene.\n\nBut at this year’s Grammys, there is a shift with women and budding acts dominating in the rock field, thanks to the Brittany Howard-led Alabama Shakes and Florence Welch of Florence + the Machine with four nominations each to promising performers such as James Bay and Highly Suspect, both up for best rock album and rock song.\n\nElle King, the 26-year-old carefree, raspy-voiced newcomer, earned nominations for best rock song and rock performance for the platinum single Ex’s and Oh’s , which topped the Billboard rock and alternative charts last year.\n\n“There’s been space for people to make different music that’s not so pop-driven ... that’s why we went with alternative because I didn’t think I was another Katy Perry of this world,” King said in an interview. “But to be in the rock category at the Grammys, for me and my heart, it’s like, ‘(Expletive) yes, that is so rad[ical]!’ That made me extremely happy.”\n\nAlabama Shakes’ nominations include album of the year and best alternative music album for Sound & Color as well as rock performance and rock song for Don’t Wanna Fight . Florence + the Machine are also up for the latter two rock honours with the single What Kind of Man , along with best pop vocal album for How Big, How Blue, How Beautiful and pop duo/group performance for Ship to Wreck .\n\nThe Grammys, which are being held at the Staples Centre in Los Angeles on February 15, could bring the often-praised Howard, 27, and Welch, 29, their first gramophones after earning multiple nominations in the past.\n\n“I feel like women have always written incredible songs, but I feel like right now what’s so rad is we’re all taking back the conversation and supporting each other and holding each other up,” said Hayley Williams, the 27-year-old frontwoman of Paramore. “We’re taking notice of each other earlier on in each other’s careers.”\n\nParamore won its first Grammy last year for best rock song with Ain’t It Fun , the anthem groove that gave the band its first Top 10 hit on the Billboard Hot 100 chart. A year before that, Imagine Dragons took home best rock performance for their breakthrough track, Radioactive ; Halestorm, with frontwoman Lzzy Hale, won best hard rock/metal performance in 2013.\n\nAlso in recent years, seasoned acts like Foo Fighters, Black Keys, Jack White and Beck have won rock Grammys, though the awards have usually been reserved for veterans in the vein of U2, Neil Young and Bruce Springsteen. And in the past women have had an even tougher road than the young acts — before Paramore’s win, Alanis Morissette was the last woman to win best rock song in 1999. It was the same year Sheryl Crow won best rock album; a woman hasn’t won the honour since.\n\n“I think it’s time that they were back in the mix as far as the Grammys goes, in a larger way because it’s undeniable that women rock,” said Bill Freimuth, the Recording Academy’s senior vice president of awards.\n\nThis year, nominees for best rock performance include four women, or women-led acts, with King, Alabama Shakes, Florence + the Machine and Wolf Alice, whose lead vocalist is 23-year-old Ellie Rowsell. The fifth nominee is the Foo Fighters.\n\nThe best rock song nominees are made up exclusively of women and new acts with King, Alabama Shakes, Florence + the Machine, Bay the acclaimed 25-year-old British singer-guitarist and Highly Suspect, the trio made up of 30-year-old twins Ryan and Rich Meyer and Johnny Stevens, 29.\n\nBig change from 2014\n\nIt’s a sea change from 2014, when nominees for best rock album included David Bowie, Black Sabbath, Queens of the Stone Age, Neil Young with Crazy Horse, Kings of Leon and winners Led Zeppelin. Best rock song nominees that year included The Rolling Stones, Black Sabbath, Paul McCartney.\n\n“I think that some of the legacy artists, if you look at their catalogue of work, some of the things that may have been in contention for this year, is it their best work or is it the name? I think we’re getting away from that and looking at what is the best work,” said Grammy-winning producer Jacquire King, who has worked with Bay, Kings of Leon and Tom Waits.\n\n“I think that’s what the Grammys have needed to focus on and this year there’s a lot of proof that the focus is getting sharper. I love what these categories represent for music.”\n\nWilliams, who said Paramore is busy writing its fifth album, said she remembers how tough it was to be taken seriously as a teen musician when the band released its debut album a decade ago. And King, whose debut was released a year ago, says she’s slowing seeing how some people view her as a young, female rock singer.\n\n“It’s funny because for years I said, ‘No way, I’ve never had any hurdles or speed bumps or anything, and it literally wasn’t until the past couple months where I realized ... I didn’t (expletive) realise that people didn’t take me seriously and I finally saw it, and it kind of broke my heart a little bit, a lot of musicians that I knew,” she said.\n\n“And so now I’m just like, seriously like, ‘I will show you and all these other women who are literally taking over rock ’n’ roll right now will all (expletive) kick your asses, seriously.’” — AP", 
    "section": "national", 
    "title": "Women, youngsters dominate rock music nominations", 
    "subsection": "general", 
    "date": "2016-01-30"
}