{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students came to my rescue in creating awareness of the right to vote: Sagayam\n\nA vulgar display of money power was witnessed in Madurai district during the 2011 Assembly elections, said former Madurai Collector U. Sagayam.\n\nHowever, he did not elaborate on the issue.\n\nAddressing students of a college here on Friday, Mr. Sagayam, who is the Vice-Chairman of Science City in Chennai, said that it were students who came to his rescue for creating an awareness of the right to vote without any inducement in the run-up to the 2011 general elections to the Assembly.\n\n“I did try to organise meetings (to create an awareness of free and fair election) with the chamber of commerce and a couple of voluntary organisations. But, they did not respond at all,” said Mr. Sagayam, who was posted as Madurai Collector by the Election Commission in March 2011, after announcement of the election schedule.\n\nLater, Mr. Sagayam, as the District Election Officer, addressed students of various colleges on the importance of conducting free and fair elections. He also administered pledge to them that they would not allow any one to induce them with money or gifts to exercise their franchise.\n\nStating that many countries across the globe had some or other specialities – economic power (US), socialism and equality (Russia) and culture and population (China) – Mr. Sagayam said the significance of India was that it was the largest democracy of the world.\n\n“And very fundamental of democracy was on fair elections,” he said.\n\nStating that people should give a thought over their choice in the election, he said they should elect honest people without being influenced by money or gifts,” he said.\n\nStating that 1.66 lakh farmers had committed suicide between 1997 and 2006 in the country, he wondered who the fruits of the nation’s Independence were benefiting.\n\nHe wondered why no syllabi in school and college level had a lesson against corruption in the country.\n\nHe also regretted that no more moral values were being taught in the educational institutions.", 
    "section": "national", 
    "title": "“2011 Assembly polls in Madurai saw display of money power”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}