{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "These two stations have almost hit a point of saturation in the number of trains they can handle\n\nEvery morning, dozens of trains reach the Chennai Central and Egmore railway stations. It is just not the station premises or the adjoining roads that get clogged but the coach maintenance facilities at Basin Bridge Junction and Chetpet as well. The congestion is so much that empty rakes of some trains are moved to far-off stations like Chengalpet and Vandalur and stabled there all day.\n\nThe two major railway terminals that provide connectivity to various destinations across the country are flooded with several thousands of people on a daily basis. With the steady increase in the number of trains and passengers, railway officials say Chennai has almost hit a point of saturation like Bangalore. Introducing new trains will be impossible unless the space is created.\n\nWhen it comes to decongesting Chennai Egmore, there have been two long-pending proposals, the prominent being the demand to develop Tambaram as a terminal. The call to create basic infrastructural facilities at Royapuram, one of the oldest railway stations in the Indian Railways has also been afloat since decades. Railway officials say the immediate, viable and effective option would be to develop Tambaram as a terminal.\n\nExplaining how Chennai Egmore had become a bottleneck, a senior railway official said several trains that came from southern destinations remained stationed at Egmore for about an hour in the mornings. Some of these trains were then shunted to stations like Pallavaram, Chromepet, Vandalur and Chengalpet for parking. In the evenings, these trains were shunted back to Egmore for departure.\n\n“This activity of shunting the empty rakes back and forth takes place on the main lines and platforms in Chennai Egmore remain occupied most of the time during peak hours. Instead, if a south-bound train like the Tiruchendur or Tirunelveli Express is extended upto Royapuram or Ennore, it can halt at Egmore and proceed to the destination,” the official who preferred not to be quoted, said.\n\nExtending trains to stations like Royapuram or Ennore will benefit passengers in the northern parts of Chennai. They would find it much easier to reach these stations than Egmore during rush hour. “Railways also stand to gain because of the increased distance. We need to create better infrastructure like access roads, parking and watering facilities at these stations for the purpose.”\n\nA former Chief Commercial Manager said developing Tambaram was a proposal that had been pending for many years.\n\n“Tambaram has excellent connectivity by road/rail and there is adequate railway land for expansion activities. If south-bound trains are terminated at Tambaram, passengers can easily switch over to suburban trains.”\n\nOnce Tambaram is declared a terminal, rail users say north-bound trains terminating at Chennai Central can be extended upto Chennai Egmore. Already, some trains connecting northern destinations like Dadar, Kacheguda and Circar Expresses originate from Chennai Egmore.\n\n“There was a time when the Chennai-Kakinada Circar Express was operated from Chennai Beach. There is a proposal to start the Chennai-Kacheguda Express from Chengalpet,” he said.\n\nMany passengers told The Hindu there was a huge congestion, including traffic holdup, in and around Chennai Central and Egmore during peak hours. “If trains coming from the south are terminated at Tambaram, passengers can take suburban trains and reach city stations. There is a train every five minutes departing from Tambaram to Beach Station connecting 17 suburban stations en route, ” N. Kannan, who owns a gas agency, says.\n\nWith more trains and less of coach maintenance facilities, passengers say trains are not cleaned properly. In some rakes, only the upper class coaches are attended to. If Tambaram is developed as a terminal, additional coach maintenance facilities will come along. Moreover, the main lines between Chennai and Tambaram would be freed .\n\n“Premium AC suburban trains should be operated between Chennai and Chengalpet with no stoppage between Chennai and Tambaram. This will immensely benefit officer-goers, traders and students coming from places beyond Tambaram,” says K. Shankar, a daily commuter who works in the IT industry.", 
    "section": "national", 
    "title": "A problem of plenty at Central, Egmore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}