{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Pattali Makkal Katchi (PMK) will take steps to replicate the United Kingdom’s National Health Service (NHS) in Tamil Nadu, the party’s chief ministerial candidate Anbumani Ramadoss said.\n\nLaunching the series of public interaction programmes on Tamil Nadu’s Development in Vellore on Thursday, Mr. Ramadoss, while speaking on Free and Quality Healthcare, said it was his dream to implement a scheme like NHS, which is one of the most successful health schemes in the world.\n\n“Under the NHS, a person need not spend for medical care. Investigations and all medical procedures are free. Patients also get taxi facility to go home after treatment. Such a scheme should come to Tamil Nadu, and we need to plan for this,” he said.\n\nHe pointed out that till now the government health insurance schemes – implemented by the DMK and AIADMK governments - gave more benefits to private hospitals. He assured people that if voted to power his government would reverse the trend by giving a larger role to public sector hospitals so that people need not spend out of their pockets towards medical care.\n\n“It is the fundamental duty of a government to provide quality healthcare to citizens, and it is the fundamental right of every individual to get quality healthcare,” he emphasised. Importance will be given to preventive and promotive healthcare, he said.\n\nTerming maternal deaths as the crime of the government, he said because of National Rural Health Mission, which was conceptualised and introduced when he was the Union Health Minister in 2005, Maternal Mortality Rate decreased by 50 per cent and Infant Mortality Rate reduced by 55 per cent in the last 10 years.\n\nWith Siddha being Tamil Nadu’s own traditional system of medicine, he said, “I will integrate Siddha into the primary health centres, sub-centres, taluk hospitals and district headquarter hospitals.”\n\nIf voted to power, he said that he would post Accredited Social Health Activists in all 79,000 villages in the State to act as facilitators in taking healthcare to villagers.\n\n“We will invest more in government hospitals, bringing in better standards than private hospitals,” he said. He also promised to implement school health programme, and preventive screening for all in the State.\n\nPMK leader says he will integrate Siddha medicine into primary health centres", 
    "section": "national", 
    "title": "Anbumani promises U.K. healthcare system in TN", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}