{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Tamil Nadu is one of the major producers of red gram in the country. In Salem district, red gram is cultivated in 4,450 hectares with an average productivity of about 900 kg per hectare.\n\nThe extent of area under red gram cultivation is gradually dwindling mainly due to the lesser yield characteristics and higher cost of cultivation, which result in reduced revenue earning for the farmers. As per the instructions of the Agricultural Production Commissioner and Secretary to Government of Tamil Nadu and the Commissioner of Agriculture, Chennai, 15 kg of Trombay Red Gram TT-401 variety breeder seeds were procured from Bhabha Atomic Research Centre (BARC), Mumbai during kharif 2015 season and 15 kg was utilised to raise seed farms in Salem district.\n\nFoundation Stage-I seed farms were raised in an extent of 14 acres utilising the breeder seeds in the farmers’ field in Attur, Thalaivasal and Pethanaickenpalayam blocks. The crop was sown in the first fortnight of October 2015. The germination and the crop stand were very good during both vegetative and flowering stages. The crop came to flowering in 70-75 days. In all the locations, there was minimum pest incidence. Plant protection was taken up for only for pod borers as prophylactic measure.\n\nProductive branches were observed at 25-30 cm above the ground level and pod-setting was full in all the branches. The variety attained maturity in 140-150 day after sowing. The popular red gram varieties grown in the district are of long duration Vamban 2 and Laxmi of 180.\n\nThe matured red gram crop variety TT-401 grown in 5 acres were harvested on Friday at Thennangudipalayam and Mullaivadi villages of Attur block in the fields of farmers Govindan, Shankar and Desiya Azhagan, in the presence of J. Daniel Chellappa, Senior Scientist (TCW), BARC, Chennai, and K. Govindan, NFSM scheme Consultant, the Commissionerate of Agriculture, Chennai.\n\nThe test yield obtained was higher at 2,550 kg per hectare, compared to the varieties in vogue which yield around 1,500 kg per hectare. BARC’s Variety TT-401 yields around 1,000 kg more than the ruling varieties which gives an additional income of Rs. 50,000 per hectare to the farmers. An added advantage of the BARC variety is its early maturity period of 150 days against 180 days of the ruling varieties.\n\nSince the plant type is medium in height, the cultural operations in the field is easier. All the seed farm farmers expressed happiness over the enhanced earnings.\n\nThe test harvest was organised under the guidance of N. Elango Joint Director of Agriculture here. D. Barani, Deputy Director of Agriculture, Salem, Lakshmanan, Assistant Director of Agriculture, Attur, Ravichandran, Seed Certification Officer, and other officials were present.", 
    "section": "national", 
    "title": "BARC’s red gram variety gives higher yield", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}