{
    "author": [
        "V S"
    ], 
    "text": "They have a range of facilities such as Wi-Fi, DTH television, focus lights, sunroof, public address system with cordless microphones\n\nWith political leaders set to hit the roads ahead of the Assembly election, workers at an automobile workshop in Tatabad in Coimbatore are busy refurbishing campaign vehicles of top politicians in the State.\n\nSix vehicles have already reached the workshop of Koyas and Sons, who are old hands at customising campaign caravans that provide the best comforts for its occupants.\n\nAround 20-odd workers are busy customising Tempo Travellers, Bolero and Tahr Jeeps. They expect another dozen orders. “We customise caravans throughout the year mainly for use in the tourism sector. But during elections, we customise vehicles into a mini home for campaigns,” says P.V. Mohammed Riaz, managing partner at Koyas.\n\nIt takes about 20 days for basis refit. But for a complete refurbishing with all facilities the work takes two to three months.\n\nWhile Riaz and his staff are not forthcoming on the cost involved, political functionaries here say the refurbishing could cost up to Rs. 25 lakh depending on the changes to be made.\n\nCustomising a vehicle for enhancing comfort level includes bringing in air suspension to avoid bumpy rides, setting up rest rooms with water tankers, fitting Wi-Fi services, DTH television facility, fitting up of six speakers and installation of focus lights. The front seat parallel to the driver is made into a motorised revolving chair with focus lights. Sun-roofing is done with a small opening at the top of the vehicle from which leaders/candidates emerge using manual steps or hydraulic platforms. Stage is created in such a way that leaders are visible at bust size. Public address systems with corded and cordless microphones were regular preferences. Small fans, additional air conditioner blowers are part of the alterations. Customising includes cosy sofas, a small bed, reclining chairs and even and geysers.\n\nSome candidates prefer jeeps redone with a small platform and flooring with hand railings to hold on.\n\nKoyas has in the past been approached by campaign managers of Chief Minister Jayalalithaa, DMK leaders M. Karunanidhi and M K Stalin and actors Amitabh Bachchan and Rajinikanth. Late Prime Minister Rajiv Gandhi had once got his Ambassador car refurbished after experiencing the seating comfort in the car of former Kerala Chief Minister K Karunakaran.", 
    "section": "national", 
    "title": "Campaign caravans getting ready in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}