{
    "author": [], 
    "text": "RELIGION\n\nMahabharatham: Rama Dikshithar, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nGita: Ramana Swaroopananda R-Block, 47/15, 15{+t}{+h}St., Anna Nagar, 6.45 p.m.\n\nNarayaneeyam: Navalpakkam Narasimhan, Sri Lakshmi Narasimhar Temple, 24{+t}{+h}St., Thillaiganga Nagar, Nanganallur, 6.45 p.m.\n\nArunyupanishad: K. Srinivasan, PS HSS., Mylapore, 6 p.m.\n\nThiru Allikeni Kandene: Venu Raza Narayanan, Adikesava Perumal Thirukoil, Chindathiripet, 6 p.m.\n\nRamanujar Vaibhavam: K.B. Devarajan, Sri Andalammal Matam, Old Washermenpet, 6.45 p.m.\n\nTiruvasagam: Apavargananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nSatsang: Vimurtananda, Jayanthi, 668, School Rd., Anna Nagar West Extn., 5.30 p.m.\n\nMeditation: Atmashraddhananda, Vivekanandar Illam, Kamarajar Salai, 7 p.m.\n\nAmbikayin Arul: S. Raghavan, Valeeswarar Temple, South Mada St., Mylapore, 7 p.m.\n\nAtma Bodha: R. Aravindan, Parsn Renascence, Aster 203, Mambakkam Main Rd., Medavakkam, 7.15 a.m.\n\nNamasangeerthanam: Ananthanarayana Bhagavathar, Asthika Samajam, Alwarpet, 6.30 p.m.\n\nCULTURE\n\nOrganising Committee: Launch of DVD ‘Krishnaveni Natya Dhwani’, Bharatiya Vidya Bhavan, Mylapore, 6.30 p.m.\n\nKalakshetra Foundation: Cultural festival ‘Baani’, Thiruvanmiyur, 9 a.m.\n\nGandhi World Foundation: Launch of social awareness documentary DVDs, Dr. MGR Janaki College of Arts and Science for Women, R.A. Puram, 5.10 p.m.\n\nSahitya Akademi: Foundation day lecture on ‘Tamil Literature and Sahitya Akademi’, Bharatiya Vidya Bhavan, East Mada St., Mylapore, 6 p.m.\n\nGENERAL\n\nCollege of Engineering, Guindy; Madras Institute of Technology; A.C. College of Technology; School of Architecture and Planning: Graduation day, Anna University, Guindy, 5.30 p.m.\n\nOrganising Committee: Memorial meeting for former Director-in-Charge, National Institute for Research in Tuberculosis Dr. V. Kumaraswami, Mayor Satyamoorthy Rd., Chetpet, 2.30 p.m.\n\nSociety of Energy Engineers and Managers and Petroleum Conservation Research Association: Session on ‘Energy efficiency in HVAC systems’, Conference Hall, IV Floor, CADD Centre, Dr. Radhakrishnan Salai, Mylapore, 5.30 p.m.\n\nArappor Iyakkam: Talk on ‘War on Corruption’ and release of Citizen’s Lokayukta Model Bill for Tamil Nadu, TN Rajaratinam Kalai Arangam, Durgabhai Deshmukh Rd., R.A. Puram, 11 a.m.\n\nP.B. College of Engineering: Conference on ‘NCRTE ‘16’, Irungattukottai, 9 a.m.\n\nQuaid-E-Milleth College for Women: Muthamizh Vizha, Anna Salai, 9.30 a.m.\n\nJ.H.A. Agarsen College: College Day, Madhavaram, 10 a.m.\n\nValliammal College for Women: Annual day, Anna Nagar East, 10 a.m.\n\nKumararani Meena Muthiah College of Arts and Science: College day, Crescent Avenue Rd., Gandhi Nagar, 5 p.m.\n\nPatrician College of Arts and Science: Graduation day, Canal Bank Rd., Gandhi Nagar, Adyar, 11 a.m.\n\nMEASI Institute of Management: Workshop on ‘Business Startup’, Peters Rd., Royapettah, 10 a.m.\n\nKola Perumal Chetty Vaishnav SSS.: UKG Convocation, Arumbakkam, 8.30 a.m.\n\nSpringfield MHSS.: Kindergarten Graduation day, 9{+t}{+h}Sector, K.K. Nagar, 9.30 a.m.\n\nRajkumar – Sulochana Matriculation School: Annual day, Varasidhi Vinayakar Temple Pravachana Mandapam, Nanganallur,, 5 p.m.\n\nSukriti Social Foundation: International day of persons with disabilities and anniversary, Maharashtra Bhavan, EVK Sampath Rd., Vepery, 3 p.m.\n\nOrganising Committee: Felicitation meet for Prof. K.N. George, ICSA Centre, Pantheon Rd., Egmore, 11.15 a.m.\n\nLions Club of Madras Tambaram East: International women’s day celebration, Hotel Savera, 7 p.m.\n\nVivekanandapuram Residents Welfare Association: Inauguration of association, Srinivasa Sastri Hall, Mylapore, 6 p.m.\n\nTheosophical Society (Kilpauk Lodge): Talk on ‘Seven words on the cross’, Dr. Alagappa School, G.K. Rd., Purasawalkam, 6 p.m.\n\nSevalaya: Montessori exhibition, Kasuva Village, Pakkam Post, Thiruninravur, 11 a.m.\n\nLions Club of Madras Cosmopolitan: Meeting, Presidency Club, Egmore, 7 p.m.\n\nAnna Nagar Thamizh Peravai: Talk on ‘Tholkappiam’, Leo HSS., Anna Nagar West Extn., 6 p.m.\n\nUlaga Thirukkural Meiyam: Meeting, Valluvarkottam, Nungambakkam, 10 a.m.\n\nLions Clubs International and Sankara Eye Hospital: World Glaucoma week celebrations, Pammal, 9 a.m.\n\nNarcotics Anonymous: Meetings, Turning Point Group, Arul Kadal Aikiya Aalayam, Santhome High Rd.; and New Attitude Group, St. Andrews Church, Choolai, 7 p.m.\n\nAl-Anon: Meetings, Community Service Centre, Balfour Rd., Kilpauk; Alagu Andavar Temple, Korukkupet; TPI Kalyana Mandapam, Avadi; and Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; and Iraivan Thantha Vaippu Kuzhu, Thiruvottiyur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Community Service Centre, Balfour Rd., Kilpauk; PS HSS., Mylapore; Advent Christian Middle School, Velachery Rd., Sembakkam; Risen Christ Church, Paper Mills Rd., Peravallur; Alagu Muthu Mariyamman Tirumana Mandapam, Periyar Salai; St. Teresa Church, Nungambakkam High Rd.; E.C.I. Zion School, 100 ft. Rd., Ekkatuthangal; Our Lady of Perpetual Help Church, Manali Town; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; Karthikeyan MHSS., Saligramam; D.B.I. Colony, M.T.H. Rd., Avadi; St. Vincent School, Assumption Church, Railway Colony, Choolaimedu; and C.S.I. Church, Arcot Rd., Virugambakkam, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}