{
    "author": [
        "D J Walter Scott"
    ], 
    "text": "A poor Dalit woman who gave her 35-day-old girl child for ‘adoption’ to a couple based in Ambattur near Chennai triggered speculation of operation of an illegal child adoption racketeering at the Government District Headquarters Hospital here.\n\nOn being alerted by the Childline, District Child Welfare Committee (CWC) chairperson R. Sakunthala conducted an enquiry into the ‘adoption’ of the child of Dharmalakshimi and Senthilkumar of Peravur and found something fishy in the adoption procedure. The official conducted a preliminary enquiry based on a complaint lodged by Kaliammal (65), mother of Senthilkumar, who alleged that her daughter-in-law had sold the child as she already had a two-year-old girl child and did not want one more girl.\n\nFour other women from the village, including a Dalit leader, who turned up for the enquiry also supported the aged woman’s averment, she said. One Revathi, native of Perambalur and M. Kathiresan from Sakkarakottai in the district befriended Dharmalakshmi at the Government Hospital here and took her in a car to Ambattur to give her child for ‘adoption,’ Ms. Sakunthala said.\n\nAs she suspected foul play in the case, she referred the case to the police for further investigation. The Kenikarai Police, after registering a ‘child missing’ case, brought the Ambattur couple with the child and launched an enquiry. The police have also summoned Kathiresan and his accomplice K Muniasamy for enquiry.\n\nIn a late evening development on Friday, the police produced the child before the Judicial Magistrate court here for entrusting the child with its parents. The police, who were perusing the records, said that “we have to investigate the case in detail to find whether the adoption was legal.” The CWC said that the police could burst the illegal child adoption racketeering if they probed the case in detail. It alleged that Kathiresan, Muniasamy, Banumathy and Revathy acted as brokers for selling children to childless couples after targeting poor mothers, who visited the Government Hospital for check-up.\n\nNeeds taken care of\n\nThe ‘brokers’ even take care of their needs of the expected mothers after striking a deal, the CWC said.\n\nThe present case came to light when anganwadi workers visited Peravur to check the weight and verify the health chart of Dharmalakshmi’s newborn child, the CWC said.", 
    "section": "national", 
    "title": "Child adoption racket busted; network targets poor mothers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}