{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Estimated to cost Rs. 2,100 cr., work is likely to be completed in 5 years\n\nUnlike the recent modernisation of the airport, officials plan to operationalise facilities as and when they are complete during the course of the project.— Photo: M. Moorthy\n\nThe phase II work of the Chennai airport, which is estimated to cost Rs. 2,100 crore, may take nearly five years for completion. However, unlike the recent modernisation of the airport, officials plan to operationalise facilities as and when they are complete during the course of the project.\n\nFeatures of the project\n\nAirport director Deepak Shastri said that new terminals, walkalator, airside development and construction of new bays were some of the features of the project.\n\nHe said they were in the process of appointing a project management consultant who would chalk out a detailed plan and provide various recommendations for carrying out the project. “This consultancy work may cost about Rs. 190 crore; the project may take 57 months to complete and the consultancy work, about eight to nine months,” he added. He said that they had called for a tender and the consultant might be finalised soon. The phase II project has been taken up to expand the capacity of the airport in terms of passenger capacity and aircraft movement, too.\n\nThey plan to increase the passenger capacity to 30 million and the aircraft movement from 29 per hour to 40. According to the plan, facilities — to give an example, walkalators — would be thrown open for public as and when they are completed so as to benefit the public.\n\nPhase I expansion\n\nThe phase I expansion of the airport was executed at a cost of about Rs. 2,000 crore.\n\nThis project was marred by constant delays and after a long wait, it was finally thrown open for commuters only three years ago. Still, the arrival hall of the international terminal, which was a part of the project, has not been opened owing to shortage of customs and immigration staff.\n\nOfficials plan to hike the passenger capacity and also the aircraft movement", 
    "section": "national", 
    "title": "Consultant soon for phase II of Chennai airport project", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}