{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The contact details of Returning Officers (ROs) and Assistant Returning Officers (AROs) of eight constituencies in Tiruvannamalai district have been made public.\n\nName and original designation of ROs and AROs of each constituency are as follows:\n\nChengam (SC): RO-A.Subramani, Additional Personal Assistant (Land) to Collector-99658 11038. AROs - 1. M. Kamaraj, Tahsildar, Chengam – 9445000518. 2. Elumalai, Tahsildar, Thandarampattu- 9500902283.\n\nTiruvannamalai: RO- R. Uma Maheswari, Revenue Divisional Officer, Tiruvannamalai-9445000420. AROs - 1. A. Subramanian, Personal Assistant to the Revenue Divisional Officer, Tiruvannamalai – 9487327142. 2. C. Panneerselvam, Tahsildar, Tiruvannamalai- 9445000516.\n\nKilpennathur: RO- Banu, Assistant Commissioner (Excise), Tiruvannamalai-9445074597. AROs –1. R. Murugan,Taluk Supply Officer, Tiruvannamalai-9445000194. 2. P. Renuka, Divisional Excise Officer, Tiruvannamalai- 9486437599.\n\nKalasapakkam: RO- Subramanian, District Adi Dravidar and Tribal Welfare Officer, Tiruvannamalai-8148001480. AROs- 1. S. Rajalakshmi, Tahsildar, Kalasapakkam-9443096448. 2. Subramanian, Special Tahsildar (SSS), Kalasapakkam- 9943391626.\n\nPolur: RO-Savithiri, District Supply and Consumer Protection Officer, Tiruvannamalai- 9445000193. AROs- 1. Dinakaran, Special Tahsildar (Flying Squad), Tiruvannamalai-9442413013. 2. D. Bhuvaneswari, Tahsildar, Polur-9445000517.\n\nArani: RO- J. Jothi, Special Deputy Collector (Social Security Scheme), Tiruvannamalai- 9442425820. AROs 1. G. Krishnasamy, Tahsildar, Arani-9445000515. 2. Suresh, Special Tahsildar (Social Security Scheme), Arani-9486238725.\n\nCheyyar: RO-T. Prabhu Shankar, Sub-Collector, Cheyyar-9445000419. AROs-1. L. Baskar,Personal Assistant to Sub-Collector, Cheyyar- 9840094320. 2. Rehana Begham,Tahsildar, Cheyyar-9445000513.\n\nVandavasi (SC): RO- M.S. Dhandayuthapani, District Backward Classes and Minorities Welfare Officer, Tiruvannamalai-9445477829. AROs- 1. Arputham,Tahsildar, Vandavasi- 9445000514. 2. S. Balamurugan, Special Tahsildar (Social Security Scheme), Vandavasi- 9047578421.", 
    "section": "national", 
    "title": "Contact details of ROs and AROs in Tiruvannamalai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}