{
    "author": [
        "Special Correspondent"
    ], 
    "text": "TNAU's Regional Centre of Reviving Green Revolution holds field day in Perambalur\n\nUnder the auspices of the Regional Centre of Reviving Green Revolution Cell of Tamil Nadu Agricultural University, Coimbatore, a field day on “Scaling up dissemination on Integrated Pest Management Technologies in cotton” in Perambalur district was organised recently.\n\nC. Selvaraj, a farmer of Periavenmani of Veppur block who had set up demonstration plot on his fields, explained the package of practices adopted and the benefits through integrated pest management practice.\n\nP. Murugesan, Field Officer, ‘Kolapadi’ Natarajan, ‘Puduvettaikudi’ A. Thirunavukarasu and “Kilumathur” D. Vadivel shared their experience during the current season in the project.\n\nR. Kavimani, Head of Cotton Research Station of Tamil Nadu Agricultural University in his address, called upon farmers to resort to climate smart agriculture — an integrated approach to address challenges of food security and climate change for sustained growth in productivity and to support equitable increases in farm incomes, food security and development.\n\nAppropriate management methods, farmers could minimise damage of biotic and abiotic stresses in crops and field-level constraints to achieve the goal of increasing production both in cotton and maize.\n\n“This would pave the way for increasing the farm income of rain-fed farmers in the area and consequently their livelihood enhancement,” he added.\n\nOn soil health, Kavimani appreciated the efforts of project in which the beneficiary farmers resorted to soil test at the mobile soil testing unit of Agriculture Department.\n\nAscertaining the soil texture the farmers applied relevant fertiliser for cotton and maize this season. This scientific approach had resulted in economy for the farmers as they had avoided wasteful application of fertilisers. The foliar application of potassium nitrate for cotton during flowering phase had enhanced yield.\n\nS. Ayyasamy, Deputy Director of Agriculture, spoke on the advantages of ‘Azolla’ cultivation a much-needed fodder.\n\nHe emphasised the importance of Integrated Nutrient Management to reduce input cost. He said that low-cost technology had been adopted on the demo farms in cotton. He called upon farmers to visit these demo fields for an exposure.\n\nK. Kalpana, Assistant Professor of Plant Pathology, Cotton Research Station, Veppanthattai, said quality seeds stepped up production both in cotton and maize and prevented diseases during cultivation.\n\nShe listed the remedial measures for major diseases in cotton and maize.\n\nKhorshed Talati, Senior Development Officer of the project in Tata Trust, spoke on the efficacy of nutrient-rich vegetables. The TNAU set up nutrition gardens.\n\nN. Mani, Periavenmani panchayat president explained the impact of the project on the economy of the farmers.\n\nHe pleaded for setting up nutrition garden for arresting malnutrition.\n\nK. Natarajan, IPM-Consultant, spoke on pest attack in cotton and maize and explained the remedial measured taken by the farmers this season. Beneficial insects in crop protection were however spared.\n\nR. Vijayaraghavan, Project Lead (Extension Activities), spoke on value addition in maize with particular reference to cattle and poultry maize-based feed production through Farmers Producer Company. Fruit and vegetable seedlings were distributed to farmers on the occasion.\n\nFarmers urged to resort to climate smart agriculture for sustainable growth", 
    "section": "national", 
    "title": "Farmers, officials discuss pest management", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}