{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Vehicles that will be part of election duty in Coimbatore being fitted with tracking system.- Photo: M. Periasamy\n\nDistrict election officials on Friday began the process of fixing vehicle tracking equipment to the vehicles allotted to flying squad officers who are on election duty.\n\nAccording to sources, engineers from the Roots Auto Products Pvt. Ltd. fixed the equipment in 30 vehicles.\n\nThe equipment has two components – a global positioning system (GPS) component and a general pocket radio service (GPRS) component. The former locates and records the vehicle position using latitude-longitude coordinates and the latter sends the recorded data to the server.\n\nOfficials at the district election office and zonal election offices will get to track movement and gather details of vehicles under their command based on the access the equipment manufacturers give, the sources say. The district officials will get to have an overall picture while the zonal officials will only get details of vehicles plying in their respective zones.\n\nThe equipment is designed in such a way that if the vehicles are static or switched off the last recorded location is sent to the server and in relaying the information there will be a minute’s delay.\n\nThe election officials say that they have hired the equipment and the tracking system for three months for election related work. In the first phase, the flying squad officials’ vehicles will get the tracking equipment and in the next few days those of static surveillance teams and videographers teams.\n\nThe objective was to communicate to the teams to reach to the nearest troubled spot based on their presence, the officials add.\n\nThe sources say that the officials have hired the equipment and tracking service at Rs. 1,100 a vehicle a month for three months.", 
    "section": "national", 
    "title": "Flying squad officers’ vehicles equipped with GPS facility", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}