{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Vikram Pawah (seated), managing director of Harley-Davidson India, and C.R. Anandakrishnan, dealer principal of The Western Ghats Harley-Davidson, at the inauguration of The Western Ghats Harley-Davidson showroom in Coimbatore on Friday.- Photo: M. Periasamy\n\nHarley-Davidson India sees majority of its growth in the future coming from tier-two towns.\n\nVikram Pawah, managing director of Harley-Davidson India, told The Hindu here on Friday that in the last two months the company has expanded its network to Lucknow, Kozhikode, Nagpur, and Surat and on Friday to Coimbatore.\n\n“The response is really fantastic in these towns. The riding culture is much advanced in the tier-two cities,” he said. The company is working on two platforms – approachability and affordability. It is expanding its network and has launched legend on tour (mobile showroom) to be nearer to customers. It launched “Street” two years ago (ex-showroom price here is Rs. 4.6 lakh). Since opening its operations in India in 2009, the company has crossed 12,000 customers, he added.\n\nHarley-Davidson offers a range of 13 models and of these, only one (Street) is manufactured in India at the Bawal (Haryana) plant. The rest are assembled at the completely-knocked-down unit at Bawal. “Street” is also exported from here to countries such as Australia and Japan.\n\nC.R. Anandakrishnan, dealer principal of The Western Ghats Harley-Davidson, told presspersons that the 8,000 sq.ft showroom here will offer sales, service, and spares.\n\nA founders’ ride will be held on Saturday morning from Coimbatore to Pollachi. The outlet has several accessories to customise the bikes.\n\nHarley-Davidson, which is registering double digit growth year-on-year, invests heavily in customer experience programmes, added Mr. Pawah.", 
    "section": "national", 
    "title": "Harley-Davidson on more Indian roads", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}