{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "RELIGION\n\nRathina Vinayakar Temple: Chathurthi, temple premises, DB Road, R.S. Puram, 8.30 a.m.\n\nJeevajothi: Family fellowship, Gujarat Samaj – Patel Hall, near North Coimbatore Chinthamani, 10.30 a.m.\n\nGENERAL\n\nTamil Nadu Petroleum Dealers Association: 35{+t}{+h}annual general body meeting, CODISSIA complex, 10.30 a.m.\n\nKovai Medical Center and Hospital Limited: Biennial cadaveric course, Should and Elbow Arthoplastry, 12 noon\n\nPSG College of Technology: Entrepreneurs Club – E Summit 2017: E Next, F Block, Assembly Hall, 4 p.m.\n\nCoimbatore Institute of Technology: CIT Alumni Day, Auditorium, 4 p.m.\n\nRegional Science Centre of Tamil Nadu Science and Technology Centre : National Science day celebration, prize distribution function, centre premises, CODISSIA road, 3 p.m.\n\nAuditors Association of Southern India – Coimbatore: 75{+t}{+h}year Platinum Jubilee guest lecture by R. Seshasayee, Chairman – Infosys Limited, Sarvaa Ball Room, Grand Regent, 5.30 p.m.\n\nMaharaja Institute of Technology & Arts and Science College: Annual day and Sports day, 10.30 a.m.\n\nSri Ramakrishna Engineering College: 3-day book fair, auditorium, Vattamalaipalayam, 9 a.m.\n\nSri Ramakrishna Institute of Technology: Technical Symposia – Panorama 16 and Resilience 16, PG Seminar Hall, 9.30 a.m.\n\nPSGR Krishnammal College for Women : Workshop on Recent Developments in Chemistry, 10.15 a.m.\n\n5{+t}{+h}Pillar – Corruption Killer: Training in Right to Information Act, 170, TV Samy Road West, R.S. Puram, 4 p.m.\n\nHindusthan Institute of Technology: Fourth national level technical symposium – Spartanz 16, 9.30 a.m.\n\nSuguna College of Engineering and Shanthi Social Services: Free medical camp, Suguna College of Engineering campus,\n\n10 a.m.\n\nKarpagam Academy of Higher Education: Advanced Materials and Applications – National Seminar, 9.30 a.m.\n\nSree Narayana Guru Mission and Educational Trust: 21{+s}{+t}anniversary of Narayana guru mandiram, polytechnic college premises, Madukkarai, 8 a.m.; Polytechnic college: 32{+n}{+d}annual day celebrations, 2.30 p.m.\n\nCoimbatore Malayali Samajam – Ladies Wing: International Women’s day, CMS – T Gopalan Nair Memorial Auditorium, 9{+t}{+h}street extension, Gandhipuram, 5 p.m.\n\nNanjiah Lingammal Polytechnic College: International Women’s Day, 3 p.m.; Lighting ceremony, 10 a.m.\n\nTejaa Shakthi Institute of Technology for Women: National Conference – Rama 16, 9.30 a.m.\n\nVLB Janaki Ammal College of Arts and Science: Alacrity – Inter Collegiate Management Meet, Conference Hall – UG Seminar Hall, 10 a.m.\n\nTirupur\n\nAngel College of Engineering: Sports day celebrations, 4 p.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}