{
    "author": [], 
    "text": "A campaign that she launched in Aravakurichi constituency in July last year, ostensibly on the lines of the U.S. political model of holding primaries to allow electors to select their candidates, has put TNCC spokesperson S.Jothimani in the middle of a controversy in Karur district.\n\nAlthough Ms.Jothimani maintains that the campaign was launched with the larger objective of ushering in a political change, there is no mistaking her intention of projecting herself as the potential candidate of the constituency.\n\nMs.Jothimani, considered part of the ‘Rahul brigade,’ started her political career as a councillor of the K.Paramathi panchayat union in the district in 1996 and unsuccessfully contested the Assembly election in 2011 and the 2014 Lok Sabha election from Karur.\n\nIn recent months, she has intensified the campaign on the ground and through social media as well. She has been meeting various sections of the people in the constituency and called upon them to give a “missed call” if they supported her candidature. Calendars and pamphlets explaining the initiative have been distributed across the constituency. Her Facebook and twitter accounts with the hashtag, ‘Aravakurichi 2016,’ are replete with postings and pictures of her interaction with voters of the constituency. She has also formed youth groups to reach out to the voters.\n\nDescribing her initiative as an attempt to implement Rahul Gandhi’s vision of ushering in a change in the political system and encourage people’s participation in the democratic process, Ms.Jothimani says people have been totally alienated in the present political system.\n\nHowever, she maintains that her campaign is not intended to lobby for the seat.\n\n“It is not just about getting the seat. I have applied to contest from the seat though. But it is for the party to decide to field me or not,” she says.\n\nHer campaign has raised the hackles of both DMK and Congress office bearers in the district.", 
    "section": "national", 
    "title": "Jothimani’s campaign kicks up row in Karur", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}