{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Forest Department has arrested two persons responsible for the death of a female leopard last week in Mavallam beat of Hasanur division in Sathyamangalam Tiger Reserve.\n\nA special investigation team led by Hasanur Forest Range Officer Palanichamy narrowed down on two local youths Kumar (30) of Devarnatham and Rangan (32) of Mavallam, who had taken on lease a nearby land for potato cultivation. Both were first-time offenders. They were remanded in judicial custody under Section 9 of Wildlife Protection Act 1972, District Forest Officer of Hasanur Division C.H. Padma said.\n\nThe team that also constituted Forester Shivakumar, and Forest Guards Alagiri, Govind, Ramasamy and Nausher established that the duo had kept metal wire trap to capture wild boars and hares, without realising the consequences.\n\nThe investigation team was felicitated by the Field Director of STR I. Anwardeen and Ms. Padma for fast-tracking the probe and arresting the offenders within five days.\n\nWithin hours of the leopard’s death after getting snared in the metal wire trap, the forest team rushed to the spot. The post-mortem was carried out by forest veterinarians in the presence of the DFO, the president of Village Forest Committee of Mavallam and a representative of Nature and Geo Society. Thereafter the carcass was burnt completely.\n\nThe leopard was found to be in an advanced age and the forest team surmised the predator had come closer to human habitation in search of easy prey.\n\nThe predator could not escape as the noose had tightened around its neck.\n\nIt was not unusual for locals to set traps for wild boars and hares primarily to prevent them from destroying agricultural crops, but were also in the habit of consuming their meat. However, there was no poaching angle, as such.\n\nThough the Forest Department has powers to deal sternly with the animal trappers, eating of the meat of boars and hares by locals seldom comes to light, it is learnt.\n\nNevertheless, the department has been carrying out routine checking of boundary lines in recent years, and there have been instances of very many snares being removed, Ms. Padma said, adding that there has been abundant increase in the population of boars in the forest area.", 
    "section": "national", 
    "title": "Leopard death: forest team arrests two persons", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}