{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Chaturti puja, Railway Colony, 7 p.m.\n\nMuneeswarar Temple: 36{+t}{+h}Masi festival; discourse on ‘Sivanum Sivanadiyarum’ by Savithri Balasubramanian, Tirumangalam, 8 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh Study Circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S. S. Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Thevaram’ by S. Kaliyamoorthi, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nSri Sathguru Sangeetha Samajam: Nama sankirtan by R. Ganesh, Lakshmi Sundaram Hall, 6.30 p.m.\n\nGandhi Museum: N. Nanmaran, former MLA, speaks on ‘George Joseph’ and K. Lakshmi of Sri Meenakshi Government College for Women on ‘Sarojini Naidu;’ K. M. Natarajan, chairman, Tamil Nadu Gandhi Smarak Nidhi, presides, Library, 5.30 p.m.\n\nGENERAL\n\nLady Doak College: 50{+t}{+h}Graduation Day; Sandhya Chintala, vice-president, Nasscom, addresses, Golden Jubilee Auditorium, 10 a.m.\n\nSourashtra College: S. K. Jaganathan, secretary, Sourashtra College Council, inaugurates Parnassus 2016, inter-collegiate literary festival; L. P. Ramalingam, Principal, presides, New Auditorium, 10 a.m.\n\nE. M. Gopalakrishna Kone Yadava Women’s College: State-level science expo, Tiruppalai, 9.30 a.m.\n\nSubbalakshmi Lakshmipathy College of Science: 19{+t}{+h}Graduation Day; T. S. Krishnamurthy, former Chief Election Commissioner, addresses; R. Lakshmipathy, president, Subbalakshmi Lakshmipathy Foundation, presides, Aruppukottai Road, 2.30 p.m.\n\nNadar Mahajana Sangam Sermathai Vasan College for Women: Inauguration of NSS camp, D. Karthigarani, Principal (in charge), presides, Koodakoil, 7 p.m.\n\nOAA MAVMM School of Management: Faculty development programme on “Effective teaching skills;” K. Alagusundaram, Director, addresses, 10 a.m.\n\nSt. Charles College of Education: International seminar on “ICT in education and research;” M. A. Jothi Rajan of Arul Anandar College delivers valedictory address, Thanakkankulam, 3.45 p.m.\n\nVenture Institute of Biotechnology: Chandrakantha Jeyabalan, former Vice-Chancellor, Tamil Nadu Open University, inaugurates seminar on “Current perspectives in enzymology,” CSI College of Nursing, Pasumalai, 10 a.m.\n\nMaria Nursery and Primary School: Chrysalis Day, S. S. Colony, 10 a.m.\n\nTHE HINDU : World of Women, International Women’s Day celebration; M. V. Muthuramalingam, chairman, Velammal Educational Trust, flags off car rally, Velammal Medical College Hospital, Ring Road, 8 a.m.; B. Kalpana of Guru Hospital flags off two-wheeler rally, Gandhi Museum, 9 a.m.; medical camp, 10 a.m.; panel discussion on “What empowers women;” J. Charukesi, Postmaster General; Helen Christina of Sri Meenakshi Government College for Women; Rajakumari Jeevagan, chairperson, Women Entrepreneurs; Chitra Ganapathy, entrepreneur, and Hema Sathish, consultant cosmetic dermatologist, address, Fortune Pandiyan Hotel, 3 p.m.\n\nMadurai Productivity Council: Management development programme on “Passion for safety is a way of life;” P. Bose, Director, Industrial Safety and Health, and P. Srinivasa Varadhan, president, TVS Srichakra, address, Hotel Western Park, TB Road, 9.30 a.m.\n\nVoluntary Association for People Service: R. Balasubramanian of Satyam Kisan care inaugurates training programme in agri-clinics and agri-business centres; V. K. Paul Pandy, Head, Krishi Vigyan Kendra, Aruppukottai, presides, 39 Besant Road, Chokkikulam, 11 a.m.\n\nTamil Nadu National Electricity Workers’ Federation: State executive committee meeting, New College House, Town Hall Road, 10 a.m.\n\nWomen Development Resource Centre: International Women’s Day celebration, Manohari Doss presides, 55 TB Road, 11 a.m.\n\nVidiyal: Mothers’ meet, AA Road, Rathinapuram, 2 p.m.\n\nEvidence: Seminar on ‘Justice for Dalit women,’ A. Kathir presides, Hotel Chentoor, West Perumal Maistry Street, 9.30 a.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar,; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}