{
    "author": [
        "Aditi R"
    ], 
    "text": "The Greater Chennai Corporation is planning 20 more shelters for the homeless in the city. Of these, seven shelters will accommodate only women and children and one will be for physically challenged women.\n\nThis comes as a welcome move to women like Shailaja, who have been living on the streets, constantly worried about their safety and security.\n\n“Recently, I was sleeping on the pavement near Citi Centre when I felt a thud on my back. When I woke up, I saw a man, who along with his friends, was laughing at me. I quietly got up and went near a temple and stayed up all night,” said Shailaja, who has been living on the streets for the past two years. “We are often insulted and abused by passers-by. It is especially scary at night and we rarely are able to sleep in peace,” she said.\n\n“Each shelter will have a capacity of 35 to 40 people. Our team has surveyed all the areas extensively and identified the ones where the facilities are needed,” an official said.\n\nAccording to a survey conducted by the Information & Resource Centre for the Deprived Urban Communities (IRCDUC) in six zones across the city, last year, 51 percent of the over 8,000 homeless people were women and girl children.\n\n“The situation of homeless women is precarious as it exposes them to all forms of gender violence and violates their personal dignity. Setting up more shelters is definitely a welcome move,” said Vanessa Peter, Policy researcher at IRCDUC.\n\nHowever, the number of homes still falls short of the 75 mandated by the Supreme Court.\n\nOfficials also claim that 10 more shelters for the homeless, including three for women, are in the pipeline. “We are aware of the vulnerabilities women and girls on the streets have to face and we are doing the best we can,” the official added.\n\nActivists suggest that a linkage with livelihood and a permanent solution for the homeless living in shelters would be more helpful. “The shelters only act as pit-stops. We need a more strengthened and permanent solution to end their distress,” said Vanessa.", 
    "section": "national", 
    "title": "More shelters, a relief for homeless women in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}