{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Collector M. Karunakaran launched voter awareness events at Rani Anna Government College for Women at Pettai near here and also at the Corporation on Friday.\n\nAfter administering oath to the students on exercising their franchise without fail on May 16, Dr. Karunakaran inaugurated the election awareness signature campaign and rally, in which the students actively participated.\n\nBesides casting votes, the young electorate should also encourage the neighbours to fulfil their democratic right without fail, the Collector urged them. In an awareness campaign launched at Tirunelveli Corporation, Dr. Karunakaran flagged off a vehicle, which would visit various parts of the city to appeal to the voters to include their names in the voters’ list and cast their votes positively so as to ensure formation of a democratic government.\n\nRevenue Divisional Officer P. Fermi Vidhya was present.\n\nThoothukudi\n\nWith just over a month left for the Assembly polls, District Administration has launched a campaign here on Friday to raise awareness about the importance of casting votes. The authorities here have come up with a novel way of creating awareness by pasting stickers on public transport vehicles. A message stressing the importance of voters’ participation to ensure 100 percent polling was highlighted.\n\nDistrict Revenue Officer S. Murugaiah pasted stickers in a bus at Thoothukudi old bus stand in the presence of Thoothukudi Sub Collector and Returning Officer to Thoothukudi Assembly constituency S. Gopala Sundara Raj and Regional Transport Officer K. Anand. Three stickers would be pasted in each of the buses, the DRO said. The stickers sported messages including ‘voting is our right as living being,’ ‘voters should check whether their names are listed in the electoral roll while accessing the website www.elections.tn.gov.in’ and ‘May 16th is the day of polling and all eligible voters get ready to cast their votes to ensure 100 percent polling.’", 
    "section": "national", 
    "title": "Move to create voter awareness", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}