{
    "author": [
        "S Ganesan"
    ], 
    "text": "CII hopes to get a grant of Rs. 15 crore from the Centre for the project\n\nThe detailed project report for setting up a common facility centre for an apparel cluster proposed to be promoted in Karur would be submitted to the Union government soon for sanction of financial assistance under the cluster development programme.\n\nThe common facility centre has been planned as part of an initiative taken up by the Confederation of Indian Industry (CII), in association with the Karur textile industry, to promote a world class apparel cluster in the town.\n\nP. Sudhakar, chairman, Confederation of Indian, Karur, told The Hindu that a preliminary proposal on setting up a common facility centre in Karur had been submitted to the Centre during interactions with the Union Ministers Nirmala Sitharaman, Kalraj Mishra, and Santosh Kumar Gangwar in January.\n\nGrant Thorton, a consultancy firm engaged to study the gaps and future prospects of Karur textile industry, by the CII and the textile industry, would submit the detailed project report for the common facility centre.\n\nThe report would be submitted to the Centre for sanction of grant under the Cluster Development Programme of the MSME Ministry. The CII was expecting a grant of about Rs. 15 crore for the facility.The facility would have expensive machinery, which the member units cannot afford to acquire individually, a design studio, product testing, and other facilities.\n\nThe site for the facility had been identified at the Textile Park in Karur, Mr. Sudhakar said. The apparel cluster would be promoted through a special purpose vehicle, Karur Cluster Services Pvt. Ltd., floated. About 20 members had been enrolled as members of the cluster so far and one of the member units would be an all-women unit.\n\n“We are talking to an NGO to promote a unit entirely by underprivileged people,” Mr. Sudhakar said.\n\nKarur currently manufactures and exports textile products, mostly handloom made-ups, estimated at Rs. 4,000 crore to various countries. The initiative aims at bringing about a diversification by promoting an apparel cluster. Mr. Sudhakar said most of the manufacturing processes of the member units would be done at the cluster.\n\nThe cluster would take care of marketing, recruitment, and training of manpower, designing, and product testing.\n\nMember units would be given an opportunity to move out of the umbrella if they learn the processes and manage to set up the required machinery for the processes after two years. Or else, they could continue under the cluster.\n\nMr. Sudhakar did not foresee much difficulty in the shift towards apparel manufacturing as most processes would be same as of the handloom made-ups manufacturing units. Besides, the members had been provided extensive orientation and taken on visits to Tirupur.\n\nThe help of Tirupur industry had been taken and tie-up arrangements had been made with a few manufacturers.\n\nThe CII had unveiled a Vision 2023 to develop Karur as a mega integrated textile and apparel cluster with an annual turnover of Rs. 25,000 crore with the apparel sector alone accounting for Rs. 5,000 crore.\n\nCOLLECTIVE RESPONSIBILITY\n\nExports from Karur are estimated to be about Rs. 4,000 crore a year\n\nMost of the manufacturing of the member units will be done at the cluster", 
    "section": "national", 
    "title": "Move to set up common facility for apparel cluster", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}