{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Over 300 workers of Bannerghatta Biological Park – from zoo keepers to animal handlers and animal veterinarians – will go on a strike on Saturday, in protest against the treatment meted out to officials by the police who had summoned them on Thursday in connection with the investigation into the recent escape of a leopard from the recue centre.\n\nConsequently, the zoo, which sees thousands of visitors on weekends, will be closed on Saturday.\n\nExecutive Director Santosh Kumar and two other officials were summoned to Bannerghatta Police Station after a complaint that officials endangered life of people because of their ‘negligence’ that led to the escape of the leopard on February 15.\n\nThe officials arrived at the station at 2 p.m. and were made to wait till 6.30 p.m. without the policemen even taking their statement, said a source at the park.\n\nAt 7 p.m., they returned to the park, unhappy with the treatment meted out by the police. In protest against the filing of the case and the ill-treatment by the police, the workers have decided to shut the zoo on Saturday.\n\nSantosh Kumar said, “I was given a notice on Tuesday that a case had been filed against me and Range Forest Officers. I had sent an officer on Wednesday, but police insisted that I come in person. I went at 1 p.m. Initially, they made me wait saying the computer operator had not arrived.” At 2.30 p.m., the police began to take his statement.\n\n“But they made glaring mistakes and had to redo the entire process. That is when I realised that they were deliberately harassing us. Once I had given my statement, they told me to wait till the sub-inspector arrived. At 6 p.m., I told them I had to leave. The policemen then gheraoed my car. It was only when I called my seniors that they let me go.\" He expressed ignorance about a bandh call.\n\nA senior police officer said, “The director was summoned in connection with the investigation into a complaint. There may be delays due to pending complaints or technical issues, but there was no harassment.\"", 
    "section": "national", 
    "title": "Park staff miffed with cops; zoo closed today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}