{
    "author": [
        "Aditi R"
    ], 
    "text": "Meenakshi was fast asleep along with her two kids, when she was woken up by a loud thud around 2 a.m on Thursday.\n\nWhen she opened the door, she realised that a part of her house had caved in.\n\nAs many as 22 other families living at Visalakshithottam near Mandavelli railway station, also heard the earth-shattering noise, which was the result of a part of the bridge adjoining the street, collapsing.\n\n“It was very scary. What if it had been severe?” she asked pointing out to the big crack near her door that had been caused by the impact of the collapse.\n\nThree houses had been constructed on the bridge; luckily, as residents put it, the owner of the house at the farthest end was away.\n\n“We have told them several times not to live there, as it is an old bridge. We have also asked them to move to a better place, but they are reluctant,” said a Greater Chennai Corporation official who had come for inspection.\n\nAlternative housing sought\n\nResidents, however, say they will move only if they are provided with an alternative place. They further claim that they are still waiting for an alternative housing facility, which officials had promised them last year.\n\n“They had come to number our houses and took our pictures. The officials promised they would allot us a house in Ezhil Nagar. But they now come and ask us to find another place. How can we afford that?” asked K. Priya, a domestic worker.\n\nMany residents have now temporarily moved out to the streets to avoid any mishap.\n\n“Our house is shaking; it can collapse anytime. We do not want to take a chance,” said Meenakshi.\n\n“We have been living here for the last 50 years. If this is illegal, then give us an alternative place, we will gladly move there,” said R Shekhar, a daily wage labourer, lifting up his kitchenware that had fallen from his house into the crack.", 
    "section": "national", 
    "title": "Partial collapse of bridge triggers panic", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}