{
    "author": [
        "K Manikandan"
    ], 
    "text": "Developers and real estate experts in Chennai are of the opinion that the Real Estate (Regulation and Development) Bill, passed in Rajya Sabha on Thursday, will make investors glad as there are plenty of provisions to safeguard their interests.\n\nAnalysts said the Bill — passed by the Upper House of Parliament and is just a couple of steps from being enacted — has come at a time when the industry is clearly not at the finest stage in its growth phase.\n\nRam Prabhu, joint secretary of Builders Association of India’s Southern Centre, Chennai, said: “The timing is not right. Consumers are already subject to a lot of problems in the form of delays in taking possession of their homes due to financial challenges faced by builders. It will be initially tough, but gradually over a period of time, things will fall in place.”\n\nAn analyst in a real estate firm said there would be both short- and long-term benefits.\n\n“The Bill will primarily protect the interests of home-buyers, while making the industry a lot more credible and organised,” he said.\n\nMr. Prabhu too agreed, stating that over a course of time, “non-professional” organisations will be pushed out of the industry, paving the way for only companies that do not deviate from planning permits or violate norms to be in the field of housing development and promotion.\n\nHe said the provisions in the Bill were aimed at ensuring timely delivery of projects and also making it possible for government agencies to levy a penalty on builders who do not stick to their scheduled date of project completion.\n\n“This is a welcome move and we were expecting this for a long time. Consumers’ point of view has been safeguarded. Developers should not take certain provisions negatively as the Bill only expects developers to deliver and perform,” said Rajesh Dave, immediate past-president of Chennai Real Estate Agents’ Association.\n\nRecalling the multi-storey building collapse of June 2014, Mr. Dave said that with the developer abandoning the project and banks pursuing borrowers for repayment of money, the Bill would eliminate the worries of investors.\n\nIt would also pave the way for funding by banks and even foreign financial institutions in housing projects as finally, real estate was getting an “industry status,” he added.\n\nAjit Kumar Chordia, president, Confederation of Real Estate Developers Association of India, Chennai, said they welcomed the move and that they looked forward to single window clearance, online approvals and model building bye-laws.", 
    "section": "national", 
    "title": "‘Real Estate Bill investor-friendly’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}