{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Anna University Registrar S. Ganesan said Sairam Engineering College in West Tambaram had been asked to submit a detailed report on the death of a student on Friday.\n\n“We will also send a committee to the college to get to the bottom of the matter. We will take this up very seriously.”\n\nA. Ilayaperumal, Director, Students Affairs Committee at the university who earlier mediated between the protesting students and the college management said, “As far as Anna University is concerned, we are responsible for the academic aspects of our affiliated colleges such as conducting examinations, ensuring that the affiliated college has adequate facilities and so on. We cannot really force a college to change its ‘social rules’. However, we believe that students must be relaxed and have an amiable atmosphere while pursuing their studies.”\n\nThe college authorities ruled out the possibility of the student falling accidentally into the well as it was located in a remote place where students hardly ventured. Enquiries revealed that there were seven wells on the campus that were covered with iron mesh.\n\nThe college authorities had decided to replace the mesh with a more secure cover and the process was already complete in a few wells. Since students are not allowed to use mobile phones in the college, it is not clear whether the victim made any calls or sent messages on Friday.\n\nCase registered\n\nAbinath’s parents arrived late on Friday and were taken to the Kundrathur police station, where a case was registered about the boy’s death.\n\nOn reports that Abinath had applied for transfer certificate and the management refused to issue the same insisting on payment of fees for four years, CEO, Sairam Group of Institutions.Saiprakash said last year alone TCs were issued to 48 students from the engineering college on request.\n\n“We retain the first year tuition fee only. There is no question of demanding or retaining any other fee when a student seeks TC,” he said.\n\nMeanwhile, a group of students studying in Sairam Engineering College have threatened to launch a strike against the college management.\n\nThe Sneha Suicide Prevention Centre helplines are 044-24640050, 24640060, and the government’s helpline is 104.", 
    "section": "national", 
    "title": "Sairam College asked to submit report", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}