{
    "author": [], 
    "text": "It will protect officials against possible allegations, writes S. Sundar\n\nThe single window clearance for the political parties seeking permission for public meetings and rallies during the electioneering is likely to bring more transparency in such dealings.\n\nA police officer said that the permission for all campaign vehicles, opening election offices and also for usage of helicopters for leaders would be given by the Returning Officers of the Assembly segments concerned after obtaining no-objection certificate from the station house officer (SHO) of the police station concerned.\n\n“The system is to ensure that fair chances are given to all political parties and independents. The system would work on a first-come-first-served basis,” the police officer said. While for the political parties, the single window clearance will make their job easier as they need not run from pillar to post and make the application but can submit it sitting at their office or home through the websitewww.elections.tn.gov.in\n\nFor the officials, it would save them from possible allegations from the political parties of showing favouritism to the ruling party.\n\nUnder the system, representatives of the candidate or the political parties would make the application with the details of the venue, nature of meeting/rally, time, date and duration. Once the details are updated, the representative would get an acknowledgement on his/her mobile phone.\n\nAfter the SHO (Inspector of Police) issuing an NOC, the Returning Officer would process it further.\n\n“The applicant will have to visit the RO’s office only to collect the hard copy of the permission. Otherwise, he need not move out,” the officer said.\n\nThe system ensures a perfect queue system and seniority of application cannot be violated.\n\n“It will be monitored by not only the District Collector, but also the office of Chief Electoral Officer,” the officer said.\n\nHowever, the relief for the police is that permission would be given only in the designated venues and no violation allowed.", 
    "section": "national", 
    "title": "Single window clearance for public meetings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}