{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "In January, a headless body was found near a garbage bin in Ramapuram. A month later, it was identified as that of actor Sasirekha. Subsequently, her husband Ramesh and his friend were arrested for the murder. But what happened to the seven-year-old son of Sasirekha and Ramesh?\n\nA group, consisting mostly of software engineers, decided to find out about the fate of the boy.\n\n“The boy is now studying in class III at a private school in Tambaram. We have taken care of his fees,” says S. Anand, who works at a software company on Old Mahabalipuram Road. This is not a one-off case. These software professionals regularly seek to help victims of crime.\n\nAnand is one of the seven who started a trust called Seyal (action) in 2013 which is now committed to doing this work. “It began on my birthday. My friends — A. Ashwin, S. Jagan, A. Karthik, Y. Umar and Y. Syed — gathered and we decided to start a trust to help others. While some are working for IT firms, some are into business. Before we started this, I used to help people on my own,” he says.\n\nAs part of the trust’s activities, the young men started police awareness meetings and medical camps.\n\n“I got in touch with P. Saravanan, the present deputy commissioner, T. Nagar, in 2013. One day, he called me and asked if I could help a disabled woman in Adambakkam who was abandoned by her husband and was on the verge of committing suicide. And, from there started our journey of helping crime victims,” adds Anand.\n\nThe trust got her to study. “She was able to study till class IX and after this, we got her a sewing machine. Now, she earns around Rs. 8,000 per month and is independent,” says Ashwin, who works in the transport section of the IT firm where Anand works.\n\nSubsequently, word about what the trust does began to reach other software engineers and employees in his company.\n\n“Now, there are over 200 people from different IT companies in the city. We use their funds to help people and also to install CCTV cameras and to take measures that can reduce accidents,” says Ashwin.\n\nHowever, the trust does not just give away money to victims.\n\n“We have many student counsellors. We first understand the need of the victims and then provide the necessary help. However, we do not have any restriction in providing education. It can be any school the child wants,” adds Anand.\n\nNow, their network has expanded so that they can help any victim or person in need across the city.\n\n“Our volunteers can reach them in 10 minutes. We may not be able to change the entire world, but we can help people around us,” says Ashwin.", 
    "section": "national", 
    "title": "Software engineers aid crime victims", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}