{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Special educators, teaching differently abled students, were special in a way and gifted in their profession, S. Subbiah, Vice-Chancellor, Alagappa University, said.\n\n“It is a rare opportunity for individuals to serve and empower students with disabilities and contribute towards social development and nation building,” he said addressing a two- week training programme on “Teaching Mathematics and Science Braille Code” for special educators here on Thursday.\n\nThe teachers had to be trained to use technology while teaching students with disabilities and they had to be well-versed in their subjects as well, he said. Regular teachers had to promote emotional stability and social adjustability among students, whereas special teachers had to find out limitations in special children and help them to overcome inferiority complex, he said. The training programme was organised by the Department of Special Education and Rehabilitation Science of Alagappa University in collaboration with National Institute for the Visually Handicapped.\n\n“The aim of this training programme is to provide professional enrichment among special educators. It is the Continuing Rehabilitation Education (CRE) programme, which offers training to in-service special educators to upgrade their knowledge and to help them in their professional growth,” he said.\n\nAddressing the programme, S. Rajaguru, Associate Professor, Sri Ramakrishna Mission Vidyalaya College of Education, Coimbatore, said that for being a special educator, it was the attitude that played a vital role in the process of inclusion. “There is a paradigm shift from special school to inclusion and teachers’ attitude contributes to its success,” he said.", 
    "section": "national", 
    "title": "Special educators are gifted in their profession, says Vice-Chancellor", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}