{
    "author": [
        "S Prasad"
    ], 
    "text": "A view of the Real Time Kinematics (RTK) GPS used by the scientists (below) from the National Institute of Ocean Technology for conducting the shoreline monitoring survey for beach restoration project near new pier at Thengaithittu in Puducherry on Thursday.— Photos: S.S. Kumar\n\nNIOT and Puducherry government to fund construction of two submerged reefs\n\nSeeing the city’s beach turn sandy again may become a reality with the National Institute of Ocean Technology (NIOT) of the Ministry of Earth Sciences taking up a major project for restoration of the beach in association with the government.\n\nNIOT has already conducted a survey for the coastline and finalised the concept design for the beach nourishment work. The total project is estimated at Rs.30 crore and will be funded by the Ministry of Earth Sciences.\n\nThe beach which once extended into the sea for a few metres has now shrunk owing to both natural and man-made activities.\n\nThe construction of a sea-wall from the northern side of the harbour to a distance of 5 to 6 km had resulted in the city losing its sandy beach to a distance of 200 metres along the coastline over the years.\n\nA team from NIOT has started shoreline monitoring survey using Real Time Kinematic (RTK) Global Positioning System (GPS) near the south of the new pier for the beach restoration project.\n\nTo start with, numerical modelling is being carried out by NIOT to understand the near shore coastal processes and movement of sand particles.\n\nNumerical modelling\n\nThe numerical modelling is done to analyse the depth of sand, detailed design of the proposed structure, distance from the shoreline and the construction methodology.\n\nBased on the numerical modelling, NIOT will be going for a Detailed Engineering Design in a month’s time, said a scientist of NIOT.\n\nThe scientist added that the project is expected to be completed by May 2017.\n\nAccording to the proposal, two submerged reefs will be built at a distance of 400 metres from the sea near the Chief Secretariat and the south of the new pier.\n\nThe reef near the Chief Secretariat will be funded by NIOT while the second reef will be funded by the government.\n\nAs per initial estimates, sand to the extent of 3.0 cubic million metres need to be placed north of the harbour.\n\nOver the last several years, the beach has been undergoing erosion and nourishment now will result in restoration of sand level.\n\nWhile the reefs are built, initial beach nourishment will be done by the government, said a senior scientist of NIOT.\n\nNIOT had also suggested eco-friendly techniques and soft engineering measures for retaining the sand and restoring the ecological functions of the coast.\n\nThe funds for the project will be finalised based on the Detailed Engineering Design and approval from the Ministry of Finance, he added.\n\nBased on the numerical modelling, NIOT will be going for a Detailed Engineering Design in a month’s time. The project is expected to be over by May 2017.\n\nNIOT scientist", 
    "section": "national", 
    "title": "Survey for beach restoration on", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}