{
    "author": [
        "R Rajaram"
    ], 
    "text": "Days after a Thanjavur farmer was beaten up by the police for loan default leading to public outcry, the police authorities on Friday transferred three constables to the Armed Reserve police and ordered an inquiry into the incident.\n\nTwo head constables – Raja and Kumaravel – and constable Yesuraj were transferred to the Armed Reserve unit from the Pappanadu police station.\n\nThe constables would be subjected to inquiry at the unit in connection with the assault on G. Balan at Cholangankudikadu village in the Orathanadu police sub division last week.\n\nConfirming the transfer, Inspector General of Police, Central Zone N.K. Senthamaraikannan told The Hindu on Friday, that an inquiry had been ordered into the incident.\n\nMr. Senthamaraikannan said he would conduct the inquiry. The Inspector of Pappanadu police station would also be called for questioning.\n\nThe action comes amid huge public outcry against police action. The video footage of the police assaulting the farmer in full public view went viral on the social media. His wife reportedly asked why the police should harass a farmer, when others owning several crores in loans to banks were allowed to leave the country, in a reference to the Vijay Mallya episode.\n\nOn Thursday, the National Human Rights Commission ordered notices to the Chief Secretary and the Director General of Police on the issue.\n\n‘Arrest policemen’\n\nMeanwhile, the Vivasaya Sangankalin Kootiyakkam (the Federation of Farmers’ Association) has demanded the arrest of the police personnel who assaulted Mr.Balan.\n\nIt has threatened to go on an indefinite fast in Orathanadu from Monday if the demand was not met in the next two days. The federation rejected the transfer of the police personnel as a routine action.\n\n‘Sanction compensation’\n\nP.K.Deivasigamani, federation president, who chaired a meeting here on Friday, also demanded immediate return of the seized tractor to Mr.Balan and urged the government to sanction a compensation of Rs.10 lakh to the farmer for the mental agony caused to him by the police action.\n\nLeaders of over 10 farmers organisations and farmers would participate in the proposed indefinite fast from Monday, Mr.Deivasigamani said.\n\n(With inputs from S. Ganesan)\n\nAn inquiry has been ordered into the incident after a public outcry, NHRC notice to govt.", 
    "section": "national", 
    "title": "Three constables transferred for assault on farmer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}