{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Madurai-Maniyachi-Tuticorin section to be taken up in the first phase\n\nRail track doubling work between Madurai and Nagercoil would be completed in three years, said Divisional Railway Manager Sunil Kumar Garg.\n\nTalking to reporters here on Friday after inspecting the facilities at Tirunelveli railway junction, Mr. Garg said that the Union government, in its recent Railway Budget, had allocated Rs. 100 crore for track doubling work between Madurai and Nagercoil, which would be executed by Rail Vikas Nigam Limited. The RVNL officials, after holding discussion with officials concerned, were preparing the proposal for this much-awaited project.\n\n“Once the proposal is ready, the RVNL will send it to various departments of Indian Railways for mandatory approval before getting the formal sanction. Once the track doubling work is completed, this stretch, which has a main line and two loop lines, will have two main lines and as many loop lines. With this additional facility, the speed of trains can be increased and there is possibility of operating additional trains,” Mr. Garg said.\n\nHe said that track doubling would be taken up between Madurai and Vanchi Maniyachi and Tuticorin in the first phase, followed by Vanchi Maniyachi-Nagercoil section.\n\nMr. Garg said that two-third of gauge conversion work between Shencottah and Punalur had been completed.\n\nAfter completing the tunnel work at Ariyankavu, train service would resume in this section by the year-end. Mr. Garg appealed to the public, especially students, to visit Science Express, which would be stationed at Tirunelveli Junction for four days from March 13. When the DRM happened to see construction materials and steel rods kept near platforms and signboards near toilets, he asked the officials to remove them. He also inspected the escalator erected at Tirunelveli Junction at a cost of Rs. 2 crore.\n\nEscalator\n\nThe escalator installed at Tirunelveli Junction is likely to be formally inaugurated on March 15 by Vashishsta Johri, General Manager, Southern Railway, even as model code of conduct for the forthcoming May 16 Assembly polls is in force.\n\nThe poll code prohibits inauguration of any project after election notification. Collector and District Electoral Officer M. Karunakaran said that he would enquire with officials concerned about the proposed inauguration of the escalator. “Completed projects cannot be inaugurated once model code of conduct comes into force,” Dr. Karunakaran said.", 
    "section": "national", 
    "title": "Track doubling to be over in three years: DRM", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}