{
    "author": [], 
    "text": "TNSTC’s concessional bus pass scheme NEEDS BETTER REACH\n\nNot many know that the Tamil Nadu State Transport Corporation (TNSTC) offers daily, weekly, and monthly passes for commuters. These passes are priced at Rs. 50 for any number of cash-free trips in any government town bus for a day, Rs. 300 for one week and Rs. 1,000 for a month. Commuters and the conductors need not hunt for change when these passes are used.\n\nThe daily passes can be bought in any government town bus and the weekly and monthly passes from the bus stands in the city, by producing a photo identity card.\n\nPersons holding the card can travel in ordinary, limited stop service, express and low platform comfort buses. However it cannot be used to travel in night shift buses.\n\nDemand is more for the daily passes. Around 15,000 such passes are issued every month in Coimbatore. Courier and online product delivery persons use this pass in more numbers as buses are the most affordable mode of transport and these passes make it even more convenient to make multiple trips across the district as well. A number of small scale businessmen and executives also use the daily passes.\n\nDemand is very less for the weekly pass as only around 100 of them are issued every month. Bank employees, government staff and middle class regular bus users prefer the monthly pass. Around 650 such monthly passes are sold a month.\n\nThe concessional pass system is a big hit in Chennai but not that popular in Coimbatore. TNSTC officials say that it is because there are hardly any private town buses in Chennai and those who buy the pass can travel in a majority of the town buses there. Of the 753 town buses in Coimbatore only 137 are private buses, but a good number of regular passengers seem to prefer private buses for several reasons.When the passes were introduced in Coimbatore four years ago, the transport corporation publicised the details through hoardings at bus stops and bus stand and stickers affixed in buses.\n\nBut this was a one-time exercise that has faded away. TNSTC officials said that conductors are instructed to popularise the concessional bus passes among their passengers, but it is doubtful how far it is translated to action.\n\n(Reporting by\n\nM.K. Ananth)", 
    "section": "national", 
    "title": "Travel at ease", 
    "subsection": "tamilnadu", 
    "date": "2016-03-12"
}