{
    "author": [], 
    "text": "Protect cycling track\n\nWhile the work to improve pedestrian infrastructure has finally started on Ramaswamy Road in K.K. Nagar, it remains to be seen how the pavement-cum-cycling track would be put to use by the public. If necessary, residents’ associations should seek the support of the councillor and the police to protect the track from encroachments.\n\nTo ensure the success of the project, I believe certain changes in traffic movement have to be carried out, which include making Ramaswamy Road and Lakshmanaswamy Road one-way.\n\nCapt. S. Nandakumar\n\nK.K. Nagar\n\nNo justification\n\nA parapet on a portion of Buckingham Canal, near Sai Baba temple, Mylapore, has been in a good condition and only a few years ago, it was tiled as part of beautification efforts. However, for no valid reason, it has been pulled down. There are no encroachments on this section to justify this decision.\n\nBaskar C.S.\n\n17 Ramarao Road\n\nPedestrian safety\n\nThe Inner ring road connecting Velachery and GST Road is used by many to access the Velachery MRTS railway station. It does not have any platform for pedestrians to walk. One has to cross the road under the flyover while coming from Madipakkam and Puzhuthivakkam. Many heavy vehicles ply on this road at very high speed. Authorities should at least install a traffic signal to ensure pedestrian safety.\n\nPrabha Vikram\n\nMadipakkam\n\nWater supply lines\n\nChennai Metopolitan Water Supply and Sewerage Board (MWSSB) had laid new water lines two years ago, and until now connections have not been provided to individual houses. These lines have also not been commissioned so far. Will the authorities take steps in commissioning the water supply lines and provide connections to houses?\n\nSuresh\n\nNolambur, Phase I\n\nSave waterbody\n\nMogappair West is a fast-growing residential-cum-commercial hub. There is a famous temple (Santhana Srinivasa Temple) that stands on an odious water body and the foul smell permeates even the sanctum sanctorum. Residents dump garbage in the waterbody and as the temple does not have a rest room, devotees relieve themselves here, forcing the residents to always keep the windows shut. The place is tailor-made for mosquito-breeding.\n\nE.S. Chandrasekaran\n\nMogappair West\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu @ gmail.com)", 
    "section": "national", 
    "title": "10JANCHMAK01_readers_mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}