{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "The centres will issue various certificates to residents from today\n\nIn a move that is likely to bring in greater transparency and make it easy for people to get important documents, the government is all set to inaugurate 126 additional e-seva centres across the city.\n\nThe Chennai Corporation and TACTV (Tamil Nadu Arasu Cable TV Corporation) have already commissioned 70 e-seva centres in many neighbourhoods. Starting Monday, the new e-seva centres will have staff issuing Aadhaar cards, patta, nativity, community, birth and income certificates to residents.\n\n“The Corporation commissioned the facilities a few months ago. They even appointed personnel to man the counters. But residents were not offered any services because of the delay in inauguration,” said P.V. Tamilselvan, Congress councillor in Ambattur.\n\n“Existing e-seva centres collect charges ranging from Rs.10 to Rs.50. Residents want waiver of all the charges at e-seva centres. They should offer services free of cost,” said Mr. Tamilselvan.\n\nChennai Corporation officials said TACTV had signed an agreement to offer free services relating only to Chennai Corporation. Services such as property tax payment, tax assessment application, company tax, professional tax, trade licence and birth certificate will be offered free of cost.\n\nResidents, however, will have to pay money for services relating to passport, Revenue Department and Social Welfare Department. For instance, residents will have to pay Rs. 50 for nativity certificate or community certificate issued by Revenue Department. Personnel at the e-seva centres would scan the original certificates and upload them instantly. Revenue officials concerned would issue the certificates based on the scanned documents. Applicants could collect the certificates from the e-seva counter, said an official.\n\nCorporation ward-level officials said the personnel manning the e-seva centres were not trained by TACTV properly.\n\n“They do not know how to talk to residents. They get Rs.8,000 as salary. They just know how to operate a computer. They need training on how to interact with a desperate resident in need of civic services,” said an official at a ward.", 
    "section": "national", 
    "title": "126 more e-seva centres for city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}