{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Visitors look at exhibits at the stall put up by the Forest Department.— Photo: C. Venkatachalapathy\n\nThe government exhibition-2016 is under way on the Vellore Fort Ground here.\n\nTwenty seven government departments have set up stalls to showcase their schemes and activities at the exhibition being organised by the Information and Public Relations Department.\n\nThe Agriculture Department’s stall drew a lot of children as it had models of tiger, dolphin and dinosaur decorated with millets and pulses such as maize and green gram.\n\nThe Department of Forest displayed samples of plants and trees, while the Vellore Corporation’s stall had models of rainwater harvesting and Combined Water Supply Scheme. The other departments that put up stall included horticulture, health, town panchayat, rural development and social welfare. The stall of the Department of School Education saw plenty of interaction between students and visitors. A number of students displayed science exhibits.\n\nTwo class VIII students of Sri Narayani Vidyalaya came up with a natural mosquito repellent. They said some commercially available mosquito repellents emitted plenty of smoke. Hence, they came up with a solution comprising yeast and sugar to get rid of mosquitoes.\n\nAnother exhibit that drew the attention of visitors was a home-made air cooler using a plastic drum containing ice cubes. The student fixed a fan on top of the drum and inserted pipes in the middle, allowing cool air from inside the drum to flow through the pipes.\n\nOther exhibits included those on healthy and unhealthy food and traffic rules.\n\nThe Reserve Bank of India is also taking part in the exhibition being held till January 24. A special counter will be open from 5 p.m. to 7.30 p.m. to exchange soiled notes and distribute coins. RBI will depute its staffers to educate the public on currency, forex and other functions of the bank, a release said.", 
    "section": "national", 
    "title": "27 government departments set up stalls at expo", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}