{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The special guests of the day display the souvenir released during the CDCA Platinum Jubilee celebration in Coimbatore on Sunday.— Photo: Rayan Rozario\n\nIf today India is standing tall in world chess it is because of the huge contribution made by the men from this part of the region. So it was a fitting gesture by the Coimbatore District Chess Association (CDCA) to remember them during its Platinum Jubilee celebration at the CODISSIA Trade Fair Complex here on Sunday.\n\nThere were many officials from the district, State, national and international chess body who lauded the efforts of stalwarts such as L.G. Ramamurthi (L.G. Group), G.K. Sundaram (Lakshmi Group), N. Mahalingam (Sakthi Group) and Subramaniam (Shanthi Gears) to name a few.\n\n“Mahalingam was the man who revolutionised Indian chess. It was not just the district and the State associations that blossomed and flourished under his care but also the national body,” said D.V. Sundar, vice-president, FIDE (the governing body for the game in the world).\n\n“Mahalingam was instrumental in getting chess included in the approved list of sports disciplines,” he added.\n\nHe also appreciated Arjuna Awardee Manuel Aaron (India’s first International Master) for his contribution and guidance.\n\nThe CDCA (1940) is the earliest known chess organisation in India, much before Tamil Nadu State Chess Association (1947) and All India Chess Federation (1950).\n\nCoimbatore also has several firsts to its credit. The first ever FIDE-rated round robin chess tournament (Mariammal Mahalingam) was held here in 1983. It was at this event that five-time world champion V. Anand got his first FIDE rating. Four years later, he got his third and final Grandmaster norm and became a GM in the Sakthi Finance Grandmaster tournament organised here.\n\nM. Manickam, executive chairman of Sakthi Sugars Ltd. and president of the State Association, said he was pleased to be sitting at the mother home of Indian chess. “Coimbatore is the only city where industries come together to support and organise sporting events without any indifference.”\n\nHe urged the district association to create chess corners in streets. “In Europe, we find pavement chess popular. That’s one place we can attract students to the game.”\n\nD. Rajesh Doraiswamy, joint managing director, Salzer Group of Coimbatore, the chief guest, recalled CDCA’s long journey and showered praises. He also had words of advice on the game and its benefits for the children and parents gathered there.\n\nTo mark the occasion, a souvenir was released by Mr. Manickam and it was received by Mr. Sundar. The CDCA also made it a point to reward past and present champions and winners of schools, colleges, universities and private and public sector tournaments. N. Jayabal, director, Salzer Electronics and CDCA president, welcomed the gathering and V. Vijayaraghavan, CDCA secretary, thanked them.", 
    "section": "national", 
    "title": "A day to remember for CDCA", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}