{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "All ‘Agamas’ (Hindu religious scriptures) are not available now in full and hence opinions formed even by experts on the basis of available materials are divided and interpreted differently by different scholars just as every law is capable of being interpreted by lawyers in different ways, the Madras High Court Bench here has said.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran made the observation while dismissing two public interest litigation petitions against proposed consecration of Sri Ramanathaswamy Temple in Rameswaram on January 20 on the ground that the ceremony had been fixed in violation of ‘Karana Agama’ that governed rituals in the temple. Stating that ‘Agama’ primarily meant tradition, the judges said that the six indigenous religions — Saivam, Vaishnavam, Saaktham, Kaumaram, Sauram and Gaanaapatyam — had their own Agamas earlier. But most of those Agamas were lost after their unification by eighth century theologian Adi Sankara.\n\n“What survive today are only 28 Saiva Agamas and two principal Vaishnavite Agamas. It appears that Saiva Agamas are classified into four types namely Siddhantha Saivagamas, Paasupatha Saivagamas, Kaapalika Saivagamas and Kaalamukha Saivagamas.\n\nAll the 28 Saiva Agamas, on the basis of which most of the temples in Tamil Nadu are built, belong to Siddhantha Saivagamas,” they said.\n\nThough one of the two PIL petitioners had relied upon certain materials to contend that Karana Agama should be followed with respect to the temple , the judges said that there was no uniform opinion even on this issue. After extracting verses from Karana Agama and Kaamika Agama, the Bench said: “It is clear that if an idol has been installed by demons or sages or Gods or persons of divine wisdom, those idols need not be replaced even if they are in a damaged condition. This rule found in Kaamika Agama is a special rule and in the case of statutory prescriptions, a general rule must yield to the special rule… the petitioner has pleaded that the presently damaged idol of Parvathavardhini, the consort of Lord Ramanathaswamy, was installed by the King of Ramanathapuram in the 18{+t}{+h}century.\n\n“We do not know whether the said averment is factually correct. Even if it is correct, we do not know whether Sri Raghunatha Sethupathi, the King of Ramnad, who installed the idol… would not fall under any of the categories mentioned in the above special rule,” the judges said before rejecting the other contention that planetary positions on January 20 were also not suitable for consecration.", 
    "section": "national", 
    "title": "‘Agamas’ prone to different interpretations, says HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}