{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "All the major lakes and tanks still remain dry\n\nThe entire Attur union is reeling under severe drought condition for the past one decade, despite the rest of the district experiencing widespread rainfall a couple of months ago.\n\nWhile a majority of the major water bodies elsewhere in the district received copious inflow, with some brimming to their capacity, all the major 55 and odd lakes and tanks in Attur union are remaining dry.The villages in the union receive rainfall neither during the North-East monsoon season nor in the South-West monsoon period.Gone are the days when the farmers of Attur union used to raise turmeric, tapioca, arecanut, makkacholam in abundance in the farm lands, besides paddy.\n\nAt present, only a limited number of farmers with bore well and open well facility continue farm activities and they have raised these crops.\n\nWhen the entire Salem district experienced heavy rain in November / December, the Attur union areas received only long spell of light showers, which could neither penetrate nor percolate into the sub soil. The showers in no way helped in recharging the ground water level and improve the water storage in the open and bore wells.\n\nThe rain received recently in the Sinna Kalrayan hills and Periya Kalrayan hills, formed into small streams and they carried heavy water to Kariyakoil dam and Aanaimaduvu dam, enabling them to fill up fast.\n\nWith the shutters of both the dams remaining closed, there was no flow of water in River Vasishtnadhi, due to which none of the lakes and tanks in Attur union including Panai yeri, Ethapur yeri, Nasivikapuram yeri, Thulukkanur yeri, Kalanatham yeri, Koolamedu yeri receiving even a single drop of water.\n\nOnly Ayanakoil lake and Thennangudipalayam lake receive reasonable water. The water in Thennangudipalayam lake has already started receding due to the large scale presence of karuvelam weed. The water of Ayanakoil lake is fully slushy.\n\nBesides, the failure of the government to desilt and deepen the lakes and channels, and remove the weeds has also contributed to their dry condition.\n\nS. Govindan, a progressive farmer of Ammanpalayam, blamed the farmers for raising coconut and other crops which needed more water in total violation of crop pattern. The farmers should totally avoid water exploitation. They should strictly adopt crop pattern based on the ecology of the respective lakes, he said.\n\nA. Kandasamy, former Koolamedu Panchayat president and block president of the Tamil Maanila Congress, says that due to recurring drought and water scarcity, many farmers have sold their cows. With agricultural operations coming to a grinding halt, the farm workers have to totally depend on the Mahatma Gandhi National Rural Employment Guarantee Scheme works for their livelihood, he said. Farmers of Koolamedu said that the government planned to construct a dam in Kalungumalai. But, the project was shelved after the initial survey.", 
    "section": "national", 
    "title": "Attur union reeling under drought", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}