{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(From top) Collector Sajjansingh R. Chavan pasting an awareness sticker on a TNSTC bus at Christopher bus stand in Vadaseri on Sunday. Tuticorin Sub-Collector S. Gopala Sundara Raj going around the exhibition on road safety. Tirunelveli Police Commissioner T.S. Anbu fixing a bullseye on the headlight of a bus at Palayamkottai.— Photo: A. Shaikmohideen\n\nCollector Sajjansingh R. Chavan appealed to road-users to adhere to Motor Vehicles Act rules — wearing seatbelts and helmet — here on Sunday.\n\nInaugurating the 27th Road Safety Week at Christopher Bus stand in Vadaseri, Mr. Chavan urged motorists to make Kanyakumari an accident-free district.\n\nHe insisted on pasting of ‘bulls eye’ on headlights to avoid glaring lights to vehicles coming from the opposite direction.\n\nHe said that the theme for this year was ``Road Safety – Time for Action’’.\n\nMr. Chavan inaugurated an awareness photo exhibition at the bus stand and flagged off a rally by the transport workers. District Revenue Officer A. Udhayakumari, TNSTC (Nagercoil Region) General Manager T. Thiruvalamban, Regional Transport Officers R. Rajinikanth (Nagercoil) and Murugan (Marthandam) participated.\n\nTuticorin\n\nThe Road Safety Week awareness programme commenced in Tuticorin and Tirunelveli also.\n\nA rally was flagged off by Assistant Superintendent of Police, Tuticorin Town, P. Arun Sakthi Kumar, in the presence of Tuticorin Sub Collector S. Gopala Sundara Raj, Regional Transport Officer, K. Anand and General Manager of TNSTC, K. Murugan, Tuticorin.\n\nThe campaigners began the rally from a place near Tuticorin old bus station and passed through thoroughfares of town here and concluded at the starting point of the rally. An exhibition with a display of posters highlighting road safety was organised as part of the programme.\n\nMr. Anand said vehicles would be checked at toll plazas in Tuticorin and drivers offered refreshments from 8 p.m. to 12 a.m. on Monday. At that time, essential factors required to ensure road safety would be announced through public address system.\n\nBesides, competitions involving students in schools on topics of road safety would be held on Tuesday and students could participate in drawing, elocution, essay writing and slogan writing. On Wednesday, pamphlets on road safety would be given to vehicle-users at traffic signals.\n\nIn Tirunelveli, a similar programme was held at new bus stand, where an exhibition was also organised. Collector M. Karunakaran inaugurated the exhibition in the presence of Joint Transport Commissioner, V. Balan, Tirunelveli Regional Transport Officer, K. Thangavelu, and Managing Director of TNSTC, Tirunelveli, M. Gajendran.\n\nPosters highlighting the need for road safety were displayed.", 
    "section": "national", 
    "title": "Awareness creation marks road safety week celebrations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}