{
    "author": [
        "Deepa H"
    ], 
    "text": "They will have to put in place a system to convert waste into bio-gas or compost\n\nOver the last decade with the growth of cities, the amount of municipal solid waste being dumped in landfill sites too has increased.— File photo\n\nWith large volumes of food and kitchen waste compounding the solid waste management programme in cities and expanding municipalities, the State Environment Impact Assessment Authority has finally decided to enforce a forgotten mandate for big builders to provide in-house systems to handle food waste.\n\nAccording to officials of the State Environment Impact Assessment Authority, from now on any builder who undertakes a project spread over 2.20 lakh square feet area will have to mandatorily provide a decentralised system to convert food waste generated in the building complexes into biogas or compost. “Provision of this facility will be mandatory at such large complexes before the flats are handed over to the owners,” an official told The Hindu.\n\nOf late, the Authority has also begun directing builders to include food waste from the local community and small eateries in the neighbourhood for generation of alternative energy or compost. “This will provide the required volume of waste for the biogas plants and keep the neighbourhood clean. Residents in apartment complexes will have to segregate waste,” said a source in the Authority.\n\nThe various environmental bodies in the State are also focussing on handling food waste, since it forms 16 per cent of the municipal solid waste and also leads to formation of landfill gas and leachate (any liquid oozing from garbage is called leachate and is a potential pollutant). It is formed in landfills when water infiltrates and percolates through waste and dissolves organic and inorganic components.\n\nOver the last decade with the growth of cities, the amount of municipal solid waste being dumped in landfill sites too has increased. For instance, seven years ago Chennai used to generate 3,400 tonnes of waste a day and now it is 4,700 tonnes. All of this, including the food waste that can be used to power lights or converted as compost, is dumped in the landfill sites.\n\n“It would help reduce the load on the landfill sites, reduce transportation costs and manure costs for parks. Biogas plants would produce electricity that can be used by the community and provide employment,” explained a source in the Tamil Nadu Pollution Control Board.\n\nBiogas plant\n\nThe Bhabha Atomic Research Centre has proven technology for micro and macro biogas plants and there are several functioning in Chennai. “A biogas plant that can handle 100 to 200 kg every day costs less than Rs. 5 lakh. It will generate 2.25 kg of methane a day, which is over four LPG cylinders a month,” explained Daniel Chellappa, senior scientist, Technical Coordination Wing, BARC.", 
    "section": "national", 
    "title": "Big buildings in Chennai will have to manage their own food waste", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}