{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The construction of a new bridge is nearing completion in Mettur town in Salem. —Photo: E. Lakshmi Narayanan\n\nThe work on the construction of high-level bridge across 16 Gate Ellis Surplus sluices in Mettur undertaken by the State Highways Department at an outlay of Rs. 23.21 crore has already been completed and will be thrown open for regular traffic shortly, said Minister for State Highways and Minor Ports Edappadi K. Palanisamy.\n\nThe bridge, sanctioned in 2012-13 and executed with financial assistance from the National Bank for Agriculture and Rural Development (NABARD) has come up on the Thoppur – Mettur – Bhavani – Erode road.\n\nSpeaking at a function to distribute free mixers, grinders and table fans to the families of Mettur Municipal limits in Mettur town on Sunday, Mr. Palanisamy said that the State Government sanctioned Rs. 10.45 crore for executing development works in Mettur town in the last four years.\n\nThe underground drainage work is in progress at an outlay of Rs. 73 crore. The Government has also sanctioned Rs. two crore for the implementation of solid waste management project, he said.\n\nReferring to the other projects sanctioned for Mettur town, the Minister said bus stand will be expanded at an outlay of Rs. 70 lakh. The work on widening the road from Mettur camp to Thottilpatti is in progress, for which the government earmarked Rs. Five crores.\n\nThe Minister said that the government identified 89,735 families of Mettur municipal limits for receiving the free grinders, mixers and table fans and all of them have already received them.\n\nIn the final phase, the Minister gave away freebies worth Rs. 5.16 crore to 10,041 families.\n\nLalitha Saravanan, Chairperson of Mettur Municipality, presided. J. Meghanath Reddy, Sub-Collector, Mettur and others spoke.", 
    "section": "national", 
    "title": "Bridge to be thrown open for traffic shortly", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}