{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Visitors look on as a pet takes part in the competition at Nandanam; (right) judges William Rodriguez Umana, Andrew Burt and Timothy Thomas with Figo, the German Shepherd that won the ‘Best in Show’ title —Photos: R.Ravindran and M. Vedhan\n\nTwo-day event comes to a close on YMCA grounds, with as many as 40 breeds hogging the limelight\n\nAt the end of the second day of the spectacular All Breeds Championship Dog Shows on Sunday evening, one thing was clear — city residents just can’t wait for the next edition of this event.\n\nAs curtains came down on the 107th, 108th and 109th All Breeds Championship Dog Shows organised by the Madras Canine Club at the YMCA grounds, pet lovers and even those who cannot own one, were seen interacting with the trainers and owners about the participating dogs, clicking photos.\n\nTrainers groomed Irish Setters, American Cocker Spaniel, Poodle and other rare breeds during the show.\n\n“The response today has been good and we had over 40 breeds participating in the shows,” said C.V. Sudarsan, President of Madras Canine Club. S. Akhil, who had come along with his relatives for the show, said it was an enjoyable experience for his children.\n\nFigo, a three year old German Shepherd bagged the 'Best in Show' title. K.E. Ramesh, the dog's owner who is from Ooty said Figo had previously won at least 40 prizes in national and international dog shows. N. Ram, Chairman of Kasturi and Sons Limited gave away prizes to owners and trainers of the dogs which were adjudged the Best in Show and the Best puppy, in a separate category as well.\n\nSiberian Husky, Beagle, Doberman, Rottweiler and pug were among the breeds which bagged prizes. M. Gopalakrishnan, a resident of the city whose Akita dog bagged a few prizes said that the championship show had been good to compete in.", 
    "section": "national", 
    "title": "Canines cast their spell on pet lovers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}