{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Union Minister of State for Tourism and Culture Mahesh Sharma with Union Minister of State for Road Transport Highways and Shipping Pon Radhakrishnan at the Sothavilai beach in Kanyakumari district on Sunday.— Photo: Special Arrangement\n\nThe Union government is considering launching of shipping service between Chennai and Kanyakumari to give a fillip to the tourism industry, according to Union Minister of State for Tourism and Culture Mahesh Sharma.\n\nImpetus to tourism\n\nInspecting tourist spots in Kanyakumari district, Mr. Sharma recalled that Prime Minister Narendra Modi during his Lok Sabha election campaign in 2014 had promised to give impetus to improve tourism infrastructure in Kanyakumari district.\n\nAs part of this promise, the NDA government had sanctioned Rs. 117-crore for improving infrastructure in various tourist spots in the district.\n\nThough there is a norm that the distance between two airports should be maintained at least 150 km, the Union government would consider establishing a Green Field Airport near Samithoppu in Kanyakumari district after relaxing certain norms if it is feasible. A land parcel of 600 acre has been inspected for this purpose, Mr. Sharma said. The Centre will also construct a bridge connecting the Tiruvalluvar statue and Vivekanandar Rock in Kanyakumari. The boat jetty in Kanyakumari will also be extended, the minister said.\n\nMr. Sharma offered prayers at Bagavathi Amman Temple, visited the Vivekanandar Rock, Tiruvalluvar Statue and Vivekananda Kendra. He also paid floral respects to the founder of the Vivekananda Kendra, Eknath Ranade at his memorial.\n\nLater, Mr. Sharma inspected Sothavilai beach, Sanguthirai, Muttom and Manavalakurichi in the district.\n\nUnion Minister of State for Road Transport, Highways and Shipping Pon Radhakrishnan accompanied him.\n\nEarlier on Saturday, the Ministers inspected Vattakkottai and Sisral Jain Temple – both falling under the Archaeological Survey of India (ASI), Samithoppu temple, Maruthuva Malai for medical tourism, Thamaraikulam for establishing an airport, Manakkudi estuary and Thirparappu falls.\n\nAdditional Director Bakthavatchalam and officials from the Chennai regional office of the India Tourism Development Corporation (ITDC) accompanied the union ministers.", 
    "section": "national", 
    "title": "Centre mulling shipping service between Chennai and Kanyakumari", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}