{
    "author": [], 
    "text": "(From the top) A chemistry expo at Holy Cross College in Tiruchi; a seminar in progress at Srimad Andavan Arts and Science College; victorious Bishop Heber College tennis team.\n\n(From the top) A chemistry expo at Holy Cross College in Tiruchi; a seminar in progress at Srimad Andavan Arts and Science College; victorious Bishop Heber College tennis team.\n\n(From the top) A chemistry expo at Holy Cross College in Tiruchi; a seminar in progress at Srimad Andavan Arts and Science College; victorious Bishop Heber College tennis team.\n\nPost Graduate and Under Graduate students of the Department of Chemistry exhibited models on various themes such as fun chemistry, electro-chemistry, soil chemistry, chemistry in everyday life, waste management, environmental science, cosmetology, food chemistry and chemistry of biomolecules at a two day chemistry exhibition ‘Chem Expo-2016,’ organised by the Holy Cross College. N. Sathyamoorthy, PG teacher in Botany, E.R. Higher Secondary School, who inaugurated the expo, encouraged the students to take up projects in chemistry at UG level. Sr. Jesuin Francis, Principal, Holy Cross College, was present. Students from various colleges and schools visited the exhibition.\n\nTennis tournament\n\nBishop Heber College won the men’s title in the Bharathidasan University inter-collegiate tennis tournament. The team comprised A. Lakshmana Raj, A. Ajai, S. Aswin Krishna and P.R. Balaji. D. Paul Dhayabaran, Principal, and L.C. John, head, department of physical education, felicitated the students and coach S. Seetharaman.\n\nFinancial reporting\n\nUnder the auspices of Nigama Samaj of Department of Commerce and Prabandha Samiti of Department of Management of Srimad Andavan Arts and Science College, a seminar on “International financial reporting and standards” and “Indian accounting standards” was held at the college recently. Radhika, Principal, explained the objective of the seminar. Resource-persons Gopalan, Muralitharan, spoke on the financial reporting and standards. Ammangi Balaji, secretary of the college, presided. In another function organised by Laughter’s Club of the college, P. Vijay, a student, mimicked voices of great leaders and prominent personalities. R. Krishnan, Head of Department of English, spoke.\n\nFelicitated\n\nYouth Forum, a study circle of Seethalakshmi Ramaswami College, organised a felicitation for the alumnae who are newly recruited as Child Development Programme Officers by the Tamil Nadu Public Service Commission. The newly recruited Child Development Programme Officers interacted with the students. They were felicitated by T. Buvaneshwari, District Programme Officer, Integrated Child Development Services, and M. Jayanthi, Principal of the college.\n\nSeminar\n\nMore than 300 students from various colleges in Tamil Nadu took part in a State-level seminar on ‘Social concerns in Indian literatures translated into English,’ organised by the PG and Research Department of English, St. Joseph’s College. P. Sivakami, writer and social activist, who was the chief guest for the inaugural function, spoke on the atrocities against the Dalit community. T. Jayakumar Reader and Associate Professor of English, Periyar EVR College, delivered the valedictory address.\n\nTraining programme\n\nThe placement cell of AIMAN College of Arts and Science for Women conducted an on-campus placement training programme, ‘You Can.’ K. Sitheswaran, Head, Department of Training and Placement, MIET Group of Institutions, K. Mohamad Jasim and D. Balakumar, Assistant Professors, MIET, spoke.\n\nPolio awareness rally\n\nThe NSS unit of Rane Polytechnic Technical Campus organised a polio awareness rally in Sethurapatti, Inam Mathur, Velappudayanpatti and Sooravalipatti villages in Tiruchi district. The NSS volunteers carried placards, raised slogans and distributed pamphlets highlighting the importance of administering polio drops to children.\n\nWorkshop on Engineering Physics\n\nA workshop on Engineering Physics was conducted by the Indian Institute of Technology in association with ISTE at the Mount Zion College of Engineering and Technology, Pudukottai. Jayabarathan Chelliah, chairman, Mount Zion Educational Institutions presided. Florence Jayabarathan, vice-chairperson, Mount Zion Educational Institutions, Jayson K. Jayabarathan, director of the college, and P. Balamurugan, Principal, spoke. Deepan Gosh, Siva Prasath and K.G. Suresh, Professors from IIT-Bombay, delivered lectures on various topics such as electromagnetism, light, quantum physics, and conduction.\n\n‘Ruby on Rails’\n\nScholars and students participated in ‘Ruby on Rails,’ a value added course organised by the Programmers Paradise Club of E.G.S. Pillay Engineering College, Nagapattinam. J. Tamilarasan, web consultant, delivered a lecture on Github server, Heroku server and web hosting application using Ruby on Rails framework. S. Paramesvaran, secretary, E.G.S. Pillay Group of Institutions, and S. Ramabalan, Principal of the college, spoke.\n\nArt competition\n\nThe Prime College of Architecture and Planning, Keezhvelur, Nagapattinam district, organised an Art Competition 2016 in which students from various educational institutions in the region participated and exhibited their art skills in a vivacious manner. Topics for the competition included amazing architecture, adore feminine, ill effects of alcohol and smoking and global warming. The concepts brought out the best colourful imaginations of the participants whose expressions were thought provoking and attractive as well. An art gallery exhibition arranged in the premises showcased the talents of the young competitors. Tiruvarur Chief Education Officer E. Mani was the chief guest while Nagapattinam CEO A. Kasthuribai, Chairman, Prime Group of Institutions, N. Govindaraj, and Principal A. Parisutharajan were among those who felicitated.\n\nContributed by\n\nM. Balaganessin,\n\nL. Renganathan and\n\nG. Prasad", 
    "section": "national", 
    "title": "Chemistry expo", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}