{
    "author": [
        "M Balaganessin"
    ], 
    "text": "The State Archaeological Department has been conserving the excavation site at Maligaimedu near Gangaikondacholapuram in Ariyalur district. A fence is being set up to protect the site.— Photo: M. Srinath\n\nThe State Archaeology Department has taken up a programme for strengthening the conservation of the excavation site at Utkottai Maligaimedu village, popularly known as Maligaimedu among the local residents, about six km from Gangaikondacholapuram, where the famour Chola ruler Rajendra Chola I had constructed his palace.\n\nThe State Archaeology Department has undertaken the excavation in a phased manner for the past three decades and is also focussing on conservation of the palace which is now represented by a layer of brick structures.\n\nA massive temple dedicated to Sri Brahadeeswarar was built by Rajendra Chola I at Gangaikondacholapuram on the lines of his father Raja Raja Chola’s Big Temple in Thanjavur. Gangaikondacholapuram had remained the capital of Chola dynasty for about 250 years.\n\nSystematic procedure\n\nDuring the course of excavation the State Archaeology Department has been adopting a systematic procedure to ensure the structures are not damaged.\n\nThe excavation also unearthed a wide range of antiquities, throwing light on the link between the Chola dynasty and South-East Asia during the period from the 10th century to 13th century.\n\nCoarse and red ware shreds; decorated knobs; decorated pot shreds, lid portion; Chola tiles and Chinese Celedon ware and porcelain ware shreds have been collected.\n\nThe thickness and height of the fortified wall measured 2.15 m and 1.35 m respectively. The exposed palace remains accounted for an area of 7 m by 3.5 m.\n\nThe treasure of antiquities from the site has been categorised.\n\nThe State Archaeology Department has now taken up strengthening works by erecting concrete pillars around the excavated site for setting up fencing and for retaining its original structure, according to sources.\n\nDetails of structures\n\nHistorians said more excavation must be undertaken. “Only a part of the palace had been excavated,” says R. Komagan, founder chairman of Gangaikondacholapuram Development Council.\n\nThe details of structures such as court room or ‘agazhi’, if any, should be displayed at the excavation site, he adds.", 
    "section": "national", 
    "title": "Chola palace excavation site at Maligaimedu strengthened", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}