{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "The Nehru Stadium located in the heart of Coimbatore is a popular venue for various tournaments. —Photo: S. Siva Saravanan.\n\nA district’s sports infrastructure development can be holistic only if it has additional facilities such as multi-purpose indoor stadium, open air stadium and a swimming pool, according to the Coimbatore wing of the Sports Development Authority of Tamil Nadu (SDAT). Many districts in the State meet these demands. But, not Coimbatore.\n\n“We have just an open air stadium to boast of,” says Raja Mahendiran, SDAT Coimbatore’ Regional Senior Manager.\n\nHe says the SDAT is doing its best to make it happen in all the districts, leave alone Coimbatore. “We have enough funding allocated by the Government for various sports schemes and infrastructure development year-after-year.\n\nThe Government had allocated funds for a multi-purpose indoor stadium (Rs. 1 crore), a swimming pool (Rs. 1.75 crore) of international standards and a sports hostel (Rs. 60 lakh) for boys.”\n\nHowever, it is lack of adequate and appropriate space that is delaying the development of these facilities here.\n\nA Government Order to build the same was passed last year and a portion (5.63 acres) of the Coimbatore Prison campus was identified for swimming pool and multi-purpose indoor stadium.\n\nThe Government even allotted Rs. 3.85 crore for the construction but nothing seems to tick. And, it is almost a three-decade wait.\n\nWho is to be blamed? Ask the officials concerned and they prefer to pass the buck. The SDAT officials say they are eagerly waiting for the Corporation’s clearance for the land. “The land transfer formalities need to be done and the SDAT is also monitoring it,” says Stanley P. Mathew, SDAT Coimbatore's District Sports and Youth Welfare Officer.\n\nThe SDAT Coimbatore however is making the best use of Rs. 1 crore funding allotted to it for various other developments in and out of the Nehru stadium. “Work is on for constructing toilets for men and women, and meeting hall and stadium repair works,” says Mr. Stanley Mathew.\n\nThe funding allotted earlier was used for lighting facilities. “We have replaced the old lighting (floodlights) with new lamps,” he adds.", 
    "section": "national", 
    "title": "Coimbatore: wait continues for indoor stadium", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}