{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Coimbatore Corporation is mulling over extending the 24x7 drinking water supply scheme to added areas.\n\nAccording to sources, the civic body’s thinking comes close on the heels of a meeting it had with senior Municipal Administration and Water Supply Department officials in Chennai a few days ago.\n\nAMRUT\n\nThe Chennai meeting was to ask for proposals from qualified companies for the 24x7 water supply project for the old city areas. The sources say that at the meeting, when the discussion veered towards water supply and underground drainage projects in added areas, the civic body informed the participants that it had proposed to take up the projects under the Central Government’s AMRUT (Atal Mission for Rejuvenation and Urban Transformation) scheme and planned to send proposals very soon.\n\nThen the civic body was asked to see if it could extend the 24x7 drinking water supply scheme to the added areas as well, the sources say and add that the civic body is likely to consider the suggestion.\n\nProposals\n\nMeanwhile, at the Chennai meeting the Department officials asked French multinational company Veolia and an Essel company, a part of the Zee conglomerate, to submit their proposals for the 24x7 drinking water supply scheme, the aim of which is to make available water round the clock to residents.\n\nThe work involves revamping the water distribution network to make it smarter and metered.\n\nThe civic body has estimated the project to cost over Rs. 500 crore and assessed that the city has around 1.50 lakh connections.\n\nThe two companies have implemented similar projects in various cities in the globe and are working on something similar in Hubli-Dharwad and Bengaluru, the sources say.\n\nThe Corporation supplies water to the city’s residents from Siruvani and Pilloor reservoirs, River Bhavani and River Aliyar.\n\nThe civic body\n\nhas estimated\n\nthe project to\n\ncost over\n\nRs. 500 crore", 
    "section": "national", 
    "title": "Corporation mulls extending 24x7 water supply project to added areas", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}