{
    "author": [
        "Staff Reporter"
    ], 
    "text": "DMK treasurer M.K. Stalin listening to the grievances of parents of children with special needs at a meeting the party organised in Coimbatore on Sunday. -Photo:S. Siva Saravanan\n\nIf the Dravida Munnetra Kazhagam (DMK) were to return to power, it would accord priority to health and education sectors, said its treasurer M.K. Stalin at a meeting organised by the party with participation from members of the health sector here on Sunday.\n\nThe party would release a State health policy with focus on communicable and non-communicable diseases and take steps to reduce maternal and infant mortality. At the heart of the policy would be the integration of Indian medicine systems with allopathy and focus on senior citizens and people with special needs.\n\nDoctors, nurses, paramedics and pharmacists attended the meeting, conducted as part of Mr. Stalin’s Namakku Naame road show.\n\nHe said the DMK would strive to improve the doctor-patient ratio to 1:1,000, which at present was 1:1,700. The party would establish a medical college in every district in the State, appoint an oncologist in all district headquarters hospital, and ensure that there is a primary health centre for every 25,000 people and a sub-centre for every 5,000 people.\n\nWhile trying to increase the number of health centres and sub-centres, the party would also work to provide permanent buildings to the centres as many functioned out of rented premises.\n\nThe consequence of ignoring primary health could be seen in the drop in institutional deliveries, Mr. Stalin said, alleging that the number of deliveries had decreased from 2.72 lakh during the DMK regime to 89,190 in the past few years of AIADMK rule. He charged that the AIADMK government failed to implement the health schemes that the previous DMK government had launched. Public health specialist T.N. Ravishankar spoke on the need for establishing six super speciality hospitals across the State.\n\nFormer Public Health Director Porkai Pandiyan spoke on preventive health care, V.S. Dhruv Kumar, an engineer, highlighted the need for creating a health registry by including Aadhaar card details and N. Ramakrishnan demanded effective drug control mechanism. Former Minister Poongothai Aladi Aruna said the programme was aimed at bringing a synergy between various wings of the party and the Namakku Naame scheme.", 
    "section": "national", 
    "title": "DMK to accord priority to health: Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}