{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(From left) Youth taking out a road safety procession in Ramanathapuram on Sunday. An exhibition on road safety held at the bus stand in Dindigul.— Photos: L. Balachandar and g. karthikeyan\n\n(From left) Youth taking out a road safety procession in Ramanathapuram on Sunday. An exhibition on road safety held at the bus stand in Dindigul.— Photos: L. Balachandar and g. karthikeyan\n\nMinister for Sports and Youth Welfare S. Sundararaj wished road-users an accident-free New Year as he inaugurated the 27th Road Safety Week and joined a procession conveying a message on road safety and popularising this year’s theme “Road Safety – Time for Action”.\n\nAfter inaugurating a photo exhibition, highlighting road safety and the need for following traffic rules, the Minister, joined by Assistant Superintendent of Police (ASP) S Sarvesh Raj and Regional Transport Officer (RTO) J Sheik Mohamed, walked around the new bus stand here in a procession and distributed pamphlets to the road-users.\n\nExpressing concern over fatal accidents, the Minister appealed to the road-users to drive and ride safely following traffic rules and avoid accidents. Chief Minister Jayalalithaa allocated Rs.65 crore for creating awareness during the road safety week this year, he said. The government also initiated several measures to prevent accidents, he added.\n\nHe was pleased to note that a majority of two-wheeler riders wore helmets in the district, he said. Most of the accidents occurred due to human error and they could be averted if the vehicle-users were little careful and followed the traffic rules.\n\nLater, Mr. Mohamed told reporters that the department would organise special awareness camps, drawing and essay competitions on road safety for school students and free medical camp for drivers of the State Transport Corporations and other road-users during the road safety week.\n\nHe said the department had registered 4,783 traffic violation cases last year and collected a total fine amount of Rs.80.81 lakh. The district witnessed 912 accidents, including 264 fatal accidents, which claimed 297 lives last year, he said.\n\nIn Sivaganga, Collector S. Malarvizhi inaugurated a photo exhibition on road safety and flagged off an awareness rally. RTO Natarajan took part in the rally and distributed pamphlets to the road users.\n\nDindigul\n\nRallies and distribution of awareness pamphlets marked the commencement of road safety week celebrations here on Sunday.\n\nA team of transport officials led by Regional Transport Officer Amirtheeswaran distributed pamphlets on road safety and accident-free travel among the public at Dindigul Government Hospital junction. The officials appealed to drivers and riders to follow traffic rules strictly not only for their safe journey but also to prevent accidents and loss of lives.\n\nFlagged off by Town DSP Sigamani, drivers and riders took out an awareness rally which started and ended at the Kamarajar central bus stand after passing through prime roads in the town.", 
    "section": "national", 
    "title": "“Drive and ride safely, follow traffic rules”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}