{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Bid to create awareness of child sexual abuse\n\nA volunteer explaining what is good touch and bad touch to young children visiting the stall run by the Child Protection Unit at the government exhibition in Tiruchi.— Photo: A.MURALITHARAN\n\nA stall to create awareness of child sexual abuse (CSA) and other forms of violence against children is among the more unusual features of the ongoing government exhibition in the city.\n\nSet up by the District Children Protection Unit (DCPU) for the very first time, the stall has been attracting a significant number of visitors daily since the 45-day exhibition was inaugurated on the grounds of the St. John’s Vestry Anglo Indian Higher Secondary School on December 18.\n\n“Until the promulgation of Protection of Children from Sexual Offences (POCSO) Act 2012, child sexual abuse was not really discussed in the legal framework,” Ms. Karthika, Child Protection Officer, DCPU, told The Hindu . “Earlier this usually referred to rape and molestation, but POSCO made it possible to examine the deep-seated psychological effects of sexual abuse on young victims,” she added.\n\nAt the expo stall, staff volunteers could be seen addressing groups of families and children about the issue with the help of large-print charts indicating the limits of physical contact with the aim of preventing inappropriate behaviour.\n\n‘No’ – with the child speaking up against the potential abuser, ‘Go’ – asking the child to leave the spot immediately, and ‘Tell’ – advising the youngster to inform a parent or trusted adult about the attempt on their modesty, is the slogan being promoted by DCPU.\n\n“Most of our studies show that the perpetrator is usually someone known to the child,” said Ms. Karthika. “Parents and teachers visiting our stall have said that they are glad to see this issue discussed in public. They feel it will help us to overcome the culture of silence related to child sexual abuse.”\n\nPencils and balloons printed with the anti-abuse message are being given to children who do well in the show-and-tell contest being held at the stall. A 40-metre cloth bale has been getting filled up with the signatures of visitors who have taken the oath to protect children against abuse and violence.\n\nPosters highlighting the challenges facing children in the State such as child marriage, child labour, infanticide and gender-based foeticide and abandoning of infants, are on display at the stall.\n\nThe exhibition is open from 4 p.m. to 10 p.m.", 
    "section": "national", 
    "title": "Enlightening girls about ‘bad touch,’ ‘good touch’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}