{
    "author": [
        "S Sundar"
    ], 
    "text": "Along with country-made bombs, lit kerosene-filled bottles were also hurled at both the places\n\nA day after crude bombs exploded at the office of the Madurai West MLA Sellur K. Raju, who is also the State Cooperation Minister, in Sammattipuram and at the ruling AIADMK’s Madurai urban district unit office at Mathichiyam, the police were clueless about the identity of those who hurled the ‘throw bombs’.\n\nMadurai Commissioner of Police Shailesh Kumar Yadav on Sunday said the ‘throw bombs’ hurled at both places contained “similar” shrapnel. Small iron balls and nails were found strewn at the scenes of explosions on Panagal Road.\n\nIncidentally, the Minister is also the party’s district urban unit secretary.\n\nSimilar pattern\n\n“We have found a pattern in both these cases and are probing them,” Mr. Yadav told reporters. Along with the country-made bombs, lit kerosene-filled bottles were also hurled in both the places, he added.\n\nHowever, no one was injured in the incidents.\n\nThe bomb that exploded damaged a tube light at the party office.\n\nThe other bomb hurled at the MLA’s office destroyed a wooden door, the police said. The incidents had taken place at 11.30 p.m. on Saturday.\n\nThe police were trying to get clues with the help of video footages of close circuit television cameras installed in nearby areas, the Commissioner said.\n\nRaju blames political opponents\n\nMeanwhile, Mr. Raju had blamed his political opponents for the incidents since he had organised a mega function organised in the city on Sunday in which thousands of people, including women, were to join the AIADMK.\n\nThe S.S. Colony and Mathichiyam police have registered two cases under Explosives Substances Act.\n\n‘L&O deteriorating’\n\nIn a statement issued in Chennai, PMK leader S. Ramadoss alleged that the hurling of bombs at the offices of the minister and the ruling party in Madurai, bore testimony to the deteriorating law and order situation in the State. “Even though Tamil Nadu has very efficient and talented police officers, their energy is utilised only for odds jobs like providing protection to the TASMAC liquor outlets and to arrest those who removed political hoardings,” he alleged.\n\nPolice trying to get clues with the help of video footages of CCTV cameras in nearby areas", 
    "section": "national", 
    "title": "Explosion at minister’s office: no breakthrough yet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}