{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A survey of schools in the five flood-affected districts in the State has found that families are yet to recover from the floods and in some cases schools have no information about students who have not returned to school.\n\nSamakalvi Iyakkam, a voluntary organisation, conducted the survey on December 19, 20, 22 and 27 last year in the most affected parts of Chennai, Kancheepuram, Tiruvallur, Cuddalore and Tuticorin.\n\nIt was carried out in schools where water had inundated the ground floor of the buildings. Around 500 students were included in the study.\n\nT. Jagan, a volunteer in Kancheepuram, who has been helping the residents of Manjakuppam Irula Colony, said residents had no roof over their head and the officials did not include them on the list of beneficiaries.\n\nNo basic amenities\n\n“The families live in isolation and are still surrounded by floodwater. In some places like Cheyyur panchayat, people are getting government freebies, but they don’t have basic amenities like streetlights,” he alleged.\n\nChildren here are forced to walk three km as the hamlet has no primary school. “Children are showing signs of poor nourishment already. Their eyes are large and they look emaciated,” said S. Christu Raj, advocacy coordinator, Samakalvi Iyakkam, who was among the 10-member team that visited these areas.\n\nIn Kandigaiper, a government school with 2,500 students is merely 60 feet away from the lake.\n\nThe lake water had entered the school and computers in the school laboratory got damaged, Mr. Christu Raj said.\n\nIn-depth study\n\nThe organisation has suggested that all government and aided schools should remain under surveillance.\n\nStudents should be provided breakfast and mid-day meals to rectify the nutritional deficiency they have suffered. Schools should be instructed to take action to bring back children who have stayed away following the floods.\n\nChella Selvakumar, the organisation’s general secretary, said a more in-depth study was in progress to come up with more suggestions.\n\nNo information about students who have not returned to classroom", 
    "section": "national", 
    "title": "Flood-hit schools need more help: NGO", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}