{
    "author": [
        "Special Correspondent"
    ], 
    "text": "State government’s failure to either grant or deny sanction to prosecute a government official for corruption, within three months of preferring an application, would amount to deemed sanction, the Madras High Court Bench here has ruled.\n\nJustice S. Vimala passed the order by relying upon an observation made by the Supreme Court in Subramanian Swamy versus Manmohan Singh (2012) that the time limit of three months for grant of sanction for prosecution must be adhered to.\n\nThe judge, however, quashed a corruption case filed against a retired Tangedco Superintending Engineer on the ground that a judicial magistrate had failed to give reasons for forwarding a private complaint against the engineer to the police for registering the case.\n\nPointing out that the Magistrate had passed a single line order directing the Directorate of Vigilance and Anti-Corruption (DVAC) to register a case, the judge said: “Application of mind is absolutely necessary before deciding to forward a complaint for investigation. When an order passed is passed without any discussion and without giving any reason and without even referring the matter to an appropriate authority, then it is clear that the direction for investigation is without application of mind and hence, it is invalid.”\n\nIn the present case, the petitioner, Bagavathiappan Pillai, had been accused by the private complainant, Jebaselvakumar, a Commercial Inspector with Tangedco, of demanding Rs. 50,000 for transferring him from one location to another in Kanyakumari district in December 2011.\n\nThough the complainant claimed to have paid a bribe of Rs. 20,000 to the then Superintending Engineer and recorded it on a pen camera, forensic examination of the camera revealed that it contained only audio files unsuitable for forensic analysis.\n\nYet, the DVAC proceeded with the investigation and filed a charge sheet against the accused, forcing him to move the present petition for quashing the entire case.", 
    "section": "national", 
    "title": "Graft case against retired Tangedco engineer quashed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}