{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Devakottai zamindar Soma Narayanan unveiling the portrait of industrialist M.A.M. Ramasamy in Karaikdui in Sivaganga district on Saturday. M.A.M.R. Muthiah, former Madras High Court Judge Chockalingam and Kamban Kazhagam secretary Pala Palaniappan are also seen.\n\nChettinad Group Managing Director M.A.M.R. Muthiah, adopted son of industrialist and philanthropist M.A.M. Ramasamy who died recently, accepted to be the patron of Kamban Kazhagam and offered to donate like his father for the conduct of the annual Kamban Kazhagam festival.\n\nAddressing a function organised by Kamban Kazhagam here on Saturday to honour his father, Mr. Muthiah agreed to be the patron of the Kazhagam as requested by Pala Palaniappan, secretary of the Kazhagam.\n\nWhen Mr. Palaniappan recalled that Mr. Ramasamy was donating Rs. 50,000 every year for the last 21 years for the conduct of the festival, Mr. Muthiah said that he would follow in the footsteps of his father (who later disowned him).\n\n“I will donate even more for the festival,” he said.\n\nHe said that an exponent in selecting best breed of racehorses, his father emerged as the most successful racer in the country. His father celebrated as if he had achieved a success in business every time one of his horses won a race, he said.\n\nJustice M. Chockalingam of Green Tribunal (Southern Zone), who released a book titled “Dr M.A.M. Oru Sahaptham”, compiled by Karaikudi Narayanan, film director and writer, paid rich tributes to the late philanthropist. He was always humble and led a simple life, he said.\n\nIn an obvious reference to the reported differences between M.A.M. Ramasamy and Mr. Muthiah, he said that in every family the father and the son had differences, and it would be totally unfair to blow it out of proportion in the open.\n\nEarlier, Soma Narayanan, zamindar of Devakottai, unveiled the portrait of Ramasamy. Karaikudi Chamber of Commerce president Muthu Palaniappan, Sahitya Academy Bala Puaraskar award winner ‘Poet’ Sella Ganapathy, industrialist M.C.N. Manickam and Nattarasankottai Kambar Koil trustee Visalakshi Kannappan among others were present.", 
    "section": "national", 
    "title": "Kamban Kazhagam gets new patron", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}