{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Observing that it would be a mockery of justice if even as simple a case as one complaining of criminal intimidation was kept pending for 19 years, the Madras High Court Bench here has directed a lower court to dispose of the case within two weeks.\n\nExpressing concern over the case having been taken on a roller coaster ride right from the Magistrate’s court to the Supreme Court and back again, Justice S. Vimala said that speedy trial was a sine qua non for effective and efficient functioning of criminal justice system.\n\n“Justice: social, economic and political, is the first promise of the Constitution… That is why right to speedy justice has been held to be a fundamental right which is consistent with the concept of fair and impartial trial,” she said.\n\nThe judge pointed out that the complaint in the present case was lodged by one Meenakshi, Managing Director of a private company, East India Corporation, with Dindigul police in September 1996 accusing E.N. Palanisamy, owner of another company, of threatening her.\n\nDuring trial, the summons issued by the court could not be served on the complainant in the address mentioned in the complaint. Efforts taken to serve the summons at her Chennai address too failed. Hence, the trial court proceeded with the hearing and acquitted the accused in 2003.\n\nIn 2004, the complainant filed a petition before a Sessions Court to condone the delay of 316 days in filing a revision case challenging the acquittal. The appellate court condoned the delay, allowed the revision and ordered retrial in the case in July 2006.\n\nThe order of the appellate court was challenged by the accused before the High Court with a delay of seven days. However, the High Court refused to condone the delay. Hence, the matter was taken to the Supreme Court which condoned the delay in 2007 and remitted the matter to the High Court. Since then, the case had been pending in the High Court. Taking it up for final disposal now, Ms. Justice Vimala confirmed the order of retrial and directed the trial court to pass final orders within two weeks after hearing arguments advanced on behalf of the complainant.", 
    "section": "national", 
    "title": "“Keeping case pending for 19 years, a mockery of justice”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}