{
    "author": [
        "P V"
    ], 
    "text": "The badminton court in Krishnagiri that awaits funds for polishing of the wooden floor.— Photo: N. Bashkaran\n\nWhen the gap in sports infrastructure maintenance widens, both the sport, and its underlying infrastructure becomes a sure casualty.\n\nFor the district’s stadium complex, which houses indoor court for badminton, along with a tennis court, a gym, an open air stadium, football ground and a basket ball court - the issue is not of infrastructure, but of lack of a steady maintenance grant to consolidate the built in facilities.\n\nFor instance, the teak-floored indoor badminton court fetches monthly income to the tune of Rs. 40,000. According to G. Shiva, Secretary, Krishnagiri Badminton Club, the court is used by about 100 players, with a monthly user charge of Rs.400 each. “Yet, the court lacks basic facilities such as drinking water or people for mopping of the court,” he says.\n\nSpeaking to The Hindu , a source said, the norm is that 25 per cent of the amount collected should be utilised for maintenance. However, the Rs.400 collected from each player gets credited directly to the SDAT account in Chennai and any proposal for maintenance rests for ‘consideration’ of the SDAT.\n\n“ “It is the prerogative of the SDAT officials whether to consider the request or not,” throwing to the wind, the 25 per cent grant norm. User-charges collected should have been rightfully channelised to support the existing infrastructure maintenance, but instead, the recurring user-fee is kept dormant, says Mr. Shiva.\n\n“In addition, a one-time deposit of Rs.3, 500 is collected from each player for the use of badminton court, though there is no written norm that such a deposit should be collected. This deposit also generates recurring interest, yet there has not been any infrastructure maintenance,” he alleges.\n\nA bare-minimal monthly maintenance grant of Rs. 2,000 each for indoor courts, swimming pool and the football ground is the only steady fund the sports complex receives from the SDAT.\n\nFor now, expenses towards gardeners, sweepers etc, is being channelled from a privately funded corpus fund of Rs.1 crore under the Krishnagiri Sports Development Society.", 
    "section": "national", 
    "title": "Krishnagiri: funds crunch hits infrastructure maintenance", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}