{
    "author": [], 
    "text": "After DMDK’s general council meeting, Vijayakant was a bit more civil with journalists — he just avoided them\n\nRun-ins between DMDK leader Vijayakant and journalists are now very well known. At his last encounter, the actor-turned-politician earned the ire of mediapersons when he lost his cool and ‘spat’ at a reporter for posing an uncomfortable question. However, stretching his contempt for the media a bit too far, the opposition leader on Saturday not only refused to meet journalists after addressing his party’s crucial general council meeting in Perambalur, but also ensured that no one from the media came anywhere close to him.\n\nParty seniors made it clear that he will not interact with him. They kept telling the security guards not to allow the reporters any access to their leader as the latter left the venue.\n\nHowever, the security guards saved the day by politely asking the journalists to oblige.\n\nAt a public meeting in Chennai, Congress leaders took enormous pride in saying that the AICC spokesperson Khushboo was the only actor in the country to have a temple dedicated to her. TNCC president EVKS Elangovan went one step further and said the actor was so popular to lend her name to a variety of idli, the traditional Tamil food.\n\nBasking in the eulogy, Ms Khushboo sought to imitate Chief Minister Jayalalithaa, who used to elicit an answer from the party cadre in public meetings. “Will you defeat her for not visiting you during the floods? (Cheiveergala),” she asked. But the crowd made only a whimpering response.\n\nPoliticians are never wary of deriving political mileage at any cost. Notwithstanding the criticism during the flood relief that the ruling AIADMK was seeking to hijack credit for it, an enthusiastic party leaders did something unusual at a recent function held in Kancheepuram to distribute free cattle to beneficiaries of the State government’s ‘Priceless Cattle and Goat Scheme’. They draped a red-black-white party coloured cloth on a cow that was lined up before it was handed over to a beneficiary.\n\nUnion Civil Aviation Minister Ashok Gajapathi Raju’s decision to spend two days in Tiruchi, meeting representatives of various sections of society came as a pleasant surprise for local residents. But there was a story behind his visit. At an interaction with travel industry representatives, with disarming candour, Mr. Raju revealed that it was felt at a recent meeting of Ministers with Prime Minister Narendra Modi that Union Ministers were not travelling enough across the country, except their home States. It was decided that each Minister would visit two States, other than their home States. “The idea is to fan out and collect information,” he said. The Ministers were supposed to give their feedback on issues and possible solutions. “I wanted to visit a place with warm weather and Tiruchi figured in the list,” he said.\n\nThe fourth edition of the annual sports meet organised for orphan children by the Armed Reserve of Coimbatore City Police and the District Child Protection Unit on Saturday raised a few eyebrows. At one event, boys and girls had to fill water with their hands in bottles placed on the ground. However, the brown coloured glass bottles resembled beer bottles prompting some to question the organisers if it wouldn’t convey wrong lessons to the children. The organisers were at pains to explain and claimed that these were not beer bottles but coloured soda bottles.\n\n(Contributions from S. Ganesan, B. Kolappan, V. Venkatasubramanian and Dennis S Jesudasan)", 
    "section": "national", 
    "title": "No more spitting, just keeping them at bay", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}