{
    "author": [], 
    "text": "Vakilsearch is giving clients an option to pay their legal service charges spread over a few months\n\nEquated monthly instalment options are available for anything people have to pay for – from property to household goods and even vacations. Paying for legal services through EMI would have been the last thing people would have thought of.\n\nVakilsearch, a legal service provider has recently come up with the option of providing instalments for legal services in Chennai, Hyderabad and Bengaluru. Hrishikesh Datar, founder of the company says they have about 3,000 lawyers on board for the service and plan to expand to New Delhi and Mumbai too. “From company incorporations, legal documentation, tax and IP registrations to secretarial services, we provide a host of service under EMI option,” he says.\n\nThe EMI can be paid over 6, 12, 18 or 24 months depending on the type of service provided; and the charges range from Rs. 2,000 to Rs. 7,000. “If it is for Intellectual Property Rights services, the charge is about Rs. 2,000 but if it deals with company registration, then we charge them Rs. 7,000,” he says.\n\nCrowdfunding education\n\nTo help students struggling to finance their education, Spice Foundation and No Food Waste teams from Coimbatore are launching an online portal,www.edudharma.com,in a week.\n\nThe portal, an online academic crowd sourcing platform, will let students create a profile and highlight their needs with regard to school or college education.\n\nThe team behind the initiative said the portal offered a platform to both students who needed help as well as philanthropists helping them. “The philanthropists who want to help out can use the portal as per the criteria they are ready to support, including details of the student’s marks and institution he or she wishes to attend. We will coordinate with people willing to help out and ensure that the funds reach the students who are in need,” says S.K. Bharanidharan , who is coordinating the working of the portal in Chennai and Salem.\n\nThe portal will be launched on January 12 on National Youth Day at the IIT Madras and Palam Kalyana-sundaram, who made news for donating his entire lifetime earnings to the cause of educational support for poor children is expected to launch it.\n\n(Reporting by S. Sunitha Sekar and\n\nS. Poorvaja)", 
    "section": "national", 
    "title": "Now, pay your legal service fees by EMI", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}