{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Indiscriminate dumping of waste sounds death-knell\n\nAn open canal at Keezha Devadhanam in the city, which was once used to irrigate the paddy fields and discharge excess water during rainy season, faces the danger of extinction due to indiscriminate dumping of waste.\n\nThe canal that flows into the River Cauvery looks like a dumping yard. It has almost been clogged, resulting water stagnation in several areas including Devadhanam, Sanjeevi Nagar and neighbouring residential colonies.\n\nLocal people say that the canal had served the city for carrying storm water during rainy season into the Cauvery. It had the history of irrigating paddy fields near Devadhanam until two decades ago. However, it is now struggling to serve the very purpose of its establishment due to encroachments, unchecked growth of hyacinth, lack of efforts from the City Corporation to clean the canal frequently and dumping of waste by some residents.\n\nThe canal has been badly silted up with solid waste, plastic bags, plastic cups, broken bottles and others. Residents complain that the sewage water flows on vacant plots and streets in residential colonies, making the life difficult for them particularly elders and children. It has ultimately become a breeding ground for mosquitoes. Moreover, the entire area has been affected with bad odour.\n\n“When I came to settle in Devadhanam about 10 years ago, the canal was about 15 feet. It has shrunk dramatically due to the encroachment and silting. It has been neglected. Canals and open drains are important to discharge water in the event of flood,” says a resident.\n\n“The canal makes life difficult for us. The bad odour that emanates from the canal forces us to close our windows always. Thousands of mosquitoes swarm in the evening and morning,” says a shop keeper in Keezha Devathanam.\n\nD. Sudhakar, Councillor, ward-8, said that the Keezha Devathanam canal and three branches of it would be revived. The areas encroached by a few people had been restored. In fact, construction of retaining wall along the canal had been completed for about half distance of it. A sum of Rs.22 lakh had been allotted for it.", 
    "section": "national", 
    "title": "Open canal facing extinction", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}