{
    "author": [
        "M K"
    ], 
    "text": "Candidates at the private job fair organised by the State Government in Coimbatore on Sunday.- Photo: M. Periasamy\n\nFrom 4.30 a.m. on Sunday, job aspirants from the city and nearby districts thronged Sri Krishna Institutions, the mega job fair venue, here with multiple copies of résumé and certificates. Over 500 companies had come to recruit candidates.\n\nThe premises had stalls put up by companies where they collected the bio-data, met the candidates and had discussions with them. There were openings in various companies for graduates as well as for those who had not completed school education.\n\nCandidates were provided with a list of companies, eligibility criteria and requirement of candidates. A mobile app and website were also launched for this purpose. Arrangements included waiting area for parents, free food, 1,600 buses for free transportation and separate area for the differently abled.\n\nSaravanakumar, a visually challenged person from Vadavalli, got placement as a trainer at an institute for Rs. 8,500 a month. “Unable to get a job for the last two years, I made Rs. 5,000 a month by taking tuitions at home,” the B.A. (English), B.Ed and Law graduate said.\n\nJinal A. Kothari, a final year BBA (CA) student and her friends got placed in a BPO at Tirupur for Rs. 7,000 a month. They were already placed for Rs. 12,000 a month through campus placement and took part in the fair to gain confidence.\n\nWhile some graduates were happy to start with Rs. 5,500 a month, others were disappointed with low salary offers. There were more opportunities for diploma and degree holders and skilled workers compared to the postgraduates.\n\nA few companies said they would conduct the next round interview at their office. Unable to manage the long queues, a few other companies collected résumés and told candidates that they would be called for interview.", 
    "section": "national", 
    "title": "Opportunities galore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}