{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Tucked away behind foliage-rich trees at the busy Marakkadai Junction is Coimbatore’s oldest school. It requires a third or fourth glance to realise that there is a school for there’s very little to suggest so.\n\nA small door leads to an enclosure that has a ground in the front. On the west and north are buildings. The building on the west is used by management to store goods that are not of day-to-day use. The building on the north houses classrooms, created artificially through partitions.\n\nThe city’s oldest school, the CSI Elementary School, is the academic home to 25 students. A plaque, replica of the original, says: This stone was laid by Alfred W. Whitey Esq., Director, London Mission Society, on December 28, 1906.\n\nBut that’s not when the school was started. Father W.B. Addis, a member of the then London Mission Society, started the school on August 1, 1831, says C.R. Elangovan, a city historian. There was no building in the school’s vicinity then and place came to be known after the school as Christianpet.\n\nThe London Mission Society established a few other schools in the city. Its activities and members so influenced the city’s life that there’s an LMS (London Mission Society) street in Pappanaickenpalayam and an Addis Street, off Avanashi Road.\n\nThe school is a shadow of its former self as it used to teach more than 100 students, say teacher R. Margret Sheela. It now caters to students from CMC Colony, SPN Colony and areas off N.H. Road. She says that she feels proud to be a teacher in the oldest school in the city.\n\nAfter Independence, the Church of South India took over LMS schools and continues to manage the Christianpet and other schools in the city, Mr. Elangovan adds. Correspondent D.S. Amirdham says that the management has plans to revive the school and will soon draw a plan of action.", 
    "section": "national", 
    "title": "Over 150-year-old school", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}