{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two men were killed in separate accidents in the city on Saturday evening.\n\nNityanandam (55) of Anaikattuchery was trying to cross the Chennai Tiruvallur High Road at Pattabhiram, when he was hit by a speeding motorcycle. He was rushed to a private hospital in Porur, where the man succumbed to injuries. The two youths who were on the motorcycle were also injured, Avadi police said.\n\nIn Pallikaranai on Saturday, a 20-year-old resident of Madipakkam was killed after he was hit by a private bus. St. Thomas Mount Traffic Investigation police said Bhaskar, of Anna Nagar second street in Madipakkam, worked in a private company in Perungudi. He was returning home from work when the bus hit him. The accident took place on Pallavaram-Thoraipakkam Radial Road. He was rushed to the hospital, but did not respond to treatment, and died. The victim’s body was shifted to Tambaram Taluk Government Hospital in Chromepet for a post-mortem examination. The bus driver, Chandrasekar of Pallikaranai, was arrested.\n\nRoad safety week begins\n\nThe annual Road Safety Week was inaugurated by P. Thangamani, Minister for Industries and Transport.\n\nA senior official of the Transport Department said the theme this year was ‘Road Safety-Time for Action’ and that it would be observed till Saturday. The focus would be on creating awareness of safe driving and the importance of wearing helmets by two-wheeler riders. Officials of the department and the traffic police will also educate four-wheeler drivers on the importance of wearing seatbelts.\n\nThe Regional Transport Officers in the city, in association with non-governmental organisations, have proposed to organise awareness programmes in schools and colleges. City traffic police will also conduct awareness meets at traffic intersections. As part of the event, Transport Commissioner Satyabrata Sahoo and other Ministers took part in a march from Labour Statue to Light House.\n\nRoad safety week to focus on safe driving, obeying traffic rules and wearing helmets", 
    "section": "national", 
    "title": "Pedestrians killed in accidents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}