{
    "author": [
        "D Madhavan"
    ], 
    "text": "M. Arumugam is preparing his homing pigeons at his loft in Avadi to participate in the month-long racing competition.— Photo: M. Vedhan\n\nA group of veteran pigeon fanciers huddle together on the Chennai-Kolkata Highway, a national highway (NH 5) in Tada, around 65 km from the city early on Sunday.\n\nAround 7 a.m., the fanciers — who breed pigeons — release the birds from their wooden cages. In a matter of seconds, hundreds of these pigeons disappear into the horizon — signalling the start of the first leg of Chennai Racing Pigeons competition for the year.\n\nHomer pigeon fanciers from different areas of Chennai take part in the annual five-month-long competition. “Weather and wind patterns are major factors,” says veteran racer, 50-year-old M. Arumugam, secretary, Goodwill Pigeon Racing Society (GPRS) in Avadi.\n\nAnother pigeon racer, M. Thirunavukarasu, says developing homing instinct among the racing pigeons starts from pairing correct bloodline. Training, healthy feed, medicine and adequate rest helps racing pigeons to strengthen their homing skills. “Bonding between the trainer (mostly fancier) and the birds is a crucial factor in making homing birds into racing pigeons. It is not gambling as most people tend to view this. On the contrary, it is a sport and passion for bird lovers,” explains Mr. Thirunavukarasu.\n\nSunday’s event is the first step in a series of trips from Tada to New Delhi where homing racing pigeons will be released on the same route by increasing the distance.\n\nEach participant is allowed to send 12 racing pigeons for the short and medium-distance races.\n\nThe racer bird is tagged with a permanent ring bearing a four-digit number around its legs. It will have details such as year of birth, sex, species, the society with which it has been registered and the registered breeder.\n\nIt has an inner ring number, not known to the breeder of the bird when it is released. When the bird reaches its loft, the breeder gets to know the inner ring number and conveys it over phone to the society. The bird that arrives first into its loft or has taken the least time is the winner.\n\n“Pigeon racing is not banned under Indian Wildlife Protection Act, 1972, but permission has taken from the Forest Department,” says S. David Raj, District Forest Officer, Chennai.\n\nSunday’s event is the first step in a series of trips from Tada to New Delhi", 
    "section": "national", 
    "title": "Pigeon racing season off to a flying start", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}