{
    "author": [
        "Annie Philip"
    ], 
    "text": "A weaver at an exhibition organised by the Puducherry Backward Classes and Minorities Development Corporation at Anna Thidal on Sunday. Visitors throng the exhibition organised at the Gandhi Thidal in Puducherry on Sunday. A woman displays products made of coconut shells atthe Gandhi Thidal expo. — Photos: S.S. Kumar\n\nBC and Minorities Development Corporation Limited hopes they will provide a platform for artisans\n\nAhead of Pongal, the Puducherry Backward Classes and Minorities Development Corporation Limited hopes that the two exhibitions organised by it not only set the cash registers ringing but also provide a platform for various cooperative societies, artisans and small-scale entrepreneurs to showcase their wares.\n\nAt the exhibitions being held at Anna Thidal since December, sales have been brisk, said R. Meenakumari, Managing Director, Puducherry Backward Classes and Minorities Development Corporation Limited. With around 75 stalls from Puducherry and Tamil Nadu, play equipment, fun rides and shows for children, it has brought in Rs.5 lakh in sale of entrance tickets and another Rs.5 lakh in sale of products, said Ms. Meenakumari. “New Year’s day brought in around 6,000 visitors,” she said. At the PONFAB stall, a staff member demonstrates the working of a handloom for visitors. “The youth do not know how handloom fabric is made which is why we thought of putting up a demonstration,” said Mathiazhagan, who is manning the stall. There is also a stall by the Pondicherry Carpenters Industrial Cooperative Society Limited, Thattanchavady.\n\n“This is the first time we are participating in a fair. Our furniture products are differentiated by the good quality and fair price,” said Ayyappan at the stall. Plastic ware, household goods, toys and textiles are some of the other products at the exhibition fair at Anna Thidal, which is on till January 27.\n\nBesides products from Puducherry and Tamil Nadu, there are handicraft, handloom, fabrics, house decor, jewellery and other products from Karnataka, Gujarat and Rajasthan at the fair at Gandhi Thidal with 130 stalls, which was inaugurated on Sunday. Unlike the other fair, there is no rent collected from exhibitors here and entrance is free for visitors. Some of the unique products include purses fashioned out of coconut shells and a variety of wooden massage and acupressure tools.\n\n“Tourists and college students find our products interesting,” said Saroja who has an array of coconut shell products. P. Karuppiah from Madurai said his wooden massage and acupressure tools are made of neem wood, and priced from Rs. 60 to Rs.1,500.\n\n“The exhibitors are those who have obtained loans from the Corporation and are running their enterprises. It is also being aided by the National Backward Classes Finance and Development Corporation,” said Ms. Meenakumari. Holding such exhibitions provide entrepreneurs and artisans the required marketing assistance, she added. The exhibition is on from 10 a.m. to 10 p.m. till January 25.\n\nThe exhibitors are operating enterprises on loans borrowed from the Corporation", 
    "section": "national", 
    "title": "Pongal sales brisk at two exhibitions", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}