{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Department of Posts would open ATMs at five more places in the southern region shortly to provide better services to public, said Director of Postal Services (Southern Region) T. Nimala Devi.\n\nPresiding over the inauguration of the first ATM at Bodi head post office – the fourth in Madurai region and the 29{+t}{+h}in the State – on Saturday, she said that installation of ATMs was over at these post offices, and they would become operational soon. At present, ATMs had been functioning at Dindigul, Palani and Karaikudi. ATM cards had been issued to 946 account holders, she added.\n\nA total of 603 of the 751 offices in the region had been brought under Core Banking System, benefiting 52 lakh savings bank account holders. Preparatory works were completed in 57 other offices and they would migrate to the CBS soon. A total of 1,645 officials had been trained in various aspects of the CBS, she said.\n\nAadhar cards of 2,259 of the 6,128 pensioners receiving their pension through post offices had been linked to their pension accounts. Digital life certificates under Jeevan Pramaan Scheme had been issued to 1,215 pensioners, she added.\n\nStating that Madurai head post office had a Philatelic Bureau with more than 3,500 philatelic deposit account holders, she said that this region had exclusive My Stamp counters at Kodaikanal, Kanyakumari and Madurai to popularise this product among tourists.\n\nMadurai region had 65 lakh accounts, accruing a revenue of Rs. 132 crore a year. It had also earned a revenue of Rs. 20 crore through business development activities this year.\n\nMs. Nimala Devi the entire population of Mudalakurichi in Kanyakumari district and Saminatham in Virudunagar district was covered and Sampoorna Dak Jeevan Bhima Gram Scheme, she added.\n\nEarlier, Finance Minister O. Paneerselvam inaugurated the ATM and opened a savings account in his name.", 
    "section": "national", 
    "title": "Postal dept. to open ATMs at five more places in southern region", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}