{
    "author": [], 
    "text": "Appoint new V-C at Tiruvalluvar varsity\n\nIt has been nearly six months since the former Vice-Chancellor of Tiruvalluvar University, Vellore, handed over office. However, the State Government is yet to appoint the new Vice-Chancellor.\n\nMore than 110 Arts and Science Colleges located in Vellore, Cuddalore, Thiruvannamalai and Villupuram Districts are affiliated to this University. The V-C is the chairperson of the Syndicate and the highest government body is unable to finalise administrative decisions. I, therefore, request the higher educational authorities of Tamil Nadu to appoint a new V-C. at the earliest for the benefit of students as well as the college administrators.\n\nM.R. Lakshiminarayanan\n\nKallakurichi\n\nPostpone Assembly elections\n\nThe torrential rains that battered Chennai and some districts in Tamil Nadu were unprecedented.\n\nThere was massive loss of property and normal life was thrown out of gear. Many residents lost certificates, ration cards, personal identity cards and voter Identity Cards.\n\nI appeal to the Election Commission to take into consideration the predicament of the residents and postpone the date of Assembly polls in the State. Similarly the havoc the rains caused in Puducherry and Karaikal regions was also severe and hence the Assembly elections due in next few months in Puducherry should also be put off.\n\nThe postponement of the polls would be helpful for the government machinery to go ahead with relief and rehabilitation works.\n\nOnce the election date is announced the model code of conduct would come into force and the political parties waiting in the wings to mount attack on the administration would come out with complaints which would only disrupt the smooth restoration works. Hence elections for the Assemblies should be postponed and statutory provisions could be invoked for smooth continuation of flood relief works for some more months.\n\nS. Nadarajan\n\nJawahar Nagar, Puducherry\n\nReaders can send their mails to pondy.thehindu@\n\ngmail.com and The Hindu, No. 135 Mission Street, I Floor, Puducherry – 605001.", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}