{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The creation of new facilities by the Sports Development Authority of Tamil Nadu (SDAT) at the stadiums in Salem city and Namakkal has brought much delight to the sports lovers of both the districts.\n\nThe State Government sanctioned Rs. One crore for the creation of new facilities and renovation of existing ones at the Gandhi Stadium in Salem city recently. It also sanctioned over Rs. 50 lakh for a new roof, creation of drinking water and sanitation facilities at the stadium, relaying the floor at the indoor stadium, renovating the basketball courtand the boxing ring. All the works have already been completed, according to the SDAT sources.\n\nThe work of construction of an indoor stadium at an outlay of Rs. 1.50 crore is in progress in Namakkal town. The SDAT has proposed to construct a compound wall for the women’s hostel apart from installing the entrance gate for the stadium.\n\nThe sports activities in both the districts got a big boost with the inauguration of an arm of the Hyderabad-based prestigious Pullela Gopichand Badminton Academy in the city a few months ago. Pullela Gopichand, former All England Open Badminton Champion and chairman of the Academy was present on the occasion. The Academy has courts of international standards besides exchange programmes. The best performing players of Salem will be imparted specialised training at the headquarters in Hyderabad.\n\nVarious private organisations too play a big role in promoting sports activities in these districts. marathon and cycle race are conducted every month in the city and rural areas. The good response for these events could be gauged from the fact that the state-level marathon race held in the rural town of Konganapuram by the Konganapuram Sports Club last week attracted more than 1,000 participants. A prize money of Rs. 2.5 lakhs was offered to the winners.\n\nThe sportsmen and sports lovers complain about the non-hosting of major sports events in Salem and Namakkal. They wanted sports bodies to take steps to host national-level events, which will further give a fillip to the sports activities in the entire western region.", 
    "section": "national", 
    "title": "Salem: plea to host national level events", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}