{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sri Sathguru Sangeetha Samajam president Shobana Ramachandran (right) with award recipients – vocalist Sanjay Subrahmanyan (third from right), mrudanga vidwan ‘Palladam’ R. Ravi (second from left) and violin vidwan M. Dakshinamoorthy (third from left) in Madurai on Sunday.— Photo: R. Ashok\n\nRendering a vocal concert in a city such as Madurai itself was a blessing for any artiste and receiving the prestigious ‘Madhurakala Praveena’ award from Sri Sathguru Sangeetha Samajam an added joy, said vocalist Sanjay Subrahmanyan here on Sunday.\n\nAccepting the award from Samajam president Shobana Ramachandran on the 64th annual arts and music festival, he said that for every artiste, recognition came from the rasikas. When the artistes were honoured by sabhas, they joy got doubled.\n\nEarlier, welcoming the artistes, Ms. Shobana Ramachandran said that for the past 64 years Samajam had been playing an invaluable role in Madurai in promoting culture. Music and fine arts played an important role in the social milieu of a country. The character and integrity of the nation vested with its cultural unity.\n\nMusic, she said, was divine and a gift from the God. It formed a strong base for a civilised and peaceful life. People were “touched” and “moved” by music and they had a collective responsibility to nurture the precious art. With this objective, the Samajam was hosting concerts throughout the year by bringing the artistes and rasikas together to keep the culture alive, she said.\n\nMrudanga vidwan ‘Palladam’ R. Ravi was conferred the title ‘Madhurakala Mani’ and a cash award was given to violin vidwan M. Dakshinamoorthy.\n\nLater, Mr. Subrahamanyan presented a vocal concert. The festival draws to a close on January 13.", 
    "section": "national", 
    "title": "Sanjay Subrahmanyan gets award", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}