{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The renovation work has been completed over a period of 10 years\n\nThe Brahadeeswarar temple at Gangaikondacholapuram in Ariyalur district now presents a picture-perfect look with the raising of garden on its precincts.— PHOTO: M. SRINATH\n\nThe ancient Sri Brahadeeswarar temple in Gangaikondacholapuram near Jayamkondam now boasts a serene ambience, thanks to the re-construction of the compound, raising of a garden with a lawn, plants, and creepers all around the ‘prakaram’.\n\nVisitors and foreign tourists at the temple are more delighted over the beautification work, taken up in 2005 by the Archaeological Survey of India.\n\nAccording to official sources, the renovation work was taken up in phases. In the first phase, the vimanam of the sanctum sanctorum was renovated. The 15-foot high battered compound wall, running to a length of 360 metres (235 metres from east to west and 125 metres from north to south) posed a big challenge to the experts. “The temple which appeared to be a dumping yard for boulders, has been given a facelift now thanks to the beautification work completed about a couple of months ago,” says Brahadeeswararn, a local resident.\n\nWhile the prakaram is dotted with masterpieces of sculptures and inscriptions, the Archaeological Survey of India has set up serene meadow in the area. “The total area of the temple is 19 acres of which the lawn had been raised on nine acres,” an ASI source told The Hindu on Saturday. Every boulder has been properly utilised. In fact, a mandapam in front of Sri Brahanayaki shrine has been given a facelift. “The mandapam was in a disarray with stones strewn all around. We had utilised every stone and provided a ceiling,” says the source.\n\nThe Hindu Religious and Charitable Endowment Department, on its part, has implemented a few amenities. “Primarily, we have regulated the entry of devotees by shifting the entrance about five metres beyond the old gate. Many devotees, particularly foreigners, are not aware that they should leave their footwear outside the temple. The shifting of the entrance aimed at ensuring that the devotees and tourists first enter the footwear service unit,” says the official. The devotees can now do circumambulation of the sanctum sanctorum of the Sri Brahadeeswarar as additional lights and focus lights have been set up all around the ‘mahamandapam’. The source said that 76 lights and nine focus lights have been installed at important places.\n\nHERITAGE PRESERVED\n\nRebuilding the 15-foot compound wall posed a big challenge\n\nThe raising of garden with lawn, plants and creepers improves the look", 
    "section": "national", 
    "title": "Serene ambience delights tourists at Gangaikondacholapuram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}