{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Parents of differently-abled want institute to be established\n\nA special ‘Pongal’ festival organised by ‘Siragugal,’ a forum of Special children’s Parents Association Tiruchi, provided an opportunity for 150 differently-abled children to participate in various games and exhibit their talents.\n\nThe events which ranged from musical chair to throw-ball and from running race to surprise gifts, attracted both special children and their parents.\n\nOrganised for the eighth consecutive year, the festival commenced with the conventional preparation of ‘Pongal’ using a pot at the end of which games were held.\n\nSome parents felt that the festival provided adequate rejuvenation to their wards. “Our wards will carry the memory of the gathering and the recreation provided for the next one month,” says R. Meenakshi of Sangukadai even as her son Arulprakash was actively participating in the events.\n\nP. Sundaram, another parent, said that traders and other private establishments should ensure job opportunities for differently-abled persons. “What all the differently-abled persons need is honouring their rights on par with normal persons,” he said explaining the working environment being provided for his son, P.S. Rajavelu, by the employer. Most parents wanted the setting up of a branch of the National Institute for Empowerment of Persons with Multiple Disabilities in Tiruchi to cater to the needs of the differently-abled persons in the central region. K. Nanmaran, vice-president of Siragugal, said that the availability of advanced equipment and other infrastructure at the institute catered to the various needs of the differently-abled persons.\n\nP. Sundaram, president of Siragugal, said the differently-abled persons resided at various places and hence remained scattered across the city. He said the association would construct a hostel if the district administration allotted a land to it.\n\nA paediatrician, A. Muthuram, said that there was a strong case for creating awareness of prevention of the deformity in new born. “Taking due advantage of latest technology, one could prevent or even treat the foetus during the pre-natal period,” he said.\n\nP. Pandiyarajan, Dean of the TNAU – Agricultural College and Research Institute, said a large number of students of the college, as part of extending support and care to the differently-abled, participated in the event.", 
    "section": "national", 
    "title": "Special children celebrate ‘Pongal’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}