{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Perseverance paid rich dividends for 11-year-old R. Sri Rusat, who won championship in the “22nd International Yoga Festival 2016” conducted by the Department of Tourism, Puducherry Government, from January 4 to 7 in the Union territory.\n\nAfter suffering a setback in the previous international event, Rusat, a class VI student of Infant Jesus Matriculation School here, won the championship in the of 10-15 years category, outsmarting participants from the United States, Germany, France and Korea.\n\nIt was equally a proud moment for his guru and yoga master A. Padmanaban (74), who won world champion award in the veteran category in 2010, and is presently teaching yoga to more than 30 students in the district.\n\nR. Saravanan, also his student, brought laurels by winning the third position in 26-35 years category in the international event.\n\nThey were part of the 18 participants sponsored by Ramanathapuram District Yoga Sports Development Association.\n\n“I want more of my students to win titles and bring laurels to the district,” Mr. Padmanaban, who is the secretary of the association, said.\n\nRusat was among the 133 students from Tamil Nadu who showcased their prowess in Thirukural in Parliament in December 2015, his father Ram Prakash, a computer engineer, said.\n\nAs his son evinced interest in yoga as a young boy, Mr. Prakash put him in Pathanjali Yogasana Training Centre, run by Mr. Padmanaban. Undeterred by his setback last year, Rusat scored 80 out of 100 marks in practical and theory to win the championship this year.\n\nThe boy who could practice more than 100 asanas aspired to win overall championship in the international event.\n\n“My ultimate aim is to become champion of champions,” he told The Hindu .\n\nOut of the 10 ‘asanas’ in the syllabus, Rusat performed ‘Kanda brindasanam’ and ‘Veera badrasanam’ chosen by draw of lots by the organisers, and ‘Poorna chakrasanam’, as his choice.\n\nSaravanan (33), a goldsmith, who had been practicing yoga for 10 years, performed ‘Yegapada vibaneetha dhandasanam’ and ‘Yoga nithrasanam’, by draw of lots, and ‘Parsava pagasasanam’, as his choice, to win the third place.", 
    "section": "national", 
    "title": "They bring laurels to Ramnad through yoga", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}