{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam : Sri Hanuman Jayanthi, Vocal concert by R. Kashyap Mahesh, 5 p.m.; Veena concert by Veenai Rangarajan’s son, Chithrai Street, Srirangam, 7 p.m.\n\nSri Andavan Ashram, Srirangam : Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam : Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Desikan sannidhi, Srirangam Sri Ranganathaswamy temple, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, Vinayagar street, Indira nagar, 6 p.m.\n\nCULTURE\n\nSri Kailasa Kamala Ganapathy Temple, Kailsah Nagar : Pongal festival, Quiz contest, 6.30 p.m.; karagam, 8.15 p.m.\n\nGENERAL\n\nOrganising Committee : Louis Braille birth anniversary of Louis Braille, V. Nandakumar, Joint Commissioner of Income Tax, delivers key note address, N. Anandhi, Chief Educational Officer, S. Kalaiarasi, Additional Chief Educational Officer and others speak, District Central Library, 3 p.m.\n\nSt. Joseph’s College : Department of Botany, School of Biological Sciences and Indian Institute of Crop Processing Technology, Workshop on “On-farm food processing,” S.R. Senthilkumar, Associate Professor, resource-person, 9.30 a.m.\n\nSrimad Andavan Arts and Science College : Department of Social Work and Trust Me - Addida Club, United Kingdom, District-level cultural meet for special children -- Insight 2016, P. Swarnakumari, Associate Professor, Holy Cross College, chief guest, G. Jothi, Vice principal, felicitates, J. Radhika, Principal, presides, Sri Paduka Arangam, 10 a.m.; Department of Commerce and Management, Nigama Samaj and Prabandha Samiti, K. Devaraj, Assistant Professor from Jamal Mohamed College, speaks on ‘Financial education awareness programme,’ M. Pitchaimani, Vice principal, felicitates, Main Block AV Hall, 11.30 a.m.\n\nShrimati Indira Gandhi College for Women: Department of Fine Arts and NSS Unit, Pongal festival celebrations, R.V. Hall, 10.30 a.m.\n\nJamal Mohamed College: Chemistry Association, Workshop on 'Microscale experiments in chemistry', S. Murugan, former Head of Chemistry Department from S.T. Hindu College, Nagercoil, delivers lecture and demonstrates, S. Mohamed Salique, Principal, presides, Chemistry Seminar Hall, 8.45 a.m.\n\nJamal Institute of Management : K. Parasuraman, Management Training Consultant, speaks on 'The leader who had no title', K. Abdus Samad, Director, presides, Seminar Hall, Jeddah Block, 3 p.m.\n\nChidambaram Pillai College for Women: Department of Tamil, Seminar on 'Sibi Ilakkiyam', Rasa. Ilangovan, from Rasavelar Shenbaga Tamil Arangu, speaks, Seminar Hall, 1 p.m.\n\nPeriyar EVR College : Training and Placement Cell, Pan Card Camp, Periyar Auditorium, 11.30 a.m.\n\nSharon Grama Vidiyal Trust and JCI Tiruchi Excel : Founder’s Day and Pongal celebrations with visually-challenged workers of ORBIT, K. Sudhakar, Plant Head, Rane TRW unit, Viralimalai, chief guest, Sathish Devaraj,Head- HR, Grama Vidiyal Micro Finance, distributes prizes, S. Devaraj, Chairman and managing director of GVM Finance, presides, Community Hall, St. Theresa's Church, 4 p.m.\n\nCampion Anglo Indian Higher Secondary School : Primary School Achievers' Day, A. Murugesan, Superintendent of Central Prison, chief guest, Mathew T.Thomas, Country Director, U.S. Food and Drug Administration,New Delhi, presides, 5.45 p.m.\n\nChellammal Vidyalaya : Multi and inter-disciplinary exhibition “Spectrum CVT 2016”, N. Gopalakrishnan, Head of Physics Department, NIT-T, chief guest, S. Ramamoorthy, Chairman, Sowdambiga Group of Schools, felicitates, Tiruverambur 9.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}