{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘His wife Premalatha had also criticised the DMK’\n\nMarumalarchi Dravida Munnetra Kazhagam general secretary Vaiko on Sunday opined that DMDK leader Vijayakant was equidistant from the two principal Dravidian parties.\n\nReplying to a query whether the DMDK was moving closer to the People’s Welfare Front as it had targeted both the AIADMK and the DMK during its executive committee and general council meeting at Perambalur on Saturday, Mr. Vaiko said he had met Mr. Vijayakant and expressed his desire that his party should join the People’s Welfare Front. Mr. Vijayakant told him that the decision on electoral alliances would be announced during the DMDK’s conference, but he continues to keep the cards close to his chest. Mr. Vijayakant also said that he neither liked the AIADMK nor the DMK.\n\nQuoting Mr. Vijayakant’s recent comments to The Hindu , Mr. Vaiko said the DMDK leader had stated that joining hands with the DMK was akin to stepping on quick sand. The DMDK leader’s wife Premalatha had also criticised the DMK, Mr. Vaiko said recalling the reported comments of Mr. Vijayakant in 2011 that he had joined hands with the AIADMK only to put an end to the “atrocities” of the DMK.\n\nJairam on jallikattu\n\nCondemning former Union Environment Minister Jairam Ramesh for terming jallikattu as a “barbaric sport”, Mr. Vaiko said Mr. Ramesh had made these remarks without knowing the basics of this traditional sport of Tamils.\n\nMr. Vaiko accused the earlier Congress-led United Progressive Alliance regime and the Narendra Modi government of “betraying” Tamil Nadu fishermen.\n\nFishermen release\n\nThe party by a resolution adopted at the district secretaries meeting appealed to the State government to take efforts to release the seven life convicts in the former Prime Minister Rajiv Gandhi assassination case on Pongal day. The MDMK appealed to the Chief Minister to invoke Article 161 of the Constitution to release them by adopting a resolution in the Cabinet and making a recommendation to the Governor.\n\nUPA and NDA governments have betrayed Tamil Nadu fishermen, says Vaiko", 
    "section": "national", 
    "title": "Vijayakant equidistant from AIADMK, DMK: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}