{
    "author": [
        "V S"
    ], 
    "text": "Built in 1862, the Podanur Railway Junction, considered the oldest in the entire region, has been visited by leaders during the freedom struggle and has its share in history. Even the Chennai Central Junction was built only in 1871, nine years after the Podanur one. The junction, an old structure, has withstood the test of time and vagaries of nature for the last 140-odd years. The building has not gone through any major structural change and the colonial building had just seen fresh coats of paints. Whenever, there used to be minor repairs, it was carefully attended to replacing only the worn out portions and the appearance has been kept intact, say railway officials. However, around the structure, there had been several developments to meet the growing demand for facilities. Some of the oldest items in the Junction namely glass jars, hat hanger (used by the British railwaymen), carved iron stair case and wooden benches are still there.\n\nPodanur Junction has its share of legacy too. It was on November 19, 1921 that a goods wagon from Malabar region came to Podanur and on opening the same the officials were shocked to see 60 to 70 dead bodies tumbling out. The victims were those arrested by the Malabar police during the violence that erupted in what was known as Khilafat Rebellion or Mappila Rebellion.\n\nNext was when Mahatama Gandhi visited Podanur Junction on March 19, 1925. Later, during his campaign tour for Harijan welfare in January 1934, Mahatma Gandhi was scheduled to reach Podanur Junction. But because of the fear of crowd management, the train was stopped mid-way at Chettipalayam and Gandhi alighted from the train, was picked up in a car by T.S. Avanashilingam Chettiar and was driven to Coonoor.\n\nThe junction, just six km from Coimbatore, has four platforms and eight railway lines. On an average, 65 pairs of trains pass through it and some of them do not even stop at Podanur. Whenever there is a discussion to decongest Coimbatore Junction or to develop a satellite station, Podanur is highlighted as the best choice.", 
    "section": "national", 
    "title": "welcoming in the first train", 
    "subsection": "tamilnadu", 
    "date": "2016-01-11"
}