{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "There’s not a moment that doesn’t belong, that doesn’t rise from what came earlier, that doesn’t slip into what comes later\n\nThere’s a sly joke in Irudhi Suttru about the Kollywood (and indeed, the Tamil) tendency to bestow titles and nicknames, put up cut-outs and banners, transform the most ordinary of events into a combination of Pongal, Deepavali and the Superstar’s birthday. The utterly ordinary event, here, is the return of Hissar-based boxing coach Prabhu (a quietly effective R Madhavan) to Chennai. In his honour, the local gym is festooned with posters that proclaim: Kuthusandai singame, Thamizhnaattin thangame .\n\nThe joke isn’t just that these celebrations are for a man who’s been disgraced (a sexual harassment charge hangs over him), a man who did not choose to come back in the first place. It’s also that he wants none of it. He doesn’t want this fuss.\n\nHe just wants to find new boxers and train them. In other words, he just wants to do his job. Had this been a Gautham Menon movie, he’d have turned to the junior coach (Nasser) at the gym and barked: Cut the crap !\n\nThat seems to be the motto of director Sudha Kongara as well. Irudhi Suttru is resolutely old-fashioned – not in the Rajini Murugan sense, where there’s nothing new, but in its conscientious commitment to the basics: writing, craft, performances. She’s made a Rocky kind of heart-warmer, where a predictable narrative is polished up by... cutting the crap. The situations are fresh, funny. There’s not a moment that doesn’t belong, that doesn’t rise from what came earlier, that doesn’t slip into what comes later.\n\nThe story has to do with Prabhu stumbling upon a girl he finds a “born champion.” But Madhi (Ritika Singh), who sells fish in a corner in the northern parts of Chennai, doesn’t see herself as a boxer. Her sister Lux (the excellent Mumtaz Sorcar) is the boxer in the family; she’s just the over-excited cheerleader. But Prabhu convinces her, and what follows is a battle of wills. If he’s got attitude, she’s no pushover either. She mocks his age, his paunch, his attempts to make something of her.\n\nThis isn’t sports training. This is breaking a wild horse. (Santhosh Narayanan’s untamed tunes, all serrated edges, are their own versions of wild horses.) Ritika Singh, who’s a professional boxer, is marvellously skittish. She plays the part like someone who grew up in the mountains, with no exposure to civilisation.\n\nEven when still, she appears to be at the verge of bursting out of her skin. It’s been a while since we’ve seen a heroine so... alive .\n\nBut the film isn’t just about this. It isn’t just Million Rupee Baby . It’s also a story about sibling rivalry. We see a lot of red in boxing dramas, but here we also see bits of grey. Prabhu himself is no saint. In his very first scene, he’s sinning with another man’s wife.\n\nIrudhi Suttru is also a love story. (We could call it a... glove story.) I had a lump in my throat when Madhi calls Prabhu’s bluff and asks what this is if not love. Most movies make the mistake of harping on issues – they turn into pamphlets. (The recent boxing drama, Bhooloham , was one – its final scenes still smelled of the printing press.) Irudhi Suttru ticks off its fair share of issues as well (poor infrastructure, politics in sports, sexual harassment), but it’s always about the characters. (The writers are Sudha Kongara and Sunanda Raghunathan.)\n\nExcept the painfully one-note villain (Zakir Hussain), everyone else is thoughtfully fleshed out from their generic moulds. The Wastrel Father is also a man who’s recently found Jesus. The Long-Suffering Mother is also the woman who encourages her daughter to box – and she’s from a Hindi household.\n\nThe Junior Coach is... just the junior coach. But Nasser negates the clichés. He gives the acting world’s equivalent of a warm hug from a grandparent.\n\nIrudhi Suttru is what you get when an in-sync team comes together. The cinematographer is Sivakumar Vijayan. In a couple of scenes, the theatre seemed flooded by sunlight. You feel you need to borrow Madhavan’s Aviator sunglasses.\n\nThe film is filled with these touches. I liked the touch that Prabhu, when transferred to Chennai, doesn’t hop on to a plane.\n\nHe bikes it, pitching tents along the way. A touch like that is worth five pages of dialogue.\n\nEven the most minor characters give us a glimpse of a larger story. I’m thinking about the boxing committee member played by Radha Ravi, who’s there for all of five minutes. But we see him with Prabhu, and we sense their shared history, the true nature of which is revealed at the end.\n\nThat something this deep, this dramatic is accomplished through a laugh-out-loud line is the sweetest punch of all.\n\nBARADWAJ RANGAN\n\nIrudhi Suttru\n\nGenre:Sports drama\n\nDirector:Sudha Kongara\n\nCast:R Madhavan, Ritika Singh, Mumtaz Sorcar\n\nStoryline:A boxing coach discovers a protégée in the unlikeliest of places.", 
    "section": "national", 
    "title": "A heart-warming boxing drama", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}