{
    "author": [
        "M K"
    ], 
    "text": "his week a five-and-a-half-year-old girl from Karumathampatty, who lost her parents in a road accident in December, will be handed over to a couple from the outskirts of Coimbatore under foster care.\n\nOn attaining 18 years of age she could decide on living with the childless couple that has come forward to nurture her as their own daughter.\n\nThe decision to hand over the child to the couple was taken at a meeting at the Child Welfare Committee (CWC).\n\nFoster care is an option under section 42 of The Juvenile Justice (Care and Protection of Children) Act, 2000, to rehabilitate underprivileged children aged more than five and below 18.\n\nIt is learnt that some parents who earlier opted for adoption have also started going for foster care due to time taken for adoption.\n\nAccording to the District Child Protection Unit (DCPU) around 8,000 couples in Tamil Nadu have registered for adoption whereas only around 800 children are available.\n\n“Twenty-five childless couple have registered with the DCPU here for foster care last month after the scheme was once again publicised by the government,” said G. Vijaya, District Child Protection Officer.\n\nThe last time they DCPU gave a child for foster care was in 2013.\n\nChildren given to foster care could be those who lost either one or both parents or of persons suffering from chronic illness or of persons unable to raise them.\n\nBiological parents are allowed to visit the child at the foster parent’s house.\n\n“The child could either live with the foster parents or stay in a home or orphanage and can be taken to the house of the foster parents during holidays,” says Ms. Vijaya. The child is constantly monitored by the DCPU till she attains 18 years.\n\nThough parents with children too could opt for foster care, those who have registered with the DCPU now are childless couples.\n\n“They prefer orphans as they would be able to adopt the child at a later stage,” Ms. Vijaya said.\n\nNorms for registering for foster care are similar to that for adoption. Details on foster care are available at the DCPU located on the second floor of the corporation complex near the new bus stand on Mettupalayam Road (ph: 0422-2455305).", 
    "section": "national", 
    "title": "An option for couples, children", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}