{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The attack on the house of Pala. Karuppaiah is highly condemnable and is proof of the deteriorating law and order situation in the State, K. Kanimozhi, State Women’s wing organiser of the Dravida Munnetra Kazhagam, said in Coimbatore on Saturday.\n\nThe attack reflected the political culture of the AIADMK which had attacked one of its former party cadre. This was not something new if one were go by the party’s track record. If at all the party had differences of opinion with what Mr. Karuppaiah had said it could have countered it by presenting facts. The attack also reflected deteriorating law and order situation in the State. It had worsened so much that a New Delhi-based agency that had studied law and order situation across the country had said that Tamil Nadu found a place in the top 10 crime-prone states.\n\nMs. Kanimozhi demanded a judicial inquiry into the alleged suicide of three students of the SVS Yoga and Naturopathy Medical College saying only that would bring out the truth as the students had been repeatedly complaining about exorbitant fees and poor infrastructure in the institution.\n\nDMK Treasurer M.K. Stalin’s ‘Namaku Name’ programme to reach out the public had had good response. In response to a question on DMK leading a coalition, she said that the party would take a decision at the right time. At present, elections were months away. If the DMK were to return to power, the party would definitely bring in prohibition as its leader M. Karunanidhi had promised.\n\nReplying to a question on Coimbatore getting selected for Smart City, she said that if the Central Government were to introduce schemes for Tamil Nadu’s development the DMK would definitely welcome those. But the schemes should not remain mere announcements.\n\nAt the protest at Red Cross junction, she said that the AIADMK government had failed on several fronts. Its freebies were of poor quality and had not reached many.\n\nMore than 1,500 women participated in the protest.", 
    "section": "national", 
    "title": "Attack on the house of Pala. Karuppaiah condemned", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}