{
    "author": [
        "B Kolappan"
    ], 
    "text": "With the Assembly election on the horizon, casteist outfits have sprung into action, calling upon their community men to come under one roof and fight for their rights. A few days ago, a leader seeking to represent the Saurashtra community organised a conference in Chennai. Sometime ago the Yadavas, under the banner of Tamil Nadu Yadava Mahasabha, held a conference.\n\nNow, Tamil Nadu Reddy Welfare Association has organised a conference on February 1 at Omanthur near Tindivanam. These outfits appropriate freedom fighters, statesmen and individuals who had scaled heights in their selected field, because they happened to born in their community\n\n. Unmistakable in the propaganda materials of the conference is the portrait of Omanthur Ramasamy Reddiyar, the Chief Minister of the Madras Presidency, who was a freedom fighter and a selfless leader.\n\n“The purpose of these leaders and their conferences is to put pressure on political parties at the time of elections. In the name of offering support to one party or the other, these leaders convert their outfit into a weapon to bargain with the government. They will never serve any good to the people they seek to represent,” alleged CPI’s State council member D. Lenin.\n\nThe trend, though, is not new to Tamil Nadu politics, the dynamics of casteism assumed a new turn in the 2001 Assembly polls when many caste organisations masquerading as political parties dictated to major political parties. In fact, it was these outfits that dominated the DMK-led alliance in the 2001 elections. The defeat of the DMK government despite a good track record in office thoroughly exposed the weakness of caste outfits.\n\n“But caste outfits continue to elbow their way into the mainstream politics during election time, as established political parties cannot afford to antagonise them,” said J. Jayaranjan, director, Institute of Development Alternatives.\n\nThe break-up of Tamil identity and lack of space for new entrants in political parties like the DMK and the AIADMK were the two causes that encourage caste-based outfits and their subsequent transformation as political parties, said Mr. Jayaranjan,\n\n“The rigidity in accommodating new faces led to the birth of actor Vijayakant’s DMDK. Mainstream political parties will not encourage these outfits in other times as they are fully aware that the emergence of Vanniyar Sangam as the PMK has become a major challenge to them,” he said.\n\nPMK MP Anbumani Ramadoss, however, rejected the attempt to paint his party in casteist terms, saying that it evolved in the process of social justice movement that secured separate reservation for Other Backward Classes in Tamil Nadu.\n\n“A total of 108 communities benefited because of the PMK’s efforts. Other cannot replicate our efforts because we have a committed leadership with a clear political agenda,” he said.\n\n‘ They elbow their way into politics as parties cannot afford to antagonise them’", 
    "section": "national", 
    "title": "Caste outfits get busy ahead of Assembly polls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}