{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ultra scan equipment in allveterinary hospitals sought\n\nCompensation to the tune of Rs. 4.29 crore has been disbursed to 12,466 farmers whose crops suffered damages during the recent downpour experienced by the district.\n\nSpecial teams comprising officials of agriculture, horticulture, revenue and cooperation departments inspected the damaged crops and submitted a report to the government. Based on the recommendation, the government sanctioned Rs. 4.31 crore as compensation, of which Rs. 4.29 crore had already been disbursed to the affected farmers. The amount had already been deposited in the bank accounts of the farmers, V. Sampath, Collector, said while speaking at the farmers’ grievances day meeting here on Friday.\n\nMany farmers’ representatives including V. R. Rajamanikkam, a progressive farmer of Veeranam, P.R. Samikannu of Periyeri, and Thiagarajan of Arasanatham complained that the crop damage assessment was not done properly and many affected farmers have been left out.\n\nThe Collector and C. Rajendran, Joint Director of Agriculture in-charge, said that another round of assessment of damaged crop was done by the official teams and the government will be sanctioning the compensation soon. Mr. Rajendran said that special initiative was taken to ensure that all the affected farmers are positively covered. Mr. Samikannu said that Periyeri Lake in the tail-end of the Kariakovil and Aanaimaduvu dams was a very old lake. The water released from both the dams into River Vasishtanadhi was yet to reach Periyeri due to encroachments and presence of seemai karuvelam trees.\n\nC. Vaiyapuri, president, United Farmers Association – Tamil Nadu, said that the High Court and the Supreme Court has ordered the speedy removal of encroachments of water bodies. Despite the above direction, encroachments continue in the Manivanthan Lake, he complained.\n\nA PWD official explained that a team had already inspected the lake and the Revenue Department has been approached for the removal of encroachments. Proposal has also been submitted to the Revenue Department for removing the seemai karuvelam trees. The Collector directed the revenue and PWD officials to take a survey of encroachments in the water bodies. Kannaiyan of Tirumanur said that the Centre has sanctioned huge funds for implementing programmes for the farmers belonging to ST community under the Farmers Protection Scheme. He pleaded with the district administration to ensure that the allotted funds are used for the implementation of the programmes, without retuning it to the government.\n\nSundaram, a cane farmer of Vaiyappamalai, thanked the Chief Minister for including a piece of red cane in the package of gifts to the people during the Pongal festival.\n\nThis enabled the farmers in getting reasonable price for the cane.\n\nA.R. Shanmugam, of Panamarathupatti, pleaded for the commissioning of ultra scan equipment in all the veterinary hospitals in the district and also 108 ambulance service for shifting the affected cattle. The regional joint director of animal husbandry said that ultra scans, each costing about Rs. 7.5 lakh, have been commissioned in six veterinary hospitals in the district, including Salem, Attur and Omalur. Three more hospitals will get this facility soon. N. Perumal, of Puliankurichi, said that many ration cards have got damaged and the farmers are made to run from one office to another for getting duplicate cards. An official from the Civil Supplies Department replied that all applications for the duplicate cards have been cleared.", 
    "section": "national", 
    "title": "Crop loss: Rs. 4.29 crore disbursed to farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}