{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Communist Party of India (CPI) has said under present All India NR Congress regime, the Legislative Assembly was made mockery and debates were not conducted in proper manner to uphold democratic values.\n\nCPI’s State Committee discussed here recently on various political developments in the Union Territory. CPI National Secretary K.Narayana, State unit R.Viswanathan and others participated in the deliberation.\n\nSpelling out the party’s stand vis-à-vis other political parties, the CPI passed resolutions stating that the party would strive to defeat corrupt- AIADMK and DMK. Holding the Congress as responsible for exorbitant price rise of essential commodities due to adoption of wrong economic policies, the party also said it would also defeat AINRC which has been supportive of communal BJP-led National Democratic Alliance(NDA) at Centre and PMK which lacks political conviction.\n\nAlternate government\n\n“We will bring alternate government in 14{+t}{+h}Legislative Assembly which will focus on the welfare of people more”, said the CPI while appealing the voters to come forward to support the candidates of People’s Welfare Front (PWF) for bringing alternate government in the Union Territory.\n\nStating that full-time Lieutenant Governor should be appointed immediately to the Union Territory, the CPI also said Lieutenant Governor of Andaman and Nicobar Islands A.K.Singh has been looking after UT as additional charge for long.\n\nHence the Centre should not delay the appointment of a full-time Lt. Governor to the Union Territory, the CPI said.\n\nPointing out that there has been strong anti-incumbency wave against the ruling AINRC led by Chief Minister N.Rangasamy, the CPI also added the ruling party MLAs too were in the mood of thorough dissatisfaction.\n\n“Chief Minister has been implementing welfare schemes every day to divert the attention of the public”, charged a resolution of the party.", 
    "section": "national", 
    "title": "Debates in Assembly not democratic: CPI", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}