{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Filling up of 149 Assistant vacancies in the Madras High Court and its Madurai Bench by granting double promotion to watch and ward staff, gardener, duffedar , photocopier operators and office assistants has created a stir among a section of employees who feel that at least 50 per cent of the vacancies should have been filled through direct recruitment.\n\nPointing out that the post of Assistant is equivalent to Group-II A services in State Government offices and carries a pay scale of Rs.5,200 - Rs.20,200 apart from Grade Pay of Rs.2,600, the employees state that many well educated graduates seeking public employment for long would have got an opportunity to enter into High Court service if half of the vacancies had been filled directly.\n\nThey also recalled that on September 3, 2012, the First Division Bench of the High Court led by the then Chief Justice M.Y. Eqbal had passed an order that 50 per cent of staff vacancies in the court should be filled by way of promotions and the rest, through public notification.\n\nSubsequently, a committee comprising two judges was also constituted to consider implementing the order.\n\nHowever, when contacted, Registrar General P. Kalaiyarasan clarified that as of now there was no necessity to earmark 50 per cent of vacancies for direct recruitment since the Madras High Court Service Rules had been amended. He also said that double promotions had been given only to those employees who had completed graduation and cleared the interview conducted by Registrars.\n\nVacancies still exist\n\nEven after filling up the vacancies through promotions, a large number of vacancies still exist in the High Court.\n\n“A notification calling for applications for these vacancies can be expected soon. It is not yet finalised whether the recruitment would be done by us or through Tamil Nadu Public Service Commission. But our experience is that the process gets delayed whenever it is outsourced,” he added.\n\n“50 per cent of vacancies should have been filled through direct recruitment”", 
    "section": "national", 
    "title": "Double promotions for HC staff create a stir", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}