{
    "author": [
        "Zubeda Hamid", 
        "K Lakshmi"
    ], 
    "text": "Infrastructure in government and private centres has not kept pace with the growth of the area\n\nFor years now, East Coast Road has been seen as a leisure destination — for weekend getaways, food and entertainment. Over the last decade or so, however, the stretch has been slowly growing into a residential hub — but with problems.\n\nResidents who live there say that the infrastructure, especially that of healthcare, both government and private, has not kept pace with the growth of the area.\n\nPortions of ECR, up to Uthandi, fall under Zone XV of the Chennai Corporation.\n\nBut beyond Injambakkam, residents say, there are no proper healthcare facilities, forcing patients to travel long distances to get to not just hospitals but also access pharmacies.\n\n“I have to travel to Rajiv Gandhi Salai (OMR) for quality medical care in multi-speciality hospitals — at least 20 km away. The nearest hospital is 45 minutes away,” said Vivish George, a resident of Nemmeli. Residents of Neelankarai, which falls under the Corporation are also not happy with the services provided.\n\nThere are not enough facilities and the standards are not up to the mark, they say.\n\nSrilakshmi Mohan Rao of Neelankarai said: “Even the primary health centre in Neelankarai functions only for a few hours. Residents still have no choice but to travel to the city or Rajiv Gandhi Salai for trauma care or emergencies. Many people opt for neighbouring hospitals for first aid and then travel to city hospitals.”\n\nBetween Uthandi and Mamallapuram, a distance of about 28 km, there are no primary health centres — only four health sub-centres function, said a senior official of the Directorate of Public Health.\n\nThis means that apart from not having access to accident and trauma care, patients have to travel considerable distances even for obstetric and other services.\n\n“There is a need for at least one PHC on this stretch and accident and trauma care services must be developed considering ECR is an accident-prone zone,” the official said.\n\nS. Nehru of a fishing hamlet in Perur said: “I either have to travel 12 km to Mamallapuram or 8 km to Kovalam by bus or autorickshaw to get to a clinic. I stock basic medicines at home as there is no pharmacy nearby.”\n\nResidents also note that there is a lack of proper ambulance service to many areas along the ECR.\n\n“When our neighbour had a heart attack, the ambulance came only after half an hour and she had to be rushed to Kelambakkam,” said Mr. Nehru.\n\nWith more residents in the city eyeing areas on ECR like Kanathur, Muttukadu and Perur to settle down in gated communities or apartment complexes, the provision of better healthcare facilities both in the government and private sector is imperative, said Susheela Vergis, a resident of Vadanemmeli.\n\nA health official of the Directorate of Public Health said there was a need for an enumeration along this belt and for an analysis of healthcare needs.\n\n“Some of these areas need no longer fall under the rural category and perhaps more infrastructures could be created here. Or if they are still considered rural, more village health nurses could be allotted, as many of them are now working for populations about of 15,000 when they should be handling about 5,000 people,” the official said.\n\nDirector of Public Health K. Kolandaisamy said further strengthening of health infrastructure on ECR was being considered by the government, as were provisions for accident and emergency care.", 
    "section": "national", 
    "title": "ECR needs better healthcare facilities", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}