{
    "author": [
        "Mohit M"
    ], 
    "text": "Resident of nearby village spots animal and alerts BBP officials\n\nIt was 150 men and a few elephants against an agitated bear. After hours of a dramatic tussle in the shrubs close to Bannerghatta Biological Park (BBP), the men eventually prevailed.\n\nA day after a Himalayan Black Bear managed to pry open the mesh and jump over the compound wall of the rescue centre at the zoo, the elusive creature was spotted at a village nearly six kilometres away. Around 7.30 p.m., a large contingent of men, with a few on elephants, made their way to Baigehalli village to bring back the female bear.\n\n“It was very aggressive and even tried to pounce on us multiple times. We tried to shoo it to a corner using firecrackers, but the bear kept swiping at the staff. Dart guns were brought to tranquilise her, but even then, it took us nearly four hours to catch the animal,” said a staff member who had a close shave when the bear’s swipe missed him by a whisker.\n\nThursday saw the zoo staff go into a panic following the escape of the bear, which had been brought from Agartala Zoo in Tripura nearly six months ago.\n\nAround 10.30 a.m., the bear was let out into the ‘crawl’ area to observe its behaviour before deciding if it could be put in the public exhibition enclosure.\n\nHowever, the bear tore open the mesh and ran towards the barbed wire wall of the zoo.\n\n“For six months, it had been in isolation. On coming out, it was restless and aggressive. When we corned the animal, it managed to jump the compound wall,” said Santosh Kumar, Director, BBP, who believed that this was an ‘isolated’ incident for an otherwise ‘well protected’ zoo.\n\nTheir fear was that the bear would make its way to the Bannerghatta National Park.Fruits and honey were placed all around to draw the bear in. Villagers in neighbouring areas were warned.\n\nOn Friday, one of the villagers called the zoo officials after spotting the bear. Mr. Kumar said the bear had recovered and would be put under observation for a few more months before deciding if it can be put in the main zoo.", 
    "section": "national", 
    "title": "Escaped bear keeps zoo officials on tenterhooks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}