{
    "author": [
        "S Senthalir"
    ], 
    "text": "Interaction between man and environment is crucial to understand climate change. But, has this interaction changed over the period of time? If so, how have humans modified environment to reach the present condition?\n\nTo get these answers, we need to first learn about the vegetation environment beginning from the pre-historic period. This was what the INQUA-HaBCom (International Union for Quaternary Research –Humans and the Biosphere Commission) Workshop-cum-Training Programme titled ‘Prehistory, Plants and People’ did.\n\nThe workshop jointly organised by the Sharma Centre for Heritage Education and the French Institute of Pondicherry (IFP) from January 18th to 24, brought together 10 young scholars from varied disciplines to introduce them to the use of phytoliths (i.e. optically isotropic microscopic silica form in plant tissues that persist after the decay of the plant) to understand the plant resource occupation at prehistoric sites in order to know the changing environments.\n\nThis was conducted in the framework of the ongoing project at Attirampakkam.\n\nResearcher at French Institute of Pondicherry K. Anupama said: “Detailed excavation and study of the pre-historic site in Attirampakkam in South Tamil Nadu had been carried out to understand the aspects of environment and how the hominin in the landscape adapted to the environment. This site has become the oldest South Asian pre-historic settlement. The workshop is conducted keeping this pre-historic site as a reference.”\n\nThe young scholars made pre-historic tools, which were the primary interface between prehistoric population and nature, for purpose of subsistence.\n\n“This helps them understand what went on in the minds of prehistoric population when they made these tools and ways in which they adapted to changing paleoenvironment, said historian and founder of Sharma Centre for Heritage and Education Shanti Pappu.\n\nShe added that it will help us know the changing man-nature interface over the period and build ways to tackle the challenges we face.\n\nThe research scholars were from disciplines including archaeology, ecology, genetics, geology and marine geology, geography, paleoclimate, spices research and palynology. “This workshop is to emphasise the importance of the inter-disciplinary approach in academics and try to have an understanding from different perspectives,” she said.\n\nINQUA-HaBCom workshop-cum- training programme held for young scholars", 
    "section": "national", 
    "title": "Exploring climate change via prehistory, plants and people", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}