{
    "author": [
        "M K"
    ], 
    "text": "More than 200 school children throng the snacks shop of 60-year-old K. Mohammed Ali at Udhagamandalam Market every day as he provides them free bondas. One will be surprised to know that this much of crowd has been there for more than 22 years to taste the hot potato bondas worth Rs. 10 and snacks that he offers free of cost.\n\nThe crowd is at its peak from 4 p.m. to 6 p.m. when children return home from schools and special classes. Around 100 children go there even during holidays. This is how he got the name ‘ bonda bhai ’.\n\nBorn in Coonoor, Mohammed Ali was the eldest among the siblings. He studied till 5th standard in a government school and on his way back home in the afternoon, a few snack sellers gave him and his friends a small parcel of the remains of varkey and biscuits. He worked in shops in Coonoor and Ooty before starting the snacks and tea bar in Ooty in 1983.\n\nTen years later, he wanted to give something to children who were returning home tired and hungry. “I invited a group of five children from a nearby school to the shop and gave them bondas,” he says. Word spread about bonda bhai’s gesture and the number of children coming to his shop multiplied. On weekdays, his snacks bar is frequented by around 250 children and it goes up to 300. “They can choose from the bonda and puffs among other snacks,” he adds.\n\nWhile he started giving snacks to the children of daily wagers from the government schools, children from private schools also come to his shop for the bondas. “Maybe, the taste is good,” he says with a smile.\n\nInterestingly he does not know the name of any of these children. “When I was in my mid 30s, I called them son and daughter. Now, I call them grand children,” he says.\n\nEarning about Rs. 10,000 on regular days and Rs. 15,000 a day during the tourist season, he spends 25 to 30 per cent of his earnings on free snacks. His wife Shabira also supports him. At times, the ‘children’, who are now settled, come to his shop to express their gratitude. “It is God’s work,” he says and wants to continue it till he breathes his last. Mohammed Ali is also secretary of the district’s inter-religious peace committee, for which the Collector is the chairman.\n\nK. Mohammed Ali has been giving bondas to the children free of cost", 
    "section": "national", 
    "title": "For them, he is bonda bhai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}