{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Even today, after 15 years of living with leprosy, 30-year-old Karthik* still does not tell people what is wrong with his right foot. “I work with an IT company in Chennai now, and while the top management knows, my colleagues do not. If I tell them, I will be viewed differently,” he said.\n\nAnd so, Karthik, who has lost all sensation below his right knee, has told his colleagues he was in an accident.\n\n“People with diabetes who have foot problems can openly tell others what the reason is — but I still can’t,” he said.\n\nLeprosy is a bacterial disease. While its exact mode of transmission is not known, it is believed to be transmitted through droplets in the air. It is treated with multi-drug therapy.\n\nThough it is infectious, after 24 hours of treatment, a person affected with leprosy becomes non-infectious, said Vineeta Shanker, executive director, Sasakawa India Leprosy Foundation, which works in many parts of the country.\n\nIt began when he was 15 and studying in class X, in his hometown, a village in Villupuram district.\n\n“I realised there was something wrong with my foot, and when I went to hospital, I was diagnosed with leprosy,” said Karthik. He was put on treatment for a year, but continued to face problems with foot ulcers. “In the beginning, I was not able to walk for many days. I underwent a surgery and now I wear modified footwear. I can walk, but I have to be constantly careful about ulcers,” he said.\n\nKarthik lost out on two years after class XII, and again three years after he completed his MBA in 2011, in an out of hospitals and on bed-rest.\n\n“I know many other young people with leprosy — most of them do not disclose their condition to the world. Some are even afraid to seek treatment because of the stigma and a few of them are not even treated well at home,” he said.\n\nEven for those who have been cured, finding a partner for marriage is extremely difficult,” said Karthik.\n\nIn Tamil Nadu, according to the National Leprosy Eradication Programme’s website, the prevalence rate of the disease per 10,000 population, as of March 2015 is 0.38.\n\nThe national prevalence rate per 10,000 population is 0.69. In Tamil Nadu, a total of 3,604 new cases were detected in 2014-15, with 327 in Chennai.\n\nThere are at least 14 laws in the country, clauses of which discriminate against people with leprosy, said Dr. Shanker. Stigma persists, she said, and what is needed is a massive campaign to eradicate misconceptions about the disease and to enable more people with the disease to come out and seek treatment.\n\nOn Saturday, to commemorate Anti-Leprosy Day, S. Yogalakshmi, deputy director of medical services (leprosy), Chennai, flagged off a walkathon on Marina Beach with about 300 college students, to raise awareness about the disease. “The stigma is coming down now, partly due to awareness campaigns and also because the government provides support for education and employment for people with leprosy,” said Dr. Yogalakshmi.\n\n* Name changed to protect privacy", 
    "section": "national", 
    "title": "For leprosy patients, battle against stigma continues", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}