{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ravi Sam (fourth right), Managing Director of Adwaith Lakshmi Industries Limited, takes a look at a stall after inaugurating the 64th Indian Foundry Congress organised by the Institute of Indian Foundrymen (IIF) at CODISSIA Trade Fair Complex in Coimbatore. President of IIF Krishna Samraj (third left) and Chairman of IIF-Southern Region Nithyanandan Devaraaj (second left) are in the picture. —Photo: M. Periasamy\n\nIndian foundry industry should focus on improving quality and process innovation, attract the best talent and scale-up, N.P. Thimmaiah, Managing Director and Chief Executive Officer of Meritor HVS India, said here on Friday.\n\nHe was speaking at the inaugural of the 64{+t}{+h}Indian Foundry Congress here. The industry should see why it was not number two in foundry production, next to China. It was in the third position now. With manufacturing industries getting a boost with the Make in India initiative, the potential for the foundries will also go up.\n\nSome of the challenges for the foundries are related to quality. He urged the foundries to start treating machining as a core activity and improve quality. Process innovation should be faster. The industry should change the perception about it so that it attracts the best talent and have more innovation. Nearly 85 % of the 4,500 foundries in the country are small-scale. These should scale-up production capacities. In order to nurture manufacturing, shop floor discipline is must, he said. M. Ramesh, Managing Director of Caterpillar India, said industries should constantly innovate in areas such as inventory, quality, and cost reduction.\n\n“We need to see how to participate in growth,” he said.\n\nTo be competitive companies should look at costs in all areas – production, logistics, etc. The pace of change is so fast that industries need to focus on innovation and operational excellence.\n\nAccording to K. Samaraj, president of the Institute of Indian Foundrymen, the main challenge for the Indian foundry industry is welcoming and embracing change.\n\nWith the Union Government envisaging increase in share of the manufacturing sector in the GDP from 15 per cent to 25 per cent by 2025, the potential for the foundry sector is huge and it should increase its capacity 3.5 times from the current level.\n\nNithyanandan Devaraaj, chairman-southern region of the IIF, said the last two years have been significant for the Indian foundry industry. The Foundry Development Council was formed which will benefit the sector.", 
    "section": "national", 
    "title": "Foundries urged to focus on quality", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}