{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "40 to 50 per cent posts of forest watcher, forest guard are vacant, say activists\n\nWhen a team of forest officials took a poacher to identify the place where he had buried the carcass of a tusker in Megamalai wildlife sanctuary, recently, it was quite an arduous trek.\n\n“ A forest watcher or the forest guard in-charge of one beat of forest area will find it difficult to take on such a challenging trek on a daily basis,” says an insider.\n\nThe forest watcher and forest guard are the first line of defence against forest and wildlife criminals and are vital to conservation. However, the vacancy position of these two job descriptions is in the range of 40 to 50 per cent, activists say.\n\nTo add to the woes, a sizable section of the existing frontline staff members are over 50 years of age and unable to cover their respective beats, say activists. “I have seen many of guards and watchers unable to even walk. They are incapable of offering any deterrence to wildlife or forest crimes,” says an activist down south.\n\nWhile originally their sole duty was forest protection, they have their duties outside forest areas at present like collecting loans from village forest committee members, looking for farmers to take up planting or as guides in eco-tourism projects, says a district forest officer.\n\nThe frontline staff is supposed to patrol their beats daily to catch offenders, report on invasive species, water needs and regeneration status.\n\n“We should be happy if they perambulate their beats once in a week or ten days. The vacancies are huge. One guard / watcher is in charge of two to three beats,” says a Coimbatore-based activist.\n\nOne of the reasons is that there is no regular recruitment like in the other southern States where qualified youth are recruited regularly, says an official. Similarly, the beat staffs are given two wheelers / walky-talkies, PDAs, GPS and other gadgets in the neighbouring States whereas the frontline staff here have no such gadgets. Old age also makes many reluctant to adapt to technology, a forest officer said.\n\nThe situation is better in the tiger reserves but even there the vacancies of frontline staff are in the range of 20 to 30 per cent, says a forest official.\n\nCentral funding helps the wildlife managers of tiger reserves to protect their forests better, he adds.\n\nForest officials and activists alike lament that the frontline staff protecting the forests often live in old and dilapidated quarters and their overall health, enthusiasm and morale were at the lowest ebb at present.\n\nThe case of the forester is no different. The foresters play a supervisory role over three to four beat staff and act as deputy to rangers in their duties and responsibilities. There has been no direct recruitment since long and the existing are mostly promoted and lack qualities to effectively supervise the beat staff, activists say.\n\nForesters lack basic facilities and are posted on duties mostly outside forest areas such as attending meetings and courts, they point out.\n\n( This is the first of a two-part series. The second part will look at the problems faced by the rangers and district forest officers. )\n\nExisting staff are aged above 50 years and are unable to cover their beats", 
    "section": "national", 
    "title": "Frontline staff shortage hampers conservation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}