{
    "author": [], 
    "text": "The Gift of Sight Eye Care hospital in the city would conduct glaucoma awareness run in the city, in memory of Dr. Rajasekaran, a pioneer in eye care, on February 14. The run would be conducted in four categories – 5 km run for all age groups (for boys and girls); 10 km runs for those above 15 years of age (men and women); 10 km run for persons above 40 years of age (men and women) and a 1 km walk for visually challenged persons (with attenders). Registrations for participation could be made at Dr. Varuna's Gift of Sight Eye Care, Simco Meter Road, Tiruchi. Registrations can also be done online athttp://youtoocanrun.com/races/?ee=387. There will be no on-the-spot registration, according to a release. For details, call 9786620348 or 04312459275.\n\nBSNL improving\n\ninfrastructure\n\nTo improve the quality of network, the Bharat Sanchar Nigam Limited has started erecting new mobile phone towers throughout the Tiruchi Telecom district. The BSNL has launched a campaign, Service With A Smile (SWAS), to provide best services to customers. A rally was taken out in the city on Friday to raise awareness on the services such as unlimited free calls from BSNL landline to any network from 9 p.m. to 7 a.m.; and so on.\n\nWatershed agency\n\nofficial’s visit\n\nThe Executive Direct of the Tamil Nadu Watershed Development Agency Anand Kumar inspected the inspected some of the agricultural fields in Tiruverumbur taluk on Friday and reviewed the implementation of the National Agriculture Development Programme in the district. He inspected the fields and interacted with beneficiaries who have been extended subsidy for purchase of agriculture equipment and machines.\n\nSpecial camp for correction\n\nThe special camps to make changes in ration cards organised by the district administration at the taluk level has become a huge draw and so far orders have been issued on 68,653 applications received at the camps in 10 taluks, Collector K.S.Palanisamy said. On Saturday, over 6,000 people thronged the special camp for residents in Lalgudi taluk to get changes done in their cards. Of these, 2,416 applications were for inclusion of names, 2,068 for deletions, 856 for correction of names, 767 for change of address, and 425 for corrections in address. Orders were issued on the applications during the day, Mr. Palanisamy said speaking at the camp.", 
    "section": "national", 
    "title": "Glaucoma awareness run on February 14", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}