{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Chief Minister Jayalalithaa on Friday inaugurated ‘Greater Chennai Corporation’ comprising 42 additional local bodies in Kancheepuram and Tiruvallur districts. The extended areas of Chennai were added in 2011, and have come under the administration of the Chennai Corporation since then.\n\nA government order renaming the Chennai Corporation as the Greater Chennai Corporation was actually issued in October 26, 2015 itself. The Chief Minister’s move to endorse the new nomenclature for the civic body is expected to give an impetus to infrastructure development in added areas using funding from international agencies such as World Bank.\n\nGreater Chennai Corporation officials said the change in name of the local body would make residents in added areas realise that they belong to the first city of modern India.\n\n“The need for infrastructure development in added areas is high. We can easily get grant from international agencies because of this change,” said an official of the Corporation.\n\nAdditional funding this year is likely to facilitate speedy implementation of the project to develop LED lighting in added areas. The civic body requires at least Rs.145 crore for completing the LED streetlight project in added areas.\n\nFlood mitigation projects in the Kosasthalaiyar river basin in added areas of Tiruvallur district and Kovalam basin in Kancheepuram district are expected to receive Rs.4,000 crore from international agencies.\n\nChennai was included in the list of smart cities with a number of proposals for infrastructure development. In 2011, seven municipalities, three town panchayats and 13 panchayat unions in Tiruvallur district and two municipalities, five town panchayats and 12 panchayat unions in Kancheepuram district were brought under the Chennai Corporation.\n\nThe move is expected to\n\nprovide impetus\n\nto infrastructure development", 
    "section": "national", 
    "title": "Greater Chennai Corporation unveiled", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}