{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Lower courts need not impose “harsh, onerous and burdensome” conditions while ordering return of gold jewels, cash and other valuables to their rightful claimants pending trial in theft, robbery and dacoity cases, the Madras High Court Bench here has said.\n\nJustice M. Venugopal made the observation while setting aside an order passed by a Judicial Magistrate permitting Manappuram Finance to take possession of eight kg of gold jewels on condition that it should not disburse them to customers who had pledged them with it.\n\nAgreeing with senior counsel M. Ajmal Khan, appearing for the finance firm, that the condition was “unduly harsh and impractical,” the judge referred the matter back to the magistrate with a direction to impose “reasonable, legitimate and workable terms and conditions.”\n\nThe judge pointed out that the area head of Batlagundu branch of the finance firm had lodged a police complaint last year claiming that gold jewellery weighing 13.957 kg and Rs.16.54 lakh had been robbed from the branch.\n\nSo far, the police had recovered 8.015 kg of the jewels and Rs.11.72 lakh and hence the company laid a claim before the Magistrate since the jewels had been actually been pledged with it by their owners to whom they had to be returned on repayment of loan amount. The company also stated before the Magistrate that physical possession of the jewels was not necessary for the purpose of trial and it would be sufficient to take photographs and store them on a compact disc.\n\nHowever, the Magistrate on December 16 ordered the release of jewels and cash on five conditions which included execution of a bond by the firm for Rs.1 crore, execution of another bond by one of its employees for Rs.10 lakh and an undertaking to desist from handing over the jewels to its customers.", 
    "section": "national", 
    "title": "Harsh, onerous conditions need not be imposed for return of stolen valuables: High Court", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}