{
    "author": [
        "D Madhavan"
    ], 
    "text": "The Avadi Municipality has introduced three helpline numbers for residents to call the civic authorities and report cases of manual scavenging. The helpline numbers are: 044-26554440, 944457331 and 9176103372.\n\nMunicipal officials said that the landline number (044-26554440) will be manned by an administrative staff at the Municipality between 9. 30 a.m and 5.30 p.m. on all days except Sundays. The two mobile numbers belong to sanitary officers of the municipality, Selvaraj and Prabhakar, respectively.\n\n“The initiative is aimed at involving residents in efforts to prevent such accidents and also saving precious lives. Necessary staff support for the initiative has been ensured,” said Municipal Commissioner C. Mathevannan.\n\nUnder the initiative, a team of six groups, each of which consists of four sanitary staff, including one sanitary inspector of Avadi Municipality, will inspect reported areas based on alerts. Around 1,000 sanitary workers including green workers have been sensitised against engaging manual scavengers.\n\nFurther, the helplines can also be used to register a request for cleaning of individual sceptic tanks in the presence of sanitary inspectors. At present, the Municipality consists of around 94,000 buildings. Of these buildings, 82,000 are houses. Around 8,000 buildings are wedding halls, community centres, hospitals, cinema halls and hotels. Most of the commercial buildings and industrial units are located in Paruthipattu and Thirumullavoyal within Avadi Municipality limits.\n\nThe initiative comes in the wake of recent death of four people, including three scavengers, in Thoraipakkam on OMR. As per the Prohibition of Employment As Manual Scavengers and Their Rehabilitation Act, 2013, employing manual scavengers is a cognizable offence and non-bailable. It also attracts imprisonment up to two years with a fine.\n\nUnlike within the Chennai Corporation limits, other areas that come under municipalities including Avadi, Pallavaram, Tambaram, Thiruverukadu and Pammal and other smaller local bodies in the city’s outskirts lack an underground drainage system. With lack of adequate jet-rodding and de-silting machines in smaller local bodies, residents and commercial establishments rely on cheap labour to clean drainage tanks.", 
    "section": "national", 
    "title": "Helplines set up to report manual scavenging cases", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}