{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Former AERB chief says no one knows which part will break down when\n\nOn the day when the first unit of Kudankulam Nuclear Power Plant (KNPP) resumed power generation after a gap of few months, former Chairman of the Atomic Energy Regulatory Board (AERB) A. Gopalakrishnan reiterated that the reactor was one of dangerous reactors in the country.\n\nAddressing a convention on nuclear energy organised by anti nuclear forums – Poovulagin Nanbargal and People’s Movement Against Nuclear Energy (PMANE), here on Saturday, Mr. Gopalakrishnan alleged that the components that went into the construction of the unit at Kudankulam were not checked properly for quality.\n\n“No one knows which part of the KKNPP is going to breakdown and on which day,” he said, contending that there was no proper quality check on the components used for the reactor.\n\nAs India had developed expertise in Pressurised Heavy Water Reactors (PHWRs) over the years, the VVER type reactor in Kudankulam was “considerably different” and the contractors who were involved in the KKNPP went ahead with their instincts which they had developed since the PHWR days.\n\nAERB autonomy\n\n“The responsibility for the problems at KKNPP – 1 and 2 may end up as a disputed area, with the Russians partly blaming the Indian side, since India had taken the responsibility for erection and commissioning them. All this has cast a grave question mark on the safety of the Kudankulam reactors,” he said.\n\nMr. Gopalakrishnan, who has been quite frank about his opinion on the autonomy of the AERB, said the image of the Board being independent was “more of a myth than reality.”\n\nLack of independence\n\nAfter his term as Chairman, the AERB has been headed by a long-standing Department of Atomic Energy or Nuclear Power Corporation of India Limited employee. “Since then, very scathing criticism about the lack of independence of the AERB has come formally from the International Atomic Energy Agency and Comptroller and Auditor General of India,” he said.\n\nDissent not tolerated\n\nPriya Pillai of the international NGO, Greenpeace, said the government was not tolerating voices of dissent in the country and considered it a threat to the national economic security. “Proactive narratives are deliberatively built around activists to curb dissent in the democratic space,” she said.\n\nNoted advocate Prashant Bhushan, former Navy chief Admiral L. Ramdas, PMANE convenor S.P. Udayakumar, Poovulagin Nanbargal’ s G. Sundarrajan participated.\n\nFormer AERB chief says no one knows which part will break down when", 
    "section": "national", 
    "title": "‘Kudankulam plant not safe without proper quality checks’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}