{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Kalabhairavar puja, Railway Colony, 5 p.m.\n\nThiruvalluvar Kazhagam: Discourse by Suba Saiganesan, R. Chandrasekaran and M. Vijayaraman on ‘Vallalar Koorum Mupperum Nerikal,” North Adi Street, 7 p.m.\n\nRamakrishna Math: Vivekananda jayanthi celebrations, 5 a.m. onwards, Discourse by SP. Ramachandran on ‘Viveka Chintamani’ 5.45 p.m., Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPaneeru Thirumurai Mandram: Pannisai by S.S. Mohanram, Adi Street, 7 a.m., Discourse on ‘Periapuranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar, 5 p.m.\n\nRajarajeswari Aanmeega Illakiya Mandram: 109{+t}{+h}discourse by M. Srinivasan on ‘Sanga Tamizhmalai’ Manicka Mandapam, No. 116 South Avani Moola Street, 6.35 p.m.\n\nUniversal Peace Sanchiary: Free meditation class by Sathguru Sundaramoorthi Sachidananda, No. 138 Kamarajar Road, Mariamman Teppakulam, 7 p.m.\n\nSri Swami Tatwananda Ashram: Upanishad class by Swami Samanandar, P and T Nagar, 6.45 p.m.\n\nSt. Lourdes Shrine: 96{+t}{+h}anniversary celebrations, special prayers and songs, K.Pudur, 5.30 p.m.\n\nChurch of Christ: Sunday service and special Bible study, Devamanickam and M.S. Raja address, Viswasapuri, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nThe American College: Sunday Vespers Service, Dr. S. Wellington and Dr. J. Jebaraj address, Jubilee chapel, 6 p.m.\n\nSt. Joseph’s Church: Madurai Pallium celebration, Rev. Antony Pappusamy Archbishop of Madurai receives Pallium blessed by Pope Francis, St. Peter’s Basilica Rome, Gnanaolivupuram church, 5.30 p.m.\n\nCULTURE\n\nArulgnana Sabai: 191{+s}{+t}meeting, Nanchil Sampath speaks on “Villum Sollum,” Thiagarajar College of Engineering campus, 6.30 p.m.\n\nThe Divine Life Society: Satsang bhajans, Swami Sivananda Sundarananda presides, Pulavar Kishore speaks on ‘Thirukural,’ Meenakshi Temple, South Adi Street, 7 p.m.\n\nYadava Cultural Association: Monthly meeting, V. Veeranan president presides, M. Karuppanalagu secretary address, Min Nagar, K. Pudur, 6 p.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nP.K.N. Matriculation Higher Secondary School: 35{+t}{+h}sports day and annual day celebrations, S. Annaraj, Inspector of Police, Tirumangalam, town chief guest, 7.45 a.m., R. Anbukkarasi, Principal, Tamil Nadu Polytechnic College, Madurai, chief guest, school president P. Senthilrajan Nadar presides, school campus, 5.30 p.m.\n\nVirudhunagar T.S.M. Manicka Nadar-Janaki Ammal HSS: 40{+t}{+h}Ruby annual day, Dr. K. Sarukesi, Dean, Kamaraj College of Engineering and Technology, Virudhunagar, chief guest, L.A.M.K. auditorium, New Ramnad Road, 4.15 p.m.\n\nPandugudi Sri Lakshmi Narayana Vidyalaya: ‘Kalpavirukshaha’ – fifth annual day, S. Narayanan, chairman, presides, S. Kalyanaraman, principal, Kendriya Vidyalaya, Karaikudi, chief guest, A. Valayapatti, Alagarkoil, 3 p.m.\n\nSakthi Vidiyal: 22{+n}{+d}anniversary celebrations, S. Dhanasekara Pandian, Deputy Director (Social Defence Department) & District Child Protection Officer, chief guest, Devaneyan, Director, Thozhamai, Chennai, felicitates, IMA Hall, Panagal Road, 3 p.m.\n\nSumathi Hospital: Dr. S. Manorama first year memorial multi-speciality mega camp, Anna Nagar, 10 a.m.\n\nSruthi Physiotherapy Clinic: Free bone mineral density camp in association with S.P. Ortho Centre, opp. SVN College, Nagamalai Pudukottai, 10 a.m.\n\nPuratchi Kavingnar Mandram: Condolence meeting for Tamizhannal, Mandram president P. Varadarajan presides, R. Illankumaran addresses, Maniammai Primary School, No. 75 North Masi Street, 5 p.m.\n\nSivananda Tapovanam: 500{+t}{+h}Sivananda free general medical camp, R. Muthiah, DGM, Indian Bank, presides, Dr. S. Vadivelmurugan, inaugurates, Thoppur, 8 a.m.\n\nRamya Neuro Hospital: Neuro medical exhibition, IMA Hall, Medical College campus, Panagal Road, 9 a.m. to 1 p.m.\n\nSBOA Matric Higher Secondary School: Seven-day NSS camp, temple campus cleaning, 8 a.m., talk on general medicine by Dr. K. Murugesh Kumar, Melakuyilkudi community centre, 2 p.m.\n\nVivekananda College: Uzhavara pani by students at one-day camp in Vadipatti Pon Perumal Temple, 8 a.m.\n\nSPJ Matriculation HSS: 10{+t}{+h}annual day celebrations, second day event, V.V. Rajan Chellappa Mayor of Madurai chief guest, school premises, Avaniapuram, 5 p.m.\n\nLions Club of Madurai Pandyan: Executive committee meeting and general body meeting, Hotel Rajadhane, KK Nagar, 6.35 p.m.\n\nAlcoholics Anonymous: Meeting, Justice V.R.Krishna Iyer Hall, KK Nagar, 7 p.m., Alfred Noble Mat. HSS, Tirunagar, 8{+t}{+h}bus stop, 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}