{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "If the instructions that Mayor Saidai Duraisamy gave them on Saturday are an indication, councillors of all wards would be kept on their toes in the weeks to come.\n\nDuring the Corporation council meeting, the mayor urged them to monitor the implementation of civic projects on a daily basis.\n\nThe sense of urgency is said to be born out of an effort to complete key civic infrastructure projects ahead of Assembly elections.\n\nOfficials from all the departments of Greater Chennai Corporation have been directed to provide data about the deadlines for completion of projects in a ward to the respective councillor.\n\n“Each of the councillors should make a list of works that are under way, noting down the deadline and the progress made on a daily basis. They should bring any delay to the notice of the Corporation. We will take action against the contractors and the officials concerned,” the Mayor said.\n\nAIADMK Councillor V. Sukumar Babu said work on roads damaged in the floods had started. “Cement concrete road work has resumed. We have requested officials to speed up the work in each neighbourhood,” said Mr. Babu.\n\nDMK leader Subash Chandra Bose said Corporation officials were yet to start work in many parts of north Chennai. “They have not given the list of works to councillors in some wards,” said Mr. Bose. Congress Councillor P. V. Tamil Selvan, who was evicted from the council hall on Saturday for protesting against observations made by the Mayor on previous elections, said the Council meeting did not discuss problems of residents affected by the delay in completion of road works.\n\n“Improper milling of roads is causing pollution in some areas. Many residents are complaining,” said Mr. Tamilselvan. Work on more than 4000 roads is expected to be taken up ahead of the notification of Assembly elections.", 
    "section": "national", 
    "title": "Mayor talks tough, wants to keep all councillors on a tight leash", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}