{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Loans to be extended to 15,000 small traders in Tiruchi district\n\nThe Department of Cooperatives, which is the nodal agency for implementing Amma micro credit scheme, plans to extend loans to at least 15,000 small time traders in the district.\n\nThe scheme, which was mainly aimed at covering the traders of flood-hit districts such as Chennai, Cuddalore, Tiruvallur, and Tuticorin, is being implemented in other districts also.\n\nShiv Das Meena, Principal Secretary, Food, Cooperative and Consumer Protection, Jayashree Muralidharan, Registrar of Cooperative Societies, visited Tiruchi on Saturday to inspect the implementation of the scheme, which was recently inaugurated by the Chief Minister Jayalalithaa.\n\nAccompanied by K.C. Ravichandran, Joint Registrar of Cooperatives, Tiruchi, they met the beneficiaries at Kattur and enquired about their trade and business.\n\nThey asked them to utilise the opportunity to use the scheme to build capital. They asked the officials to identify right beneficiaries for the scheme. Sources told The Hindu that senior officials of the government had directed the district-level officials to give priority to the scheme. It had been decided to cover as many beneficiaries as possible within the next few weeks. So far, 600 beneficiaries had been extended Rs. 5,000 each. A sum of Rs.30 lakh had been distributed.\n\nBesides the Tiruchi District Central Cooperative Bank (TDCCB), urban cooperative banks in Musiri, Lalgudi, and Manapparai, city cooperative banks in Puthur, Irudhayapuram, Srirangam, and Varaganeri and 32 branches of TDCCB would be involved in the drive. Special camps would be conducted at crowded places to receive applications for Amma micro credit scheme.\n\nThe officials would create awareness among the people on the importance of availing the scheme.\n\nSmall-time traders like those selling fruits, vegetables vendors, tea shops owners, fruit stalls traders, snack sellers or petty shop owners would be covered. The applications would be processed on the spot by the officials of the respective banks.\n\nThe selected beneficiaries could get interest-free loans of up to Rs. 5,000.\n\nCREDIT FLOW\n\nA high-level team visits Tiruchi to give a thrust to the scheme", 
    "section": "national", 
    "title": "Micro credit scheme gets a push", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}