{
    "author": [
        "B Kolappan"
    ], 
    "text": "Anbumani says PMK will lead alliance in State and BJP can join it\n\nWe have a long-term plan for the party in Tamil Nadu politics, says Anbumani Ramadoss.\n\nThe revival of the BJP-led National Democratic Alliance (NDA) is unlikely to take shape the way the BJP expects it to happen, as the PMK, one of the possible partners, is firm that it will be the leader of the alliance in the State.\n\n“We have been saying this repeatedly. I once again want to reiterate that the BJP can join the alliance under the PMK,” the party's Chief Ministerial candidate Anbumani Ramadoss told The Hindu .\n\nDr. Anbumani also rejected reports that his party was in touch with the BJP and that the PMK had been allotted 70 seats as part of the electoral arrangement.\n\n“There is no basis for all these stories. I have decided to contest in the Assembly elections and we have a long-term plan for the party in Tamil Nadu politics. Our agenda for development of Tamil Nadu was not prepared just for one election,” he said.\n\nDr. Anbumani, who was one of the two non-AIADMK candidates, the other being BJP’s Pon. Radhakrishnan, to win a seat in the 2014 Lok Sabha polls, said the biggest mistake the PMK had made in Tamil Nadu politics was to change its loyalty from the DMK to the AIADMK for a few seats.\n\n“When we realised this, it was too late. We could win four seats on our own even two decades ago. If we had been consistent in our plan to go it alone in elections, we would have emerged as an alternative to the Dravidian parties long ago,” he said.\n\nEven assuming that the BJP is ready to play the role of junior partners to the PMK, another major prospective constituent Desiya Murpokku Dravida Kazhagam (DMDK), led by actor Vijayakant, will certainly not concede to the dictates of the PMK.\n\nThe Modi factor that brought together the mutually antagonistic species – the PMK, the DMDK and Vaiko’s MDMK – in the 2014 Lok Sabha polls will not work as the stakes of regional parties are higher in the Assembly elections.\n\nMr Vaiko has already become a key player of the People’s Welfare Front (PWF) comprising the Left parties and the Viduthalai Chiruthaikal Katchi (VCK).\n\nThe trump card\n\nAs Mr. Vijayakant has emerged as a trump card in the poll game, others are also banking on him and the DMK has opened channels to rope him in.\n\n“You know he is a tough political leader to deal with. We have approached him through a different source. Only after committing him to the alliance can we talk to other political parties. Otherwise seat-sharing arrangements will not be smooth,” a senior DMK leader said.\n\nRejects reports that PMK had been allotted 70 seats by BJP as part of poll arrangement", 
    "section": "national", 
    "title": "NDA revival in Tamil Nadu unlikely to go the BJP way", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}