{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The simplification of police verification procedure for issue of passport and the launch of a mobile application has helped expedite submission of the reports, S. Lingasamy, Regional Passport Officer, Tiruchi, has said.\n\nPointing out that Police Verification (PV) has been an integral part of passport issuance process since its inception, Mr. Lingasamy said the modalities of PV have undergone various changes from time to time, though the main objective of ascertaining the applicant’s identity, citizenship, and absence of criminal antecedents have been the same.\n\nUnder the Passport Seva Project, the Ministry of External Affairs has streamlined Police Verification System by digitally integrating 685 of 731 police districts in the country. This led to overall reduction in the number of days taken to complete police verification process to 34 days in 2015, as against 42 days in 2014 and 49 days in 2013.\n\nTo simplify the process, the Ministry of External Affairs has decided that henceforth normal passport applications of all first-time applicants furnishing Aadhaar, Electoral Photo Identity Card (EPIC), Permanent Account Number (PAN) card and an affidavit in the format of Annexure-I will be processed on post-police verification basis, enabling faster issue of passport, without payment of any additional fees. However this would be subject to successful online validation of Aadhaar number. In addition, EPIC and PAN may also be validated, if required, from the respective databases.\n\nThe Ministry has launched mPassport Police App for speedy submission of Police Verification Report (PVR). The App would facilitate the field-level verification officers to directly capture the PV report into the system digitally. With the launch of this App, there would be no need to download and print the physical personal particulars form and questionnaire, resulting in paperless end-to-end digital flow of the PV process. This would help reduce the time required for completion of PVR and achieve the desired time limit of 21 days, Mr. Lingasamy said.\n\nAppointment\n\nThe Ministry has also introduced a new provision which would allow applicants to choose any appointment date from the earliest five available dates (working days), while scheduling/rescheduling an appointment online for passport-related services.\n\nTo avail the facility, applicants may fill their personal particulars online, click on “Pay and Schedule Appointment link.” After the selection of payment mode, applicants will be redirected to appointment screen. They may choose any of their preferred PSK under the jurisdiction of the respective Regional Passport Office (RPO). At the next step, applicants will be redirected to Pay and Book Appointment Screen allowing them to choose a date from the displayed calendar. The calendar will highlight latest five days available for the selected PSK and applicants can indicate the date of their choice, Mr. Lingasamy added.", 
    "section": "national", 
    "title": "Norms relaxed for first-time passport applicants", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}