{
    "author": [
        "Staff Reporter"
    ], 
    "text": "‘Puducherry has been pushed back by 25 years due to lack of development in any sector’\n\nThe opposition Congress on Saturday charged that the four-and-a-half-year rule of the AINRC Government had pushed Puducherry backwards by over 25 years due to lack of perceptible development in any sector.\n\nFloral tributes\n\nSpeaking after paying floral tributes to the portrait of Mahatma Gandhi at the Congress office here, Puducherry Pradesh Congress president A. Namassivayam said that Puducherry had a record of being a peaceful Union Territory in the past. But now law and order has deteriorated and even women staying at home have no security under the current rule of AINRC.\n\nMr. Namassivayam said that the Government was distributing freebies with an eye on the forthcoming Assembly elections.\n\nPeople cannot be taken for granted since they were seething with resentment over the deficiencies and poor functioning of the Government. He said that Ministers and MLAs do not get proper respect.\n\nRetrenchment\n\nThe ruling AINRC had retrenched over 4,500 employees appointed during the previous Congress regime on the pretext of lack of funds.\n\nBut the Chief Minister was now appointing his own supporters in various undertakings, he said.\n\nMr. Namassivayam also alleged that the Chief Minister had a meeting with the Lieutenant Governor with a request to ensure that officials of his choice were posted in the polling booths during the forthcoming assembly elections.\n\nThe Government is discriminating constituencies held by the opposition parties in distribution of freebies. People are ready to support the Congress in the election and it is for the cadres and leaders to consolidate the vote bank and function in unity so that Congress rule could be restored in the UT in 2016.\n\nTaking a dig at the BJP led National Democratic Alliance (NDA) at the Centre, he said that communalism was gaining precedence at the hands of the BJP which is totally against the policies and ideals of Mahatma Gandhi.\n\nFormer Union Minister for State V. Narayanasamy and Leader of Opposition V. Vaithilingam participated.", 
    "section": "national", 
    "title": "Opposition slams AINRC govt. rule", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}