{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Members of various teachers' associations staged a road blockade in front of the Collectorate in Nagercoil on Saturday.\n\nAs many as 154 teachers including 35 women teachers were arrested for blocking the road in front of the Collectorate on Saturday as part of their State-wide agitation to press their 15-point charter of demands. Traffic on the Nagercoil-Trivandrum National Highway was affected for over 15 minutes near the Collectorate.\n\nThe agitation was presided over by V.L. Benin Devakumar, General Secretary, Tamil Pandits Association and C. Balachandran, General Secretary, Tamil Nadu Primary School Teachers’ Federation.\n\nSpeaking at the agitation, leaders of various teachers’ associations demanded reverting to the old pension scheme; union government pay scale and benefits; regularisation of services of those appointed between 1986 and 1988 on contract basis, and those appointed between 2004 and 2006 under consolidated pay scales from the date of their employment, merging 50 per cent DA with basic pay etc.\n\nThe State Government was implementing 14 welfare programmes for students of primary schools to higher secondary schools.\n\nThe involvement of headmasters and teachers for the implementation of these programmes affected teaching activities, they said. The associations demanded appointment of special personnel for the work.\n\nThe government should also do away with its move to close down primary schools, they said.\n\nC. Vallivelu, General Secretary, Tamil Nadu Post Graduate Teachers’ Association (TNPGTA) participated.\n\nDespite all efforts, the teachers squatted on the road and staged an agitation after raising slogans for a while. The protesting teachers were arrested by a team of police personnel led by Nagercoil Town DSP T. Eswaran. All of them were taken to a private marriage hall and released in the evening.", 
    "section": "national", 
    "title": "Plea for Central government pay, old pension scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}