{
    "author": [
        "S Senthalir"
    ], 
    "text": "Simple repairs to emergency vehicles take nearly six months\n\nThe ambulance vans awaiting repairs parked at the Indira Gandhi Government General Hospital and Post Graduate Institute in Puducherry on Saturday.— Photo: S.S. Kumar\n\nAn ambulance meant to shift critically ill-patients from Indira Gandhi Government General Hospital to Jipmer or hospitals in Chennai is lying idle for the past two-and-half months waiting for clearance to be repaired.\n\nIt requires only Rs. 3,500 to repair the clutch cylinder of this ambulance that has worn out. The other vehicle – a Qualis used by the doctors requires a new self-starter that would cost Rs. 2,500.\n\nBut the cumbersome bureaucratic procedures are delaying the sanction of this required amount to carry out repair works.\n\nWell-equipped\n\nAn official in the hospital lamented: “This ambulance is well-equipped to quickly shift a critical patient and all that needs to be done is to repair the clutch cylinder. When moving the patients to Chennai, they are only charged Rs.5 per km. This would come up to Rs. 1,500 or Rs. 1,600 per patient. But, it becomes very expensive for people taking private vehicles since they charge up to Rs. 12,000 to move the patients to Chennai.”\n\nIt would be impossible for people from economically poor background to spend such exorbitant amount on ambulance.\n\nThe procedure to repair a vehicle begins by getting a no-objection certificate (NOC) and RRC from a government-run workshop. After assessing the extent of damage, the cost incurred towards repairing would be given to the hospital. The file would be sent to Assistant Engineer (AE) and then to Junior Engineer (JE) in the RTO office. It has to come back from the RTO office.\n\nOnce the director (health) sanctions the amount, the file would be sent to the secretariat (health) and then to the finance department.\n\nThis procedure will take at least five to six months to complete, causing inconvenience to the impoverished people dependent on this service. There are only six vehicles which include ambulances and also vehicles used by doctors at the Indira Gandhi Government General Hospital and Postgraduate Institute.\n\nIn 2001, they had 16 vehicles. Out of the six vehicles present now, only three are working. The hospital has not added any new vehicles for the past 10 years.\n\nOn an average, at least two to three patients in a day would need the ambulance to be moved to Chennai or Jipmer or Rajiv Gandhi Women and Children Hospital.\n\nWhen asked about the ambulance service, Director of Health and Family Welfare Services K.V. Raman said that there were enough 108 ambulance services.\n\nThese vehicles are all strategically placed at the eight primary health centres (PHCs). The 108 services are present at Ariyur, Karaikalampakkam, Katterikuppam, Thavalakuppam, Bahour, Kalapet, Nettapakkam, and Medical College.\n\nHowever, the National Health Mission that runs the 108 ambulance services provide services mainly to pregnant women, referral cases sent to the Indira Gandhi Government General Hospital, road accidents and snake bites.\n\nIt is the vehicles in the GH which are used to move patients from Indira Gandhi Government General Hospital to other hospitals including those in Chennai.\n\nThese procedural delays are adding to the burden of the patients who cannot afford expensive private ambulance services. The repair work should be carried out faster to enable better services during emergencies.\n\nOne has get a no-objection certificate and RRC from a govt.-run workshop for repairs", 
    "section": "national", 
    "title": "Procedural delays render ambulance service immobile", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}