{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says it has good infrastructure such as stadiums and sports hostels\n\nThe district is poised to emerge as a sports hub with good infrastructure with the establishment of stadiums for cricket, basketball, indoor stadiums for carrom and chess and sports hostels, Collector S. Natarajan has said.\n\nAddressing the inaugural ceremony of the 61st National School Carrom Championship for boys and girls at Syed Ammal Engineering College near here on Saturday, he said that after setting up a world-class AstroTurf hockey stadium at a cost of Rs. 6.50 crore, the district administration was creating various facilities on a total outlay of about Rs. 2 crore.\n\nThe district administration allotted 14 acres of land for establishing a cricket stadium near the University College of Engineering at Pullangudi at a cost of Rs. 82 lakh and a basketball stadium and indoor carrom and chess stadiums at Seethakathi Sethupathi Sports Stadium on a total outlay of Rs. 63 lakh.\n\nSports hostels for hockey and cricket were also being established at a cost of Rs. 55 lakh, he said. Thanks to the Chief Minister’s encouragement to sports and interest shown by S. Sundararaj, Minister for Sports and Youth Welfare, Ramanathapuram was poised to emerge as the district with good sports infrastructure, the Collector said.\n\nA. Anwar Raja, MP, appealed to the School Games Federation of India (SGFI) to host national-level football, hockey and kabaddi championships also in the district. He congratulated the Tamil Nadu School Education Department for hosting the SGFI’s championship in the district for the first time.\n\nS. Prasath, District Instructor of Physical Education, said that 259 boys and girls from 11 States and Union Territories were taking part in the five-day championship, which would draw to a close on February 3. Contingents from Delhi and Kerala were conspicuous by their absence.\n\nAfter the boys and girls presented an impressive march past, the Collector inaugurated the championship by playing a board with Mr. Anwar Raja. The participants took out a colourful ‘Players’ introduction rally’ at Aranmanai in the evening.\n\nChief Educational Officer Jayakannu, Tamil Nadu hockey unit president Chelladurai Abdullah, Syed Ammal Engineering College correspondent Chinnadurai Abdullah and Tamil Nadu Chief Instructor of Physical Education M. Kalaiselvan were present.", 
    "section": "national", 
    "title": "Ramnad poised to emerge as a sports centre: Collector", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}