{
    "author": [
        "S Senthalir"
    ], 
    "text": "D. Saravanan, Executive of Aranya Forest and Sanctuary, addresses the students of Pondicherry Engineering College. The students going around the sanctuary near Puducherry.— Photos: S.S. Kumar\n\nStudent volunteers with Aranya plan to reinvigorate Eco Clubs for conserving environment\n\nWho could ever refuse to listen to chirpy birds or watch Crimson Rose butterflies? It is a pleasure to the senses to take a stroll through the rich green indigenous trees. Away from the hustle and bustle of city life, a serene forest with rich flora and fauna welcomes you about 12km away from Puducherry. Aranya Forest and Sanctuary flanked by Ousteri Lake to its north west, is spread over 20 sqkm.\n\nB. Seenu, first year B.Com student of Achariya Arts and Science College and G. Vijayakumar, second year B. Tech (Computer Science) of Sri Venkateswara College of Engineering and Technology, take time off from academic work to guide anyone who visits Aranya through the 40 hectares with 36,000 trees.\n\nPassionate about working in Aranya, Mr. Vijayakumar says: “We visit the place every weekend and even during vacations. Inspired by the activities of D. Saravanan, executive, Aranya Forest and Sanctuary, we along with many of our school mates started visiting the sanctuary regularly.”\n\nThey are part of Santhi Animal Welfare and Wild Life Conservation Trust and work with Aranya in conservation of plants and wildlife.\n\nThe 15-member team is divided into three groups – for field activities, education and research.\n\nThe role of education team is to promulgate information on environment among schools and colleges; the field activities team does the practical part of planting saplings and the research team conducts research and document various flora and fauna.\n\nNearly 3000 students visit Aranya Forest and Sanctuary every year. “The number increases when three-day camps are held here. I started working with school and college students from 1989. The main target group would be students between the age group of 12 to 14. I started Eco Clubs in the schools in 14 villages,” said Mr. Saravanan.\n\nHe added that students from the Eco Clubs have not only planted saplings but also had actively prevented felling of trees in their villages.\n\nThe Eco Club members have participated in the conservation of biodiversity in villages close to Ousteri Lake.\n\nThe 15-member team is aggressively reaching out to more schools and colleges every month. “We conduct two to three awareness programmes in a month and interact with at least 60 to 100 students. Many volunteers join after the interaction programmes and start work with us after that,” says Mr. Seenu.\n\nThe students not only reach out to the school children, they also prepare information material and discuss it with them.\n\n“Mr. Saravanan taught us on biodiversity. Learning from him and our seniors, we started to teach students not only in schools but also medical and engineering colleges,” he added.\n\nAsked if their family supports their work, they cheerfully say that their family members help them now though they had to face resistance initially. Plans are afoot to reinvigorate the Eco Clubs and involve many more students in conserving environment.\n\nEnthused to create more green spaces, Aranya Forest and Sanctuary is resolved to create more Eco Clubs in schools across Puducherry.", 
    "section": "national", 
    "title": "Ready to share their passion for trees", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}