{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMK treasurer M.K. Stalin said if the DMK is elected to power, its government would formulate a start-up policy for the IT sector, adding that the future of the State’s growth depended on entrepreneurship and innovative companies.\n\nDuring a Town Hall meeting with IT professionals as part of his Namakku Naamey campaign, Mr. Stalin stressed the need for creating an environment where ideas of IT professionals could be nourished.\n\n“We will encourage start-up accelerators and incubators in Chennai so that the city becomes the next startup hub of the country. The DMK will introduce single-window clearance for entrepreneurs to set up companies,” he said.\n\nMr. Stalin said the DMK would take advantage of the presence of urbanised Tier II and Tier III cities to ensure that IT becomes a driver for growth, while making efforts to see that Tiruchi, Madurai, Salem, Coimbatore and Tirunelveli were also developed as IT hubs.“We will lay emphasis on increasing employability through vocational training and skill development. For this, the integration of training for corporate employment needs to percolate well into our education system, especially to empower the vast number of first-generation undergraduates who seek employment in our State,” he said.\n\nMr. Stalin said though the IT sector had greatly empowered women, who had entered the workforce through these companies, their safety was an important issue.\n\n“The DMK will ensure that specific guidelines for safety of women in the IT sector are mandated and followed,” he said. Reiterating that Tamil Nadu needed a Media Park with high-technology centres where world-class companies could develop State-of-the-art multimedia, animation and graphics products and services, he said the DMK government would push the thrust beyond generic IT parks to niche technology work spaces.", 
    "section": "national", 
    "title": "Stalin promises start-up policy for IT sector", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}