{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CII and Yi join hands to organise start-up idea contest for youths\n\nThe Confederation of Indian Industry and Young Indians (Yi) will jointly conduct a start-up idea contest for youths, particularly the students, interested in launching industrial ventures.\n\nThe contest titled “Ozhimayam’ is organised with the objective of promoting innovation, entrepreneurship and skill development initiatives among the younger generation, who have novel ideas on launching industrial ventures, but could not achieve the same due to various constraints including lack of funds.\n\nThe event will be powered by Native Angel Network, Madurai.\n\nP. Vimalan, vice-chairman, CII Salem, and R. Sivarajah, founder and president, Native Angles Network, told presspersons here on Monday, that te entrepreneurial eco-system in Salem and encourage the students to take up the culture of entrepreneurship.\n\nThey said that “Ozhimayam” will identify potential venture ideas from serious mainstream entrepreneurs for mentoring and funding support and also to promote the culture of innovation and entrepreneurship among the student community.\n\nMr. Sivarajah said that the Centre has kick-started special policies towards encouraging industrial development. This is a great opportunity for budding entrepreneurs to take their ventures to the next level, while students get an opportunity to showcase their ideas on a platform which could help them achieve great heights through alternative career opportunities.\n\nThe CII and Yi will assist aspiring entrepreneurs to harness the benefits of these schemes. He said that the CII and Ci have already launched this campaign with the assistance of Native Angel Network in Madurai, Tiruchi and Coimbatore districts, and will be launching the same in Erode and Salem districts.\n\nAbout six projects have already been finalised and a capital of Rs. 2.1 crore has already been sanctioned. While Rs. 60 lakhs had already been disbursed, the rest is under the proposal. The Native Angles Network will stake a share in the business before sanctioning the funds.\n\nThe contest is being organised as two parallel streams and applications will be accepted from serious mainstream entrepreneurs and students. They will be processed separately.\n\nThe entries can be submitted atwww.ozhimayam.comand the last date for submission will be February 10. Boot camp session will be organised on February 12 and the last date for the submission of the business plan is February 20.\n\nThe shortlisted entries will be called for preliminary evaluation sessions at Salem on February 23. The ten outstanding entries in each category will be called for the finals scheduled on February 26.\n\nThe entries should be submitted atwww.ozhimayam.\n\ncom on or before February 10", 
    "section": "national", 
    "title": "Submit business plan, get financial support", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}