{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The idea is to ensure continuity and not disturb the organisation ahead of the Assembly polls, says a leader.\n\nBJP Tamil Nadu president Tamilisai Soundararajan is all set to get a second term in office as the high command has decided to ensure continuity in leadership in the State ahead of Assembly elections.\n\nParty sources said a formal announcement of a second term for Ms. Soundararajan is likely to be made in the next few days. However, the decision to award her another term was communicated to senior leaders at a high-level meeting in Coimbatore on Friday that had the presence of national organising secretary Ram Lal.\n\nA doctor by profession, Ms. Soundararajan took over her as president in mid-2014 after the BJP’s phenomenal victory in the Lok Sabha elections, replacing Union Minister Pon. Radhakrishnan since the party constitution bars leaders from holding dual positions.\n\nWith a second term, she would be at the helm for three years. “The whole idea was to ensure continuity and not disturb the organisation ahead of the Assembly polls. Also, Ms. Soundararajan has been very vocal and has put the party on a solid platform in the media,” a leader said.\n\nAlso to her credit was the highly successful membership drive last year with the party claiming to have enrolled over 50 lakh persons. Sources added that Ms. Soundararajan also decentralised decision-making and provided larger roles to district secretaries. “This helped get more booth-level functionaries to strengthen our election machinery,” the leader said.\n\nMs. Soundararajan was also the most vocal critic of the AIADMK government in the BJP.\n\nVisu joins BJP\n\nMeanwhile, noted Tamil film director and actor Visu joined the BJP on Saturday in the presence of Mr. Radhakrishnan. The actor was earlier with the AIADMK.\n\nA formal announcement\n\nis likely to be\n\nmade in\n\na few days", 
    "section": "national", 
    "title": "Tamilisai set to get second term", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}