{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Teachers affiliated to JACTO staging agitation in front of the Collectorate in Salem city on Saturday. (right) Teachers stage a demonstration in Erode on Saturday.—Photos: E. Lakshmi Narayanan and M. GOVARTHAN\n\nThe City Police took into preventive custody 1,176 teachers, including 663 women, affiliated to Joint Action Committee of Teachers Organisations (JACTO), when they attempted to organise a road roko agitation in front of the Collectorate here on Saturday to press for 15-point charter of demands.\n\nThis is the first day of the three-day agitation schedule of the JACTO.\n\nThey urged the Government to extend all benefits announced for the teachers of the Central Government schools as per the recommendation of the Sixth Pay Commission.\n\nThey demanded the government to regularise the services of the teachers appointed during 2004-06 on consolidated scale of pay from the date of their appointment and provide time-bound pay scale to them; do away with the Teachers Eligibility Test and appointment of teaches on seniority basis; and withdrawal of new pension scheme. They also urged the government to do away with its move of closing down the government schools citing the student strength. The government should continue to run all the government schools. Murugesan, high-level committee member of JACTO, speaking to presspersons appealed to the State Government to come forward to hold negotiations with the representatives of JACTO on their just demands immediately. The teachers will show their resentment through ballots in the Assembly elections, if their demands were not conceded, he added.\n\nNAMAKKAL: A total of 753 teachers belonging to JACTO, including 370 women, were rounded up when they attempted picketing at clock tower junction in the town. S. Muthusamy, State general secretary of the Tamil Nadu Aasiriyar Koottani, and P. Elangovan, State president of the TN Graduate Teachers Kazhagam, led the agitation, police said.", 
    "section": "national", 
    "title": "Teachers taken into preventive custody", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}