{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Around 650 police personnel would be deployed for ensuring smooth flow of traffic in the city during the visit of Prime Minister Narendra Modi on February 2. The police said that traffic will be closed on Kamaraj Road from 12 noon till the Prime Minister leaves the ESI hospital premises. Vehicles from Avinashi Road and Trichy Road will not be allowed to enter or leave Kamaraj Road.\n\nVehicles of Bharatiya Janata Party cadre from Mettupalayam heading to the public meeting venue will be diverted through Thudiyalur to Kalapatti Road and Vilankurichi Road to the place behind the meeting venue at Codissia. Vehicles of the party cadre from Sathy Road would be diverted in the above said route.\n\nVehicles from Avinashi Road would be diverted to the parking place behind the meeting venue by taking right from the Sitra Junction. Vehicles from Coimbatore and Pollachi heading to the meeting venue through Avinashi Road would be diverted to the parking vehicle place through the Tidel Park Road.\n\nHeavy vehicles would be allowed through out the stretch of Avinashi Road (in the city) on that day. The police said that the stretch from Peelamedu to Circuit House would be closed if Mr. Modi chooses to take a short break to the Circuit House.\n\nMeanwhile, 22 political parties and organisations have planned to show black flags to the Prime Minister, condemning BJP’s alleged anti-Dalit stand.\n\nResidents and cadre attached to CPI (M) have threatened to picket a Tasmac outlet opposite the government hospital to be inaugurated by Mr. Modi, as their repeated pleas to close down the shop have not yielded the desired results.\n\nThe police said that they have not given permission for such activities and pointed out that persons organising such protests could be arrested as a precautionary measure ahead of the Mr. Modi’s visit.", 
    "section": "national", 
    "title": "Traffic diversions for PM’s visit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}