{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Central Crime Branch (CCB) of city police arrested a woman on Friday for allegedly cheating a Chennai-based businessman to a tune of Rs. 5.12 crore in a land deal.\n\nThe police also registered a case against two persons in this connection.\n\nAccording to the police, one of the accused Vidhya Balachandran (51) entered into a 20 years lease agreement with V.S. Veerasamy of Ramanathapuram for a property worth several crore on Oppanakara Street.\n\nA leading jewellery outlet had occupied the building and later they vacated the premises a few months ago.\n\nLoan from bank\n\nThe police said the woman had pledged the building and obtained a loan from a bank. But, she could not repay it as there was no source of income from the building that remained unoccupied after the jewellery outlet moved out.\n\nNotice sent\n\nInquiries revealed that the bank sent notice to auction the building.\n\nThe accused approached S. Ashok of Chennai, who owns a chain of textile of outlets across the state, including one on Oppanakara Street, to clear the loans.\n\nThe police said that the businessman gave her Rs. 1.5 crore on September 19, 2015 and Rs. 3.62 crore later and signed an agreement with the woman, according to which the money should be returned or the building be registered in the name of the businessman before December 19, 2015.\n\nIt was learnt that Vidhya and her family allegedly refused to repay the money or finalise the property registration formalities, following which Mr. Ashok moved Judicial Magistrate-V of the Coimbatore Court and got a court direction in his favour on Thursday.\n\nBased on a direction from the Judicial Magistrate-V of the Coimbatore Court a case was registered against Vidhya Balachandran, her brother V. Vivekanandh and father C. Venkatesh under sections 120(b) (criminal conspiracy), 406 (criminal breach of trust) and under 420 (cheating and dishonestly inducing delivery of property) of the Indian Penal Code.\n\nThe woman was arrested and inquiries are under way on the role of Venkatesh and Vivekanandh.", 
    "section": "national", 
    "title": "Woman held for cheating businessman", 
    "subsection": "tamilnadu", 
    "date": "2016-01-31"
}