{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "The extremists have roped in units of ‘Company-10’, trained to kill with precision, from Chhattisgarh to execute the plan\n\nLeft-wing extremists have reportedly brought in units of ‘Company-10’ from Chhattisgarh, each with a cadre strength of 30 men trained in killing with precision. Picture shows a meeting of Maoists in Dantewada.— File photo\n\nContrary to the Maharashtra government’s recent claim that left-wing extremism is on the wane, the State faces a renewed red cadre that has vowed to eliminate 37 senior police officers and informants in 2016.\n\nThe latest hit list has been issued by Naxals in response to the State’s lucrative surrender policy, which, the government claims, has taken off in a big way resulting in a substantial drop in violence.\n\nBut the latest data show that this claim could be exaggerated. Intelligence inputs have revealed that to execute the hit list, the extremists have brought in several units of ‘Company-10’ from Chhattisgarh, each with a cadre strength of 30 men trained in killing with precision.\n\n“This [the latest hit list] is a matter of serious concern for the State, even as inputs show new strategies are being adopted to attract youth with fresh vigour,” an intelligence note in possession of The Hindu reads.\n\nCounter-strategy\n\nAs part of the Naxal revival policy, documents recovered recently by Gadchiroli Police show that plans are afoot to win the surrendered cadres back in the Maoist fold or eliminate them.\n\nThe counter strategy was launched by the CPI-Maoist’s Dandakaranya Special Zonal Committee (DKSZC) in villages around Gadchiroli where most of the surrendered cadre lives. Dandakaranya stretches across five States — Chhattisgarh, Telangana, Maharashtra, Odisha, and Andhra Pradesh, and its total area is over 92,000 sq km.\n\nIt is a significant holding area for Maoists.\n\nThe State government has claimed that thanks to its latest policy, as many as 51 extremists surrendered in 2015. Violence, too, has ebbed, the government claims.\n\nSenior officials told The Hindu that a minor drop in violence could be attributed to 237 joint operations carried out in 2015, as against 173 the previous year.\n\nMaharashtra first launched a Naxal surrender policy on August 29, 2005, and has claimed that 502 extremists have given up arms since then in violence-hit regions.", 
    "section": "national", 
    "title": "37 on Naxal hit list in Maharashtra", 
    "subsection": "general", 
    "date": "2016-01-21"
}