{
    "author": [], 
    "text": "People cannot have 1,000 real friends on Facebook. Nor 500. In fact, anything over 200 starts seeming unlikely, an unusual study asserted on Wednesday.\n\nLimitations on brain capacity and free time meant that humans can nurture no more than about 150 true friendships on social media, just as in real life, said a paper in the journal Royal Society Open Science .\n\nThe rest are acquaintances, or people recognised on sight.\n\nA theoretical limit of 150 friends has become known as “Dunbar's Number” after British evolutionary psychologist Robin Dunbar, who coined the concept. He also authored the new study, and concluded the same limits applied online. “There is some flexibility, perhaps, but not very much, and it mostly depends on how weak or strong you want your friendships to be,” Dunbar told AFP.\n\n“It is as though we each have a limited amount of social capital and we can choose to invest it thinly in more people, or thickly in fewer people. But you can't exceed these limits.”\n\nDunbar believes human relationships are layered in ever larger circles from closest to furthest. We have on average five intimate friends, 15 best friends, 50 good friends, 150 friends, 500 acquaintances and 1,500 people we recognise on site.\n\n“The 150-layer is the important one: this defines the people you have real reciprocated relationships with, those where you feel obligations and would willingly do favours,” the scientist explained. “People can [and sometimes do] have 500 or even 1,000 friends on Facebook, but all they are doing is including people who we would normally call acquaintances or people we just recognise by sight but don't know very well.”\n\nFacebook didn’t distinguish between types of friendship, Dunbar pointed out. Psychologists like Dunbar believe friendship limits are determined by two things: the ability of our brain to process multiple relationships, and time limitations.\n\n‘Free fan club’\n\nThere has long been speculation that social media may allow us to pierce through some of these barriers, partly by allowing us to communicate with more people at a time -- so stretching limited available social time.\n\nFor the new study, Dunbar used data from a two polls targeting more than 3,300 people in total in the United Kingdom. — AFP", 
    "section": "national", 
    "title": "‘Acquaintance’ category needed in Facebook, says new study", 
    "subsection": "general", 
    "date": "2016-01-21"
}