{
    "author": [
        "Shubhomoy Sikdar"
    ], 
    "text": "The Special Cell of the Delhi Police has arrested four youths with suspected links to the Islamic State (IS) for allegedly planning to target the Ardh Kumbh Mela in Uttarakhand and the National Capital Region in the run-up to the Republic Day.\n\nSpecial Commissioner of Police (Special Cell) Arvind Deep refused to name the outfit. But sources confirmed that they were in touch with a Syria-based member of Ansar-ut Tawhid fi Bilad al-Hind (AuT), which has pledged allegiance to the IS.\n\n“The suspects were tracked down with inputs from a central intelligence agency. They had planned attacks at Ardh Kumbh Mela, on trains bound for Haridwar, which is hosting the event, and at some strategic locations in the capital,” Mr. Deep said.\n\nAkhlaq ur-Rehman, Mohammad Ajimussan, Mohammad Meraj alias Monu (all aged 20) and Osama Mohammed alias Adil (18) were in touch with a key member of AuT through social media and Voice over Internet Protocol.\n\nThey are residents of Manglour in Haridwar, Uttarakhand, and are pursuing undergraduate degrees.\n\n“An FIR was registered on the night of January 18. After detailed interrogation, they were arrested and brought to the capital on Wednesday morning,” Mr. Deep said. They were produced before a local court which remanded them in police custody for 15 days.\n\nSources told The Hindu that the arrested men planned to go to Chhattisgarh for procuring raw material for making explosives through an innovative methodology.\n\n“The methodology they were planning to use involved turning the innocuous looking matchsticks into lethal bombs which they planned to plant on trains or at the venue of the Ardh Kumbh Mela. We are interrogating them to find out more about this,” a police source said.\n\nCharges false, says brother\n\nSpeaking to The Hindu on the phone from Haridwar, Akhlaq’s brother Kamrul Hasan said his brother was innocent.\n\nHe dismissed claims that Akhlaq was in touch with those based in Syria.", 
    "section": "national", 
    "title": "Arrested youth planned to target Ardh Kumbh Mela and Capital", 
    "subsection": "general", 
    "date": "2016-01-21"
}