{
    "author": [
        "Arun S"
    ], 
    "text": "In the first backchannel diplomatic effort since the official notification of the recent visa fee hike move by the Obama administration, a group of U.S. Congress Representatives held a meeting with India’s premier software body, Nasscom, to ensure that such issues were amicably resolved to boost India-U.S. trade and investment ties.\n\nSources in the government and Nasscom confirmed that the meeting between a delegation of U.S. Congress Representatives including Ami Bera, the only Indian-American Representative in the U.S. Congress and a member and co-chair of the Congressional Caucus on India and Indian Americans and Nasscom representatives in New Delhi.\n\nTalks were held on steps to increase the annual bilateral trade from the current $100 billion to $500 billion in the next few years by strengthening India-U.S. partnership in initiatives such as ‘Start-up Mission’ and ‘Make In India’ as well as by resolving all outstanding issues including the recent U.S. visa fee hike, the sources told The Hindu . Indian industry body CII had said the U.S. visa fee hike is highly discriminatory and punitive and is specifically geared towards India and Indian-centric technology companies.\n\nAccording to Nasscom, the visa fee hike will restrict and reduce the usage of H1B and L1 visas by Indian technology companies, the sources said. The sources said since these visas were for short-term work, the American lawmakers were requested not to confuse this issue with immigration or spread the “myth that hiring of foreign tech workers is hindering employment of local professionals”.\n\nThe U.S. Citizenship and Immigration Services (USCIS) on January 12 had said the Consolidated Appropriations Act, 2016, signed into law by the U.S. President Barack Obama on December 18, 2015, increases fees for certain H-1B and L-1 petitioners. These petitioners must submit an additional fee of $4,000 for certain H-1B petitions and $4,500 for certain L-1A and L-1B petitions postmarked on or after December 18, 2015, it addedThe additional fees apply to petitioners who employ 50 or more employees in the U.S., with over 50 per cent of those employees in H-1B or L (including L-1A and L-1B) non-immigrant status, the USCIS said. It said this fee is in addition to the base processing fee, Fraud Prevention and Detection Fee, American Competitiveness and Workforce Improvement Act of 1998 fee as well as the premium processing fee, if applicable.\n\nIn effect the hike is more than double the fee for these categories of H1B and L1 visas, which are for temporary work visas for skilled professionals, and according to Nasscom the decision’s financial implication on the Indian technology sector would be about $400 million annually.\n\nIndian technology companies will be the most affected by the move as it is the largest user of H1B visas (67.4 per cent of the total 1,61,369 H1B visas issued in FY14 went to Indians), and is also amongst the largest users of L1 visas (Indians received 28.2 per cent of the 71,513 L1 visas issued in FY14).\n\nTalks were held on steps to increase annual trade from current $100 bn to $500 bn", 
    "section": "national", 
    "title": "Backchannel efforts begin to resolve U.S. visa fee issue", 
    "subsection": "general", 
    "date": "2016-01-21"
}