{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Is the move by the Nitish government not tantamount to defamation of the Patna High Court, asks Opposition.\n\nThe opposition Bharatiya Janata Party on Wednesday slammed the Nitish Kumar government for withdrawing a case against Rashtriya Janata Dal chief Lalu Prasad, his two sons and 262 other party workers and asked whether the move was not tantamount to defamation of the Patna High Court which was hearing the case.\n\nA case against them was filed on July 27 last year for indulging in vandalism, preventing government officials’ work and stopping vehicles of judges who were on their way to the court during the RJD’s Bihar bandh call.\n\n“Has the State government taken permission from the Patna High Court, which had earlier taken suo motu cognisance of the issue and has been hearing the case, before withdrawing the case from the lower court?” asked BJP leader Sushil Kumar Modi. Mr Modi also charged that the government buckled under pressure of “Super CM” Lalu Prasad to withdraw the case against him, his two sons and over 200 party workers.\n\n“Will the State government now withdraw cases against RJD leader and former party MP, Mohd. Shahabuddin, who is in jail, and several other RJD and JD(U) MPs and MLAs under pressure of Lalu Prasad?” asked the BJP leader. Mr. Modi also hit out at the Chief Minister for “bowing down to the RJD chief Lalu Prasad for the sake of being in power.”\n\nOn Tuesday, the chief judicial magistrate of the Patna civil court, Om Prakash, had accepted the plea of the government lawyer for withdrawal of the case against Mr. Prasad, his two sons Tejaswi Yadav and Tej Pratap Yadav, State party chief Ram Chandra Purve and 262 party workers under Section 321 of Cr.PC. The charge sheet was filed on October 13 last year. However, out of 24 FIRs registered under various police stations against RJD supporters during the bandh call, only one involving Mr. Prasad and his two minister sons was withdrawn.\n\nThe case was filed against all of them last year on July 27 for vandalism and preventing government officials and stopping vehicles of at least three Patna High Court judges during the bandh call. The case was registered against them under various Sections of the IPC with the Kotwali police station following the directive of the then Patna Senior Superintendent of Police Vikas Vaibhav.\n\nThe Patna High Court would hear the matter on February 1.", 
    "section": "national", 
    "title": "BJP slams withdrawal of case against Lalu, his two sons", 
    "subsection": "general", 
    "date": "2016-01-21"
}