{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "“I am disgusted with Hindus and Hinduism because I am convinced they cherish wrong ideals and live a wrong social life,” a booklet recently brought out by some Hyderabad-based activists and academics of the Dalit movement to take on the Sangh Parivar quotes B.R. Ambedkar as saying.\n\nThe 87-page booklet, of which 1,000 copies have been printed, is a direct critique of RSS ‘mouthpiece’ Organiser ’s recent collector’s edition to mark 125 years of the birth of India’s first Law Minister.\n\nAmong the four authors, two — K. Laxminarayana and K.Y. Ratnam — teach at University of Hyderabad witnessing a storm after a Dalit research scholar ended his life after a standoff with the administration and the Sangh’s student affiliate ABVP.\n\nThe booklet is titled ‘Ambedkar can neither be adopted nor appropriated by the Hindutva elements.’ It has serious issues with the Organiser ’s edition: its bid to see Dr. Ambedkar as a ‘Hindu reformer’ and the absence of references to substantiate the claims made.\n\nThe booklet mentions an article in the edition that refers to a purported visit by Dr. Ambedkar to an RSS camp and his “appreciation” for the “absence” of caste feeling in the Sangh.\n\n“In the absence of any reference to public sources, it is difficult to believe these statements of endorsement of the RSS by Dr. Ambedkar. In fact, the RSS is an organised institution to re-implement the caste order and all evils of Hinduism,” says the booklet.\n\nAccording to it, Dr. Ambedkar saw “conversion” as important for Dalits just like self-government was for India. The booklet questions the reading of RSS joint general secretary Krishna Gopal — in an article on Dr. Ambedkar — that an event linked to the Arab invasion of Sindh in Raja Dahir’s time was the first instance of untouchability in India.\n\n“This is a very mischievous and absurd statement,” the authors say, referring to Mr. Gopal’s apparent bid to link the practice of untouchability to the coming of Islam to India.\n\nIt repeatedly questions the authors of the Organiser articles — some of them Sangh functionaries — on the absence of references to many of the assertions made.\n\nIt decries the\n\nattempt to see\n\nB.R. Ambedkar\n\nas a ‘Hindu reformer’", 
    "section": "national", 
    "title": "Booklet attacks RSS take on Ambedkar", 
    "subsection": "general", 
    "date": "2016-01-21"
}