{
    "author": [
        "Mohammad Ali"
    ], 
    "text": "The video which BJP leaders in Muzaffarnagar alleged was the “rape video” of a Jat woman by a local Muslim man, is actually a consensual sex video, shot by the lovers — Irshad and the Jat girl — two years ago, which “accidentally” fell into the wrong hands last week, claim some of the villagers.\n\nThe village is tense and scared of fresh communal violence. While Muslim families have started leaving, a section of the villagers was categorical in claiming that the Jat girl and Irshad were known to be lovers and their affair was at least four years old.\n\nBoth attended the same college in Khatauli where they became close and it was during this time that they shot the video. After minutes of random conversation, the villagers opened up and showed to this correspondent the intimate pictures and videos of the two lovers which had gone viral.\n\nLast week, the 25-year-old-Jat woman from Kalawda Kala went to the Khatauli police station accompanied by BJP and VHP leaders to register a case of gang rape and blackmailing against two Muslim men from the same village. Subsequent to the filing of the FIR, local BJP leaders invoked “rape love jihad” by Muslim youths in the area and threatened dire consequences, including organising a “Mahapanchayat.” In just over 24 hours, Irshad, the alleged rapist, and his cousin Nazar, were arrested.\n\n“You see the pictures and videos. None of the pictures and videos indicate any hint of coercion and rape and have been shot in hotels of Meerut,” said Rajkunwar Saini, a member of the Saini community in the village.\n\nRajkunwar said the affair of Irshad and his Jat girlfriend was a known fact among their classmates in college.\n\n“The girl got married two years ago but the lovers were in touch. Due to this affair there was marital discord after which she filed for divorce. But people know that even after that both the lovers used to meet in Meerut,” said a neighbour of Ashok, a mobile mechanic who is accused of copying the video from Irshad’s phone and making it public.\n\nAccording to the youths in Kalawda Kala, everything was fine between the two till last week when Irshad’s cousin Nazar gave the phone to a local mobile mechanic to download songs and movies.\n\n“Nazar wanted to download some songs in Irshad’s phone. And that is when the phone shop guy copied the intimate videos from the memory card of his phone and later started selling them to locals at the rate of few rupees per video,” said a former classmate of the lovers.\n\n“When the video became viral, the girl’s family registered a case of rape against Irshad. But the matter took a communal turn when BJP leaders made it a Hindu versus Muslim issue, which it is not, because the three accused are Hindus who own mobile phone shops in the village and who had allegedly copied the video and were selling it,” said Rajkunwar.\n\nMuzaffarnagar village is tense and locals are scared of fresh communal violence", 
    "section": "national", 
    "title": "‘Consensual video’ shot by lovers fell into wrong hands", 
    "subsection": "general", 
    "date": "2016-01-21"
}