{
    "author": [], 
    "text": "The Los Angeles comedian has kept herself busy making short films that have landed her all over the Internet. But this project, inspired by her eating disorder, is different\n\nIt takes a special kind of filmmaker to make bulimia funny. Jessie Kahnweiler is that person.\n\nBefore hooking up with Jill Soloway and her Wifey.TV for the new Web series, The Skinny , the Los Angeles comedian kept busy making shorts that have landed her all over the Internet. But this project, inspired by her more than 10-year relationship with the eating disorder, is different.\n\nIt’s her first series, and it’s taking her to Sundance after she raised about $12,000 on Kickstarter to help pay for it. That’s after chatting up Ms. Soloway as a partner and tracking down Illeana Douglas to join her as a producer and the mother to her feminist wannabe YouTube star.\n\n“I’m a broke indie filmmaker... and I’m an avid TV addict, and I noticed that there weren’t that many stories that really spoke to the truth of my experience, of what it was really like to have an eating disorder and also be this strong, feminist, crazy, loud, Jewish chick,” the 30-year-old Atlanta native said. “I started shopping it around to Hollywood and everyone was like, eating disorders aren’t sexy and nobody wants to watch that.”\n\nAfter friends and family came through on Kickstarter, she shipped off a spec pilot to Ms. Soloway, who got her together with Refinery29.com , where the first six 10-minute episodes will debut January 27.\n\nSo how does a broke indie filmmaker meet the likes of Ms. Soloway? “I’ve known Jill for a few years. I’m really good at stalking people. You can ask all my ex-boyfriends. So I stalked Jill on Facebook and I sent her a short film that I made,” Ms. Kahnweiler said.\n\n“Jill really gave me permission to give myself permission. She taught me how to trust my own voice and trust my intuition,” she said.\n\nClearly, Ms. Kahnweiler knows there’s nothing funny about having an eating disorder. “Having an eating disorder is awful and horrifying ... but for me, my experience as a person, a woman, an artist, you know, I tend to find a lot of comedy in the hardest, most tragic moments,” she said. “Going back from when I was a little kid, I would really use humour as a way to cope and handle and interact, and make meaning of my life,” she added.\n\nThe first off-the-rails, binge-and-purge cycle has her stuffing cake down her throat from a black plastic garbage bag as she cleans up from an impromptu welcome home party for her boyfriend, Cole, played by Spencer Hill. He walks in on her right after the big flush as she sits euphoric on the tile, rattling on about bad sushi to hide the obvious.\n\n“You’re still doing this,” he says. “No, I have food poisoning,” she responds weakly, head downcast.\n\nClingy, needy, co-dependent the Jessie in this comedy is dark. Trigger after trigger has her on the binge and purge, stealing chocolate laxative, partying, showing a younger Vine star how it’s done on one’s knees, face in a toilet bowl.\n\nA salami Jessie stuffs down her dress in an early episode is pulled out in the bathroom of a party after her better-looking friend catches the attention of a dude. She is then discovered by said dude, Stuart, played by Ryan Pinkston, who becomes her hyperactive manager as she continues to go about her work getting discovered with her “female branded content.”\n\nAuthentic content\n\nMs. Kahnweiler not only stars, she wrote, directed and helps produce. And The Skinny comes after a comedic short film she created and stars in based on her experience as a rape victim. In Meet My Rapist , she runs into her rapist at a farmer’s market and takes him around, showing him the effect he had on her life. “For me, comedy is really about authenticity,” Ms. Kahnweiler said. “Jill was really helpful in helping me not use The Skinny as therapy, so while it’s a really personal story ... it’s not a documentary. It’s not just for people who have an eating disorder, just for women, just for young Jewish girls. It can really be about anybody that’s experiencing the human condition and dealing with self-hate and doubt and shame.”\n\nMore raw, real and vulnerable was the advice of Ms Soloway, and Ms Kahnweiler went there. Her goal — Let’s talk about it. Let’s talk about our complicated mother-daughter stuff, our body issues, the messier side of things. “We show sex and drugs and violence all the time,” Ms. Kahnweiler said.\n\n“But yet we don’t talk about food, and to me that just further reinforces the cycle of shame. As a young girl growing up with this secret ... there was no conversation to join,” she said. — AP", 
    "section": "national", 
    "title": "Darkly comic Web series takes on bulimia, body shame", 
    "subsection": "general", 
    "date": "2016-01-21"
}