{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "India’s Iran policy is marked by unnecessary caution, Gholamreza Ansari, envoy of Iran, said on Wednesday, arguing for a new age in India-Iran relationship.\n\n“Following the nuclear deal, Iran has been mainstreamed in international affairs and India should appreciate that to bet on Iran is the right thing. In the past, India often advised patience on important projects. In the changed circumstances in West Asian region, India cannot follow the policy of patient waiting any more,” Mr. Ansari said in his first public statement following the nuclear deal between Iran and western countries that led to the dramatic lifting of decades-old sanctions.\n\n“In my three years as the Ambassador of Iran, I have often been advised to be patient on big India-Iran projects. Does India want to wait for centuries before capturing the right opportunities?” Mr. Ansari said in an impassioned speech delivered at the India International Centre during a seminar on West Asian affairs.\n\nGuarantor of stability\n\nThe envoy said that Iran was the guarantor of stability in the West Asian region and would fight against the forces of instability that are responsible for violent extremism in Iraq, Syria and Libya.\n\n“Iran visualises a stable future for its neighbourhood and we will fight till the end to create and maintain stability in our region,” he said while introducing the changes sweeping in West Asian region following the nuclear deal.\n\nMr. Ansari said that mega projects such as the Chahbahar port upgradation, and international energy pipelines demand prompt Indian decisions.\n\n“I feel private companies in India are keen to move ahead in the Chahbahar port project but the government has not shown the same level of enthusiasm in the past.”\n\n“Syria, Iraq and even Egypt need billions of dollars worth investments for reconstruction and recovery from the violent wars. The region urgently requires inclusive social and political structures. India, which has strong interest in the region, should express its concerns freely,” he said.", 
    "section": "national", 
    "title": "Delays disappointing, Indian policy needs to change: Iran", 
    "subsection": "general", 
    "date": "2016-01-21"
}