{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "It will be one of the largest carriers after U.S. super carriers\n\nBy the end of the year, India expects to freeze the design for the largest battleship ever built for the Indian Navy. It will also be one of the largest carriers across the world after the U.S. super carriers, which weigh about 1,00,000 tonnes.\n\nAccording to Navy sources, the Indigenous Aircraft Carrier (IAC-II) would be of 65,000 tonnes, and will be capable of carrying over 50 aircraft. In comparison, displacement of INS Viraat is only 28,500 tonnes and INS Vikramaditya is 45,400 tonnes, both of which are of foreign origin and currently in service with the Indian Navy. The first indigenous aircraft carrier INS Vikrant weighing 40,000 tonnes is currently under construction at Kochi.\n\nThe feasibility study for IAC-II has begun and will take about 8-10 months based on which the design will be frozen, a senior Navy official said on Wednesday.\n\nGiven that this the first time a ship of such size will be built in India which involves development of several new technologies, design consultancy will be sought from foreign companies with expertise in carrier design and construction.\n\nFive countries have been identified for the purpose — the U.S., Russia, France, the U.K. and Italy — all of which currently operate carriers, the official added.\n\nThe Navy has issued a letter in July 2015 to identify the domestic shipyard for constructing IAC-II. Following that, a study group headed by Rear Admiral Surinder Ahuja, Assistant Controller of Carrier Project, has been set up to identify suitable Indian shipyards for construction of IAC-II and to arrive at the build strategy. The Navy aims to achieve 80 per cent indigenisation in the project.\n\nThe critical factors which define a carrier are the number of aircraft, launch mechanism and propulsion which in turn determine the size and displacement of the carrier.\n\nWhile the launch mechanism would be Catapult Assisted Take-Off But Arrested Recovery (CATOBAR), the Navy said “modern technologies for launch and recovery will be considered,” leaving room for incorporating Electro-Magnetic Aircraft Launch System (EMALS) technology of the U.S.\n\nOn Vikrant, officials said it was in advanced stage of construction and was on course to be delivered by December 2018. “The plan is to begin sea trials by September 2017 and deliver by December 2018 after which aviation trails can start,” the official added.", 
    "section": "national", 
    "title": "Design for second domestic aircraft carrier to be frozen by year-end", 
    "subsection": "general", 
    "date": "2016-01-21"
}