{
    "author": [], 
    "text": "Dollocaris ingens, an extinct arthropod, had 18,000 lenses in each eye — a record only ever surpassed by modern-day dragonflies\n\nAn artist's reconstruction of a Dollocaris of the Jurassic seas.— Photo: AFP\n\n: A tiny but scary-looking marine critter that died out with the dinosaurs, caught prey with the aid of two monstrous eyes — each a quarter of its body length, scientists said Tuesday.\n\nThe giant peepers were composed of 18,000 lenses each — a record only ever surpassed by modern-day dragonflies, a team wrote in the science journal Nature Communications.\n\nThe sophisticated organs belonged to Dollocaris ingens, an extinct arthropod which lived about 160 million years ago, during the Jurassic geological period better known for the rise and fall of the dinosaurs.\n\nAn arthropod is an animal with an exoskeleton and segmented body — including groups like today's insects, spiders and crustaceans.\n\nD. ingens, a swimmer, would have had a crab-like shell, with three pairs of clawed, segmented legs with which to catch tiny shrimps, and eight pairs of stubby swimming appendages.\n\nIt would have been about five to 20 centimetres (two to eight inches) long, and each eye about a quarter of that.\n\nFor the study, experts used special microscopes and scans to examine fossilised D. ingens eyes dug up in southeast France.\n\nIt is extremely rare to find well-preserved samples of internal eye structure.\n\nThe first compound eyes, made up of many individual units like those of ants, are thought to have appeared in the Cambrian period some 500 million years ago — revolutionising animal development, according to study co-author Jean Vannier from France's University of Lyon.\n\n\"To see and be seen changed everything -- with eyes you could become a more effective hunter, while prey became more easily detectable,\" he explained.\n\n\"All this led to a new dynamic -- for some to better protect themselves, for others to become better at detection, and new evolutionary pressures.\"\n\nTheir examinations confirmed that C. ingens was a \"visual hunter,\" said Vannier.\n\nIts eyes shared features with those of modern-day insects and crustaceans.\n\n\"It is clear that its huge, panoramic, multi-faceted acute eyes were crucial to scanning its environment and to detecting potential moving prey,\" the study authors wrote.\n\nIt was probably not a very dexterous swimmer, and more likely an \"ambush predator\" pouncing on prey from a concealed position. — AFP\n\nIt is clear that its huge, panoramic, multi-faceted acute eyes were crucial to scanning its environment and to detecting potential moving prey\n\nThe first compound eyes, made up of many individual units like those of ants, are thought to have appeared in the Cambrian period some 500 million years ago -- revolutionising animal development", 
    "section": "national", 
    "title": "Extinct crustacean caught prey with its eyes", 
    "subsection": "general", 
    "date": "2016-01-21"
}