{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "The sessions this year would include the issue of migration which would be dealt with in ‘Chronicles of Exile’\n\nThe Ninth edition of the Zee Jaipur Literature Festival (JLF), which will be attended by 380 authors, including over 100 foreign authors, will begin today with organisers expecting the footfall to exceed 2.5 lakh.\n\nThe five-day literature festival will be inaugurated by Chief Minister Vasundhara Raje which will follow sessions being attended and addressed by noted authors including Margaret Atwood, British comedian and actor Stephen Fry, Indian author Ruskin Bond and the Dalit activist and campaigner Bant Singh, Man Booker Prize winner of 2015 Marlon James, Ireland’s famous writer Colm Toibin, and French economist and global voice on wealth and income inequality Thomas Piketty.\n\nThe keynote address would be delivered by Tara Gandhi Bhattacharjee and Margaret Atwood where Bhattacharjee would be speaking on the legacy of her grandfather Mahatma Gandhi and Atwood would speak about ‘life, literature and the spaces in between’.\n\nAuthors - Uday Prakash, Ashok Vajpeyi, Nand Bhardwaj and K. Satchidanandan would also attend JLF. The writers had returned their Sahitya Akademi Awards, last year, in response to the increasing instances of religious intolerance in the country and the killings of writers to curb freedom of expression.\n\nThe sessions this year would include the issue of migration which would be dealt with in ‘Chronicles of Exile’, it would be further dealt with a session titled ‘The Pity of Partition’ which recounts one of the greatest migrations of human history through the works of Saadat Hasan Manto.\n\nSpeaking to The Hindu on what’s new in JLF this year, Sanjoy Roy, Director of Teamwork Arts which produces JLF said: “This year we have introduced theatre. Also, we have been saying that the focus has to be on Indian languages, so the Jaipur Book Mark (JBM) will facilitate translations.”", 
    "section": "national", 
    "title": "Galaxy of writers, poets to take part in Jaipur Literature Festival", 
    "subsection": "general", 
    "date": "2016-01-21"
}