{
    "author": [
        "Vidya Venkat"
    ], 
    "text": "“I have no privacy at home. My friends have been cut off. Nobody coming forward to help me”\n\nVyapam whistleblower Ashish Chaturvedi has written a letter to the Director-General of Police, Madhya Pradesh, saying he has been kept under “conditions of house arrest” since January 13, a day after he testified in the special Vyapam court in Gwalior in the ongoing investigation into the corruption case.\n\nIn an interaction with The Hindu he said: “At night, two police persons, who have been appointed in the name of providing me security, enter my house and lock it ensuring that I do not go out. So, from 10 p.m. to 10 a.m., I’m virtually under house arrest.\n\nIn the letter to DGP Surendra Singh, dated January 18, 2015, Mr. Chaturvedi said his friends had been cut off from him, and nobody was coming forward to help him. There have been instances in the past, when key witnesses in the Vyapam case, including Anand Rai and Prashant Pandey, have alleged harassment by the State police.\n\nMr. Chaturvedi said last year, the thana in-charge in Jhansi Road, Gwalior, openly threatened him against pursuing the case. He claimed that extra watch on his movements started after he slipped away to Delhi on January 8 to a friend’s place in order to escape police surveillance.\n\n“On January 12, I returned to Gwalior from Delhi to give a statement in the Rahul Yadav case. He is one of the accused in the Vyapam scam.”\n\n‘Hide-and-seek’\n\nSources in the DGP office said they were yet to receive a copy of the letter. Gwalior SP Harinarayanchari Mishra denied that Mr. Chaturvedi was under house arrest. He said Mr. Chaturvedi was in the habit of playing “hide-and-seek” with security persons.\n\n“Sometimes he enters his house through a room and slips away when the security guards are not present. So the police have started locking the doors of his house at night,” Mr. Mishra said.\n\nHe says his friends could not contact him and no one was coming forward to help him", 
    "section": "national", 
    "title": "I am virtually under house arrest, says Vyapam whistleblower Chaturvedi", 
    "subsection": "general", 
    "date": "2016-01-21"
}