{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Open to the possibility that it was “misled” by the Akhilesh Yadav government into appointing former High Court judge Virendra Singh as Uttar Pradesh Lokayukta, the Supreme Court on Wednesday remained firm that a fresh appointment of the anti-corruption ombudsman, if necessary, will be done by the apex court itself. When told that the Supreme Court has been “misled,” a Bench of Justices Ranjan Gogoi and P.C. Pant reacted that “we will deal with them [State government]”.\n\nThe Bench slammed the three constitutional authorities of the State of Uttar Pradesh — Chief Minister, Chief Justice of Allahabad High Court and Opposition Leader — for failing in their constitutional duty to reach a consensus and appoint the Lokayukta despite the lapse of about 20 months.\n\nBefore reserving the case for final orders, Justice Gogoi made it plain that even if the Bench decides to re-call its order appointing Justice Singh as Lokayukta, the court would not leave it back in the hands of the three authorities to make a fresh appointment.\n\n“For 20 months they did nothing. So even if we find we were wrong, we will recall our order and appoint another person ourselves,” Justice Gogoi observed.\n\n“For 20 months you were just talking ... your approach was sanguine. Now, once we appointed someone, you are coming to us saying he is a bad man... what were you doing before we appointed this man... You can go ahead and blame us or praise us. We are used to being blamed,” Justice Gogoi told senior advocate T.R. Andhyarujina, appearing for the High Court.\n\nAfter 20 months, the apex court had to step in and appoint Justice Singh on December 16 last year, employing its extraordinary judicial powers under Article 142 of the Constitution.\n\nHowever, within days of the order, the choice of Justice Singh as Lokayukta became an issue when objections were raised by High Court Chief Justice D.Y. Chandrachud. The Chief Justice pointed out that his name had already been dropped from the list of persons shortlisted for Lokayukta appointment.\n\nConsequently, petitions were filed in the Supreme Court alleging that the apex court was “misled”. This led the apex court to accept the State’s offer to stay the swearing-in till the controversy was cleared.\n\nThe hearing started with the Bench making it clear that even though they respect the Chief Justice’s reservations about Justice Singh, they would not alter their December 16 order unless there are “very, very strong reasons to shake our conscience.”\n\nJustice Gogoi made it clear that the reservations expressed by the Chief Justice of the High Court and the Opposition Leader were of no relevance as Justice Singh was appointed by the Supreme Court itself.\n\n“We are not sitting here in appeal over his (Chief Justice) satisfaction. We have to satisfy ourselves about the allegations against Justice Singh,” Justice Gogoi said.\n\nAdvocate Prashant Bhushan, appearing for one of the petitioners, however submitted that it would be “too hazardous and risky” if the apex court chose to ignore the alarm raised by the Chief Justice of the High Court and the Opposition Leader about Justice Singh.\n\n‘Even if we find\n\nwe were wrong,\n\nwe will recall our order and appoint another person ’", 
    "section": "national", 
    "title": "If misled on Lokayukta, we will deal with U.P. govt. appropriately: SC", 
    "subsection": "general", 
    "date": "2016-01-21"
}