{
    "author": [
        "Dennis S"
    ], 
    "text": "The space agency chairman describes blast-off as successful, says two more satellites will be launched by March\n\nIn yet another textbook launch, the Indian Space Research Organisation (ISRO) on Wednesday launched IRNSS-1E, the fifth of the seven-satellite Indian Regional Navigation Satellite System (IRNSS) into space.\n\nISRO’s workhorse PSLV C-31 rocket lifted the 1,425 kg satellite from the second launchpad of the Satish Dhawan Space Centre here at 9.31 a.m. and placed it in the intended orbit some 19 minutes later. This is ISRO’s first launch for this year.\n\nThough it was a textbook launch, the extremely cloudy skies in Sriharikota deprived the onlookers and journalists of a clear view, as the soaring rocket was visible only for a few seconds, before clouds engulfed it.\n\nAnnouncing that the launch was a success, ISRO chairman A.S. Kiran Kumar said the national space agency had a long way to go since two more satellites were to be launched by March.\n\nDirector of Satish Dhawan Space Centre P. Kunhikrishnan called the launch a “New Year gift” to the nation and said the calendar was hectic for the space agency this year.\n\nWith the launch of the first four satellites — IRNSS-1A, 1B, 1C and 1D were launched in July 2013, April and October, 2014 and March last year respectively — ISRO said, “The current achieved position accuracy is 20 metres over 18 hours of the day with four satellites.”\n\nIRNSS-1E with a mission life of 12 years was launched into a sub geosynchronous transfer orbit with a 284 km perigee (nearest point to Earth) and 20,657 km apogee (farthest point from Earth) with an inclination of 19.2 degree with reference to the equatorial plane.\n\nIRNSS-1E carried navigation and ranging payloads, including a rubidium atomic clock, C-band transponder and corner cube retro reflectors for laser ranging. The signal-in-space of four satellites has already been validated by various agencies within and outside the country.", 
    "section": "national", 
    "title": "ISRO puts fifth GPS satellite in orbit", 
    "subsection": "general", 
    "date": "2016-01-21"
}