{
    "author": [
        "Mini Muringatheri"
    ], 
    "text": "Police bringing Mohammed Nisham, accused in the Chandrabose murder case, to the Thrissur Additional Sessions Court on Wednesday.— Photo: K.K.Najeeb.\n\nThe Thrissur Additional Sessions Court on Wednesday found controversial businessman Mohammed Nisham guilty of murdering Chandrabose, a security guard at the Sobha City apartment complex at Puzhakkal, near Thrissur, where he lived.\n\nNisham, owner of Kings Group of Companies, was pronounced guilty on nine counts, including murder. Additional Sessions Judge K.P. Sudheer is expected to pronounce the sentence on Thursday.\n\nNisham had reportedly chased and hit Chandrabose with his imported Hummer jeep, critically injuring him on January 29, 2015. He had also thrashed the badly wounded security guard, whom the police took to a hospital later. Chandrabose succumbed to his injuries after three weeks, at a private hospital.\n\nThe judge pronounced the verdict in just one sentence soon after taking up the case on Wednesday morning. Clad in a white shirt and jeans, Nisham heard the verdict unemotionally.\n\nWhen the judge asked the businessman what he had to say to the court, Nisham pleaded for leniency. He said he headed a joint family, which was dependent on him. “My mother has a pacemaker. I have wife and kids,” he added.\n\nIn his argument seeking the maximum punishment for Nisham, Special Public Prosecutor C.P. Udhayabhanu noted that the case belonged to the rarest of rare genre and the culprit deserved nothing less than the death penalty.\n\nUnderscoring the way the crime was committed, the public prosecutor said Nisham had attacked the unarmed security guard without any reason. The injuries were so severe that even a three-week treatment and a series of surgeries could not save him. Nine of his ribs were broken and there were 22 injuries on his body, the prosecutor recalled.\n\nMr. Udhayabhanu also argued that Nisham was a threat to society and that was why the Kerala Police slapped the Kerala Antisocial Activities (Prohibition) Act on him. “He orphaned a poor family. He doesn’t deserve any mercy,” the prosecutor pointed out.\n\nHe also demanded of the court that Nisham be made to pay a Rs. 5-crore compensation to Chandrabose’s family, which was pushed to poverty following the death of its sole breadwinner. The defence lawyer, however, alleged that the special public prosecutor was trying to work on emotions in the court. Family being orphaned was no issue at the court, he countered.\n\nSentence to be handed down today\n\nMohammed Nisham chased and hit Chandrabose with his Hummer jeep\n\nin January 2015", 
    "section": "national", 
    "title": "Kerala businessman found guilty of murdering security guard", 
    "subsection": "general", 
    "date": "2016-01-21"
}