{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Computer engineer Rahul Thakkar to be honoured for technical achievement\n\nAfter Bhanu Athaiya, Satyajit Ray, Resul Pookutty, A.R. Rahman and Gulzar, another person of Indian origin has joined the list of Academy Award winners. Rahul Thakkar, a computer engineering graduate from Mumbai University, has won an Oscar that honours scientific and technical achievement.\n\nMr. Thakkar shares the honour with Richard Chuang for “groundbreaking design” of the DreamWorks Animation Media Review System.\n\nEarlier this month, the Academy of Motion Picture Arts and Sciences announced the ten scientific and technical achievements represented by 33 individuals who will be honoured at its annual scientific and technical awards presentation on February 13, at the Beverly Wilshire in Beverly Hills.\n\n“With their outstanding, innovative work, these technologists, engineers and inventors have further expanded filmmakers’ creative opportunities on the big screen,” said Richard Edlund, Academy Award-winning visual effects artist and chair of the Scientific and Technical Awards Committee.\n\nUnlike other Academy Awards, achievements receiving Scientific and Technical Awards need not have been developed and introduced during 2015. Rather, the achievements must demonstrate a proven record of contributing significant value to the process of making motion pictures.\n\nMr. Thakkar, who took his Master’s degree in computer science from Utah State University has over 20 years of experience in product design and research and is presently the vice-president at Brivo Systems.\n\nThe Academy Award citation says of the DreamWorks media review system: “Over its nearly two decades of development, this pioneering system enabled desktop and digital theater review. It continues to provide artist-driven, integrated, consistent and highly scalable studio-wide playback and interactive reviews.”\n\nShares award with Richard Chuang for design of DreamWorks Media Review System", 
    "section": "national", 
    "title": "Mumbai varsity graduate wins an Oscar", 
    "subsection": "general", 
    "date": "2016-01-21"
}