{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "A class of frogs that grow in tree holes and, as tadpoles feed on eggs laid by their mother have been discovered in the north-east region, according to an international team of researchers led by a Delhi University-based scientist.\n\nIn the last two decades, India has reported a rapid rise in the discovery of frog species from the Western Ghats and, more recently, the north-eastern States. The new frog, reported in the peer-reviewed journal PLoS One , has been christened Frankixalus Jerdonii and was once considered a species lost to science.\n\n“This genus remained unnoticed by researchers probably because of its secretive life in tree holes”, said S D Biju, the lead author of the study and from the University of Delhi.\n\nHe said he had first found these frogs in 2005 during explorations in Assam and Arunachal Pradesh, among other places, but had taken a decade to publish about them because of the complexities involved in ensuring that it was indeed an entirely new genus and not merely a known species.\n\nFrogs of the newly described genus Frankixalus , according to Mr. Biju, were relatively large (between 37–50 mm long) with big, bulging eyes and blunt snouts and are found on forest canopies and inside bamboos slits. Due to insufficient food resources in tree holes, the mother exhibits “remarkable parental care” by laying unfertilised eggs to feed her tadpoles. Tree frogs occur across sub-Saharan Africa, China, much of tropical Asia, Japan, the Philippines and Sulawesi.\n\nIndependent experts told The Hindu that Mr. Biju’s find was significant but needed more scrutiny. Sushil Dutta, a veteran herpetologist and formerly with the Indian Institute of Science, and who read Mr. Biju’s research paper, described the study as a “rare and good find” but added that more molecular analysis was required to be convinced that the find was indeed a new genus.", 
    "section": "national", 
    "title": "New class of frogs found in the north-east", 
    "subsection": "general", 
    "date": "2016-01-21"
}