{
    "author": [
        "Kenneth Chang"
    ], 
    "text": "There might be a ninth planet in the solar system after all — and it is not Pluto.\n\nOn Wednesday, two astronomers reported that they had compelling signs of something bigger and farther away — something that would definitely satisfy the current definition of a planet, where Pluto falls short.\n\n“We are pretty sure there’s one out there,” said Michael E. Brown, a professor of planetary astronomy at the California Institute of Technology.\n\nWhat Brown and a fellow Caltech professor, Konstantin Batygin, have not done is actually find that planet, so it would be premature to revise mnemonics of the planets just yet.\n\nIn a paper in The Astronomical Journal , Professors Brown and Batygin lay out a detailed circumstantial argument for the planet’s existence in what astronomers have observed — a half-dozen small bodies in distant, highly elliptical orbits.\n\nWhat is striking, the scientists said, is that the orbits of all six loop outward in the same quadrant of the solar system and are tilted at about the same angle. The odds of that happening by chance are about 1 in 14,000, Prof. Batygin said.\n\nA ninth planet could be gravitationally herding them into these orbits.\n\nFor the calculations to work, the planet would be quite large — at least as big as Earth, and likely much bigger — a mini-Neptune with a thick atmosphere around a rocky core, with perhaps 10 times the mass of Earth. It would dwarf Pluto, at about 4,500 times its mass.\n\nPluto, at its most distant, is 4.6 billion miles from the sun. The potential ninth planet, at its closest, would be about 20 billion miles away; at its farthest, it could be a trillion miles away. It would take from 10,000 to 20,000 years to complete one orbit around the sun.\n\n“We have pretty good constraints on its orbit,” Brown said. “What we don’t know is where it is in its orbit, which is too bad.”\n\nAlessandro Morbidelli of the Côte d’Azur Observatory in France, an expert in dynamics of the solar system, said he was convinced. “I think the chase is now on to find this planet,” he said. — New York Times News Service", 
    "section": "national", 
    "title": "Ninth planet may exist, say scientists", 
    "subsection": "general", 
    "date": "2016-01-21"
}