{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "The secretaries had been asked to show results for the work being done\n\nThe public health community in India was taken by surprise as the Health Ministry released the first set of the National Family Health Survey (NFHS) data on Tuesday night — with even the top rung of Health Ministry officials unaware of the development. According to highly placed sources in the Ministry, the decision was taken due to ‘mounting pressure from the Prime Minister’s Office (PMO) to show results’. The National Family Health Survey (NFHS), a large-scale household sample survey is the main source for detailed health statistics in India. The survey had last been conducted in 2005-06 and the public health community, globally, was surprised as a partial data set for 13 States, was released without a media briefing.\n\nA senior bureaucrat in the Ministry said on condition of anonymity that NFHS was released under pressure from the PMO to ‘show results’. “The secretaries had a meeting at the PMO on Sunday, and were asked to show results for the work being done. We had this data ready. There is a lot of pressure to show results,” the official added.\n\nThe Statistics department had released the data without any consultation with senior bureaucrats in the Ministry. “The Department of Statistics uploaded the data without any consultation,” said another senior official. A third official said, “We waited 11 years for the data. It makes no sense that they could not wait a few more months for all India data to be compiled.”\n\nC.R.K. Nair. Additional Director-General, Statistics, said “the survey is not complete. For now we have only 13 States. The survey is just beginning in other States. We did not think there was any point in calling the media since we did not have the entire data set,” he added. The complete data from NFHS-4 will be available by September. The data released on Tuesday has health indicators for Andhra Pradesh, Bihar, Goa, Haryana, Karnataka, Madhya Pradesh, Meghalaya, Sikkim, Tamil Nadu, Telangana, Tripura, Uttarakhand, West Bengal and Union Territories of Andaman and Nicobar Islands and Puducherry.", 
    "section": "national", 
    "title": "PMO exerts pressure, data released", 
    "subsection": "general", 
    "date": "2016-01-21"
}