{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "The final blow was delivered by Human Resource Development Ministry’s letters and reminders to the university\n\nStudents put up posters at the University of Hyderabad on Wednesday in protest against the authorities who they allege to have caused the suicide of a research scholar, Rohith Vemula.— Photo: K.V.S. Giri\n\nRohith Vemula, the research scholar who committed suicide on the University of Hyderabad (UoH) campus, was known as a bright doctoral student who had secured a CSIR-Junior Research Fellowship (JRF) and also as a fiery Dalit leader of the Ambedkar Students Association (ASA). The day, January 17, that he hanged himself using ASA’s banner, he was on the 14th day of a sleep-in strike against the authorities following his expulsion from the hostel after a series of incidents and probes which took place on campus dating back to June 2015.\n\nSoon after he completed his one year PhD (Science Technology and Societal Studies) coursework in June 2015, Mr. Vemula could neither pursue his research nor political activism because he had been tied down by three ongoing investigations, one conducted by the Gachibowli police, and two by the university authorities, based on a complaint lodged by an Akhil Bharatiya Vidyarthi Parishad (ABVP) student leader of the UoH campus, N. Susheel Kumar.\n\nThe investigations and proceedings which began in August were based on a complaint made by Mr. Kumar that five Dalit scholars of the ASA including Mr. Vemula had physically assaulted him leading to his hospitalisation. Mr. Kumar had also accused the ASA of leading anti-national activities on the campus, including protests related to Yakub Memon’s hanging.\n\nGoing by The Hindu ’s investigation, the following are the facts in the case:\n\nMr. Susheel Kumar, who was hospitalised on August 4 following what the university’s security officers on record have called a “scuffle”, had sustained no major injuries. As per the report signed and submitted by the physician who examined him on August 4 & 5, Mr. Kumar’s condition was stable and no evidence of assault was found on him, except for a bruise on the shoulder. However, based on the complaint filed by Mr. Kumar at the Gachibowli police station, the Cyberabad police had booked the students under four serious Sections.\n\nMr. Vemula was already deeply embroiled in multiple probes soon after his research proposal on molecular microbes was approved and set for review of literature. He could not pursue his research and spent most of his precious time worrying, sharing his anger and concerns on Facebook and with his friends as two different committees set up by UoH probed and prodded into the assault claim over an extended period of time.\n\n“[Rohith] put up a great fight for all of us. But it had started looking like a never-ending fight. When five Dalit research scholars were sleeping in the open at Shopping Complex, the Vice-Chancellor did not even bother to turn up. We had to lay siege to the administrative building on January 13 to get him to talk to us sometime,” said Dontha Prashanth, a fellow expelled student.\n\nThe Proctorial Board found no instance of assault or harm done to Mr. Kumar by a 30-member “mob” of ASA students who had approached his hostel room on August 3-4 night/morning.\n\nHowever, the PB penalised all five students with a one semester suspension on the same grounds in its report submitted on August 31. What followed in the lives of Mr. Vemula and others was another round of protests supported by the ASA and some student outfits.\n\nA faculty member and general secretary of University of Hyderabad Teacher’s Association (UHTA), P. Thirumal, asked, “Why was the matter referred to the EC subcommittee. The matter was dragging on and the lives of all the students were getting tedious. The university silenced even their political, rightful voice. Could the matter not have been resolved fast?”\n\nThe final blow was delivered by the Ministry of Human Resource Development’s letters and reminders to the university. With Minister of State for Labour Bandaru Dattatreya referring to the “assault” case on ABVP leader and “anti-national, casteist and extremist” activities on the campus, the matter had already taken a political turn.\n\nThe final blow was delivered by MHRD’s letters and reminders to the university", 
    "section": "national", 
    "title": "Rohith could not do research as he was embroiled in probes", 
    "subsection": "general", 
    "date": "2016-01-21"
}