{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Recent budget cuts in education sector have put universities under financial stress\n\n“I have to get seven months of my fellowship, one lakh and seventy five thousand rupees. Please see to it that my family is paid that …” January 17, 2016.\n\nThe suicide note of Dalit Ph.D. scholar Rohith Vemula highlights how the delays in government-sponsored scholarships drive the students from Schedule Caste and Schedule Tribe (SC/ST) communities into desperation.\n\nAfter speaking to several students and professors in various States, The Hindu has learned that the recent budget cuts in the education sector have put universities under financial stress. In the 2014-15 revised budget estimates, the government reduced funds for higher education by Rs. 3,900 crore. Prior to this, the universities would release the stipends from their own coffers, knowing that the University Grants Commission (UGC) would reimburse them on time. But they have now ceased to be generous.\n\nA senior Professor from the University of Hyderabad said, “There has been almost a 50 per cent cut in Plan funds as well as maintenance grants from the Centre [UGC] resulting in administrative belt-tightening.”\n\nSpeaking to The Hindu , Chinmaya Mahanand, a Ph.D. scholar at Jawaharlal Nehru University, said he had been living frugally, and taking small loans from his friends, since he had not received his monthly stipend of Rs.25,000 for about five months. “It’s mentally frustrating,” he said.\n\nMr. Mahanand is a “core committee” member of the Birsa Ambedkar Phule Student Association (BAPSA), a JNU-based group for Dalit rights. He said 600 students from SC/ST communities associated with BAPSA were struggling to get by in the absence of scholarship aid.\n\nA senior official at the Union Human Resource and Development Ministry said that last September, the Ministry slashed the education budget by 25 per cent which led to a 17 per cent loss in the UGC’s budget.\n\nSince Mr. Mahanand’s stipend came from the UGC, the JNU turned a cold shoulder on him, shrugging off accountability for his welfare.\n\nBorn in Koksara village in Odisha, Mr. Mahanand grew up in tough circumstances as both his parents worked as daily wage farmers. Whenever they fell on hard times, he helped them with a few thousand rupees. “Every student from SC/ST community does that [sends money home],” he said. Mr. Mahanand joined the Occupy UGC movement to register their protests, but now differs with it since he believes its mandate is “too narrow”.", 
    "section": "national", 
    "title": "Shackled by budget cuts for education sector", 
    "subsection": "general", 
    "date": "2016-01-21"
}