{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Debate triggered by claims that his father is a BC and mother belongs to a Scheduled Caste\n\nEven as claims surface about the Dalit status of Rohith Vemula, the Supreme Court has already laid down the law that a child from an inter-caste marriage who suffered the “deprivations, indignities, humilities and handicaps” of his Scheduled Caste or tribal mother’s community all his life should be recognised as belonging to that depressed caste.\n\nProbe agencies have reportedly expressed doubts about the Dalit status of the 26-year-old research scholar at the University of Hyderabad who ended his life under tragic circumstances after he was suspended and his research stipend allegedly withheld following an altercation with ABVP followers. The debate about his caste was triggered by claims that Vemula’s estranged father belongs to a backward community in Andhra Pradesh though his mother is a Scheduled Caste.\n\nThe judgment delivered by a Bench of Justices Aftab Alam and Ranjana Prakash Desai in January 2012 in the Rameshbhai Dabhai Naika versus State of Gujarat case held that there was no such “inflexible rule of general application” that in every case of inter-caste marriage in which the mother belonged to an SC/ST community, the child should take his father’s caste.\n\nThough the court agreed that there may be a strong presumption that the child would take his father’s relatively dominant community identity, the apex court observed that such presumptions cannot be “conclusive and irrefutable” and would depend on the facts of each case.\n\n“It is open to the child of such marriage to lead evidence to show that he/she was brought up by the mother who belonged to the Scheduled Caste/Scheduled Tribe. By virtue of being the son of a forward caste father he did not have any advantageous start in life but on the contrary suffered the deprivations, indignities, humilities and handicaps like any other member of the community to which his/her mother belonged. Additionally, that he was always treated as a member of the community to which her mother belonged not only by that community but by people outside the community as well,” the judgment held.\n\nThe court further noted that a presumption in favour of every child taking his father’s dominant caste was almost impractical. On this point, the court illustrated the case of a pregnant tribal or Scheduled Caste woman, abandoned by her forward caste husband, who would go back to her people and community.", 
    "section": "national", 
    "title": "Supreme Court verdict of 2012 supports Dalit status of deceased scholar", 
    "subsection": "general", 
    "date": "2016-01-21"
}