{
    "author": [
        "K Lakshmi"
    ], 
    "text": "During the floods in Chennai, they came together to offer help to the affected. Now, with this experience guiding them, the spirited group of volunteers is coordinating relief efforts in the quake-hit Manipur. It all started when individuals joined hands to reach out to the flood-affected residents in December. They then formed Tamil Nadu Flood Support and worked several hours in a day , carrying out functions, from mobilising volunteers and materials to delivering supplies on time. The group still continues to engage in relief activity in Chennai and Cuddalore.\n\n“We met with several challenges as we tried to reach out to people. Many had supplies and funds and did not know how to reach people. Much time was lost in transporting supplies. Sometimes, there were more volunteers than necessary at one place,” said Shashi Kumar M. of Tamil Nadu Flood Support.\n\nUsing this experience and database of over 55,000 people, the team is coordinating with other groups like Red Elephant Foundation, Flood Support Manipur and Sphere India to mobilise help for quake-hit Manipur.\n\n“Our Chennai experience has taught us to identify the specific needs of people and avoid supplying things they don’t need. For instance, we realised much later about the need for children’s clothes in Chennai. In Manipur, there is a greater need for tents and warm clothes than for volunteers,” said Anusha Padmanabhan of Tamil Nadu Flood Support.\n\nThe group has now prepared a kit that could be sponsored and also a standard list of items that would be required in disaster-hit areas.\n\n“We are planning to gather more support and fund for the relief operations from ICON-MUN in ICFAI, Hyderabad, where students from various colleges will congregate for a conference this month-end. Our focus is to be more transparent in feedback about relief operation,” Mr. Shashi Kumar added.", 
    "section": "national", 
    "title": "Volunteers go beyond Chennai, reach out to Manipur quake-hit", 
    "subsection": "general", 
    "date": "2016-01-21"
}