{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "Budget cuts, halting of IEC measures and targeted intervention activities to blame\n\nThe latest National Family Health Survey (NFHS) data findings, released by the Health Ministry on Tuesday night, reveal widespread ignorance about HIV/AIDS among adults in India. According to the latest data, nearly 82 per cent women and nearly 70 per cent men — in the 13 States surveyed under phase 1 of NFHS4 — lacked comprehensive knowledge of HIV/AIDS and safe sex practices.\n\nThe pattern is, worryingly, seen even in high burden States with the most drastic fall coming from Andhra Pradesh. As per the NFHS4 data, only 56% men and 29% women know about HIV — a staggering fall from a 2005 data when 93% in men and 74% in women in the State had comprehensive knowledge. With a prevalence of 0.59%, Andhra Pradesh shoulders the third highest HIV burden in India — way above the national average of 0.35%.\n\nThis is seen as a direct result of budget cuts, with IEC (information, education and communication) measures and targeted intervention activities coming to a screeching halt. “Yes. We are aware. And it is an alarming drop in HIV information available in the public. This could be because the IEC activities have taken a backstage,” said C.R.K Nair, Additional Director-General (Statistics), Health Ministry. A comparison with NFHS3 revealed that while 45% men had ‘heard of’ HIV in 2005 (across the 13 States for which partial data has been released), only 30% currently are aware of the disease. For women, the figure fell from 24% in 2005 to 18% in 2016.\n\nThe Ministry has, historically, relied heavily on IEC activities, since prevention is the only key method of curbing and reversing the epidemic. “Due to budget cuts in the past couple of years, IEC activities have suffered. You do not see advertisements on safe sex or mass media campaigns about HIV as much anymore. These are extremely worrying findings,” said a senior official.", 
    "section": "national", 
    "title": "Widespread lack of HIV awareness among Indian adults", 
    "subsection": "general", 
    "date": "2016-01-21"
}