{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district police arrested 40 people, including a woman, for selling liquor and booked as many as 125 drunken riding cases on Saturday when TASMAC shops selling liquor downed shutters on the occasion of Thiruvalluvar Day during the Pongal festival.\n\nActing on the directions of Superintendent of Police N. Manivannan, the Prohibition and Enforcement Wing, led by S. Vellaidurai, Additional Superintendent of Police, launched a district-wise drive against illegal liquor selling and arrested the 40 people and seized an auto rickshaw and a two-wheeler on charges of illegally selling liquor at various places.\n\nAll those arrested were remanded in judicial custody, Mr. Manivannan said during a brief chat with reporters here on Sunday after inaugurating an awareness rally for auto-rickshaw drivers as part of the road safety week celebration.\n\nThough the government closed down liquor shops on Saturday, police during a special drive, booked as many as 125 two wheeler riders for ‘drunken driving’. Police had also booked 772 two wheeler riders for not wearing helmet, the SP said.\n\n“On Saturday alone, police booked more than 1,500 motor vehicle cases and collected a fine amount of Rs 1.20 lakh,” the SP said.\n\nAs four two-wheeler riders died and more than 15 injured in drunken riding cases on Pongal day on Friday, police would continue the drive against drunken driving and book two wheeler riders who do not wear helmet, the SP added.\n\nEarlier, inaugurating the rally, the SP said auto rickshaw drivers, who were in touch with general public most of the time, helped the police in cracking a number of criminal cases with their valuable inputs. He advised them to be law-abiding citizens and bring to the notice of the police of any illegal or anti-social activity.\n\nHe said the auto rickshaw drivers should be extremely careful while taking children to schools. “Treat the children as your own kids,” the SP said and advised them to avoid overloading, while distributing pamphlets on road safety.", 
    "section": "national", 
    "title": "40 arrested for selling liquor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}