{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A child being administered polio drops in a booth in new bus stand in Vellore on Sunday.- Photo: VM_MANINATHAn\n\nA total of 3,68,568 children aged 0 to five years were immunised on Sunday during the first phase of the intensified pulse polio immunisation campaign in Vellore district. Through this, Vellore district recorded coverage of 97.1 per cent.\n\nIn Vellore Health Unit Division (HUD), of the enumerated 1,80,649 children, 1,79,004 children received the drops. In Tirupattur HUD, the drops were administered to 1,89,564 children of the enumerated 1,98,847.\n\nWhile Vellore HUD achieved 99.1 per cent coverage on the first day of the campaign, Tirupattur HUD recorded 95.3 per cent coverage. Overall, a total of 3,68,568 children of the enumerated3,79,496 were immunised in the district, taking the district’s average coverage to 97.1 per cent.\n\nK. Poonkodi, deputy director of health services, Vellore HUD, said the health department staff will undertake door-to-door checks starting from Monday to Saturday to immunise children who had missed the dose on Sunday.\n\nA total of 2,393 booths were set up across the district. Booths were established at the toll gates on the National Highway-46, bus terminals and railway stations, besides on hill areas that had poor transportation facilities. As many as 9,466 staff and 290 supervisors from various departments including public health, education, social department and revenue, NGOs and women Self Help Groups were involved in the campaign.\n\nEfforts were taken to reach out to children of migrant workers in the district. In Vellore HUD, 172 children of migrant families were immunised, while 758 children were covered in Tirupattur HUD. A total of 17,501 children (10,758 in Vellore HUD and 6,743 in Tirupattur HUD) on transit were covered.\n\nK. Manivannan, district revenue officer, Vellore inaugurated the campaign at the New Bus Stand.\n\nTIRUVANNAMALAI: Out of the 1,43,713 enumerated children in Tiruvannamalai HUD, 1,41,107 children were immunised. This accounted for 98.2 per cent coverage.\n\nIn Cheyyar HUD, 87,256 children of the enumerated 89,177 children were immunised, recording coverage of 98 per cent, officials said.", 
    "section": "national", 
    "title": "97.1 % coverage in pulse polio", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}