{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Institutions and companies are increasingly taking steps to organise waste segregation\n\nLast September, Avvai Home, decided to do something about the waste generated in their institution premises. The home for less privileged girls and women was generating a lot of it. “We cook every day for 195 people and earlier, we would just dispose of all our garbage. But I wanted to use our kitchen waste for a vegetable garden,” says V. Susheela, secretary of the home. And so, they set up composting units, into which their garbage goes and is converted as compost. “It’s been coming out very well. The rains delayed our gardening project, but we are planning to set it up soon,” she says.\n\nEvery day, the city disposes of nearly 5,000 tonnes of garbage. Most of this is un-segregated and is dumped in the massive landfills in Pallikaranai and Kodungaiyur.\n\nAvvai Home, says Navneeth Raghavan of Daily Dump which sells and sets up community composting units called Aaga, is one of many organisations that are now expressing an interest in composting their waste. “Eight years ago, when we began in Chennai, our focus was on individual home composting. But now, the scale of the problem has become so large, that the community must step in,” she says.\n\nWhile community composting is still in its nascent stages in the city, it is slowly growing in popularity, says Siddharth Hande, of Kabadiwalla Connect, a social enterprise that works in waste management. “The big barrier here is segregation. If residents started segregating at source, wet waste can be composted and recyclables sold to the local scrap merchant. If all of Chennai did this, we will be sending 70 per cent less waste to the landfill,” he says. Recently, a lot of people and companies have come forward in attempting to solve this problem and also make a profit from it, he adds.\n\n“The apartment we lived in previously in Siruseri off Rajiv Gandhi Salai had community composting and did an excellent job. Families at the new complex we live Padur are interested and we are attempting to set it up this year. It is not that people are not sensitive to the issue: the challenge is getting it 100 per cent right, which is easy to do individually but in large complexes it can be tricky,” says Srinivas Krishnaswamy, co-founder of Krya Consumer Products, a start-up focussing on sustainable household products.\n\nMs. Raghavan says an apartment complex in Perangalathur too had set up a composting unit for their 120 apartments and IT companies and other complexes in the city are showing interest. “It does not involve much work at all. There is initial cost in setting up the units and buying the dry waste. There is no smell at all and only the items that cannot be composted such as medical waste will eventually be have to be disposed off,” she explains.\n\nThe Harrington Road Residents Association is also setting up a composting unit – it will be ready by the end of the month says Suhasini Frederick, a member of the Association. At present, the Association generates about 700 kg of organic waste per month, mostly garden waste.\n\nThe Chennai Corporation has been attempting to get residents to segregate their garbage at source, but it is an uphill battle. “Currently, we collect about 150 tonnes of segregated waste, but we plan to increase the quantity. We have started bidding for this project and are also setting up biomethanation units. We have 10 functioning units and two more are under construction,” a senior Corporation official says.", 
    "section": "national", 
    "title": "A community approach to composting", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}