{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Following low-key new-year celebrations owing to the flood, the turnout of people during ‘Kaanum Pongal’, on Sunday, was much higher. Parks, beaches and malls were brimming with visitors from across the city and suburbs. Multitudes of people filled the sands of Marina Beach from the Anna memorial to Light House as hawkers and stall owners made a roaring business. People were seen waiting in long queues to visit Anna and MGR memorials. The Chennai Trade fair at Island Grounds, very close to Marina Beach, saw a sizeable crowd too.\n\nThe Chennai City Police and the Traffic Police were in full strength at all public places, including Marina and Elliot’s beach in Besant Nagar and also at Tiruvanmiyur. At Marina, police had placed temporary booths and made regular announcements.\n\nTraffic Police had cordoned off the numerous service roads leading to the Marina beach from Kamarajar Salai to regulate vehicle parking and crowd movements. A senior official of the City Police said this year was safe as no drowning was recorded in the beaches and all the 22 children who had gone missing were rescued and handed over to their parents. Drones were used by the police as part of the security measures.\n\nThe Arignar Anna Zoological Park in Vandalur and the Children’s Park in Guindy too witnessed heavy crowds. According to Zoo authorities, the total number of visitors to the zoo during the past three days was 92,344. The zoo registered footfalls of 44,243 on Sunday, 33,679 on Saturday and 14,422 on Friday. The roads leading to the beaches in Tiruvanmiyur, and Besant Nagar including New Beach Road, Tiruvalluvar Nagar, 16{+t}{+h}Cross Street, and Sixth Avenue, Besant Nagar, became a parking lot causing inconvenience to pedestrians. At Besant Nagar, many people struggled to find spaces to park their vehicles.\n\nThe Metropolitan Transport Corporation fleet was operated at full strength, while the suburban trains and MRTS maintained their weekly services, instead of their usual Sunday service.\n\nAt Mamallapuram, police had a tough time keeping people away from the sea. An All-Terrain Vehicle was pressed into service for the safety of the revellers. Places like the boat house at Mudaliyarkuppam and Alamparai Fort near Kadapakkam on East Coast Road attracted large numbers of people.", 
    "section": "national", 
    "title": "An ocean of humanity heads to beach fronts on Kaanum Pongal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}