{
    "author": [
        "K Raju"
    ], 
    "text": "Come Pongal festival, rural people offer their agri-produces to their village gods to show their gratitude and for better yield in the coming season.\n\nTheir offerings vary from foodrains to cattle and roosters to goats depending on their livelihood activities.\n\nBut residents of Sevugampatti, 32 km away from Dindigul on the Batlagundu-Dindigul highway, celebrated a banana festival as part of their annual festival of Sri Solaimalai Azhagar Temple.\n\nDuring the festival in the evening of Sunday, devotees threw bunches of bananas on devotees waiting outside the temple.\n\nThey have been following this custom for the past two-and-a-half centuries on the third day of Thai, Tamil month.\n\nThe banana bunches meant for offering were brought in baskets. Each pilgrim carried at least 20 to 25 dozens of bananas and offered them to the deity. Some rich farmers brought even van load of banana.\n\nAt the outset, hundreds of devotees gathered on a street near the temple with baskets full of bananas on their shoulders. Local youths carried holy umbrellas, covering bananas.\n\nThey entered the temple in a procession. Each house has to offer at least one basket of bananas.\n\nThe fruits were kept before the deity as offerings.\n\nAfter special pujas, the bananas were taken to the roof of the temple. Donors threw bananas on the crowd that gathered outside the temple. Several men, women and children, irrespective of their age and social status, grabbed them.\n\nSome devotees personally handed over the bananas to each and every person who could not grab it in the crowd. Even people waiting on the roadside were not left out.\n\nThe devotees brought different varieties of bananas in mini lorries and vans from villages in Dindigul, Theni, Tiruchi and Madurai districts.\n\n“We call it as ‘soorai viduthal’ (throwing banana). Only restriction is that no resident of Sevugampatti would be allowed to take home a single banana offered to the temple,” said Andia Pillai, village head.\n\nOffering was to show the gratitude to the deity for bumper harvest in the last season and also for better harvest in the next season, said the villagers.\n\nMost of the devotees were banana traders from Chennai, Bangalore, Batlagundu, Sevugampatti, Thummalapatti, Lakshmipuram, Singarakottai, Salaipudur, Thandigudi and Batlagundu, some of the major banana producing centres in Dindigul district.", 
    "section": "national", 
    "title": "Banana festival to show gratitude to God", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}