{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Vaiko leads fast organised by People’s Welfare Front demanding lifting of the SC ban\n\nThe ruling Bharatiya Janata Party hoodwinked the people of Tamil Nadu by enacting a drama of taking efforts to lift the ban on jallikattu, and the All India Anna Dravida Munnetra Kazhagam, with 37 Lok Sabha members, did nothing concrete but offered only lip service on the issue, alleged Marumalarchi Dravida Munnetra Kazhagam general secretary, Vaiko on Sunday.\n\nAddressing the media while observing a fast organised by the People’s Welfare Front demanding lifting of the ban on jallikattu here, Mr. Vaiko charged that the ban was a cultural invasion orchestrated by the People for The Ethical Treatment of Animals. “Hindutva forces were behind it,” he claimed.\n\nStating that the Centre did not realise the sentiments of Tamils behind jallikattu, he said it was more a cultural event that dated back to several centuries.\n\nHe charged that the BJP government at the Centre failed to enact a legislation for effectively lifting the ban on jallikattu that was implemented by the previous United Progressive Alliance Government through a legislation.\n\n“With 37 Lok Sabha and 11 Rajya Sabha members, the AIADMK has not taken adequate steps for lifting the ban on the sport. It only offered lip service by writing letters to the Prime Minister,” he alleged.\n\nMaintaining that the rural masses were not indulging in any violence, he said there would be a silent revolution against the parties that brought in the legislation banning jallikattu and that failed to reverse it.\n\nThe PWF would continue its struggle till the ban is lifted, he said.\n\nViduthalai Chiruthaigal Katchi leader, Thol. Thirumavalavan, complained that the State had a lackadaisical approach in legally fighting the issue in the court. The last-minute effort by the State and the Centre was only a political drama, he charged. He wanted a strong legislation in place so that the sport was not banned in any form in future.\n\nCommunist Party of India State secretary, R. Mutharasan, said the State police had fortified the rural villages with a massive force that hindered the movement of the common man.\n\nHowever, in the neighbouring Andhra Pradesh, no police action was taken against people who conducted rooster fight and buffalo fight despite the Supreme Court ban.\n\nCommunist Party of India (Marxist) leader M.N.S. Venkataraman, leaders of the PWF, were among those who took part in the day-long fast.\n\n“AIADMK with 37 Lok Sabha members only paid lip service”", 
    "section": "national", 
    "title": "‘BJP hoodwinked people on jallikattu’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}