{
    "author": [], 
    "text": "Pongal fest at college\n\nPongal festival was celebrated at The American College, Madurai, on January 13 with a variety of competitions that reflected Tamil tradition and culture. Students turned up in traditional attire and participated in competitions that included lifting of ‘ilavatta kal.’ Prizes were distributed to the winners by M. Davamani Christober, Principal.\n\nMoU signed\n\nThe departments of Commerce and Computer Science of Vivekananda College, Tiruvedakam West, signed a memorandum of understanding (MoU) with Madurai SMIT on December 28 when a two-day workshop on “PHP and MYSQL” was inaugurated. The MoU was signed by Swami Niyamananda, secretary, and A. Sureshkumar, Director, SMIT. Under the MoU, the SMIT will help the college in organising campus interviews, workshops and seminars. K. Karthikeyan, Coordinator, Department of Commerce, welcomed the gathering. B. Ramamoorthy, Principal, delivered the presidential address. S. Raja, Vice-Principal, and M. Ganesan, Dean, offered felicitations. P. Poopathi, Assistant Professor, proposed a vote of thanks.\n\nFormulating research problem\n\nA State-level workshop on “Formulating the Research Problem” was organised by the Department of Commerce, Saraswathi Narayanan College, Madurai, on December 30 with the objective of providing a platform for research scholars to identify, define and formulate the research problem in their respective field of research. About 150 research scholars from various colleges and universities participated in the workshop, which was inaugurated by K. Natarajan, former Principal, NMS S. Vellaichamy Nadar College. V. Kamarasan, Head, Department of Commerce, welcomed the gathering. M. Kannan, Principal, presided over the inaugural session. K. Jeyakodi, Associate Professor, proposed a vote of thanks. S. Raja, Vice-Principal, Vivekananda College; M. Muthupandi, Head, Department of Commerce, Sourashtra College; and A.I. Auxilia Felicitas, Associate Professor, Department of Commerce, Fatima College, were the resource persons. S. David Amirtharajan delivered the valedictory address and distributed certificates to participants.\n\nRemembering Ramanujan\n\nThe Department of Mathematics of N.M.S. Sermathai Vasan College for Women, Madurai, organised a paper presentation event for students on the occasion of S. Ramanujan’s birth anniversary on December 23. M. Valliammal, Head, Department of Mathematics, welcomed the gathering. G. Mariskumar, president, delivered the presidential address. R. Mutharasu, vice-president , offered felicitations. Ten students presented papers on “Application of Mathematics” at the event. K. Karpagam, Assistant Professor, proposed a vote of thanks.\n\nThe Women’s Cell of the college conducted a seminar on “Women Empowerment” on January 5 in which G. Boomadevi spoke about the need to empower women at various levels. Principal D. Karthiga Rani presided over the seminar.\n\nCorporate image\n\nThe Department of Commerce of Ayya Nadar Janaki Ammal College, Sivakasi, conducted a seminar for Corporate Secretaryship students on “Corporate Image” on December 31. It was inaugurated by the Principal, V. Pandiyarajan. R. Manohar, Head, Department of Commerce, welcomed the participants. The resource persons for the seminar were P. Mahendravel, Chairman, Perrys Biscuits; K. Kaliappan, General Manager, Prem Engineering; and M. Rajagopal, Proprietor, Sarojini Stores, Sivakasi. The speakers highlighted customer relationship practices and dynamic entrepreneurship.\n\nLectureship skills\n\nThe Research Centre in Tamil and Alumni Association of Standard Rajaratnam College for Women, Sivakasi, organised a workshop on “Lectureship Eligibility Skills” on December 19 as an extension activity. D. Sasireka, Principal, presided over the workshop. B. Ponni, Head, Department of Tamil, welcomed the gathering. D. Kasi of District Institute of Education and Training, Palayampatti, trained the participants in logical and reasoning skills. P. Ganesh, Assistant Professor in Computer Science, Ayya Nadar Janaki Ammal College, spoke on teaching and research. Seventy-seven students from SFR College for Women, ANJA College, Sri Kaliswari College, VVV College and VHNSN College participated in the workshop.\n\nSeventy seven students and two staff members of the Department of Commerce and Rotaract Club of the college visited Jeevakkal Old Age and Children’s Home on New Year’s Eve and distributed sweets, clothes and calendars to the inmates. On January 1, Rotaract members and teachers visited the Dhanasamy Parimala Devi Social Welfare Trust in Virudhunagar and presented clothes and sweets to the inmates.", 
    "section": "national", 
    "title": "Campus Connect", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}