{
    "author": [], 
    "text": "In the aftermath of the flood, citizens are keen on equipping themselves and making sure they have the ability to volunteer\n\nMore than a month after the floods which crippled Chennai, many residents have a new agenda on their minds: to equip themselves for a crisis and volunteer with proper skills at hand.\n\nSurvival Instincts, a city-based organisation, which is all set to orient residents on how to be crisis response volunteers, has planned two days of training sessions a week, which will include crisis assessment, transportation, rescue operations and protocol as well as relief management among other procedures.\n\nWhile the organisation has earlier offered such programmes to companies and institutions, this will be the first time they will be involving residents in the process. A trainer with the organisation said that they expected over 500 volunteers to sign up and said there has been an increased interest among city residents to learn about such procedures following the floods.\n\nWhile this is one such organisation offering such training, S. Shweta, who volunteered with rescue and relief operations during the floods, says she went through a basic course in first aid and read up on disaster management. “While many of us were ready to volunteer during the floods, we also realised that it was necessary to have some amount of knowledge and familiarity with what we were getting into as we should not put ourselves or anyone else in danger,” she said.\n\nFor more reliable information\n\nA group of students and research scholars in the city have planned to launch a campaign seeking accurate online information from the Chennai Corporation.\n\nThey say the information currently available only ends up confusing people searching for details.\n\nA few universities have started research work on civic issues in Chennai after the recent floods. The number of visitors logging on Chennai Corporation’s website has increased and many research scholars have started a search for the right kind of information online.\n\nMany of them feel that a lot of key information is missing.\n\nFor instance, the website –www.chennaicorporation. gov.in— continues to retain the names of senior officers, who have been shifted out of the local body. Researchers, who are working on civic issues, have already reported such issues to officials.\n\nIt was only recently that the Corporation took to social media after a long gap and young researchers are anxious that in the digital era, all information available should be perfect and clear, without giving any room for misleading people, many of whom depend on online sources for nearly everything.\n\n(Reporting by S. Poorvaja and Aloysius Xavier Lopez)", 
    "section": "national", 
    "title": "Chennaiites look to pick up crisis management skills", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}