{
    "author": [
        "R Sujatha"
    ], 
    "text": "It was late evening and 23-year-old James John Britto of Chennai was still getting used to the news that he was the All India topper in the Chartered Accountancy exam held in November last. He scored 74.38 per cent with 595 marks on 800. He still has four months of articleship left at Sharp and Tannan before he can take up a job.\n\nThe Chartered Accountancy examination is considered to be among the toughest academic tests in the country and the overall pass percentage is consistently low.\n\nIt required planning, strategy and some hard work to achieve this remarkable feat, says Mr. Britto. An alumnus of the Don Bosco, Egmore, he stood State third in class X and would have been ranked sixth in the State but for his choice of second language in class XII.\n\nHe was a gold medallist in Loyola College and ranked fourth in ACS (company secretaryship), but says, “I wanted to be a CA and will be applying for membership in four months,” he says.\n\nSo what was his winning strategy? He began planning in college by choosing to work on his strengths and weaknesses. “Science required me to draw diagrams, so I took the commerce stream. Then I decided to do CA. That settled I had to find my strengths and weaknesses and then choose faculty who could help me improve. Chennai has the best faculty and I had the guidance of seniors who told me about the faculty,” Mr. Britto reveals.\n\nAccording to him all students felt that the direct taxes paper was tough. “It was a yorker, but they usually want to shake you up,” he says.\n\nHis father is also a chartered accountant and has his own practice. But Mr. Britto plans to work six to 10 years in firms elsewhere as he feels he needs mentoring.\n\nNagulu Mohan Kumar of Tirupati with a score of 572 marks and Avinash Sancheti of Kolkata with 566 marks have been ranked second and third in the country. Of the 42,469 candidates , 2,440 have passed.", 
    "section": "national", 
    "title": "Chennai candidate is all-India topper in CA finals", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}