{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Priya Kishore, Sri Krishna Gana Sabha, Maharajapuram Santhanam Salai, T. Nagar, 6.30 p.m.\n\nAitareya Upanishad: Satyavratananda Saraswati, Shiridi Sai Hall, Shenoy Nagar, 5.30 p.m.\n\nSivan Arutchelvargal: P. Swaminathan, Kapaleeswarar Temple, Mylapore, 5.30 p.m.\n\nCULTURE\n\nSri Parthasarathy Swami Sabha: Inauguration of dance festival and conferment of titles to dancers, Narada Gana Sabha, T.T.K. Rd., Alwarpet, 6 p.m.\n\nBharatiya Vidya Bhavan and V-Excel: Programme ‘Bhakta Dhruva’ – ‘The Light Everythmy Ensemble’, East Mada St., Mylapore, 4 p.m.\n\nGENERAL\n\nIndian Oil Corporation: Inauguration of ‘Oil and Gas Conservation Fortnight’, Indian Oil Bhavan, Nungambakkam High Rd., 10.30 a.m.\n\nMadras Institute of Development Studies: Talk on ‘Language Caste and Territory’, 2nd Main Rd., Gandhi Nagar, Adyar,\n\nChennai Chengai Trawl Boat Owners and Workers Association and TREE Foundation: Programme on ‘Mission Sea Turtle’, Kasimedu Fishing Harbour, 6 p.m.\n\nNarcotics Anonymous: Meetings, Grace of the Millennium Group, CSI Zion Church, Chintadripet; and Reality Group, CSI Good Shepherd Church, Taramani 100 ft. Rd., Velachery, 7 p.m.\n\nAl-Anon: Meetings, Meston College of Education, Royapettah; The Lady of the Light Church, Luz, Mylapore; Madipakkam Group, Moovarasampet; Anmeega Asthivara Group, Tollgate; and CSI Church, Padikuppam Rd., Anna Nagar; Ebenezer MM School, Thirumullaivoyal, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Our Lady of Lourdes Church, Perambur, 6.30 p.m.; Meston College, Royapettah; Chennai Corporation Public Health Centre, Adambakkam; Risen Redeemers Church, United India Colony, Kodambakkam; ECI Church, Padikuppam Rd., West Anna Nagar; Annai Velankanni Church, Besant Nagar; The Lady of the Light Church, Luz Church Rd., Mylapore; St. Johns Catholic Church, Tondiarpet; Ebenezer School, Thirumullaivoyal; St. Josephs School, West Cross St., M.K.B. Nagar; C.S.I. Church, Thiruninravur; and PS HSS., Mylapore, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}