{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "During first phase of the pulse polio programme\n\nCollector N. Venkatachalam administering polio drops to a child in Theni on Sunday. (Right) Virudhunagar Collector V. Rajaraman giving polio drops to a child.\n\nMore than one lakh children in Theni and over two lakh children in Dindigul districts in the age group of 0-5 years were immunised in the first phase of the pulse polio programme held here on Sunday.\n\nThe second phase of the programme will be held on February 21.\n\nIn Theni, more than one lakh children were immunised. Collector N. Venkatachalam administered polio drops to a child at a centre in Theni.\n\nPolio drops were dispatched well in advance to all the 849 centres to start administering polio drops at 7 a.m. More than 3, 500 persons, including government employees, noon-meal staff, officials from health, education and social welfare departments, service and non-governmental organisations and members of Rotary Clubs engaged in this work.\n\nThe programme commenced simultaneously in all the government hospitals, primary health centres, sub-centres, private hospitals and government schools.\n\nSufficient staff members were deputed to monitor special centres at railway stations, bus stands, markets, religious centres and other public gathering places, he added.\n\nThe field staff will also undertake door-to-door campaigns on January 18 and 19 to children who were not covered on the first day. They will make an ink mark on the finger of the child after administering polio drops to those children, he added.\n\nLater, the Collector inspected the centres at old and new Theni bus stands, and special camps at Unjampatti, Vadapudhupatti, Ammapuram and nearby villages. Joint Director of health services M. Syed Khan Ibrahim accompanied him.\n\nDindigul\n\nMore than two lakh children were immunised in the district on the same day.\n\nCollector T.N. Hariharan administered polio drops to a child at Dindigul Government Hospital and Kamala Nehru Hospital.\n\nAdministering polio drops commenced in all the 1,313 centres in rural and urban areas simultaneously. To reach remote villages, 33 mobile teams were constituted and 48 special camps conducted.\n\nAround 5,343 field staff, including anganwadi workers, village health nurses, noon-meal workers, doctors and paramedical staff in government headquarter and taluk hospitals and primary health centres, were deployed, he added.\n\nJoint Director of Health Services M. Ravi Kala made elaborate arrangements.\n\nVirudhunagar\n\nVirudhunagar district achieved over 93.5 per cent success in the first phase of oral vaccination on Sunday. The second phase will be held on February 21.\n\nOut of the total number of 1,66,089 targeted children, the officials were able to give the drops to 1,55,290 children, according to officials of the Health Department.\n\nVirudhunagar Collector, V. Rajaraman, inaugurated the campaign at the Primary Health Centre here.\n\nA total of 1,068 centres were set up at the Government hospitals, PHCs, anganwadi centres and schools. Besides, 45 mobile teams were used to cater to children at places of public congregations like temples, bus stands, railway stations and national highway toll gate near Sattur.\n\nSpecial focus was given to children of Sri Lankan refugee camps and the temporary shelters of nomads in various parts of the district.\n\nThe Deputy Directors (Health), Palanichamy (Virudhunagar) and N. Kalusivalingam, monitored the pulse polio drive.\n\nA door-to-door campaign will be held from Monday to cover the left out children across the district for five days from Tuesday.", 
    "section": "national", 
    "title": "Children immunised", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}