{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As many as 1.47 lakh children below the age of five years were administered polio drops during the first phase of the intensive pulse polio campaign across Kanyakumari district on Sunday.\n\nNagercoil MLA A. Nanjil Murugesan inaugurated the campaign by administering polio drops to the children at the Kanyakumari Government Medical College Hospital (KGMCH) in the presence of Nagercoil Municipal Chairman Meena Dev.\n\nPolio drops were administered through the 1,256 camps established across the district. A total of 5024 officials and employees drawn from public health, noon meal, municipalities for this purpose.\n\nA total of 233 mobile vans transported polio drops to the camps. Besides this, 17 camps were also set up at the places where people congregate in large numbers such as bus stands, railway stations, boat jetty in Kanyakumari. Apart from this, eight mobile polio units were also on the move to administer polio drops in hilly and areas such as Thottamalai, and Thachamalai\n\nMoreover, eight mobile teams had covered the children living in hilly regions. Around 160 officials were appointed to oversee proper implementation.\n\nThe employees of Primary Health Centres and other staffs were given training in administering polio drops. As Sunday being Kaanum Pongal, majority of the family went for outing to tourist places, the exercise will continue for a few more days, officials from the health department said.\n\nKGMCH Dean S. Vadivel Murugan, Deputy Director of Health M. Madhusoodhanan among others participated.\n\nThoothukudi\n\nAs many as 1,172 booths were set up across the district. Collector M. Ravikumar inaugurated the programme at Kovilpatti Government Headquarters Hospital in the presence of C. Raju, Kovilpatti MLA, and officials.\n\nAs many 1,45,723 children were given the drops in the district, sources said. City Health Officer of Tuticorin Corporation, Pradeep V. Krishnakumar said a total of 23,180 children under the corporation limits were immunized till 5 p.m.\n\nAbout 1,692 children were immunized in four transit booths.\n\nIn Thoothukudi Government Medical College Hospital, 327 children were covered. Besides, six migrant children were administered polio drops in a booth near new bus stand here, Dr.Krishnakumar told The Hindu .\n\nTirunelveli\n\nIn Tirunelveli district, 96.2 per cent of the targeted children were immunised in a total of 1,641 booths, said Deputy Director of Health Services, S. Ramganesh, Tirunelveli.\n\nThe programme was inaugurated by Collector M. Karunakaran in Pediatric ward at Tirunelveli Government Medical College Hospital in the presence of Muthukaruppan, Tirunelveli Rajya Sabha MP, Nainar Nagendran, Tirunelveli MLA, Mayor E. Buvaneshwari and Dean K. Sithy Athiya Munavarah.\n\nOut of 2, 71,730 targeted children in this district, 2,61,631 children were covered.\n\nA total of 6,461 persons, including staff from the departments of health, education, integrated child development services,\n\nRotary Club members and volunteers from educational institutions were involved in the drive in the district, the Deputy Director said.", 
    "section": "national", 
    "title": "Children given polio drops", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}