{
    "author": [
        "Staff Reporter"
    ], 
    "text": "This year, the cleaning work in the Palar river would cover a distance of four kilometres within the Vellore Corporation limits.- Photo: C. Venkatachalapathy\n\nClean Palar Project, an initiative of VIT University, entered its second year on Saturday.\n\nThis year, the cleaning work in the Palar river would cover a distance of four kilometres within the Vellore Corporation limit.\n\nUnder this project, which is part of the university’s Green Vellore initiative, cleaning work in Palar was taken up for a distance of more than two kilometres last year. This involved removing weeds and “karuvelam” trees, a press release said.\n\nPlea to protect river from pollution\n\nLaunching the second year of the project, VIT University Chancellor G. Viswanathan appealed to the Corporation, panchayats and public to take up the responsibility of protecting Palar river from pollution.\n\nHe said that the government could utilise manpower under the National Rural Employment Guarantee Act scheme for strengthening the banks of Palar river.\n\nStringent action\n\nHe also said that the Public Works Department should take stringent action against those who encroach on water bodies and ensure that there are no more encroachments in Palar river area.\n\nMr. Viswanathan also urged the fan clubs of film actors who were present at the meeting to join hands in the project.\n\nVasanth Diwakar, health officer, Vellore Corporation, said the Corporation had planned to construct a compound wall for a distance of 0.75 km to separate the burial ground and Palar river.\n\nTenders being finalised\n\nHe added that the tenders were being finalised for the work. He noted that the local body phad lanned to introduce biomass gasifier in the crematorium, the release added.\n\nAmong others, G.V. Selvam, vice president of the university and Anbarasu, executive engineer of PWD were present.", 
    "section": "national", 
    "title": "Clean Palar Project enters second year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}