{
    "author": [
        "R Rajaram"
    ], 
    "text": "The Railways has given a push to installation of bio-toilets in passenger coaches as a green initiative.\n\nThe exercise of fitting bio-toilets which were carried out in production units and railway workshops have now been extended to the divisions.\n\nThe environment-friendly green toilets would be fitted in passenger coaches at the broad gauge coaching complex in Tiruchi in addition to the railway workshop at Golden Rock. Railway sources told The Hindu that 250 bio-toilets are proposed to be fitted in passenger coaches at the Golden Rock Railway Workshop in Tiruchi besides in the coaching complex in Tiruchi and Madurai divisions. The plan is to complete the exercise before the end of the current financial year, say the officials.\n\nBio-toilets are prevent open discharge of human waste on the track thus making it environment-friendly.\n\nFixing in passenger coaches has been in vogue at the Golden Rock Railway Workshop from 2014 whenever coaches arrive at the workshop for periodic overhaul.\n\nEngaged in a slew of activities, including manufacture of container wagons and steam locomotives besides carrying out periodic overhaul of passenger coaches and diesel locomotives, the Golden Rock Railway Workshop had fitted 150 bio-toilets in passenger coaches till now, say railway officials.\n\nThe bio-toilets would eliminate the need for clearing the poop that falls on the track from the conventional toilets in the coaches.\n\nThis would prevent corrosion of the rails, say the officials. Technical personnel of the Golden Rock Railway workshop will assist the Tiruchi Railway Division in the task of fitting bio-toilets in coaches at the coaching complex. The bio-toilets will be provided in those coaches where necessary provision for its installation had been made, say the officials.\n\nCoaching complexes in Madurai, Tiruchi divisions to start the process", 
    "section": "national", 
    "title": "Coaches go green, get bio-toilets", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}