{
    "author": [
        "Dennis S Jesudasan"
    ], 
    "text": "Listing of cases and getting permission from Armed Forces Tribunal to move Supreme Court remain a challenge\n\nMore than six years since the Regional Bench of the Armed Forces Tribunal (AFT) was inaugurated in Chennai, both serving and retired defence personnel, who approach the quasi-judicial forum, are facing various challenges.\n\nFrom getting their petitions numbered to getting leave to appeal from the AFT to move the Supreme Court, the situation to move the High Court for specific cases, like transfer and challenging punishment above dismissal from service, the defence personnel are bogged down by hurdles.\n\n“Getting the cases numbered itself is a Himalayan task. The staff would delay it citing trivial lapses like a spelling mistake. So only after a few months, the case would come up for hearing,” says an advocate requesting anonymity.\n\nA source, who is aware of the numbering process, too confirmed that the procedure was delayed. “Sometimes numbering of a case takes even six months. If one is lucky, he can get his case numbered in three to four months,” he alleged.\n\nConsidering that many of the litigants are retired or dismissed personnel they find it difficult to wait for such a long period to even get their cases heard.\n\nAnother challenge litigants face is obtaining the “Leave to Appeal” to move the Supreme Court to challenge an order passed by the AFT here. According to Section 31 of the Armed Forces Tribunal Act, 2007, it is mandatory that the leave to appeal be obtained from the AFT on the ground that a point of law of general public importance is involved in the decision.\n\n“Only if the Bench is convinced that the point of law of general public importance is there in the case, will they give leave to appeal. Though some of the other AFT Benches allow leave to appeal readily, the Bench in Chennai insists that an affidavit with the petition be filed as per law,” says another advocate.\n\nA section of ex-servicemen says this clause defeats their right to appeal. “How can we expect the AFT chairperson or member who dismissed our case to grant us the leave to appeal? The process of appeal must come without caveats,” said an ex-serviceman who lost a case last year.\n\nRetired Madras High Court judge feels that the leave to appeal can be obtained orally. “It will defeat the very purpose of constituting the AFT if it is made mandatory to get permission to challenge an order. The litigant should be able to move the Supreme Court even with or without the appeal,” he says. Tribunals were only constituted to ease out litigation process and not burden litigants with procedures, contends Mr. Chandru.\n\nCountering the charge, a jurist familiar with the AFT’s functioning says, “The leave to appeal is made mandatory only to check whether the appeal qualifies for its point of law in the eyes of judiciary. There is nothing wrong in that.” He points out that 98 per cent of the AFT decisions have been upheld by the Supreme Court.\n\nThe AFT has also been supporting defence personnel to appear as party-in-person and has also assisted them with financial support for fighting cases with the help of Tamil Nadu Legal Services Authority, he claims. “The only challenge the defence personnel would have while filing an appeal is that they have to go to Delhi,” he adds. The AFT in Chennai has disposed of a 936 cases since October 2009.\n\nRetired Wing Commander U.C. Jha, who authored ‘Military Justice System in India: An Analysis’, says if the AFT denies the leave, and the case is justified, the Supreme Court would not hesitate in granting such leave.", 
    "section": "national", 
    "title": "Defence personnel too face hurdles to justice", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}