{
    "author": [
        "R Srikanth"
    ], 
    "text": "Work to construct two new rail lines begins\n\nKorukkupet is among the 25 stations where platforms will be extended to accommodate 12-car rakes —Photo: B. Jothi Ramalingam\n\nor commuters travelling on the suburban train services from Chennai Central to Thiruvallur and Gummidipoondi, getting stuck near Basin Bridge railway station during the morning and evening rush hours is a daily affair.\n\nThe ‘detaining’ of suburban trains near the station is to make way for long distance trains.\n\nSouthern Railway officials said suburban train services originating from Moore Market Complex and long distance trains from Chennai Central are operated on the same lines at Basin Bridge railway station.\n\nHe said: “There are more than 140 conflicting (overlap) points between Chennai Central and Basin Bridge stations.\n\nTo tackle this, we have started work on creating two additional lines between these stations and the work is progressing on schedule.”\n\nTrains to get freeway\n\nThe construction of the fifth and sixth lines between Chennai Central and Basin Bridge is expected to be completed by March this year. The official said that once the work is completed, suburban trains would not be held up at the Basin Bridge station.\n\nThe creation of two additional lines would help in segregating suburban and long distance train services and end conflicts in timings.\n\nThe lines, each having a length of 2.22 km, are to be executed at a cost of over Rs. 30 crore.\n\nPlatform extension\n\nThe Southern Railway is also simultaneously constructing two additional platforms at MMC, which now has three. Southern Railway is also working on extending the platform length of several suburban stations on this route.\n\nTo ease congestion, they have decided to operate 12-car rakes towards Thiruvallur and Gummidipoondi from both MMC and Beach.\n\nAs part this, platforms of 25 stations are being extended and they include Basin Bridge, Villivakkam, Ambattur, Thirumullaivoyal, Pattabhiram, Royapuram, Washermanpet, Korukkupet and Kathivakkam on both the Gummidipoondi and Tiruvallur sectors.\n\nThe lines, each having a length of 2.22 km, are to cost over Rs. 30 crore", 
    "section": "national", 
    "title": "Delay at Basin Bridge: solution on the cards", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}