{
    "author": [
        "Special Correspondent"
    ], 
    "text": "here is a greater sense of satisfaction this year among members of Erode District Differently Abled People’s Welfare Association after their street corner campaigns on Sunday at 11places in the city.\n\nAll these years, the association used to hold rally, and this year, cultural programmes were planned at block-level to sensitise the public, especially parents and prospective parents about the precautions they need to take to prevent disabilities.\n\nIn view of the Pongal holidays, the initiative had to be scaled down to the street corner meetings. But, there was expected response from the public, to our awareness exercise, S. Durairaj, Association president said.\n\nCommencing from Krishna Theatre, the members on two-wheelers covered Paneer Selvam Park, Kalai Maadu Junction, Railway Station, Soorampatti Four-Roads, Collectorate, Sampath Nagar and a few other locations before culminating at the bus stand. They took along two of their members in an autorickshaw with sound system to reach out to more number of people. There are thousands of differently abled people. Since polio has been eradicated, the campaign envisaged sensitising the parents to the facts about several other disabilities as well, including autism, and mental retardation.\n\nDisabilities at birth, for instance, could be stopped if caution is exercised in consuming birth-control pills, Mr. Durairaj explained.\n\nThe anti-polio campaign has to be sustained, Mr. Durairaj said, after completing the arduous campaign spanning four to five hours at a stretch.\n\nEarlier in the day, District Collector S. Prabakar initiated the pulse polio campaign at the Maternity Hospital along Mahatma Gandhi Road in the presence of Mayor Malliga Paramasivam, and Erode West MLA K.V. Ramalingam.\n\nAs many as 13,266 children below five years are expected to be covered through 58 immunisation centres in the Corporation limits. Elsewhere in the district, 1,289 centres were operated to cover 1.97 lakh children.\n\nThe left-out children will be covered again on February 21, the Collector said.", 
    "section": "national", 
    "title": "Differently abled spearhead campaign in Erode district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}