{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The increasing number of accidents on four-lane highways, mainly due to human negligence, is a cause for concern for Transport department authorities. According to statistics available with Regional Transport Offices, four-lane highways account for over 30 per cent of deaths in road accidents.\n\nIn 2014, of the total 15,191 deaths in road accidents, 5,043 were on four-lane highways. Transport officials attribute several reasons for these accidents. Primary among them are driving without sufficient gap between vehicles, abrupt lane cutting, speeding at places where there are pedestrian as well as vehicle crossings, parking on the highway instead of parking bay and sleeping on the wheel.\n\nDuring the Road Safety Week, officials insisted that drivers should follow lane discipline on the highway. The paved shoulder on the left extreme is meant for two-wheelers and pedestrians; the left lane is for heavy vehicles and light vehicles should use the right lane. They should always use indicators while overtaking vehicles through the other lane and avoid abrupt lane cutting.\n\nVehicles should not be driven closer to the median and should maintain a gap of four feet. This would prevent accidents caused by sudden attempts by animals or pedestrians to cross the road from the median. Accidents are also caused by vehicles using the wrong lane in the opposite direction. Vehicles, which break down on the highway, should be halted at the parking bay. Help to tow the vehicle to the nearest parking bay can be obtained by dialling helpline at the nearest toll plaza.\n\nCertain basic precautions like wearing seat belts and not overshooting the speed limit should be observed on the highways. The maximum speed stipulated for a vehicle carrying nine persons is 100 km per hour; for those with over 10 passengers, goods vehicles and motorcycles it is 80 km per hour and three-wheelers should not be driven beyond a speed of 60 km per hour.", 
    "section": "national", 
    "title": "“Drive safely on four-lane highway”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}