{
    "author": [
        "M K"
    ], 
    "text": "hey halt in the middle of the road, jump signals, drive rashly with blaring horns and think nothing of going the wrong way. Government buses are guilty of all of the above and behave like bullies, completely unmindful and indifferent to the smaller vehicles and pedestrians on the road.\n\nThe reason is a combination of unskilled drivers, lack of will to enforce road rules by authorities and poor quality of Tamil Nadu State Transport Corporation (TNSTC) buses. Lives are claimed in accidents every year thanks to bad driving and many have been maimed. The only way to escape them is to give them a wide berth or get out of their way to avoid being hit.\n\nRefresher courses\n\nObviously, there are no refresher or sensitising courses offered by the TNSTC to their drivers.\n\nAccording to the city crime records bureau, government buses were involved in 401 accidents in the last five years. This included 118 fatal accidents (accidents that claimed one or more lives) and 283 non-fatal accidents (accidents in which victims were injured).\n\nDeadlines\n\nIn their defence, drivers say it is the pressure to meet deadlines that forces them to violate rules that sometimes cause accidents. They complain that trip timings have not changed for decades despite the manifold increase in traffic, numbers of signals and bus stops on the city roads. Running time from origination point to destination fixed more than one-and-a-half decades are still in practice.\n\nIn 1972, the time allotted for covering a stage (two kilometres) was fixed at five minutes. It is the same even today, more than 40 years later, for most routes. In fact on some routes the time has been reduced to three minutes Two decades ago, there were 15 bus stops for route 7 (Gandhi Park to Gandhi Park), says a driver for 28 years. And the trip had to be covered in 62 minutes.\n\n“It is the same time now, but there are 12 signals and the number of bus stops has increased from 15 to 35. But the running time has not been increased,” he said. How else can they make it on time if they do not drive fast, he asks and adds that often because of this pressure the crew has to forego the six minute break they are entitled to between trips.Mofussil drivers said that they have to work for 12 hours a day against the actual shift time of eight hours. The distance they have to cover has also been increased from 480 kms a day to 640 kms. “Our shifts were complete after a round trip to Madurai or Tiruchi. Now we cover an additional round trip to Pollachi or Tirupur ,” another driver said.\n\nDrivers are forced to work for three days at a stretch during festivals to clear the crowd. “We only get an hour or two between a long distance trips ,” he said. TNSTC officials said shifts were extended due to shortage of drivers. Recruitment is done twice a year, said the official but also added that there are drivers retiring throughout the year.\n\nDistrict Road Safety-cum-Traffic Advisory Committee member, K. Kathirmathiyon said that in 2004 then District Collector N. Muruganandam asked the Regional Transport Authorities (RTO) to increase time for covering a stage. “But it has not been done.”\n\nAccording to him, RTO, police and TNSTC can initiate action against bus drivers for non-compliance to the road safety rules, but they do not as TNSTC is a government agency.", 
    "section": "national", 
    "title": "driven to violating rules", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}