{
    "author": [
        "Deepa H"
    ], 
    "text": "Enrolling as a voter is a cool thing… that’s what the Election Commission of India (ECI) is telling youngsters of eligible age who have not enrolled. At least one per cent of youth of eligible age are not enrolled.\n\nTo capture their attention and others who have been left out of the electoral rolls, the ECI has embarked upon an online media campaign from Pongal.\n\nThe campaign across Twitter, Facebook and Google Plus, aims to bring in new voters and make existing voters check if their names are on the rolls . “Since most youngsters are on Twitter and Facebook, we thought we could reach out to them this way. Also Tamil Nadu is a leader in the IT sector. If icons retweet our tweets, it would mean more people are seeing our tweets,” said State Chief Electoral Officer Rajesh Lakhoni.\n\nOnline registration\n\nVoters can log ontowww.elections.tn.gov.inand check if their names are on the rolls, else they can register online. “The process takes 10 days. Similarly, the Elector’s Photo Identity Card (EPIC) number can be SMSed to 1950. If for some reason, their details are missing, they can be updated online. First time voters can take their photos on the website and submit a scanned image of their age proof,” Mr. Lakhoni explained.\n\nCapturing attention\n\nThe ECI has roped in a private agency to come up with memes and messages that would capture the attention of voters. OPN Advertising Pvt Ltd., director (strategy) Bala Manian, whose agency was behind the success of Chennai Super Kings ‘Whistle Podu’, said because everything that the millennial generation does is digital, the whole concept of going to the election booth doesn’t sound appealing to them.\n\n“It is this idea that we are looking to change. We are trying to deviate from traditional modes of communication and start talking in a language that appeals to them. When you become 18 you have this motivation to get driving license or a passport but not a voter ID,” she said.\n\nThe campaign will end with the phase where citizens would be asked to come out and vote, and vote ethically.\n\nThe campaign is launched across Twitter,\n\nFacebook and Google Plus", 
    "section": "national", 
    "title": "EC takes to social media to woo youth", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}