{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "More than a mere hobby:Exhibition of stamps, coins and currency notes in the city on Saturday.— Photo: S. James\n\nCoins dating back to the Sangam period, currencies from more than 200 countries, erroneously printed currency notes from India and peculiar stamps from various countries were all in display at the two-day coins, currencies and stamps exhibition at Gandhi Memorial Museum since Saturday.\n\nThe exhibition, organised by Madurai Coins Society and Tiruchirapalli Notaphily Society received a good turnout, including many foreigners, who were curious to see the currencies of their countries displayed in the exhibition. S. Pandy, secretary of Madurai Coins Society, said that the idea of the exhibition was to create an interest in history through coins and currencies. “The members of our society are well-versed with the history and have more details of pre-Independence than many history students,” he said.\n\n“Apart from guiding budding hobbyists on understanding the significance of the coins, the society also teaches them how not to get cheated. Since rare coins fetch a lot of money, replicas get sold as originals by many,” he said.\n\nCoins and currencies collected by hobbyists with varied interests were on display at the exhibition. For instance, B. Chandrasekar from Madurai had exhibited erroneously printed currency notes. “Rarely currencies get printed with mistakes like missing serial numbers, denomination or numbers printed at the wrong place. Many such mistakes often escape the eyes of a common man. But it becomes a treasure for collectors,” he said.\n\nA. Syed Ismail, an experienced coin collector from Madurai, said that though the number of youngsters taking up coin and stamp collection as a hobby had reduced over the years, serious collectors were still large in number. “However, most of the collectors these days are interested in collection of modern coins and not ancient ones,” he said.\n\nThe oversized currency notes printed before Independence, centuries old coin with symbols of Cheras, Cholas and Pandyas together received attraction from the visitors.\n\nN. Thiagarajan, a visitor from Coimbatore, said that he enjoyed the exhibition although he attended it by chance. “I didn’t know coins had these many stories to say,” he said.", 
    "section": "national", 
    "title": "Every exhibit has a story", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}