{
    "author": [
        "R Arivanantham"
    ], 
    "text": "Initiative of the Forest department to conserve Olive Ridley turtles\n\nA safe Homecoming:Turtle hatchlings from the hatcheries set up by the Forest Department being let into the sea near Kanyakumari .\n\nFirst batch of 86 turtle hatchlings of the season were released into the sea over the last two days, said A. Gopal Doss, Assistant Conservator of Forest, Kanyakumari division here on Saturday.\n\nAs turtle nests found in large numbers along the coastal areas from Leepuram to Colachel in the district was brought to the attention of the forest department by nature lovers and environmentalists, the forest department established hatcheries in Azhikkal Pozhimugam near Muttom and Dwarakapathy near Kanyakumari three years ago under the project ‘Save Olive Ridley Turtles.’\n\nThe department collects turtle eggs from the nests and maintains them in the hatcheries with watchers round-the-clock to ensure its safety and releases them safely into the sea, when the hatchlings come out of the eggs within 12 hours of hatching.\n\nThe department had appointed 12 watchers along the coast to collect turtle eggs. Theywere collected by the watchers between 2 a.m. and 8 p.m. and brought to the hatcheries.\n\nAfter the eggs hatched, the hatchlings were released into the sea without time loss as per the instructions of District Forest Officer Vismiju Viswanathan.\n\nThe turtles usually visit the coasts for nesting from December to April. The watchers had collected 338 eggs from the nests in three batches in December, 2015.\n\nOf these, the first batch of 103 eggs brought from nests started hatching since Friday and the hatchlings were being let into the sea gradually by the officials.\n\nOlive Ridley turtles nested in over 30 coastal areas, and human interference on the beaches was lesser three decades ago in the district. Population explosion, human interference on beaches, construction of groynes, increasing fishing activities, illegal use of banned purse-seine nets, explosion of trawlers with trawling nets, high degree of sea pollution, uncontrolled beach tourism and construction activities are said to be reasons for the diminishing population of Olive Ridley Turtles.\n\nDuring the first year of establishing hatcheries, the department collected 1,100 eggs and the number increased to 2,800 last year. The department hopes that it would surpass 3,000 during the current season due to the awareness created among fishermen through local community leaders.\n\nOlive Ridley Turtle is classified as vulnerable according to the International Union for Conservation of Nature (IUCN), and listed in the Appendix I of CITES, besides being included in Schedule I of Wild Life Protection Act, 1972, said Mr. Gopal Doss.\n\n“Turtles played a major role in the marine environment by cleaning up the sea by consuming dead, decayed fishes and rotten sea weeds. Their nesting sites are prone to danger from predatory animals and reptiles,” said environment educator S.S. Davidson.", 
    "section": "national", 
    "title": "First batch of 86 turtle hatchlings released into sea", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}