{
    "author": [
        "S Prasad"
    ], 
    "text": "Relief for fisherfolk:Chief Minister N. Rangasamy, hands over the keys of Modern Hygienic Fish Market to Oulgaret Municipality Commissioner M.S. Ramesh, in Puducherry on Wednesday. (Below) Modalities for allotting shops will soon be worked out in consultation with stakeholders.— Photos: S.S. Kumar & T. Singaravelou\n\nThe building was kept locked for one-and-a-half years\n\nChief Minister N. Rangasamy on Wednesday formally handed over maintenance of the Modern Hygienic Fish Market located on the East Coast Road (ECR) to the Oulgaret Municipality.\n\nThe building had remained locked for the last one-and-a-half years due to procedural delays between the Fisheries department and the Oulgaret municipality over the mechanism for allotment of stalls to vendors and the norms for selection of vendors.\n\nThe two-storey fully air-conditioned structure spread over 37,886 square feet was built by the Project Implementation Agency (PIA) with World Bank assistance of Rs.13.5 crore under the Tsunami Emergency Rehabilitation Project I. The complex was inaugurated by Chief Minister N. Rangasamy on February 19, 2014.\n\nAccording to an official in the Fisheries department, the new complex was planned to cater to the needs of fishermen from several coastal villages in Puducherry.\n\nThe complex has around 110 air-conditioned stalls including 55 stalls on the ground floor with cold storage facilities.\n\nWhile the first floor of the market would sell low-cost fish, the second floor would have costly varieties for sale. Provisions have been given for lifts.\n\nA separate area has been ear marked for processing and cutting the fish. Since the complex is big, fishermen from several coastal villages can sell their catch, the official added.\n\nThe other facilities in the complex include an effluent treatment plant, auction hall for fishes, 10-tonne capacity ice plant and an ATM. The plant would treat effluents collected from the market and has been fitted with a 10-KV solar power plant to meet the requirements of the shopping area.\n\nThe Fisheries department will finalise the list of vendors and hand it to the municipality for allotment of stalls.\n\nThe facility will be opened for public use shortly, an official said. Local Administration Minister N.G. Pannirselvam and officials from PIA were present.\n\nThe fully air-conditioned building was built by Project Implementation Agency", 
    "section": "national", 
    "title": "Fish market maintenance work given to Oulgaret Municipality", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}