{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Modernisation of fishing harbour here which remained suspended for a brief spell following the onset of the North East monsoon, has resumed.\n\nThe work is being executed at an estimate of Rs. 19.52 crore and has been the felt-need of the fishermen of Karaikal region. The World Bank-funded project is currently being executed in three phases. The major objective of the project is to ensure hygienic handling of fish by fishermen.\n\nAccording to sources, the harbour has been divided into three segments for early execution of the project. The salient features of the project are construction of slip way, setting up of power room, winch room, and boat repair yard in the first phase at an estimate of Rs.7.88 crore.\n\nA chilling plant, fish processing unit and two sumps will come up in the second phasae at an estimate of Rs.6.89 crore. The daily capacity of the chilling plant would be 30 tonnes and the fishermen would be able top handle the fishes hygienically, sources told ‘The Hindu’ on Sunday.\n\nThe third phase of the programme, which was taken up recently, pertains to construction of effluent treatment plant. Based on Sequencing Batch Reactor (SBR) technology, the work pertains to erection and commissioning of the ETP. It could handle one million litres of effluent per day and is executed on directly build, operate and transfer (DBOT) basis.\n\nThe project is expected to be completed by the middle of next year. The modernisation project, sanctioned under the Coastal Disaster Risk Reduction Project, is being implemented through the Project Implementation Agency here.\n\nThe efficiency of effluent treatment plant would be monitored during its maiden operation for a period of three months to rectify technical defects, if any. The repair and maintenance of boats would be more convenient to fishermen once the winch is pressed into service. Now, boats are moved manually to the repair yard.", 
    "section": "national", 
    "title": "Fishing harbour at Karaikal being modernised", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}