{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A team of faculty members of the college and students along with Forest Department officials carried out a census of the Greater Flamingo\n\nThe Forest Department and the A.V.C. College, Mannampandal, near Mayiladuthurai organised a Flamingo Festival - 2016 recently at Point Calimere in Nagapattinam district – one of the most attractive and ecologically important bird sanctuaries in the State.\n\nA team of faculty members of the college and post graduate students of Zoology and Wildlife Biology along with Forest Department officials carried out a census of the Greater Flamingo – a water bird, a thing of attraction inside the sprawling sanctuary.\n\nThe Point Calimere is characterised by visits of flock of birds of different species including migratory birds. The team trekked deep inside the sanctuary to carry out the bird count in connection with the Flamingo Festival. A couple of vantage spots were identified inside the sanctuary and the teams positioned themselves for the bird count.\n\nThe total count method was adopted to carry out the census of Greater Flamingos in Point Calimere, a globally recognised wetland titled under Ramsar site.\n\nThe census was done for over six hours at the site.\n\nThe team recorded nearly 2,200 Greater Flamingos during the count, said Dr. J. Pandiyan, Assistant Professor of Wildlife Biology, A.V.C. College. Greater Flamingo is classified as Least Concern as per the International Union for Conservation of Nature – 2015, he said.\n\nThe objective behind organising the flamingo festival is to create awareness of this bird species and its significance, Dr. Pandiyan said adding that the festival was being celebrated globally.\n\nHe claimed that the population of flamingo had declined in the sanctuary over the years.\n\nThis could be due to variations in densities, changing climatic conditions and availability of prey species, he added.", 
    "section": "national", 
    "title": "Flamingo festival held at Point Calimere", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}