{
    "author": [
        "S Senthalir"
    ], 
    "text": "He is considered to be the first Dalit playwright\n\nProminent Dalit folklorist and theatre personality K.A.Gunasekaran passed away on Sunday at his residence in Puducherry. He was 61.\n\nHailing from a poor Dalit family of Elayankudi, Prof. KAG is considered to be the first Dalit playwright. His play Bali Adugal (sacrificial goat) was a precursor to the arrival of Dalit theatre in Tamil Nadu.\n\nMr.Gunasekaran passed away due to prolonged illness following kidney failure. He was a teacher, folk-artist, researcher and dramatist. He served as the dean of the School of Performing Arts at Pondicherry University and also the director of International Institute of Tamil Studies.\n\nHe carved a niche for himself in the Tamil literary sphere through his plays Sathya Sothanai , Thodu , Mazhi , Maatram , Varaivu Kadavuthal , and Kanthan Valli . His concept of Dalit theatre on the lines of the theatre of the oppressed was a revolutionary, experimental and innovative effort.\n\nThe rebellious song Manusangada Naanga Manusangada , wrote by poet Inkulab and powerfully sung by Mr. Gunasekaran became the anthem of the Dalit Movement in the 1990s. He has sung many songs on the theme of caste at innumerable stages.\n\nAs a folk singer, he has done extensive research work on urban folklore and published many books and research articles. He was associated with the Progressive Writers’ Movement. Later, he moved out and started his own performance troupe ‘Thannane’ and toured across the globe spreading awareness about the problem of untouchability and the plight of Dalits in India. Mr.Gunasekaran has been honoured with Kalaimamani award by the Government of Tamil Nadu and Puducherry. He has also received the Dalit Isai Kurisil Award from The Tamil Association of Canada.\n\nHe is survived by wife and two children.\n\nMr. Gunasekaran was scheduled to participate in a discussion on ‘Dalit aesthetics and politics: How the Tamil Dalits reclaimed their identity’ at The Hindu Lit for Life 2016 on Sunday.", 
    "section": "national", 
    "title": "Folklorist Gunasekaran passes away", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}