{
    "author": [], 
    "text": "S. Gopinath, Executive Director, BHEL, Tiruchi, handing over a degree certificate to a candidate at Shrimati Indira Gandhi College; Students of Thiagarajar College, Madurai, receiving the overall winner’s trophy from A.K. Khaja Nazeemudeen, Secretary and Correspondent, Jamal Mohamed College.\n\nS. Gopinath, Executive Director, BHEL, Tiruchi, stressed the importance of hard work, positive attitude, continuous learning, openness to diverse experience and team work for improving resourcefulness. Delivering his Graduation Day address at Shrimati Indira Gandhi College, he said that youth should never give up ethics. They should be sensitive to social and environmental issues. A total of 672 post-graduates and research scholars received their degrees. Thotta P.V. Ramanujam, president of the college, S. Kunjithapatham, secretary, and S. Vidhyalakshmi, Principal, were present.\n\nTechnical\n\nsymposium\n\nThiagarajar College, Madurai, emerged overall winners of VarIT-2k16, an inter-collegiate technical symposium, organised by the Department of Information Technology, Jamal Mohamed College. Cauvery College for Women, Tiruchi, was the overall runners-up. Students from over 25 arts, science, and engineering colleges across the state participated in it. A. Vadivel, Head, Department of Computer Applications, National Institute of Technology, Tiruchi, inaugurated it. S. Mohamed Salique, Principal, Jamal Mohamed College, presided. Events such as ‘Bugster,’ ‘Cyber spidy,’ ‘Job seizer,’ ‘Mind crusher,’ ‘Xpress ur gadget,’ and ‘APK DevOps’ were held. A. K. Khaja Nazeemudeen, secretary and correspondent, Jamal Mohamed College, distributed the prizes.\n\n400 get degrees\n\nD. Rajakumar, vice-president (operations), Tessolve Semi-Conductor Private Limited, who delivered the Graduation Day address at Chettinad College of Engineering and Technology, Karur, said there was a big demand for talented engineers in the industry. Four hundred candidates, including Anna University rank holders, received their degrees. R. Murugesan, Director of Allied Health Sciences, Chettinad Academy of Research and Education, presided. C. Jegadheesan, Principal, was present.\n\n‘Everybody Counts’\n\nOver 500 persons from 16 special schools and 10 institutions serving people with disabilities participated in ‘Everybody Counts,’ organised by the Department of Rehabilitation Science, Holy Cross College, in collaboration with Christoffel Blinden Mission. Sports meet for children with special needs, exhibition of products by differently abled persons and screening for children with disabilities in need of intervention were organised as part of the event. M.S. Nagarajan, Senior Sports Manager, Special Olympics, Asia Pacific Region, N. Swaminathan, DDAW Officer, Rev. Sr. Jeusin Francis, Principal, Holy Cross College, and Rev. Sr. Lilly, secretary, were present.\n\n‘Translation vs new writing’\n\n“Writers make national literature and translators make universal literature. The translated version of Thirukkural spreads our cultural heritage and human values which suit all ages and countries. Without translation we would not have known our ancient culture,” said G. Bhaskaran, Vice-Chancellor, Tamil University, in his inaugural address at a national conference on ‘Translation vs new writing,’ organised by the Department of English, National College. K. Anbarasu, Principal, presided. Prema Nandakumar, writer and critic, explained the nuances of translation and the problems faced in translating idiomatic expressions, musical notes and clichés. C. Santhoshkumar, Associate Professor, Annamalai University, in his valedictory address, said that translation is complicated because of the complexity of language and culture. R. Sundararaman, Controller of Examination, National College, presided.\n\nStudent induction programme\n\nThe Department of Computer Science and Engineering of K. Ramakrishnan College of Engineering organised LEAD’16, a student induction programme. The programme was organised to create awareness of computers among students of Sri Mariamman Higher Secondary School. Based on the assessments, certificates and prizes were given to the students. D. Srinivasan, Principal of the college, Durai Manivannan, Headmaster of the school, spoke.\n\n‘Financial\n\nEducation’\n\nNigama Samaj and Prabandha Samiti of PG and Research Department of Commerce and Management of Srimad Andavan Arts and Science College organised an awareness programme on ‘Financial Education.’ J. Radhika, Principal, presided. K. Devaraj, Assistant Professor in Management studies, Jamal Mohamed College, spoke about investment in mutual funds, stock exchange and explained various investment options.\n\nWorkshop\n\nA workshop on ‘Design and simulation of electronic circuits using Proteus Software was organised by the Department of Embedded Systems, Nehru Memorial College. K. Mathan Kumar, Assistant Professor, Department of Embedded Systems, was the resource person. T. Jayaprakasam, Principal, presided.\n\nTraining\n\nprogramme\n\nTwenty-five faculty members from various colleges participated in a faculty development training programme on ‘Prefabricated Structures,’ organised by the Department of Civil Engineering, M.A.M. College of Engineering. Resource persons elaborated on various topics such as prefabrication, modular coordination, and industrialised construction. An industrial visit to Malar Energy and Infrastructure Pvt. Limited was also a part of the programme.\n\nCompetitions\n\nheld\n\nAVC College of Engineering, Mayiladuthurai, celebrated the birth anniversary of Swami Vivekananda. Elocution and essay writing competitions were conducted.\n\nThe students deliberated on the ideas and teachings, spiritualism and philosophy of Swami Vivekananda.\n\nCompiled by G. Prasad", 
    "section": "national", 
    "title": "Graduation Day", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}