{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Safety match manufacturing industry is in the doldrums as lack of potassium chlorate, a key raw material for production, continues to depress this traditional industry in Kovilpatti.\n\nStock of potassium chlorate in some factories ran out and was gradually getting closed, J. Devadoss, secretary, South India Match Manufacturers Association, Kovilpatti said on Sunday.\n\nSince this raw material was not available in Thoothukudi, ‘no objection certificates’ were required to procure it from other districts. This waning industry suffered a double whammy of delay in getting NOCs for procuring the raw material and also in renewing The Arms Act licence for running match factories.\n\nEven after applying for the NOC well in time last year, applicants could not get it. It was the same issue in renewing the licence too. To avail these mandatory requirements, several manufacturers applied for it during November last, but still it could not be obtained.\n\nWhen this problem was taken to authorities concerned for a solution, absence of District Revenue Officer, the competent authority to issue such ones, in Thoothukudi, was reasoned out, he told The Hindu .\n\nAfter this problem was taken to the attention of Collector M. Ravikumar this month, he promised to appoint a special officer to renew licences of match factories and also to provide NOC’s to distributors. But nothing happened as of now.\n\nNext to salt industry in this district, employment was provided considerably by the match industry to jobless people. However, neighbouring districts such as Virudhunagar and Tirunelveli had not encountered such problems and dwindling production of matches in Kovilpatti could offer opportunities for others to fill gap in the market. If such problems prolonged, this industry would undergo a significant contraction in coming days as production would come to naught in many factories.", 
    "section": "national", 
    "title": "Lack of key raw material affects match industry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}