{
    "author": [
        "Annie Philip"
    ], 
    "text": "Jean-Jacques Lemêtre presented the audience a crash course in music\n\nJean-Jacques Lemêtre, musician and composer of theatre company Théâtre du Soleil, Paris, performs at Alliance Francaise in Puducherry on Saturday.— Photo: S.S. Kumar\n\nThe musical instruments came in sizes of differing dimensions and produced sounds which varied from the reverberating boom to the tinkling chime.\n\nFor those who had trooped into the Alliance Francaise on Saturday evening, Jean-Jacques Lemêtre, musician and composer of theatre company Théâtre du Soleil, Paris, were in for an experience far different from a regular concert.\n\nThe experience was more of a crash course in sound and music. Mr. Lemêtre took the audience through the story of each instrument and the sounds they produce. The bulbul tarang (banjo), pey pok (pipe instrument), harmonica, bass drum, guitar, clarinet, nagara (drum), and even a flute instrument fashioned out of animal femur bone were some of these.\n\nThis is not his first time in Puducherry, and the musician expressed hope he could keep coming back.\n\n“I like performing here!” he said, rather simply.\n\nTo further mix things up, French Consul General Philippe Janvier-Kamiyama proved his musical mettle on the Scottish Bagpipe.\n\nThe event is part of a line-up of programmes celebrating Théâtre du Soleil founder Ariane Mnouchkine and her group’s stay in Puducherry.\n\nThe group has seen the successful completion of their mobile theatre school ‘école nomade’ here. Having travelled to countries like England, Sweden, Afghanistan and Chile, the école nomade, a mobile school of sorts, aims to take the tools of theatre to different places through workshops, in an experience of sharing and learning.\n\nAt present, more than 70 actors and technicians from the Théâtre du Soleil are busy with their workshop, ‘Résidence de création’.\n\n“The response to Théâtre du Soleil here has been tremendous. Their presence is being felt on a social level as well. They have engaged with a lot of people. This has been among the most ambitious and fulfilling of our projects. We are extremely proud of our capacity as Alliance Francaise to bring people from diverse backgrounds to work together,” said Oliver Litvine, Director of Alliance Francaise.", 
    "section": "national", 
    "title": "Listening to the story of sounds", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}