{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Turmeric farmers are relieved over what they term as favourable auction price of their produce at the newly-opened turmeric marketing complex at Karumandisellpalayam.\n\nFarmers and traders have begun to patronise the new centre, which has come up in the place of the one that used to be operated by the marketing committee at Sunnambuodai.\n\nThe cultivators are confident about the procurement price improving further if the new complex is made an integrated auction centre.\n\nAt present, trade is conducted at four places thought the first auction is carried out at Karumandisellipalayam. Of the remaining three, one auction centre is operated by traders and the other two by cooperatives department.\n\nThere is no need for the government to conduct auction at three places.\n\nThe auction at the Semmampalayam centre operated by traders must also be stopped forthwith as there is cartelisation, Deivasigamani, president of Turmeric Farmers' Association of India, said.\n\nOnce, the Karumandisellipalayam market is upgraded as an integrated auction centre, traders who have been going to the centres at Tiruchengodu, Kallakurichi and Coimbatore will also start patronising the new centre, Mr. Deivasigamani said, adding that the Association has communicated to its members throughout the country about the significance of the new turmeric marketing complex equipped with abundant stocking space, banking and other amenities on its 10-acre campus. In due course, there was scope to carry out grading of the produce, for ensuring better returns to the farmers, he said.\n\nThe complex encompassing a transaction shed, office building, bank building, and separate rest houses for traders and farmers, drying yard, weigh bridge, canteen, and huge parking space for vehicles, has godowns with capacity to store 15,500 tonnes of produce at a given point of time.", 
    "section": "national", 
    "title": "‘Make turmeric complex an auction centre’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}